[{"articleID": "2015112712_00069291_W", "date": "2015-11-27", "url": "http://www.thenorthernecho.co.uk/news/national/14108358.Ministers_accused_of_hypocrisy_as_fracking_schemes_called_in/", "content": "Ministers accused of hypocrisy as fracking schemes called in Protesters against fracking outside Preston County Hall, Lancashire 0 comments Ministers have been accused of hypocrisy after it was revealed the Government would make the decision on whether to allow two fracking schemes in Lancashire. Shale company Cuadrilla saw an application to frack and test the flow of gas from up to four exploration wells at each of two sites between Blackpool and Preston refused earlier this year by Lancashire County Council. The firm has appealed against the planning decision, made after officials for the council recommended a scheme at Roseacre Wood should be turned down on traffic impact grounds, but a site at Preston New Road, Little Plumpton should get the go-ahead. Loading article content The appeal is due to be heard by a planning inspector at a public inquiry next February, but the Government has decided Communities Secretary <mark> Greg Clark </mark> will make the decision because the proposals are \"of more than local significance\" . A Department for Communities and Local Government spokesman said: \"Ministers have decided to recover Cuadrilla's appeals for shale exploration in Lancashire.\" They consider these proposals are of more than local significance and raise important issues of planning development control. \"The Government's intention to take over decision-making from local councils on planning applications for fracking was first announced in the summer, as ministers try to get the UK shale industry off the ground. The Government has said it is going\" all out for shale \", but oil and gas companies keen to exploit the resource have come up against local opposition, with councils turning down applications in potential shale areas including Lancashire and Sussex. Mr <mark> Clark </mark>'s decision to call in the planning application is in contrast to its stance on onshore wind farms, where local people have been given the final say on developments in their areas. Promoted stories Shadow energy secretary Lisa Nandy said:\" It's hypocritical for ministers to support devolution and local democracy for decision-making over wind farms, only to then trample over the views of local communities when it comes to fracking. \"The Government has completely failed to win public support for these drilling projects, which is not surprising as they abandoned important environmental safeguards. By seeking to impose fracking, public concern is only likely to deepen.\" Greenpeace UK energy campaigner Hannah Martin said: \"With this move the Government is making a mockery of their commitment to local democracy and giving a slap in the face to the people of Lancashire.\" The same minister who told local councils they should be \"masters of their own destiny' could now overthrow one of the most important and difficult decisions Lancashire councillors have ever made. Share article\" Months of public debate, campaigning, and deliberations could be nullified by a stroke of the minister's pen. Lancashire residents have peacefully and successfully fought to stop fracking before - there are good reasons to believe they will do so again. \"Promoted Stories", "Greg clark": ["Q16194481", "Q16728072", "Q271800", "Q27914893", "Q5605416", "Q5605417", "Q5606856", "Q59165228"]}, {"articleID": "2010083107_00341920_W", "date": "2010-08-31", "url": "http://wtkr.com/news/nationworld/sns-ap-us-exotic-pets,0,6773584.story", "content": "nation world fatal bear attack highlights ohio's lax laws on exotic pets and high number of fatal attacks julie carr smyth ap statehouse correspondent columbus, ohio (ap) - the bear that recently killed a caretaker in a cleveland suburb was the latest example of animal violence in a state that has some of the nation's weakest restrictions on exotic pets and among the highest number of injuries and deaths caused by them. after a standoff between the humane society and agriculture interests, state officials are crafting restrictions on the ownership of dangerous wild pets. but the killer beast and others owned by former bear-wrestling entrepreneur sam mazzola, who was on probation at the time of the attack for illegally selling and transporting exotic animals, would have been grandfathered out of them. \"it's just a free-for-all in ohio, and sam mazzola is just an example of that,\" said wayne pacelle, president of the humane society of the united states. \"tigers, wolves, bears in a suburban lorain county community: it is a disaster waiting to happen.\" follow newschannel 3 on twitter the death in ohio and attacks elsewhere - including the maiming of a connecticut woman by her friend's pet chimpanzee and a 2-year-old florida girl squeezed to death by her family's python - highlight that the patchwork of federal, state and local laws on keeping dangerous wild animals at home has holes. mazzola had the proper state permit to keep the black bear, a species native to ohio, on his property. he also kept wolves, tigers and a lion, saomething he was free to do because ohio and at least four other states - alabama, idaho, missouri and montana - impose few or no restrictions on the ownership of non-native animals kept solely as pets, according to a review of state regulations by the associated press. the u.s. department of agriculture regulates animals exhibited to the public but not private ownership. the u.s. fish and wildlife service requires permits for native endangered and threatened species but doesn't track non-native, endangered species unless they cross state borders. the humane society cut a deal this year with ohio gov. ted strickland and leading farm groups that traded pulling an animal cruelty measure off the november ballot for certain animal protections, including a ban on exotic pets. farm groups opposed the ballot measure, which would have imposed treatment and caging requirements on livestock, as threatening to ohio's $93 billion agricultural industry. existing non-native animals, like the ones mazzola continues to keep, may be kept under ohio's proposed regulations, but owners would not be able to breed them or replace them when they die. the ban also would exempt animals in zoos, research centers and existing athletic mascot programs, strickland spokeswoman amanda wurst said. many exotic pet owners in ohio and elsewhere believe big animals - especially predators such as lions, tigers, bears and cougars - are no longer safe in the wild because of habitat loss, public fear and poaching. they view themselves as conservationists. \"of the overall amount of people who actually have snakes as pets, who actually have chimpanzees as pets, these incidents are a very small percentage,\" said cindy huntsman, whose stump hill farm near massillon houses 250 wild animals. according to a database of publicized exotic-pet escapes and attacks since 1990 kept by the animal rights group born free usa, ohio ranks fifth in the number of episodes that hurt or killed a human - 14. the leader, florida, has had 43, followed by texas with 19, new york with 18 and california with 16. alabama ties ohio with 14. the ohio bear attack occurred aug. 19 when caretaker brent kandra, 24, took the animal out of its cage for feeding at mazzola's menagerie. mazzola's federal license to exhibit the bear was revoked after animal rights activists complained about his practice of taking money to let people wrestle ceasar, another bear he owned. but he was still free to keep the animals. most people who work regularly with exotic beasts know and accept the risks, huntsman said, comparing it to being a farmer or working with killer whales at seaworld. mazzola reflected that attitude in comments to reporters the day after the fatal attack, showing off a facial scar he got from an encounter with a bear and saying he had a total of 2,000 stitches from his time working with animals. \"these are the things that happen when you deal and love these type of animals,\" he said. tom burrington, 68, a retiree who lives two doors from mazzola, recalled after the attack that one of the man's bears once rolled over a neighbor, who had to go to the hospital. \"it was a big joke,\" burrington said. \"they said the bear sat on a guy, but it was not funny to the safety forces. there wasn't anything funny about it.\" a federal judge on friday ordered mental health treatment for mazzola as new terms of his probation sentence after pleading guilty in 2009 to transporting a bear to toledo and selling a skunk without a license. mazzola's attorney didn't return a message monday seeking comment. animal rights groups have used attacks like the one that killed kandra to push for tougher regulations elsewhere. after a friend's 200-pound pet chimpanzee mauled and blinded a connecticut woman in 2009, state lawmakers voted to ban ownership of large primates and other potentially dangerous animals, such as bears, leopards and wolves. since the florida girl was suffocated by her family's burmese python last year, it has become illegal for individuals there to own them and six other large, exotic reptile species. born free usa considers it inhumane to keep large, wild animals in captivity even if they don't hurt anyone, executive vice president <mark> adam roberts </mark> said. exotic pet ownership also includes the risk of infectious disease, damage to the environment when pets are set free or escape, and a growing financial burden on animal rescue groups that run sanctuaries for animals that are abandoned, he said. the association of zoos & aquariums recommends against exotic pet ownership in part because of the lethal diseases wild animals can carry: distemper and rabies in carnivores; herpes in monkeys; and salmonella in reptiles. vaccines used on domestic animals often don't work on their wild cousins, the group notes. \"people see wild animals and they see them as cute, as something they want to have, want to hold, want to covet,\" <mark> roberts </mark> said. \"then they get bigger and more dangerous and the owner is in over their head.\" ___ associated press writers susan haigh in hartford, conn., bill kaczor in tallahassee, fla., and tom sheeran in cleveland contributed to this report. on aug. 30, 1967, the senate confirmed thurgood marshall as the first black supreme court justice garmin recalls 1.3 million nuvi gps devices because of a battery problem", "Adam roberts": ["Q350734", "Q4679680", "Q4679681", "Q4679686"]}, {"articleID": "2018050314_00136202_W", "date": "2018-05-03", "url": "https://cdn2.benzinga.com/pressreleases/18/05/r11638108/chicken-salad-chick-builds-momentum-in-tennessee-with-opening-of-knoxv", "content": "Chicken Salad Chick Builds Momentum in Tennessee with Opening of Knoxville Location May 03, 2018 10:15 am Comments Share: Chicken Salad Chick Builds Momentum in Tennessee with Opening of Knoxville Location - Fast casual concept celebrates 7th location in Tennessee with free chicken salad for a year - PR Newswire AUBURN, Ala., May 3, 2018 AUBURN, Ala., May 3, 2018 / PRNewswire /--Chicken Salad Chick, the nation's only southern inspired, fast casual chicken salad restaurant concept, announced today it will be expanding in Tennessee with its newest location in Knoxville, marking the brand's 7 th location in the state. Located at 8008 Kingston Pike, the Knoxville restaurant will celebrate its grand opening on May 16 th, where the first 100 guests will receive free chicken salad for a year. The Knoxville opening kicks off a string of Tennessee expansion, with restaurants in Memphis, Spring Hill and Maryville slated to open over the course of the year. During grand opening week, guests will experience the southern hospitality that Chicken Salad Chick is known for, with giveaways and specials that include: Wednesday, May 16--Free Chicken Salad for a year--The first guest will receive one large Quick Chick of chicken salad per week for an entire year; the next 99 guests receive a free large Quick Chick of chicken salad per month. * Thursday, May 17--The first 100 guests to purchase a Chick Trio will receive a free 20oz. RTIC Chick tumbler. Friday, May 18--Free Scoop Friday--The first 100 guests to purchase The Chick will receive a free scoop of classic carol. Saturday, May 19--The first 50 guests to buy two large Quick Chicks will receive a small chick cooler. The Knoxville restaurant is owned and operated by longtime Chicken Salad Chick fan Josh Patton of Volunteer Restaurant Concepts. The Tennessee native had his first Chicken Salad Chick experience at the original Auburn location back in 2008. A senior in college at that time, Patton was a frequent visitor, sometimes even making two trips to Chicken Salad Chick in one day. His love for chicken salad quickly turned into a desire to open his own location and in 2014, that dream became a reality when he opened his first Chicken Salad Chick in Chattanooga. Since then, he's opened additional locations in Chattanooga and Knoxville, with plans to open another three throughout those markets. \"When I first walked into the original Chicken Salad Chick restaurant 10 years ago, I knew I stumbled into something special,\" said Patton. \"Founder Stacy <mark> Brown </mark> used to joke with me about eating there so often, but I couldn't get enough of the high-quality food and southern charm. My passion for the brand led me to open my own locations and I'm grateful for the opportunity to introduce the concept to residents in Knoxville.\" The Chicken Salad Chick concept, born in Auburn, was established in 2008 in the kitchen of founder, Stacy <mark> Brown </mark>. When Stacy discovered that the local county health department would not allow her to continue making and selling her delicious recipes out of her home kitchen, she overcame that obstacle by launching her first restaurant with the business expertise of her future husband and fellow founder, <mark> Kevin Brown </mark>. Together, they opened a small takeout restaurant, which quickly grew; the company now has 88 restaurants across the Southeast. Chicken Salad Chick in Knoxville will be open Monday--Saturday from 11 a.m.--8 p.m. For more information, visit http: //www.chickensaladchick.com. Follow Chicken Salad Chick on Facebook, Twitter and Instagram for the latest news and trends. * Eligible winners must be over 16 years of age, purchase a Chick special and are required to download the Craving Credits app. Redemption will start 5/21. About Chicken Salad Chick Founded in Auburn, Alabama, in 2008, Chicken Salad Chick serves full-flavored, Southern-style chicken salad made from scratch and served from the heart. With more than a dozen original chicken salad flavors as well as fresh side salads, gourmet soups, signature sandwiches and delicious desserts, Chicken Salad Chick's robust menu is a perfect fit for any guest. Today, the brand has more than 85 restaurants in 9 states and is continuing its rapid expansion with both franchise and company locations. Chicken Salad Chick was recently named as one of's top Movers and Shakers and one of Nation's Restaurant News 2017 Next 20 brands. The brand also ranked #37 on the 2016 Inc. list of the 500 fastest-growing companies in the U.S. See www.chickensaladchick.com for additional information. FastCasual.com Contact:", "Kevin brown": ["Q21151448", "Q22681252", "Q23682329", "Q30122171", "Q3195666", "Q3814801", "Q57435330", "Q6395912", "Q6395913", "Q6395914", "Q6395915", "Q6395916", "Q6395917", "Q6395918", "Q867833"]}, {"articleID": "2020031718_00114491_W", "date": "2020-03-16", "url": "https://www.bignewsnetwork.com/news/264322729/minnesota-star-towns-to-donate-100k-to-mayo-clinic?src=rss", "content": "Virus highlights how America no longer leads world Minnesota star Towns to donate $100K to Mayo Clinic Minnesota Timberwolves big man Karl-Anthony Towns on Sunday announced he is donating $100,000 to the Mayo Clinic to help with improving and making more abundant tests for COVID-19, the strain of coronavirus that has led to a global pandemic. Towns, 24, is the latest NBA star to donate money to a cause related to coronavirus, as virtually all of the sports world is on pause for at least the next two weeks--and likely much longer. <mark> Kevin Love </mark>, Giannis Antetokounmpo, <mark> Stephen Curry </mark>, Blake Griffin and Zion Williamson are among the players donating money to help pay arena employees' wages during the stoppage in play. The Mayo Clinic in Rochester, Minn., is one of the nation's leading centers in disease research and is the largest employer and health care provider in Minnesota. \"@ MayoClinic has begun rolling out a test to detect the virus that causes COVID-19,\" Towns posted to Instagram. \"My hope is that we can fight this virus quicker and more efficiently by increasing the testing capabilities and availability and Mayo Clinic's overall COVID-19 response. This is why I will be donating $100K to support these efforts. Thank you to the Mayo Clinic workers and all healthcare workers who are working around the clock to treat us. You are our heroes.\" The NBA on Wednesday announced an indefinite postponement of play because of the coronavirus outbreak, with the NCAA and most professional leagues following suit within 24 hours. On Sunday, the Centers for Disease Control and Prevention issued a recommendation that any gatherings of 50 or more people over the next eight weeks across the country--including sporting events--should be postponed or canceled .--Field Level Media Minnesota star Towns to donate $100K to Mayo Clinic Minnesota star Towns to donate $100K to Mayo Clinic Field Level Media 16th March 2020, 13:05 GMT +11 Minnesota Timberwolves big man Karl-Anthony Towns on Sunday announced he is donating $100,000 to the Mayo Clinic to help with improving and making more abundant tests for COVID-19, the strain of coronavirus that has led to a global pandemic. Towns, 24, is the latest NBA star to donate money to a cause related to coronavirus, as virtually all of the sports world is on pause for at least the next two weeks--and likely much longer. <mark> Kevin Love </mark>, Giannis Antetokounmpo, <mark> Stephen Curry </mark>, Blake Griffin and Zion Williamson are among the players donating money to help pay arena employees' wages during the stoppage in play. The Mayo Clinic in Rochester, Minn., is one of the nation's leading centers in disease research and is the largest employer and health care provider in Minnesota. \"@ MayoClinic has begun rolling out a test to detect the virus that causes COVID-19,\" Towns posted to Instagram. \"My hope is that we can fight this virus quicker and more efficiently by increasing the testing capabilities and availability and Mayo Clinic's overall COVID-19 response. This is why I will be donating $100K to support these efforts. Thank you to the Mayo Clinic workers and all healthcare workers who are working around the clock to treat us. You are our heroes.\" The NBA on Wednesday announced an indefinite postponement of play because of the coronavirus outbreak, with the NCAA and most professional leagues following suit within 24 hours. On Sunday, the Centers for Disease Control and Prevention issued a recommendation that any gatherings of 50 or more people over the next eight weeks across the country--including sporting events--should be postponed or canceled .--Field Level Media", "Kevin love": ["Q297221", "Q6396801"], "Stephen curry": ["Q352159", "Q43981708", "Q5573861"]}, {"articleID": "2010040304_00073010_W", "date": "2010-04-03", "url": "http://star-telegram.com/2010/04/02/2086637/ut-arlington-rallies-in-eighth.html", "content": "ut-arlington scored a run in the eighth and added another in the ninth to beat nicholls state 4-3 on friday night in southland conference baseball. rett varner pitched a complete game for the mavericks (14-13, 7-4 slc), giving up five hits and one earned run. he walked none and struck out a career-high 12. michael choice had an rbi single in the eighth inning. in the ninth, chad comer led off with a double, moved to third on a single by brian nephew and scored the winning run on a single by jesse payne. men: tcu (7-7) opened mountain west conference play by winning four of six singles matches on the way to beating unlv 4-3. the horned frogs swept doubles on the way to an easy victory over air force 6-1. texas 2, oklahoma 0: the visiting longhorns (20-7, 6-2 big 12) shut out the sooners (22-5, 3-3) for the second consecutive game. texas beat ou 5-0 on thursday. cole green gave up three hits in 72/3 innings. chance ruffin finished. the visiting aggies (18-8, 5-3) evened the series by scoring three runs in the fourth inning and adding three more in the seventh. <mark> adam smith </mark> had two rbi for a & m. jamodric mcgruder went 4-for-4 for the host red raiders (14-15, 4-4). joey kenworthy and kevin whitehead each had three rbi. the wildcats fall to 20-5, 3-2. ap awards: ohio state forward evan turner and syracuse coach jim boeheim were selected the associated press player and coach of the year, respectively. turner averaged 20.3 points, 9.2 rebounds per game. boeheim took syracuse from an unranked team in the preseason to no. 1 in the poll and a no. 1 seeding in the ncaa tournament. james dickey figures the key to making the cougars relevant again can be found close to home. \"we've got to recruit houston, the greater houston area, that's going to be paramount for us,\" he said. dickey, a former texas tech coach, was hired as houston's coach on thursday. the bearkats promoted jason hooten to head coach. he succeeds bob marlin, who left to take the job at louisiana-lafayette. hooten, who spent 11 seasons as an assistant coach for tarleton state, had been part of marlin's staff since 2004. nebraska: athletic administrators have begun talks with coach connie yori to rework her contract after the cornhuskers' 32-2 season and run to the ncaa sweet 16. andre riley was selected the winner of the 2010 nancy lieberman award as the top point guard in women's college basketball.", "Adam smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"]}, {"articleID": "2012082603_00041365_W", "date": "2012-08-26", "url": "http://bloodyelbow.com/2012/8/25/3268770/mma-news-jon-jones-fight-chael-sonnen-heartbeat-august-17th-interview", "content": "<mark> jon jones </mark> continues to get heavy criticism for his refusal to fight chael sonnen on short-notice at ufc 151, and it won't be much easier for <mark> jones </mark> to cover himself in glory. last saturday on the abe kanan show, a weekly program on siriusxm, interviewed the world's #1 light-heavyweight and discussed a potential fight with sonnen down the road in 2013. kanan proceeded to \"sell\" the champion a fight with chael, listing several reasons why it could be highly profitable for him, and also saying that <mark> jones </mark> would dominate him. the lead-up to the damning quote from <mark> jones </mark> starts at about 1:32 in the video below. kanan: \"why not just take the fight, do it and make a lot of money?\" <mark> jones </mark>: \"i totally agree and i'm not sitting here saying that i wouldn't take the fight, i would take the fight in a heartbeat.\" ouch. well <mark> jones </mark> had his chance and said no. that's another notable slip-up revealed in the last few days, with the other major one being his statement on twitter that <mark> greg jackson </mark> responds to dana white's criticism, suggests <mark> jon jones </mark> vs chael sonnen for ufc 152 ufc 151 cancelled after <mark> jon jones </mark> turns down chael sonnen fight, cm punk wastes no time commenting but i really think <mark> greg jackson </mark> needs to be really discussed here more. he either has a heavy influence on what <mark> jones </mark> does (go get some fans) to the point where <mark> jones </mark> does whatever <mark> greg </mark> tells him to or this is all <mark> jones </mark>' doing. <mark> jones </mark> is so awesome in the cage and so amazingly bad outside of it, whats wrong with this guy? but can anyone say they wouldn't? being 23 and on top of the world, must be hard to stay good. i'll admit i'd get myself in trouble if back in the day when i was 23 if i was champ ladies all over me people buying me free drinks, and wordhipping the ground i walk on. no i don't buy that you an adult at 23, he has been champ for over a year. over and over he says things and then blatantly contradict them, its absurd. he is a massive hypocrite and in real life i find being a hypocrite is one of the worse things you can be. for example how can i ever be friends with someone when i have no idea who they truly are, that's why hypocrites are so bad. i can't even form a real idea of who you are. looking out for yourself first does not include inviting the ridicule of all fans, fighters and employers by rejecting a fight that would be quite simple for you. that's the point with this guy, he does and says things that are clearly horrible for him, but he's under the impression they are favorable. \"they could be saying rolo, it may be a candy craving crowd tonight...\"\"i'm not going to stop yelling because that would mean, i lost the fight!\" - kenny powers put yourselves in ufc's position regarding <mark> jon jones </mark> for a second zombie prophet is back with the latest your day in mma. he's got tons of ufc 151 stuff, ken...had trouble keeping up with what the hell happened yesterday? zombie prophet has compiled a video...community blog posts and discussion. recommended fanposts put yourselves in ufc's position regarding <mark> jon jones </mark> for a second mma video: bellator champ eduardo dantas ko'd by tyson nam at shooto brazil video: <mark> jon jones </mark> says he would take chael sonnen fight \"in a heartbeat' in august 17th interview <mark> jon jones </mark> apologizes, accepts full responsibility for ufc 151 cancellation we've developed a unique newsletter that delivers the top mma stories of the week, that you don't want to miss, delivered directly to your email inbox. the mma main event newsletter is curated by an sb nation mma editor who follows sports the way you do: as a fan.", "Jon jones": ["Q285450", "Q3183202"], "Greg jackson": ["Q25190426", "Q5605759", "Q5605761", "Q5605764", "Q925856"]}, {"articleID": "2019040207_00104462_W", "date": "2019-04-02", "url": "https://www.publicnewsservice.org/2019-04-02/energy-policy/opponents-colstrip-bill-allows-mt-utility-to-skirt-regulation/a66026-1", "content": "Get more headlines like this via email Opponents: Colstrip Bill Allows MT Utility to Skirt Regulation Senate Bill 331 would allow NorthWestern Energy to pass on $75 million to Montana ratepayers if it buys more energy from Colstrip. (Tonyglen14/Flickr) April 2, 2019 HELENA, Mont.--A controversial bill that would allow NorthWestern Energy to sidestep regulations to buy more power from the Colstrip coal plant continues to make its way through the Montana Legislature. Senate Bill 331, now in the house, is touted as a good deal to meet Montanans' energy needs and a way to save jobs at Colstrip. It would allow the state's largest monopoly utility to pass on $75 million to ratepayers over the next decade if it chooses to buy more energy from the coal plant. Travis Kavulla, a former Public Service Commissioner, said NorthWestern isn't obligated to keep the plant open if it buys more energy, meaning the bill doesn't necessarily secure jobs. He also noted the utility already is able to buy an additional share of the power plant. \"Which, I think, necessarily implies that the only reason for this piece of legislation is because NorthWestern wants special protection or favorable regulatory treatment for a business decision that we should expect it to make all on its own as a business,\" Kavulla said. Kavulla believes NorthWestern is outsourcing a business decision to the Montana Legislature. He also said sticking with coal without evaluating the cost of other energy options such as renewables could cost customers even more. <mark> Jason Brown </mark>, attorney with the Montana Consumer Council, noted the bill also exempts NorthWestern from decommissioning and remediation costs for the share of Colstrip it owns and any additional shares it might buy. The Montana Department of Environmental Quality estimates cleanup costs at the power plant could be as much as $700 million dollars. He said there's no guarantee this would be a good deal for Montanans if regulators step aside. \"A good deal can turn into a bad deal if there's a lack of oversight and planning,\" <mark> Brown </mark> said. \"So I think that's kind of the crux of our concern.\" Kavulla said he also worries about the implications of subsidizing a utility company. \"It's generally not been the policy of the United States and certainly not the policy of a red state like Montana to subsidize uneconomic competition,\" Kavulla said. \"And I worry that that is, in essence, what this S.B. 331 could set up.\" Utilities across the country have been stepping away from coal-based power as the cost of clean-energy sources such as wind and solar have decreased. Eric Tegethoff, Public News Service - MT", "Jason brown": ["Q1630161", "Q18631123", "Q48817195", "Q55312656", "Q556169", "Q6162123", "Q6162127", "Q6897856"]}, {"articleID": "2019020815_00565485_W", "date": "2019-02-08", "url": "http://security.itbusinessnet.com/2019/02/correcting-and-replacing-caption-scientists-at-childrens-hospital-los-angeles-investigate-how-blood-flow-in-the-brain-is-affected-by-autism/", "content": "With autism diagnoses on the rise, science is on the hunt for answers. LOS ANGELES--(BUSINESS WIRE)--Please replace the caption for release dated February 7, 2019 with the accompanying corrected caption. The release reads: SCIENTISTS AT CHILDREN'S HOSPITAL LOS ANGELES INVESTIGATE HOW BLOOD FLOW IN THE BRAIN IS AFFECTED BY AUTISM With autism diagnoses on the rise, science is on the hunt for answers. Each year, one in 59 children are diagnosed with Autism Spectrum Disorder (ASD), a condition that impacts a child's social, emotional, and behavioral development. The rate of diagnosis has grown, tripling in the last 15 years. While genetic and environmental influences have been implicated as potential causes of ASD, little is known about its neurobiology. Now, researchers at Children's Hospital Los Angeles have brought us one step closer. In a study published recently in the journal Biological Psychiatry, CHLA's Bradley Peterson, MD, uncovers a direct link between altered brain activity and social deficits in ASD. Peterson's group studied 44 individuals with ASD and compared them with 66 typically-developing participants. Groups were matched for age, sex, and IQ. Peterson's team used advanced imaging techniques to acquire two types of information. First, the group used a method called arterial spin labeling, which measures blood flow through the vessels of the brain. Because active parts of the brain need the most oxygen and nutrients, more blood flow to an area signals increased brain activity. Second, the team measured levels of NAA, an amino acid byproduct commonly used as a marker of healthy neurons. \"This is a multimodal imaging data set,\" explains Peterson, Director of the Institute for the Developing Mind at CHLA and Professor of Pediatrics at the Keck School of Medicine of USC. \"Each modality gives us a different window into the brain. We are able to look through both windows at once to tell us much more about what's going on in the brains of these individuals.\" Scans revealed a striking pattern in the part of the brain called the white matter. Our brains have about 100 billion cells, which communicate with each other through long, wire-like branches called axons. These axons are coated with myelin, a specialized wrapping--like wire insulation--that helps the messages flow faster from one cell to another. Because myelin appears white, communication pathways between cells are collectively called white matter. Cell bodies, or gray matter, are not coated as extensively in myelin and therefore do not appear white. Studies show that communication between distant brain cells is disrupted in ASD due to fewer long-range connections between cells and thinner myelin. Given these differences in white matter, decreased blood flow and activity in this region would make sense. Yet, Peterson and his team found exactly the opposite. In the study, the researchers found what is called hyperperfusion--increased blood flow, indicating more brain activity--throughout large portions of white matter in participants with ASD. Perhaps even more striking, these activity rates were correlated with ADOS scores; ADOS is a tool used by doctors to help diagnose ASD. If white matter is compromised in ASD, one might expect decreased activity in this region, not increased. Peterson explains that this finding likely reveals an attempt to compensate for underlying white matter problems. \"If the drive train in your car is compromised, you have to hit the gas harder to achieve the same speed,\" he explains. Similarly, supporting cells in the brain that create and maintain the myelin wrapping seem to be working overtime to counteract deficits in the underlying axon. This compensatory mechanism may partially explain why many individuals with ASD are high functioning. \"This correlation of perfusion and ADOS is absolutely key,\" emphasizes Peterson, \"because it shows that the higher the blood flow, the more ASD symptoms the participants have. This very solidly supports the idea of compensation.\" Looking in the second window--measuring NAA concentrations as a marker for healthy neurons--revealed support for this idea of compensation. \"We found that in participants with autism, the lower the NAA concentrations were, the higher their perfusion was at those points in the brain,\" Peterson says. In other words, areas with the lowest levels of healthy neurons were also the ones with the highest activity and blood flow. The majority of autism research has focused on other parts of neurons, as opposed to axons. Peterson's study marks the first to correlate widespread white matter hyperperfusion, healthy neuron biomarkers, and symptom scores. The study paves the way for understanding more about how the brain may compensate for compromised white matter signaling. \"Axons and their supporting cells have not been a major focus in autism research,\" Peterson says. \"My hope is that this study will help to refocus attention on the cell types and brain areas that are critical in understanding the neurological basis for ASD.\" Additional authors on the study include Ariana Zargarian, Jarod B. Peterson, Suzanne Goh, Siddhant Sawardekar, Steven C. R. Williams, David J. Lythgoe, Fernando O. Zelaya, and Ravi Bansal. This study was supported by National Institute of Mental Health grant R01 MH089582 and funding from Children's Hospital Los Angeles and the University of Southern California. About Children's Hospital Los Angeles Children's Hospital Los Angeles has been ranked the top children's hospital in California and sixth in the nation for clinical excellence by the prestigious U.S. News & World Report Honor Roll. The Saban Research Institute at CHLA is one of the largest and most productive pediatric research facilities in the United States. CHLA also is one of America's premier teaching hospitals through its affiliation since 1932 with the Keck School of Medicine of the University of Southern California. For more, visit CHLA.org, the child health blog and the research blog. Contacts <mark> Melinda Smith </mark> (323) 361-7236 msmith @ chla.usc.edu Continue Reading Previous AM Best Downgrades Issuer Credit Rating of EquiTrust Life Insurance Company Next 25% Dividend Paid to the Hotel Workers' Compensation Safety Group #578 Managed by Friedlander Group, Inc. .", "Melinda smith": ["Q19364602", "Q44641357"]}, {"articleID": "2014081217_00040397_W", "date": "2014-08-12", "url": "http://www.marketplace.org/topics/business/high-price-alleged-police-misconduct", "content": "The FBI is investigating possible civil rights violations after a police officer in suburban St. Louis fatally shot an unarmed teenager on Saturday. The death of <mark> Michael Brown </mark>, 18, stirred a night of unrest in the town of Ferguson, Missouri, where the incident happened. Many of the costs these kinds of cases of alleged police misconduct can have on a community are impossible to quantify - in terms of loss of life, and loss of confidence in civic institutions. \"The greatest cost is loss of faith in the police department, which then cause crime to spiral out of control,\" says Dick Simpson, a professor of political science at the University of Illinois at Chicago. But there are also some very specific costs to a community, with dollar amounts attached. For example, a string of notorious police brutality cases in the 1970s, '80s and '90s, connected to one police lieutenant, <mark> John Burge </mark>, cost the city of Chicago more than $100 million, says Simpson. The money went to court fees, lawyer fees, and multi-million dollar payouts to some victims. As Tim Lynch, director of the Cato institute's Project on Criminal Justice, points out, all that money has to come from some place. \"The tax payers of these various cities pay the costs,\" he says. The money usually comes through a city's general fund, says Professor Simpson. Meaning, if a city has to spend a lot on a big police misconduct case, \"it diminishes the ability to provide services to citizens, and it raises their property taxes.\" ", "Michael brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "John burge": ["Q57468255", "Q6223885"]}, {"articleID": "2018121911_00187131_W", "date": "2018-12-19", "url": "http://fieldnotes.msnbc.msn.com/en-xl/northamerica/northamerica-life-arts/5-body-language-signs-a-breakup-is-looming-according-to-experts/ar-BBR7mJv?li=BBJGCka", "content": "Portals Navigation Outlook.com Skype Microsoft Store Facebook Twitter Office OneDrive Receive your emails here See your recent emails Send a quick email Manage your calendar with easy access Sign in with any Microsoft account: Outlook, Hotmail, MSN, Live What is a Microsoft account? SIGN IN Create Now Sign In Microsoft Store OFFICE 365 - Buy & Download directly from Microsoft UPGRADE TO WINDOWS 10 - Big savings on a huge selection of products Surface Windows Support Facebook Check News Feed See notifications View messages Confirm friend requests Get your Twitter Updates Sign In See your recent documents, or start one for free with Office Online. Sign in Sign in to your Microsoft account to see recent OneDrive contents. Sign in Curtea De Arges / -2 ° C Change Close Set Default Location Search Display Temperature In Fahrenheit Celsius Done AFRICA ASIA AUSTRALASIA EUROPE LATIN AMERICA MIDDLE EAST NORTH AMERICA powered by Microsoft News Latest Stories Top stories Romania stocks fall amid tax push Bloomberg Pogba danced on Jose's grave? Mirror Brad celebrates birthday with kids US Weekly News IMF approves $3.9 billion loan program for Ukraine Reuters Belgium PM Michel resigns Evening Standard Romanian singer dies after car plunges into river Mirror Stars are nothing like us 2018 edition Wonderwall Bloating and gas may actually be an under-diagnosed gut condition Prevention More News Lithuania to buy floating liquefied gas terminal Associated Press \"Thousands' of EU diplomatic cables hacked AFP Czech govt office stops using Huawei phones Associated Press Celeb Buzz Cardi B stirs chaos on Corden show Mirror Holmes' birthday outing with Foxx ETOnline Ed Sheeran tops earnings record BANG Showbiz 10 science stories in 2018 that made us go,\" Whoa, that's awesome \"Vox.com Sport UEFA investigates\" racist incidents' Goal.com Manchester City win on penalties The Guardian Man Utd's gaffe leaks interim boss Evening Standard Croatia's shipbuilders struggle to stay afloat AFP Take a break Can you ace this tricky spelling quiz? Daily Mail News in pictures Reuters Video: Paraglider crashes into lounge chairs BuzzVideos MOST READ IN EUROPE Romania govt faces vote Euronews Sandra wanted to be a young mom ETOnline Communism is alive in Romania dw.com MOST READ ON MSN Mourinho sacked by Man Utd Sky Sports WTA amends rules affecting players Associated Press Girl's brain tumor vanishes FOX News Royal watch Meghan \"feeling very pregnant' during visit Sky News Meghan in crisis talks about dad after he drags Queen Mirror Celebrity babies we can't wait to meet in 2019 INSIDER Exercise could be\" as good as drugs at cutting high blood pressure' The Telegraph Priceless treasures that were found hiding in plain sight Lovemoney Facial recognition will raise difficult questions for us all soon The Independent Popular theme parks around the world in 2018 INSIDER 30 foods you should eat more once you turn 30 Eat This, Not That! 20 tips for actually keeping your resolutions Espresso Previous Slide Next Slide Leopard kills, decapitates 3-year-old AFP Author spots \"Loch Ness monster with 4ft-neck' Mirror Model accused of fat shaming for exercising at burger place Glamour Here's how many minutes you need to walk daily to lose weight PopSugar Revealed: Mourinho's insane sacking payout Goal.com Iran's unusual weapon against Trump Tehran Times Hamilton on\" slums' remark: I chose the wrong words Mirror Six baby fur seals found decapitated in New Zealand Newshub Blind amphibian named after <mark> Donald Trump </mark> The Guardian Michelle topples Walliams to secure Christmas No 1 book The Guardian How a Coke can cracked a 28-year-old murder case The Washington Post Victoria's fashion brand loses $13M in a year Mirror Around the world Edit Remove Section Move Section Up Move Section Down Add Section Below Mob lynches driver, burns bus in Lagos The Punch Nikki Haley's parting shot at UN FOX News Trump agrees to shut down his embattled charity The Boston Globe Cuba to scrap same-sex marriage law Associated Press Around the world Two migrant teens slain in Tijuana Iranian missiles: Hypocrisy and paradox Win for Yemeni mom to see dying son Nigeria's former army chief killed Trump softens stance on border Kenya officers not to vacate houses UNP: Sirisena won't get key ministries Pakistani activist awarded top UN prize FB removes more Myanmar accounts Reuters Life Edit Remove Section Move Section Up Move Section Down Add Section Below Corden's horror as Cardi B crashes car during Carpool Karaoke Mirror Holmes' birthday outing with Foxx ETOnline Ed Sheeran's $433M world tour BANG Showbiz Meghan's neat handwriting explained International Business Times Life When Roberts felt she was famous Jazzy talks about Banks' exit Davidson refused to see Grande Signs a breakup is looming 4 questions before changing career Gaga & Carino's low-key romance Is Jennifer Aniston dating again? Sandra saw \"fear' in Bird Box crew Australian actor accused of sex abuse HuffPost Sport Edit Remove Section Move Section Up Move Section Down Add Section Below Revealed: Mourinho's insane sacking payout Goal.com Pogba accused of dancing on Mourinho grave Mirror Nets hold off Lakers to extend winning streak to 6 games Associated Press Marcelo reacts to Mourinho's exit AFP Sport Salah on dad's role in his stardom Gor Mahia to miss Ernest Wendo Klopp glad to avoid Juve, Dortmund Agent opens on Ronaldo's move Spurs extend Vertonghen contract Conor's trial ends in just 10 seconds De Bruyne opens up on injury woes LeBron still bad at free throws line Rabiot set for PSG exit after talks fail Read Sport Features Edit Remove Section Move Section Up Move Section Down Add Section Below Is a female lead now key to box office success? BBC News Sports pictures of the week Photos The United Kingdom's tortuous journey in and out of the EU Reuters A child occupies the White House - and the world knows it The Washington Post Year in Review Edit Remove Section Move Section Up Move Section Down Add Section Below Celeb romances and weddings of 2018 Photos Biggest box office booms of 2018 Photos Celebrity babies of 2018 Photos The biggest news stories of 2018 Photos QUIZ: How well do you remember the year so far? Photos 2018's best animal photos Photos People we lost in 2018 Photos Best travel images of 2018 Photos Catherine, Duchess of Cambridge: Best looks of 2018 Photos The best pictures of the year Photos Unusual wedding photos of 2018 Photos Best space and celestial photos of 2018 Photos The best entertainment and showbiz pictures of 2018 Photos 75 of the best photos of royalty from around the world Photos Melania Trump: Best looks of 2018 Photos Stunning drone photos of 2018 Photos Video Edit Remove Section Move Section Up Move Section Down Add Section Below 1947 best-picture Oscar auctioned Buzz60 Cockatoo is thrilled when owner arrives home Rumble Speeding truck loses cargo BuzzVideos Runaway horse gallops head-on into a BMW Newsflare Huge fire breaks out after tanker explodes in Brazil Dailymotion How many times a day do you really need to shower? Buzz60 Snuggling parrot has hard time getting out of bed Rumble Forget the reindeer: Man converts car into sleigh Buzz60 New haircut displays crazy 3D illusion Rumble Brazilian wave surfer in scary wipeout Newsflare Man's out of this world proposal Buzz60 This ant moves faster than any animal on Earth National Geographic Baby hitches ride on automatic vacuum cleaner BuzzVideos Marine brother surprises sister during wedding ceremony Rumble Diver rescues ray trapped in fishing net BuzzVideos Japan's Sakurajima volcano blows off twice Storyful Click here for more", "Donald trump": ["Q22686", "Q27947481"]}]