[{"articleID": "2009070821_00021981_W", "names": {"Bob Evans": ["Q171886", "Q19879682", "Q4932384", "Q4932387"], "David Williams": ["Q1177200", "Q1177203", "Q1177205", "Q1177206", "Q1177211", "Q15993658", "Q18285462", "Q18921621", "Q19668225", "Q19979283", "Q21067351", "Q21191045", "Q27909752", "Q27909753", "Q28935607", "Q29643799", "Q3018997", "Q3703373", "Q39070773", "Q471380", "Q5241129", "Q5241130", "Q5241132", "Q5241135", "Q5241140", "Q5241142", "Q5241145", "Q5241146", "Q5241148", "Q5241151", "Q5241153", "Q5241155", "Q5241156", "Q5241379", "Q53147193", "Q55090089", "Q56596997", "Q56604607", "Q56650695", "Q56650757", "Q56660359", "Q56928356", "Q57161824", "Q57430588", "Q58186825"]}, "date": "2009-07-08", "url": "http://us.rd.yahoo.com/sports/rss//SIG=12caiomb0/*http%3A//sports.yahoo.com/rah/news?slug=ap-racingsfuture&prov=ap&type=lgns", "content": "derby's future secure despite racing's woes louisville, ky. (ap) - the kentucky derby will continue to thrive at churchill downs on the first saturday in may. it's the rest of the year that's a problem for racing venues in the self-proclaimed \"horse capital of the world .\" coming off a derby featuring an upset for the ages by mine that bird and the highest tv ratings in 17 years, churchill downs inc. president and ceo <mark>bob evans</mark> said wednesday the shine is still on the first jewel of the triple crown. however, <mark>evans</mark> and other industry leaders continue to be worried about the future of racing in kentucky if the state doesn't find a way to approve expanded gaming. \"the playing field is no longer level,\" <mark>evans</mark> said. \"we're not even close to it .\" a dozen states, including indiana, west virginia and pennsylvania, already have expanded gaming at their tracks. the games give those states another revenue stream to fatten purses and lure horsemen away from non-gaming states like kentucky. the derby, however, appears to be safe, even if one state lawmaker said recently there's a chance another race could replace the run for the roses as the first stop in the triple crown. house speaker greg stumbo speculated last month that a track at a state with the ability to supplement purses with gaming revenue could offer a more lucrative alternative for the owners and trainers of the sport's top 3-year-old horses. the derby offered a $2 million purse this spring. stumbo said if another track could find a way to offer purses in excess of $5 million with money from expanded gaming, the kentucky derby could be in trouble. \"you can't rule anything out,\" <mark>evans</mark> said. \"maybe somebody wants to comes along with something else to do the first saturday in may. bring it on, we'll take it on, but i'm not worried about it .\" <mark>evans</mark> remains hopeful state lawmakers will find a way to pass legislation to legalize expanded gaming, but it's unlikely a measure would gain any footing in the near future. the house approved a bill during a special session of the general assembly last month, but the bill never made it to the floor of the senate. senate president <mark>david williams</mark> said after the session the bill has no chance of getting approved next year. while <mark>evans</mark> doesn't see alternative gaming as a cure-all, he does believe it's the most practical way to put the kentucky horse industry-which generates $4 billion in economic impact and employs nearly 100,000 people-on a level playing field with states that already have expanded gaming. \"slots aren't going to save racing, but they are going to determine who in racing survives,\" <mark>evans</mark> said. \"(<mark>williams</mark>) and his supporters have put kentucky racing on the do not resuscitate list .\" ellis park owner ron geary has already sliced the number of racing dates for this summer's meet in half, and said he'll likely close the historic western kentucky track for good if an alternative gaming bill isn't passed. the math is remarkably simple, according to <mark>evans</mark> and geary. expanded gaming leads to bigger purses, which mean bigger fields and more wagering. owners and trainers will go where the money is. right now, the money is moving out of kentucky, and the state's problems are symptomatic of most racing states that do not have expanded gaming. \"these are desperate times,\" thoroughbred owners and breeders association representative andrew schweigardt said. the bleak financial outlook put a damper on one of the most successful spring meets in recent memory at churchill downs. in addition to the underdog story of 50-1 longshot mine that bird, the track generated some much-needed buzz during the final weeks of the meet by hosting three night racing events. nearly 90,000 people-most of them young, many of them visiting for the first time-turned \"downs after dark\" into a roaring success. the format will likely return next year, though an official announcement won't come until the fall. the overwhelming success of the event showed the track could handle night racing."}, {"articleID": "2019040503_00001877_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-04-05", "url": "http://www.gamereactor.eu/games/48324/Overwatch/?sid=9f30b7a76cde7bae9b27cf366d39c0fe", "content": "OVERWATCH REVIEW. Written by Rasmus Lund-Hansen on the 26th of May 2016 at 16 \"Overwatch is, without a doubt, the best multiplayer-shooter I've ever had my hands on .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 3rd of April 2019 at 09 NotE is heading to Dallas Fuel, while rCk is going to Uprising, with both teams looking to improve their middling record so far this year. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 28th of March 2019 at 09 The Stage 1 winners will welcome opponents to the Rogers Arena, as revealed by team owner Francesco Aquilini on Twitter. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 27th of March 2019 at 08 The event will run between May 15 and 16 this year, between Stages 2 and 3 of the season, pitting Atlantic against Pacific. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 26th of March 2019 at 08 They defeated the San Francisco Shock in the final to earn a bonus of $200,000 USD and become the first champions of this season."}, {"articleID": "2019071116_00100910_W", "names": {"James Burke": ["Q16206040", "Q16229909", "Q6130497", "Q6130509", "Q6130510", "Q778787"]}, "date": "2019-07-11", "url": "https://www.freemalaysiatoday.com/category/leisure/2019/07/12/harvey-weinstein-gets-approval-for-new-lawyers-in-rape-case/", "content": "Harvey Weinstein leaves the State Supreme Court on April 26, 2019 in New York, after a break in a pre-trial hearing over sexual assault charges. (AFP pic) NEW YORK: Former Hollywood producer Harvey Weinstein got approval from a New York judge to hire a new legal team two months before his scheduled rape trial. The two new lawyers, Donna Rotunno and Damon Cheronis, appeared at a brief hearing in Manhattan Supreme Court before Justice <mark>James Burke</mark> to make their formal applications to take over Weinstein's defence before the Sept 9 trial date. \"Mr. Weinstein, is that what you want?\" <mark>Burke</mark> asked. \"Yes,\" Weinstein answered. Weinstein, 67, is charged in New York with sexually assaulting two women, in July 2006 and March 2013. He has pleaded not guilty to the five charges against him, which include rape, and faces a maximum sentence of life in prison if convicted. Weinstein hired the new lawyers, both based in Chicago, last month. Rotunno and Cheronis are Weinstein's third legal team in the case. Prominent Florida defence lawyer Jose Baez and Harvard University law professor Ronald Sullivan both recently left, with Baez making his departure official at Thursday's hearing. They, in turn, had replaced New York defence lawyer Ben Brafman, who quit the case in January. The two accusers in the criminal case are among some 70 women, mostly young actresses and women in the film industry, who have accused Weinstein of sexual assaults dating back decades. He has denied the allegations. The accusations helped spark the #MeToo movement in which hundreds of women have publicly accused powerful men in business, politics, the news media and entertainment of sexual harassment and abuse. As the accusations against Weinstein mounted, his company Weinstein Co fired him and filed for bankruptcy, and he was expelled from the Academy of Motion Picture Arts and Sciences. The Wall Street Journal reported that Rotunno, a former Chicago prosecutor who specialises in the defence of men accused of sex crimes, said in an interview that she rejected the #MeToo movement. Subscribe to our newsletter and get news delivered to your mailbox."}, {"articleID": "2016080922_00873887_W", "names": {"Scott Bailey": ["Q1464826", "Q6379124", "Q7435932"]}, "date": "2016-08-09", "url": "http://au.news.yahoo.com/thewest/sport/a/-/rugby-union/32285383/caslick-hits-back-at-soft-medal-claims/", "content": "<mark>Scott Bailey</mark> - AAP on August 10, 2016, 6:35 am Share Tweet Whatsapp Email Share Caslick hits back at soft medal claims - The West Australian Pinterest Tumblr Australia's rugby sevens star Charlotte Caslick has suggested coaching guru Ric Charlesworth tried playing the sport after labelling the Olympic women's competition a \"soft event\". Charlesworth, a hockey great who has worked with a number of sports, claimed the standard of competition wasn't strong in the wake of Australia's 24-17 win over New Zealand in the gold medal match. But Caslick said the call was unfair. \"I guess he's never played sevens,\" she told Sky Sports Radio's Big Sports Breakfast. \"I don't think you can judge it before you can try it .\" I used to do track running when I was younger and rugby sevens is like running a 400m but on steroids. \"It's the hardest sport I've tried, if you tried running a 400 and getting tackles and getting back off the ground, it's tough .\" Charlesworth played for Australia in hockey at four Olympic Games, before coaching the women's Hockeyroos to victory in Atlanta and Sydney. He is also an ambassador for the Australian Womensport and Recreation Association, but on Tuesday claimed the men's form of Rugby Sevens carried more weight. \"I'm delighted we won in rugby sevens but that's a soft event at the moment,\" he told ABC. \"I don't think they had a try scored against them well into the competition, so some events are much easier than others .\" Share Tweet Whatsapp Email Share Caslick hits back at soft medal claims - The West Australian Pinterest Tumblr"}, {"articleID": "2012102909_00027847_W", "names": {"Lance Armstrong": ["Q2172", "Q6483312"]}, "date": "2012-10-29", "url": "http://wthr.com/story/19939361/nyc-braces-for-megastorm-evacuations-ordered", "content": "meta itemprop = \"datepublished\" content = \"2012-10-29 09:10:20\" > coast guard monitors tall ship in distress off nc coast guard monitors tall ship in distress off nc the coast guard is monitoring a tall ship that's in distress off north carolina's outer banks as hurricane sandy swirls toward the east coast. the coast guard is monitoring a tall ship that's in distress off north carolina's outer banks as hurricane sandy swirls toward the east coast. meta itemprop = \"datepublished\" content = \"2012-10-29 08:20:38\" > east coast grinds to a halt as superstorm nears east coast grinds to a halt as superstorm nears hurricane sandy bore down on the eastern seaboard's largest cities monday, forcing the shutdown of mass transit, schools and financial markets, sending coastal residents fleeing for higher ground, and threatening...hurricane sandy bore down on the eastern seaboard's largest cities monday, forcing the shutdown of mass transit, schools and financial markets, sending coastal residents fleeing for higher ground, and threatening a.. . meta itemprop = \"datepublished\" content = \"2012-10-29 09:00:20\" > nyc braces for wall of water from superstorm nyc braces for wall of water from superstorm after days of seeming to take a looming superstorm in stride, new yorkers scrambled to gather supplies and get out of the way as forecasters warned that a wall of water could hit the nation's largest city. after days of seeming to take a looming superstorm in stride, new yorkers gathered supplies or tried to get out of the way as forecasters warned that a wall of water could hit the nation's largest city. meta itemprop = \"datepublished\" content = \"2012-10-29 07:51:06\" > eastern us braces for dangerous superstorm eastern us braces for dangerous superstorm from washington to boston, big cities and small towns were buttoned up monday against the onslaught of a superstorm that threatened 50 million people in the most heavily populated corridor in the nation, with...from washington to boston, big cities and small towns were buttoned up monday against the onslaught of a superstorm that threatened 50 million people in the most heavily populated corridor in the nation, with forecasters...meta itemprop = \"datepublished\" content = \"2012-10-29 08:41:01\" > minn. gay activists pitch to tough crowd: seniors minn. gay activists pitch to tough crowd: seniors supporters of gay marriage who are fighting a proposed ban on minnesota's ballot are trying to win over a particularly skeptical audience: senior citizens. the word \"homosexual\" was rarely uttered in public when louise pardee was growing up, but now the 81-year-old is dialing up fellow minnesota senior citizens trying to convince them gay relationships are nothing to fear. meta itemprop = \"datepublished\" content = \"2012-10-29 09:02:29\" > high court hears closely watched copyright case high court hears closely watched copyright case costco, ebay, google and the nation's top art museums are backing a thai graduate student against book publishers, the movie and music industries and other manufacturers in a supreme court battle over copyright...costco, ebay, google and the nation's top art museums are backing a thai graduate student against book publishers, the movie and music industries and other manufacturers in a supreme court battle over copyright...meta itemprop = \"datepublished\" content = \"2012-10-29 09:00:26\" > at a glance: how to handle a flight cancellation at a glance: how to handle a flight cancellation hurricane sandy is expected to make landfall monday night or early tuesday, likely in new jersey. it will tie up with other weather systems and form a so-called superstorm. airlines have preemptively canceled...hurricane sandy is expected to make landfall monday night or early tuesday, likely in new jersey. it will tie up with other weather systems and form a so-called superstorm. airlines have preemptively canceled thousands of...meta itemprop = \"datepublished\" content = \"2012-10-29 09:00:25\" > before the storm: how people are bracing for sandy before the storm: how people are bracing for sandy by the associated press along the east coast, residents are preparing for hurricane sandy to hit and merge with two other weather systems to create a fearsome storm. here are their stories. by the associated press along the east coast, residents are preparing for hurricane sandy to hit and merge with two other weather systems to create a fearsome storm. here are their stories. meta itemprop = \"datepublished\" content = \"2012-10-28 14:25:23\" > nyc schools, transit closing ahead of storm nyc schools, transit closing ahead of storm new york gov. andrew cuomo has ordered new york city's transit service to suspend bus, subway, and commuter rail service in advance of the massive storm expected to hit the eastern third of the united states. new york city shut down its mass transit system, closed its schools and ordered hundreds of thousands of people to flee their homes sunday in the face of increasingly dire predictions about the wall of water that could hit...meta itemprop = \"datepublished\" content = \"2012-10-28 09:25:12\" > hi tsunami smaller than feared; ports reopened hi tsunami smaller than feared; ports reopened a senior geologist tracking a tsunami expected to hit hawaii says the first waves hitting shore are smaller than expected. windows 8 to bridge gap between pc, mobile devices microsoft launches windows 8 in bid to bridge gap between personal computers, mobile devices hurricane sandy makes landfall in bahamas, will soon threaten us east coast hurricane sandy may head for east coast hurricane sandy makes landfall in bahamas, will soon threaten us east coast oregon scientists make embryos with 2 women, 1 man provocative research could lead to babies with dna from 3 people, avoiding rare disease risk hurricane sandy moving across caribbean hurricane sandy makes landfall just west of santiago de cuba in southern cuba soundtrack to history: 1878 edison audio unveiled newly unveiled 1878 audio on edison invention features world's first recorded music, blooper google cameras map popular grand canyon trails google captures 360-degree view of popular hiking trails at grand canyon national park apple debuts ipad mini; a bigger screen and higher price tag than rival tablets analysis: calm romney pins hopes on momentum analysis: as obama tries to fire up dems, cool romney pins his hopes on momentum; ohio is key column: <mark>lance armstrong</mark>'s downfall now complete associated press new york (ap) - after days of seeming to take a looming superstorm in stride, new yorkers gathered supplies or tried to get out of the way as forecasters warned that a wall of water could hit the nation's largest city. facing a seawater surge of anywhere from 6 to 11 feet from hurricane sandy, the city shut down its mass transit system, closed its schools and ordered hundreds of thousands of people to flee their homes sunday. some new yorkers packed grocery stores for water and food and scrambled to get out of flood zones, while others insisted they weren't going anywhere. clutching a white pillow in her left hand and two computers in another, alyssa marks rushed to get to the subway before it stopped running sunday evening. she'd gotten cash but had no time to get toiletries and water. \"i'm nervous, but i'm also excited,\" she said as she left her apartment in a lower manhattan evacuation zone for a friend's place on higher ground. ralph gorham watched the sea get rough, but he planned to weather the storm at the red hook lobster pound, the seafood business he co-owns in a low-lying part of brooklyn. \"i'm not leaving. my house is here. my business is here,\" he said. \"when the bell tolls, you live with it .\" warnings about the superstorm - a predicted combination of sandy, a wintry system moving in from the west and cold air streaming down from the arctic - took on a much more ominous tone sunday. the national oceanic and atmospheric administration's environmental protection chief, louis uccellini, called the projected storm surge \"the worst-case scenario\" for new york city, long island and northern new jersey. it threatened to swamp parts of lower manhattan, flood subway tunnels and knock out the underground network of power, phone and high-speed internet lines that are the lifeblood of america's financial capital. the new york stock exchange and other u.s. financial markets are shutting down monday as hurricane sandy bears down on the nation's largest city. the nyse's parent company said late sunday that the shutdown might be extended through tuesday \"pending confirmation,\" according to exchange operator nyse euronext. \"if you don't evacuate, you're not just putting your own life in danger - you are also endangering the lives of our first responders who may have to come in and rescue you,\" mayor michael bloomberg said at a news conference sunday as he announced a mandatory evacuation affecting 375,000 people in low-lying areas from the beaches of queens to the glassy high-rises of battery park city. \"this is a serious and dangerous storm .\" gov. andrew cuomo deployed national guard troops to the city and long island. consolidated edison weighed the possibility of shutting down power in parts of lower manhattan to protect equipment. broadway shows were canceled for sunday and monday. one small hospital was being evacuated, while several others were moving patients to higher floors. america's biggest public school system, which serves 1.1 million students, was ordered closed monday, while many of the schools opened sunday as emergency shelters. it marked the second time in 14 months that new york city has faced a scenario forecasters have long feared: a big hurricane hitting the city or a bit south, such that the cyclone's counterclockwise winds drive water into miles of densely populated shoreline. hurricane irene ultimately came ashore as a tropical storm in coney island, with a 4-foot storm surge that washed over parts of the southern tip of manhattan but didn't wreak the havoc that officials had feared, although it caused tremendous damage elsewhere. some experts have said that a surge 3 feet higher could have caused huge damage. bloomberg announced evacuations around 11:30 a.m., telling people to be out just 7? hours later. by 7 p.m., subways and buses were shut down, leaving more than 5 million mostly carless daily riders on their own to get to higher ground. for those who refused to leave, they mayor had a message. \"they won't be arrested. but i would argue they are being very selfish,\" bloomberg said, noting rescue crews will still try to help them if they are flooded. \"we aren't going to leave them to die. we are going to save them .\" ___ associated press writers verena dobnik and deepti hajela in new york and seth borenstein in kensington, md., contributed to this report. links to the fcc website to view wthr and/or walv's on-line public inspection files: publicfile @ wthr.com, or 317.655.5680, for assistance with access to the public inspection files."}, {"articleID": "2020031418_00007229_W", "names": {"Thomas Doherty": ["Q27909349", "Q58148998"]}, "date": "2020-03-14", "url": "https://www.cowichanvalleycitizen.com/news/home-near-campbell-river-destroyed-by-fire/", "content": "Campbell River and Oyster River fire departments responded to a house fire at around 7 p.m. on March 13. Crews were called to an incident on the ERT logging road near Willis Road. The house, located around 7 km up the logging road, was fully involved when crews arrived on scene. Two propane tanks and an adjacent house were in danger from the fire. The residents of the home had called 911 and escaped the building with no injuries. Three engines, a ladder truck and two water tenders were on scene. The area is without hydrants, so Campbell River Fire called Oyster River to bring an additional water tender. They were able to make use of a nearby river to help with the water supply. Around 19 members of the Campbell River crew were on scene for a few hours, and two members of Oyster River were on scene as well. Crews were focused on minimizing damage to the adjacent house, as well as making sure two large propane tanks nearby were safe. \"We focused on cooling those tanks, so we didn; t have any additional risk of those tanks blowing off,\" said Campbell River fire chief <mark>Thomas Doherty</mark>. \"There was a little bit of heat damage ot he other house, the windows were cracked. But we were able to save that home form the fire .\" <mark>Doherty</mark> said that the fire started in the chimney area, and that the residents had been using a woodburning stove at the time of the fire. \"We want to get that message out there about making sure people have working smoke alarms in their homes,\" <mark>Doherty</mark> added. fire Get local stories you won't find anywhere else right to your inbox. Sign up here"}, {"articleID": "2013070116_00089934_W", "names": {"Martin Schulz": ["Q17905", "Q1904987", "Q26884486", "Q42372365"], "Stephen Brown": ["Q48487071", "Q57009868", "Q57392252", "Q7608785", "Q7608788", "Q7608789", "Q7608791", "Q7608792", "Q7608793", "Q7608794", "Q7609276"]}, "date": "2013-07-01", "url": "http://my.news.yahoo.com/germanys-greens-snowden-safe-haven-europe-093225438.html", "content": "BERLIN (Reuters) - The leader of Germany's opposition Greens suggested on Monday that Europe provide a safe haven for former U.S. spy agency contractor Edward Snowden, whose revelations about the extent of U.S. surveillance programmes have infuriated America's allies. Juergen Trittin, parliamentary leader and candidate for chancellor of the Greens, Germany's third biggest party, told German television it was an outrage that the 30-year-old former National Security Agency (NSA) contractor should be seeking asylum in \"despotic\" countries. \"It's painful for democrats that someone who has served democracy and, in our view, uncovered a massive violation of basic rights, should have to seek refuge with despots who have problems with basic rights themselves,\" said Trittin. \"Someone like that should be protected,\" he said. \"That counts for Mr Snowden. He should get safe haven here in Europe because he has done us a service by revealing a massive attack on European citizens and companies. Germany, as part of Europe, could do that .\" Trittin did not specify which \"despots\" he was referring to. Snowden flew from the United States to Hong Kong and is now in an international airport in Russia seeking asylum in Ecuador - the country that has been sheltering WikiLeaks founder Julian Assange in its London embassy since last year. European concern over U.S. spying tactics flared anew at the weekend after German magazine Der Spiegel reported that the NSA had tapped communications at EU offices in Washington, Brussels and at the United Nations. According to the report, the NSA taps half a billion phone calls, emails and text messages in Germany in a typical month, much more than any other European peer. Britain's Guardian newspaper said the United States had also targeted non-European allies. The revelations have enraged America's foreign partners and sparked a debate over the balance between the protection of privacy and national security. The Germans are particularly sensitive about this, having experienced the Stasi secret police in communist East Germany and the Gestapo under the Nazis. \"This used to happen in the Eastern bloc but you were aware of it. You knew everything was bugged so you didn't talk to each other. You just went for a walk in the forest,\" <mark>Martin Schulz</mark>, the German president of the European Parliament, told German radio. \"It is no way to treat your closest partners .\" Chancellor Angela Merkel has not commented on the latest report. She said during a visit by U.S. President Barack Obama earlier this month that some questions about the U.S. programme, code-named Prism, still needed to be cleared up. Obama tried to reassure Germany that the programme was well within the law and that the emails of ordinary citizens were not being monitored. Trittin said that in reponse to the latest revelations, the EU should suspend exchanging banking and flight data with the United States. He said plans to create an EU-U.S. free trade zone should only be pursued if rules were upheld \"such as respecting commercial secrets rather scouting them out via espionage\". (Reporting by <mark>Stephen Brown</mark> and Annika Breidthardt; Editing by Noah Barkin)"}, {"articleID": "2014092317_00031582_W", "names": {"Brandon Marshall": ["Q3643713", "Q898156"]}, "date": "2014-09-23", "url": "http://www.sportstalkflorida.com/lamarr-houston-kaepernick-said-the-n-word/", "content": "Chicago Bears defensive end Lamarr Houston told the Chicago Tribune that San Francisco 49ers quarterback Colin Kaepernick used the N-word to confront him during their Week 2 game. Kaepernick has denied saying anything \"racially derogatory, but he did say he said something after he threw an interception against the Bears. Replay backed this up. But Houston told the Tribune on Monday that Kaepernick was\" Last week Kaepernick was fined $11,025 and during the game he was called for an unsportsmanlike conduct penalty. However, Houston says he didn't take offense saying it's just a \"cultural thing .\" The Heisman winning quarterback that had a perfect season with the Seminoles last year, isn't so perfect anymore. He may have a perfect record with...Chicago Bears defensive end Lamarr Houston told the Chicago Tribune that San Francisco 49ers quarterback Colin Kaepernick used the Some angry Fantasy Football fans mixed up Chicago Bears wide receiver <mark>Brandon Marshall</mark> with Denver Broncos linebacker <mark>Brandon Marshall</mark>. According to reports, Tampa Bay Buccaneers offensive coordinator Jeff Tedford is taking a leave of absence from the team until his heart condition improves Bucs' Lovie Smith: Offensive Supporting Cast Needs to Step Up Too (VIDEO)"}, {"articleID": "2012111622_00034085_W", "names": {"Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"], "Christopher Stevens": ["Q21464245", "Q21464732", "Q294536", "Q5113277", "Q56199338"], "Susan Rice": ["Q23848423", "Q50612"], "Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2012-11-16", "url": "http://my.news.yahoo.com/benghazi-testimony-petraeus-says-al-qaeda-role-known-214449144.html", "content": "washington (reuters) - former cia director david petraeus told congress on friday that he and the spy agency had sought to make clear from the outset that september's deadly attack on the u.s. diplomatic mission in benghazi, libya, involved an al qaeda affiliate, lawmakers said. petraeus told lawmakers \"there were extremists in the group\" that launched the attack on the diplomatic mission, describing them as affiliates of al qaeda and other groups, said representative c.a. dutch ruppersberger, the top democrat on the house of representatives intelligence committee. \"the fact is that he clarified it,\" ruppersberger said. petraeus appeared behind closed doors before the house and senate intelligence panels the week after quitting his cia post because of an extramarital affair. he made no public remarks. another lawmaker, republican representative <mark>peter king</mark>, said petraeus' account in the closed-door session differed from the assessment the cia chief gave to congress two months ago, just days after the september 11 attack that killed u.s. ambassador <mark>christopher stevens</mark> and three other americans. \"he also stated that he thought all along he made it clear that there were significant terrorist involvement, and that is not my recollection of what he told us on september 14,\" <mark>king</mark> said. petraeus last week admitted to an affair with his biographer, paula broadwell. lawmakers said a somber petraeus told them his resignation had nothing to do with issues related to benghazi or any reluctance to testify before congress. \"the general did not address any specifics of the affair, of that issue,\" democratic representative jim langevin said. \"what he did say in his opening statement was that he regrets the circumstances that led to his resignation .\" the assault on the u.s. mission and nearby cia annex in benghazi has turned into a flash point between president barack obama, a democrat, and republicans. republicans accuse the white house and in particular the u.s. ambassador to the united nations, <mark>susan rice</mark>, of misleading the public just after the attack by suggesting the assault was a spontaneous act instead of a planned terrorist operation. the obama administration denies misleading anyone and says it discussed information about the benghazi tragedy as it came in. some republicans have suggested the administration initially wanted to avoid the idea that it had failed to prevent a terrorist attack, which might have dampened the president's re-election chances on november 6. obama has denied that implication. petraeus, a retired army four-star general, slipped in and out of the closed sessions unseen by a swarm of media. capitol police cleared journalists and others from hallways where the former cia director might have been spotted. \"blame it on us'\" you can blame it on us, \"senator dianne feinstein, democratic chairwoman of the senate intelligence committee, told reporters who complained about not even seeing petraeus .\" the general was both eager and willing to give us his views on this, and his experience on it, and that's very much appreciated ....we didn't want to make it any more difficult for him. \"although he has left the cia, petraeus was asked to testify about benghazi in part because he had gone to libya before his resignation to interview people about what happened in benghazi on september 11. lawmakers appeared to treat the question of petraeus' personal life with kid gloves. they said the questioning was sometimes awkward against the backdrop of the broadwell scandal and because some of them have known petraeus for years and think highly of his military service in which he ran the wars in afghanistan and iraq .\" i consider him a friend, which made the questioning tough, to be honest with you, \"<mark>king</mark> told reporters .\" i've known him for nine years now. i actually asked him to run for president a few years ago, \"he said. petraeus' affair has raised questions about whether any classified information was divulged to broadwell that would affect national security. so far, fbi investigators have not discovered anything to suggest that was the case, law enforcement sources said. democratic lawmakers emerging from the sessions with petraeus said it was clear <mark>rice</mark> had been speaking from talking points that were approved by the u.s. intelligence community when she discussed the benghazi attack. in five sunday talk show appearances on september 16, <mark>rice</mark> said the assault was prompted by an anti-muslim video and then morphed into a more violent act. but she also told cbs's\" face the nation \"that day that it was\" clear that there were extremist elements that joined in and escalated the violence. \"\"i don't think she should be pilloried for this,\" said feinstein, who was carrying a copy of the talking points that were probably given to <mark>rice</mark> and read them aloud to journalists. \"she did what i would have done, or anyone else would have done, that is going on a weekend show. you would have said,\" what talking points can i use?' \"feinstein said .\" it's almost as if the intent is to assassinate the character. \"senator saxby chambliss, the intelligence committee's top republican, told reporters the problem with <mark>rice</mark>'s talk show appearances was that she did not stick with the talking points she was given on the benghazi attack .\" she knew at that point in time that al qaeda was very likely responsible in part or in whole for the death of ambassador <mark>stevens</mark>, \"he said. some senior republicans have vowed to block <mark>rice</mark>'s potential nomination for secretary of state or another top cabinet post because of her benghazi comments. <mark>rice</mark> is believed to be on obama's short list to replace hillary clinton, who has said she intends to leave her state department job. seremban, 13 nov (bernama)--seorang lelaki maut apabila motosikal yangditungganginya terbabas sebelum badannya digilis sebuah lori dalam satu kejadiandi jalan besar taman bukit galena, di sini malam tadi.dalam kejadian kira-kira pukul 8 malam itu, mangsa, lee kuan yew, 48, mautdi tempat kejadian akibat kecederaan parah di bahagian kepala dan badan.jurucakap polis berkata ketika kejadian mangsa yang menunggang motosikaljenis yamaha dalam perjalanan dari taman bukit gelena menuju ke rumahnya ditaman? back by popular demand: 63% off 5 pieces sk-ii whitening source derm revival mask for all skin types with free nationwide delivery @ best buy world for only rm99 instead of rm270! (limited quantity) check out the latest in entertainment <mark>jon stewart</mark> tells bill o'reilly to stop worrying about loss of\" traditional america \"(c) copyright thomson reuters 2012. check for restrictions at:"}, {"articleID": "2019111719_00056476_W", "names": {"Max Verstappen": ["Q2239218", "Q2744186"], "Lewis Hamilton": ["Q6536656", "Q9673"], "Carlos Sainz": ["Q211204", "Q544856"]}, "date": "2019-11-17", "url": "http://www.expressandstar.com/sport/uk-sports/2019/11/17/max-verstappen-victorious-in-brazil-amid-late-drama-involving-ferrari-pair/", "content": "<mark>Max Verstappen</mark> victorious in Brazil amid late drama involving Ferrari pair Less than an hour ago World champion <mark>Lewis Hamilton</mark> finished in third, but his podium is subject to a post-race investigation. Subscribe to our daily newsletter Sign UpBrazil F1 GP Auto Racing <mark>Max Verstappen</mark> won the Brazilian Grand Prix as Ferrari's Sebastian Vettel and Charles Leclerc crashed out following a dramatic late finish. Toro Rosso driver Pierre Gasly finished a surprise second after he took advantage of <mark>Lewis Hamilton</mark> banging into Alex Albon on the penultimate lap. <mark>Hamilton</mark>, with damage to his car, took the flag in third, but his podium is subject to a post-race investigation. <mark>Verstappen</mark>, out to seek revenge at Interlagos 12 months after he was punted out of the lead by backmarker Esteban Ocon, looked to have been denied another victory here after Robert Kubica almost collided with his Red Bull during the first round of pit stops. <mark>Verstappen</mark> slammed on the brakes to avoid hitting the Williams and ending up in the wall, allowing <mark>Hamilton</mark> to get the jump on the Red Bull. But in a spellbinding 75 seconds, <mark>Verstappen</mark> fought his way past Ferrari's Leclerc and then latched on to the back of <mark>Hamilton</mark>'s Mercedes before diving underneath the world champion at the opening bend. <mark>Verstappen</mark>'s skills were tested for a second time when the safety car was deployed after Valtteri Bottas' Mercedes engine conked out. Red Bull opted to pull <mark>Verstappen</mark> in from the lead to give their driver fresh rubber for the remaining 15 laps. <mark>Hamilton</mark>, running in second, was told by his Mercedes team to stay out if <mark>Verstappen</mark> stopped. Advertising But the Englishman, on old tyres, was a sitting duck for the speedy <mark>Verstappen</mark>, who used <mark>Hamilton</mark>'s tow before sailing around the outside of the Mercedes at the first corner after the safety car pulled in. The Ferrari drivers then sensationally collided as they diced for fourth place. Leclerc had just passed Vettel at the Senna Esses, but on the run down to the left-handed fourth corner, the German appeared to cut across his team-mate. Both sustained terminal damage, before pointing the finger at one another in a series of furious radio outbursts. That led to a third safety car period. <mark>Hamilton</mark> took on fresh tyres, dropping him to fourth. He immediately drove past Gasly at the restart but then collided with Albon in the battle for second, denying the London-born Thai his first podium. He would finish out of the points in 14th. \"I massively apologise to Albon,\" <mark>Hamilton</mark> said. \"The gap was there but it closed at the end. It was definitely my fault. Advertising\" I raced my heart out and left nothing on the table. I took a lot of risks today. \"McLaren's <mark>Carlos Sainz</mark> finished fourth, but could be promoted if <mark>Hamilton</mark> is penalised. A quarter of a century after he perished at the San Marino Grand Prix, Ayrton Senna's memory lives on. The Brazilian's name was chanted from the packed-out grandstands as his nephew, Bruno, a one-time Williams driver, drove his uncle's world championship winning McLaren from 1988 in the hour before Sunday's race. In the absence of a Brazilian driver, and his idolising of Senna, <mark>Hamilton</mark> has become something of a home favourite in these parts. As he arrived on the grid, the Briton's name rang out around the stands of Interlagos. With his sixth world championship already in the bag, it might have provided the 34-year-old with the necessary motivation to chase a fourth victory at the home of his childhood hero. <mark>Hamilton</mark>, starting from third on the grid, wasted no time in fighting his way past Vettel. The Mercedes driver roared away from his marks, drawing alongside the German's Ferrari on the downhill roll to the Senna Esses. <mark>Hamilton</mark> stamped later on his brakes, and, elbows out, got the job done by dancing his way around the outside of Vettel's Prancing Horse. <mark>Hamilton</mark>'s early move ensured a shootout between the two stars of the sport. While Vettel might be a four-time world champion, and Leclerc emerging as a driver for the future, <mark>Hamilton</mark> and <mark>Verstappen</mark> are in a different tier. <mark>Verstappen</mark> has not been particularly generous in <mark>Hamilton</mark>'s march to a sixth title--his argument being that it has been more machine than man. There are those in the paddock, too, who believe that <mark>Verstappen</mark> would beat <mark>Hamilton</mark> if he was in a Mercedes. If Bernie Ecclestone, here in Brazil for only his third race of the year, was still running the sport, he might have pulled the strings to make it happen. On this occasion, however, <mark>Verstappen</mark> had the speed in his Red Bull to more than match <mark>Hamilton</mark>. As <mark>Verstappen</mark> celebrated his second win of the campaign, another inquiry will be under way at Ferrari following a major collision involving its two drivers, the four-time world champion and the emerging star. Vettel suffered a left-rear puncture, while the force of the impact broke Leclerc's front suspension. Their incident promoted the Alfa Romeo duo of Kimi Raikkonen and Antonio Giovinazzi to fifth and sixth ahead of Renault's Daniel Ricciardo with British teenager Lando Norris eighth."}]