[{"articleID": "2018030512_00267260_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Emma Stone": ["Q147077", "Q58064847"], "Christopher Nolan": ["Q224912", "Q25191"], "Daniela Vega": ["Q21858404", "Q28816282"], "Michelle Williams": ["Q156796", "Q229153", "Q23893381"]}, "date": "2018-03-05", "url": "http://www.nwaonline.com/news/2018/mar/05/90th-oscars-dance-between-honoring-and-correcting-/", "content": "90th Oscars dance between honoring and correcting the past By LINDSEY BAHR, AP Film Writer Posted: March 5, 2018 at 6:29 a.m. Chris Pizzello/Invision/AP <mark>Jimmy Kimmel</mark> speaks at the Oscars on Sunday, March 4, 2018, at the Dolby Theatre in Los Angeles. LOS ANGELES--Held one year ago, the 90th Academy Awards would have very likely been a rose-colored nostalgia fest. But this year, with a culture-wide reckoning over decades of sexual misconduct, a film business in decline, a volatile political climate and the fact that last year the esteemed show couldn't even manage to present its biggest award correctly, the film academy and host <mark>Jimmy Kimmel</mark> on Sunday staged a complex and sometimes incongruous dance of attempting to both honor and atone for the past. In many ways, the show inside the Dolby Theatre went exactly as planned--scripted, tight, full of past-looking montages, forward-thinking speeches and produced to appeal to all. Presenters Faye Dunaway and Warren Beatty got a best picture redo, (\"What happened last year is Waterhouse under the bridge,\" <mark>Kimmel</mark> quipped) and 86-year-old Rita Moreno got to wear her dress from the 1962 ceremony again. The Walt Disney Co. sneaked a fair amount of promos (\"A Wrinkle in Time,\" and \"Mary Poppins Returns\" ) and self-congratulations (for \"Black Panther\" ) into its ABC broadcast and the production did its best to appeal to the \"regular moviegoer\" by trotting out Gal Gadot and other stars to literally give candy to a theater full of people. The awards also effectively skirted the awkwardness of having an accused man in the spotlight by shifting around long-held presenter traditions and having Jodie Foster and Jennifer Lawrence present the best actress award instead of Casey Affleck. <mark>Emma Stone</mark> got her Natalie Portman moment, presenting the directing award to \"four men and Greta Gerwig .\" Activists like #MeToo creator Tarana Burke were included in a song segment. And three Harvey Weinstein accusers, Ashley Judd, Salma Hayek and Annabella Sciorra, were given a moment to themselves on stage for nothing more than the fact that they were brave enough to speak up before a hopeful video played highlighting a changing industry, post #MeToo and more diverse. [CLICK HERE for a full list of Oscar winners] The video highlighted Greta Gerwig, the fifth woman to ever be nominated for best director, Yance Ford, the first transgender nominee for \"Strong Island,\" Dee Rees, whose \"Mudbound\" scored a historic cinematographer nomination and the Pakistan-born Kumail Nanjiani, nominated for \"The Big Sick .\" The nominees signaled a renaissance. The winners told a slightly different story. With a more diverse, more international and younger infusion of voting members into the film academy, the movie in love with movies still won the top awards. Guillermo del Toro's fantasy romance \"The Shape of Water,\" won best picture, director, score and production design. \"Growing up in Mexico, I thought this could never happen,\" del Toro said. \"It happens .\" The acting awards, which have been locked for three months, went to the expected winners--all esteemed veterans and three of whom had never been nominated before: Frances McDormand won best actress for \"Three Billboards Outside Ebbing, Missouri\" and her co-star Sam Rockwell won for his supporting performance. Gary Oldman picked up the best actor prize for transforming into Winston Churchill in \"Darkest Hour\" and Allison Janney for becoming Tonya Harding's mother in \"I, Tonya .\" At 89, James Ivory became the oldest Oscar-winner for his adapted screenplay for \"Call Me By Your Name .\" And <mark>Christopher Nolan</mark>'s ambitious World War II nail-biter \"Dunkirk\" picked up three technical awards. But Gerwig's \"Lady Bird\" left empty handed, Rachel Morrison did not become the first female cinematography winner (the long-snubbed Roger Deakins got that honor finally for \"Blade Runner 2049\" after 14 nominations) and Ford was not the first transgender Oscar-winner. There were glimpses of progress, in Chile's \"A Fantastic Woman,\" which starred the transgender actress <mark>Daniela Vega</mark>, won best foreign film. Disney and Pixar's celebration of Mexican culture, \"Coco,\" took best animated feature, as well as best song for \"Remember Me .\" \"The biggest thank you of all to the people of Mexico,\" said director Lee Unkrich to loud applause. \"Marginalized people deserve to feel like they belong. Representation matters .\" And Jordan Peele became the first African-American to win best original screenplay for his horror sensation \"Get Out .\" Peele said he stopped writing it \"20 times,\" skeptical that it would ever get made. \"But I kept coming back to it because I knew if someone would let me make this movie, that people would hear it and people would see it,\" said Peele. \"So I want to dedicate this to all the people who raised my voice and let me make this movie .\" Even McDormand used her moment on stage to make a statement on behalf of women. \"If I may be so honored to have all the female nominees stand with me,\" McDormand said. \"We all have stories to tell and projects we need financed,\" she added, before uttering the phrase \"inclusion rider,\" referring to actors signing contracts that mandate a film's gender and racial inclusivity. Everyone seemed to take this moment of an industry in flux to heart. \"We can't let bad behavior slide anymore,\" said <mark>Kimmel</mark> at the show's start. \"The world is watching us .\" And indeed as the last show in this very long season, made even longer thanks to the Olympics, and with an unprecedented pressure to address all the ills of society and 90 years of movies it was perhaps always going to be too big a feat for one group of entertainers to tackle in a single nearly four-hour production. There's only so much they can do, after all, and there is no one like <mark>Kimmel</mark> to remind everyone that it is still the movie industry. In an aside about the pay disparity between Mark Walhberg and <mark>Michelle Williams</mark> for \"All the Money in the World\" reshoots, <mark>Kimmel</mark> said upon discovering that both actors were represented by the same talent agency that, \"This one shook me .\" \"If we can't trust agents, who can we trust?\" AP Film Writer Jake Coyle and writers Andrew Dalton, Nicole Evatt, Sandy Cohen and Kristin M. Hall contributed to this report. Sign up for breaking news & daily updates delivered"}, {"articleID": "2016082400_00456361_W", "names": {"Charlie Cox": ["Q454231", "Q5084731", "Q5084734"]}, "date": "2016-08-23", "url": "http://www.gizmodo.com.au/2016/08/daredevils-charlie-cox-explains-how-tiny-details-tie-marvels-netflix-shows-together", "content": "Marvel's Netflix shows--Daredevil, Jessica Jones and Luke Cage--all take place in the same version of New York City. It's gritty, it's prone to ugly violence, and you're more than likely to encounter a nurse named Claire Temple. And sometimes the links are so subtle, casual viewers might not even notice. Rosario Dawson and Mike Colter in Luke Cage. Image: Netflix Speaking at Wizard World Chicago, Daredevil \"s <mark>Charlie Cox</mark> pointed out one example of this:\" One thing that I thought was really cool is that in the second season [of \"Daredevil'], we had a scene together and in the storyline we hadn't seen each other for a long time and it takes place at the hospital,\" said <mark>Cox</mark>. \"Roasario had--Claire Temple has a cut in her eyebrow. So I was like,\" What is that?' Apparently it had nothing to do with our world but it's part of \"Luke Cage .' The timeline had been thought through and worked out so that whatever's going on in\" Luke Cage,' which we don't know, I don't know, somehow at some point during that show, the next day she's in the hospital talking to me. \"For her part, Dawson told the same panel audience that she signs on for specific episodes when her character is needed--sometimes without knowing which show she's going to appear on. Up next: Luke Cage, which begins September 30. [Comic Book Resources] Have you subscribed to Gizmodo Australia's email newsletter? You can also follow us on Facebook, Twitter, Instagram and YouTube."}, {"articleID": "2013112306_00061707_W", "names": {"Eduardo Martinez": ["Q11856580", "Q57548837"]}, "date": "2013-11-22", "url": "http://krgv.com/news/a-dance-with-darkness/", "content": "Views: ${media: community. statistics. views} EDINBURG - The Hidalgo County juvenile detention center leaves an indelible mark on those who spend time there. The experience is especially difficult for females sent to the Judge Mario E. Ramirez Juvenile Justice Center. Their stories, though, are similar to their male counterparts. Their lives are marked by years of pain and abuse. Life at the juvenile center does give the girls something they seldom have - a sense of structure. \"I always say I'm not going to come back, but I'm here,\" one girl said. The place is meant to set the girls on the right path. For some, it is the only place where they feel safe. Many of the girls know their actions have deep repercussions. \"You don't just involve yourself when you get into a gang; you involve your whole family,\" one girl said. The structured environment at the center is a far departure from what most of the teenagers know. They wake up at 6 a.m.. They have to do chores, clean up and exercise before breakfast. School starts at 8 a.m.. The learning environment resembles a regular classroom. Still, the uniforms remind them where they are. The teens are forced to pay attention. The must behave differently then they did before arriving at the center. \"I just got tired of waking up every morning and going to school and getting in fights with the same kids,\" one of the girls said. The idea of going back to a regular classroom is unsettling. \"They're gonna be talking about how I was locked up. They're gonna think I'm a bad girl now,\" one girl said. <mark>Eduardo Martinez</mark>, detention center administrator, said he has noticed a change in the female population during his 20 years working with teens. \"Back then, what we saw with girls was more runaways, truancy, maybe drug abuse. Now we see girls involved in more hardened crimes...robberies and aggravated assaults,\" <mark>Martinez</mark> said. Staff at the center said the girls are aware of the choices they made. Unlike the boys, the girls rarely make excuses, they said. A teen told a CHANNEL 5 NEWS reporter about her first days at the center. \"I was medically confined for like three days. I was throwing up, and had high fever. At the time, I was using crack,\" the girl said. She said an ex-boyfriend got her into drugs. She started stealing to feed her habit. \"When I was 12, I was raped. It was a 32-year-old man. I was a little girl,\" the girl said. She said her reality became too painful. She turned to drugs and men for solace. Another girl said her mother's actions marked her life. \"Something happened to me that wasn't supposed to happen. I have a mind now like a 23-year-old girl...I don't trust nobody,\" she said. She said her mother could have made things better. But the woman chose a man instead. \"He started living in the house. I didn't mind. He started, slowly by slowly, getting used to me and grabbing me...kissing me on the cheek. One time he kissed me on the mouth. He told me to run away with him,\" the girl said. She told her mom about the abuse, but her mother did not believe her. She said her father died years ago. Losing confidence in her mother was disastrous. Another teen is a mother herself. She knows what she wants for her son. \"This isn't the life I want him to remember I had...or the life that he's going to have,\" she said. Her son is in the care of family members. She admits they do more for him than she ever did. \"In sixth grade, I started hanging around the wrong people. I got involved in gangs. Then, seventh grade, I got pregnant and stopped going to school,\" she said. She ended up doing things she is ashamed to talk about."}, {"articleID": "2010082819_00599097_W", "names": {"Craig Stevens": ["Q1138681", "Q16226556", "Q5181488", "Q58004772"]}, "date": "2010-08-28", "url": "http://seattlepi.com/cfootball/2060ap_fbc_auburn_durable_duo.html?source=rss", "content": "last updated august 28, 2010 9:31 a.m. pt bynes, <mark>stevens</mark> are auburn defense's iron men file - in this sept. 19, 2009, file photo, auburn linebacker <mark>craig stevens</mark> (46) intercepts a pass and returns it for a touchdown past west virginia offensive line selvish capers (66) during an ncaa college football game in auburn, ala. <mark>stevens</mark> and josh bynes are the iron men of no. 22 auburn's defense and almost certainly its two most indispensable players. (ap photo/butch dill, file) auburn, ala.--<mark>craig stevens</mark> and josh bynes rarely leave the field when the no. 22 auburn tigers are playing. last year the two linebackers played all 115 defensive snaps plus special teams during auburn's overtime win against northwestern in the outback bowl. <mark>stevens</mark> had to take minute, lie down on the field and catch his breath before joining the celebration. \"it just felt so good for it to be over,\" he said. \"i did every snap, covered every punt and ran down on a couple of the kickoffs. once you go back and think about it, it kind of amazes me .\" <mark>stevens</mark> and bynes are the iron men of no. 22 auburn's defense. they played virtually every snap on the season, which defensive coordinator ted roof estimates at more than 900 overall. \"i've never had two guys play as many snaps as they played last year,\" said roof, who also coaches the linebackers. \"they played a lot more snaps last year than i've had teams play defensive snaps some seasons .\" that's what we needed to do to give us the best chance to win. those guys are both team-first guys and that's why i have so much respect for them. \"they seldom got any relief on defense last season and aren't really assured of all that much when the tigers open next saturday against arkansas state despite an influx of young linebackers. the outback bowl, a 38-35 marathon, just took matters to the extremes. auburn's defenders had to deal with a stamina-sapping double-whammy: a fast-paced offense that tries to score quickly and take minimal time between plays, and little depth. none shouldered more of that burden than bynes and <mark>stevens</mark>. they have never aired a complaint about the heavy workload, though. in fact, <mark>stevens</mark> said the bowl game was the only time he was truly worn out .\" it's a big deal, but you're so used to it, \"said bynes, a first-team preseason all-sec pick .\" this'll be my third year starting in a row. for two years, i haven't had a backup and i've played every down, every snap. you get to a point where you get used to do it and you just go out there and don't even worry about it and just play. you're playing for your teammates. it's not about me. it's not about <mark>craig</mark>. \"we realize we've got to do it in order for our team to be successful and in order for us to win games .\" auburn has brought in four linebacker signees and switched starting safety daren bates to outside linebacker. the numbers look better but only bynes and <mark>stevens</mark> are proven commodities at the position. <mark>stevens</mark>, a three-year starter, is shifting from strongside, or sam, linebacker, to weakside (will). \"i just have to get used to thinking of myself as a will, because a lot of times even coach gets confused sometimes,\" <mark>stevens</mark> said. \"i've played sam for so many years, he'll start talking about what the sam's supposed to do and he's looking at me the whole time. so i just have to remind him sometimes i play will. i get confused sometimes, too, and find myself in my playbook looking at what the sam does and i'm the will. other than that, it's been a smooth transition .\" and he's hoping the move will help win a friendly bet with bynes, since he expects to line up between the tackles more. they plan to put a little money in the pot each week that will go to the top tackler at season's end. bynes wound up with 104 tackles in 2009, nine more than <mark>stevens</mark>. \"it's harder for me,\" <mark>stevens</mark> said. \"being an outside linebacker, people just run away from me. he's in the middle so he has a chance to make plays on both sides. i don't know if i want to take that bet. i think i'll still end up in the lead, though, no matter what .\" both bynes and <mark>stevens</mark> think they belong in any conversation of the southeastern conference's top linebacking duos. they also think alike in what it will take to get that kind of recognition: winning. \"i'm not a very arrogant or cocky person,\" bynes said, \"but i feel like we're the best 1-2 combo in the sec .\" bynes is the defensive signal caller, a film rat who roof calls \"one of the most aware football players that i've ever coached .\" he often impresses <mark>stevens</mark>, too. \"josh lives in between the tackles,\" <mark>stevens</mark> said. \"he can dissect a play quickly. sometimes you'll see him on film, before a play, maybe he'll think it's going to the right. you'll see before the ball's snapped, he'll take a step that way. most of the time he ends up being right. he plays a lot on instincts .\" bynes, meanwhile, praises <mark>stevens</mark>' ability to take on much bigger offensive linemen. \"he has some big arms so he knows how to get that punch when you hit a lineman,\" he said. \"i do the same thing but he does it almost every time consistently .\" now, if they can just catch an occasional break. roof said a little rest could help them be stronger players, and that typically the quality of snaps starts to be affected somewhere between 50-70 snaps. auburn's defense was on the field for 945 plays last season, most in the sec and 73 a game. the tigers' linebacking duo weren't on the sidelines for many of them."}, {"articleID": "2018032716_00090770_W", "names": {"David O'Brien": ["Q16222361", "Q19876560", "Q5238116", "Q5238118", "Q5238119"]}, "date": "2018-03-27", "url": "http://www.myajc.com/sports/baseball/braves-albies-small-stature-large-impact/6UhDpyE507tpTsPi5N1OCM/", "content": "atlanta-braves By <mark>David O'Brien</mark> - The Atlanta Journal-Constitution...ccompton @ ajc.com/Curtis Compton Ozzie Albies holds his sister Jeanalyn before Monday night's game against the Yankees. (Curtis Compton/ccompton @ ajc.com) Posted: 12:10 p.m. Tuesday, March 27, 2018 Ozzie Albies was the youngest and smallest player on the field through most of his minor league career and his two-month call-up to with the Braves in 2017, but the second baseman's stature and impact were anything but undersized. The dynamo from Curacao silenced skeptics who wondered if he was too small to excel at the higher levels, now he is the middle infielder, not Dansby Swanson, being most counted upon by the Braves to spark the offense and help take a big step back toward contention in 2018. Albies had the Braves' only extra-base hit (double) and scored their only run in Monday's 5-1 exhibition loss to Yankees at SunTrust Park. With his family in from Curacao for the game, the 21-year-old put the finishing touches on an impressive spring training in which Albies hit .303 (20-for-66) with six extra-base hits (three homers), three stolen bases, a .343 OBP and a .500 slugging percentage. His slugging percentage was third-highest on the team among Braves with at least 40 at-bats this spring, behind outfield phenom Ronald Acuna, Freddie Freeman and Preston Tucker, an outfield candidate whose power is his primary asset. \"I feel great right now, I just want to keep it going through the whole season,\" said the 5-foot-8 switch-hitter, who homered and doubled in two games against the Yankees in the past three days. \"I'm ready .\" His work in Grapefruit League play was a continuation of what the Braves saw late last season from Albies, who debuted Aug. 1 at age 20 and hit .286 with a .354 OBP, .810 OPS, six homers, 28 RBIs and eight stolen bases in 57 games for the Braves, all starts at second base. \"What he did last year when he came up was pretty special and very exciting,\" said Freeman, who likes having Albies batting second in front of him. \"And he's continued it in the spring. I think he's going to be a very special player for a long time in this game .\" He works hard and he's like the perfect guy in this lineup, he can do everything--switch-hit, he plays great defense, he can hit, he can run. So I think a full season of him is going to be good. \"So does Braves manager Brian Snitker, who enjoys penciling Albies' name in the lineup and watching him put pressure on opposing teams and play solid and sometimes-spectacular defense .\" Whenever he plays he's going to be the highlight of something, I think, \"Snitker said\" Because he's an exciting player. He's steady and I'm not surprised by anything anymore. He's just a really good little player. \"Albies' performance as a rookie was made even more impressive by the fact he was limited during the previous offseason after breaking his elbow swinging at a pitch during a Double-A playoff game in October 2016. He wasn't cleared to begin full activities until after 2017 spring training was underway, but Albies had kept his muscular 5-foot-8 body in shape and was ready to go when he got the green light .\" It's definitely tough coming back from injuries, \"Braves veteran right fielder Nick Markakis said .\" He's a strong little bastard. He works hard, takes pride in his game and it shows on the field. He's the type of young guy you want coming up, and you want the guys after him to watch him and how he goes about his business. Because he's a special player and he's going to be a in Braves uniform for a while. \"Albies spent the winter in Curacao working to hone swing adjustments he made last year with Braves minor league hitting coaches, with special instructor Chipper Jones--who worked specifically with Albies at Triple-A Gwinnett on the switch hitter's left-handed swing--and with Braves hitting coach Kevin Seitzer. At home during the offseason, Albies set up his phone to video his daily workouts and said he watched the video repeatedly at night, examining his swing before he went to bed .\" He's real into his game, \"Snitker said .\" He's a very dedicated guy and focused. He works hard. It's every day. He gets after it. I don't think he's the kind of kid that's ever going to take anything for granted. He's always going to prepare. \"Seitzer lauded Albies for his work ethic and willingness to make in-season tweaks last season, the two of them going over things in indoor batting cages at the ballpark each day before regular batting practice, working to calm Albies' high leg kick from the left side and reduce other movement in his swing, which he did successfully. After hitting just .179 (10-for-56) with four extra-base hits and a .569 OPS in his first 16 games, Albies hit .323 with 16 extra-base hits (four triples, four homers) and an .892 OPS in 41 games the rest of the season and also stole seven bases in that span. His pace over his last 41 games would yield 206 hits, 16 triples, 16 homers and 28 stolen bases in 162 games. Swanson, who became close friends with Albies in the minor leagues, says he's not surprised by the diminutive second baseman's success at the big-league level .\" First time that I got acclimated with the Braves, people would tell me how good he was, \"said Swanson, who was traded to the Braves from Arizona in December 2015 .\" And he definitely hasn't disappointed. He's a great kid and a great player. He expects a lot out of himself and he goes out there and does it. \"We're definitely happy to have him on our team and looking forward to having him for the rest of this year and many years to come .\" About the Author <mark>DAVID O'BRIEN</mark> <mark>David O'Brien</mark> has covered the Atlanta Braves for The Atlanta Journal-Constitution since 2002. Popular in Sports 1 2 3"}, {"articleID": "2019052702_00015988_W", "names": {"Lewis Hamilton": ["Q6536656", "Q9673"], "Max Verstappen": ["Q2239218", "Q2744186"]}, "date": "2019-05-27", "url": "http://www.brisbanetimes.com.au/sport/motorsport/ricciardo-shackled-by-renault-pit-stop-blunder-in-monaco-20190527-p51rj2.html", "content": "Ricciardo shackled by Renault pit stop blunder in Monaco Ricciardo shackled by Renault pit stop blunder in Monaco Ricciardo shackled by Renault pit stop blunder in Monaco May 27, 2019--11.53 amLarger text sizeVery large text size A Renault team error has cost a frustrated Daniel Ricciardo a shot at a podium finish at the Monaco Grand Prix won by Mercedes' <mark>Lewis Hamilton</mark>. Ricciardo finished 10th, later adjusted to ninth, but the defending race champion would have been gunning for something more respectable had his team not misjudged a pit stop during an early safety car period. Play video When Ferrari's Charles Leclerc crashed on lap 11 trying to pass Nico Hulkenberg, the top four cars pitted and Renault decided to bring the Australian, who was running fifth, in as well. It was costly as Ricciardo slipped five places as other cars stayed out and climbed through the field. Advertisement He was then stuck in traffic and for an agonising stretch behind the Alfa Romeo of Kimi Raikkonen, who was able to compile an extended opening stint despite starting on soft tyres. \"It was a very frustrating race to be honest,\" Ricciardo said. A pit stop call cruelled Daniel Ricciardo's podium chase in the Monaco Grand Prix. Credit: PA \"We had a great start, jumped Kevin Magnussen on the outside for fifth and had a strong turn one .\" Then we pitted under the safety car, which is where we missed out. Loading \"We definitely could have done better and got a great result as we had all the cards in our hand .\" Ricciardo said his car was good despite not being able to fully use the speed at his disposal. \"We'll look at what happened and address it for future races,\" he added. Team principal Cyril Abiteboul said Renault had done everything required in qualifying to set up for a good result. \"Unfortunately, the single most important decision of the day was to stop Daniel under the safety car,\" he conceded. \"It turned out to be the wrong one .\" It's clearly a missed opportunity that does not reward the hard work of the team and the drivers to improve the competitiveness of the package. \"<mark>Hamilton</mark> nursed his worn tyres around the famously windy French principality circuit to cross ahead of Ferrari's Sebastian Vettel with <mark>Max Verstappen</mark> third for Red Bull. AAP"}, {"articleID": "2015051711_00011960_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"]}, "date": "2015-05-17", "url": "http://www.espnfc.com/liverpool/story/2450700/steven-gerrard-is-mr-liverpool-says-brendan-rodgers", "content": "Steven Gerrard is \"Mr Liverpool' and irreplaceable - <mark>Brendan Rodgers</mark> The ESPN FC panel discuss Steven Gerrard's career at Liverpool, where Steve Nicol says he's the second best for the club after Kenny Dalglish. Liverpool manager <mark>Brendan Rodgers</mark> has nothing but praise for Steven Gerrard, as the long-standing skipper gets ready to make his final Anfield appearance. Crystal Palace manager Alan Pardew says he has great respect for Liverpool legend Steven Gerrard, but will not let that respect change his game plan. Liverpool FC midfielder Steven Gerrard says his only regret is not winning the Premier League title as he prepares to make his final appearance at Anfield. Outgoing Liverpool captain Steven Gerrard has warned contract rebel Raheem Sterling that <mark>Brendan Rodgers</mark> will provide him with the best opportunity to develop over the coming years at Anfield. <mark>Brendan Rodgers</mark> has described Steven Gerrard as\" Mr Liverpool \"as the captain prepares to Liverpool face Crystal Palace on Saturday evening, when the 34-year-old midfielder will lead his boyhood side out at their famous home for the final time. Reds manager <mark>Rodgers</mark> said Gerrard was irreplaceable and that Liverpool, the city of his birth, owed him a great debt. <mark>Rodgers</mark> said that showed the mark of the man and added:\" I've asked a lot of my staff: \"If you could describe Steven in one word what would it be?'\" I would describe him as \"Liverpool .' Not just Liverpool as a football club, but Liverpool the city .\" This is a guy who is very much about looking after his people. He loves this city. \"As you have seen and heard, he has had number of opportunities to move from here to prestigious clubs, but Liverpool is his home .\" He grew up round the corner and went on to play for the club he supported, and what he has given to this city politicians haven't given to this city. \"He is a wonderful symbol for the people here and an incredible icon of the club. If you think he is a good player, he is an even better human being .\" FA Cup (2): 2001, 2006; League Cup (3): 2001, 2003, 2012; Community Shield (1): 2006; Champions League UEFA Super Cup (1): 2001 Individual: PFA player of the year (1): 2006; PFA young player of the year (1): 2001; PFA team of the year (8): 2001, 2004, 2005, 2006, 2007, 2008, 2009, 2014; PFA Merit Award: 2015; FWA footballer of the year (1): 2009; UEFA club footballer of the year Planning for life without Gerrard began months ago, but <mark>Rodgers</mark> refused to discuss any potential transfer targets. \"Today isn't about talking about transfer policy. Today is about commemorating the career of a phenomenal player in Steven,\" he added. \"He is irreplaceable in terms of what he is, but you have to keep moving forward as a club and a team .\" The manager praised the attitude of his players in remaining focused on opponents Palace, rather than the occasion, ahead of the weekend. \"We respect and understand the nature of the game and the occasion--as I am sure will Palace--but we are concentrating on winning the game as I am sure Steven will want to go out with a win,\" he explained. \"Steven doesn't like the focus and attention, but it is brought on because of his star quality."}, {"articleID": "2011042721_00100274_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Kate Middleton": ["Q10479", "Q17506155"]}, "date": "2011-04-27", "url": "http://ibtimes.com/articles/138798/20110427/obama-birth-certificate.htm", "content": "\"never let your opponent define you\" is the philosophy of george w. bush and his campaign staffers. the latest us business and financial news as well as issues and events obama, on the other hand, just let <mark>donald trump</mark> define him by playing into <mark>trump</mark>'s hand and releasing his long-form birth certificate. in recent weeks, <mark>trump</mark> embarked on a media blitz attacking obama on everything from foreign policy to his birthplace. initially, obama ignored <mark>trump</mark> because that's the standard response to a marginal figure - you don't want to legitimize him with your reactions. however, as <mark>trump</mark> climbed to the top of the 2012 republican presidential nominee poll, it was time to take him more seriously. marginalizing <mark>trump</mark> shouldn't be too hard - the media is already doing it on its own. obama could have accused <mark>trump</mark> of trying to pump ratings for the apprentice or pointed to past instances when <mark>trump</mark> showed interest in running and then failed to follow through. most importantly, he should have blasted <mark>trump</mark> and the media for wasting time on silly political theater instead of focusing on real issues. many americans already feel this way and obama could have really played into that. then, he needed to come out and define his 2012 campaign on the issues of his choosing. instead, obama and his campaign advisers decided to stay quiet and then released his long-form birth certificate, thereby giving more spotlight to the issue and playing right into <mark>trump</mark>'s hand. now, <mark>trump</mark> is able to criticize obama for taking such a long time to do so, which feeds the public perception that obama is arrogant and aloof. obama should realize that as long as the public stays on the birther issue, he can't win either way. of course, there is a small chance obama and his team are knowingly playing <mark>trump</mark>'s game. they may have calculated that a birther candidate will only appeal to republican primary voters while repulsing independents. playing <mark>trump</mark>'s game, then, would be building up an unelectable republican opponent at the expense of electable ones. the downside to this strategy, of course, is if an electable republican soundly defeats <mark>trump</mark>. f that happens, the republican candidate would be unscathed from the birther issue. real madrid - barcelona final score: how the champions league first leg played out thousands pay last respects to indian guru sathya sai baba amid hopes of miracles, reincarnation [photos] the royal guestlist: prince william and <mark>kate middleton</mark>'s wedding [photos] lte 4g shootout: htc thunderbolt, motorola droid bionic, samsung droid charge schalke 04 vs. manchester united (champions league - live coverage) lte 4g shootout: htc thunderbolt, motorola droid bionic, samsung droid charge <mark>donald trump</mark> pleased (but not satisfied) after obama releases birth certificate free edition get the day's most relevant news, data and anlaysis. professional forex newsfeed service for fx brokers"}, {"articleID": "2016120611_00238088_W", "names": {"Sergio Blanco": ["Q2623342", "Q42394063"], "Daniel Goldman": ["Q42321545", "Q5217300"], "Dennis Kelly": ["Q1189253", "Q21453570", "Q3705495"], "Trevor White": ["Q15040002", "Q7839484", "Q936804"]}, "date": "2016-12-06", "url": "http://www.whatsonstage.com/london-theatre/reviews/review-thebes-land-arcola-sergio-bianco_42420.html?cid=rssfeed", "content": "REVIEWS X Share via Email To From Email body Hi, I was on WhatsOnStage.com and thought you might be interested in seeing this. Cancel Send Email Review: Thebes Land (Arcola) <mark>Sergio</mark> Bianco's play is a mix of truth and fiction about a man who killed his own father with a fork Matt Trueman • London, Off-West End • 6 Dec 2016 WOS Rating: Reader Reviews: Be the first to review this show Please disable your ad blocking software or enable javascript to view this gallery. Click for fullscreen Fifty years after In Cold Blood, we remain obsessed by true crime. Think Netflix's Making a Murderer or This American Life's Serial. Thebes Land takes aim at the form and shows - bit by bit, drip drip drip - how art gets in the way of the truth. It corrodes and mutates reality. It manipulates and corrupts. T is a theatremaker; a playwright and actor. He had planned, he tells us, to put a patricide onstage at the Arcola; to bring a real-life killer face-to-face with an audience. It was all arranged with the Department of Justice and, in a metal cage, three metres high, in his grey prison tracksuit, sits Martin - a young man who killed his father with a fork. Or does he? <mark>Sergio Blanco</mark>'s play turns somersaults with the truth. It follows T's process--his meetings with Martin on the prison basketball court, his rehearsals with Freddie (Alex Austin), the actor now playing him--and charts the distortions that creep in en route. His notes on meetings are incomplete, and he smoothes Martin's words for flow, picks up on patterns and finds artistic allusions--to Oedipus, to The Brothers Karamazov, to Mozart and religious art. BUY TICKETS MORE INFO At some point it gives way - is art leading or is truth? Martin's rosary changes from jasmine to rose and back, to suit T's purposes, but was there even a rosary before the write turned up? Was there a basketball court, or is that a reflection of T's own sporting father? Was there a Martin? Even his name is symbolic: of Mars, god of war. Freddie derives from peace. In time, nothing stands up. <mark>Blanco</mark>'s play is, in turn, translated and further twisted by director <mark>Daniel Goldman</mark>, who sews in local colour and culture. The only thing the playwright insists on, we're told, is one prayer (in French) and one piece of music. \"The rest they can change .\" Can we even know <mark>Blanco</mark>'s play--let alone \"Martin's'\" crime'? What a sharp, satisfying watch this is--a play that runs rings around its audience; riddles us like the Sphinx did Oedipus. Scene by scene, it slips out of reach. Fiction slides into fiction, rehearsals corkscrew into \"reality,' and come the end, nothing's solid. <mark>Blanco</mark> does for documentary art what <mark>Dennis Kelly</mark>'s Taking Care of Baby did for verbatim work. It holes it below the waterline. The cage, then, is clever. It boxes something up, pins it in place and, at the same time, disrupts our perspective on it. T doesn't just neatly package his subject, he both defines and exploits it and displays it at a distance. <mark>Blanco</mark> shows how art spins back on itself and shapes our view of reality. In doing so, far from being progressive, it simplifies the world and so maintains the status quo. T could help his subject, could educate or comfort him; instead, he appropriates his story for personal gain and self-expression. In our post-fact world, of liberal elites and press pens, Thebes Land is all the more chilling. True, <mark>Blanco</mark> labours his point and risks overindulging it, especially since he has his postmodern cake and eats it, serving up the same salacious tittle-tattle he warns us off. For a play that points out the problems of art at length, and even suggests an alternative - art as education - but Thebes Land actively refuses to practice its own preaching. Indulgence hardly impedes enjoyment, though, and <mark>Goldman</mark>'s production is engrossing and slippery. It owes a lot to its actors: <mark>Trevor White</mark>, beautifully low-key as the flawed author, and Alex Austin, who carefully confuses actor and captive--one light, one dark, but both complex. True crime always is. Thebes Land runs at the Arcola until 23 December. Arcola Thebes LAnd <mark>Sergio Blanco</mark> X Share via Email To From Email body Hi, I was on WhatsOnStage.com and thought you might be interested in seeing this. Cancel Send Email Want more stories like these? Get theatre news, reviews, interviews, exclusive ticket discounts, and more. Each month, one subscriber will win a pair of tickets to a top London show. AROUND WHATSONSTAGE Most Shared Most Viewed Casting announced for European premiere of Death Takes A Holiday Casting announced for RSC's Julius Caesar and Antony and Cleopatra Review: Peter Pan (Olivier, National Theatre) Old Vic announces new cast of Old Vic 12 What the hell is a Candleician? Lucy Bailey to direct The Graduate in new season at West Yorkshire Playhouse Become a theatre insider. Get theatre news, interviews, videos, the latest tickets and more delivered to your inbox No thanks, don't show this popup again."}, {"articleID": "2016122303_00037400_W", "names": {"John Carney": ["Q16195457", "Q18576519", "Q21067052", "Q3181205", "Q42479381", "Q6217372", "Q6225238", "Q6225240"], "Graham Henderson": ["Q1325101", "Q5592895"], "Emma Stone": ["Q147077", "Q58064847"]}, "date": "2016-12-22", "url": "http://www.craveonline.com/entertainment/1185973-best-movie-musical-2016-la-la-land-vs-moana-vs-sing-street", "content": "by Witney Seibold Dec 22nd, 2016 Three major original movie musicals were released in 2016. Disney's animated Samoan adventure Moana, Damien Chazelle's love letter to L.A. La La Land, and <mark>John Carney</mark>'s even more passionate love letter to post-punk England Sing Street. As this is the end of the year, and this is the ideal time to look back and size up our annual experiences, SoundTreks has arrived to declare one of these three films to be the best movie musical of 2016. I know that Sing was also released this year, but that is a jukebox musical, and features no original music. A jukebox musical is its own entity, so I hasten to exclude it from the running. Apologies to fans of Sing. It can also be said that Swiss Army Man was a musical as well, although the characters in the film do very little singing themselves; the original songs, for the most part, appear on the soundtrack. It is also disqualified on a technicality. The three musicals in question all feature original songs, sung in the film by the characters, and have songs that function as revelations of character. In short, they function the way musicals traditionally do, going back as far as Show Boat. Proper movie musicals are quite rare these days, at least outside of the purview of animation, and to have two live-action musical films in one year is something of a treat. The genre should never be allowed to entirely die out. Let's start with: Moana--Music written by Lin-Manuel Miranda, Opetaia Foa’i, and Mark Mancina There are three interesting elements at play (or perhaps at war) in the music of Moana. On the one hand, we have a Broadway veteran--Lin-Manuel Miranda of Hamilton fame--attempting to make the songs sound a little more showy and stage-appropriate. The Broadway influence can be heard in songs like \"You're Welcome,\" a brag song performed by Maui (Dwayne Johnson), the cocky demigod. These are the kinds of songs that are fun to sing in the shower, and typically make for the most memorable moments from animated films. Have you forgotten \"Let It Go\" yet? No? Of course not. It's branded on your brain. Secondly, there is the Samoan influence. Moana is one of the only films I have encountered to feature the Tokelauan language, which is a Polynesian language spoken in American Samoa. The lead actors in the film are Hawai’ian and Samoan, and a lot of the musical details derive, I assume, from Samoan musical customs. This can be heard in \"We Know the Way .\" This song is, however, rendered toothless by the third element: The Disney factor. You can hear this bland flattening of interesting material in almost all of Disney's animated films, as they each feature very similar emotional beats. Moana, too, has a song about wanting more in the form of \"How Far I'll Go .\" The \"longing for more\" trope has become so common in Disney films, it's almost a snore. Indeed, this tertiary influence seems to flatten a lot of the more interesting music in Moana. The proud exception is the Bowie-influence performance of Jemaine Clement as a giant treasure-hoarding crab. Sing Street--Music written by <mark>John Carney</mark>, Ken and Carl Papenfus (from Relish), <mark>Graham Henderson</mark>, and Zamo Riffman The New Wave and post-punk era of the early 1980s were a pretty glorious time in pop music. Pop exploded in a big way at that time, and glam rock turned into something smaller and more intimate. The characters in Sing Street, when seeing a Duran Duran video (of \"Rio\" ) decide that being a New Wave band is the best way not only to win the heart of a girl, but to truly realize one's place in life. <mark>John Carney</mark>'s films all share that thesis: That making music is a transcendent experience, and those that do so live at a heightened emotional pitch, greater than that of ordinary people. The songs in Sing Street reflect not only that passion, but are nearly good enough to pass for the real thing. The in-film band, also called Sing Street, is comprised of several no-talent teens, and one very talented teen, who manage to compose and construct the most amazing pop hits. The songs play out almost like parallel universe fantasies of what they ought to be. In a teen's mind, this is how good he sounds. Never mind that kid wouldn't be able to make something nearly that polished. Never mind that the film may have benefited from a good deal of grit on the soundtrack. This is certainly a nostalgia piece, but it's the sort of nostalgia that makes anyone long for it, even those who have no experience with the New Wave scene in ’80s England. And, like all <mark>Carney</mark> joints, it's intensely and disarmingly emotional. This is a deep abiding love for music that is told in musical form. Its adoration for the time, and for live music, is the most apparent thing about Sing Street, and that affection is infectious. La La Land--Music by Justin Hurwitz, lyrics by Pasek and Paul Damien Chazelle's La La Land is a frustrating animal for sure. If you were raised on proper movie musicals--and especially if you were raised on Broadway musicals--you will immediately see the cracks in La La Land \"s false fa & ccedil; ade. The songs are bold and brassy...but not entirely slick. They reach for something they simply cannot achieve: the honest-to-goodness glitz of a Broadway production. The choreography on the opening number,\" Another Day of Sun \"is first rate, and it's a glorious number, but the song fades into the back of the memory pretty quickly. Indeed, I feel that way about most of the songs in La La Land. They are presented with energy and spirit, but they're still not memorable. Plus, the young lead actors, Ryan Gosling and <mark>Emma Stone</mark>, are clearly straining against the limits of their song and dance talent, having learned the steps and the words, but lacking the ease of movement of someone who had clearly been singing and dancing for years. You can always tell when an actor spent years dancing, and when they simply learned to dance for the production they're currently in. Watch Catherine Zeta-Jones and Renée Zellweger dance next to each other in Chicago. Zeta-Jones can dance. Zellweger is merely dancing. The showstopper from La La Land is an audition piece from the <mark>Stone</mark> character, wherein she sings about dreaming. The number is called\" Audition (The Fools Who Dream) \"and it's average. It doesn't have the genuine emotional outpouring of Sing Street. Indeed, compared to Sing Street, La La Land feels more artificial and constructed. I think that may be by design--the filmmakers don't seem willing to let the audience to simply accept that this is unreality--but that might be what's keeping me at arm's length. The Winner: The Weinstein Company Sing Street is the winner here. It's not a perfect film, but in terms of what a musical should do--and how the music should emotionally function within a film framework--it excels. Moana feels too typical for its own good. Disney has a long tradition of formula, and that formula is why audiences keep returning to their output, but creatively it's always a hindrance. There have been few Disney animated features to be truly daring in terms of storytelling beyond the 1950s. La La Land, meanwhile, is too ambitious. It wants to be in league with old-world Hollywood musicals, not realizing the virtuosity and talent that went into those old films. Fred Astaire and Ginger Rogers rehearsed until their feet bled. These posh young people merely took lessons for a few weeks, and it shows. The film is so content to be a musical, that it forgot to be a good musical. Sing Street is earnest and emotional. The music is, yes, far too slick, but that's not so horrid a distraction as to ruin the film entirely. The film's clear love of all things New Wave is glorious and enjoyable, and it's inspiring. Top Image: Disney / Lionsgate / The Weinstein Company Witney Seibold is a longtime contributor to the CraveOnline Film Channel, and the co-host of The B-Movies Podcast and Canceled Too Soon. He also contributes to Legion of Lei a and to Blumhouse. You can follow him on\" The Twitter \"at @ WitneySeibold, where he is slowly losing his mind. SHARE TWEET"}]