[{"articleID": "2017111302_00075735_W", "names": {"Liz Smith": ["Q27517406", "Q291438", "Q644208", "Q6660303"], "Elizabeth Smith": ["Q1331318", "Q28530491", "Q43391751", "Q43393828", "Q43394133", "Q43395523", "Q43395873", "Q43396043", "Q55761719", "Q56535801", "Q644208"]}, "date": "2017-11-13", "url": "http://www.santafenewmexican.com/news/longtime-queen-of-tabloid-gossip-columns-dies/article_5d806960-9023-5164-9b12-e2d722331f32.html", "content": "<mark>Liz Smith</mark>, the longtime queen of New York's tabloid gossip columns, who for more than three decades chronicled little triumphs and trespasses in the soap-opera lives of the rich, the famous and the merely beautiful, died Sunday at her home in Manhattan. She was 94. Her friend and literary agent, Joni Evans, confirmed her death. From hardscrabble nights writing snippets for a Hearst newspaper in the 1950s to golden afternoons at Le Cirque with Sinatra or Hepburn and tête-à-tête dinners with Madonna to gather material for columns that ran six days a week, <mark>Smith</mark> captivated millions with her tattletale chitchat and, over time, ascended to fame and wealth that rivaled those of the celebrities she covered. A self-effacing, good-natured, vivacious Texan who professed to be awed by celebrities, <mark>Smith</mark> was the antithesis of the brutal columnist J.J. Hunsecker in Clifford Odets and Ernest Lehman's screenplay for Sweet Smell of Success, which portrayed sinister power games in a seamy world of press agents and nightclubs. Her column, called simply \"<mark>Liz Smith</mark>,\" ran in The New York Daily News from 1976-91; in New York Newsday from 1991-995, when that newspaper closed; continued in Newsday until 2005 and, with some overlap, in The New York Post from 1995-2009--a 33-year run that morphed onto the internet in the New York Social Diary. She was not an exceptional writer or reporter, although there were occasional scoops--the 1990 split of Donald and Ivana Trump, Madonna's 1996 pregnancy--but her income often exceeded $1 million a year, more than any newspaper columnist or executive editor. Her style was not the intimidating jugular attack of columnists who expose intimacies or misdeeds in the private lives of public figures, thriving on Schadenfreude and sometimes damaging reputations. Nor, for the sake of a titillating item, did she seize upon ugly rumors or tasteless embarrassments. And gossip was hardly the only ingredient of her columns, which were sprinkled with notes on books or films, bits of political commentary and opinions about actors, authors and other notables. But journalism's watchdogs accused her, with some justification, of conflicts of interest, of lacking objectivity and distance from those she wrote about. \"It's a valid criticism, I suppose,\" <mark>Smith</mark> said in a 1991 interview with The New York Times. Mary <mark>Elizabeth Smith</mark> was born in Fort Worth, Texas, on Feb. 2, 1923, daughter of Sloan and Sarah McCall <mark>Smith</mark>. Her father was a cotton broker whose gambling problems and fading income during the Great Depression forced the family to sell their home and move. After high school, she attended Hardin-Simmons University, a Baptist-affiliated college in Abilene, and met George E. Beeman, whom she married and divorced. She leaves no immediate survivors."}, {"articleID": "2018010808_00257666_W", "names": {"Stephen Farrell": ["Q27824992", "Q7609177", "Q7609179"], "John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"]}, "date": "2018-01-08", "url": "http://www.insidermedia.com/insider/yorkshire/town-centre-securities-appoints-john-lewis-director", "content": "<mark>Stephen Farrell</mark> Digital Staff Writer Town Centre Securities appoints <mark>John Lewis</mark> director 8 Jan 2018 Yorkshire Business <mark>Stephen Farrell</mark> Leeds-based property developer and investor Town Centre Securities has appointed the property director at department store chain <mark>John Lewis</mark> to its board. Jeremy Collins will take up a position as non-executive director with effect from 1 February 2018. Collins is currently property director at <mark>John Lewis</mark> and will leave his current role as at the end of January. He joined <mark>John Lewis</mark> in 2003 as head of retail development, becoming property director in 2010, and has overseen the significant expansion of the partnership's department store estate from 24 to 51 shops during that time. He worked for Lend Lease between 1998 and 2003, in the roles of head of retail and project director, and his career has also included roles at MEPC, Grosvenor Square Properties, Bredero Properties and Wirral Borough Council. Edward Ziff, chairman and chief executive of TCS, said: \"We are delighted Jeremy is joining our Board. He brings 35 years of commercial property experience and a unique perspective on retail development and management having worked for a local authority and several property companies.\" Jeremy's appointment continues our board succession planning with three new non-executive directors, a new executive director and a new finance director appointed over the last three years, adding the additional skills and experience necessary to manage an ambitious real estate business. \"Jeremy Collins added:\" I am delighted to be joining the board of Town Centre Securities, at such an exciting time for the company. Its family origins and values, and its long-term perspective, resonates very strongly with me. \"I am looking forward to helping the business to adapt to the rapidly changing retail environment, and to continuing its role as a leading regeneration specialist in major cities such as Leeds and Manchester. This new role is an exciting start to my new portfolio of interests.\" Entries are now open for Insider's 6th annual manufacturing awards, Made in Yorkshire 2018. Enter your nominations now. Sector News"}, {"articleID": "2012091811_00030328_W", "names": {"Louis Smith": ["Q445224", "Q639998"]}, "date": "2012-09-18", "url": "http://breakingnews.ie/entertainment/humble-dappy-wants-to-dance-on-strictly-567349.html", "content": "18/09/2012 - 11:41:01 dappy wants to do \"strictly come dancing'. the\" no regrets' singer - whose cousin tulisa contostavlos is a judge on rival show' x factor' - thinks he would be a great competitor on the bbc talent show, which this year features <mark>louis smith</mark>, jerry hall and victoria pendleton, because he is a good mover. he told we love pop magazine: \"i would love to go on\" strictly come dancing'. i've got good rhythm, of course. \"despite his cousin and n-dubz bandmate tulisa becoming a huge star on' x factor', dappy claims he is not jealous of her success because they are\" completely different \". he said:\" i've never, ever been jealous of tulisa, because we do completely different things. \"i'm too down to earth and too humble to have a grudge over my cousin who is a female.\" dappy may be inclined to do \"strictly' because he believes his behaviour has changed from when he was younger and in n-dubz. 21/09/2012: rugby friday: glasgow warriors v connacht 22/09/2012: the premier blog: chelsea v stoke 23/09/2012: all-ireland senior football final: donegal v mayo 28/09/2012: rugby friday: connacht v leinster 30/09/2012: all-ireland hurling final replay: kilkenny v galway we have no live events at the moment. please check\" future events' tab for upcoming events"}, {"articleID": "2011071922_00011670_W", "names": {"Peter Oppenheimer": ["Q2306779", "Q28457748"]}, "date": "2011-07-19", "url": "http://eweek.com/c/a/Desktops-and-Notebooks/Apples-OS-X-Lion-Launching-iPad-iPhone-Quarterly-Sales-Soar-163074/?kc=rss", "content": "desktops and notebooks news & reviews apple reported significant growth in ipad and iphone sales for the fiscal 2011 third quarter, on its way to quarterly revenues of $28.57 billion and net profit of $7.31 billion. in all, apple sold 20.34 million iphones during the quarter, a year-over-year increase of 142 percent. it also sold 9.25 million ipads, good for a year-over-year increase of 183 percent. sales of 3.95 million macs represented a 14 percent increase from the same quarter in 2010. \"we sold every ipad we could make,\" cfo <mark>peter oppenheimer</mark> told analysts and media listening to apple's july 19 earnings call, while suggesting that significant majorities of the fortune 500 were studying how to best integrate the bestselling tablet into their employees' workflow. the iphone is also apparently enjoying an uptick in adoption among enterprise users. as with previous quarters, apple also faced a significant decline in ipod sales: 7.54 million units sold, a 20 percent dip from the year-ago quarter. the company traditionally ascribes this softness in media-player sales to cannibalization by the iphone. \"we're thrilled to deliver our best quarter ever, with revenue up 82 percent and profits up 125 percent,\" apple ceo steve jobs wrote in a july 19 statement accompanying the numbers. \"right now, we're very focused and excited about bringing ios 5 and icloud to our users this fall.\" even before apple's july 19 earnings report, analysts and pundits had turned their attention to the backend of 2011, when the company is expected to release a host of new software-including the mac os x \"lion\" and ios 5 operating systems-along with a new iphone. \"the concern on [wall street] seems to be more about the outlook for the third quarter,\" tony ursillo, an analyst with loomis sayles & co, told reuters july 15, \"ongoing supply constraints for the ipad and the timing of the iphone introduction.\" for many, questions (and buzz) are growing around the nature of that iphone rollout. the blog boy genius report, citing \"new information from an incredibly solid source,\" posted july 18 that apple is planning to launch a no-contract iphone priced at $350. \"it's entirely possible that the low-cost iphone will in fact be the iphone 3gs,\" that posting added. \"we are told that apple will continue to sell the current iphone 4 as well, finally giving the company a full range of devices in the lower, mid, and high-end price segments.\" but apple likes to keep its future plans shrouded in secrecy, and company executives on the july 19 earnings call were tight-lipped about the iphone's future. <mark>oppenheimer</mark> did reveal, however, that apple plans on launching the latest version of mac os x 10.7 \"lion\" july 20. the latest version of apple's long-running mac os x franchise includes full-screen applications, tweaks to the user interface (such as disappearing scroll bars and an increased range of gesture controls) and an airdrop feature that wirelessly shoots files to other users. ios 5 and icloud will launch during the fall timeframe, along with a \"major product transition that we won't talk about.\" that could be the closest thing to an actual iphone reference. the ios 5 update includes a wide variety of new features specifically designed to make apple's mobile devices more competitive against google android, windows phone, and research in motion's blackberry franchise. the world's leading ssl certificates now offer more protection and security. now from symantec. the verisign seal is displayed more than 250 million times a day on more than 90,000 websites and inspires confidence among your customer base when on your site. delivering business to your customers global ibm study confirms cloud computing poised to take off visit eweek labs for independent reviews of it products and services from your it peers. (sponsor) apple no-contract iphone rumors emerge ahead of earnings iphone preferred over android 46% to 32%: changewave verizon iphone, ipad 2 lure developers from android to ios apple mac os x lion includes revised encryption mechanism ipad will go to higher resolution display: reports hp_smallbiz: it??? s??? as easy a time as ever?? to overcome noise in the industry and make a name for yourself .?? - @ davekresse: hp_smallbiz: get @ davekresse @ mudynamics??? take on working in small companies and industry opportunities on 367addisonavenue. com: hp_smallbiz: choosing a location for your #smallbiz? consider these ideas from @ socialtimes: hp_smallbiz: brand new on 367addisonavenue. com - @ davekresse:??? you never have a dull day???? \"tips for entrepreneurs: hp_smallbiz: did you know you can vote every 24 hours for this year??? s @ smbinfluencer awards. our blog is up for best news outlet! hp_smallbiz: how can you avoid passing on the rising cost of doing business to your loyal customers? consider these ideas: hp_smallbiz: #googleplus is all the rage, and it will have business profile pages for #smbs! (via @ mblumenthal) #smallbiz hp_smallbiz: confront costs: if you??? re overwhelmed by the amount due, these ideas are for you: hp_smallbiz:??? extra power at a fair price?? @ govcomputernews awards the #hp z210 #zworkstation with a reviewers choice!"}, {"articleID": "2011100916_00036146_W", "names": {"Jonathan Ross": ["Q40054", "Q58131908"]}, "date": "2011-10-09", "url": "http://khon2.com/entertainment/story/Gaga-wants-career-before-motherhood/4bAVmMzgbESG7_Ad5b-Hgw.cspx", "content": "lady gaga arrives at nevermind nightclub on july 11, 2011 in sydney, australia. (marianna massey, getty images) lady gaga has no desire to become a mother in the near future as she wants to release at least 10 more albums before having babies. the poker face hitmaker admits she does want a family one day, but she is too busy focusing on her career to think about settling down. speaking on britain's the <mark>jonathan ross</mark> show, she says, \"i'm a maternal person but i'm not feeling the urge to be pregnant. some day i will but not now.\" oh my gosh, the fans would kill me. i'm just not ready. i really want to make at least 10 more albums before i do something like that. \"you can send a story to multiple email addresses by separating the email addresses with a semicolon (;)"}, {"articleID": "2012110107_00041397_W", "names": {"Steve Thornton": ["Q1316784", "Q3499136", "Q7441719"], "John Reynolds": ["Q1119678", "Q11928237", "Q16735150", "Q19097301", "Q20006890", "Q20733627", "Q24042092", "Q27925313", "Q47095546", "Q51589906", "Q57411918", "Q6254663", "Q6254673"], "Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"]}, "date": "2012-11-01", "url": "http://nwemail.co.uk/walney-carnival-under-threat-if-new-secretary-not-found-1.1009408?referrerPath=news/1509454", "content": "walney carnival under threat if new secretary not found a carnival is under threat next year unless a new secretary joins its committee. walney carnival committee is desperately appealing to find a secretary so the island celebration can go ahead next july. the small team has been seeking a replacement for the former secretary, sara smith, who stepped down this summer. but the plea through facebook and posters has not attracted anyone so far. as well as the enjoyment of carnival day, the event also raises money for good causes on walney, and community events for families on the island. it is now feared that all this will end. most of the committee work full time and the secretary role is suited to someone who may only work part time, as they need to be able to make phone calls in the day time, but with the support of the committee. chairman <mark>steve thornton</mark> said: \"if we don't get a secretary it's finished. we wouldn't have a carnival and we couldn't raise the money for charities. i think people would be devastated if there was no carnival on walney. it's a big thing on the island. we just have to hope.\" walney carnival committee held its annual family halloween party and cheque presentation to seven worthy cause on friday night. treasurer <mark>john reynolds</mark> explained at the presentation that the carnival was in jeopardy. speaking to the evening mail, mr <mark>reynolds</mark> said: \"we have had posters up in schools and we set up a facebook page but we have had no one forward. on carnival day we always get a lot of volunteers. it's just a couple of hours a week that is needed and it would be supported. it's having the time in the day time to contact people.\" we want to continue to help projects on the island. \"one community group which also knows about giving their time to their community is walney community first responders, which received? 200 at the presentation. first responder keith sharpe, who accepted the cheque, said:\" you just have to look at it here tonight, it's a community event that is what the carnival is for. we wouldn't like to see the carnival go. we hope they get a secretary. \"anyone interested in finding out about being the secretary is asked to call mr <mark>thornton</mark> on 07856 753482. see more about the good causes that benefited from walney carnival in thursday's evening mail. first published at 16:28, monday, 29 october 2012 pair in eight-hour south lakes mountain rescue only had page from guide inspirational ulverston teenager receives pride of britain award from <mark>robbie williams</mark>"}, {"articleID": "2018121201_01602430_W", "names": {"Nathan Lyon": ["Q6969216", "Q6969217"], "Jack Russell": ["Q17402898", "Q3526123", "Q390197", "Q56254121"]}, "date": "2018-12-12", "url": "https://www.news18.com/cricketnext/news/india-vs-australia-ability-to-grow-as-a-cricketer-stands-between-pant-achieving-stardom-1970471.html", "content": "Rishabh Pant. (AFP) Loading...The distance from Haridwar to Perth, as the very tired crow flies, is 7943 kilometres. But, when you see just how far Rishabh Pant has come in his cricketing journey, even this humongous number seems small. In the first Test against Australia in Adelaide, Pant kept wickets, Pant batted, hell, without knowing it Pant was even commentator for one over when host broadcaster Fox decided to silence their men and allow the chirp from the wicketkeeper to Pat Cummins to inform the world on the state of play. In a Test match where the record for the most number of catches was broken--there were 35 in all--it felt right that the wicketkeeper had the lion's individual share, 11 catches. There might have been a 12th and a world record, but Pant's dive to his right to try and hold onto a healthy edge from <mark>Nathan Lyon</mark>, fell short and he had to be content with drawing level with England's <mark>Jack Russell</mark> and South Africa's AB de Villiers. There was another miss, not quite a drop, when Pant failed to get a glove to ball from a Tim Paine edge. But, you don't dwell on what went begging when someone has played his part in sealing a famous victory. Pant is playing only his sixth Test match and he knows better than anyone else what his limitations are behind the stumps. He will no doubt work on improving his footwork, which will help him attempt more catches with two hands rather than one. His anticipation can only get better as he closely watches the best in the world, how they bat and what the ball does in response to certain strokes. (AP Photo) With the bat, Pant is all excitement. Or none at all. When called to, he can block it, but he'd rather not. His natural instincts are to attack and the manner in which he picked up a full ball from Mitchell Starc in India's first innings and dinked it over backward square for six was pure Twenty20 magic. Pant made 25 and 28 in his two innings, 36 of 53 runs coming off only eight deliveries in boundaries. But while that contribution in this Test, a low scoring one, was adequate, the fact that he has predominantly two gears, first and overdrive, would not have missed the attention of opposition bowlers, coaches and video analysts. A case in point was when <mark>Lyon</mark> packed the off side field with slip, silly point, gully, point and two short covers and bowled his hard spun quick off breaks, Pant found it almost impossible to get off strike. He either had to take the high-risk option playing across the line or slog the ball over the infield. To his credit, he managed to strike a few clean blows, but the fact that he could not then make the most of it has been noticed by many, including the coach of the Indian team. \"You have to allow him to play his game, but he has to be a little more sensible now,\" said Shastri after the first Test. \"He did the hard work in getting <mark>Lyon</mark> to spread his fields, so he has to be smarter. You make a mistake now, but don't repeat it, then I'll be in his ears.\" It would be wise for Pant to engage in course correction on his own for he does not want to get a reputation for having only one style of play. Whether he works with fielding coach R Sridhar, reaches out to those who have helped him get where he is or learn by himself, he has to work on becoming a more complete batsman, one who can be relied on to work the singles, rotate the strike and keep the scoreboard ticking along when the big shots are taken out of the equation. Pant credited Mahendra Singh Dhoni for being a major influence in his evolution. \"He's (Dhoni) the hero of the country,\" Pant told the Cricket Australia website soon after the first Test. \"I've learnt a lot from him as a person and as a cricketer as well. Whenever he's around I feel more confident as a person. If I've got any problems I can share it with him and get a solution right away. As a wicketkeeper and as a player he has taught me to be patient in pressure situations. You have to keep calm and keep composed and give 100%.\" Working hard and giving 100% are things that this lot of international cricketers do not shy away from at any stage. That should be a given. What is not is skill levels and the ability to grow as a cricketer. When Pant adds that to his personality, he has the potential to become a superstar in front of the stumps and an invaluable asset behind them. AB de Villiers India vs Australia 2018 <mark>Jack Russell</mark> Mitchell Starc <mark>Nathan Lyon</mark> Pat Cummins Rishabh Pant Tim Paine First Published: December 12, 2018, 6:10 AM IST"}, {"articleID": "2016051901_00073191_W", "names": {"Patrick Smith": ["Q15459993", "Q43392916", "Q43911120", "Q51933768", "Q7147663", "Q7147670"], "Garry Jones": ["Q16145331", "Q17466273"], "Donald Trump": ["Q22686", "Q27947481"], "Eugene Robinson": ["Q5407694", "Q5407695"]}, "date": "2016-05-19", "url": "http://timesunion.com/tuplus-sports/article/Rain-could-benefit-Nyquist-s-challenger-in-7669621.php", "content": "http: //www.timesunion.com/tuplus-sports/article/Rain-could-benefit-Nyquist-s-challenger-in-7669621.php Rain could benefit Nyquist's challenger in Preakness Exaggerator, second in the Kentucky Derby, has proven he can win on a sloppy track By Tim Wilkin Updated 8:18 pm, Wednesday, May 18, 2016 Photo: <mark>Patrick</mark> Semansky Image 1of/36 Caption Close Image 1 of 36 A groom washes Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) A groom washes Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 2 of 36 BALTIMORE, MD - MAY 18: Preakness contender Laoban is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Preakness contender Laoban is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 3 of 36 BALTIMORE, MD - MAY 18: Exaggerator trainer Keith Desormeaux looks on after watching a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Exaggerator trainer Keith Desormeaux looks on after watching a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore,...more Photo: <mark>Patrick Smith</mark> Image 4 of 36 Preakness Stakes hopeful Collected is led to the track for a morning jog by assistant trainer Jimmy Barnes at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. Exercise rider George Alvarez is in the saddle. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Preakness Stakes hopeful Collected is led to the track for a morning jog by assistant trainer Jimmy Barnes at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. Exercise rider George Alvarez is in the...more Photo: <mark>Garry Jones</mark> Image 5 of 36 BALTIMORE, MD - MAY 18: Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less BALTIMORE, MD - MAY 18: Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in...more Photo: <mark>Patrick Smith</mark> Image 6 of 36 A horse is bath in the barn area days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) A horse is bath in the barn area days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) Photo: <mark>Patrick Smith</mark> Image 7 of 36 A man walks through rows of empty seats during a training session days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. A man walks through rows of empty seats during a training session days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. Photo: <mark>Patrick Smith</mark> Image 8 of 36 Preakness contender Collected is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Preakness contender Collected is bathed following a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 9 of 36 A horse trains in front of a \"Preakness' sign days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. A horse trains in front of a\" Preakness' sign days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. Photo: <mark>Patrick Smith</mark> Image 10 of 36 Gary Sherlock, who trains Preakness Stakes hopeful Uncle Lino, listens to a story outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) MDGJ101 less Gary Sherlock, who trains Preakness Stakes hopeful Uncle Lino, listens to a story outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled...more Photo: <mark>Garry Jones</mark> Image 11 of 36 Horses walk in front of row-homes as they train on track days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Horses walk in front of row-homes as they train on track days prior to the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 12 of 36 Trainer Keith Desormeaux, who will saddle Exaggerator in the 141st Preakness Stakes, shares a laugh outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016 in Baltimore. The Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Trainer Keith Desormeaux, who will saddle Exaggerator in the 141st Preakness Stakes, shares a laugh outside the stakes barn at Pimlico Race Course Wednesday, May 18, 2016 in Baltimore. The Preakness Stakes is...more Photo: <mark>Garry Jones</mark> Image 13 of 36 Trainer Keith Desormeaux walks Preakness Stakes hopeful Exaggerator in the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore following a morning jog. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) less Trainer Keith Desormeaux walks Preakness Stakes hopeful Exaggerator in the stakes barn at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore following a morning jog. The 141st Preakness Stakes is...more Photo: <mark>Garry Jones</mark> Image 14 of 36 Assistant trainer Jimmy Barnes holds Preakness Stakes hopeful Collected during a morning bath at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday, May 21. (AP Photo/Garry <mark>Jones</mark>) ORG XMIT: MDGJ105 less Assistant trainer Jimmy Barnes holds Preakness Stakes hopeful Collected during a morning bath at Pimlico Race Course Wednesday, May 18, 2016, in Baltimore. The 141st Preakness Stakes is scheduled for Saturday,...more Photo: <mark>Garry Jones</mark> Image 15 of 36 Kentucky Derby winner Nyquist is walks in the barn after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is walks in the barn after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark>... more Photo: <mark>Patrick Smith</mark> Image 16 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 17 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 18 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 19 of 36 Grooms wash Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) ORG XMIT: MDPS102 less Grooms wash Preakness contestant Collected at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) ORG XMIT:...more Photo: <mark>Patrick</mark> Semansky Image 20 of 36 Nyquist trainer Doug O'Neill walks at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Nyquist trainer Doug O'Neill walks at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 21 of 36 An apron for Laoban hangs in a barn as he is washed at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) An apron for Laoban hangs in a barn as he is washed at Pimlico Race Course in Baltimore, Wednesday, May 18, 2016. The Preakness Stakes horse race is scheduled to take place May 21. (AP Photo/Patrick Semansky) Photo: <mark>Patrick</mark> Semansky Image 22 of 36 Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 23 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 24 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 25 of 36 Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is bathed after a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty...more Photo: <mark>Patrick Smith</mark> Image 26 of 36 Kentucky Derby winner Nyquist is walked by exercise rider Jonny Garcia on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist is walked by exercise rider Jonny Garcia on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore,...more Photo: <mark>Patrick Smith</mark> Image 27 of 36 Kentucky Derby winner Nyquist trains on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist trains on track during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark>... more Photo: <mark>Patrick Smith</mark> Image 28 of 36 Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (left) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 29 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on back to the barn with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on back to the barn with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico...more Photo: <mark>Patrick Smith</mark> Image 30 of 36 Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Kentucky Derby winner Nyquist (right) is walked by exercise rider Jonny Garcia on track with an outrider (right) during a training session for the 141st running of the Preakness Stakes at Pimlico Race Course on...more Photo: <mark>Patrick Smith</mark> Image 31 of 36 Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo by <mark>Patrick</mark> Smith/Getty Images) less Trainer Doug O'Neill looks on after watching his horse Kentucky Derby winner Nyquist train for the 141st running of the Preakness Stakes at Pimlico Race Course on on May 18, 2016 in Baltimore, Maryland. (Photo...more Photo: <mark>Patrick Smith</mark> Image 32 of 36 Buy photo Kentucky Derby winner's trainer Doug O'Neill smiles at receiving the #3 post position for his charge at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) less Kentucky Derby winner's trainer Doug O'Neill smiles at receiving the #3 post position for his charge at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip...more Photo: SKIP DICKSTEIN Buy this photo Image 33 of 36 Buy photo The Preakness winner's Trophy is on display for all to see at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) The Preakness winner's Trophy is on display for all to see at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) Photo: SKIP DICKSTEIN Buy this photo Image 34 of 36 Buy photo Kentucky Derby winner Nyquist's trainer Doug O'Neill is joined by owner J. Paul Reddam, left and jockey Mario Guiterrez, center seem calm at receiving the #3 post position for Nyquist at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD.. The 141st running of the Preakness will be held Saturday. (Skip Dickstein/Times Union) less Kentucky Derby winner Nyquist's trainer Doug O'Neill is joined by owner J. Paul Reddam, left and jockey Mario Guiterrez, center seem calm at receiving the #3 post position for Nyquist at the Post Position Draw...more Photo: SKIP DICKSTEIN Buy this photo Image 35 of 36 Buy photo The starting gate positions are set for Saturday's 141st running of the Preakness at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) The starting gate positions are set for Saturday's 141st running of the Preakness at the Post Position Draw Wednesday May 17, 2016, at Pimlico Race Course in Baltimore, MD (Skip Dickstein/Times Union) Photo: SKIP DICKSTEIN Buy this photo Image 36 of 36 Rain could benefit Nyquist's challenger in Preakness 1 / 36 Back to Gallery Baltimore, Md.. Two things look to be definite on Saturday. Kentucky Derby champion Nyquist will be the favorite for the 141st running of the Preakness, and the weather is going to be lousy. Recent weather reports call for a chilly day, with temperatures in the 50s, and a 100 percent chance for rain. Is that good for Nyquist? The unbeaten champ has run on an off track only once in his eight-race career, when he romped to a 31/4-length win in the Florida Derby on a Gulfstream Park track labeled \"good.\" \"We've seen that Nyquist can handle a bit of weather at Churchill Downs,\" trainer Doug O'Neill said, referring to a hard rain an hour and a half before the Kentucky Derby. \"The Florida Derby, it rained pretty good, too. He is a sure-footed horse. Whatever the weather will be, I think he'll show up and run his race.\" One horse who should relish an off track is Nyquist's arch-rival, Exaggerator. The Keith Desormeaux - trained colt has won two of his three career starts on an off track. Exaggerator was most impressive in his latest trip on a sloppy track. That was the April 9 Santa Anita Derby, at which he sloshed to a 61/4-length win and earned the highest speed figure (103) of his career. Nyquist was not in the field that day. Exaggerator has faced Nyquist four times this season and finished second twice. Exaggerator was a fast-closing second in the Derby, beaten by 11/4 lengths. Desormeaux was not working on a victory speech after finding out about the weather forecast. A sloppy track doesn't guarantee that Exaggerator will turn the tables on Nyquist. \"I don't know if it's a matter of our horse moving up on an off track,\" Desormeaux said. \"It's more of the fact that my horse handles it so well, whereas other horses have not run in the slop. The track we ran on at Santa Anita was a quagmire. The fact that he got over it so well gives me an advantage, but I don't know if it moves me up.\" twilkin @ timesunion.com • 518-454-5415 • @ tjwilkin This is a TU + story. Click for more information. Today's Premium Content - - - - - - - - - - - - - - - - - - - - - - - - - - Tech Valley students learn how to run their own utility from National Grid Adirondack tourist railroad seeks to block state trail conversion plan Outgoing Adironack Park board member blasts Cuomo tactics Editorial: The <mark>Donald Trump</mark> show <mark>Eugene Robinson</mark>: <mark>Trump</mark> and his fictional characters Jo Page: The rituals in our lives can fill us with a sense of hope Layoff responsible for growth Congress must take a stand on war View Comments & copy; 2016 Hearst Communications, Inc. ."}, {"articleID": "2012122804_00003297_W", "names": {"Mark Sanchez": ["Q15991558", "Q15991574", "Q6769581", "Q946184"]}, "date": "2012-12-28", "url": "http://app.com/article/20121227/NJSPORTS031003/312270076/1002/SPORTS&source=rss", "content": "defining moment like he does before every game, khaseem greene will gather the entire rutgers defense together on...matt theobold thought for a second he might have been defeated in the 138-pound championship bout...uncle vinnie's comedy club: $35.00 gift certificate for uncle vinnie's comedy club on sale for $8.75 we're all about great food & great fun! uncle vinnie's comedy club features the top stand up in the...howard johnsons/legends: $25.00 gift certificate on sale for $12.50 coming friday: 66 sessions with julian fulton and the zombie gospel dems lining up for 2 key races mayor cory a. booker of newark will not be david to gov.'tis the season when columnists write mea culpas, make predictions and list their resolutions. florham park - rex ryan stepped to the podium, looked out at the cameras and opened his news conference with a warning. \"you're not going to believe this one,\" the jets coach declared without any hint of a smile. in what has been a bizarre season, the jets' wacky quarterback situation took yet another twist. greg mcelroy has a concussion - which he didn't reveal until thursday - and will be replaced by <mark>mark sanchez</mark> as the starting quarterback in the season finale at buffalo on sunday. \"we've come to find out that greg wasn't exactly truthful with our training staff after the game,\" said ryan, who acknowledged he was \"stunned\" to hear the news. \"he never disclosed that he had symptoms after the game to our trainers. right now, he's being evaluated for a concussion.\" mcelroy, preparing to make his second nfl start in place of the benched <mark>sanchez</mark>, was lifting weights thursday morning and started experiencing headaches, ryan said. mcelroy went to the team's training staff and then revealed he was suffering concussion-like symptoms after being sacked 11 times in the jets' 27-17 loss to san diego last sunday. mcelroy and head trainer john mellody then went to ryan to tell the coach the news. offensive coordinator tony sparano said he was \"pretty silent\" when he found out a few minutes after ryan. \"it's another bump in the road here,\" sparano said, \"and it's something we've become a little accustomed to dealing with.\" ryan was not certain exactly when mcelroy suffered the concussion, but said there was no way he would play mcelroy against the bills and the third-stringer will \"definitely be out.\" mcelroy had been listed on the injury report wednesday with a mild abdominal strain, but was a full participant in practice and was expected to play without any issues. \"i admire his courage and everything else, but you have to be truthful and i think that's the lesson learned here with the medical staff,\" said ryan, who spoke to the entire team about concussions after practice. \"the fact he really wanted to play, i understand the competitive side of greg and all that, but the most important thing is the health of the players.\" obviously, i feel fortunate that something like this showed up without him going out there and putting himself in harm's way. \"while <mark>sanchez</mark> wouldn't comment on whether players choosing to play through head injuries is common in the nfl, tebow acknowledged that it probably does happen around the league because of job security.\" you fight hard to earn something and you don't want to jeopardize that with an injury, for sure, \"said tebow, who added that he has never been in mcelroy's situation.\" i think that's definitely something guys will think about. \"ryan chose to start <mark>sanchez</mark> over tim tebow because the team has just two practices and a walkthrough to prepare before the game. he also cited <mark>sanchez</mark>'s success against the bills in the season opener, when he threw three touchdown passes in the jets' 48-28 win. <mark>sanchez</mark> appeared to be on his way to a solid season, but it ended up being his best game. he was benched for the first time in his four-year career after turning over the ball five times at tennessee on dec. 17.\" i'm excited to play, obviously, \"<mark>sanchez</mark> said.\" you just never want to see something like that happen to a teammate, somebody i really respect. you feel for greg and i'll be ready to play. \"<mark>sanchez</mark> was a bit surprised when ryan told him he'd be starting because he thought mcelroy just wasn't feeling well.\" i guess i didn't expect it, \"<mark>sanchez</mark> said.\" i wasn't coming into today thinking he had a concussion. i never would've known. \"mcelroy leapfrogged tebow on the depth chart to start against the chargers. after finding out about mcelroy's condition, ryan spoke with both <mark>sanchez</mark> and tebow to tell them of his decision.\" obviously, tim's not happy with that, as you'd expect, \"ryan said. the news came on the heels of some tension between ryan and tebow last week, when the popular backup quarterback told the coach he was\" disappointed \"at not getting the start and wanted to play\" regular quarterback. \"espn new york first reported sunday that tebow asked out of the wildcat, and a person with knowledge of the situation confirmed that to the associated press. the two met again last friday to clear the air, and tebow reiterated that he was willing to do anything the team asked him to do. tebow insisted wednesday that he did not refuse to do anything and acknowledged that ryan might have misinterpreted what he said. ryan said he understands that tebow is frustrated at the situation and by not starting, but again would not disclose anything said between the two in their conversations last week. tebow said he didn't think ryan's choice to play <mark>sanchez</mark> was in any way punitive, and added that he and the coach have a\" great \"relationship.\" when you're a competitor, you want to play, \"tebow said.\" but i understood his decision and i just let him know, just like always, that i'll do whatever i can to help the team. \"tebow will be the no. 2 quarterback on sunday at buffalo, and could play - but it won't be as the starter.\" obviously, he'd like a shot at it, \"ryan said,\" but with the situation the way it is, it's a short window, really, to get the preparation time in and i just think it's best for our football team. \"with the way the season has played out, from the quarterback controversies to the injuries suffered by key players, ryan was asked if this is the strangest year he has ever experienced in the nfl. concussion will sideline mcelroy; <mark>sanchez</mark> to start rex ryan stepped to the podium, looked out at the cameras and opened his news conference with a warning.\" you're not going to believe this one,' the jets coach declared without any hint of a smile. firefighters battle surf city blaze that destroys vacant summer home become a subscriber today to enjoy these benefits: ipad-optimized edition mobile site & iphone app are you currently a subscriber? set up your digital access now. you now have full access. thank you for subscribing. access the tablet-optimized site, mobile site and iphone app share your access with any friend or family member subscriber exclusive top 5 daily email newsletter create an account or if you have a digital profile to continue using your current web browser, adobe flash must be installed or upgraded:"}, {"articleID": "2013102308_00037822_W", "names": {"James Lee": ["Q11309421", "Q16221020", "Q3161221", "Q3161260", "Q42790671", "Q56152921", "Q56597623", "Q6137920", "Q6137925", "Q6137927", "Q6137929", "Q8988115"]}, "date": "2013-10-23", "url": "http://www.modbee.com/2013/10/22/2988551/former-broker-admits-defrauding.html#storylink=rss", "content": "FRESNO - The former owner of a Modesto real estate firm pleaded guilty Monday to seven fraud charges in a deal expected to bring eight years in federal prison. <mark>James Lee</mark> Lankford, 74, who previously owned Century 21-Apollo Realty, signed the plea agreement in late August, but illness delayed a formal resolution until this week. He will be sentenced Jan. 27 by U.S. District Judge Anthony Ishii, who will decide the appropriate prison term. Lankford's mortgage scheme duped elderly homeowners from Modesto and Hughson and lenders over an 11-year period, costing them more than $7 million. \"Such fraudulent behavior will not go undetected nor will it go unpunished,\" said Michael P. Stephens, acting inspector general for the Federal Housing Finance Agency. \"We will continue to work with our law enforcement partners to dismantle such schemes and hold all involved accountable.\" The agency cooperated on the case with the Stanislaus County district attorney's real estate fraud unit and the FBI. Lankford's husband, Jon Vance Lankford, who formerly went by the last name McDade, on Sept. 16 pleaded guilty to one count of bank fraud in connection with the scheme and is expected to receive a one-day prison sentence. Bee staff writer Garth Stapley can be reached at SALES ASSOCIATE Hansen's Furniture Class A Drivers E.B. Bradley Co.> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}]