[{"articleID": "2017092520_00815126_W", "names": {"Elizabeth Davis": ["Q16195968", "Q29000529", "Q5362395"], "John Best": ["Q1101234", "Q1376523", "Q1699328", "Q329180", "Q47454915", "Q51521433", "Q51586082", "Q54556043", "Q6221772"]}, "date": "2017-09-25", "url": "http://www.richmond.com/news/local/education/richmond-area-students-attend-white-house-computer-science-announcement/article_01342c89-fe83-5b70-8cd4-933fdbd8c7a3.html", "content": "More than a dozen Richmond-area students were on hand Monday as the White House announced a $200 million per year commitment to computer science education in U.S. schools. Fourteen students from CodeRVA in Richmond and Chesterfield County traveled to Washington to witness the announcement, which is meant to expand access to computer science in schools. The money also aims to increase participation by women and underrepresented minorities in computer science. \"This funding will jumpstart efforts to ensure every student in every school has the opportunity to learn computer science as part of a well-rounded education,\" code.org, a national coding nonprofit funded by donations from the likes of Facebook and Microsoft, wrote in a statement. \"For advocates of increased access and diversity in CS, this is the culmination of years of momentum that began in classrooms, spread to entire school districts, and won the support of business leaders and elected officials globally .\" Got a news tip? Email tips and photos here. President Donald Trump signed the executive memorandum Monday afternoon. The memorandum directs the U.S. Department of Education to dedicate at least $200 million to computer science education while increasing the focus of computer science in K-12 classrooms, Axios reported. The announcement was originally scheduled for about two weeks ago, but was delayed by Hurricane Irma. Former President Barack Obama also pushed for computer science education with his Computer Science For All initiative, which called for $4 billion in funding for states. Congress didn't fund the initiative. The Richmond region's representation in Washington comes as computer science education in Richmond is on the rise. The four students at The White House from CodeRVA are in their first year at the new, experimental high school near The Diamond. The school, which has a staff of six and an enrollment of about 100, is focused on computer science and is experimental in nature with internships, year-round schooling and about a 50-50 split between online and face-to-face learning. The school also features a diverse population, with about 50 percent men and women, which is similar to the school's makeup of white students and minorities. Virginia became the first state in the U.S. to pass computer science education reform in 2016 where every student receives access to computer science education from K-12. CodeVA, a nonprofit based in Richmond that advocates for computer science across the commonwealth, helped create the legislation and was overjoyed by the news Monday. CodeVA is an affiliate partner of code.org. \"We're pleased to see the renewed commitment from the administration to computer science education. Virginia, which has the highest density of computer science jobs in the nation, has long been a national leader in making K-12 computer science education a priority,\" said Chris Dovi, the executive director of CodeVA, in a statement. \"Our governor and our General Assembly's commitment is clear by adding computer science as a core K-12 subject in out SOLs, and it's fitting that Virginia students are represented at the White House event .\" The Richmond-area students who went to the announcement were: Sean Reavis, Robious Middle School Samuel Raymond, James River High School Shalicia Pickett, CodeRVA Alanah Mayo, Providence Middle School Barbara Wyand, Providence Middle School Briana Jackson, Bailey Bridge Middle School Kyndal Townes, CodeRVA Krystal Rubio, CodeRVA Torrence Washington, <mark>Elizabeth Davis</mark> Middle School Richard Drum, Tomahawk Creek Middle School <mark>John Best</mark>, Manchester Middle School Kenneth Brake, Swift Creek Middle School Hunter Cumbie, Robious Middle School Jeffery Cumming, CodeRVA"}, {"articleID": "2010102804_00253892_W", "names": {"Aaron White": ["Q4662533", "Q4662534"]}, "date": "2010-10-28", "url": "http://dailyherald.com/article/20101027/sports/710289711/", "content": "custom reprints are a powerful and strategic way to share your article with customers, employees and prospects. the ygs group provides digital and printed reprint services for daily herald. complete the form to the right and a reprint consultant will contact you to discuss how you can reuse this article. why not the best second-seeded fremd became the final mid-suburban league team to say goodbye to the boys soccer season wednesday night in libertyville. the vikings (17-3-2) were eliminated after suffering a 3-1 defeat to no. 7 highland park (14-5-4), which struck for 3 unanswered goals in a seven-minute span to extend a memorable postseason run for retiring head coach dave bene. advertisement highland park meets host and no. 1 seed libertyville for a sectional championship on saturday morning. \"i guess i have to continue pinching myself because of this team,\" said a humble bene, who will step aside following the season after 33 years at the helm. \"we appeared to be in trouble after a very good start by fremd, and later, when they scored so quickly after the break. but we had that stretch in the second half when we scored those three quick goals, one of them a highlight goal from eoin moore, which really got us going .\" the vikings began by putting the pressure on the giants, and spurred by the speed and pace of front-runners lorenzo savino, matt burkhardt and yusuke kanada, along with a strong wind at its back, the msl champs appeared to be just a touch or two away from getting into the back of the net during the first quarter-hour. \"we didn't manage the wind very well tonight, and we let it affect how we played and highland park didn't,\" said fremd coach steve keller. a long, well-struck free kick from alex bochat forced giants keeper <mark>aaron white</mark> into a save at 10 minutes. later, spencer filosa and savino worked a nice 1-2 combination to allow savino to get free in close, only to watch talented sweeper konrad kucharski track back and clear off the end line. \"that no. 2 (kucharski) is a load back there, and easily one of the most impressive players along the back that i've seen all year long,\" said keller. moments after the break, the vikings took lead, courtesy a well-played corner sent low on the floor by brian hindle from the near flag to filosa, who on the turn, fired a smash off of <mark>white</mark> and into the net. disaster struck for fremd seven minutes later when an innocent looking corner serve from noah bloch appeared to knuckle on fremd keeper scott sutarik and slip through the senior's gloves and into the 6-yard box, where kucharski slotted the equalizer. what happened two minutes later might have been the beginning of the end for the vikings. that's when eoin moore unleashed a blast from 30 yards that buried itself into the back of the net to give the giants the lead for good. \"that was an amazing goal from eoin, and one that a senior player like he came through to score for us,\" said bene. playing from behind for the first time in weeks, the vikings conceded a costly third goal when they failed to clear a loose ball. freshman francesco moore was only to happy to steer in a shot from 20 yards. \"i'll give our guys credit for not giving up when we went down 2 goals, but we were chasing a highland park team which was energized and feeling very good about things after that third goal,\" keller said. the vikings stepped up the tempo in search of cutting into the giants' lead, and nearly did so if not for a brilliant save by <mark>white</mark>, who in full stretch to his left somehow stopped a shot by hindle at point-blank range. the giants dropped numbers, while fremd added another striker up top. and although it was one-way traffic heading in the direction of <mark>white</mark> and company, the vikings were not able to score again. custom reprints are a powerful and strategic way to share your article with customers, employees and prospects. the ygs group provides digital and printed reprint services for daily herald. complete the form to the right and a reprint consultant will contact you to discuss how you can reuse this article. telemarketers telemarketing -? telemarketers? evenings, schaumburg, will train $12/hr to start. 224-200-6427 part-time front desk / dental office - pt frnt desk huntley dental off. m-th 12-6pm. email/fax bayhilldental @ foxvalley.net / 847-669-6885. no calls. business workflow analyst - info/technology business workflow analyst bachelor's degree; exp. with enterprise workflow software; javascript & ms sql required; nautilus / onbase exp. preferred. resumes with salary reqs. to: fax: 847-265-5262. email: hr_dept @ myconsumers.org no phone calls. eoe collector - collections - stoneleigh recovery associates, an agency located in lombard is actively hiring experienced collectors as well as top performers in other industries. we offer competitive base pay, no cap commission structure and affordable bcbs heath insurance. if you are a positive and energetic person with the ability to meet or exceed goals call 630-282-5752 or email your resume to sfuernstahl @ stoneleigh.biz musical theatre voice instructor - musical theatre voice instructor-degree required in related field with previous voice coaching and musical theatre experience. must have a passion for teaching children. classes run tuesdays and wednesdays beginning 9/14 thru 12/15 from 4:00 -7:00 p.m. with possible continuation of the program throughout the year, to send resume or further inquiries contact: lori norton at inorton @ nbparks.org or northbrook park district 3323 walters ave. northbrook, il 60062 part time tractor trailer driver - driver's need extra cash for the holidays, part time drivers needed. must be 23 yrs. old, 2 yrs of recent verifiable exp. with knowledge of city and suburbs for deliveries, clean mvr and criminal history. we can offer great hourly pay with daily overtime, flexible schedules including friday pm's, saturday and sundays and more. call 877-219-5270 to apply. eoe pharmacy technician - now hiring pharmacy technicians in mount prospect, il. you will collaborate with our pharmacists to provide the exceptional care & expert support that our customers have come to rely on. every day you will be engaged in valuable work that is helping to transform the health care industry. -1 year of pharm tech exp. - current/active il pharm tech license. - prescription entry exp. to learn more please visit: www.caremarkpharmtech.com job id #23877br customer service rep - 4234566 - customer service repre - sentative: the northbrook park district seeks a motivated part-time customer service representative. this position is responsible for answering phones, data entry, cash handling, facility supervision/monitoring, filing, copies and other various office duties as assigned. must possess strong customer service/computer skills (microsoft office); class registration software experience a plus. a high school degree (or equivalent) with experience working in a fast-paced environment required. approximately 20 hrs. / wk. hours must be flexible including days, nights, weekends and occasional special events. $9.30 / hr. submit completed employment application, letter of interest, resume and list of references to: tgreene @ nbparks.org or tiffany greene, npd sports center, 1730 pfingsten rd., northbrook, il 60062. no phone calls please."}, {"articleID": "2013090406_00060927_W", "names": {"Pat Buchanan": ["Q149127", "Q48700522"], "John Hawkins": ["Q19522517", "Q22563641", "Q30122693", "Q47347909", "Q6238289"], "John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "John Kerry": ["Q22316", "Q6242998"], "Michael Barone": ["Q16197964", "Q19865861", "Q6828446"]}, "date": "2013-09-03", "url": "http://townhall.com/news/politics-elections/2013/09/03/ap-interview-world-bank-head-looks-at-lebanon-aid-n1690583", "content": "America: Yeah, Immigration Reform Probably Won't Happen This Year | Katie Pavlich Bloodbath: 40,000 Union Members Leave AFL-CIO Over Obamacare | Katie Pavlich Boehner: I Support The President's Call For Action on Syria | Katie Pavlich Unintended Consequences | Thomas Sowell Book: State Department Knew Benghazi Raid Was Terrorist Attack Within Minutes | Guy Benson New Polls: Americans Strongly Oppose Syria Intervention | Guy Benson The Politics of Syria: Does Obama Have the Votes? | Guy Benson WASHINGTON (AP) - The World Bank president says his staff is doing a rush assessment of the impact of the Syrian conflict on Lebanon to prepare the ground for a new wave of international aid. Jim Kim told The Associated Press in an interview on Tuesday that the Lebanese government asked for the quick assessment and the World Bank made a \"very intensive effort\" to get it done in a few weeks. It will be presented during a Sept. 25 meeting of an international support group for Lebanon at the United Nations General Assembly later this month. Democrats Don't Want to See Obama \"Shamed and Humiliated on the National Stage\" Editor-In-Chief of Mises Institute in Canada Advocates \"Slut-Shaming\" WaPo Editors: DOJ Wants to Keep Poor Minorities in Low-Performing Schools New Polls: Americans Strongly Oppose Syria Intervention Pledge of Allegiance on Trial in Massachusetts Majority Vote: Against Federal Involvement in Marijuana Report: Reid Has Votes For Military Resolution in Syria Get Ready for \"Choice: Texas'--The Abortion Video Game Book: State Department Knew Benghazi Raid Was Terrorist Attack Within Minutes No Syrian War to Save Obama's Face! | <mark>Pat Buchanan</mark> Why France is Suddenly America's Best Friend For the Record, or: The Art of Airbrushing History The Wrong Target on WMDs | Mona Charen The Real Heart of the Matter | Marvin Olasky The Weakened President | Cal Thomas Unintended Consequences | Thomas Sowell 5 Reasons Not To Bomb Syria | <mark>John Hawkins</mark> The President Must Personally Make His Case for War Oregon bakery closes doors after state investigates over refusal to cater same-sex wedding Top House Dem: If Congress opposes Syria intervention, Obama must stand down Two new polls: Heavy public opposition to U.S. strikes in Syria <mark>John Bolton</mark> on Syrian resolution:\" I would vote no \"<mark>John Kerry</mark>, just thinking out loud: I can't rule out boots on the ground if Syria implodes <mark>Kerry</mark> Doesn't Want Boots on the Ground Option Off the Table United Nations: Attack on Syria Would be Outrageous War Crime iPhone/Android Apps About Townhall.com Townhall.com is the leading source for conservative news and political commentary and analysis. Townhall is packed with breaking news headlines, political news, and conservative opinion with Townhall columnists including Ann Coulter, Michelle Malkin, <mark>Michael Barone</mark>, Star Parker, Dennis Prager, Thomas Sowell, and many more of your favorite conservatives. Political cartoons full of satire and political humor from editorial cartoonists including Michael Ramirez, Glenn McCoy, and Henry Payne. Townhall.com also features the latest news videos and pictures on the latest political hot topics including health care reform, the economy, immigration, government tax, President Obama, Sarah Palin, Mitt Romney, Herman Cain, Ron Paul, Iraq, immigration, politics, gay marriage laws, and many more big news issues."}, {"articleID": "2019010920_00491250_W", "names": {"David O'Sullivan": ["Q3018548", "Q5238159", "Q5238161", "Q5238163"]}, "date": "2019-01-09", "url": "https://www.npr.org/2019/01/09/683552107/eu-group-blasts-harmful-white-house-approach-to-trans-atlantic-relations?utm_medium=RSS&utm_campaign=national", "content": "Europe EU Group Blasts \"Harmful' White House Approach To Trans-Atlantic Relations Facebook Twitter Flipboard Email January 9, 2019 3:00 PM ET Daniella Cheslow Enlarge this image <mark>David O'Sullivan</mark>, who heads the EU Mission to Washington, D.C., speaks in Brussels in February 2014. Yves Logghe/AP hide caption toggle caption Yves Logghe/AP <mark>David O'Sullivan</mark>, who heads the EU Mission to Washington, D.C., speaks in Brussels in February 2014. Yves Logghe/AP A European Union legislative group has sent a letter of protest to members of the U.S. Congress blasting\" the increasingly harmful approach from the White House \"to relations across the Atlantic. The letter came after news reports revealed that the State Department had quietly downgraded the status of the EU's Mission to the U.S., making it an international organization, rather than a national delegation. The EU's ambassador in Washington, <mark>David O'Sullivan</mark>, was not notified of the change in status, but he did notice that he hadn't been invited to certain affairs in recent weeks, the German broadcaster Deutsche Welle reports. It became apparent at the state funeral of the late President George H.W. Bush in December 2018. Prior to the change, <mark>O'Sullivan</mark> would have been among the first 20 or 30 ambassadors to be called up, in line with his seniority as a diplomat serving since 2014. DW reports he was called up last .\" This is no way to treat partners, \"the letter notes .\" Such moves play into the hands of rival global powers and can only lead to greater fragmentation rather than much needed increased cooperation. \"National Security\" They Conveniently Forgot To Notify Us': EU Diplomat Downgraded In D.C.. The letter was signed by European Parliament members Christian Ehler of Germany, Jeppe Kofod of Denmark and Marietje Schaake of the Netherlands. They are the chair and two vice chairs, respectively, of the parliament's Delegation for Relations with the United States of America. \"We've seen a series of very, very confrontational and frankly insulting...approaches from the Trump administration,\" Schaake tells NPR. \"And now on top of that, the status of the EU delegation in Washington has suddenly been downgraded without the EU even being informed ....That really puts the EU last in line, behind all other countries. And I think it is absolutely necessary that the new Congress speaks out against this .\" Schaake says she has written to Congress on subjects such as net neutrality, but this is the first time the three delegation leaders have issued a joint appeal to U.S. lawmakers. She says the letter was sent to newly minted House Speaker Nancy Pelosi, D-Calif ., as well as every other member of Congress. Pelosi's office did not respond to NPR's request for an interview. The U.S. State Department also did not respond to requests for comment. Relations between the EU and the U.S. have been strained during President Trump's term in office. Europe Trump's Criticisms Of NATO Not Apparent As It Holds Largest War Games Since Cold War Brussels has bristled over U.S. tariffs on European exports, slapping retaliatory duties on American motorcycles, bourbon and other goods. The White House has withdrawn from the Iran nuclear deal, which the EU remains committed to, and has announced that the U.S. plans to pull out of the Paris climate agreement. At a NATO summit in July 2018, Trump berated European countries for not spending more on their military defense--although the U.S. recently participated in the largest war games with NATO since the Cold War, as NPR has reported. Some European countries are trying to bolster ties with the U.S.. In October, Germany announced a year-long initiative called Wunderbar Together that will feature about 1,000 events in all 50 U.S. states. In launching the program, Germany appealed to the heavens--summoning a greeting from the first German commander of the International Space Station, Alexander Gerst, who said, \"A strong relationship between both sides of the Atlantic is fundamental for successful cooperation--be it on Earth or in space .\" Schaake of the European Parliament says she sees the relationship between her bloc and the U.S. as \"a relationship ending badly .\" \"The EU still believes we should stay together but the U.S. partner is, you know, maybe looking around elsewhere,\" she says. \"I wish the Trump administration could see that a strong transatlantic relationship is in the American self-interest .\" Ambassador <mark>O'Sullivan</mark> has not publicly commented on his downgraded status. His Twitter account still refers to him as the EU's ambassador to the United States, though technically the State Department now considers him the head of a delegation. Recently, <mark>O'Sullivan</mark> tweeted about how the U.S. is the largest supplier of soy beans to the EU. And he pointed to a report that his bloc is stable: \"Happy to note we are very much alive and kicking in 2019!\" NPR International Affairs Correspondent Jackie Northam contributed to this report. Marietje Schaake <mark>David O'Sullivan</mark> European Union Congress Facebook Twitter Flipboard Email"}, {"articleID": "2012110523_00050245_W", "names": {"Scott Wilson": ["Q16194870", "Q16225692", "Q39073743", "Q3952879", "Q41446754", "Q51216278", "Q718135", "Q7437523", "Q7437524", "Q7437525", "Q7437528", "Q7437529"]}, "date": "2012-11-05", "url": "http://huffingtonpost.com/2012/11/05/the-walking-sarah-wayne-callies_n_2077624.html", "content": "\"the walking dead' sarah wayne callies talks shocker in season 3's\" killer within' the huffington post | by maggie furlong posted: 11/05/2012 2:44 pm est updated: 11/05/2012 3:10 pm est reddit stumble get tv alerts: sign up react: amazing inspiring funny scary hot crazy important weird follow: video, television, tv spoilers, interview, irone singleton, maggie furlong, sarah wayne callies, the walking dead, the walking dead deaths, the walking dead killer within, the walking dead lori death, the walking dead season 3, the walking dead t-dog death, tv news \"the walking dead's\" latest casualty sounds off \"the walking dead\" isn't the kind of show that shies away from killing off main characters, but two main character deaths in one episode? a lot of fans were left shocked after this week's episode, \"killer within,\" and for good reason. warning: spoilers ahead! if you have not seen \"the walking dead\" season 3, episode 4, \"killer within,\" proceed with caution. with t-dog (irone singleton) getting torn to shreds by walkers and the group otherwise occupied with securing the prison once again, lori grimes (sarah wayne callies) finally had a redemptive moment, making the heroic but difficult decision to give her own life to save her baby--and to have her ultimate fate sealed by her young son carl (chandler riggs). sarah wayne callies spoke to a group of critics the morning after \"killer within\" aired, all about lori's death. keep reading for her take on the birth scene and leaving the show (\"it felt like the lost boys losing wendy. that crew and i are really close,\" she said). plus, find out what lori's death will mean for the larger group, and also when we'll find out the sex of the baby and how we'll know who the dad really is. on lori being the hero sarah wayne callies: \"i think the lori death is very unique among the ones we've had on\" the walking dead' because it's one that she's chosen. it's an interesting tone because it's not surrounded by quite the same level of crisis and panic, althogh she's clearly in a situation where things are going to go badly. \"on carl doing the dirty work sarah wayne callies:\" it was pin-drop quiet throughout that whole scene...there was a level of concentration and respect and focus from all 80 people who were there that was remarkable. it was also significant that the entire cast showed up. i finished the scene and i came out, and there was almost every single member of our cast that had just come to sit and watch and be there. it was difficult, i'll be honest. chandler and i didn't really talk at all the week that we were shooting that because we couldn't really look at each other without losing it. i love that kid. \"saying goodbye to lori sarah wayne callies:\" i loved lori. i love lori. she's one of those characters that i think will live in my heart for a long, long, long, long time. i learned so much from her. [in] one of my first conversations with frank [darabont], we agreed that we wouldn't do the tv version of this. lori was not going to be some big busted, beautiful woman with flowing perfect hair who was standing by her man. we talked about doing the ugliest, dirtiest, most dangerous and sometimes unlikable version of this that we could. it was so exhilarating to be able to dig deep into the darkness of motherhood and the darkness of marriage...to work on a production that had the courage--even though some fans kicked up a fuss about it--to have the courage to say, \"we're going to tell this story a way it's never been told before' is remarkable. it's the best work i've ever done on camera, and that's because the material was so strong. it's an experience unlike anything i've ever had, and i've learned so much from it. i love lori so much. her passion, her fire, her lack of vanity...[laughs] i love that woman and i am going to miss her .\" how it almost didn't happen...sarah wayne callies: \"frank and i talked a lot about the necessity of lori dying, and we fought about it. glen [mazzara] and i talked about that scene a lot--what pieces had to be in place for lori, for carl and for rick. in a way it was an intimate process, because glen had lost his mother shortly before they started writing the season...the death of shane. the death of lori. those, to me, were very difficult things to get around. i had spoken to frank about that at a certain point and he goes,' i don't need to kill you .' and i said,\" due respect, sir, yes you do .' [laughs .] he said, \"i've never had a leading lady argue her way off a show .' and i said,\" in the books, rick goes nuts because his wife died. and i think the way he goes nuts is pretty cool, and i think you're gonna do that at some point, so know that i'm a big girl when you make that call .' i can't wait to see those episodes afterwards and see what happens. \"who's the daddy? sarah wayne callies:\" the only definitive way to tell in a world where there's no paternity test would be if the baby has blue eyes, then the baby is rick's...both rick and carl have blue eyes, and it's a recessive trait. shane had brown eyes, and lori had brown eyes. if it's a brown-eyed baby, there's no way to know. \"is it a boy or girl? sarah wayne callies:\" i believe you'll find out in the next episode. but yeah, it's either a girl or a boy. [laughs .] \"on rick without lori sarah wayne callies:\" it's important for what happens to rick later in the season that he replay that scene between the two of them at the end of episode 2, over and over in his head and go, \"why didn't i tell her i loved her? why didn't i say' i forgive you'? why didn't i say\" i'm sorry'? \"tell us: were you shocked by the deaths in this week's episode?\" the walking dead \"airs sundays, 9 p.m. et on amc. loading slideshow the walking dead season 3 cast (l-r) lori grimes (sarah wayne callies); carl grimes (chandler riggs); daryl dixon (norman reedus); carol (melissa suzanne mcbride); t-dog (robert\" irone' singleton); beth greene (emily kinney); hershel greene (<mark>scott wilson</mark>); rick grimes (andrew lincoln); maggie greene (lauren cohan); glenn (steven yeun); the governor (david morrissey); michonne (danai gurira) and andrea (laurie holden) - photo credit: frank ockenfels/amc the walking dead season 3, episode 1 stills (l-r) daryl dixon (norman reedus), maggie greene (lauren cohan), t-dog (robert \"irone' singleton), glenn (steven yeun) and rick grimes (andrew lincoln). the walking dead season 3, episode 1 stills (l-r) rick grimes (andrew lincoln), t-dog (robert\" irone' singleton), daryl dixon (norman reedus), glenn (steven yeun) and maggie greene (lauren cohan). the walking dead season 3, episode 1 stills maggie greene (lauren cohan). the governor the governor (david morrissey) merle merle (michale rooker). rick grimes rick grimes (andrew lincoln). michonne michonne (danai gurira). the walking dead season 3, episode 1 stills your friendly jail zombie. the walking dead season 3, episode 1 stills your friendly neighborhood zombie. michonne & friends michonne (danai gurira) also on huffpost: contribute to this story: send us a tip send us a photo or video suggest a correction follow tv like 11k get alerts"}, {"articleID": "2012070921_00032770_W", "names": {"Jamie Brooks": ["Q15999786", "Q16200364", "Q2668347"]}, "date": "2012-07-09", "url": "http://al.com/entertainment/index.ssf/2012/07/mountain_brooks_vino_restauran.html", "content": "al rabiee, owner of vino restaurant in mountain brook. mountain brook, alabama - vino restaurant in english village has completed the addition to its patio and plans to celebrate wednesday, july 11, with a benefit for the american diabetes association and children's miracle network hospitals. the event supports the campaigns of the young professionals of birmingham's rhett mccreight and <mark>jamie brooks</mark>, who are raising money to support two of their favorite charities. vino will donate 25 percent of all sales from wednesday's event to the charities. hours are 5:30 to 8:30 p.m. \"i am so proud of the success we have seen here at vino thus far, and now being able to unveil the new patio and bar while supporting two amazing charities with this event is a huge moment for us,\" vino owner al rabiee said in a press release. mccreight, a sales representative for business electronics, and <mark>brooks</mark>, a public relations coordinator and social media specialist at style advertising, are among 10 nominees competing for the titles of mr. and ms. young hot birmingham professional, which goes to the candidates who raise the most money for their respective charities. mccreight's charity is the american diabetes association's step out: walk to stop diabetes, a nationwide campaign to raise money for diabetes research and education. <mark>brooks</mark>' charity, children's miracle network hospitals, supports 170 children's hospitals across north america, including children's of alabama in birmingham. vino, which shares space with gallery 1930 on cahaba road in english village, opened last september, with seating for about 50 to 60 diners at the tables and bar inside. with the expanded and now partially covered patio, vino can now seat nearly 150 diners, according to the release. the addition includes an outdoor bar. the restaurant features both mediterranean and italian cuisine, as well as an extensive wine menu. dinner hours are 4 to 11 p.m. mondays through saturdays. to see a menu, go here."}, {"articleID": "2016082712_00594352_W", "names": {"Peter Thiel": ["Q39141069", "Q705525"]}, "date": "2016-08-27", "url": "http://thestar.com/news/world/2016/08/27/who-would-miss-the-daily-mails-patent-misogyny-mallick.html", "content": "World Who would miss the Daily Mail's patent misogyny?: Mallick The lawyer that toppled Gawker is now targeting the for repeating Melania Trump rumours. But don't start cheering for the death of the Daily Mail just yet. A lawyer for Melania Trump said Monday he has informed several news organizations, including the Daily Mail, that they could face legal action for publishing articles that Trump contends were defamatory. (ERIC THAYER / The New York Times) ByHeather MallickColumnist Sat ., Aug. 27, 2016 The lawyer behind the Hulk Hogan sex-tape lawsuit that bankrupted Gawker is planning to sue Britain's Daily Mail on behalf of Melania Trump for repeating \"100 per cent false\" rumours that she worked as an escort in the 1990s. It was a story about those confused years when she was striving to reach American shores. It's a strange lawsuit because the lawyer, Charles Harder, who was backed by billionaire <mark>Peter Thiel</mark> in the Gawker case, said the Mail story \"exceeds all bounds of...human decency .\" Thanks to Trump's husband, I no longer know what those bounds are. Thrashingly, chaotically free speech leaves many orphans in its wake. The Daily Mail exceeds moral bounds often. After all those \"what we lost when we lost Gawker\" journalistic analyses--the answer is not a whole lot, frankly--I wonder what we'd lose in the Daily Mail were it to close, which I assume DMG Media will not permit. The thing is eternal; cockroaches will read it long after humans vanish. It's the only mainstream website I formally avoid as a health hazard--Twitter, you're next--but there remains something wonderful about it. Its genius is that it is unfailingly interesting (a quality that Canadian newspapers will evade unto death), I suspect because its editor, Paul Dacre, terrifies people. I get frightened all over again when I watch video of him at the 2012 Leveson inquiry into phone hacking. Dacre has said he \"would die in a ditch\" to defend a columnist's freedom of speech but as I typed his name, the knuckles vanished from my hands and appeared inside my fingers. The room grew cold; I could see my breath. The lead story on the Daily Mail's home page was a 30-kilometretraffic jam on the M5 motorway caused by police talking a suicidal woman off a bridge. So why did it take two hours to arrest her, the Mail headline asks angrily/chattily. Women. If they're not blocking traffic, they're a bloody smear on the public junctions, and take hours to clean up. Article Continued Below Oh no, they've sent columnist Katie Hopkins to the Calais \"Jungle\" migrant camp across the Channel in France. \"Calais is bandit country. Lawless. Ungodly .\" Note: partial sentences are every bad writer's spare change. They dispense them. One. By one. The Daily Mail offers the purest misogyny in existence, 4chan has nothing on them, and after two hours of study, dear readers, I've decided I don't like women much either. The Sidebar of Shame running down the right hand side contains one, two, oh 40 photos of us in action before I tired of counting because I am not aroused by strumpets who are all wrong for me. Action verbs flow: \"defends bikini body, puts on smoking hot display, flashes her pert derrière, flaunts her toned torso, showcases her ace figure, shines in gold nightie top, dies, shows off her taut tummy, opts for sexy look, puts on a leggy display, flaunts her peachy posterior, cries, struggles to contain her womanly curves .\" Shift eyes back to the news and scroll down the longest tale of woe you will ever know, it's like a dragon's tail or the surgical packing in a deep wound. Britain's economy is \"booming\" while Germany's is \"wobbling .\" Nearly three out of 10 babies in England and Wales are born to foreign mothers, over 75 per cent in parts of London with \"Poles overtaking Indians .\" Note: never trust Daily Mail stats. If you're a foreigner, 100 per cent of infants born in your hospital room will be yours. It all depends how you define \"parts of London .\" Seven stories on bloody migrants. Five foreigners drown all at once, which is suspicious. A child reaches puberty at age 6, which is concerning. A mysterious \"rock\" on the surface of Mars looks like someone's \"lost shoe,\" and a take-no-chances bomb squad blows up a pesto sandwich on London Bridge. Here's photos of a python vomiting up an entire antelope. Daily Mail fear alert: rubble, pythons, shortage of bungalows, old cookies. Daily Mail advice: DO rub Vaseline on your teeth/split ends/behind ears as it gives skin \"a dewy glow .\" DON'T blacken eye walking into rolling stepladder outside Marks & Spencer as staff will laugh at you and \"fallout will shake your faith in the mainstay brand .\" DON'T get drunk and wake up to find you bought a & pound; 30,000 bus on eBay. In literary news, Sue Townsend dies and Gabriel Garcia Marquez is admitted to hospital with a urinary tract infection (both died in 2014). Ask the Daily Mail doctor: Should I take turmeric pills for my arthritis? \"No .\" Daily Mail question: How long do YOU want to live for? The Daily Mail recipe is Freudian (sex, death), paranoia (bloody foreigners), disgusting personal ailments (people squeezing the unlikeliest things), wacky animals (mainly ferrets) and people who don't deserve nice things (foreigners). It's riveting. And that's the problem. Hours pass. Your head has gone nasty. I oppose censorship, sympathize with Melania Trump (imagine what the woman endures) and thanks to the Daily Mail, wish to insert myself into a large protective non-flammable glove away from the wider world. But I made that choice. I read the thing. Don't read it. But you will. Will you wish you still could?"}, {"articleID": "2014071523_00083985_W", "names": {"James Scott": ["Q18224055", "Q18816109", "Q21165400", "Q21165402", "Q21457653", "Q21516445", "Q2165229", "Q22280379", "Q29643568", "Q3025403", "Q3161395", "Q32947138", "Q38361537", "Q43910857", "Q54312478", "Q6138548", "Q6142856", "Q6142862", "Q6142863"]}, "date": "2014-07-15", "url": "http://whas11.com/news/crimetracker/Fegenbush-Lane-shooting-suspect-appears-in-court-bond-set-at-25K-267184411.html", "content": "Related: Coroner releases identity of man shot, killed on Fegenbush Lane add to reading list Shooting on Fegengush Lane View larger map LOUISVILLE, Ky. (WHAS11)--A Louisville man is behind bars Tuesday after a deadly dispute with his landlord. Anthony Jecker, 54, is suspected in the shooting death of 49-year-old <mark>James Scott</mark> Tolle inside his Manor Brook Apartment complex in the Norfolk neighborhood. Tolle's father told WHAS 11 News his son had been in a dispute with Jecker over his electric bill, totaling $58. When Jecker didn't pay it, Tolle cut off his electricity. Tensions only escalated from there. \"The neighborhood is just really shocked. Everybody around here is just freaking out,\" neighbor Mary Welch said. \"I'm just having a real hard time grasping that my friend, that I talk to everyday, on a daily basis killed somebody .\" Tolle died from a single gunshot wound to the chest. \"Sixty dollars ain't worth killing somebody for. Take them to court,\" Welch said. Instead, Jecker appeared before a judge Tuesday morning on charges of murder and tampering with evidence, after police said he attempted to dispose of the gun. The judge set his bond at $25,000 cash only, on the conditions he not speak to Tolle's family or carry a firearm. Print print Email Email this article | Tweet MORE MORE! X Digg Delicious Tumblr LinkedIn StumbleUpon Newsvine Reddit Pinterest Next article Couple arrested having sex on Chipotle roof in Deleware"}, {"articleID": "2015010716_00072723_W", "names": {"Andy Kerr": ["Q4760890", "Q4760892", "Q526409"]}, "date": "2015-01-07", "url": "http://www.packagingtoday.co.uk/news/newsnew-versatile-hot-stamping-foil-has-got-it-covered-4483945", "content": "New Versatile Hot Stamping Foil Has Got It Covered 7 January 2015 Email Jan 7 2015 New Versatile Hot Stamping Foil Has Got It Covered API Foils has developed a new more versatile, general-purpose matt pigment hot stamping foil. It offers both fine detail and broad area coverage across a wider range of applications than any other pigment foil previously available from API. The PG grade is the result of two years research and development and combines the best qualities of the company's legacy pigment foils UA and 432, delivering a number of improved product features. A better opacity means customers will achieve a sharper colour and better overall finish and a wider operating temperature window increases productivity by improving process times. In addition, by providing a well-defined colour range in just a single grade, it is simpler for customers to choose their preferred product as PG will cover the vast majority of applications. Says <mark>Andy Kerr</mark>, International Technical Support: \"This new range has been developed to make product selection far easier for our customers. We have developed just one grade for most general-purpose applications, which is available in 12 well-defined colours .\" The versatility of PG across so many applications together with its improved technical capability, means the customer can concentrate on the effect they want to achieve rather than get involved in technical considerations. Having such a grade also means that deliveries will be quicker and simpler. \"Suitable for both fine detail and broad area coverage, PG can be used on a wide range of substrates including self-adhesive labels, coated and uncoated paper and board plus a wide range of plastics and natural materials such as leather and wood. In fact it can be used on anything from ballet shoes to brake pads .\" Working in collaboration with Newfoil, based in Bolton, API is launching the PG grade to platen press stamping label manufacturers in the UK. Commenting on PG after initial customer trials, Steve Tonge of Dotaprint Labels said: \"This foil makes label printing so much easier, one foil that suits all substrates and even works when printing foil on foil .\" Janet Clarkson, Director of Newfoil says; \"Initial customer trials have produced some truly exceptional results and as the leading hot foil distributor in the UK, we welcome a foil that not only delivers high performance, versatility and reliability, but also provides an easy machine set up .\" The new PG foils are available in a well defined range of colours and complement the comprehensive range of products that we already offer to the labeling industry. \"PG has an easy release and excellent adhesion. Depending on the machine type and application, it typically has activation at 85oC with an operating temperature of between 100oC to 1500C. For best results it has a recommended top temperature of 170oC. The new foil has good resistance to water, plasticiser migration and to wines and spirits. It is non-toxic and meets stringent compliance and legislation across numerous industry standards worldwide. Manufactured in Livingston, UK, PG is available worldwide through the company's dedicated distribution centres. REXAM DEVELOPS BESPOKE CUT-OUT TAB FOR CARLSBERG BEER...KNOWLEDGESHARE LIVE IN DUBAI - INTERNATIONAL FORUM TO ADDRESS GLOBAL BEVERAGE CHALLENGES Packaging Today is a product of Global Trade Media, a trading division of Progressive Media Group Limited. © 2015, All Rights Reserved. privacy policy. In the latest update it explains what cookies are and how we use them on our site. To learn more about cookies and their benefits, please view our"}, {"articleID": "2015082417_00022238_W", "names": {"Lance O'Sullivan": ["Q16733903", "Q6483500"], "Richard Taylor": ["Q15052265", "Q19814900", "Q201470", "Q23073042", "Q334322", "Q54596833", "Q56553128", "Q630767", "Q712170", "Q7329401", "Q7329402", "Q7329404", "Q7329409"]}, "date": "2015-08-24", "url": "http://www.stuff.co.nz/taranaki-daily-news/news/71390094/Mayors-want-top-Kiwi-to-come-from-Taranaki", "content": "Mayors want top Kiwi to come from Taranaki HELEN HARVEY Last updated 16:10, August 24 2015 Sam Scannell South Taranaki mayor Ross Dunlop, left, New Plymouth district mayor Andrew Judd and Stratford district mayor Neil Volzke have joined together to encourage the region to vote for a Taranaki person to be New Zealander of the Year. Taranaki's mayors are pushing for the next New Zealander of the Year to be from their region. Mayors Andrew Judd, New Plymouth, Ross Dunlop, South Taranaki, and Stratford district's Neil Volzke, have challenged residents to make the 2016 New Zealander of the Year a Taranaki local. Previous winners of the New Zealander of the Year Award include Sir Stephen Tindall (2015), Dr <mark>Lance O'Sullivan</mark> (2014), Sir <mark>Richard Taylor</mark> (2012) and Sir Ray Avery (2010). Taranaki has had few mentions in those other big awards, the Queen's biannual honours, in recent years, receiving just three in 2014. With 2.4 per cent of the population and approximately 350 honours handed out annually, on a per capita basis Taranaki could expect to receive about eight honours a year. This has been blamed on the region's rural heritage and an attitude of \"just getting on\" with things. The homegrown New Zealander of the Year is said to be the ultimate recognition of people's service to New Zealand. And the three mayors are out to find the winner in Taranaki. Mayors see ordinary people doing exceptional things in the community every day, Judd said. \"Whether it's the volunteer, high-achiever, or someone who went the extra mile to help others--these are real people displaying real acts of kindness. These people are the pillars of our community. They represent the best of us and make Taranaki a much better place to live in .\" There are plenty of people in Taranaki who would be deserving recipients of the New Zealander of the Year Award, he said. \"It's time we honoured their deeds by showing the rest of New Zealand just how proud we are of them .\" Any member of the public can nominate an individual or community organisation for an award. Nominations for the prestigious award, and supporting categories, opened last month and will close on the September 30. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next News story: Taranaki Iwi Trust to finalise $70m settlement with Crown Taranaki Daily News Homepage"}]