[{"articleID": "2013060610_00025194_W", "names": {"Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"], "Jeff Mcdonald": ["Q21458890", "Q6174469"], "Tim Duncan": ["Q193020", "Q7803451"]}, "date": "2013-06-06", "url": "http://blog.chron.com/ultimaterockets/2013/06/james-parker-to-pit-enhanced-skills-since-07-nba-finals-meeting/", "content": "James, <mark>Parker</mark> to pit enhanced skills since '07 NBA Finals meeting LeBron James will get his chance at revenge on the Spurs after they knocked his Cavaliers out of the Finals in 2007. (AP Photo/Tony Dejak) By <mark>Jeff McDonald</mark> MIAMI - They met in a hallway in the catacombs of Cleveland's Quicken Loans Arena in the champagne-soaked moments following an NBA Finals sweep. San Antonio's <mark>Tim Duncan</mark>, mere minutes into life as a four-time champion, embraced LeBron James, thanked the 22-year-old Cavaliers star for allowing him at least one more title, and then made the surest prediction ever. \"The league is going to be yours soon,\" <mark>Duncan</mark> told James. Six years later, that vision has come to fruition. James is in Miami now. He has a better supporting cast than in Cleveland, not to mention four NBA Most Valuable Player awards. He is on the cusp of a third consecutive appearance in the Finals since joining the Heat in 2010, seeking a legacy-building second straight championship. \"Knowing the player that he was then and the trajectory he was on, I had no doubt he would be back here,\" <mark>Duncan</mark> said Wednesday. \"Driving their success' There was another young star on the rise in Cleveland that night, and you didn't have to look hard to spot him. He was the guy in the Spurs' locker room, cradling and kissing his Finals MVP trophy like a newborn baby. <mark>Tony Parker</mark> was 25 then, a two-time All-Star, and nowhere near the player he would become. As James again takes the NBA Finals stage, he will find a familiar face - but a different player - standing in his way. Having supplanted <mark>Duncan</mark> as the team's centerpiece, the 31-year-old <mark>Parker</mark> has emerged as the propelling force behind the Spurs' bid to reclaim a championship after a six-year dry spell .\" He was the best player in the Western Conference playoffs each game, \"Miami coach Erik Spoelstra said of the Spurs' All-Star point guard .\" He was driving their success. \"Like James, <mark>Parker</mark> used failure as fuel for self-improvement. Unlike his Miami counterpart, <mark>Parker</mark> didn't have to change addresses to do it. An Olympic challenge After being outplayed by Memphis' Mike Conley in a first-round flameout in 2011, <mark>Parker</mark> returned to France to lead his national team to an Olympic berth. It was in that Olympic qualifying tournament that today's incarnation of <mark>Parker</mark> was born. When <mark>Parker</mark> returned stateside, Popovich challenged him to apply the same fire and leadership to his day job .\" I took it as a challenge to improve my game and get better every year, \"said <mark>Parker</mark>, who is averaging postseason career highs in points (23) and assists (7.2) per game .\" As the responsibility and the ball came into my hands, I try to do more and try to deliver. \"G1: at Miami8 today G2: at Miami 7 Sun. G3: at San Antonio 8 Tue.. G4: at San Antonio 8 June 13 James, <mark>Parker</mark> to pit enhanced skills since '07 NBA Finals meeting"}, {"articleID": "2012081606_00062052_W", "names": {"John Mills": ["Q16201718", "Q17402961", "Q19520598", "Q24257027", "Q27915240", "Q48810303", "Q54901208", "Q58209206", "Q6248833"], "A. B.": ["Q50332866", "Q50391364"]}, "date": "2012-08-16", "url": "http://elections.peacefmonline.com/politics/201208/129449.php", "content": "the immediate past attorney general and minister for justice, martin amidu, has raised legal questions and legitimacy regarding the selection of president john dramani mahama as the party's flagbearer pending an endorsement at congress. the ndc last month announced at a national executive committee meeting that it had settled on the new president as its leader pending a confirmation by congress on august 31. the decision has, however, ruffled the party's running mate for the 2000 general elections. citifmonline.com has in possession a copy of mr. amidu's latest article where he stated the party's decision breaches both the 1992 constitution of the republic of ghana and the ndc's constitution. he cautioned that the party risks suffering the same fate it suffered when then vice president <mark>john mills</mark> was unilaterally selected at the infamous swedru declaration as its flagbearer for election 2000. below is the full article: constitutional and political challenges on the demise of the president of ghana and political impunity: by martin <mark>a. b.</mark> k. amidu political parties under the 1992 constitution are constitutional and public institutions deriving their power and authority from and under the constitution. this is amply captured by the letter and spirit of article 55 of the constitution. it is because political parties are public and not private institutions under the constitution that the constitution guarantees participation in political party activities to all citizens of voting age (18 years and above) and enjoins that every such citizen has the right to participate in political party activity intended to influence the composition and policies of the government (see article 55 (2) and (10)). as a bulwark against tyranny and oppression the constitution further guarantees in clause (5) of article 55 that: \"(5) the internal organization of a political party shall conform to democratic principles and its actions and purposes shall not contravene or be inconsistent with this constitution or any other law .\" the sitting vice president on 24th july 2012 naturally and properly succeeded the deceased president as mandated by the constitution for the balance of the remaining term of the president. the sudden demise of the president as the ndc's presidential candidate who had been duly elected at a properly convened and contested congress at sunyani in july 2010 has, however, left and raised national constitutional and ndc constitutional issues as to the succession to the presidential flag bearer candidacy of the ndc for the 2012 elections. firstly, just a day after the unfortunate demise of former president <mark>mills</mark>, the general secretary of the ndc (in what i consider to be an indecent haste in the midst of the mourning atmosphere that had engulfed the nation,) issued a statement allegedly on behalf of the nec informing members [i suppose all members of the ndc] that the \"his excellency john dramani mahama becomes the leader of the party under article 26 (1) of the ndc constitution which states that,\" the president of the republic who is a member of the party is the leader of the party when in government .' \"what this statement suppressed is the fact that when article 26 (1) of the ndc constitution is read within both the context of that article and the ndc constitution as whole, the statement of the nec issued by the general secretary could be inconsistent with the letter and spirit of the ndc constitution. it could also be inconsistent with and in contravention of article 55 (5) of the 1992 constitution. does article 26 (1) of the ndc constitution standing and read alone apply to a sitting vice-president who was never elected at the previous national congress as the flag bearer that contested the elections that brought the government referred to in the sub-clause (1) to power but assumes office by virtue of the inevitable death of the sitting president under article 60 (6) of the 1992 constitution? does article 26 (2) of the ndc constitution which states that:\" where the president of the republic is not elected a flag bearer, a person elected as flag bearer of the party at any time prior to the election is the leader of the party \"not reinforce the fact that the president referred to in article 26 (1) is a president who had been elected a flag bearer as professor <mark>mills</mark> had been at the ndc congress of 2006, for the 2008 presidential elections, and in july 2011 for the 2012 presidential elections? will the nec not be accused of unconstitutional acts and conduct in equating the right of the sitting vice-president to assume office as the president of the republic for the unexpired term of the office of the deceased president with effect from the date of his death with a right to assume the leadership of the party without any previous endorsement by the national congress at its previous meeting? does the selective and out of context interpretation of article 26 (1) of the ndc constitution not send signals of arbitrariness and impunity when the nec takes such an important decision and imposes it on the generality of the citizens of ghana who have a right of expectation under the 1992 constitution and the ndc constitution that, in running the affairs of the party, the nec will observe internal democratic principles? are there any lessons to be learnt from the consequences of the swedru declaration and the subsequent fracture of the ndc in the 2000 presidential elections leading to the formation of the national reform party? are there further lessons to be learnt from the rapture from the korforidua ndc congress which also led to the formation of the democratic freedom party? does the ndc have to court destructive internal conflict and disunity by handling the transition to the election of a new flag bearer to represent the party at the 2012 election in a manner that may raise disaffection and dissatisfaction in some members as experience has shown? it would appear that those in control of the ndc, for the time being, were bent on excluding other bona fide members of the party who may wish to lay democratic claims to who becomes the next flag bearer of the party by excluding them even before the mortal remains of the demised president were interred. it is also symptomatic of how political party elites in ghana and africa worm their way into the confidences of persons perceived as likely to ascend to power positions for purposes of eventual personal economic gain at the expense of the generality of the mass of party members and the nation which every president swears to serve under the constitution. it is with the lense of this attitude of the self serving political elite, as distinguished from the nationalistic and democratic political elite, that i see the attempts by those persons falling over themselves to ignore the letter and the spirit of the ndc constitution to give the transitional president the impression that it is right to anoint him as leader and flag bearer pending acclamation by the national congress. like the congress of the former communist states, the ndc national congress is being called now on 31st august 2012 just to endorse the candidature of one person who has ascended to the balance of president <mark>mills</mark>' term as president because of a force majeure. yet we are being told that for others the demise of the late president is not a very welcome and prayed for blessing to be exploited for personal power and glory. secondly, the constitution of the ndc provides for the election of a presidential candidate in article 44 thereof. article 44 (a) appears to have envisaged the immortality of the ndc presidential candidate once elected by the congress as the highest decision making body of the party. consequently, it provides for the election of the presidential candidate at least 12 months before a national election date in the case where the party is in power, and at least 24 months in the case where the party is outside government. the rest of article 44 governing the election of the presidential candidate of the ndc envisages the democratic nomination of candidates, balloting, and run-offs as the only legitimate procedure for the choice of a presidential candidate and remain in full force and effect. but article 44 (a) only governs the power of the nec to decide the date and venue for the election of the presidential candidate and requires that they do this within the periods stipulated. it does not prohibit an abridgement of the period in exceptional circumstances such as the death of a flag bearer before general elections! but as a result of the death of the sitting president and the mandatory assumption of that office by the vice president, the nec decided that there was no provision in the ndc constitution which deals with the election of a presidential candidate following the death of one elected within the periods stipulated in article 44 (a). they made a decision to endorse the new president as the leader of the party, and the flag bearer in waiting allegedly pursuant to article 50 of the ndc constitution on the residual powers of the nec to make regulations only. the requirement that political parties be governed by internal democratic principles necessarily requires that the regulations to be made by the nec will be published for discussion by the various branches and organs of the party before they are enacted and published as valid and binding regulations. the right of citizens to join and participate in political party activities would be set at naught if the nec could just meet in a room, enact constitutional regulations altering stipulations in the constitution without due process and publication of same to its members. indeed the spirit of the 1992 constitution requires political parties to furnish to the electoral commission copies of such constitutional regulations just as they furnish the electoral commission with a copy of their constitution and amendments thereto. the letter and spirit of the 1992 constitution, particularly article 55 (5) thereof and the ndc constitution, article 44 (a), require that democratic elections be held to nominate the presidential candidate of the ndc for election 2012. the fact that the elected presidential candidate died before those elections does not change the spirit in which the national congress enacted such a democratic constitutional provision. in any case wherein lies the power of the nec to amend article 44 (b) to (g) of the ndc constitution and impose in advance a presidential candidate on the party, however styled or called in the interim? we are just a few days to the new date of 31st august 2012 when the ndc national congress will be convened in kumasi, the ashanti regional capital, at great party and public expense to endorse the transitional president as the only choice of the strongest political elite, for the time being, in control of the ndc as the party's flag bearer for the 2012 elections. i am not aware of any constitutional regulations pursuant to article 50 the nec has enacted to take care of whatever omissions or perceived gaps there are in the ndc constitution. the letter and the spirit of the 1992 constitution and the ndc constitution are both binding on the ndc and demand that citizens who are members of the party are treated by the strongest political elite in control of the party, for the meantime, with utmost respect by making requisite information available to them within a reasonable time before the national congress. any political party that does not allow its members access to critical information and rules that will affect the exercise of their democratic right of choice of a flag bearer in a democratic and transparent manner in accordance with article 55 (5) of the constitution will be acting in a manner inconsistent with and in contravention of the 1992 constitution, and the party constitution. i speak out now so that i may not be counted among what self serving elite politicians take the mass of the national population for - a herd that unquestionably swallows what ever is put out there in the name of the party and be led by the nose. reasoned argumentation is the only way by which group dynamics can be sustained in any political party respecting the rights of its members, the rule of law, democracy and liquidating the impunity of what marx webber calls the controlling political elite. comments (): post your comments> vice president amissah-arthur interacts with ndc loyalists in kumasi staying united is not the same as staying unanimous - prez mahama"}, {"articleID": "2013110606_00066259_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"]}, "date": "2013-11-05", "url": "http://examiner.com/article/missing-mississippi-family-that-disappeared-after-fiery-crash-found-dead", "content": "Mississippi family of three seemed to vanish into thin air following a fiery car crash, an exhaustive search was conducted to find them. On the morning of Nov. 5, 2013, authorities learned the fates of Atira Hughes Smith, 30, her son Jaidon Hill, 7, and her husband, Lattery Smith, 34, according to the New York Daily News. Each member of the family was found shot to death in an abandoned house near where their SUV was found, a relative reportedly told ABC News. Authorities believe they were murdered prior to the crash, and that the vehicle was burned to destroy any evidence of a crime. Timothy Burns led investigators to the bodies and was subsequently arrested. WAPT, \"The sad part is, we have a young child that has lost his life and he is not going to be able to grow up and be the person he should have been, and that is sad .\" WJTV, Atira's mother, Judith Hughes, said her daughter called just after midnight on Saturday to say she was leaving town for several days, but would not say why before the call was cut short. Before the conversation ended, Judith asked, \"At this late time of night?\" and Atira replied that something had come up. She then asked if everything was OK, and Atira told her everything was fine, reports WJTV. Judith told the local news media outlet that Jaidon, her grandson, lives with her, but was staying with Atira for the weekend. She offered to pick him up, but Atira told her the family was already on the road and he was asleep. That was the moment Atira's cell phone seemed to cut out. When Judith tried to call Atira back, the call was immediately sent to voice mail. The Daily News reports that according to Atira's family, early Saturday morning someone attempted to use the victim's ATM cards, but did not have the PIN code, so the effort was unsuccessful. Anyone with information regarding the case is urged to call Crime Stoppers at 601-355-8477, the Copiah County Sheriff's Dept. at 601-894-3011, or the FBI at 601-948-5000. Entire family mysteriously disappears after Mississippi car crash Baby girl dies after intoxicated mother passes out while breastfeeding Amanda Knox trial: Meredith Kercher DNA not found on knife in new tests LAX shooter, Paul Ciancia, could face death penalty, say authorities Rebecca Sedwick case: Mom of girl accused of bullying faces child abuse charges Rebecca Sedwick suicide: Boyfriend talks, says he didn't know about bullying Man accused of beating <mark>Adrian Peterson</mark>'s son has prior domestic abuse indictment (Photos) Man charged in relation to beating death of NFL star <mark>Adrian Peterson</mark>'s son Baby Kate case: New evidence leads to murder charge against missing girl's dad (Video) Amanda Knox case: Untested evidence on butcher knife may be factor in new trial Bryce Laspisa case: Parents of missing California student plan Illinois vigil 31-year-old woman poses as teen to have sex with 14-year-old boy Baby girl dies after intoxicated mother passes out while breastfeeding A 20-year-old gunman fired shots inside a New Jersey mall before taking his own life The Milky Way could contain billions, yes billions, of habitable planets Roughly 1,500 famous paintings stolen by Nazis have been found in a Munich apartment Dr. Phil hosts Michelle Knight for a powerful tell-all of her 10 year captivity"}, {"articleID": "2017121918_00738197_W", "names": {"Bill Miller": ["Q14951130", "Q16187209", "Q16732604", "Q19325928", "Q28421889", "Q30507980", "Q43379343", "Q438279", "Q4910185", "Q4910193", "Q4910195", "Q860960", "Q862326"], "Wayne Collins": ["Q20676285", "Q7976110", "Q7976111"]}, "date": "2017-12-19", "url": "http://www.wtoc.com/story/37100976/free-cooking-demo-offers-sw-georgians-healthy-eating-options", "content": "Free cooking demo offers SW Georgians healthy eating options - WTOC-TV: Savannah, Beaufort, SC, News, Weather & Sports Free cooking demo offers SW Georgians healthy eating options - WTOC-TV: Savannah, Beaufort, SC, News, Weather & Sports Member Center: Free cooking demo offers SW Georgians healthy eating options 2017-12-19T17:32:53 Z Folks learn how to cook cabage from the free, healthy cooking demo (Source: WALB) Cabbage waiting to be cooked (Source: WALB) <mark>Bill Miller</mark> Community Center also has community gardens (Source: WALB) ALBANY, GA (WALB) - Folks in the Albany community had the opportunity to sample cabbage late Tuesday morning. Through the Department of Public Health's \"Pick it, try it, like it\" series, DPH workers taught people at the <mark>Bill Miller</mark> Community Center how to cook cabbage. After learning how to make healthy recipes to try at home, they got to sample the dish. Ebonee Kirkwood, DPH's Chronic Disease Prevention Manager for the Southwest Health District, said they want to work specifically with adults to learn how to eat healthy. \"We're trying to make sure that those fresh fruits and vegetables are easily accessible to the populations that are at greater risk for chronic diseases such as diabetes, heart disease and even obesity,\" explained Kirkwood. If you want to stop by the next event it will be at 9:30 on January 10 at Jackson Heights Community Center. The vegetable demonstrators will focus on is kale. Copyright 2017 WALB. All rights reserved. Tuesday, December 19 2017 1:20 PM EST 2017-12-19 18:20:05 GMT Source: WTOC Savannah-Chatham Metro Police are investigating a shooting that took place at an apartment complex on E. Montgomery Cross Road, Tuesday afternoon. Tuesday, December 19 2017 12:30 PM EST 2017-12-19 17:30:35 GMT Steven <mark>Wayne Collins</mark> (Source: CCSO) The Candler County Sheriff's Office says a suspect wanted after a multi-county police chase Monday morning has turned himself in. Tuesday, December 19 2017 9:36 AM EST 2017-12-19 14:36:00 GMT (Source: SCMPD) The Savannah-Chatham Metropolitan Police Department is asking for the public's help identifying a pair suspected of stealing several hoverboards from Walmart on Abercorn Street. Tuesday, December 19 2017 8:50 AM EST 2017-12-19 13:50:02 GMT Last year's turkey giveaway event. (Source: WTOC) Savannah Attorney Mike Hostilo is lending a helping hand when it comes to feeding folks this holiday season. Tuesday, December 19 2017 8:17 AM EST 2017-12-19 13:17:36 GMT (Source: WTOC)"}, {"articleID": "2018051614_00089037_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2018-05-16", "url": "https://www.coventrytelegraph.net/news/uk-world-news/north-korea-threatens-trump-14664240", "content": "News North Korea threatens to cancel US summit with Donald Trump It is still unclear, however, whether the North intends to scuttle all diplomacy or merely wants to gain leverage Share Comments By James Rodger Advanced Content Writer 11:20, 16 MAY 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email North Korea has threatened to scrap a historic summit next month between US president Donald Trump and North Korean leader <mark>Kim Jong Un</mark> over military exercises between Seoul and Washington. The surprise declaration, which came in a pre-dawn dispatch in North Korea's state media, appears to cool what had been an unusual flurry of outreach from a country that last year conducted a provocative series of weapons tests that had many fearing the region was on the edge of war. It is still unclear, however, whether the North intends to scuttle all diplomacy or merely wants to gain leverage ahead of the planned June 12 talks between Mr <mark>Kim</mark> and Mr Trump. Meanwhile, Pyongyang cancelled a high-level meeting with South Korea. The two Koreas were due to meet at a border village to discuss how to implement their leaders' recent agreements to reduce military tensions along their heavily fortified border and improve their overall ties. The North's Korean Central News Agency called the two-week Max Thunder drills, which began on Monday and reportedly include about 100 aircraft, an \"intended military provocation\" and an \"apparent challenge\" to an April summit between Mr <mark>Kim</mark> and South Korean president Moon Jae-in, when the leaders met on their border in their countries' third-ever summit talks since their 1948 division. \"The United States must carefully contemplate the fate of the planned North Korea-US summit amid the provocative military ruckus that it is causing with South Korean authorities,\" the North said on Wednesday. \"We'll keenly monitor how the United States and South Korean authorities will react .\" Annual military drills between Washington and Seoul have long been a major source of contention between the Koreas, and analysts have wondered whether their continuation would hurt the detente that, since an outreach by Mr <mark>Kim</mark> in January, has replaced the insults and threats of war. Earlier--and much larger--springtime drills, which Washington and Seoul toned down, went off without the North's typically fiery condemnation or accompanying weapons tests. In Washington, the US State Department emphasised that Mr <mark>Kim</mark> had previously indicated he understood the need and purpose of the US continuing its long-planned exercises with South Korea. Read More Donald Trump confirms US is pulling out of Iran nuclear deal State Department spokeswoman Heather Nauert said the US had not heard anything directly from Pyongyang or Seoul that would change that. \"We will continue to go ahead and plan the meeting between President Trump and <mark>Kim Jong Un</mark>,\" Ms Nauert said. Army Colonel Rob Manning said this current exercise is part of the US and South Korea's \"routine, annual training program to maintain a foundation of military readiness\". Col Manning, a Pentagon spokesman, said the purpose of Max Thunder and exercise Foal Eagle--another training event--is to enhance the two nations' abilities to operate together to defend South Korea. \"The defensive nature of these combined exercises has been clear for many decades and has not changed,\" said Col Manning. Washington and Seoul delayed an earlier round of drills in the spring because of the North-South diplomacy surrounding February's Pyeongchang Winter Olympics in the South, which saw Mr <mark>Kim</mark> send his sister to the opening ceremonies. Mr <mark>Kim</mark> told visiting South Korean officials in March that he \"understands\" the drills would take place and expressed hope that they will be modified once the situation on the peninsula stabilises, according to the South Korean government. Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now South Korea did not immediately make any official response to the North's announcement. The North's statement on Wednesday comes amid a slew of surprising moves from the North in recent weeks. On Tuesday, South Korea's military said North Korea was moving ahead with plans to close its nuclear test site next week, an assessment backed by US researchers who say satellite images show the North has begun dismantling facilities at the site. The site's closure was set to come before the Kim-Trump summit, which had been shaping up as a crucial moment in the decades-long push to resolve the nuclear standoff with the North, which is closing in on the ability to viably target the mainland United States with its long-range nuclear-armed missiles. Despite the North's moves, some experts were sceptical about whether Mr <mark>Kim</mark> would completely give up a nuclear programme that he had pushed so hard to build. Mr <mark>Kim</mark> has expressed his intention to negotiate over his weapons, but he still uses a long-contentious term, \"the denuclearisation of the Korean Peninsula\". The North previously has used this phrase when demanding that the United States pull its 28,500 troops out of South Korea and withdraw its so-called \"nuclear umbrella\" security guarantee to South Korea and Japan as a condition for its nuclear disarmament. Wednesday's threat could also be targeted at showing a domestic audience that Mr <mark>Kim</mark> is willing to stand up to Washington. Mr <mark>Kim</mark> has repeatedly told his people that his nukes are a \"powerful treasured sword\" that can smash US hostility. North Korea also has a long history of launching provocations or scrapping deals with Seoul and Washington at the last minute. In 2013, North Korea abruptly cancelled reunions for families separated by the 1950-53 Korean War just days before they were held to protest what it called rising animosities ahead of joint drills between Seoul and Washington. A year earlier in 2012, the North conducted a prohibited long-range rocket launch weeks after it agreed to suspend weapons tests in return for food assistance. Download our all-new mobile app to get the latest news, sport and what's on. Click here for iPhone and here for Android Looking for an older story? Search our archives Search for jobs, motors and property, or place an advert or family notice here. Like us on Facebook Follow us on Twitter Daily Newsletter coventrytelegraph Follow @ live_coventry Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Donald Trump North Korea"}, {"articleID": "2009111716_00063803_W", "names": {"John Hemming": ["Q2354910", "Q673430"], "Colin Campbell": ["Q1108386", "Q1108388", "Q1108411", "Q1108531", "Q19414277", "Q22323626", "Q27345368", "Q43911673", "Q5144955", "Q5144956", "Q5144961", "Q55469116", "Q5601509", "Q5601513", "Q56380383", "Q56524218"]}, "date": "2009-11-17", "url": "http://carolinamtnwoman.wordpress.com/2009/11/16/key-oil-figures-were-distorted-by-us-pressure-says-whistleblower/", "content": "the pentagon's building boom in afghanistan indicates a long war ahead official us air force document reveals the true intentions behind the us-colombia military agreement november 16, 2009...2:57 am key oil figures were distorted by us pressure, says whistleblower key oil figures were distorted by us pressure, says whistleblower exclusive: watchdog's estimates of reserves inflated says top official terry macalister guardian.co.uk monday 9 november 2009 the world is much closer to running out of oil than official estimates admit, according to a whistleblower at the international energy agency who claims it has been deliberately underplaying a looming shortage for fear of triggering panic buying. the senior official claims the us has played an influential role in encouraging the watchdog to underplay the rate of decline from existing oil fields while overplaying the chances of finding new reserves. the allegations raise serious questions about the accuracy of the organisation's latest world energy outlook on oil demand and supply to be published tomorrow - which is used by the british and many other governments to help guide their wider energy and climate change policies. \"there's suspicion the iea has been influenced by the us' link to this audio in particular they question the prediction in the last world economic outlook, believed to be repeated again this year, that oil production can be raised from its current level of 83m barrels a day to 105m barrels. external critics have frequently argued that this cannot be substantiated by firm evidence and say the world has already passed its peak in oil production. now the\" peak oil \"theory is gaining support at the heart of the global energy establishment .\" the iea in 2005 was predicting oil supplies could rise as high as 120m barrels a day by 2030 although it was forced to reduce this gradually to 116m and then 105m last year, \"said the iea source, who was unwilling to be identified for fear of reprisals inside the industry .\" the 120m figure always was nonsense but even today's number is much higher than can be justified and the iea knows this. \"many inside the organisation believe that maintaining oil supplies at even 90m to 95m barrels a day would be impossible but there are fears that panic could spread on the financial markets if the figures were brought down further. and the americans fear the end of oil supremacy because it would threaten their power over access to oil resources,\" he added. a second senior iea source, who has now left but was also unwilling to give his name, said a key rule at the organisation was that it was \"imperative not to anger the americans\" but the fact was that there was not as much oil in the world as had been admitted. \"we have [already] entered the\" peak oil' zone. i think that the situation is really bad, \"he added. the iea acknowledges the importance of its own figures, boasting on its website:\" the iea governments and industry from all across the globe have come to rely on the world energy outlook to provide a consistent basis on which they can formulate policies and design business plans. \"the british government, among others, always uses the iea statistics rather than any of its own to argue that there is little threat to long-term oil supplies. the iea said tonight that peak oil critics had often wrongly questioned the accuracy of its figures. a spokesman said it was unable to comment ahead of the 2009 report being released tomorrow. <mark>john hemming</mark>, the mp who chairs the all-party parliamentary group on peak oil and gas, said the revelations confirmed his suspicions that the iea underplayed how quickly the world was running out and this had profound implications for british government energy policy. he said he had also been contacted by some iea officials unhappy with its lack of independent scepticism over predictions .\" reliance on iea reports has been used to justify claims that oil and gas supplies will not peak before 2030. it is clear now that this will not be the case and the iea figures cannot be relied on, \"said <mark>hemming</mark>.\" this all gives an importance to the copenhagen [climate change] talks and an urgent need for the uk to move faster towards a more sustainable [lower carbon] economy if it is to avoid severe economic dislocation, \"he added. the iea was established in 1974 after the oil crisis in an attempt to try to safeguard energy supplies to the west. the world energy outlook is produced annually under the control of the iea's chief economist, fatih birol, who has defended the projections from earlier outside attack. peak oil critics have often questioned the iea figures. but now iea sources who have contacted the guardian say that birol has increasingly been facing questions about the figures inside the organisation. matt simmons, a respected oil industry expert, has long questioned the decline rates and oil statistics provided by saudi arabia on its own fields. he has raised questions about whether peak oil is much closer than many have accepted. a report by the uk energy research centre (ukerc) last month said worldwide production of conventionally extracted oil could\" peak \"and go into terminal decline before 2020 - but that the government was not facing up to the risk. steve sorrell, chief author of the report, said forecasts suggesting oil production will not peak before 2030 were\" at best optimistic and at worst implausible \". but as far back as 2004 there have been people making similar warnings. <mark>colin campbell</mark>, a former executive with total of france told a conference:\" if the real [oil reserve] figures were to come out there would be panic on the stock markets...in the end that would suit no one. \""}, {"articleID": "2010041609_00000967_W", "names": {"Andy Cole": ["Q19870706", "Q216928"]}, "date": "2010-04-16", "url": "http://metro.co.uk/sport/821976-fergies-the-best-cole", "content": "16th april, 2010 share | fergie's the best - <mark>cole</mark> <mark>andy cole</mark> believes sir alex ferguson deserves to be lauded as the best of british even if manchester united fail to retain their title for a fourth successive season. (0) related tags: alex ferguson wayne rooney goals season game with only four games remaining, united head into saturday's derby against manchester city four points adrift of chelsea. sir alex ferguson and former old trafford striker <mark>cole</mark> reckons ferguson sets the benchmark for domestic managers as he said: \"he is the best. every now and then he loses his temper but that happens in any line of work. he is very fair and you can always sit down and talk with him. he is not dismissive that way .\" he added: \"the way he produces teams year on year capable of challenging for major honours is fantastic. no doubt he will go down as the best manager great britain has ever seen .\" united have slipped up recently, going out of the champions league to bayern munich before losing to chelsea. only last sunday they had to settle for a point against blackburn and <mark>cole</mark> said: \"it is chelsea's to lose. losing to chelsea was a big knock and then to draw against blackburn was another setback .\" now we face manchester city and that is going to be a very tough game. we have to win it and hope chelsea slip up (against tottenham). \"much could depend on wayne rooney's fitness. he sat out the goalless draw at ewood park after suffering a recurrence of the ankle injury sustained against bayern. rooney has scored 34 goals this season and <mark>cole</mark> believes the england striker's ability to finish the simplest of chances is what has made him so deadly. <mark>cole</mark> said:\" the good thing with wayne this season is that he has got lots of tap-ins or goals from eight or 10 yards and those make big things in a season. his work-rate has always been the same and he has always been a team player but to get into those areas and get more goals it has been absolutely superb. \"share this article...share | top stories michael ballack and steven gerrard\" to form inter milan midfield next season' david haye set for talks with klitschko brothers over heavyweight title fight arsenal's jack wilshere for england at world cup, owen coyle claims wayne rooney favourite to land pfa award double barry geraghty: on the spot they say <mark>cole</mark> hails rooney's simple approach itv.com rooney out of the blackburn game itn rooney ruled out for united sky sports wayne rooney will not play against blackburn, insists sir alex ferguson guardian.co.uk ankle injury forces wayne rooney out of line-up the scotsman"}, {"articleID": "2011121606_00024321_W", "names": {"Chris Johnson": ["Q1077381", "Q1077389", "Q14849826", "Q22296293", "Q24006944", "Q2455991", "Q28203608", "Q2964750", "Q3662449", "Q47077990", "Q47847286", "Q4957157", "Q5107017", "Q5107019", "Q5107020", "Q5107021", "Q5107022", "Q5107024", "Q58149026", "Q766879"]}, "date": "2011-12-16", "url": "http://omaha.com/article/20111216/MONEY/712169958", "content": "republican presidential candidates gather tonight in iowa for what is likely their final debate before the jan. 3 caucuses. we'll have live updates during the debate, starting at 8 p.m. premium content click on premium content on the featured navigation bar for information. driver found guilty of 2nd-degree murder in fbi informant's death republican presidential candidates gather tonight in iowa for what is likely their final debate before the jan. 3 caucuses. we'll have live updates during the debate, starting at 8 p.m. premium content click on premium content on the featured navigation bar for information. it's time again for our 12 days of cookies series, this year sponsored by roberts dairy foods. bakers submitted their family favorites and online visitors voted on which cookies they wanted to see in the series. premium content click on premium content on the featured navigation bar for information. premium content click on premium content on the featured navigation bar for information. premium content click on premium content on the featured navigation bar for information. premium content click on premium content on the featured navigation bar for information. premium content click on premium content on the featured navigation bar for information. just a month ago, doctors discovered leukemia in the 10-year-old fifth-grader from sioux city, iowa. treatment at the nebraska medical center started immediately, tearing him away from his friends, his school, his everyday life. this year, tax advisers agree, was benign in terms of changes to the internal revenue code. as is true every year, taxpayers should run a checklist for everything from selling securities that have lost money to taking advantage of annual gift allowances. but beyond the usual recommendations, tax advisers stress that you should use this year to get your affairs in order for what promises to be an uncertain two years of tax policy. \"for high-net-worth individuals, chances are the next year or so is going to be a challenging time,\" said <mark>chris johnson</mark>, head of u.s. wealth advisory at barclays wealth. \"there is going to be a lot of attention focused on ways to extract additional tax dollars .\" if congress does not act to extend a series of smaller tax deductions, next year could be costly for middle-income taxpayers as well. some of the more pressing issues to consider: what might expire after 2011 every year congress passes a series of so-called patches, renewing some 70 tax advantages for another year or two. in the past, this has been a formality, much as raising the debt ceiling used to be. this year, it remains to be seen what congress will do. mark luscombe, principal federal tax analyst at cch, a publisher of research and software for tax lawyers and accountants, noted that when these patches expired in 2009 and were re-enacted retroactively at the end of 2010, the delay wreaked havoc with tax planning. without a fix next year, said stephen baxley, director of tax and financial planning at bessemer trust, the amt \"will hit an additional 20 million people, and most of them are middle-income taxpayers .\" it normally claims around 4 million taxpayers. what changes in 2012 there are several provisions that take effect or lapse regardless of congressional action. one set to start in 2012 is a requirement that brokers report the purchase price on mutual funds and exchange-traded funds to the irs for capital gains purposes. (they began doing this for stocks this year .) the default method of reporting is called \"first in, first out,\" which could result in higher capital gains taxes if those first shares were much cheaper than more recent ones. taxpayers have the option of electing other reporting methods, like \"last in, first out,\" which benefits people who bought shares over many years, presuming those shares have appreciated. there are also two significant tax advantages set to end. one is a loophole that allows people whose marginal tax bracket is under 15 percent to pay no capital gains tax when selling securities held for more than a year. the other break is a provision in the 2010 tax relief act that allowed 100 percent of an investment made in a private company to be free of capital gains taxes. this provision is a boon to venture capitalists who can reap millions in gains tax-free. what happens in 2013 in many ways, 2011 may be the calm before the storm. if congress and president barack obama continue to disagree, then the bush tax cuts automatically expire in 2013, raising taxes on income, capital gains and dividends and lowering the exemptions for estate and gift taxes. add to this the prospect of an additional 3.8 percent medicare surcharge on investment income. then again, the two sides could do something completely unexpected."}, {"articleID": "2018092809_00063727_W", "names": {"Michael Baker": ["Q20090207", "Q22030053", "Q22906618", "Q41804624", "Q52222700", "Q54932801", "Q6828371", "Q6828372"]}, "date": "2018-09-28", "url": "https://www.mortgagefinancegazette.com/market-news/funding/new-investor-pumps-60m-masthaven-28-09-2018/", "content": "New investor pumps £ 60m into Masthaven By Joanne Atkin in Company news, Funding 28th September 2018 0 Global alternative investment firm Värde Partners is to make a strategic £ 60 million equity investment into specialist bank Masthaven, subject to regulatory approval from the Bank of England. The investment, along with Masthaven's existing capital base, will enable the bank to significantly increase lending to consumers and SMEs over the next three to five years and provide deposit solutions to its customers. Masthaven serves borrowers without access to the traditional high street banks, and has seen significant growth in its chosen market niches--namely retail savings, SME lending, short - and long-term property financing across commercial, buy-to-let and specialist residential real estate. Värde Partners, a $14 billion global alternative investment firm, has more than 20 years of experience investing in consumer and commercial credit in the specialty finance sector. Andrew Bloom, Masthaven's founder and CEO, said: \"In Värde Partners we have chosen our strategic partner for the next phase of the continued journey of Masthaven bank. Our original investors remain committed to the bank--what Värde Partners brings to the table is the commitment, experience and firepower to take us to the next level .\" \"Masthaven has made tremendous strides in the past few years and, since our launch of the bank two years ago, we have successfully launched specialist residential and buy-to-let mortgages, plus bolstered our savings suite by entering the SME savings market, all while growing our team to above 170 people and generating over £ 0.5 billion of deposits .\" Now it's time for us to further enhance our propositions for both our existing customers and intermediary partners as well as our future clients. Masthaven will use the investment to bring more capacity to the UK market and enable us to innovate in terms of both our savings and lending propositions. \"Elena Lieskovska, senior managing director and head of European specialty finance at Värde Partners, said:\" Masthaven is an exciting brand in the UK challenger bank scene and we're thrilled about the opportunity to work together to hone the bank's proposition and to take it to the next level. \"At Värde, we are active in our portfolio companies, favouring the partnership approach to creating value, and that's exactly how we expect to work with the Masthaven team .\" <mark>Michael Baker</mark>, Managing Director Joint Ventures at The William Pears Group, Pears being an investor in Masthaven, said: \"We've backed Masthaven Finance since 2011 together with the launch of Masthaven Bank in 2016 and are pleased to welcome Värde Partners as a new investor and look forward to them being part of the next phase in Masthaven's journey .\" Masthavem Värde Partners 2018-09-28 Joanne Atkin Share Twitter LinkedIn"}, {"articleID": "2018011614_00124089_W", "names": {"Yisrael Katz": ["Q487304", "Q487316"]}, "date": "2018-01-16", "url": "http://hamodia.com/2018/01/16/first-test-run-tel-aviv-yerushalayim-high-speed-railway/", "content": "Tuesday, January 16, 2018 at 9:03 am | כ \"ט טבת תשע\" ח Israel Railways CEO Shahar Ayalon with Israeli Minister of Transportation Israel Katz during a test ride on the Jerusalem-Tel Aviv express train in central Israel on January 16. (Hadas Parush/Flash90) Transportation Minister <mark>Yisrael Katz</mark> on Tuesday conducted the first test run of the new high-speed railway from Tel Aviv to Jerusalem. The line is set to open on March 30, in about two and a half months. During the trip, <mark>Katz</mark> was accompanied by an entourage of Transportation Ministry officials, reporters and supporters. Speaking to the reporters, <mark>Katz</mark> said that he had decided to name the rail line the \"King David Line .\" The line \"will connect us to Yerushalayim and its history,\" <mark>Katz</mark> said. \"I decided to call it after King David, the conquerer of Yerushalayim, who turned the city into our eternal capital .\" Test trips that have been ongoing in recent months indicate that the predictions that the trip between Yerushalayim and Tel Aviv will take less than a half-hour are accurate, with the electric train achieving speeds of up to 160 kilometers per hour (100 mph). The 28-minute trip will include stops at Ben Gurion Airport, Modiin, and Shaar Hagay (where a large parking lot for commuters to Beit Shemesh will be set up). According to the Transport Ministry, the line will include five kilometers of bridges, including the longest bridge in Israel, at a length of almost three quarters of a mile. It is also the highest bridge, rising to almost 300 ft off the ground. The successful traversing of this bridge by the 1,200 ton train is an excellent sign that the project is sound from an engineering point of view, the Ministry said in a statement, adding that each pass of a train over the bridge will enable it to \"settle,\" strengthening its pylons and making it more sturdy. Besides the highest bridge, the railway will include the country's longest tunnel--7 miles. In addition, the railway's Jerusalem terminus, which will be about half a mile below ground, is one of the deepest commuter railway stations in the world. The line will begin operating just in time for Chol Hamo’ed Pesach, and travel for the first three months of its operations will be free, <mark>Katz</mark> said Tuesday. \"The train will take 28 minutes to travel in either direction, and will guarantee further the status of Jerusalem, and further bring it to the country's business center, making it a more attractive place to live for families to live and start businesses. It will completely change the connection between Jerusalem and the rest of Israel,\" said <mark>Katz</mark>. Print Email Gmail"}]