[{"articleID": "2019102709_00123898_W", "names": {"Frank Lampard": ["Q41533", "Q461633"]}, "date": "2019-10-27", "url": "http://www.clactonandfrintongazette.co.uk/sport/national/17996243.hat-trick-hero-christian-pusilic-nearly-forgot-match-ball/", "content": "Hat-trick hero Christian Pusilic: I nearly forgot the match ball By Press Association 2019 Burnley v Chelsea--Premier League--Turf Moor 0 comment Christian Pulisic almost forgot the match ball after his first career hat-trick fired Chelsea to a 4-2 victory at Burnley to keep their winning run going. Pulisic's first Chelsea goals arrived in a hurry as he rewarded <mark>Frank Lampard</mark>'s decision to give him a first league start since August with a match-winning performance, scoring in the 21st, 45th and 56th minutes to put them in complete control before Willian added a fourth. Pulisic's was a perfect hat-trick--left foot, right foot and a header--as he punished defensive mistakes in the first half before heading in Mason Mount's cross early in the second. Still got no words for yesterday. Thankful for my teammates and the fans! Such a special day?? ⚪ ️ @ ChelseaFC pic.twitter.com/O94u2xUfDz--Christian Pulisic (@ cpulisic_10) October 27, 2019 \"It's incredible, honestly I can't believe it,\" said the 21-year-old, a £ 58million signing from Borussia Dortmund. \"The goals were amazing. It's tough to say which was my favourite. The header was cool but I think I'd have to go with the first one, the left foot, I don't know why .\" It's actually my first professional hat-trick so I nearly forgot the match ball, luckily my team-mates helped me out. \"It was a seventh straight win in all competitions for <mark>Lampard</mark>'s youthful side, made all the more special for the manager as it came on the back of arguably their best result yet--a 1-0 Champions League win over Ajax in Amsterdam on Wednesday. All four. Enjoy ...?? #BURCHE pic.twitter.com/peMyp0WAuf--Chelsea FC (@ ChelseaFC) October 26, 2019\" It's really pleasing because it's a worry, \"said <mark>Lampard</mark>, who included Pulisic ahead of Callum Hudson-Odoi in the only change from midweek .\" You travel back, you're aware the other team doesn't have that situation. \"That was a really taxing game, it was our toughest physical game of the year, so credit to the medical staff and everyone that works around the players .\" They put a lot of hours in, and in the last two or three days, the players themselves have been professional about how they have recovered and picked themselves up to come to Burnley. \"The only negative for Chelsea were two late goals for Burnley as Jay Rodriguez hit a stunning strike in the 86th minute before Dwight McNeil found the net in stoppage time, suggesting their defensive worries are not yet over. REACTION | Jay Rodriguez shares his thoughts after scoring a sublime goal against Chelsea last night. WATCH ➡ ️ https: //t.co/kx3AhztEFg pic.twitter.com/IynV1c697s--Burnley FC (@ BurnleyOfficial) October 27, 2019\" We knew it would be a tough match, \"<mark>Lampard</mark> added .\" It's easy to take the small gloss off it with two goals late on, but it doesn't take any gloss off for me. For 95 per cent of the game we played some outstanding football at a really tough place to play, that's what made me very happy. \"It was a frustrating night for Burnley on the occasion of their 200th Premier League game as first-half errors from Matthew Lowton and James Tarkowski were punished by Pulisic while Ashley Barnes could not take a number of opportunities that came his way .\" It was an odd night in that I don't think there was too much in the game, especially in the first half, \"manager Sean Dyche said .\" We've created some good chances, but we ended up 2-0 down when mistakes were punished. Chelsea have won 4 ️ ⃣ consecutive #PL away games while scoring at least 3 ️ ⃣ goals each time for the 1 ️ ⃣ st time #BURCHE pic.twitter.com/8NNRE3A1kO--Premier League (@ premierleague) October 27, 2019 \"It's poor from us for giving the ball away in those positions, and credit to them for taking those chances, but you come in 2-0 down and scratching your head .\" Then we started the second half quite bright and took the game on again, but we gave away a third and then it's really tough. \"At four it certainly didn't feel like a 0-4 game, because we created some really good chances and that's pleasing .\" 0 comment"}, {"articleID": "2015092403_00031457_W", "names": {"Thomas Johansson": ["Q19392386", "Q2371406", "Q2425118", "Q277802", "Q28002950", "Q48816303", "Q48995779", "Q51107870", "Q58324928", "Q5887950", "Q5887958", "Q5887973", "Q9358498"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"]}, "date": "2015-09-24", "url": "http://mumbaimirror.com/sport/tennis/Pennetta-adds-to-CTL-star-power-this-year/articleshow/49083859.cms", "content": "Pennetta adds to CTL star power this year Mumbai Mirror | Sep 24, 2015, 05.37 AM IST My Saved articles Mirror Sports Bureau If Roger Federer and Novak Djokovic's presence in New Delhi last year for the International Tennis Premier League (IPTL) seemed servings from paradise, the likes of Jelena Jankovic and Sergi Bruguera in India for the Champions Tennis League, founded by Vijay Amritraj, only whetted our appetite for more. While the IPTL claimed it was a resounding success, the future of Amritraj's project appeared a touch uncertain after a low-key inaugural season in 2014. The Delhi franchise has pulled out of the CTL this year--Nagpur and Raipur have joined the league, with any of Bangalore, Pune and Chennai franchise likely to pitch for the sixth team. \"We give everyone the option to stay or opt out,\" Amritraj explained. He has enhanced the league's star power this year--never mind some of the retirees--contracting Marcos Baghdatis, Andreas Seppi, Fernando Verdasco, Ivo Karlovic, former Wimbledon champion Richard Krajicek, and Thomas Muster, the original king of clay before Rafael Nadal became the final word on red dirt. However, the biggest draw of the league this year has to be US Open champion Flavia Pennetta of Italy, who will represent Mumbai Masters. Drummers and Gera music (which has a touch of Samba) enlivened the players draft at a city hotel yesterday. Going by CTL's star galaxy this year, the action should be as gripping. Rules tweaked Amritraj explained that the league to be held from November 23 to December 6 has been tweaked to fit into the time slot of two-and-a-half hours to suit prime time viewing. \"Last year, when we had two matches per day and most of the matches were close, each day play got extended up to three and a half hours or more. So we had to make some changes so that this time around only one match (tie) will be held per day with a 7 PM start and an expected 9:30 -9:45 pm end,\" he said. \"Each match would comprise one set only (same as last year) but this year the set would be played to five games instead of six. Sets can be won from 5-0 to 5-4 and if it's 4-all a 9-point tie-break would be held,\" he said. The format remains the same: legends' singles, ATP players' singles, WTA players' singles, men's doubles and mixed doubles. Punjab Marshalls: Greg Rusedski (Australia), Marcos Baghdatis (ATP player, Cyprus), Elina Svitolina (WTA player, Ukraine), Saket Myneni (India) Hyderabad Aces: <mark>Thomas Johansson</mark> (Sweden), Ivo Karlovic (Croatia), Martina Hingis (Switzerland), Jeevan Nedunchezhiyan (India) Mumbai Masters: Richard Krajicek (The Netherlands), Andreas Seppi (Italy), Flavia Pennetta (Italy), Sriram Balaji (India) Team Nagpur: Alex Corretja (Spain), Feliciano Lopez (Spain), Jelena Jankovic (Serbia), Divij Sharan (India) Team Raipur: Thomas Muster (Austria), <mark>Kevin Anderson</mark> (South Africa), Alize Cornet (France), Ramkumar Ramanathan (India) Undecided Team: Rainer Schuettler (Germany), Fernando Verdasco (Spain), Heather Watson (Britain), Vishnu Vardhan (India) TEAM ROSTER You Might Also Like"}, {"articleID": "2019122310_00156680_W", "names": {"Frank Lampard": ["Q41533", "Q461633"], "Anthony Taylor": ["Q21457929", "Q3618544", "Q4453759", "Q572863", "Q7823537"], "Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}, "date": "2019-12-23", "url": "https://www.independent.co.uk/sport/football/premier-league/frank-lampard-chelsea-antonio-rudiger-racist-abuse-tottenham-fans-a9257651.html", "content": "Sport> Football> Premier League Close Antonio Rudiger: <mark>Frank Lampard</mark> would back Chelsea players walking off pitch over racist abuse <mark>Lampard</mark> responded after his German defender reported suffering from monkey chants during their 2-0 win at Tottenham Nick Purewal Monday 23 December 2019 09:58 {{^ moreThanTen}} {{total}} comments {{/ moreThanTen}} <mark>Frank Lampard</mark> has promised to back his Chelsea players if they ever ask to walk off the pitch amid any future racist abuse. Antonio Rudiger claimed he was subjected to racist chanting during Chelsea's 2-0 Premier League derby win at Tottenham. Referee <mark>Anthony Taylor</mark> halted play at the Tottenham Hotspur Stadium, while announcements reminded fans there is \"no place for racism in the game\". Download the new Indpendent Premium app Sharing the full story, not just the headlines Download now And after the match, the German asked: \"When will this nonsense stop?\" In a series of tweets on Sunday evening, he said: \"I really hope that the offenders will be found and punished soon, and in such a modern football ground like the Tottenham Hotspur Stadium with dozens of TV and security cameras, it must be possible to find and subsequently punish them. Shape Created with Sketch. Ratings: Tottenham vs Chelsea Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ratings: Tottenham vs Chelsea 1/22 Paulo Gazzaniga: 4 out of 10 AFP via Getty Images 2/22 Serge Aurier: 6 out of 10 AFP via Getty Images 3/22 Davinson Sanchez: 6 out of 10 Tottenham Hotspur FC via Getty I 4/22 Toby Alderweireld: 5 out of 10 AFP via Getty Images 5/22 Jan Vertonghen: 5 out of 10 AFP via Getty Images 6/22 Eric Dier: 4 out of 10 Getty Images 7/22 Moussa Sissoko: 6 out of 10 AFP via Getty Images 8/22 Lucas Moura: 5 out of 10 IKIMAGES/AFP via Getty Images 9/22 Dele Alli: 6 out of 10 AFP via Getty Images 10/22 Son Heung-Min: 4 out of 10 Tottenham Hotspur FC via Getty I 11/22 <mark>Harry Kane</mark>: 5 out of 10 Getty Images 12/22 Kepa Arrizabalaga: 6 out of 10 IKIMAGES/AFP via Getty Images 13/22 Antonio Rudiger: 7 out of 10 IKIMAGES/AFP via Getty Images 14/22 Kurt Zouma: 6 out of 10 Getty Images 15/22 Fikayo Tomori: 6 out of 10 Getty Images 16/22 Cesar Azpilicueta: 7 out of 10 Getty Images 17/22 N’Golo Kante: 7 out of 10 Getty Images 18/22 Mateo Kovacic: 6 out of 10 AFP via Getty Images 19/22 Marcos Alonso: 6 out of 10 AFP via Getty Images 20/22 Mason Mount: 8 out of 10 Getty Images 21/22 Willian: 9 out of 10 Getty Images 22/22 Tammy Abraham: 7 out of 10 IKIMAGES/AFP via Getty Images 1/22 Paulo Gazzaniga: 4 out of 10 AFP via Getty Images 2/22 Serge Aurier: 6 out of 10 AFP via Getty Images 3/22 Davinson Sanchez: 6 out of 10 Tottenham Hotspur FC via Getty I 4/22 Toby Alderweireld: 5 out of 10 AFP via Getty Images 5/22 Jan Vertonghen: 5 out of 10 AFP via Getty Images 6/22 Eric Dier: 4 out of 10 Getty Images 7/22 Moussa Sissoko: 6 out of 10 AFP via Getty Images 8/22 Lucas Moura: 5 out of 10 IKIMAGES/AFP via Getty Images 9/22 Dele Alli: 6 out of 10 AFP via Getty Images 10/22 Son Heung-Min: 4 out of 10 Tottenham Hotspur FC via Getty I 11/22 <mark>Harry Kane</mark>: 5 out of 10 Getty Images 12/22 Kepa Arrizabalaga: 6 out of 10 IKIMAGES/AFP via Getty Images 13/22 Antonio Rudiger: 7 out of 10 IKIMAGES/AFP via Getty Images 14/22 Kurt Zouma: 6 out of 10 Getty Images 15/22 Fikayo Tomori: 6 out of 10 Getty Images 16/22 Cesar Azpilicueta: 7 out of 10 Getty Images 17/22 N’Golo Kante: 7 out of 10 Getty Images 18/22 Mateo Kovacic: 6 out of 10 AFP via Getty Images 19/22 Marcos Alonso: 6 out of 10 AFP via Getty Images 20/22 Mason Mount: 8 out of 10 Getty Images 21/22 Willian: 9 out of 10 Getty Images 22/22 Tammy Abraham: 7 out of 10 IKIMAGES/AFP via Getty Images\" If not, then there must have been witnesses in the stadium who saw and heard the incident. It's just such a shame that racism still exists in 2019. When will this nonsense stop? \"Chelsea boss <mark>Lampard</mark> lamented the situation, admitting he would support his players walking off if subjected to a future racism storm .\" In terms of walking off the pitch, I think that has to feel right in the moment, \"said <mark>Lampard</mark>.\" And until that moment comes I don't want to guess what I would do. It would depend what the players were feeling and saying. \"But I would be absolutely, 100 per cent behind them if (they wanted to walk off), and I'm sure it would be a group decision. But we're not there yet, so it's hypothetical to a degree .\" All I know is that Toni Rudiger said he heard some racist chanting or comments, and I haven't had chance for an individual conversation with Toni. Watch more Tottenham issue statement after Chelsea's Rudiger \"racially abused'\" Of course I'll support Toni as we would support any of our players, or in fact any opposition players. Wherever this happens it needs to be dealt with. \"If it happened and it's fact, then punishment is needed and it needs to be strong .\" Willian's brace handed Chelsea a stunning 2-0 win at Spurs, who had Son Heung-min sent off for kicking out at Rudiger. Defender Rudiger complained of alleged racist abuse in the second half in north London, leaving Tottenham pledging to complete a full investigation. \"We are now conducting a thorough investigation which will include liaising with Chelsea and their players for their observations,\" read a Tottenham statement. \"Any form of racism is completely unacceptable and will not be tolerated in our stadium. We take any such allegations extremely seriously and shall take the strongest possible action against any individual found to be behaving in such a way, including stadium bans .\" Tottenham boss Mourinho--who sarcastically said he hoped Rudiger \"recovers quick from the broken ribs\" after Son's glancing blow--backed referee <mark>Taylor</mark>'s stance in halting the match. <mark>Frank Lampard</mark> applauds his Chelsea players at Tottenham (REUTERS) \"I've not much to say apart from it's something that saddens me,\" said Mourinho. \"I hate racism in society, I hate racism in football, I'm disappointed that things like that can still happen .\" But the referee stopped the game, spoke with the players, spoke with the coaches, spoke with the captains. \"As soon as I knew the reasons why the game was stopped I obviously understood and accepted it .\" Rudiger tweeted after the game and included the hashtags £ NoToRacism and £ PleaseGetSomeBasicEducation, and Chelsea forward Tammy Abraham hailed his team-mate's response. \"He is a strong character and it showed because he is a fantastic player and overcame it,\" he said. \"Everyone is doing as much as they can to make a stop for it. But there are going to be one or two people who will always remain the same .\" More about <mark>Frank Lampard</mark> | Antonio Rudiger | chelsea fc | Premier League | Show {{#moreThan 3_total}} {{value_total}} {{/ moreThan3_total}} comments Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive news and stats from the Premier League, every weekday by email Update newsletter preferences Comments Share your thoughts and debate the big issues Learn more {{#singleComment _ p}} {{value_p}} Independent Premium comment {{/ singleComment_p}} {{^ singleComment_p}} {{value_p}} Independent Premium comments {{/ singleComment_p}} {{#singleComment _ open}} {{value}} open comment {{/ singleComment_open}} {{^ singleComment_open}} {{value}} open comments {{/ singleComment_open}} Open Comments Join the discussion Create a commenting name to join the debate Submit Please try again, the name must be unique Only letters and numbers accepted Post Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore}} Read more {{/ showMore}} Minds Comments Join the discussion {{^ nickname}} Create a commenting name to join the debate Submit Please try again, the name must be unique {{/ nickname}} Post Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} Loading comments...{{^ comments}} There are no Independent Premium comments yet - be the first to add your thoughts {{/ comments}} {{#comments}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} Reply {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} Create a commenting name to join the debate Submit Please try again, the name must be unique Cancel Post {{#replies}} {{sender. name}} {{dateTime}} {{{commentText}}} {{#sender. isSelf}} Delete {{/ sender. isSelf}} {{posVotes}} {{negVotes}} {{/ replies}} {{/ replies}} {{/ comments}} {{#showMore _ p}} Read more {{/ showMore_p}} Follow comments Enter your email to follow new comments on this article. Subscribe Thanks for subscribing! {{errorMessage}} Vote Are you sure you want to submit this vote? Submit vote Cancel You must be logged in to vote. Report Comment Are you sure you want to mark this comment as inappropriate? Cancel Flag comment This comment has been flagged. Subscribe to Independent Premium to debate the big issues Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today. Subscribe Already registered? Log in Report Comment Are you sure you want to mark this comment as inappropriate? Flag comment Cancel This comment has been flagged. Delete Comment Are you sure you want to delete this comment? Cancel Delete comment Deleting comment...This comment has been deleted. This comment has been deleted. About The Independent commenting Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment. The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates. Subscribe Already registered? Log in"}, {"articleID": "2012062513_00107061_W", "names": {"Rick Ross": ["Q297831", "Q431969", "Q606032"]}, "date": "2012-06-25", "url": "http://hiphopdx.com/index/singles/id.20881/title.shawty-lo-f-rocko-gucci-mane--mvp-prod-zaytoven", "content": "audio> singles> shawty lo f. rocko & gucci mane's \"mvp [prod. zaytoven]\" got an account with one of these? log in here, or just enter your info and leave a comment below. error submitting comment this is a test of the error system got an account with one of these? log in here, or just enter your info and leave a comment below. shawty lo f. rocko & gucci mane: \"mvp [prod. zaytoven]\" nas f. <mark>rick ross</mark>: accident murderers [prod. no i.d. & salaam remi] gunplay x stalley x wale x meek mill f. <mark>rick ross</mark> & kendrick lamar kendrick lamar f. twista & dr. dre: the recipe rmx french montana f. <mark>rick ross</mark>, drake & lil wayne: pop that kendrick lamar f. dr. dre: the recipe [prod. scoop deville] kanye west f. dj khaled & dj pharris: theraflu [prod. hit-boy] nas: the don [prod. heavy d, salaam remi & da internz] obie trice f. eminem: richard [prod. statik selektah] chief keef f. kanye west, pusha t, jadakiss & big sean maroon 5 f. mac miller & christina aguilera: moves like jagger rmx gunplay x stalley x wale x meek mill f. <mark>rick ross</mark> & kendrick lamar wiz khalifa f. 50 cent: telescope [prod. harry fraud] <mark>rick ross</mark> f. nas: triple beam dreams [prod. j.u.s.t.i.c.e. league] future concert ticket giveaway enter for a chance to win a pair tickets to see future & pusha t live in concert!"}, {"articleID": "2010111921_00051218_W", "names": {"Joe Barton": ["Q6208505", "Q966261"], "Brian Howard": ["Q16221339", "Q1650990", "Q2924921", "Q48818225", "Q50117090"]}, "date": "2010-11-19", "url": "http://newschannel10.com/Global/story.asp?S=13421666", "content": "dimming the future for incandescent bulbs earth911.com the incandescent bulb hasn't changed much since thomas edison patented it in 1879. more than one hundred years later, the familiar bulbs still push electricity through a wire filament - and still waste a whole lot of energy. ninety percent of the energy pumped through an incandescent light bulb is wasted as heat; that's why traditional bulbs are so hot to the touch. however, thanks to a piece of 2007 legislation, traditional incandescent bulbs will soon become a thing of the past. the bush-era law, called the energy independence and security act, set energy-efficiency standards for light bulbs that will come fully into effect in 2012. the law will require light bulbs to use 25-30 percent less power than incandescents use today. it's a mandate that will quickly slash residential and commercial energy use, lowering the nation's carbon footprint and utility bills at the same time. predicted savings include $13 billion in energy costs and the prevention of 100 million tons of carbon dioxide from entering the atmosphere, reported noah horowitz, senior scientist at the natural resources defense council's energy program, in a blog post. overall, the legislation will save as much electricity each year as that used by all the homes in the state of texas. in theory, the legislation sounds like a no-brainer. australia, brazil and the european union have already enacted their own, parallel laws. yet in the united states, some consumers and activists have interpreted the act as a ban on incandescent bulbs. others believe that energy-efficient alternatives will necessarily cost more, deliver lower quality light and pose a health risk. texas congressman <mark>joe barton</mark> recently proposed a repeal of the legislation, and editorials occasionally crop up in leading newspapers, from the wall street journal to the washington times, protesting the \"light bulb ban .\" true, energy efficiency standards will inevitably make most incandescent bulbs obsolete, and give a boost to their more energy-efficient competitors, compact florescent bulbs (cfls) and light emitting diodes (leds). yet \"no one is requiring you to buy a cfl-not now, not ever,\" horowitz wrote. \"the regulation is simply making manufacturers build you a better bulb .\" cfl and led proponents point out that alternative lighting options are becoming cheaper, safer and more aesthetically pleasing every day, and that the legislation will force manufacturers to make them even better. for consumers, the biggest deterrent to choosing cfls and leds \"is the initial cost,\" says <mark>brian howard</mark>, web editor at green lighting. yet although cfls and leds cost more initially, <mark>howard</mark> explains, over time they can save consumers hundreds of dollars in reduced energy costs. cfls use four times less energy to run and last ten times as long as traditional incandescents: this means that each bulb, over its lifetime, actually costs $30 less than an incandescent. think of it this way: incandescents cost less upfront, but come will sneaky hidden fees. another complaint <mark>howard</mark> often hears, he says, is \"i tried a cfl years ago, and i hated it .\" <mark>howard</mark> points out that technology has improved radically since bulbs first hit the market. consumers can now buy energy-efficient bulbs that fit pretty much any light fixture and choose from a whole range of light effects. a while cfls do contain mercury, with proper handling, they produce a minimal health risk. each cfl bulb carries about 5 milligrams of mercury, \"just enough to cover a ballpoint pen tip .\" \"unless you wipe up mercury [without gloves] and then lick your hand, you're probably going to be okay,\" says russ leslie, associate director of the lighting research center at rensselaer polytechnic institute, as reported by popular mechanics. popular mechanics crunched the numbers and discovered that traditional incandescent bulbs actually introduce more mercury into the environment over their product life cycle. because incandescents consume more energy, they're responsible for a greater amount of pollution associated with electricity generation, including the release of trace amounts of mercury, sulfur dioxide and nitrogen oxide into the surrounding environment. over the next couple of years, you'll probably see fewer and fewer incandescent bulbs on store shelves - and hear a lot more from pundits, both on the right and left, about the light bulb legislation. the best way to cut through the hype? try out some energy-efficient alternatives, and find out how they can fit your lifestyle and save you money. click for your chance to win great prizes in the newschannel 10 pro football pick 'em contest. connect with local businesses. click here. visit the amarillo chapter and find out more on how you can make in impact. find out what and when programs come on newschannel 10. link to the official texas lottery website to see if you have won!"}, {"articleID": "2016042515_00198615_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-04-25", "url": "http://reason.com/blog/2016/04/25/chris-christie-urges-lawmakers-to-rewrit", "content": "dashcamGov. Chris Christie (R-N.J.) is leaving the door open for his support of a bill requiring police departments to equip their vehicles with dashboard cameras, after that law was ruled an unfunded mandated by the Council on Local Mandates. \"I signed it the last time so I'm certainly willing to look at it,\" Christie said, \"but look at it in light of the new costs .\" The dashcam bill, first introduced in 2014, included a $25 surcharge on DWI offenses as a method of paying for the dashcams. Christie has not been shy to support increased fines as a method of paying for government mandates before. In 2013, he signed a bill into law that increased penalties for failure to keep right from the $50 to $200 range to the $100 to $300 range, including a $50 surcharge to pay for \"keep right\" sign. While the dashcam bill's sponsor argues that the Council on Local Mandates doesn't have the power to review partially funded mandates and asked Christie to appeal the decision, Christie agreed with the council that its decisions were not reviewable. The New Jersey Constitution calls the council's decisions \"political and not judicial determinations .\" The Constitutional provision about the Council on Local Mandates does offer a number of other ways legislation can avoid review by the council, including laws, rules, or regulations \"which implement the provisions of this Constitution,\" something the bill's sponsors perhaps could have argued the dashcam law did, but didn't argue. Another provision exempts laws, rules, or regulations \"which are required to comply with federal laws or rules or to meet eligibility standards for federal entitlements .\" There are no federal rules tying federal funding of local and state law enforcement to transparency measures like installing dashboard cameras or using body cameras. I've previously suggested a tax on police associations and unions to pay for the dashcam, but suspect that's an idea that would be met in the New Jersey legislature with bipartisan opposition. Photo Credit: dashcam Friday Funnies: Chris Christie & <mark>Donald Trump</mark> Chip Bok | 3.04.16 The Sad, Embarrassing Spectacle of Chris Christie's <mark>Donald Trump</mark> Endorsement Peter Suderman | 3.02.16 Chris Christie's <mark>Trump</mark> Endorsement Proves He's an Authoritarian Who Never Really Cared About Entitlement Reform Peter Suderman | 2.26.16 VIEW COMMENTS (3) | LEAVE A COMMENT Editor's Note: We invite comments and request that they be civil and on-topic. We do not moderate or assume any responsibility for comments, which are owned by the readers who post them. Comments do not represent the views of Reason.com or Reason Foundation. We reserve the right to delete any comment for any reason at any time. Report abuses. On select articles, Reason is testing a new comment promotion feature developed by SolidOpinion. Commenters can purchase points and bid to promote their comments and/or the comments of others. Winning comments are displayed at the top of the comment thread for each article, and are identified as \"promoted comments .\" Point purchases and bidding are handled SolidOpinion. Please send any questions and feedback to promoted-comments @ reason.com. Please enable JavaScript to view the comments powered by Solidopinion. Tonio | 4.25.16 @ 11:07 AM | #Yo, fuck Chris Christie. / xeones reply to this log in or register to reply Radioactive | 4.25.16 @ 11:10 AM | #not even with someone else's dick reply to this log in or register to reply Hyperion | 4.25.16 @ 11:11 AM | #I really don't know what good the dash cams are doing. I mean, sure it's spreading awareness. But you can show the boot lickers 100 videos of cops murdering unarmed people who are in no way resisting and they'll still say something like \"well, that guy had to be doing something wrong'. I think that before something changes, a majority of people will have to be outraged, so I think the cops are safe for the foreseeable future, unfortunately. reply to this log in or register to reply Leave a Comment * COMMENT: You must have an account and be logged in to comment. Click here to register, or here to login if you already have an account * COMMENT:"}, {"articleID": "2016082916_00565849_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-08-29", "url": "http://www.huffingtonpost.com/2016/08/29/aziz-ansari-didnt-think-his-ny-times-op-ed-about-trump-would-affect-so-many-people_n_11761796.html", "content": "GP Images via Getty Images Aziz Ansari attends Master of None cast panel at Just for Laughs Comedy Festival held on Jul. 29, 2016 in Montreal, Canada. Aziz Ansari brilliantly called out <mark>Donald Trump</mark>'s xenophobic rhetoric in a scathing op-ed for the New York Times this past June. The \"Master of None\" writer, actor and director spoke about the article, which quickly went viral, in a new interview with The Daily Beast. \"You know, I put out that article and I thought like,\" Maybe this will resonate with other brown people, \"' Ansari said .\" But it ended up being like the most-emailed, most-viewed article on the site for a couple of days. People come up to me of all different races, all different religions like, \"That's really cool that you wrote that. I really liked that article .\" ' In the op-ed, Ansari spoke about his parents, who are from India, and his family's Muslim faith. The actor started it off with an anecdote, telling his mother not to go near a mosque out of fear she would be hurt, thanks to the sort of hate Trump believes in. \"Today, with the presidential candidate Donald J. Trump and others like him spewing hate speech, prejudice is reaching new levels,\" the actor wrote. \"It's visceral, and scary, and it affects how people live, work and pray. It makes me afraid for my family. It also makes no sense .\" As Ansari explains in his interview with The Daily Beast, Trump's xenophobic comments are a result of the GOP candidate's fear of anyone who doesn't look exactly like his tiny handed, spray-tanned self. \"Blaming them for something, misrepresenting them, making them some sort of strange character that they're not, not giving them the depth that he would give other white people,\" Ansari said, adding, \"What gives me hope is that I think sometimes the people that are more negative, kind of troll-y type people, they're very loud, but I think they're a loud minority. It's a strange juxtaposition, but I think there are still plenty of good people. I have hope .\" To read the rest of Ansari's interview with The Daily Beast, head here. Editor's note: <mark>Donald Trump</mark> regularly incites political violence and is a serial liar, rampant xenophobe, racist, misogynist and birther who has repeatedly pledged to ban all Muslims--1.6 billion members of an entire religion--from entering the U.S.. More: <mark>Donald Trump</mark> Aziz Ansari Suggest a correction Comments Close"}, {"articleID": "2019032408_00536744_W", "names": {"Eddie Jones": ["Q1773628", "Q3047282", "Q5336166", "Q5336167", "Q5336170", "Q735730"], "Marcus Smith": ["Q16235030", "Q30122761", "Q59162330", "Q6758457", "Q6758458"], "Danny Care": ["Q433555", "Q5220208"], "Liam Williams": ["Q19578254", "Q23306997", "Q56421819", "Q6539846"], "Schalk Burger": ["Q284846", "Q3475286"]}, "date": "2019-03-24", "url": "https://www.mirror.co.uk/sport/rugby-union/billy-vunipola-swaps-scotland-horror-14178848", "content": "Get the biggest daily news stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Billy Vunipola put his Twickenham hell behind him to help Saracens beat Harlequins with a revival Scotland would have been proud of. A week ago he and Jamie George were part of an England team which blew a 31-point lead to draw with Gregor Townsend's tartan marauders. This time it was them with a mountain to climb after London rivals Quins went into half-time leading 17-6 at the Olympic Stadium. While the wheels of England's chariot completely came off in their Calcutta Cup horror show, Saracens responded like the champions they are. The north Londoners scored three second half tries and had a further two controversially disallowed as they powered back to win 27-20. Read More England's <mark>Eddie Jones</mark> compared to Jose Mourinho by worried World Cup winner <mark>Marcus Smith</mark> scores first try of afternoon for Harlequins (Image: Getty Images) Saracens boss Mark McCall said: \"The players were superb, really calm, really clear about what we needed to do better. The reaction of the group in the second half was fantastic .\" We could have felt sorry for ourselves with those disallowed tries but we didn't. We were the kind of team we wanted to be. \"Vunipola had come to Stratford\" hurting \"from England's implosion which he said would leave opponents thinking they possessed a soft underbelly. Read More Alex Goode says big game flop was making of Saracens and can be of England David Strettle touches down for Saracens, only for it to be one of two tries the champions controversially had chalked off (Image: Getty Images) With a massive Champions Cup quarter-final at home to Glasgow next Saturday, Saracens could ill-afford to show similar weakness. They hinted at it when <mark>Marcus Smith</mark> and <mark>Danny Care</mark> grabbed first half tries in front of a 42,717 crowd, but their response more than made up for that .\" The second half is going to provide us with a bit of feel-good to take into the Glasgow game, \"said McCall .\" The first half some soul searching as to what we need to do better. \"Will Skelton scores one of his two tries (Image: Getty Images) Read More <mark>Danny Care</mark> has\" unfinished business' with World Cup and won't give up on dream Don't kick the ball dead when there is still one second left on the game clock, as Alex Lozowski did, for one thing. He thought he was ending the half only for ref JP Doyle to permit Quins the lineout, from which <mark>Care</mark> scuttled over. Sarries were furious with themselves and their frustration grew in the third quarter as Doyle disallowed a try by Vunipola after adjudging that he himself had blocked Chris Robshaw, so preventing him from making the try-saving tackle. Read More Owen Farrell's future as England captain questioned after wild Scotland draw Strettle (blue) clashes with Harlequins pair Joe Marler (left) and Chris Robshaw (Image: Action Images) It did not look that way and the TMO said as much, but Doyle held firm - then came up with another controversial call to deny a second Saracens try. This time he found fault with a scrap between <mark>Liam Williams</mark> and <mark>Care</mark>, both of whom he sin-binned, and although it had no impact on Dave Strettle's try, he chalked it off anyway. Saracens might have lost their heads had <mark>Schalk Burger</mark> not scored from close range between the two disallowed efforts. Quins' Gabriel Ibitoye is tackled by Saracens' Ali Crossdale (Image: Getty) That try, combined with the collapse of both Quins' lineout and discipline, meant it was only a matter of time before the champions took charge. Their inspiration was Aussie lock Will Skelton who plundered two tries in nine minutes to seal a man of the match performance and send Vunipola and George home happy. SARACENS - Tries: <mark>Burger</mark>, Skelton 2. Cons: Lozowski 3. Pens: Lozowski 2. HARLEQUINS - Tries: <mark>Smith</mark>, <mark>Care</mark>. Cons: <mark>Smith</mark> 2. Pens: <mark>Smith</mark> 2. Read More Sport top stories Real reason Wilder rejected Joshua fight Schumacher Jr honoured by dad comparison Bryony Frost will miss Grand National McIlroy wins \"unofficial fifth Major '"}, {"articleID": "2015031718_00072611_W", "names": {"Christopher Graham": ["Q21165674", "Q5112420"]}, "date": "2015-03-17", "url": "http://feeds.washingtonpost.com/c/34656/f/636617/s/447f08a4/sc/14/l/0L0Swashingtonpost0N0Clocal0Cdc0Epolitics0Ca0Emarijuana0Eprotest0Ebeer0Efor0Est0Epatricks0Eday0C20A150C0A30C170C88c810A440Ecc980E11e40E8c540Effb5ba6f2f690Istory0Bhtml0Dwprss0Frss0Idc/story01.htm", "content": "DC Brau co-founder Brandon Skall, seated, with brewer <mark>Christopher Graham</mark> on March 14 during a tour of DC Brau Brewing Co. and a sneak peek of its new protest beer \"Smells Like Freedom .\" (Aaron C. Davis/The Washington Post) Aaron C. Davis March 17 at 2:19 PM But if that's what you like - a dank, resinous pint - or if you're willing to at least try it, this could be your kind of St. Patrick's Day in D.C.. The District's DC Brau will tap a few green-decorated kegs of its new seasonal india pale ale dubbed \"Smells Like Freedom\" on Tuesday night, for what is bound to be a first in the District's protracted fight for full voting rights. threats of jail time by congressional Republicans. Possession, sharing and home cultivation of marijuana is now legal in the District. But Congress has blocked legal sales or purchases of pot. conflict has spurred sit-ins, marches, and as late as Tuesday, a band of pro-marijuana advocates dressed up in colonial garb who barged into the Capitol Hill office of House Oversight Committee Chairman Jason Chaffetz (R-Utah), a leading opponent of legalization in D.C.. The protestors offered a glass peace pipe of sorts. Chaffetz's staffers declined. Brewing a marijuana protest beer, however, was far less spontaneous. It's been fermenting, in fact, since last fall, said Brandon Skall, chief executive and co-founder of DC Brau Brewing Co. DC Brau and Longmont, Colo.-based Oskar Blues Brewing, both of which bottle their beers in cans, had for more than a year been looking for a reason to team up on a brewing project. In e-mails last fall, Skall said he laid out the case for doing a beer together around D.C.'s legalization effort and the rarely-noticed plight of the 650,000 D.C. residents who have no voting rights in Congress. Oskar executives were sold, and brewers there took to their lab, Skall said. They found three experimental hops that, when combined, produced a distinctly marijuana-like aroma. \"The experimental hops were definitely unique,\" said DC Brau brewer <mark>Christopher Graham</mark>. \"Some were over the top with melon. Some had a lot of berry notes. But all had that undertone of piney, resinous, dank quality that someone would expect from a nugget\" of marijuana, he said. For Skall, the issue is more about the tax bill he said he pays every year to the District while feeling like a second-class citizen. \"I'll tell you straight up, I don't smoke pot,\" Skall said, \"but I believe 100 percent in people's freedom to do so. I think that if we didn't have people standing for the end of prohibition that this business would not be here today .\" But at root, he said, it's about the fact that the District could only partially legalize marijuana, instead of fully like Colorado, which designated much of the revenue from taxes on pot to go to schools. \"Something needs to change with D.C., it's ridiculous,\" Skall said. \"I live here, I'm about to have a second child here. We're sending our children to school in Washington, D.C. - There's no reason we shouldn't be able to benefit the same way they do in Colorado .\" You walk into a D.C. public school, you see empty bookshelves, you seen underfunding, you see teachers going out and spending their money to buy kids supplies. We should be able to benefit the same way that other states do. \"The unveiling of the beer comes Tuesday night at Meridian Pint in the District's Columbia Heights neighborhood, where Initiative 71 supporters gathered on Election Night last year to celebrate legalization. SuperFan Badge SuperFan badge holders consistently post smart, timely comments about Washington area sports and teams. Culture Connoisseur Badge Culture Connoisseurs consistently offer thought-provoking, timely comments on the arts, lifestyle and entertainment. Washingtologist Badge Washingtologists consistently post thought-provoking, timely comments on events, communities, and trends in the Washington area. Post Writer Badge This commenter is a Washington Post editor, reporter or producer. Post Forum Badge Post Forum members consistently offer thought-provoking, timely comments on politics, national and international affairs. Weather Watcher Badge Weather Watchers consistently offer thought-provoking, timely comments on climates and forecasts. World Watcher Badge World Watchers consistently offer thought-provoking, timely comments on international affairs. Post Contributor Badge This commenter is a Washington Post contributor. Post contributors aren't staff, but may write articles or columns. In some cases, contributors are sources or experts quoted in a story. Post Recommended Washington Post reporters or editors recommend this comment or reader post. You must be logged in to recommend a comment. Sign in here Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges:. Replies to those posts appear here, as well as posts by staff writers. All comments are posted in the All Comments To pause and restart automatic updates, click\" Live \"or\" Paused \". If paused, you'll be notified of the number of additional comments that have come in. Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges: Text from flight:\" Scariest moment' as passenger racing at cockpit is subdued Forget Harvard and Stanford. It really doesn't matter where you go to college Jet returns to Dulles after passenger disregards instructions from the crew D.C. area forecast: Afternoon cold front ends warm reign; Rain, snow chances late Thursday into Friday Before I Go: A Stanford neurosurgeon's parting wisdom about life and time Forget Harvard and Stanford. It really doesn't matter where you go to college Text from flight: \"Scariest moment' as passenger racing at cockpit is subdued Severe geomagnetic storm spurs beautiful aurora, could continue Tuesday evening (Photos) Wet snow chances tick up for Friday, but accumulation chances very iffy Put on your Sudoku hat and get ready for a challenging Sudoku puzzle! A marijuana (protest) beer for St. Patrick's Day Mayor Bowser spells out plan to close District's troubled homeless shelter Name of Related Newsletter (daily)"}, {"articleID": "2011042219_00065766_W", "names": {"Vinod Kumar": ["Q21066568", "Q21531067", "Q2527132", "Q27917266", "Q39500993", "Q58221646", "Q59441093", "Q7932734"]}, "date": "2011-04-22", "url": "http://economictimes.indiatimes.com/news/news-by-industry/telecom/vodafone-essars-33-stake-worth-more-than-5-b-argues-essar-group/articleshow/8053215.cms", "content": "new delhi/chennai: high court verdict rejecting vodafone's plea opposing the merger of the two essar group companies, the indian conglomerate on thursday said its 33% stake in vodafone essar was worth more than the $5 billion that vodafone was offering it. essar's stance counters vodafone group plc chief executive vittorio colao's arguments on tuesday that its jv partner agreed to sell its 33% stake for $5 billion as it could not get a higher valuation. the madras high court on thursday approved the merger of india securities with essar telecommunications holdings pvt ltd that owns an indirect 11% stake in vodafone essar. vodafone had opposed the merger, saying this could be misinterpreted as a fair market value for unlisted vodafone essar, india's second largest telecoms company by customers. \"we have always believed that the fair market value of vodafone essar is higher than the underwritten value, and this is especially so in light of the recent stellar performance of the company,\" an essar spokesperson said, adding that the verdict vindicated the company's stand that \"vodafone did not have any locus standi in relation to this merger as it was neither a shareholder nor a creditor of the relevant companies\". uk-headquartered vodafone said it was \"disappointed\" that the madras high court did not feel it necessary to further investigate the merger. it said the verdict would not affect a separate deal to buy out essar from the joint venture and was confident that the process would be \"completed no later than november this year\". executives close to essar also said despite the high court order it was too late for public shareholders of isl to benefit from this decision as vodafone had already announced it was buying out the essar group's one-third stake in its indian jv. the high court also struck down the opposition of the income-tax department to the merger. rejecting vodafone's plea against the merger, justice <mark>vinod kumar</mark> sharma said the company had no locus standi to file an objection. the agreement between vodafone and essar was formed in two parts: one, a put, or sell, option for 22% held by the essar group overseas and, the other, a call, or buy, option for vodafone to buy 11% stake the essar group held in india. essar had the first right to exercise its option, but if it tendered its entire 22% stake, vodafone's option would become valid. on tuesday, colao had told et that it would not pay more than $5 billion for buying out the ruias' 33% stake. \"essar had two options: sell their entire stake for $5 billion as per the earlier agreement, or appoint an independent entity to arrive at a fair market valuation. that they choose the underwritten floor price proves they could not get a higher valuation (than $5 billion),\" he had said. he also added that ruias' seeking a higher price was a \"psychological\" tactic that all entrepreneurs employ during negotiations. while vodafone's announcement was aimed at ending months of bickering between the two partners and giving it complete ownership of the indian entity, et had recently reported the outbreak of peace was shortlived as both partners appeared to be headed for a new round of confrontation as the ruias' were seeking to extract a higher price for its stake. essar has also argued that its 11% stake held in india is being bought by vodafone is subject to the reserve bank regulations. the april 2010 rbi resolution, which sought to protect domestic companies from aggressive multinational buyers, mandates that indian shares in privately held firms should be valued under the discounted cash flow method. under this method, essar's 11% stake in vodafone essar is worth $1.7-1 .8 billion, compared with the purchase option that pegs it at $1.2 billion \"rbi is also examining whether it would permit vodafone to purchase these shares for $1.2 billion against the discounted cash flow valuation of $1.7 billion,\" one of the executives said. the executives also said that both partners had \"appointed standard chartered bank, goldman sachs and ubs to determine a fair market value of vodafone essar, in advance of the put options, but the valuation exercise by the banks never actually got completed and essar was forced to exercise the fixed price option as time was running out\". they also objected to the vodafone chief executive's announcement that the company was looking at its indian operations by the year-end following the exit of its jv partner. according to them, essar last year pushed for listing vodafone essar but was unsuccessful as \"vodafone refused to dilute its its shareholding\" ."}]