[{"articleID": "2016051909_00128466_W", "names": {"Richard Anderson": ["Q3934757", "Q52621684", "Q7323733", "Q932647"]}, "date": "2016-05-19", "url": "http://www.mprnews.org/story/2016/05/19/twin-cities-archdiocese-readies-post-bankruptcy-plan", "content": "Next mission for Twin Cities archdiocese: life after bankruptcy Religion Martin Moylan & middot; St. Paul & middot; May 19, 2016 The Archdiocese of St. Paul and Minneapolis is about to move a step closer to emerging from bankruptcy. By the end of the month, the archdiocese will file a bankruptcy reorganization plan detailing how it expects to remain a financially viable organization while providing compensation for victims of clergy sex abuse. The proposal will likely be controversial. • Full coverage: Betrayed by Silence The archdiocese has been in bankruptcy for about 16 months and insurers, parishes, abuse victims and other parties have been in mediation during most of that time. The parties involved were told to keep talks confidential. But there are indications that critical matters, especially insurance coverage, remain unresolved. At a late March court hearing, archdiocese attorney <mark>Richard Anderson</mark> told a federal judge that a plan would include financial contributions from the archdiocese and insurers. But he didn't offer details and said the church could file a plan without first securing the support of sex abuse victims. That did not sit well with Mike Finnegan, an attorney for many of the victims. \"We would not look favorably at all on a plan that was filed without the survivors' approval and definitely without the survivors being able to see it first,\" he said. \"If it is something that the survivors agreed to or that they thought we were going to agree, they would show it to the survivors first .\" The roughly 430 abuse survivors who've filed claims against the archdiocese survivors will decide whether a reorganization proposal is approved. They account for the vast majority of claimants who'll vote to approve or reject the proposal. The archdiocese has about $26 million in net assets. But much of that would not be available to abuse survivors and other creditors because of donor conditions and other restrictions. The church has raised $8 million through the sale of the archbishop's Summit Avenue residence and other property. But that's about what the church has spent on legal and related costs of the bankruptcy. If there's substantial money for victims, it'd likely have to come from insurance. But insurers have contested their obligation to pay claims for abuse that occurred because of the church's negligence. \"The insurers might have a very valid defense to the archdiocese claims on the policies,\" said University of Minnesota law professor Christopher Soper. Rather than contest their liability, he added, insurers might agree to significant payouts if that resolves existing cases, but they would want guarantees there'll be no more insurance claims from the archdiocese and parishes for past clergy sex abuse cases. The insurance companies would rather resolve all the policies all their outstanding liabilities to both the archdiocese and the parishes. That's worth some money, but how much? The archdiocese better have a firm idea when it presents a plan to the bankruptcy court, said Temple University law professor Jonathan Lipson. \"A court told,\" We think we can get X dollars in insurance but we really don't know' might be concerned about something called feasibility, \"Lipson said .\" If you say, \"I'm going to fund the plan with X dollars from insurance, you better be pretty sure that that money is really going to come in .\" The church could also face demands top tap local Catholic foundations, charities, schools, parishes and other entities to compensate abuse victims. But church leaders have long argued those are separate legal organizations, meaning their assets should not be touched by archdiocese creditors. Creditors committee attorney Rob Kugler is asking the court to authorize the hiring of an accounting firm to hunt down assets inside and outside the archdiocese that should be available to creditors. \"They've said a lot of it entities are supposed to be separate,\" Kugler said. \"The ones that we think there might be some question on, we've looked at. We have looked under every viable rock that we can look under so far .\" Money isn't the only thing abuse victims will want out of a reorganization. \"They would like to see the archdiocese files opened on abuse cases. They'd like the world to see what the archdiocese knew and when they knew it,\" said Charles Zech, director of the Center for Church Management and Business Ethics at Villanova University. But those files generally remain closed, he acknowledged, making that kind of relief harder to get than money. The news on your schedule from MPR News Update Email Address *"}, {"articleID": "2017122211_00354092_W", "names": {"Gary Klein": ["Q1746215", "Q5525375"], "Edward Jones": ["Q16853914", "Q18671061", "Q19282395", "Q24042103", "Q5343818", "Q5343819", "Q5343824", "Q56597246"], "Justin Davis": ["Q14904993", "Q38708712", "Q6317515", "Q6317516"], "Robert Woods": ["Q1265326", "Q12970035", "Q3436589", "Q7351239", "Q7351240"]}, "date": "2017-12-22", "url": "http://www.mydaytondailynews.com/sports/adoree-jackson-who-grew-rooting-for-rams-faces-them-with-lot-line/NP0fDxip3uc0VlbW2G5sbJ/", "content": "sports By <mark>Gary Klein</mark> - Los Angeles Times...CHARLES TRAINOR JR/TNS Miami Dolphins quarterback Jay Cuyler (6) runs from the Tennessee Titans' Adoree Jackson (25) at Hard Rock Stadium in Miami Gardens, Fla., on October 8, 2017. (Charles Trainor Jr. / Miami Herald/TNS) Posted: 6:00 a.m. Friday, December 22, 2017 LOS ANGELES--Growing up about 15 miles from St. Louis, Adoree' Jackson rooted for and dreamed of playing for the Los Angeles Rams. Quarterback Kurt Warner, running back Marshall Faulk, receivers Isaac Bruce and Torry Holt and offensive lineman Orlando Pace were among the Rams players who starred at the <mark>Edward Jones</mark> Dome and won a Super Bowl during Jackson's youth. Jackson also played in the stadium--during halftime exhibitions featuring local Pop Warner teams. When he stepped onto the artificial turf, his goal was always the same. \"The only thing on my mind was playing well so I could go to Dave & Buster's,\" Jackson said, referring to the restaurant and arcade chain. \"That's what my dad always did for me .\" He said give him three touchdowns and he'd take me to Dave & Buster's. So I pretty much went to Dave & Buster's every weekend during football season. \"Jackson moved to California after his first year of high school. He starred at multiple positions at Gardena Serra and USC before the Tennessee Titans selected him with the 18th pick in this year's draft. Related Golden State Warriors' go-to guy doesn't play a minute On Sunday, Jackson will start at cornerback and return kicks for the Titans when they play host to the Rams at Nissan Stadium in a game that has playoff implications for both teams. The Titans are 8-6 and in second place behind the Jacksonville Jaguars in the AFC South, needing a win plus some help to get in. The Rams are 10-4--their first 10-win season since Jackson was 8 years old--and can clinch the NFC West with a victory .\" It will be strange because I always wanted to play for them growing up as a kid, \"Jackson said during a phone interview last week .\" But being able to play against them is one of those things that's pretty cool. \"Jackson, 22, has started every game at cornerback. He has broken up 14 passes and forced two fumbles. On special teams he's averaging 21.3 yards per kickoff return and 9.3 yards per punt return. He also has rushed for 55 yards in five carries but has not run the ball in the last four games. Rams rookie running back <mark>Justin Davis</mark> was a teammate of Jackson for three seasons at USC. Receiver <mark>Robert Woods</mark>, a fifth-year pro, played at Serra and USC and has watched Jackson evolve as a cornerback and return specialist .\" He's made a lot of plays, \"<mark>Woods</mark> said .\" He's an exciting player on punt returns, one of those very, very elusive players ....When he gets the ball in his hands, he's a very dangerous player. \"A matchup with <mark>Woods</mark> would be Jackson's second this season against a former Serra and USC All-American receiver. Jackson covered Jacksonville's Marqise Lee on several plays during the Titans' Week 2 victory over the Jaguars. Lee, a fourth-year pro, caught seven passes for 76 yards .\" It was cool to see Marqise out there, \"Jackson said .\" I always wanted to play with him, but when I transferred to Serra, he was leaving. And when I got to SC, he left ....Playing against him, it was an honor. \"We always keep in touch. He's like a big bro in my eyes, one of those guys I tried to model my game after when I was at Serra .\" Jackson also knows <mark>Woods</mark>, who returned from a shoulder injury for last week's 42-7 victory at Seattle. <mark>Woods</mark> has 53 catches, five for touchdowns. \"We've all been in touch, worked out together a couple times,\" Jackson said. \"From <mark>Woods</mark> to Lee, it's just cool the connection we have. It's bigger than just football. It's like a brotherhood we have from being at the same high school and college .\" Jackson said he was improving each week, \"getting smarter, getting better, tuning up some things to play at a high level\" every week. Jackson left USC with a season of eligibility remaining. He said he was close to finishing his undergraduate degree and has considered pursuing a master's degree. But his focus is on football. \"Having the whole offseason, without having to get ready for the draft and prepare for the combine and be able to focus on certain things, I think that's going to be a big help going into my second year,\" he said. First, he'll concentrate on containing <mark>Woods</mark> and other Rams receivers, and helping the Titans stay in the playoff race. He also plans to acquire a Rams souvenir. \"I'm sure after the game, I got to do a jersey swap or something with <mark>Woods</mark>,\" he said, \"so I can have one of those jerseys to hang up .\" Popular in sports 1 2 3"}, {"articleID": "2019121813_00040159_W", "names": {"Victoria Clarke": ["Q15504611", "Q39069999"]}, "date": "2019-12-18", "url": "http://www.bracknellnews.co.uk/news/national/18109486.low-inflation-provides-festive-cheer-consumers-say-economists/", "content": "Low inflation provides festive cheer for consumers, say economists By Press Association 2019 Stirling Currency Stock 0 comment Economists have said that continued low inflation will give consumers \"further cheer\" over Christmas, as it continues to sit significantly below wage growth. The latest data from the Office for National Statistics revealed that the Consumer Price Index (CPI) held firm at 1.5% in November, the same figure as a month earlier. Inflation was last lower in November 2016. Inflation was higher than analysts had predicted, having forecast a decrease to 1.4% for the month. Emma-Lou Montgomery, associate director for personal investing at Fidelity International, said the latest figures are positive for consumer finances. \"Today's UK CPI figures reveal, once again, the rate of inflation continues to lag behind wage growth--in a boon for households around the country .\" A continued easing in the cost of goods and services included within the index will no doubt bring further cheer to consumers as they celebrate the festive season, particularly following yesterday's news of a strong jobs market. \"Wage growth remains significantly ahead of the rate of inflation, although figures released by the ONS on Tuesday revealed that average wage growth slipped to 3.2% in October, from 3.6% a month earlier. Employment increased for the month, but the number of vacancies contracted for the tenth consecutive month as the labour market remained tight. Analysts also highlighted that consumers will only feel a benefit in their purse if they do not have a sweet tooth, with the price of chocolate jumping as food prices increased for the month. <mark>Victoria Clarke</mark>, economist at Investec, said:\" The biggest upward force to the 12-month inflation rate in November month was the \"food and non-alcoholic beverages' category where British chocolate lovers were hit with a bigger price rise for chocolate boxes and chocolate-covered ice cream bars than in the same month last year .\" However, Howard Archer said the new figures are still \"decent news for consumer purchasing power\". He added: \"It also gives the Bank of England ample scope to cut interest rates if the economy fails to decisively pick up early in 2020 .\" UK CPI readings remain below the BoE's 2% threshold but not really far enough to warrant rate cuts. OIS pricing shows v little chance of a move tomorrow from the Bank--also seen as unlikely in the coming months. One 25bps cut largely discounted by Nov 2020 pic.twitter.com/OznIo4J3sF--David Cheetham, CFA (@ DavidCheetham3) December 18, 2019 Although the rate stayed noticeably below the Bank of England's target rate of inflation, economists said they still do not expect a change to policy by rate-setters. David Cheetham, chief market analyst at XTB, said: \"The core reading of 1.7% was unchanged from the previous month and is close enough to the Bank of England's 2% target to not by itself give too much food for thought amongst rate-setters ahead of tomorrow's decision .\" After being widely criticised for becoming politicised following the bank's comments on the EU referendum, it would not be at all surprising if they decide that the best course of action is no action at all and simply stand pat until there's great clarity on the Brexit outcome. \"The pound increased against the dollar on the announcement but tailed off shortly after as concerns over Brexit continued to dominate trading. 0 comment"}, {"articleID": "2010040212_00085746_W", "names": {"Ed Murray": ["Q19604849", "Q5335211", "Q5335212"], "Lisa Brown": ["Q11347967", "Q1827717", "Q47071859", "Q6557848", "Q6557850", "Q6557852", "Q6557853"]}, "date": "2010-04-02", "url": "http://theolympian.com/2010/04/02/1192711/taxes-divide-house-senate.html", "content": "the budget impasse at the capitol is expected to continue past easter, pushing state lawmakers closer to the end of their 30-day special legislative session. senate democratic leaders still were hanging on to a temporary sales tax increase thursday as part of their $800 million tax package to bridge a $2.8 billion budget gap. their inability to get 25 votes for other substitute taxes appears to be a major sticking point with the house, which says it can't get votes for a sales tax. \"we've got some big hurdles to get over; (we're) somewhat maybe slightly closer but some big hurdles to get over,\" senate democratic caucus chairman <mark>ed murray</mark> of seattle said thursday. <mark>murray</mark> said the senate democrats, who have zero support from the gop for raising taxes, have \"a variety\" of plans they are talking about, and some of them might not include the sales tax. he also said the sales tax is less likely to survive in any final agreement. <mark>murray</mark> disputed reports that a tax deal was at hand, and he dismissed claims by house leaders that senate majority leader <mark>lisa brown</mark>, d-spokane, had a new proposal in the works to break the deadlock. gov. chris gregoire called lawmakers in for the overtime session after the house and senate were unable to find votes for a tax package and supplemental operating budget in their regular, 60-day session. the special session started march 15, which makes april 13 the new deadline to finish. minority republicans are complaining about the costs of the session and a lack of action on bills that spur job creation. so far, session costs are about $170,000, according to estimates from the house and senate administrative offices. the house has estimated that its costs have been as low as $1,000 on days when most members are gone, as they were thursday; on actual session days, costs are higher, but not as high as during regular session because there is less staffing and many members turn down their $90-a-day per diem. despite the lack of progress, the house is set to be back in full session today to consider an enhanced-911 emergency system tax on cell phones, which the senate approved thursday. house democrats also are learning about a new approach to temporary worker layoffs, which labor unions are fighting. the latter piece is a key element in any final budget agreement. house speaker frank chopp, d-seattle, said he, majority leader <mark>brown</mark> and others keep talking about taxes, and he credited <mark>brown</mark> with a new approach that might break the tax deadlock. \"i think <mark>lisa</mark> was potentially working on a new approach on the revenue. so we're looking forward to seeing what she has in mind,\" chopp said. <mark>brown</mark> plans a meeting with reporters today, but <mark>murray</mark> said there was no new deal or proposal in the works. rather, senate democrats are working individually with members and asking whether changes to a variety of proposals might win or retain their votes, <mark>murray</mark> said. the dispute over taxes is more complicated than whether the senate can simply drop its proposal for a 0.2 percent temporary sales tax. that is because the senate is holding firm on raising $800 million in new revenue to blunt cuts that are likely to exceed $4 billion over the 2009-11 budget cycle. but to reach that level of revenues without $200 million from the sales tax requires senate members to accept other tax ideas for which <mark>brown</mark> and <mark>murray</mark> are unable to get 25 votes, including a tax on some first-mortgage interest earnings of banks; adding sales tax to custom software transactions; and ending a sales-tax exemption for out-of-state residents, whose purchases help border-county businesses. on the flip side, the house opposes repeal of a $10 million tax break for coal purchases by the transalta power plant in centralia and other senate proposals. gregoire planned a meeting with chopp and <mark>brown</mark> late thursday, and house majority leader lynn kessler said she was hopeful that some kind of agreement will be reached next week. if that happens, kessler said, lawmakers will return april 9 and try to finish by sunday, april 11. staff writer jordan schrader contributed to this report."}, {"articleID": "2011011113_00094172_W", "names": {"Thomas Cole": ["Q47005466", "Q53952783", "Q53952784"], "William Cullen": ["Q18577154", "Q52990733"]}, "date": "2011-01-11", "url": "http://dallasartnews.com/2011/01/landmark-american-masterpiece-on-view-at-amon-carter-beginning-in-february/", "content": "landmark american masterpiece on view at amon carter beginning in february posted tuesday, january 11, 2011 one of the most treasured paintings in american art, kindred spirits (1849) by asher b. durand, will be on view at the amon carter museum of american art this spring. the painting, on loan from the crystal bridges museum of american art (bentonville, ark .), will hang concurrently with the museum's special exhibition, the hudson river school: nature and the american vision, from february 26-june 19, 2011. admission is free to the museum and the special exhibition. beginning in the 1820s, the american landscape became a significant theme for artists who traveled up the hudson river from new york city to sketch the rugged mountains and tranquil valleys along its banks. with the noted landscape painter <mark>thomas cole</mark> as their inspirational leader, these artists gave impetus to the first self-consciously \"american\" vision for landscape painting, a movement that would become known as the hudson river school. in kindred spirits, durand, a hudson river school artist, depicts <mark>cole</mark> with his close friend and colleague <mark>william cullen</mark> bryant, the esteemed poet and editor. the painting was commissioned by art patron jonathan sturges as a tribute to <mark>cole</mark> following his death in 1848 at age 47. invoking john keats' sonnet vii, durand portrays <mark>cole</mark> and bryant together as \"kindred spirits\" in the landscape. after the painting was complete, sturges gifted the work to bryant. in 1904, bryant's daughter julia gave kindred spirits to the new york public library in manhattan, where it hung on public view for more than a century before being deaccessioned and acquired by the crystal bridges museum of american art. \"the painting is glorious,\" says chris crosman, chief curator at crystal bridges. \"while our museum is under construction, we are thrilled that audiences can view the masterpiece in the amon carter's galleries .\" the timing also coincides with the amon carter's 50th anniversary year. \"how fitting that we can show such an iconic american painting during a milestone year for the museum,\" says rebecca lawton, curator of paintings and sculpture at the amon carter. \"we are grateful to crystal bridges for loaning us the work, which symbolizes our mutual dedication to presenting masterpieces of american art to audiences who may otherwise never have the opportunity to enjoy them .\" additional works by hudson river school artists, such as <mark>cole</mark>, frederic edwin church, jasper francis cropsey and george inness, are on view in the amon carter's permanent collection throughout the year. about press release art news posts by press release are items that come directly from museums, galleries and other sources. these posts have been formatted but not re-written. filed under: exhibits, museums, news by press release share your voice readers of dallas art news are encouraged to leave comments, notes, remarks or haikus. fill out the below text fields with your name, e-mail address and comment. dallas art news does not spam or mass e-mail, so your e-mail address is safe with us. cheers. name (required) e-mail (will not be published) (required) website"}, {"articleID": "2013122317_00041029_W", "names": {"Luis Suarez": ["Q26517", "Q270367"], "Brendan Rodgers": ["Q19973684", "Q310623"], "James Tomkins": ["Q1681200", "Q1681210"]}, "date": "2013-12-23", "url": "http://www.football365.com/news/21554/9085918/Moyes-Sees-Leadership-Qualities-In-Rooney", "content": "T here are plenty of reasons why Frank De Boer would join Spurs. Plus, can West Ham...Sky Bet are paying 1/4 the odds on all each-way bets on the top four Premier League goalscorers this season. Robin van Persie, <mark>Luis Suarez</mark>, Daniel Sturridge and Sergio Aguero are front-runners in the betting market. Check out the latest outright odds on next summer's World Cup in Brazil, where the hosts are the favourites. Predict six correct scores for your chance of winning the? 250k jackpot. Terms and Conditions apply. Who will be the next managerial casualty in the Premier League? Chris Hughton and Andre Villas-Boas are available to back with Sky Bet. Wayne Rooney: Hailed for his leadership qualities Rooney, who was an injury doubt before this weekend's game, was instrumental in United's 3-1 win over West Ham and Moyes believes the England international is now playing a key role in helping his team-mates improve. Moyes has been impressed by Rooney's attitude since taking over at Old Trafford and believes the 28-year-old is showing more maturity on his way to becoming a true United great as he enters his tenth year at the club. \"Do you know what I see more than anything in Wayne? I see leadership,\" said Moyes. \"I see somebody who wants to take responsibility for the team. I see somebody who cares for how he plays and how the team plays. More than anything, that is what I see from Wayne .\" Maybe if he is not quite at the top of his form I will need him to drop in at times and he has no problem doing any of the jobs. He is getting to an age now where he realises he is not a boy any more. He is one of the senior men in the team. He is actually on the verge of being one of the great legends at this club. S oldado's three chances on a plate include one against an advancing keeper from an extremely oblique angle and one stretching awkwardly just to get a touch on a bouncing cross. The other he created himself. Behave. R eplace a proven winner with a complete amateur, about 1% of the time it works, great odds Spurs fans! Oh, he's won one game, well he must have what it takes then, my mistake! Liverpool boss <mark>Brendan Rodgers</mark> says <mark>Luis Suarez</mark> deserves world class tag Liverpool boss <mark>Brendan Rodgers</mark> believes <mark>Luis Suarez</mark> deserves to be mentioned as one of the best players in the world. Premier League: Chelsea boss Jose Mourinho keen to stay for 12 years Jose Mourinho believes stability is the key to success and hopes to remain in charge of Chelsea for another 12 years. West Ham defender <mark>James Tomkins</mark> charged over police officer assault There are plenty of reasons why Frank De Boer would join Spurs. Plus, can West Ham spring another upset at Old Trafford on Saturday? And thoughts on Liverpool's challenge ..."}, {"articleID": "2014012300_00066193_W", "names": {"Greg Wood": ["Q18346186", "Q5606450", "Q5606451", "Q59216650"], "Nathan Lyon": ["Q6969216", "Q6969217"], "Graeme Smith": ["Q1427233", "Q1541330", "Q1541338", "Q370049", "Q3774173", "Q5592397", "Q5592398", "Q58299803"], "David Warner": ["Q3018962", "Q363271", "Q57408725"], "Mitchell Johnson": ["Q3180617", "Q54569328", "Q6881268"], "Phil Hughes": ["Q1189699", "Q3901330", "Q7182030"]}, "date": "2014-01-22", "url": "http://www.theroar.com.au/2014/01/23/history-shows-australia-can-topple-south-africa/", "content": "+ enlarge image First cricket Test between South Africa and Australia at the Gabba ground. AFP PHOTO / <mark>Greg WOOD</mark> Watch on for Glenn Mitchell's thoughts on the Australian Test squad - including his surprise at Shaun Marsh's selection. Australia's chances of maintaining their 44-year unbeaten Test series streak in South Africa will be boosted by a likely low-scoring affair in next month's battle. With both sides boasting supreme pace attacks which will cherish pitches predicted to be green and lively, it seems likely team totals of between 200 and 300 will be the norm. History also suggests as much. Over the past 20 years, the 17 Tests between Australian and the Proteas played in South Africa have been dominated by the ball. The average total for completed innings has been just 271. Further emphasising the low-scoring state of these Tests is the fact that only once in every eight innings has a total of 400-plus been posted. Australia will enter the series as rank outsiders against the imposing Proteas. But low-scoring contests in any sport always increase the likelihood of an upset. South Africa has a history of producing \"result' wickets. This seems unlikely to cease with reports that the Proteas are expected to ask for spicy decks to exploit Australia's lesser batting line-up and negate the edge that spinner <mark>Nathan Lyon</mark> offers the tourists. Masterful batsmen Hashim Amla, AB de Villiers and captain <mark>Graeme Smith</mark> provide the Proteas with a bounty of experience and talent around which to construct their batting order. Australia, by comparison, remain susceptible to batting collapses and would be at their most vulnerable on seaming surfaces. South Africa do, however, have one glaring weakness - their lack of anything close to a reasonable spin option. Loose leg spinner Imran Tahir was vaporised by the Aussies last summer, while left arm tweaker Robin Peterson has taken just 15 wickets at 41 in his past seven Tests. <mark>Nathan Lyon</mark>, meanwhile, has graduated into a genuine world-class spinner, having reaped 37 wickets at 27 in his past nine Tests and regularly snared crucial wickets in Australia's recent 5-0 Ashes triumph. South African batsman Faf du Plessis recently revealed his side were wary of the threat posed by both <mark>Lyon</mark> and cavalier opener <mark>David Warner</mark>.\" Their spinner is bowling very well at the moment, \"du Plessis told supersport.com .\" It might suit us to prepare a greener wicket. It might help us to neutralise <mark>David Warner</mark>, as he could do a lot of damage on another wicket. \"Esteemed South Africa-based cricket journalist Mike Haysman went so far as to suggest that <mark>Lyon</mark> could be Australia's ace. In a column for supersport.com, he encouraged the Proteas to request a juicy pitch for the opening Test at Centurion .\" An energised, confident and vastly improved <mark>Nathan Lyon</mark>, given the correct surfaces, could become Australia's trump card as he constructs a valuable holding pattern early, then spins with an attacking nature later, \"Haysman wrote .\" That will mean going into this crucial opening gambit on a surface that will suit the compelling pace potency that South Africa possess. \"The fact that players and pundits in South Africa are paying such close attention to the preferred state of the pitch indicates how highly the Proteas rate Australia. That is not surprising given the boys in the baggy greens have a proud history of excelling on Test tours to South Africa. Not since 1969-70 have they lost a Test series in that country. Over the past 20 years, Australia's win-loss record in Tests in South Africa is 11-5. The Aussies have regularly produced some of their best cricket away from home against the Proteas. While there have also been some shattering lows, such as the 47 all-out debacle at Cape Town in 2011, Australia have often exceeded expectations. On that last tour in 2011, Australia were predicted to get dismantled by a ruthlessly efficient South African side. The Aussies were fresh from a horrific capitulation in the Ashes earlier that year, while the Proteas had lost only two of their previous 12 Tests. Australia threw away a seemingly match-winning 188-run first innings lead by folding for 47 at Newlands in the first Test. But they rebounded ferociously to draw the series by manufacturing a thrilling two-wicket win at Johannesburg. Australia were similarly written off prior to the 2009 series in South Africa. Having just lost to the Proteas at home, the Aussies were expected to struggle. Yet thanks to spectacular displays from <mark>Mitchell Johnson</mark> and fresh-faced opener <mark>Phil Hughes</mark>, Australia stormed to a 2-0 lead in the three Test series. The Aussies are no more underdogs this time than they were on the previous two tours. In fact, they enter the series in better shape with a settled, confident side. The likely low-scoring nature of this series is tailor made for Australia to once again deny the Proteas victory on their home soil. Please be sure to enter your name and email before submitting this comment. Please also refer to our 7/154 Melbourne Renegades won the toss and elected to bat Recent Overs:...4 1 1 | 1. . 4. 2 | Last Wicket: Ludeman, 20 (c: Hill b: Siddle) Current Partnership: 25 runs, 16 balls, RR:156.25"}, {"articleID": "2019030715_00365618_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-03-07", "url": "https://inews.co.uk/news/uk/amber-rudd-diane-abbott-coloured-woman-bbc-radio-interview/", "content": "In brief The comments provoked an immediate response Diane Abbott called the comments \"offensive, outdated and revealing' Work and Pensions Secretary Amber Rudd has been criticised after she described Labour frontbencher Diane Abbott as a\" coloured woman' during a BBC interview on Thursday. The Government minister was discussing the women in politics on Jeremy Vine's BBC Radio 2 show, when she used the offensive term. The comments provoked an immediate response from Ms Abbott who branded it \"offensive, outdated and revealing\" in a tweet. Ms Rudd apologised shortly after making the comments saying: \"Mortified at my clumsy language and sorry to Diane Abbott My point stands: that no one should suffer abuse because of their race or gender .\" \"Coloured woman' Work and Pensions Secretary Amber Rudd talks to the media in Westminster (Photo: Jack Taylor/Getty Images) Ms Rudd was talking about internet trolling of Ms Abbott when she said:\" It's definitely is worse if you're a woman, and it's worst of all if you're a coloured woman. \"\"I know that Diane Abbott gets a huge amount of abuse, and I think that's something we need to continue to call out .\" She said research has shown that \"it definitely was the case that the women get it more, black and black minority ethnic women get it additionally\". She added: \"It is just a particularly nasty form of attack that focuses on gender and colour and I think that we have to address it by calling it out and we have to continue to look at ways of trying to stop it happening .\" \"The term\" coloured \", is an outdated, offensive and revealing choice of words\" --Diane Abbott (@ HackneyAbbott) March 7, 2019 The Labour MP for Midlothian, Danielle Rowley, tweeted: \"Amber Rudd undermining an important point about online abuse by referring to Diane Abbott as a\" coloured woman \"on BBC Radio 2. She clearly gets her language from the same bygone era as her abhorrent welfare policies .\" Ms Rudd returned to Government in November after resigning as Home Secretary in April 2018 because of the department's handling of the Windrush scandal. Ms Abbott, who is Labour shadow Home Secretary, has called for action to tackle online abuse after research showed she received nearly half of all abusive tweets sent to female MPs in the run-up to the 2017 general election. More on Amber Rudd Amber Rudd to end repeat PIP assessments for disabled pensioners <mark>Theresa May</mark> to pause Brexit as up to 15 ministers threaten to walk out More people are using food banks in Amber Rudd's constituency since UC Amber Rudd admits Universal Credit has pushed people to food banks Brexit: Justice Secretary David Gauke urges Parliament to give MPs free votes \"to resolve things' Cabinet split as <mark>Theresa May</mark> refuses to rule out No Deal Brexit News Politics UK Video Amber Rudd BBC Radio 2 Diane Abbott"}, {"articleID": "2015020606_00037752_W", "names": {"Mike Allen": ["Q3307988", "Q6845851", "Q6845854"], "Jim Messina": ["Q3088816", "Q6196934"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2015-02-06", "url": "http://politico.com/story/2015/02/mitt-romney-obama-concession-call-2012-114954.html?hp=t2_r", "content": "It's one of the iconic moments in American politics - never rehearsed, and never pleasant. The loser of a long, expensive presidential campaign telephones the victor with carefully worded pleasantries after the networks have declared a winner. Then the two go before their supporters and a global television audience. But that ritual - designed to signal the polite end of the campaign, and the commitment to unite the country behind the winner - has sparked one final disagreement between the still-bitter camps of President Barack Obama and his 2012 rival, Mitt Romney, with eyewitnesses to the concession call lining up on Thursday to dispute just what was said between the two men. At issue isn't just the political spin, but a footnote of history, destined to be reviewed by anyone who writes about the 2012 presidential race. ALEX ISENSTADT In a passage previewed by the New York Daily News, Axelrod writes that an \"unsmiling\" Obama told those in the room after the call that Romney had said: \"You really did a great job of getting the vote out in places like Cleveland and Milwaukee .\" The president had added, according to Axelrod: \"In other words, black people. That's what he thinks this was all about .\" That sparked a war of tweets and interviews between the camps. Garrett Jackson, Romney's body man throughout the 2012 campaign, told POLITICO that he believes Axelrod \"concocted\" the call. \"When I read that, I was furious,\" Jackson said in a telephone interview from Houston, where he is now a private equity analyst. \"It didn't happen ....I was right next to the Gov. Hell, it was my phone. I was the one who called [Obama aide] Marvin Nicholson ....Mitt goes:\" Mr. President, I just wanted to call and congratulate you and your team on a well-fought race, and congratulate you on your victory .' Then there was a silence on Mitt's end - we weren't on speaker. \"<mark>MIKE ALLEN</mark>\" [H] e didn't do it in a malicious way - there was nothing about voter turnout, \"Jackson added .\" This was a national campaign. When I was giving the Gov. updates, they were macro, and state results. There was never talk of turnout in this city versus that city. \"Later in the day, Tagg Romney, who was also in the room when his father made the call, said in an email to POLITICO:\" Garrett is 100 percent correct...We had no idea what turnout was like in Milwaukee or Cleveland at that point. \"Axelrod is expected to respond to Jackson's account after\" Believer \"is published on Tuesday. But former Obama aides jumped in with a flurry of responses backing his account. <mark>Jim Messina</mark>, Obama's 2012 campaign manager, tweeted:\" Every word of @ davidaxelrod mitt e-night call is true. I was standing with axe & POTUS. That's what happened. \"<mark>Messina</mark> added in a telephone interview:\" He said exactly what David said he said. It's pretty much what Romney said after the election. That's what he thought. \"Jay Carney, former White House secretary, tweeted:\" Account by @ davidaxelrod of POTUS call w/Romney on election night is 100% accurate. I remember it well. \"Greg Whiteley, the filmmaker who chronicled Romney's campaign, said he did not record the call. Whiteley recalled that Romney made the call from a bedroom with Jackson, Tagg Romney, and, possibly, vice-presidential candidate <mark>Paul Ryan</mark> in the room."}, {"articleID": "2019120305_00131507_W", "names": {"David Torres": ["Q5797514", "Q5800412"]}, "date": "2019-12-03", "url": "https://www.prokerala.com/news/articles/a984040.html", "content": "Nissan Image Source: PK Road accident. Image Source: PK Washington, Dec 3: Two Indian students were killed in a hit-and-run incident in the US state of Tennessee, with the accused surrendering himself to the police, media reports said. The accident took place on Thanksgiving Day on November 28 and the victims were identified as Vybhav Gospisetty, 26, and Judy Stanley Pinheiro, 23, who were both Indian graduate students at the Tennessee State University, the Knoxville-based WVLT-TV said in a report. The accused <mark>David Torres</mark>' GMC truck reportedly collided with the 2015 Nissan Sentra, which Gospisetty was driving with Pinheiro sitting in the front seat. The Sentra reportedly attempted to cross Nolensville Pile from the parking lot of the US Bank to Walmart. Police said the truck hit the passenger side of the car as it was driving north. The car was sent off the east side of the road, through a fence and into a tree on Walmart property, according to the WVLT-TV report. Witnesses told police that the GMC was speeding and ran the red light at the intersection. <mark>Torres</mark> surrendered on December 1 to the Metro Nashville Police. The university also released a statement, saying: \"The Tennessee State University family is mourning the loss of two students killed in an auto accident on Thanksgiving night. Judy Stanley, 23, and Vybhav Gopisetty, 26, were both graduate students from India pursuing food science degrees in the College of Agriculture. Stanley was seeking a master's, and Gopisetty a doctorate .\" "}]