[{"articleID": "2011042505_00027304_W", "names": {"Mao Li": ["Q45433741", "Q45456423"]}, "date": "2011-04-25", "url": "http://nation.com.pk/pakistan-news-newspaper-daily-english-online/Entertainment/25-Apr-2011/Man-spends-one-year-living-in-a-pipe", "content": "read more ppp-q love affair not to hurt punjab govt | read more india, bangladesh to have rail links | read more gilani pledges to resolve public issues | read more anti-taliban leader killed in bajaur | read more japan deploys 25,000 troops in search for disaster victims | read more turkey criticizes obama over remarks on armenian killings | read more u.n. should probe syria crackdown: human rights watch | read more indian guru sathya sai baba passes away | entertainment? man spends one year living in a pipe this concrete tube has been home to houseproud <mark>mao li</mark> for a year. <mark>mao</mark> has installed a wood floor, door, rugs and cushions in the 6ft floodpipe. but the bachelor, 30, who recycles cans for a living in haikou, southern china, is being evicted from his bridge-side pad. an official said: \"he will be given a home. we can't have people living in pipes. -\" the sun"}, {"articleID": "2010031203_00105084_W", "names": {"Mike Shanahan": ["Q17025605", "Q1857407", "Q27973761", "Q47467791"], "Bruce Allen": ["Q16199057", "Q20724811", "Q477130", "Q4977062", "Q4977063"], "Sean Ryan": ["Q21082345", "Q7441413", "Q7441414", "Q7441415", "Q7441416", "Q7441418", "Q7459602", "Q7459603"], "Larry Johnson": ["Q18586008", "Q2334039", "Q3445677", "Q3827149", "Q43132113", "Q463635", "Q6490580", "Q6490581", "Q6490583", "Q6490584", "Q6490586"], "Carlos Rogers": ["Q1627398", "Q3660129"]}, "date": "2010-03-12", "url": "http://washingtonexaminer.com/sports/redskins-snyder-supports-free-agency-approach-87416857.html", "content": "redskins' snyder supports free agency approach associated press 03/11/10 10:20 pm est - dan snyder's early verdict on <mark>mike shanahan</mark> and <mark>bruce allen</mark>: \"great guys. lucky to have 'em .\" in brief remarks to reporters before a charity dinner, the washington redskins owner said thursday night he supports the measured approach to free agency under his new coach and general manager, which differs from his aggressive style of years past. \"it's really not about the past now,\" snyder said. \"it's really about the future. and when we look at the pedigree of <mark>bruce</mark> and <mark>mike</mark> and everything that they've experienced, we're in good hands .\" the redskins have signed three players in the first week of free agency: offensive lineman artis hicks, nose tackle maake kemoeatu and tight end <mark>sean ryan</mark>. free agent running back <mark>larry johnson</mark> will meet with <mark>shanahan</mark> on friday. the redskins have been known as the champions of the offseason under snyder, but the owner gave control of the roster to <mark>shanahan</mark> when the coach was hired after a 4-12 season. \"we've got a game plan. it takes time,\" <mark>shanahan</mark> said. \"and we've got a plan. it's not going to happen overnight. you'll just have to watch the plan take place .\" <mark>shanahan</mark> said he expects 100 percent participation when the offseason conditioning program begins monday. that includes running back clinton portis, whose preference is to stay home in florida and avoid the extra work. \"oh, i guarantee you clinton'll be there,\" <mark>shanahan</mark> said. \"i know clinton too well. he'll be there, and he'll kick off the offseason on the right note. i want my leaders to be there .\" <mark>shanahan</mark> also said he met with cornerback <mark>carlos rogers</mark>, who was hoping to become an unrestricted free agent and find another team. instead, the redskins tendered <mark>rogers</mark>, making him a restricted free agent. mason to play in cit george mason coach jim larranaga will get a chance to give his youthful squad some more experience later this month when it plays in the collegeinsider.com tournament. mason...terps' vasquez climbs over wall it's hard to see anyone other than ohio state's evan turner winning the naismith award as college basketball's best player. and the consensus seems to be kentucky freshman john...snyder believes in plan the redskins have had quiet offseasons in the past under dan snyder. but it's rare for it to happen in the first year with a new coach. so, in some ways, this quiet first...perhaps nobody will be happier about the redskins signing nose tackle ma'ake kemoeatu on wednesday than albert haynesworth. that is, if kemoeatu recovers from a torn achilles he...house democrats looking at \"slaughter solution' to pass obamacare without a vote on senate bill updated! all comments on this page are subject to our terms of use and do not necessarily reflect the views of the examiner or its staff. comment box is limited to 200 words. warning: if you comment, the disqus platform default is set to email you when other reply to it. if you do not want to receive these replies to your comment, please uncheck the box."}, {"articleID": "2014101703_00011683_W", "names": {"Mark Sanchez": ["Q15991558", "Q15991574", "Q6769581", "Q946184"]}, "date": "2014-10-17", "url": "http://www.courant.com/sports/hc-on-the-fly-1017-20141016-story.html?track=rss", "content": "ew York Knicks power forward Amar' e Stoudemire reacts during the second half against the Miami Heat at American Airlines Arena. Red wine soothes the body. So says Amar' e Stoudemire, and so says anyone who might have a glass or two at the end of a long day. Stoudemire, however, hasn't been drinking in an effort to return to form with two surgically repaired knees. He's been bathing in it. He told reporters after Knicks practice, \"It allows me to create more circulation in my red blood cells. Plus, it's very hot, so it's like a hot tub. But it's also the red wine - just kind of soothes the body .\" ...Speaking of booze: Imagine how many people in the Kansas City area called in sick Thursday? The Royals have kept their postseason perfection party rocking right into the World Series. With a sweep, players and fans have plenty of time to recover and recharge ....Kevin Durant, meanwhile, says he'll be bathing in white wine. No, just kidding. The reigning MVP did have surgery on his fractured right foot, though. He'll be out at least six weeks. The Patriots sent out a Throwback Thursday tweet with a picture of <mark>Mark Sanchez</mark>'s infamous \"butt fumble .\" That, of course, would have been more appropriate if <mark>Sanchez</mark> was still with the Jets, whose spelling is apparently on par with their play-calling. In advance of Thursday's game in Foxborough, the Jets put out a highlight video with the message \"RIVARLY RENEWED .\" ...Connecticut's representation at the World Series might be on camera as much as anyone involved in the fall classic. The difference between former Clippers owner Donald Sterling (banned from the NBA and forced to sell the team in the aftermath of racist comments) and new owner Steve Ballmer? \"Steve is a good dude,\" Blake Griffin wrote in a piece for The Players' Tribune. \"He's like a cool dad who gives you candy. Donald was like a weird uncle .\" ...The UConn men, who won the national title for the fourth time last season, start out as No. 15 in the USA Today/Coaches preseason poll. No. 1? Kentucky, which, of course, was No. 2 when it mattered most in April. Arizona, Duke, Wisconsin and Kansas round out the top five ....Classy move by the Cromwell High cross country team, which has raised $500 to be donated to Komen Connecticut's breast cancer awareness and prevention campaign ....Rutgers football player"}, {"articleID": "2013091903_00040340_W", "names": {"Chris Barrett": ["Q16198009", "Q5105823", "Q5105824"], "Tim Stevens": ["Q1779960", "Q7804335"]}, "date": "2013-09-18", "url": "http://venturebeat.com/2013/09/18/google-glass-is-shattering-6-months-after-launch-multiple-reports-of-breakage-and-breakdowns/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Google Glass appears to be living up to its name. At least, the latter half of it. The sexy prototype augmented reality devices are unexpectedly fragile, breaking down with some degree of regularity after just a few months of use. \"First, a few weeks ago the side of the prism started to delaminate,\" <mark>Chris Barrett</mark> of PRserve told VentureBeat. \"Then I wore Glass to Made in America festival two weekends ago and...the trackpad stopped working. You could still manually take photos, you could still use voice commands, but you couldn't swipe .\" <mark>Barrett</mark> told me about the Glass issues about a week ago, but I didn't think much of it until I saw on Facebook that the most famous Glasshole, Robert Scoble, also recently experienced a breakdown. He posted that the mirror on the prism of his Google Glass \"totally disintegrated\" due to a sticker he put on the end of it, and bemoaned the fact that he was \"contextless in New York\" for a week while awaiting a replacement. \"The prism problem seems to be happening to a other people...and this was only after about 70 days of daily use,\" <mark>Barrett</mark> told me. The question is: How long should Google Glass last, out of the box? What might be acceptable for the \"Explorer\" edition which is in the hands of a few thousand people is one thing, but what consumers who buy them in the millions expect is probably quite another. Google seems to be pretty good about replacements - you send Glass back to Google in a box they mail you, and they'll send you a new pair if the damage wasn't self-inflicted - but the problems also seem to be fairly widespread. A quick Twitter search for \"Google Glass broken\" brings up dozens of recent results. Most of them, of course, are self-inflicted: Well this isn't good. Just pulled my Google Glass out of my bag to find this. Anybody broken theirs yet? Still works. pic.twitter.com/9UkFqR783b - <mark>Tim Stevens</mark> (@ Tim_Stevens) June 20, 2013 That appears to be at least partially the fault of an inadequate case, which one broken Glass victim called \"a cowboy accessory of gray flannel that is closer to a hard-toed sock than to the Bulgari satin-lined jewelry box that would seem to suit fancy Google Glass .\" photo-1 photo-2 broken g Source: <mark>Chris Barrett</mark> broken google glass Source: <mark>Chris Barrett</mark> IMG_1509 Previous 1 of 5 Next Previous Slides Next Slides X photo-1 But <mark>Barrett</mark>'s delamination and trackpad failures - which he attempted to treat with rice, wondering if it had gotten wet - and Scoble's prism disintegration suggest that there are other issues at play, including ones of product quality. I supposed that's not a big shock, given that this is a prototype device, as a Google representative mentioned as he gave me this statement: \"We're in the Explorer phase of Glass's development, so we're eager to hear back from users about their experiences with both the hardware and software. The more feedback we get, the better we can make Glass ahead of our wider consumer launch in 2014 .\" In addition, Google is replacing almost all non-functioning Glass devices for free - although the company will put a $1,500 hold on your credit card while you still have your old Glass in hand. The only occasions it won't do that, the company says, is when the device was damaged deliberately or via lack of care. <mark>Barrett</mark> agrees, saying that \"Google customer service is top notch .\" However, Glassholes who don't want to spend $1,500 on a new pair might want to invest in a more secure case than Google's default version."}, {"articleID": "2015041318_00050395_W", "names": {"Josh Jones": ["Q26269516", "Q29862025", "Q30122055", "Q6289030"], "Harry Knight": ["Q18619353", "Q42319512"]}, "date": "2015-04-13", "url": "http://www.lithgowmercury.com.au/story/3007456/reggies-win-was-pleasing/?src=rss", "content": "h1 itemprop = \"name\" > Reggies' win was pleasing After suffering a number of set backs in the lead up to the 2015 first division rugby league competition, the Lithgow Workmens Club \"Reggies' got off to a winning start to the competition. Not to be outdone, the Oz League side also produced a win marking what was a very successful start to the season. SPEEDSTER: Wolves' Jenna Heath makes a great break. GOOD BREAK: Under 18's Cody Godden puts the big step on as he waits for support. TOP GAME: First division captain coach Kyle Willmott capped off a good game with two tries. ONE of the most pleasing wins of the afternoon for Lithgow Workmens Club was the win by the\" Reggies' (first division). Over the past months, the Wolves have been struggling for numbers after losing several players to the New Era competition. But in the last week, a couple of players came to training to make up what was a pretty good side. Spearheaded by inspirational captain coach Kyle Willmott, the Wolves posted a 22-16 win over Cowra and in doing so played some pretty good football. They worked for each other in defence, ran hard and scored some good tries. Trailing 10-6 at the break, the Wolves finished all over Cowra. They had some good performers in a team where all played well. Outstanding were Willmott who scored two tries, Steve Slaven, <mark>Josh Jones</mark>, <mark>Harry</mark> Bender and <mark>Harry Knight</mark>. \"We have had little time to work on any combinations, but we will only get better in the coming weeks,\" Willmott said. \"I was really pleased with their intensity and never say die attitude .\" It was a good win. \"The other try scorers were Joel Walsh and Keegan Craig. Oz League The Wolves girls got the day off on the right note with an impressive 16-4 win over the strong Cowra side. Cowra struck first with a try to Shailee Dolbel, but from then on it was all the Wolves. They used their speed to good effect with a number of girls having genuine pace. Players such as Jenna Heath, Chrissy West, Tahlia Nugent and Hannah Healey all have athletics' backgrounds and are really quick. Along with those, the other girls are no slouches either and coach Cory Stockton has a side that will really test the opposition with their speed. Best for the Wolves were Maddy Bender, Mallory Goodman, Hannah Healey and Chrissy West in a side where all played well. Try scorers were Gemma King, Chrissy West and Maddy Bender with West also kicking two goals. Under 18 The Wolves went down 34-14 to a very good Cowra side. The young Wolves stuck with them for a good period of the first half, but as the game wore on, Cowra pulled away .\" The boys tried hard, but they missed too many one-on-one tackles, \"coach Ross Harrington said .\" It is something that we are going to have to work on. \"Nathan McAndrew had a good game finishing with two tries while the other try scorer was Nic Miller. Gallery: Portland Central | Scots School | Easter Hat parades 2015"}, {"articleID": "2012040314_00021361_W", "names": {"Bud Anderson": ["Q1095362", "Q4983771"]}, "date": "2012-04-03", "url": "http://roadracingworld.com/news/article/?lnk=rss&article=47775", "content": "jon block group adds fourth rider to 2012 sponsorship lineup apr 03, 2012,? copyright 2012, roadracing world publishing, inc. press release issued by kurt burgess, on behalf of jonblockgroup.com: after a successful 2011 program, along with several 2012 wins (most notably joey pascarella's daytona 200 victory), san francisco consulting firm, the jon block group, has announced they will continue their support in both ama, afm and wera series with an interesting addition to their racer line-up. \"our sponsorship campaign has been impressively successful throughout the past year, due largely to the endless commitment we receive from our supported riders (joey pascarella, cameron gish and wyatt farris). these kids bring a tremendous amount of value to the overall equation, including first-class talent, professionalism, integrity and the occasional milestone achievement that sends a shock & awe blast throughout our corporate office,\" says kurt burgess, who oversees the groups sponsorship efforts. this year, the firm has decided to add another young-at-heart racer to their afm support. <mark>bud anderson</mark>, afm #37 and 2011 afm f40 champion, will join joey, wyatt and cameron this year in the jon block group afm contingency program. <mark>bud</mark> will be representing the firm in both the formula 40 and open superbike classes. at 57 years old, <mark>bud</mark> brings with him a solid fan base, a swift pace and a polished professional image. his sincere commitment to the sport instills camaraderie and a sense of esprit de corps to the entire team. <mark>bud</mark>'s addition provides the firm with a well-rounded program that not only focuses on up and coming junior elite athletes, but also those who have sustained years of top-level athleticism with no signs of slowing down. about the group the jon block group is an internationally recognized clinical affairs consulting firm based in san francisco specializing in orthopedic medical devices with emphasis on the spine, including treatments for sports-related injuries. their primary mission is to expedite regulatory approval and clinical acceptance of emerging and cutting-edge technologies. the group's sponsorship programs focus on bolstering the awareness, and value, of motorcycle road racing sponsorships within the healthcare industry as affordable branding / marketing campaigns."}, {"articleID": "2015040118_00035319_W", "names": {"Jimmy Page": ["Q10426092", "Q165467"], "Jimmy Kimmel": ["Q20793563", "Q4914"], "Dave Davies": ["Q364890", "Q5228642"]}, "date": "2015-04-01", "url": "http://www.guitarworld.com/van-halen-perform-hot-teacher-eruption-and-you-really-got-me-jimmy-kimmel-live-video", "content": "Inventing the Steel: How to Solo Like Angus Young, <mark>Jimmy Page</mark> and Tony Iommi Joe Satriani, Tosin Abasi and Guthrie Govan Join Forces for 2015 G4 Experience - Video Kurt Cobain Talks Gear and More in His Final Guitar World Interview from 1992 Black Sabbath's Geezer Butler and Tony Iommi on Fighting with Skinheads, \"War Pigs\" Inspiration and More In Deep with Andy Aledort: Ozzy Osbourne's \"I Don't Know\" Video Lesson The Guitar Drum, a New Percussive Acoustic Guitar Device - Video The Guitar Drum, a New Percussive Acoustic Guitar Device - Video Van Halen Perform \"Hot for Teacher,\" \"Eruption\" and \"You Really Got Me\" on \"<mark>Jimmy Kimmel</mark> Live' - Video Van Halen Perform\" Panama \"and\" Runnin' with the Devil \"on\" <mark>Jimmy Kimmel</mark> Live' - Video Eddie Van Halen Tests New EVH Gear 5150IIIS Amp Head - GoPro Video Dear Guitar Hero: <mark>Dave Davies</mark> Talks Kinks Reunion, His Kinks-Era Gibson Flying V, New Album and More Video: Brad Paisley Plays Van Halen's \"Hot For Teacher\" with 6-Year-Old Drummer 100 Greatest Guitar Solos: No. 46 \"Hot For Teacher\" (Eddie Van Halen) The Next Bend: Clarence White-Inspired Country B-Bender Lick in A - Video closed down part of Hollywood Boulevard Monday night so that Van Halen could perform in front of 6,000 die-hard fans. The first half of the band's outdoor performance, which included \"Panama\" and \"Runnin' with the Devil,\" was broadcast Monday night (and shared on GuitarWorld.com Tuesday). Last night, the show broadcast several more tunes from the event, including \"Hot for Teacher,\" \"Eruption\" and the Kinks' \"You Really Got Me .\" You can watch these last three songs in the pro-shot videos below. Some of you might notice that David Lee Roth is wearing a bandage on his nose. \"They opened with\" Panama,' but during <mark>Dave</mark>'s microphone-stand ninja moves, he cut his nose, \"says Andy Alt of Los Angeles, who was at the show .\" You can see he's dealing with it in some of the fan-shot videos-until he realizes they needed a bandage to stop the bleeding. \"It was a live taping, so Roth announced they needed to start over. However, it appears Roth didn't tell Eddie [Van Halen] that he was stepping off stage, so Eddie performed an impromptu guitar solo, which was cool and unexpected. The <mark>Kimmel</mark> performance is an extended part of Van Halen's 2015 North American summer and fall tour, which kicks off in earnest July 5 in Seattle. Tickets go on sale April 4. Van Halen's new live album, Tokyo Dome Live in Concert Eventide Announces H9 Max Spring Giveaway: Win an H9 MAX Stompbox Inventing the Steel: How to Solo Like Angus Young, <mark>Jimmy Page</mark> and Tony Iommi"}, {"articleID": "2014042011_00021620_W", "names": {"Robert Kennedy": ["Q27835047", "Q4935237", "Q7346313", "Q7346314", "Q7346315"]}, "date": "2014-04-20", "url": "http://www.duluthnewstribune.com/content/cost-cold", "content": "Family, friends recall rise and fall of Minnesota fugitive minister Canopy of Greysolon Plaza in Duluth to be replaced with history in mind Reader's view: Support bill to make foster care homes smoke-free Reader's view: Letter omitted loopholes in gun sale background checks RedBlueAmerica: Should gun policy halt choice for surgeon general? Tweet Even if the snow and cold finally subside this Easter Sunday, the winter of 2013-14 will go down as one of the toughest in recent memory - and one of the most expensive. The Minnesota Department of Transportation reports that its spending on plowing and maintenance of state roads in Northeastern Minnesota already had reached record levels by the end of March. But, of course, those expenses have continued to mount, thanks in part to the snow and freezing rain that descended on the Northland this past week. Today, we reflect on some of the headaches of the season, including brutal heating bills, frozen pipes, failed roofs and the physical toll the battle between human and winter has taken on many of us. But amid the misery, this winter also has delivered rewards to snow enthusiasts, including the spectacle of the Apostle Islands' Ice Caves and the dramatic resurgence of the John Beargrease Sled Dog marathon. These, too, we will visit. For our disconcerting first stop, we hit the pavement. ROUGH RIDE Last winter was no cakewalk for people charged with road maintenance in the region. MnDOT spent a record-breaking $14.78 million during the winter of 2012-13 clearing winter roads in what it calls District No. 1 - an area that stretches from Canada on south to Pine County, west to Mille Lacs and back north, clear to International Falls. This winter, little respite could be found. Keeping state roads in the district clear had set MnDOT back $14.84 million by the end of March, ensuring that it would handily surpass last year's record. And, of course, winter has continued to exert its hold on the region in April, tacking more onto the season's mounting bill. Cities, too, have struggled to shoulder the costs of a harsh winter. To date this calendar year, the city is running about $230,000 over budget on its snow - and ice-removal costs, according to Peg Spehar, Duluth's chief financial officer. She cited the key drivers as increased use of salt, sand and fuel, combined with higher overtime and equipment maintenance costs. Yet Spehar remains confident the city can absorb the overruns without any special budget appropriations if more normal weather patterns return for the remainder of the calendar year. If the next winter arrives as early and fiercely as this one did, however, all bets will be off. Spehar hopes the city won't see a repeat of calendar year 2013, when back-to-back tough winters forced it to blow through its snow - and ice-removal budget, leaving it $1.1 million in the red. The city was able to make up about $600,000 of the shortfall with savings from other operations, but nevertheless a special allocation of an additional $500,000 was required to cover the difference at the end of 2013. SAND-BAGGED Particularly frigid weather rendered salt an ineffective tool much of this winter, forcing road crews to lean more heavily on sand to help motorists get a grip on Duluth's often icy hillside streets, said Kelly Fleissner, Duluth's maintenance operations manager. Patrick Huston, a MnDOT district engineer headquartered in Duluth, said this winter's unusually cold weather played a large role in driving up costs. \"Even though we had less snow than last winter, we had more cold and persistent ice conditions,\" he said, noting that salt is far less effective at low temperatures. \"We had to use more sand, and sand doesn't stay put. So we had to continually apply it, and that meant our people spent a lot more time on the road this winter,\" Huston said. Through March of this year, MnDOT workers had logged about 25,500 hours of overtime in District 1 - just 100 hours fewer than they did in all of the previous winter. While April numbers have not yet been added to the equation, Huston expressed certainty the current winter will set a new all-time high for the amount of overtime MnDOT road crews worked in the region. Spehar said the overtime hours for city road crews have surpassed expectations, too. While Duluth had budgeted for 34,000 hours of overtime during the early months of this year, she said road workers have already logged about 88,000 so far. SPRING AFTERMATH All the sand applied this winter will mean a lot of work for street cleaning crews this spring. Fleissner said he and his team are eager to remove the grit before it washes into Duluth's streams and rivers. But that work was put on hold by the return of snow last week. Fleissner said crews also would be hard at work filling potholes by now were it not for the latest dose of winter. The winter has done a number on many sections of pavement, and Duluth Mayor Don Ness announced earlier this month that the city will double its budget, spending another $400,000, to fill potholes and seal cracks in local streets. Fleissner welcomes the additional resources. He just wishes for a break in the weather that will allow street repairs to begin at last. In his understated manner, Fleissner said: \"It's going to be a busy spring for us .\" IN HOUR OF NEED No matter how bad the road conditions, emergency calls demand a rapid response. Firefighters and ambulance service providers alike know that they must find a way through whenever and wherever they're needed. But winter weather makes that job much more challenging. \"Access can be a problem, because many of the streets get so narrow during a winter like this one, and the cars tend to stick out further and further because of the snowbanks even if they're parked correctly,\" Duluth Fire Chief Eric Strongitharm said. \"It can be especially tough for us, because some of our rigs are pretty big,\" he said. But Strongitharm said local firefighters have received valuable help from plow drivers and others this winter. He says he knows of no situation where firefighters have failed to reach a fire or emergency scene this winter. <mark>Robert Kennedy</mark>, a paramedic and field training officer for Gold Cross Ambulance in Duluth, made the same claim, pointing to the importance of inter-agency cooperation. \"Every year brings some challenging situations, but this year has been exceptional in the number of days with difficult conditions,\" he said. \"What's most important is being prepared and being able to adapt on the fly .\" <mark>Kennedy</mark> said most winters bring a lull in activity, but this year has been consistently busy. To ensure that service hasn't suffered in adverse weather conditions, he said Gold Cross repeatedly has brought extra units online this winter. Strongitharm said call volumes during this winter were up about 50 percent from the norm when he last checked. He speculated that the increased number of emergencies may be related to the greater number of people holed up their homes, where kitchen mishaps and other household accidents can occur. <mark>Kennedy</mark> noted that calls for falls on ice or injuries related to snow removal from roofs and sidewalks were relatively common this winter, too. FROZEN SKIN The unrelenting cold during much of the winter chilled us to our bones - and out to our skin. \"In 20 years, I've never seen as many frostbite cases as I have this year,\" said Dr. Chris Delp, an emergency physician at St. Luke's Regional Trauma Center. Delp attributed the early onset of cold conditions and recent mild winters for some people not being as protected outdoors as they should have been. Frostbite patients included people who visited the Ice Caves in the Apostle Islands area and competitors in the American Birkebeiner cross-country ski race from Cable, Wis., to Hayward, Delp said. \"Even some very experienced people got frostbite this year because of the unanticipated cold,\" Delp said of the Birkie skiers. The same cold kept people inside so much that the emergency room saw fewer than usual injuries from skiing, snowmobiling and other outdoor activities, he said. But being cooped up indoors may have taken a toll on our mental health. People who already have depressive disorders may have experienced their symptoms to a greater degree this winter, said Dr. David Baldes, a psychiatrist with St. Luke's Psychiatry Associates. \"What I've been seeing in my office is people saying that they've been really stuck indoors,\" Baldes said. \"\"Doc, it's too cold to snowmobile .'\" People who would normally be outside may have been deprived of the physical exercise that is in itself an antidepressant, Baldes said. They also may have been more likely to turn to less healthy behaviors, such as drinking and overeating. But the weather conditions have little to do with Seasonal Affective Disorder, Baldes said. That is triggered solely by the length of the day. And it wanes in spring, even if winter weather lingers. To some degree, almost all of us are affected by the effect of increased light, Baldes said, which makes April and May \"a wonderful time to be a psychiatrist .\" \"People are getting better, and it's probably just because of the lengthening of the day, but they want to give me the credit,\" Baldes joked. SLIPPERY SLOPE Spirit Mountain had been rooting for the return of a good, old-fashioned Minnesota winter, but it may have gotten a bit more than it bargained for this year. The hill got the snow that the ski operation wanted, but they also were saddled with subzero temperatures that repeatedly forced Spirit Mountain to close during what would normally be prime time business hours. While Spirit Mountain opened early and closed late this year, logging what likely was its longest season ever, according to executive director Renee Mattson, she said the hill still will likely finish the ski season in unprofitable territory. The dreaded \"polar vortex\" first took aim at Spirit Mountain when it most depended on business, over the the Christmas holiday season. \"That put a huge crimp in our revenues that we couldn't get back,\" Mattson said. It's like having a guest room that goes unused. You can't make up for it. \"PROBLEM PIPES A harsh winter has taken a toll on pipes, too. Whereas, the city of Duluth typically receives reports of five to 10 buildings per year with frozen water lines, that number soared to about 350 this winter, according to Jim Benning, director of public works and utilities. Within the past couple weeks, the number of calls has diminished, but Benning said the extra work has put a dent in the city's utility budget, which likely will exceed $200,000. That's not including the additional expense the city will swallow for encouraging more than 400 customers to leave water running this winter to avoid repeat freeze-ups. These customers who were asked to bleed their pipes throughout the winter, will not be charged for the extra water they used and sent to the treatment plant, leaving the city to shoulder the cost. Yet this winter has not proven as punishing on the backbones of Duluth's water system as past years. Benning reports that the city's 75 water main breaks so far this winter is down slightly from previous years. He suspects much of the credit goes to the insulating properties of the blanket of snow that covered the ground here in the Northland early and has been slow to lift. TOO MUCH TO BEAR Heavy snows wreaked structural havoc in the Northland this year. Northland homeowners can attest to the difficulties of ice dams and roof damage. But winter also delivered some very public failures, too. Greysolon Plaza's canopy collapsed in December with a large amount of snow on top, though an official cause has not yet been determined. In February, a portion of Miller Hill Mall was closed after a steel roof joist bent below roof-top snow drifts as tall as 15 feet. On April 8, Duluth firefighters were called to a 20-foot hole that had surfaced in the roof of the Duluth armory building. THERMOSTAT ANXIETY Northland residents also felt the financial slap of an unusually cold winter. Between November 2013 and March 2014, local temperatures averaged 18 percent lower than last winter, according to Eric Schlacks, gas and energy coordinator for the Duluth Public Works and Utilities Department. But that's only half the story. Fuel costs jumped this winter as well. People heating with natural gas in Duluth saw their rates climb 28 percent compared with last year, Schlacks said. Households heating with other forms of fossil fuel fared no better. If you burn No. 2 fuel oil, your average cost per gallon rose 97 percent this season. And if you rely on propane heat, your fuel price more than doubled, increasing an average of 146 percent this winter. ON THE PLUS SIDE BEARGREASE: FROM FINISHED TO FLOURISH In 2012, the John Beargrease Sled Dog Marathon was canceled because of a lack of snow. In 2013, the storied race along the North Shore was postponed for six weeks because of unfavorable weather and poor trail conditions. In 2014, thanks to a winter much colder and snowier than average, there were no doubts that the 30th Beargrease would be a go. If anything, there was too much snow; wind-stacked drifts along the trail challenged mushers and their dogs for much of the race in late January. But those challenges aside, the frigid winter aided a remarkable turnaround for the race. After the troubles of the previous two years, race officials in October 2013 had announced they would be canceling the 2014 edition for lack of money. New leadership stepped up, stepped in and revived the race - and were fortunate to avoid the lack-of-snow concerns that had dogged the previous organizers. The 2014 race drew big crowds at the start and finish, and the bitterly cold temperatures - which closed schools and canceled events statewide while the race was underway - left people at home tracking the mushers' progress online .\" Here we are standing at the finish line after no one thought this race was going to happen, \"race director Jason Rice said as musher Nathan Schroeder of Chisholm won his second-straight Beargrease title .\" We went from saving it to slingshotting it into the future. \"ICE CAVES: A BEAUTIFUL BEACON OF WINTER For two months, along a portion of the Lake Superior shore near Cornucopia, the bitterly cold winter that brought so much misery elsewhere in the Northland created an awe-inspiring icy spectacle that drew tens thousands of visitors. Access to the ice-bedecked mainland sea caves in the Apostle Islands National Lakeshore opened in mid-January, the first time in five years that the caves were accessible in winter. By the time ice conditions deteriorated and access was closed in mid-March, an estimated 125,000 people had traveled to Bayfield County to make the hike along the shore to the caves. The News Tribune was among the first media outlets to carry photos from the ice caves. After that, stories and photos spread rapidly around the region and around the world, thanks in large part to social media. Sunday's weather for Duluth and the Northland: The weather we've been waiting for Family, friends recall rise and fall of Minnesota fugitive minister"}, {"articleID": "2017111302_00561886_W", "names": {"Katherine Grieve": ["Q43392914", "Q43393914"]}, "date": "2017-11-13", "url": "http://www.woodstocksentinelreview.com/2017/11/12/ontarios-lieutenant-governor-elizabeth-dowdeswell-visited-the-4-h-oxford-showcase-friday", "content": "Ontario's Lieutenant Governor Elizabeth Dowdeswell visited the 4-H Oxford showcase Friday By Greg Colgan, Sentinel-Review Sunday, November 12, 2017 9:28:43 EST PM Lieutenant Governor of Ontario Elizabeth Dowdeswell spoke to a crowd of more than 100 during a Oxford 4-H Showcase in Woodstock, Ont. on Friday November 10, 2017 at the Oxford Auditorium. Greg Colgan/Woodstock Sentinel-Review/Postmedia Network Tweet Change text size for the story Print Report an error WOODSTOCK - Ontario's Lieutenant Governor Elizabeth Dowdeswell visited Woodstock Friday evening. The province's 39th representative of the United Kingdom and the Commonwealth - the 29th since Canadian confederation in 1867 - spoke for 15 minutes to the crowd of more than 100 people at Oxford Auditorium during the 4-H Oxford showcase. In her speech, she emphasized the role 4-H played during her youth in helping teach her life lessons she continues to use in her role as Lieutenant Governor. \"I think it's a very big moment for the kids to see, especially having someone of that stature explain how 4-H has helped them,\" 4-H Oxford chair Dwight Hargreaves said. \"People are always looking for work and if you mention 4-H in your interview, that can help because they know the value 4-H has instilled in their members .\" Dowdeswell has travelled much of Ontario since being appointed Lieutenant Governor in 2014. She discussed the theme of sustainability as well as visiting towns and cities throughout Ontario to listen to their concerns, but also what makes them proud of their communities. Following her speech, Dowdeswell mingled with 4-H Oxford members and visited the different stations that had been set up to showcase information on 4-H and projects it's members had completed. The process of getting Dowdeswell to visit Woodstock began several months ago when 4-H Oxford volunteer <mark>Katherine Grieve</mark> saw her speak on a TV news show. During the interview, Dowdeswell mentioned how 4-H had helped her when she grew up in rural Saskatchewan after emigrating from Northern Ireland with her family at a young age. After <mark>Grieve</mark> submitted an application for Dowdeswell to speak in Oxford, they were able to set a date to coincide with the 4-H Oxford showcase. 4-H is a worldwide youth organization focusing on helping to develop youth between six and 21. The four H's stand for head, heart, hands and health. 4-H Oxford has more than 200 members and more than 50 volunteers. \"It's a youth focused evening and we wanted to hear the impact 4-H has had on Her Honours (Dowdeswell) life with her experiences,\" <mark>Grieve</mark> said. The Lieutenant Governor position is a viceroy representative of Canada's head of state, Queen Elizabeth II. The rest of the evening featured square dancing, collecting donations for Farm Credit Canada Drive Away Hunger campaign and viewing of several displays spread throughout the Oxford Auditorium. Members of 4-H Oxford were also presented with awards for completion of projects. \"I hope it empowers them,\" <mark>Grieve</mark> said of what she hopes members take away from hearing Dowdeswell speak. \"It's interesting to hear how it helped prepare her. In our 4-H projects we help the youth learn public speaking, parliamentary procedure, judging or critical thinking skills. We work that in so our members become confident and make judgements from buying groceries to doing their job .\" To have someone of Her Honours stature visit and share her time is a privilege and one the youth can learn from, \"she added. gcolgan @ postmedia.com twitter.com/GregatWSR"}, {"articleID": "2015011214_00049418_W", "names": {"John Cowan": ["Q16196890", "Q16730319", "Q19276601", "Q56254372", "Q6227357"]}, "date": "2015-01-12", "url": "http://www.mortgagesolutions.co.uk/mortgage-solutions/news/2389800/questions-raised-over-sesame-protection-premiums-and-commissions", "content": "Questions raised over Sesame protection premiums and commissions Mortgage Solutions | 12 Jan 2015 | 13:56 An analysis of premiums and commissions found that premiums for protection products sold by Sesame's \"restricted focussed' advisers can be as much as 13% higher than for an identical product sold by its\" universal' advisers. Sesame restricted panel providers all deny breaching FCA inducement rules Sesame angers advisers with past advice crackdown after £ 6m fine The investigation had been prompted by concerned Sesame advisers. Providers have said the differences are down to Sesame, not them. Sesame Bankhall group chairman <mark>John Cowan</mark> said the model of charging higher premiums in one part of a business over another is \"the general market position, it pertains inside all sorts of financial services businesses\". But advisers have suggested the approach may not represent treating customers fairly (TCF). All Sesame advisers are \"restricted' by the regulator's definition, but the network operates two advice models within that. The first is\" universal', a whole of market arm which largely houses those Sesame advisers who were independent under the pre-Retail Distribution Review (RDR) definition of the term. The second is \"focussed', a much smaller proposition for advisers who must pick products from a panel of around six providers. In illustrations provided by Sesame advisers to Professional Adviser, for an individual, 15-year £ 200,000 life insurance policy for a male, non-smoker born in the 1960s, the difference in the monthly premium paid by a client of a\" universal' adviser can be about £ 5 less than a client transacting with a \"focussed' adviser, depending on provider. Over the lifetime of the policy, that means the client would pay around £ 1,000 more with a Sesame restricted focussed adviser. However, the difference is even starker in the example of a couple where critical illness (CI) cover and a waiver of premium - known as premium protection - have been added. In another illustration, for a husband and wife who are both non-smokers and are both aged 49, buying 20-year life insurance with CI cover and premium protection using a Sesame focussed adviser, the monthly premium is £ 418. For the same couple, taking the same products, from the same provider, but using a Sesame universal adviser, the monthly premium is £ 369 - 13% less. Over the 20-year lifetime of those products, the couple using the focussed adviser would pay £ 11,544 more than if they had gone to a universal adviser. The model Focussed protection advisers must choose products from a panel of just six providers: Aviva, Aegon, Bright Grey, Zurich, PruProtect and Friends Life. Universal advisers typically choose from around 13. There is no requirement for a Sesame focussed adviser to tell a client they could buy the same product cheaper from one of the network's universal advisers. The amount of commission paid by providers for products sold via Sesame's focussed advisers is also significantly higher, as commissions are linked to premiums. In the example of the couple above, the difference in the upfront commission paid is almost £ 5,000. Commission is paid by the product provider directly to Sesame, which takes its cut before passing the remainder onto the adviser. According to Sesame advisers, the network takes a single digit percentage of the per product commissions earned by universal advisers, but a percentage around three times higher on the greater commissions paid by providers for products sold by focussed advisers. Protection advice was not included in the commission ban, meaning advisers can still get paid by the providers of the products they sell. The amount they get paid must be disclosed to clients, but - like with the premiums - clients would not realise the different amounts being paid for the sale of products via focussed and universal advisers. Sesame Bankhall group chairman <mark>John Cowan</mark> said the model of having higher premiums and commissions in some parts of a business\" is not exclusive to Sesame \".\" It is the general market position. It pertains inside all sorts of financial services businesses. Certain business models are constructed in different ways. Different premiums are paid for products. The different price is due to differences between the universal and focussed advisers' business models, \"he said .\" Out of the higher commissions, professional indemnity (PI) cover is bought for [focussed advisers], regulatory fees are paid. But focussed advisers run a business for which they can charge a premium for. \"He added that the focussed part of the business is\" tiny \", with less than 50 advisers choosing that model. Sesame has around 2,000 adviser members in total. He defended the lack of disclosure to clients about the difference in price and commissions between Sesame's focussed and universal advisers .\" When someone goes to a universal adviser they don't have a conversation about restricted versus independent. It's the same when an adviser is restricted focussed. The world doesn't work like that. If I go to an IFA in London and Poole I'll get charged a different price for the same service, \"he said. But advisers said the model is more akin to two clients being charged differently for the same service by the same adviser. One, who asked not to be named, said:\" What doesn't sit right with this scenario is that we are effectively talking about the same distributor. Different adviser firms, but the products being distributed are being facilitated via the same network. If these were rival distribution channels, say IFA versus non-advised, then all's fair in love and war. But in this scenario the two advisers are operating under the same umbrella. \"The providers Asked why providers who feature on the focussed protection panel were willing to pay higher commissions, <mark>Cowan</mark> admitted it is probably because they think they are going to do more business due to the restricted nature of the options available to the advisers using it .\" The provider is paying higher commissions probably because they think they are going to get a lot of business from the focussed panel. Loads of life companies operate that system. We couldn't offer that unless the life companies are offering that. It must be profitable for them, \"he said. The Financial Conduct Authority (FCA) fined Sesame £ 1.6 m in October after it found the network had set up what it termed a\" pay-to-play' scheme, relating specifically to the panel used by its focussed investment advisers. The range of products recommended to Sesame clients under its focussed investment advice service was influenced by the amount product providers were willing to pay Sesame for certain services, the regulator ruled, saying it \"undermined the ban on commission payments brought in by the RDR\". All seven product providers on Sesame's \"focussed' restricted investment advice panel denied breaching the regulator's rules on inducements. Professional Adviser spoke to each of the six providers on Sesame's restricted focussed protection panel. All of them refused to discuss their commercial terms. However PruProtect, which gave the most detailed response, said the difference in premiums is down to Sesame .\" Networks and other distributors ask insurers for different pricing strategies for certain circumstances, it would be a question for the network or intermediary as to why they do so, \"a spokesperson for PruProtect said .\" We have a standard price (premium) which we set but some distributors ask for different pricing to suit certain strategies. Networks would tend to do this at group level rather than by individual adviser. It's a question for the network as to what their strategy is and why they need differentiated premiums, \"he said. On the difference in commissions he added:\" While we do not comment on any specific arrangements, it is common practice for protection insurers to vary the level of commission paid to intermediary firms depending on a range of different factors and commission payments are fully disclosed within all quotes provided. \"Aviva, Aegon, and Friends Life said only that they would not comment on commercial terms with individual distributors. A spokesperson for Zurich said:\" Zurich works diligently to ensure that all of our arrangements with key distributors and third parties deliver good outcomes for our customers. We consider the overall business opportunity of each distribution model separately and so the commission terms will vary between different agreements. \"Bright Grey also said the differences between the restricted focussed commissions and premiums and those of the universal proposition were negotiated by Sesame .\" Our distribution partners offer a range of different protection propositions, each of which is underpinned by different features and services such as technology, training, compliance and research. Vote in our polls, get your opinion across on the news and watch out for our weekly editorial round-up features. Withdrawn XF003, XF004 and XF001 and XF002 and launched XF0013, XF0014, XF0015 and XF0016"}]