[{"articleID": "2012012809_00080042_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Chris Canty": ["Q3675459", "Q5106084"], "Sebastian Vollmer": ["Q124879", "Q45774867"]}, "date": "2012-01-28", "url": "http://nypost.com/p/sports/giants/block_key_5U3u0Qt1hZZEr2SSjchOIL", "content": "giants blog last updated: 4:18 am, january 28, 2012 mark cannizzaro foxborough, mass. - the subject is already a sore one for the patriots. and, because the scab is going to be picked at for the next week, the wound might be bleeding by kickoff in super bowl xlvi. yes, the patriots are well aware the giants defensive front had as much do to with their devastating perfect-season-ending super bowl loss four years ago as david tyree and divine intervention did. yes, the patriots know the giants defensive front was a big part of the reason they lost to them again earlier this season, a 24-20 defeat at gillette stadium. pressure point: the patriots offensive line, ransacked the last time they met the giants' fearsome pass rush in the super bowl, will be asked to respond with better protection of <mark>tom brady</mark> this time around. and yes, the patriots realize the giants defensive front could be the difference in this super bowl if it is able to manhandle the new england offensive line again. \"every time we play them you talk about their defense, their pass rush,\" patriots quarterback <mark>tom brady</mark> said. \"we have our work cut out for us .\" with the super bowl week media onslaught having not even begun yet, <mark>brady</mark> and his offensive line are going to be sick of hearing the names jason pierre-paul (16? sacks, two forced fumbles), justin tuck (five sacks), osi umenyiora (nine sacks, two forced fumbles) and <mark>chris canty</mark> (four sacks). the members of the patriots' offensive line are going to be reminded over and over about the job the giants' defensive front did on them in the super bowl four years ago. it promises to be one of the themes of the week. eli manning was named the mvp of that super bowl, but anyone who watched the game (including eli) knows the giants' defensive front should have been given that honor. that made the patriots' offensive line the goats in that game. \"that was four years ago - next question,\" patriots left guard logan mankins said yesterday when asked about that super bowl. touchy, touchy. \"i don't think i was there for that one,\" patriots left tackle matt light said, making an attempt at humor while deflecting the question with a non-answer. \"they're all very good athletes,\" said light, the senior member of the line. \"they can line up anywhere, whether they're walking around behind the line or switching from defensive end to defensive tackle, those guys are an athletic group .\" they play well with each other, running [pass rush] games. when you have a group like that you can't just isolate any one of them. other teams try to do similar things with their guys [as the giants do] moving them around, but i'd say [the giants] are probably the best. \"they're very opportunistic. they capitalize on other peoples' mistakes, and they're athletic enough to create a lot of plays on their own. they're a confident group, and they should be based on the way they've been playing .\" light, mankins and the rest of <mark>brady</mark>'s protectors - a group that likely will include rookie right tackle nate solder, who has been playing in place of the injured <mark>sebastian vollmer</mark> - know they need to be the difference in the game. if they aren't, then the giants' defensive front again will be the difference, and perhaps this time will be named the collective mvps. even the great <mark>brady</mark> is vulnerable when he gets knocked around, especially with pressure up the middle, because his comfort zone is stepping up in the pocket. \"they can rush the passer, there's no doubt about that,\" <mark>brady</mark> said. \"they put a lot of pressure on you with their front four. they get a lot of turnovers. they have a big, physical group that plays really well together .\" mankins said a key to handling the giants' front is recognizing their personnel from play to play, because they often have four defensive ends in the game and no defensive tackles, making them a more dangerous pass-rushing bunch. new york post is a registered trademark of nyp holdings, inc. ."}, {"articleID": "2017051320_00483408_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-05-14", "url": "http://www.freepressjournal.in/world/donald-trump-may-be-a-poet-without-knowing-it/1067682", "content": "Home / World / <mark>Donald Trump</mark> may be a poet without knowing it! <mark>Donald Trump</mark> may be a poet without knowing it!--By | May 14, 2017 12:08 am Agencies FOLLOW US: make poetry great again Oslo: \"I know words...I have the best words,\" <mark>Donald Trump</mark> had once said in his superlative way. Now those words by the US President have been pulled together as a collection of poetry in Norway. Who knew? <mark>Trump</mark> the poet? \"What <mark>Trump</mark> says is closer to poetry and fiction than to reality,\" said Chris Felt, the Norwegian man who created the collection. \"We're appalled that his rhetoric which seems to have little thought or preparation behind it could have won an electoral campaign,\" Felt said. The book's tongue-in-cheek title is \"Make poetry great again'--a play on <mark>Donald Trump</mark>'s campaign slogan\" Make America great again'. The content is composed strictly from speeches, interviews and other statements that the 70-year-old has given over the years. Among the choice bits turned to poems in the book are words about his daughter that <mark>Donald Trump</mark> said around 10 years ago. \"I have said if Ivanka were not my daughter, perhaps I would be dating her .\" Felt said the words may be \"terribly macho, pitiful and confusing but when the quotations have space around them I see other facets of him\". Reading <mark>Donald Trump</mark>'s words as poetry, Felt said he felt in them \"more despair, more insecurity and perhaps an inferiority complex\". According to the publisher, Kaggen, the first print run was 2,000 copies--one of which has been sent to <mark>Donald Trump</mark>. Now the question is whether his penchant for superlatives will make it a \"bestseller\". Share this Post:"}, {"articleID": "2017062216_00388585_W", "names": {"Jackie Robinson": ["Q1631748", "Q3805723", "Q731871"], "James Brown": ["Q16195919", "Q19324906", "Q21003859", "Q23664069", "Q27915121", "Q27915122", "Q28567916", "Q30122834", "Q43127964", "Q43914306", "Q44476131", "Q46143791", "Q47414128", "Q51586591", "Q57942983", "Q6130307", "Q6130311", "Q6130322", "Q6130325", "Q6130327", "Q6130333", "Q6130335", "Q6130341", "Q6130343", "Q6130347", "Q6193882", "Q975078", "Q980087"]}, "date": "2017-06-22", "url": "http://www.thebatavian.com/mike-pettinella/marshall-film-that-featured-old-county-courthouse-to-open-in-theaters-on-oct-13", "content": "\"Marshall' film that featured Old County Courthouse to open in theaters on Oct. 13 posted by Mike Pettinella in news, Old Genesee County Courthouse, Marshall film. Last June, downtown Batavia was in the spotlight as an on-location site for the new movie,\" Marshall, \"which stars Chadwick Boseman as a young Thurgood Marshall, an attorney for the NAACP who later became the first African-American justice on the U.S. Supreme Court. At that time, I wrote a story for The Buffalo News, and it started out as follows: BATAVIA--If you happen to be in a movie theater late this year (or possibly in the fall of 2017, depending upon the release date), watching intently as Chadwick Boseman in his portrayal of Thurgood Marshall climbs the 17 steps to a 1940's Oklahoma courthouse door, here's some insight into that scene: It took place in Batavia, New York around 6:30 p.m. on Wednesday, June 1. The crew of Marshall Movie Inc., about 70 strong, shot a trial scene and an entrance scene for the feature film,\" Marshall, \"at the old Genesee County Courthouse at the intersection of Route 5 and 63 in downtown Batavia. Fast forward to today, and we've learned that the film will open in theaters on Oct. 13. A trailer, which includes a quick shot of the old courthouse, as been released and can be viewed by CLICKING HERE. The movie focuses on a pivotal case in the career of Marshall, who served on the nation's highest court from 1967-1991. He died in 1993. In the first shooting at the Old County Courthouse, Boseman--who starred as <mark>Jackie Robinson</mark> in\" 42 \", <mark>James Brown</mark> in\" Get on Up \"and T'Challa in the Marvel Studios film\" Captain America: Civil War \"--walked up to the courthouse door with a bounce in his step, showing that he was ready to defend his client in the Oklahoma County of Choctaw courtroom. In the second, he had to walk past five\" locals \"who formed a wall in front of the steps. Director Reginald Hudlin said he wasn't sure which scene would be used, saying he shot the second one after something told him to try a different angle .\" I'm leaning on the first one, \"said Hudlin, who said the crew's two days in Batavia, as well as their time filming in Buffalo, has been a tremendous experience. The scenes from the Oklahoma trial are a very small piece of this story--about three to five minutes of a case Marshall defended while traveling across the country for the NAACP."}, {"articleID": "2015120705_00052950_W", "names": {"John Mcmahon": ["Q27915237", "Q27915238", "Q6248117", "Q6248119", "Q6248121"], "Mike Morrell": ["Q55375276", "Q6848113"]}, "date": "2015-12-07", "url": "http://sbsun.com/general-news/20151206/inland-empire-leaders-react-to-obamas-san-bernardino-shooting-address", "content": "Inland Empire leaders react to Obama's San Bernardino shooting address and Ryan Hagen, The Sun Posted: #Comments SAN BERNARDINO>> Less than a mile from where 14 people were murdered four days earlier, Inland Empire leaders listened intently in Rep. Pete Aguilar's Congressional office as President Barack Obama gave the third Oval Office address of his presidency. The main points of Obama's speech--that this was an act of terrorism, that the United States will overcome ISIS, that more gun control was necessary and that Muslims should not be scapegoated--hit the right note, said the group of 20 people invited by Aguilar's staff. Aguilar, D-San Bernardino, himself said in an interview afterward that he wished the president had gone into more details and was hesitant to send \"too many\" American troops to fight the extremist group, but largely applauded the plan. Obama called on Congress to increase restrictions on who can legally buy a gun--again singling out those on the \"no fly list,\" who aren't currently restricted from firearms access--and Aguilar said those steps should get broad support. \"My friends who own guns also think background checks are important when we're talking about our safety,\" Aguilar said. \"Even before this tragedy, San Bernardino has had a problem with gun violence, and this is an important step to prevent that .\" Aguilar was joined by other community and elected leaders, including Mark Takano, D-Riverside, who said he wholeheartedly agreed with what Obama said. \"I was choked up, especially when he spoke about living with our friends and neighbors,\" said Takano, whose district includes the homes of two victims of the attack and a mosque Syed Farook attended. \"I think the American people respond to a leader who challenges us to hold fast to our ideals .\" Takano's family had been sent to internment camps during World War II, and it was important to avoid targeting innocent Muslims now, Takano said. Some sitting and some standing, taking notes or nodding and murmuring, the group was mostly restrained and somber as Obama spoke. Vernon Lambert, pastor at Living by Faith in Redlands, reacted more passionately, agreeing aloud from time to time. \"This is an important message and one I hope people, including my congregation, listen to,\" Lambert said afterward. \"Yes, we need more gun control, and yes, we need to respect all of our rights .\" San Bernardino City Councilwoman Virginia Marquez was the only city official at Aguilar's office, and she said the attack had demonstrated the city's resiliency. Advertisement \"As soon as it happened, I went into gear, and the whole community responded flawlessly,\" Marquez said, while declining to comment on the speech. \"This is a challenge, but San Bernardino is strong and it's getting stronger .\" Other local leaders demurred when offered the chance to comment, including San Bernardino Mayor Carey Davis, Assemblyman Marc Steinorth, R-Rancho Cucamonga, and San Bernardino County Sheriff <mark>John McMahon</mark>. State senator <mark>Mike Morrell</mark>, R-Rancho Cucamonga, could not be reached for comment. Rep. Adam Schiff, D-Burbank, applauded Obama's call to make it illegal for those on the government's \"no fly\" list to own firearms and his desire to curb access to \"assault weapons .\" \"Ultimately, ISIS must be defeated on the ideological battlefield as well as militarily. And in this facet of the struggle--as the president pointed out--the Muslim community at home and abroad must be our chief ally,\" Schiff, the ranking member of the House Permanent Select Committee on Intelligence, is quoted as saying in a press release issued after the president's speech. \"We will continue to work closely with the Islamic community in the United States to identify those at risk of radicalization and must do far more with the community abroad to counter the pernicious bastardization of the faith that urges the slaughter of innocents .\" He also said he agrees with the president's intention to take the fight to ISIS and al-Qaida, saying he and his staff have been working on new legislation that would authorize the presidential use of force against both groups. \"We are confronting a pernicious enemy that we will fight and defeat,\" Schiff's press release concludes. \"And as we do, and even as we are vigilant, we will hold true to our principles and values by celebrating our freedoms, treating others with respect, and giving refuge to those in need .\" About the Authors Beau Yarbrough covers education and politics for The Sun and the Inland Valley Daily Bulletin. Reach the author at Beau.Yarbrough @ langnews.com or follow Beau on Twitter: @ lby3."}, {"articleID": "2017120703_00182143_W", "names": {"Peter Davison": ["Q16090277", "Q19876980", "Q21932415", "Q358427", "Q7173573"]}, "date": "2017-12-07", "url": "http://trollslum.wikia.com/wiki/SuicidalArsonist?diff=42667&oldid=42491", "content": "Revision as of 04:41, November 26, 2017 (edit) 108.44.197.110 (wall) (FUCK) ← Older edit Latest revision as of 02:35, December 7, 2017 (edit) (undo) SuicidalArsonist (wall | contribs) Line 244: Line 244: * Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. * Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. * Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. * Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. + * Jay doesn't believe in blood colour being related to Zodiac, so they just decided \"Teal-Blooded Gemini, why not?\" Anyone who criticises Toraum for his sign in front of Jay will have their kneecaps broken. [[Category: Teal/Blue Blood]] [[Category: Teal/Blue Blood]] [[Category: Male]] [[Category: Male]] Latest revision as of 02:35, December 7, 2017 Contents [show] Basic Information Edit Toraum Zwilig If you think about it. . We all go through change in our lives even when we don't expect it. I wasn't expecting to go blind and lose my right arm, but it happened. AKA The Doctor, Doc, Toto Title Heir of Space Age 9 Alternian Solar Sweeps (19 Human Years) Screen Name suicidalArsonist Typing Style Toraum: Replaces O with 0, i with 1, S with 2. The Doctor: Uses perfect grammar and syntax. Symbol Gemini Strife Specibi Firekind Fetch Modus Burn, Formerly Deck of Cards Relations The Novelist/Arsonist (Ancestor) Krakau Zwilig (Dancestor) Lodove Planci/Zwilig (Wife) Khimio Vuqtoz (Moirail) Jay (Best Friend) Planet Land of Light and Fire Likes History, Electro Swing Music https: //www.youtube.com/watch? v=7QU1nvuxaMA Toraum Zwilig, later known as Doc, is a male teal blooded troll. He is an Heir of Space. His associated zodiac sign is Gemini. The first part of his handle, suicidal, is referring to the fact his Accident was viewed as one of his many suicide attempts by his Moirail and best friend. The second part of his handle, arsonist, is referring to the fact he was often fascinated with fire before the incident. Etymology Edit Toraum is a combination of two german words. \"Tot\" meaning dead, referencing his personality. and \"Raum\" meaning Space, referencing his god tier. \"Zwilig\" was shortened from Zwillinge, meaning Twins in german. Introduction Edit> Be that one blind blue guy. Your name is TORAUM ZWILIG. You like to play with CARDS, suprisingly you can actually do some pretty amazing tricks. Your favourite card is the ACE OF SPADES. You used to study your ANCESTOR, how he was first a well known NOVELIST, but then he went mad and became known as the ARSONIST. You tried to copy one of his habits of lighting candles in his hive so he could still see in the dark, but you ended up dropping one and set your entire house ablaze. You lost your RIGHT ARM and EYESIGHT that day, but luckily your moirail found you at the right time and possibly saved you from certain death. Your trolltag is suicidalArsonist and you tend t0 2peak 1n a manner that 1s referenc1ng the c0d1ng 0f a c0mputer. Fire Edit Toraum spent most of his time inside studying, mainly studying novels from the Novelist, and learning about his slow descent into madness. Toraum was on the last novel that he had wrote before he was murdered, and found a note in the back. To Whom It May Concern, I don't have much time left in this world, they're coming for me. I can sense that they are going to kill me, just by his nature. I try to keep calm around him, but he seems to be devoid of all emotion. They claim to be a \"Time Lord\" , whatever that means. . They're a very dangerous person, let's just hope he doesn't come for you. They said they were going to come after my next of Kin, and said one of them is going to study all of my novels and then die in an \"Accident\". . Let's both hope you're safe, for my sake. ~ ARSONIST But it was too late, while he was reading the letter, a man had snuck in with intent to kill, he had a smile across his face. Before Toraum could say anything, the man dropped a candle onto Toraum's carpet, setting the house ablaze. Toraum managed to escape through the back, clutching onto his arm before being crushed by the rubble of his house. Toraum recieved a scar on his left him, lost his right, and lost his eyesight as a result. Toraum was later diagnosed with Post Traumatic Stress Disorder, upon the sight of fire, he goes into a state of shock and could possibly pass out. Robotopia Edit After his session, Toraum stumbled into the world of Robotopia. There he helped locals by offering the residents services that the government couldn't give. He built people houses, helped the local government with its budget and made sure the city was happy. He worked as a Piano Player for a Restaurant. One of Two Endings Edit There are two ways that Toraum's future ends, both of them do have quite a story to tell. Toraum ended up having an Anxiety attack and broke down into tears on stage after failing to play \"Plucky Daisy\" and was fired. After that, things just seemed to take a turn for the worse. Constant Death Edit Khimio Vuqtoz, Toraum's Moirail, was found dead in a street alley after a little fight with robbers. Toraum broke down and cried during the funeral. Jay, Toraum's Closest friend, was brought into emergency care after the food he had eaten at a restaurant was found to have contained very lethal amounts of Potassium Cyanide. They died a few days later. With nobody to turn to, Toraum felt that everything in life had lost meaning. His closest friends were dead, and he had nobody else to turn to. Getting Help Edit Eventually, Emergency Care was called and Toraum was taken to the hospital. There he was nursed back to health and given lots of love and care. Toraum asked for his friend Khimio's house to be searched in an effort to recover anything that could be used as a memoir for his deceased friend, they found a blue rose and plans for a robot design. Toraum cried when he saw the rose, and asked if they could try and follow the blueprints to see just what his friend wanted to build before he was murdered. Robot Edit The blueprint was for a \"Battery-Powered Orb Head\" Robot. Khimio's body was exhumed and the contents of his brain were put into a hard drive and placed inside the robot. Khimio was reborn, but suffered from massive amnesia. Toraum helped him regain his memories and then asked if he could try and help scientists build a robot for Jay. Khimio, with tears in his eyes, agreed to help them build the robot and bring them back to life. Jay was brought back as a robot 5 days later. With his friends by his side and a newfound sense of happiness, Toraum finally felt that things were going to be alright after all. Research Edit Toraum ended up getting a degree in Psychology and studied Mental Disorders, such as Autism. His in-depth research in the field of Psychology ended up him being recognised as a role-model for Psychologists everywhere. (wip ajklsdgjas) Toraum met his future wife, Lodove Planci, while working his day job as a piano player for a restaurant. He was taking song requests and he invited her up to play a piece with him. The Piece they played together was called \"Plucky Daisy\". It can be found here. https: //www.youtube.com/watch? v=9Stb6HIBw8M After the show, Toraum asked Lodove if they wanted to hang out sometime, and they did. A few months later, Toraum confessed his love and the two got married within the next month. They had two beautiful children, Mirari and Dergan Zwilig. The Zwilig Family. Betrayal Edit A local Mafia, whom Toraum had been helping pay off debts, had turned on him. Due to members of that mafia being affiliated with government officials, Toraum was convicted of 1st Degree Murder, Arson, and Child Abduction after a house in the area burned down and one of the sons of the victim of the fire had been found in Toraum's custody. Toraum pleaded not guilty due to a lack of evidence and false testimony being given, alas that was not enough to save him. He was sentenced to Death by Lethal Injection. Toraum took the time in his cell to write his wife his final letter. Dear Lodove, I just went to court for another hearing today, I was given the death penalty. I don't have much time left...But before I go, tell the kids that daddy will always love them and that he will always be thinking about them. I didn't do the crime, but they found me guilty because the witnesses had a solid alibi and they all linked me to the crime. The execution date is tommorow, but I'm not ready to go. Not like this. . I don't want to go. . I love you so much. Thank you for everything, and goodbye. ~ Toraum Death Edit Toraum was executed by lethal injection, as the court had ordered. Toraum requested Khimio be by his side to comfort him as he died, and this request was granted. Upon his death, Khimio visited Toraum's grave, placed a blue rose onto it, and swore to find the true circumstances about Toraum's death. Rebirth Edit Extensive research done on Khimio's part had shown that Toraum was not only innocent, but the prosecution had been blackmailed into getting a guilty verdict. Khimio had used his skills in robotics to attempt to revive Toraum. It took a few weeks, but he had succeeded. Toraum was officially brought back. He suffered from massive amnesia, appearing to not even know who he was or have any recollection of any of his past life memories. With the help of Khimio, he discovered the truth behind who he was and what happened. Toraum requested that he just be referred to as \"Doc\" as he didn't want to arouse any suspicions. Doc inside his charging pod. Sacrifice Edit Toraum came home to Mirari and Dergan crying. When Toraum asked what was wrong, they both replied, \"Dad, Mom isn't waking up!\" Toraum then followed them to find Lodove on the floor, dead. Toraum looked at them with tears in his eyes and said, \"Mom's gone. . and she's never going to come back .\" Toraum comforted his children reassuring them that Lodove loved them until the very end, as he did. Toraum begged and pleaded with Khimio to help him bring back his deceased wife. He reluctantly agreed to do so due to stress related reasons. Regardless, Khimio managed to finish working on Lodove's robot body and was brought back to the world of the living 2 weeks later. Upon Khimio being recognized for his actions, Khimio died of a heart attack during the knighting ceremony. Move Edit Upon Lodove being brought back to the world of the living, Toraum and his family moved to England after Toraum had been offered a position at the University of Cambridge as a Psychology Professor. Toraum was brought to Buckingham Palace a few weeks later, and was knighted for his service to the field of Psychology, Toraum had done research to help get a better understanding on Mental Disorders. Ancestor Edit The Arsonist Edit The Arsonist is the ancestor of Toraum Zwilig and the post-scratch incarnation of Krakau Zwilig. The Arsonist wielded a firekind specibus, much like Toraum. Although it's worth mentioning he has a knifekind specibus, filled with various kinds of knives. The Arsonist was originally a well known Novelist who published many fantasies that would spark controversy with the other highbloods, referring to the fact that most purple bloods in his books were considered heartess, cruel psychopaths. The Arsonist (called the Novelist at the time) often wrote stories about mythical creatures, murder mysteries and revolutions that he would hear about from Jay (Pre-Regeneration), his stories were often over-exaggerated and quite appealing to the Lowblooded castes. He was known to have caused outrage with highbloods and eventually befriended The Picaroon. Upon hearing of The Picaroon's Death, The Novelist went beserk. The Novelist went completely insane. He started by setting hives on fire, starting with a lot of purplebloods and seadwellers then resorting to raiding hives, killing the residents inside, looting them and then setting their hive on fire to dispose of the body. The Arsonist managed to narrowly managed to escape death by setting the entire courthouse ablaze, killing everyone inside except him. He was finally caught when Jay, one of his closest affiliates, confronted him about his crimes and murdered him. Toraum studied his Ancestor's novels, even the ones he wrote as he descended into madness. Toraum is often frightened whenever he thinks of his ancestor, saying \"He wa2 a danger0u2 tr0ll, but he d1d 1t f0r a ju2t1f1ed rea2on, 1 gue22 .\" The Novelist was a troubled man who spent most of his time with his closest friends, and he ended up getting murdered by someone he trusted completely. Dancestor Edit Krakau Zwilig Edit Krakau's normal appearance Krakau's god tier Krakau Zwilig is the Mage of Space, the pre-scratch incarnation of The Novelist, and is Toraum Zwilig's dancestor. He is the moirail to Retinz Vuqtoz, the dancestor to Khimio Vuqtoz. Krakau is 12 sweeps old, or 26 human years old. Like Toraum, Krakau has problems with his eyesight. Krakau and Retinz are close moirails and stick with eachother until the very end. Unlike Toraum, Krakau is only Monochromatic, he only sees the world in black and white. Krakau is known to dress in a very sophisticated style, finding pleasure in cravats and frilly coats. He sports a \"Flint Michigan,\" by human terms, but he has a soft and comforting voice. He always put his friends first and calmed those in distress. Krakau was known to be a skilled Tactician and Field Expert. Unlike Toraum, Krakau would actually go outside and explore, not being afraid to get his hands dirty if it came to it. Krakau has Bipolar Disorder though, which results in random mood swings at certain times. Toraum and Krakau started off awkward, but eventually became close friends. Even though sometimes Toraum is a bit scared of his dancestor, as he finds Krakau to be \"the k1nd 0f per20n wh0 ha2 tw0 21des t0 them, they can e1ther be y0ur be2t fr1end 0r y0ur w0r2t enemy .\" Relationships Edit Lodove Planci/Zwilig Edit Lodove Zwilig (née Lodove Planci) is Toraum's wife. Toraum doesn't know what he'd be doing if he didn't have his wife. She means the world to him. True love sometimes means being able to deal with pain for your lover. Khimio Vuqtoz Edit Khimio is Toraum's best friend. Toraum is always there for Khimio, even in the darkest of times. They are pretty much like brothers. Trivia Edit Toraum is Jay's Trollsona. Toraum's Doc outfits are based on Peter Capaldi and <mark>Peter Davison</mark>'s doctors from Doctor Who. Toraum's full title is Professor Sir Toraum Zwilig, CH, KBE, CB, FRS, MD.. Jay doesn't believe in blood colour being related to Zodiac, so they just decided \"Teal-Blooded Gemini, why not?\" Anyone who criticises Toraum for his sign in front of Jay will have their kneecaps broken. Retrieved from \"http: //trollslum.wikia.com/wiki/SuicidalArsonist? oldid=42667\" Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected. Categories: Teal/Blue Blood Male Troll SuicidalArsonist"}, {"articleID": "2015081416_00154593_W", "names": {"Phil Spencer": ["Q16207227", "Q16734485"]}, "date": "2015-08-14", "url": "http://arcadesushi.com/nintendo-employee-fired-for-podcast/", "content": "Nintendo Employee Fired for Speaking on Podcast EDIT Jon Ledford | an hour ago Nintendo A localizer at Nintendo has been fired for appearing on a podcast and giving honest opinions about his company's efforts to bring foreign titles to the West. Polygon reports that Nintendo localizer and Treehouse employee Chris Pranger was fired from the company after appearing on the Part-Time Gamers podcast. Nintendo of America's Treehouse division is often used to localize the company's Japanese games for the North American market, handling the English, French and Spanish translations of games that have more abundant amounts of Japanese audio and text in them compared to Nintendo's usual titles. Pranger revealed that he was fired on Twitter for appearing on the podcast and the comments he made there. In the interview, Pranger commented on the fans who were being critical of what Nintendo was (and wasn't) bringing overseas. \"It'll be like,\" Yeah, we do want money, which is why we know it's a colossal waste to localize that in this current market because look at you people. You don't make up a big enough group,' \"Pranger said on the podcast .\" You look at something like even Xenoblade Chronicles. People love that game, you know, within a certain group. That game is not the type of game that just pulls in enough to justify the costs on that. We got it in the States by luck, that [Nintendo] decided \"Oh, we'll take the bullet. We'll localize that .'\" \"And people are like\" Why do you guys hate money?' We don't. That's why you literally can't make everything. And people don't like finding out that their fanbase is actually too small to justify the costs of the thing they want. And they don't get that. \"Pranger also mentioned how fighting game enthusiasts got upset at Super Smash Bros. being geared towards a more casual fanbase. He explained that they are simply a niche group who don't make up enough of Nintendo's overall audience to be considered on how to develop such a widely popular game. On the topic of Uncharted 4, Pranger mentioned that he wasn't\" supposed to say nice things about our competitors, \"suggesting that Nintendo has some sort of guideline in place for either avoiding the topics of Sony and Microsoft or not openly praising them. Meanwhile, <mark>Phil Spencer</mark> has openly commended both Nintendo and Sony for their ventures on the E3 stage while millions of people were watching. To no surprise, the comments Pranger said about Nintendo weren't that bad, but they certainly weren't as sugarcoated as Nintendo would've liked. I've seen plenty of Xbox and PlayStation employees be more frank about their companies than Pranger has, and it's a shame that he lost his job for being honest. As some of you may have heard, yes, I was fired yesterday. Yes, it was ultimately my own fault. No, I did not see this coming .--Chris Pranger (@ TheChrisPranger) August 13, 2015 Even Sonic the Hedgehog feels for Pranger's termination: Dear @ Thechrispranger: Hang in there. We all make mistakes--we kissed a princess once. Things will get better. pic.twitter.com/SwHt1rVOlb--Sonic the Hedgehog (@ sonic_hedgehog) August 13, 2015 100 Video Game Facts You May Not Know Filed Under: Nintendo Categories: News Next Up The Legend of Zelda Redone as a Western Comments Leave A Comment"}, {"articleID": "2020041412_00002525_W", "names": {"Simon Harris": ["Q7518921", "Q7518922"]}, "date": "2020-04-14", "url": "https://www.newstalk.com/news/seven-people-arrested-gardai-not-adhering-covid-19-restrictions-999538", "content": "Seven people arrested by gardaí for not adhering to COVID-19 restrictions Stephen McNeice 12.56 14 Apr 2020 Share this article Seven people were arrested over the long weekend by gardaí using the emergency powers in place during the coronavirus crisis. Between Wednesday and Monday, gardaí ran a high-profile operation - Operation Fanacht - aimed at ensuring the public was complying with the current restrictions. 150 permanent checkpoints were placed on major routes, as while there were also 500 shorter and mobile checkpoints. Officers were also deployed at tourist locations, natural beauty spots, parks and beaches. While the \"vast majority' of people are said to have complied with the rules, the force says a small number of individuals didn't comply\" despite receiving a number of warnings \". Gardaí say they will now follow policy and consult with the Director of Public Prosecutions before making a decision to charge any of the seven individuals arrested. Meanwhile, the force says it also attended 144 COVID-19 related incidents that started as potential breaches of the regulations but ended up as other offences - such as public order, assault, road traffic or drug offences. Those incidents are said to have included house & street parties, gatherings beyond the family unit and non-essential travel. Garda Commissioner Drew Harris thanked the public for their compliance over the Easter period, saying it helped save lives. He noted:\" Regrettably, there was a small minority who did not adhere to the guidelines or other legislation and Garda members had no option but to use the regulations or other legislation. \"This demonstrates the need for the regulations not only from an enforcement point of view, but also to support those who are willingly living their lives in line with the public health guidelines .\" The duration of the Garda emergency powers was extended by Health Minister <mark>Simon Harris</mark> on Friday after the Government announced the current coronavirus restrictions would remain in place until May 5th. Main image: A Garda vehicle on an almost deserted section of the M50 motorway in Dublin. Picture by: Brian Lawless/PA Wire/PA Images Share this article Most Popular Mary Lou McDonald confirms she tested positive for COVID-19 REVEALED: The Offaly sporting Mount Rushmore France considering June restart for Ligue 1 Gabriel Scally: Ireland could be \"very susceptible' to new COVID-19 cases coming in through ports and airports Related Mary Lou McDonald confirms she tested positive for COVID-19 Gabriel Scally: Ireland could be\" very susceptible' to new COVID-19 cases coming in through ports and airports Shortall says reported FF/FG plan to trial State childcare scheme is \"exceptionally weak '"}, {"articleID": "2017071709_00279126_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Leyla Aliyeva": ["Q284744", "Q298532"], "Thomas Roberts": ["Q21282391", "Q51590127", "Q56598249", "Q7793584", "Q7819809"]}, "date": "2017-07-17", "url": "http://news.opb.org/news/article/npr-timeline-of-events-the-2013-miss-universe-pageant/", "content": "From left, Miss Connecticut USA Erin Brady and <mark>Donald Trump</mark> look on as Russian singer Emin Agalarov speaks onstage with his father Aras Agalarov during a news conference after Brady won the Miss USA 2013 pageant on June 16, 2013, in Las Vegas. Jeff Bottari, AP In November 2013, <mark>Donald Trump</mark> took the Miss Universe pageant to Moscow, bringing his trademark glitz and glamour to a country that had never hosted a major beauty contest. Trump later boasted that he met a lot of important people at the pageant. They included the billionaire real estate tycoon Aras Agalarov, who is now figuring prominently in the investigations into the Trump campaign's ties to Russia. Here is a look back at how the Miss Universe contest came together and what happened there. 2012 British-born music promoter Rob Goldstone began representing singer Emin Agalarov, son of billionaire real estate investor Aras Agalarov. At the time, Emin was married to <mark>Leyla Aliyeva</mark>, the daughter of Azerbaijani president Ilham Aliyev. March 21, 2013 In a Facebook post from New York, Goldstone announced he would be attending the Miss USA pageant in June. He served as a preliminary round judge at the event. May 31, 2013 Emin Agalarov released a music video featuring 2012 Miss Universe Olivia Culpo. This collaboration led Golstone to meet with the head of the Miss Universe Organization, Paula Shugart, according to Mother Jones. June 15, 2013 \"Fun meeting with <mark>Donald Trump</mark>,\" Rob Goldstone posted on Facebook. June 16, 2013 During the Miss USA pageant, Trump announced the location for the 2013 Miss Universe pageant: Crocus City Hall in Moscow, Russia. Trump was joined on stage by Aras Agalarov, president of Crocus Group, and his son. The elder Aras later told a Russian news outlet that Trump greeted him warmly, saying, \"\"Look who came to me! This is the richest man in Russia!\" ' Later in June, the Russian parliament passed a series of anti-gay laws. In an interview with Miss Universe co-host <mark>Thomas Roberts</mark> before the event in November, Trump defended his decision to keep the pageant in Moscow. June 18, 2013 Trump tweeted about the upcoming pageant. \"Do you think Putin will be going to The Miss Universe Pageant in November in Moscow - if so, will he become my new best friend?\" he wrote. November 9, 2013 Miss Universe took place at Crocus City Hall in Moscow, Russia. Emin Agalarov performed at the event. November 13, 2013 In an interview with Forbes, Emin Agalarov said Crocus Group, \"may theoretically consider a possibility of building a Trump Tower as one of our skyscrapers .\" November 20, 2013 Emin Agalarov released his music video for \"In Another Life .\" The video features him at a dull business meeting, daydreaming about Miss Universe contestants. His fantasies are suddenly interrupted by the man running the meeting, <mark>Donald Trump</mark>, who barks, \"You're fired!\" The pop musician would later tweet about the video, after a controversial dossier was leaked making allegations about Trump's Russia visit. February 4, 2014 Ivanka Trump visited Crocus City Hall in Moscow. Emin Agalarov gave her a tour. March 8, 2014 Emin Agalarov performed at the 2014 WGC-Cadillac Championship golf tournament held at Trump National Doral near Miami, Fla.. September 21, 2015 Trump told radio host Hugh Hewitt about meeting Russian oligarchs during the Miss Universe pageant. He said, \"...two years ago, I was in Moscow. And a lot of the people, Hugh, they were there, and they had an amazing time. And they're terrific people. You know, I was getting along with them so great. I really loved my weekend, I called it my weekend in Moscow. But I was with the top level people, both oligarchs and generals, and top of the government people. I can't go further than that, but I will tell you that I met the top people, and the relationship was extraordinary .\" June 3, 2016 Rob Goldstone emailed <mark>Donald Trump</mark> Jr., offering up incriminating information on Hillary Clinton. \"Emin just called and asked me to contact you with something very interesting,\" he wrote. Goldstone said the information came from the \"crown prosecutor,\" an apparent reference to Russia's top prosecutor, Yuri Chaika. Throughout the campaign, Emin Agalarov and Goldstone supported Trump on social media. \"You proved the entire world wrong, it's just incredible!\" Emin Agalarov posted on November 10. June 9, 2016 Russian lawyer Natalia Veselnitskaya and a Russian-American lobbyist met with Trump Jr., then-Trump campaign chairman Paul Manafort and Trump son-in-law Jared Kushner. July 24, 2016 On CNN, Trump Jr. skewered the Democrats for accusing the Trump campaign of colluding with Russian hackers to release documents from the Democratic National Committee. \"I mean, I can't think of bigger lies--but that exactly goes to show you what the DNC and what the Clinton camp will do. They will lie and do anything to win,\" he said. November 8, 2016 Goldstone posted a picture of Emin Agalarov, himself and Trump captioned \"The A Team - headed to the White House!\" November 13, 2016 Days after the election, Goldstone shared a picture of himself, Emin Agalarov and president-elect Trump that ran on Russian TV. July 8, 2017 The New York Times first reported the existence of the meeting with Trump Jr., Manafort, Kushner and Veselnitskaya. July 11, 2017 Trump Jr. published the email exchange with Goldstone on his personal Twitter account. Later in the day, White House principal deputy press secretary Sarah Huckabee Sanders reads a statement from the president: \"My son is a high-quality person, and I applaud his transparency .\" Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Featured Adventure explore view more photos get driving directions print field guide + map powered by Explore Nearby Adventures More News Contract Dispute Grounds Converted 747 As Wildfires Rage Across The West Hate, Bias Incidents Are On The Rise In Eugene Fairview Police Department Merges With Multnomah County Sheriff's Office Helicopters To Drop 350,000 Trout Into Oregon's High Mountain Lakes More OPB History, Beer And Throwing Heavy Things At Portland Highland Games 3 Things About Arts In The 2017 Oregon Legislative Session The Decemberists As Offa Rex | Tracy K. Smith | DaVinci Days | Bend Arts Center"}, {"articleID": "2014100516_00063496_W", "names": {"Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"]}, "date": "2014-10-05", "url": "http://www.fuse.tv/videos/2014/10/acl-fest-2014-paolo-nutini-interview", "content": "Paolo Nutini Meets Fans, Talks \"Caustic Love' & Influences at Austin City Limits On location at the Waterloo Autograph Tent at Austin City Limits Fest, Esteban Serrano caught up with not just UK soul-pop star Paolo Nutini, but his biggest fans, too! We found out exactly why a few of Paolo's fans were so excited to meet the singer, including one couple who say they have his music to thank for their initial spark .\" The first songs he played on the guitar for me were Paolo songs, \"one fan told us while looking at her boyfriend. Another fan first saw Nutini at ACL in 2007 and has been waiting for his return .\" His voice is just The Best Photos from Austin City Limits Fest 2014 (So Far) Excited to meet his fans, Nutini confided to Fuse before the signing, \"You just hope people are gonna' turn up .\" And turn up they did. Before signing countless autographs, the singer explained the title and theme of his Caustic Love album, which dropped earlier this year. \"Human on human love, romantic love - It can wash over all your defense mechanisms and leave you vulnerable,\" says Nutini. As an admirere in line to meet Paolo told us, it's the singer's deep, soulful (and sexy) voice that draws in fans, so we wanted to know who his musical influences were. \"The first thing I put on...was my grandfather's Drifters records. When I was about 5 years old, I put the needle on the vinyl and on came Ben E. King,\" says Nutini. \"It was all the old Stax [records], all the old Motown, all these five-part vocal groups; [The] Coasters, [The] Flamingos, [The] Platters - It was what I liked!\" ACL Fest 2014 Chvrches Talk New Single, Album at Last 2014 U.S. Festival Date ACL Fest 2014 Jack Antonoff Shares Strangest Desire at ACL Viral Watch Princess Jasmine From \"Aladdin' Sing\" A Whole New World \"22 Years Later Exclusive Interview Steve Aoki Explains Differences Between Two\" Neon Future' Albums Childish Gambino Delivers New Tracks, Old Favorites at ACL Avicii Returns With Genre-Defying \"The Days\" ft.. <mark>Robbie Williams</mark>"}, {"articleID": "2010101505_00273693_W", "names": {"Cody Johnson": ["Q17916913", "Q27052182"], "Mack Brown": ["Q13411875", "Q27830906"], "Mike Davis": ["Q14948795", "Q1608491", "Q16193543", "Q16235313", "Q16728420", "Q18631667", "Q1933136", "Q3313280", "Q6846501", "Q6846502", "Q6846504", "Q6846507", "Q6846508", "Q6846511", "Q6846512"], "Greg Davis": ["Q16218420", "Q19872760", "Q3116205", "Q5605468", "Q5605470", "Q5605471", "Q5605474", "Q9276234"]}, "date": "2010-10-15", "url": "http://collegesportsblog.dallasnews.com/archives/2010/10/forget-the-running-game-longhorns-will-t.html", "content": "texas has a rolodex full of running backs with experience at the college level but no 100-yard rusher in any game this season. <mark>cody johnson</mark>, the 250-pound hope of fall drills, has returned to his role as the team's primary goal-line and short-yardage runner, coach <mark>mack brown</mark> said earlier this week. d.j. monroe, the latest flavor of the week at tailback, remains a concern to coaches in pass protection, but predicts better days ahead \"as soon as i learn the playbook .\" tr? newton, the team's top returning rusher from last season, has fallen behind monroe and fozzy whittaker on the depth chart while battling a hip pointer. <mark>brown</mark> said newton, a southlake carroll graduate, does not project to play much, if at all, in saturday's game at no. 5 nebraska (5-0, 1-0 big 12) that will determine if texas (3-2, 1-1) can snap its first two-game losing streak since the 2007 season. if not, the unranked longhorns will be afterthoughts in the big 12 title picture and owners of their first three-game losing streak since 1999. against that backdrop, expect the longhorns to do something in lincoln, neb., that they should have done sooner: build a game plan around quarterback garrett gilbert, a five-star signee with nfl-caliber arm strength, and downscale plans to jump-start a ground game that ranks 82nd nationally, at 129.8 yards per game. from the outset, <mark>brown</mark> has stressed that his off-season emphasis on an improved ground game--a failed bit, for multiple reasons--stemmed from a desire to minimize pressure on his first-year quarterback. now, coaches deem gilbert ready to shoulder more of the offensive load. \"we thought our offense would grow with garrett,\" <mark>brown</mark> said. \"we liked a lot of things he did in the second half against oklahoma .\" specifically, coaches liked the 208 passing yards and three scoring drives gilbert led during the second half of a 28-20 loss. during that stretch, he completed 17 of 26 passes and did not throw an interception. included were strikes of 44, 40 and 33 yards to different receivers. gilbert put up those numbers without throwing to the team's most electric receiver, <mark>mike davis</mark>, who missed the ou game with a knee ailment but is expected to play against nebraska. so is john chiles, a mansfield summit graduate who leads the team in yards per catch (15.4), but missed most of the ou game with a groin injury. after reviewing videotapes during the longhorns' bye week, offensive coordinator <mark>greg davis</mark> declared himself \"negligent\" of freeing gilbert to make big plays in the early stages of games because he focused too much on building his confidence with short completions. \"can we let him throw the ball vertically a little bit more?\" <mark>greg davis</mark> said. \"the answer is,\" yes .'...even if you don't hit those balls, it sends a message about vertical throws that may open up something underneath. early in games, we have not cut it loose as much as we should have. \"so, for the first time this season, all signs point to texas trying to win a game by leaning on its five-star quarterback instead of mixing in a liberal dose of carries for its three-star running backs. why have coaches been reluctant, until now, to put the ball in the hands of their most heralded offensive player? a combined 14 drops by receivers in the past three games is one answer. gilbert also has thrown more interceptions (five) than td passes (four) this season. but <mark>brown</mark> identified the biggest reason .\" there's no question that, until the trust between <mark>greg</mark> and garrett gets there, that it's harder to call plays, \"<mark>brown</mark> said .\" he's got to find out what garrett can do under pressure. \"<mark>brown</mark> said the two seemed to be\" really making progress \"during the bye week. gilbert said <mark>greg davis</mark> has spent the time since the ou game stressing a need to be more precise with the football and to look for more opportunities to scramble for first downs .\" there have been times when i've gotten out of the pocket and i maybe had 5 or 6 yards, \"gilbert said .\" but i tossed it downfield and the ball ended up falling incomplete. sometimes, the best play is to run and get what you can and either get down or get out of bounds. \"<mark>greg davis</mark> said gilbert's arm strength is a\" noticeable \"upgrade over predecessor colt mccoy. in terms of gilbert's mobility, <mark>davis</mark> said:\" we knew that he would not be a zone-read guy. but there are more plays in his feet than we've gotten through this part of the season. \"bottom line: with the team's season on the brink, texas coaches sound like they're finally ready to remove the offensive training wheels and sink or swim with gilbert. he clearly is receptive to the challenge."}]