[{"articleID": "2010011917_00083275_W", "names": {"Stephen Baldwin": ["Q310947", "Q42889419"]}, "date": "2010-01-19", "url": "http://cotswoldjournal.co.uk/uk_national_entertainment/4859656.Tougher_regime_for_CBB_housemates/?ref=rss", "content": "tougher regime for cbb housemates (from cotswold journal) celebrity big brother housemates have started to find life a lot tougher after the house was made less luxurious. the new, harsher regime began on tuesday morning, halfway through the latest channel 4 series, when the celebrities drank their morning cup of tea and found that all their sugar had been swapped for salt. producers have also removed the soft furnishings from the living room, meaning the celebrities have to sit on hard benches. housemates have become increasingly frustrated with the new regime, with singer dane bowers complaining: \"they have taken all our comforts.\" actor-turned-preacher <mark>stephen baldwin</mark> shouted: \"the hotter it is, the more you make me feel like jesus, son. now we're gonna see what's up. now we're going to see what people are made of.\" stephanie beacham does not know that she will have to do without her acrylic bed linen on tuesday night as housemates will have to make do with hessian sheets. find your next job in the cotswolds and beyond dating find your next date in the cotswolds and beyond find your next home in the cotswolds and beyond"}, {"articleID": "2019111120_00004098_W", "names": {"James Allison": ["Q22017223", "Q30607948", "Q30612849", "Q3913494", "Q57437357", "Q6140731"], "Lewis Hamilton": ["Q6536656", "Q9673"], "Michael Schumacher": ["Q1929281", "Q19707089", "Q9671"]}, "date": "2019-11-11", "url": "http://brazilbusiness.einnews.com/article/501835245/W-eJsGI3zk438-jH", "content": "Motor racing-Mercedes boss Wolff to skip Brazil now both F1 titles won Reuters Share Adjust Comment Print LONDON--Mercedes boss Toto Wolff will miss Sunday's Brazilian Grand Prix, making it the first race he has not attended since 2013, now that his team have won both Formula One championships for an unprecedented sixth year in a row. A Mercedes spokesman said technical director <mark>James Allison</mark> will be the most senior team member at the track in the Austrian's absence. \"With both championships secured, it gives me more time in Europe to focus on other open topics,\" Wolff said in a team preview of the season's penultimate race at Sao Paulo's Interlagos track. \"It's great to be able to do this and to know that the team will represent the three-pointed star in the best way possible both on and off the track.\" <mark>Lewis Hamilton</mark> won his sixth world championship when he finished second to team mate Valtteri Bottas in Austin, Texas, on Nov. 3 after the team sealed the constructors' championship in Japan on Oct. 13. Mercedes have dominated the V6 turbo-hybrid era that started in 2014 and have won 14 of this season's 19 races so far--<mark>Hamilton</mark> 10 of them. The Briton has 83 career wins and is closing in on <mark>Michael Schumacher</mark>'s all-time record of 91. The 34-year-old won in Brazil last year, while Mercedes wrapped up the constructors' championship there. With both titles secure, and the top three positions in the constructors' standings locked in, Mercedes, Ferrari and Red Bull will also be using the last two races to test ideas for next season. \"Despite this record-breaking achievement, I still feel a lot of hunger and desire for more achievements,\" said Wolff. \"There's no sense of complacency, everybody is still determined to keep on improving...we have two races to go in the 2019 season and we want to end this season on a high.\" The last race is in Abu Dhabi on Dec. 1 (Reporting by Alan Baldwin, editing by Pritha Sarkar)"}, {"articleID": "2010071915_00297534_W", "names": {"John Beckett": ["Q45319541", "Q6221321"]}, "date": "2010-07-19", "url": "http://siliconrepublic.com/news/item/17034-forfas-appoints-new-chief-e", "content": "the disruptive exemplar network technology could pave the way for many new jobs...the digital education opportunity was discussed at the recent intel education forum hp's senior vice-president of inkjet and web solutions stephen nigro on how...<mark>john beckett</mark> talks about his web design and software development start-up adrenalin. 19.07.2010 forfás, the policy advisory board for enterprise and science, has announced the appointment of martin shanahan as chief executive. forfás, the policy advisory board for enterprise and science, has announced the appointment of martin shanahan as chief executive. the appointment has been approved by the minister for enterprise, trade and innovation, batt o'keeffe td. shanahan was previously divisional manager of science, technology, innovation and human capital policy in forfás. \"martin shanahan has demonstrated the vision, leadership and enterprise skills to take forfás forward in its pivotal role in informing government strategy on enterprise, trade, science, technology and innovation,\" said eoin o'driscoll, chairman of forfás. \"he has an excellent blend of experience and understanding of enterprise in ireland, both from a business and a policy development perspective and has outstanding communication and relationship skills. the board of forfás is delighted that he will be leading the talented and dedicated forfás management team and staff in providing evidence-based, analytically rigorous enterprise and science policy advice to government over coming years.\" at a time of significant economic turmoil and high unemployment, forfás has a key role to play in advising on the policies required to position and enable the enterprise sector to drive future growth and job creation. martin has demonstrated the necessary leadership and skills in his role heading up the innovation and labour market, education and skills policy areas to lead forfás at this critical time. \"shanahan said he was honoured by the appointment.\" i look forward to working with the wide range of stakeholders who contribute to and inform the essential work of forfás and leading the organisation as it continues to promote enterprise development and the consequent employment creation that ireland so desperately needs. \"martin shanahan's background a native of kerry, 37-year-old shanahan joined forfás in 2005 as manager of the human capital and labour market policy department, before becoming part of the forfás executive team in 2008 and leading the science, technology, innovation and human capital policy division. prior to moving to the agency, he was head of the professional development section of fáilte ireland. shanahan also previously worked in senior management roles in the hotel industry, including positions with the great southern and sinnott hotels groups. he has represented ireland at international and eu fora and worked as a consultant for international bodies, including the oecd and the international labour office (ilo). he holds a bsc (management) from trinity college dublin, a higher diploma and msc in hospitality management from the dublin institute of technology and an mres (educational research) from the university of lancaster. he is a member of the national qualifications authority of ireland, the advisory council for science, technology and innovation, the expert group on future skills needs, and is ireland's representative at the strategic forum on international cooperation on science."}, {"articleID": "2014092310_00013784_W", "names": {"Julia Gillard": ["Q41563", "Q59400153"], "Ray Martin": ["Q7297787", "Q7297788", "Q7297789", "Q7297790", "Q7297791"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"], "Alan Jones": ["Q16730391", "Q172753", "Q19831854", "Q21453612", "Q2830529", "Q30321578", "Q4706990", "Q4706991", "Q4706992", "Q4706993", "Q4706994", "Q4706995", "Q4706996", "Q51879900", "Q56248414", "Q56969955"], "Clive Palmer": ["Q5134643", "Q550879"]}, "date": "2014-09-23", "url": "http://theguardian.com/world/2014/sep/23/julia-gillard-i-dont-see-an-alternative-to-what-i-did-that-day", "content": "<mark>Julia Gillard</mark>: I don't see an alternative to what I did that day It was the act that dead-weighted her prime ministership, and almost cost Labor power federally in 2010 - but <mark>Julia Gillard</mark> says she would not reverse the decision to depose Kevin Rudd as Labor leader and prime minister. In an interview with the Nine Network broadcast on Tuesday evening, <mark>Gillard</mark> did not resile from the June 2010 leadership coup \"even with the benefit of hindsight\" - even though most senior Labor figures now do, regarding the strike against Rudd as a fundamental mistake. In characteristically unflinching fashion, <mark>Gillard</mark> told interviewer <mark>Ray Martin</mark>: \"Still, even with the benefit of hindsight, [I] don't see an alternative to what I did that day.\" <mark>Gillard</mark> also declared she would have \"out-campaigned <mark>Abbott</mark>\" if the Rudd forces had not destabilised her and run her down before the 2013 federal poll. \"If I'd had a clear run...I would have out-campaigned <mark>Abbott</mark>. I would have run a better campaign and I could have landed us in the same spot. That's my view, others will contest it, I get that.\" The conversation with <mark>Martin</mark> broadcast on Tuesday night is part of a promotional drive for <mark>Gillard</mark>'s memoir, My Story, to be released on Wednesday. <mark>Martin</mark> noted during the interview the memoir is a tale of \"almost unbridled treachery\" - a reference to her poisonous relationship with Kevin Rudd, which is canvassed extensively in the book. Despite being unable to countenance a viable alternative to deposing Rudd, <mark>Gillard</mark> is not without regret about the events of 2010. She regrets that she \"fed hope\" to Rudd in their fraught conversation over whether there were any circumstances in which he could hold on to the Labor leadership after their confrontation in June. She acknowledges that the act of blasting Rudd out of the prime ministership was traumatic for him and consequential for her. It assigned her a reputation for \"political brutality\" - \"the woman who wielded the knife\" - a difficult bequest given that in the critical moment of decision, she'd actually been \"hesitant.\" She told <mark>Martin</mark> the voters were surprised and disconcerted by the abrupt leadership change because she and other Labor players had shielded them from the government's policy drift and descent into internal paralysis. <mark>Gillard</mark> suggests she thought Rudd would move on and more than likely quit politics, \"free from the weight...because he'd found it so difficult in those last few months. Obviously I was wrong about that.\" \"If you look at my prime ministership there was this sort of cocktail, the internal destabilisation, the minority government - I think a harshness in the public critique - all of that swirled together to make it very hard political yards,\" she said. <mark>Gillard</mark> said her prime ministership felt like a fight on two fronts. \"You had this parallel tracks between what the opposition was saying about me and what the, you know, internal critics were saying about me - and that was a very hurtful, powerful dynamic.\" <mark>Gillard</mark> says she promised Rudd the foreign affairs portfolio after the loss of the leadership in a transaction designed to \"stop the leaks.\" Tuesday night's interview with <mark>Martin</mark> covered a range of topics. <mark>Gillard</mark> accepts complete responsibility for the \"real <mark>Julia</mark>\" botch up in the 2010 campaign. The newly minted Labor leader used a newspaper interview to attempt to reset a campaign plagued by leaks and missteps and excessive stage management by insisting she would, henceforth, be \"the real <mark>Julia</mark>\" - a declaration which served to reinforce voter's doubts about her authenticity. \"I put my hand up for that, one hundred percent...a dumb rookie error.\" <mark>Gillard</mark> is highly critical of press gallery journalists. She says some \"became activists in the leadership contest...(and) that's not their job as journalists.\" She also used the conversation with <mark>Martin</mark> to deliver a hard flick at radio talkback host <mark>Alan Jones</mark> - the broadcaster who declared <mark>Gillard</mark>'s father had \"died of shame.\" <mark>Gillard</mark> says <mark>Jones</mark> delivered only a \"mealy mouthed apology\" for the infelicitous outburst, and he only delivered that because of commercial pressure. \"It was a disgraceful thing; unforgiveable.\" She says she felt \"sorry\" for Germaine Greer - who made a famous crack about <mark>Gillard</mark>'s \"big arse\" . From \"being the feminist for our times, to end up talking like that for cheap laughs about another woman was a really sad thing\" . There are reflections on her time in the Lodge, the famous misogyny speech, her relationship with partner Tim and their daily routine, her atheism, her personal rapport with US president Barack Obama, the pressures of appearance and fashion for female leaders - and reflections on <mark>Tony Abbott</mark>. She says <mark>Abbott</mark> lacked the application required to persuade the cross bench independents to form a minority government after the 2010 election. \"I turned up, I was there every day doing it personally. <mark>Tony</mark> took a different approach.\" She contends that in the prime ministership, <mark>Abbott</mark> is a \"slave\" to the whims of <mark>Clive Palmer</mark>. \"On the big questions where the major parties have divided Mr <mark>Abbott</mark> can't do anything unless <mark>Clive Palmer</mark> says yes.\" On gay marriage - an issue she worked against in government, <mark>Gillard</mark> accepts \"we are going to see same sex marriage here and in, you know, most parts of the developed world.\" The Great 2014 Celebrity Nude Photos Leak is only the beginning US confirms 14 air strikes against Isis in Syria US air strikes against Isis and Khorasan in Syria - live updates Carbon map - which countries are responsible for climate change? \"Fuck it, I quit': Alaska TV reporter makes on-air exit to fight for pot legalisation Man avoids being hit by car and survives being knocked off bike by truck Charlo Greene tells viewers she owns Alaska Cannabis Club Israel shoots dead two Palestinians suspected of killing abducted teenagers Deepika Padukone: Bollywood star in titillation row with Times of India US air strikes against Isis and Khorasan in Syria - live updates US air strikes against Isis and Khorasan in Syria - live updates <mark>Julia Gillard</mark>: I don't see an alternative to what I did that day Australians preparing to fight overseas could face life imprisonment"}, {"articleID": "2011070814_00008309_W", "names": {"Lei Wang": ["Q27051273", "Q37372904", "Q37385604", "Q43601984", "Q44147377", "Q44963301", "Q47128418", "Q47711354", "Q50001573", "Q51188853", "Q52497576", "Q56421515", "Q56495065", "Q57054896", "Q57063136", "Q57394767", "Q57412266", "Q57422706", "Q57763652", "Q57896074", "Q57899255", "Q58351995", "Q58804944", "Q58874400"]}, "date": "2011-07-08", "url": "http://esciencenews.com/articles/2011/07/08/unnatural.chemical.allows.salk.researchers.watch.protein.action.brain.cells", "content": "\"unnatural' chemical allows salk researchers to watch protein action in brain cells published: friday, july 8, 2011 - 08:34 in biology & nature researchers at the salk institute have been able to genetically incorporate\" unnatural \"amino acids, such as those emitting green fluorescence, into neural stem cells, which then differentiate into brain neurons with the incandescent\" tag \"intact. they say this new technique, described in the june 16 online issue of stem cells, may help scientists probe the mysteries of many different kinds of stem cells in humans as well as the cells they produce. this could be a boon to both basic and clinical research, such as helping to speed development of stem cell-based regenerative medicine.\" stem cells hold great potential for the treatment of various diseases, yet it has been hard to study how they self renew and produce all of the body's cells, \"says the study's senior author, dr. <mark>lei wang</mark>, assistant professor and frederick b. rentschler developmental chair in the chemical biology and proteomics laboratory.\" the ability to genetically incorporate unnatural amino acids in stem cell proteins will accelerate our understanding the signaling networks that control these stem cells. \"he says, thorough understanding of these mechanisms is critical for safe and reliable stem cell therapeutics. the study's first author, dr. bin shen, adds that the incorporation of unnatural amino acids\" allows researchers to study a particular protein in a living cell or organism, compared to the traditional biochemical methods which are conducted through in vitro settings such as a test tube. \"these studies can also be conducted in real-time, says shen, who is a postdoctoral researcher in <mark>wang</mark>'s lab. use of unnatural amino acids (uaas) was developed by <mark>wang</mark> and his colleagues, and was first used in bacteria in 2001, and in mammalian cells in 2007. this is the first report of its use in stem cells. salk chemists, molecular and cell biologists, and experts in protein structure collaborated on this study, which was conducted in two stages. the first stage was to see if uaas could be incorporated into neural stem cells, without disrupting their process of differentiation, and if so, would the fluorescent tag they inserted be carried into neuronal cells created by the stem cells.\" current methods for uaa incorporation are not appropriate for stem cells, because the added genes are often lost before the stem cell has a chance to finish differentiation, \"<mark>wang</mark> says. to solve that problem, the researchers developed a lentiviral-based gene delivery method to incorporate the uaas into proteins expressed in neural stem cells.\" the lentiviral gene therapy technique, which was pioneered by dr. inder verma at salk, can afford long-lasting expression through stem cell differentiation, \"<mark>wang</mark> says. the virus was used to deliver different components needed in the uaas technology. these consisted of a synthetic transfer rna (trna) that cells use to incorporate amino acids into a protein that is being built inside a cell. the second molecule is an enzymatic synthetase that can recognize the engineered trna, and load it with the third engineered molecule - an unnatural amino acid. these amino acids are chemically distinct from the 20 amino acids that naturally exist in the body; they can be engineered for different desirable properties, such as to fluoresce.\" once you have a stem cell line stably incorporating uaas, you can custom the uaa to study stem cell biology, \"<mark>wang</mark> says.\" you also get the bonus of obtaining various mature cells with this ability through differentiation, such as neurons, which are difficult to insert uaas in and expensive to procure in large amounts. \"in the first set of experiments, the researchers found out that uaas were successfully incorporated into neural stem cells, the incorporation lasted through the differentiation, and these cells then produced neurons carrying the fluorescent amino acid. the second set of experiments was to demonstrate how these uaas can be used to help solve a biological question. the researchers wanted to know how voltage-sensitive ion channels, which are pore forming proteins, work in neurons. in these nerve cells, membrane ion channels respond to changes in electric current - the charged signal that is passed between neurons - that either activate or silence the neurons.\" we are trying to understand how the electric field of cell membranes can turn on or turn off protein activities - like a switch in a house turns on or off lights, \"<mark>wang</mark> says. to study this phenomenon, the researchers embedded a fluorescent uaa into a protein domain that ion channel and other proteins used to sense the electric field in neural stem cells, which produced neurons with the same embedded uaa. they could then watch, in real time, the fluorescent tag given changes in electrical current across the neuron.\" we detected changes in fluorescence intensity of the uaa when the neurons were stimulated, and these changes are dependent on where the uaa was incorporated, which hint that different positions of the protein are moving into or outside of the membrane in response to the electric field. \"<mark>wang</mark> says this experiment, designed to demonstrate the power of uaas in brain cells, can also be adapted to study other membrane proteins in other cells, no matter where they exist in the body. source: salk institute"}, {"articleID": "2011123107_00060246_W", "names": {"Bob Clark": ["Q2413649", "Q4932080", "Q50983316", "Q5389944"]}, "date": "2011-12-31", "url": "http://registerguard.com/web/sports/27393145-41/ppg-washington-game-rpg-huskies.html.csp", "content": "contain tony wroten and duck men's basketball just might ruin dawgs' day <mark>bob clark</mark> the register-guard (friday, dec 30, 2011 11:18 pm) today seattle - all oregon needs to worry about tonight is avoiding turnovers, keeping washington at bay on the boards, dealing with the usual frenetic pace of the huskies and, oh, yeah, defending the pac-12's best freshman. in other words, it's a lot of the usual problems when going against washington, with the presence of tony wroten added in. \"he's an awfully good player,\" uo coach dana altman said of the uw freshman. \"he's very athletic and has good instincts .? he scores a lot of baskets.\" the 6-foot-5 wroten scored 26 points, led the huskies with nine rebounds and had four assists in washington's 95-80 win over oregon state on thursday. after entering the game with the most turnovers in the pac-12, he committed only two in 32 minutes as his game settled down. though he has started only the past four games, wroten has scored at least 23 points in three of them, raising his season average to 16.8 points. that ranks him atop the pac-12 among all players, and fifth in the nation among freshmen. certainly there are other issues for the ducks (10-3, 1-0) as they attempt to open the pac-12 schedule with a sweep after thursday's 92-75 win over washington state. there is, for instance, the fact the huskies (7-5, 1-0) lead the pac-12 in offensive rebounds, with 14.2 per game. who wants to give this team that many extra chances at scoring? the huskies do that anyway by forcing about 14 turnovers by opponents. oregon had a solid rebounding game against wsu with a positive margin of 12 in rebounds, but even there, the ducks had 17 turnovers. and the cougars aren't the match for the huskies in putting pressure on ballhandlers. \"we don't want to give up easy baskets because they're going to score enough as it is,\" altman said. \"we've got to handle the ball and not turn it over? (and) stay with them on the boards.\" oregon isn't about to suddenly turn into a team that runs a slowdown offense, but altman would prefer the game not be played at the huskies' pace. too many teams can get drawn into playing out of control by washington, and then find themselves playing catch-up. \"i don't think it'll be a low-scoring game but i don't think we want it in the 90s,\" altman said. washington's task will be to force its favored tempo on oregon. as he previewed the game friday afternoon, uw coach lorenzo romar spoke of the \"efficiency\" with which the ducks ran their offense in the win over wsu, leading to oregon's shooting a season-high .694 percentage from the field. \"they've got a lot of experience on that team and they played like that on the road,\" romar said. \"you can't fall asleep (defensively)? when you make a mistake, mark it in your book, they're going to score.\" uo sophomore guard johnathan loyd has a sore thigh after taking a knee to that area in thursday's game. \"he's hobbling around a little bit, but i think he's ok,\" altman said. back to form use the below form to e-mail this story to your friends. notice: you must have javascript enabled to use this form. attention: * indicates a required field. contain tony wroten and duck men's basketball just might ruin dawgs' day | a lucky survivor | a eugene man feels fortunate for his timely heart treatment every time 61-year-old charles mestrich jr. hears about another young athlete who suddenly collapsed and died, and the autopsy reveals hypertrophic cardio? myopathy, he has two? from pigskin to picasso | if you go for football, take in some more refined pursuits, too pasadena, calif. - there's more to pasadena than the annual tournament of roses, with its spectacular new year's parade and rose bowl game. this city? some like it hot | an abundance of nearby hot springs heat up winter's chill blue river - soaking in a hot spring of volcanically heated mineral water in the midst of a northwest rainforest is one of life's finest? dreams of snow | even under dry skies, the right meals can be winter wonders rose bowl: bcs moment to call his own still dogging lamichael james rose bowl: lamichael james healthy, unafraid (maybe) going into game guest viewpoint: sexual harassment is an epidemic in the school system with <mark>bob clark</mark> last activity: 5 hours ago with rob moseley last activity: 6 hours ago with reidun craig last activity: 1 day ago with rob moseley last activity: 1 day ago get the print version of the register-guard on your computer, ipad or e-reader. it's convenient get 24-hour access to the register-guard anywhere you have a computer and internet access. available by 6 a.m. every morning. easy to use enlarge photos and stories. save, print and email articles or advertisements. searchable search and access past issues. 2011 oregon football app: just $3.99 for the 2011 season! qa technician hearthside food solutions 3500 chad drive? eugene, or? 97408 telephone to subscribe or to report a delivery problem: (541) 485-3311 or 1-800-377-7428. these numbers are staffed from 6:30 a.m. to 5:30 p.m., monday through friday and from 6:30 a.m. to 10:30 a.m. on weekends and holidays. to place a display advertisement: (541) 485-1234, ext. 2421 to place a classified advertisement or a paid obituary: (541) 342-1212 newsroom fax: (541) 683-7631 sports fax: (541) 687-6674 news tip hotline call 541-338-2727 or e-mail"}, {"articleID": "2009041522_00003346_W", "names": {"Julie Anderson": ["Q58066126", "Q6308005"], "Brian Ebersole": ["Q19360508", "Q2924887"]}, "date": "2009-04-15", "url": "http://tacomaweekly.com/article/3028", "content": "mlk housing seeks assistance from city by john larson burdened by a parcel of land it does not need and resources spent on a homeless shelter it no longer operates, martin luther king housing development association (mlkhda) finds itself in a bind. the non-profit organization is hoping to get help from the city of tacoma. executive director felix flannigan discussed his agency's problems and proposed a possible solution during tacoma city council's economic development committee meeting on april 14. in 2005 the agency purchased property on south 48th street near tacoma mall, with the intention of building 110 units of housing for low-income individuals. at the time the property was worth $980,000. a recent appraisal set its value at $590,000. as part of the purchase, mlkhda used its charlesbee apartments on south \"g' street on hilltop as collateral. with the current downturn in the economy, that 39-unit complex is at risk of foreclosure and its 60 residents could soon find themselves out of their homes. flannigan discussed steps taken so far to address the agency's financial woes. staff has been cut from 42 to 16. those who remain no longer have benefits. in 2002 mlkhda was persuaded by community leaders to take over operation of the troubled king center homeless shelter. flannigan explained that human services was not his agency's forte, but took on the shelter anyway. it announced last year it wanted to shift away from this, and catholic community services recently took over operation. during the seven years his agency ran the shelter the economy was good, flannigan explained. it shifted about $1.5 million in revenue generated from other projects to the shelter, which he said has ended up causing it financial problems. he wants the city to purchase the property near the mall.\" we never view the city as a lender. we view it as a partner, \"he said. the agency wants to concentrate on its effort to build a mixed-use project on hilltop, which it expects would generate revenue needed to make it financially stable over the long term. the plan he proposed would have the city pay $1,250,000 to the lender to pay off the loan on the property, plus another $633,000 in working capital for mlkhda. the lender, according to flannigan,\" has been very flexible and they are hoping we can get this resolved. \"council members expressed support for the planned building on hilltop while sounding hesitant about the loan request. mayor bill baarsma said the city likely cannot come up with the amount of money the agency seeks. he noted that revenue from sales and business and occupation taxes are tanking, and real estate excise taxes are on shaky ground. the city may not have the money, he told flannigan. councilmember mike lonergan pondered whether the city could legally buy the property. councilmember lauren walker noted that mlkhda does not have all of the capital it needs to begin construction of the hilltop project. she suggested an independent third party examine the agency's finances. flannigan was agreeable to this.\" it might be helpful to have someone from the outside take a look at this, \"walker remarked. councilmember <mark>julie anderson</mark> noted that mlkhda's only collateral is apartment buildings. lonergan asked why the agency does not sell one of these. flannigan said finding a buyer is unlikely in the current economy.\" how do you sell anything in this market when the bands are not lending? \"<mark>brian ebersole</mark>, a former mayor now working with mlkhda, asked the council to help the agency, comparing the hilltop project to the museums that have breathed new life into downtown. the city assisted in those and other major projects, he noted.\" when you make something a priority it happens. \"\"this project is so exciting for the city of tacoma,\" said jack connelly, an attorney who sits on the agency's board. \"it is time to pull out all the stops and make this happen.\" © 2009 pierce county community newspaper group"}, {"articleID": "2017120617_00804229_W", "names": {"Scott Mclean": ["Q21622011", "Q7436835", "Q7436836"]}, "date": "2017-12-06", "url": "http://www.foxnews.com/us/2017/12/06/southern-california-wildfires-trigger-mass-destruction-hurting-families-economy.html", "content": "close What to know: Huge wildfire rips through Southern California A massive wildfire in Southern California has spread over 48 square miles and continues to expand. A look at the destruction and what we know about it. Thousands of people in Southern California were forced to evacuate on Tuesday as wind-whipped wildfires continued to blaze across Ventura County. Officials said that the so-called \"Thomas Fire,\" which started Monday about 60 miles northwest of downtown Los Angeles, has caused 27,000 people to evacuate, destroyed at least 150 structures and has scorched roughly 65,000 acres so far. At least 12,000 additional structures are threatened by the wildfire as well. The cause of the fire is currently unknown. No fatalities have been confirmed yet, Ventura County Fire Chief Mark Lorenzen said Tuesday. One unnamed firefighter has reportedly been injured and three others were burned, the Los Angeles Times reported. President Trump tweeted about the wildfires on Wednesday, writing: \"Our thoughts and prayers are with everyone in the path of California's wildfires. I encourage everyone to heed the advice and orders of local and state officials. THANK YOU to all First Responders for your incredible work!\" Our thoughts and prayers are with everyone in the path of California's wildfires. I encourage everyone to heed the advice and orders of local and state officials. THANK YOU to all First Responders for your incredible work! https: //t.co/g9y9PkB352--Donald J. Trump (@ realDonaldTrump) December 6, 2017 In light of the Thomas Fire, here's what you need to know about California wildfires. How do the fires start? Roughly 95 percent of wildfires are caused by humans, <mark>Scott McLean</mark>, an information officer at the California Department of Forestry and Fire Protection, or Cal Fire, told Fox News. A simple task--like mowing the lawn, throwing a cigarette butt out of a window, or parking a car on dry grass--can spark a fire, he said. For instance, if a rock hits the lawn mower's metal blades, that's usually enough friction to create a spark that can ultimately start a fire, he said. And the heat from a car's catalytic converter, a device that's located underneath that controls its exhaust emissions, can reach up to 1,200 degrees Fahrenheit--enough heat to create a fire if the car is parked over dry, flammable grass. \"It only takes one spark to start a fire,\" he said. How are wildfires stopped? Officials are currently unsure what sparked the wildfires in Southern California. (The Associated Press) All wildfires can bring mass destruction. But the way each fire is stopped varies, <mark>McLean</mark> said. In other words, \"the different vegetation and different scenarios up and down the state\" impact how each fire is handled. \"You don't just throw resources at a wildfire,\" he said. \"It's like a battle--you have to think what will be the most effective.\" Cal Fire usually depends on a mix of bulldozers, fire engines, inmate crews, and helicopters or airplanes, which disperse things like fire retardant, to stop wildfires. Using containment lines, or large areas where a bulldozer cuts away vegetation to the point where only dirt remains, is very common, he said. But this isn't always an accessible option. \"\"What would increase the fire's speed, what would slow it down?,'\" he asked. \"Helicopter and airplanes are ineffective with winds over 30 miles an hour, and bulldozers can't always get in there.\" Strong wind gusts also cause problems when putting out or controlling wildfires, he said. Regional atmospheric patterns that develop in the fall create dry, hot wind gusts that can sometimes reach 80 miles per hour. These winds can create so-called \"spot fires\" --which is when an ember from the main wildfire gets blown into a nearby bush or field, ultimately creating a second fire. \"It's like a blowtorch.\" - <mark>Scott McLean</mark> \"It's like a blowtorch,\" he said. Rain is typically welcome, as it can slow down or deter the fire, he said. But it can also create muddy conditions for bulldozers and fire crews which impacts how they can combat the blaze. As for the Thomas Fire, however, <mark>McLean</mark> said resident safety comes first--hence the evacuation that took place on Tuesday. He added that Cal Fire is expecting more resources to come to the Ventura County area, adding that \"several strategies and tactics are in place\" to stop or control it. \"It's a case by case basis, and it's extremely fluid,\" he said. Why have California's wildfires been so destructive recently? <mark>McLean</mark> explained that California has faced a significant drought over the past five years, which created a lot of dead vegetation across the state. Like other mediterranean climates, winter time brings rain, which fills up water reserves and helps new vegetation to grow. California also had a record amount of rainfall in spring of 2017. But the summer's heat dried out that new growth, and, combined with the autumn winds, means \"a lot of fuel was created for wildfires,\" he said. The Santa Ana winds are currently pushing the Thomas Fire. <mark>McLean</mark> said there are 102 million or more dead trees in California--all potential fuel for wildfires to blaze across the state. \"There's a long road ahead of us. The fires we've dealt with recently--like the Thomas Fire--are all indicators of what we're having to deal with in California for the next few years,\" he said, adding that many of these fires have been wind-driven. \"Rains are not a cure all with one winter--it will take several years of winters to get moisture back into plants and reservoirs.\" Additionally, unlike tornados and hurricanes, wildfires don't really have a season, <mark>McLean</mark> said. At this point, \"there's pretty much no fire season. It's year round,\" he said. An impact on wine and entertainment Wildfires could also impact the state's wine industry from an economic standpoint, wine experts previously told Fox News. The California wine industry generates $57.6 billion in annual economic activity in the state and $114 billion in the country, according to statistics from the Wine Institute, a California-based public policy organization. The wine industry can be affected by wildfires in California. (The Associated Press) About 325,000 Californians are employed by the wine industry in California. The industry also contributes $17.2 billion in wages annually in the state. Additionally, it generates $7.2 billion in tourism expenditures in California. What's more, the Hollywood Reporter reported Tuesday that HBO suspended its second season of \"Westworld\" due to a 200-acre brush fire that broke out near where the show was filming. Fox News' Travis Fedschun contributed to this report. Madeline Farber is a Reporter for Fox News. You can follow her on Twitter @ MaddieFarberUDK."}, {"articleID": "2018042720_00080426_W", "names": {"Guo Pei": ["Q20984058", "Q45454805", "Q45644543", "Q45677692"]}, "date": "2018-04-27", "url": "https://www.teenvogue.com/gallery/rihanna-met-gala-red-carpet-best-looks", "content": "Rihanna's Best Met Gala Looks of All Time 11 years of red carpet perfection. Pinterest Getty Images Rihanna will be co-hosting this year's 2018 Met Gala along with Donatella Versace and Amal Clooney (with Vogue Magazine's Editor-In-Chief, Anna Wintour, serving as Chair, of course). In collaboration with the Metropolitan Museum of New York and the Costume Institute, this year's theme will be \"Heavenly Bodies: Fashion and the Catholic Image.\" Rihanna is one of the most fitting choices we can imagine to host, as she's attended the gala as far back as 2007, skipping a few in between to amount to a total of seven appearances on NYC red carpet. As one of the biggest nights of the year when it comes to fashion, we can't wait to see how all in attendance--especially Rihanna herself--will interpret the religiously-pointed theme. 11 years ago, 19-year-old Rihanna hit the red carpet for her first ever Met Gala in a Georges Chakra dress that was understated and simple, despite some embellishment on top. Since then, she's only risen further and further up the fashion-statement totem pole, consistently topping the best-dressed list and being one of the few celebrities on the red carpet to nail the theme each year. From Chinese designer <mark>Guo Pei</mark> to a Comme des Garçons look that we're still dreaming about, here are all of Rihanna's Met Gala looks to date."}, {"articleID": "2018032920_00204296_W", "names": {"Bryan Thomas": ["Q4980418", "Q4980419", "Q54922057"], "Harry Shum": ["Q16905622", "Q348649"], "Brad Smith": ["Q15477554", "Q16218831", "Q23664265", "Q24084114", "Q2923428", "Q4954263", "Q4954264", "Q4954266", "Q4954267", "Q4954269", "Q4954270", "Q50300377"]}, "date": "2018-03-29", "url": "https://www.nytimes.com/2018/03/29/technology/microsoft-reorganizes-to-fuel-cloud-and-ai-businesses.html?partner=rss&emc=rss", "content": "Photo In an email to employees on Thursday, Microsoft chief executive Satya Nadella cited the central role of cloud computing and the advances in artificial intelligence as reasons for a reorganization. Credit <mark>Bryan Thomas</mark> for The New York Times The Windows era at Microsoft, long in eclipse, is officially history. Microsoft said on Tuesday that it was splitting up its Windows engineering team and that the leader of its Windows business was leaving. The moves, analysts said, were part of a reorganization intended to accelerate Microsoft's emphasis on newer, faster-growing businesses like cloud computing and data-fueled artificial intelligence. That shift, they noted, has been underway since Satya Nadella became chief executive in 2014. In an email to employees, Mr. Nadella cited the central role of cloud computing and the advances in artificial intelligence--and their potential across all the company's products. The organizational overhaul, Mr. Nadella wrote, \"enables us to step up to this opportunity.\" Terry Myerson, 45, executive vice president of Microsoft's Windows and devices group, will be departing. In a separate email to employees, Mr. Myerson said that he supported the company's evolution under Mr. Nadella. \"I believe in it, and these changes are great for Microsoft,\" wrote Mr. Myerson, who worked for the company for 21 years. Continue reading the main story But with the revamp, the Windows group will be smaller and its engineering efforts dispersed. Windows technology, analysts said, will increasingly be folded into Microsoft's cloud software. Other engineers will create the user applications--\"Windows experiences,\" in Microsoft terms--that ride on top of the underlying software, in smartphones, tablets, personal computers and game consoles. Photo Terry Myerson, executive vice president of Microsoft's Windows and devices group, will be departing as part of the reorganization. Credit Eric Risberg/Associated Press Today, cloud services from Amazon, Microsoft and Google have become the internet equivalent of Windows, the dominant operating system of the personal computer era. Software developers write new applications to run on the cloud services, just as they once did for the Windows operating system. Microsoft has successfully rewritten its popular Office productivity products as web-based applications running on the cloud. The reorganization is \"really doubling down on the cloud as the fundamental platform for Microsoft,\" said Ed Anderson, an analyst at Gartner. Newsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. See Sample Manage Email Preferences Not you? Privacy Policy Opt out or contact us anytime Microsoft's cloud business is powering its growth. In the most recent quarter, its Azure business grew 98 percent and its cloud-based Office 365 offering by 41 percent. By contrast, the division that includes the Windows PC software increased 2 percent. The formal relegation of the Windows franchise, said Michael Cusumano, a professor at the Massachusetts Institute of Technology's Sloan School of Management, \"has been a long time coming.\" And such a transition, Mr. Cusumano said, \"probably had to be done by a second or third generation of leader.\" Mr. Nadella succeeded Steven A. Ballmer, the longtime ally and friend of Microsoft's co-founder, Bill Gates. Beyond the organizational changes, Mr. Nadella said in his email that Microsoft's research leader, <mark>Harry Shum</mark>, and president, <mark>Brad Smith</mark>, have established a panel, the A.I. and Ethics in Engineering and Research Committee, to increase the odds that A.I. technology \"benefits the broader society.\" That move, said Patrick Moorhead, an independent analyst, is Microsoft's effort to show it is \"serious about the broader implications of A.I.\" at a time of rising concern about the technology's influence on people's behavior and as a threat to jobs. Continue reading the main story We're interested in your feedback on this page. Tell us what you think."}]