[{"articleID": "2009072412_00024392_W", "names": {"John Campbell": ["Q1148728", "Q12885331", "Q12885333", "Q1383155", "Q1444898", "Q15861577", "Q16198535", "Q18685177", "Q18704951", "Q19596498", "Q22003550", "Q2277620", "Q258792", "Q29216", "Q30077568", "Q3181179", "Q4251090", "Q43911585", "Q478094", "Q51212260", "Q51542318", "Q52834952", "Q56254457", "Q56434401", "Q57945700", "Q6217589", "Q6219128", "Q6224971", "Q6224989", "Q6224992", "Q6224995", "Q6224999", "Q6225008", "Q6225027", "Q6232197", "Q6249971", "Q6253779", "Q6264129"], "Chris Matthews": ["Q15735939", "Q25189328", "Q5107375", "Q5110828", "Q5112832", "Q948687"], "Larry King": ["Q213430", "Q51724798", "Q6490623", "Q6490625"], "John Hawkins": ["Q19522517", "Q22563641", "Q30122693", "Q47347909", "Q6238289"], "Joe Scarborough": ["Q1280288", "Q6212213"]}, "date": "2009-07-24", "url": "http://nashuatelegraph.com/apps/pbcs.dll/article?AID=/20090724/NEWS03/307249925/-1/XML07", "content": "nation/world published: friday, july 24, 2009 by david crary the associated press new york - six months after barack obama's inauguration, a persistent and noisy legion of doubters won't let go of an already debunked claim - that he is actually a foreign-born, illegal president. the issue has flared again on political blogs, tv news shows and even a town hall meeting, widely circulated on youtube, in which a republican congressman was booed for saying obama is a citizen. mainstream republicans who want the issue to go away are having a tough time stamping it out as the so-called \"birthers\" resurface, with assists from talk show host rush limbaugh and cnn's lou dobbs. some who had initially dismissed the claim as a laughable political sideshow now wonder whether it's gotten out of control. \"i've stopped laughing,\" new york daily news columnist errol louis wrote thursday. \"too many political and media leaders are deliberately fanning the flames of ignorance and fear, and they should be ashamed .\" passions among the birthers run so high that rep. mike castle, of delaware, was booed by his own constituents at a recent town hall meeting for saying obama \"is a citizen of the united states .\" he was responding to a woman who waved her own birth certificate, contended obama was born in kenya, and shouted out, \"i want my country back!\" theories that obama was born abroad abounded during the presidential campaign, even after an official hawaii birth certificate was produced, along with august 1961 birth notices from two honolulu newspapers. numerous lawsuits and emergency appeals were lodged challenging obama's eligibility to be president, and all were rebuffed. the constitution states that a person must be a \"natural-born citizen\" to be eligible for the presidency. the birthers contend that obama's hawaiian birth certificate is a fake, and many say he was actually born in kenya, his father's homeland. limbaugh, for example, joked that obama and god have something in common - the lack of a birth certificate. dobbs has broached the issue several times, saying at one point, \"the questions won't go away .\" and 10 republican members of congress have co-sponsored a bill that would require future presidential candidates to provide a copy of their original birth certificate. one of those congressmen, <mark>john campbell</mark> of california, was pressed by msnbc's <mark>chris matthews</mark> as to whether he believed obama was a u.s. citizen. \"as far as i know,\" <mark>campbell</mark> replied. the issue also was raised by cnn's <mark>larry king</mark> this week, in a conversation with liz cheney, a former state department official and daughter of former vice president dick cheney. \"i think the democrats have got more crazies than the republicans do,\" liz cheney said. \"but setting that aside, one of the reasons you see people so concerned about this...people are uncomfortable with having for the first time ever, i think, a president who seems so reluctant to defend the nation overseas .\" a fellow guest, democratic strategist james carville, suggested cheney should have been more critical of those questioning obama's citizenship. \"she refuses to say this is ludicrous because she wants these people to believe this,\" he said. carville is among many democratic commentators suggesting that republican officials are reluctant to denounce the birthers for fear of alienating an energetic part of their party's base. even some conservatives say dragging out the controversy only hurts the republican cause and helps obama. \"he has a significant number of conservatives wasting enormous amounts of time on a side issue that can never bear any fruit and, as an added bonus, it makes them look somewhat unhinged to many americans,\" wrote conservative blogger <mark>john hawkins</mark> on townhall.com. \"when your political enemies are making fools of themselves, why stop them?\" john feehery, a gop consultant and former press secretary for dennis hastert when he was house speaker, suggested that dobbs and other broadcast figures were seeking to capitalize on the controversy to boost ratings. \"it says more about the media culture we're entering and the decline of responsible journalism, and less about the political realm,\" feehery said. as for the birth certificate bill introduced by the 10 house republicans, feehery said, \"it's so they can point to something if they're asked questions .\" the president's birthplace and citizenship have been among the most popular topics in e-mails to ask ap, a q & a column where associated press journalists respond to readers' questions about the news. over the past year, dozens of readers have asked about obama's birth certificate, or have simply declared that he was born in kenya and asked why he's allowed to serve as president. seemingly unimpeachable evidence hasn't swayed the birthers, as msnbc's conservative talk show host <mark>joe scarborough</mark> noted this week. \"they would rather be like sea lions barking at waves,\" he said. \"instead of trying to figure out what's happening to their country...they embrace conspiracy theories, and they make themselves look like cartoon characters .\" comments from unverified accounts will be reviewed twice daily. details"}, {"articleID": "2018101306_00048386_W", "names": {"Kevin Schmidt": ["Q10432773", "Q1740247", "Q1740249", "Q26091", "Q3195802"]}, "date": "2018-10-13", "url": "http://www.washingtontimes.com/news/2018/oct/13/old-army-depot-now-teems-with-wildlife-in-iowa/", "content": "Old Army depot now teems with wildlife in Iowa Follow Us Will there be a \"blue wave' in the midterm elections? Question of the Day By BARB ICKES - Associated Press - Saturday, October 13, 2018 SAVANNA, Iowa (AP) - The little office is what you'd expect, mostly. One wall of the National Wildlife & Fish Refuge office at Savanna is occupied by your typical taxidermy. The stuffed owls, hawks and eagles should come as no surprise in such a habitat, right? On a table under the mounted birds of prey, however, is a collection that doesn't fit the motif. Scattered upon the little display table are hand grenades, mortar shells, shrapnel and bullets. Hawks and hand grenades? Welcome to the Lost Mound Unit, formerly the Savanna Army Depot. The old depot property an hour north of the Quad-Cities, bequeathed to the Refuge when the Army shipped out about 15 years ago, contains a bunch of little surprises, rolled into one. The natural beauty is striking, for sure. What a treat it would be to help manage the old prairie's return - if only the bombs weren't hiding underfoot. The Quad-City Times reports that when the Refuge was the Depot, it contained a massive operation. During World War II, Savanna was the largest munitions storage base in the country. During that period, about 7,500 people worked there, making, testing and storing artillery and explosives. An untold number of unexploded ordnance - UXO - never was accounted for. Along with the pieces of scrap that are scattered on the table in the office are several large photographs of items found on the property that cannot be displayed. One such photo shows a practice grenade, found in shallow water of the Mississippi River by contractors digging for fiber-optic cable. Live rounds have been found, too, and there's the rub: How do you know the difference?\" You don't know whether it's live or scrap, \"said Wildlife Refuge Specialist Alan G. Anderson .\" From bombs to bullets, it's all here. The first bombs dropped after Pearl Harbor were made here. \"On the backside of Anderson's business card, the reality of the risk is in black and white:\" UXO-MEC (Munition of Explosive Concern) DO NOT TOUCH! \"Do Not Move Closer, Remove or Disturb. Mark Your Location (leave a hat).\" Walk Away (on same path you entered)... After hours or weekends call 911. \"The explosive risk is so worrisome in large sections of the former depot, the public never will be allowed there. But the public also has more access than ever before. The U.S. Fish & Wildlife Service accepted the mission from the federal government to manage nearly 10,000 acres of the former Army Depot. And that's what they're doing - one cautious step at a time .\" If there's risk, we won't take it. We'll manage it, \"Anderson said. In fact, he manages 4,000 acres, focusing primarily on restoring the prairie to its natural state and urging it into a condition that makes it increasingly accessible to the public. He pointed to a map on his office wall and said,\" That shows where you can and cannot go. The Illinois EPA, U.S. EPA and the Army have to declare a site clean before it can be included in what's open to the public. \"A large swath of land near the center of the Lost Mound Unit of the refuge is restricted. Called the\" range fan, \"it's the area where munitions made at the depot and at the Rock Island Arsenal were test fired and proof fired .\" Thousands of rounds of live munitions were fired, and some hit the ground without going off, \"said Ed Britton, manager of the Savanna District of the Upper Mississippi River National Wildlife & Fish Refuge, which includes Lost Mound .\" A couple of years ago, during a land survey in the range fan, more than 1,000 black powder grenades were found. \"You can clean up everything you find, but you'll never find everything .\" The government already has spent at least $200 million cleaning up the munitions left by the Army's operations, Britton said. Estimates suggest the final cost could reach $350 million. \"As World War I, World War II, Korea and Vietnam all wound down, the leftover munitions had to be stored somewhere, and tens of thousands were at Savanna,\" he said. \"They had to be tested to see if they still worked .\" Some munitions were dumped into a giant burn pit to be destroyed. They'd just put an explosive on the top of the pile. But some didn't explode; they just scattered around about a 2,000-acre tract that'll never be open to the public. \"Most of the ominous-sounding\" range fan \"acreage - an old firing range, basically - has been a dream for the Fish & Wildlife folks. When the Army had the Depot, grazing animals were permitted on sections. They ate the grass, which reduced the fire risk. Storing enormous quantities of explosives, they couldn't be too careful about fire. But the grazing ended when the land went to the Refuge, and the grass grew back .\" With a grass habitat, mice came, \"Anderson said .\" That's what brought owls here. \"In 2002, 40 long-eared owls were counted in a grove of pines in the range fan. That was the biggest concentrated population of the species in the nation. They had been on the endangered list .\" An endangered species of turtle also has occupied the old depot, courtesy of its rich supply of sand. The refuge, after all, contains the largest sand dune in Illinois. The sand prairie at Savanna is ten times larger than the next size of dune, and its presence is a magnet to wildlife. One such creature is the Ornate box turtle, which is like a tortoise in that it lives in sand, not water. The species is on Illinois' list of threatened species, but it is thriving at Savanna. A small population of the turtles was identified south of Savanna at Thomson, which is part of the Refuge and where Britton's district office is located. When Ornate box turtle nests are found at Thomson, four eggs are removed. Two go to Niabi Zoo in Coal Valley and the other pair go to a zoo in Chicago for incubation and care, Anderson said. After about a year, two are released at Savanna and two at Thomson. While Anderson is not a biologist, he is a big player in the turtle-conservation effort. \"This project took 20 acres of turtle fence - the largest there is,\" he said. \"It's a 24-inch steel strip that we dug 12 inches into the ground, leaving 12 inches above. There's then what looks like a barbed-wire fence and a third layer of fencing .\" My job is to build that fence. My job is not to manage turtles. But I'm happy to help. It's another way the Army left us a treasure. \"Many things at the refuge catch your eye, including the height of the prairie grass (to your shoulders in areas), the silence of the remote refuge, the abundance of wildlife (including birds I didn't recognize) and the vast absence of civilization. But the bunkers are what really grab you. The concrete structures with grass roofs look like pyramids that had their points seared off. Besides being oddly shaped, they appear oddly located - sitting vacant among the cactus and milkweed. Anderson and others with the refuge call them\" igloos, \"and he has 409 of them to maintain .\" There were 410, \"he said .\" One went boom! \"Seventy years ago, Britton elaborated, one of the bunkers got too cold. It was filled with land mines, containing liquid chemicals and a fuse, which typically were stored at about 55 degrees. Somehow, the temperature in the bunker dropped to the point the chemical froze, causing a massive explosion .\" It was heard all the way to Hanover (about 14 miles away), \"Britton said .\" It blew storefront windows out for miles around. \"Thereafter, fuses never were loaded into munitions while in storage. The old bunkers were long ago disarmed, and Anderson doesn't have much to do on the maintenance front, given they're thoroughly sealed and unused. The property contains hundreds of other igloos, differentiated by single doors, which belong to the refuge. The bunkers with double doors are on land that is privately owned, which accounts for another few thousand acres of former depot. The sloping grass rooftops give a false impression. It wasn't until Anderson permitted me to pull open one of the 1,000-pound doors that the vastness of the interior revealed itself. He rattled off the dimensions: 15 feet tall at the center; concrete 2 feet thick on the sides and back wall; 1 foot of concrete on the front wall and ceiling; 60 feet in length and 30 feet wide. None of the igloos face one another. That way, an explosion in one would have less of a chance of taking out another. The Army stored massive amounts of munitions in the bunkers - from bullets to 500-pound bombs. The walls contain lots of scribble, but it's not just graffiti. A few personal messages, mostly initials and dates, mingle with the copious ledger-like jottings .\" They basically took inventory on the walls, \"Anderson said .\" As they hauled things in and out, they sometimes kept a count on the wall. It's almost an historical document. \"Other telltale signs appear on the walls, including deep and shallow scratches and gouges in the concrete. As weapons and munitions were loaded in and out, their pallets and racks sometimes made contact with the concrete. As I stepped outside to give photographer <mark>Kevin Schmidt</mark> uninterrupted interior shots, I spotted something on the ground. It looked like a large o-ring; a circular piece of black plastic .\" You've proven once again there's military stuff everywhere, \"Anderson said as I handed him the relic .\" That's a bomb cap, probably from a 100-pound bomb. They placed them on the nose of a bomb as they put it in storage. \"In addition to the igloos, the old base contains many buildings of varying size. Some are in private hands. While there once as an inventory of 30\" black powder magazine storage \"buildings, only two remain. The refuge uses the remaining 100-year-old structures (with pine rafters) to store hunting blinds, animal monitoring equipment and other supplies. Everyone wants to see the land in Savanna become much more refuge than depot .\" We're trying to recreate the old black oak savanna, \"Anderson said .\" We spend a lot of time on burns that encourage the prairie to return. \"And there is evidence everywhere that it's working. In addition to the on-site success of the Ornate box turtle and the long-eared owl, other animals and plants are coming back with gusto. A total of 47 species of endangered or threatened plants and animals have been observed at Lost Mound. Anderson burns about 1,000 acres each winter to coax the natural grasses back onto the prairie in the spring. Meanwhile, exotic and invasive species are fought back. It's easy to get caught up in the fascinating history of the depot and give short shrift to the ongoing success of the refuge. But that would be a mistake .\" Trappers can take five otter. That's how abundant they've become, \"Anderson said .\" It's not unusual to have another species observed out here, especially with so much prairie coming back. \"The Army didn't destroy it. They just suppressed it .\" ___"}, {"articleID": "2018110922_00412546_W", "names": {"Carlos Osorio": ["Q41674730", "Q48453034"], "Chris Alexander": ["Q16164161", "Q5105713", "Q5105714"], "Patrick Stewart": ["Q16296", "Q43394636", "Q43911027"]}, "date": "2018-11-09", "url": "https://theworldgame.sbs.com.au/double-agents-how-clubs-players-and-advisers-play-the-tax-game", "content": "Behind most millionaire football stars stands a successful agent. Except when it comes to filling out a tax return. Updated Updated 3 mins ago Share Share on Facebook Share on Twitter Take Manchester City and the French player Gael Clichy, recruited by the club in 2011 for more than 4 million pounds ($5.2 million) a year. Man City recorded that soccer agent Darren Dein represented it in the negotiations. Yet British press reports identified Dein as Clichy's agent starting in 2010. And in two emails to officials at a European club in 2013, Dein said he acted for Clichy. Who Dein represented became the subject of inquiry by UK tax inspectors. It is not the only instance to attract the attention of Her Majesty's Revenue and Customs (HMRC). An examination of thousands of documents relating to some of the world's richest football clubs shows how clubs and players have repeatedly clashed with the tax authority over the role and pay of agents. At stake are hundreds of millions of pounds in tax revenue. The \"Football Leaks\" documents, which include emails and contracts, were obtained by the German publication Der Spiegel and reviewed by Reuters in partnership with European Investigative Collaborations, a consortium of international media. Agents typically take a cut of at least five percent of a player's wage for negotiating on the player's behalf. In many cases, the club pays, treating this sum as part of the player's overall remuneration package. Under UK law, this is a taxable \"benefit in kind\" to the player. The player becomes liable for income tax and sales tax, and the club becomes liable for social security payments. If the player has negotiated a salary net of tax, the club ends up paying all of it. But if the parties can show that the agent worked for the club, not the player, none of these taxes are due and the agent's fee is treated as a regular business expense. In such cases, clubs benefit, and the tax authorities are the losers. In the instance of Man City and Dein, tax inspectors challenged the club's account of Dein's role in negotiating that 2011 contract with Clichy, the documents show. In 2013, the tax authority wrote to Man City about a 1.2 million pound payment it made to Dein in 2011 and asked why the club hadn't reported a \"benefit\" to Clichy. It noted that \"all the information in the public domain shows that Dein is the player's agent .\" In November 2015, after a meeting with the club, the tax authority wrote, \"As stated during our meeting, we do not accept that Darren Dein doesn't act for the player .\" Later the same month, Man City's head of finance, Andrew Widdowson, acknowledged in a letter to the tax authority that while Man City had paid Dein \"to influence the player into joining us\" in 2011, the club also accepted that \"as you point out, Darren Dein is the player's agent and with that in mind we accept that a proportion of the fee should be apportioned as Dein acting for the player .\" Man City sought to reach a deal with HMRC over the unpaid tax, exchanges between the club and the tax authority show. Reuters was unable to determine the outcome. Based on the sum involved and the tax rate at the time, the total bill was likely to have been at least one million pounds, if Dein was deemed to have represented Clichy alone, Reuters has calculated. Sterling becomes highest-paid British player with new contract Man City said it would not comment on \"out of context materials purported to have been hacked or stolen from City Football Group and Manchester City personnel and associated people. The attempt to damage the Club's reputation is organised and clear .\" A law firm representing Dein and Clichy declined to answer questions about their relationship. The tax authority said it would not comment on individual cases, but added, \"HMRC works closely with football clubs to ensure payments made to their agents during the renegotiation of a contract or club transfer are taxed correctly. We actively challenge any payments we consider not to be realistic and ask for evidence to prove legitimacy of any arrangement .\" In recent years, the UK tax authority has increased its scrutiny of clubs, including those in the world's richest league, the English Premier League. As of November 2018, the tax authority was investigating 171 players, 44 clubs and 31 agents about agents' fees and other tax issues and had recouped 332 million pounds, it said, without naming the agents, clubs or players concerned. But in the documents examined by Reuters, the tax authority didn't impose any punishment. Instead it offered to settle back-tax claims without a penalty. And, the documents show, it allowed clubs to say agents jointly represented a club and a player. The tax authority declined to answer questions about this arrangement and why it hadn't imposed penalties. Between May 2015 and January 2018, agents were involved in around 1,400 contract negotiations between Premier League clubs and players, according to player transfer data gathered by the Football Association (FA). In over 80 percent of these negotiations, the FA recorded that the club and the player used the same agent, a Reuters analysis of the publicly available data found. But public statements by some agents suggest that in many instances the agent was only working for the player. Some club officials have expressed concern that they are pushing the boundaries of what is permissible. Following inquiries by the UK tax authority about how Man City reported player benefits, club finance head Widdowson in July 2015 emailed the chief financial officer of Man City's parent company and noted agents' fees were sometimes an area \"where we are sailing close to the wind .\" Man City declined to answer questions about how it reported its relationship with football agents. Widdowson did not respond to requests for comment. THE FATHER AGENT Players rely on agents to help them negotiate contracts, choose clubs and maximise their earnings off the field, from activities such as advertising. For many years it was routine for clubs to pay agent fees on behalf of players without reporting these payments as a \"benefit in kind,\" and for the UK tax authority to let the practice go unchallenged. By the early 2000s, with the value of player contracts soaring, the tax authority began to look more closely at this arrangement. One of the people that caught its attention was Vincent Kompany, captain of Man City and then captain of Belgium's national team. Kompany lured by EPL appeal In November 2014, Belgian agent Jacques Lichtenstein told Dutch magazine Sports Football that Kompany had been a client for years. In June that year, an executive at Lichtenstein's firm, Eleven Management, wrote to a potential business partner listing several of Eleven's clients. Vincent Kompany was the first name on the list drawn up by the executive, Peter Verplancke. Yet in July 2012, when Kompany agreed a new 6 million-pounds-a-year contract with Man City, the club recorded in a submission to the FA that Kompany was advised not by Lichtenstein, but by someone with no apparent experience of the high rolling English Premier League - his father, Pierre. Pierre Kompany's name does not appear on Belgian or English lists of registered agents. His website says he has worked as a taxi driver, engineering lecturer and municipal politician. For its part, Manchester City signed a contract with Lichtenstein and his firm Eleven Management. The tax authority wrote to Man City asking it to clarify Lichtenstein's role in the negotiations. Man City finance head Widdowson replied in November 2012 that the club had retained Lichtenstein to \"help negotiate with his (Kompany's) father .\" Kompany did not have an agent, Widdowson said in the letter. \"As far as we are aware there is no signed agreement between Jacques Lichtenstein and Vincent Kompany .\" As late as October 2015, Widdowson was maintaining in an email to the tax authority that \"Vincent Kompany's father actually represents him in all of his negotiations .\" If the tax authority accepted Man City's account that Lichtenstein worked for the club, and not the player, payments to the agent wouldn't be considered a taxable \"benefit in kind\" to Kompany. The authority wouldn't levy sales tax or social security. If it considered that Lichtenstein solely represented Kompany, however, the total tax bill would have been at least 2.3 million pounds, according to Reuters calculations based on the agreed fee and prevailing tax rates. The authority's review of the matter found that \"Lichtenstein to all intents and purposes acts and behaves like he is the player's agent,\" a tax official wrote to Man City in November 2015. Documents appear to show Man City considered settling with tax authorities. Reuters was unable to determine whether Man City ultimately accepted that Lichtenstein represented Kompany or paid back taxes. The tax authority, Man City and Pierre Kompany declined to comment. Lichtenstein and Verplancke did not respond to requests for comment. Vincent Kompany's lawyer said \"my Client's case has been investigated by the Authorities thoroughly in the recent past and he has answered all their questions satisfactorily, which was confirmed in writing .\" He said Reuters calculations \"can only be based on incorrect facts and/or guesses\" but declined to identify inaccuracies or answer detailed questions. In 2014, the tax authority challenged Man City about another deal involving a Belgian player, Dedryck Boyata. Boyata had signed a contract with the club in 2010 and negotiated a new deal in 2011. Man City recorded for tax purposes that in both deals, Boyata relied on the advice of his father, Bienvenu, a former player who ran a van rental business. Bienvenu Boyata does not appear on Belgian or English lists of registered agents. Man City again retained Lichtenstein as its agent, contracts and other files show. The club told the tax authority it felt the need to retain an agent because Boyata, advised by his father, had demands the club found unrealistic. \"DB's father was asking for too much money and JL was used to try to get DB's father to see sense & reduce his demands,\" according to club minutes of a February 2015 meeting between Man City and tax officials. Man City had hired Lichtenstein after club official Brian Marwood met him at a Boyata family event, where the agent was present \"as a family friend,\" the club told tax officials at that same meeting. Yet Man City documents referred to Lichtenstein as Boyata's agent. These include a 2012 spreadsheet that listed Man City players and their representatives and other communications. In an interview with Belgium newspaper DH in August this year, Boyata said Lichtenstein had represented him \"for a long time .\" Reuters could not determine the outcome of the tax authority's inquiry or whether Man City agreed to pay any back tax for the Boyata deals. The tax authority and Man City declined to comment. Marwood, Lichtenstein and Dedryck Boyata did not respond to requests for comment. Bienvenu Boyata replied in a text message that \"for good growing of the player you need both the father and best agent's service .\" A NEAT STEPOVER From around 2010 clubs, managers and players were increasingly adopting a different approach to recording agent fees. They recorded in their tax filings that an agent worked for both a club and a player or manager. They didn't split the agent's fee evenly. Instead, they attributed only a small share of the fee to the player or manager. That gave some ground to the tax authorities, but limited the tax liability assumed by the player or manager. For example, in 2013, Jose Mourinho, one of the biggest names in world soccer, returned to Chelsea Football Club as manager. Public statements and documents reviewed by Reuters show Mourinho has used an agent named Jorge Mendes since at least 2004. When Chelsea sent a draft contract to Mendes' firm, Gestifute, in June 2013, it proposed paying Mendes's fee and recording that 90 percent of the total was in recompense for his work for Chelsea. UK tax rules state that the breakdown of fees must reflect the true nature of the business relationship. If the club pays almost all the fee on its own account, rather than on behalf of the manager or player, then the agent must have acted overwhelmingly to represent the club's interests. Emails between Chelsea and Gestifute show Mendes acted diligently in Mourinho's interest, not the club's. For example, when Gestifute lawyer <mark>Carlos Osorio</mark> de Castro returned a draft contract to Chelsea, he omitted a clause inserted by the club that 10 percent of Mendes's fee would be reported as a benefit to Mourinho. The clause, de Castro noted, would have made Mourinho liable for tax. Chelsea Finance and Operations Director <mark>Chris Alexander</mark> responded that, despite the additional cost to Mourinho, the clause had to be in the contract. Because Mendes \"is Jose's agent,\" <mark>Alexander</mark> wrote in an email to de Castro, \"it is not credible for tax purposes that some part of the fee is not allocated to services for Jose. 10 percent is the absolute minimum we feel we can put in .\" Gestifute accepted that the clause be kept in the contract. Chelsea declined to answer any questions about the matter. \"We do not comment on speculation concerning confidential contracts or related matters,\" a club spokesman said. De Castro declined to answer questions citing confidentiality obligations to clients. The tax authority also declined to comment. <mark>Alexander</mark>, Gestifute and Mourinho did not respond to requests for comment. NO PENALTIES In hundreds of emails and letters between the UK tax authority and clubs and between club officials, Reuters did not come across a single proposed or threatened penalty in respect of an inaccurate filing. Even in cases where the tax authority says it believes a club has inaccurately reported the role of an agent, it has only sought back tax in relation to half the agent's fee, the documents show. In October 2015, the tax authority wrote to Man City to say it believed the club had inaccurately reported who agents worked for in respect of seven players. In the case of one, it said the club \"must have been aware\" of the inconsistency at the time it submitted tax filings. Nonetheless, the tax authority did not threaten penalties and simply proposed that the club recalculate its past tax bills. The tax authority and Man City declined to comment. In the most recent deals reviewed by Reuters, the clubs and tax authorities appear to have found common ground. The tax authority has settled on an approach that accepts an agent can equally represent both sides of a negotiation, emails from the tax authority to the clubs and between clubs and their tax advisers show. Consequently, the even splitting of agents' fees between the two sides has become common in the top echelons of British football, dozens of player contracts and other emails seen by Reuters show. Yet the documents raise questions about whether the equal sharing of fees accurately reflects the relationships between the parties. For example, when manager Jose Mourinho went on to join Manchester United in 2016, he, the club and agent Jorge Mendes signed a contract which apportioned the agent's fee evenly between the club and the manager. In an email to Gestifute's lawyer de Castro, however, Man United's Director of Legal & Business Affairs <mark>Patrick Stewart</mark> referred to Mourinho as \"your client\" seven times. And in one way at least, Gestifute appeared to be working contrary to Manchester United's interests. At the same time as Gestifute was negotiating the terms of Mourinho's Man United contract, the agency was in negotiations with another club to hire Mourinho. In May 2016, de Castro exchanged dozens of emails with officials of French team Paris St. Germain. A deal was never reached, but the talks progressed to the point of exchanging a Heads of Terms, or provisional contract. Reuters couldn't determine if the tax authority challenged the way the agent's fee was split or how much tax was paid. The tax authority declined to comment. Manchester United and <mark>Stewart</mark> declined to answer questions about the negotiations with Mourinho, but the club said it \"operates within the rules set by football's governing bodies and all payments and agreements are reported to HMRC in the standard way .\" Gestifute, Mourinho and PSG did not respond to requests for comment. De Castro declined comment. The tax authority's willingness to accept split fees in the face of contrary evidence means the football industry gets a generous break, and the UK Treasury and millions of ordinary taxpayers lose out."}, {"articleID": "2016050910_00275383_W", "names": {"Gareth Mcauley": ["Q55362512", "Q933750"], "Darren Fletcher": ["Q172792", "Q30122681"], "Martin O'Neill": ["Q16733787", "Q310263"]}, "date": "2016-05-09", "url": "http://www.independent.ie/sport/soccer/premier-league/irelands-harry-arter-hits-back-at-tony-pulis-claims-he-should-have-saw-red-against-west-brom-34697842.html", "content": "Independent. ie Monday 9 May 2016 Ireland's Harry Arter hits back at Tony Pulis' claims he should have saw red against West Brom EmailBournemouth's Harry Arter put in a combative display against West Brom on Saturday Republic of Ireland international Harry Arter has slammed Tony Pulis for claiming that he should have been sent off during Bournemouth's 1-1 draw with West Brom on Saturday. Share Comments The Baggies boss claimed Arter should have received two yellow cards and one red for three separate incidents in the game. The 26-year-old reacted angrily after being caught high in the leg by <mark>Gareth McAuley</mark> in the first half of the game and pushed the centre-half to the floor. Pulis also claimed that he should have saw yellow for a handball in the second period and red for a late challenge on <mark>Darren Fletcher</mark>. \"Harry Arter's a lucky boy tonight,\" Pulis said \"His push on <mark>McAuley</mark> first half was really a yellow card, the handball second half that stops us breaking was a yellow card, and his tackle on <mark>Fletcher</mark> is a straight red card but we finished the game 11 against 11 .\" Arter was clearly unimpressed with the comments and told the Bournemouth Echo: \"He should see the stud marks on my leg and he would probably think his player should have been sent off first .\" Mark Clattenburg said he would look at the footage because he wasn't sure if there had been a high foot. \"Their player apologised to me after the game because he said he caught me so maybe he (Pulis) should speak to his players before he comes out and speaks out loud .\" Arter will be hoping to be a part of <mark>Martin O'Neill</mark>'s squad for the upcoming friendly against the Netherlands on May 27 when it's announced on Thursday. Online Editors"}, {"articleID": "2013091621_00055872_W", "names": {"Adam Green": ["Q15069925", "Q18920513", "Q349591", "Q4679146", "Q4679148", "Q808769"]}, "date": "2013-09-16", "url": "http://www.manilatimes.net/summers-backs-off-from-us-fed-race/40525/", "content": "Faced with bitter opposition, former US treasury secretary Larry Summers abruptly withdrew from the race to lead the Federal Reserve, potentially opening the door for the bank's first woman chair. Sunday's surprise announcement came after weeks of speculation and no little ire over his bid to succeed Ben Bernanke, but his candidacy was ultimately felled by a lack of support from key senators. President Barack Obama confirmed he had accepted Summers's decision during a telephone call, in a move that boosts the chances of Janet Yellen, the current deputy chair of the Fed, taking over at the US central bank. Summers' run for the pivotal economic post had received backing from the White House, but in other quarters his efforts were undermined by fierce criticism of his record as head of the Treasury during Bill Clinton's presidency. His opposition to the regulation of derivatives-the often complex financial products blamed in part for triggering the 2008 global economic crisis-and his work on Wall Street had attracted particularly heated scrutiny. In stepping aside, Summers issued a letter stating that his withdrawal came at \"a complex moment in our national life,\" noting he had \"reluctantly concluded\" that his route to securing the job was not tenable. \"Any possible confirmation process for me would be acrimonious and would not serve the interests of the Federal Reserve, the administration, or ultimately, the interests of the nation's ongoing economic recovery,\" Summers said. The 58-year-old economist, a Harvard professor and former president of the university, worked for Clinton at the Treasury Department between 1999 and 2001, and served as Obama's chief economic adviser at the White House in 2009 and 2010. The latter role raised his prospects of taking over at the Fed, with several reports talking him up as Obama's preferred pick. In a statement following Summers's decision to withdraw, Obama praised his former aide's performance in government during the financial meltdown at the turn of the decade. \"Larry was a critical member of my team as we faced down the worst economic crisis since the Great Depression, and it was in no small part because of his expertise, wisdom and leadership that we wrestled the economy back to growth and made the kind of progress we are seeing today,\" Obama said. Opposition to Summers That opinion, however, was not shared by several members of Obama's Democratic Party who sit on the Senate's influential Banking Committee. Last week, they said that they would oppose sending Summers's Fed nomination to the full Senate for a confirmation vote, effectively blocking Obama's favored candidate at a sensitive time in a still bumpy US economic recovery. Despite his stellar credentials, Summers's work for a New York City-based hedge fund and for Wall Street banks, which he would have been tasked with regulating had he been made Fed chairman, had come under fire. Like many senior economic advisers in US political life, Summers has racked up millions of dollars in speaking and consulting fees from financial firms, feeding accusations that he would have been soft on Wall Street. Earlier Sunday, Citigroup, one of several top US financial institutions that received billions of dollars in a bailout from the Obama administration, said Summers had stopped working for them as a consultant. With a reputation as a strong economist, Summers also struck many as overly brash, a man of sharp elbows in Washington's corridors of power, with several key lawmakers arguing that a more conciliatory chair was needed to take over when Bernanke leaves his position, likely in January. Yellen, 67, seen as highly experienced, now steps up as frontrunner to take over at the Fed. Although the White House recently said several other candidates were on a shortlist, the deputy chair is seen as a consensus candidate and there has been no indication that her confirmation hearings would hit trouble. Summers's decision to bow out was welcomed by the Progressive Change Campaign Committee, a Washington-based political and consumer pressure group. \"He would have been an awful Fed Chair,\" said <mark>Adam Green</mark>, the group's co-founder. \"President Obama should appoint someone to lead the Fed who has not accepted millions in payments from Wall Street, and who will prioritize an economy that works for the little guy above further enrichment for the big guy,\" he added. EMETERIO SD. PEREZ DUE DILIGENCER Address: 2/F Sitio Grande Building 409 A. Soriano Avenue, Intramuros Manila 1020 Philippines Tel.: +63 (02)? 524? 5664 up to 67 Fax: +63 (02)? 528-1729 Email:"}, {"articleID": "2015091500_00002003_W", "names": {"Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Darren Wilson": ["Q17543917", "Q5225246", "Q5225247"]}, "date": "2015-09-15", "url": "http://leaderjournal.com/article/20150914/NEWS/150919448", "content": "Ferguson panel recommends police, court reform, transparency...Ferguson panel recommends police, court reform, transparency A reform panel formed after the Ferguson police shooting of <mark>Michael Brown</mark> is pushing for the consolidation of police departments and municipal courts in the St. Louis area, and decreasing the use of police force. Comment By JIM SALTER, Associated PressJIM SUHR, Associated Press Leader Journal - St. James, MO By JIM SALTER, Associated PressJIM SUHR, Associated Press Posted Sep. 14, 2015 at 1:17 PM By JIM SALTER, Associated PressJIM SUHR, Associated Press Posted Sep. 14, 2015 at 1:17 PMST. LOUIS A reform panel formed after the Ferguson police shooting of <mark>Michael Brown</mark> is pushing for the consolidation of police departments and municipal courts in the St. Louis area, and decreasing the use of police force. The Ferguson Commission, a 16-member panel appointed by Missouri Gov. Jay Nixon in November, released a copy of its 198-page report online Monday. Nixon and members of the commission planned to discuss the details at an afternoon news conference. The report acknowledges the commission has no power to enact any of the proposals, but Nixon has said the group has his office's full support. \"The law says all citizens are equal,\" the report's introduction states. \"But the data says not everyone is treated that way .\" The events in Ferguson raised concerns about police departments and municipal courts in that north St. Louis County town, and elsewhere in the region. The departments and courts have been accused of targeting minorities to raise revenue, leading to mistrust that was a key component of unrest following <mark>Brown</mark>'s death. <mark>Brown</mark>, 18, who was black and unarmed, was killed by Ferguson officer <mark>Darren Wilson</mark> during a confrontation in August 2014. A St. Louis County grand jury and the U.S. Department of Justice declined to prosecute <mark>Wilson</mark>, who is white, but the shooting spurred a national \"Black Lives Matter\" movement and led to protests and rioting in and around Ferguson. The report said the panel heard from many black residents \"who do not feel heard or respected when they interact with the police or the courts. They do not feel that they are treated in an unbiased way .\" Relations with police were strained in parts of the St. Louis region before the shooting, partly because of excessive force, the report said. \"The regular use of force has led many citizens to view the police as an occupying force in their neighborhoods, damaging community trust, and making community safety even more difficult,\" the report said. It suggested new use-of-force policies, officer training and a change in department culture. It also recommended establishment of a statewide database of use-of-force incidents and statistics. The report notes St. Louis County has 81 municipal courts and 60 municipal police departments--and recommends consolidating at least 18 of those departments into just three that would oversee different areas of north St. Louis County. The fragmentation \"is not only costly and a grossly inefficient use of taxpayer resources, but more importantly presents as an impediment to justice for many of our region's citizens,\" the report said. The commission also recommended a statewide plan to deal with mass demonstrations. Some observers were skeptical about the value of the report. Remy Cross, a criminologist and sociologist at Webster University in suburban St. Louis, isn't optimistic that it will lead to significant change. Page 2 of 2 - \"It's hard not to be cynical of these kinds of reports given the track record,\" Cross said. \"They (commissioners) are really not given any authority. Everybody agrees with the report, and nothing really comes of it because no one wants to pony up the money or get down to the brass tacks of the policy changes .\" Ferguson Mayor James Knowles III said his community has made several changes, including installing a new police chief and municipal judge. He was concerned that the name of the commission is misleading. \"One of the worst things they could have done is naming it\" The Ferguson Commission,' \"Knowles said .\" That's not what it's about. When you do that, it makes it real easy for other communities not feeling the pressure to ask, \"Why do we need to change? There wasn't a riot in our section of the region .'\" By JIM SALTER, Associated PressJIM SUHR, Associated Press Leader Journal - St. James, MO By JIM SALTER, Associated PressJIM SUHR, Associated Press"}, {"articleID": "2018081801_00073185_W", "names": {"David Gilbert": ["Q1174544", "Q16228862", "Q17385807", "Q42322165", "Q5234127"]}, "date": "2018-08-17", "url": "http://www.fox28.com/news/regional/two-more-arraigned-in-what-msp-is-calling-a-child-porn-ring", "content": "Two more arraigned in what MSP is calling a child porn ring by Nicky Zizaza | Newschannel 3 Two more arraigned in what MSP is calling a child porn ring. (WWMT/Jason Heeres) A A BATTLE CREEK, Mich.--Michigan State Police arrested two more people in what detectives have called a child porn ring. Matthew Toole and Talia Furman appeared in Calhoun County District Court on Friday to face charges in a child pornography in a case the Michigan State Police have been following closely. Calhoun County Judge said, \"Count five did persuade, entice, endure, coerce or cause or knowingly allow a 3-year-old child to engage in a child sexually abusive activity\" Toole and Furman were arraigned on multiple charges including, but not limited to criminal sexual conduct and using computers to commit a crime. Calhoun County Judge said, \"Count three, did perform or intentionally commit an act likely to cause physical or mental harm to a child by performing bleep on the child\" Calhoun County Prosecutor <mark>David Gilbert</mark> said one of the victims was harmed at the hands of a parent. <mark>Gilbert</mark> said, \"A mother and someone else doing something to her own children .\" A tip led MSP detectives to 19-year-old Jayme Lapoint where they uncovered chat messages and videos depicting sexually abusive material. Calhoun County Judge said, \"Count one did engage in sexual penetration, with a child under the age of 13 .\" Prosecutors alleging that both Furman and Toole attempted to lure a 12-year-old out of a county fair and transport the child up north. <mark>Gilbert</mark> said, \"The allegations are this is a child pornography ring it's also basically a human trafficking ring .\" Lapoint has already been charged and is headed to trial at a future date. A pre-exam hearing for Furman and Toole is scheduled August 30. Unmute"}, {"articleID": "2017121317_00733430_W", "names": {"David Burns": ["Q10426343", "Q20986553", "Q3558779", "Q4109533", "Q5231931", "Q5231932", "Q57395556"]}, "date": "2017-12-13", "url": "http://www.mystatesman.com/news/local/community-news-central-health-urges-residents-enroll-for-coverage/J6rn45tCKdf3X6zL8Y4H0K/", "content": "metro-state By Staff - American-Statesman staff...Posted: 11:40 a.m. Wednesday, December 13, 2017 Highlights Operation Blue Santa is seeking volunteers Saturday morning to be delivery drivers. Georgetown firefighters will serve breakfast Saturday morning as part of fundraiser. TRAVIS COUNTY TRAVIS COUNTY Insurance deadline Friday Central Health and its partners are accelerating efforts to enroll Travis County residents in health coverage, as open enrollment for the Health Insurance Marketplace ends Friday. Residents can call into the United Way 211 call center by dialing 211 to schedule an appointment at an enrollment facility in Central Texas. While local efforts have resulted in a 100 percent increase in enrollment to date, Central Health and its partners want to ensure everyone who needs health coverage gets it. Consumers are being reminded to not delay, as time is limited; enroll this week or risk not having health coverage in 2018 .--American-Statesman staff AUSTIN Help deliver Blue Santa gifts Operation Blue Santa is seeking volunteers, starting at 8 a.m. Saturday, to be delivery drivers who bring toys and goods to qualifying Blue Santa recipients. Volunteers may visit wrapping stations at the Operation Blue Santa Warehouse, 4101 S. Industrial Drive; the Austin Police Department North Substation, 12425 Lamplight Village Ave.; the East Substation, 812 Springdale Road; or the South Substation, 404 Ralph Ablanedo Drive. For more information: 512-974-2583 .--American-Statesman staff SOUTHEAST AUSTIN TreeFolks to give away trees TreeFolks, in partnership with H-E-B, will give away 200 trees as part of the organization's NeighborWoods program from 9 a.m. to noon Saturday, at H-E-B Plus, 2508 E. Riverside Drive. The trees that will be distributed are native to Central Texas and include evergreen sumac, burr oak, Texas mountain laurel, mulberry and persimmon. The NeighborWoods program helps to shade city streets and neighborhood by distributing 4,200 trees annually to Austin Energy customers. The trees will help lower summer temperatures and energy bills, as well as increase the tree canopy cover in Austin-area neighborhoods. The program is a partnership between TreeFolks and the city of Austin. Another distribution event will be Feb. 24 .--American-Statesman staff AUSTIN New traffic signals coming The city of Austin will build pedestrian hybrid beacons and traffic signals next year to improve safety across the city as the City Council approved a $2.85 million contract to build 10 signals in locations with identified safety needs. Pedestrian hybrid beacons are pedestrian-activated traffic control devices that help pedestrians safely cross major roads where traffic signals are not present and/or warranted. Using the new contract, these will be built near 12th and Luna streets; First Street and King Edward Place; First Street and Desert Primrose Drive; First and Monroe streets; the 515 block of South Congress Avenue, south of Riverside Drive; and Burnet Road and 47th Street. New signals will be built near First Street and Great Britain Boulevard, Davis Lane and West Gate Boulevard, Davis Lane and Copano Drive and Lamar Boulevard and Houston Street .--American-Statesman staff WILLIAMSON COUNTY GEORGETOWN Sheriff's office to present awards The Williamson County sheriff's office's Winter Awards Banquet will begin at 6 p.m. Thursday at the Sheraton Hotel & Conference Center, 1101 Woodlawn Ave. During the program, sheriff's office employees will be recognized for their achievements and service throughout the year .--American-Statesman staff GEORGETOWN Firefighters to serve breakfast Georgetown firefighters will serve breakfast from 7:30 to 11 a.m. Saturday at the Georgetown Community Center in San Gabriel Park, 445 E. Morrow St. Santa Claus will make an appearance for pictures, and children will be able to visit with the firefighters and climb on a fire truck. The breakfast will include pancakes and sausage with juice and coffee. Tickets are $6 per person and can be purchased at the door the day of the event or in advance at the Public Safety Operations and Training Center, 3500 D.B. Wood Road. Ages 12 and younger are free with a paid adult. Proceeds will help to provide clothing, food and gifts for children in the Georgetown area .--American-Statesman staff HAYS COUNTY DRIPPING SPRINGS Shooter response event set The Hays County sheriff's office will host the \"Civilian Response to Active Shooter Event\" presentation from 6:30 to 8:30 p.m. Thursday at Dripping Springs High School, 940 U.S. 290 West. The public presentation will be made by Hays County sheriff's Lt. <mark>David Burns</mark>, one of the founding members of Advanced Law Enforcement Rapid Response Training who has taught throughout the country on how to respond to an active shooter crisis. Additional presentations will be announced as they become available. Companies or organizations that want to schedule a specific presentation are encouraged .--American-Statesman staff Popular in News 1 2 3"}, {"articleID": "2012100812_00071483_W", "names": {"Johnny Campbell": ["Q18705329", "Q6266433"], "Tetsuo Suzuki": ["Q11648678", "Q11649354", "Q17160044"]}, "date": "2012-10-08", "url": "http://autoblog.com/2012/10/08/honda-debuts-production-dakar-racer-crf450-rally/", "content": "the dakar rally raid is a spectacle unlike anything else in motorsports. with a course that tracks its way through some of the most unforgiving and forgotten areas in south america, the event is challenging enough for those who tackle the race on four wheels. the guys who make for the dunes on motorcycles, however, are simply our kind of insane. honda has chosen to honor this year's factory team with a production version of the race bike. the crf450 rally debuted at the 2012 international motorcycle, scooter and bike fair in cologne, germany, and is based on the standard crf450. honda swapped in programmable fuel injection in place of the old carbs, bumped up the total fuel capacity and incorporated a new navigation system. engineers also worked in new changes to both the chassis and bodywork to increase durability and protect the drivetrain from damage. honda will first test the crf450 rally in the morocco rally later this month before putting it to task in the dakar rally in january. take a look at the full press release below for more information. related gallery honda crf450 rally show full pr text honda unveils new production dakar rally racer 10/03/2012 - torrance, ca honda unveiled its new crf450 rally model dakar racer at the 2012 international motorcycle, scooter and bike fair in cologne, germany. the world debut of this production-based race machine centers on its entry in the dakar rally, which will be held in january 2013. america's <mark>johnny campbell</mark>, the 11-time baja 1000 champion who previously gained dakar rally experience in africa, will join riders helder rodrigues (portugal), felipe zanol (brazil), sam sunderland (united kingdom) and javier pizzolito (argentina) in an international effort. honda entered factory teams nine times from 1981 onward in the forerunner of the present dakar rally, the paris-dakar rally. cyril neveu (france) rode honda to its first victory in 1982, the race's fourth year, and from 1986 to 1989 honda won four consecutive titles for an overall record of five victories in nine years. in 2013, honda will aim for its first rally victory with a model built from a production-based machine. the crf450 rally model is based on honda's commercial crf450x off-road racing machine, but it differs in a number of ways. changes include its use of honda's programmed fuel injection (pgm-fi) system, increased fuel capacity and the addition of a sophisticated navigation system. in addition, other changes were made to the bodywork and chassis for protection, efficiency and durability. the crf450 rally model in its current configuration has undergone extensive testing in japan and will be tested further in its first race at the morocco rally, beginning october 14th. the morocco rally will serve as a real-world test to gather data, identify any problems with the machine under actual race conditions, and pinpoint any operational issues. <mark>tetsuo suzuki</mark>, president of honda racing corporation (hrc) and honda motorcycle r & d, said, \"our young engineers have created a race machine based on the crf450x production enduro bike. the dakar rally is a race that continues for two weeks across the hardest terrain of three different countries. the dakar rally is extremely long and extremely tough. this is a new challenge for us. previously, we entered the dakar rally with machines purpose-built for racing. this time, we are aiming for our first victory in the dakar rally with a production-based machine .\" <mark>johnny campbell</mark> said, \"my participation in the dakar rally over the past few years has been an amazing experience. i have been working very hard to bring the enthusiasm and attention of the usa to this prestigious global event. i am excited to be part of honda's official dakar race team and i'm committed to its success. my role will be to provide consultant, development, rider and mechanical services as needed to the project .\" about american honda american honda motor co., inc. is the sole distributor of honda motorcycles, scooters, atvs and muvs in the u.s. american honda's motorcycle division conducts the sales, marketing, and operational activities for these products through authorized honda dealers. for more information on honda products, go to www.powersports.honda.com."}, {"articleID": "2012090404_00067634_W", "names": {"Matt Campbell": ["Q24678643", "Q6788433", "Q6788434", "Q6788435", "Q6788436"], "Brett Smith": ["Q16235028", "Q39070154", "Q57472681", "Q910861"], "James Green": ["Q16224571", "Q16233184", "Q22109257", "Q27925040", "Q553470", "Q56885258", "Q57026690", "Q6134902", "Q6134906", "Q6134912"]}, "date": "2012-09-04", "url": "http://toledoblade.com/UT/2012/09/04/Missed-tackles-main-culprit-in-Rockets-loss.html", "content": "missed tackles main culprit in rockets' loss university of toledo head football coach <mark>matt campbell</mark>. photo reprints <mark>matt campbell</mark> theorizes that the biggest strides made by a college football team happen now, between the first and second weeks, because players should be accustomed to the speed and the emotion of a game. the area on defense in which the university of toledo coach hopes to see the most growth following the season-opener at arizona is no surprise to anyone who watched the rockets grasp at air all night. in reviewing the film, <mark>campbell</mark> counted anywhere from 180 to 200 yards surrendered after his defense missed a tackle. that's a big ole chunk of the 624 yards accrued by the wildcats in their 24-17 overtime win. \"it's one of the things we stress more than anything,\" <mark>campbell</mark> said monday. <mark>campbell</mark> was actually pleased with most areas of the unit. he praised his young cornerbacks for covering well and conceding small and medium chunks of yards rather than debilitating receptions. he applauded the two turnovers created, and the bend-but-don \"t-break attitude that led to a reasonable number of points allowed relative to the enormous number of yards given up. he said his players executed the game plan. but tackling, well, that area better tighten up before saturday at wyoming. safeties were the main culprit, said <mark>campbell</mark>, whose assertion was echoed by one of them. senior jermaine robinson, one of the most reliable members of the unit and a team captain, whiffed a number of times. his failure to bring down running back ka\" deem carey in the open field led to a 73-yard touchdown run early in the third quarter. \"i put that on myself to work harder this week and to eliminate those few missed tackles,\" robinson said. \"those tackles could have changed the game .\" toledo does not keep a record for yards allowed, but arizona's 623 are the most in a while. wyoming totaled 345 yards in a 37-17 loss saturday at no. 15 texas. quarterback <mark>brett smith</mark>, the reigning freshman of the year in the mountain west conference, threw for 276 yards, with 173 of them and both of his touchdown passes going to 5-foot-10 junior robert herron. the cowboys, who won eight games in 2011 and lost to temple in the new mexico bowl, beat toledo two years ago at the glass bowl. \"it's all going to come back to keep the ball in front of us, tackling, and playing sound defense,\" robinson said. hayes coming: <mark>campbell</mark> confirmed a report from the blade stating former whitmer standout and ohio state defensive lineman kenny hayes is enrolled at toledo and plans to play football. toledo is awaiting the go-ahead from the ncaa clearinghouse before officially welcoming hayes, a former four-star recruit whom rivals considered the nation's 68th best prospect in 2010. hayes (6-5, 285 pounds) must sit out this season before becoming eligible next fall. he will have three years of eligibility remaining. hayes redshirted as a freshman last season with the buckeyes following an all-state senior season at whitmer. he left the team last month. \"he's a gifted football player and certainly had a great high school career,\" <mark>campbell</mark> said. \"at the end of the day, it will all be predicated on kenny and what his adjustment is coming to the university of toledo and fitting into our football team .\" short yards: <mark>campbell</mark> said quarterback terrance owens will start saturday \"if all things are equal\" during the week between he and austin dantin. owens did not win the right to start the arizona game last week, but will get the nod because it is his turn after dantin won a coin flip to start at arizona. dantin is expected to enter the game early, just as owens did in the third series saturday ....punter vince penza was named mid-american conference west division special teams player of the week. penza averaged 44.9 yards per punt, and six of his eight punts landed inside arizona's 20 ....receiver <mark>james green</mark> (knee) is expected to make his season debut saturday. <mark>green</mark>, a junior, caught nine passes in each of the past two seasons. contact ryan autullo at: rautullo @ theblade.com, 419-724-6160 or on twitter @ autulloblade. guidelines: please keep your comments smart and civil. don't attack other readers personally, and keep your language decent. if a comment violates these standards or our copyright 2012 the blade. by using this service, you accept the terms of our visitor agreement. please read them. the toledo blade company, 541 n. superior st., toledo, oh 43660, (419) 724-6000"}]