[{"articleID": "2013062520_00038022_W", "names": {"Bob Gibson": ["Q1131535", "Q17002469", "Q4932531", "Q4932533"], "Adam Wainwright": ["Q1185516", "Q57305474"]}, "date": "2013-06-25", "url": "http://blogs.riverfronttimes.com/dailyrft/2013/06/busch_stadium_cardinals_christian_symbols.php", "content": "Christian symbols on the mound at Busch? A few weeks ago, Daily RFT got an e-mail from a reader and lifelong Cardinals fan who, while watching the games this season, had noticed something he hadn't seen before on the pitcher's mound. Right by the spikes, etched into the dirt, there appeared to be a Christian cross and fish symbol. Michael Vines, who was born and raised in St. Louis, tells us he thought this was unusual and decided to look at some past footage from this season--and noticed that these symbols were on the mound on many different occasions. \"That's when I realized they were doing it all year,\" he says. \"I hadn't noticed. I was shocked I hadn't noticed.\" Vines sent us a handful of images from various games showing the cross and what appears to be the fish symbol--both of which he argues are not appropriate for a baseball stadium. Here's another photo. More evidence below. When Daily RFT first mentioned it to a Cardinals spokesman earlier this month, he told us he personally had not noticed or heard anything about it, but said he would try to look into it. We haven't gotten any additional information since. Worst Cardinals Fans Ever: Homophobic, Racist, Offensive Tweets Catalogued Sports Illustrated Cover Draws On 1968 Lou Brock, Roger Maris, <mark>Bob Gibson</mark> Photo Ballpark Village: Cardinals Move Forward With Construction, Release Renderings Post-Dispatch had a very short item in a Sunday article titled \"MOUND TRIBUTE\" that references the cross: Several times this season the Cardinals starter has gone to the mound to find subtle symbols scratched on its backside, near the rubber spikes used to scrub off dirt. \"They've been there every time for me,\" ace <mark>Adam Wainwright</mark> said. To the left of the spikes is a Christian cross and just below it is a looped figure. It's a \"6\" for Stan Musial, the Cardinals great who died in January. A member of the grounds crew puts the symbols on the mound for most home games. The Cardinals have been one of the few teams not to adopt the trend of stenciling a team logo on the backside of the mound, where television cameras see it for every pitch. Vines had apparently also alerted the P-D to these symbols and in response to the Goold piece, argues it's pretty clear that it's not a \"6\" but rather the fish symbol. And over the weekend, he sent Daily RFT and the P-D a follow-up letter, which is on view below, arguing that it's wrong for the Cardinals to display \"religious iconography on the infield at Busch Stadium, a place of hallowed ground not just for Christians, but for Cardinal fans of all religions, including none at all.\" His argument is that it's not appropriate given that the team owners are the beneficiaries of ticket and real estate tax abatements; he says that though the team and stadium are privately owned, they are \"civic institutions.\" We've printed the full letter below. When we first spoke with Vines on the phone earlier this month, he told us that his gripe is not with the fact that they are Christian images, but that he belives there shouldn't be religious symbols of any kind on a baseball field. \"How come nobody's mentioning this?\" he says. \"It's totally inappropriate.\" He argues that there are \"plenty of Major League Baseball players who don't want that in their face...There may be Christian Cardinals who don't like it.\" Vines is Jewish but says he would not want a Star of David on the mound either. \"You don't have to be Jewish to be offended,\" says Vines, who now lives in New York City, but says he never misses a Cardinals game. Some will argue the symbols are fairly innocuous, given that they've gone largely unnoticed and even disappear as a game progresses. But Vines tells us that it's poor judgment to have these symbols on the field at all. \"Just because you have the right to do something doesn't mean you should do it,\" he says. StLToday.com (June 23, 2013) about a Christian cross etched into the dirt of the pitcher's mound at Busch Stadium. It was I who called attention to the cross, along with what I took to be the image of something commonly known as the \"Jesus fish\" also scratched into the mound. Goold says that the latter is the number \"6\" , a tribute to Stan Musial. If so, it's a very oddly shaped \"6\" (see attached photo) and, considering its proximity to the cross, would seem to be serving a dual purpose. Goold lead his piece with the headline \"Mound Tribute,\" as if there were nothing inappropriate about displaying religious iconography on the infield at Busch Stadium, a place of hallowed ground not just for Christians, but for Cardinal fans of all religions, including none at all. http: //bit.ly/1caTLMW), team owners are the beneficiaries of ticket and real estate tax abatements that will save them $143 million in payments to the city over 25 years, as well as $54 million in state incentives and a $45 million county loan."}, {"articleID": "2009031707_00104090_W", "names": {"Ted Kennedy": ["Q134549", "Q326157"]}, "date": "2009-03-17", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=47884264&blogId=430283436", "content": "palin's rifle shot on foreign policy jeff stein | september 4, 2008 6:24 pm comments (1) for a vice presidential candidate who didn't own a passport until last year, sarah palin's brief passages on national security thursday night were perfectly tailored to her lack of expertise or experience in foreign affairs. but it hit the spot--the oil spot, to be precise--in a rollicking acceptance speech spent mostly ridiculing the democratic ticket and extolling the expertise hockey moms bring to high office. the alaska governor's office floats in a sea of oil politics. during her 20 months in office, palin threw herself into ramping up exports of north slope supplies to the lower 48. in fact, she accelerated the construction of infrastructure to deliver fuel. it's hard to imagine an alaska governor not knowing at least something about what's going on in the rest of world's energy markets. but it's a sure bet that the average alaskan is as familiar with the intricacies of crude futures as ordinary iowans are with the price of ethanol or, for that matter, third worlders with the price of kerosene. but otherwise, palin has shown little interest in the world outside the united states. her first, and apparently only, foreign travel came last year, to visit members of the alaska national guard stationed in kuwait, and wounded troops in germany, according to her deputy communications director, sharon leighow. that was roughly equal to the travels of george w. bush when he entered the white house in 2001. the erstwhile texas governor had visited china when his father was ambassador to beijing in the 1980s, and israel, and there were the famous \"lost weekends\" in mexico during his drinking years--all of which, critics say, left him woefully unprepared for the rigors of the post-9 / 11 world. historians will have the final call on that. palin sounded authoritative when she mentioned \"russia wanting to control a vital pipeline in the caucasus and to divide and intimidate our european allies by using energy as a weapon...\"critics have credited speechwriter matthew scully, late of the bush white house, with writing the words palin merely sang. but as tidy a line as that was, it's likely palin had at least as much a hand in drafting it as scully, considering her involvement with oil infrastructure during her term as governor, no matter how brief. she went on to talk about the scary what-ifs: to confront the threat that iran might seek to cut off nearly a fifth of the world's energy supplies, or that terrorists might strike again at the abqaiq facility in saudi arabia, or that venezuela might shut off its oil discoveries and its deliveries of that source, americans, we need to produce more of our own oil and gas...big applause. and take it from a gal who knows the north slope of alaska: we've got lots of both. more big applause. if palin didn't write that line, she sure had obvious fun delivering it. the next lines, though, came right out of the republican boilerplate for the past eight years. starting in january, in a mccain-palin administration, we're going to lay more pipelines, and build more nuclear plants, and create jobs with clean coal, and move forward on solar, wind, geothermal, and other alternative sources...the problem is, it's a script grounded more in the kind of kitchen-table, hockey-mom talk that makes so much sense to so many people, until it's tested against the complicated real world. washington has shown only fitful interest in alternative energy supplies (the technology for which, most energy economists say, doesn't exist yet to generate meaningful amounts of power). and nuclear is a non-starter, unless she and mccain win the election and the republicans take both houses of congress - not--unless we want to buy them from france; u.s. companies deserted the business years ago. nor is there's going to be any explosion of offshore drilling, which all the republicans, except those who actually would have to look at them from their patios, seem to be for. (likewise, look up <mark>ted kennedy</mark>'s position on windmills in nantucket sound .) al gore-like pronouncements that natural gas, not oil, is only a temporary solution to our energy problem. so, like it or not--and nobody outside saudi arabia does--we'll be mired in global oil politics for decades to come, particularly in the middle east so when palin falls back on right-wing red-meat rather than thoughtful alternatives, as she did thursday night, she sounds like nothing more than an echo of harry and louise on the republican ticket--not a serious contender for the second highest post in the land.\" victory in iraq is finally in sight, and he wants to forfeit, \"she said of barrack obama, in a disturbing slander. (has anyone noticed that the iraqis themselves have forced the bush administration into adopting obama's position?) terrorist states are seeking nuclear weapons without delay; he wants to meet them without preconditions. and: al qaeda terrorists still plot to inflict catastrophic harm on america, and he's worried that someone won't read them their rights. yes, they do believe it. don't you have a euro to be chasing away to any minute now? while you are at it, get me a canadian with some furry boots and a thick accent. i'll aboot her immediately. seriously, yes, this whole convention was about lying the fuck out of everything. that's the way it is and i don't hold much hope. this country is on it's last legs and you see it everyday. we will become third world, because all business will be ran by the eu and their land ties will be with asia. we continue to ignore our greatest resource of our neighbors to the south. you know, it's sick as fuck but if chavez declared war on us tomorrow we'd go there and give him the attention and get this economy going again, but our deep prejudices towards those that live amongst us is more overpowering than the hatred that exists on the other side of the world. they have the oil down south and we ignore them, because they do our lawns and those in office don't have good relations with them, because they rebel against us legally. it's much easier to punch an asshole than sign treaties with those organized. corporate america. latin america is our future. it has always been, but they are peaceful and we hate them for giving us cocaine, so we will never pay attention to them. yeh, that whole drug bullshit that reagan got us in. canadians just jump around with a huge oil supply and act like silly americans and i want to join their party. i agree, but reverend wright is not the issue. just my lack of eating. bocc kob on friday, september 05, 2008 - 8:07 pm ["}, {"articleID": "2012101104_00039985_W", "names": {"Chris Williams": ["Q1077862", "Q1077870", "Q17027823", "Q18166423", "Q2147406", "Q24006414", "Q2620648", "Q2766588", "Q5108477", "Q5108478", "Q5108479", "Q5108480", "Q5108481", "Q5108483", "Q5108484", "Q55837805"]}, "date": "2012-10-11", "url": "http://boxingnews24.com/2012/10/roach-pacquiao-has-to-move-constantly-against-marquez-to-win/", "content": "by <mark>chris williams</mark>: freddie roach seems to think he's got the golden plan that will help his fighter manny pacquiao (54-4-2, 38 ko's) finally conclusively beat 39-year-old juan manuel marquez (54-6-1, 39 ko's) after having failed to establish that he's the better guy in their three previous fights together. roach thinks that all pacquiao has to do to beat marquez this time is to use movement. roach said to maxboxing.com \"we've got to really, really get back to that perpetual motion that we had in the first fight.\" if pacquiao is able to hop around like he used to be able to do then roach thinks this will be enough for him to defeat the 39-year-old marquez. roach has noticed that since pacquiao lost his ability to move like he did years ago, he's taking a lot more punishment - and getting beaten. whether roach wants to admit it or not, pacquiao should have two straight losses going into the fourth pacquiao-marquez fight on december 8th at the mgm grand in las vegas, nevada. i don't the movement is the answer for pacquiao, because even when he was able to move really well in his first fight with marquez in 2004, he was still dominated from the 2nd round on in that fight. smart fighters are easily able to handle guys that move by timing them for when they do come in and make an attack. the fighter that is doing all the moving is really hurting himself by wearing himself out with all the extra effort. roach: bradley won't win a round tonight pacquiao will lose to bradley if he fights like he did against marquez roach: pacquiao will be scientific against marquez marquez-pacquiao: roach not satisfied with a mere win for manny, he wants a knockout"}, {"articleID": "2015052600_00000221_W", "names": {"David Leslie": ["Q1175203", "Q16731417", "Q762029"]}, "date": "2015-05-23", "url": "http://hamptonroads.com/2015/05/angler-wasnt-looking-shark-one-found-him", "content": "Sports \"Outdoors Angler wasn't looking for a shark, but one found him A 9-foot blue shark caught by <mark>David Leslie</mark> is brought to the side of the boat. get hooked Off the Hook is a Sunday outdoors feature highlighting the tales (fact, not fiction) of anglers from Hampton Roads and northeastern North Carolina. If you have a story to tell, send pictures and ideas to Pilot outdoors writer Lee Tolliver at lee.tolliver @ pilotonline.com, or call him at (757) 222-5844. Be sure not to miss Lee's Fishing Forecast each Thursday at May 24, 2015 Friends didn't believe <mark>David Leslie</mark> when he told them about catching a nearly 10-foot blue shark while fishing for sea bass off the coast of Virginia Beach. But those fishing with him - Beth and Kevin Synowiec - can attest to the story.\" I looked up and saw this fin on the surface, \"said <mark>Leslie</mark>, a 29-year-old Newport News resident who grew up freshwater fishing in Wisconsin.\" We weren't sure what it was at first. \"The torpedo-like shark with the deep blue back didn't take <mark>Leslie</mark>'s first offering of bait.\" I had a 4500 Daiwa spinning rig set up for drum and cobia, \"<mark>Leslie</mark> said.\" I had a piece of piano wire leader rigged up and put that on with a piece of squid and tossed it out there. \"Given the length of the shark, <mark>Leslie</mark> admitted that the size of his tackle\" wouldn't have been my weapon of choice. I've got a couple of 50 - and 80-wide (larger reels) in the garage that I would have preferred to have been using. \"Fishing for sharks is not exceptionally difficult, given a shark's never-ending appetite. Anglers usually use chum to attract a fish, then pieces of cut bait to entice a bite. Many species, such as mako and hammerheads, charge after trolled offerings for tuna and billfish. And when hooked, all species are known for putting up a battle. <mark>Leslie</mark>'s shark made several runs, nearly spooling his reel. And because the trio was anchored over a wreck for bottom fishing, chasing the shark wasn't an option at first. When the shark swam around the anchor line, getting it to the side of the boat seemed nearly impossible.\" I had 300 yards of braid (braided fishing line) and he got me down pretty close several times, \"<mark>Leslie</mark> said. About halfway into the fight, the Synowiecs taped together a pair of 48-inch-long fishing measuring strips and got them to the edge of the boat for a good estimate of the shark's length.\" That gave us 96 inches and it was longer than that, \"<mark>Leslie</mark> said.\" We weren't about to bring it into the boat because it wasn't a species we were going to keep and eat. And bringing it in otherwise would have been too dangerous. \"More slender than some shark species, blues can top 500 pounds. The International Game Fish Association all-tackle world record is a 528-pounder caught off Montauk, N.Y., in 2001. And like nearly all shark species, they have a formidable set of teeth.\" This one wasn't that big, I don't think, but it was the biggest fish I've ever caught, \"<mark>Leslie</mark> said.\" We got him close to try and measure him and cut him loose. \"It was just an amazing experience...that electric-blue colored shark in that beautiful blue water.\" "}, {"articleID": "2011060623_00081282_W", "names": {"Greg Edwards": ["Q19650371", "Q5605519", "Q5605522"]}, "date": "2011-06-06", "url": "http://walb.com/story/14849581/autopsy-performed-on-east-albany-infant-found-in-garbage-can", "content": "autopsy performed on east albany infant found in garbage can albany, ga - an autopsy was conducted monday on the body of a newborn infant discovered over the weekend inside a trash can on collins street in east albany. investigators did a preliminary interview with the mother but won't release her name until they complete a more in-depth interview. a group of doctors will review the case to determine whether the premature baby, said to be about 24-weeks along, ever took a breath. monday district attorney <mark>greg edwards</mark> explained the 911 call saturday morning around four o'clock came in for the mother. only after she was taken to the emergency room did doctors and nurses determine she'd had a baby. \"the matter evolved from the emergency room and police and emergency medical personnel made the effort to try and see if the body of the baby could be found and if anything could be done,\" said dougherty district attorney <mark>greg edwards</mark>. comments terms of use: we welcome your participation in our community. please keep your comments civil and on point. notify us of any inappropriate comments by clicking the \"mark as offensive\" link. you must be at least 13 years of age to post comments. by submitting a comment, you agree to these terms of service you must be logged in to leave a comment. nixle alerts click here to sign up for alerts from the albany police department on your mobile device click here to sign up for emergency notification in communities with code red add walb news, sports, and weather content to your news reader! do not call registry gives you a choice about whether to receive telemarketing calls at home. better business bureau check out a business or charity, or file a complaint. consumer reports operates the world's largest product testing and research lab. bureau of consumer protection works to prevent fraud, deception, and unfair business practices in the marketplace. all content? copyright 2000 - 2011 worldnow and walb, a"}, {"articleID": "2009082807_00019214_W", "names": {"Robert Huth": ["Q155461", "Q28007074"]}, "date": "2009-08-28", "url": "http://croydonguardian.co.uk/uk_national_sport/4569999.Chimbonda_decision_for_Allardyce/?ref=rss", "content": "chimbonda decision for allardyce (from croydon guardian) blackburn are plotting exactly where to deploy new signing pascal chimbonda after the 30-year-old french defender's arrival from tottenham. rovers confirmed chimbonda had signed a two-year on thursday night - one of several deals to go through on a day of swift business as the end of the transfer window beckons. sam allardyce bought chimbonda as a replacement for left-back stephen warnock, who moved to aston villa for a fee believed to be around £ 7million. other transfer moves included stoke's acquisition of defender <mark>robert huth</mark> from middlesbrough, everton's agreement to sign sylvain distin from portsmouth - pending a medical on thursday night - and fulham's confirmation of midfielder kagisho dikgacoi's arrival on a two-year deal for an undisclosed fee from golden arrows. sunderland manager steve bruce also gave midfielders carlos edwards and grant leadbitter permission to talk to ipswich. allardyce had lined up former wigan and sunderland defender chimbonda when villa first approached rovers about warnock but wanted the transfers to occur simultaneously. he said: \"we've got the deal done. we've got an experienced player who is desperate to play football again, having missed it at spurs.\" the only question that remains is chimbonda's most likely position for rovers."}, {"articleID": "2011090901_00062642_W", "names": {"Larry Page": ["Q4934", "Q6490923"], "Thomas Kurian": ["Q15646403", "Q7791610"]}, "date": "2011-09-09", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://sg.finance.yahoo.com/news/Judge-Oracle-Google-case-rsg-3597387387.html?x=0&.v=1", "content": "fri, 9 sep 2011, 09:34 sgt - singapore markets close in 7 hrs 26 mins {\"s\" : \"goog, orcl\" , \"k\" : \"a00, a50, b00, b60, c10, g00, h00, l10, p20, t10, v00\" , \"o\" : \"\",\" j \":\" \"} on friday 9 september 2011, 9:29 san francisco (reuters) - the judge overseeing a potential billion dollar patent case between oracle and google is angling for a summit of silicon valley's two most famous larrys. oracle corp chief executive larry ellison and google ceo <mark>larry page</mark> had not been slated by their respective companies to attend a mediation session in oracle's patent infringement case against google over the java programming language. however, in an order on thursday, u.s. district judge william alsup\" strongly \"recommended that the magistrate running the mediation compel ellison and <mark>page</mark> to show up.\" in light of the october trial date, mediation sessions should take place this month, \"alsup wrote. oracle spokeswoman deborah hellinger declined to comment, and google representatives did not immediately respond to a request for comment. oracle sued google last year, claiming the web search company's android mobile operating technology infringes oracle's java patents. oracle acquired the java programming language through its purchase of sun microsystems in january 2010. in court documents filed on wednesday, google proposed sending android chief andy rubin and general counsel kent walker to a mediation. oracle offered president safra catz and <mark>thomas kurian</mark>, its executive vice president of product development. google said in those court filings that it\" welcomes \"the upcoming negotiating session, while oracle said it\" concurs \"with the idea of having one.\" oracle has found previous efforts at settlement, including private discussions between the parties, frustrating for lack of follow-through, and believes that those efforts have not exhausted the possibilities for resolving the case, \"oracle wrote in its filing. the case in u.s. district court, northern district of california, is oracle america, inc v. google inc, 10-3561. quotes delayed, except where indicated otherwise. delay times are 15 mins for nasdaq, nyse and amex. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! singapore finance partner <mark>page</mark>. quotes are delayed at least 15 minutes. all information provided\" as is \"for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by commodity systems, inc. (csi). international historical chart data, daily updates, fund analyst estimates data provided by"}, {"articleID": "2014071618_00009174_W", "names": {"Robert Street": ["Q12718024", "Q15993540"]}, "date": "2014-07-16", "url": "http://www.talkingretail.com/products-news/alcohol/new-marketing-campaign-blossom-hill/", "content": "New marketing campaign from Blossom Hill Blossom Hill is launching a £ 2.1 m marketing campaign inviting consumers into the \"Wonderful World of [...] Wall's unveils two hour ice cream delivery service for London retailers Blossom Hill is launching a £ 2.1 m marketing campaign inviting consumers into the\" Wonderful World of Blossom Hill'. The activity, which will focus predominately on the new Blossom Hill Sun-Kissed Red & White range, includes TV, digital and cinema advertising, sampling in key cities nationwide and the launch of a new website. The campaign launched with a Blossom Hill TV ad on the 14th July 2014, designed to communicate the brand's new proposition, showcase its extensive range and highlight the new look packaging. A second TV ad the following week supports the new Blossom Hill Sun-Kissed Red & White range. The evocative creative features a series of strong, vibrant images of fresh fruit teamed with playful music to communicate the fun, fruity flavours of the brand and its new Sun-Kissed Red & White range. Digital support will come from the launch of the Blossom Hill's new website and activity on its popular Facebook page - www.facebook.com/blossomhill. Kevin Chinn, marketing director at Percy Fox & Co. said: \"We are incredibly excited to invite our loyal consumers in to experience the\" Wonderful World of Blossom Hill', whilst enticing new shoppers to try the innovative flavours and tastes that we know they will love. \"The campaign will showcase the vibrant new look and feel of the brand and is set to reach a substantial percentage of our target audience, delivering up to four opportunities for our consumers to view it through relevant mediums. Feedback from independent market research on the TV ad has been exceptional, with it hitting the top 10% of the best performing ads. The activity demonstrates our commitment to supporting our trade partners who will be able to capitalise on sales through the TV exposure and additional channel executions.\" Independent Retail News Retailer Newsletters Specially Selected Partner E-mails Sitemap © 2014 Copyright TalkingRetail.com. Metropolis Business Publishing, 6th Floor Davis House, 2 <mark>Robert Street</mark>, Croydon, CR0 1QQ"}, {"articleID": "2013070801_00013616_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2013-07-07", "url": "http://www.inquisitr.com/834976/james-cameron-will-begin-work-on-battle-angel-alita-movie-in-2017/", "content": "<mark>James Cameron</mark> Will Begin Work On \"Battle Angel Alita' Movie In 2017 <mark>James Cameron</mark> will begin work on his long-delayed Battle Angel Alita movie once he's finished with the Avatar sequels. The Titanic director has been kicking around the project for quite a few years now. Although it's still several years away, <mark>Cameron</mark> intends to move forward with the project in 2017. The award-winning filmmaker recently sat down with Children of Men Avatar around the globe, it's not altogether surprising that <mark>Cameron</mark> currently has plans to finish out the trilogy. Once those films are out of the way, the director can then move on to something else. MTV News last year that the project was still moving forward. Avatar might be taking up the majority of his time at the moment, but he still has every intention of bringing that story to the big screen.\" [You] would have to be pried out of my cold dead fingers, but, on the other hand, I'm not gonna - I don't wannatake it to my grave, either, \"the director explained. Battle Angel Alita takes place 300 years after a war lays waste to most of the world. The story follows a young female cyborg who is unearthed in some wreckage and eventually repaired. Unfortunately for the poor girl, she has no memory of who she is or where she came from. <mark>James Cameron</mark> also discussed his displeasure with most 3D movies. In his opinion, not every motion picture that comes barreling down the Hollywood pipeline needs to be presented in the format.\" I do not think Hollywood is using the 3D properly. The reason I say that Hollywood is not doing well is because it is automatic. For example, \"Man of Steel,'\" Iron Man 3? and all those movies should not necessarily be in 3D. If you spend 150 million on visual effects, the film is already going to be spectacular, perfect, \"<mark>Cameron</mark> explained. h4 class =\" icon-inq-social-friends widgettitle \"> Inquisitr With Friends h4 class =\" icon-inq-facebook widgettitle \"> Facebook h4 class =\" widgettitle icon-inq-featured-news \"> Featured Stories Firefighter's Remains Identified From WTC Attacks Twelve Years Later"}, {"articleID": "2016121800_00144875_W", "names": {"Robert Miles": ["Q1629565", "Q310985", "Q7347674"], "Steve Ramsey": ["Q4389824", "Q56676015"]}, "date": "2016-12-17", "url": "http://www.heraldonline.com/news/local/news-columns-blogs/andrew-dys/article121556642.html#storylink=rss", "content": "Order Reprint of this Story YORK Every year in the weeks leading up to Christmas, Buddy Owens, the jolly Vietnam veteran on Oklahoma Street in York, puts out lights and decorations to bring cheer to the Musical Heights neighborhood. To get to Oklahoma Street, you take South Pacific Street and pass Dolly Street. The neighborhood streets are all named for famous musicals. It was always considered a safe place to enjoy the lights. Nobody loved it more than Owens. \"It's always so beautiful over there. I have known Buddy for years and he always had such beautiful lights,\" said Doris Mode at York's senior center. Others at the center talked of driving their grandchildren past Owens' house to see the lights. But on Dec. 11, while Owens was fixing a palm tree light display in his front yard, he was attacked by two pit bull mix dogs and his arms injured so badly that he remains hospitalized after several surgeries. Police put it bluntly: Owens' left arm was mangled. One of the dogs had chased another woman in the neighborhood into her house, and a police officer who responded was threatened by one of the dogs before shooting it to protect himself and others. York's mayor Eddie Lee said the attack on Owens \"could have been fatal,\" and he will bring up a potential dangerous dog law to other city leaders in January. \"This was an attack,\" Lee said. \"Musical Heights, that's a safe neighborhood. But what happened could have been deadly.\" Lee said he plans to bring up the potential for a law against dangerous dogs despite the council being told about a decade ago that the city could not enact \"breed specific\" laws after complaints about pit bulls. \"After what happened here in York, we need to take another look at it,\" Lee said. A rash of dog attacks a decade ago prompted Rock Hill officials to look at a dangerous dog law aimed at pit bulls and Rottweilers, but that law never was passed after outcries from owners of those breeds. <mark>Robert Miles</mark>, the owner of one of the two dogs in the Dec. 11 attack, said the dogs are mixes of Boxer and American Pit Bull terrier, but had not previously shown aggressive behavior. Although both dog owners have been cited for leash law violations, police have so far filed no criminal charges. Investigators are continuing to look at the circumstances around the attack, said detective Billy Mumaw of the York Police Department who is handling the investigation. People in York were stunned by the attack and remain concerned. \"I am a Vietnam veteran just like Mr. Owens and what happened to him is just terrible,\" said <mark>Steve Ramsey</mark> of York. \"Here he survived Vietnam and at his age this happens to him. That's not right.\" Owens, 71, who worked almost four decades for a textile company, is a Musical Heights neighborhood Christmas staple but his family said it remains unclear if Owens will be released from a Charlotte hospital in time for Christmas. And even days after the attack this week, as Christmas approaches, many people drove down Oklahoma Street. Not just to see the lights as they have for so many years, but to see where a man was severely attacked in his own yard while trying to make Christmas bright for others."}]