[{"articleID": "2018032515_00023623_W", "names": {"Patrick Evans": ["Q18686079", "Q7146453"]}, "date": "2018-03-25", "url": "https://defence.pk/pdf/threads/us-clears-record-total-for-arms-sales-in-fy17.550285/", "content": "Pentagon US clears record total for arms sales in FY17 By: Aaron Mehta September 13, 2017 US on Track for Record Foreign Weapon Sales The State Department has cleared $45.2 billion in sales in just three months. By: Aaron Mehta A State Department official declined to address setting the record directly, instead noting that \"strengthening the defense capabilities of U.S. allies and their ability to partner with our forces is a smarter approach to protecting the United States, is a force multiplier for the U.S. warfighter, and ultimately, benefits U.S. industry by driving new innovation and creating high-quality American jobs .\" Lt. Cdr. <mark>Patrick Evans</mark>, a Pentagon spokesman, said DSCA would not comment on total figures until the end of the fiscal year but noted that \"sales continue to be strong and continue to indicate the interest of our partners in seeking the quality products and services we offer. Additionally, we have said in the past that when you examine the three-year moving sales averages, you can see the continuing, growing sales trend over the last decade .\" As in 2012, the vast majority of dollars approved came from a few huge notifications. The sale of F-15s to Qatar ($21.1 billion), F/A -18 E/F fighters to Kuwait ($10.1 billion), the Canada F/A -18 agreement ($5.2 billion) Patriot PAC-3 weapons to Romania ($3.9 billion), CH-47 Chinooks to Saudi Arabia ($3.51 billion) and Apache AH-64E for the UAE ($3.5 billion) all helped push the total to record highs. Sign up for our Daily News Roundup The top Defense News stories of the day Overall, 17 of the 73 DSCA notifications announced through Sept. 12 total $1 billion or more. Roughly $47.1 billion in potential sales were approved by the Obama administration, with another $28.7 billion approved under the Trump White House. However, at least some of those announced by the Trump administration began under the previous White House team. Given the high-dollar figure attached to fighter jet deals, it is no surprise that the Middle East leads the way for DSCA announcements, with 27 announced sales worth an estimated $52 billion. Because the total is so inflated by a few high-priced items, it is unlikely that DSCA's FY2018 will match the levels of 2017. But there are still some opportunities for big-ticket items out there. Schweizer highlighted tactical air, helicopters, missile defense and guided munitions as areas that will continue to be in demand. Callan, meanwhile, highlights potential deals for further THAAD (perhaps to Poland) and Aegis Ashore (publicly being sought by Japan) missile defense systems in 2018, as well as interest in new fighters from Belgium, the UAE, Israel, Japan and South Korea. Nathan, however, is concerned that the lack of a coordinated security cooperation strategy across the whole U.S. government will affect America's ability to continue to dominate the international arms trade. \"While a record number of DSCA announcements shows positive momentum in security cooperation, reflecting our government is working with partners to approve these important sales, it does not reflect the fact that the system is facing challenges in supporting the growing pace and scope of U.S. foreign policy, national security and economic objectives,\" Nathan said. \"We collectively have to do more to accelerate security cooperation improvements if we want to grow the return on investment for the American economy and our international alliances .\" \"Resourcing and reforms of this system will arguably have a much bigger, more sustainable impact on sales figures than any particular transaction,\" he concluded. https: //www.defensenews.com/pentagon/2017/09/13/us-clears-record-total-for-arms-sales-in-fy17/"}, {"articleID": "2010031307_00081974_W", "names": {"Christian Oliver": ["Q2965507", "Q61677"]}, "date": "2010-03-13", "url": "http://lanle.wordpress.com/2010/03/13/north-korea-draws-on-tobacco-for-cash/", "content": "a north korea desperate for foreign exchange has been generating hard currency by re-exporting british cigarettes, despite renewed efforts by the international community to apply tougher sanctions on the impoverished state. north korean and other asian trading entities started re-exporting state express 555 cigarettes, manufactured by british american tobacco, in february last year, just months before north korea's second nuclear test in four years prompted the united nations to impose tougher sanctions on pyongyang. bat sold the so-called \"nk 555s\" , made and packaged in singapore for the north korean market, to a singaporean distributor for shipment to nampo, a port near pyongyang. however, at least 15,000 cases worth $6.3 m (€ 4.6 m, £ 4.2 m) rebounded out of nampo to ports in vietnam and the philippines, according to documents seen by the financial times, to go to other markets where they commanded a higher price. while the un banned luxury goods exports to north korea, member nations have been allowed to compile their own sanctions lists, which critics say created loopholes. the us, japan, australia and canada banned a broad range of tobacco products. meanwhile, the european union and singapore sanctioned only cigars, which allowed bat to continue exporting nk 555 cigarettes to north korea. bat said it halted exports of the cigarettes from singapore to north korea after discovering a diverted cargo of nk 555s in august. international tobacco companies frown on \"grey market\" or \"parallel\" exports of their products to markets for which they were not intended. but national customs authorities target counterfeits rather than so-called \"diverted real product\". the diversions offer a rare glimpse into how the impoverished country can secure foreign exchange - especially as the noose tightens on arms exports. international security agencies have also cracked down on suspected north korean smuggling of narcotics and counterfeit $100 bills in recent years, forcing the regime to find other sources of hard currency. the nk 555 diversions may be part of a much larger flow of dollar-earning re-exports. their interruption comes at an awkward time for a regime that has tested the patience of the international community. closer to home, a populace with memories of severe 1990s-era famines is infuriated by pyongyang's recently botched currency reform programme. \"the turmoil in north korea is self-inflicted and far more damaging than the [un] sanctions,\" said marcus noland, a north korea expert with the peterson institute for international economics in washington. bat has maintained some business ties to the country. it still supplies its former pyongyang joint venture, from which it divested in 2007, with materials to make and sell cheaper craven a cigarettes on the domestic market. bat says 175m nk 555s were exported to north korea in 2008. they were made and packaged in singapore which, like the eu, banned exports of cigars but not cigarettes. the london-based company sold the nk 555s to sutl group, a family-controlled distributor in singapore, for onward shipment to the north korean port of nampo. \"when we became aware of the diversion, we immediately launched an investigation,\" pat heneghan, global head of bat's anti-illicit trade division, told the ft. \"we certainly didn't like what we found .\" while there was no evidence of any involvement by sutl in the diversion, mr heneghan said bat still had \"a very hard discussion with the distributor\". sutl declined to comment. there is no evidence that the re-export of nk 555s by a number of unidentifiable north korean entities and other small trading companies across asia was illegal. while tobacco companies consider the re-routing of legitimate cigarettes from their intended market as \"illicit\" , they are not necessarily \"illegal\" in the eyes of customs authorities focused on counterfeits and smuggling. \"in august last year, bat discovered a diverted nk 555 shipment in singapore, which we assumed could be for transhipment to other markets in asia,\" said a bat spokeswoman. \"but we were unable to inspect the shipment as we could not demonstrate any breach of singapore law to the authorities .\" on april 10 2009, the nk 555 re-exports were discussed in an e-mail sent by a singapore-based cigarette trader to a potential buyer in manila. \"we have to confirm by next week,\" wrote bert lee of compass inc. \"empty containers will have to start moving into nampo...so kindly speak and plan with your buyer and let me know if you want to take up this new nk 555 blue .\" compass began to sell cases of nk 555 to a hong kong-based trading company in early 2009. e-mails and shipping documents show the cigarettes were first diverted to dalian, a chinese port, and then shipped on to singapore before finally landing in haiphong in vietnam. while the trail ran cold in haiphong, people tracking the shipment suspected its ultimate destination was china. \"they sell it to someone who can handle it for the china market,\" said one person involved in the trade, who asked not to be identified. invoices sent from compass to its hong kong buyer in february 2009 do not reveal the north korean source of the nk 555s. but mr lee left no doubt about the cigarettes' provenance. \"stocks are now in nk and sample already send [sic] out to us,\" he wrote to his potential buyer in manila. \"i hope we can work on this new blue [555] and controlling the market and stocks as soon as possible .\" mr lee did not reply to phone calls, e-mails and faxes from the ft. \"as a trader, we just get the product and buy and sell,\" said one compass executive who declined to identify himself or comment on the nk 555 shipments when contacted by telephone. \"where it goes, who knows?\" additional reporting by <mark>christian oliver</mark> in seoul"}, {"articleID": "2011011606_00081240_W", "names": {"Tony Phillips": ["Q10383226", "Q21461790", "Q7823170"]}, "date": "2011-01-16", "url": "http://chron.com/disp/story.mpl/metropolitan/7383456.html", "content": "grand saline - dust from <mark>tony phillips</mark>' sweet potato fields fills the leather creases across the toe of his workboots. along the soles, salt from his second job cakes the rubber bottoms. during harvest season, he easily puts in 20 hours a day - a full night at the morton salt mine and a full day in his field. like the dwindling number of sweet potato farmers in east texas, he kept a second job to have a backup to the exceedingly risky farming industry. \"i've got to be a farmer, an accountant, a salesman and a weatherman,\" <mark>phillips</mark> said, standing outside a warehouse stacked floor to ceiling with hundreds of crates of his sweet potatoes. by thanksgiving, he sold half his crop to h-e-b, walmart and the prison cannery. the rest, he said, needs to sell before easter. more and more, east texas' sweet potato farmers are cutting back or quitting the business, <mark>phillips</mark> said. for 1970, he estimates, texas had about 5,000 acres of sweet potatoes. a mere two years ago, he said about 1,500 acres were planted, and last year, it was probably fewer than 1,000 acres. \"there were 70 or 80 growers when i started,\" he said. \"there might be 15 now, but the people who are still doing it do a real good job .\" towns such as golden and gilmer continue annual sweet-potato festivals and parades, serving as reminders of east texas' once-rich sweet potato history. texas ranked third nationally in the sweet potato industry, growing 13,500 acres of the crop, in 1970, according to the texas department of agriculture. the numbers dwindle from there. by 1980, texas dropped to fourth with 8,000 acres. the state maintained its fourth ranking through 2000, growing 6,800 in 1990 and 5,500 in 2000. this year, texas farmers only farmed 1,300 acres of sweet potatoes, and the state fell to eighth nationally. losing family traditions <mark>phillips</mark>, 50, joined his father and uncle's farming business in 1978, the year after he graduated high school, as a side project to his job at the salt mine. he remembers several boys in his graduating class who joined their fathers' farms. these days, he said, there is not an incoming generation of growers. \"very few younger people want to go into the business,\" he said. \"there's nobody to come in behind us to replace us .\" he thinks the mounting obstacles facing today's farmers deter the business. once a prospective farmer finds a large enough piece of land, he has to control wild hogs and deer, he said. the next step is praying for good weather during harvest season and finding enough affordable labor to get the job done. but he noted that it would be \"near impossible\" to start up, unless the sweet potato hopeful had \"a ton of cash on hand .\" but up near emory, farmer scott lyles, 52, is nurturing a new generation. lyles' 10 children help with accounting and sales at bright star farm. in the mix of finding land to farm and keeping wild hogs away from the crops, sweet potato farmers also deal with weevils, a devastating insect. the insect feeds and tunnels through sweet potatoes, leaving punctures on the skin and making the potato \"unfit for human or animal consumption,\" lyles said. but as for the future of east texas sweet potato farmers, lyles, and many other farmers who stuck it out, expect their numbers to continue dwindling. lyles said tourism to lake fork created a boom in growth to the area. \"land is still an issue for us,\" he said. \"a lot of the land that was used in the past, there's houses on it now .\" he and his wife are hopeful their children will take over the business. \"i wouldn't change it for anything,\" lyles said. \"this is what we were made to do .\" "}, {"articleID": "2009080520_00020523_W", "names": {"Amy Anderson": ["Q18637100", "Q4749070"], "Jennifer Song": ["Q6178833", "Q6178835"]}, "date": "2009-08-05", "url": "http://westhawaiitoday.com/articles/2009/08/05/sports/local_sports/sports02.txt", "content": "kim drops to sixth at amateur, but makes the cut by stephens media wednesday, august 5, 2009 10:02 am hst no harm, no foul for kimberly kim. the pahoa native struggled a bit tuesday but easily made the cut at the u.s. women's amateur in st. louis. kim carded a 74 at old warson country club to finish in a six-way tie for eighth at 1-over-par 143 during two rounds of stroke play qualifying. advertisement the 17-year-old faces canada's maude-aimee leblanc today at 4:10 a.m. hawaii time in the first round of match play. leblanc finished at 8-over 150 to tie for 53rd. the top 64 golfers advanced to match play, which will conclude with a 36-hole final sunday. kim, the 2006 women's amateur champion, had room for error tuesday after an opening round 69 left her tied for second. she bogeyed two of her first four holes and never found the rhythm she had monday when she pocketed six birdies. she was one of three golfers from hawaii to make the cut. honolulu's stephanie kono (147) tied for 28th and cassy isagawa (149) of wailuku, maui, tied for 46th. danielle kang (138) of thousand oaks, calif., rolled in a 30-foot par putt to cap a 68 and claim medalist honors. kim could see some familiar faces out on the course today. also qualifying were <mark>amy anderson</mark>, who beat kim in the finals of the u.s. girls junior championship on july 25, and <mark>jennifer song</mark>, who relegated kim to a runner-up role at the u.s. women's amateur public links on june 27. playing in a tournament for the third consecutive week, kim says she hasn't had time to dwell on her disappointments. \"at the junior, i was really upset,\" kim told the amateur's web site. \"but the next day reality sets in because you're stepping on a plane to the next tournament. so there really isn't much time to think about what you just did. your focus is on the next big tournament .\" the associated press and contributed to this report. rate story current rating: 0 of 0 votes! rate file:"}, {"articleID": "2020021719_00018378_W", "names": {"Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"], "Harmanpreet Kaur": ["Q3525920", "Q52239619"], "Rajinder Singh": ["Q1523698", "Q15966650", "Q24005533", "Q41609414", "Q56686099", "Q7286161"], "Ajit Kumar": ["Q27973774", "Q56804784"], "Bharat Bhushan": ["Q30541659", "Q42119414", "Q42884182", "Q4901100", "Q57332897"]}, "date": "2020-02-17", "url": "http://www.dailypioneer.com/2020/state-editions/snake-man-rescues-serpents--brings-relief-to-people.html", "content": "Home State Editions Dehradun Snake man rescues serpents, brings relief to people Tuesday, 18 February 2020 | PNS | Haridwar Share T T T T 0 Snake man rescues serpents, brings relief to people Tuesday, 18 February 2020 | PNS | Haridwar Due to the close proximity of Haridwar city to the Rajaji national park and other wooded areas, various wild animals moving in areas populated by humans is not uncommon here. Apart from the mammals, there are also different species of snakes in the region. It is here too that the forest department is playing a proactive role by rescuing snakes that enter human habitations. The timely action of the department staff prevents harm to both the humans and the serpents. One of the major responsibilities of the divisional forest office is to take necessary action on reported conflict situation between a human and a snake or a wild animal. When it comes to snakes, Bhola Ram is the person who attends to the calls from citizens. He used to look after routine work in the forest department office in the past but after learning the necessary skills has become known as \"snake man' among the locals. Talking to The Pioneer, he said,\" I used to the work in the department office. However, once when I accompanied the snake catching team, it occurred to me that I too could do this task. After learning the basics among experienced officers, I too started catching snakes. Now, I rescue an average of two to three snakes a day or about 100 snakes a month due to which some people know me as \"snake man' .\" Bhola Ram routinely rescues various venomous and non-venomous snakes including the Russell's viper, cobra, common krait and other species. The forest division has also felicitated him in the past for efficiently rescuing snakes and resolving human-wildlife conflict situations. Talking about him, the Haridwar divisional forest officer Akash Verma said that Bhola Ram is a capable person who is playing an important role in the department. Currently, he is working on a contract basis and has been given a place in the rescue squad. Trending News Pakistan no longer a \"safe haven' for terror groups: <mark>Imran Khan</mark> After Facebook, coronavirus derails Intel event in US Four Indians infected with coronavirus on board cruise ship responding well to treatment: Indian embassy Sidharth referred to Shehnaz's father as\" daddy'? Pakistan launches nationwide anti-polio campaign It's going to be very big if we win T20 WC: <mark>Harmanpreet Kaur</mark> 4 dead, 15 hospitalised after inhaling toxic gasses coming out of vegetable container in Karachi BBC takes soccer pundit off air after racist comment China virus death toll rises to 1770; total cases climb to over 70,500 Trump threatens intelligence block over Huawei: US diplomat Bieber admits to being \"reckless' in previous relationship Delhi AQI turns\" very poor', thunderstorms likely soon more State Editions \"Ekal Abhiyan' proves service not medium of any trade: CM 18 February 2020 | PNS | Lucknow CM to review arrangements for Trump's visit to Agra 18 February 2020 | PNS | Lucknow UP Budget: Yogi govt faces uphill task to bridge deficit 18 February 2020 | PNS | Lucknow Sunni Waqf Board's crucial meeting on February 24 18 February 2020 | PNS | Lucknow Rs 7,900 cr plan okayed for FY' 20-21 for HP 18 February 2020 | PNS | Chandigarh Inbrief 18 February 2020 | PNS | Chandigarh Delhi, Bhopal, Bhubaneswar, Ranchi, Lucknow, Chandigarh, Dehradun, Raipur Sunday Edition Sustainability goals 2020 16 February 2020 | Somnath Debnath | Agenda Ways to Staying Healthy 16 February 2020 | Sant <mark>Rajinder Singh</mark> | Agenda Be your own well-wisher 16 February 2020 | <mark>Ajit Kumar</mark> Bishnoi | Agenda You can write your life anew 16 February 2020 | <mark>Bharat Bhushan</mark> Padmadeo | Agenda Talktime |\" I have been my own person' 16 February 2020 | Shalini Saksena | Sunday Pioneer Larry's theme for a dream 16 February 2020 | Shalini Saksena | Sunday Pioneer E-mail this link to a friend. Email of your friend: Your Name (Sender's): Your Email (Sender's): Subject: Home About Us Contact Us Advertise with us Archives © 2020 The Pioneer. All Rights Reserved. Site Designed and Developed by: Infomedia Web Solutions"}, {"articleID": "2011091607_00064722_W", "names": {"Colin Powell": ["Q150851", "Q5145485"], "Michael Gallagher": ["Q16729157", "Q18753018", "Q1927517", "Q23982048", "Q24005409", "Q56952076", "Q6828327", "Q6830491", "Q6830492", "Q6830493", "Q6830494", "Q6830499", "Q6830500", "Q6830501", "Q6830502", "Q6830503"]}, "date": "2011-09-16", "url": "http://bulatlat.com/main/2011/09/16/us-admits-role-in-opposing-sisons-exclusion-from-terrorist-list/", "content": "? after 60 years, us-rp defense pact \"proved useless, disadvantageous to philippines'? public private partnerships in education, health\" more costly' - act teachers party? protest against 2012 budget dispersed, ralliers to file charges, intensify protests bulatlat.com in a series of cables, the us embassy admitted the us' government's role in the terrorist listing of prof. jose ma. sison, chief political consultant of the national democratic front of the philippines (ndfp) in the peace talks with the government of the philippines (gph). wikileaks also released confidential and secret cables from the us embassies in manila and the hague in the netherlands, and these expose how the three governments worked together to designate sison as a terrorist. sison also stands as the chief political consultant of the national democratic front of the philippines (ndfp) in peace talks with the government of the philippines (gph). attacks against sison served to endanger the talks. in the three cables where officials and reports from the us embassy in the manila, the hague and the gph were quoted, kenney said that it was inadvisable for the netherlands government to remove prof. jose m. sison from the terrorist listing of the european union. it said sison is the leader of the npa and that the npa continues to launch attacks and ambushes against its targets including philippine military and police personnel. sison, the communist party of the philippines and new people's army were included in the us terror list in august 2002, right after the manila visit of then secretary of state <mark>colin powell</mark>. he was soon after also included in the eu \"terrorist list\" of organizations and individuals upon the requests of the us and ph governments. his bank account was subsequently frozen, denying him social benefits accorded to refugees living in the netherlands. in a cable dated 05/18/2009, charge d'affaires <mark>michael gallagher</mark> in the us embassy in the hague sent a cable to manila on the dutch government's \"urgent request for information\" on sison's inclusion in the terrorist list. the dutch government was concerned that the european court of first instance would rule that sison does not rightfully belong in the the eu sanctions list. \"the dutch government may be unable to retain its domestic designation against sison if the eu removes him from its list. the dutch government claims that it listed sison in 2002 at the us government's request, and it is now urgently asking for us government information to bolster the case for keeping sison's eu and dutch designations,\" he said. in manila, kenney said the \"npa remains a serious threat to the country's security, development, and the continued consolidation of democratic institutions,\" and that \"the designation of the npa as a terrorist organization by the u.s., eu, and others has materially hampered its effectiveness and military capabilities .\" kenney also said she concurred with the march 2009 intelligence community assessment of the npa's activities since 2004 and sison's leadership of the npa is basis enough to go against all calls to have sison removed from the terrorist listing. in the meantime, the us embassy under kenney essentially admitted that the us interfered in the peace talks between the gph and the ndfp. according to ndfp chief negotiator luis jalandoni, the us, dutch and philippine governments engaged in acts that were inimical to the peace talks between the ndfp and the philippine government. in statements released in 2007, jalandoni insisted that the gph has been using the terrorist listing as leverage against the ndfp. sison was placed under intense pressure: he was deprived of social benefits; his life was threatened, and he was actually even arrested and detained in september 2007. reports had it that the matter of the terrorist listing became a prejudicial question in the peace talks. in a 2005 meeting with us ambassador francis ricciardone, foreign affairs secretary alberto romulo said the npa's \"delisting as a foreign terrorist organization depended on a demonstration or proof of sincerity.such as entering into a cease-fire or new peace talks .\" the same leveraging tactic was echoed by then presidential peace adviser annabelle abaya in a discussion with us ambassador kristie kenney in november 2009. abaya noted that sison's delisting by the eu \"would eliminate some of the grp's leverage over him\" and that \"the grp preferred sison to remain designated as a terrorist\" but admitted that \"talks had not succeeded during his time in the eu list\". pressure for sison's removal from terrorist list in the meantime, the foreign ministry's terrorism finance coordinator, wendela haringhuizen, met with the us economic office on may 13, 2009 to discuss the sison case and the dutch government's great concern about the repercussions if the european court rules that he should not remain in the eu sanctions list. the official also was reported to have alluded to agitation from several countries including norway to remove sison from the list and allow him to travel to norway to participate in the peace talks. the official also reported that within the the eu the customary sanctions blockers feel the case against sison is \"weak\" despite the efforts of the the dutch police, intelligence services (aivd), and the dutch embassy in manila against the delisting. \"these offices have not been able to provide concrete help,\" haringhuizen said. \"it was also stated in a cable that the dutch government\" feels on thin ice because the original listing was in part at the us government's request. \"us intervention, through the terrorist listing, had a very negative impact on the peace talks. it was a move that was aimed at forcing the ndfp to surrender to the philippine government, even without addressing the roots of the armed conflict. this negates the inherent character of the talks which are primarily aimed at finding solutions to the root causes of the armed struggle. arroyo appeared more interested in getting the ndfp to surrender than in addressing the substantial issues in the peace negotiations. these issues include human rights, socio-economic reforms, political and constitutional reforms, and the disposition of forces. after a long legal battle, sison was eventually removed from the eu\" terrorist list \"in november 2009 based on a ruling by the european court of first instance. it appeared that the dutch\" terrorist listing \"was done only in relation to asylum proceedings and was not based on actual crimes or terrorist activities. us embassy admits strength of revolutionary forces finally, in a cable the us embassy admitted that the cpp and the npa continue to maintain a support base at the grassroots level .\" the cpp/npa cadre often provide free medical care, education, and other social services to the rural poor, especially in areas where the grp remains only a distant reality. these social services, as well as propaganda against the often ineffective and corrupt central governmental structure, help to explain the continued appeal of the cpp/npa/ndf to segments of the philippines' rural and urban population. it also said that the the npa remains a potent force. \"the npa targets not only grp security forces but also internal dissenters, defectors, suspected government informants, and those who fail to pay\" revolutionary taxes \"or\" permit to campaign \"(ptc) fees .? pnp, cidg continue to evade producing its own witnesses' in jonas burgos abduction case? witnesses to abduction of 2 up students ready to confront palparan, other accused? nato-led rebels abducting, killing civilians in libya, including migrants, immigrants"}, {"articleID": "2016121311_00775346_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}, "date": "2016-12-13", "url": "http://tv3.ie/entertainment_article.php?locID=1.803.810&article=225400", "content": "<mark>Will Smith</mark> confident his daughter can handle dating without his help 13th Dec 16 | Entertainment News & times; Share URL Close <mark>Will Smith</mark> sees no need to get involved in \"confident\" daughter Willow's love life. The daughter of the Men In Black actor and his wife Jada Pinkett Smith turned 16 in October (16) and is already a fully fledged star in her own right with a budding music career and high-fashion campaigns to her name. Quizzed on whether male suitors are lining up to take her out, <mark>Will</mark> joked Willow already knows how to speak for herself in that area. \"My baby is 16,\" he exclaimed to Entertainment Tonight. \"Willow can handle herself on that one. They knock on the door and the first couple of questions that Willow asks sort of shuts it down. She's so confident in who she is and what she wants to be and where she's going; it's just amazing to see that inner-energy come out in pictures. I'm very proud of her .\" Joking that the Smith ladies are \"a lot\" to take in, <mark>Will</mark> puts his daughter's tough edge down to her mother's influence. The 48-year-old actor was speaking at the New York City premiere of his new film Collateral Beauty, in which he plays a father coping with the loss of his daughter to a rare form of cancer. At the same time as the film was in production, <mark>Will</mark>'s own father, Willard Carroll Smith, Sr., was diagnosed with cancer, and during his chat with ET, the Suicide Squad star spoke again about how the illness has impacted his performance. \"During the time that I was preparing the character my father was diagnosed,\" he added, of his dad who passed away last month (Nov16). \"So here I'm playing a character who's studying everything about loss and world religion and all of that, and I was able to share that with my father and we were able to work through the process .\" Collateral Beauty hits cinemas from 15 December (16) and also stars the likes of Kate Winslet, Helen Mirren and Edward Norton. & copy; WENN Newsdesk 2016 Previous: Orlando Bloom: \"Fatherhood renewed my sense of responsibility' Next: Jennifer Lawrence is a\" huge hypochondriac! '"}, {"articleID": "2009030121_00012608_W", "names": {"Nathan Lane": ["Q2396802", "Q491264"], "Sergio Trujillo": ["Q6125662", "Q7454424"]}, "date": "2009-03-01", "url": "http://register.thestar.com/Entertainment/article/594520", "content": "theatre critic new york - the classic musical guys and dolls is all about gambling, and lots of people have high stakes on the table in the revival opening on broadway tonight. there's a consortium of producers (including toronto's david mirvish) who have about $15 million invested in the show, a fair chunk of change in this recession economy. but then there are those whose contributions to the show, while harder to measure financially, are perhaps even riskier. take director des mcanuff. his last broadway outing was jersey boys, one of the major hits of the new century. that would put enough pressure on anyone. but add the fact that, as of last spring, he's the solo artistic director of the stratford festival, and you have a pressure cooker scenario that would melt down most people. except for mcanuff, who redefines \"cool .\" on friday, about 48 hours before his show is due to open, he sits calmly in his midtown office, sipping bottled water and talking about what brought him to this project in the first place. \"i've always loved the music of frank loesser,\" begins mcanuff. \"when i did the revival of how to succeed in business without re ally trying starring matthew broderick back in 1995, i had the great pleasure of getting to know frank's wife, jo loesser, and she has been one of the biggest instigators of wanting me to direct a new revival of guys and dolls .\" it's not as though the classic story of the manhattan demimonde based on the stories of damon runyon has exactly been absent from broadway since its original triumphant run back in 1950. the 1955 film version, starring frank sinatra and marlon brando, brought the show to a worldwide public who would otherwise not have known it. there were numerous small-scale revivals in the 1960s, and an all-black version in 1976 (starring robert guillaume from benson) set the town on its ear for nearly a year. then there was the legendary jerry zaks revival in 1992 that turned <mark>nathan lane</mark> and faith prince into superstars and ran almost as long as the original production. anyone who knows mcanuff realizes he's not the guy you go to for a reverential, museum-style revival. and that's not what he delivered. \"initially i thought about updating the show,\" says mcanuff, \"but then i came to realize the real truth lay in the opposite direction .\" damon runyon wrote the original stories...back in the 1930s. when george kaufman, abe burrows and frank loesser set out to adapt it, they decided to make it contemporary, so it turned into a story of post-world war ii new york. but i asked myself, what if we went back to when runyon actually created the material? \"with his usual knack for finding the deep theatricality in any situation, mcanuff explored those years just after the depression, when new york was coming alive again and burlesque, in its tawdriest manifestations, was grabbing a place at the enterainment table .\" miss adelaide keeps telling us that she has a chronic cold because of her skin exposure, \"mcanuff laughs,\" and that makes a lot more sense if she's a burlesque stripper than a nightclub dancer. \"mcanuff also feels that a world coming out of a depression offers more dramatic intensity .\" for these guys, \"he insists,\" every roll of the dice means salvation or loss. it means that \"luck be a lady' isn't just a hopeful song, but a desperate one .\" choroegrapher <mark>sergio trujillo</mark>, who works hand in glove with mcanuff, shares the vision. \"when i have these men shooting dice,\" he says, \"it's not just a casual game or a chance to make a few dollars. it's life and death, and they play it that way .\" <mark>trujillo</mark> deliberately sought out high-profile, super-intense dancers like john selya (movin' out) to fulfill his vision. as for crafting the sexy nightclub routines for lauren graham, best known as the mom on tv's gilmore girls, <mark>trujillo</mark> says, \"we worked together closely every step of the way. we discussed just what the character would feel and how she would dance. what we came up with was kind of marilyn monroe-ish, but also very unique .\" mcanuff isn't worried about this production in terms of his overall career, or how it might reflect upon his work at stratford. \"i truly believe that what damon runyon, abe burrows and frank loesser wrote was classic,\" he says, \"and it's my job to make it come alive again onstage, just the same way i would do with a shakespearean text."}, {"articleID": "2010080209_00057188_W", "names": {"Matt King": ["Q16222252", "Q16224598", "Q1909213", "Q1909222", "Q30318230", "Q41699562", "Q6788903", "Q6788904"], "James Graham": ["Q16213380", "Q16224495", "Q19560599", "Q3161111", "Q3161352", "Q335692", "Q43911144", "Q6134823", "Q6134831", "Q6137567"], "Paul Wellens": ["Q3372412", "Q486939"], "Tony Smith": ["Q1618809", "Q16197257", "Q16616294", "Q19577926", "Q21461804", "Q27037222", "Q28791252", "Q3531891", "Q3531893", "Q7822195", "Q7823435", "Q7823441", "Q7823444", "Q7823445", "Q7823446", "Q7823447", "Q7823448", "Q7823449"], "Michael Monaghan": ["Q56959274", "Q6832865"], "Jon Clarke": ["Q6270498", "Q6270502"], "Paul Wood": ["Q17063188", "Q7154470", "Q7154471"], "Francis Meli": ["Q3081596", "Q47769167"]}, "date": "2010-08-02", "url": "http://liverpoolecho.co.uk/liverpool-entertainment/echo-entertainment/2010/08/02/potter-delighted-to-win-epic-against-warrington-100252-26977385/", "content": "potter delighted to win epic against warrington st helens boss mick potter admitted he was a relieved man after his side's 26-24 derby victory at warrington in an epic contest. the lead changed hands five times in the engage super league contest and potter said: \"it was a superb advertisement for the game .\" it was not over until the last carry and even then everyone was wondering what would happen. \"it was a fantastic match and i am just glad we finished on the right side of the scoreboard .\" potter singled out youngster jamie foster, who scored two tries and kicked three goals as stand-in for the injured <mark>matt</mark> gidley. he explained: \"jamie had a bit of pressure put on him with kick plays but i am happy with the way he is progressing .\" james roby and <mark>james graham</mark> were outstanding for us and benny westwood for them. both sets of forwards were dragging their heels at times but found the energy to keep playing. \"my players came back into the sheds at the end of the match drained .\" despite our semi-final against leeds on saturday we won't have a heavy week of training after that. \"<mark>paul wellens</mark> was everywhere and is still one of the best full-backs in super league .\" ben westwood, who also scored two tries and four goals for warrington, missed a late conversion which could have earned his side a rare point against saints. but coach <mark>tony smith</mark> said: \"he has been kicking well in recent times and i feel for him. he had a superb game and was the best player on the pitch .\" he kicked a goal earlier many people thought he wouldn't kick and played a big part in almost getting us a bit of history. the game could have gone either way but it was much the same as other contests against saints in recent years. unfortunately for us it was the same result. \"we didn't quite execute on the day. saints scrambled and hung in there and put pressure on us .\" we didn't quite take our opportunities but were not far off. it was a much better performance than last week - and that's encouraging. \"<mark>smith</mark> admitted he had\" no problem \"with jamie foster's second try despite a suggestion of offside by jon wilkin from <mark>michael monaghan</mark>'s pass. <mark>smith</mark> also praised <mark>jon clarke</mark> for his performance and said:\" roby was terrific for them. \"saints have now lost only one of the previous 42 derbies since the super league launch in 1996 - a defeat at the wolves' old wilderspool ground in 2001. saints took the lead on their first raid as <mark>james graham</mark> fed chris flannery for matty ashurst to blast his way through three defenders with jamie foster booting the touchline conversion. and wolves were powerless to stop foster extending the lead as leon pryce collected a long cut-out pass to go over in the corner and make it 10-0 with sub tony puletua making a big impact in the build-up. warrington desperately needed a score and, after <mark>graham</mark> had been penalised, it was <mark>paul wood</mark> who obliged although it was a magical pass from david solomona which gave him the opportunity. ben westwood tagged on the conversion and then added the extras five minutes later to fire the wolves ahead 12-10 after <mark>wood</mark> released the ball to <mark>jon clarke</mark>. warrington's joy was short-lived with <mark>francis meli</mark> brushing off <mark>matt king</mark> straight from a scrum and foster's conversion made it 16-12. warrington went back in front after 51 minutes with westwood barging his way over and then add the conversion to make it 20-16. but in a clash that lived up to the pre-match hype <mark>wellens</mark> midfield burst created the chance for james roby to touch down with foster landing the touchline conversion. <mark>king</mark> looked like he may level for warrington before losing the ball after a superb <mark>graham</mark> tackle. both sides should have been out on their feet but westwood had enough energy to latch onto briers' kick and go over but then was agonisingly wide with the conversion to leave his side trailing 26-24. the liverpool echo, the best source for liverpool fc, everton fc and liverpool news. your liverpool echo, great local images, videos and your local stories."}, {"articleID": "2019092513_00555138_W", "names": {"David Schneider": ["Q4412226", "Q465987", "Q5239547", "Q5239548", "Q53722688"]}, "date": "2019-09-25", "url": "http://www.somersetcountygazette.co.uk/news/national/17926644.anti-brexit-group-launches-redesign-contest-government-propaganda-posters/", "content": "Anti-Brexit group launches redesign contest for Government \"propaganda' posters By Press Association 2019 Brexit preparation posters 0 comment Creative members of the public have been called upon to satirically redesign the Government's\" get ready for Brexit \"campaign. Anti-Brexit group Led By Donkeys has launched a competition which will see the five best remakes of the Government advertisements put on billboards across the country. The contest will be judged by The Thick Of It creator Armando Iannucci and comedy actor and writer <mark>David Schneider</mark>, and aims to ridicule a campaign which has reportedly cost the taxpayer £ 100 million .\" It's an absolutely colossal amount of taxpayers' money going into what is basically a Brexit propaganda campaign, \"Led By Donkeys' Oliver Knowles told the PA news agency .\" It seems crazy that at a time when so many social services are under so much pressure after years of austerity, that so much money should go into something as crazy as this. \"An example of the adverts being promoted on Facebook by the Government (Gov. uk/Facebook) People can enter the competition by visiting ledbydonkeys.com, where they can also use an online tool to create their own version of the Government Brexit messages, which have been published on social media, billboards and in newspapers in recent months. Will Rose, of Led By Donkeys, said:\" If you absolutely must launch a £ 100 million propaganda campaign at taxpayers' expense to make Brexit feel inevitable, at least make it good. \"Instead, (Boris) Johnson and (Michael) Gove have come up with a cross between a supermarket's own brand pasta packaging and the 1980s England football kit .\" Led By Donkeys said the judges, who it described as \"comedy heroes\" , will be looking for \"creativity, great satire and someone who gets the cause\". Hi @ patel4witham, we saw your Tory election adverts masquerading as Home Office police recruitment ads. If you were serious about police numbers you wouldn't be spaffing £ 100m up the wall on your hopeless \"Get Ready For Brexit\" campaign. (Location: Portsmouth International Port) pic.twitter.com/WRXWkelsD5--Led By Donkeys (@ ByDonkeys) September 23, 2019 \"Billboards mean billboards,\" said Mr <mark>Schneider</mark>. \"And I'm very much looking forward to helping people use them to try and prorogue our Brexit misery .\" I shall try and be as decent and fair a judge as Lady Hale in this comedy Supreme Court. \"Iannucci added:\" All we are doing is taking back control of our billboards. \"Together, we can spaff posters on to prime advertising space and send a message: that message is\" Please Help Us, God'. \"Led By Donkeys has made its name by protesting against Brexit with various large-scale projects in public spaces, first going viral in early 2019 by sharing politicians's past statements on billboards with the aim of highlighting hypocrisy. 0 comment"}]