[{"articleID": "2015122916_00671781_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-12-29", "url": "http://blogs.wsj.com/washwire/2015/12/29/super-pac-backing-jeb-bush-attacks-marco-rubio-in-ad-airing-in-iowa/", "content": "Article Comments (1) 2016 2016 Election Ads Iowa Jeb Bush Marco Rubio Right to Rise PAC By Rebecca Ballhaus @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography CONNECT @ rebeccaballhaus rebecca.ballhaus @ wsj.com Biography Marco Rubio and <mark>Donald Trump</mark> shake hands as Jeb Bush looks on during the Republican presidential debate in Milwaukee Nov. 10, 2015. Morry Gash/Associated Press The super PAC backing Republican Jeb Bush is airing a new ad in Iowa criticizing rival Marco Rubio for skipping his U.S. Senate duties while running for president. The campaign, which will run for two weeks and cost $1.4 million, is the latest chapter in Bush backers' efforts to portray Mr. Rubio as overly devoted to campaign fundraising. More In 2016 5 New Year's Resolutions for <mark>Trump</mark>, Clinton and Other 2016 Campaigns Video: Ted Cruz Is Loathed in Washington but Loved in Iowa For Obama, 2015 Was a Mixed Year in Foreign Policy Capital Journal Daybreak: <mark>Trump</mark>'s Strength Points to New Dynamic in New Hampshire, More Seib Video: Three Things to Watch for Next Year in Politics \"Days after the Paris attacks, senators came together for a top-secret briefing on the terrorist threat,\" the narrator intones, referring to the terrorist attacks in Paris last month that left more than 120 people dead. \"Marco Rubio was missing, fundraising in California instead.\" With an image of an empty seat, the ad also knocks Mr. Rubio for missing a similar briefing following the attacks in San Bernardino, Calif., earlier this month. The ad also notes that Mr. Rubio has missed \"more total votes than any other senator,\" repeating a line that many of Mr. Rubio's rivals have used against him. Mr. Rubio's campaign on Tuesday pushed back on the super PAC's criticism. \"Bush's team dishonestly omits that Marco is on the Senate's Intelligence Committee, where he attended the highest level briefings on the Paris attacks,\" Alex Conant, Mr. Rubio's spokesman, said in a statement emailed to reporters. \"No other candidate for president has received more classified Intelligence briefings or better understands the threats facing our nation today than Marco. It's sad to see Jeb's\" joyful' campaign reduced to such intellectual dishonesty. \"The pro-Bush super PAC, Right to Rise USA, raised $103 million in the first half of the year--far more than any other candidate's allied super PAC--and has spent more than $30 million on TV ads. But despite spending considerably more than Mr. Bush's rivals, the super PAC has failed to move the needle for the former Florida governor. Mr. Bush is in sixth place among Republican primary voters, with 4.4% support, according to a Real Clear Politics average of recent national polls. In Iowa, which holds the first-in-the-nation caucus Feb. 1, Mr. Bush is in fifth place, with 4.8%, according to Real Clear Politics. Earlier this month, Right to Rise aired an ad campaign nationally and in four early states knocking Republican front-runner <mark>Donald Trump</mark> as\" impulsive and reckless \"and criticizing votes by Texas Sen. Ted Cruz that it said would\" dramatically weaken counter-terrorism surveillance. \"That ad also went after Mr. Rubio for skipping his Senate duties\" just to campaign. \"______________________________________________________ 2016 Election Calendar | WSJ/NBC Polls | 2016 Poll Standings Politics Alerts: Get email alerts on breaking news and big scoops. Capital Journal Daybreak Newsletter: Sign up to get the latest on politics, policy and defense delivered to your inbox every morning. For the latest Washington news, follow @ wsjpolitics For outside analysis, follow @ wsjthinktank Recommended post x 2015: Top 10 Most-Read Capital Journal Stories"}, {"articleID": "2018112020_00068179_W", "names": {"Chris Wallace": ["Q21256789", "Q2964884", "Q2964885", "Q37624906", "Q5108402", "Q5108404"]}, "date": "2018-11-20", "url": "https://www.adweek.com/tvnewser/chris-wallace-shares-his-thanksgiving-moderating-tips-in-a-funny-segment-for-the-late-show/385204", "content": "We have published a good deal of <mark>Chris Wallace</mark> - related content on this site recently, and here's a worthy addition. The Fox News anchor--who appeared on The Late Show with Stephen Colbert earlier this month--taped a segment released yesterday on YouTube titled, \"Thanksgiving Moderating Tips with <mark>Chris Wallace</mark>.\" In it, the 2016 presidential debate moderator shares his tips on how to properly moderate a Thanksgiving dinner. <mark>Wallace</mark> introduces himself by saying, \"You may know me from your parents' TV when you go home to do laundry,\" and then proceeds to deliver his tips without breaking. Nothing like a little mid-afternoon humor on a Tuesday! WATCH: Comments"}, {"articleID": "2009021222_00037782_W", "names": {"Simon Fraser": ["Q12058068", "Q19043594", "Q21457277", "Q4492612", "Q55834851", "Q7518792"]}, "date": "2009-02-12", "url": "http://thevarsity.ca/article/17912", "content": "this article was published on feb 12, 2009 in the news section. © 2009 the varsity. the <mark>simon fraser</mark> student society and the british columbia branch of the canadian federation of students have been battling it out before the supreme court of british columbia for the last two weeks to determine whether the sfss is still a part of the cfs-bc. sfss members voted to leave the cfs-bc last spring. the federation, however, has refused to recognize the referendum, insisting that the union owes them $430,000 in membership fees for the academic year. \"it should have been over by now,\" said sfss president joe paling. \"we had a vote last may and 69 per cent of students took part in that referendum. it should have been resolved that day, but [the cfs-bc] said that they wouldn't recognize the referendum results.\" \"cfs happily recognized the referendum while it was happening because they had 30 people or more, including some people from the university of toronto, flown over the country to campaign on the cfs side of the referendum,\" said paling. \"even though they said they weren't going to recognize the vote, they still actively campaigned hoping that they would get a result that was favourable to them.\" cfs claims that its own procedures were not properly followed in the referendum. the referendum oversight committee, consisting of two representatives each from the cfs-bc and the sfss, fell apart during the referendum. according to paling, the group was ill-prepared and \"basically broke down\" despite lengthy notice given by the sfss some six months in advance of the referendum date. paling is optimistic about the forthcoming proceedings. \"we feel that this can be a summary trial without a jury because we think it's fairly clear-cut. there's no reason for it to go to trial when the students overwhelmingly voted to leave.\" \"since the <mark>simon fraser</mark> student society filed suit against the cfs-bc the legal process initiated by the sfss has followed its normal course and it is my understanding that it has not been a lengthier process than a similar suit of this nature,\" cfs-bc chair shamus reid told the varsity. \"the cfs-bc continues to vigorously represent the interests of <mark>simon fraser</mark> students.\" the varsity reserves the right to remove any comment that: constitutes hate speech against an identifiable group directly and deliberately insults other posters is promotional or commercial in nature does not make a relevant contribution to the discussion hooking and hanging - modification artist russ foxx talks flesh and hooks event calendar for week of february 9"}, {"articleID": "2019070323_00240249_W", "names": {"Mark Norman": ["Q16733470", "Q6769046", "Q6769047"]}, "date": "2019-07-03", "url": "http://cumberlandnewsnow.com/opinion/columnists/editorial-the-liberals-have-problems-with-judicial-independence-329525/", "content": "EDITORIAL: The Liberals have problems with judicial independence Postmedia News, Postmedia News Updated: just now Sorry you must be at least 19 years of age to consume this content. Minister of Intergovernmental Affairs, Northern affairs and Internal Trade Dominic LeBlanc, is seen in a Dec. 7, 2018, file photo. It's not enough that politicians be clear of actual wrongdoing when it comes to misdeeds, such as corruption or improperly interfering with the justice system. They must be completely free of the perception that they have crossed these lines. This is a rule widely known, previously voiced even by Prime Minister Justin Trudeau himself. That's why we're left scratching our heads about a story concerning judicial appointments coming out of New Brunswick. As first reported by the CBC, five out of the last six judicial appointments in the province went to people close to federal Liberal cabinet minster and Trudeau friend Dominic LeBlanc. The individuals appointed include, according to the report, a \"neighbour, a LeBlanc family relation and three lawyers who helped retire debts from his unsuccessful 2008 leadership bid.\" The Liberal government has already released a statement saying all three appointments were merit-based. But Canadians will have a tough time stomaching that statement, regardless of its truth. That's because this isn't the first time the Liberals have shown they have a problem with judicial independence. A roll call of recent scandals related to the justice file is a troubling one. There's the Lavscam affair, which was never fully resolved. We wrote in past editorials in this space that the RCMP should be probing the question of whether or not individuals in the Prime Minister's Office broke obstruction of justice laws in persistently pressuring Jody Wilson-Raybould into offering a Deferred Prosecution Agreement to SNC-Lavalin even after the head of the prosecution service ruled it out. Trudeau began by describing the story as false until eventually parts of the real story got out and the PMO changed its tune to state that while Wilson-Raybould was pressured, it was all--in former top bureaucrat Michael Wernick's words--\"lawful advocacy.\" Then, there's the Vice-Admiral <mark>Mark Norman</mark> affair, where Canadians were left wondering why bureaucrats close to Trudeau even referred the case to the RCMP in the first place. Then, there's the reports that many judicial appointments were first screened through a database of Liberal donors. The Liberals clearly have problems with judicial independence. Skepticism around this latest story is highly warranted. Copyright Postmedia Network Inc., 2019 More Columnists stories"}, {"articleID": "2012033117_00042332_W", "names": {"Kevin Gray": ["Q1740154", "Q25189598", "Q6396390"]}, "date": "2012-03-31", "url": "http://au.sports.yahoo.com/news/article/-/13315404/fish-tanks-and-palm-trees-miamis-new-baseball-stadium/", "content": "fish tanks and palm trees - miami's new baseball stadium <mark>kevin gray</mark>, reuters april 1, 2012, 2:43 am miami, march 31 (reuters) - get ready, baseball fans. miami, the city of sun and fun, wants to bring some flair to america's favorite pastime. when baseball's opening day kicks off next week, the miami marlins will inaugurate a new $515 million ballpark built with all the trappings of south florida--two enormous fish tanks, palm trees and a kitschy (of course) home run celebration display. the stadium, named marlins park, \"screams miami,\" team owner jeffrey loria has said. the white semi-domed stadium is an attempt by loria and city officials to reignite fan interest in a team that won the world series in 1997, and again in 2003, but finished at the bottom of the national league east division standings last year. they also hope it will help revitalize miami's little havana neighborhood, a rough-and-tumble district near downtown and a cultural symbol for many in miami's large cuban community. the stadium's official opening on wednesday will mark a new chapter for the marlins, who have changed their name, redesigned their uniforms and embarked on a spending spree for a high-profile manager and free-agent players to breathe new life into the team. to win over fans, the marlins are offering up a baseball experience with a dash of latin and south beach style. the stadium's signature feature will be its backdrop at home plate. two 450-gallon salt water aquariums sit on either side and will be stocked with 100 tropical fish. \"when you think of miami, you think of water, right?\" said claude delorme, a marlins executive vice president. \"we wanted a unique piece that identifies where we are.\" the fish tanks are built of durable fiberglass and protected by a material used in bullet-proof glass. to ensure they would withstand impacts from baseballs, team officials brought in a marlins player to hurl balls to test out the glass. the tanks will be lit with blue lights during games to make sure players do not lose sight of the balls. \"home run sculpture' behind the outfield is a home run celebration display few will confuse with being anywhere but south florida. team officials call it a\" home run sculpture. \"designed by american pop artist red grooms, the 72-foot yellow, blue and neon pink structure features seagulls, flamingos, and a pointy-billed teal marlin that will leap every time a home run is hit. it is set next to - what else - palm trees. the home run celebration will also include a 34-second splash effect and laser show.\" some people have been critical of it, \"delorme joked.\" but it adds to the experience of coming out to the ballpark. \"no new ballpark in miami would be complete without a swimming pool. marlins park will be the second major u.s. baseball stadium after chase field in phoenix, arizona, to feature a swimming pool for fans looking to enjoy the game from a different vantage point.\" we wanted to have this party area in left field, \"delorme said.\" so people would see it on tv and say, you know what, i want to go there. \"about four feet deep, the pool is part of an area that was conceived with the clevelander, a well-known south beach party-goers hotel. the pool side area includes a bar and djs.\" there will be home run balls landing in the pool, so people will have to be alert, \"delorme said. built on the old site of miami's orange bowl, the stadium offers an intimate setting that will hold a mere 37,442 spectators - the smallest capacity in baseball. it also has a host of other amenities that fans complained were missing from the marlins' previous home, sun life stadium, in suburban north miami, where the miami dolphins also play. the stadium's roof is retractable - key when miami's rainy season sets in. air conditioning in the stadium will maintain an average temperature of 75 degrees to keep fans comfortable during florida's muggy summer months. the stadium, however, has not been without controversy. when plans for its construction were first announced, it drew howls from some miami residents who complained taxpayers were picking up the tab for three-fourths of the stadium's costs. it was financed using municipal bonds. the stadium's financing is now the focus of a probe by the securities and exchange commission. still, it has generated buzz in miami and team officials say they hope it proves to be a draw not only for baseball fans.\" you could bring someone here who does not like baseball and they could have a really good time, \"delorme said.\" and they'll want to come back. \"(editing by greg mccune and philip barbara)"}, {"articleID": "2018040320_00251247_W", "names": {"Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}, "date": "2018-04-03", "url": "https://www.cnbc.com/2018/04/03/reuters-america-update-2-elliott-takes-1-bln-stake-pushes-for-changes-at-hyundai.html", "content": "* Reveals stakes in Hyundai Mobis, Hyundai Motor, Kia Motors * Calls for clearer plan to improve corporate governance * U.S. hedge fund previously took on S. Korea's top chaebol Samsung (Add background on Elliott, past campaigns, Samsung) SEOUL/NEW YORK, April 4 (Reuters) - A unit of activist hedge fund Elliott Management said on Wednesday that it holds more than $1 billion of shares in three key affiliates of South Korea's Hyundai Motor Group, and said more needs to be done to reform the company. In its latest challenge to South Korea's family-run conglomerates, Elliott Advisors called for \"a more detailed roadmap as to how it will improve corporate governance, optimize balance sheets, and enhance capital returns at each of the companies\" including Hyundai Mobis, Hyundai Motor and Kia Motors. South Koreas auto-to-steel giant Hyundai Motor Group announced a plan last week to streamline its complex ownership structure as it responds to calls from the government and investors to reform the countrys powerful family-controlled conglomerates or chaebols. The plan will be put to shareholders for approval on May 29, but worries that a proposed restructuring plan would benefit the parent groups controlling family ahead of companys shareholders hit shares. While Elliott said it was pleased that Hyundai Motor Group has taken a first step toward improving its corporate structure, it said in a statement that \"more needs to be done to benefit the companies and stakeholders.\" Under Hyundai's plan, parts supplier Hyundai Mobis is to spin off its domestic module and after-service parts businesses and merge them with logistics affiliate Hyundai Glovis backed by Hyundai's family members. But some investors and analysts said Mobis could be giving away cheaply what is seen as the more profitable part of its business. After the merger, parent Hyundai Motor Groups Chairman Chung Mong-koo and his son Chung Eui-sun, who is vice chairman, will buy stakes in Mobis held by other affiliates Kia Motors, Glovis and Hyundai Steel. \"Elliott looks forward to engaging with management and other stakeholders directly on these issues, and to offering recommendations regarding the proposed plan,\" it said. A Hyundai Motor spokesman in Seoul was not immediately available for comment outside business hours. Last year, South Koreas new antitrust chief told Reuters that he has been in talks with Hyundai Motor Group about unwinding its circular shareholdings, which critics say gives too much power to its controlling family at the expense of shareholders. His commission welcomed Hyundai's latest decision. Elliott's call adds to challenges for Hyundai, which is struggling from slowing sales in China and the United States, due to its delayed response to the sport utility vehicle segment, and Seouls diplomatic row with Beijing last year. BATTLE WITH CHAEBOLS Paul Singers $33 billion firm Elliott Management has taken on Samsung Group, South Korea's biggest family-run conglomerate, as well as the Li family, which founded Hong Kongs third-largest lender Bank of East Asia. In 2015, Elliott narrowly lost its battle to block a merger of two Samsung Group affiliates that would allow the controlling Samsung family to consolidate their holdings ahead of a leadership transition. Like Samsung, Hyundai has a large foreign investors base. In 2016, Elliott called on Samsung Electronics to introduce a transparent holding company structure and pay a 30 trillion won special dividend, among other demands. In 2017, Samsung rejected the call for a holding company, but announced plans to cancel its existing treasury shares worth over $35 billion by 2018. Founded by Singer in 1977, Elliott is renowned for winning cases against Peru and Argentina for repayment of debts they took on at a deep discount during their financial crises. While U.S. hedge funds used to rarely target Asia-based companies for activist campaigns, it is now becoming more popular. San Francisco-based activist hedge fund ValueAct Capital said late last month it was considering making its first investment in Japan. (Reporting by Hyunjoo Jin in Seoul and Liana B. Baker in New York; Editing by Adrian Croft and <mark>Tom Brown</mark>)"}, {"articleID": "2014020718_00035448_W", "names": {"John Coates": ["Q16135744", "Q19664760", "Q4250255", "Q6226433", "Q6226435", "Q6226437", "Q6226439", "Q671993"]}, "date": "2014-02-07", "url": "http://news.brisbanetimes.com.au/breaking-news-sport/coates-lauds-winter-sports-in-australia-20140207-327ma.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Australian snow sports are a shining example to their summer counterparts, according to AOC boss <mark>John Coates</mark>, but that doesn't necessarily mean there's going to be any extra funds coming to winter athletes any time soon. \"It continues to be a matter of spending what is allocated, wisely,\" <mark>Coates</mark> said ahead of the start of the Winter Olympics in Sochi. \"The Australian Olympic Committee has a limited budget.\" We put a million a year into the Winter Institute, the sports commission and the other institutes put another one-and-a-half million in - any increase would be good but there are other priorities in sport - participation sport and whatever. \"He said winter sports in Australia got good value for money because they centralise their programs.\" It is certainly well done. It's probably a lesson to some of the smaller sports and the summer sports too, \"he said. A strong performance at these Games - four medals or more - would undoubtedly be a handy bargaining chip to obtain more money for Australian winter sports but even that may not be enough to please everyone. A number of snowboarders have complained about what they perceive as funding discrepancies in the team, Scotty James particularly vocal while he and others including Torah Bright, Belle Brockhoff and Jarryd Hughes frequently sign off with #teamoutcast on their social media accounts to signify their various frustrations. But <mark>Coates</mark> said while it would be great to offer more support to athletes outside official programs, the reality was limited money meant tough decisions had to be made.\" Some (athletes) manage to do it on their own; some make a lot of money, \"<mark>Coates</mark> said.\" I think it is whether the (Olympic Winter) Institute has got the money to say \"here's X dollars, go off and spend it as you like'.\" It is probably fraught with danger, so they do try to control the programs and ensure the sports science medicine and backup is there in a co-ordinated way - and maybe that model doesn't suit everyone but it works for us. \"Meanwhile <mark>Coates</mark>, also the IOC vice-president, said he was pleased with how the Games were shaping up despite some complaints from athletes and media.\" We've had good reports from our staff and from the organising committee. We've experienced moving around the city, the security looks good, it's not difficult and I get a very positive impression, \"<mark>Coates</mark> said. There have been quirks - from unfinished buildings, to dirty water coming out of taps, the culling of dogs and then the more pressing humans rights, security and spending concerns. But <mark>Coates</mark> was steadfast these Games would be good."}, {"articleID": "2019052216_00407608_W", "names": {"Gerry Kelly": ["Q15463074", "Q5552825"]}, "date": "2019-05-22", "url": "http://www.penarthtimes.co.uk/news/national/17657744.finucane-defies-loyalist-threat-as-he-starts-work-as-belfast-mayor/", "content": "Finucane defies loyalist threat as he starts work as Belfast mayor By Press Association 2019 Lord Mayor of Belfast John Finucane meets the Prince of Wales 0 comment John Finucane has vowed not to be deterred by a loyalist threat, as he met the Prince of Wales on his first day as Belfast's new mayor. The Sinn Fein councillor, whose solicitor father Pat was murdered by paramilitaries 30 years ago, said police have warned him that loyalists were planning to attack his family home. He said officers came to his house to inform of the threat on Tuesday night, just hours after he was formally elected mayor at City Hall. Mr Finucane, a 39-year-old father of four, proceeded with his first day in post as planned, welcoming Charles to the city on Wednesday morning. \"Last night the PSNI came to my home to tell me of a threat by loyalists to attack me in my family home,\" he said. Belfast solicitor Pat Finucane (PA) \"I am committed to serving and representing all the people of this city and I will not be deterred from that by threats from anyone.\" This is not just a threat against me but it is also a threat against democracy. \"Sinn Fein MLA <mark>Gerry Kelly</mark> said:\" This reprehensible threat against John Finucane has to be condemned. \"The reference to his family home was clearly deliberate, given this is where his father was murdered by loyalists.\" It is a cowardly attempt to intimidate the newly-elected first citizen of Belfast. \"0 comment"}, {"articleID": "2012072609_00038025_W", "names": {"Kamal Nath": ["Q1287413", "Q57327046"]}, "date": "2012-07-26", "url": "http://business-standard.com/india/news/egom-to-meet-next-week-to-review-monsoon-situation/180287/on", "content": "egom to meet next week to review monsoon situation monsoon rains deficient by 22% so far across india, situation is worrisome in karnataka, maharashtra, rajasthan & gujarat press trust of india / new delhi jul 26, 2012, 14:26 ist an empowered group of ministers (egom) on drought will meet on tuesday to review the monsoon situation, as 22% deficit rains so far have affected sowing of kharif crops, particularly coarse cereals. the egom is authorised to review the situation and take \"quick and timely decisions\" on policy and other matters for effective management of drought. pawar, who joined office today after issues related to a week-long stand-off between the congress and his party ncp were sorted out, said the ministry is collecting details from states on the impact of poor rains. earlier in the day, pawar held discussions with food minister k v thomas and indian meteorological department (imd) director general l s rathore to review the monsoon situation. the egom was earlier headed by pranab mukherjee, the then finance minister. home minister p chidambaram, power minister sushilkumar shinde, petroleum minister s jaipal reddy, urban development minister <mark>kamal nath</mark>, water resources minister pawan kumar bansal are members of the egom. other members include rural development minister jairam ramesh, railway minister mukul roy, planning commission deputy chairman montek singh ahluwalia, food minister k v thomas and minister of state for finance namo narain meena. \"we discussed the monsoon situation and also about futures trading in agri commodities,\" food minister k v thomas said after meeting pawar. meanwhile, imd said it expects monsoon deficiency to narrow down in the coming days with improvement in rains. monsoon rains have been deficient by 22% so far this year across the country and the situation is worrisome in karnataka, maharashtra, rajasthan and gujarat. test drive and win a spark contest. click here just another way ge works to help doctors cure india. how can a bank be here for good? click here buy, sell or lease, residential or commercial property. click here find out more about the banking services available in your country. click here luxury apartments with breathtaking views. click here to know more get a world view every week. click here. trustworthy innovative solutions to realize potential. click here get smarter with teamcenter 9. smarter decisions, better products. power launched 166 ps. most powerful in its class. click here become a part of a global network of business leader. click here witness the emergence of future business leaders. click here our designation doesn t just help the careers, it build respect. which is the best plan for your daughter for improved productivity & better storage efficiency. click here now buy a new broadband online & get rs 500 cashback. a global market leader in the logistics industry. click here. stock investing - the safest way. click here ashwani srivastava: it' s = \"s\" time = \"time\" for = \"for\" a = \"a\" pat = \"pat\" on = \"on\" the = \"the\" bottom = \"bottom\" class = \"textmost'>"}, {"articleID": "2019081506_00180233_W", "names": {"Gerry Armstrong": ["Q2712483", "Q5552639"]}, "date": "2019-08-15", "url": "https://www.firstpost.com/sports/watch-nick-kyrgios-smashes-racquets-abuses-umpire-in-second-round-defeat-against-karen-khachanov-at-cincinnati-masters-7167961.html", "content": "Watch: Nick Kyrgios smashes racquets, abuses umpire in second-round defeat against Karen Khachanov at Cincinnati Masters Sports Agence France-Presse Aug 15, 2019 11:43:31 IST Cincinnati: Nick Kyrgios stepped off court to smash two racquets and toss his shoes to spectators on Wednesday in a meltdown during a second-round ATP Cincinnati Masters loss to Russia's Karen Khachanov. Eighth-seeded Khachanov rallied for a 6-7 (3/7), 7-6 (7/4) 6-2 victory over the volatile Australian, but the final set was close to farce, with Kyrgios engaged in a running dialogue with Irish chair umpire Fergus Murphy. \"He has a really great talent but sometimes the head not in the right place,\" Khachanov said. \"It was a really difficult match for me--I had to really work it out, how to get the win.\" It's really tough (playing Kyrgios), not only for me but for everybody. You have to try and handle it, then you can have chances to win the match. Always try to stay in there. \"BANG, BANG!!???? Nick Kyrgios absolutely DESTROYED two racquets and the commentators lost it???? Watch the Cincinnati Masters live on ESPN. pic.twitter.com/q2d2dTeND3--ESPN Australia & NZ (@ ESPNAusNZ) August 15, 2019 Kyrgios, who won his sixth career ATP singles crown two weeks ago in Washington, also complained last week in Toronto in an apparent dispute as to why he could not have a white towel during a match. World number 27 Kyrgios, rarely far from controversy, was defaulted three months ago after throwing a chair as he quit a match in Rome. The latest iteration of the Kyrgios saga erupted after he lost the second set to Khachanov. Sitting in his chair at the pause, Kyrgios suddenly announced he was going on a bathroom break, with Murphy telling him there was no time. The Aussie walked anyway, carrying two racquets with him. Television showed him going through a stadium door partly made of glass and smashing his racquets before collecting them and walking back onto court. All the while, he was nagging and occasionally cursing at Murphy. Kyrgios calmly held his own at the start of the final set, producing a hold which featured three aces. But it was the ice-calm Khachanov who took advantage, breaking for 4-2 and running out to a 5-2 margin. Kyrgios, by now hardly in the match, double-faulted to hand over two match points and served up another double after saving a first match point. He refused to shake Murphy's hand on the way off court and tossed his shoes and other soft articles into the crowd and handing his broken racquets to young fans before walking off. At one point in the drama, Kyrgios stood at the back of the court, wrapping his racquet grip, which Murphy kept telling him he was not ready. Kyrgios told Khachanov to go ahead and serve, but the Russian declined until all was in place on the Kyrgios side of the net. Tournament supervisor <mark>Gerry Armstrong</mark> sat near the court, observing, but was not called upon to make any ruling during the bizarre closing stages of the evening. Khachanov will play Frenchman Lucas Pouille in Thursday's third round. Updated Date: Aug 15, 2019 11:43:31 IST"}]