[{"date": "2011-05-16", "url": "http://sohh.com/2011/05/rihanna_receives_backlash_for_following.html?utm_source=google&utm_medium=feed&utm_campaign=general-feed", "content": "rihanna receives backlash for following <mark>chris brown</mark>, \"it's f * cking twitter, not the alter!\" tags for this article: <mark>chris brown</mark>, rihanna beastie boys are hot at no. 2, <mark>jennifer lopez</mark> finds love in top 5, sade & musiq invade the chart \"i think he needs to talk about the situation in itself, what actually happened to rihanna\" <mark>chris brown</mark>'s mom on leaked nude pic, \"he said,' i pretty much know who did it'\" [video] rihanna raised a few eyebrows over the weekend after following ex-boyfriend <mark>chris brown</mark> on twitter and lashed back at criticism from her fans. responding to a fan asking if her following <mark>brown</mark> was a sign the two would romantically reunite, riri turned down the speculation. \"@ istan4rihanna_ its f * ckin twitter, not the alter! calm down,\" she tweeted may 14th. \"@ istan4rihanna_ babygirl i'm sorry, i didn't mean to hurt or offend u! just needed to make it clear to the navy! i still stan for u xoxo\" (exes <mark>chris brown</mark> and rihanna are following each other on twitter--and the fans aren't very happy about it. on saturday, people began to notice that <mark>brown</mark>--who beat his then-girlfriend rihanna on the night of the grammy awards in 2009--started following rihanna on the social media website. in turn, she followed him as well. (billboard) earlier this year, riri talked about \"we don't have to talk ever again in my life,\" rihanna explains. \"i just didn't want to make it more difficult for him professionally. what he did was a personal thing--it had nothing to do with his career. saying he has to be 100 feet away from me, he can't perform at awards shows--that definitely made it difficult for him...but you can never please people. one minute, i'm being too hard, and the next minute, i'm a fool because i'm not being hard enough .\" (<mark>brown</mark> made headlines for causing mayhem following a \"good morning america\" interview where he was asked questions about rihanna. <mark>chris brown</mark> exploded in rage behind the scenes at \"good morning america\" this morning...smashing a window and storming out without a shirt...sources tell tmz...and it was triggered by on-air questions about the rihanna incident. abc sources tell tmz...<mark>brown</mark> performed and was interviewed by <mark>robin roberts</mark> live from the times square studio when she began asking about the infamous incident. <mark>brown</mark> tried to redirect the questions to focus on his album--but <mark>roberts</mark> continued to ask about <mark>brown</mark>'s legalissues stemming from the rihanna incident. (tmz) last february, <mark>chris brown</mark> had his restraining order downgraded but is forbidden from annoying, harassing and stalking ex-girlfriend rihanna. nicki minaj won't be missing diddy, rapper reportedly \"disappointed\" w / management comments you must now sign-in to comment using your existing typepad, facebook, myspace, wordpress, aim, blogger or open id accounts. if you have any problems please rihanna receives backlash for following <mark>chris brown</mark>, \"it's f * cking twitter, not the alter!\" rihanna raised a few eyebrows over the weekend after following ex-boyfriend <mark>chris brown</mark> on twitter and lashed back at criticism from her fans. nicki minaj won't be missing diddy, rapper reportedly \"disappointed\" w / management rihanna receives backlash for following <mark>chris brown</mark>, \"it's f * cking twitter, not the alter!\" young <mark>chris</mark> calls out jay-z & kanye west, \"they're cheating right now\" jadakiss can't crack the lox, \"we're going to chop some of these f * cking hands off\" young jeezy, polow da don & more unpaid debts exposed, \"it's insane\" kanye west busted lip locking mystery blonde hottie, \"they are dating\" drake raises eyebrows w / \"throne' reference,\" did [he] send a subliminal shot at hov & ye? \"ludacris disturbs tha wedding bells,\" i've learned so much about myself this past 2 years through rumors \"jay-z & kanye west change clothes & hotels,\" no beyonce & no booze \"young money's shanell holds her own,\" [lil] wayne's reason for choosing each of us is that...\"tyler the creator clears up\" f * ck the police' rant, \"[they] had us in cuffs for no reason\" ", "articleID": "2011051622_00045291_W", "names": {"Robin Roberts": ["Q1185477", "Q2041541"]}}, {"date": "2011-05-18", "url": "http://chroniclelive.co.uk/north-east-news/uk-and-world-news/2011/05/18/no-blinking-on-deficit-says-clegg-84229-28721396/", "content": "there must be \"no blinking\" on the government's programme of deficit reduction, deputy prime minister nick clegg has said, insisting the shared agenda of cutting debt is the \"glue which binds this coalition together\". the liberal democrat leader, who has faced grassroots discontent over the scale of spending cuts in the wake of his party's poor showing in this month's elections, insisted the government must \"hold our nerve\" and press ahead with its plans to restore economic stability. but he risked ruffling feathers among his conservative coalition partners by appearing to trace the origins of the 2008 financial crisis to margaret thatcher's administration of the 1980s. calling for a \"new, liberal economy\" with a focus on investment and stability rather than speculation and debt, mr clegg said that it is time to \"turn the page on...an era that began with a big bang and ended with a monumental crash\". the big bang was the popular name for lady thatcher's 1986 deregulation of the markets, which opened the way for massive growth in the city of london's financial sector. speaking to the cbi in london, mr clegg called for a move away from the short-termist debt-driven economy of recent decades and towards a \"less spectacular\" but \"more prosperous and more profitable\" future. he said: \"the economy is out of the danger zone. but we need to hold our nerve. that means no blinking on deficit reduction. the government has a plan to restore stability and we will stick to it .\" liberal democrats and conservatives \"may differ on the nature and shape of the state, but we agree its finances must be sound,\" mr clegg said. \"tackling deficit is a necessary response to an immediate emergency. it is the glue that binds this coalition together .\" cbi president <mark>helen alexander</mark> told the dinner that the government's intentions had been \"good\" but it was \"taking too long to get there\". chroniclelive, the evening chronicle newspaper online. latest newcastle news, north east and national news. newcastle united, sunderland afc updates, videos, pics, forums. for our complaints procedure,", "articleID": "2011051821_00021158_W", "names": {"Helen Alexander": ["Q20090888", "Q43393812"]}}, {"date": "2011-05-19", "url": "http://cctimesdemocrat.com/story/1729139.html", "content": "piggott is gearing up for the 13th annual heritage park car show and cruise, to be held friday through sunday, may 20-22, at heritage park. organizers of the event have announced that active duty members of the military and their spouses will not be charged admission to this year's event. the portion of the show that is open to the public, from 9 a.m. to 3 p.m. saturday, may 21, falls on armed forces day, prompting the offer. \"we can't do enough to show our appreciation to the members of our armed forces,\" piggott area chamber of commerce secretary lynette cale said. \"our board met last week and voted to allow all active members of the military free admission. the offer applies to general admission at the gate for them and their spouse and includes members of all branches of the military and national guard .\" active duty personnel need only show a current id card at the gate to gain entry to the show. this marks the third year the chamber of commerce has sponsored the annual car show and cruise, which regularly draws several hundred entries and thousands of spectators. the show will be open to the public saturday, may 21, but there are many other activities for the participants. \"many traditions developed over the years that the supercruise group ran the show and we love to see them continue,\" added show chair and chamber president tim blair. \"the participants begin to arrive early in the week and a small community begins to grow in the rv area of the park. during the week we have a lot going on, including a visit to both murphy health and rehab and magnolia manor. it's been going on for a number of years and i've heard the residents, and the car show folks, really get a kick out of visiting and looking over the old cars and trucks .\" friday evening all the registered participants, and the crew of volunteers, will enjoy a barbecue chicken dinner at the park. \"we've got such great corporate sponsors and for the second year kennett national bank is sponsoring a barbecued chicken wing dinner along with the emmanuel baptist church of piggott,\" blair said. \"the dinner proved to be a favorite among the 2010 entries and offered a great opportunity for the entries to enjoy fellowship and a great meal .\" \"we've got a lot going on in piggott on car show day, including the lions club breakfast being served from 6:30 to 10 a.m. that morning at the community center,\" cale added. \"the hemingway pfeiffer museum will be holding their annual quilt show, plus the matilda and karl pfeiffer museum will be open regular hours. the shuttle bus will be running throughout the day and we encourage everyone to take advantage of the convenience to visit the sites .\" subtle changes from last year's show include the return of trophies for the winners, a revival of the various games played by participants and the change in judging to a class system based on age of the vehicle. otherwise, organizers hope to emulate the 12 shows that came before--and made the event the success it is today. \"hopefully, those who have been coming to the show for years will see very little difference from past events,\" blair noted. \"we have listened, though, and hope the changes are for the positive. one new addition this year will be more food vendors, which should afford a bit more variety for those in attendance .\" \"we've got more vendors this year, and expect a few late additions,\" cale added. \"tom rainbow, the montana pinstriper, is coming back this year along with a lot of longtime favorites like al and janet blume of ozark early ford and street rod parts--we're looking forward to a good variety of vendors .\" another new addition this year is turtle races for the kids. the races will be held beginning at 10 a.m. with trophies for the various winners. the turtle races are open to entrants in the sixth grade and younger and will be held near the main pavilion at heritage park. \"mayor gerald morris received a letter suggesting the races, so we thought we'd give them a try,\" blair said. \"we're still working out all the details, but expect a good turnout .\" saturday afternoon paid entrants to the show will be treated to another tradition, as they chow down on a delicious barbecued pork steak dinner. later saturday afternoon, the participants will line-up for the annual cruise to the square, parading along main street to the airport before returning to the court square. once all the cruisers are parked around the square the major awards will be handed out for this year's event, followed by an evening of rock--n-roll featuring kenny and the flashbacks. \"we'll also have our 50's dress and dance contest,\" cale added. \"it's always so much fun to see the little girls in their poodle skirts .\" as has become tradition, the aerial bouquets relay for life team will be selling hot dogs, hamburgers and soft drinks on the square before, during and after the cruise. local pastor and chamber board member bro. <mark>kevin murray</mark> will bring offer a non-denominational church service beginning at 9 a.m. sunday, may 22, at the park, followed by the closing ceremonies. \"we'll be giving out the award for the club that brought the most participants, and drawing for the 50/50 winner that morning,\" blair added. \"we've also got a few special awards and recognitions to hand out before we officially close the show for this year. it's also a great chance to visit with some of the folks that you only see a couple of times a year .\" early registration and check-in will be conducted at the chamber of commerce office in the depot through thursday, may 19. check-in and registration will continue friday, may 20, at heritage park and will be going on throughout the day of the show. judging will be from 11 a.m. to 1 p.m. registration is $35, with a discount offered for multiple entries. admission is $3 per person for everyone age 16 and older the day of the show for entry to the park. those wanting more information may call 870 598-3167.", "articleID": "2011051919_00034274_W", "names": {"Kevin Murray": ["Q57327222", "Q6397056", "Q6397058", "Q6397059", "Q6397060", "Q6397061", "Q6397062"]}}, {"date": "2011-05-21", "url": "http://statesman.com/news/texas/ucla-bruins-lua-lead-ncaa-womens-golf-1488449.html?cxtype=rss_texas", "content": "Names:", "articleID": "2011052101_00080303_W", "names": {"Jesse James": ["Q18719497", "Q20985425", "Q21062632", "Q530550", "Q954359"], "Ucla 'S Tiffany Lua Had A Hole-In-One And Topped The Individual Leaderboard With Four Holes Left And The Bruins Had A Six-Stroke Lead Friday When Third-Round Play In The Ncaa Division I Women 'S Golf Championship Was Suspended Because Of Darkness . Lua , Who Entered The Round Tied For Third , Aced The Par-3 11Th Hole . She Was 3 Under For The Day And 5 Under Overall On The Tradition Club Course . Georgia 'S Marta Silva Zamora Was Tied For Second At 2 Under With Lsu 'S Austin Ernst . Silva Zamora Had A 72 , And Ernst Was 4 Over For The Round With Four Holes Left . \" I Got Off To A Rough Start , But After That I Tried To Make Some Good Solid Swings And Keep A Good Tempo , \" Lua Said . \" I Wanted To Make Some Solid Strokes In Putting . I Was Excited To Make The Ace And Follow That With A Birdie . I 'M Definitely Looking Forward To Tomorrow . \" Ucla Had Four Holes Left . Defending Champion Purdue Was Second , Also With Four Holes Left . \" We 'Re Going To Take It Easy , \" Ucla Coach Carrie Forsyth Said . \" We Have To Take It Easy . We Are Going To Think Positive And Try To Make Good Decisions Because We Made Some Bad Ones Today . We Need To Have Confidence , And I Think We Will Play Just Fine . \" The Round Was Delayed 1 Hour , 50 Minutes Because Of Lightning . Ucla Was On The Seventh Hole When Play Was Delayed . Forsyth Said She Was Surprised How Much The Delay Affected Her Team , Which Shot A 5 Under Through The First Seven And Was 6 Over On The Next Three . \" Sometimes The Break Helps You , And Sometimes They Help You , \" Forsyth Said . \" We Had Some Girls Who Had Momentum Going , And You Feel Like You 'Re Doing Well , And Then You Come In And Sit . \" Coastal Carolina 'S Courtney Boe Also Had A Hole-In-One On The 11Th Hole , And Virginia 'S Brittany Altomare Aced The 16Th . Georgetown Police Try To Piece Together Restaurant Owner 'S Injuries Swat Officer Fired , Six Others Disciplined In Aftermath Of Party <Mark>Jesse James</Mark> ": []}}, {"date": "2011-05-23", "url": "http://novinite.com/view_news.php?id=128527", "content": "the nationalists' rally at a sofia mosque last friday quickly escalated to a serious clash. photo by the ethnic turkish party, movement for rights and freedom, dps, is going to inform all european institutions about the actions of the far-right, nationalist ataka party. the announcement was made by the dps parliamentary group deputy chair, yunal lyutvi, who spoke for the bulgarian national radio, bnr, saying the information is to reach the council of europe, the human rights agency at the european commission and the european parliament. last friday ataka staged a rally in front of the sofia's banya bashi mosque, protesting the fact it has loudspeakers that sound muslim prayers in the entire area around. the rally escalated to a fight with injured and detained people. ataka leader, <mark>volen siderov</mark>, claims those at the mosque are islamic extremists and terrorists. \"<mark>siderov</mark> is detrimental for bulgaria,\" lyutvi declared, adding the bulgaria might ban nationalist party \"ataka' for stirring hatred bulgarian pm on xenophobic outburst: don't worry, that's just campaigning! how significant do you take to be the incident in which activists of the nationalist and far-right right party ataka assaulted praying muslims in the banya bashi mosque in downtown sofia? the incident is a very grave foreboding of the overall situation religious and ethnic violence that can occur in bulgaria unless it is taken seriously by the state and society. one should not read too much into this incident because the attack was staged by several dozen far-right activists who are not representative of the bulgarian society. nobel prize winner <mark>orhan pamuk</mark> with highest bulgarian award why is bulgarian nationalist <mark>siderov</mark> not shouting? a: i am watching bulgarian nationalist leader <mark>volen siderov</mark> on tv right now, but i cannot hear him violently ranting against turks. something must be wrong! all rights reserved? novinite ltd., 2001-2011.", "articleID": "2011052309_00051349_W", "names": {"Orhan Pamuk": ["Q241248", "Q53091976"], "Volen Siderov": ["Q12960523", "Q351040"]}}, {"date": "2011-05-22", "url": "http://wonderwall.msn.com/tv/ashton-kutcher-only-contracted-to-do-25-men-for-10-year-1620085.story", "content": "ashton kutcher's contract to star in \"two and a half men\" is surprisingly only for a single year. that's what sources with inside knowledge of the deal told the wall street journal. warner bros. television also has only a one-year deal with cbs to continue producing the show. despite its status as the most popular sitcom on tv, \"two and a half men'\" s recent troubles with former star charlie sheen seem to have everyone a bit on edge on how the audience will respond to a revamped series and kutcher. it also gives kutcher, who is reportedly being paid $20 million for the season, the right to walk away after a year even if the show is renewed and warner bros. wants to keep him. if all goes well, expect to see the show which also stars jon cryer and angus t. jones, to remain on cbs through 2013. done deal! ashton kutcher in, charlie sheen out on \"two and a half men' exclusive video: charlie sheen takes radar for tour of his\" sober bar' britney spears, rihanna and more stars at the billboard music awards in las vegas. jessica simpson and her fiance step out in new york, fergie catches a flight and more celebs out and about. russell brand was deported from japan on saturday. read story \"lost\" star evangeline lily welcomes a son. read story? kim kardashian, demi lovato and more celebs tweet about the rapture. dr. drew asserts that jeff conaway's coma stems from pneumonia and sepsis, not an od. michael buble and his wife celebrate their love with a third wedding in vancouver. get the scoop on sara rue's weekend wedding...read story costs are piling up for nick lachey and vanessa minnillo's upcoming wedding. kelly ripa talks party planning and analyzes the authenticity of \"the real housewives of new jersey .\" we dish out advice for teresa giudice and more \"housewives\" stars. jen's decade of hotness and more on may 20's 7 wonders hosted by brian mcfayden. ginnifer goodwin splits with her fiance. read story? mila jovovich, brangelina and more a-listers grace the cannes film festival. pink takes on selena over a horse of a different color; plus, katy vs. carnations and lots more gossip! jeff conaway remains comatose in an encino hospital after a possible drug overdose. kim kardashian collaborates with opi on a nail polish line, plus more star shilling. <mark>sofia vergara</mark> parties in new york, plus more of your favorite celebs this week in photos. rosario dawson splits from her french dj boyfriend. read story check out the best of pippa middleton's fashion choices over the years!", "articleID": "2011052319_00065238_W", "names": {"Sofia Vergara": ["Q231911", "Q28111741"]}}, {"date": "2011-05-23", "url": "http://reuters.com/article/2011/05/23/us-volkswagen-idUSTRE74M60620110523?feedType=RSS&feedName=businessNews&rpc=23&sp=true", "content": "new york/detroit (reuters) - volkswagen ag (vowg_p. de) may look to significantly expand its dealership base in the next three to four years, the chief executive of its america unit said in new york on monday. \"i think in the 2014, 2015 window would be when there might be a significant expansion,\" volkswagen group of america ceo <mark>jonathan browning</mark> said, speaking on the sidelines of a media luncheon in new york. \"the first phase of our growth can essentially be handled within the existing footprint of the network,\" he said. \"as we go through the medium to longer term, then we would have to see an expansion of our network .\" volkswagen currently has about 600 dealers in the united states. it has set aggressive sales goals for the u.s. market, where by 2018 it wants to sell 1 million vehicles. of those, 800,000 would be branded volkswagen and 200,000 audi. by way of comparison, the company sold about 360,000 vehicles in the united states in 2010. as part of its u.s. push, volkswagen will officially open a new $1 billion manufacturing plant in chattanooga, tennessee, on tuesday. the plant makes the 2012 passat sedan, which debuts in the u.s. market later this year. passat production at the plant is scheduled to rise to 150,000 annually by 2012. volkswagen once had a production plant in pennsylvania, but by 1988 sales had slowed and the plant was closed. volkswagen has gained on global sales leaders toyota motor corp (gm.n) in the past several years, and last year it sold more than 7 million vehicles worldwide for the first time. while its sales are improving in the united states, it still is a relatively small player, with a market share near 3 percent, including its luxury brand audi. volkswagen's best-performing year in the united states was 1970, when it sold 569,696 vehicles and had a nearly 6 percent share of the u.s. market. we welcome comments that advance the story directly or with relevant tangential information. we try to block comments that use offensive language, all capital letters or appear to be spam, and we review comments frequently to ensure they meet our standards. if you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. views expressed in the comments do not represent those of reuters. thomson reuters is the world's largest international multimedia news agency, providing investing news, world news, business news, technology news, headline news, small business news, news alerts, personal finance, stock market, and mutual funds information available on reuters.com, video, mobile, and interactive television platforms. thomson reuters journalists are subject to an editorial handbook which requires fair presentation and disclosure of relevant interests.", "articleID": "2011052320_00066190_W", "names": {"Jonathan Browning": ["Q20684268", "Q6272663"]}}, {"date": "2011-05-26", "url": "http://nola.com/opinions/index.ssf/2011/05/progress_in_standarized_tests.html", "content": "public school students in most of the metro area continue to make strides on standardized tests, according to scores released this week, with the recovery school district schools in new orleans posting the largest gains. rusty costanza, the times-picayune archive students at william fischer charter school in algiers participate in a leap test rally in april. that's strong evidence that the transformation of the city's public schools after hurricane katrina continues to yield results. education officials at the state and local level need to continue pushing in that direction and fend off efforts to erode reforms. students across most of our area showed progress, although large discrepancies exist between districts. the top average performance came from students in the 16 schools that remain under the orleans parish school board. that's hardly surprising, as the board in 2005 kept only schools that were not failing before the storm and several of those campuses are magnet schools with admissions requirements. overall, schools in st. tammany, plaquemines, st. bernard and st. charles parishes continued to perform near or above the state averages in most results of the state leap, ileap and graduate exit exams administered this spring. some parishes were significantly better than the state's figure. but not all students saw gains from last year. st. tammany has performed well above the state's average for several years and saw gains in all areas, except the graduate exit exam taken by students in 10th and 11th grades. those results actually dipped a bit from last spring, and officials need to focus on maintaining gains and improving performance across the board. state officials highlighted the gains recorded in st. bernard in recent years. since 2007, the percentage of st. bernard students scoring at \"basic\" proficiency--essentially at grade level--or above has risen 17 percent. that's an impressive gain. but the largest gains overall came among the new orleans schools the state took over after katrina because of their historic poor performance. most of those schools are now independent charters overseen by the rsd, which also runs a number of traditional schools. rsd students, including charter and traditional campuses, posted their fourth-consecutive year of improvement, increasing the proportion of students scoring at grade level or above to 48 percent. that's a 5 percent gain compared to 2010. with that progress, the proportion of rsd students scoring at grade level or better has more than doubled since 2007, from 23 percent to 48 percent. the numbers reflect the progress sparked by the wholesale reform of the system after katrina. the district still has substantial ground to cover to raise its overall performance to the state average. but the progress since katrina would have been unthinkable without the reforms. the track record of the system in recent years--including these latest scores--should stymie efforts by some teacher unions and other critics of charter schools to erode reforms the rsd is not perfect, and it needs to address inequities between individual schools. the system also needs to focus on improving performance among new orleans schools that are still well below the state average. that's particularly true for high schools still run directly by the rsd. rsd superintendent <mark>john white</mark> said the results show the district is a national model for broader education reform efforts. \"the new orleans system of schools works. period. end of story. and we cannot go back to a system that does not put children's needs first .\" he said. \"these results should close the book on that question .\" mr. <mark>white</mark> is right. new orleans' results also show that officials in jefferson parish must accelerate their push for reform. jefferson schools, which now rank 52nd out of 70 public school systems in louisiana, posted gains in five of seven grade levels that take the standardized tests. but jefferson still remained well below the state's average and also had a dismaying 21 percent drop from last year's scores in the gee. that's unacceptable for one of the largest and richest public school systems in the state. \"we cannot be complacent, satisfied or celebratory,\" deputy superintendent <mark>richard carpenter</mark> said of the results. indeed. the message jefferson officials should draw from these results is that they should pursue reform as vigorously as their rsd counterparts have done in new orleans. and even the school systems with the best scores in the region need to continue working to improve.", "articleID": "2011052611_00035364_W", "names": {"John White": ["Q10383267", "Q15821600", "Q16215641", "Q17423827", "Q18385573", "Q21230044", "Q21598415", "Q28873238", "Q3182735", "Q3809674", "Q43395687", "Q459082", "Q51586479", "Q53838422", "Q53838425", "Q53838427", "Q53838454", "Q54932732", "Q56817081", "Q6263775", "Q6263782", "Q6263788", "Q6263790", "Q6263798", "Q6263800", "Q6263804", "Q6263809", "Q719350"]}}]