[{"articleID": "2017121305_00210510_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"], "Lu Kang": ["Q19825841", "Q45425431", "Q45438483", "Q45443872", "Q45505537"], "Zhang Liangui": ["Q45492171", "Q45703917"]}, "date": "2017-12-13", "url": "http://www.brisbanetimes.com.au/world/on-the-banks-of-the-tumen-china-prepares-for-north-korean-refugee-tide-20171213-h03rvn.html", "content": "Beijing: A Chinese county along the border with North Korea is constructing refugee camps intended to house thousands of migrants fleeing a possible crisis on the Korean Peninsula, according to an internal document that appears to have been leaked from China's main state-owned telecommunications company. Three villages in Changbai county and two cities in the north-eastern border province of Jilin have been designated for the camps, according to the document from China Mobile. The document appeared last week on Weibo, China's answer to Twitter site. China's national flag flutters on the Chinese side of the banks of the Tumen river, as a North Korean village is seen behind. Photo: <mark>KIM</mark> KYUNG HOON The telco was tasked with providing internet services to the camps, Newsweek reported. The camps are an unusual, albeit tacit, admission by China that instability in North Korea is increasingly likely, and that refugees could swarm across the Tumen River, a narrow ribbon of water that divides the two countries. A bridge over the Tumen River linking Dandong, China, and Sinuiju, North Korea, has never been used since it was built in 2015. Photo: Sanghee Liu/Fairfax Media For decades, Chinese policy on North Korea has centred on maintaining stability in a neighbouring country known for its repression and volatility. Despite international sanctions and condemnation, the North in recent months has intensified a program to test nuclear weapons and missiles, increasing the potential for internal instability or the chance of an attack by the United States. <mark>Lu Kang</mark>, a China's Foreign Ministry spokesman, told reporters this week that he was unaware of the plan for the refugee camps, but he did not deny their existence. \"I haven't seen such reports,\" <mark>Lu</mark> said. North Korean leader <mark>Kim Jong-un</mark> waves during a military parade in Pyongyang, North Korea earlier this year. China fears his antics may drive a rise in desertions. Photo: Wong Maye-E Changbai county officials did not answer telephone calls, and an executive at China Mobile in Changbai declined to discuss the matter. Newsweek however quoted a China Mobile spokesperson as saying: \"The government has ordered these settlement points .\" But don't worry, no one is panicking here. It is not a big deal. \"With a gun on his shoulder, a young North Korean man on a bicycle watches a Chinese tourist boat passing by in Sinuiju on the North Korean side of the Chinese border. Photo: Sanghee Liu The China Mobile document said that a manager of the company inspected five sites December 2 at the request of the Changbai county government. The company was asked to ensure there was viable internet service in the areas that would be used for the camps .\" Because the situation on the China-North Korea border has intensified lately, Changbai county government plans to set up five refugee sites in Changbai, \"China Mobile said in the document. A North Korean man fishes off a ferry in Sinuiju near the Chinese border. Photo: Sanghee Liu/Fairfax Media The areas designated for the refugee camps were on state-owned land, and temporary housing had already been constructed at several sites, according to a local businessman who requested anonymity for fear of angering the local government. Three county villages were named in the document as locations for the camps. The cities of Tumen and Hunchun would also house refugees, according to the businessman. Tumen and Hunchun have for 20 years received defectors, who have managed to escape from North Korea into China. Many of those defectors travel on to South-east Asia and eventually to South Korea. Jilin province is about 90 kilometres from Punggye-ri, the main North Korean nuclear test site. Fears of a nuclear war, or disaster, just kilometres away have set residents of the province on edge. Last week, the Jilin Daily, a provincial newspaper, advised residents on how to react in case of a nuclear explosion or radioactive fallout. The advice included washing off radioactive dust from exposed body parts and shoes, and taking iodine tablets. The article noted that when the United States dropped an atomic bomb on Hiroshima, Japan, in 1945, more than 70,000 people were killed. Modern weapons are many times more powerful. China has refrained from imposing overly punitive sanctions on North Korea for fear of causing a collapse that would result in refugees flooding the economically vulnerable northeast. So far, China has resisted calls to cut off oil to North Korea, a move that would result in severe deprivation resulting in many people crossing the border. Although China does not appear to have changed its basic position on maintaining stability, the increasingly hostile talk in Washington appears to be spurring contingency preparations. Zheng Zeguang, vice minister of foreign affairs, rushed to Washington last week to discuss what Chinese officials call the\" black hole of confrontation \"between the US and North Korea. As a result of the rising tensions, one of China's most prominent experts on North Korea, called building the camps\" absolutely reasonable. \"\"It is highly possible that there is a conflict between North Korea and the United States now,\" said <mark>Zhang Liangui</mark>, a professor of international strategic research at the Communist Party's Central Party School. \"What China does here is to be prepared for any kind of situation happening on the Korean Peninsula .\" In another sign of increased tensions, South Korea is joining the United States and Japan for a drill to practice tracking missiles launched from North Korean submarines. Loading Last month, North Korea tested an intercontinental ballistic missile that flew higher and longer than its previous tests. The North said that the missile could deliver nuclear warheads anywhere in the continental United States. New York Times"}, {"articleID": "2015073118_00058194_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Scott Russell": ["Q1360222", "Q4353179", "Q7437173", "Q7437174"]}, "date": "2015-07-31", "url": "http://www.vancouversun.com/Pete", "content": "Pete McMartin: Real estate and laundered money--If it's so prevalent, why aren't we catching it? Federal investigative agency won't say whether dirty money has been identified here and realtors are adamant they comply with the reporting rules By Pete McMartin, Vancouver Sun columnistJuly 30, 2015 Laundered offshore money is blamed by some for Metro Vancouver's high real estate prices. But until the federal agency that investigates such things shares its findings, we won't know whether there's any truth to it. Fotolia. Photograph by: Africa Studio - Fotolia, Africa Studio - Fotolia If Metro Vancouver's real estate market is awash in laundered offshore money, then where is the evidence of that? Where are the arrests and court cases attesting to its existence? Where are the press releases of successfully prosecuted cases? Where are government vows to crack down on it, or even recognize it as a problem? In other countries, the problem of foreign laundered money in real estate has been more visible. In New York, the influx of plundered money from Russia, China and despotic Third World countries buying up luxury properties has been well-documented, most notably in The New York Times. In Britain, Prime Minister <mark>David Cameron</mark> vowed this week to act against corrupt foreigners buying up high-end properties there through shell companies, a practice, he suggested, that was driving real estate prices. About $245 billion-worth of real estate in England and Wales is registered offshore now, most often to shell companies with addresses in the British Virgin Islands or Jersey. The difference between Britain and Canada is that in Britain, those real estate figures are readily available. Here, they aren't. This is not to say laundered and plundered money has not been flooding into the Canadian real estate market, especially here in Metro Vancouver. It may well be. But catching it is another matter. In Canada, the federal government's investigative arm of laundered money is Fintrac--the Financial Transactions and Reports Analysis Centre. Under its system, the responsibility to report suspicious transactions or those transactions over $10,000 rests with real estate agents and their brokerages. Paperwork must be filed, and the identification of the individual or company involved in the transaction must be obtained. Penalties for not doing so are stiff, with fines up to $2 million and/or five years in prison. Yet in Fintrac's 2014 annual report, it stated there was \"a lower level of compliance\" for reporting in the real estate industry. Penalties for non-compliance, however, have been few--only seven minor fines across all of Canada--and of the half-dozen real estate agents I interviewed here, including <mark>Scott Russell</mark>, president of the B.C. Real Estate Association, all were surprised at Fintrac's portrayal of the industry's compliance. All said they were careful to comply, despite the fact they felt it did little good in identifying laundered money. Several of them said they made out Fintrac reports on every transaction they made, despite the amount. Speaking of his own firm's procedures, <mark>Russell</mark> said: \"We will not pay out on a completed deal without a Fintrac form on every single transaction, and I can tell you most brokerages are like that. This office hasn't accepted cash since before 2000, and the reason why is that it's more of a security thing for us because we had (office staff) taking bags of money to the bank .\" And most offices don't (take cash). The (Fintrac) penalties are huge, and nobody wants to be offside. \"The tales of deals being done with suitcases full of cash, he said, were just that--tales. Most often, realtors never see cash, but bank drafts or registered cheques, and only then for down payment sums that are often below Fintrac's $10,000 cut-off figure for reporting. The big closing sums, all the realtors said, were handled by lawyers and notary publics. Due to a Supreme Court decision earlier this year, however, lawyers were ruled exempt from Fintrac reporting on the grounds it violated solicitor-client privilege. Additionally, Fintrac does not monitor leases and rental deals. Randall McCauley, vice-president of government and public relations for the Canadian Real Estate Association, has been negotiating with the federal government for the last seven years on how the real estate industry could best report to Fintrac. He was loathe, he said, to comment on Fintrac's effectiveness. Because of the confidential and sensitive nature of its investigations, he said, it may not be able to divulge its methods. But he did say that if a criminal was intent on avoiding Fintrac, there were ways to do it .\" It seems to me, \"McCauley said,\" that people with that level of money often deal with professionals like lawyers and banks and accountants, and some of them have to report and some of them don't. Big goes to big in my experience. If they were criminal and they knew what they were doing, I don't know that they'd easily run to a realtor. \"So it's an imperfect regime...If they are sophisticated criminals, and they do want to launder money through real estate in big markets, there are huge gaps where they can do that without ever talking to a realtor .\" Is there laundered money in Metro Vancouver's real estate? Possibly. Likely."}, {"articleID": "2013081923_00073162_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2013-08-19", "url": "http://www.newkerala.com/news/story/56243/indian-army-chief-meets-pm.html", "content": "New Delhi, Aug 19: Indian Army chief General Bikram Singh met Prime Minister <mark>Manmohan Singh</mark> here Monday, official sources said. The meeting came in the backdrop of increased ceasefire violations by the Pakistan Army at the LoC in Jammu and Kashmir. \"The army chief met the prime minister. The meeting lasted for 15 minutes,\" an official in the Prime Minister's Office told IANS. It is not immediately known what was discussed."}, {"articleID": "2017102315_00561693_W", "names": {"Barbara Evans": ["Q21459365", "Q26197283", "Q27450107", "Q56867893"]}, "date": "2017-10-23", "url": "http://thestir.cafemom.com/tv/208108/jenelle_evans_teen_mom_reunion?utm_medium=sm&utm_source=rss&utm_content=tv_rssfeed", "content": "Nate Beckett/Splash News Uh-oh, is the old Jenelle back? On Saturday, the girls of Teen Mom 2 taped their reunion, and according to numerous sources, both Jenelle <mark>Evans</mark> and David Eason behaved in a downright shocking way. The day after the taping, Jenelle posted a live Instagram video in an attempt to tell her side of the story. \"I came here to do a live video...because of the s ** t that happened last night,\" she started off. And from the sounds of things, the mom of three has a lot of explaining to do. Advertisement \"If you haven't heard, last night there was an article that, of course, comes out after I left, [saying] that they had to shut down production and Jenelle and David were acting crazy,\" Jenelle said, referring to a report on The Ashley that claimed a huge fight erupted backstage and David even wound up pulling a knife out at party for the cast. According to Jenelle, David, technically-speaking, did have a knife, but he only used it to, um, pop some balloons after he was frustrated that he was being denied a beer. But apparently, that wasn't the big issue on Saturday. Evidently, Jenelle was upset after seeing her ex Nathan Griffith's new girlfriend, Ashley Lanhart, hug her mother, <mark>Barbara Evans</mark>. OK, fine, not cool. But here's where things get a little strange. Jenelle said that she was always under the impression that Ashley wanted nothing to do with Teen Mom, so she was surprised to see her being filmed backstage. When she asked why Nathan's girlfriend was being filmed, Jenelle said that Ashley started to \"cuss her out\" to the point where she had to be pinned against a wall and asked to leave."}, {"articleID": "2019061921_00224025_W", "names": {"Alexander Zverev": ["Q13990552", "Q24689242", "Q4189526"], "Steve Johnson": ["Q1341137", "Q1469682", "Q18688075", "Q18922000", "Q19364140", "Q24007397", "Q25466909", "Q27916976", "Q3498969", "Q46037545", "Q53569", "Q7612949", "Q7612950", "Q7612951", "Q7612953", "Q7612954", "Q7612956"], "Andy Murray": ["Q10125", "Q526811"]}, "date": "2019-06-19", "url": "https://sports.nbcsports.com/2019/06/19/coric-khachanov-progress-in-halle-open/?share=email", "content": "Click to email this to a friend (Opens in new window) HALLE, Germany (AP) Defending champion Borna Coric outlasted Portuguese qualifier Joao Sousa 7-6 (4), 5-7, 7-6 (4) to reach the quarterfinals of the Halle Open on Wednesday. Coric, who defeated Roger Federer in last year's final, saved seven of the nine break points he faced and took his match point after a 26-shot rally to beat Sousa in just under 3 hours. The 14th-ranked Coric next faces France's Pierre-Hugues Herbert, who earlier defeated Ukrainian qualifier Sergiy Stakhovsky 2-6, 7-6 (2), 6-4 in their second-round match. Karen Khachanov defeated home favorite Jan-Lennard Struff 6-3, 3-6, 6-4 at the grass-court tournament, a warm-up for Wimbledon. Khachanov, ranked a career-high No. 9, hit 11 aces and converted two of his seven break chances to win in 1 hour, 43 minutes. The Russian will next face an Italian, Stuttgart Open champion Matteo Berrettini or Andreas Seppi. David Goffin defeated Radu Albot 4-6, 6-4, 6-3 and awaits the winner between the second-seeded <mark>Alexander Zverev</mark> or American <mark>Steve Johnson</mark>, who play on Thursday. Nine-time champion Roger Federer also returns Thursday against Jo-Wilfried Tsonga of France. Tsonga won their only previous match on grass, at Wimbledon in 2011 .--Click to email this to a friend (Opens in new window) LONDON (AP) Tennis player Feliciano Lopez has denied any wrongdoing after being linked by Spanish media to a doubles match at Wimbledon in 2017 that was allegedly fixed. Lopez said on Wednesday at the Queen's Club tournament in London that \"I feel it is extremely important to come to you and absolutely deny any link with the events described in relations to the allegations of match fixing .\" Spanish online newspaper El Confidencial reported earlier this week that a match played by Feliciano Lopez and doubles partner Marc Lopez at Wimbledon two years ago had been mentioned in a phone conversation by a former soccer player who is being investigated as part of a match-fixing probe in Spanish soccer. According to El Confidencial, Carlos Aranda said that he knew the Lopez pair would lose a certain match, which they did. The report does not say that the tennis players were involved or that they threw the match. Feliciano Lopez said that he and Marc Lopez had contacted the Tennis Integrity Unit, a competition watchdog in the sport, to say they would \"fully cooperate .\" Wash-out at Queens' Club means <mark>Murray</mark>'s comeback delayed Getty Images Click to email this to a friend (Opens in new window) LONDON (AP) <mark>Andy Murray</mark>'s comeback has been delayed after rain washed out the entire day's play at the Queen's Club grass-court tournament for only the third time in 18 years on Tuesday. <mark>Murray</mark>, who is competing in the doubles alongside Feliciano Lopez as he makes a tentative return to action five months after hip surgery, was due to play on Wednesday. But their first-round match against top-seeded Juan Sebastian Cabal and Jean-Julian Rojer has now been put back until Thursday. That is because Lopez's singles match against Marton Fucsovics was one of those affected by Tuesday's bad weather. The Spaniard is now first on Court One on Wednesday. Queen's Club organizers gave full refunds to spectators left frustrated by the rain. The only previous total wash-outs at the tournament since the turn of the century was finals day in 2011, which meant <mark>Murray</mark>'s title match against Jo-Wilfried Tsonga was played on the Monday, and the opening day in 2012."}, {"articleID": "2020031905_00141656_W", "names": {"Mary Ward": ["Q22662782", "Q42846167", "Q6780920"], "Philip Lowe": ["Q1981766", "Q27922677"], "Jordan Baker": ["Q12983069", "Q16146320", "Q21620815", "Q23037368"]}, "date": "2020-03-19", "url": "http://media.smh.com.au/sport/nrl/nrl-tells-players-to-self-isolate-in-preparation-for-full-calendar-20200319-p54bwt.html", "content": "Australian Breaking News Headlines & World News Online | SMH.com. au Australian Breaking News Headlines & World News Online | SMH.com. au \"We believe it's essential to take a further step to ensure we are no longer allowing anyone, unless they are a citizen or resident or direct family member, [to enter Australia],\" he said. 7 minutes ago by, <mark>Mary Ward</mark> and Latika Bourke Matt Bungard Add to shortlist Australian financial markets experienced another brutal session with equities, the Aussie dollar and longer-dated government bonds all selling off sharply despite RBA's moves. by David Scutt Police and border officials will crack down on people hoarding supermarket goods and re-selling them for profit. by Anthony Galloway Governor <mark>Philip Lowe</mark> said the RBA will also provide at least $90 billion at 0.25 per cent over three years to banks if they lend that cash to small and medium-sized businesses. 2 hours ago Nearly a million doctors, nurses, teachers, cleaners and carers are among the Australian workers who are regularly exposed to disease or infections while they do their jobs. 36 minutes ago The Chinese Communist Party knows that by the time the crisis is over the world's order could be altered. by Chris Zappone What is the thinking behind the decision to keep schools across Australia open? by Fergus Hunter The ground zero of NSW's bushfire emergency response has been commandeered to wage the state government's war against COVID-19. 56 minutes ago The sex offender, who died last year, had promised to pay her legal fees for any claims from the dozens of women who say she helped him recruit them. 2 hours ago By signing up you accept our privacy policy and conditions of use Advertisement Paracetamol and ventolin will be limited to one per customer, while children's paracetamol will be placed behind pharmacy counters, after panic buyers stripped shelves bare across the country. 2 hours ago by and Paul Sakkal Bianca Hall Add to shortlist The Prime Minister has warned private school funding could be at risk if schools defy government advice. by <mark>Jordan Baker</mark>"}, {"articleID": "2017091219_00516821_W", "names": {"Simon Townsend": ["Q21064247", "Q7519915"], "Tom Robinson": ["Q153289", "Q17198666", "Q42320057", "Q42714349", "Q723493"], "Adam Smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"]}, "date": "2017-09-12", "url": "http://www.northdevongazette.co.uk/swp-league-round-up-torridgeside-s-unbeaten-start-comes-to-an-end-1-5191077", "content": "SWP League round-up: Torridgeside's unbeaten start comes to an end PUBLISHED: 11:58 12 September 2017 | UPDATED: 11:59 12 September 2017 Matt Smart Football Archant This week's Carlsberg South West Peninsula League round-up Share Email this article to a friend To send a link to this page you must be logged in. Torridgeside's unbeaten start to the season in the Carlsberg South West Peninsula League was brought to an end on Saturday. It was Teignmouth who inflicted T-Side with their first loss in Division One East, leaving Donnacroft 3-0 winners. Manager Barry Paine said individual mistakes cost his side in what was otherwise an even game. \"There was nothing in the game. It looked like a 0-0,\" he said. \"Either side could have won and they've taken it because of the mistakes we've made .\" On the day they've just played it a little bit better than we did, but we're not a million miles away. \"Ilfracombe Town picked up their first away win of the season, and made it four unbeaten with a 4-1 at Galmpton and Roselands. <mark>Simon Townsend</mark> gave the Bluebirds the lead with a well-taken finish before Joe Seldon doubled. Galmpton pulled one back before Cassian Blackmore burst through to restore a two-goal advantage. <mark>Townsend</mark> wrapped things up in the second half with a classic route one goal .\" In the first half, although we went in 3-1 up, it could have gone either way, \"said coach Clem Bennellick .\" Both teams had decent chances, and it all went well for us. Everything we touched turned to gold. \"I think that was the first match where I've come in after the game and said I enjoyed it. We've found our feet a little bit and we're playing with a little bit more freedom .\" Elsewhere in Division One East, Appledore were beaten 2-0 at Honiton Town. \"I was struggling for a side and we knew it was going to be difficult,\" said manager Keith Shapland. \"We deserved to get beat, I won't gloss it over, we weren't good enough .\" We gave away possession too cheaply and didn't create. One thing I will say, was in goal Toby <mark>Robinson</mark>, who came in from the reserves was fantastic. He made four or five brilliant saves to keep the score down. \"In Division One West, Holsworthy thumped Illogan RBL 6-2 on Saturday. There were two goals each for Connor Nash and Tudor Placinta. <mark>Tom Robinson</mark> and <mark>Adam Smith</mark> also scored. Attentions turn to the Walter C Parsons Cup this weekend, with all the Division One teams at home. Appledore play University of Exeter, Ilfracombe welcome Budleigh Salterton, Torridgeside play Honiton Town and Hoslworthy have a game against St Martins. Witheridge are on their travels, playing Stoke Gabriel. Withy were in action in the Buildbase FA Vase on Saturday, coming unstuck 9-1 at home to Toolstation Western League side Cribbs."}, {"articleID": "2008111912_00004412_W", "names": {"John Collins": ["Q10387544", "Q20645386", "Q20984420", "Q22979302", "Q26254380", "Q28935742", "Q29438451", "Q30122510", "Q47504584", "Q51586365", "Q52154681", "Q57413181", "Q57437992", "Q6111740", "Q6226714", "Q6226717", "Q6226721", "Q6226723", "Q6226726", "Q6226733", "Q720921", "Q961079"], "Jim Clark": ["Q16114343", "Q23091533", "Q360002", "Q55615078", "Q6194199", "Q6194205"]}, "date": "2008-11-19", "url": "http://breitbart.com/article.php?id=prnw.20081119.LAW057&show_article=1", "content": "transunion's trendinsight provides lenders with new analysis of consumer behavior and debt management memory pharmaceuticals achieves enrollment goal for phase 2 study of mem 3454 in cognitive impairment associated with schizophrenia photos: warner bros. consumer products announces the inspirations of oz fine art collection to continue ongoing 70th anniversary celebration of the wizard of oz myperfectcreditcard.com gives consumers ways to improve their personal finances during a tough economy mycanvas and smugmug join together to provide a full range of photo sharing and digital photo book options tickets.com and vanoc exceed expectations during first phase of ticketing for the 2010 winter olympic games clarinol (tm) cla and puregels (r) featured on hit television show \"living in style' health and fitness site inutrition.com gives away fifth nintendo wii and wii fit port orchard, wash., nov. 19 / prnewswire /--stayhealthy, inc. and ef recovery announced today that they have launched a pilot program with the washington fire chief's fire rescue wellness corporation to bring revolutionary health and fitness devices to washington area firefighters .\" the health and safety of our firefighters is always a top concern, \"said chief wayne senter, fire chief of south kitsap fire rescue .\" as our nation deals with an epidemic of overweight and obesity that affects more than 70% of our population, we are always looking for the best solutions to bring to our firefighters to improve their overall fitness levels. the pilot program we've launched today provides what i believe will be one of the most compelling solutions to help our firefighters achieve their best fitness levels. \"\"in advance of a nationwide rollout of the program, stayhealthy and ef recovery have partnered to test pilot this program in washington state. when we were first introduced to the firefighters in washington state, we were immediately impressed by their enthusiasm and commitment to the health and fitness of their organization. we chose to test pilot our program here so that we can get firsthand experiences that we can take to firefighters across the country,\" said <mark>john collins</mark>, ceo of stayhealthy. \"the pilot program will be initiated at seven fire stations directed by chief wayne senter, within the puget sound region, in south kitsap fire and rescue district. the stayhealthy devices that will be used during the pilot include the stayhealthy body composition analyzer and the stayhealthy calorie tracker. the body composition analyzer is the only product of its kind. it provides a precise and instantaneous reading of individual body fat, lean muscle mass and hydration levels. all of this information is critical to understanding personal fitness levels and setting goals for enhancing fitness. the calorie tracker provides 24/7 tracking of actual calories burned. fitness starts with balancing individual caloric requirements with calories consumed and calories burned,\" said <mark>collins</mark>. \"the stayhealthy tools allow anyone to precisely define their needs and personalize a program to attain their fitness goals .\" the pilot program will be conducted for the next 90 days and will conclude in mid-february. participants in the program will monitor their body composition throughout the program using the body composition analyzer, and each participant will wear a calorie tracker to monitor their actual calorie burn. we are interested in seeing how firefighters use the devices on a day to day basis. \"in communities across the country, firefighters play a vital role in protecting citizens and property. every community is interested in helping to keep their firefighters healthy. we believe this program will play a key role in managing the health and fitness of firefighters across the country,\" said <mark>jim clark</mark> of ef recovery. about stayhealthy stayhealthy, inc. is a privately owned health services company focused on bringing solutions to individuals wishing to \"take control\" of their health and fitness. stayhealthy has created the first fully integrated health and fitness solution and seeks to make \"health\" a life style choice--a way of life. about ef recovery ef recovery was founded with a specific focus on bringing safety related services and products to the fire department industry. ef recovery products enhance the safety of fire fighters and the public while mitigating toxic spills and protecting the communities they serve when addressing hazardous spills at collision scenes. ef recovery's unique service model will actually put funds back into the fire departments for protecting the environment of their communities. washington fire chiefs / fire rescue wellness corporation the wfc fire rescue wellness corporation was created to provide a comprehensive approach to firefighter's health and wellness. these programs provide a means for reducing fire fighter injuries, deaths, time loss, workers compensation, and disability claims. source stayhealthy, inc.; ef recovery the b-cast: zogby under fire for poll used in documentary on campaign media bias \"do the right thing': huckabee slams other gop candidates in new book\" merry tossmas': focus on the family calls out retailers who nix \"christmas' tidings"}, {"articleID": "2019082601_00016363_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"]}, "date": "2019-08-26", "url": "http://www.gamereactor.eu/gamescom-2019/?sid=05221e7d75a1e7a2fa56b890f4803707", "content": "Metal Guts sees you platform in the body of an android Written by <mark>Sam Bishop</mark> on the 24th of August 2019 at 10:13 Toco's founder Luc Le Dauphin joined us for a chat to explain the concept at Gamescom in Cologne. 0 Zero Damage is an action game with \"a message of peace\" Written by <mark>Sam Bishop</mark> on the 24th of August 2019 at 08:41 Producer and game director Daniel Camelo spoke to us at Gamescom about the action game with a twist. 0 Age of Empires 4 gameplay will debut at X019 in November Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 13:15 The first day of the Inside Xbox show in London will lift the lid on the long-awaited strategy sequel. 0 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:50 These are coming in December, although the September update is focused on getting newcomers on board. 0 Here is our last Gamescom update of 2019 Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:48 The Cologne show has wrapped up for us, and we've had a lot of fun experiences at the event. 0 Brenda Romero on board game design influencing Empire of Sin Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 12:14 The team even held a sort of \"pseudo-D & D session\" when coming up with the ideas for a game in 1920s Chicago. 0 Empire of Sin's goal is \"to put you in the shoes of a 1920s boss\" Written by <mark>Sam Bishop</mark> on the 23rd of August 2019 at 10:17 Brenda Romero breaks down all of the moving parts within Empire of Sin during our interview at Gamescom this year. 0 Multiplayer in Cyberpunk 2077: \"If it doesn't fit, it doesn't fit\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 15:27 CD Projekt Red isn't committing to multiplayer in the RPG yet, and that's because it's still in \"R & D phase\". 0 We have Battletoads gameplay to share from Gamescom Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 14:36 The Battletoads are back, and we got to spend some quality time with them in Cologne this week. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 13:30 Xbox Live UK's senior EMEA category manager talked to us about Game Pass during Gamescom in Cologne. 0 Catch our own gameplay from The Witcher 3 on Switch Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 12:10 The Switcher is arriving this October, and we got to try our Geralt's new adventure in uncharted territory. 0 Star Renegades \"mashes together a lot of genres\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 11:44 Massive Damage lead designer Garry Seto talked to us at Gamescom about the ideas bringing Star Renegades together. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 11:15 Master cold weather in a variety of customisable vehicles and large sandbox maps packed with hazards. 0 Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 10:50 The team at Black Shamrock also shed some light on the RPG during a Gamescom developer diary. 0 This year's Grid \"is the Grid you know and love\" Written by <mark>Sam Bishop</mark> on the 22nd of August 2019 at 10:17 We spoke to game director <mark>Chris Smith</mark> at Gamescom, and have some new gameplay of our own to share as well."}, {"articleID": "2013112510_00027505_W", "names": {"Charlie Moore": ["Q16211929", "Q5085260", "Q58090551"], "Charles Matthews": ["Q27448073", "Q42322466", "Q43167428", "Q47108874", "Q5080729", "Q5080732"], "John Oliver": ["Q1701249", "Q1701254", "Q21598301", "Q22279481", "Q47542017", "Q6251229", "Q6251231", "Q6251237"], "Mike Taylor": ["Q1394224", "Q14951476", "Q17011025", "Q172604", "Q1933556", "Q19666430", "Q22108039", "Q24006988", "Q38917715", "Q6849017", "Q6849018", "Q6849019", "Q6849020", "Q8134165"]}, "date": "2013-11-25", "url": "http://southtownstar.suntimes.com/sports/23932871-419/disabato-marian-catholic-starts-boys-basketball-season-no-1-in-southtownstar.html", "content": "Disabato: Marian Catholic starts boys basketball season No. 1 in SouthtownStar storyidforme: 58254522 tmspicid: 21250567 fileheaderid: 9973726 I could attempt to appease more readers and claim there were as many as a half-dozen teams in the running for the No. 1 spot in the SouthtownStar's Boys Basketball Preseason Top 10. That would be stretching the truth. It was a three-team race, and each, in its own way, had the means to earn top honors. It came down to defending Class 3A state champion Morgan Park, reigning Catholic League South champion St. Rita and Marian Catholic, fresh off a record-setting season in 2012-13. So why Morgan Park? The Mustangs boast a pair of 6-foot-7 forwards in Josh Cunningham and Lamont Walker and a dynamic, young point guard in sophomore <mark>Charlie Moore</mark>. Why St. Rita? Well, there's Vic Law, a 6-7 Northwestern recruit, junior <mark>Charles Matthews</mark>, regarded as one of the top prospects in the Class of 2015, and senior Dominique <mark>Matthews</mark>, who averaged 16 points per game a year ago. Why Marian? Well, the Spartans return their entire starting lineup from a team that won a school-record 29 games and advanced to its first Elite Eight, led by all-world point guard Tyler Ulis, a Kentucky recruit. Selecting the best among the three was like judging a beauty pageant between the Victoria Secret Angels. While I believe St. Rita, from top to bottom, with three bona fide Division I players, is the most talented squad in the Southland, talent alone doesn't guarantee success. That's why Marian Catholic will begin the season as No. 1. Of course, the Spartans are talented. Ulis is the best player in the area, and I believe the seasoned, experienced supporting cast of Ki-jana Crawford, Josh Cohn, Terrone Parham and <mark>John Oliver</mark> will be even better this season. Here's what sets Marian apart: The Spartans realize Ulis is the star of the show and are willing to play Robin to his Batman. Ulis, in turn, is just as pleased to register the assist on a game-winning shot as he is burying a buzzer-beater. In other words, egos are checked at the door. That's as much a compliment to the players as it is to coach <mark>Mike Taylor</mark> and his staff. Beginning his 11th season, <mark>Taylor</mark> has taken the program from the outhouse to the penthouse. \"We're very proud to be No. 1,\" <mark>Taylor</mark> said. \"We have a great appreciation for south suburban basketball. We were never mentioned in the same sentence before with Bloom, H-F, Hillcrest, Thornton and Thornwood. Now, we are .\" Marian was able to fly under the radar for most of the first-half of last season. That won't be the case beginning Monday vs. T.F. South. The Spartans better have a solid jaw, because every opponent is going to give them their best shot. \"I think the kids think they're ready for it,\" <mark>Taylor</mark> said. \"I don't think they realize how hard everyone is going to come at them. Our whole group is going to have to stand up .\" The one area concern for the Spartans is a lack of size. Parham, at 6-7, is their tallest player. \"We're not much different than last year; we're better in a lot of ways,\" <mark>Taylor</mark> said. \"But we haven't gotten any bigger .\" Ulis has gotten noticeably stronger, according to <mark>Taylor</mark>, and that should scare the daylights out of opponents. <mark>Taylor</mark> also said <mark>Oliver</mark> and Cohn have improved their games big time. Now it's time to go out and live up to expectations. \"It's going to be a battle every night,\" <mark>Taylor</mark> said. \"I've told them,' I don't want your season to be defined by one game. Celebrate this year, celebrate each other, celebrate what you've accomplished. '"}]