[{"articleID": "2018101106_00292433_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-10-11", "url": "http://www.gamereactor.eu/esports/?sid=1e4a7620fb124b802eb42fa66dc835b9", "content": "Esports ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 12 Along with PUBG and Blackout. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 11 Including video content and workbooks. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 10 It's a \"strategic effort to position our organisation for the future .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 09 They'll have their rematch against Astralis. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Coming to Las Vegas in December. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 9th of October 2018 at 13 Including Uzi, Svenskeren, and more."}, {"articleID": "2019110611_00006340_W", "names": {"Rohit Sharma": ["Q21622845", "Q21622847", "Q26436595", "Q26837282", "Q30122003", "Q3520045", "Q58049760"], "Mustafizur Rahman": ["Q19829386", "Q25189318", "Q39386119", "Q57078132"]}, "date": "2019-11-06", "url": "https://www.thestatesman.com/sports/skipper-rohit-sharma-admits-to-team-feeling-pressure-ahead-of-second-t20i-against-bangladesh-1502818529.html", "content": "Home / / Skipper <mark>Rohit Sharma</mark> admits to team feeling pressure ahead of second T20I against Bangladesh Sports Skipper <mark>Rohit Sharma</mark> admits to team feeling pressure ahead of second T20I against Bangladesh The 32-year-old also emphasised that the team learns from the mistakes in the national capital and doesn't repeat them in the second T20I. IANS | Rajkot | November 6, 2019 4:26 pm Indian skipper <mark>Rohit Sharma</mark> in action during the 1st T20I match between India and Bangladesh at Arun Jaitley Stadium, in New Delhi on Nov 3, 2019. (Photo: Surjeet Yadav/IANS) Following the crushing seven-wicket defeat in first T20I against Bangladesh, India captain <mark>Rohit Sharma</mark> on Wednesday said the pressure is not just on any particular department, but on the entire team to perform in the remaining two matches of the series. India were able to put up a par-score of 148 at the Arun Jaitley Stadium on Sunday and it was pacer Khaleel Ahmed, who was hit for four boundaries by Mushfiqur Rahim in the 19th over that changed the complexion of the game. \"Pressure is just on the team to perform, as simple as that. Not a particular department. You've lost as a team, you've not lost as a bowling unit. So the focus will be on the team,\" <mark>Rohit</mark> told reporters on the eve of the second match. \"The batsmen need to get the job done, the bowlers need to come out and take those crucial wickets. That will be the idea. We are not focusing on any individual departments. Because we lost as a team, not as individuals,\" he added. The Indian skipper also hinted of changing the pace attack at the Saurashtra Cricket Association Stadium. \"Our batting looks good. So I don't think there's any change we need to make in our batting. But we'll analyze the pitch, and based on that we'll see what we can do as a team,\" <mark>Rohit</mark> said. \"The (pace-bowling) combination that we played in the last game, it was based on the pitch that was on offer in Delhi. We will see the pitch again today and we will think what we need to do in our bowling line-up,\" he added. If India do go in for a change then Shardul Thakur might be seen replacing Khaleel. The 32-year-old also emphasised that the team learns from the mistakes in the national capital and doesn't repeat them in the second T20I. \"We were short in a lot of departments. It is important to focus on the mistakes we made and make sure those mistakes are not repeated again. That is the sign of a good team, when you don't repeat mistakes,\" he said. \"I cannot tell you the strategy, but what I can definitely tell you is that there will be changes in our approach. In the last match (in New Delhi), we played according to the pitch. We were playing as per the ways the pitch was reacting,\" he added. Squads: India: <mark>Rohit Sharma</mark> (c), Shikhar Dhawan, KL Rahul, Sanju Samson, Shreyas Iyer, Manish Pandey, Rishabh Pant (wk), Washington Sundar, Krunal Pandya, Yuzvendra Chahal, Rahul Chahar, Deepak Chahar, Khaleel Ahmed, Shivam Dube, Shardul Thakur Bangladesh: Soumya Sarkar, Mohammad Naim, Mahmudullah (c), Afif Hossain, Mosaddek Hossain, Animul Islam, Liton Das, Mushfiqur Rahim, Arafat Sunny, Al-Amin Hossain, <mark>Mustafizur Rahman</mark>, Shaiful Islam, Abu Haider Rony, Mohammad Mithun, Taijul Islam. TAGS:"}, {"articleID": "2012091922_00060137_W", "names": {"Richard Barnes": ["Q1262726", "Q15729849", "Q21466338", "Q22109577", "Q42313319", "Q55314483", "Q7323957"]}, "date": "2012-09-19", "url": "http://wftv.com/news/news/local/action-9-investigates-craigslist-contractor/nSFr4/", "content": "updated: 6:33 p.m. wednesday, sept. 19, 2012 | posted: 3:57 p.m. wednesday, sept. 19, 2012 action 9 investigates a local contractor with a history of taking deposits then walking away from the job. an apopka man claims he's the latest victim. mark harchar didn't expect to see a yard of dirt after paying nearly $2,000 for a new lawn. but he said that's what he got after finding a landscaper on craigslist. \"i feel he's stolen from me, and ultimately all i wanted was grass on my front lawn,\" he said. harchar said he first hired <mark>richard barnes</mark> of affordable tree service and landscaping to trim trees and he paid after it was done. so, harchar said he felt comfortable hiring <mark>barnes</mark> to re-sod the lawn and paid nearly $2,000 upfront. part of that was paid with an $1,100 check. the check was cashed more than two months ago. according to the customer, he never saw <mark>barnes</mark> again. action 9 found out the day <mark>barnes</mark> took the money he was already serving probation and wearing a court ordered gps bracelet. he pleaded to grand theft in 2009, and again in 2010 for taking cash and then not doing the job, wftv learned. now harchar said he's been demanding answers since july. \"promising to show up the next day, he wouldn't show up the next day, days on end, weeks on end,\" said harchar. affordable landscaping has an \"f\" rating at the bbb, and seven unanswered complaints, many from customers who paid deposits. \"the theme here is that he asks for money upfront and then he doesn't come back and disappears,\" said bbb president judy pepper. wftv could not find <mark>barnes</mark> at home. later by phone he denied doing anything wrong, and said he had been paid to trim the trees only but now has promised to give harchar a full refund. \"i don't want to see someone else have to deal with this,\" said harchar."}, {"articleID": "2017122216_00807127_W", "names": {"David Harrison": ["Q19798242", "Q2337380", "Q24005525", "Q3018041", "Q5234755", "Q5234756", "Q5234758", "Q5234759", "Q5234760"]}, "date": "2017-12-22", "url": "https://www.independent.ie/irish-news/news/inms-david-harrison-stands-down-as-company-director-36431051.html", "content": "Independent. ie INM's <mark>David Harrison</mark> stands down as company director Independent House, Talbot Street, Dublin INM's <mark>David Harrison</mark> stands down as company director Independent. ie Independent News & Media (INM) has announced that <mark>David Harrison</mark> has stood down as a director after five years with the company. The Dermot Desmond nominated director was elected to the board of INM as a non-executive director in 2012. https: //www.independent.ie/irish-news/news/inms-david-harrison-stands-down-as-company-director-36431051.html Email Independent News & Media (INM) has announced that <mark>David Harrison</mark> has stood down as a director after five years with the company. The Dermot Desmond nominated director was elected to the board of INM as a non-executive director in 2012. INM's Chairman, Leslie Buckley, said \"On behalf of the Company and the Board, I wish to express my sincere gratitude to <mark>David</mark> for his extremely valuable and positive contribution to INM over the last five years. His support and dedication has been invaluable during this transformative period for the business .\" The company is in the process of appointing candidates to fill a number of vacancies, including to replace the former senior non-executive director Jerome Kennedy who stood down earlier in the year. Online Editors"}, {"articleID": "2018092500_00151994_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}, "date": "2018-09-25", "url": "http://denverbroncos.com/news/broncos-high-school-coach-of-the-week-derrick-martin", "content": "Saturday, Sep 22, 2018 05:54 PM Copied! Broncos High School Coach of the Week: Derrick Martin Photo taken by Dustin Price / dustinpricephotography.com Derrick Martin is no stranger to a championship atmosphere. The 2003 graduate of <mark>Thomas Jefferson</mark> High School has been to the very top of the highest mountain when it comes to football. Among his collection of memorabilia from his time in the NFL are two Super Bowl rings. One with the Green Bay Packers and one with the New York Giants. Martin's last season in the NFL was 2013 and it was in March of 2016 that he was chosen to revitalize his alma mater. This year, his efforts have paid off as he has the Spartans sitting at 4-0 after a 44-0 win over Northfield on Friday. His path through high school football, a Division I college program and the NFL has been one that he feels fortunate enough to be able to share with kids once stood in his very shoes. \"I can say that most of my (learning) experiences are from high school,\" he said. \"It's crazy because not too much has changed at <mark>Thomas Jefferson</mark> in terms of the hallways so I can put myself in their same environment and guide them and tell them things that I didn't do that I wish I would have .\" Having the chance to offer up life lesson is just as valuable to Martin as being able to pass on football lessons. He buys into his kids as human beings and not as football players. They've rewarded him by taking care of what he asks them to on and off the field. For that reason, Martin was selected as this week's Denver Broncos High School Coach of the Week. Years as a head coach: 3 (20-5 overall record) Years at <mark>Thomas Jefferson</mark>: 3 (20-5, 4-0 this season) Previous coaching stops: None. Q: Why do you coach? Martin: I coach for the kids. I like being out there with the kids just to be out there and drop some knowledge on them and hopefully some lifelong lessons that they can pick up as human beings. Q: What do you think it's like for your players to be coached by a former D-I standout and Super Bowl champion? Martin: I think it's hard. I have high expectations for my guys and I've been in the same situation as a lot of them so I can put myself in their shoes. They know I'm telling the truth. Anything that comes out of my mouth is first-hand experience. Q: What are your favorite coaching memories? Martin: Oh man, I don't know. It was fun to beat (Denver) South this year. South has been a powerhouse in the DPS for several years. To play them for the first time in a long time and beat them was pretty awesome. Q: Does this experience, especially starting 4-0 this year, let you go back and remember just how much fun the high school football world is? Martin: Yeah, it's funny, I was actually talking to one of my former coaches kind of about that. We're playing a (Class) 3A schedule and I feel like we have the same number of kids that we had back then (when <mark>Thomas Jefferson</mark> was 4A). For me, it puts things in perspective of the atmosphere of the 3A, 4A, 5A landscape. Q: From a football standpoint, how does it feel emotionally when you've accomplished something like winning a Super Bowl compared to having a kid grow and develop according to the plan you've built for him? Martin: It's crazy. I have a running back who I think is the best in the state in Daveon Hunter. He just turned 16. He's just a kid. We had to tell him his freshman year that he had to workout, he had to watch film and to see that he's done that and now that he's on the field and he's not supposed to be there is an accomplishment. You give these guys the potion and once they figure it out, it's astonishing to see how it changes their passion for the game. Story by Dan Mohmann / CHSAANow Photo taken by Dustin Price / dustinpricephotography.com."}, {"articleID": "2018120613_00361426_W", "names": {"Chris Weston": ["Q27889126", "Q5108451"]}, "date": "2018-12-06", "url": "http://feeds.marketwatch.com/~r/marketwatch/internet/~3/S2aX37IYXzw/story.asp", "content": "Stock-market bulls are definitely not catching any breaks these days, and Thursday isn't looking like the exception. Thus far, the market isn't sanguine about the chances for further progress on trade relations between the U.S. and China, after the arrest of Huawei's CFO Meng Wanzhou. Indeed, carnage in global equity markets is already on display. Combine that narrative with an OPEC production gathering that has the market on a knife's edge, and the recipe for more pain seems fairly baked in as traders return from a day off to mourn the 41st U.S. President George H.W. Bush. That detention of a high-profile tech executive in China is being credited, at least in part, for some crazy action for S & P 500 futures as electronic trade restarted in the wee hours of Thursday. As this chart shows, those futures plummeted so viciously at the open that the CME had to step in and stop trading for a period, just to cool things off: FactSet/MarketWatch That leads us to our call of the day from trader Greg McKenna, who runs McKenna Macro. He says while the jury's still out on whether a so-called fat finger, or accidental trade, caused that big spike down, or it was something else, it's a warning shot for investors. \"This is a very dangerous set up. I'm not Chicken Little, but we need to see a base build up or prices will slip,\" he said in emailed comments. \"Market collapses happen from weakness so we need to get through Thursday trade in the U.S. to give folks more confidence again .\" As for retail investors, probably a bit frazzled by now given what the week has thrown at them so far, his advice is to \"stay in the time frame that they trade. Investors invest, and traders trade. Don't get caught outside those parameters .\" McKenna says cash is a \"reasonable alternative\" right now, for those who are a bit unnerved right now. He says the levels to watch are 2,600 for the S & P 500 and above 2.8% for the yield on the 10-year Treasury note. In addition to trade worries, investors have been focused on a narrowing of the yield spread between the 2-year and 10-year government bonds to the tightest gap in about 11 years has many fretting about a potential recession. Read: Money-management CEO sees \"significant slowdown' in economy, shifts to less-risky investments While some are fretting about that outsize move overnight, others are taking a glass half-full view .\" Personally I think everyone looking at this the wrong way. the circuit breaker worked and limited the damage. Everyone missing that point that an algos-gone-rogue was prevented by CME systems from causing further unnecessary losses, \"said <mark>Chris Weston</mark>, head of research in Pepperstone, in emailed comments .\" So many are worried about a world with algos causing distortions but in the case we can sleep slightly better at night--the system won, \"said <mark>Weston</mark>. I REFUSE TO BELIEVE THE FUTURES. THE PAJAMA TRADERS KNOW NOTHING. THEY KNOW NOTHING!--Ramp Capital ♿ ️ (@ RampCapitalLLC) December 6, 2018 The market Dow YMZ8, -1.45% S & P 500 ESZ8, -1.30% and Nasdaq NQZ8, -1.62% futures are deep in the red. That's after Tuesday's bloodbath wiped 800 points off the Dow DJIA, -3.10% making for the worst day in a month for all three big indexes SPX, -3.24% COMP, -3.80% Read: Here's one theory to explain the stock market's plunge on Tuesday Europe SXXP, -2.12% is also in the red, and it was no better in Asia, which saw widespread losses, led by Hong Kong HSI, -2.47% Crude US: CLU8 has taken a big hit as the market grapples with the Vienna OPEC meeting where there's some confusion over a potential production cut. The dollar DXY, -0.09% is flat and gold US: GCU8 is easier. The yield on the 10-year Treasury note TMUBMUSD10Y, -0.79% is hovering at 2.894%. Read: Brace for a 15% plunge in S & P 500 next year if the Treasury yield curve fully inverts Check out the Market Snapshot column for the latest action. The buzz Huawei's CFO was detained on Saturday, but news seemed to get around slowly and take the market by surprise in Asia Thursday. Arrests don't get more high-profile than Meng--the daughter of the Chinese telecommunications giant's founder and potential successor. The Chinese are furious, with the embassy in Canada demanding her release, while the company says she's innocent. One security expert says U.S. tech executives should avoid traveling to China until this all cools off. The other big spotlight Thursday is on Vienna, where markets are waiting to see if OPEC will green light a production cut to help support struggling oil prices. Crude is tearing lower amid some worries Saudi Arabia won't push for a big enough cut. China may have been behind the massive hack at hotel chain Marriott MAR, -5.04% say sources. Facebook FB, -2.24% has\" too many adversaries, \"said Stifel Nicolaus, which cut the company to hold from buy on Wednesday. Facebook is among the techs getting hit pretty hard Thursday. Lands' End LE, -0.28% Children's Place PLCE, -4.48% Hovnanian NOV, -3.65% and H & R Block HRB, -1.64% are reporting ahead of the open, with Lululemon LULU, -4.48%, AVGO, -4.14% and American Outdoor AOBC, -3.35% after the close. Earnings released late Tuesday and Wednesday may grab attention, after Brown-Forman's BF. B, -4.78% sales numbers disappointed, but Marvell MRVL, -5.37% beat revenue forecasts. Boeing BA, -4.85% is among the losers after the CEO of its biggest client, Lion Air, said it may cancel a huge order after the airline group appeared to blame his company for a deadly crash in October. The economy A huge batch of data is headed our way, kicking off with ADP employment data, weekly jobless claims, the trade deficit, productivity, unit labor costs, the Markit services PMI, the ISM nonmanufacturing index, factory orders and a quarterly services survey. Read: Wages may spike higher in November jobs report and Wall Street won't like it Opinion: Trump's economy will boost wages The stat 6 million--That's how many Brits are using smart devices to snoop on loved ones, says a new survey from Direct Line Insurance. The survey showed nearly 4 million parents (13%) are already watching their offspring and eight million say they intend to do so. One in five surveyed said they'd happily spy on their cleaner or babysitter. Random reads The first presidential funeral train in nearly 50 years will carry George H.W. Bush\" s casket through several Texas towns CO2 levels hit an all-time in 2018, thanks largely to coal use in China Check out the 100 best songs of 2018 Cheap and simple test reveals if you any cancer cells anywhere Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern. Follow MarketWatch on Twitter, Instagram, Facebook. Providing critical information for the U.S. trading day. Subscribe to MarketWatch's free Need to Know newsletter. Sign up here. Barbara Kollmeyer Barbara Kollmeyer is an editor for MarketWatch in Madrid. Follow her on Twitter @ bkollmeyer. We Want to Hear from You Join the conversation Comment Related Topics U.S. Stocks Markets NY Stock Exchange NASDAQ"}, {"articleID": "2018052311_00111337_W", "names": {"Neil Graham": ["Q30506329", "Q6988647"], "Rosemary Barton": ["Q19955946", "Q24052788"], "Tom Elliott": ["Q16196918", "Q21461424", "Q7815715", "Q8952291"]}, "date": "2018-05-23", "url": "https://www.newsletter.co.uk/news/ni-teen-who-died-in-tractor-accident-is-named-locally-1-8508415", "content": "NI teen who died in tractor accident is named locally The incident happened in the Boho Road area of Enniskillen Published: 12:20 Wednesday 23 May 2018 Share this article Sign Up To Our Daily Newsletter Sign up Tributes have been paid to teenager from a well respected family in Co Fermanagh who lost his life in an accident involving a tractor yesterday. Named locally as <mark>Neil Graham</mark>, the 18-year-old was an apprentice mechanic. His father, Edward <mark>Graham</mark>, is involved in the Loyal Orders in the local area. Ulster Unionist MLA <mark>Rosemary Barton</mark> said: \"The family of the man are a very well respected and community orientated family, not only in the Garrison area, but far beyond. The tragic loss of a young life like this is unbearable to contemplate. The pain that the family must be going through is totally unknown to most of us .\" She continued: \"This young man had a great and bright future ahead of him, which has been cut short in heart-breaking circumstances .\" My heart goes out to his parents, and the entire family circle at this terrible time. \"The former Fermanagh and South Tyrone MP <mark>Tom Elliott</mark> said:\" It's a huge tragedy to the family. This is a young 18-year-old and it is almost unthinkable what the family is going through. \"They are a very well respected family in the wider community, not just in that local area. They are known right through the wider Fermanagh area and for something like this to come upon them - I can't bear to think what they are going through .\" The family are very community based and would have great relationships with everyone. They are very well liked, so obviously the communinty will be very upset and will want to come together to support them. \"There is a big family network as well and I am sure that will be a massive support to them, but at this stage they will feel great pain .\" <mark>Neil Graham</mark> is described in a death notice as the \"loving son of Joy and Edward .\" "}, {"articleID": "2011012420_00077699_W", "names": {"Gary O'Neil": ["Q11298220", "Q731946"], "Gordon Strachan": ["Q314095", "Q5585876", "Q5585877"]}, "date": "2011-01-24", "url": "http://dailystar.co.uk/latestsport/view/173468/Hammers-bid-for-O-Neil-accepted/", "content": "middlesbrough have accepted an undisclosed offer from west ham for midfielder <mark>gary o'neil</mark>. the teessiders confirmed that they have given the barclays premier league club permission to talk to the 27-year-old. a statement said: \"boro have accepted an undisclosed bid from premier league club west ham for midfielder <mark>gary o'neil</mark>. the hammers have been given permission to discuss personal terms with the former portsmouth man .\" <mark>o'neil</mark> joined boro in a?? 5million switch from portsmouth in august 2007 under former boss gareth southgate. he initially struggled to settle in the north-east and was linked with a return to the south coast on several occasions, but he eventually found his feet and was appointed captain as he established himself. however, boro's relegation from the barclays premier league and failure to win promotion at the first attempt have put ever greater pressure on the club's finances, and with little sign of a push for the top flight materialising this season, purse strings are having to be tightened. david wheater, who like <mark>o'neil</mark> was on premier league wages at the riverside stadium, joined bolton last week, and his former team-mate seems certain to follow him out of the exit door as the club hierarchy attempt to keep a tight rein on spending. current boss tony mowbray will also hope the sales will generate a transfer kitty for him to do his own rebuilding work with no cash left for new signings following predecessor <mark>gordon strachan</mark>'s shopping mission. <mark>o'neil</mark> could be set to team up with demba ba at upton park after the hoffenheim striker claimed he was joining the londoners until the end of the season. the 25-year-old said the two clubs had agreed a six-month loan deal."}, {"articleID": "2018080201_00172586_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2018-08-02", "url": "https://www.breitbart.com/national-security/2018/08/01/north-korea-our-society-is-the-best-in-the-world/", "content": "North Korea's state newspaper Rodong Sinmun published a column Wednesday urging North Koreans not to be enticed by other cultures or ways of life, insisting instead that the brutally repressive communism of the <mark>Kim</mark> family regime is the \"best in the world .\" The article is the latest in a string of propaganda pieces urging North Koreans to hang onto their austere communist ways and reject the \"cultural poisoning\" of the free world in anticipation of dictator <mark>Kim Jong-un</mark> announcing a refocus of his regime towards economic development. That shift has stalled as President Donald Trump has refused to lift sanctions on the country, citing its refusal to denuclearize. \"The DPRK [North Korea] is a socialist country which has been cherished in its people's mind as the benevolent bosom where they lead an independent and creative life and happiness of all generations is ensured for 70 years,\" Rodong Sinmun asserted in its column Wednesday. \"The Korean people have enjoyed the most dignified life in the bosom of the DPRK for 70 years .\" \"Our society is the best in the world as everyone enjoys happiness in very stable living condition, helping and leading each other though their life is not so luxurious and rich,\" the piece continues, touting \"the principle of collectivism\" as the key to the alleged success of the regime. \"Ordinary workers, peasants and intellectuals have become deputies to the Supreme People's Assembly to discuss state affairs and conduct free socio-political activities. This is a true picture that can be found only in the Korean-style socialist society .\" In reality, North Korea is one of the world's most impoverished countries and arguably the most repressive regime in the world. In contrast to the picture of equality that Rodong Sinmun alleges, the <mark>Kim</mark> regime divides society into castes in a system known as songbun. Those who exhibit the greatest loyalty to the <mark>Kim</mark> family, who are worshipped as gods, receive higher songbun, while anyone suspected of not being sufficiently loyal to the regime, harboring any religious faith at all, or sharing family ties with someone suspect loses songbun. Those of lower songbun may be banned from Pyongyang or forced to live in labor camps for generations. The claim that North Korean society is prosperous also belies warnings in state propaganda published as recently as last week that the nation might soon face even more poverty than it is used to. Rodong Sinmun suggested in an article last week that North Koreans should be prepared to sacrifice in the recent future, urging, \"even if (we) have to travel a long distance through snowstorms with our belts tightened, we will go straight to the people's road which was proved as immortal in the process of the 70-years-long struggle and to the road of socialism .\" Yet Rodong Sinmun continues to publish stories insisting that the <mark>Kim</mark> regime is not amenable to compromise in negotiations with the United States or South Korea. In another story published Wednesday, the state newspaper argued that \"a new mode of thinking\" is necessary in the government of Seoul to understand and accept that North Korea will not change. It decries negotiations with South Korea as \"not substantial\" and suggests that South Koreans want \"a comprehensive and great change in inter-Korea relations, not a partial change, and permanent reconciliation and peace, not a temporary escape from the phase of confrontation and danger of war .\" The article also demanded an end to unprecedented global sanctions weighing on the <mark>Kim</mark> regime. \"The anti-north sanctions are an unreasonable step taken by the U.S. and other hostile forces for the mere reason that the DPRK conducted self-defensive nuclear tests and ballistic rocket fires to defend peace and security from the aggression and war threat by outsiders,\" it argued. American officials have repeatedly stated that they will offer no sanctions relief to North Korea until the country completely, irreversibly ends its illegal nuclear weapons program. Instead, reports released this month suggest that North Korea has continued to attempt to manufacture long-range missiles. Secretary of State Mike Pompeo told Congress last week that the Trump administration has reason to believe North Korea is still producing fissile material, following the release of satellite images showing some activity at the nation's Yongbyon nuclear energy facility. This week, a report in the Washington Post suggested that images showed renewed activity at a facility in Sanumdong believed to have been the factory that created the Hwasong-15, a liquid-fueled intercontinental ballistic missile (ICBM) considered the most powerful in North Korea's arsenal. Follow Frances Martel on Facebook and Twitter."}, {"articleID": "2009030301_00026815_W", "names": {"Mike Singletary": ["Q1777632", "Q26706931"], "John York": ["Q1702240", "Q599443", "Q6265158"], "Jay Cutler": ["Q312811", "Q937778"], "Keith Lewis": ["Q20741693", "Q22096362", "Q6384649"], "Kevin Lynch": ["Q16229569", "Q16866666", "Q3814826", "Q6396809"], "Alex Smith": ["Q12720234", "Q16658140", "Q20011588", "Q2833039", "Q4717806", "Q4717807", "Q4717808", "Q4717809", "Q4717810", "Q4717811", "Q4717812", "Q4717814", "Q4717815", "Q4717818", "Q4717819", "Q57417658", "Q717897"], "Jason Taylor": ["Q16213806", "Q1684006", "Q24738395", "Q2786087", "Q6163606", "Q6163608"]}, "date": "2009-03-03", "url": "http://feeds.sfgate.com/click.phdo?i=3d1dee1256c52a3193b2f8ff7ff1f562", "content": "kurt coming to town so, it's on. with the bull-headed cardinals letting kurt warner slip into the free agency, the 49ers have a shot at stealing a potential hall of fame quarterback away from their chief rival. it could work. obviously, the 49ers have a desire to sign him, and they have $26 million of cap space in which to do it. if that does happen, offensive coordinator and head coach <mark>mike singletary</mark> would be smart to redress their offense into a form which suits warner, which means more passing, more multi-receiver sets, more shotgun formations. kurt warner doing what he does best. it doesn't mean the 49ers can't have a potent running attack, but to not take advantage of warner's skills would be to greatly miss an opportunity. but here's the other question, does the personnel the 49ers have suit warner? consider when he was at his best in st. louis and arizona, he teamed with the best receiving corps in the game at the time. when warner was with the giants relatively pedestrian receivers, he struggled. also, warner has said the reason he was so dynamic this past season was because he knew the offense. if warner has to go through a steep learning curve, expect the new <mark>york</mark> giants' warner, the guy who throws interceptions, gets sacked and fumbles. that's why it's so crucial that the 49ers approximate the offense of former arizona offensive coordinator todd haley if they can pull off the coup of signing him. email) | march 02 2009 at 10:35 am this story is great blog material but other than that...a complete waste of everyone's time. they should be spending the money on a hard hitting safety like jermaine phillips and a tackle like khalif barnes which both play into <mark>singletary</mark>'s defense first, smash mouth attack. then get a pash rusher in the draft unless they can trade back, get more picks and still pick up sanchez or stafford if they fall in the draft. kurt-o-claus is coming to town! i read somewhere that this kind of move indicates jed york is showing a new, more aggressive style of ownership! this will at least force the tards to up the offer to warner and eat cap space! good for jed! jimmy raye's best quality as a coach is finding a way to use his players the best way! he will be able to get warner going here too! no way warner signs here. he's a poor fit and really not what the niners need right now. this would certainly fall under the \"holy sheepsh! t' heading of fa signings. - go slim pickens!!! - it would be a stop-gap signing, but it would get them pretty far in the west this year. if they did do this, they would then have to address their line immediately. sign barnes and/or someone else (runyan? pace?) and draft a couple more guys. they could still go after e brown in the 1st round, but the 2nd and 4th round picks would have to be ots and maybe my guy from slo in the 3rd round - ramses. i would be crazy to say that bringing in kurt warner would be a bad thing. but i really like what we've got going with shaun and the power running philosophy that the niners are trying to implement. we finally have a coach who has a system in place that he wants to run for years to come. and to change that structure because of one player is risky. i say stick with what you have and bolster that defense and o-line through the draft. instead of kurt warner visiting, the 49ers should be getting <mark>jay cutler</mark> on the phone. apparently he can be had for a first. now your talkin primafacie! is there really evidence of that? we should jump on it! <mark>jay cutler</mark> is angry with the fiasco over the weekend when a three-way between denver, tampa bay and new england falling apart. it would have put matt cassell with the broncos, <mark>cutler</mark> in tampa and a first with the patriots. . buying opportunity. . i don't think signing warner would be a coup, especially at the price he'll command. as <mark>keith</mark> points out, he had very pedestrian years when he was throwing to average receivers. and do we really thing that johnny raye will be able to\" approximate \"todd haley's offense, even if <mark>mike singletary</mark> gave him the ok? aw man you had me excited but. ., we don't want to trade <mark>jay</mark>,\" mcdaniels said saturday. \"we never did. he's our quarterback .\" ...that was a compilcated deal, i don't think we can put together a package like that. mcdaniels was after cassell his ex qb...pmh9erfan...jimmy raye would be able to get the most out of having warner if we did get him!. why shell out all of that dough for a guy who will play one, maybe two seasons for us and be gone. . i could see why the jets did it...it was favre. . warner is no favre!. bad move imo.... posted by: kauairobert | march 02 2009 at 11:29 am regardless of what kurt warner did last season and when he was with the rams i have little to no faith in him as a football player and least of all as a quarterback. in both situations where he won he had the most ridiculous wide recievers in the game which took most if not all the pressure off of him at the qb position. he's an arena league qb parading as an nfl qb because when he succeeds all he has had to do is throw the ball deep and the amazing recievers just go get it. he can't scramble, he still holds the ball too long, and we want to run a power running offense. he doesn't fit the 49ers offensive plans, our offensive personnel doesn't fit warner and frankly <mark>singletary</mark> and warner together would be way too much god talk for the bay area. it's a step backwards for the 49ers who should be looking more at development of a qb than a has been who was never really a qb in the true definition of the word. they should be pressing denver hard for <mark>cutler</mark>. the pats already set the market at a 2nd round pick. hey <mark>kevin</mark> do we have to sign warner's wife to a contract too since she's the leader of the household and spokes woman for the warner family? - what a pathetic ownership we have here, it started from the automatic hiring of <mark>singletary</mark> with his 5-4 pristine record and without bothering to look at what was available, the hiring of raye and now warner. this ownership are not only a bunch of tight wod's but are clueless on how to run a winning nfl franchise properly. - but hey they're very lucky to have <mark>kevin lynch</mark> as their ambassador of spineless reporting and a whole lot of fans like unca_chuck who accept anything and just move on. if they were doing a reality show to see how far and gullible fans can be taken for a ride by their teams ownership then i'd understand but this is insanity and should be considered a crime. i'd be willing to bet that warner is in \"get paid\" mode. the cards rejected him and told him he wasn't worth 12-15 million a year. he thinks he is, and with all the wasted millions the niners throw around (see most recent signing), why not throw another couple mill at warner to get lienert prematurely playing, fitz frustrated, and the d's stacking the box against the cards' newly acquired running backs (in this year's draft). it's a win / win anyway you slice it, but this group of dumbies will screw it up six ways from sunday. pay warner a lot o' dough!!!! well, i'll be damned. if this comes to fruition, i'll have to come up with some new grocery clerk material. it won't be easy, but i'll do it. you guys can count on me. . good post bra!...~ aloha ~ here's a funny one...i was on the broncos website looking for <mark>cutler</mark> news...they have a picture of nolan up there hahahahahahahahaha if a qb is all this team needed to compete and win a championship, this would be the greatest day ever. but we need to be able to keep him upright and play solid d. i don't think we are there yet and would rather see ol and db addressed before we worry about a qb. hill will be just fine this year. we can address the qb \"need\" after the season when the rest are covered. in my opinion. - that is of course, unless they plan on bringing in an actual wr like tj...brmgd30! good post! there are actually people on here who think we should sign warner and draft a querterback with our #1 pick!!!! sheeesh...we might as well put 5 offensive tackles and 4 quarterbacks on the field every play! hey kauai! i agree, \"warner is no favre!\" but something tells me, both will end up in canton someday. bring back joe and steve! i'm always looking for conspiracies. i can't help but believe the rumors about vick, warner coming in, are for shaun hill. maybe sing wants to scare the pants off of him (so to speak) to become a true full season 1st string qb. maybe he's trying to soften the blow of kicking hill back to 2nd string (with <mark>alex</mark>, with <mark>cutler</mark>?). maybe he's setting the stage for getting sanchez. maybe it's just jerking the cards. i sure enjoy speculating...warner is in the niners complex now! he took a physical and is talking to our guys now! oh, that's what that lear jet flying over my house this morning was. i thought it was larry ellison again. no, no, no, no! did i fall asleep and wake up and the niners had an excellent, deep, wide receiver corps? and get a successful pass-blocking ol? kiss off rebuilding the lines if you sign warner. at least we know why scotty didn't splurge on fa so far. i just * hope * he's playing poker and raising the stakes for the cards. puh-lease...the biggest mistake the 49ers made was not going after gm scott pioli the braintrust of the new england patriots.now he's on his way to making the chiefs respectable again getting cassel for a 2d round pick a brillant move.does anyone think mcclueless could pull that off with <mark>jay cutler</mark> and denver? jayson <mark>taylor</mark> is now available for $8.5 mil. screw kurt warner (no offense, future hof), and take <mark>alex</mark> with you...warner as the starter with hill as his backup would be far better than hill with <mark>smith</mark>... (heaven forbid a <mark>smith</mark> with hill scenario). with warner, vd wouldn't have to catch with his fingers wide or low anymore, one of his key weaknesses as a pass catcher, because warner can hit him on the numbers every time. we haven't anybody with his kind of accuracy since joe and steve. the only problem would be that vd would be doing too much strutting around with his new found \"ability\". and then we could still draft e. brown (or sanchez as an apprentice qb if brown is gone) with the first pick. after looking it up, maybe <mark>jason</mark> is more interested in dancing now than his 6 pro-bowl appearances as a pass-rushing de. sing would change that in a hurry. reno, big, where are you? would he fit into a 3-4, or am i just blowing $8.5 mil worth of smoke again? \"we don't want to trade <mark>jay</mark>,\" mcdaniels said saturday. \"we never did. he's our quarterback .\". you believe him? josh mcdaniels was ready to dump <mark>jay cutler</mark> for matt cassell, which says how highly he thinks of <mark>cutler</mark>. sez here next year's no. 1 does it. here's my two cent opinion that i posted on the last thread. i just don't see warner on our team. i guess if we picked up holt, pace, and with bruce we could be the geriatric greatest show on grass. god, please don't let that happen. news flash - i just got off the phoe with a bud from high school. he let me know that the the most popular sporting goods store we used to shop at is being bought by dicks sporting goods. the place used to be called chick's. no word on whether it will now be called chicks with dicks! pursuing and then signing warner would have made all the sense in the world - if we still had martz. as is, i find the news tepid. i don't mind that martz is gone but hell, i would mind if we get warner and now no more martz to pair him up with. reno, what about <mark>jason taylor</mark>? this question's right up your alley, my good friend...the warner signing is great from two angles...first we get a great qb and stiff the cards and...wait for it...finally dump <mark>alex</mark> smiths 13 mill a contract for warners 13 mill a year contract so we break even and still have all the cap space to blow on another failure of a signing hey sidewinder - \"the greatest geriactic show on grass .\" that's good turf! add that, to my broken left hip. now we're talking! just you wait, i'm gonna beat next year in our fantasy football league. if i make it that long...i like <mark>jason</mark> tylor but don't know what he has left. i really don't know what to think. i'd be inclined to think he's not worth 8.5 mil. i also think if he is worth it mcsing will be calling. - i must get back to work but the chicks with dicks story is true. hey reno - chicks with dicks? you gave me the wrong 900 number again. posted by: del_mar_dennis | march 02 2009 at 01:51 pm reno, there used to be a biker bar about 5 miles from here on the road to my favorite city in the world, los gatos. played pool there - badly, but i wasn't a biker. sold, turned into a gay bar named \"friends\". never went there. didn't last long, i think bikers from all over the west kept showing up...jake2007 - if the 9ers do pick up warner, i certainly don't see them drafting a qb in the 1st round. a qb selected with the 10th pick would be earning as much as most starters in the league. as a reference point, joe flacco was taken 18th overall and got a 5-year, $30m deal. that's in 2008. you have to believe a guy like sanchez taken at #10 in 2009 would command something in the $7 - $8m range. combine that with the $14m/yr warner wants and the $2m/yr they're paying hill and you have the world's most expensive stable of quarterbacks. that said, maybe they'll spend a second day pick on a guy who won't wring them dry. hey reno - if you could promise me this, i'll make it up by draft day. *** if they do somehow end up with warner, the timimg would be awful screwy seeing as how martz left the building a while ago. would it mean we'd go after holt and pace? posted by: unca_chuck | march 02 2009 at 02:15 pm hey dennis - you'll make it. and i am sure it will be just a fun as last year. this is some crazy stuff with warner though. - asmith - like you said, if we could just flip-flop <mark>smith</mark> and warner's expected salary, so we could kick <mark>smith</mark> to the curb, without it costing too much, i'm all for it. - what in the wide wide world of sports is a goin on here?...where's the white women?...and where the hell are vernon \"aint gonna do ya no good no how\" davis's trade papers at? - kurt warner huh?...drop <mark>alex</mark> and give the $'s to kurt instead for two years, also screwing our \"newest\" division rival?...sounds good in theory so far:)... then we draft a qb somewhere on the third round to take the reigns over when warner's gone?...where does hill fit in? - he'd have to change his number out of respect to mr. warner:)... be his back-up...hmmmm...something will go wrong, sing might drop trow in front of kurts wife or something during the \"meeting\" - how'd you like that ass whoopin i put on ya in the nascar del:) - and p.s., why not take a flyer on <mark>jason taylor</mark>, seeing as we're not signing any ot's in free agency.... guess they like jennings? the entire charade about warner goes to show how unsettled <mark>singletary</mark> is on our back-up passing as a starter s. hill. let the ridculous <mark>alex smith</mark> go. pleeeze. go get <mark>cutler</mark>. he is lightyears better than any qb in this mediocre draft. if warner is signed look for bruce to stay!:) wow, v. a new record. your 12,983,036 post saying the same thing. - are you as tired of typing this sh! t as we are of reading it? apparently not. get a life. better yet, get a job. hey \"faithful! that's what i've been trying to tell these people...\"my name is jim, but most people call me...jim\" maybe you should eat something, first? \"no thanks. food makes me sick .\" \"a man drink like that, and he don't eat, he's gonna die .\" \"when?\" posted by: del_mar_dennis | march 02 2009 at 03:12 pm arizona today signed <mark>keith lewis</mark>. seems like a fair trade: <mark>lewis</mark> for kurt warner. damn chuck, was just thinking that v pretty much copy's and paste's his blogs:) - but \"v\" , you and i have had our words, just a couple of times...you seem to be bright, and yet you still are caught up in the past? - don't you \"feel\" something familiar with jed debartolo pulling the strings now? - yep, i said it...he's not <mark>john york</mark>! - a <mark>york</mark>, would not have the balls to send a private jet to phoenix to pick up kurt and the little mrs., then drive them around in a stretch limo to and from headquarters, the hostpital, etc. - it's a debartolo move...one his uncle eddy was famous for:)... the kids got balls, the want to win, he actually seems like he doesn't like losing (uncle eddy perhaps?) - he's going after a hall of fame qb (yes, he was a ram at one time) who i am sure you would rather have the ball in his gloved hands than anyone we've put out on the field since garcia right? - flow with it my guitar wielding friend, stop with the constant whining of the past, the yorks, nolan...this could be our division again!!!! - or, we could just be sheep being led down the yorks fiery path to hell:) - i got my $on little jed debartolo, seeing that he seems to have more of that blood running through his veins, than his no football knowing dr. daddy! - he aint acting like a <mark>york</mark>!!!!.... just sayin...but he also hasn't traded away vernon \"brickhouse\" davis yet either:)... so six in one hand, half dozen in the other...but it'd be nice to know warner was under center for the next two years, instead of doing another deal for the inaccurate <mark>smith</mark> right? move for the niners. last year he had the best receivers in the league and excellent protection--the niners would give him neither and he would be his old fumbling self. the only reason his signing is possible is because the niners are so stupid!!! jed and mcclueless--what a team--i pray to the most high that sf does not sign warner. three negatives: 1. we don't have the personal at wr. 2. we got rid of m. martz, which warner would be able to excel under. 3. we can't protect him, he's not mobile at all. thanks for the visit and then get lost kurt. the only reason dr. <mark>york</mark> was involved in the nfl at all was because of a couple incidents. eddie d. got booted out of league for his felony involvement southern gambling casinos (i don't remember, riverboat?). his sister denise took over. denise was clueless, but sure wasn't going to give up a $1 billion business that eddie made so much money on over the years. denise is married to dr. <mark>york</mark>. he has been running the team for years. we've seen how that's gone. jed's running the team now. with sing as hc. 391 king street west chatham ontario n7m 1g3 canada barefeet possess barefeet pictures of kurt warner posted by: bigred55a | march 02 2009 at 04:17 pm true, warner is no favre. favre only played in one super bowl, and sabotaged two teams on his way out to pasture. if kurt warner wants to be a 49er...sign him up!!!!! why would any team pass on kurt warner? he's one of the best in the nfl!!! why not? it's irresponsible not to. kurt warner can adjust to any offense and its personnel. he's a professional football player for christ's sake. we paid <mark>alex smith</mark> all that money for absolutely nothing!!!!! kurt warner is no <mark>alex smith</mark>. why any 49er fan would settle for the qb's we have already is beyond me. i want to win now. kurt warner gives us the best chance to win now...after the past 7-8 years why we want to postpone winning now for the future doesn't make any sense at all. gooooo kurt warner. and referencing his stint with the giants.... and when he first signed with arizona...his mechanics were changed...and he did what he had to do to be successful in this league...<mark>alex smith</mark> could learn from that. if it takes $14 million per to sign kurt warner, wouldn't that money be better spent on, say, <mark>jay cutler</mark>, a guy to build around? a 37 -, 38-year-old quarterback could go at any minute. chuck, actually the warner topic was just brought up only a few days ago and about you being a spineless, gutless and accepting everything and just moving on, i will continue to bring it up until you stop your puppet dangling ways. - faithful, the <mark>york</mark>'s hiring of <mark>singletary</mark>, raye and now warner happen not that long ago so please don't make it seem like i been talking about warner for years. with that said going after warner who's one hit away from being in a wheel chair isn't what i call a great free agent prospect and it's one out of many bad moves the <mark>york</mark>'s have made since their arrival. again if this happened to be a reality show the <mark>york</mark>'s were putting on to see how far they can take all the gullible 49ers fans for a ride before they said enough is enough well then i would understand. it's obvious it won't work with fans like you and unca_chuck because like v said before you'll accept anything including an all female 49ers team, flag football and much, much more and will never complain and will always have a smile. - when the last time the <mark>york</mark>'s went after a real free agent signing instead of the bottom of the barrel prospects? tell me i'm waiting...what bruce another person who's one hit away from being in a wheel chair himself. do you see a real winning organization like the patriots going after these bottom of the barrel players? no it's only the 49ers who are trying to penny pinch their way to a championship and in reality it doesn't work that way. what happened to you fans has your expectations falling so low that anything is better than nothing? an 8-8 season is your super bowl championship. has it got just that bad that your really don't expect much out of your team and any progress is better than none? these little moves and trades made by this pathetic ownership with the hopes it will lead us to a super bowl victory is pure insanity and you fans that buy into this nonsense and move on with balles chuck and his white flag of surrender is the real problem we face in america today. _ chuck, for v saying things as they really are and bringing out the truth i would prefer you calling me a raider fan or a nazi like most liberals do when they don't want to hear a mans point of view. \"favre only played in one super bowl...\"yeah, i know...would've edited if i could've. malcolm jenkins - 1st round ohio state don't get me wrong, i could live with raji. with <mark>taylor</mark>, you don't need brown. i want a safety. <mark>taylor</mark> gives an edge pass-rusher (from a 4-3)?. still doesn't solve the problem at nt, but, heck, it's just an idea. prima...with all due respect...warner only costs the 49ers money...it's not my money so i could care less really. <mark>cutler</mark> on the other hand will cost draft picks...we can't afford that at this stage of our\" progress \". and why would denver shop <mark>cutler</mark> anyway??? what have they observed that\" we \"haven't?? why do people keep bringing up <mark>cutler</mark>? that was always a 3-way deal that would reunite josh mcdaniels with cassell. the broncos were only willing to trade a franchise qb for a franchise qb. not to mention the fact that shaun hill has a better winning percentage than <mark>cutler</mark> (who i believe has more losses than wins as a starter). <mark>cutler</mark> is definitely not gonna happen and warner's a waste of money. could this possibly be a way for warner to leverage the cards for more money while we scare <mark>alex smith</mark> into giving us a lower restructured deal? in the end, t.j. houshmandzadeh's free-agency fling ended where it started: with the seahawks. houshmandzadeh, the top-rated receiver in free agency, decided monday afternoon to sign with the seahawks. the deal was first reported by espn.com, sighting multiple sources, and has been confirmed by the p-i. houshmandzadeh, who also was being wooed by the minnesota vikings and had an offer to re-sign with the cincinnati bengals, will sign what is believed to be a five-year, $40 million contract that includes $15 in guarantees. renoberger you killed me!!!!!!!!! i read the it's official he signed and...this time it's a player leaving the 49ers. defensive lineman ronald fields has signed a two-year, $5 million contract with the denver broncos, espn is reporting ....oh nobrain strikes again! now he can make fields look even less effective than he really is!"}]