[{"articleID": "2019020116_00542838_W", "names": {"Paul Davies": ["Q16669255", "Q21131684", "Q535733", "Q7150145", "Q7150146", "Q7150147", "Q7150148", "Q7150149", "Q7150150", "Q976254"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-02-01", "url": "http://www.gamereactor.eu/games/17281/Destiny/?sid=14b17f92d98cae8ec4f1b24e8040ac58", "content": "DESTINY REVIEW. Written by <mark>Paul Davies</mark> on the 26th of September 2016 at 10 \"It feels like the end of the road for Destiny before the true sequel. Having said that, it remains a road well worth travelling.\" 0 REVIEW. Written by <mark>Mike Holmes</mark> on the 21st of September 2015 at 14 \"It builds on the base game and improves it in almost every way, and while it might be pricey, it's an essential expansion for fans.\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of August 2017 at 15:09 DeeJ cleared the whole thing up for us. 0 NEWS. Written by Ford James on the 23rd of June 2017 at 17:08 But not if you plan to play on PC. 2 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2017 at 12:34 \"Our sole focus at this time is Destiny 2.\" 1 NEWS. Written by <mark>Sam Bishop</mark> on the 29th of March 2017 at 13:28 Reddit users spotted it."}, {"articleID": "2019040908_00454711_W", "names": {"Steve Collins": ["Q1337988", "Q16194486", "Q2346903", "Q48817948", "Q7612235", "Q7612236"], "Brian Hutton": ["Q55090000", "Q912381"]}, "date": "2019-04-09", "url": "https://www.irishtimes.com/news/crime-and-law/steve-collins-returns-to-limerick-10-years-after-son-s-murder-1.3854274?localLinksEnabled=false", "content": "<mark>Steve Collins</mark> returns to Limerick 10 years after son's murder Roy Collins was killed by members of the Dundon McCarthy gang in 2009 55 minutes ago Updated: 49 minutes ago <mark>Brian Hutton</mark> A file image of <mark>Steve Collins</mark>, father of Roy Collins who was shot dead in Limerick ten years ago, pictured with a photograph of him with his son. Photograph: Press 22 <mark>Steve Collins</mark>, father of murdered Limerick businessman Roy Collins, has moved back to the city to rebuild his family's life, he has said. The family fled Ireland in recent years to try and overcome the devastation wreaked on the them by gangland violence and intimidation. Mr Collins led a campaign, including street marches through Limerick, against the rampant criminality in the city and emigrated after testifying against members of the Dundon McCarthy gang who murdered his son in 2009. In October 2017, Wayne Dundon and Nathan Killeen, who are serving life sentences for the murder, had their convictions upheld by the Court of Appeal. Exactly ten years to the day of the killing of 35-year-old father-of-two Roy at the Coin Castle amusements arcade they ran at Roxboro Road in Limerick, his father said it was time to build a new life for his other son Steven in their home city. \"There is inward investment all the time now (in Limerick), we have the hanging gardens and the likes of that here now,\" he said. \"We have invested heavily in a bar here, my son Steven runs it. Father of murdered Roy Collins hopes others will give evidence\" We are trying to rebuild our lives, trying to rebuild Steven's life, to give him something to hold on to. We were comfortable in this city before all this came on our door, then we were destroyed and devastated in every way - this is a rebuilding thing now. \"Mr Collins said he remains\" haunted \"by his ordeal.\" It never leaves you...you never expect it to come into your life, the horrific way it happened, \"he said.\" It's a loss you never get over, nobody ever gets over losing a child - it doesn't matter what age they are. We are just happy to be moving on now. \"Mr Collins praised the support of the people of Limerick who came out onto the streets in solidarity with his family when they began their campaign against gang violence.\" It gave us the impetus to move on and talk to politicians and campaign to get the law changed. I think we've achieved that with the 2009 Justice Act, \"he said.\" I think Limerick is a different place. When we came back we noticed it how things have changed. The investment is coming into the city now. That wouldn't happened back in the day, in 2009. \"For such a small city, it was crazy. To get change, it is heartening.\" Mr Collins told RTÉ Radio's Morning Ireland the change came at a huge cost to his family and the stress has \"put an awful burden\" on their health. \"We relocated to try rebuild our lives again, but it was tough, we always wanted to come back in Limerick. We sacrificed an awful lot for this city.\" It took the people of Limerick to stand up and say \"we are sick of this\" , he said, to bring about the changes. \"I'm just so happy it happened...this didn't just help Limerick - it helped the whole country.\" "}, {"articleID": "2017061707_00294928_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"]}, "date": "2017-06-17", "url": "http://www.arkansasonline.com/news/2017/jun/17/how-about-showing-dj-little-respect-201/", "content": "How about showing DJ little respect? a A Font Size PHOTO BY AP/CHRIS CARLSON Defending U.S. Open champion <mark>Dustin Johnson</mark>, the world's No. 1 player, won't repeat after missing the cut by three shots at Erin Hills on Friday. <mark>Johnson</mark> played the tournament's first eight holes in 3 over in the opening round and never recovered. As <mark>Dustin Johnson</mark> approached his ball buried in the tall grass on the 17th hole at Erin Hills, a fan standing just a few feet away offered a little pick-me-up to the world's No. 1 player. \"You got a nice bounce off my arm, Justin,\" the fan said proudly as he patted his right arm. Justin? It was that sort of day for <mark>Johnson</mark>, who either didn't notice the misspeak or didn't care, because by that point the first round in defense of his 2016 U.S. Open title was already headed the wrong direction. Starting on the back nine, he double-bogeyed 14, bogeyed 15 and was on his way to wasting a birdie at 16 with the errant drive on 17 that would lead to yet another bogey. Three over in four holes isn't a blueprint for disaster for the average golfer--like, for example, the guy in the gallery who just called the best player in the world by the wrong name--but it's a death knell at this U.S. Open. Just a few holes ahead, Rickie Fowler had four birdies on his front nine, another three on the back side for a 7-under 65. Even though <mark>Johnson</mark> played even-par golf the rest of the way to finish with a 3-over 75, it still left him 10 strokes back after the first round. \"Where I went wrong is when I laid it up in the hay,\" <mark>Johnson</mark> said matter-of-factly after his round, referring to his brutal 14th. \"Got it on the green and three-putted for double. A great hole I played there.\" And just like that, the prohibitive favorite coming in was already on the ropes. By the time <mark>Johnson</mark> walked off the green on his final hole, 44 players were under par. He did better Friday, but not good enough, despite getting to the 1-over cut line after a birdie on 12. Bogeys on 13, 14 and 17 knocked him out of the tournament. He finished with a 1-over 73, a two-round total of 4-over 148. The race is on Olympic legend Michael Phelps is probably the greatest that's ever been in the water. Well, for a human. According to a news release from Discovery Channel, Phelps will race a great white shark as part of Shark Week on July 23. \"They are one of the fastest and most efficient predators on the planet: Sharks,\" the release said. \"He is our greatest champion to ever get in the water: Michael Phelps. 39 world records. 23 Olympic golds. But he has one competition left to win. An event so monumental no one has ever attempted it before. The world's most decorated athlete takes on the ocean's most efficient predator: Phelps V Shark--the race is on!\" Phelps is going to have his hands full. According to Jennifer Kennedy of ThoughtCo.com, sharks cruise at around 5 mph, but great whites can reach north of 25 mph if they're in attack-mode. \"Their swimming speed is 10 times faster than the typical human swimmer,\" Kennedy wrote. Phelps was clocked at 6 mph by ESPN.com at the height of his overwhelming success in 2010. The distance and the shark's state of mind will certainly play a role in the race. Phelps, 31, went cage diving with some great whites last weekend, perhaps scouting out his competition: Phelps will also take part in another Shark Week project, Shark School, which will \"dispel the myths and common misconceptions\" about the beasts. That puts Phelps on the first and last days of Shark Week. Sports on 06/17/2017"}, {"articleID": "2012111513_00029902_W", "names": {"Annette Groth": ["Q16151744", "Q78330"]}, "date": "2012-11-15", "url": "http://businessspectator.com.au/bs.nsf/Article/Greek-protesters-break-into-conference-23DSP?opendocument&src=idp", "content": "greek protesters break into conference 17-nation eurozone slips into recession spain risks missing deficit cut targets for 2014 anti-austerity strikes launched across europe parties \"gun-shy' on tax reform: oakeshott china officially confirms xi jinping as next president paperlinx suffers\" first strike' on pay asia the key to australia's future success: gillard 17-nation eurozone slips into recession bartholomeusz: myer eyes a christmas miracle greek protesters break into conference aap dozens of anti-austerity protesters have broken into a conference centre in northern greece and clashed with police. the protesting municipal workers pushed and threw coffee on a german diplomat who arrived to attend the conference of greek and german mayors being held in the city of thessaloniki. they later forced open shutters and entered the conference center, where they clashed with riot police. a german deputy labour minister who has been appointed special envoy to greece, hans-joachim fuchtel, was also attending the event. \"these people haven't come here to help us, but to announce our death sentence,\" said themis balasopoulos, leader of greece's municipal workers union, who was at thursday's demonstration. the protesters chanted \"nazis out\" and \"this will not pass\" as they tried to obstruct municipal officials from attending the conference. germany is the biggest contributor to greece's rescue loans and has been one of the most vocal advocates of the tough austerity measures demanded of athens. as a result, protesters in greece often target germany in their demonstrations. last month, around 50,000 people demonstrated in athens when german chancellor angela merkel paid her first official visit to greece since the country's massive debt crisis broke out. she expressed support for the conservative-led government's efforts to limit high budget deficits. the greek parliament last week passed a new austerity package that bailout creditors had demanded in exchange for paying out more rescue loans. the package raised the retirement age and cut pensions and raised taxes. it has also has eased restrictions on firing workers. in a chaotic scene on thursday, riot police chased protesters through the conference centre complex from building to building. there were no immediate reports of arrests. the protesters played nazi anthems over loud speakers, as well as greek radio recordings from world war two. left-wing german mp <mark>annette groth</mark> joined the protesters outside the conference centre, where clashes with riot police also occurred. to contribute your comments for possible publication, please list being compiled. please try again later. contact details business spectator 22 william street melbourne victoria 3000 australia fax: +61 (0) 3 8624 3088 info @ businessspectator.com.au office hours: mon - fri 9:00 am - 5:00 pm copyright? 2012 business spectator pty ltd. all rights reserved. * * * you must have javascript enabled to use this form * * * free website. it is a requirement of some of our content providers that users register their email address and agree to the copyright terms. it's quick and easy. once registered you have access to all our articles immediately, as well as our customisable tools including email alerts. you must enter the information highlighted below in red. morning briefing: overnight, national and international financial and business news kgb dossier: the best business commentary and analysis from kohler, gottliebsen and bartholomeusz. afternoon update: latest industry and market news delivered after the market closes. eureka report free subscription: as part of our exclusive partnership with eureka report we are delighted to offer you a complimentary 21 day membership. eureka report, australia's number 1 investment report. webinar invitations: listen live and free to australian and international experts as the discuss a variety of different finance and business strategies while you ask your questions live."}, {"articleID": "2020021216_00292035_W", "names": {"Ann Lewis": ["Q2850402", "Q4766506", "Q58416597"]}, "date": "2020-02-12", "url": "https://www.kmuw.org/post/after-iowa-debacle-lefts-tech-experts-say-dems-need-strategic-shakeup", "content": "After Iowa Debacle, Left's Tech Experts Say Dems Need A Strategic Shakeup By Laurel Wamsley • 55 minutes ago Share Tweet Email After the messy reporting of the Iowa caucus results, some who build tech for progressive causes say the approach to software development in this space needs rethinking. Daniel Acke / Bloomberg via Getty Images Democrats could avoid another tech meltdown like the one that afflicted the Iowa caucuses with a better strategy for building the tools they need, progressive technology specialists say. The origins of the Iowa debacle are in a boom-and-bust cycle that places technology in competition with other priorities as time-crunched campaigns grapple with how best to spend as they hurtle toward an election. \"The easy way to spend money, that's reliable, is on advertising,\" says Evan Henshaw-Plath, a technologist who has built applications for progressive causes and was an early employee at Twitter. \"Spending money on technology is riskier and may or may not pay off.\" When campaigns commence, they hire staff, open offices, buy ads. When the campaign ends, the contracts end and the offices close. Code that is written is often abandoned and forgotten. \"We're rebuilding everything from scratch each cycle for everything that isn't finance and compliance,\" Henshaw-Plath says. \"We aren't funding organizations that can survive from one cycle to the next,\" he adds. \"We aren't funding the technology to be maintained from one cycle to the next. And we aren't releasing the code in a maintainable way and picking up again on the next cycle.\" Light falls on Shadow After the Iowa caucus, the spotlight swung to Shadow, the small tech company that built the glitchy application precinct chairs were supposed to use to report results. Shadow's primary business is operating two applications for the progressive movement: a messaging product and a data integration tool. The caucus app's lackluster performance brought scrutiny of the connections between Shadow, its main investor Acroynm, and various figures and campaigns in the Democratic Party. Such connections are no surprise in this corner of the tech world: It's common practice for Democratic candidates and Democratically-aligned causes to use political tools and technologies developed specifically for the left. There are essentially separate, parallel universes of tech vendors that develop tools for either Democrats or Republicans--but not both. \"It is a pretty deeply held value within the progressive community that you want to put your money where your values are,\" says Brady Kriss, the founder and executive director of Ragtag, a company that corrals tech workers who want to volunteer their skills to help progressive causes. \"It's not just about political competition. You don't want your money in any way, directly or indirectly, to go towards supporting issues or candidates that you find morally problematic.\" Some tech experts have pointed out that popular mainstream applications like Google Forms might have been a better choice for Iowa, rather than relying on a custom-designed app built on a small budget under time pressure. Using products already in wide commercial use has another benefit: they're likely to be supported and maintained. \"If you're building on top of that, you don't have to worry about that infrastructure,\" Kriss says. \"That really helps with the cyclical nature of campaigns and campaign tech. Because it's very, very hard to keep a small application like a phone app or a large database base application updated when every other year, no one cares.\" Building beyond the campaign cycle Advocates and entrepreneurs have tried to target the boom-bust dynamic. Higher Ground Labs--a venture capital firm with the mission of supporting progressive tech companies \"for experimentation and iteration that's no longer dependent on election dates\" --was an investor in the company went on to become Shadow. But <mark>Ann Lewis</mark>, chief technology officer for MoveOn.org, says that cyclical fundraising cycles continue to affect progressive tech vendors. One particular challenge she's noticed: A lot of the money for tech arrives in September, just two months before a November election. \"That's often not enough time to really take advantage of the surge of funding in software teams,\" she says. What more money often buys is more staff--but adding engineers to a tech project only a few months before launch actually can hinder the team's speed and efficiency, <mark>Lewis</mark> says. Recurring donations can smooth out spiky funding. But when it comes to structural change, <mark>Lewis</mark> has one big request: open source software, frameworks, and collaboration spaces. Open source software means anyone can access and build on the code. The most common place for developers to share their code and collaborate is the online platform Github. If political tech developers did make more software open source, <mark>Lewis</mark> says they might be able to break free from election-driven peaks and valleys--and sustain applications long enough to make them relevant for more than one campaign cycle. \"Not all projects will be successful and not all projects will live forever. There's a constant evolution in the frameworks and tools that we use to build any kind of software,\" she says. \"But I think investing in open source early is a way to let the best software rise to the top and live past that campaign horizon.\" Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email"}, {"articleID": "2011051208_00062097_W", "names": {"Angela Knight": ["Q4762477", "Q532835"]}, "date": "2011-05-12", "url": "http://insidermedia.com/insider/north-west/52302-back-new-investment-urges-bibby", "content": "last updated: thu 12th may, 2011 | time: sir michael bibby, managing director of liverpool conglomerate bibby line group, has called on the banking community improve its \"logic on lending decisions\" . speaking at the better business finance event at liverpool's radisson blu hotel he told the audience now was the time to back new investment. \"during the boom we sold ships - a cyclical sector - and invested in assets that were non-cyclical such as costcutter,\" he said. \"now we are going to the banks saying\" give us money to buy cheap assets' but they are very cautious on loan to value rates, offering 50 per cent instead of 80 per cent, for example. \"but this is the wrong way round. because assets are cheap the risk is lower - the banks should be lending more, not less. the logic on lending needs to be more disciplined through the cycles. we will see more foreign banks coming into the market unless our own lenders become more active.\" bibby said his financial services business, which accounts for a largest chunk of the? 1.2bn-turnover empire, grew 20 per cent last year with the bad debt profile \"the best it's been for 17 years\" . he also revealed the company had explored the option of buying a bank to expand into the sector but walked away from the deal due to the level of capital required against any deposits. he warned corporates that lending margins would remain high due to the capital adequacy ratios now being enforced on banks and said they should plan for the worst and look to pay down debt in the face of an uncertain refinancing market. bibby added that a two-tier lending system - where many small companies were unable to meet the criteria of a good track record and a strong balance sheet - were not being helped by the centralisation of credit decision making in the banks. he called for a return to local decision making, giving relationship managers in the region more say in their ability to finance companies, and aid the process of assessing risk and lending more into the market. <mark>angela knight</mark>, chief executive of the british bankers' association said the industry had \"collectively stepped up to the table for change\" through a reformed culture, better management and the raising of extra capital. \"we have made these changes very publicly and very noisily,\" she said, before adding that there \"was more to come\" . but she also told the audience \"we won't build the right future if we dwell on the past\" ."}, {"articleID": "2014102318_00013300_W", "names": {"Alex Gordon": ["Q16025008", "Q16136145", "Q25352122", "Q37583452", "Q4717069", "Q4717072", "Q997395"], "Michael Morse": ["Q1093315", "Q6832934"], "Billy Butler": ["Q2747753", "Q4912305", "Q4912309"], "Ichiro Suzuki": ["Q27997082", "Q57064719", "Q5986296", "Q600"], "Paul Nelson": ["Q21062490", "Q7152694", "Q7152695"]}, "date": "2014-10-23", "url": "http://ktvn.com/story/26875662/at-1-all-world-series-moves-to-quirky-giants-park", "content": "meta content = \"2014-10-23 17:59:20\" > 911 calls show chaos after Delaware tour bus crash 911 calls show chaos after Delaware tour bus crash Emergency calls made by passengers and passing motorists capture the chaos, fear and confusion in the aftermath of a tour bus crash in Delaware that left three people dead. Emergency calls made by passengers and passing motorists capture the chaos, fear and confusion in the aftermath of a tour bus crash in Delaware that left three people dead. meta content = \"2014-10-23 17:39:20\" > CDC details new Ebola response and prep teams New federal Ebola response squads - likened to public health SWAT teams - are being readied to rush to any U.S. city where a new Ebola case might be identified, officials say. New federal Ebola response squads - likened to public health SWAT teams - are being readied to rush to any U.S. city where a new Ebola case might be identified, officials say. meta content = \"2014-10-23 16:19:21\" > Theater shooting prosecutors agree to trial delay Theater shooting prosecutors agree to trial delay Prosecutors say they would agree to push back the trial for the man charged in the Colorado theater shootings so defense attorneys can have more time to review his sanity exam. Prosecutors would agree to push back the trial for the man charged in the Colorado theater shootings so defense attorneys can have more time to review his sanity exam, according to court filings released Thursday. meta content = \"2014-10-23 17:09:21\" > Woman who stabbed pencils in eyes sues over photo Woman who stabbed pencils in eyes sues over photo A woman who stabbed pencils in her eyes during a suicide attempt is suing Los Angeles County, claiming her photo was snapped at a hospital and went viral online. A woman who stabbed pencils in her eyes during a suicide attempt is suing Los Angeles County, claiming her photo was snapped at a hospital and went viral online. meta content = \"2014-10-23 13:49:15\" > Driver attacked after ice cream truck kills boy Driver attacked after ice cream truck kills boy Authorities say a 7-year-old boy riding a motorized bike was hit and killed by an ice cream truck in South Los Angeles and residents then attacked the driver. An ice cream truck ran over and killed a 7-year-old boy riding a motorized bike in South Los Angeles and residents then attacked the driver, authorities said. A Maine mother who's using social media to have her son's ashes scattered all over the world has sent him on his greatest journey yet: to space. A Maine mother who's using social media to have her son's ashes scattered all over the world has sent him on his greatest journey yet: to space. meta content = \"2014-10-23 13:49:14\" > Prosecutors: Michigan girl meant to kill family Prosecutors: Michigan girl meant to kill family Prosecutors say a 15-year-old Michigan girl stabbed her 12-year-old brother and conspired to kill other family members so she could run away with her 23-year-old boyfriend. A 15-year-old girl accused of stabbing her younger brother as part of a plot to kill her family so that she could run off with a 23-year-old man appeared in a suburban Detroit courtroom Thursday, where a judge set her bond...meta content = \"2014-10-23 15:19:18\" > US journalist returns home after Ebola recovery An American video journalist who recovered from Ebola is home in Rhode Island. An American video journalist who recovered from Ebola is home in Rhode Island. meta content = \"2014-10-23 08:59:05\" > Massive cheating scandal at UNC involved athletes Bogus classes and automatic A's and B's are at the heart of a cheating scandal at the University of North Carolina that lasted nearly two decades, encompassing about 3,100 students - nearly half of them...Bogus classes and automatic A's and B's are at the heart of a cheating scandal at the University of North Carolina that lasted nearly two decades, encompassing about 3,100 students - nearly half of them athletes. meta content = \"2014-10-23 15:59:26\" > Eric Frein lookalike: I've been stopped repeatedly Eric Frein lookalike: I've been stopped repeatedly A northeastern Pennsylvania resident said he's been stopped and questioned more than 20 times by authorities who have mistaken him for a man sought in the killing of a state trooper, including one encounter at...Dancing priests become Internet sensation Dancing priests become Internet sensation as singing nun releases first album Dancing priests become Internet sensation as singing nun releases first album Obama expresses optimism about Ebola in US Obama says he's cautiously more optimistic about Ebola situation in US Obama says he's cautiously more optimistic about Ebola situation in US North Korean detainee reunites with family in Ohio American detained half a year in North Korea returns to Ohio, has tearful reunion with family American detained half a year in North Korea returns to Ohio, has tearful reunion with family One American released from North Korea, two remain American detainee released in North Korea; two others remain American detainee released in North Korea; two others remain Indiana serial murder suspect arrested Police in Indiana say deaths of 7 women could be serial killing; suspect hints at more victims Police in Indiana say deaths of 7 women could be serial killing; suspect hints at more victims Dallas nurse with Ebola transferred to Maryland Obama names Ebola \"czar' to run widening US response to the disease as criticism mounts Obama names Ebola\" czar' to run widening US response to the disease as criticism mounts Sources: Biden son out of Navy after drug test AP sources: Biden's son discharged from Navy Reserve after testing positive for cocaine Quiet \"whiz kid' from New York suburb, CDC's Frieden now the public face of US Ebola fight Quiet\" whiz kid' from New York suburb, CDC's Frieden now the public face of US Ebola fight US still searching for credible allies in Syria Bombs not enough: US faces a heavy challenge in building an anti-IS Syrian ground force Second Texas nurse tests positive for Ebola; woman flew home from Cleveland before falling ill AP Baseball Writer SAN FRANCISCO (AP) - Eric Hosmer is eager to see what makes San Francisco's waterfront ballpark unique. \"I know absolutely nothing,\" the Kansas City first baseman said. \"I've heard nothing but good things about it, the atmosphere and the energy the crowd brings. I've always wanted to play there.\" \"I'm sure going for the first time for a World Series game, it should be fun,\" he said. Well, wait until he trips over a bullpen mound chasing a foul ball. Or a teammate loses a fly in the mist that wafts above shallow center. Or those swirling winds turn a routine popup into an all-out scramble. Who knows? Might even get a crazy carom off that odd-shaped brick facade on the right-field wall, resulting in the first Series inside-the-park home run since 1929. Yep, loads of fun. Hosmer, <mark>Alex Gordon</mark>, Mike Moustakas and most of the Royals will get their first look at quirky AT & T Park during a workout Thursday. Then it's on to Game 3 on Friday with Kansas City and the Giants tied at 1-all. Tim Hudson starts for San Francisco against Jeremy Guthrie. The Royals' only trip to San Francisco came in 2005 and they took two of three. Buddy Bell was the manager, Tony Graffanino batted third and Jeremy Affeldt was in the bullpen. The 35-year-old Affeldt now pitches for the Giants and came on in relief Wednesday night in a 7-2 loss. He said he figured the Royals could handle the new park. \"That's an athletic team over there. So I think they can make adjustments. I don't think we'll go in thinking that they're at a disadvantage because of not being at our ballpark,\" he said. About one-third of the Royals have played at AT & T Park with other teams. Of the most frequent visitors, Josh Willingham has hit .352 with five homers in 16 games and Omar Infante has batted .307 in 19 games, STATS said. Among the pitchers, Guthrie did fine in two starts and Jason Frasor made two relief appearances. Outfielder Lorenzo Cain played one game at the stadium in 2010 when he was with Milwaukee. The AL Championship Series MVP plans to practice with coach Rusty Kuntz to \"work on my angles and see how the park plays.\" \"It's kind of a work in progress and a wait-and-see type thing,\" Cain said. Good luck, Giants designated hitter <mark>Michael Morse</mark> said. \"It's a big park; right field is tricky. The wind does a lot of different things in the outfield, so our guys are used to it,\" he said. \"It's tough. It's tough out there. But everybody's a professional. I don't think it will be a factor,\" he said. One thing will change, for sure. With no DH in the NL park, <mark>Morse</mark> and Kansas City's <mark>Billy Butler</mark> will lose their spots - <mark>Morse</mark> drove in a run during a 7-1 win in the opener, while <mark>Butler</mark> already has three hits and a pair of RBIs. With tight foul ground, gusts that whip off McCovey Cove, twilight starts and pesky seagulls that hover around in the late innings, a lot of balls become adventures in San Francisco. In 2007, <mark>Ichiro Suzuki</mark> hit the first inside-the-park home run in an All-Star game when his shot off the right-field wall took a weird ricochet. There have been nine inside-the-parkers in World Series play. Lou Gehrig and Casey Stengel are on the list, and Mule Haas of the Philadelphia Athletics hit the last one in 1929. Plus, postseason is frequently a weather adventure in the Bay Area. Players need to pack for all sorts of conditions - short sleeves, hoodies, hats and gloves. During the NLCS, Giants manager Bruce Bochy said the teams played in the toughest winds of the season. Right fielder Hunter Pence had no chance trying to track a fly ball by St. Louis' Kolten Wong that landed for a triple. \"You play this game, you play in a lot of different ballparks and you find a way to adjust,\" Pence said this week. \"I think everyone's going to enjoy it.\" Moustakas was looking forward to the trip. Raised in Southern California, the Royals third baseman has seen AT & T Park only on television. \"I don't know anything about it,\" he said. \"It looks like a beautiful park. I've always wanted to see it, and this is a great opportunity to go there.\" ___ AP Baseball Writer Janie McCauley contributed to this report. The Reno-Sparks Convention Visitors Authority's board members say they like the job their CEO is doing and they're willing to put their money where their mouth is. The RSCVA board voted Wednesday to reward authority president and CEO Chris Baum with a 16 percent bonus worth nearly $37,000. The Reno-Sparks Convention Visitors Authority's board members say they like the job their CEO is doing and they're willing to put their money where their mouth is. The RSCVA board voted Wednesday to reward authority president and CEO Chris Baum with a 16 percent bonus worth nearly $37,000. meta content = \"2014-10-22 18:41:57\" > Game Wardens Seek Information on Six Elk Shot, Left to Rot Game wardens at the Nevada Department of Wildlife are seeking the public's help to solve the illegal killing of at least six elk, including four cows and two calves, in two different incidents in Lincoln County. Game wardens at the Nevada Department of Wildlife are seeking the public's help to solve the illegal killing of at least six elk, including four cows and two calves, in two different incidents in Lincoln County. meta content = \"2014-10-22 23:29:39\" > Reno Police Arrest Man for Unlawful Contact With a Minor Reno Police have arrested a man they say approached young girls riding a bicycle in the area of Damonte Ranch. Reno Police have arrested a man they say approached young girls riding a bicycle in the area of Damonte Ranch. meta content = \"2014-10-23 11:52:35\" > Opponents of Question 3 Spend Over a Million Dollars Corporations and business interests are digging deep to fund a drive to defeat a Nevada ballot measure that would tax commerce to fund education in a state near the bottom nationwide in per-pupil spending. A Center for Public Integrity analysis made public Thursday finds opponents of Question 3, the Education Initiative, have spent more than $1.2 million on television ads. Corporations and business interests are digging deep to fund a drive to defeat a Nevada ballot measure that would tax commerce to fund education in a state near the bottom nationwide in per-pupil spending. A Center for Public Integrity analysis made public Thursday finds opponents of Question 3, the Education Initiative, have spent more than $1.2 million on television ads. meta content = \"2014-10-22 20:43:17\" > Reno police officers practiced the PIT maneuver on Wednesday. It causes a suspect's vehicle to spin out during a pursuit - and reporter <mark>Paul Nelson</mark> got a firsthand look. KTVN-TV Phone: (775) 858-2222 Fax: (775) 861-4298"}, {"articleID": "2015110819_00108566_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Charles Barkley": ["Q192707", "Q5077040"]}, "date": "2015-11-08", "url": "http://theblaze.com/the-wire/36657245/good-not-spectacular-preliminary-ratings-for-trump-on-snl/", "content": "Good, not spectacular, preliminary ratings for <mark>Trump</mark> on SNL Nov. 8, 2015 2:22 pmNEW YORK (AP)--<mark>Donald Trump</mark> hadn't gotten far into his opening monologue before trouble occurred. An off-screen heckler interrupted with a cry of \"You're a racist!\" But the \"heckler\" was comedian Larry David, who before <mark>Trump</mark> arrived onstage had been seen impersonating Democratic presidential hopeful Bernie Sanders. \"Larry, what are you doing?\" <mark>Trump</mark> asked with a trace of exasperation. \"I heard if I yelled that, they'd give me $5,000,\" said David with a shrug, echoing an offer made publicly by one of the Hispanic groups protesting <mark>Trump</mark>'s appearance. \"As a businessman,\" <mark>Trump</mark> told him, \"I can fully respect that.\" <mark>Trump</mark>'s 90 minutes in the \"SNL\" spotlight followed weeks of growing anticipation, increasingly sharp criticism and mounting calls for him to be dropped from the show. But the Republican presidential candidate hosted Saturday's \"SNL\" as scheduled. And, at least in NBC's Studio 8H, there was no more unrest--orchestrated or otherwise. (Deport Racism, the group that made the $5,000 offer, tweeted that David would get the bounty, \"joke or not.\" ) Only hours after the broadcast, <mark>Trump</mark> was back on television and characteristically bullish about his performance, calling it \"very well received and probably got very good ratings, who knows.\" Very good, but not spectacular. Preliminary Nielsen ratings measuring households in 56 U.S. markets gave Saturday's \"SNL\" its highest rating only since January 2012. Basketball great <mark>Charles Barkley</mark> was host that night. Full results, including viewership figures, will be released Thursday, NBC said. <mark>Trump</mark> also told CNN's \"State of the Union\" that some sketches were cut because there were \"a little risque.\" He did not go into details. During his monologue, <mark>Trump</mark> promised his hosting appearance would be \"something special,\" while noting that many people had asked him why he accepted the gig. He said they had told him, \"You're brilliant, you're handsome, you're rich. The world is waiting for you to be president. Why?\" His answer: \"I had nothing better to do.\" \"But part of the reason I'm here,\" he added, \"is to show I can take a joke.\" In one sketch, <mark>Trump</mark> was willing to mock his penchant for tweeting insults about people with whom he differs. \"I hate to break it to you guys,\" he told viewers, \"but I'm not going to be in the next sketch.\" Instead, off-camera, he live-tweeted comments that were flashed on the screen about \"SNL\" cast members performing a skit: \"Cecily Strong is not a nice person.\" \"Kate McKinnon was born stupid.\" \"I love SNL...SNL loves me. But everyone in this sketch is a total loser who can bite my dust.\" Another sketch imagined <mark>Trump</mark> in the Oval Office in 2018--two years into his presidency--savoring his many successes. By then, Syria is at peace. China is borrowing money from the U.S. <mark>Trump</mark>'s real-life daughter, Ivanka, is the administration's secretary of the interior, and announces the Washington Monument will be covered with gold. Did it all sound too good to be possible? \"If you think that's how it's going to be when I'm president, you're wrong. It's going to be even better,\" <mark>Trump</mark> said, addressing the audience. \"I said to the writers of this sketch,\" Keep it modest .' \"His preference, he insisted, was to keep expectations low for his presidency and not overpromise. Until Saturday, just eight politicians had served as guest hosts in the NBC sketch comedy series' 40 years. Only one of those--the Rev. Al Sharpton, in 2003--was actively involved in a presidential bid at the time. (Hillary Rodham Clinton appeared in last month's season premiere, but not as the host .) The star turn granted <mark>Trump</mark> fanned the flames of outrage sparked in June when he announced his Republican candidacy for president and described some Mexicans who are in the United States illegally as criminals and rapists. Hours before the show's live broadcast, dozens of protesters marched from <mark>Trump</mark> Tower to NBC's studio in Rockefeller Plaza, chanting in both English and Spanish and carrying signs. In Spanish, they chanted:\" The people united shall never be defeated \"and signs declared SNL racist.\" I feel like they're giving him a platform, \"said Hazel Hernandez, 26, who emigrated from El Salvador and now lives in Brooklyn.\" I'm an immigrant myself, so I'm pretty outraged. I've been in this country for many years, and I'm outraged that they would let him host SNL. It's upsetting. \"<mark>Trump</mark>'s comments last summer spurred NBC to sever its Miss Universe ties with him while declaring he would never return to his\" Apprentice \"role. But leading up to Saturday's broadcast, NBC did not respond to accusations that it had reversed itself, or to the outcry against <mark>Trump</mark> that had built since\" SNL \"announced his host booking last month. Typically outspoken, <mark>Trump</mark> welcomed the controversy, predicting it would only boost his audience. It wasn't <mark>Trump</mark>'s first turn as guest host. The billionaire developer and media personality presided in April 2004, a few weeks after he debuted as host of NBC's\" The Apprentice. \"This time, while <mark>Trump</mark> demonstrated once again that he could take a joke, he was running for president. The sketches--both with and without him--seldom let the audience forget it. ___ Associated Press writers Kathleen Hennessey in Washington and Katie Park contributed to this report."}, {"articleID": "2014060313_00064907_W", "names": {"Tom Lee": ["Q16233960", "Q29425405", "Q7816555"]}, "date": "2014-06-02", "url": "http://newswise.com/articles/view/618738/?sc=rsmn&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Breaking News Channels provide a rapid response to major news events. Novel NextGen Sequencing Test Developed for Retinoblastoma Test identifies germline mutations of gene responsible for childhood eye cancer 6/2/2014 5:10 PM EDT Source Newsroom: Contact Information Available for logged-in reporters only Newswise - Researchers at Children's Hospital Los Angeles (CHLA) have developed a unique next-generation sequencing test for the gene linked to retinoblastoma. The new approach is both more comprehensive and can be conducted in less time than existing tests - enabling early detection of the cancer's genetic cause, which is critical for optimal treatment outcomes. The test was developed to serve the needs of the Retinoblastoma program at CHLA's Vision Center, one of the largest clinical programs in the U.S., caring for approximately 20% of the nation's retinoblastoma cases and seeing as many as 50 new patients each year. Retinoblastoma - a malignant cancer of early childhood that arises from immature retinal cells in one or both eyes - can start growing at any time before birth up until about seven years of age. Among infants and children, common signs of this cancer include having a white \"glow\" or \"glint\" in the pupil of one or both eyes, the presence of a white pupil in a color photo, or crossed or misaligned eyes. Early detection is vital because, when left untreated, retinoblastoma can result in blindness or death. In germline cases, the disease causing mutation is present in cells throughout the body resulting in tumors in both eyes, as well as in other locations throughout the body. Therefore, early detection and accurate diagnosis are critical for determining the best course of treatment. A team of physicians and scientists from the Department of Pathology and Laboratory Medicine's Center for Personalized Medicine, working with clinicians and surgeons from the Vision Center, developed the CHLA retinoblastoma next generation (RB1 NextGen) sequencing panel based on deep DNA sequencing technology, using novel technical and bioinformatics methodology to sequence the entire RB1 gene. Conventional genetic testing for retinoblastoma typically involves sequencing of specific hot spots within the gene where there are known to be numerous mutations. When CHLA researchers set out to develop their own laboratory-derived test, they took a very different approach in order to sequence the entire gene from end to end. \"Typically, we have used NextGen sequencing capability to sequence many genes at a relatively low depth of coverage\" explained Alexander Judkins, MD, FRCP, head of the Department of Pathology and Laboratory Medicine. \"Our team took a very different approach by deciding to look at a high depth of coverage of a single gene, sequencing through the entire gene, which is technically very difficult to do.\" With the existing NextGen sequencing approach for retinoblastoma, there are regions of genes that do not get examined at all, potentially allowing significant data to be missed, added Timothy Triche, MD, PhD, Director of the Center for Personalized Medicine at CHLA. \"New data tells us that the non-coding DNA is extremely important. And one of the strengths of our approach is in examining those non-coding areas.\" By sequencing the whole gene, researchers are able to see more frequent occurrences of germline mutations of the RB gene. Because germline mutations can be passed on, this knowledge can better inform the correct treatment approach for patients when these mutations are identified. \"We used to think that if a child had a tumor in one eye and not in the other eye, it was a result of a somatic mutation. And because somatic carriers don't pass on mutated genes, we believed removal of the tumor stopped the cancer,\" says <mark>Tom Lee</mark>, MD, Director of the Vision Center at CHLA. \"But now we know that there is a percentage - on the order of 10 to 15% of those children who had an apparent somatic mutation - who are actually carrying a germline mutation, putting them at risk of developing subsequent tumors during adolescence or early adulthood.\" <mark>Lee</mark> said that the ability to determine the existence of RB1 germline mutations early has significant implications - not only for the prognosis of a new patient with retinoblastoma, but for siblings who could also be at risk and eventually for a patient's own children, if a germline mutation is detected in a retinoblastoma survivor that could be passed on to future generations. With a legacy of treating hundreds of children with retinoblastoma, CHLA now has the ability to also offer this unique and comprehensive screening test to survivors of the disease or their family members, as well as to patients at other cancer centers. \"We believe that siblings and children of carriers of the germline should be tested immediately after birth because by detecting the gene mutations early can save a patient's vision,\" says <mark>Lee</mark>. Approximately two-thirds of retinoblastoma patients at CHLA have unilateral cases of RB, or cancer in just one eye. While only 15% of cases will test positive for a germline mutation, physicians must treat all patients as though the cancer could potentially be bilaterial, or present in both eyes, a condition commonly associated with having a germline mutation. \"Historically, genetic testing can take up to three or four months-which is a very long time when a child's health is at stake,\" said Jonathan Kim, MD, director of the Retinoblastoma Program at CHLA. \"Doing our tests faster and on site has the potential to significantly improve treatments outcomes for all of our patients.\" \"This test enables our researchers to look at the RB1 gene more comprehensively,\" says Judkins. The collection of new genomic data on RB1 will hopefully enable basic researchers to translate this material into biologically meaningful insights, leading to earlier detection and new treatments for both primary and recurrent disease. \"Heath care providers interested in the new RB1 NextGen Sequencing test may contact the Laboratory Service Center of the Department of Pathology and Laboratory Medicine at Children's Hospital Los Angeles by calling KIDZ LAB (877-543-9522) or 323 361 2423. About Children's Hospital Los Angeles Children's Hospital Los Angeles has been named the best children's hospital on the West Coast and among the top five in the nation for clinical excellence with its selection to the prestigious U.S. News & World Report Honor Roll. Children's Hospital is home to The Saban Research Institute, one of the largest and most productive pediatric research facilities in the United States. Children's Hospital is also one of America's premier teaching hospitals through its affiliation since 1932 with the Keck School of Medicine of the University of Southern California. For more information, visit CHLA.org. Follow us on Twitter, Facebook, YouTube and LinkedIn, or visit our blog: WeTreatKidsBetter.org."}, {"articleID": "2012071310_00037971_W", "names": {"Wayne Smith": ["Q16041132", "Q16106464", "Q16623073", "Q3566861", "Q3566866", "Q59210874", "Q7221890", "Q7976620", "Q7976622", "Q7976623", "Q7976624", "Q7976626"]}, "date": "2012-07-13", "url": "http://foxnews.com/us/2012/07/12/parents-accused-locking-girl-in-chicken-coop-forcing-her-to-wear-shock-collar/?test=latestnews", "content": "samual and diana franklin are seen in an undated photo provided by the taylor county, ga., sheriff's office. ap/taylor county sheriff office butler, ga. - a georgia girl told investigators she spent days at a time locked inside a small outhouse and a chicken coop, and had to wear a shock collar because she didn't do her school work, authorities said thursday. the 15-year-old girl's parents, samuel and diana franklin, were arrested earlier this week on multiple counts of child cruelty and false imprisonment. they were released on bond, and declined to comment as they left the courthouse thursday for what appeared to be a custody hearing. \"i've never seen anything like this personally,\" said special agent <mark>wayne smith</mark> of the georgia bureau of investigation. \"if the allegations prove to be true, it's a very severe case.\" the girl was adopted around 2007 and home-schooled in a house outside the small town of butler, about 85 miles south of atlanta, according to <mark>smith</mark>. the franklins live on a rural stretch of road sprinkled with a few homes and cow pastures. the house is surrounded by a split-rail fence with prominent \"no trespassing\" signs at the entrance of the driveway. the girl told investigators she spent up to six days at a time in the small buildings in the back of the property as punishment for such things as failing to complete her school assignments, <mark>smith</mark> said. she said she had been put in the buildings for at least the past two years. the outhouse was about 4 feet in length and width, and just a few feet high, <mark>smith</mark> said. \"it was just big enough to sit in,\" <mark>smith</mark> said. the red chicken coop was much larger than the outhouse and chickens were being kept there thursday. the girl \"might come out during the day a little bit, come in and shower,\" <mark>smith</mark> said. a neighbor refused to speak with an associated press reporter and told him to leave the property. the investigation began may 25, when child welfare agents, acting on a tip, visited the home with the sheriff's department. that same day, juvenile court judge <mark>wayne</mark> jernigan sr. ordered the teen removed from the home. <mark>smith</mark> said he believed the franklins were in court thursday for a custody hearing. he was not aware of the outcome, and court officials refused to answer questions about the hearing. on tuesday, when the parents were taken into custody, investigators found a dog collar on a table in the home, <mark>smith</mark> said. the girl told investigators its shock function was operated by a radio signal with a device similar to those used to lock and unlock cars remotely. it was being examined at a crime lab. the girl lived at the home with another sibling, while two other siblings are older and lived away from home. the charges involve only the 15-year-old girl, <mark>smith</mark> said, and there are no allegations of abuse involving the other three children. a spokeswoman for the state department of family and children's services said state law prevented her from answering questions about the case. after the girl was removed from the house, <mark>smith</mark> said she began to open up to investigators. \"kind of what has happened is within a few hours of being taken out of that environment, a lot of this began to flow very freely,\" <mark>smith</mark> said. \"you almost have to remove the person from the threat of punishment before they begin to open up to you. that's normal, and that's what has happened here.\" print email share comments recommend tweet related stories police looking for boyfriend of mom accused of abusing daughter, 10, by locking her in closet nd man charged with homicide in wis. daughters' deaths; all 3 had \"sharp force injury' to neck share this article newsletter signup sign up for free e-mail news alerts from foxnews.com and foxbusiness.com. newsletter signup view article you must login to comment. view article"}]