[{"articleID": "2013052101_00016286_W", "names": {"David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "John Jones": ["Q10502076", "Q16089943", "Q16151785", "Q1829452", "Q19360718", "Q20733490", "Q22116791", "Q23022440", "Q40744539", "Q47123953", "Q47467135", "Q47545673", "Q51588437", "Q56187543", "Q56187544", "Q56274376", "Q56597672", "Q56597777", "Q56604622", "Q56678613", "Q6241998", "Q6242049", "Q6242052", "Q933190"]}, "date": "2013-05-20", "url": "http://www.shropshirestar.com/education/2013/05/20/wrockwardine-wood-arts-academy-in-telford-celebrates-80th-anniversary/", "content": "Wrockwardine Wood Arts Academy celebrates 80th anniversary Former pupil <mark>David Wright</mark> MP prepares to cut the cake Current staff and pupils at Wrockwardine Wood Arts Academy organised the event to mark the milestone. And town MP <mark>David Wright</mark>, who left in 1983, and Joyce Rowding, who started in 1936, were two of the star guests. The school in New Road opened in 1933 and has steadily grown in size over the years, with more than 600 pupils now on the roll. Telford MP Mr <mark>Wright</mark>, who was born and raised in the town, said he was delighted at being invited to cut the anniversary cake. He said: \"I am so glad to be back celebrating the 80th anniversary of my school. I left in 1983 and today really has brought the memories flooding back .\" It is great to see so many people who have attended the school over the years coming back for the anniversary to share their memories. \"Great-grandmother Mrs Rowding, now of Donnington, admitted Saturday had been the first time she had returned to the school since she attended there in the 1930s .\" It is the first time I have been back and I couldn't believe it. I hardly recognise the place, so much has changed, \"she said .\" My children and their children also attended here, so three generations of my family have passed through the doors over the years. \"Widow Mrs Rowding, who has five children, 17 grandchildren and\" at least as many \"great-grandchildren, helped out on the Home Front in various factories during the Second World War after leaving school before going on to work as a home help. Headteacher <mark>John Jones</mark> said it was especially important to celebrate the anniversary with the historic school buildings due to be bulldozed in the next couple of years as part of a? 200 million improvement programme across the borough. Pupils are due to move to a new site next to Oakengates Leisure Centre in a merger move with nearby Sutherland School. In the run-up to the event on Saturday, pupils and staff launched a website and appealed for past pupils to tell them about their memories in a bid to piece together a history of the school. Mr <mark>Jones</mark> said:\" I have been absolutely delighted by the commitment of all the students, teachers, parents and governors in organising this very special event. \"Everyone who has been involved with it can feel very proud indeed and when you see how many past students have turned out to join us it makes it all worthwhile .\" Music teacher Ben Millington has played a leading role in piecing together the history of the site. He said: \"We would still like to appeal to people to go on to our website, sign our guestbook and tell us about their memories and share old pictures. We know about how the school started and we obviously know about the present but there are still a lot of gaps in between, particularly from the 1950s to the 1980s .\" The event featured performances by the senior choir, pupil rock and pop bands and also soloists. Teacher Rob Star bravely put his head on the block by asking pupils to pay for the privilege of throwing a wet sponge at him, while there was also a variety of stalls in the school playground. More than 300 past and present pupils of a Telford school, including an MP and an 88-year-old woman believed to be its oldest surviving pupil, turned out to celebrate its 80th anniversary. Staff and children at a Shropshire nursery are celebrating after being commended by education inspectors. A series of events aimed at encouraging \"Lifelong Learning' has been launched at one of Shropshire's leading schools as part of a new community involvement initiative. Telford College's new engineering centre to fill the skills gap"}, {"articleID": "2014091307_00006491_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2014-09-13", "url": "http://www.denverpost.com/rss/ci_26523122?source=rss", "content": "Traditional (Provided by Arch-Interiors) Back in my college days, I wrote a paper called \"From Fiction to Nonfiction: Writing Along the Continuum .\" I looked at writing's extremes, from fantasy-rich fiction to stripe-straight reporting, with stopovers at essay, memoir, humor and opinion writing. I did this for selfish reasons. If writing were to be my future, I wanted to write it all - facts, lies and everything in between. (Hence this column: I wanted to know the rules so I could break them .) I feel the exact same way about decorating: I don't like to feel pigeonholed. So was I thrilled with a recent conversation I had with a high-end-high-style designer friend who walked me through the design continuum, and said I could, in fact, have it all - just not all at once. \"Home décor runs the gamut from antique-filled traditionalism to stark modernism,\" Christopher Grubb, president of Arch-Interiors, in <mark>Beverly Hills</mark>, told me. \"If traditional is all about embellishment, zz and modern is about clean lines, you can't have both together. Can you?\" I asked. His short answer: Yes, kind of. But you must blend with care. Grubb told me about two stopovers on the design continuum between traditional and modern: transitional and contemporary. \"Some people find it relaxing to come home at the end of their work day to clean lines, so they find modern interiors relaxing,\" said Grubb. \"Others find them too sterile, and prefer their surroundings embellished by decorative arts .\" Those folks veer toward traditional. \"And some can't decide,\" I say. \"I tell those clients design is a language,\" said Grubb. \"When they gravitate toward an item that isn't going to fit, I say,\" Yes, that's great, but that's Chinese and we're speaking French .' \"\"And those hybrid interiors you promised me?\" \"They're bilingual,\" said Grubb, who then pinned down the hallmarks of traditional and modern interiors, and their bilingual hybrids, transitional and contemporary. Syndicated columnist and speaker Marni Jameson is the author of \"House of Havoc\" and \"The House Always W ins\" (Da Capo Press). Contact her through marnijameson.com. Transitional (Provided by Arch-Interiors) Contemporary (Provided by Arch-Interiors) Interiors considered contemporary are the next stop up the continuum. They're decidedly more modern, but not purely so. \"The lines, and furniture shapes are modern, but the rules relax as comfort becomes important,\" said Grubb. Furniture fabrics are more comfortable than those in a modern interior, and here you may encounter chenille or a cotton print. In contemporary spaces, color, which is largely absent in modern interiors, can be featured on an accent wall or on pillows (used sparingly), other small furnishings, or in a collection of vases. \"However, you won't find carved wood, nor will you see a nod to antiquity. Rugs are geometric or tone on tone. Art will lean toward the abstract, though the look also might include an ethnic piece, like an African mask. 4. Modern These interiors are all about clean lines. They feature metal finishes, sleek surfaces, and zero excess. Think chrome, leather, glass, stone, and highly finished wood .\" Furniture is usually more sculptural and may not look comfortable, \"said Grubb .\" It's very Bauhaus and Le Corbusier. Spaces feel very museum-like. \"We reserve the right to remove any comment we feel is spammy, NSFW, defamatory, rude, or reckless to the community. We expect everyone to be respectful of other commenters. It's fine to have differences of opinion, but there's no need to act like a jerk. The Rockies are flirting with history, and in this instance that is not a good thing. Rick Upchurch's return includes induction into Broncos' Ring of Fame"}, {"articleID": "2020010917_00227815_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2020-01-09", "url": "https://www.plymouthherald.co.uk/news/uk-world-news/mps-extra-month-year-3722692", "content": "Sign up to FREE daily email alerts from PlymouthLive - Daily Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing See our privacy notice Invalid Email MPs will get a whopping 64 days off this year - the most since 2014 and an increase of a month from 2019. Leader of the House of Commons Jacob Rees Mogg said that his colleagues will take a two-week break next month. Something that they weren't allowed to do last year due to the impending Brexit deadline. The Commons will be in recess for 64 working days this year - not including conference season and the Christmas break, which has yet to be announced, reports the Mirror Online. The bumper breaks mean Boris Johnson will have to fewer sessions of Prime Minister's Questions and ministers won't have as many departmental questions sittings. It will give Parliamentary committees less time to scrutinise Government decisions through the year. Last year the Commons was in recess for just 46 working days, excluding the dissolution for the General Election. Read More Related Articles Prince Harry and Meghan Markle removed from Royal Family display at Madame Tussauds Read More Related Articles Sainsbury's issue urgent product recalls over allergy fears The Prime Minister faced criticism last week after failing to appear in public for 12 days, despite Britain facing a growing international crisis over <mark>Donald Trump</mark>'s Iran air strike. Both the Summer and Easter recesses are a full week longer than 2019. At 35 working days, MPs summer holiday this year will be the longest since 2009. Many MPs use the recess to catch up on constituency work - but they are free to use the time as they wish. The average holiday entitlement for British workers is 33.5 days. And even this wasn't enough for one Tory MP. Early May's bank holiday has been moved from May 4th to May 8th to coincide with VE day commemorations. Read More Related Articles Baby names that could help your child earn big money Read More Related Articles Meghan Markle and Prince Harry \"will be punished' for quitting royal duties But former minister Karen Bradley urged Mr Rees-Mogg to make both days bank holidays, because it might\" adversely affect \"weddings, sporting fixtures and civic events. She said:\" Perhaps he might consider whether it might be in the spirit of a new, forward-looking Britain that we might have a second bank holiday in May, and reinstate that Monday as well as have the Friday. \"\"There is a great cost to bank holidays and I think the chances of having another one, though we all like to have a day of, are relatively slim, so I wouldn't want to build up my right honourable friend's hopes .\" "}, {"articleID": "2019111010_00069891_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2019-11-10", "url": "https://www.geo.tv/latest/255654-charlize-theron-honoured-with-american-cinematheque-award", "content": "Charlize Theron honoured with American Cinematheque Award By AFP Sunday Nov 10, 2019 Charlize Theron was honored for a \"fearless' career for tackling sexual harassment long before the #MeToo movement up-ended the industry. Photo: Frazer Harrison / Charlize Theron was honored by Hollywood Friday for a\" fearless \"career in which she tackled themes including sexual harassment long before the #MeToo movement up-ended the industry. The 44-year-old South African Oscar-winner, who has often played down her flawless looks to win darker, more complex parts, collected the prestigious American Cinematheque Award at a <mark>Beverly Hills</mark> gala .\" I'm overwhelmed--I need a cocktail! \"she told AFP as stars including Kristen Stewart, Seth Rogen, and David Oyelowo gathered to honor her career .\" These people who are here tonight have been with me through a lot of stuff. \"Theron won the best actress Academy Award in 2004 with her turn as prostitute and serial killer Aileen Wuornos in Monster. She earned Hollywood's respect with a visceral performance which saw her pack on 30 pounds (14 kg) and render herself unrecognizable with makeup and prosthetics to play the unappealing murderer .\" She is the most fearless actor I've ever worked with, and probably the most fearless human being I've ever met, \"said Jason Reitman, who directed Theron in Young Adult and Tully. Next month Theron appears in another transformative role--as former TV anchor Megyn Kelly in Bombshell, which depicts the downfall of Fox News co-founder Roger Ailes after a sexual harassment scandal .\" When I read (the script) it felt like it was part of a conversation that was happening now. And that to me, felt really important, \"she said. In contrast, her 2005 turn as a miner who files the United States' first class-action sexual harassment lawsuit in North Country came at a time when Hollywood turned a blind eye to such issues. Back then there was a sense that sexual harassment\" was in the past and that it's been dealt with, \"said Theron. The part earned her a second Oscar nod. A decade later, the #MeToo movement swept through Hollywood. Theron was born in the small South African town of Benoni in 1975. When she was 15, her mother shot and killed her father after he attacked them in a drunken rage. Her mother was never charged. Theron arrived in Los Angeles as a teenager in the 1990s speaking only broken English--her first language is Afrikaans. She was discovered by a talent scout in a bank, and broke into Hollywood's elite with The Devil's Advocate (1997), alongside Keanu Reeves and Al Pacino. Theron has since mixed commercial films such as the Fast and Furious franchise with tougher, less conventional roles. The American Cinematheque Award is a\" mid-career achievement award, \"with previous honorees including Al Pacino, Tom Cruise, and Steven Spielberg."}, {"articleID": "2020011919_00030191_W", "names": {"Steve Young": ["Q16185674", "Q18818306", "Q30122679", "Q4356818", "Q55634010", "Q740086", "Q7614385", "Q7614386"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}, "date": "2020-01-19", "url": "https://www.sfgate.com/news/us/article/Bad-Boys-for-Life-debuts-so-good-with-box-14988009.php", "content": "BREAKING NEWS How the 49ers brought <mark>Steve Young</mark> back into the fold 8:52 AM 8:52 AM The Raiders left Oakland. The 49ers want to take it. Kittle causes descent into syrup-chugging madness on NFL Network 10:01 AM 10:01 AM Jimmy G's backpack says a lot about him, teammate explains 10:28 AM 10:28 AM Back in playoffs, 49ers fans get nostalgic for Candlestick https: //www.sfgate.com/news/us/article/Bad-Boys-for-Life-debuts-so-good-with-box-14988009.php \"Bad Boys for Life' debuts so good with box office top spot Jonathan Landrum Jr., Ap Entertainment Writer Updated 10:47 am PST, Sunday, January 19, 2020 LOS ANGELES (AP)--Two\" Bad Boys \"were too good for one\" Dolittle \"at the box office .\" Bad Boys for Life \"starring <mark>Will Smith</mark> and Martin Lawrence brought in $59 million in the U.S. and Canada to score a No. 1 debut entering the Martin Luther King Jr. holiday weekend. The action-packed, buddy comedy returned for the franchise's third installment after a 17-year hiatus with popular demand to outlast\" Dolittle, \"starring Robert Downey Jr., which opened at second with a mediocre $22.5 million. Sony Pictures predicted that\" Bad Boys \"<mark>will</mark> make around $68 million over the four-day weekend. The film exceeded expectations, building momentum with favorable reviews including an A Cinema Score and a 76% rating on Rotten Tomatoes .\" It's a great brand with two terrific stars, a beloved franchise and it feels like summertime in January, \"said Paul Dergarabedian, senior media analyst for Comscore. He said it was a smart move by Sony Pictures to release the film during January, an unusual month for blockbusters releases but it ultimately\" reaped huge benefits. \"\"Dolittle\" barely topped the World War I film \"1917,\" which claimed the top spot last week. The Sam Mendes-directed war film continues to hold strong with $22.1 million this weekend after going from 11 screens in its first weeks to more than 3,600. The Oscar-nominated epic wartime film has gained popularity after it won Golden Globes for best director and drama film a couple weeks ago. Saturday night, it won an award for theatrical motion picture at the Producers Guild Awards, which has gone on to win best picture Oscar 21 out of 30 times, including the past two years. \"' 1917' is really taking a lot of the oxygen and taking on a life of its own since the Oscar nominations and all of these awards,\" Dergarabedian said. \"If you haven't seen\" 1917,' you're totally out of the loop for awards season. \"Along with\" Bad Boys, \"Sony Pictures has two other films in the top 10 at the domestic box office including Oscar-contender\" Little Women \"and\" Jumanji: The Next Level, \"which crossed $700 million worldwide. In another blockbuster,\" Star Wars: The Rise of Skywalker \"topped $1 billion globally after five weeks. The Disney's film focusing on the final chapter of the Luke Skywalker saga has also earned more than $492 million domestically. Estimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to Comscore. Where available, the latest international numbers for Friday through Sunday are also included. Final domestic figures <mark>will</mark> be released Monday. 1 .\" Bad Boys for Life, \"$59.1 million. 2 .\" Dolittle, \"$22.5 million. 3 .\" 1917, \"$22.1 million. 4 .\" Jumanji: The Next Level, \"$9.5 million. 5 .\" Star Wars: Rise of Skywalker, \"$8.3 million. 6 .\" Just Mercy, \"$6 million. 7 .\" Little Women, \"$5.9 million. 8 .\" Knives Out, \"$4.3 million. 9 .\" Like A Boss, \"$3.8 million. 10 .\" Frozen 2, \"$3.7 million. ___ Follow AP Entertainment Writer Jonathan Landrum Jr. on Twitter: http: //twitter.com/MrLandrum31 Most Popular 1 The Raiders left Oakland. The 49ers want to take it. 2 Adorable Bay Area home with ocean view only $800K--with a catch 3\" Unconditional love': Wife speaks after husband dies in avalanche 4 How the 49ers brought <mark>Steve Young</mark> back into the fold 5 \"Dopes and babies': Inside Trump's tirade against generals 6 Manteca school bus driver put on leave after frightening ride 7 Stanford University student found dead in campus residence 8 Conor McGregor blasts Cerrone in 40 seconds in UFC return 9 Person walking along I-280 in SF struck, killed 10 Minerva's Sunday Horoscope: 1/19/20 11 Berkeley police warn of increase in catalytic converter thefts 12\" Oh no, not again': Remembering SFO's epidemic of plane hijacking 13 Harry, Meghan to quit royal jobs, give up \"highness' titles 14 49ers QB Jimmy Garoppolo's backpack says a lot about him 15 The best place to eat in the Presidio is ending food service View Comments © 2020 Hearst Communications, Inc. ."}, {"articleID": "2015022023_00049455_W", "names": {"Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"], "Marky Mark": ["Q164119", "Q55753348"]}, "date": "2015-02-20", "url": "http://www.comicbookmovie.com/fansites/JoshWildingNewsAndReviews/news/?a=115541", "content": "SPIDER-MAN: 31 Year Old Donald Glover Is Done Campaigning To Play 14 Year Old \"Miles Morales' Back in 2010, Donald Glover campaigned hard for the role of <mark>Peter Parker</mark> in Donald Glover has been a fan-favourite choice to play Spider-Man for years now, with even The Amazing Spider-Man star Andrew Garfield even backing him to one day take over the role. While there's every chance that Marvel Studios and Sony Pictures will turn to him to play <mark>Peter Parker</mark> in Captain America: Civil War and the 2017 reboot, a lot of fans are rooting for him to take on the role of Miles Morales (despite being years too old). He does voice the character on TV though. Yahoo! Movies caught up with the Community star, they asked him to weigh in on whether or not he's still interested in playing Spider-Man .\" Of course, I would always be honored to play Spider-Man, \"he said .\" But I just want the Spider-Man movie to be dope, that's all I want. \"As for his intentions to campaing for the role again, he added:\" I'm leaving it to them. Campaigning's part of life, but for me, I've got a lot of stuff that I'm really excited about, and dropping it all...of course it'd be an honor. But it's fine, if it comes, if not. \"What do you think of these comments? DISCLAIMER: This article was submitted by a volunteer contributor who has agreed to our Think this article is front page worthy? [frick] Miles Morales. Oh, wait. I take this [frick] back. damn, who would have thought that geeks could be such racist pieces of shit...I guess if you choose <mark>Marky Mark</mark> as your Avatar (a celebrity that was convicted f a hate crime), what else could we expect. SPIDER-MAN: 31 Year Old Donald Glover Is Done Campaigning To Play 14 Year Old\" Miles Morales' BATMAN v SUPERMAN: Just How Close To The Comics Is Jason Momoa's \"Aquaman' Look? SPOILER WARNING: Here's What\" Aquaman' Gets Up To In BATMAN v SUPERMAN Latest DAREDEVIL Image Reveals A Major Tie To AGENTS OF S.H.I.E.L.D."}, {"articleID": "2018052318_00158869_W", "names": {"Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Kim Jong Un": ["Q14045951", "Q56226"], "Raj Shah": ["Q1274250", "Q29043436"]}, "date": "2018-05-23", "url": "http://mysanantonio.com/news/politics/article/The-Latest-Pompeo-says-bad-deal-on-N-Korea-not-12937273.php", "content": "Text \"NEWS' to 77453 for Alerts Officials: Motorcyclist skidded hundreds of feet after I-35 crash S.A.-area race unfolds against unknown Texas Rangers probe https: //www.mysanantonio.com/news/politics/article/The-Latest-Pompeo-says-bad-deal-on-N-Korea-not-12937273.php The Latest: White House team off to Singapore for prep work Updated 1:20 pm, Wednesday, May 23, 2018 window. _ taboola = window. _ taboola | | []; _ taboola. push ({mode:\" thumbnails-c', container: \"taboola-interstitial-gallery-thumbnails-4', placement:\" Interstitial Gallery Thumbnails 4', target_type: \"mix'}); _ taboola. push ({flush: true}); Photo: Evan Vucci, AP Image 1 of / 4 Caption Close Image 1 of 4 President Donald Trump boards Air Force One for a trip to New York to discuss immigration policy, Wednesday, May 23, 2018, in Andrews Air Force Base, Md.. Trump will hold a roundtable discussion on Long Island on illegal immigration and gang violence that the White House is calling a\" national call to action for legislative policy changes. \"less President Donald Trump boards Air Force One for a trip to New York to discuss immigration policy, Wednesday, May 23, 2018, in Andrews Air Force Base, Md.. Trump will hold a roundtable discussion on Long Island...more Photo: Evan Vucci, AP Image 2 of 4 Secretary of State Mike Pompeo looks over his notes as he waits to testify at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. Secretary of State Mike Pompeo looks over his notes as he waits to testify at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 3 of 4 Secretary of State Mike Pompeo, center, is greeted by Chairman Rep. Ed Royce, R-Calif ., left, and Ranking Member Rep. Eliot Engel, D-NY ., right, before testifying at the House Foreign Affairs Committee hearing on Capitol Hill in Washington, Wednesday, May 23, 2018. less Secretary of State Mike Pompeo, center, is greeted by Chairman Rep. Ed Royce, R-Calif ., left, and Ranking Member Rep. Eliot Engel, D-NY ., right, before testifying at the House Foreign Affairs Committee hearing...more Photo: <mark>Pablo Martinez</mark> Monsivais, AP Image 4 of 4 The Latest: White House team off to Singapore for prep work 1 / 4 Back to Gallery WASHINGTON (AP)--The Latest on the United States and North Korea (all times local): 2:10 p.m.. A White House team is heading to Singapore this weekend to work on logistics for President Donald Trump's planned summit with North Korean leader <mark>Kim Jong Un</mark> (<mark>kim</mark> jawng oon). Trump cast doubt Tuesday on the future of the June 12 meeting. But a White House spokesman, <mark>Raj Shah</mark>, says the U.S.\" always sends advance teams ahead of any scheduled presidential visit. \"<mark>Shah</mark> says Joe Hagin--the deputy chief of staff for operations--will go to Singapore over the weekend to continue the preparations. ___ Local Channel Now Playing: Now Playing Fatal pedestrian crash on San Pedro Jacob Beltran Woman found with gunshot wound to face San Antonio Express-News 3 armed suspects break into San Antonio home San Antonio Express-News Armed suspect at large after robbing San Antonio IHOP San Antonio Express-News Reporter saves drowning dog Sarah Duran, Courtesy Fatal hit-and-run ends in bystanders shooting at suspect driver Jacob Beltran, Staff Robbery suspect dons disguise in mask, dreadlock wig San Antonio Express-News SAPD: Driver ran over teen who hit his Mercedes with a bat San Antonio Express-News Duo crashes after leading 100 mph motorcycle chase on I-10 San Antonio Express-News 4th suspect accused in drugging, prostitution of teen arrested San Antonio Express-News 12:40 p.m. President Donald Trump says he will know next week whether his planned summit with North Korean leader <mark>Kim Jong Un</mark> is still on, as his administration looks to keep the historic meeting on track. He says:\" We will know next week about Singapore and if we go I think it will be a great thing for North Korea. \"On Tuesday, Trump expressed doubts about the June 12 meeting taking place as scheduled when he hosted South Korean President Moon Jae-in at the White House, amid concerns that the North isn't committed to discussing dismantling its nuclear program. Speaking from the White House before boarding Marine One on Wednesday, Trump said,\" Someday a date will happen, \"for the North Korea talks, adding, and\" It could very well be June 12. \"____ 11:15 a.m. Secretary of State Mike Pompeo says it is ultimately up to North Korean leader <mark>Kim Jong Un</mark> whether a planned summit with President Donald Trump takes place. Pompeo was asked at a congressional hearing if the meeting in Singapore on June 12 will happen or not after Trump said Tuesday\" there's a very substantial chance \"it won't go off as planned. Pompeo said <mark>Kim</mark>\" asked for the meeting, the president agreed to meet with him. I'm very hopeful that meeting will take place. \"He was testifying Wednesday before the House Foreign Affairs Committee. ____ 11 a.m. Secretary of State Mike Pompeo says the Trump administration will walk away from talks with North Korea if the\" right deal \"is not on the table for negotiation. Pompeo told the House Foreign Affairs Committee in prepared testimony on Wednesday that a\" bad deal \"is not an option. He says preparations continue for a planned June 12 summit in Singapore between President Donald Trump and North Korean leader <mark>Kim Jong Un</mark>. Pompeo says previous U.S. administrations had been\" fooled before and we can't permit that to happen again. \"However, based on his own discussions with the North Korean leader, Pompeo said he was hopeful that Trump could convince <mark>Kim</mark> to make a strategic decision to denuclearize. ___ 12:33 a.m.. The United States and South Korea are working to keep the scheduled U.S. summit with North Korea on track--even after President Donald Trump's comment that\" there's a very substantial chance \"it won't go off as planned. Trump and South Korea's leader met in the Oval Office on Tuesday, and President Moon Jae-in says\" the fate and the future of the Korean Peninsula hinge \"on the summit set for June 12 in Singapore. The summit would offer a historic chance for peace. But there also is the risk of a diplomatic failure that would allow the North to revive and advance its nuclear weapons program. Sign up for instant alerts from MySA by texting NEWS to 77453. Most Popular 1 Buc-ee's wins federal court trademark fight against competitor Choke Canyon 2 Photos: KENS-TV anchor weds in Caribbean paradise 3 S.A.'s Instagramable Flower Vault will remain open throughout the summer 4 Lake levels heading into Memorial Day weekend 5 Motorcyclist suffered life-threatening injuries in crash that closed I-35 6 Former cheerleader sues Texans over pay, other issues 7 Former patients of doctor indicted in $240M fraud file notices to sue him 8 S.A. amusement park gets major praise from TV star 9 Affidavit: Former San Antonio nurse stole nearly 1,700 pills from rehab facility 10 People who sleep in on weekends avoid dying young, study suggests 11 Police find stabbing victim in Terrell Hills while en route to burglary call 12 A peek inside one of San Antonio's swankiest Pearl apartments 13 SAPD: Victim shot in neck in NE side neighborhood 14 Valdez wins tight race to become first Latina, first lesbian to win major party nod for governor 15 Woman who met R. Kelly after San Antonio show accuses singer of sexual battery, giving her herpes View Comments © 2018 Hearst Communications, Inc. ."}, {"articleID": "2017052423_00178126_W", "names": {"Yu Gu": ["Q3428771", "Q45434640", "Q51542236", "Q58363615"]}, "date": "2017-05-24", "url": "http://www.thebull.com.au/articles/a/67396-as-us-mulls-action-on-steel,-foreign-producers-urge-caution.html", "content": "News As US mulls action on steel, foreign producers urge caution Foreign steel producers on Wednesday called for prudence from the Trump administration as it considers possible actions to shield domestic companies from unfair imports on national security grounds. Print 25.05.2017 08:45 AM Foreign steel producers on Wednesday called for prudence from the Trump administration as it considers possible actions to shield domestic companies from unfair imports on national security grounds. The remarks came at a public hearing that is part of a Commerce Department investigation into the effects of steel imports on US national security. The administration is also scrutinizing aluminum imports. The Trump administration's new stance has cheered US producers, who hope it will bring more relief to struggling industries than scores of scattershot anti-dumping cases. Domestic producers on Wednesday said unfair competition is undermining the US industrial base in ways that could jeopardize energy production and the manufacture of weapons, armor and vehicles. Still, some analysts say technological advances and increased productivity, more than trade, have accounted for much of the industry's job losses. John Ferriola, president of Nucor Corp, said his company's steel helped produce US Humvee light military trucks, Abrams battle tanks, Bradley fighting vehicles, the Patriot surface-to-air missile system and the plating used for armored vehicles, Navy aircraft carriers and destroyers. That required \"continual investment\" in expertise, research, development and testing to meet exacting US Navy standards, he told the hearing. \"Unfortunately, global overcapacity and unfairly traded imports threaten our ability to invest,\" he said. \"Production overcapacity in the steel industry has reached crisis levels .\" - Trade barriers questioned - However, foreign producers told the hearing that new trade barriers could be both unnecessary and counter-productive. Karl Tachelet, head of international affairs at Eurofer--an association of European Union steel producers--said his organization had also been fighting unfair practices and global oversupply. \"We do not believe that restrictive, unilateral action based on national security will allow for lasting solutions we all need,\" he said, calling for the investigation to focus on \"specific uses\" directly tied to national security. \"What do tin mill products used to make cans for food and beverages have to do with national security?\" he said. \"How real is the risk that one day the US will not be able to produce enough rebar or sections for construction and infrastructure given its massive scrap availability?\" - China, Russia, Ukraine - <mark>Yu Gu</mark>, a representative of the Chinese Commerce Ministry, said the US Defense Department had found that US defense needs for steel were low, citing research that concluded that just three percent of domestic shipments served national defense purposes. \"Clearly, current and projected US national defense demand for steel can be readily satisfied by domestic production,\" he said. The deputy head of Russia's US trade mission, Alexander Zhmykhov, said his country's steel exports were already subject to heavy anti-dumping restrictions and duties in the United States, where certain imports have tumbled. \"Russian imports have already been so drastically limited by the measures enforced that further limitations would be excessive,\" he said. Ukraine's representative said his country's steel industry is under attack--suffering seizure and expropriation by foreign-backed separatists in industrial eastern Ukraine--but that security cooperation with the United States is also crucial to his country's stability. A 2001 investigation showed that the America was not vulnerable to imports of iron ore and semi-finished steel, said Vitalii Tarasiuk, minister-counsellor at the Ukrainian embassy. \"We are confident that evidence in this case will likewise show that steel imports do not threaten US national security,\" he said. Speaking to reporters on Wednesday during a visit to Washington--where she met with US Trade Representative Robert Lighthizer--German Economy Minister Brigitte Zypries said she is worried the US steel investigation could result in higher tariffs on German exports of the metal and hopes to address the issue with US Commerce Secretary Wilbur Ross. Archive"}, {"articleID": "2011042019_00065573_W", "names": {"Michelle Rodriguez": ["Q184219", "Q3311458"], "Maggie Smith": ["Q172653", "Q19666077", "Q21455452", "Q26883013", "Q59266872"], "Elizabeth Perkins": ["Q232047", "Q59156669"], "Patrick Wilson": ["Q22116929", "Q2724775", "Q351290", "Q51589818", "Q55629235", "Q7147850", "Q7147851", "Q7147852"], "Bradley Cooper": ["Q205707", "Q4954898"], "George Lopez": ["Q1703868", "Q73035"], "Helen Hunt": ["Q16198794", "Q170574"], "Danny Mcbride": ["Q336400", "Q3702286", "Q5220605"]}, "date": "2011-04-20", "url": "http://reporternews.com/news/2011/apr/20/no-headline---moviesthursday/", "content": "starting this week \"african cats\" (century 12) a view into the world of cheetahs and lions. documentary with samuel l. jackson. g. not reviewed. \"madea's big happy family\" (century 12) madea tries to unite her family. tyler perry, loretta devine and bow wow. pg-13. 106 minutes. not reviewed. \"water for elephants\" (pc-6) a veterinarian joins a traveling circus. drama with robert pattinson, reese witherspoon and christoph waltz. 122 minutes. not reviewed. continuing \"arthur\" (premiere 10, town & country) a playboy risks his inheritance when he falls for a woman who doesn't meet his family's approval. comedy with russell brand, helen mirren and jennifer garner. pg-13. 110 minutes. hh \"battle: los angeles\" (century 12) marines defend los angeles from alien invaders. action sci-fi with aaron eckhart, <mark>michelle rodriguez</mark> and bridget moynahan. pg-13. 116 minutes. not reviewed. \"diary of a wimpy kid: rodrick rules\" (century 12, town & country) a few tales about two brothers' antics. comedy with zachary gordon, devon bostick and robert capron. pg. not reviewed. \"gnomeo & juliet\" (westwood) a couple of young garden gnomes are caught up in a feud between their families. animated comedy with james mcavoy, emily blunt and <mark>maggie smith</mark>. g. 84 minutes. not reviewed. \"hanna\" (century 12) a teenage girl is raised to be the perfect assassin. action thriller with saoirse ronan, cate blanchett and eric bana. pg-13. 114 minutes. hhh \"hop\" (century 12, town & country) the easter bunny's son seeks to become a drummer in a band. animated comedy with russell brand, james marsden and <mark>elizabeth perkins</mark>. pg. not reviewed. \"insidious\" (pc-6) evil spirits threaten a comatose child. horror with <mark>patrick wilson</mark>, rose byrne and ty simpkins. pg-13. 102 minutes. hhh \"just go with it\" (premiere 10) a plastic surgeon has his assistant pose as his wife to cover up a lie. comedy with adam sandler, jennifer aniston and brooklyn decker. pg-13. 116 minutes. not reviewed. \"justin bieber: never say never\" (westwood) justin bieber's 2010 concert tour. music documentary with justin bieber. g. 105 minutes. not reviewed. \"the last lions\" (pc-6) a film documenting the disappearance of lions. documentary with jeremy irons. pg. 88 minutes. not reviewed. \"limitless\" (century 12) a man is pursued by killers after finding a drug that gives him superhuman abilities. thriller with <mark>bradley cooper</mark>, anna friel and abbie cornish. pg-13. 105 minutes. hhh \"the lincoln lawyer\" (premiere 10) a lawyer operates from the back of his car. drama with matthew mcconaughey, marisa tomei and ryan phillippe. r. 119 minutes. h? \"paul\" (century 12) a pair of british comic-book geeks stumble upon an alien. comedy with simon pegg, nick frost and seth rogen. r. 104 minutes. hh? \"rango\" (premiere 10) a chameleon defends a western town from bandits. animated adventure with johnny depp, isla fisher and timothy olyphant. pg. 107 minutes. hhh \"rio\" (premiere 10, town & country) a domesticated macaw goes on an adventure to rio de janeiro. animated comedy with jesse eisenberg, anne hathaway and <mark>george lopez</mark>. g. 96 minutes. hhh \"scream 4\" (premiere 10) ghostface returns to haunt the survivors of his earlier attacks. horror with neve campbell, courteney cox and david arquette. r. 111 minutes. not reviewed. \"soul surfer\" (pc-6) after losing an arm to a shark, a young woman tries to return to surfing. drama with annasophia robb, dennis quaid and <mark>helen hunt</mark>. pg. not reviewed. \"source code\" (century 12) a soldier finds himself trapped in the body of another man, attempting to find the bomber of a chicago commuter train. sci-fi thriller with jake gyllenhaal, michelle monaghan and vera farmiga. 93 minutes. pg-13. hh? \"sucker punch\" (premiere 10) a young girl retreats to an alternate reality after being institutionalized. action fantasy with emily browning, vanessa hudgens and abbie cornish. pg-13. h? \"your highness\" (century 12) a prince and his lazy brother set off to rescue a princess. adventure comedy with <mark>danny mcbride</mark>, zooey deschanel and james franco. r. 102 minutes. hh aero union grounds airtanker fleet in abilene over dispute with faa aero union grounds airtanker fleet in abilene over dispute with faa published 4/19/2011 at 3:33 p.m. 105-year-old cowboy, wife lose four homes in stonewall county wildfires wildfires whipped up by winds, blister hundreds of thousands of acres in the big country published 4/16/2011 at 12:01 a.m. asia-based investment groups to own majority of cisco-based frac tech feels like: 63? humidity: 75% precip: 23% title hopes wylie keeps dreams alive in win over brownwood homecoming victory wylie hangs on to lead, beats lubbock estacado abilene, big country and texas high school football at its best. bumpy or smooth? what condition is your street in? check our database"}, {"articleID": "2019101012_00341602_W", "names": {"Mason Rudolph": ["Q19666923", "Q3543162"]}, "date": "2019-10-10", "url": "https://steelersdepot.com/2019/10/devlin-hodges-path-from-undrafted-to-starting-fits-who-i-am/", "content": "It's been a long journey from Milan to Minsk for Devlin Hodges. The undersized quarterback ended up playing his college ball at an FCS school, where he would go on to break the record for the most passing yards thrown in a career. He proceeded to go undrafted, and then unsigned, though he received an invitation by the Pittsburgh Steelers to participate in their rookie minicamp. That was the point at which he began proving himself week in and week out to anyone that mattered. Over the course of three days, he outperformed first-year Brogan Roback, prompting the team to waive him and instead sign Hodges to the 90-man roster. He proceeded to turn heads throughout OTAs and all the way through the preseason, where he saw a disproportionate share of the snaps for a number four quarterback, a clear signal that the Steelers were taking him and his viability seriously. While generally working well within the scope of the opportunities that he was provided, it wasn't enough for the team to conclude that he was one of their three best quarterbacks. Behind Ben Roethlisberger, they decided that <mark>Mason Rudolph</mark> would be the backup, and Joshua Dobbs would be the number three. After being offered a fifth-round pick for Dobbs, however, they made the trade and signed Hodges to the practice squad. A season-ending injury to Roethlisberger a week later saw him promoted to the 53-man roster as <mark>Rudolph</mark>'s backup. Now with <mark>Rudolph</mark> in the concussion protocol, the rookie undrafted free agent is getting first-team reps for the first time and preparing to make his first NFL start after showing promise in his debut on Sunday filling in for the second-year man. \"I tell everyone I think it fits who I am\" , Hodges told reporters yesterday about the journey he has undertaken so far in the NFL. \"I never once didn't think I would be here or could be here. It is crazy, especially to be gone Week One and then coming back on the practice squad\". \"Some of the guys on the team were like,\" it felt like you were gone forever \"', he added .\" But then Ben going down and being brought up and <mark>Mason</mark> getting the concussion last week and getting thrown in. It is just crazy. It is a crazy process \". There's still a long road ahead for Hodges to really prove anything of himself. He only has a handful of pass attempts to his name, and his future is as yet unwritten. But he knows that if his story is one of success, that it will have been because of who he is .\" Even from the beginning, coming here on like a tryout, I told some people before that if five years from now or 10 years, if I am still playing in the NFL, this whole kind of story just fit who I am \", he said .\" It just shows that hard work and confidence in yourself and belief in yourself, you can accomplish your dreams \". Related Items: Devlin Hodges Share Tweet Share Share Email Recommended for you Devlin Hodges Lack Of Practice Reps Makes Debut Even More Impressive Chargers Head Coach On Sunday Play Of Steelers' Hodges:\" I Thought He Was Outstanding' Why Devlin Hodges Winning Sunday Night Probably Wouldn't Surprise Bill Parcells Please enable JavaScript to view the comments powered by Disqus."}]