[{"articleID": "2014041808_00036883_W", "names": {"Michael Kirby": ["Q57496340", "Q6831890", "Q6831895"], "Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2014-04-18", "url": "http://www.3news.co.nz/Call-for-sanctions-against-North-Korea/tabid/417/articleID/340650/Default.aspx", "content": "Call for sanctions against North Korea The United Nations Security Council should slap targeted sanctions on North Korean officials responsible for grave human rights abuses, the head of a special UN inquiry says. <mark>Michael Kirby</mark> told an informal meeting of the Security Council convened by Australia, France and the US that he also wanted the reclusive regime hauled before the International Criminal Court (ICC) for prosecution. \"More monitoring and engagement alone cannot suffice in the face of crimes that shock the conscience of humanity,\" said <mark>Kirby</mark>, a former Australian High Court justice. \"Perpetrators must be held accountable, it is necessary to deter further crimes.\" North Korea did not send a representative and the meeting was snubbed by China, Pyongyang's sole major ally, and Russia. \"A new generation of senior officials now surround the supreme leader <mark>Kim Jong-Un</mark>,\" <mark>Kirby</mark> said. \"They must be made to understand that they will themselves face personal accountability if they join in the commission of crimes against humanity or fail to prevent them where they could.\" The commission of inquiry therefore recommends to the Security Council the adoption of targeted sanctions against those individuals most responsible for crimes against humanity. \"<mark>Kirby</mark> said the proposal to refer North Koreans to the ICC had found favour with most countries present, but UN diplomats said any move would likely face fierce opposition from China, the North's economic lifeline. In March, the UN's top rights body also called on the Security Council to act against officials responsible for a litany of crimes against humanity in North Korea. <mark>Kirby</mark>'s commission of inquiry on North Korea released a hard-hitting report on the nuclear-armed totalitarian state in February that documented a range of gross human rights abuses, including extermination, enslavement and sexual violence. North Korea refused to co-operate with the probe and said the evidence was\" fabricated \"by\" forces hostile \"to the country. After the meeting, US ambassador to the UN Samantha Power praised council members for joining other countries for the first time to discuss the North's\" tragic human rights situation in North Korea \".\" We heard directly from the authors of a thorough, objective and credible UN report, and from victims of North Korean atrocities themselves, \"she said."}, {"articleID": "2016080518_00262775_W", "names": {"David Kilgour": ["Q5236003", "Q872073"], "Ethan Gutmann": ["Q18977963", "Q58040087"]}, "date": "2016-08-05", "url": "http://www.bclocalnews.com/news/389310611.html#storyComments", "content": "News Falun Gong brings protest to Penticton Jing Trien (right) along with Vera Sun and Joy Wang are Falun Gong practitioners who were recently in Penticton to raise awareness of human rights abuses against Falun Gong in China .--image credit: Mark Brett/Western News posted Aug 5, 2016 at 10:00 AM Jing Trien is one of the lucky ones. The 37-year-old Vancouver resident and Falun Gong practitioner managed to escape her captors and her home country of China but left with some very deep emotional scars. Trien was a member of a group of touring Falun Gong proponents who were in Penticton recently to raise awareness and support for their cause. In particular, they want an end to what they say is the mass killings and the state-sponsored crime of forced organ harvesting of its members in China. Trien was in prison with other family members including her sister, brother and mother. \"Jing says she is so fortunate and lucky because her mother was persecuted and then blinded and then died,\" said Vera Sun who translated Trien's statement. \"She knew another woman in the prison with her, after being persecuted to death and when the family came to check the body they found holes at the waist where they took the organs.\" Trien was eventually able to escape to Thailand and made her way to Canada in 2009. Her brother also escaped but is still in Thailand. During her incarceration Trien had numerous physical check ups and now believes her poor medical condition was part of the reason she escaped organ harvesting. \"Millions more are not so lucky,\" said Sun. \"That is why all of us volunteers are doing this, to simply raise awareness of what's going on.\" We are urging Canadians to condemn the horrific crime of forced organ harvesting from Falun Gong practitioners in China and to help stop the ongoing campaign of persecution and mass killings of practitioners. \"Falun Gong is a traditional, spiritual discipline whose adherents follow the principles of truthfulness, compassion and tolerance.\" I think it's human nature of the communist party they are afraid of people being empowered by anything other than their ideology, \"said Joy Wang of Penticton who is travelling with the group.\" I learned the truth about Falun Gong after I left China 15 years ago. Since I started practising my problems have disappeared and I've become much calmer. \"She has started a local class which meets weekly near the SS Sicamous and is becoming increasingly popular. A number of countries including the U.S. along with the European parliament have condemned the practice. In June, a report released by Canadian human rights lawyer David Matas, former Canadian secretary of state <mark>David Kilgour</mark> and investigative journalist <mark>Ethan Gutmann</mark> indicated up to 1.5 million Falun Gong practitioners have been killed since 2001.\" We call on the federal government to warn Canadians not to go to China for a new organ since they may be unknowingly become complicit in this crime and we urge Prime Minister Justin Trudeau to raise these issues during his upcoming visit to China, \"said Sun. We encourage an open exchange of ideas on this story's topic, but we ask you to follow our guidelines for respecting community standards. Personal attacks, inappropriate language, and off-topic comments may be removed, and comment privileges revoked, per our Terms of Use. Please see our FAQ if you have questions or concerns about using Facebook to comment."}, {"articleID": "2015120423_00103798_W", "names": {"James Boyd": ["Q16588788", "Q43918632", "Q56421215", "Q6130075"]}, "date": "2015-12-04", "url": "http://www.abqjournal.com/686236/news/ex-officers-charged-in-nm-shooting-death-ask-to-move-trial.html", "content": "............................................................................................................ALBUQUERQUE, N.M. (AP)--The trial for two former Albuquerque police officers charged with second-degree murder in the shooting death of a homeless man should be moved to another city because of the high volume of media attention the case has received, defense attorneys said Friday in court documents. Attorneys for Keith Sandy and Dominique Perez want the trial, set for August 2016, to be moved from Bernalillo County, which includes Albuquerque, to Las Cruces in Dona Ana County, according to the court filing. Las Cruces is about 200 miles south of Albuquerque. Sandy and Perez shot <mark>James Boyd</mark> after an hours-long standoff in March 2014. In police video footage, the 38-year-old homeless man has two knives in hand but appears to be turning away from officers when gunfire erupts and he is shot. The footage released amid a U.S. Justice Department investigation into a pattern of excessive force within the Albuquerque Police Department sparked extensive local protests, including one in which demonstrators shut down City Hall during a council meeting. \"Not only will nearly every single potential juror know about the case, but also, each one will already have a fixed opinion--whether it is pro- or anti-Albuquerque police,\" the motion states. \"The community is divided.\" Both Sandy and Perez have pleaded not guilty to second-degree murder and assault charges in the shooting death of <mark>Boyd</mark>, who authorities say suffered from mental illness. <mark>Boyd</mark> had been camping illegally in the foothills on the east side of New Mexico's largest city. The incident preceded a broader national debate about police shootings and officers' use of force. \"At the inception of the shooting, there was uproar from local demonstration groups, demanding that Officer Perez and Detective Sandy be charged criminally,\" the motion states. The motion cites more than 250 media reports among several outlets in the Albuquerque area compared to a handful in Las Cruces. Defense attorneys argue the news coverage has \"harshly criticized\" Perez and Sandy, with headlines that read \"Charges keep police accountable...\"and\" No wonder Albuquerque Police Dept. has difficulty in finding recruits. \"In August, a judge ruled there was probable cause for the officers' case to go to trial after a two-week preliminary hearing in which Special Prosecutor Randi McGinn argued <mark>Boyd</mark> couldn't have posed a threat to officers when he was killed because he was shot in the side and back. Defense attorneys contend <mark>Boyd</mark> presented a danger and had threatened officers, leaving them no choice but to shoot as their training had taught them. Since the shooting, Sandy was allowed to retire from the force and Perez was released in October under a policy indicating the department may take disciplinary action upon indictment of an officer or a formal criminal charge. Perez and Sandy could face up to 15 years in prison if convicted of second-degree murder. A voluntary manslaughter conviction carries a term of up to three years. They remain free on their own recognizance as they await trial."}, {"articleID": "2015021616_00053831_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"]}, "date": "2015-02-16", "url": "http://washingtonmonthly.com/political-animal-a/2015_02/a_presidential_education054198.php?page=all&print=true", "content": "By Ed Kilgore One of the issues raised by <mark>Scott Walker</mark>'s quick ascendancy to the top tier of presidential candidacy in the 2016 Invisible Primary is the phony scandal of his lack of a college degree. I call it a \"phony scandal\" because while there have been a few liberals (notably Howard Dean) to cite it as a disqualifier for the presidency, there have been far more conservatives raising lusty cries of Palinesque defiance of the godless lefty elites who think brainwashing at godless liberal universities is blah blah blah bark bark woof woof. Glenn Reynolds (a university professor, of course) USA Today: [A] President <mark>Walker</mark> would accomplish something worthwhile the moment he took office. Over the past few years in America, a college degree has become something valued more as a class signifier than as a source of useful knowledge. When Democratic spokesman Howard Dean (who himself was born into wealth) suggested that <mark>Walker</mark>'s lack of a degree made him unsuitable for the White House, what he really meant was that <mark>Walker</mark> is \"not our kind, dear\" - lacking the credential that many elite Americans today regard as essential to respectable status.... [T] he college degree - especially a degree from an elite school - has become an entry-level ticket into the educated mandarinate. In his important book, The New Class Conflict, Joel Kotkin calls it the \"clerisy\" - that now dominates government, journalism and academia. And as a result, an America that once prided itself on real-world achievement and practical good sense now runs largely on credentials. Kotkin, of course, is a conservative intellectual beating a conservative anti-intellectual drum that's not \"new\" at all; it goes back for many decades, not just in pointy-headed conservative circles but among politicians, particularly in the 1960s when \"university\" was identified with \"spoiled hippies\" on the Right. It's a shame for people like Reynolds and Kotkin that Spiro T. Agnew was forced to resign the vice presidency in disgrace; nobody will ever surpass his denunciation of liberals as \"an effete corps of impudent snobs.\" In any event, I guess progressives will have to dutifully line up and confirm that no, we do not consider a college degree a requirement for the presidency. Like an awful lot of things, educational credentials are a data point, and to that extent, conservatives touting <mark>Walker</mark> should admit not finishing college (after all, if elected <mark>Walker</mark> would be the first president born after 1884 to have no college degree) isn't some sort of positive accomplishment. If it was, then maybe Republicans should find a candidate who didn't finish high school, or who is illiterate; they'd sure be immune from all that Marxist propaganda, wouldn't they?"}, {"articleID": "2019072720_00063550_W", "names": {"Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "Ian Mcculloch": ["Q19518682", "Q21455045", "Q2666679", "Q580278", "Q773923"]}, "date": "2019-07-27", "url": "http://events.stuff.co.nz/2020/a-ha/christchurch?utm_medium=rss", "content": "a-ha--Hunting High And Low Powered by: a-ha--Hunting High And Low When: Thu 5 Mar' 20, 7:00 pm Where: Horncastle Arena, Jack Hinton Dve, Addington, Christchurch Restrictions: a-ha, Rick Astley, The Beths Frontier Touring and Roundhouse Entertainment are excited to announce pop icons a-ha will tour New Zealand next March. This is the band's first ever visit to the country and will also mark the return of a day on the green to New Zealand. They'll be joined by very special guest Rick Astley at both New Zealand shows. New Zealand's own guitar pop heroes The Beths will also join the lineup in Auckland Since January 2008 a day on the green has presented concerts in New Zealand by Crowded House, Joe Cocker, Simply Red, The B-52s, The Proclaimers, John Mellencamp, Sheryl Crow, Diana Krall and <mark>Tom Jones</mark>, establishing itself as a major concert brand across the country. Since launching in Australia in 2001, a day on the green has become one of Australia's most popular and premier outdoor concert events. After 470 shows and more than 3.5 million happy patrons, the a day on the green experience of good food, fine wine and great music in magnificent locations remains unrivalled. Now a day on the green is excited to present a-ha! The Norwegian trio who dominated pop charts worldwide during the ’80s, are celebrating the 35th anniversary of their hugely influential debut album Hunting High And Low and will be performing the album in full as well as other favourites from across their career. Selling more than 11 million copies worldwide, it includes the unforgettable \"Take On Me' which peaked at number seven on the New Zealand charts--remaining in the chart for 18 weeks--as well as follow-up hits\" The Sun Always Shines On TV', \"Train Of Thought' and the title track\" Hunting High And Low' Joining a-ha to make this one poptastic event not to be missed is another superstar who dominated the ’80s, Rick Astley--also making his debut in New Zealand. With a treasure trove laden with shimmering pop hits, a-ha and Rick Astley are set to thrill fans with shows in Christchurch at Horncastle Arena on Thursday March 5 and a day on the green on Saturday March 7 at Villa Maria, Auckland. a-ha have also scored global hits with the <mark>James Bond</mark> theme \"The Living Daylights' as well as\" Cry Wolf', \"I've Been Losing You\" and the 2005 Max Martin-collaboration \"Analogue', while their most recent release was an MTV Unplugged collection in 2017 featuring collaborations with Echo & The Bunnymen's <mark>Ian McCulloch</mark> and Alison Moyet. NME recently declared Hunting High And Low as\" one of the albums that have stood the test of time and still sounds great today \"Rick Astley is also enjoying a major career resurgence. The British star has sold more than 40 million albums fuelled by hits like\" Never Gonna Give You Up', \"Whenever You Need Somebody',\" Together Forever', \"When I Fall in Love',\" She Wants To Dance With Me' and \"Cry For Help'. In 2007, Rick became an internet phenomenon becoming the subject of a viral meme known as Rick-rolling, with\" Never Gonna Give You Up' garnering millions of hits on YouTube, introducing him to a whole new audience. Purveyors of high-energy guitar pop, New Zealand four-piece The Beths channel their friendship into high-energy guitar pop with a smart lyrical bite. 2018 was their breakout year, beginning with signing to Carpark Records and Dew Process, before releasing the internationally acclaimed debut album Future Me Hates Me, which was heralded as one of the stand-out music releases of that year. The band have toured relentlessly, getting audiences hooked on their ebullient sound. After selling out shows last year across Australia, New Zealand, North America, UK and Europe, the band are proving to be one of the most in-demand live acts on the planet. With a career spanning four decades, secure your spot now for a-ha's first ever New Zealand tour. Together with very special guest Rick Astley, they have created the pop soundtrack to countless lives, and this promises to be a highlight on the summer concert calendar."}, {"articleID": "2015121100_00254381_W", "names": {"Dave Palmer": ["Q15919849", "Q5229518"]}, "date": "2015-12-09", "url": "http://www.mercurynews.com/eat-drink-play/ci_29199998/weekend-getaway-arty-ojai?source=rss", "content": "Weekend getaway to arty Ojai By Amber Turpin Posted: 12/08/2015 12:00:00 PM PST Updated: 12/09/2015 02:48:25 PM PST The rosy wash of the setting sun illuminates the Topatopa Mountains near Ojai, where residents call the stunning phenomenon \"the pink moment.\" (Michael McFadden/Ojai Visitors Bureau) OJAI--It was on a recent trek to this artists colony just east of Santa Barbara that I experienced my first pink moment. The fading sunlight washed across the Topatopa mountain range, setting it ablaze with rosy light. It's a stunning natural phenomenon, and one fitting for a town so rich in sensory appreciation. Ojai has long attracted artists, writers and others interested in delving deep into the creative side of life, and the town continues to evolve, offering new ways for visitors to discover their own artistic souls. Sensory blending takes many different forms here, where art infuses everything, from galleries and studios to the farmers market and cocktail bar. Ojai's historic post office tower is illuminated by the setting sun. (Joe Virnig/Ojai Visitors Bureau) Tucked away in the center of the luxe Ojai Valley Inn & Spa, you will find the Artist Cottage & Apothecary. This distinctive hideaway offers guests experiential art exploration classes, from basic drawing to Japanese paper-folding and dyeing. I'm here for the very popular tile-painting class, where instruction, supplies and even a nice cup of local Zhena's tea all are provided. I just have to decide what to paint. It's tempting to try to replicate the wonder of the pink moment, but more than a tad overreaching. Instead, I opt for a freehand zigzag pattern. Advertisement But my attention is soon diverted by what's happening in the adjoining apothecary, where more than 40 base scents, from lavender and rose to sandalwood, are on display, and you can concoct a custom perfume in the aroma-blending class. They even keep a database of sorts, so your carefully chosen scent portfolio stays on file, in case you want to get another bottle down the road. Day two brings me to dabbling in zigzags of a different type. \"A mandala is made to center you, to focus you,\" says teacher Bernadette DiPietro, explaining the geometric designs within Buddhism that symbolize the entire universe, and are often used in meditation. DiPietro teaches interactive art classes, including a make-your-own mandala class, in her studio off a downtown side street. Her space is adorned with inspiration from her vast travels--she teaches art on a cruise ship for several months each year--as well as a lifetime of work grounded in this region. DiPietro has lived and worked here since 1971 when, she says, the \"sunshine brought me\" from the East Coast. I'm stationed at my own little desk with a single piece of white paper, blank except for a small blue - and pink-feathered focal point. This design called to me more than the others--DiPietro instructed us to choose the one that beckons the most--and is the kickoff point for creating my own unique mandala. After stocking up on a variety of supplies--colored pencils, glitter pens, stencils and round tracing objects--the embellishment begins. The calm that comes over the room as we contemplate mandala patterns is palpable. It's evidence, DiPietro says, of why \"adult coloring books are really big right now.\" We essentially are making our own mandala-themed coloring page that we can revisit as much as we desire. It's a work in progress and can be a tool to finding quiet reconnection. But creativity isn't always quiet. Every Sunday at Heather Stobo and Lisa Casoni's aptly named Porch Gallery, a contemporary art gallery in what was once the town funeral home, local musician <mark>Dave Palmer</mark> drops by to play the piano. Music wafts over to the farmers market next door, inspiring shoppers to grab some food and head for the gallery's wraparound porch, where they can nibble and sip coffee as they listen and linger. As I revel in the artful atmosphere, a small, bright red pop of color catches my eye. It's from the gallery's \"Rock the Glass\" cocktail glassware series, which includes Tomatomania! pint glasses with hand-drawn crimson icons by artist Sam Hamann--and a recipe for a tequila-based Tomato Sunrise. \"The concept is that we are pairing mixologists and artists,\" Stobo says. The result, Casoni adds, is \"all kinds of cross tie-ins.\" Folks have been having fun with the glassware project, celebrating thematic events--such as the Kentucky Derby with mint juleps served in artist Katie Van Horne's horse-themed glasses--and bringing a community together, quite literally, over drinks. On the lawn outside, a huge chalkboard--with the prompt \"Before I Die...\"--coaxes some soulful contributions from the public. I fish out a fuchsia-toned piece of chalk and, without hesitation, add the words:\" Watch another pink moment. \"If You Go"}, {"articleID": "2019012110_00167783_W", "names": {"Thomas Frank": ["Q13469562", "Q1497420", "Q2744752", "Q57481970"], "Jon Taylor": ["Q19518141", "Q6271673"], "Anthony Forde": ["Q3618491", "Q4772527"], "Michael Smith": ["Q15637781", "Q1620255", "Q16207164", "Q16225563", "Q1627389", "Q16976514", "Q1720858", "Q18325554", "Q18325556", "Q18344457", "Q1929419", "Q1982423", "Q21175251", "Q3856267", "Q52907019", "Q56394971", "Q58870848", "Q6829665", "Q6831697", "Q6834460", "Q6834463", "Q6834464", "Q6834465", "Q6834468", "Q6834469", "Q6834471", "Q6834472", "Q6834473", "Q6834474", "Q6834475", "Q6834476", "Q6834478", "Q6834480"]}, "date": "2019-01-21", "url": "https://www.yorkshirepost.co.uk/sport/football/rotherham-united/big-match-verdict-rotherham-united-show-their-fighting-spirit-but-brentford-prove-too-strong-1-9547185", "content": "York Big Match Verdict--Rotherham United show their fighting spirit but Brentford prove too strong Sorry, we're having problems with our video player at the moment, but are working to fix it as soon as we can Waiting for Video...Updated: 06:47 Monday 21 January 2019 Share this article Sign Up To Our Daily Newsletter Sign up Have your say THE DRINK of choice was Champagne after Rotherham United's feted home victory over Brentford to clinch promotion on a heady, unforgettable Spring afternoon in April 2001. The beverage on offer on a raw winter's day on Saturday was coffee and its pungent aroma was discernible throughout a sobering occasion. The Millers--whose squad's market value was reportedly set at £ 6.44 m in figures revealed last week--are taking on the rest of their Championship rivals with the equivalent of one arm tied behind their backs. Rich in spirit, competitiveness and energy they may be, but in the unforgiving second-tier, such qualities can only take you so far. Competing against a club--a traditionally comparable one at that--whose squad's own market value was registered at £ 46.22 m, the chasm in class was a yawning one on the second-half evidence. It exposed just what the Millers are up against this season as they suffered at the hands of a Brentford side whose game changers all came to the party once again after inflicting a 5-1 first-day humbling upon Paul Warne's side. Rotherham's Matt Crooks celebrates after his side's second goal against Brentford. That United still find themselves out of bottom three is laudable. Anyone who begged to differ could have done worse than listen to Brentford head coach <mark>Thomas Frank</mark> after the match. Unprovoked and before being asked any questions on the game, the Dane complimented his team's opponent and opposite number for their achievement so far in keeping out of the relegation zone, despite having the lowest budget in the Championship. It was a moment of class--in keeping with his side's stylish efforts on the pitch. Rather less endearing was the reaction of a section of Millers supporters who ironically cheered when loan full-back Zac Vyner--a young defender still making his way in the game--was substituted in the second half. We speak to all the managers after games and they appreciate that the gulf between League One and this division is a massive gulf. Paul Warne A club and set of supporters who need to stay together on and off the pitch if they are to retain their Championship status this season--which would be a remarkable feat--it was a moment which will have hurt many fans and most definitely Warne. On the treatment of Vyner, the Millers chief said: \"It is disgusting. I do not understand it. Fans possibly see games differently to me. It summed it up when Zak came off that all the coaches went to thank him for his efforts.\" I did not take him off because he was having a stinker in my eyes. I took him off because I went three at the back. I have done that loads of times this season. You could see Will Vaulks clapping him and saying: \"Zak, well done .' He put loads of crosses in.\" It is disappointing for me. Zak has been great for us and I do not think any player should be singled out for abuse. \"Rotherham's Will Vaulks wins a header against Brentford on Saturday. On support for what he is up against from his opposing number, Warne added:\" Everyone in football knows the challenge we have, but we've taken it on every week with a smile on our face and tried to be the best we can be. The lads give everything. \"We speak to all the managers after games and they appreciate that the gulf between League One and this division is a massive gulf. Realistically, my team is virtually the same as last year.\" The early signs were ominous for the hosts on Saturday. An instinctive, rapier-like move orchestrated by Rico Henry and Said Benrahma--who both had afternoons to savour--undressed the Millers and it was left to Kamohelo Mokotjo to coolly tuck away a second-minute opener. It was to the Millers' credit that they overcame a rough start to impose their own will upon the visitors and it really should have seen them lead at the break. <mark>Jon Taylor</mark>'s leveller, a super strike after <mark>Anthony Forde</mark>'s corner was not cleared--was a head-turning one and the winger was inches away from a second following Vyner's sweet centre. The hosts continued to press with Ajayi somehow missing from a few yards out after Daniel Bentley's instinctive reaction save to keep out Clark Robertson's point-blank header--and it proved a fateful moment. On the resumption, the quality of Brentford--swift in thought and movement with poise on the ball--wore the Millers down, while <mark>Michael Smith</mark> ploughed the loneliest of furrows on his own up front at the other end. A clever effort which flew just wide from the Bees' top-scorer Neal Maupay signalled Brentford's intent before a superb move was started and clinically finished by the buoyant Benrahma, with Ollie Watkins and Romaine Sawyers also involved. Once more, the Millers' character was unquenchable and they hauled themselves back up again when a cross from Richie Towell was met with a glancing header from Robertson, which went in off Bees defender Ezri Konsa. This time, Brentford did not panic and the marauding Henry soon set up Mokotjo for another unerring low finish and this time, there was no home fightback. Maupay chipped over before having his moment after the increasingly besieged hosts were opened up again as the Bees bagged their first league away win since April with a hint of swagger. Rotherham United: Rodak, Vyner (Yates 78), Ajayi, Robertson, Mattock, Vaulks, <mark>Forde</mark> (Vassell 86), Towell, Wiles (Crooks 59), <mark>Taylor</mark>, <mark>Smith</mark>. Unused substitutes: Wood, Price, Raggett, Jones. Brentford: Bentley, Konsa, Jeanvier, Barbet, Dalsgaard, Sawyers, Mokotjo (Da Silva 88), Henry, Watkins (Ogbene 88), Maupay, Benrahma (Canos 76). Unused substitutes: Odubajo, McEachran, Daniels, Sorensen. Referee: Tony Harrington (Cleveland)."}, {"articleID": "2012042205_00034895_W", "names": {"Hugo Chavez": ["Q732006", "Q8440"]}, "date": "2012-04-22", "url": "http://detroitnews.com/article/20120422/NATION/204220316/1020/rss09", "content": "people walk by a mural of venezuela's president <mark>hugo chavez</mark> in caracas, venezuela on friday. (ap photo/ariana cubillos) caracas, venezuela - venezuelan president <mark>hugo chavez</mark> has been out of sight for a week, speaking only through twitter messages and written statements while undergoing cancer treatment in cuba. the lack of any appearances on television has venezuelans wondering about what his unusual silence might say about his struggle with cancer, and whether <mark>chavez</mark> may be coping with a particularly tough phase of radiation therapy. more than 30 messages have appeared on <mark>chavez</mark>'s twitter account since he left for cuba on april 14. he has cheered on supporters with slogans such as \"let's continue building socialism!\" in others, he has praised his military commanders, announced funding for local governments and vowed to survive and win re-election in october. but he has seldom mentioned his cancer treatment. national assembly president diosdado cabello reiterated on friday that <mark>chavez</mark> is expected to return to venezuela soon. \"god willing, next week he'll be here again with us once he has finished the treatment,\" cabello said in a televised speech. he insisted that even when <mark>chavez</mark> is away in cuba, \"he leads just the same as if he were here in venezuela.\" \"the commander's presence here isn't necessary, because just the same he's the commander of the revolution,\" cabello said. but even some of <mark>chavez</mark>'s supporters have been saying recently that they wonder what's going on with his health. \"it makes me sad, but my comandante must not be as well as they say,\" said guillermo suarez, a street vendor selling sunglasses. \"it's already been many days that we haven't seen him, heard him.\" <mark>chavez</mark>, who has been president since 1999, has long been a constant presence on venezuelan television, often addressing the nation for several hours most days in addition to his marathon sunday program \"hello, president.\" but recently there have been no episodes of \"hello, president,\" and <mark>chavez</mark> said he expected his final rounds of radiation therapy, which began last month, to be rough. <mark>chavez</mark> has not discussed details of the radiation treatments, saying they have diminished his strength but have been going well. last weekend, he decided not to attend the summit of the americas in colombia, the sort of high-profile international event where he would previously have taken center stage. foreign minister nicolas maduro announced the decision, saying <mark>chavez</mark> was skipping the summit on the advice of his doctors. <mark>chavez</mark> began radiation treatment in cuba in late march after undergoing an operation in february that removed a second tumor from his pelvic region. the first was taken out last june. he has kept secret some details of his illness, including the type of cancer and the precise location of the tumors. <mark>chavez</mark> also was away in havana regularly last year while undergoing chemotherapy after the initial surgery. during previous trips to cuba, <mark>chavez</mark> periodically appeared on television, either in phone calls or appearances with his aides or daughters, and gave the appearance of continuing to work and keeping abreast of affairs at home. before his latest trip to cuba, <mark>chavez</mark> said he planned to stay away longer to allow for his last two rounds of radiation treatment. he urged his supporters to remain united and said an \"anti-coup command\" was being formed within his political movement to focus on maintaining stability and countering any possible attempt to destabilize his government. in the past week, his twitter messages have been read aloud by his cabinet ministers at televised events. at one event friday, <mark>chavez</mark>'s supporters responded with shouts of \"onward, comandante!\" in several twitter messages saturday, <mark>chavez</mark> urged his party to mobilize \"toward the big victory of oct. 7\" in the election. another said: \"comrades you make me happy! let's keep fighting very hard to defeat the bourgeoisie! a downpour is falling over havana, and i'm with you!\" <mark>chavez</mark>'s online messages aim to \"make it appear that the president is active, that the president is in control of what's going on in venezuela,\" said jose vicente carrasquero, a political science professor at venezuela's simon bolivar university. carrasquero, a government critic, said that while <mark>chavez</mark> has been coping with illness, long-standing problems such as rampant crime, inflation and sporadic shortages of some food items are going unresolved. without <mark>chavez</mark> on the air, state television has instead shown a salsa concert, documentaries and a mass. such programs and newscasts are interspersed with a short segment showing a healthy <mark>chavez</mark> embracing children in slow motion against a background of folk music. columnist fausto maso wrote in the newspaper el nacional that \"never has the uncertainty been greater in venezuela.\" pro-chavez lawmaker dario vivas dismissed concerns about <mark>chavez</mark> keeping a lower profile, saying the president remains fully in charge and is regaining his health. albuquerque, n.m. - a new mexico teacher asked a 13-year-old girl to stop talking with her friend and move to another seat. the girl refused. the teacher called the police. 1:00 am <mark>hugo chavez</mark>'s weeklong silence spurs uncertainty sat, apr 21 defense worried about zimmerman's safety in fla. sat, apr 21 u.n. monitors visit syria opposition stronghold sat, apr 21 more secret service agents quit amid prostitution scandal sat, apr 21 zimmerman apologizes for trayvon martin shooting, gets $150k bail tigers demote struggling reliever daniel schlereth, call up thad weber <mark>hugo chavez</mark>'s weeklong silence spurs uncertainty caracas, venezuela - venezuelan president <mark>hugo chavez</mark> has been out of sight for a week, speaking only through twitter messages and written statements while undergoing cancer treatment in cuba. detnews police in redford investigate triple murder late friday. the detroit news apps stay up to date on the go with the latest from the detroit news apps"}, {"articleID": "2013010322_00081060_W", "names": {"Jamie Fox": ["Q19957801", "Q41787887", "Q6146902"], "Tommy Lee Jones": ["Q170587", "Q7819623"], "Amy Adams": ["Q4451142", "Q4749062", "Q481832"]}, "date": "2013-01-03", "url": "http://hitfix.com/blogs/in-contention/posts/argo-lincoln-master-silver-linings-lead-denver-film-critics-nominations", "content": "\"argo,'\" lincoln,' \"master,'\" silver linings' lead denver film critics nominations? sign up to get the latest updates instantly. silver linings playbook \"led the way with four nominations each, though\" lincoln \"and\" the master \"were edged out of the best picture category by\" jessica chastain on mining for details and feminism's new moment in \"zero dark thirty' django unchained - trailer 2 quentin tarantino assembled a star cast for\" django unchained' with <mark>jamie fox</mark>... argo - interview with ben affleck argo director and lead actor ben affleck sits down with hitfix's greg ellwood...check out everything there is including photos, reviews, videos. best film \"argo\" \"django unchained\" \"silver linings playbook\" best director ben affleck, \"argo\" paul thomas anderson, \"the master\" kathryn bigelow, \"zero dark thirty\" best actor daniel day-lewis, \"lincoln\" john hawkes, \"the sessions\" denzel washington, \"flight\" best actress jessica chastain, \"zero dark thirty\" jennifer lawrence, \"silver linings playbook\" quvenzhan? wallis, \"beasts of the southern wild\" best supporting actor robert de niro, \"silver linings playbook\" philip seymour hoffman, \"the master\" <mark>tommy lee jones</mark>, \"lincoln\" best supporting actress <mark>amy adams</mark>, \"the master\" anne hathaway, \"les mis? rables\" sally field, \"lincoln\" \"the perks of being a wallflower\" \"silver linings playbook\" best original screenplay \"django unchained\" \"the master\" \"moonrise kingdom\" best original score \"argo\" \"the dark knight rises\" \"lincoln\" best original song \"suddenly\" from \"les mis? rables\" \"skyfall\" from \"skyfall\" \"when can i see you again?\" from \"wreck-it ralph\" best animated feature \"frankenweenie\" \"paranorman\" \"wreck-it ralph\" best documentary feature \"bully\" \"jiro dreams of sushi\" \"samsara\" option 1 comment instantly as a guest option 3 login or create a hitfix account \"argo,'\" lincoln,' \"master,'\" silver linings' lead denver film critics nominations anderson and spielberg's films edged out in best pic however also: dressing \"django unchained,' and the sexism of\" les mis' \"anna karenina,'\" cloud atlas,' \"skyfall' among art directors guild nominees"}, {"articleID": "2014092517_00056456_W", "names": {"Alan Duncan": ["Q302417", "Q4706546", "Q56885837"], "Derek Williams": ["Q10548473", "Q16196337", "Q28935704", "Q39039625", "Q5262465", "Q5262466"]}, "date": "2014-09-25", "url": "http://www.bbc.co.uk/news/uk-england-leicestershire-29362829#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa", "content": "Print Braunston-in-Rutland church \"blighted by bat faeces' Faeces and urine from a 500-strong colony of bats are affecting services at a 1000-year-old church in Rutland, officials have said. The bats are roosting in the roof of All Saints Church, in Braunston-in-Rutland, but cannot be removed as they are a protected species. Staff and volunteers are spending up to an hour-and-a-half cleaning before weddings and funerals can take place. They have also covered stones dating back to 1632 in order to protect them. Local MP Sir <mark>Alan Duncan</mark> said he would raise the issue with the Church Commissioner in Parliament. He said:\" This situation is absolutely intolerable and I have never seen such a mess. \"Bats might be a protected species, but they are clearly not facing extinction in Braunston any time soon.\" Speaking in the House of Lords earlier this year, Conservative peer Lord Cormack agreed bats were a \"particular menace\" to church-goers. He described an instance in which \"the vicar had to shake bat faeces out of her hair while celebrating holy communion at the altar\" . Officials said bat droppings can cause irreparable damage to buildings and artefacts Braunston church council member Sue Willetts told the Leicester Mercury: \"The young fly all over inside the church and their droppings are all over\" . She added: \"The first thing that hits you is the smell.\" <mark>Derek Williams</mark>, of Peterborough Diocese, added: \"Bat droppings can cause irreparable damage to buildings and artefacts, as well as inconveniencing visitors.\" We receive no state aid for church maintenance or for the kind of legal measures to discourage bats from roosting. \"But, according to the Bat Conservation Trust, the droppings themselves rarely cause damage, although bat urine can corrode metal. And, if faeces are left they can encourage algal growth that can damage surfaces. 05 AUGUST 2013, SCIENCE & ENVIRONMENT The Uncatchable How Greece's most wanted man became a folk hero Watch\" As many as it takes to protect myself from bad guys' #MuslimApologies The sarcastic hashtag that says \"Sorry for algebra '"}]