[{"articleID": "2013101422_00069235_W", "names": {"Steve Russell": ["Q16195304", "Q2634274", "Q30122065", "Q42277880", "Q43388452"]}, "date": "2013-10-14", "url": "http://www.recyclingtoday.com/Article.aspx?article_id=146726", "content": "Milwaukee to Promote Recycling of Plastic Bags, Wraps The city of Milwaukee has launched a campaign to increase the recycling of plastic bags and other film products. To kick off the program, Milwaukee Mayor Tom Barrett, along with a coalition of businesses, recycling advocates and government agencies, declared October as \"Milwaukee Plastic Film Recycling Awareness Month .\" The campaign will include a number of public outreach methods, including radio advertising. Wisconsin WRAP (Wrap Recycling Action Project), a public and private partnership that promotes recycling of plastic film beyond bags. The partnership is comprised of the American Chemistry Council's Flexible Film Recycling Group, the Wisconsin Department of Natural Resources, and GreenBlue and the Sustainable Packaging Coalition. \"Many Milwaukee residents already know that they can take back plastic grocery bags to many retail stores for recycling,\" says <mark>Steve Russell</mark>, vice president of plastics for the American Chemistry Council. \"But they also can take back other plastic bags and wraps, such as zip top food storage bags, the bags for newspapers, produce, bread, and dry-cleaning, and even the plastic wraps from products such as paper towels, diapers, cases of water and more .\" Plastic bags and wraps are returned for recycling to Milwaukee grocery and retail stores."}, {"articleID": "2015121007_00577369_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2015-12-10", "url": "http://poststar.com/entertainment/national/nkorea-s-kim-jong-un-sends-all-female-band-to/article_5493307d-6da3-5409-8404-54cb027d5dfb.html?comment_form=true#comments", "content": "NKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in China Agreement has been hard to come by in Hollywood's awards season, even when it comes to who's in the hunt for what. Recent Tonight, for my family's dining pleasure, we will be enjoying a large plate of fluffy scrambled eggs with a tempting side of toasted hamburger buns. Recent NKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in China Saved 2015-12-10T01:41:19 ZNKorea's <mark>Kim Jong Un</mark> sends all-female band to sing in ChinaThe Associated PressThe Associated Press1 hour ago (0) Comments BEIJING (AP)--An all-female band formed by <mark>Kim Jong Un</mark> will perform behind closed doors at Beijing's iconic performing arts center Thursday on a visit to cultivate better ties with China. The Moranbong Band, a group of women who sing and play instruments including violins, electric guitars and keyboards in short dresses and high heels, was set up by the North Korean leader in 2012. Its look is similar to pop bands from the North's hated rival, South Korea, but it has performed on stages in front of a giant screen showing various images of <mark>Kim Jong Un</mark> and a missile launch. The band will play alongside another North Korean musical troupe, the State Merited Chorus, at the National Center for Performing Arts for three nights starting Thursday. The performances are not open to the public, according to various people reached at the center who could give no details on who was invited. North Korea's state news agency, Korean Central News Agency, said the trip was a \"friendship visit .\" It said the Moranbong Band has played an ideological and cultural role in North Korea, \"arousing all the service personnel and people .\" Relations between China and North Korea have been strained since the accession in 2011 of <mark>Kim Jong Un</mark>, who seems to have focused on domestic politics to the detriment of relations with its traditional ally, China. The North Korean leader still has not visited Beijing. Chinese Foreign Ministry spokeswoman Hua Chunying said Wednesday that China would like to continue to developing friendly ties with its neighbor. \"Whether it's North Korea, Japan or any other country, we believe any form of civilian exchange and cooperation will boost understanding and friendship among the people,\" Hua said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. No Comments Posted. RULES FOR COMMENTING ONLINE 1) Comments must be contained to the topic of the articles only. Comments that stray from the direct subject of the article will be deleted. 2) Readers are free to comment on and debate other readers' comments, but comments must specifically address the issue (s) raised. Comments containing personal insults directed toward another reader in any form will be deleted. 3) Comments must be civil in tone, and there will be no name calling of any kind. Uncivil or inappropriate comments will be deleted, as will any comment containing profanities. 4) Comments critical of crime or accident victims will be deleted. 5) Comments that are potentially libelous, including those that contain accusations not supported by facts, will be deleted. Commenters who abuse these policies will have their e-mail registrations revoked."}, {"articleID": "2009031222_00040293_W", "names": {"Frank Edwards": ["Q16207149", "Q5486430", "Q59194970"]}, "date": "2009-03-12", "url": "http://watoday.com.au/wa-news/child-escape-loophole-in-wa-law-20090312-8w7g.html", "content": "march 13, 2009 - 6:57 am child protection minister has conceded for the first time that the failure to compel day care centres to report when children go missing is a loophole in wa law. in mid-january, watoday.com.au informed minister robyn mcsweeney of the anomaly after revealing how two-year-old oliver mcalister escaped from little rascals child care centre in kwinana on december 19 last year. oliver wandered out of the centre's screen door, onto a paved car park and left into an adjacent reserve. if instead he had strayed just 15 metres to the right, he would have stepped onto busy gilmore avenue. at the time, oliver's parents were appalled that the centre, one in a chain of 20 operated by child care industry identity rory vassallo, took until january 5 to report the incident. even though regulations allow for a charge to be laid and a $15,000 fine imposed for allowing a child to go missing, reporting of such incidents is not compulsory. now, two months after oliver's unsupervised walkabout, ms mcsweeney said the legal advice was in, and work on closing the loophole had commenced. \"the department of communities have sought advice from legal counsel regarding the tightening of legislation and are currently working through how proposed changes may affect current regulations,\" she said. a strikingly similar case to oliver's, where another two-year-old boy was allegedly allowed to wander around a northbridge car park in june last year, was reported by a child care centre operated by perth city council. perth council ceo <mark>frank edwards</mark> last year told watoday.com.au that the city had reported the child's disappearance because it understood this was mandatory. 14 jan | wa authorities are investigating how a major child care...| the city of perth has been charged with failing to ensure...14 jan | wa authorities are investigating how a major child care chain let a toddler wander unsupervised from a kwinana kindergarten to play in a park beside a main road. | the city of perth has been charged with failing to ensure the safety of a two-year-old boy who wandered from a council-run child minding centre in to a busy carpark in june."}, {"articleID": "2019100916_00265733_W", "names": {"Steve Cooper": ["Q18588205", "Q18640334", "Q24183505"]}, "date": "2019-10-09", "url": "https://investingnews.com/daily/tech-investing/emerging-tech-investing/artificial-intelligence-investing/oss-receives-us1-1-million-order-for-ai-computing-systems/", "content": "The global satellite company will be utilizing OSS's deep learning systems for processing satellite signals in Europe, North America and Asia. One Stop Systems (NASDAQ: OSS), a high performance computing company announced that it has received a contract from a satellite company totalling US $1.1 million. Through the deployment of its AI on the Fly platform, the satellite company will integrate its advanced systems for satellite signal processing. As quoted in the press release: These additional systems will be deployed within satellite ground stations located in the U.S., Europe and Asia Pacific. The systems support the regeneration and processing of satellite signals using AI deep learning models. \"This follow-on order demonstrates the Volta-16's strong fit for this AI on the Fly application, and reflects the industry trend toward deploying an extremely high level of computing power in the field,\" said <mark>Steve Cooper</mark>, president and CEO of OSS. \"We are excited to play a leading role in this fundamental transition in how AI capabilities are deployed world-wide .\" OSS plans to ship these systems in the fourth quarter of 2019. Click here to read the full press release. Find stocks in Artificial Intelligence Artificial Intelligence is used in technology across the globe. Should you invest in the market? Click here to get your free report on A.I. investing!"}, {"articleID": "2010022002_00048796_W", "names": {"James Holland": ["Q16209153", "Q544059"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Patrick Murray": ["Q16234061", "Q2057835", "Q43395509", "Q43912276", "Q7123558"]}, "date": "2010-02-20", "url": "http://us.rd.yahoo.com/dailynews/rss/search/data+%22security+breach%22+%22new+york%22/SIG=1262tq7ia/*http%3A//wcbstv.com/politics/frank.lautenberg.stomach.2.1505819.html", "content": "n.j. sen. lautenberg has \"curable' stomach cancer n.j. sen. lautenberg has\" curable' stomach cancer (2/16/2010) new jersey's senior senator, frank lautenberg, has been diagnosed with curable stomach cancer. doctors they expect the 86-year-old to make a full recovery. dr. <mark>james holland</mark> of new york city's mount sinai medical center said the five-term democrat will undergo chemotherapy treatments. \"we expect a full and complete recovery for senator lautenberg. the senator will be treated with chemotherapy administered approximately every three weeks. we anticipate that he will receive between six and eight treatments, and in between treatments, the senator is expected to be back at work in the senate,\" dr. <mark>holland</mark> said. lautenberg began his treatment friday afternoon. \"i wouldn't be too surprised to soon hear how he's once again outpacing younger aides as they walk through u.s. capitol building,\" said state assembly speaker sheila y. oliver, a democrat. lautenberg told the star-ledger of newark late friday that he was \"feeling very good .\" lautenberg said he intends to return to washington to complete his term. \"my contract goes to 2014,\" he said. in the event that lautenberg, the second-oldest u.s. senator, is unable to serve, republican gov. chris christie has the option of naming a replacement, calling for a special election, or leaving the seat vacant until the next regular election. however, in the state's political circles friday, there wasn't open talk of a lautenberg resignation. politicians of both parties wished him a quick recovery. \"i'm encouraged by the positive statements of his doctors, and i am confident that frank will be back in the senate fighting for new jersey soon,\" said senate majority leader <mark>harry reid</mark>, d-nev. u.s. sen. robert menendez, also a democrat, called lautenberg \"new jersey tough .\" \"my thoughts and prayers are with sen. lautenberg,\" he said, \"and i look forward to fighting for new jersey families together with him for years to come .\" assemblyman jay webber, chairman of new jersey's republican state committee, said it's \"inappropriate\" to talk about filling the seat should lautenberg be unable to finish his term. <mark>patrick murray</mark>, a monmouth university political scientist, said a lautenberg resignation would mean that new jersey would have its first republican senator since nicholas f. brady served for eight months after being appointed to fill a vacancy. lautenberg replaced him. the state hasn't elected a republican u.s. senator since 1976. \"three of the four elected statewide offices in new jersey would be held by republicans, which would be an oddity,\" said <mark>murray</mark>, who doesn't think lautenberg would resign unless he had to. university of virginia political scientist larry sabato said another republican in the senate would make it harder for democrats to get the 60 votes they need to block a filibuster. there are now 59 democrats in the senate. \"it's that much harder to get two republican defections instead of one,\" he said. the liberal lautenberg, born in paterson, became prominent as a founder of the payroll services company automatic data processing long before he entered politics in 1982 with a successful run for the u.s. senate. he retired from politics and did not seek re-election in 2000, but returned two years later as a last-minute replacement in a senate race when sen. robert torricelli dropped out. he was re-elected in 2008, winning easily in a race in which his age never materialized as a major issue. he is a major supporter of gun control and a big critic of the tobacco industry. he's also active in transportation issues. lately, he has criticized the transportation security administration over a disruptive security breach at newark liberty international airport. lymphoma is an immune system cancer, and the b-cell form is a type of the non-hodgkin's lymphoma that strikes more than 65,000 people in the u.s. annually. there are multiple subtypes of the b-cell form, with widely varying treatments and prognoses. lymphomas can strike in lymph tissue anywhere in the body, such as the lymph nodes--and the stomach contains lymphoid tissue. lautenberg was taken to the hospital monday after his office said he fell at his cliffside park home. the office said tuesday the senator was treated for a bleeding ulcer. doctors believe that diagnosis was also accurate."}, {"articleID": "2017123104_00461991_W", "names": {"Brett Wilkinson": ["Q18378912", "Q2924636"], "Danny Chan": ["Q16068695", "Q42162022", "Q706919", "Q9368727"]}, "date": "2017-12-31", "url": "http://m.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11962632", "content": "NZ Herald Brokers Picks 2018: Hot stocks for the new year updated 12 minutes ago 31 Dec, 2017 5:30 pm 7 minutes to read James Smalley says benefits from SkyCity's investment in its Auckland and Adelaide operations will materialise in the years ahead. Photo / 123RF Share on Reddit reddit Brokers have picked a diverse mix of stocks for 2018, in many cases opting for those that have underperformed in the last year or so. It's always worth remembering that winning the Brokers Picks competition requires different strategies to everyday investing. A single year is an arbitrary time frame--often not long enough for value investors but too long for traders. It is interesting to see the way participants opt for different ends of that spectrum in an attempt to capture a market beating annual result. Hamilton Hindin Greene has leaned most heavily towards value investing picking well established stocks that have been out of favour and could present a bargain. Advertisement The two most obvious examples in their selection are Fletcher Building and Comvita--both strong companies that were punished by investors in 2017. \"Fletcher Building aired plenty of dirty laundry in 2017,\" says Hamilton Hindin Greene's James Smalley \"Whilst the risk remains of more coming to light, we believe the risk of major surprises has been limited by the announcements to date, and the recent KPMG Audit .\" When you strip out the downgrades associated with the Building & Interiors business unit, Fletcher Building actually had a reasonable year, Smalley and his team noted. \"We expect continued strong performance from most divisions, and a return to more normal performance from the Building & Interiors business unit .\" Comvita had a tough year, its share price falling 37 per cent at one point before almost recovering back almost to break even by December. \"The decline was the result of investors' concerns of a lower than usual honey harvest, the discovery of myrtle rust in the North Island, and a drop-off in grey channel sales,\" says Smalley. Related articles: Share on Reddit reddit Hamilton Hindin Green also picks both SkyCity and Sky TV. SkyCity's share price has gone sideways for several years as the company continues to invest heavily into the expansion of its Auckland and Adelaide operations. We expect the benefits from this investment will materialise in the years ahead, Smalley notes. SkyCity seems a more curious play given the widespread view that the life span of its satellite transmission business model is limited. Sky TV's share price has been in a steady decline since 2014, and accelerated to the down side in 2017 to touch an all-time lows in December, Smalley notes. \"This is on the back of investor concerns regarding alternative internet based offerings such as Netflix and the ever present threat of Amazon. Despite this, it is worth noting Sky's revenue is still above where it was in 2013 and subscriber numbers above where they were in 2012 .\" That presents a potential short term upside--around the rights context for All Black rugby. \"We feel that given the complexity of the contracts with Sanzaar, and the wider rugby content distribution obligations, Sky is still the likely candidate. Negotiations are expected to begin in April 2018, with a renewal likely to ease investor concerns. The company has relatively low gearing, with total debt representing just over 20 months 2017 free cash flow. This free cash flow should also underpin a dividend that would be in the double digits at current prices .\" Craigs Investment Partners takes a similar approach with established stocks but leans towards those that have performed well in 2017 and could continue their run. Share on Reddit reddit Craigs head of Research Mark Lister notes it would have been nice to have had a2 milk in the mix for 2017 (it returned 274 per cent). While the a2 chart might look a bit shocking to some \"the fact is that a fair chunk of the gains have been driven by fundamental improvements in the business\" , Lister says. In 2014 a2 generated EBITDA of just $3.6 m, and in 2017 this increased to $141m. This is expected to growth even further, with EBITDA of more than $250m expected in the coming year. Forsyth Barr also has a2 in its picks for 2018. Share on Reddit reddit Tourism Holdings is another strong performer which Craigs is picking to continue its run in 2018. It delivered nearly 70 per cent return for 2017. \"The tourism sector remains in very good shape, despite some capacity issues in places like Queenstown,\" says Lister \"THL is also a vastly different company than it was ten years ago, with management having made a lot of progress in reshaping the business and positioning it for growth. More than half the company's revenue comes from outside New Zealand, so it also fits the bill for us in terms of global growth options and some international diversification .\" The only stock to get picked by three brokers this is year is Restaurant Brands--another strong performer through 2017. Craigs, Hobson Wealth and Vulcan Capital all have it in the mix. Share on Reddit reddit \"[Restaurant Brands is] well placed to continue their impressive growth trajectory through global expansion initiatives as well as the continued roll-out of store refreshes, Hobson Wealth Partners notes. Says Lister:\" RBD has approximately 45 per cent of revenues from outside New Zealand, which provides some insulation from a potentially slower economy, the benefit of any NZ dollar weakness, as well as a number of international growth opportunities. \"After that the picks start to get pretty diverse. A number of brokers have picked small cap stocks that have potential for large percentage gains if they capture market attention. MSL Capital Markets sticks with Green Cross Health and Plexure--two companies that dragged down their results in 2017. Share on Reddit reddit Green Cross Health is a diversified healthcare business (owning or supporting 330 Pharmacies under the Life Pharmacy and Unichem Brands, 23,000 Community Nursing clients and 46 Medical Centres).\" It is our preferred exposure to the healthcare sector and ageing population theme, \"says MSL's Andrew McDouall .\" The arrival of offshore competition to the Pharmacy division has seen share price weakness which we believe is an over-reaction and provides a buying opportunity. \"Plexure is a digital advertising company (originally known as V-Mob). It moved into profitability in 2017, notes McDouall, and is selling now on a revenue multiple of less than 1 times .\" Given the quality of their main contract with McDonalds and the worldwide rollout through the McDonalds franchises there should be significant earning uplift in 2018, \"he says. First NZ Capital also picks some outsiders this year including EROAD--a tech company specialising in road transport payment solutions. And Tilt Renewables a solar and wind generation player formed from the de-merger of Trustpower. The ultimate speculative play this year comes from Vulcan's <mark>Brett Wilkinson</mark> who's included a company called QEX logistics--which is expected to list in January. <mark>Wilkinson</mark> notes that the QEX, whose directors include former Federated Farmers chairman Connor English (Bill's brother) and local rich Lister <mark>Danny Chan</mark> has completed capital raising and is ready to roll. However, the NZX notes that (at time of writing) QEX Logistics have not yet released a listing and quotation notice. Disclaimer--It's a game Readers should recognise that the results of the Brokers Picks are skewed by some features of the game. The figures exclude brokers fees. Brokers are asked to choose the securities that will give the best short-term performance. If they had been asked to choose, for example, a five-year term, the results might be different. The survey does not allow brokers to review choices during the year. The survey implies a one-size-fits-all approach. It takes no account of individual circumstances such as an investor's appetite for risk, need for income or tax circumstances. The views expressed do not constitute personalised financial advice and are not directed at any person. Finally, past performance is no guarantee of future performance. We hope it provides a good basis for further research and discussion about investment in the local market."}, {"articleID": "2017061403_00401834_W", "names": {"John King": ["Q11169832", "Q11728008", "Q12320190", "Q1232745", "Q15460643", "Q16018812", "Q16237828", "Q17859802", "Q18043577", "Q18626490", "Q19665420", "Q21461592", "Q22095928", "Q27958442", "Q30597402", "Q57312040", "Q6234532", "Q6239042", "Q6243110", "Q6243113", "Q6243117", "Q6243127", "Q6243129", "Q6243132", "Q6243134", "Q6243136", "Q6252241", "Q671520"]}, "date": "2017-06-14", "url": "http://www.breitbart.com/big-government/2017/06/13/opposition-mainstream-media-concede-jeff-sessions-wins-this-round/#disqus_thread", "content": "On Tuesday, even the opposition establishment media had to concede that Attorney General Jeff Sessions emerged from his Senate Intelligence Committee hearing virtually unscathed. Much to the dismay of left-wing Democrats and their allies in the legacy press, Sessions shot down the notion that he somehow colluded with Russians during the 2016 election. He swatted away theories that he recused himself from the collusion investigation because he may have done something wrong. He displayed just the right amount of righteous indignation in defending his honor to come across as a trustworthy figure. As former CIA counterterrorism official Philip Mudd, who has viciously criticized President Donald Trump and his administration, conceded on CNN, Sessions \"wins this round .\" \"He didn't lay facts on the ground that could be disputed,\" Mudd said. \"I didn't see anything today that suggested that Sessions did anything illegal. I think he wins this round .\" CNN's <mark>John King</mark> said that \"unless facts surface to the contrary,\" Sessions \"helped himself quite a bit and rebutted the notion that he was involved in some type of collusion .\" Wolf Blitzer said Sessions made a \"strong case why he should recuse himself .\" CNN's Jeffrey Toobin said because Sessions did not answer questions about his conversations with Trump without citing executive privilege, the White House \"had its cake and ate it too .\" CNN's Gloria Borger agreed. CNN's David Chalian said when Sessions spoke about his \"meeting\" with Russian Ambassador Sergey Kislyak, Sessions was \"quite adamant\" and \"dispatched\" with \"that whole Mayflower meeting .\" He also gave Sessions high marks on his testimony regarding his recusal from the collusion investigation. And even on left-wing MSNBC, Ari Melber conceded that Sessions \"did well\" in his \"legal performance\" and played a bad hand very well. Sessions: Russia Collusion Charge \"Appalling and Detestable Lie' In his introductory remarks, Sessions emphatically denied that he colluded with Russian officials in any way during the 2016 election, saying that charge was\" an appalling and detestable lie. \"He also disputed reports that he met with Kislyak at the Mayflower Hotel in Washington, DC in 2016 .\" Let me state this clearly, colleagues. I have never met with or had any conversation with any Russians or any foreign officials concerning any type of interference with any campaign or election in the United States, \"Sessions said .\" Further, I have no knowledge of any such conversations by anyone connected to the Trump campaign. \"Sessions: It's an\" appalling and detestable lie \"that he would collude with a foreign power https: //t.co/pDkbqXXKN7 #SessionsHearing pic.twitter.com/0qU3XGtfe0--Bloomberg (@ business) June 13, 2017 Sen. Tom Cotton (R-AR) boosted Sessions' case when, after asking Sessions if he enjoys spy novels, Cotton asked,\" Have you ever...in any of these fantastical situations heard of a plot line so ridiculous that a sitting United States senator and an ambassador of a foreign government colluded at an open setting with hundreds of other people to pull off the greatest caper in the history of espionage? \"Sessions replied that it\" is just like through the looking glass. I mean, what is this? I explained how in good faith I said I had not met with Russians, because they were suggesting I as a surrogate had been meeting continuously with Russians. \"\"I said I didn't meet with them and now, the next thing you know I'm accused of some reception plotting some sort of influence campaign for the American election,\" he added. \"It's just beyond my capability to understand .\" Addressing reports that he may have met privately with Kislyak at the Mayflower Hotel, Sessions insisted, \"I did not have any private meetings, nor do I recall any conversations, with any Russian officials at the Mayflower hotel .\" Sessions said he did not \"attend any meetings separately prior to\" Trump's speech that day. \"I attended a reception with my staff, that included at least two dozen people and President Trump, though I do recall several conversations I had during that pre-speech reception, and I do not have recollection of meeting or talking to the Russian ambassador or any other Russian officials,\" he said. \"If any brief interaction occurred in passing with the Russian ambassador in that reception, I do not remember it. After the speech, I was interviewed by the news media. There was an area for that in a different room and then I left the hotel. Whether I attended a reception where the Russian ambassador was also present is entirely beside the point of this investigation into Russian interference in the 2016 campaign .\" Sessions Says He Recused Himself to Follow Law Sessions made it clear that he did not recuse himself from the FBI's Russia investigation because he was under investigation or did something wrong. He adamantly made the case that he was simply following the law. \"Many have suggested that my recusal is because I felt I was a subject of the investigation myself, I may have done something wrong,\" he said. \"This is the reason I recused myself: I felt I was required to under the rules of the Department of Justice and as a leader of the Department of Justice, I should comply with the rules obviously .\" AG #Sessions on why he recused himself from #Russia investigation: \"I felt I was required to under the rules of the Department of Justice .\" pic.twitter.com/gheQdM8q6m--CSPAN (@ cspan) June 13, 2017 Sessions added that he recused himself \"not because of any asserted wrongdoing\" on his part during the campaign but \"because a Department of Justice regulation, 28 CFR 45.2, required it .\" \"That regulation states, in effect, that [Justice Department] employees should not participate in investigations of a campaign if they have served as a campaign adviser,\" he said. Addressing the criticism that he may have improperly recommended that Comey be fired after his recusal, Sessions said that it is \"absurd, frankly, to suggest that a recusal from a single specific investigation would render the attorney general unable to manage the leadership of the various department of justice law enforcement components that conduct thousands of investigations .\" He said he and Deputy Attorney General Rod Rosenstein believed that when Comey \"declined the Clinton prosecution, that was really a usurpation of the authority of the federal prosecutors in the Department of Justice. It was a stunning development .\" Sessions said he ultimately determined that \"a fresh start at FBI was the appropriate thing to do .\" He added that \"there were other things that had happened that indicated to me a lack of discipline and it caused controversy on both sides of the aisle and I had come to the conclusion that a fresh start was appropriate and did not mind putting that in writing .\" Sessions Challenges Comey's Testimony Comey testified that he did not receive \"any kind of memorandum issued from the attorney general or the Department of Justice to the FBI outlining the parameters of\" Sessions' recusal, but Sessions countered on Tuesday by saying that his chief of staff sent an email to Comey about his recusal. \"On the date of my formal recusal, my chief of staff sent an email to the heads of the relevant departments, including by name to director Comey of the FBI, to instruct them to inform their staffs of this recusal and to advise them not to brief me or involve me in any such matters. And in fact, they have not,\" Sessions said. Sessions also challenged Comey's account in which Comey said Sessions did not respond when Comey said he was uncomfortable being alone with Trump. In fact, Sessions said Comey never told him why he was uncomfortable in the first place. \"Mr. Comey expressed concern about the proper communications protocol with the White House and with the president,\" Sessions said. \"I responded to his comment by agreeing that the FBI and Department of Justice needed to be careful to follow department policies regarding appropriate contacts with the White House .\" Sessions added that Comey \"could have complained to the deputy or to me at any time that he felt pressure,\" but did not do so. AG Sessions gives testimony about conversation where former FBI Director Comey expressed concern about communications with the White House. pic.twitter.com/4BExYbOQyU--ABC News (@ ABC) June 13, 2017 Citing \"Longstanding Position of Department of Justice,' Sessions Doesn't Disclose Confidential Communications with Trump Democrat after Democrat asked Sessions about his conversations with Trump, and Sessions never budged, citing\" longstanding policy \"at the Department of Justice. Establishment media reporters and Democrats sensed that this line of questioning was where Sessions--or someone else associated with Trump--could be put in legal limbo, but Sessions did not give them anything. He declined to answer Sen. Dianne Feinstein's (D-CA) questions about his potential meetings with Trump. He told Sen. Ron Wyden (D-OR) that,\" I am not stonewalling. I am following the historic policies of the Department of Justice. \"\"You don't walk into hearing or committee meeting and reveal confidential communications with the President of the United States who is entitled to receive conventional communications in your best judgment about a host of issues and have to be accused of stonewalling them,\" he said. When Sen. Martin Heinrich (D-NM) accused Sessions of impeding and obstructing the investigation, Sessions said, \"I am telling the truth in answering your question and saying it's a longstanding policy of the Department of Justice to make sure that the president has full opportunity to decide these issues .\" When Sen. Kamala Harris (D-CA) interrogated him to try to enhance her national profile, Sessions said, \"I have some appreciation for as far as having spent 15 years in the Department of Justice, 12 as United States attorney, and that principle is that the Constitution provides the head of the executive branch certain privileges and...one of them is confidentiality of communications, and it is improper for agents of any of...any departments in the executive branch to waive that privilege without a clear approval of the president .\" AG Sessions declines to answer whether he discussed Comey's handling of Russia probe with Pres. Trump https: //t.co/rYsOYVGAu6 pic.twitter.com/DthE32wUtq--ABC News Politics (@ ABCPolitics) June 13, 2017 Sessions Defends Honor with Righteous Indignation, Comes Across as Trustworthy Perhaps most importantly, Sessions came across as credible while addressing his former colleagues. It is worth noting that many mainstream media reporters pointed out that even senators who disagreed with Sessions on issues like immigration did not question his trustworthiness during his tenure in the Senate. \"I was your colleague in this body for 20 years, at least some of you. And the suggestion that I participated in any collusion that I was aware of, any collusion with the Russian government to hurt this country which I have served with honor for 35 years, or to undermine the integrity of our democratic process is an appalling and detestable lie,\" Sessions said. When Wyden, echoing Comey, kept insisting that Sessions may be hiding the real--and nefarious--reason for his recusal, Sessions again showed his righteous indignation, thunderously saying that, \"this is a secret innuendo being leaked out there about me, and I don't appreciate it. I try to give my best and truthful answers to any committee I've appeared before, and...people are suggesting through innuendo that I have been not honest about matters, and I've tried to be honest .\" Earlier, Sessions had said that, \"I recused myself from any investigation into the campaign for president, but I did not recuse myself from defending my honor against scurrilous and false allegations .\" At the end of the day, even CNN's <mark>King</mark> had to give Sessions high marks on \"personal integrity\" and \"trustworthiness .\" VIDEO: AG Sessions bristles at questions about why he recused himself from Trump-Russia probe. https: //t.co/yrCNCoH02A pic.twitter.com/3CGJeOJJRT--AP Politics (@ AP_Politics) June 13, 2017"}, {"articleID": "2011080218_00005207_W", "names": {"Kamal Hossain": ["Q327967", "Q6355437"]}, "date": "2011-08-02", "url": "http://thedailystar.net/story.php?nid=197023", "content": "eminent jurists have expressed concern over the chaos, scuffles, slogans and exchange of abuse before a high court bench yesterday. the situation arose after an unruly lawyer hurled a plastic made object at the judges, protesting an observation of the bench. \"i'm greatly distressed over the reported incident that took place in the high court today [yesterday],\" said dr <mark>kamal hossain</mark>. such actions are totally unacceptable as it threatens the judges and the lawyers and, indeed, the very existence of the supreme court, he told the daily star. another eminent jurist dr m zahir said, \"i'm shocked by the behaviour of my colleagues whatever the reason may be. they have tagged the image of the judiciary to an abysmal depth .\" barrister rokanuddin mahmud said aggressive behaviour in the courtroom is completely unacceptable. in addition to practicing law, lawyers are duty-bound to ensure that there is no chaos in the courtroom over the court order, he added. he said the court has the jurisdiction to take actions against those responsible for the incident. \"the court could have taken punitive action, but it showed mercy by not doing so .\" noted lawyer shahdeen malik said, \"aggressive behaviour and attitude have become synonymous with our politics. now it seems the intolerant behaviour with each other has affected the bar and these were not mitigated by the bench .\" "}, {"articleID": "2017120304_00473475_W", "names": {"Mark Dixon": ["Q6767380", "Q6767382"], "Jeff Robinson": ["Q16193823", "Q16229109", "Q6174821", "Q6174823"], "Nick Jones": ["Q16229192", "Q17198222", "Q24799774", "Q3876016", "Q52892180", "Q7027374", "Q7027375"]}, "date": "2017-12-03", "url": "http://www.heraldcourier.com/sports/vhsl-a-state-football-chilhowie-s-cale-didn-t-flinch/article_9cd9065c-d7e3-11e7-9861-27ef32756276.html", "content": "GALAX, Va.--Galax High School football coach <mark>Mark Dixon</mark> recognizes a talented player when he sees one and he saw one on Saturday in Chilhowie junior quarterback Zack Cale. \"I knew how good he was,\" <mark>Dixon</mark> said. \"And he was even better than what I thought .\" Cale was a dual threat dynamo on Saturday--as he has been all season--in helping Chilhowie claim a 25-21 victory over Galax in the VHSL 1A state semifinals. Cale threw for 204 yards and hooked up with Will Russell and Lucas Doss for scores, while also gaining 97 yards on the ground. The Galax defense was kept on its toes by the 6-foot, 170-pound speedster, who eluded Maroon Tide tacklers all day. \"He bought a lot of time scrambling,\" <mark>Dixon</mark> said. \"We got pressure a lot, but then we just got wore down chasing him. In the end, when we needed to get pressure, I thought we were a little bit tired and then we got a little cautious of how we were rushing because he kept breaking the pocket so much .\" There were some mistakes by Cale--he threw an interception and lost a fumble--but you take the bad with the good when it comes to a player of his caliber. \"That's who he is,\" said Chilhowie coach <mark>Jeff Robinson</mark>. \"He's a playmaker. He's going to lose yardage sometimes and then he's going to make the plays. He made more of those plays today than he didn't .\" Cale has a gift of being able to put the play which just occurred out of his mind as soon as it ends and focusing on the moment at hand. Take for instance how calm, cool and collected he was on the eight-play, 76-yard drive late in the fourth quarter that put Chilhowie ahead to stay. He completed a 3rd-and-10 pass to Russell that gained 25 yards. He had an 18-yard completion to <mark>Nick Jones</mark>. There was a 36-yard strike to Doss on the penultimate play of the drive. He culminated the march by handing it off to Greg Sanchez, who plowed into the end zone from the 2-yard line with 2:16 left as a 21-18 deficit was turned into a 25-21 lead. \"I knew I made some mistakes and I knew I had to step up and make some more big plays,\" Cale said. There was one play in particular that showed what Cale can do. \"Number 69 [Christian Brown] chased him for about 30 yards one time, still didn't get him and Zack completed a 30-yard pass,\" <mark>Robinson</mark> said. \"That's a backbreaker when you're playing defense that hard .\" Cale was all smiles after a performance that put Chilhowie in Saturday's state championship game against Riverheads. \"This is great,\" Cale said. \"We've been working for this all summer. It's a great feeling for all of us .\" As the confident QB took questions from a local media member following the game, a teammate stood behind him and kiddingly observed. Cale didn't flinch. Nothing seems to rattle this guy. \"Zack Cale's got ice water in his veins,\" <mark>Robinson</mark> said. \"How many plays did he make in that game?\" Too many to count."}, {"articleID": "2010031707_00129471_W", "names": {"Richard Hammond": ["Q297265", "Q7326237"], "Gordon Ramsay": ["Q15280", "Q22279905", "Q27557641"]}, "date": "2010-03-17", "url": "http://blogs.timesofindia.indiatimes.com/beamingfromblighty/entry/only-proper-books-need-apply", "content": "so it was \"get dressed as your favourite book character day\" at my son's school on thursday, on account of world book day. after much head scratching, we decided he would go as harry potter. the grim reaper's shroud left over from a halloween party was modified into a wizard's robe; a scabbard became a fancy wand and with his father's old pair of glasses (with the lenses taken out) and a mascara lightning-shaped scar on his forehead, he was ready. he went to school, practicing saying \"expelliarmus!\" under his breath. at the bus stop, there was a fantastic mr fox, another harry potter, a willy wonka and a few more roald dahl characters. but what i couldn't guess what character a girl the same age as my son, wearing a funky version of her school uniform, with her tie askew and a lurid short skirt over a pair of black tights, was. i quizzed her mother and got the answer that the girl was a st trinian's school girl. \"ah!\" , said i. \"yeah, she rejected the white witch cos it wasn't cool enough\" , completed the mum. this is what has come down too - relative coolth of even everyday choices like characters from books. while i am not so much of a fuddy duddy to not understand the child's desire to fit in with his / her peers, i am very much miffed, on the other hand, by the profusion of st trinian books and other books of similar ilk that grace the local book store's shelves. i walk into my high street bookstore and at the window, horrid henry greets me, along with tracey beaker. inside, they are joined by the stig, bakugan and the ninja turtles. the famous fives and secret sevens tucked away in the corners don't even get a look in. but, to be fair, at least the children venture into roald dahl and dr seuss thanks to efforts such as book day. the adults have no such luck. glamour model jordan, with roughly an autobiography for every increase of her cup size, dominates the fare in the adult's books section. whatever shelf space remains is split between other celeb \"authors\" - <mark>richard hammond</mark>, jeremy clarkson, kerry katona and the celeb chefs' books from their latest tv series. only a determined soul can smash past these barriers and delve into the store, to get a \"proper book\". whilst i do understand that it is called \"pop culture\" for a reason, i do not see why it should take centre stage, leaving the \"proper\" books languishing in the sidelines. there is only so much of the celeb news that one can take and personally speaking, i am well beyond my saturation point. i do not want to know how kerry lost 2 stone, what new truths jordon has discovered and what <mark>gordon ramsay</mark> has to say about india. lavanya donthamshetty is an indian-born blogger, who has made england her home since moving abroad in 2001. funny, quirky, sardonic and sarcastic, this madrasi mum of two has been writing for various websites since graduating from college. she is also an occasional contributor at and naachgaana.com. \"beaming from blighty' will be a smorgasbord of thoughts and ideas as they occur to the writer, as she sits in her very own corner of merrie england. parenting, nostalgia, random articles of newsworthiness will all find a spot here."}]