[{"articleID": "2014121105_00029974_W", "names": {"Rob Bowman": ["Q693016", "Q7339989", "Q7339991"], "Carla Thomas": ["Q2939046", "Q462426"], "William Bell": ["Q14950256", "Q19395422", "Q29000856", "Q3028826", "Q3568581", "Q43910767", "Q53844101", "Q59070365"], "Albert King": ["Q3608060", "Q55754035"], "Kim Weston": ["Q1741589", "Q6409563"], "Jim Stewart": ["Q16751261", "Q1689226", "Q21622965", "Q39078816", "Q6198338", "Q6198340", "Q782370"], "Shirley Brown": ["Q30122835", "Q7498706", "Q7498707"]}, "date": "2014-12-11", "url": "http://www.noise11.com/news/stax-to-release-box-set-of-singles-20141211", "content": "Concord Music Group and Stax Records have announced the digital release and physical reissue of two comprehensive box set titles: The Complete Stax/Volt Soul Singles, Vol. 2: 1968-1971 and The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975. Originally released in 1993 and 1994, respectively, these two compilations will be re-released back into the physical market in compact and sleek new packaging. Each set includes full-color booklets with in-depth essays by Stax historian and compilations co-producer <mark>Rob Bowman</mark>. The volumes feature stalwart Stax R & B artists including Isaac Hayes, the Staple Singers, Rufus <mark>Thomas</mark>, Johnnie Taylor, <mark>Carla Thomas</mark>, the Bar-Kays and <mark>William Bell</mark>, as well as bluesmen Little Milton, <mark>Albert King</mark> and Little Sonny, and \"second generation\" Stax hitmakers like Jean Knight, the Soul Children, <mark>Kim Weston</mark>, the Temprees, and Mel & Tim. Many of the tracks included in these collections will be made available digitally for the very first time. The story of the great Memphis soul label Stax/Volt can be divided into two distinct eras: the period from 1959 through the beginning of 1968, when the company was distributed by Atlantic and was developing its influential sound and image (chronicled in acclaimed 9-CD box set The Complete Stax/Volt Singles 1959-1968, released by Atlantic in 1991); and the post-Atlantic years, from May 1968 through the end of 1975, when Stax/Volt began its transition from a small, down-home enterprise to a corporate soul powerhouse. In Stax's early years as an independent label, founders <mark>Jim Stewart</mark> and Estelle Axton struggled with the loss of its back catalog to Atlantic/Warner Brothers Records and the loss of the label's most lucrative artist, Otis Redding, who tragically died in a plane crash months before. In need of funding and new stars, Axton and <mark>Stewart</mark> sold the label to Gulf + Western, bringing on promotion head Al Bell (who would soon become an equal partner and major figurehead of the label). In his Vol. 2 essay, <mark>Rob Bowman</mark> recalls, \"As the sun arose in Memphis on May 6, 1968 [the day Stax officially became independent of Atlantic], Stax had been essentially gutted. For all intents and purposes it was a new record company poised to issue its first few records .\" Comprised of nine CDs, Vol. 2 focuses on this period, 1968 through 1971, when Stax/Volt was forging ahead as its own entity. The 216-song collection includes all of the singles issued by the label during this time period, and features some of the biggest and best-loved hits of the day, including Isaac Hayes' Theme From Shaft, The Staple Singers' Respect Yourself and Johnnie Taylor's Who's Making Love, as well as a number of little-known gems by both major and less-familiar artists. By the end of 1971, <mark>Bowman</mark> notes, \"Al Bell's dream of [Stax/Volt] becoming a diversified full-line record company was several steps further along the line to being reality. The label now recorded a wealth of different styles and flavors of black popular music, ranging from the jazz and easy-listening proclivities of Isaac Hayes to the blues of Little Milton to the '70s disco-infused vocal style of the Dramatics to the gutsy soul of the Staple Singers .\" Indeed, the early 1970s found Stax/Volt a much bigger entity than ever thought possible during its initial split from Atlantic, with Isaac Hayes as its breakout star. Spurred by the success of Hayes' GRAMMY Award-Winning Shaft soundtrack in early 1972, the label was casting its net across a wide cross section of the entertainment industry, entering into new territory with soundtracks, comedy records, and even investing in a Broadway play. The Complete Stax/Volt Soul Singles, Vol. 3: 1972-1975, coming Spring 2015, covers this era of success and excess, when Stax's stars were shining bright, but the label was on the verge of its dramatic denouement. The 10-disc box set contains all 213 soul singles issued by Stax/Volt during this time, including such hits as <mark>Shirley Brown</mark>'s Woman to Woman and the Staple Singers' I'll Take You There. In 1976, faced with involuntary bankruptcy and an unsuccessful distribution deal with CBS Records, Stax was forced to close its doors. In his liner notes for Vol. 3, compilation co-producer Bill Belmont writes, \"Stax's difficult and inglorious end in no way diminishes its vital contributions to rhythm and blues and soul. Today, the music of Stax maintains a strong and steady presence, heard continually in cover versions by major artists, in movies and on television. Simply put, the Memphis Sound lives .\" And indeed it does. With a revival of the label in recent years, through Fantasy Records, the 2003 opening of the Stax Museum of American Soul Music in Memphis, Tenn., as well as several developing theatrical performances around the label, the music of Stax will continue to influence generations of musicians and fans alike .----------------------------------------------Never miss a story! Get your free Noise11. com daily music news email alert. Subscribe to the Noise11 Music Newsletter here Listen to the Noise11 Music News channel now at iHeartRadio Follow Noise11. com on Facebook and Twitter----------------------------------------------more from vvnmusic-com Comments comments Tagged as: music news, Stax Tweet"}, {"articleID": "2011071922_00059924_W", "names": {"Thomas Hill": ["Q2424735", "Q3066250", "Q55361165", "Q733899", "Q7790682"]}, "date": "2011-07-19", "url": "http://sacramentopress.com/headline/53559/Museum_Adventures_for_Mom_Dad_and_Tots", "content": "museum adventures for mom, dad and tots crocker art museum has launched a museum guide and an interactive gallery for families. kids and their parents walk from the original building into the new crocker to begin story trail. this morning crocker art museum staff led kids and adults on a story trail. featuring a captivating storybook, \"birdy's museum adventure\" leads families on an adventure through the museum to look, discuss and discover seven works of art. \"birdy's museum adventure\" can be checked out at the admission desk to begin a fun exploration into the galleries with trail markers to lead the way. the kids were really engaged as we followed along. children were introduced to \"birdy's museum adventures\" book and were led into the crocker. trail markers are posted along the way, guiding participants through the museum. a bird perched above trail marker #2 waiting to be discovered. there are surprises along the way, such as this piece of art. artist <mark>thomas hill</mark>'s \"sugar loaf peak, el dorado county, 1865\" is one of the featured paintings in \"birdy's\". another stop along the way on the second floor in the original building. our adventure concluded at tot land, a gallery devoted entirely to families. located in the museum's education center, the gallery is designed to encourage creativity while building eary-learning skillls. tot land features an interactive touch screen for creative play. resources available in tot land support a successful path to early literacy and creative thinking. verification email has been sent. to validate your account open the link provided in the message."}, {"articleID": "2019062004_00024725_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2019-06-20", "url": "http://www.yeovilexpress.co.uk/news/national/17718197.chinese-president-arrives-in-north-korea-for-talks-with-kim-jong-un/", "content": "Chinese president arrives in North Korea for talks with <mark>Kim Jong Un</mark> By Press Association 2019 China North Korea Summit 0 comment Chinese President Xi Jinping has arrived for a two-day state visit to North Korea where he is expected to talk with leader <mark>Kim Jong Un</mark> about the stalled negotiations with Washington over Pyongyang's nuclear weapons. China's official Xinhua news agency reported that Mr Xi was accompanied by his wife, Peng Liyuan, and several Communist Party officials. He is the first Chinese president to visit North Korea in 14 years. The summit comes as both leaders are locked in separate disputes with the United States--Mr Xi over trade and Mr <mark>Kim</mark> over his nuclear weapons. There has been tension over the North's relentless push for nuclear weapons (Korean Central News Agency/Korea News Service via AP, File) A Xinhua commentary said China could play a unique and constructive role in breaking the cycle of mistrust between North Korea and the US so they can work out a roadmap to achieve denuclearisation. The US has demanded that North Korea abandon its nuclear weapons development before international sanctions are lifted. North Korea has sought a step-by-step approach in which a step toward its denuclearisation would be matched by a concession from the US, notably a relaxation of economic sanctions. China backs what it calls a \"suspension for suspension\" proposal. Xinhua said both sides \"need to have reasonable expectations and refrain from imposing unilateral and unrealistic demands\". Experts say Mr Xi will likely endorse North Korea's calls for an incremental disarmament process. Mr Trump last met Mr <mark>Kim</mark> in February (AP/Evan Vucci, File) Chinese and North Korea media have said Mr Xi would stay in Pyongyang for two days. His meeting with Mr <mark>Kim</mark> would be their fifth summit since Mr <mark>Kim</mark> entered nuclear diplomacy with the United States and South Korea early last year. In an essay published in both countries' official media before his trip, Mr Xi praised North Korea for moving in the \"right direction\" by politically resolving issues on the peninsula. He did not mention Mr <mark>Kim</mark>'s nuclear diplomacy with the US in the article, much of which focused on lauding the neighbours' seven-decade relationship. Mr Xi said his visit will \"strengthen strategic communication and exchange\" between the traditional, though sometimes strained, allies. The nations fought together in the 1950-53 Korean War against the United States, South Korea and their allies, but there has been friction in recent years, especially over the North's relentless push for nuclear weapons. 0 comment"}, {"articleID": "2014113018_00021697_W", "names": {"Christopher Nolan": ["Q224912", "Q25191"], "Joan Collins": ["Q152843", "Q47122349", "Q6204959"], "Ray Rice": ["Q1523516", "Q23823439"], "Justin Long": ["Q298672", "Q6317841"]}, "date": "2014-11-30", "url": "http://feeds.foxnews.com/~r/foxnews/entertainment/~3/2PZiYCbgglA", "content": "Jennifer Lawrence portrays Katniss Everdeen in a scene from \"The Hunger Games: Mockingjay Part 1 .\" \"The Hunger Games: Mockingjay - Part 1 ″ was the clear choice among Thanksgiving moviegoers, but Katniss Everdeen didn't leave much left over for\" Horrible Bosses 2 ″ or \"Penguins of Madagascar\" to feast on, reports Variety. The futuristic adventure pulled in a massive $82.7 million over the five day holiday and $56.9 million in its sophomore weekend. ADVERTISEMENT Unfortunately, \"Turkey Day's\" two new entrants disappointed in their debuts. The spin-off of DreamWorks Animation's \"Madagascar\" franchise made $25.8 million in its first weekend from 3,762 locations and $36 million over the five day holiday. It had been expected to generate in the mid to high $40 million range in ticket sales. The film cost $132 million to produce, so it will look to overseas audiences as it tries to become profitable. \"Horrible Bosses 2 ″ pulled in $15.7 million this weekend, which was only good enough for a fifth place finish. It pulled in $23 million for the five day period from 3,375 locations, a shadow of the $35 million it was expected to make. The good news is that with a $43 million production budget, the\" Bosses \"sequel was relatively inexpensive to cook up. Overall, the Thanksgiving box office was down 20% from 2013. Even\" Mockingjay - Part 1, \"which became the third highest grossing Thanksgiving release, couldn't keep pace with the ghosts of\" Hunger Games \"past. Last year, its predecessor,\" Catching Fire, \"set a new record, picking up $110 million during the five day holiday. That year also saw\" Frozen \"become the year's second highest grossing Thanksgiving week release of all time with $93 million. The film's North American total through the weekend is $225.7 million. Internationally,\" Mockingjay - Part 1 ″ grossed an estimated $67 million from 86 foreign markets, bringing its estimated foreign total to $254.4 million. Two holdovers benefited from the traffic at the multiplexes. \"Big Hero 6 ″ continued to draw family crowds and likely cut into\" Penguins of Madagascar's \"box office numbers. The animated film picked up roughly $26 million over the five days and $18.7 million for the weekend .\" Interstellar \"also showed impressive stamina. <mark>Christopher Nolan</mark>'s space adventure has enjoyed a lift from Imax screens, which it holds onto until\" The Hobbit: The Battle of Five Armies \"lands in theaters on Dec. 17. The film earned more than $16 million .\" Dumb and Dumber To \"nabbed $8.3 million in its third week in theaters, driving its domestic total to $72.2 million. On the opposite end of the intelligence spectrum,\" The Theory of Everything \"performed well in its expansion, earning $5.1 million. The biopic about astrophysicist Stephen Hawking moved from 104 to 802 domestic locations this week and looks to be a strong awards season contender. One of\" Theory's \"main competitors for Oscar glory,\" The Imitation Game, \"got off to a strong start in limited release. The story of code breaker Alan Turing scored the year's second highest per screen average, commanding $120,518, behind only\" The Grand Budapest Hotel's \"$200,000 average. The Weinstein Company release made $482,071 in four theaters in New York and Los Angeles. 1 Freddie Prinze Jr learning to walk again 2 <mark>Joan Collins</mark> opens up about being raped 3\" Dirty Jobs' host spars with critic 4 Burt Reynolds auctioning off personal items Thanksgiving: Cultivate an attitude of gratitude Michael Phelps--Out of Rehab...Back with Miss California The Game--My 49ers Would LOVE <mark>Ray Rice</mark>, But...Mama June--I May Get Back with Sugar Bear The Week in Tabloid Fodder: Fact vs. Fiction The Hottest Celebrity Skin Pics of the Week - 11.30.14 The Cutest Celebrity Kid Pics of the Week - 11.29.14 15 Things You May Have Missed in \"Guardians of the Galaxy' Stars Who Disappeared from Hollywood [PHOTOS] Most Controversial Magazine Covers of All Time [PHOTOS] Kendra: Risking Her Life For Reality TV? Second Chance At Romance? Mama June & Sugar Bear Working On Their Relationship Snooki's Wedding Photos: First Kiss, First Dance & More! Harry Styles Steps Out Of Hollywood Hot Spot With Two Women Nori Wears Ostrich Feather Cape For Spa Day With Mommy Kim Harry Styles And His Wild Hair Can't Get Enough Of Los Angeles Lindsay Lohan Wraps 2-Month Run In London Play These 4 Stars' Kids Make the Cutest Turkeys You've Ever Seen <mark>Justin Long</mark> Hums\" Shake It Off,' Survives Being Laughed At By Taylor Swift Style Fox News Entertainment"}, {"articleID": "2011051008_00033325_W", "names": {"Robert Frank": ["Q2157418", "Q3435143", "Q467574", "Q7344489"]}, "date": "2011-05-10", "url": "http://recordpub.com/news/article/5031906", "content": "more people showed up for a kent state university graduation ceremony than expected, forcing hundreds to watch saturday's commencement from remote locations. university officials said 73 graduates and 500 people in total could not fit in the memorial athletic and convocation center and instead were led to two buildings nearby to watch the keynote address on projectors. every graduate could still walk across the stage, ksu spokeswoman emily vincent said. this was the first time students couldn't fit in the building, officials said. \"i don't think there was one happy person in the room,\" said kayla wilson, an exercise physiology graduate and one of 400 people - graduates and their guests - who watched from an auditorium a couple hundred yards from the mac center. \"everyone's blood was boiling,\" she said. some were crying. ksu divides its commencement into three ceremonies. it was for the final 5:30 p.m. program that dozens of students apparently failed to register in an online form to say they were coming. \"the\" failed to rsvp' is what gave us the trouble, \"said <mark>robert frank</mark>, ksu provost and senior vice president for academic affairs. about 1,900 students graduated saturday in all, and <mark>frank</mark> said there were a record number of attendees at the evening ceremony. when the folding chairs for graduates on the gymnasium floor filled up, they began to fill bleacher seats. when the mac center reached capacity, organizers ushered students and guests to the kiva auditorium. then it filled up, too. he said 100 people watched from the university ballroom, which had been set up for another event. occasionally, the university is forced to move parents and friends of graduates to the kiva for overflow crowds, but they've never moved graduates there .\" there were people along the walls, \"wilson said .\" it was really disorganized. \"she said once the keynote speech was over, the students were led back to the mac center and lined up with their classmates to walk across the stage and receive their diplomas. they were allowed to stand in the aisles to turn their tassels, she said. on sunday the university posted an apology on its website and has sent emails to students apologizing for what they called\" an unprecedented occurrence. \"the university doesn't use tickets for its graduation ceremonies as some schools do, and they don't limit the number of guests a student can invite. <mark>frank</mark> said they'll reconsider those policies now. the university is sending the graduates free dvds and pictures taken of them at the ceremony .\" i think it's nice of them; i think it's a nice effort, \"wilson said .\" but i would have rather been there. \"comments by posting to this site, you agree to our copyright record publishing co, llc. 1995-2011. all rights reserved."}, {"articleID": "2010012613_00124466_W", "names": {"William Bell": ["Q14950256", "Q19395422", "Q29000856", "Q3028826", "Q3568581", "Q43910767", "Q53844101", "Q59070365"]}, "date": "2010-01-26", "url": "http://blog.al.com/breaking/2010/01/city_crews_haul_off_435_tons_i.html", "content": "local news updates from huntsville and surrounding communities weather \"city crews haul off 435 tons in tornado debris; another 1,000 tons await eric schultz huntsville, al--from the orange cones in the streets to the blue tarps on dozens of roofs, colorful reminders dot the five points neighborhood that was at the center of last thursday's tornado. huntsville public works employees as well as private construction crews were out in full force monday, still trying to clear the area of debris left behind from the f2 tornado that struck swiftly, but fortunately, left no fatalities or serious injuries, as could have been the case in the heavily populated area. through saturday, city workers picked up 435 tons of debris left in front yards and on curbs,\" and we've barely made a dent in it, \"said public works director terry hatfield monday .\" we've probably got another week or two of hauling off stuff, \"said hatfield, adding that another 1,000 tons of debris seems plausible .\" but we'll keep with it, as long as it takes. \"contractors and tree services hired by property owners are responsible for hauling off debris, but residents can place the downed trees and other trash on the curb, and the city will take it to the landfill .\" there were some huge trees that came down, and it takes a while to get through those, \"hatfield said .\" we know the path that the tornado took, so we're just going down those streets, getting them cleared as quickly as we can. \"huntsville mayor tommy battle said the city is compiling together numbers to see if it can receive federal help for the costs of cleaning up after the storm .\" there is a $5 million threshold for declaring a disaster area, \"battle said .\" we're pulling together a list of costs to see if we meet that threshold for (federal emergency management agency) grants. \"our take on it right now is that we probably won't .\" it would be helpful to the cash-strapped city if it did meet that requirement. between the overtime public works is paying its employees to clear this debris plus the overtime it paid to keep roads salted during the snow and ice event earlier this month, the city is feeling the pinch. \"we have money budgeted for overtime for emergencies like these,\" hatfield said. \"i guess we just have to hope that we won't have many more this year .\" david dalton, 42, who lives on ward avenue in five points, was attending an mba class at the university of alabama in huntsville when the storm hit. his wife called him on his cell phone and said she was in the bath tub with their two dogs and that the wind was howling like a freight train. \"i never wanted to be the guy on the news talking about tornado damage,\" dalton said. \"i never wanted to be one saying,\" it sounded like a freight train ...' \"a neighbor's tree crushed his utility shed, and his roof, soffit and fence were damaged,\" but we're both fine so it's ok. \"according to kris white, a meteorologist with the national weather service, said the tornado had peak winds of 115 mph, with a path 4.4 miles long and up to 150 yards wide. it first touched down near the intersection of triana boulevard and 9th avenue, then proceeded northeast through old town and five points before lifting near the intersection of gaboury lane and rosalie ridge road near chapman mountain. city crews haul off 435 tons in tornado debris; another 1,000 tons await public hearing on proposed zoning changes in scottsboro could be this spring auburn recruiting: a weekend update on marcus lattimore, defensive tackles and more birmingham mayor-elect <mark>william bell</mark> set to discuss his administration and transition © 2010 alabama live llc. all rights reserved. use of this site constitutes acceptance of our"}, {"articleID": "2010072513_00179271_W", "names": {"Matt Prior": ["Q3529850", "Q6789204"], "Michael Clarke": ["Q1428440", "Q16203034", "Q16227744", "Q57942480", "Q6829291", "Q6829292"], "Jimmy Anderson": ["Q16018039", "Q22958398", "Q6199520", "Q6199522", "Q6199525"], "Bob Willis": ["Q21104318", "Q2907874"]}, "date": "2010-07-25", "url": "http://blog.taragana.com/sports/2010/07/25/funny-swann-has-blossomed-into-worlds-best-spin-bowler-stewart-122686/", "content": "0 \"funny' swann has blossomed into world's best spin bowler: stewart london - former england captain alec stewart insists that spinner graeme swann has got all the attributes to win the ashes series down under this winter. with seven five-wicket hauls, almost 100 wickets and an ashes series victory from last summer already under his belt, stewart believes swann is making up for lost time after being a latecomer to the international scene. stewart believes the 31-year-old has blossomed into a cricketer capable of leading england's attack as they bid to avenge the 5-0 humiliation suffered at the hands of australia in the 2006-07 ashes series .\" graeme is the best spin bowler in the world currently and his record shows that, \"the news of the world quoted stewart, who earned 133 test caps before his retirement in 2003, as saying. headingley test win against australia will have far reaching effects: butt swann transforms from clinically depressed county journeyman to england great kamran's\" impressive batting' behind his selection in test squad: pcb selector may 18th, 2010 london, may 18 (ani): spinner graeme swann is sure that england can make it two world cup wins by clinching the 2010 world cup in south africa. he backed the england footballers to follow the cricketers and make it a double glory for the country inside three months, the sun reports. april 15th, 2010 london - england off-spinner graeme swann has been named one of wisden's five cricketers of the year. swann is joined by england teammates stuart broad, <mark>matt prior</mark> and graham onions plus australia's <mark>michael clarke</mark>, the sun reports. april 4th, 2010 london - england bowler graeme swann has been arrested on suspicion of drink driving as he was returning home in the west bridgford area of nottingham. he had reportedly been celebrating his 31st birthday, which was last week, before he was stopped. swann \"proud\" to be at second spot in icc world bowling rankings more images more imageschittagong - england off-spinner graeme swann, whose 10-wicket haul in the first test against bangladesh lifted him to second place in the world bowling rankings, has said that he is proud to be first england bowler to have reached the spot in last six years. swann finished with match figures of 217-10 and played a crucial role in england's 181-run victory over the home team in chittagong. swann has established himself as a world-class cricketer: emburey london - former england off-spinner john emburey believes that off-spinner graeme swann has established himself as a world-class cricketer with his performances with both bat and ball against australia and south africa. \"graeme has already proved that he is a match-winner. england must tweak batting order, include more spinners to win ashes down under: vaughan london - former england cricket captain michael vaughan thinks that there are only two small things that need to be sorted out if england are to contemplate retaining the ashes urn won last year - improved batting and better bowling. vaughan fears that mental weakness among the former could cause physical problems for the latter - and god help us all if graeme swann picks up an injury. durban (s. africa), - off-spinner graham swann believes that he has finally established himself in the england cricket team after taking wickets against both the australians during the ashes series and now against the south africans in two back-to-back tests. describing 2009 as an incredible year for himself, swann writes in an article for the sun that:\" i must be the happiest cricketer in the world right now. october 24th, 2009 london - off-spinner graeme swann has said that he will lead england's tweet nothings in south africa this winter. according to the mirror, england bosses briefly considered banning tweets, but swann, whose twitter duel with team-mate <mark>jimmy anderson</mark> has become the stuff of legend in the dressing room, last night revealed the censors had spared him. september 15th, 2009 london - off-spinner graeme swann is hoping to give a wake up call to his england team-mates when they take on australia in the fifth of the seven match natwest series. the day-night clash is to be played at trent bridge tonight. \"special to take final australian wicket to clinch ashes' says swann london - england cricketer graeme swann, who took the last australian wicket to clinch the ashes, has said that he has never experienced anything like the surge of emotion and happiness he felt after winning the ashes. swann said that he would cherish the day and the experience for rest of his life, as he has seen all the phases in his career and the experience on the final day at the oval beats it all. july 20th, 2009 london - england off-spinner graeme swann is insisting that his team will not panic on the final day of the second ashes test being played at lord's. the aussies need another 209 with five wickets remaining to complete a historic world record run chase. england must hammer home their spin advantage during first ashes test: <mark>willis</mark> london - former england fast bowler <mark>bob willis</mark> has said that the hosts must hammer home their spin advantage in cardiff and get their ashes quest off to a flyer. <mark>willis</mark>, who claimed 325 wickets during his international career, and is now a sky sports expert, told sun sport that england can call on graeme swann and monty panesar to do the job that is expected of them, while australia, on the other hand, have just nathan hauritz and part-timers <mark>michael clarke</mark>, marcus north and simon katich. june 28th, 2009 london - england's right-arm offbreak bowler graeme swann has expressed confidence on england's spinners abilities to tangle australians in a web to regain the historic ashes series, which begins on thursday. swann highlighted the magic web that spin genius shane warne used to create around english batsmen, however, this time he is hopeful that the likes of left-armer monty panesar and adil rashid would turn the table on australians. june 25th, 2009 london - spin legend shane warne insists that england is wrong to line up monty panesar to play in the first test against australia, starting july 8. warne says adil rashid should partner graeme swann in cardiff on july 8 instead of panesar."}, {"articleID": "2018121314_01094801_W", "names": {"Vladimir Kozlov": ["Q15069024", "Q18226133", "Q18613644", "Q18923776", "Q30346141", "Q336143", "Q3561808", "Q39389553", "Q4015848", "Q4226710", "Q4226713", "Q4226714", "Q4226716", "Q4226717", "Q4226718", "Q4226720", "Q57416884", "Q59449027"], "Pavel Vasilyev": ["Q18218137", "Q7155784"]}, "date": "2018-12-13", "url": "https://www.computerweekly.com/news/252454370/Sberbank-partners-US-accelerator-for-startup-programme", "content": "elvis_dead - Fotolia Sberbank partners US accelerator for startup programme Russian state-run bank links up with San Francisco-based accelerator 500 Startups to provide expert advice to startups in a variety of tech fields Share this item with your network: <mark>Vladimir Kozlov</mark> Russian state-run bank Sberbank and San Francisco-based accelerator 500 Startups have launched a programme aimed at uncovering IT startups. The accelerator programme, a first for Russia, was announced in early September. It is inviting applications from startups in a range of fields, including e-commerce, advertising technology, educational technology, the internet of things (IoT), big data, machine learning, artificial intelligence (AI), robotics and cyber security. Sberbank holds almost one-third of Russia's aggregate assets in the industry and boasts more than 145 million customers in 20 countries. In recent years, the bank has increased its activity around tech innovation and is one of the largest investors in Russian tech startups, also investing in tech companies across the globe. In September 2018, Sberbank signed an investment deal with Israeli company ThetaRay, focused on cyber security. The bank also pumped cash into local company VisionsLab, which provides face-recognition technology. \"We are glad to cooperate with 500 Startups, which entrepreneurs all over the world dream about being invited to,\" said Lev Khasis, Sberbank's first deputy chairman of the executive board. \"It is important that our joint project is focused on selecting Russian startups and allows American companies to take part in the selection .\" There has been nothing like this in Russia before. During the acceleration programme, large Russian companies and Sberbank will become customers of the startups. So, taking part in our programme will enable them to test their products in real conditions and find future clients. \"More than 840 startups applied to the programme; 56% of them already had a minimum viable product and 15% had a product in open beta testing .\" The selection process was tough as we received applications from top teams from all over Russia, \"said Khasis .\" When making selections, we primarily looked at startups that could not only become an integral part of Sberbank's ecosystem, but could also have good prospects in the global market. \"I hope that during the acceleration, 500 Startups and the competences of the accelerator's Russian partners will help the teams to graduate to a new level of development .\" Read more about startups in Russia Annual IT event Startup Village in Russia saw blockchain take centre stage and support from the country's government. The annual Startup Village event near Moscow to showcase Russian innovators was the biggest yet. E-commerce was the most popular area for startups applying to the programme, accounting for 15% of all applications, followed by cloud services and lifestyle services with 9% each. AI and big data were also popular areas of activity, while other startups work in financial technologies, blockchain, digital healthcare and educational technologies. In late November, Sberbank announced a list of 30 startups selected for the programme. Each project will receive seed investment of up to 10 million roubles (US $150,000) and the possibility to promote their product in Sberbank's ecosystems and corporations, which are partners of the accelerator. According to Sberbank, all the selected startups already have working products and paying customers. One of them, Data Screen, develops technology for analysing and managing digital content distribution through the entire supply chain. Michael Ilyichev, partner at Data Screen, told Computer Weekly: \"Our project is at a stage when the solution is ready and needs to be scaled beyond Russia. We think that attention from 500 Startups and their community can help us with that .\" Find new customers Ilyichev said Data Screen expects participation in the programme to help to find new customers for the company's products outside Russia and attract international venture capital to the next funding round. Another startup, ArtLogics, has developed pooling. me, an online platform for cargo deliveries to retail chains. It ran a pilot project with major Russian food retailer Magnit and four of its suppliers this summer. \"We believe our project could potentially have a very big impact on Russia's logistics industry,\" said <mark>Pavel Vasilyev</mark>, managing director at ArtLogics. \"So when we heard about the accelerator of Sberbank and 500 Startups, we immediately realised that it would be exactly the kind of support that we need at this point, as both companies have enormous expertise and a network of contacts and could help us to develop this project in the right way .\" ArtLogics expects its participation in the programme to help it devise a growth strategy and make contact with retail and logistics operators in other markets to see if its technology is applicable outside Russia, said <mark>Vasilyev</mark>. Improving skills Meanwhile, Doczilla, a digital document creation service, expects taking part in the accelerator to improve its skills for product development and promotion, and to learn from 500 Startups' mentors about business scaling in Europe, the US and other countries, according to Kirill Buryakov, the company's CEO. \"We also hope to show Sberbank and its partner the possibilities of our platform and to launch pilot projects,\" he added. Alexander Fokin, general director of Calcul. ru, a service for calculating insurance payments that is also taking part in the programme, said: \"We would be certainly like to test ourselves in working with foreign customers .\" During the accelerator's first stage, the teams will work with startups in Moscow for nine weeks. The mentors of the teams will be specialists from 500 Startups, who will give lectures and seminars and provide one-to-one consultations. The final stage of the accelerator will be a demo day, where top managers from Sberbank, private venture investors and representatives of funds will choose the seven best startups. The winners will be sent to the US to take part in the Silicon Valley Exchange Programme. There, they will learn about international business practices and develop their products, before presenting their projects to Russian and foreign investors and large companies on a demo day in San Francisco. Read more on Technology startups Manchester's evolution from rag trade to e-commerce riches Trusted nodes: The next generation in quantum key distribution CTO interview: Proving new technology at Bloomberg"}, {"articleID": "2019122212_00041402_W", "names": {"Farhad Moshiri": ["Q3066849", "Q861168"], "Marco Silva": ["Q20118419", "Q57025699", "Q6757714"]}, "date": "2019-12-22", "url": "http://www.somersetcountygazette.co.uk/sport/national/18117808.ancelotti-sets-sights-champions-league-everton/", "content": "Ancelotti sets sights on Champions League with Everton By Press Association 2019 Carlo Ancelotti watched on against Arsenal 0 comment Carlo Ancelotti has targeted Champions League football with Everton, who he has described as \"one of the greatest clubs in England\". Everton appointed Ancelotti as their permanent new manager on Saturday and the 60-year-old Italian has signed a four-and-a-half-year contract. \"I'm excited to be here at one of the greatest clubs in England,\" Ancelotti told evertontv in his first interview at the club .?? | \"I am excited to be here, at one of the greatest clubs in England. This is a Club with a lot of history--and ambition for the future. It's my dream to bring success .\" #EFC @ MrAncelotti gives his first interview. And it's brilliant .?? #EFC #WelcomeMrAncelotti pic.twitter.com/q9zoJSCCB5--Everton (@ Everton) December 22, 2019 \"The ambition is for us to try to win and be competitive. The goal is there to reach the Champions League or Europa League. Winning honours has to be the dream for this club and for the supporters. I am here to try to do this .\" Ancelotti won the Premier League and FA Cup double at Chelsea in 2010 and is one of only three managers to win Europe's elite competition on three occasions. \"Our goal is to be competitive in the Premier League, to be towards the top of the table, to be competitive in Europe,\" Ancelotti added. \"It's not going to happen straight away, but we have to work for this .\" To Evertonians I would like to say, stay with the team as you always do because it's really important for the players to have your support. \"I would like to work together with the supporters. My dream is to bring success to this club .\" Ancelotti, who won the European Cup twice with AC Milan and the Champions League with Real Madrid and also had spells at Juventus, Paris St Germain and Bayern Munich, is already \"loving\" being at Everton, according to chairman Bill Kenwright. Kenwright sat next to Ancelotti in the directors' box at Goodison Park on Saturday to watch the Toffees play out a goalless draw with Arsenal that was hardly inspiring. But Kenwright is confident Ancelotti is the man to push Everton back towards the top of the Premier League and praised majority shareholder <mark>Farhad Moshiri</mark> for aiming high .?? | \"Duncan gave the Club and fans a reminder of what a privilege it is to be an Evertonian .\" Emotional praise from the Chairman for Duncan Ferguson, as the Blues look forward to an exciting new era under \"world-class\" @ MrAncelotti. #EFC--Everton (@ Everton) December 21, 2019 Kenwright told evertontv: \"I have to take my hat off to <mark>Farhad</mark>. We interviewed a lot of people and <mark>Farhad</mark> was pushing for a world-class manager .\" He wants this team to be where he's wanted it to be for three and a half years. He wants this club to be winning trophies. \"That is what he is here for. We want a world-class manager to help us do that and to get us to this magnificent new stadium .\" Carlo's had a little bit of an Everton experience today. He's already loving the club. You can't not feel the embrace of this club, can you? \"While Kenwright is hugely excited for the start of a new era he reserved special praise for Duncan Ferguson, who stepped in as caretaker boss following the sacking of <mark>Marco Silva</mark>. Bill Kenwright praised the work done by caretaker Duncan Ferguson (Peter Byrne/PA) Ferguson's four-game spell resulted in victory over Chelsea, draws with Manchester United and Arsenal and a loss on penalties to Leicester in the Carabao Cup. The Scot, a hero as a player at Goodison Park, brought a huge amount of passion and energy to the role, and Kenwright said:\" It'd be hard for me to put into words the Duncan Ferguson era. \"I get emotional because I am an emotional chairman. He gave the club and fans a reminder of what a privilege it is to be an Evertonian .\" I don't know anyone else who could have done it, who could have said, \"We're going to work now and show those fans (what it means to play for Everton), because he loves those fans as much as they love him. Carlo Ancelotti (left) replaces <mark>Marco Silva</mark> as Everton manager (Anthony Devlin/PA)\" It's not just a game to him, it's Everton. \"Ferguson will stay at the club as part of Ancelotti's backroom staff and Freddie Ljungberg has also been told he will be kept on under Mikel Arteta's management at Arsenal. It was a unique situation with both men on the touchline at Goodison Park being watched by their new bosses after Arteta's appointment on Friday. 0 comment"}, {"articleID": "2015022018_00027982_W", "names": {"Roger Williams": ["Q21165828", "Q266434", "Q30106740", "Q4014560", "Q56187912", "Q716906", "Q7359122", "Q7359124", "Q7359125", "Q7359126"]}, "date": "2015-02-20", "url": "http://www.bbc.co.uk/news/uk-wales-politics-31557630#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa", "content": "Media playback is unsupported on your device 20 February 2015 Last updated at 18:16 GMT An MP is supporting residents of a Powys town fighting to stop its only GP surgery from closing due to a cut in NHS funding. Doctors running the practice in Llanwrtyd Wells have written to Health Minister Mark Drakeford asking him to reconsider the scrapping of the Minimum Practice Income Guarantee (MPIG). They say 1,200 patients will have to travel 13 miles to their main surgery in Builth Wells from August. The Welsh government said there had to be \"new ways of meeting local needs\". <mark>Roger Williams</mark>, the Liberal Democrat MP for Brecon and Radnorshire, said it was difficult to find the money to keep rural GP practices open."}]