[{"articleID": "2009102314_00003284_W", "names": {"Martin Baker": ["Q19949704", "Q24817439", "Q6774929", "Q6774930"]}, "date": "2009-10-23", "url": "http://carrickfergustimes.co.uk/latest-london-news/Probe-39vindicates39-suspended-Met-officer.5762188.jp", "content": "suspended scotland yard officer ali dizaei said he will be cleared of misusing his corporate credit card. the senior officer said an inquiry by dorset chief constable <mark>martin baker</mark> found a series of allegations against him were unfounded and baseless. mr dizaei, 47, was accused of failing to repay money he spent on a police american express card and no advertisement t keeping receipts. it was alleged he spent more than £ 5,000 on clothes and perfume while on a trip to the united states. a file was passed back to the independent police complaints commission (ipcc) earlier this week. but it is now for members of the metropolitan police authority (mpa) to examine it and decide whether mr dizaei should face any further action. alfred john, of the metropolitan black police association, which supports mr dizaei, said the officer always maintained the claims were without foundation. he said: \"following a 14-month criminal investigation, where commander dizaei's expenses going back several years have been scrutinised, dorset police concluded that there was no case to answer and the allegations have been withdrawn.\" we are pleased that our member has been fully vindicated of this grave allegation and we thank the chief constable of dorset police and his team for an open and transparent investigation. \"we shall continue to support all of our members against unfounded and baseless allegations.\" copyright (c) press association ltd. 2009, all rights reserved."}, {"articleID": "2019041006_00155738_W", "names": {"Cameron Walker": ["Q25189341", "Q30122762"]}, "date": "2019-04-10", "url": "http://www.newindianexpress.com/world/2019/apr/10/woman-lived-to-99-with-most-organs-on-wrong-side-of-body-1962606.html", "content": "Home World Woman lived to 99 with most organs on wrong side of body The discovery of the rare condition, which was presented this week to a conference of anatomists, was astounding especially because Bentley had lived so long. Share Via Email Published: 10th April 2019 11:45 AM | Last Updated: 10th April 2019 11:45 AM | A + A A - Rose Marie Bentley. By PTI SALEM: Rose Marie Bentley was an avid swimmer, raised five kids, helped her husband run a feed store, and lived to the ripe age of 99. It was only after she died that medical students discovered that all her internal organs \"except for her heart' were in the wrong place. The discovery of the rare condition, which was presented this week to a conference of anatomists, was astounding especially because Bentley had lived so long. People with the condition known as situs inversus with levocardia often have life-threatening cardiac ailments and other abnormalities, according to Oregon Health & Science University. <mark>Cameron Walker</mark>'s class at the university in Portland was examining the heart of a cadaver last year when they noticed the blood vessels were different. When they opened the abdominal cavity, they saw that all the other organs were on the wrong side. The unusual blood vessels helped the heart compensate. In a telephone interview Tuesday, <mark>Walker</mark> described his reaction to the find as\" definitely a mix of curiosity, fascination and a sense of wanting to explore a little bit of a medical mystery' a medical marvel really' that was in front of us. \"\"And I would say the students felt something very similar,\" <mark>Walker</mark>, an assistant professor of anatomy, told The Associated Press. Bentley's family had not known about the condition, which OHSU says occurs only once in every 22,000 births. Apparently, Bentley didn't either. Bentley, who lived in Molalla, 40 kilometers south of Portland, had led a normal life. Her only recurrent physical complaint was arthritis, her daughter Louise Allee remembered. But there were signs. When Bentley was in her 50s, she underwent a hysterectomy, and the doctor also wanted to remove the appendix. But he couldn't find it, Allee said in a phone interview. When Bentley had her gallbladder removed at least a decade later, it was on the opposite side of where it should have been, she said. \"No one said a thing,\" Allee said. Bentley had agreed to donate her body to OHSU, Oregon's only academic health center. \"This is an important case that really gave us an opportunity to talk about the importance of future clinicians paying attention to subtle anatomic variations, not just large anatomic variations, in terms of addressing their future patients as individuals,\" <mark>Walker</mark> said. \"Don't judge a book by its cover, and always check and see what you've got before you talk about care.\" He has researched how long people with the condition have lived, and he found no documented cases in which a person lived beyond age 73. Bentley surpassed that by 26 years. Her husband, James, died about 15 years ago. Stay up to date on all the latest World news with The New Indian Express App. Download now (Get the news that matters from New Indian Express on WhatsApp. Click this link and hit \"Click to Subscribe'. Follow the instructions after that .) TAGS Rose Marie Bentley situs inversus Oregon"}, {"articleID": "2015042919_00008568_W", "names": {"Liz Green": ["Q3257310", "Q56709371", "Q6660163"]}, "date": "2015-04-27", "url": "http://www.thecomet.net/inspired_by_the_london_marathon_beginner_runners_can_get_on_their_marks_in_hitchin_1_4050207", "content": "Email this article to a friend To send a link to this page you must be logged in. The programme of classes, supported by North Herts District Council along with England Athletics, will be supervised by friendly instructors who are members of Hitchin Running Club, including project leader Melissa Peacock. The weekly classes will take place every Tuesday evening from May 12 until July 28 at 6.30 pm, meeting at the Walsworth Common play area. The council's <mark>Liz Green</mark> said: \"We'd encourage as many people as possible to try the classes in Hitchin.\" Comments Please log in to leave a comment and share your views with other The Comet visitors. We enable people to post comments with the aim of encouraging open debate. terms and conditions can post comments. These terms and conditions explain our house rules and legal guidelines. Comments are not edited by The Comet staff prior to publication but may be automatically filtered. Not a member yet? Register to create your own unique The Comet account for free. Walk this way and help festival put a spring in Stevenage's step The third annual Stevenage Walking Festival steps out with a crowded calendar of pedestrian possibilities on Saturday. London Marathon 2015: Guinness World Record \"failure' doesn't dampen spirits of Letchworth, Baldock and Stotfold runners A barrier in a Baldock play park has been destroyed by vandals for the second time in five weeks. Man in serious condition after car rolls off A1 (M) near Baldock Services and lands on roof Drug dealing ring from Hitchin, Stevenage and Letchworth jailed for a total of 41 years Man punches woman in the face and tries to steal dog in Stevenage Labour leader Ed Miliband on the campaign trail in Stevenage, with comedian Eddie Izzard in tow"}, {"articleID": "2017102613_00031672_W", "names": {"John Combs": ["Q22676769", "Q6226795"]}, "date": "2017-10-26", "url": "http://www.marketwired.com/mw/release.do?id=2238519&sourceType=3", "content": "SOURCE: Strategic Environmental & Energy Resources, Inc.. October 26, 2017 08:31 ET Strategic Environmental & Energy Resources Partners with Biochar Now and Enters into Exclusive Service Contract and Water Remediation Market Wholly Owned Subsidiary Resource Environmental Group Services \"REGS' Receives Exclusive Manufacturing, Management and Remediation Services Contract & Exclusive Technology Licensing Rights to Water Remediation in the Mining Market Throughout U.S. GOLDEN, CO--(Marketwired - October 26, 2017) - Strategic Environmental & Energy Resources, Inc. (SEER) (OTCQB: SENR), a provider of environmental, renewable fuels and industrial waste stream management services, today announced that it has partnered with Biochar Now, (\"BCN\" ) a leading engineer and manufacturer of high-quality biochar. As a part of this new partnership, REGS, a wholly owned subsidiary of SEER, has received exclusive rights to perform all fabrication, manufacturing and environmental/remediation services required by BCN on all its water and soil clean up, reclamation or enhancement projects. In addition, REGS received an exclusive license under BCN's newly issued U.S. Patent Number 9,650,261 B2 (May 16, 2017) arising out of and related to water reclamation and clean up in and around the mining industry; a market REGS has serviced in the past. This license will be granted to a joint venture owned 90% by SEER and 10% by BCN. As part of the partnership, SEER made a $300,000 loan to BCN. The loan is in a super-priority position and paid back out of gross sale proceeds from BCN's currently operating Berthoud, Colorado production facility. For the loan, SEER has also received a small equity interest of approximately one percent of the privately held BCN. BCN, and its patented production technology, is emerging as one of the nation's premier producer of biochar. Biochar, considered as a more cost-effective alternative to activated carbon, is a solid material, obtained through thermochemical conversion of biomass (primarily wood) in a kiln. BCN has proprietary and patented procedures for this process resulting in a superior biochar product. The superiority of the BCN product has already been recognized by several states and many of the country's largest industrial and chemical companies that are currently developing programs and remediation plans to utilize the BCN product. All of these programs and remediation plans represent opportunities for REGS to provide services and support. The BCN product also has large potential for landfill soil remediation, a market that supplements MV's LFG gas capture technologies. Biochar has several applications within the reclamation market, from improving soil quality in agricultural, to removing various pollutants and unwanted components from water, such as phosphorous, mercury, arsenic and pesticides. REGS has already begun to work with leading water experts and service companies to expedite the deployment of this technology within the water treatment market. The addressable opportunity is significant, as the water recycling market is expected to grow 13.1% annually through 2021, to $22.3 B, according to BCC Research. As the number and scale of environmental cleanup projects around the world increase, the activated carbon global market, estimated to be $3 billion in 2015, is expected to exceed $10 billion by 2024 according to grandviewresearch.com. The superior quality biochar produced by Biochar Now is now being recognized by many industries and engineers as a more cost-effective and superior substitute for activated carbon in many applications. Given REGS' exclusive license and operational background in several Colorado mines, biochar is especially relevant for the mining industry, where it can sequester heavy metals and acids in the soil, preventing them from entering local water supplies. This more rapidly facilitates the return of vegetation, expediting the traditionally costly process of mine reclamation. In one study by the U.S. Forest Service, biochar performed better for re-vegetation than compost alone by 313%. \"This new partnership is part of SEER's ongoing effort to leverage REGS' 25 years of environmental service experience and diversify its business model into new mature and lucrative verticals,\" said <mark>John Combs</mark>, SEER's President and CEO. \"The addressable market for biochar is significant and growing rapidly. This fits perfectly into SEER's business portfolio objectives and presents an exciting and imminent revenue growth opportunity for SEER. We are particularly interested in the joint marketing opportunities between MV and BCN in the landfill market and have already begun discussions with a large landfill operator in Florida where MV has one of its largest LFG systems. In addition to this promising landfill opportunity, we have a potential pipeline of projects on the East Coast and in South Florida through our relationship with Biochar Now with some of the nation's largest industrial and chemical companies where REGS could provide service work and project management, in addition to manufacturing the kilns that would be required to fulfill increased product demand. We look forward to announcing these projects in the months to come,\" concluded <mark>Combs</mark>. \"We couldn't have found a better fit as service and support partners than SEER and its affiliated companies, especially REGS,\" said James Gaspard, BCN's CEO. \"REGS is right here in our backyard, they have used our biochar over the last year, they have impressive fabrication capabilities, and we are familiar with REGS' great reputation for service in the greater front-range area for over 20 years. In addition, SEER's other divisions, MV, SEM and Paragon, also bring expertise and experience in closely related areas such as gas conditioning, environmental materials production, pyrolysis, and solid waste destruction. All of these synergies make for multiple and potentially very lucrative opportunities for our companies as we can now offer services as part of our product offerings,\" continued Gaspard. \"As a real-world example of the possible synergies, in just a few weeks of joint marketing with SEER, Biochar Now has been able to identify and add millions of dollars to our product sales pipeline with companies that had already expressed interest in using our product after successful testing, but needed the full-service solution offered by REGS to implement our product in their processes,\" concluded Gaspard. About Resource Environmental Group Services (REGS) Resource Environmental Group Services (REGS) is a wholly owned subsidiary of Strategic Environmental & Energy Resources, Inc. (SEER). Founded in 1994, REGS provides industrial and environmental services to the petroleum industry, various industrial and manufacturing clients, medical facilities, universities, government entities, and environmental and consulting firms in the Western United States. REGS utilizes state-of-the-art equipment and technologies to provide the most efficient and environmentally safe services in the industry. As the developer of the first non-entry closed-loop cleaning process for stationary tanks, REGS can provide the lowest cost cleaning options for your tanks, as well as offer additional savings in down-time and waste reduction. REGS' experience and knowledge in dealing with a myriad of environmental regulations can ensure that its client companies' environmental programs are proactive and compliant. REGS offers its clients flexibility by providing turnkey project services or supplemental services on an as needed basis. For more information on REGS, please visit: www.regs-llc.com. About Strategic Environmental & Energy Resources, Inc.. Strategic Environmental & Energy Resources, Inc. (SEER) (OTCQB: SENR), identifies, secures, and commercializes patented and proprietary environmental clean technologies in several multibillion dollar sectors (including oil & gas, renewable fuels, and all types of waste management, both solid and gaseous) for the purpose of either destroying/minimizing hazardous waste streams more safely and at lower cost than any competitive alternative, and/or processing the waste for use as a renewable fuel for the benefit of the customers and the environment. SEER has three wholly-owned operating subsidiaries: REGS, LLC; MV Technologies, LLC and SEER Environmental Materials, LLC; and two majority-owned subsidiaries: Paragon Waste Solutions, LLC; and ReaCH4biogas (\"Reach\" ). For more information about the Company visit: www.seer-corp.com. Forward Looking Statements This press release contains \"forward-looking statements\" within the meaning of various provisions of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, commonly identified by such terms as \"believes,\" \"looking ahead,\" \"anticipates,\" \"estimates,\" and other terms with similar meaning. Although the company believes that the assumptions upon which its forward-looking statements are based are reasonable, it can give no assurance that these assumptions will prove to be correct. Such forward-looking statements should not be construed as fact. Statements in this press release regarding future performance or fiscal projections, the cost effectiveness, impact and ability of the Company's products to handle the future needs of customers are forward-looking statements. The information contained in such statements is beyond the ability of the Company to control, and in many cases the Company cannot predict what factors would cause results to differ materially from those indicated in such statements. All forward-looking statements in the press release are expressly qualified by these cautionary statements and by reference to the underlying assumptions. Contact Information"}, {"articleID": "2019060722_00284842_W", "names": {"Sergio Ramos": ["Q483309", "Q514286"], "Luis Enrique": ["Q222789", "Q322350"]}, "date": "2019-06-07", "url": "http://www.bournemouthecho.co.uk/sport/national/17692990.santi-cazorla-relishing-dream-return-to-spain-squad/", "content": "Santi Cazorla relishing \"dream' return to Spain squad By Press Association 2019 Santi Cazorla is enjoying life back in the Spain squad 0 comment Santi Cazorla hailed captaining Spain in the 4-1 win over the Faroe Islands as a\" dream \". The former Arsenal midfielder took the armband when <mark>Sergio Ramos</mark> left the field, as the Spaniards cruised to victory in Torshavn. Villarreal star Cazorla made his first Spain appearance since 2015, then topped it off with the captaincy in a remarkable return to the international arena. Two years ago Cazorla was told he would never play football again after an infection had eaten away at his heel--now the 34-year-old is relishing a new lease of sporting life.\" Wearing the armband is another dream fulfilled for me, \"Cazorla told reporters.\" I'm enjoying this a lot but the important thing is for me to help the team. \"The important thing was to win.\" We knew it would be difficult because of the pitch and that they were going to close us down. \"But we were better in many aspects of the game and we're happy.\" Jesus Navas fired his first international goal in six years as Spain romped home to stay top of Group F in the Euro 2020 qualifiers. <mark>Sergio Ramos</mark> toasted his world-record 122nd international victory with his 19th Spain goal, with Jose Gaya on target and goalkeeper Teitur Gestson putting through his own net. Klaemint Olsen turned in a smart strike for the Faroes, but the hosts were ultimately outclassed and forced to bow to Spain's supremacy. Spain host Sweden at home on Monday, with new boss <mark>Luis Enrique</mark> keen to extend his side's promising run. \"Sweden will be a complicated game,\" said Cazorla. \"But we're playing at home and we want to give our all.\" Hopefully we can get the three points. \"0 comment"}, {"articleID": "2014042908_00047708_W", "names": {"William Richardson": ["Q19325980", "Q20898590", "Q23304291", "Q35147350", "Q57429240", "Q8017553", "Q8017555"]}, "date": "2014-04-29", "url": "http://www.workers.org/articles/2014/04/28/new-cold-war/", "content": "Behind the imperialist drive to the east The Soviet Union no longer exists. The Russian Federation is not a socialist state. But the U.S. military and political establishment still seek to destroy Russia. That's the object of the crisis the Pentagon, State Department and CIA are orchestrating in Ukraine. What drives this seemingly irrational course of action? The same thing that drove the George W. Bush regime to invade Iraq in 2003. The same thing that's driving the violent anti-China rhetoric from the Pentagon and the White House: financial need and cold economic calculation. Not the financial need of the hungry and homeless, of the millions who need jobs at living wages, of those who can't pay their rent or mortgages or who must choose between heating and eating. It's the need of Wall Street bankers and corporate CEOs to pump up their profits, stock prices and rates of return on their invested capital amid a global economic slowdown caused by capitalist overproduction. The U.S. Energy Information Administration projects that the United States will replace Russia this year as the world's top hydrocarbon energy producer. It says the U.S. will replace Saudi Arabia as the world's No. 1 oil producer by 2015. This is the result of the U.S. capitalist class investing hundreds of billions of dollars over the past 10 years in fracking - the hydraulic fracturing of oil and natural gas from shale rock. ExxonMobil, the world's most profitable company, spent $41 billion in 2010 to buy fracking giant XTO Energy. ExxonMobil is now the largest U.S. natural gas producer. Chevron, Phillips 66, Valero, Berkshire Hathaway and General Electric are other top 10 Fortune 500 companies betting billions on the superprofits they hope fracking will bring. Some of them have ascended to the top 10 based on these investments. Halliburton, the Koch brothers and hedge funds like KKR are heavily invested. So is every major bank. But these environment-destroying investments would not be profitable without the triple-digit oil prices of the past decade. These record prices were made possible by the violent suppression of Middle East and North African energy production by the Pentagon through war and sanctions. The U.S. invasion of Iraq devastated that country. And it hit hard at working class and oppressed communities in the United States. For Big Oil and Wall Street it was a bonanza. In 2002, before U.S. invaders destroyed Iraq's state-owned oil industry, the price of West Texas Intermediate crude, a benchmark used by the oil industry, hovered around $20 a barrel. By April 2003, when U.S. tanks rolled into Baghdad, WTI crude was over $40 a barrel. ExxonMobil and Chevron, the biggest U.S. oil companies, saw their profits rise nearly 300 percent. By mid-2008, war threats and sanctions against Iran combined with the continued wars in Iraq and Afghanistan to drive oil up to $147 a barrel. It was ExxonMobil's most profitable year ever. War in the Middle East made profitable the plunder of Canada's tar sands, the proposed Keystone XL pipeline and new mountaintop removal projects in Appalachia. It enabled the building of the Anglo-U.S.-owned Baku-Tbilisi-Ceyhan pipeline from former Soviet Central Asia to the Mediterranean and new U.S. energy investments in Africa. But capitalists will do what capitalists do. When profits and prices are booming, they will produce \"more than the market can bear.\" The third quarter of 2008 saw a global capitalist economic crisis and oil prices began to fall. Sanctions against Iran and Sudan, the 2011 U.S. / NATO bombing of Libya and the CIA-orchestrated war in Syria, which blocks a potential Iranian oil pipeline to the Mediterranean, have slowed the decline but not reversed it. Some analysts predict prices as low as $50 a barrel by 2015. Oil and natural gas prices tend to move in tandem, and oil prices of $60 to $80 a barrel are needed for most fracking projects to break even. Shale reserves with a value of $26 trillion at today's prices could become worthless. A crisis that disrupts the flow of Russian energy to Europe would change the picture radically. On April 14, CNBC announced \"oil hovers near $108 as Ukrainian crisis worsens.\" \"Cold War' chained Western Europe to U.S.. In the 1970s the Soviet Union was the world's top energy producer. Much of its production was consumed domestically or provided to other socialist countries in barter arrangements. Western Europe relied on Arab and Iranian oil and gas sold by U.S. and British monopolies. In the early 1980s, German and French banks financed a massive Soviet pipeline project, called Urengoi 6, to bring Siberian natural gas to Western Europe. The Reagan regime launched an overt and covert campaign to sabotage the project. (\"A Tale of Two Pipelines,\" Workers World, June 10, 2005) Washington wanted to hurt the Soviet economy, of course. It also wanted to keep Western Europe dependent on U.S. energy monopolies. The project was completed, however, and Soviet natural gas poured into Europe. In 1998, Russia, now capitalist, responded to a speculative attack on its currency by devaluing the ruble. Oil fell below $11 a barrel, throwing the Western oil industry into a panic. The U.S. responded with missiles and bombs. The target was not Russia but Iraq. Within three months the Clinton regime came up with an excuse for a massive bombing campaign against Iraq, which was already suffering from U.S.-orchestrated sanctions. Two years earlier, U.S. Secretary of State Madeleine Albright had admitted that sanctions had killed 567,000 Iraqi children. She said the \"price was worth it.\" As bombs rained on Iraq, Energy Secretary <mark>William Richardson</mark> was begging U.S. oil executives to build oil and gas pipelines to former Soviet Central Asia to cement U.S. influence there. They told him it would not be worth it unless he could guarantee oil prices above $40 a barrel for a sustained period. It took the 2003 invasion of Iraq to do that. Energy is the world's most profitable commodity. But other interests are at stake. The Pentagon needs to protect and expand its bloated budget, which faces \"mandatory\" cuts in 2016. The generals want to expand NATO to the east and put U.S. troops in the former Soviet Union. The military-industrial complex wants more arms sales to Eastern Europe, with Ukraine as a customer. Then there is the heart of the system - Wall Street itself. Bankers and politicians know that war and crisis abroad drive capital into the United States, cutting the deficit, propping up the dollar and helping keep U.S. banks at the center of the world economy. Wall Street analysts hope and predict that capital flight from Russia alone could reach $150 billion this year, more than twice what it was in 2013. The monopoly-dominated world capitalist market is saturated with commodities and capital. It is in a permanent battle because of a crisis that is unique to the capitalist system: overproduction. Bankers sit on trillions of dollars they cannot reinvest at an \"acceptable\" rate of profit. The world imperialist system cannot absorb the productive capacity of the vast industrial-technological-scientific apparatus that exists in the former Soviet Union - just as it cannot absorb the labor power, the minds and capabilities of hundreds of millions of people around the world. The imperialist market has no room for the Eurasian Union, the Commonwealth of Independent States, the Shanghai Economic Cooperation Organization or the rising bloc of BRICS nations (Brazil, Russia, India, China and South Africa), which Iran seeks to join. It has no room for the African Union or the Bolivarian Alliance of the Peoples of Our America. The dominant mode of production in the above-mentioned blocs Is capitalist. But an important factor in their economic growth is the state-powered economy of the People's Republic of China, a product of the great socialist revolution of 1949. Moreover, the state-owned sector of Russia's economy has risen to 60 percent under the Putin administration. New! From the pages of Workers World. Download this PDF booklet. On the U.S. / NATO-backed fascist coup & a growing people's resistance. FIST - Fight Imperialism, Stand Together: a revolutionary socialist youth organization Fred Goldstein gives an in-depth description & analysis of current Ukraine Rebellion Against Coup Regime & the U.S. Puppets Struggle for Control. Includes \"final comments.\" \"Cada 11 tiene su 13\" . Bajo este lema se celebr? el D? a de la Dignidad Anti-fascists organize resistance as crisis grips Ukraine coup regime"}, {"articleID": "2017050322_00663503_W", "names": {"King James": ["Q17100723", "Q36159"]}, "date": "2017-05-03", "url": "http://southernminn.com/owatonna_peoples_press/news/article_52a15efc-f1a7-5066-88a3-cf53efe6ed49.html", "content": "OWATONNA--Taking home medals and plaques from the spring Minnesota Association of Alternative Programs (MAAP) STARS conference would be a boost to the confidence of any student. But for Owatonna's Amanda Haskell, those medals and plaques are mile markers of a life back on track. They're tangible evidence of promises finally fulfilled after a detour of drugs and depression, and signs heralding a future of boundless possibility. \"I don't want to be afraid to tell my story,\" she said. \"Finally becoming who I was before has been an incredible journey.\" And, she added, the MAAP STARS awards \"showed I can achieve something.\" As a child, Haskell was so bright she was able to skip kindergarten and move right to first grade. Before she was even a year old, she could read--thanks to her grandfather's tutelage--from the <mark>King James</mark> Bible. She \"was ridiculously advanced in state test scores\" as an elementary student, she was in a gifted-and-talented program as an eighth grader, and she regularly brought home straight A's, she said. Then, when she was 15, she was shattered by a sexual assault in a hotel, leaving her with Post Traumatic Stress Disorder. Self-medicating soon led to a disastrous spiral of substance abuse. Though she'd vowed to herself to go through her senior year sober, that promise--like countless ones before--went unfulfilled, and she missed nearly the entire first week in a haze of drugs before landing at the Alternative Learning Center, or ALC, in October. Every time she used drugs, she said, she knew she was breaking her parents' hearts, but she could never get clean in her social circle comprised of other heavy drug users who she knew were pulling her down. Finally, on New Year's, as she sat surrounded by drugs and deeply under the influence friends, she experienced the epiphany that it was neither kindness nor love she was experiencing, and that they didn't care about each other: They just fed each other drugs. \"I don't want to be around these people or drugs anymore,\" she said about her realization. She separated herself from them, and she's been sober since the first of the year. In February, she also cut ties with \"an emotionally-abusive\" now-ex-boyfriend who encouraged her drug use, she said. In the past few months, she's befriended peers at the ALC who support her sobriety, and both her grades and attendance have markedly improved. Instead of bragging to peers about her drug-and-alcohol-fueled exploits, Haskell now cautions others from following her self-destructive path, she said. \"I could've died so many times,\" said Haskell. Ditching drugs has also helped her rebuild her relationship \"beyond belief\" with her parents, whom she'd shut out while abusing drugs, she said. Now, she can bring reputable friends home with her and talk with her mother and father about their days, as opposed to dashing up the stairs to her room as soon as she walked in the door so her parents wouldn't see in her eyes she was high again. Haskell said there's no chance she'd be in the position she is today--poised to graduate on time later this month, sober, and heading to college in the fall to become a nurse--if not for the teachers at the ALC. \"They care so much about your home life, and they really want you to succeed,\" Haskell said as tears welled in her eyes. \"They have to deal with a lot, but they do it so well.\" Haskell has settled on nursing as a career because her mother was a nurse, as was her mother's mother, and \"my parents raised me on service,\" she said. In addition, Haskell is now working with elderly dementia patients at a local nursing home. \"My parents are such good examples of service to other people being gratifying,\" she said. \"To look them in the eyes and know they respect me back is such a huge thing for me.\" Between her parents, friends and teachers, Haskell now has a motivational support system as she prepares to leave the warm embrace of the ALC for college this fall, she said. In addition, she'll glance at her MAAP STARS awards every day as a reminder of what she can achieve by attending class, studying for tests and remaining sober. ALC STARS shine bright Haskell's performance in Edina last week was all the more impressive considering it was her first time at the conference, as it was for the handful of other students who represented Owatonna's ALC there, said Ray Ostfeld, a math teacher at the ALC and the MAAP STARS adviser. Owatonna's ALC has been participating in MAAP STARS \"about as long as there's been an ALC,\" but this was Ostfeld's first year as the adviser. Students participated in various activities, both individual and team, from public speaking to employment interviews, he added. The competitions concentrate on building leaders and career development. \"The way they taught you life skills was awesome,\" Haskell said. \"It really stuck in your head.\" Furthermore, \"you definitely become a leader,\" she said. \"It's definitely for everyone, and I told all the people I know when I got back to school to get into MAAP STARS.\" Because so much of the conference \"is planned down the minute,\" students also learned valuable time-management skills, she said. \"Being in charge of your own time is very adult-like.\" Haskell was also impressed by the sheer amount of volunteers working the event, showing they care about the students, she said. Furthermore, the event was conducted at \"a really beautiful hotel, which I don't think a lot of kids [who were] there get on a regular basis.\" Haskell first learned about the possibility from her sister, Ally, who participated in MAAP STARS and told her \"it was a blast, and it taught you a lot about growing up,\" she said. \"It really does, and we could all benefit from that.\" For example, the critique sheets from judges helped students improve their employment interviews in later rounds, she said. \"We really took their comments to heart.\" Though the articulate Haskell had long been told she more than held her own in conversations with adults despite her youth, she didn't expect to finish second out of more than 200 students in the employment interview, she said. Instead, her focus was on the public speaking category, where she also excelled, finishing sixth out of more than 150 contestants. \"I really like public speaking, and I prepared for weeks,\" she said. \"I rewrote it and rewrote it and rewrote it.\" Though Haskell had a remarkable story to tell of her education journey, her speech needed to fit within a five to seven minute time frame, Ostfeld said. \"She was so receptive to reworking it repeatedly, and she deserves her\" accolades. Because her father, Keith, is a pastor (at Bridges of Hope Community Church), and she often helped him at events, Haskell grew up with public speaking, she said. \"I did introductions for him, and he trained me to be comfortable with public speaking,\" she said. While in high school, Haskell's mother, Kathleen, also excelled in public speaking, receiving recognition for a speech she gave about her mother's death from ALS. When Haskell told her mother she was going to give a speech for MAAP STARS and \"follow in her footsteps,\" Kathleen's advice was succinct: \"Do something personal.\" So Haskell shared the painful details of her educational journey for the first time publicly. Adding to the irony was the fact the first day of the conference--at a hotel--took place on the two-year anniversary of her own hotel nightmare, she said. \"It was emotional, but also more meaningful because I overcame that,\" she said. Haskell discovered \"it's easier to tell strangers than people close to you,\" she said. \"Family and friends have this weird pity, and they're afraid to talk about it, but judges understand, and I could cry with them knowing I was being heard.\" A judge even hugged Haskell and cried herself, she added. \"I didn't know they could do that.\" Haskell also credited ALC social studies teacher Don Hettinga, who accompanied the group as a pinch hitter for Ostfeld, who was unable to attend due to a death in his family. Hettinga's presence also added poignancy to the ALC's community service project, Pennies for Patience, as he's a cancer survivor. \"Everybody knew (Hettinga),\" Haskell said. \"It was so cool.\" Though not a particularly close-knit group prior to the conference, the six students from Owatonna bonded while at MAAP STARS, she said. It was neat \"to get close to people\" with similar interests and goals, and \"we became a little family.\" Stories of redemption like Haskell's are a reason \"I don't want to do anything else\" but teach at an ALC, said Ostfeld, who is in his second year in Owatonna after nine years at a Rochester ALC. \"It has its challenges every day, but to see students walk across the stage on graduation day--my favorite day of the year--with their diplomas, beaming with pride, knowing what they've been through, and what they're capable of, makes everything worthwhile,\" said Ostfeld. Though earning a high school diploma \"doesn't seem like a lot to people outside this building, it means a lot to us,\" Haskell said. \"That diploma is a reminder every morning that I can do it.\" Indeed, Ostfeld spends much of his time convincing students they can excel, and they often do, he said. He tried to remind them \"the past is the past, and it's never too late for anything.\" "}, {"articleID": "2010110206_00224104_W", "names": {"Lote Tuqiri": ["Q364694", "Q6684640"], "Andrew Gee": ["Q2846606", "Q4757071"]}, "date": "2010-11-02", "url": "http://news.brisbanetimes.com.au/breaking-news-sport/defence-could-win-roos-the-mental-edge-20101102-17c0x.html", "content": "a leaky defence is all that stands between a mental edge or defeat for australia in saturday night's four nations final dress rehearsal against new zealand. australian centre brent tate believes the winner of the dead rubber in auckland would earn a huge psychological advantage going into the tournament final at suncorp stadium on november 13. \"both teams will want to win on saturday night...i think it will definitely give the winner an edge (in the final),\" he told aap. \"you always want to be winning going into finals matches and psychologically it's a huge advantage.\" australian coach tim sheens blasted his charges' second half performance in last sunday's 34-14 victory over england, claiming the kiwis would be encouraged by australia's patchy ruck defence. tate concedes the australians let themselves down with sloppy handling and porous defence last weekend, but backed them to bounce back from the criticism. \"i think it's just a general thing of tightening everything up,\" he said. \"i think we dropped too much ball the other night, and defensively we were a little bit too loose as well.\" sometimes it doesn't take too much to sharpen those things up so hopefully come saturday night we can put a really good performance together. \"but we've got a lot of classy players in our side and a lot of big game players to help us do it.\" tate added the kangaroos will need to keep a close eye on playmaker benji marshall, with the kiwi star able to punish teams who take their foot off the gas. \"they are a dangerous team if you give them any space, especially with a guy like benji dictating terms the way he has been,\" he said. \"they've got plenty of strike players out there and the challenge there for us now is to do our best and try and stop that.\" marshall's west tigers teammate <mark>lote tuqiri</mark> knows the kiwi superstar's game better than most, but even he was struggling to come up with a plan to stop reduce his impact. \"i guess it would be easier, but you never know with benji, he's an unpredictable player,\" <mark>tuqiri</mark> told aap. \"and you can't really let your foot off what you're trying to do and relax because that's the time he'll pounce.\" obviously our defence was pretty ordinary last week, and in cases where they did score a few tries we let ourselves down in the communication and i guess reading the defence so that's something we'll work on this week. \"<mark>tuqiri</mark>, having played at eden park during his rugby union days with the wallabies and nsw waratahs, is the sole kangaroo with any experience of what to expect from a crowd at the venue - and he has a warning for his teammates.\" it won't be a warm (reception)... there's a fierce rivalry between new zealand and australia and i think that will be shown on the weekend, \"he said. wine copyright © 2010 fairfax media brits hail the wallabies often dismissed in the northern hemisphere as exponents of fluffy running rugby, the wallabies have been hailed by the british press. phar lap the cup's greatest winner eighty years after his melbourne cup win, phar lap has saluted again as the rightful winner of the greatest cup never run. americain wins melbourne cup americain's victory in the 150th running underlines what an international event the race has become. tiger woods upbeat about regaining no. 1 tiger woods is upbeat about regaining the world number-one spot with three events remaining this year. broncos give te reo a second chance three years after telling john te reo he was sacked brisbane's <mark>andrew gee</mark> has kept his word and offered young kiwi-born utility a second chance at the nrl. fanning says gilmore can win 10 titles defending men's champion mick fanning predicted stephanie gilmore can go onto win at least 10 women's world surfing titles. sonny bill back in school with all blacks sonny bill williams admits feeling like a schoolboy again as he finds his way with rugby's world no. 1 all blacks. gibbs defends book as\" open and honest' herschelle gibbs defends his controversial autobiography, calling the description of drinking, drugs and sexual antics on cricket tours \"open and honest\" . macqueen says wallabies on track australia's world cup-winning coach rod macqueen believes the wallabies are well-positioned to launch an attack on next year's rugby tournament."}, {"articleID": "2011100523_00039850_W", "names": {"James Martin": ["Q16567028", "Q1680235", "Q19661856", "Q21457369", "Q21664719", "Q22985957", "Q27919864", "Q28733139", "Q28919976", "Q28941801", "Q29641354", "Q3547757", "Q3806666", "Q40329092", "Q4282520", "Q52834492", "Q6138967", "Q6138975", "Q6138977", "Q6138979", "Q6138982", "Q6138984", "Q6138985", "Q6138989"]}, "date": "2011-10-06", "url": "http://nursingtimes.net/nursing-practice/clinical-specialisms/cardiology/nurses-should-play-a-big-role-in-society/5035953.article?referrer=RSS", "content": "\"nurses should play a big role in society' nurses often feel they get more than enough exercise on the wards but that is not the case for orthopaedic nurse mark dabbs. he runs nine miles to and from work every day, come rain or shine, and has run in all bar five of europe's capitals to raise money for charity. he has participated in marathons all over the globe, raising funds for the local hospice, marie curie cancer care and guide dogs for the blind. he has written a novel, researched and written about local history, organised photographs with celebrities for a charity book and become an international ambassador and health promoter for walsall. oh, and works as a nurse in a busy midlands hospital, too. his role as walsall's greatest ambassador began with his running.\" a friend of mine told me how he had seen walsall described in the media as \"full of fatties\" and laughed and said i ought to do something about that as i was walsall born and bred and so fit, \"says mr dabbs.\" at the time, i was running marathons all over the world, and my next one was in cape town, so i took them a gift from walsall and arranged to meet their mayor for a bit of publicity for the town. \"she met me and asked me to attend a dinner that night and meet the president. i assumed she meant the president of a group or club. i had no idea until i turned up that she meant the president of south africa. i met nelson mandela that night.\" former prime minister margaret thatcher, comedian ken dodd, chef <mark>james martin</mark> and newsreader angela rippon have also made it into his photograph album. \"i decided to meet and interview celebrities, and get a photograph with them and my walsall scarf for a book called travels with my scarf,\" says mr dabbs. \"it's soon going to be finished, and i am going to sell it for charity.\" although writing, running and fundraising may feel like full-time careers, mr dabbs says they do not detract but enrich his work in nursing, which he has been involved in for 12 years. he took up nursing after a series of jobs he didn't enjoy, such as factory work. \"i'd not done terribly well at school, but i'd always loved health so i went to night school to learn nursing,\" he says. \"i think my other work inspires patients. having run and suffered injuries and pain, i know how hard it can be for them when their bodies are not in top condition and how difficult it is to motivate yourself. i show how important it is not to stagnate but to use the life you've been given.\" he feels his running has inspired his fellow nurses to take care of themselves. \"people are always asking me where i am off to next and what i am up to. i've encouraged a couple of nurses to do the race for life, and given them advice about running,\" he says. \"i run to work - it's three miles there, and i take a six-mile route back. it saves me parking but also allows me to wind down and keep healthy. it's important to have something to help you relax. working on an orthopaedic ward you see a lot of dementia patients, and that can get to you if you don't have an outlet.\" for mr dabbs, being a nurse is not just about the job but being a role model and taking care into the community. he was inspired by sister dora (nurse dorothy wyndlow pattison), who risked her life to look after men involved in railway and industrial accidents in walsall, attending over 12,000 patients in 1867 following an ironworks explosion and a smallpox outbreak. \"i take pride in my local community. i've painted out graffiti, cleaned up the canal and tried to promote health. i think nurses should play a big role in society.\" he's been rewarded for that with a good citizen award from walsall council. \"and that is my proudest achievement,\" he says. at 35, he still has more ambitions. \"i'd love to run easter island in the pacific. and i want to finish off running every capital city in europe and continue being an ambassador and show the whole country that we are well-intentioned good folk, not all\" fatties'. that's important to me. \"we have a new website just for student nurses, with everything from the usual site at a discounted price plus more. take a look now at\" there is so much changing here all the time. and every time i've got itchy feet, i've had a promotion' new evidence may call into question conviction of \"killer nurse' colin norris online learning for nurses update your skills and earn cpd hours with convenient online learning units from nursing times learning advertise with the uk's leading nursing weekly and the biggest nursing website outside the us, with an audience of more than 300,000 unique users a month. we provide a range of both print and online advertising opportunities. with essential content, nursing times equips you with the latest unbiased information and best practice, so you can be the best nurse you can be, now and in the future."}, {"articleID": "2018092823_00243989_W", "names": {"Bill Condon": ["Q28709359", "Q361336", "Q48798555"], "Rebecca Hall": ["Q230534", "Q58010813", "Q7301759"], "Kelly Macdonald": ["Q230383", "Q6386172"], "Adam Mckay": ["Q350405", "Q41538972"], "Jimmy Miller": ["Q16732610", "Q18586910"]}, "date": "2018-09-28", "url": "http://deadline.com/print-article/1202473427/?KeepThis=1&TB_iframe=1&height=500&width=750", "content": "\"Holmes & Watson' Trailer: Elementary, My Dear Ricky Bobby By Patrick Hipes 9 mins ago Sony Pictures There's plenty of room inside the Sherlock Holmes tent, with the canon easily available to everything from those fantastic gravel-crunching British movies, to teenage (Barry Levinson's Young Sherlock Holmes) and elderly (<mark>Bill Condon</mark>'s Mr. Holmes) takes, Guy Ritchie's action-hero versions and, most recently, a simply stunning modern adaptation pulled off by the BBC, Masterpiece Theater, Mark Gatiss, Steven Moffat, Benedict Cumberbatch and Martin Freeman. So add to that the newest inductee to the club, Sony's Holmes & Watson, a rare stab at a comedic take on Arthur Conan Doyle's Victorian master detective and his cohort, and the latest reteam of Will Ferrell and John C Reilly from their Talladega Nights and Step Brothers days. Sony Pictures dropped the first trailer today ahead of its December 21 release date. This one goes period and parody, as you would hope and expect from Ferrell and Reilly and the script by Etan Cohen (back directing Ferrell after Get Hard, and who also penned the upcoming Men In Black 3). Cohen also directs the pic which finds the legendary detective (Ferrell) and his doctor-sidekick Watson (O’Reilly) tasked with solving a murder at Buckingham Palace; if they fail, the Queen gets it next. Included in the trailer that hit today: fighting killer bees with pistols, a\" no-sh * t' - Sherlock \"reference and Victorian selfies. <mark>Rebecca Hall</mark>, Rob Brydon, <mark>Kelly Macdonald</mark> and Ralph Fiennes as the evil mastermind Moriarty also star. Ferrell, <mark>Adam McKay</mark>, <mark>Jimmy Miller</mark> and Clayton Townsend are producers, and Chris Henchy, Jessica Elbaum and M Riley are executive producers. Check out the trailer above."}]