[{"articleID": "2018102500_00082283_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-10-24", "url": "https://www.onenewspage.com/n/Front", "content": "One News Page 4 hours ago) President <mark>Donald Trump</mark> vows that \"acts or threats of political violence have no place in the United States.\" He was speaking after multiple reports of suspicious devices being sent to Democrats, media companies and prominent individuals. (Oct. 24) ▶ <mark>Trump</mark> Promises Thorough Investigation Into Suspicious Packages 00:34 According to Reuters, U.S. President <mark>Donald Trump</mark> said that threats of political violence have no place in the United States, promising a full investigation into suspicious packages that were mailed to prominent Democrats and others. <mark>Trump</mark> said that \"The full weight of our government is being...You Might Like US President <mark>Donald Trump</mark> has said\" acts or threats of political violence have no place in the United States \"after suspicious packages were sent to Democrats and the media. Credit: PA - Press Association STUDIO - Published 2 hours ago Former President Barack Obama reportedly had a plan in the event then-candidate <mark>Donald Trump</mark> lost the 2016 election and refused to accept the results. Former President Barack Obama had a plan in the. . Credit: Geo Beats - Published"}, {"articleID": "2016082218_00210656_W", "names": {"John Harbaugh": ["Q2412102", "Q29344932"]}, "date": "2016-08-22", "url": "http://www.espn.com/blog/nflnation/post/_/id/211098/does-matt-elams-knee-injury-signal-end-of-his-ravens-career", "content": "comment OWINGS MILLS, Md.--Baltimore Ravens safety Matt Elam suffered another untimely injury, and it could ultimately be his last one with the team. Elam, a 2013 first-round pick who has struggled with his consistency, will undergo arthroscopic surgery for a chip in his knee after he was making a push to make the Ravens' 53-man roster. \"It won't be a season-ending injury by any stretch,\" coach <mark>John Harbaugh</mark> said. \"They say it's about some number of weeks into the early part of the season.\" That puts the Ravens in a difficult situation. Baltimore can either use a roster spot on Elam until he's healthy, release him before the start of the regular season or place him on injured reserve-designated for return. But Baltimore didn't use that IR designation on Elam last year, so that's probably not in play this time. Ravens safety Matt Elam is dealing with a significant injury for the second straight year. Steve Mitchell/USA Today Sports If the Ravens don't want to carry an injured backup, they could decide to give Elam an injury settlement and part ways with him three years after using the No. 32 overall pick on him. Baltimore could attempt to bring him back when he's healthy. \"(General Manager) Ozzie (Newsome) will deal with it roster-wise however he decides to deal with it,\" <mark>Harbaugh</mark> said. This is the second straight year that a significant injury has curtailed Elam's chances of making the team. Elam, who had problems with tackling and giving up big pass plays in his first two seasons, was having a solid training camp last year when a torn biceps ended his season. Last week, Elam was making major strides and was playing his best football in recent memory. He was breaking on passes in practice, and he was making open-field tackles in Saturday's preseason game. Elam was starting to look like the safety the Ravens envisioned until he fell on his knee Saturday. He learned Sunday that he needed surgery. The Ravens have never had to part ways with a first-round pick before his rookie contract expired. But Elam's latest injury might force the Ravens into cutting a player that was making a serious run at the season-opening roster."}, {"articleID": "2008120214_00041043_W", "names": {"John Ferguson": ["Q16217277", "Q1668361", "Q18379649", "Q19957766", "Q21461016", "Q27915205", "Q29642657", "Q3183189", "Q6232967", "Q6232977", "Q6232987", "Q6232993"]}, "date": "2008-12-02", "url": "http://news.com.au/heraldsun/story/0,21985,24744065-662,00.html?from=public_rss", "content": "by <mark>john ferguson</mark> december 03, 2008 12:01 am the woman who has accused labor powerbroker theo theophanous of raping her sent friendly text messages several years after the alleged assault. the herald sun has seen christmas and new year messages sent by the woman in which she wishes the embattled mp a long and happy life. the woman also extended the season's greetings to mr theophanous's family, more than four years after she claims he assaulted her in parliament house. the text messages have been retrieved from greek phone records and are likely to be crucial to the police investigation. it is believed the former melbourne woman, who is aged in her 40s and now lives in greece, has alleged she had no social contact with mr theophanous after she claimed he raped her in september 1998. but the text messages contradict this. on christmas day in 2002, at 10.03 am, the woman texted mr theophanous from overseas, declaring: \"wishing you and the family a very merry xmas.\" she also sent a greek greeting, which when translated to english wished mr theophanous \"many happy years\" . on new year's day 2003, at 11.37 am, she sent another sms declaring: \"happy new year. may 2003 be a joyus (sic) and prosperous year for you.\" it is believed police are aware of the bombshell text messages, which raise the question of why the woman remained in contact with the father of four after she accused him of sexually assaulting her. police are still investigating the rape allegations, which have derailed mr theophanous's ministerial career. he has denied the allegations. mr theophanous has stood down from cabinet while the police investigate but is expected to return to the front bench if no charges are laid. the herald sun believes police have been told of other possible instances where there was friendly social contact between the accuser and the mp after the alleged assault. this was at greek community functions where both the alleged victim and mr theophanous were said to be present. the issue of social contact after september 1998 is likely to be crucial to mr theophanous's defence if charges are ultimately laid. the accuser decided to make a series of tell-all revelations in a media interview, where she did not reveal her identity. police are still examining evidence after interviewing mr theophanous. a brief is likely to be passed on to prosecutors to determine if charges should be laid. the woman who has accused labor powerbroker theo theophanous of raping her sent friendly text messages several years after the alleged assault. the herald sun has seen christmas and new year messages sent by the woman in which she wishes the embattled mp a long and happy life. the woman also extended the season & squo; s greetings to mr theophanous & squo; s family, more than four years after she claims he assaulted her in parliament house. emma hansen: no accountability for crash - victim's mum"}, {"articleID": "2011090614_00361894_W", "names": {"Andrew Mitchell": ["Q333261", "Q4758038", "Q4758039", "Q4758043", "Q48796982", "Q54310554", "Q57820261"]}, "date": "2011-09-06", "url": "http://10tv.com/content/stories/2011/09/06/columbus-stolen-credit-cards-used.html", "content": "trio of thieves seen using stolen credit cards tuesday september 6, 2011 9:04 am updated: tuesday september 6, 2011 9:08 am police released surveillance photos of three people who they said used a college student's stolen credit card. the credit cards were used at the walmart, located on georgesville road, a gas station located on wilson road and a west side kroger store, crimetracker 10's angela an reported tuesday. the victim said that she lost the cards in late july while she was in the short north. forgery detectives said that criminals usually use stolen cards where they are most comfortable. \"it's familiar to them and they usually know the clerk or know where they can get away, using someone else's card,\" said columbus police detective <mark>andrew mitchell</mark>. anyone with information about the case is asked to call crime stoppers at 614-461-8477. watch 10tv news and refresh 10tv. com for additional information. full schedule 8:00 ncis 9:00 ncis: los angeles 10:00 ncis: los angeles"}, {"articleID": "2013090212_00028255_W", "names": {"Andrew Hughes": ["Q16234640", "Q20677018", "Q2351918", "Q4757357", "Q4757358", "Q56260341", "Q58300911"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2013-09-02", "url": "http://au.news.yahoo.com/latest/a/-/article/18754652/early-voters-turning-out-in-record-numbers/", "content": "A record number of Australian are voting early ahead of Saturday's federal election, a trend one political analyst says could be crucial to the outcome. So far 715,000 people have cast their vote at an early polling station or via post. That is up from 446,000 people at the same stage of the last election. In 2010, there were 1.5 million pre-poll votes and nearly 1 million postal votes. \"We're certainly trending above that at this stage,\" said Phil Diak from the Australian Electoral Commission. Elections are always held on a Saturday because traditionally that is the day most people are not at work or church. Mr Diak says more people find they are too busy to attend a polling station on election day. \"It has been a continuing trend, we have an electorate that perhaps works more on Saturdays.\" We also have people that are highly mobile and might be out of their electorate, travelling more interstate, even overseas. All of those people can vote before they go. \"There are rules around early voting, the bottom line is you must be unable to attend polling day for legitimate reasons.\" Australian National University political analyst <mark>Andrew Hughes</mark> says candidates have started to target their campaigns toward early voters. \"These early voters can decide the outcome of an election so you want to make sure you do reach them and contact them and engage with them,\" he said. \"The way people do that is through social media, without disrupting their main campaign.\" <mark>Tony Abbott</mark> seeks to explain baddies versus baddies comment on situation in Syria"}, {"articleID": "2011042919_00109265_W", "names": {"Dave Martin": ["Q1173280", "Q18749080", "Q3018159", "Q4282523", "Q5229283", "Q5229285"], "Phil Campbell": ["Q366807", "Q56462605", "Q7181755"]}, "date": "2011-04-29", "url": "http://newstimes.com/news/article/Killer-twisters-likely-among-largest-strongest-1357265.php", "content": "killer twisters likely among largest, strongest kristi eaton, associated press, randolph e. schmid, associated press this aerial photo shows the devastation of the rosedale court housing community in tuscaloosa, ala. on thursday, april 28, 2011. a powerful and deadly tornado cut through alabama wednesday evening. president barack obama said he would visit alabama friday to view damage and meet with the governor and families devastated by the storms. obama has already expressed condolences by phone to gov. robert bentley and approved his request for emergency federal assistance. photo: the tuscaloosa news, dusty compton / ap this aerial photo shows the devastation of the rosedale court...an aerial view of tornado damage is seen in tuscaloosa, ala., thursday, april 28, 2011. photo: <mark>dave martin</mark> / ap an aerial view of tornado damage is seen in tuscaloosa, ala.,...tim heath, left, and his cousin, who did not want to give their names, look through what is left of his home, thursday, april 28, 2011, in <mark>phil campbell</mark>, ala. wednesday's tornado destroyed his home and his grandmother's house across the street. photo: bob farley / ap washington (ap) - some of the killer tornadoes that ripped across the south may have been among the largest and most powerful ever recorded, experts suggested, leaving a death toll that is approaching that of a tragic \"super outbreak\" of storms almost 40 years ago. \"there's a pretty good chance some of these were a mile wide, on the ground for tens of miles and had wind speeds over 200 mph,\" said it may have been a single long-ranging twister that battered tuscaloosa, ala., and then covered the 60 miles to birmingham, brooks said. only 1 percent of twisters reach the most powerful readings, but brooks thinks several of those that left death and destruction in alabama and five other states wednesday fall into that category. that speculation hasn't been confirmed yet, but if it is, it's no wonder so many homes were flattened and scores were killed. most tornadoes are weak, so most reasonably built structures survive them. the typical tornado is on the ground for a couple of miles and is a couple hundred yards wide with half the wind speed of the storms that barreled through the region on wednesday. it was the deadliest day for tornadoes since a series of twisters killed more than 300 people in 11 states in 1974, brooks added. the death toll from wednesday has surpassed 250 and is rising. the worst day in recorded history for storm fatalities is march 18, 1925, with 747 deaths. \"a big question is - the tornado in tuscaloosa and birmingham, is it the same one? i think they are the same,\" he said. texas tech university, said the storm that spawned that tornado formed in mississippi and \"lasted over 300 miles, and even for a super cell that's pretty long.\" tornado outbreaks happen just about every year somewhere in the country. but this time conditions were just about perfect for the series of powerful storms, explained university of oklahoma. he noted that a deadly tornado in oklahoma in 1999 also was almost a mile wide. brooks noted there was a trough in the mid-levels of the atmosphere over the western u.s., with a strong jet stream coming across the southern u.s. a trough to the west means winds blowing to the south, turning and then moving back north at the same time a powerful jet of wind blows from the west above. and that, explained brotzge, results in an area \"to the east of the trough where you have warm, moist southeast winds at the surface and strong dry winds from the west above...that creates the perfect scenario for strong thunderstorms\" and tornadoes. \"causes are always difficult to assign,\" brooks said. \"a little bit has probably been the weakening la nina in the pacific, but not all weakening la ninas are associated with lots of tornadoes, and we get lots of tornadoes in other situations as well.\" la nina is an unusual cooling of the water in the tropical pacific ocean that can change weather patterns around the world. the federal climate prediction center said last month that la nina conditions were weakening but could continue to affect weather for months. weiss said there is no scientific consensus on whether climate change played a role in this series of powerful storms. \"the problem is trying to relate a climate signal to a specific weather event is always dangerous,\" he said. deaths from twisters have been declining in recent years because of improved forecasts and increased awareness of them by people living in tornado-prone areas, especially in smaller and rural communities. while most americans live in cities, urban areas actually cover only a relatively small percentage of the country. the result is that tornadoes occur more often in rural, sparsely populated areas. that's led some people to believe twisters don't strike cities. but the national climatic data center in asheville, n.c., calls that a myth: \"tornadoes have hit several large cities including dallas, oklahoma city, wichita falls, st. louis, miami and salt lake city. in fact an urban tornado will have a lot more debris to toss around than a rural twister.\" while may is historically the busiest month for tornadoes, they surge sharply upward in april as warm weather begins setting in and dry western air collides with warm moist conditions moving north from the gulf of mexico. indeed, the biggest tornado outbreak on record occurred april 3-4, 1974 when 147 confirmed twisters touched down in 13 states, claiming more than 300 lives in the united states and canada. however, april 1957 was more like this year, recording several days with large numbers of deadly twisters, said brooks. by contrast april 1974 was a relatively average month, he said, with one \"ridiculous\" day. the extraordinary swarm of tornadoes battering the country this month seems bent on proving grady dixon's point - tornado alley is a lot bigger than people thought. while that's traditionally seen as a north-south swath of the nation from the dakotas to texas with a second twister center - dixie alley - extending across the south from arkansas to georgia, dixon argues they are really one big tornado risk area. \"our goal is to show that there really are no separate regions, it's all one large risk area that's connected,\" dixon said, describing a study scheduled to be published in the bulletin of the danbury's parking woes city officials say the lack of parking is a \"perception\" that needs to be addressed through marketing campaigns. contributed photo / danbury news times contributed"}, {"articleID": "2018082115_00085275_W", "names": {"Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"], "Seth Roberts": ["Q21066522", "Q7456587"]}, "date": "2018-08-21", "url": "http://www.beloitdailynews.com/sports_news/20180821/nelson_fits_in_with_oakland", "content": "Nelson fits in with Oakland August 21, 2018 at 10:05 am | Print Article Associated Press Former Packers WR Jordy Nelson will take on his old team Friday night. ALAMEDA, Calif. (AP) - After spending his first 10 NFL seasons in Green Bay with the same quarterback and head coach, Jordy Nelson acknowledged it took a little time to adjust to his new environment with the Oakland Raiders. Nelson got over that fairly quickly and has done his best to fit in and adjust right away, becoming a leader in the receiver room and a trusted target for quarterback Derek Carr. \"He's been a playmaker on the field,\" coach Jon Gruden said Monday. \"He's been a consistent, reliable target at a couple positions. He's been a real good influence behind the scenes. We've been really, really happy with his addition to this team.\" Nelson gets the chance to reunite with Aaron Rodgers, coach <mark>Mike McCarthy</mark> and the rest of his former Packers teammates when Green Bay visits the Raiders on Friday night in an exhibition game. \"Those are the guys you miss that you see day-to-day, that you don't get to talk to as much as you're used to,\" Nelson said. \"It'll be fun to see them. It's kind of enjoyable as a preseason game so we can have some fun and get in and get out.\" The 33-year-old Nelson struggled last season with 53 catches for 482 yards and six TDs, recording a career-low 9.1 yards per reception as Rodgers missed more than half the year with injuries. Nelson had 25 catches for 290 yards and all six of his TDs in five games before Rodgers broke his collarbone last season. Those numbers plummeted once Brett Hundley took over and the Packers released Nelson in March. He signed a two-year deal with the Raiders, who believe he still has burst left in his game. Carr heard plenty about Nelson from his former college teammate at Fresno State, Davante Adams, who played the past four seasons with Nelson in Green Bay. Carr said the only thing that has surprised him about Nelson is that he still has the speed of a much younger player. \"Everything that you hear about him is what you get,\" Carr said. \"He helps the receiver room raise their level, whether you're the second guy, third guy or you're just trying to make the team, he raises the level for others. It's not only with the way that he practices and works out and the way he takes care of his body and those things, but the way he goes after it mentally. He wants to think like the quarterback. If we throw a ball, we're always communicating. We'll say,\" Hey, if they play it this way, I like it like this .' Just the way he communicates, it rubs off on those young guys, too. \"Nelson has plenty of experience. He had four 1,000-yard seasons in Green Bay, including 1,519 yards on 98 catches in 2014. In 136 career games, he has 550 catches for 7,848 yards and 69 TDs. Nelson made the Pro Bowl in 2014 and won AP Comeback Player of the Year in 2016 when he led the league with 14 touchdown catches a year after missing the entire season with a right knee injury. Once he got comfortable enough with the new offense in Oakland, Nelson has been able to share some of what he learned with younger receivers in Oakland.\" Once I started feeling that out, I've been able to have more conversations with guys and really get into the fine details of maybe some suggestions or ways to help them create more separation, which is what we're all trying to get at the end of the day, \"he said. While Nelson and Amari Cooper are entrenched as starters in Oakland, Gruden is still searching for someone to emerge as the third receiver. Martavis Bryant has been in and out of practice and <mark>Seth Roberts</mark> missed close to two weeks with an injury. <mark>Roberts</mark> returned to practice Monday but his time away has allowed Ryan Switzer and Griff Whalen to get more time in the slot in practice with Carr.\" We're all sitting there excited to see what happens, \"Carr said.\" They're all, I think, healthy. We'll see. I think they're all mentally ready, physically ready. Hopefully come game time, we can sit there and we can evaluate that spot. \""}, {"articleID": "2019060311_00042105_W", "names": {"Ian Mccall": ["Q576525", "Q5982260"], "Martin O'Neill": ["Q16733787", "Q310263"], "Paul Taylor": ["Q1818773", "Q18387151", "Q18588327", "Q2062707", "Q2062712", "Q21462943", "Q23417071", "Q2916069", "Q3372254", "Q3372257", "Q3526255", "Q42887513", "Q56847772", "Q7153929", "Q7153931", "Q7153933", "Q7153935", "Q7153936", "Q7153937", "Q7153938", "Q7153939", "Q7153941"]}, "date": "2019-06-03", "url": "https://www.nottinghampost.com/sport/football/transfer-news/nottingham-forest-sleeping-giant-scottish-2934661", "content": "Get the biggest Weekday Nottingham Forest FC stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Hot-shot striker Lawrence Shankland, who has been linked with Nottingham Forest, is said to have three teams to choose from as he ponders his next move--including one from \"a sleeping giant-type club\" . Shankland is a free agent as his Ayr United contract comes to an end this summer, and a prolific season in the Scottish Championship has put him firmly in the shop window. The Reds, Hull City and Sunderland were all said to have taken an interest, back in February, while Swansea City had a bid rejected during the winter transfer window, and Celtic and Rangers are also reportedly keen. Now Ayr manager <mark>Ian McCall</mark> has revealed the 23-year-old front man has two English sides and a leading club in Scotland all vying for his signature. Read More Nottingham Forest \"target' Gavin Whyte hailed as\" one of the best deals I've ever made' \"He has to go to a club where he will play,\" <mark>McCall</mark> told BBC Scotland. \"There may be the option of a very, very big club, but would he play there every week, to take that next step and kick on again? He added:\" One of them, it's a club in Scotland and you need to be really mentally strong. \"That's something I think Lawrence has, but the only way you find that is if you go through it.\" You can't predict that, it's something you have to live through to find out if you have it. \"There are a couple of pretty sizeable clubs in England where I'm pretty sure he would play. One in particular would suit him, a sleeping giant type club. Lawrence Shankland in action for Ayr United (Image: PA)\" He has three now to choose from. \"Shankland made the move to Somerset Park two years ago and has racked up an impressive haul of 63 goals in 74 appearances across the past couple of seasons. This term alone he finished with a tally of 34 strikes in 41 games in the second tier, and <mark>McCall</mark> believes he can get even better, tipping him for an international call-up for Scotland in the near future.\" If his mentality is as good as it can be, which he'll need if he goes to a big club, he can be as good as any of them (strikers in the Scotland squad), \"he added.\" He scores goals with his right foot from 25 yards, with his left foot from 20 yards, he scores tap-ins, headers. Read More Youngster Nottingham Forest wanted for £ 1m reportedly set for £ 7.5 m Premier League move \"He's so fit and strong. I'm not even sure if he's best as a number nine or number 10.\" He's not even close to how good he could be. \"Coming through at Aberdeen, he's had loans that didn't work out and he's quite a complex boy.\" Technically, people don't realise what he's got. He can drop off, find passes with left or right foot that gifted midfielders see. \"Or he can play right up in the box. Forest manager <mark>Martin O'Neill</mark> (Image: Dan Westwell)\" It doesn't matter where it falls to him, he can create space for himself in a second. \"Shankland himself has previously said his next move would not be motivated by money, but by the chance to play regular football.\" I've played two full seasons now and done well, \"he said back in April.\" People were doubting me a wee bit at the start of the season because I'd been in the Championship but not done that great. \"It's been good to show I can play at this level and if I get the chance to play in the Premiership or wherever then I will look forward to it.\" It's honestly not about the money for me. I want to keep improving and the money will come if you do well enough. \"I want to go somewhere where I can go and show people what I can do.\" Sign up for our free Forest WhatsApp service for latest news Keep up to date with the latest Nottingham Forest news, features and exclusives from Nottinghamshire Live via our free WhatsApp service. Text NEWS to 07557204102 and then add the number to your phone contacts book as ForestLive to receive daily updates and breaking news from our Reds reporters <mark>Paul Taylor</mark> and Sarah Clapson. Your phone number won't be shared with any other members of the group. Click here for more information on the service."}, {"articleID": "2019052108_00272567_W", "names": {"Paul Williams": ["Q11339500", "Q1375801", "Q14948624", "Q15441162", "Q15452843", "Q15990362", "Q18746544", "Q1933480", "Q19517939", "Q30165049", "Q3898170", "Q43082028", "Q50365751", "Q52645093", "Q542332", "Q55294657", "Q59094558", "Q7154382", "Q7154384", "Q7154386", "Q7154387", "Q7154392", "Q7154396", "Q7154397", "Q7154398", "Q7154399", "Q7154401", "Q7154402", "Q7154407", "Q927415"], "David Jones": ["Q10450056", "Q1174792", "Q1174894", "Q1174896", "Q16105375", "Q16945194", "Q17314899", "Q18350685", "Q18921618", "Q19665551", "Q20655901", "Q20732856", "Q21467224", "Q21467227", "Q24007312", "Q24007313", "Q260857", "Q2747788", "Q27906151", "Q27983475", "Q3018172", "Q312803", "Q4042624", "Q458276", "Q49193215", "Q50633601", "Q51397308", "Q52356357", "Q5235721", "Q5235722", "Q5235734", "Q5235735", "Q5235742", "Q5235743", "Q5235745", "Q5235746", "Q5383", "Q54666079", "Q56248428", "Q56507984", "Q56596961", "Q56604601", "Q57497739", "Q57552289", "Q728167"], "Michael Christian": ["Q27922508", "Q6829255"]}, "date": "2019-05-21", "url": "http://news.theage.com.au/sport/afl/thomas-hit-with-heavy-fine-for-umpire-abuse-20190521-p51prw.html", "content": "Larger text sizeVery large text size Carlton veteran Dale Thomas has apologised for setting a poor example after he was hit with a $7500 fine by the AFL Tribunal for calling boundary umpire Michael Barlow a \"f------cheat\" . Thomas pleaded guilty to a charge of umpire abuse stemming from an incident which occurred during the third quarter of Sunday's heavy loss to Greater Western Sydney at Giants Stadium. \"I'm extremely apologetic for the way in which I acted, the words I used and the way I spoke to umpire Barlow,\" Thomas said as he left the tribunal on Tuesday night. \"I reached out to him today to issue that apology, I spoke to him on the phone, and he accepted that quite well. It was tremendously unfortunate that I put myself in that position, I'm really disappointed in myself for doing that.\" Umpires are an amazing part of our game. Without them we wouldn't have a game, and for me to do that, as an experienced player, does not set a good example. Advertisement \"I put my hand up to that, hence the guilty plea, and the sanction that's accompanied that. We move on now, I look forward to Sunday's game [against St Kilda] and there'll be no more of this in the future hopefully.\" Tribunal jurors Wayne Henwood, Shane Wakelin and <mark>Paul Williams</mark> took four minutes to determine the penalty. Dale Thomas at the AFL Tribunal on Tuesday night. Credit: AAP AFL counsel Jeff Gleeson QC said that a base sanction for the offence should be $10,000, but called for Thomas to receive a discount of $2500 on the basis that the 2010 Collingwood premiership player had not disputed the recollection of events of umpire Barlow, had called Barlow to apologise unreservedly, and hadn't made Barlow submit to cross-examination. However Gleeson stressed that the charge was serious. \"There is no graver insult or accusation to level at an umpire, than to accuse him or her of cheating,\" Gleeson said. Gleeson added that it struck at the heart of the umpire's reputation of fairness and integrity. Carlton director Marcus Clarke QC, acting as Thomas' player advocate, argued that the base penalty should be $7500, and should be reduced to $4500 - $5000 because of factors including Thomas' apology and the fact this was his first offence of this nature in a 248-game career. The incident occurred following a GWS goal. Umpire Barlow had told the Giants that they had an extra man inside their forward 50 ahead of the next centre bounce, providing the GWS players with a warning, as umpires are supposed to do in line with the new 6-6-6 starting positions introduced this year. Thomas lashed out at Barlow when he heard the instructions: \"You can't tell them that. You can't tell them that dickhead,\" Thomas said in an agreed statement of facts. \"You're a f------cheat,\" Thomas continued. Thomas was informed at three-quarter-time of the game that he'd been reported. \"Umpires are important to the game. If we don't have umpires, we don't have matches,\" tribunal chairman <mark>David Jones</mark> said when summarising the case for the jurors. Because of the severity of the accusations, the matter had been referred directly to the tribunal by match review officer <mark>Michael Christian</mark> when he assessed the weekend's incidents on Monday. The fine follows a $10,000 fine - half of which was suspended - handed to Sydney co-captain Dane Rampe for telling an umpire that he \"talks like a little girl\" during a recent game against Essendon. That matter was dealt with by the AFL's football operations department rather than the match review officer."}, {"articleID": "2012122108_00037560_W", "names": {"Peter Jackson": ["Q25521960", "Q3376667", "Q39073400", "Q4160117", "Q4465", "Q52743056", "Q54556363", "Q7174914", "Q7174916", "Q7174918", "Q7174919", "Q7174920", "Q7174922", "Q7174923"]}, "date": "2012-12-21", "url": "http://femalefirst.co.uk/movies/movie-news/Sir+Ridley+Scott-272212.html", "content": "damon lindelof not writing prometheus sequel 21 december 2012 damon lindelof will not write the sequel to \"prometheus'. the\" lost' writer redrafted jon spaihts' script for the first film, but now a sequel is underway, he has ruled himself out due to clashes with other projects. he told collider.com: \"i'm usually very single-minded creatively. i can only be working on one thing at a time. so i said to [director sir ridley scott],' i really don't think i could start working on this movie until i do this other stuff, and i don't know when the other stuff is going to be done'. comment on this article\" he was like, \"well, okay, it's not like i asked you anyways'.\" he and i are on excellent terms and it was a dream come true to work with him. \"referring to criticism he received after the film's release, he added:\" much to the delight of all the fanboys, i don't see myself being involved in [the prometheus sequel]. \"damon recently worked on the screenplay for\" star trek into darkness' and is also writing a tv project. ridley has already started work on the sequel - which is tentatively titled \"paradise' - and is aiming for a 2014 or 2015 release. he said:\" from the very beginning, i was working from a premise that lent itself to a sequel. what did you think of the hobbit: an unexpected journey <mark>peter jackson</mark> has taken us back to middle earth for the first time in nearly ten years and femalefirst absolutely love this movie .? 2012 first active media ltd. all rights reserved."}]