[{"articleID": "2015091317_00024352_W", "names": {"Ryan Mathews": ["Q641173", "Q7384288"], "Andrew Gardner": ["Q2846608", "Q46997879"], "Ed Reed": ["Q1282460", "Q604393"], "Brandon Graham": ["Q16215795", "Q3643702"]}, "date": "2015-09-13", "url": "http://trentonian.com/sports/20150913/chip-kelly-wants-great-not-good-from-eagles", "content": "Philadelphia Eagles Chip Kelly wants great, not good from Eagles With Sam Bradford at the helm, hopes are high for Chip Kelly's Eagles as long as Bradford remains healthy. The Associated Press By Bob Grotz, bgrotz @ 21st-centurymedia.com, @ BobGrotz on Twitter Posted: The Eagles know they're good. Great, the goal of Chip Kelly's unconventional makeover is another thing. But it's safe to say the expectations at the starting gate are much like they were 11 years ago, when the Eagles went to the Super Bowl. Terrell Owens and Jevon Kearse helped put that 2004 team over the top. Byron Maxwell and Sam Braford are the new pieces the Eagles need to make this team special. \"I feel like we are a Super Bowl team,\" said Maxwell, who played in the last two NFL title games. \"Obviously you've got to put the work in. It's a long season. A lot of things can happen. But I definitely feel like we're in the mix. Most teams, they don't have a shot right away. We have a quarterback. And unless you have a quarterback, you can't win. So we've definitely got an opportunity.\" Advertisement Quarterback Bradford, acquired in a trade for Nick Foles, has shown glimpses of giving the Eagles a chance to be great. Bradford reads the game like a coach. He puts the ball in tight places as easily as some quarterbacks hand it off. He's also coming off back-to-back reconstructions of the ACL in his left knee. The Eagles acquired Bradford as is, which right now is healthy enough to play, but not so fit where each time he's driven into the ground you wonder if he's getting up. \"I just try to put that back in my mind and I haven't thought about it that much,\" said Bradford, sidelined all but seven games the past two seasons. \"I think more than any other season opener, I'm probably more excited than ever, just to get back on the field. It's something I've been waiting a long time for.\" If the Eagles keep Bradford healthy, Kelly's offense could become epic. The Eagles signed 220-pound running backs DeMarco Murray and <mark>Ryan Mathews</mark>, whose downhill style is a better fit for the Philly scheme than LeSean McCoy's north, south, east and west running. Third-down back Darren Sproles has been split out at receiver. With Kelly, the mismatches start at running back. North-south running backs and up-tempo equal misery for the opposition. \"I definitely think it's a positive,\" Murray said of the tempo. \"You don't get guys coming off the ball as hard. You get them in different looks. You get them confused. So I definitely think it's the upper hand for us. At the same time we've got to make sure we play with great tempo, great hand-eye coordination, all of the things that gives us an advantage. It's a lot of technique and being in great shape.\" Nelson Agholor was drafted in the first round to replace leading receiver Jeremy Maclin, who left in free agency. Jordan Matthews looks ready to take another big step and veteran Miles Austin is around if Michael Huff sputters. Tight end Zach Ertz still isn't all the way back from hernia surgery but veteran Brent Celek and Trey Burton are solid targets. The offensive line anchored by center Jason Kelce and tackles Jason Peters and Lane Johnson looks OK with Allen Barbre and <mark>Andrew Gardner</mark> stepping in as guards. The Eagles faded down the homestretch last season, losing three of their last four games and, despite 10 victories, failed to reach the playoffs. \"It's just unfinished business,\" Jordan Matthews said. \"We know we left a little bit on the table last year. We made a lot of changes. We've got a lot of hungry guys in this locker room. And I just love the focus. I mean you can tell when guys come in the building, there's a vibe, there's an electricity. Everybody's hungry and excited to be here but there's also a focus. Everybody knows that we've got to take care of business.\" The defense signed the ever-confident Maxwell, the top cornerback in free agency, to a six-year, $63 million contract. The signing of safety Walter Thurmond, another player with Seahawks pedigree, looks almost as helpful. Thurmond is a ball hawk who plays the angles and roams the back end like a knock-off of <mark>Ed Reed</mark>. Middle linebacker Kiko Alonso, acquired from Buffalo in the trade for McCoy, might not start the early portion of the season if veteran DeMeco Ryans is healthy. But Alonso and his legendary motor--\"That guy never gets tired,\" <mark>Brandon Graham</mark> said--will work in. Cornerback Nolan Carroll hopes to make Eagles fans forget that Bradley Fletcher started the past two years. The front seven is underrated with All-Pro Fletcher Cox, Pro Bowl linebacker Connor Barwin (14 1-2 sacks), <mark>Graham</mark> in a starting role and nose guard Bennie Logan. Kicker Cody Parkey says he's healthy after a groin injury and so are the special teams, which scored seven touchdowns last season, including two punt returns by Sproles and one kickoff return by Huff. The chemistry, at least at this early spot, is off the charts entering the season opener Monday night in Atlanta against the underdog Falcons. It's Chip Kelly's team. \"It's his team. It's our team, too,\" <mark>Graham</mark> said. \"He made the choices. We've just got to believe in it and I feel everybody believes that he made the right choices. Everything is coming together, man. I'm just excited, just like everybody else, just to see how everything comes together this weekend. I really feel like, man, we're going to get it done. People know that we're going to come to work. You're going to have some bad days, but we've got a lot of guys around here that are going to get you going and aren't scared to criticize you. And we've got a lot of people who can take it, too.\" It wasn't that way in Kelly's first two seasons when a personality here or a personality there seemed bigger than the team. And it hasn't been like that for, well, 11 years or so."}, {"articleID": "2016050408_00404421_W", "names": {"Mariela Castro": ["Q253736", "Q58031633"]}, "date": "2016-05-04", "url": "http://mysinchew.com/node/113991?tid=10", "content": "Chanel glitz comes to Havana, Cubans watch from afar 2016-05-04 16:13 By Hector Velasco Havana (AFP)--French fashion house Chanel staged its first Latin American catwalk show in newly trendy Havana Tuesday, but ordinary Cubans were left watching the glitz from afar. International celebrities and Cuban bigwigs graced the red carpet as Karl Lagerfeld showed his latest collection, which the German designer infused with the styles and colors of the Caribbean island. Cubans without an invitation to the exclusive event meanwhile packed the balconies of old Havana or lined the police cordon outside, straining to catch a glimpse of the beauties in the distance. \"What a sight. But I would have liked to be closer to the models,\" said 52-year-old Mireya Correoso, who told AFP she had never seen so much luxury and showbiz in one place. It was the latest in a stream of international cultural events on the communist island as it opens up its diplomatic and commercial relations. \"The world is finally opening up to Cuba. Everyone wants to come taste the forbidden fruit. Everyone wants to discover it, savor it, enjoy it, explore it,\" said <mark>Mariela Castro</mark>, the daughter of President Raul Castro and a prominent gay-rights activist on the island. Other high-profile attendees included Hollywood stars Vin Diesel, Tilda Swinton and Geraldine Chaplin. Diesel is in town shooting the latest \"Fast and Furious\" action movie. Among the parade of visiting celebrities and top officials, the Rolling Stones also played a concert here last month after a visit by US President Barack Obama. Obama and Castro's December 2014 announcement of a rapprochement between their two countries has kindled new interest in Cuba, long isolated by a US embargo and its status as one of the last bastions of communism. In announcing the show, Chanel said that \"the cultural richness and the opening up of Cuba to the world have turned it into a source of inspiration.\" The show took place on an open-air catwalk on the Paseo del Prado, a long seaside boulevard in a scruffy neighborhood that got a deep makeover for the occasion. The opulence inside the tightly guarded venue stood in stark contrast with the poverty of the ordinary Cubans dressed in shorts and T-shirts peering in. The half-hour show ended with a brief appearance by Lagerfeld, dressed in his trademark gloves and a sequin jacket, who received a burst of applause and conga drums. \"Too nostalgic' The show was not entirely to local designer Idania del Rio's liking, however.\" It was very interesting and maybe too nostalgic. A lot of Cuban cigars, colors and hats from another era. It represented a Cuba that doesn't interest me right now, because today's Cuba is another, more contemporary Cuba, \"said the 33-year-old entrepreneur. For years, the communist principles that ruled in Cuba after revolutionary Fidel Castro won power in 1959 insisted on equality, even in clothing. Foreign brands were not available until the 1990s, when the market started to open up gradually. Cuba entered a crisis after the Soviet Union, which had financially supported its communist government, fell in 1991. Cubans had to wear imported second-hand clothes from state-run stores. Authorities called it\" recycled clothing \"but ordinary Cubans referred to their trips to the official shops as\" rag-shopping. \"With its cabarets and casinos frequented by US film stars and gangsters, pre-revolutionary Cuba had a thriving fashion scene. The end of the Soviet era encouraged a rebirth. The future of fashion will depend on if and when US lawmakers end the 54-year-old embargo--still in place despite the diplomatic thaw.\" When we become a normal country, without the embargo, we will be leaders of fashion, \"said Cuba's best-known living designer, Raul Castillo."}, {"articleID": "2016080814_00169028_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Phil Smith": ["Q16018910", "Q21598350", "Q7182421"], "Robert Murray": ["Q16149751", "Q16193097", "Q43910843", "Q7347885", "Q7347887", "Q7347888", "Q7347889", "Q7350719"]}, "date": "2016-08-08", "url": "http://www.environmentalleader.com/2016/08/08/workplace-safety-laws-take-centerstage-in-presidential-race/", "content": "Feature Workplace safety rules in the coal mining sector are coming up for air and are taking centerstage in the presidential race. The issue comes on the heels of the conviction and the imprisonment of a former coal mining boss accused of violating those laws. And it comes in the midst of major coal mining job losses, which is the culmination of a fierce competition for cleaner fuels, tougher federal regulations and thinning coal seams. At the epicenter of the discussion is the federal prosecution of Don Blankenship, who had been the chief executive of Massey Energy and who was sentenced in April to a year in prison--all tied to an underground mine explosion that killed 29 people in April 2010. Former Secretary of State Hillary is weighing in, saying that the penalty does not fit the crime and that she would work with Congress to update workplace safety laws that would enhance compliance. \"After 29 miners died at the Upper Big Branch Mine, our worst mining disaster in 40 years, prosecutors charged and convicted (Blankenship) for conspiracy to violate the Mine Safety and Health Act,\" Clinton writes, in her. \"Blankenship received only one year in jail, however, because violations of the (act) are only misdemeanor charges.\" position paperThe overarching premise of Clinton's view is that while environmental and workplace safety violations can happen in any town across America, they are more likely to occur in the poorest areas least able to defend themselves. The concerns are especially acute in southern West Virginia, which has been heavily dependent on coal and the wealth that it has created. Now, though, the region is ravaged with, leaving citizens there desperate for any economic opportunity. poverty and drugsWithout question, everyone abhors the deaths of 29 in an underground explosion. But Blankenship and his defense team have maintained that the tragedy was an accident caused by natural circumstances, not by a willful attempt to sidestep safety laws. Just the opposite, they add: he had written several memos stressing the need for better compliance. The Republican nominee <mark>Donald Trump</mark> has said that the coal industry is suffering because of the undue burdens put upon it by by federal regulations that unfairly clamp down on carbon releases, among other emissions regulated under the Clean Air Act of 1990. His advocates have said that those rules single out coal because the only technology that would make coal acceptable under those conditions is carbon capture and burial--and it is not yet commercialized or cost effective. \"I have friends that own the mines. I mean, they can't live, they can't eat,\" said <mark>Trump</mark>, as reported by E & E. \"The restrictions, environmentally, are so unbelievable, where inspectors come two and three times a day, and they can't afford it any longer...We make these environmental deals where we have to adhere here immediately and China doesn't kick in for 25 years. Great. Great negotiating, fellas.\" But the mine workers, which are certainly on the side of the coal companies when it comes to environmental laws, say that <mark>Trump</mark> is conflating the federal environmental rules cover carbon with the work place safety laws that protect miners from serious accidents. The two are mutually exclusive, they say. Whose side is Mr. <mark>Trump</mark> on? \"The notion of reducing mine inspections because coal operators are going hungry is preposterous,\" said <mark>Phil Smith</mark>, spokesman for the United Mine Workers of America, in a story by SNL Energy. \"It demonstrates a complete lack of understanding of the difference decades of progress in mine health and safety has made for miners. The most precious thing to come out of a coal mine every day isn't the coal, it's the coal miner. Reducing safety inspections puts miners at greater risk, plain and simple.\" In an earlier talk with this writer, <mark>Murray</mark> Energy Chief Executive <mark>Robert Murray</mark> said he remains especially critical of the Obama administration, which he says is responsible for the bankruptcies of dozens of coal companies and thousands of coal mining job losses. He refers to global warming as \"global goofiness.\" He has also labeled the prosecution of Don Blankenship as \"political,\" saying that if authorities spend enough time and money pursuing any business leader, they could find something. \"No question: The Blankenship case has hurt the coal industry,\" he says. \"But this case does not represent the coal industry or how it does business.\" The families of the fallen miners don't think the prosecution of the former coal mining boss was political. They say it has been necessary, although they are generally displeased with the ultimate misdemeanor verdict and the one-year prison sentence. They told this reporter after the Blankenship sentencing in April of this year that Congress needs to stiffen the penalties for workplace safety crimes; Blankenship reported a month later, in May. But measures to achieve such standards have long languished on Capitol Hill. For their part, business leaders don't want to wind up in jail for workplace safety violations that they had either tried to address or could not have foreseen. Workers, though, want reasonable assurances that corporate leaders have taken all steps to ensure that they are able to return safely to their families. On this one, Mrs. Clinton would be appear to be the conspicuous choice among mine workers, favoring revised work place laws and criticizing Mr. Blankenship's treatment of workers. But odds are she won't get their votes, as the men and women in the coal communities have related to Mr. <mark>Trump</mark> and have vowed their support to him. As to whether he would buck business and push for more aggressive work place safety laws, though, remains unknown."}, {"articleID": "2019041216_00272058_W", "names": {"Sergio Ramos": ["Q483309", "Q514286"]}, "date": "2019-04-12", "url": "http://www.gazette-news.co.uk/sport/national/17570975.ramos-sidelined-by-calf-injury/", "content": "<mark>Ramos</mark> sidelined by calf injury By Press Association 2019 <mark>Sergio Ramos</mark> has a calf injury 0 comment Real Madrid captain <mark>Sergio Ramos</mark> could face a spell on the sidelines after the club announced he has sustained a calf injury. The capital club revealed on Friday that <mark>Ramos</mark> has been diagnosed with a left soleus injury. <mark>Sergio Ramos</mark> medical report. #RealMadrid https: //t.co/17mX7inDb7--Real Madrid C.F.???????? (@ realmadriden) April 12, 2019 A statement on the club's official website read: \"After the tests carried out on our player <mark>Sergio Ramos</mark> by the Real Madrid medical services, he has been diagnosed with a grade I injury in the left soleus.\" The player's situation will continue to be monitored. \"0 comment"}, {"articleID": "2009040223_00028584_W", "names": {"Brad Pitt": ["Q35332", "Q373912"], "Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "John Mayer": ["Q1699730", "Q21039156", "Q215215"], "Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2009-04-02", "url": "http://news.com.au/couriermail/confidential/showbuzz/0,24975,5012101-5038257-3,00.html", "content": "<mark>brad pitt</mark> <mark>brad pitt</mark> has reportedly demanded angelina jolie marry him. the actor - who has been with angelina since 2005 and raises six children with her - is said to have told twice-divorced angelina he will not have any more children with her unless she agrees to tie the knot. a source told america's ok! magazine: \"<mark>brad</mark>'s told her,\" marry me, or it's over .' he definitely wants to get married before they have any more babies. \"madonna + more...madonna's three-year-old adopted son, david banda, asked\" who are you? \"when reunited with his father. kate moss, lily allen kate moss and lily allen get into an all-night drinking contest after lily's london concert. see who won. anna faris, bono anna faris, jamie lynn spears and paris hilton are the wedding belles of the moment, as bono fears u2 will split up. <mark>chris martin</mark> + more...<mark>chris martin</mark> has likened his band, coldplay, to vegemite, while <mark>michael jackson</mark> has requested an elephant for his tour <mark>michael jackson</mark>, madonna <mark>michael jackson</mark> offers a treat for harry potter stars, while madonna's\" corrupt \"ways might jeapordise her adoption plans. ashton kutcher, <mark>john mayer</mark> ashton kutcher has posted a picture of wife demi moore's bottom on twitter. lindsay lohan, demi moore lindsay lohan admits her movie career is probably over and would like to become a model. rihanna, ed westwick rihanna\" fears \"an alleged sex tape will ruin her, while ed westwick may\" have sex in public \"to prove he isn't gay. <mark>chris brown</mark>, mischa barton <mark>chris brown</mark> and rihanna have reportedly split, while mischa barton needs to gain weight. watch this video now! protesters clash violently with police as the g20 gets underway in london."}, {"articleID": "2019122910_00095429_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"]}, "date": "2019-12-29", "url": "http://www.harpersbazaar.co.uk/uk/celebrities/news/a30352798/katie-holmes-suri-cruise-photo/", "content": "A post shared by <mark>Katie Holmes</mark> (@ katieholmes212) on Dec 25, 2019 at 7:34 am PST <mark>Holmes</mark> previously revealed to, \"My child is the most important person to me, and her upbringing is paramount to my work right now. It's very important that I'm present and she has a stable, innocent childhood.\" She continued, \"I feel so blessed to do what I do, but there's nothing in the world better than watching your child succeed.\" Town & Country The Dawson's Creek star was recently praised for posting unretouched photos which showed her stretch marks. Posing in a brazer and bra, <mark>Holmes</mark> revealed her midriff, and didn't Photoshop any of her images, which fans found incredibly refreshing. She captioned the pics, \"it is wonderful to be working today with such amazing women!\" "}, {"articleID": "2010011709_00073451_W", "names": {"Brad Pitt": ["Q35332", "Q373912"]}, "date": "2010-01-17", "url": "http://app.com/article/20100116/ENT/100116041/1031/ENT&source=rss", "content": "your browser's security settings are preventing some features from appearing. los angeles - sandra bullock said friday she donated $1 million toward haitian earthquake relief, and madonna announced she gave $250,000 toward the effort as celebrity aid continued to pour into the devestated country. bullock's contribution went to doctors without borders' emergency operations in port-au-prince, where three of the organization's existing facilities were damaged by the magnitude 7.0 quake. \"i wanted to ensure that my donation would be used immediately to meet the needs of the haitian people affected by this catastrophic event,\" said bullock in a statement. madonna's gift was to partners in health, a longtime medical provider in haiti. \"i urge all of my friends and fans around the world to join me collectively to match my contribution or give in any way you can,\" she said. \"we must act now.\" earlier friday, not on our watch, an advocacy and grantmaking group founded by george clooney, <mark>brad pitt</mark> and others, donated $1 million to partners in health. you must fill out the comment body in order to submit a comment. the comment you have entered is too long. please limit your post to {maxchars} characters or less. rss feeds for the latest jersey shore news, sports, business and more. use of this site signifies your agreement to the"}, {"articleID": "2019053014_00306381_W", "names": {"Kevin Taylor": ["Q52908963", "Q57412238", "Q6397603", "Q6397604", "Q6397605", "Q6397606"]}, "date": "2019-05-30", "url": "http://modernghana.com/news/935810/friday-editorial-presenter-kevin-taylor-threatens-ghana-with.html", "content": "30.05.2019 Feature Article Friday Editorial Presenter <mark>Kevin Taylor</mark> Threatens Ghana with Rainof Brimstone & Fire Over the EC Boss Jean Mensah Come Election 2020 By Rockson Adofo 2 HOURS AGO FEATURE ARTICLE Friday Editorial Presenter <mark>Kevin Taylor</mark> In a recent video posting by the presenter of Friday Editorial, a likely social media platform, one could see <mark>Kevin</mark> Ekow-Baidoo <mark>Taylor</mark>, raving and ranting in condemnation and bastardization of the Chair of the Ghana Electoral Commission, Mrs Jean Mensah. I wish I could find the Web, YouTube or Facebook link of this said video which was forwarded to me on my WhatsApp page, to attach to this publication for the scrutiny of the Ghana and worldwide general public. From the video postings by, and postures of, this self-styled social critic, who indeed is excessively biased and fanatically partisan in his submissions, he could clearly be seen to incite through indoctrination, the Ghanaian public to uprise against His Excellency Nana Addo Dankwa Akufo-Addo and his NPP government in the event of NDC of which he is affiliated, failing to regain power in December 2020. He is using his spurious condemnations of the persons of Mrs Jean Mensah and Mr Boosman Asare, the Chair of the Electoral Commission and Deputy Electoral Commissioner respectively, to propagate his malicious agenda of goading people to revolt in case NDC failed to come to power in December 2020 after the general election. He always wants to play smart in his video presentations by first defining or telling the public, his listeners or public viewers, the normal functions of, and the expectations of the public from the persons and institutions he attacks. He then cunningly proceeds to unveil his real intentions through insults on, and spewing lies about, the personalities he wants to pull down to advance the cause of the NDC party of which he is inextricably fanatically affiliated. I am going to outsmart him, belittle him and prove him a nonstarter in the propaganda he has embarked on in the hope of persuading Ghanaians to vote for the NDC come Election 2020 or else, they will witness deadly uprising in the country. I am going to refer to some of the unfounded allegations he made against Mrs Jean Mensah, Messrs Bossman Asare, Mac Manu and Joseph Anokye, to prove not only his malignity towards these individuals but also, how ignorant of the laws in place he is about, and how by his apparent stupidity he can be lawfully sued for defamation of character if his victims so desire. He questions why the NPP Government fired Mrs Charlotte Keeson Osei, the former Chair of the Electoral Commission? If <mark>Kevin</mark> has not outgrown his intelligence and does possess an iota of wisdom, he could realise that Charlotte Osei self-incriminated herself when rebutting the criminal committals alleged against her by her three deputies. She went her own way to award contracts and at costs of her choice to people without going through the Electoral Commission's laid down procurement procedures. A contract the procurement panel agreed to award for US $7 million was later discovered to have single-handedly been awarded at the inflated cost of US $14 million by Charlotte Osei. Did she not renovate her office at a whopping sum of hundreds of thousands of Ghana Cedis without approval and the knowledge of the EC Procurement Board? Did she not say in her defence that her Deputy of Operations, Mr Amadu Sule, was accepting huge sums of money from some political parties and was transferring illegal votes at the Electoral Commission? What did she do about such illegalities being committed by her deputy when she discovered them? Nothing! What an incompetent leader and a colluding criminal she was by this simple inaction by her. The above assertions by Charlotte Osei and her deputies clearly constitute criminal offences the committal of which in the Civilized Western Whiteman's land, would have them by now languishing behind prison bars. Therefore, for <mark>Kevin</mark> to naively assert that the NPP got rid of Charlotte Osei because she posed a threat to them in Election 2020 proves the extent of the folly, silly partisanship and unpatriotic <mark>Kevin Taylor</mark> is. He claims some people are interfering with the independence of the Electoral Commission but unfortunately, he had not the solid balls to name who they are but just making wild allegations meant to throw dust into people's eyes. He went on further to question how credible is the Ghana Electoral system with Mrs Jane Mensah as its head? He questions the posture and the integrity of Jane Mensah and Bossman Asare and accused them of acting like NPP foot soldiers. He goes on to say there will be war in Ghana if the Chair of the Electoral Commission did not re-invent herself to gain the confidence of the people before the 2020 general election. He asserts on authority that what happened in Ayawaso by-election is only the tip of the iceberg, or will pale to nothing compared to what will happen in 2020 if the Electoral Commission do not change their posture? What posture and how does he expect them to act differently? Why is he allowed to beat the war drums the way he does with impunity? He has intent to plunge Ghana into war and has audaciously been declaring them in his videos through fabrications and public incitements. As said in my previous publication, Ghanaians are not proactive but reactive. We are waiting for the harm to be caused before we react in search of solutions by which time it may be too late. He gleefully seriously tags Jane Mensah as a slave queen appointed to head the Electoral Commission. How and why is she a slave queen and who are her slaves? He continues to assert without the least shame that Jean Mensah cannot part with her party colours? What political party does she belong to and where are the proofs to confirm such reckless accusations levelled against her by the hallucinating <mark>Kevin Taylor</mark> so imbued with NDC madness? Does this guy, <mark>Kevin Taylor</mark>, a one-eyed man in the land of the blind hence becoming the King, know that he can be sued for assassination of character by the woman if it were not that Ghana is a nation where sadly, laws are not enforced, and laws do not work satisfactorily as I have asserted in some of my recent publications? Again, as childish as he is although in his mind's eye, he is the most intelligent and wisest man in Ghana, he questions why Jane Mensah has unilaterally appointed an Information Technology (IT) Director to head the IT Department of the Electoral Commission. Why should Jane Mensah and her selected people want to have the PASSWORD to the Electoral Commission Systems, something Dr Kwadwo Afari Gyan, [the man who at the Supreme Court could not define \"Over Vote\" and \"No Verification No Vote (NVNV)--my emphasis, clearly eating back his sputum], and Charlotte Osei, did never ask for? He claims, she asking for the password means she wants to control what goes in and comes out of the systems. No wonder <mark>Kevin Taylor</mark>, although has embarked on what Ghanaians have lately coined as\" Pull Him Down \"malicious agenda, he is so little-minded and markedly incompetent going about it. He cites,\" Microsoft has administrator's password to their software, etc. so why does she want to hand over the EC Information infrastructure password to only one person by collecting it from the Israeli company, Super Tech Ltd (STL) that has been handling the biometric database of the voters' register for several years or since its inception? This explains it all, the utter ignorance and the stupidity of a Ghanaian who claims to know it all but in fact knows absolutely nothing. Let me help give him some tutorials here as I have many friends who work in the IT Departments in various capacities as IT analysts hence I have insights into some of their jobs. When the manufacturer supplies you with a software, you are given a password to access it. Within your firm, you appoint certain persons, especially the heads or the managers of the various departments within the firm that may need to use the software to carry out their duties, as the administrators. They will be assigned different passwords as the administrator for that department. Then, they will also create passwords for the various individuals who will within the chain downwards be using the software. Once the individual is granted access to the software for the first time using the password created for him/her by the firm's IT Department, the person is always advised to set up their own password after first accessing the software using the one created for them by the IT Department. The Manager or the Head of each department appointed as the administrator will then permit you access to certain documents at their own volition according to your job requirements. With this little said, it should not be the manufacturer or the supplier of your IT equipment that must be the sole handler of the password to your systems. No, no, and no! The manufacturer can only remotely access your system with your permission and with you logging on your password which is unknown to them. This even only comes in for major repairs where it is only the manufacturer that can help. Does <mark>Kevin</mark> now know who we call administrators and how one becomes an administrator of a firm's IT Infrastructure? If we had not been stupid all this while, why should we as a buyer of IT Equipment and software not be able to access them but done by a foreigner? Is it not like having nuclear weapons installed in your country and permitting the foreign manufacturer and installer to continue to keep the password to the weapons usage instead of the President or the Prime Minister of the Nation or a nominated body in the country? Will the nation's safety not be in the hands of the foreign manufacturer or installer holding the password to the nuclear weapons in which case the purpose of having the weapons could be compromised? Why should an outsider hold on to such a sensitive password without which and whom the buyer nation cannot use the equipment so purchased? With such ideas as postulated by <mark>Kevin Taylor</mark>, there is no wonder that Ghanaians are not progressing but overwhelmed with corruption, pandering to criminals, being denigrated by our white contemporaries and treated in some circles as subhuman. From my years of experience gained staying in Europe and working, I have never come across a firm that has its IT Equipment's password solely known to the foreign manufacturer doubling as the company contracted to manage them. It is only in Ghana. Am I wrong therefore to publish an article recently questioning if the black men, especially Ghanaians, are capable of managing their own affairs? From the nonsense being told by <mark>Kevin Taylor</mark>, the answer is a no! \"Ghanaian voters' biometric data completely controlled by foreigners--EC laments\" If you read the reasons as per the written and live video explanations by Jean Mensah as found below which I entreat the publishers to activate them for easy accessibility by the public readers, one will understand whether or not the Chair of the Electoral Commission is wrong in her actions taken. As I am conversant with how things work within the IT Department, I support the actions of Jean Mensah 100%. It is only selfish individuals who for what they stand to gain by their silly intentional throwing of dust into people's eyes that will side with the nonsensical views espoused by <mark>Kevin Taylor</mark>, a traitor. . https: //www.myjoyonline.com/politics/2019/May-21st/ghanaian-voters-biometric-data-completely-controlled-by-foreigners-ec-laments.php <mark>Kevin</mark> now questions why Mac Manu, the Campaign Manager of NPP in Election 2016 and Joseph Anokye, the IT Analyst assisting with the collation of polling stations results for NPP in Election 2016, were denied access to Kenya ahead of the Kenyan 2017 election when they had intended to go there to assist in some capacity of some sort? What proof has <mark>Kevin Taylor</mark> claiming that these two gentlemen had been denied access to Kenya because of the American Security raising the red flag of their involvement in hacking Ghana's electoral machines in 2016 election? He claims Mac Manu and Joseph Anokye were meddling in the Kenya's election. If his allegation is anything to go by, why did he not submit the evidence to the Kenyan authority for them to be arrested and arraigned? Finally, he claims Anokye hacked the Electoral Commission's computers to tilt the results in favour of the NPP. I have never come across a stupid person like <mark>Kevin Taylor</mark> and his ilk making wild allegations bordering on criminality yet, are without the balls to take the perpetrators to court. Do they know that it is a crime to hack any computer let alone, sensitive computers like those of the Electoral Commission? If they are very convinced and have the evidence that Anokye by virtue of being once an IT Analyst at NASA in America had hacked the computers of the EC, he must prefer criminal charges against him. As said by Asiedu Nketiah, \"Every fool can go to court\" He concludes by saying Anokye has been rewarded with the post of the Boss of the National Communications Authority (NCA) for successfully hacking the computers of the Electoral Commission to the advantage of the NPP. Why should he not sue Anokye if he has any evidence to substantiate his allegation? Does he know that Anokye has every right to, and can, sue him for character assassination for his stupid adventure of meandering in the wilderness with his treacherous Friday Editorials? CONCLUSION: There is a saying that \"When you spot a stump that has the likelihood to injure you, you do not sharpen it but uproot it\" . Therefore, those people and institutions that are on constant reckless attacks by <mark>Kevin Taylor</mark> had better take him to court to substantiate his allegations against them before it gets out of hand. The more you give him the leeway or unfettered freedom to tarnish your reputation, the harder it becomes for you to redeem your image later on. Rockson Adofo Rockson Adofo, © 2019 This author has authored 1764 publications on Modern Ghana. Author column: RocksonAdofo Disclaimer: \"The views/contents expressed in this article are the sole responsibility of the author (s) and do not neccessarily reflect those of Modern Ghana. Modern Ghana will not be responsible or liable for any inaccurate or incorrect statements contained in this article.\" Reproduction is authorised provided the author's permission is granted. View comments"}, {"articleID": "2014011401_00052910_W", "names": {"Matt Thomas": ["Q17511411", "Q22096360", "Q48720082", "Q55368011", "Q6789424", "Q6789425"]}, "date": "2014-01-13", "url": "http://www2.kusports.com/news/2014/jan/13/isu-star-kane-game-time-decision-against-kansas/", "content": "ISU star Kane a game-time decision against Kansas The availability of Iowa State men's basketball senior guard DeAndre Kane remains up in the air hours before the Cyclones play host to Kansas at Hilton Coliseum, in Ames, Iowa. ISU coach Fred Hoiberg said Monday morning during the Big 12 teleconference that Kane, who suffered a sprained left ankle in the final minute of the Cyclones' 87-82 loss at Oklahoma on Saturday, did not practice Sunday and will be re-evaluated today before the 8 p.m. game versus KU. \"I've been messaging with him this morning, and he'll be in soon for treatment to see where things stand,\" Hoiberg said before 11 a.m. Monday. \"Obviously, he wakes up sore, and that's to be expected. It's always gonna be a little bit worse in the morning, after sleeping on it. But we'll see.\" Hoiberg said Kane, who averages 16.5 points, 7.3 rebounds and 6.1 assists, will test the ankle at today's shoot-around. \"We'll see if he can run on it and, more importantly, see if he can cut on it,\" the coach said. \"But, again, we'll take a cautious approach with this one. We've got a lot of season left after tonight's game.\" Hoiberg, impressed with the Jayhawks' road win over Oklahoma and their home victory against Kansas State, said KU is playing as well as any team in the country right now. The Cyclones (14-1 overall, 2-1 Big 12), coming off their first loss of the season, will have to adjust against Kansas (11-4, 2-0) if Kane can't play. Hoiberg said Mont? Morris, a backup freshman guard, will have the ball in his hands if Kane is unavailable. \"He's done a really good job of taking care of the ball, making good, safe plays and initiating the offense for us,\" Hoiberg said of Morris, who averages 6.3 points and 2.9 assists. Additionally, Hoiberg said Iowa State's bigs will have to be play-makers if the Cyclones' best all-around player is in street clothes. \"We'll try to do the best job we can,\" Hoiberg said. Kansas coach Bill Self knows his team will have its hands full tonight against the Cyclones. \"They've been terrific,\" Self said on the teleconference. \"Fred has done an unbelievable job. Their defense is under 40 percent (39.3), I believe, overall field-goal percentage defense, they've played a nice schedule and they've had newcomers that have made such a huge difference.\" <mark>Matt Thomas</mark> has been solid for them, obviously, in a freshman role and produced pretty well. And then (Melvin) Ejim and (Georges) Niang have been better coming back and been terrific. But (DeAndre) Kane and (Dustin) Hogue have been awesome. You're looking at a guy (Kane) that arguably could be the front-runner for player of the year in the league with the type of performances so far, and a guy that's as good a rebounder from his spot as any kid in the country in Hogue, \"the 11th-year Kansas coach said of his team's opponents.\" And their bench shoots it, \"Self added.\" They've got a nice team. Fred does such a good job of giving them freedom offensively. They play with a free mind, and if I wasn't playing them I'd say they're definitely one of the more fun teams to watch play. \"While the Big 12 has its share of difficult road venues - Self acknowledged Oklahoma State and Kansas State in that category - Iowa State is at the top of that list, too, and Self said tonight's game at Hilton Coliseum (with 14,384 seats) figures to be as good an atmosphere as Kansas will play in on the road this season. The KU coach stressed that he wants the Jayhawks to enjoy the scene and he hopes it will foster a more intense focus and a tighter huddle.\" I'm excited to see how our guys react, \"Self said.\" It's never easy when you're on the road, and as good as the crowd's gonna be, it's their five guys that can all stretch it from the three-point line that concerns me more than the crowd. \"Video highlights from Late Night in the Phog October 5, 2013 Ben McLemore sends message to KU fans from NBA Draft June 27, 2013 Andrew Wiggins and Bill Self talk after camp scrimmage June 19, 2013 KU blue team summer scrimmage highlights: June 19 June 19, 2013 Press Conferences & Post-Game Interviews Bill Self on KU's 86-60 win over KSU and Monday's showdown with Iowa State Press Conferences & Post-Game Interviews Naadir Tharpe, Wayne Selden and Andrew Wiggins discuss the latest victory in the KU-K-State rivalry Press Conferences & Post-Game Interviews Bill Self talks K-State, a day before Sunflower Showdown"}, {"articleID": "2013071406_00026590_W", "names": {"Chris Houston": ["Q2964741", "Q5106926", "Q5106927"], "Chris Hope": ["Q30085120", "Q5106913", "Q5106914"], "Bill Bentley": ["Q3716821", "Q4908108", "Q4908111"]}, "date": "2013-07-06", "url": "http://www.miamiherald.com/2013/07/06/3487517/safety-quin-all-business-and-the.html", "content": "DETROIT--New players. New team. New questions. It's always of concern to coaches how new players fit in with their new surroundings. If Lions defensive coordinator Gunther Cunningham had any questions about free-agent safety Glover Quin, one word told him all he needed to know. \"He is something,\" Cunningham said. \"We had a meeting the other day and I turned to (vice president of pro personnel) Sheldon White and I said,\" Quin .' He goes, \"Professional .' I said,\" That's the best description I've ever heard .' That's him. All about business every day. \"Quin already has shown some of his chops on the field and off it. He mixed in well with the starters during minicamp and he has been trying to encourage younger players in the secondary.\" I think we're shaping up pretty well, \"Quin said.\" We've got a good group of veterans. Me and <mark>Chris Houston</mark> and Ron Bartell and Louis Delmas, and we just signed <mark>Chris Hope</mark>. So we've got a great group of veteran guys. We've got a great group of young guys like <mark>Bill Bentley</mark> and Chris Greenwood and Jonte Green, and we just drafted Darius Slay. \"And then Quin has flashed a little of that professionalism. As a four-year veteran, he understands the practical realities that affect an NFL team's success. While most eyes will be trained on the starters, it could be the younger players on the back end of the roster who determine the secondary's success.\" So I think when guys miss, we always look at it is as next man up, \"he said.\" It's a great opportunity to get that experience, to get that depth. \"As you know, depth wins in this league because a lot of things happen over the course of 16 weeks. Guys go down. All types of stuff happens. So you've got to have guys that are able to come in and fill that role.\" "}]