[{"articleID": "2016082323_00049226_W", "names": {"Lawrence Wright": ["Q18706520", "Q353893", "Q6504763", "Q6504767"], "John O'Neill": ["Q16122131", "Q2628718", "Q53536543", "Q54771468", "Q6250976", "Q6250980", "Q6250982", "Q6250984", "Q6250987", "Q6250991", "Q6250993", "Q6250995", "Q6251003"]}, "date": "2016-08-23", "url": "http://wdiy.org/post/terror-years-traces-rise-al-qaida-and-isis", "content": "\"The Terror Years' Traces The Rise Of Al-Qaida And ISIS By NPR Staff • 4 minutes ago Share Twitter Facebook Google + Email Listen Listening.../ Author <mark>Lawrence Wright</mark> was a conscientious objector during the Vietnam War, which meant he was required to do two years of what was called\" alternative service. \"He ended up in Egypt, teaching at the American University in Cairo. And it was there that the man from Texas started his obsession with the Middle East. Since then, <mark>Wright</mark> has written a lot about the region and about terrorism as a staff writer for The New Yorker. Now, he has compiled his many New Yorker essays into a new book called The Terror Years: From al-Qaeda to the Islamic State. But his interest in terrorism stretches back to well before his New Yorker job...back to a screenwriting gig in the 1990s. He tells NPR's Kelly McEvers that the 1998 film The Siege asked\" what would happen if terrorism came here? As it already had in, say, London and Paris, you know, how would we react if it happened in New York? \"Interview Highlights On people's reactions to The Siege after the Sept. 11 attacks It was the most rented movie in America after 9/11...I think there were two things--one was, it explained and looked at the problem of terrorism. But the other thing is, the movie has a happy ending, and after 9/11, people weren't sure how this movie was going to end. On his piece about <mark>John O'Neill</mark>,\" The Counter-Terrorist \"If you recall, the planes were all grounded [after the attacks], and I lived in Austin, so I was unable to get to New York for several days, and I was desperate to get involved in this. I didn't know how to reduce this vast tragedy to a human scale. So I was combing through obituaries streaming online, and on this Washington Post site, I found <mark>O'Neill</mark>'s obituary. And it made him out to be something of a disgrace. He had been the head of counterterrorism in New York, and he'd been washed out of the [FBI] because he'd taken classified information out of the office. And then he wound up getting a job as head of security at the World Trade Center. You know, his job was to get Osama bin Laden, and instead bin Laden got him. And I thought at the time it was ironic. But I don't see it that way anymore. He took that job because he knew that al-Qaida would come and try to finish the job on the World Trade Center--they had bombed it once before in 1993--so he instinctively put himself at ground zero...it was <mark>O'Neill</mark> and a handful of people that really realized the peril that America was in. On the Americans held captive and killed by the Islamic State, and what might have been done differently I'm not saying that they might have been able to survive. Unless the American government had taken the same policy as the Europeans, which was simply to pay off the kidnappers. But the American government opposes that, and also at the time opposed any Americans, even the parents of these individuals, paying to ransom their child. So essentially, the parents were left by themselves. They had no idea how to deal with ISIS, and they got very little help from the State Department or the FBI...there was rarely any moment when the FBI or the State Department shared information or offered to help in any meaningful way. On the relevance of al-Qaida in the age of ISIS Well, al-Qaida is the parent, with all the progeny that has multiplied all over the world. If you call it al-Qaida or bin Ladenism or jihadism, whatever you call it, it's proliferated. So yes, the mother organization has been reduced--it's not extinct, but it has certainly been confined. But the idea that they have put forward is alive in the world and spreading rapidly, unfortunately. On how we've changed in America Well, I was reflecting about how, when I was in high school, I took a date to Love Field in Dallas. That was actually the name of the airport, but it was where a lot of dates went when you didn't have any money. And I remember that we climbed into this airliner that had just come from some European place--we decided it must have been Paris--and we sat in the first class compartment, and the stewardesses, as you called them then, brought us a snack, and we pretended we were really cosmopolitan. And then we went up in the FAA tower,\" Come on in, kids! \"So we sat down and watched these airplanes land. And that was America. And I'm so struck, just going into an office building where you have to be photographed. In Philadelphia, you go visit the Liberty Bell and you have to take off your shoes and your belt. These impingements on ordinary liberty--the kinds of things we took entirely for granted, those are gone. But if they're forgotten they'll be permanently gone. And I think that it's important that we keep in our minds the idea of that kind of freedom, and if we lose that, then I think terrorism really will have won. Copyright 2016 NPR. To see more, visit http: //www.npr.org/. Related Program: All Things Considered View the discussion thread."}, {"articleID": "2017020615_00165952_W", "names": {"Luis Enrique": ["Q222789", "Q322350"]}, "date": "2017-02-06", "url": "http://www.aol.co.uk/living/2017/02/06/messi-alba-and-umtiti-backed-by-luis-enrique-over-ban-threat/", "content": "Messi, Alba and Umtiti backed by <mark>Luis Enrique</mark> over ban threat By Omnisport Feb 6th 2017 02:46 PM - <mark>Luis Enrique</mark> says Barcelona trio Lionel Messi, Jordi Alba and Samuel Umtiti will play as normal against Atletico Madrid despite being one booking away from missing a potential Copa del Rey final. Three yellow cards over the course of the competition results in a one-game ban, leaving the three players - who all have two to their name - in a precarious situation ahead of the second leg of the semi-final with Atletico on Tuesday. Barca lead the last-four tie 2-1 on aggregate, but are already without Neymar for the match at Camp Nou, who received his third yellow card of the tournament in the first leg. <mark>Luis Enrique</mark>, though, will play Messi, Alba and Umtiti without fear of them receiving a costly ban and does not expect the tense situation to affect their play. \"No [it will not affect our approach to the game] because fortunately these players are very good at knowing the situation,\" the head coach said at his pre-match media conference. \"I don't think it is going to affect how these players play in the game. The most important thing is to beat Atletico Madrid and get into the final .\" After that we will see what has happened, but I don't think it is going to play a role. \"There is nothing I can do to change Neymar being out - so [being frustrated] would be a waste of energy .\" I have fewer options at that position than midfield, although I do have some interesting players I can put there on the wing. \"But we are going to make the other coach [Diego Simeone] think about it and not give away who we are going to play there .\" <mark>Luis Enrique</mark>: My players are experts in big games https: //t.co/WLCx4KWp2I #CopaFCB #ForçaBarça pic.twitter.com/F21IO0LVmN"}, {"articleID": "2014082122_00049562_W", "names": {"Jay Hunt": ["Q15990063", "Q6166730"]}, "date": "2014-08-21", "url": "http://radiotimes.com/news/2014-08-21/jeremy-paxman-in-talks-with-channel-4-but-he-wont-be-taking-jon-snows-job", "content": "Jeremy Paxman in talks with Channel 4...but he won't be taking Jon Snow's job Could Paxo be plotting a new lease of life on another channel? By Ben Dowell Thursday 21 August 2014 at 03:25 PM For a quarter of a century he was a pillar of the BBC presenting establishment as the host of Newsnight. And even after he announced he was quitting BBC2's current affairs flagship this year, the Corporation is believed to have remained keen to retain his services in as many capacities as possible. But now it has emerged that Jeremy Paxman is in talks with Channel 4 about making shows for the rival broadcaster. Asked at the Edinburgh International Television Festival if she has held talks with the presenter, C4's Chief creative officer <mark>Jay Hunt</mark> said: \"I have known Jeremy for years and worked with him on Newsnight [at the BBC]. [C4 News presenter] Jon Snow should not be worried in any way. But am I in talks? Yes, of course .\" <mark>Hunt</mark> would not elaborate on what she is talking to the veteran presenter about, but it appears the erstwhile grand inquisitor of BBC2 is looking to spread his creative wings further than just 3:30 pm The Hairy Bikers: Everyday Gourmets 4:30 pm Put Your Money Where Your Mouth Is Subscribe to RT Try the magazine of the year, RadioTimes, with 12 issues for just £ 1. Shaun the Sheep Win: Be an extra in Shaun the Sheep The Movie next year. © Immediate Media Company Limited Website is owned and published by Immediate Media Company Limited."}, {"articleID": "2019082211_00247636_W", "names": {"Gary Griffin": ["Q16148752", "Q17305979", "Q5525176"]}, "date": "2019-08-22", "url": "https://jewishnews.timesofisrael.com/liveblog_entry/over-half-of-hasmonean-gcse-grades-were-9-to-7/", "content": "home page Pupil during an exam Photo credit: Chris Radburn/PA Wire 12:46 pm Over half of Hasmonean GCSE grades were 9 to 7 Hasmonean High School has been celebrating top results, where more than half of all GCSE grades were A * / A/9 -7 (53 percent this year). Over 90 percent of grades were in the A * - C/9 -4 category. Katherine Brice, head of Hasmonean Girls' school, said: \"These impressive results are the product of hard work by the girls who have maintained their commitment to Jewish Studies alongside their secular subjects .\" We are very proud of our students' achievements and are delighted that so many of them have exceeded their target grades. We are delighted to congratulate each one of them on their personal achievements, and are grateful to our dedicated and talented staff who have guided and supported them academically and pastorally. Debbie Lebrett, head of Hasmonean Boys' School and acting head of Hasmonean Girls' school, said: \"Hasmonean students have continued to find success in their secular studies whilst maintaining a focus on both Jewish Leaning and leadership opportunities .\" We are particularly proud of our students' achievements given that they have sat very challenging GCSE examinations. We are delighted to congratulate each one of them on their personal achievements, and are grateful to our dedicated and talented staff who have guided and supported them academically and pastorally. 11:40 am Beaming JCoSS pupils get top scores JCoSS pupil Emma Wilkins with her family. She was awarded all 9s Tom Mosseri received 9 grade 9s and A * From L to R, Aran Haber, Tom Mosseri, Lucy Ritter, Ben Brent, Emma Wilkins, all received at least 9 × 9 11:37 am Record-breaking results for JCoSS! JCoSS announced record-breaking results this year, with half of results at grade 7 (A) or higher. Another 18 percent of grades were at 9, compared with the 3 percent national average. Meanwhile, 32 percent of results were grades 8 or 9, and seven students achieved at least 9 grade 9s, of whom three scored 10. A third of students achieved at least 8 GCSEs at grade 7 or higher. 83.2 percent of results were graded at grade 5 and above, which is a strong pass--marking an increase since last year. 93 percent of results were at grades 9 to 4. Over 30 percent of grades in Jewish education, biology, physics, chemistry and history were at 9. Headteacher Patrick Moriarty said: \"We are delighted by the outstanding GCSE results that our students have achieved, which surpass our already strong track record .\" Their hard work and resilience, married to the expertise and care of their teachers, have enabled them to meet the increased challenges of new specifications with flair. I am exceptionally proud of students and colleagues alike. \"11:11 am JFS\" celebrates the success of all students \"92 percent of students at JFS achieved five or more standard GCSE passes including English and Maths. Of these, 80 percent were grade 5 or above, with nearly half (46 percent) of students achieving achieving 9 to 7 grades. Another 28 percent of grades were at 8 or 9 (A *). Headteacher Rachel Fink said:\" Today's outstanding results are the culmination of the collective hard work or our students and staff together with support from home. I am deeply proud of all our students who have shown such commitment to their studies as a step towards their future goals. \"In keeping with our drive to promote positive well-being we have chosen not to name individual students for praise. We have many students who have attained a clean sweep of top grades, many who have made remarkable progress in terms of their value added grades and others who have succeeded despite personal challenges that impacted on them over the past two years .\" 10:30 am Yavneh College pupils with their GCSE results Yavneh College celebrate GCSE results! 10:13 am Kantor King Solomon High School celebrates \"fantastic set of GCSE results\" Kantor King Solomon has achieved over 87 percent of students gaining English and over 75 percent achieving Maths. According to the school, Jewish Studies continues to be a strength, with 82 percent of students achieving grades 4-9 and over 35 percent achieving grades 7-9 in GCSE Religious Studies. Head Hannele Reece said: \"I am so proud and delighted for the entire school, that we have maintained our amazing success at GCSE. The staff, students, parents, Governors and the entire community have committed to the success of our school .\" These results are testament to the focus, determination, skill and tenacity of our teaching staff and our students. It has been a difficult year for many of our year 11 students and I am tremendously proud of the whole year group. \"Kantor King Solomon continues to move from strength to strength, I am so proud of all our staff and students and all their hard work .\" 10:07 am \"Another great set of GCSE results at Yavneh College\" , head says 90 percent of GCSE students at Yavneh College achieved 5 + standard passes including English and maths. 44 percent of students achieved 9 to 7 grades, while another 79 percent were awarded 9 to 5 grades, with 26 percent of grades at 8 or 9 (A *). Executive Headteacher Spencer Lewis said: \"I am delighted to announce another fantastic set of GCSE results. Yavneh College pupils have worked very hard and should be really proud of what they have achieved again this year. Together with last week's exceptional A Level results that placed Yavneh College as the best performing non selective state school in the UK at A Level, this is a testament to the hard work and dedication of the pupils and of the incredible team of staff at our school .\" In addition to these excellent GCSE results, we are extremely proud of those pupils who have taken vocational courses in Business Studies, PE and Digital Media and who have done incredibly well. \"9:37 am\" Outstanding GCSE results achieved at Immanuel! \"Nearly half (49 percent) of all grades at Immanuel College were awarded at 9, 8 or A * with 29% being the highest grade possible (9 or A * equivalent). 70 percent of all grades were awarded at 9--7 or A *--A, with 97% at 9--4 or A *--C. Gideon Futerman, Raquel Menashe and Sarah Root achieved a clean sweep of grade 9 and A * results in all their subjects. Immanuel headmaster <mark>Gary Griffin</mark> said:\" We would like to offer our congratulations to all our Year 11 students on receiving such an excellent set of results--which continue to break College records! \"We are so proud of everyone's accomplishments, which are the culmination of hard work and dedication by students and teachers alike. We look forward to welcoming students back to embark on their A Level courses in September .\" 9:36 am Welcome to GCSE Results Day 2019! Welcome to the Jewish News' live feed for GCSE results 2019! Send us your results and pictures, your thoughts and comments about the day! Email us at: Editorial @ thejngroup.com! Good luck! read more: News live blog Facebook Twitter email Print 3 shares Spotlight Communicated Content Masa Israel: A year to make a difference By Deborah Cicurel Photographer Jonny Baker: An eye for fashion! By Francine Wolfisz Cask your eyes on this! The Whisky Event returns Whisky business! The art of inspiring vulnerable children By Jewish News Reporter Are you getting the Holocaust compensation you deserve? By Deborah Cicurel Lasting Power of Attorney Aviv Appeal By Brigit Grant Study in Israel, learn in English with Bar Ilan University By Deborah Cicurel Grab a slice of the ultimate living experience with Gindi TLV WIZO UK celebrates 100 years of changing lives and building futures An invitation to inspiration--It's the Big Event 2018! By Jewish News A small school with big dreams Enjoy Southern Africa with Mmilo Tours The perfect luxury getaway By Judy Elkus All hands to the pump! Whisky business! By Richard Cawthorne Cementing relationships! By Deborah Cicurel When life begins again By Judy Elkus Giving children a brighter tomorrow By Judy Elkus comments"}, {"articleID": "2019081023_00108898_W", "names": {"William Barr": ["Q16683338", "Q43123958", "Q43911234", "Q8005104"], "Cameron Lindsay": ["Q16731524", "Q5026294"], "Brad Edwards": ["Q4953908", "Q4953910"]}, "date": "2019-08-10", "url": "http://longisland.news12.com/story/40901860/us-attorney-epstein-abuse-probe-will-continue-after-his-death", "content": "US attorney: Epstein abuse probe will continue after his death Posted: By JIM MUSTIAN, MICHAEL R. SISAK and MICHAEL BALSAMOAssociated Press NEW YORK (AP) - The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against the well-connected financier remain steadfast, officials said. Epstein, accused of orchestrating a sex-trafficking ring and sexually abusing dozens of underage girls, had been taken off suicide watch before he killed himself in a New York jail, a person familiar with the matter said. Attorney General <mark>William Barr</mark>, in announcing the investigation, said he was \"appalled\" to learn of Epstein's death while in federal custody. \"Mr. Epstein's death raises serious questions that must be answered,\" <mark>Barr</mark> said in a statement. Epstein was found unresponsive in his cell Saturday morning at the Metropolitan Correctional Center, according to the Federal Bureau of Prisons. Fire officials received a call at 6:39 a.m. Saturday that Epstein was in cardiac arrest, and he was pronounced dead at New York Presbyterian-Lower Manhattan Hospital. Epstein, 66, had been denied bail and faced up to 45 years behind bars on federal sex trafficking and conspiracy charges unsealed last month. He had pleaded not guilty and was awaiting trial. The federal investigation into the allegations remains ongoing, said U.S. Attorney Geoffrey Berman, who noted in a statement Saturday that the indictment against Epstein includes a conspiracy charge, suggesting others could face charges in the case. Epstein had been placed on suicide watch and given daily psychiatric evaluations after an incident a little over two weeks ago in which Epstein was found with bruising on his neck, according to the person familiar with the matter who wasn't authorized to discuss it publicly. It hasn't been confirmed whether the injury was self-inflicted or the result of an assault. Epstein was taken off suicide watch at the end of July, the person said. The Bureau of Prisons confirmed that he had been housed in the jail's Special Housing Unit, a heavily secured part of the facility that separates high-profile inmates from the general population. Until recently, the same unit had been home to the Mexican drug lord Joaquin \"El Chapo\" Guzman, who is now serving a life sentence at the so-called Supermax prison in Colorado. Epstein's death raises questions about how the Bureau of Prisons ensures the welfare of such high-profile inmates. In October, Boston gangster James \"Whitey\" Bulger was killed in a federal prison in West Virginia where had just been transferred. Nebraska Sen. Ben Sasse, a Republican member of the Senate Judiciary Committee, wrote Saturday in a scathing letter to <mark>Barr</mark> that \"heads must roll\" after the incident. \"Every single person in the Justice Department - from your Main Justice headquarters staff all the way to the night-shift jailer - knew that this man was a suicide risk, and that his dark secrets couldn't be allowed to die with him,\" Sasse wrote. <mark>Cameron Lindsay</mark>, a former warden who ran three federal lockups, said the death represents \"an unfortunate and shocking failure, if proven to be a suicide .\" \"Unequivocally, he should have been on active suicide watch and therefore under direct and constant supervision,\" <mark>Lindsay</mark> said. Epstein's removal from suicide watch would have been approved by both the warden of the jail and the facility's chief psychologist, said Jack Donson, a former prison official who worked for the Bureau of Prisons for more than two decades. An attorney for Jeffrey Epstein, Marc Fernich, said in a statement that jailers at the Metropolitan Correctional Center failed to protect Epstein and to prevent the \"calamity\" of his death. Fernich also said that reporters, plaintiffs' lawyers and court officials \"should be ashamed of their behavior\" following Epstein's indictment last month. He said Epstein had \"long since paid his debt to society\" for his crimes. Epstein's arrest last month launched separate investigations into how authorities handled his case initially when similar charges were first brought against him in Florida more than a decade ago. U.S. Labor Secretary Alexander Acosta resigned last month after coming under fire for overseeing that deal when he was U.S. attorney in Miami. On Friday, more than 2,000 pages of documents were released related to a since-settled lawsuit against Epstein's ex-girlfriend by Virginia Giuffre, one of Epstein's accusers. The records contain graphic allegations against Epstein, as well as the transcript of a 2016 deposition of Epstein in which he repeatedly refused to answer questions to avoid incriminating himself. Sigrid McCawley, Giuffre's attorney, said Epstein's suicide less than 24 hours after the documents were unsealed \"is no coincidence .\" McCawley urged authorities to continue their investigation, focusing on Epstein associates who she said \"participated and facilitated Epstein's horrifying sex trafficking scheme .\" Other accusers and their lawyers reacted to the news with frustration that the financier won't have to face them in court. \"We have to live with the scars of his actions for the rest of our lives, while he will never face the consequences of the crimes he committed the pain and trauma he caused so many people,\" accuser Jennifer Araoz said in a statement. <mark>Brad Edwards</mark>, a Florida lawyer for nearly two dozen other accusers, said that \"this is not the ending anyone was looking for .\" \"The victims deserved to see Epstein held accountable, and he owed it to everyone he hurt to accept responsibility for all of the pain he caused,\" <mark>Edwards</mark> said in a statement. Epstein's arrest drew national attention, particularly focusing on a deal that allowed Epstein to plead guilty in 2008 to soliciting a minor for prostitution in Florida and avoid more serious federal charges. Federal prosecutors in New York reopened the probe after investigative reporting by The Miami Herald stirred outrage over that plea bargain. His lawyers maintained that the new charges in New York were covered by the 2008 plea deal and that Epstein hadn't had any illicit contact with underage girls since serving his 13-month sentence in Florida. Before his legal troubles, Epstein led a life of extraordinary luxury that drew powerful people into his orbit. He socialized with princes and presidents and lived on a 100-acre private Caribbean island and one of the biggest mansions in New York. ___ Sisak reported from Myrtle Beach, South Carolina, and Balsamo from Savannah, Georgia. Associated Press writers Curt Anderson, Jennifer Peltz, David Klepper and Larry Neumeister contributed to this report. (Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed .) 8/10/2019 6:50:25 PM (GMT -4:00) Breaking news and headlines in your inbox. Sign up for News 12 email alerts! Saturday, August 10 2019 5:04 PM EDT 2019-08-10 21:04:16 GMT Resident: FAA should change noisy North Fork Helicopter Route Resident: FAA should change noisy North Fork Helicopter Route Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Some North Fork residents are demanding the FAA change a helicopter route that they say is the root of major noise issues. Updated: Saturday, August 10 2019 7:23 PM EDT 2019-08-10 23:23:46 GMT The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. The FBI and U.S. Inspector General's office will investigate how Jeffrey Epstein died in an apparent suicide Saturday, while the probe into sexual abuse allegations against him remain steadfast, officials said. Saturday, August 10 2019 5:08 PM EDT 2019-08-10 21:08:32 GMT LaGuardia Airport announces changes to traffic pattern amid construction LaGuardia Airport announces changes to traffic pattern amid construction The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. The Port Authority is changing the traffic patterns entering LaGuardia Airport to accommodate the ongoing construction there. Saturday, August 10 2019 4:54 PM EDT 2019-08-10 20:54:08 GMT A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. A Long Beach restaurant has temporarily shut down while authorities investigate a potential salmonella outbreak. Updated: Saturday, August 10 2019 3:14 PM EDT 2019-08-10 19:14:12 GMT Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg Subaru logo on a 2019 Subaru Forester on display at the 2019 Pittsburgh International Auto Show in Pittsburgh Thursday, Feb. 14, 2019. . jpg The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. The National Highway Safety Administration is investigating complaints of malfunctions with the front passenger air bag sensors in more than a half-million Subaru Foresters. Friday, August 9 2019 7:13 PM EDT 2019-08-09 23:13:34 GMT President Donald Trump attended a pair of fundraisers Friday in the Hamptons. President Donald Trump attended a pair of fundraisers Friday in the Hamptons. Updated: Friday, August 9 2019 9:53 AM EDT 2019-08-09 13:53:54 GMT This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998. This week's dogs are up for adoption at Ruff House Rescue. The shelter is located in Island Park. Their phone number is 516-306-4998."}, {"articleID": "2014010916_00031319_W", "names": {"Jesse James": ["Q18719497", "Q20985425", "Q21062632", "Q530550", "Q954359"]}, "date": "2014-01-09", "url": "http://www.portlandtribune.com/pt/9-news/206746-62678-artists-sketch-a-better-life-for-typhoon-victims", "content": "Artists sketch a better life for typhoon victims - Thursday, 09 January 2014 06:00 Auto show fundraiser fuels hospital lodging - Thursday, 09 January 2014 06:00 Police threaten complaint as calls mount at the commons - Thursday, 09 January 2014 06:00 - Thursday, 09 January 2014 06:00 EGGERS: Ex-Blazer Ainge rebuilds Celtics New urban developments threaten forests, creeks - Thursday, 09 January 2014 00:00 Monterossi's clutch play carries Southridge over Rams - Thursday, 09 January 2014 00:00 Jesuit's Mondeaux excited to be a Duck Laker boys downed on last-second shot - Thursday, 09 January 2014 00:00 Pacer boys rebound with big win over Putnam - Thursday, 09 January 2014 00:00 Showmen sought for Singers spring session - Thursday, 09 January 2014 00:00 Westside Christian is moving on up - Thursday, 09 January 2014 00:00 Tigard leaders brace for 2014 projects - Thursday, 09 January 2014 00:00 New urban developments threaten forests, creeks Sources Say: Fritz thinks voters should \"own' city elections once again Artists sketch a better life for typhoon victims View Comments Portland 4 the Philippines plans fourth fundraiser Riannah Weaver was supposed to be in the Philippines when Tropical Storm Haiyan struck in November. The 30-year-old Northeast Portland artist had been invited by her pastor's family to teach art at a Philippine orphanage. After the trip was postponed, however, Weaver was shocked to hear that a devastating typhoon had hit the Philippines, leaving more than 6,000 dead, millions homeless, and major logistical challenges for relief operations .\" I was glad I wasn't there but (I thought) there's something I can do, \"she recalls. So she set up a Facebook page to collect donations for her pastor's organization, Christian Frontier Ministries. Within 48 hours, her social media community was so supportive that the effort took on a life of its own. It turned into a group called Portland 4 the Philippines, a collaborative of artists, dancers, musicians, performers and other creatives who've produced three fundraising concerts so far and have a fourth scheduled for later this month. The events include lineups of at least five bands, spoken-word performances, art auctions, raffles and education in the form of updates, photos and blogs from contacts on the islands. The Portand creative community has embraced the effort .\" There's a definite family here. We're all really driven to do something with our arts that actually make a difference, \"says Joseph\" Djo \"Fortunato, a 34-year-old musician and visual artist who is one of three other co-organizers .\" We're all trying to survive off our arts, but everyone wants to have a purpose for it. \"Fortunato, who is half Filipino, grew up on the East Coast but has several hundred relatives in the Philippines and has been there twice for family reunions. He says he'd never thought much about the Filipino community in Portland before, but this tragedy has helped bring many of them together. The events have been family-friendly and affordable, with tickets on a sliding scale of $5 to $20. Local and international artists have donated their work for auction, and local venues and others have pitched in. The three events so far in December and January have raised more than $2,000. The fourth event (they set one in each quadrant of the city) is set for Jan. 25 at the Dublin Pub. Artists Colton Carnahan, Jessica Rose and Kenton Clow, 1000 Fuegos, Jordan Harris, <mark>Jesse James</mark> with Drake Carnahan, and Erick Valle are some of the acts set to perform. All of the proceeds are going to two on-the-ground charities in the Philippines that are focused on relief efforts .\" It's an opportunity to remind ourselves why we pick up an instrument, a paintbrush - which is to make the world a better place, \"Fortunato says. Long-term plans Raising money is just part of the goal. The group wants to keep a spotlight on the disaster for years to come, as the nation rebuilds. They plan to sponsor the extended recovery efforts, which Fortunato's uncle is helping to lead through his organization, Soft Power Philippines. That group formed after the earthquake that struck a month before the typhoon. They offer trauma counseling, education and sustainable materials to the disaster survivors as they rebuild their communities with a 21st century model. They want their efforts to be sustainable, not just a flash in the pan .\" This horrible tragedy creates the need and opportunity to build a better world, \"Fortunato says .\" It wouldn't have been as devastating if they would've planned better, and they know it. \"Most Americans would have a hard time comprehending the scale of the devastation, which has been called far worse than Haiti endured after its 2010 earthquake. That's why Tom Finch volunteered to help, despite not being an artist or a musician .\" It's forced me to confront my own Eurocentrism, that I need to open my eyes to more than just this Eurocentric paradigm, \"says Finch, 39, a longtime teacher at Portland Public Schools, on sabbatical this year. Named by The Princeton Review as one of the 168 best medical schools in the country, the School of Naturopathic Medicine at Bastyr University is committed to developing leaders in the evolving field of natural medicine."}, {"articleID": "2018102902_00238532_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2018-10-29", "url": "http://www.gamereactor.eu/games/29421/Hearthstone", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 19th of April 2018 at 14 \"Witchwood is yet another quality expansion for Hearthstone .\" 0 REVIEW. Written by Kristian Kask on the 17th of August 2016 at 12 \"It's a good entry point for all the old World of Warcraft players who want to feel a bit nostalgic .\" ESPORTS. Written by <mark>Sam Bishop</mark> on the 10th of October 2018 at 08 The Blizzard Arena Los Angeles is hosting 16 top players. 0 NEWS. Written by Ricardo C. Esteves on the 17th of September 2018 at 10:33 New Tavern Brawl and quests are available. 0 NEWS. Written by Ricardo C. Esteves on the 19th of July 2018 at 12:51 Especially the Magnetic mechanic."}, {"articleID": "2010020400_00113122_W", "names": {"Paul Fraser": ["Q2059630", "Q7150728"]}, "date": "2010-02-04", "url": "http://lifesitenews.com/ldn/2010/feb/10020314.html", "content": "by patrick b. craine victoria, b.c., february 3, 2010 (lifesitenews.com) - british columbia pro-life researcher ted gerk appeared before a government committee today to call on the government to allow access to information relating to abortions performed in the province. the kelowna native, presenting to the special committee to review the freedom of information and protection of privacy act, called for the repeal of bill 21, an amendment to the province's freedom of information act that was enacted in 2001 by the ndp government to specifically exclude access to abortion information. as gerk told the committee, the bill \"created the amazing dilemma that i can know that my local hospital is providing abortion services, but i'm not allowed to know how many .\" in fact, as he pointed out, the abortion figures put out by statistics canada no longer include the number from b.c., and simply includes the note that the b.c. figure is \"too unreliable to be published .\" gerk charged that the amendment was enacted during a period when government was \"closely aligning themselves with political activists that lobby them on a regular basis,\" but \"then ensuring that information detailing that lobbying is never made public .\" the amendment, suggested gerk, was a way of covering up that information. prior to the passage of the amendment, information obtained through freedom of information, \"provided embarrassment after embarrassment directed toward the government and the bureaucracy,\" he added. through freedom of information requests, said gerk, he and fellow researchers were able to learn details about a special government committee called the abortion services working group, for example. they discovered that through this committee the ministry of health and the ministry of the attorney general were meeting with abortion-activist groups, and they also learned that freedom of information was a topic of discussion at these meetings. he mentioned, further, the discovery in the early 1990s that the b.c. attorney general had filed a false affidavit when he swore that he had not participated in a secret strategy meeting with abortion proponents. in 1996, said gerk, he and others discovered that the college of physicians and surgeons \"didn't even follow their own rules when it came to the accreditation of one of vancouver's abortion clinics .\" detailed in 2001, gerk was also able to discover, while investigating the death of a woman following an abortion at vancouver general hospital, that 15 babies had survived abortion between 1995 and 1998, but then died later. the amendment, gerk concluded, \"was put there, plainly and simply, because the government was tired of having to defend their abortion policies and activism. they were meeting with activists on one side of a public policy issue, all the while refusing to meet with those with a differing opinion .\" \"i didn't think it was too much to ask that we be allowed, in a democratic country, to monitor abortion advocacy being undertaken by our government and the bureaucracy,\" gerk observed. \"i mean, the same pro-choice groups that secretly met with government have called for a ban on any discussion about abortion and the formation of any pro-life groups, on university campuses!\" \"the public and media are surprised, now all these years later, at the travesty that foi has become in bc,\" gerk stated. \"i would submit that many of them failed to recognize that when you allow government to make any topic off limits, make it secret, you have in fact sown the seeds of secrecy...and how can you complain when it naturally expands to other areas?\" gerk and john hof, the president of campaign life coalition b.c., also called on the acting b.c. information and privacy commissioner, <mark>paul fraser</mark>, today to address this problem of abortion censorship. they presented him with 2,500 postcards signed by fellow british columbians. contact information: mr. <mark>paul fraser</mark>, qc office of information and privacy commissioner for british columbia po box 9038, stn. prov. govt. victoria, bc v8w 9a4 phone: (250) 387-5629 e-mail: study: 56% of young adults in a new sexual relationship infected with hpv liberal leader ignatieff slammed as \"extreme\" and \"divisive\" on abortion lawsuit filed challenging constitutionality of fed. hate crimes law canadian professors' union blacklists christian university over \"academic freedom\" poll: majority of americans wants us supreme court to reject gay \"marriage\" mcgill prof: quebec anti- \"homophobia\" plan is \"declaration of war\" u.k. gov' t backs down on equalities bill amendment following papal criticism chinese parents refuse simple life-saving treatment for daughter u.s. bishops' media director who exonerated exec admits to not reading key report planned parenthood board members in law, medicine teaching positions at jesuit u. the two lists: a former pro-choice atheist reflects on sex, abortion and anger congressman smith blasts abortion - \"obsessed\" obama - calls for prayer and fasting petition launched: support cbs's decision to air tim tebow super bowl ad conference of catholic bishops exec chaired pro-abortion, lgbt rights group calif. quietly shifts fruitless embryo research funds to adult stem cells cbs news legal analyst slams feminist critics of tebow super bowl ad cnn gaffe: anchor wonders on air whether more pro-lifers or pro-aborts at march for life creative commons attribution-no derivatives license. you may republish this article or portions of it without request provided the content is not altered and it is clearly attributed to \"lifesitenews.com\". any website publishing of complete or large portions of original lifesitenews articles"}, {"articleID": "2015051618_00009127_W", "names": {"Magic Johnson": ["Q134183", "Q7490891"], "Chris Webber": ["Q314415", "Q5108439"], "Tony Williams": ["Q11704565", "Q15059471", "Q16216174", "Q17132118", "Q27058293", "Q27922630", "Q3430687", "Q3993322", "Q41762006", "Q4777220", "Q7823679", "Q7823682"], "Tom Wolf": ["Q1557544", "Q7794795"], "Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "Ed Lee": ["Q241750", "Q5335075"], "Greg Ballard": ["Q2340949", "Q5251212"], "Greg Stanton": ["Q5606289", "Q56718996"], "Mike Rawlings": ["Q15689970", "Q6848512"], "Chuck Reed": ["Q21170808", "Q5115678"], "Alvin Brown": ["Q10900657", "Q4738049", "Q4738052"], "Michael Coleman": ["Q18390603", "Q18629172", "Q50418243", "Q52359840", "Q6829344", "Q6829345", "Q6829347", "Q6829353", "Q6829361"]}, "date": "2015-05-14", "url": "http://www.huffingtonpost.com/2015/05/14/philadelphia-mayor-super-pac_n_7268872.html", "content": "45 Years Ago, A Nun Promised To Protect These Women. Now They're Searching For Her Killer. Canada Just Threw A Grenade Into Elizabeth Warren's Trade Fight With Obama American Apparel Fires Back At Dov Charney With A Lawsuit Of Its Own How One Grocery Chain Succeeds In Low-Income, Underserved Communities Blue Bell Will Lay Off A Third Of Its Workers After Listeria Outbreak <mark>Magic Johnson</mark>'s Son Debuts 100-Pound Weight Loss While Promoting Reality Show Sharon Osbourne: \"The View'\" Lost Its Direction' After Barbara Walters Left ABC Disputes RNC Chair's Implication The Party Can Pick Its Own Debate Moderators Cartoon Nails Why So Many People Are Frustrated With Brady's Suspension Jalen Rose And <mark>Chris Webber</mark>'s Public Beef Just Reached Another Level Don't Let Feel-Good Stories Trick You Into Thinking The Sports World Isn't Homophobic Inside The Mind That Built Google Brain: On Life, Creativity, And Failure \"Game Of Thrones' Star Talks About Sexuality On Hit Show And The Homoerotic Night's Watch WASHINGTON--Voters will cast ballots in the Democratic primary for Philadelphia's mayoral race on May 19, but three libertarian donors from the suburbs could really influence the contest. According to city campaign finance records, Arthur Dantchik, Joel Greenberg and Jeff Yass--heads of the trading firm Susquehanna International Group--have pumped almost $7 million into the American Cities super PAC, which backs state Sen. Anthony H. Williams (D). The total contributed by the three financial executives through May 4, the cutoff for the latest reports, not only dwarfs the amount spent by each candidate in the race, but also is nearly equal to all candidate and other super PAC fundraising combined. The contributions come amid a continued uptick in large campaign donations from financial investors to city, state and municipal elections sent through super PACs in recent years. The funds are largely given in support of market-based education reforms including the privatization of public schools, the diversion of public school funds to charter schools and the breaking of teachers unions .\" There is a trend right now toward increased outside spending on lower-ticket races, \"said Denise Roth Barber, managing director at the National Institute on Money in State Politics, a group tracking campaign finance at the state level. The $7 million contributed by just three individuals in the Philadelphia mayoral race stands out as one of the largest financial investments at the city level since the Supreme Court's 2010 Citizens United ruling opened the door for unlimited independent spending by corporations, unions and, ultimately, wealthy individuals. A super PAC that was largely funded by supporters of charter schools and school privatization spent $4 million in support of Chicago Mayor Rahm Emanuel's winning re-election campaign this year. A hedge-fund-backed group in New York that successfully helped elect a Republican state Senate majority in 2014 also spent $4 million. And in Newark's 2014 mayoral election, supporters of market education reform similarly spent $4 million in a losing campaign to elect a successor to Sen. Cory Booker (D-N.J.). The Susquehanna International Group investors are major backers of these policies through their political and charitable donations, and as a staunch supporter of these types of policies, <mark>Williams</mark> is a perfect fit with these priorities. In the state Senate, <mark>Williams</mark> was the architect of an expansion of the state tax credit diverting public funds to charter schools by allowing corporations and wealthy individuals to be refunded with public money when they pay for a scholarship, or\" voucher, \"for a public school student to attend a charter school. He also served on the education commission created by former Republican Gov. Tom Corbett, a proponent of charter schools and vouchers. <mark>Williams</mark> is not a new commodity for the investors based in Bala Cynwyd, Pennsylvania. Dantchik, Greenberg and Yass spent at least $6 million through their Students First PA PAC to support <mark>Williams</mark>' bid for the Democratic Party's gubernatorial nomination in 2010. Susquehanna International Group did not respond to a request for comment from Dantchik, Greenberg, Yass or the company itself. Barbara Grant, a spokeswoman for the <mark>Williams</mark> campaign, said she could not comment on the prior connections between the campaign and the American Cities PAC donors, citing the ban on coordination between campaigns and super PACs .\" I can tell you what the senator has said for a very long time about his being influenced by the gentlemen who are the founders [of American Cities PAC], \"Grant said .\" And basically, he's said they have supported him for a long time and they've never asked him for anything except to advance the cause of good schools and good education for kids. \"Connections between <mark>Williams</mark> and the Susquehanna International Group donors are not limited to their contributions. <mark>Williams</mark>' campaign manager, Dawn Chavous, Chavous also founded a charity, Sky Community Partners, to take advantage of the tax credits for scholarships policy pushed by <mark>Williams</mark>. The Susquehanna International Group investors have given money to Sky Community Partners in exchange for tax credits under the program. Actually, Dantchik, Greenberg and Yass are, collectively, the largest users of the tax credit program. Not only do they give to Sky Community Partners, but they have also donated to Choice Academics, a charter charity run by Yass' wife, Janine. The tax credit program, which cost the state $127 million in 2014, has been plagued by a lack of oversight and criticized by Gov. <mark>Tom Wolf</mark> (D). According to a report on Philly.com, the state's Department of Community and Economic Development\" acknowledged that until 2012, it did not keep digital records for hundreds of millions of dollars worth of educational tax-credit applications filed on paper. \"The program also contains a loophole, according to Philly.com, allowing companies to sidestep the limit in the total amount of tax credits they can receive under the program in a given year by donating through affiliates or subsidiaries. This is precisely the practice used by the Susquehanna International Group. While Dantchik, Greenberg and Yass have a long history of supporting <mark>Williams</mark> in Democratic primary elections and have made bipartisan contributions for years, they are primarily backers of Republican Party politicians and groups promoting libertarian policies. They have contributed to national Republican Party committees, Corbett, Wisconsin Gov. <mark>Scott Walker</mark> (R) and Republican leaders such as former U.S. House Majority Leader Eric Cantor (R-Va .). Large contributions have flowed to various committees set up by the Club for Growth. Most of the candidates they supported in recent elections are from the more libertarian wing of the party or the tea party. Yass contributed to the 2000 presidential campaign of Libertarian Party nominee Harry Browne and the Libertarian National Committee and also the Ralph Nader's 2004 independent presidential campaign. The trio has also donated to Democrats, including both Hillary Clinton and Barack Obama during the 2008 presidential nominating contest and Pennsylvania politicians such as then-Gov. Ed Rendell and U.S. Sen. Bob Casey. Democratic congressmen on key financial services committees have also received contributions. Dantchik, Greenberg and Yass have given contributions to Democratic Party committees as well, albeit on a smaller scale than to Republican groups. The three investors have also given millions of dollars to such nonprofits as the libertarian Cato Institute, the libertarian legal group Institute for Justice and the Ayn Rand Institute .\" They know they can't elect a Republican citywide in Philadelphia, and <mark>Tony Williams</mark> is the closest thing they can get, \"said Kati Sipp, director of Pennsylvania Working Families, a group backing <mark>Williams</mark>' opponent Jim Kenney in the mayoral race. Previous polling, both independent and by groups favoring individual candidates, showed a tight race between Kenney and <mark>Williams</mark>. An NBC 10 poll released on Thursday, however, gave Kenney a large lead and <mark>Williams</mark> in a tie for second with former District Attorney Lynne Abraham. Kenney has the backing of many of the city's largest unions including the teachers unions and national unions like the AFL-CIO, and those groups have contributed large sums to super PACs supporting his election, but not nearly to the level of the Susquehanna International Group. The union-supported Building a Better PA super PAC raised $1.5 million through May 4. Another pro-Kenney union group, Forward Philadelphia, raised $783,100 through the same date. Spending by all super PACs is expected to pick up in the final week of the campaign. Charlotte mayor Dan Clodfelter speaks during an event on Sept. 24, 2014 at the Siemens Charlotte Energy Hub in Charlotte, N.C. (Jason E. Miczek / AP Images for Siemens) San Diego Mayor Kevin Faulconer speaks before the California Republican Party 2014 Spring Convention Friday, March 14, 2014, in Burlingame, Calif. (AP Photo/Ben Margot) Chicago Mayor Rahm Emanuel speaks to members of the Safe Passage program during a training session at Chicago State University in Chicago, Wednesday, Aug. 21, 2013. (AP Photo/Scott Eisen) San Francisco Mayor <mark>Ed Lee</mark> speaks to reporters during a news conference after Asiana Flight 214 crashed at San Francisco International Airport in San Francisco, Saturday, July 6, 2013. (AP Photo/Darryl Bush) Los Angeles Mayor Eric Garcetti speaks in front of city hall after being sworn in on Sunday, June 30, 2013. (AP Photo/Mark J. Terrill) New York City Mayor Bill de Blasio sits on stage during the swearing in ceremony for New York City's 42nd police commissioner William Bratton at One Police Plaza on January 2, 2014. (Photo by Spencer Platt/Getty Images) President Barack Obama, right, meets with Houston Mayor Annise Parker during his arrival at Ellington Airport, Friday, March, 9, 2012, in Houston. (AP Photo/Pablo Martinez Monsivais) Indianapolis Mayor <mark>Greg Ballard</mark> talks the plans for the city to bid for the NFL football's 2018 Super Bowl as Allison Melangton, left, chair the 2018 Super Bowl Bid Committee, watches during an announcement in front of the downtown skyline in Indianapolis, Friday, Aug. 30, 2013. (AP Photo/Michael Conroy) Mike Duggan celebrates his election as the new mayor of Detroit at a victory party at the Renaissance Center November 5, 2013 in Detroit, Michigan. (Photo by Bill Pugliano/Getty Images) Philadelphia Mayor Michael Nutter speaks about ways to reduce U.S. murder and gun violence rates and other issues affecting urban communities at the National Press Club in Washington, D.C., September 26, 2013. (SAUL LOEB/AFP/Getty Images) Oscar Leeser poses during the reception for Hyundai Hope on Wheels and CHOC Children's Foundation's Change the World Campaign on May 10, 2011 in Orange, California. (Photo by Ryan Miller/Getty Images) Phoenix Mayor <mark>Greg Stanton</mark> speaks at a press conference to introduce Brittney Griner (not pictured) of the Phoenix Mercury at U.S. Airways Center on April 20, 2013 in Phoenix, Arizona. (Photo by Christian Petersen/Getty Images) U.S. Health and Human Services Secretary Kathleen Sebelius, right, with Dallas Mayor <mark>Mike Rawlings</mark>, left, discusses the implementation of the federal health care overhaul in Dallas, Texas, on Thursday, September 26, 2013. (AP Photo/Nomaan Merchant) This April 22, 2011 file photo shows San Jose Mayor <mark>Chuck Reed</mark> speaking during the 8th Annual CEO Summit at IBM offices in San Jose, Calif. (AP Photo/Paul Sakuma, File) Secretary of Health and Human Services Kathleen Sebelius, left, leads a meeting with Austin, Texas, Mayor Lee Leffingwell, second from left, and City Manager Marc Ott, right, and others at City Hall in Austin, Texas, on Thursday, Aug. 8, 2013. (AP Photo/Austin American-Statesman, Jay Janner) Jacksonville mayor <mark>Alvin Brown</mark> speaks to the media during the Road to Daytona Fueled By Sunoco Tour stop at City Hall on February 12, 2013 in Jacksonville, Florida. (Photo by Sam Greenwood/Getty Images for NASCAR) Mayor <mark>Michael Coleman</mark> of Columbus, Ohio speaks to members of the media outside the West Wing during a news briefing after a meeting with President Barack Obama at the White House December 12, 2012 in Washington, D.C. (Photo by Alex Wong/Getty Images) Fort Worth Mayor Betsy Price looks on during a press conference before the start of the 2013 Mayor's Cup on July 26, 2013 at Texas Motor Speedway in Fort Worth, Texas. (Photo by Cooper Neill/Getty Images for Texas Motor Speedway) Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg"}, {"articleID": "2015091313_00001054_W", "names": {"Mohamed Omar": ["Q12240858", "Q130427"]}, "date": "2015-09-13", "url": "http://antiguaobserver.com/al-qaeda-chief-urges-lone-wolf-attacks-militant-unity/#respond", "content": "Latest: Baldwin Spencer to participate in meeting of OECS opposition leaders <a href = \"http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=addc1000 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src =\" http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=12 & cb=INSERT_RANDOM_NUMBER_HERE & n=addc1000' border =' 0' alt = \"/> </ a> <a href =\" http: //antiguaobserver.com/adserver/www/delivery/ck.php? n=a5e87b37 & cb=INSERT_RANDOM_NUMBER_HERE' target =' _ blank'> <img src = \"http: //antiguaobserver.com/adserver/www/delivery/avw.php? zoneid=17 & cb=INSERT_RANDOM_NUMBER_HERE & n=a5e87b37' border =' 0' alt =\" /> </ a> Al Qaeda chief urges lone wolf attacks, militant unity September 13, 2015Reuters International No comments New Story A photo of Al Qaeda's new leader, Egyptian Ayman al-Zawahiri, is seen in this still image taken from a video released on September 12, 2011. Al Qaeda leader Ayman al-Zawahri called on young Muslim men in the United States and other Western countries to carry out attacks inside there and urged greater unity between militants. \"I call on all Muslims who can harm the countries of the crusader coalition not to hesitate. We must now focus on moving the war to the heart of the homes and cities of the crusader West and specifically America,\" he said in an audio recording posted online on Sunday, referring to nations making up the Western-led coalition in Iraq and Syria. He suggested Muslim youth in the West take the Tsarnaev and Kouachi brothers, who carried out the Boston marathon bombings and Charlie Hebdo shootings in Paris respectively, and others as examples to follow. It was not clear when the recording was made but references to former Taliban leader Mullah <mark>Mohamed Omar</mark> as being alive suggest it is at least two months old. <mark>Omar</mark>'s death was announced by Afghanistan's government in late July. Zawahri reiterated his position on Islamic State, repeating what he said in a recording posted on Wednesday--that he viewed the group's claim to be a caliphate as illegitimate but would join them in fighting Western and secular forces in Iraq and Syria. Former Egyptian doctor Zawahri urged unity between Islamist militant factions in Syria and Iraq, where a Western-led coalition is bombing Islamic State targets, but recognized it would he be difficult. He called for the formation of an independent sharia court to settle disputes."}]