[{"articleID": "2019070900_00181811_W", "names": {"Phil Gould": ["Q7181928", "Q7181933"], "Wally Lewis": ["Q18218165", "Q3565555"], "James Maloney": ["Q17386312", "Q25708309", "Q3161249"], "James Bracey": ["Q27915120", "Q6130103"], "Andrew Webster": ["Q29033785", "Q4758866"]}, "date": "2019-07-09", "url": "http://northernstar.com.au/news/gus-roasts-maroons-champ-with-prediction/3774916/", "content": "<mark>Phil Gould</mark> on Channel 9's 100% Footy. Rugby League Gus roasts Maroons champ with prediction 9th Jul 2019 10:48 AM 0 Billy Slater could only shake his head and laugh after <mark>Phil Gould</mark> executed a brutal drive by on Monday night's episode of 100% Footy on Channel 9. <mark>Gould</mark> was holding court when the focus of the panel shifted to State of Origin Game 3 on Wednesday night when his prediction for how the series will be decided turned a torch on the contentious decision to award Slater the <mark>Wally Lewis</mark> Medal as the player of the series in 2018. Slater famously received Origin's top individual award despite only featuring in two matches in a series where the Blues wrapped up victory in the first two matches. <mark>Gould</mark> couldn't help himself on Monday night as he outlined by prediction that NSW will win the series decider at ANZ Stadium by just one point, thanks to a <mark>James Maloney</mark> field goal. When asked by host <mark>James Bracey</mark> about who will receive the medal in 2019, <mark>Gould</mark> responded: \"Billy Slater\". As the former Panthers supremo tossed his prediction card away, fellow panellists Paul Gallen and Slater erupted with laughter. \"You're not safe on this table,\" Slater said as he shook his head. Gus' prediction for #Origin Man of the Series; Billy Slater .?? He wasn't expecting that one .?? #100PercentFooty | 10.20 pm on @ Channel9 pic.twitter.com/lj4oy5SLsv--NRL on Nine (@ NRLonNine) July 8, 2019 It comes as a fresh report on Tuesday outlined the changes the NRL has made to the voting on the prestigious award following the farce of 2018. The Daily Telegraph reports that judges for the award - Mal Meninga, Laurie Daley and Darren Lockyer - will now only vote for players who turned out in all three Origin matches. The voting panel will also convene at the end of Game 3 to vote separately on a player of the series - rather than rely on the votes of the individual three matches. Billy Slater could only laugh. After Wednesday night's game three, the trio will vote for the man of the match. They will then be presented with a shortlist of eligible players for the man of the series. Those players will have to have played every game with Cameron Munster and Dane Gagai expected to lead Queensland's candidates, while NSW's contenders are shaping as James Tedesco and Jake Trbojevic, Tom Trbojevic and Damien Cook. It was revealed last month Blues coach Brad Fittler was still angry about the decision to hand the 2018 gong to Slater. The Sydney Morning Herald's <mark>Andrew Webster</mark> told Macquarie Sports Radio, Fittler was seething at the decision to award Slater the top individual honour. \"I just know after seeing Freddy in the rooms after last year, he was filthy,\" <mark>Webster</mark> said. \"He was absolutely filthy that Billy Slater got it .\" Damien Cook, Boyd Cordner and James Tedesco were all thought to have been the clear favourites for the award, but the voting anomaly allowed Slater to sneak past the Blues stars. More Stories Maroons star out after bizarre backflip premium_icon Slater clause: NRL acts to avoid a silly Billy medal premium_icon Ferguson's vow if Blues win Origin decider More Stories Maroons star out after bizarre backflip premium_icon Slater clause: NRL acts to avoid a silly Billy medal premium_icon Ferguson's vow if Blues win Origin decider 0 editors picks Read More Login to follow gus <mark>gould</mark> Read More Login to follow maroons Read More Login to follow state of origin Read More Login to follow editors picks gus <mark>gould</mark> maroons state of origin"}, {"articleID": "2011010517_00177618_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2011-01-05", "url": "http://gossipcop.com/lindsay-lohan-breathalyzer-betty-ford-rehab-palm-desert-police/", "content": "(gettyimages.com) police officials reportedly believe lindsay lohan was under the influence of drugs or alcohol while in rehab at the betty ford center. the palm desert police department suspects the actress committed probation violations dawn holland, including a supposed refusal to submit to a breathalyzer test, according to tmz. it's worth noting, however, that the department has not yet gone on record with these allegations of substance use. shawn chapman holley, lohan's attorney, tells the site that during conversations with various rehab personnel, \"it was never suggested by anyone that [lohan] ever drank or used drugs .\" gossip cop will monitor the situation. justin bieber and selena gomez \"kissing\" picture is fake (exclusive) the lengths robert pattinson is going just to attend people's choice awards did miley cyrus take a naked photo of herself on her iphone? (update) cell phone butt dial leads to hilarious (for us) 30-person swat team intervention <mark>glenn beck</mark> dropped by new york city radio station for low ratings blake griffin announces he'll be in slam dunk contest, world rejoices airplane fight! grizzlies teammates go at it over card game, while in mid-air espn announcer whose mic was accidentally left on: \"my god, these are the longest games ever\" "}, {"articleID": "2015021909_00004669_W", "names": {"Tom Wolf": ["Q1557544", "Q7794795"]}, "date": "2015-02-19", "url": "http://citizensvoice.com/news/arguments-planned-in-lawsuit-targeting-school-funding-inequities-1.1835150", "content": "HARRISBURG - A state appeals court will hear arguments next month concerning a lawsuit calling for an end to sharp inequities in the way Pennsylvania public schools are funded. The full Commonwealth Court scheduled a March 11 hearing in Harrisburg to decide if the case can go forward, said Brett Schaeffer, policy analyst for the Education Law Center, an advocacy group. Wilkes-Barre Area School District, Shenandoah Valley School District in Schuylkill County and Panther Valley District in Carbon County are among several school district plaintiffs in the lawsuit. Plaintiffs include Tracey Hughes on behalf of her unnamed minor son, an eighth grader at E.L. Meyers Junior-Senior High School in Wilkes-Barre. The lawsuit seeks court action to erase disparities in per-pupil spending between richer and poorer school districts across Pennsylvania. Often reflecting variations in property values, education spending ranges from a low of $9,800 per pupil to a peak of $28,400 per pupil, said the Education Law Center and Public Interest Law Center of Philadelphia. These groups, school districts and parents filed the lawsuit last November saying the Legislature and governor have failed to uphold a state constitutional obligation to provide public education that gives all children the resources they need to meet state-imposed academic standards. The lawsuit was filed following former Gov. Tom Corbett's re-election defeat. Attorneys for Corbett and the House and Senate filed motions on Jan. 16 seeking to dismiss the case. It is uncertain what legal course Gov. <mark>Tom Wolf</mark> will take, advocates said. <mark>Wolf</mark> spoke in broad terms about wanting to bridge the education spending gap in his Jan. 20 inaugural speech. \"Our state will never be as strong as it needs to be if some schools have all the resources they need and other schools are cutting band and football to just to keep the lights on,\" he said. We welcome user discussion on our site, under the following guidelines: To comment you must first create a profile and sign-in with a verified DISQUS account or social network ID. Sign up here. Comments in violation of the rules will be denied, and repeat violators will be banned. Please help police the community by flagging offensive comments for our moderators to review. Valentine's Day Deals Check out the great deals from our local businesses Win tickets to Sesame Street Live! Register to win a Family 4-pack to see Sesame Street Live at the Mohegan Sun Arena in March! Deadline to enter is February 22. Win tickets to SPANK: The Fifty Shades Parody The Citizens' Voice is giving away tickets to SPANK: The Fifty Shades Parody. Deadline to enter is February 25 Follow us on Twitter Follow @ CitizensVoice for breaking news, weather updates & more Find us on Facebook \"Like\" The Citizens' Voice on Facebook for all the latest news! Follow us on Pinterest Are you on Pinterest? Follow our boards for entertainment, sports, photos & more"}, {"articleID": "2016091314_00787619_W", "names": {"Richard Johnson": ["Q14951100", "Q15485938", "Q166422", "Q1700677", "Q48742884", "Q6584097", "Q7326891", "Q7326893", "Q7326895", "Q7326896", "Q7326897", "Q7326900", "Q7326902", "Q7326904", "Q7326905", "Q7326907", "Q7328820"]}, "date": "2016-09-13", "url": "http://k2radio.com/councilman-fights-to-legalize-skateboarding-in-downtown-cheyenne/", "content": "Councilman Fights to Legalize Skateboarding in Downtown Cheyenne By Joy Greenwald September 13, 2016 8:19 AM Share on Facebook Share on Twitter Thinkstock Cheyenne City Councilman <mark>Richard Johnson</mark> is working to repeal a section of city code which prohibits skateboarding in the downtown area. \"I've been fighting this battle since 1988 when I was 14 years old,\" said <mark>Johnson</mark>. \"I've basically had this argument with almost three different mayors .\" <mark>Johnson</mark>, who started skateboarding in 1985, says he understands some downtown business owners may be reluctant to get on board with the idea. \"One thing people don't seem to realize about skateboarders is they want to be left alone, so they go seek places that there's not a lot of traffic,\" said <mark>Johnson</mark>. \"They don't want to be bothered, just like they don't want to bother downtown business owners .\" <mark>Johnson</mark> says even if skateboarding becomes legal downtown, it would still be illegal to skate in places that have \"No Skateboarding' signs, like the Depot Plaza .\" Anywhere that there's a \"No Skateboarding' sign, even if it's not on the books, it basically could still be classified as a trespassing charge,\" said <mark>Johnson</mark>. <mark>Johnson</mark> says while there is a skate park in Brimmer Park, it's not a convenient location for many teens. \"Say you live over by the base or say you live in Sun Valley or Saddle Ridge or even up north,\" said <mark>Johnson</mark>. \"If your skateboard is your only means of transportation, you literally have to skate several miles to reach the central facility .\" The City Council's Public Services Committee will take up the issue when it meets on Tuesday, September 20 at noon. \"I didn't go fish for votes, this is just something I'm passionate about,\" said <mark>Johnson</mark>. \"Fifteen-year-old <mark>Richard</mark> would really be upset with 42-year-old <mark>Richard</mark> if he was elected to City Council and didn't do anything about this .\" Category: Casper News Share on Facebook Share on Twitter More Leave a comment Send to a friend! Print this page Pin it! Reddit This! Share on Tumblr!"}, {"articleID": "2010030519_00145042_W", "names": {"Patrick Henry": ["Q2825856", "Q3369514"]}, "date": "2010-03-05", "url": "http://forum.prisonplanet.com/index.php?topic=162322.msg964452#msg964452", "content": "* a caller called into alex's show the other day and said that most of the police have been pulled off the subway areas...i think we need to be very aware of a false flag happening in the subway. ny wins $274 mln stimulus funds for transportation the u.s. department of transportation has awarded more than $274 million of stimulus funds to help finance two projects in new york, a group of officials said on friday. u.s. the funds will be allocated to the second avenue subway project and the east side access project, senators charles schumer and kirsten gillibrand and representatives jerry nadler and carolyn maloney said in a statement. the second ave project aims to ease congestion on the lexington avenue line on manhattan's east side, the busiest subway line in the nation. the east side access project aims to create a rail link from the long island railroad to grand central station via the 63rd street tunnel, cutting commuting time for riders from long island. \"for my part, whatever anguish of spirit it may cost, i am willing to know the whole truth; to know the worst and provide for it .\" ~ <mark>patrick henry</mark>"}, {"articleID": "2010041806_00121100_W", "names": {"Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Robert Martin": ["Q15970430", "Q16136784", "Q17154354", "Q19668228", "Q22525963", "Q27892945", "Q41191585", "Q42782633", "Q42995616", "Q43912327", "Q51078349", "Q53953098", "Q55693554", "Q59395153", "Q7347389", "Q7347391", "Q7373118", "Q93010"], "President Bush": ["Q207", "Q23505"]}, "date": "2010-04-18", "url": "http://chron.com/disp/story.mpl/editorial/outlook/6963629.html", "content": "the article \"a load of debt on an empty dome; astrodome carrying as much as $32 million, an amount likely to haunt county for years to come\" (page a1, tuesday) was very disturbing, especially in light of the fact that the city will close its libraries on saturdays to save money. the current debt of $19 million to $32 million resulted from the harris county sports & convention corp.'s spending of $60 million in 1987 to add seats and luxury boxes so the wealthy owner would not move the oilers. this turned out to be a big waste since the team moved anyway to nashville in 1997. in addition, the yearly debt, interest and operating costs total about $4.4 million. so houston then builds another football stadium - reliant - at a cost of $449 million, of which only 50 percent was private financing. one wonders when the folks of houston will need to build a more modern stadium because reliant is not nearly as grand as the new edifice built by <mark>jerry jones</mark> in dallas. regarding your excellent article on the plight of the astrodome, while memories and nostalgia continue to run high, let's face it: the 40-year-old facility has lost its usefulness to the community and should be demolished. many similar covered stadiums around the country have already been razed. there should be a message here. it is ludicrous to think that in these times any developer or investment group is going to assume the monstrous $32 million debt. with a struggling economy, hotel occupancy hovering at 50 percent, failed amusement parks and financial lending marginalized for the foreseeable future, county officials should bite the bullet. the dome is doomed, so let's demolish it now rather than continue to soak the taxpayers for $5 million a year indefinitely. how many more years are county officials going to keep feeding this long-dead animal? remember when we built the astrodome, roy hofheinz told us we were giving the city a gift that would bless us for generations? now i read that we still owe up to $32 million, which will take 22 years to pay off, all while we pay $2 million more a year in maintenance (not allowing for inflation). you do the math. seems to me like we gave ourselves the gift that keeps on taking. how about we follow dallas' lead and just blow it up? we could sell lottery tickets to push the button. might even make enough to retire the debt. i'd pay 10 bucks for a chance to do it. hopefully the astrodome is now one step closer to its final destiny: being converted into a much-needed multilevel parking garage at reliant park. the outer shell should retain the familiar dome look that we all have become accustomed to seeing over the past 40-plus years. but the interior should be converted into multilevel parking with six to eight entrances spaced around the perimeter. the parking fees collected would fully pay for this conversion, and we would still have our beloved astrodome to view. we are about to build still another new stadium and saddle the taxpayers with a big part of the bill. yet in our city sits a beautiful stadium, billed as the eighth wonder of the world, and it is vacant. well, duh! why can't the dynamo work out a deal to use this great facility instead of building still another playpen for athletes? in addition to saving money, there would be a prestige factor in claiming the dome as a home. an alternative looms in the future, which is to eventually tear down this great facility because it costs too much to sit there vacant. i don't think anyone in this city wants this to happen. i truly wish that good common sense would prevail among the decision-makers. someone, please, exercise some leadership and lead the way toward making this happen. regarding your article about the outstanding debt on the long-vacant astrodome (another example of government mismanagement), perhaps a mere 32 of all those famous athletes who benefited greatly from their taxpayer-funded playground might consider a little public service and each kick in a million dollars apiece or so to pay off the debt. nah...never happen. it appears that after all these years and all those tragic deaths, the houston police department is still sending lone officers to deal with family disturbances (\"police: officer shoots man holding knife; officials say suspect held it to woman's throat\" (page b1, friday). the headline could have been much different. too many times officers have been killed or seriously injured at such events. one of the first things my training officer told me was, \"when you break up a fight, you frequently have to fight two people .\" to continue sending lone officers to such calls is dangerous. <mark>robert martin</mark>, retired hpd lieutenant, montgomery in \"some cross bridge to 21st century; others\" just say no' \"(page b9, april 7), thomas friedman makes two main errors. first, he assigns to president george w. bush the legacy of the reagan trifecta of\" tax cuts, deregulation and government-as-the-problem-not-the-solution. \"in truth, president <mark>bush</mark> met only one of the three - one short of even the meatloaf standard of success. under <mark>bush</mark>, not only did regulation increase (even in the financial sector - remember sarbanes-oxley?) but domestic discretionary spending increased at nearly double the level that it did under president clinton. second, he states that government should be\" incentivizing businesses to build their next factory in this country, \"implying that it is the government that should lead the way in deciding where we should invest in the future, using subsidies and special benefits to guide innovation. unfortunately, government tends to use such interventions to protect favored corporations from competition and to set up benefits for favored special interests. friedman is asking for politicians, acting on the incentive of being re-elected, to somehow predict the future and direct future innovation in areas in which they have limited knowledge and expertise. we've seen the result when we expect government to lead the way in\" building bridges \": we get a bridge to nowhere. comments readers are solely responsible for the content of the comments they post here. comments are subject to the site's about our ads copyright © 2010 the houston chronicle"}, {"articleID": "2018090412_00278714_W", "names": {"Nicola Mclean": ["Q7029075", "Q7029076"], "Jamie O'Hara": ["Q1429719", "Q470340"], "John Partridge": ["Q23680943", "Q454634", "Q51584622"], "Stephanie Davis": ["Q6134141", "Q7608260"]}, "date": "2018-09-04", "url": "http://heatworld.com/entertainment/tv-movies/coleen-nolan-kim-woodburn-interview/", "content": "Coleen Nolan breaks down over her confrontation with Kim Woodburn on This Morning Coleen Nolan breaks down over her confrontation with Kim Woodburn on This Morning by Emma Dodds | 54 mins ago © Coleen Nolan & Kim Woodburn © Shutterstock They tried to make amends last week Coleen Nolan had a well-publicised feud with celebrity cleaner Kim Woodburn when they were in the Celebrity Big Brother house together in January 2017. However, their bad blood has spilled into real-life - and despite attempts to patch things up, Kim and Coleen are still at loggerheads over 18 months later. Last week, Kim appeared on Loose Women where Coleen is a panelist, in a segment in which the pair were set to attempt to clear the air - but it quickly descended into a slanging match and ended with Kim storming off the show. © Kim stormed off the show © Shutterstock After the show, Kim vowed to have Coleen and her sister Linda fired from the show, saying that they'd been \"vile\" to her after the appearance which has since drawn over 7,000 Ofcom complaints. Now, Coleen has done her first TV interview since the incident, speaking to Holly Willoughby and Phillip Schofield on This Morning about what she's dubbing \"the worst week of her life .\" Swipe through to see the most OUTRAGEOUS Celebrity Big Brother contestants EVER View Gallery 9 photos Channel 4 Jackie Stallone Perhaps the greatest entrance into CBB ever, Jackie Stallone was introduced as the queen of the house and iconically announced: \"Yeah, I'm Jackie .\" She then continued to act like royalty by calling Blazin Squad's Kenzie \"the little kid' because she forgot his name, demanding champagne and calling the house' a dump'. Her presence was hard for Brigitte Neilsen - ex wife of Jackie's son Sylvester Stallone - who nearly walked out on the night Jackie arrived. Jackie also hilariously told Big Brother to\" kiss my ass' in the Diary Room. Jackie: we bow down to you. 1 / 9 Channel 4 Jackie Stallone Perhaps the greatest entrance into CBB ever, Jackie Stallone was introduced as the queen of the house and iconically announced: \"Yeah, I'm Jackie .\" She then continued to act like royalty by calling Blazin Squad's Kenzie \"the little kid' because she forgot his name, demanding champagne and calling the house' a dump'. Her presence was hard for Brigitte Neilsen - ex wife of Jackie's son Sylvester Stallone - who nearly walked out on the night Jackie arrived. Jackie also hilariously told Big Brother to\" kiss my ass' in the Diary Room. Jackie: we bow down to you. Channel 4 Pete Burns Where do we even start with cross-dressing controversial 80s popstar Pete Burns? After boasting about his \"gorilla fur' coat, PETA got involved and made Big Brother confiscate it. Pete's response?:\" I want my effing coat back! \"It's also fair to say that he despised Jodie Marsh, who he reduced to tears on more than one occasion. He told Big Brother in the Diary Room:\" I wouldn't p ** s on her if she burst out in flames. \"OUCH. Pete passed away in 2016. Channel 4 Jade Goody It was the year of the Big Brother racism row which quickly became political and hit headlines on all the mainstream news channels and papers. Jade Goody, unfortunately, was leader of the pack with Danielle Lloyd and S Club 7's Jo O'Meara. The show received a record number of complaints after the group\" bullied' Bollywood star Shilpa Shetty and did impressions of her accent. Jade was the third to be evicted but because the controversy was so HUGE, no crowd was allowed to be present when she left the house. Jade sadly died of ovarian cancer in 2009, but her death helped raise awareness of smear tests among young women. Channel 4 Kim Woodburn Queen of clean (except from when it comes to what comes out of her mouth) Kim Woodburn made A LOT of enemies in the Big Brother house. She frequently quarrelled with Bianca Gascoigne and <mark>Nicola McLean</mark>, telling them to shut up and calling them bullies, cowards and bitches. But the BIG argument came when she had to be dragged away by security from <mark>Jamie O'Hara</mark> while shouting \"ADULTERER!\". She told Big Brother in the Diary Room that he was the type of scum you wash down the sink. We probably won't be booking her in to clean up our gaff anytime soon, TBH. Channel 4 Perez Hilton It takes a big character to get under Katie Hopkins' skin, and Perez Hilton fitted the bill perfectly. He went so far in arguments that he actually cracked Katie and was labelled a \"bully' by viewers. Some of his other attention-seeking moments included threatening Calum Best, comparing the experience in the house to serious illnesses and running around stripping. He clearly LOVED annoying people. Channel 4 Gemma Collins Ah, The GC had MANY an outrageous moment during her time in the CBB house. Her biggest feud seemed to be with the Big Brother system, refusing to take part in challenges and telling them she doesn't need the fee money to pay her mortgage (\"I'VE GOT MONEY!\" ). Other memorable moments include Gemma thinking she was pregnant, telling Gillian McKeith to F off down the phone and choosing to have a blow dry at the cost of her housemates missing out on hot water for the day. Channel 4 Megan McKenna Ex On The Beach's Megan McKenna screamed and shouted so much that we very nearly got tinnitus. Her most famous meltdown came when she nearly got into a physical fight with Tiffany Pollard. She also called <mark>John Partridge</mark> every name under the sun and cried: \"I've eaten gruel for that c ** t.\" It's almost admirable (and hilarious) how easily Megan can get hysterical over...well, nothing. Channel 4 Stephen Bear The Ex On The Beach star was either loved or loathed. Stephen's most, ahem, \"memorable' moments perhaps took place with romantic interest Chloe Khan. The pair put on quite a show in front of other contestants by dry humping in front of a window, and they made noises we'll never be able to un-hear when they got intimate in the shower. So it was a bit awkward when Stephen's girlfriend came in to confront him...Despite his Marmite character, Stephen went on to win the show. Channel 4 <mark>Stephanie Davis</mark> Hollyoaks star <mark>Stephanie Davis</mark> entered the most turbulent relationship EVER (well, probably) when she met Jeremy McConnell in the house. The pair weren't shy around each other and quickly got jiggy in between the sheets. Slight problem: <mark>Stephanie</mark> was already in a relationship outside the house. Daniella Westbrook and Gemma Collins took particular offence to <mark>Stephanie</mark>'s behaviour, which sparked arguments. In fact, Danielle said:\" I'd be happy not to breathe the same air as her again in my life. \"Oh dear oh dear."}, {"articleID": "2017100614_00540222_W", "names": {"Mike Chernoff": ["Q1176973", "Q21091663"], "Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"], "John Michael": ["Q16209656", "Q21556337", "Q6248613", "Q6248615"]}, "date": "2017-10-06", "url": "http://www.crainscleveland.com/article/20171006/blogs06/137961/trust-tito-reaches-new-level-after-bauers-game-1-gem", "content": "October 06, 2017 9:41 am \"Trust in Tito' reaches new level after Bauer's Game 1 gem Cleveland Cavaliers Cleveland Indians Kevin Kleps Radio Photo by Joe Sargent/MLB Photos Trevor Bauer threw 6 2/3 shutout innings against the Yankees in Game 1 of the American League Division Series on Thursday night, Oct. 5. Against a New York Yankees team that led MLB in home runs and was second in runs scored, Terry Francona picked his third-best starting pitcher for Game 1. Wait, what?\" Trust in Tito \"is now as much a part of the Northeast Ohio sports dialogue as\" Strive for greatness \"and (choose the phrase you most often yell at the TV during Browns games). But the Bauer move seemed as if the Tribe was getting a little too cute, considering the opponent and stakes. What the heck do we know? Bauer threw 6 2/3 shutout innings Thursday night in Game 1 of the American League Division Series, the Indians posted their sixth shutout victory in 16 postseason games dating back to last year, and Kluber will take the mound Friday night, when a win would put the Tribe one victory short of back-to-back ALCS appearances for the first time in 19 years. Basically, Thursday was a continuation of a theme that started last July, and hasn't really stopped. Francona, Chris Antonetti and <mark>Mike Chernoff</mark> can do almost no wrong--even in a sport that can be more odd than some of Bauer's past interview sessions. Since July 27, Bauer is 10-1 with a 2.23 ERA and 1.15 WHIP. He's allowing 8.2 hits and 2.1 walks per nine innings (down from his respective season norms of 9.2 and 3.1), and he's struck out 93 batters in 84 2/3 frames. In three starts against the Yankees in 2017, he's 3-0 with a 0.92 ERA and 19 Ks in 19 2/3 innings. He's yielding only 5.9 hits per nine against a lineup that also finished in the top five in MLB in on-base percentage, slugging and OPS. Thursday night, only four of the 23 batters Bauer faced reached base, and he faced only three over the minimum in recording 20 outs. He got a boost from an incredible catch by Jason Kipnis on a line drive to center field by Chase Headley to lead off the third inning. Kipnis, a two-time All-Star, was moved from second base to center for 11 regular-season games in another\" wait, what? \"move by Francona that now looks brilliant. And just as <mark>Andrew Miller</mark>--the Tribe's prized acquisition at the 2016 trade deadline--did last October, the front office's big summer move looked even better in Game 1. Jay Bruce--acquired from the Reds in August, after the Indians beat out the Yankees in the bidding because they, unlike the Bronx Bombers, were willing to take on the $4 million that remained on the outfielder's contract--doubled, homered and hit a sacrifice fly in his first three trips to the plate. Bruce was acquired for Ryder Ryan, a 30th-round draft pick by the Indians in 2016 who spent the entire 2017 campaign in Single-A. He's 22 and has a 4.07 ERA and 1.40 WHIP in two years down on the farm. Maybe Ryan will end up being an effective reliever. It doesn't matter, though. Bruce was the piece the banged-up Indians desperately needed at the time, and with Michael Brantley on the roster only as a pinch hitter, he's every bit as crucial in the postseason. Thursday night, it was as if every big decision was on display. And again, the Tribe's decision-makers hit it out of the park. Do you have MLB Network? Time to check Depending on your level of baseball fandom, you might not even be aware if you have the MLB Network. Well, unless you're going to be at Progressive Field or a bar early Friday night, you should check. Game 2 of the Indians-Yankees series is the second of two exclusive postseason broadcasts by MLB Network. Baseball's signature channel, as this Sports TV Ratings piece outlines, is in about 62.4 million homes. That's almost 23 million below FS1 (85.3 million) is 25.3 million fewer than ESPN (87.5 million). MLB sent out a news release this week that Thursday's Astros-Red Sox and Friday's Indians-Yankees games on MLB Network would also be available via free preview for customers of Armstrong, Cablevision (Optimum), Comcast (XFINITY), Cox, DISH, Fidelity, Frontier, Grande, GVTC, Mid-Hudson Cable, Norwood Light Broadband, RCN and Verizon FiOS. MLB partnered with those providers for an eight-day free preview that runs until Oct. 11. That, however, isn't enough to cover all of the fans whose providers don't have MLB Network. Again, we recommend you check, and soon. Cavs strike contract with iHeart just in time The Cavs and Lake Erie Monsters announced a radio deal with iHeartMedia Cleveland on Thursday, and it turns out, it really went down to the wire. The NBA team and the American Hockey League club struck multiyear agreements with iHeart, which means WTAM-AM, 1100, and WMMS-FM, 100.7, will remain the flagship stations of the Cavs. After the deal was made public, a source told Crain's that the previous agreement was expiring prior to the 2017-18 season. That's a moot point now, as the two Cleveland stations will power the 30-station Cavs Radio Network, which the release says\" reaches 38 states and half of Canada. \"It also means WMMS-HD2, 99.1 FM, remains the Monsters' radio home. The station will air all 76 regular-season broadcasts for the second consecutive year. The Cavs also announced that they reached an extension with Murray Hill Broadcasting's 87.7 FM La Mega to continue the team's Spanish radio broadcasts, which are led by play-by-play voice Rafael Hernandez Brito. This will be Year 7 with <mark>John Michael</mark> as the radio voice on the Cavs Radio Network, and Jim Chones will be in his eighth season as the color analyst. <mark>Mike</mark> Snyder, in Year 26, will anchor the pregame, halftime and postgame coverage."}, {"articleID": "2010032606_00105035_W", "names": {"Michael Hanna": ["Q16090306", "Q20876911", "Q27020822"]}, "date": "2010-03-26", "url": "http://boston.com/news/world/middleeast/articles/2010/03/26/iraqs_tight_race_brings_warnings_on_violence/", "content": "iraq's tight race brings warnings on violence by adam schreck associated press / march 26, 2010 e-mail this article to: invalid e-mail address add a personal message: (80 character limit) your e-mail: invalid e-mail address sending your article your article has been sent. e-mail | print | reprints | | text size - + baghdad - iraqi election results today will probably show a virtual tie between the two top vote-getting blocs led by the prime minister and his chief rival, a political equation that could add up to bitter political wrangling and risk reigniting violence. prime minister nouri al-maliki, a shi'ite who enjoys wide support with the shi'ite majority, is neck and neck with former prime minister ayad allawi, who is popular with iraq's sunni minority. if neither camp emerges with a clear mandate, many fear a drawn-out political debate to form a government could spill over into violence and complicate american efforts to speed up troop withdrawals in the coming months. interior minister jawad al-bolani, himself a candidate, called on iraq's electoral commission to hold off releasing the tally today because he fears the political rivalries could erupt into violence. that concern has been echoed by many members of maliki's state of law coalition, who say they fear the shi'ite majority could react in outrage if they feel the results aren't what they expect. such pronouncements are likely to reflect political posturing. election officials have dismissed calls for a further delay or a recount of the returns from the march 7 vote. many iraqis fear a return to violence between the sunni and shi'ite factions amid the horse-trading that will ramp up in earnest once all of the results are made public. maliki's coalition has drawn much of its support from the shi'ite majority, and his attempts to appeal to sunnis were undercut by his support for a ban on many sunni candidates for alleged ties to saddam hussein's regime. the sunnis largely threw their support behind allawi's iraqiya bloc, which although headed by a shi'ite, has billed itself as secular. iraq's kurdish faction sees itself as a key electoral kingmaker, though followers of radical anti-us shi'ite cleric moqtada al-sadr could also play a pivotal role after garnering a significant number of seats. \"everybody's talking to everybody,\" said <mark>michael hanna</mark>, an iraq analyst with the century foundation. \"none of these governments make a whole lot of sense in terms of consistent ideologies...it's all about wielding power .\" © copyright 2010 globe newspaper company."}, {"articleID": "2015022506_00008121_W", "names": {"Joseph Kahn": ["Q1363428", "Q6284490"]}, "date": "2015-02-25", "url": "http://mashable.com/2015/02/25/power-rangers-film-reaction", "content": "LOS ANGELES - Jason David Frank, who was cast as Tommy Oliver a.k.a. the original Green Ranger for the Power Rangers series in 1993, reacted unfavorably to Tuesday's release of a twisted 14-minute short film based on the Power Rangers franchise. In the POWER/RANGERS film - created and fully funded by prominent music video director <mark>Joseph Kahn</mark> (he recently directed Taylor Swift's \"Blank Space\" video) - James Van Der Beek as Red Ranger Jason interrogates Katee Sackhoff as Pink Ranger Kimberly before Green Ranger Tommy appears to face off against Jason. \"I'm just a PG-13 guy - like the cuss words, the drugs, all this other stuff doesn't fly with me,\" Frank, now 41, said in a reaction video on Facebook (below). \"You can't take a brand like this and reboot it so dark and gritty...you still have the kids who want to watch Power Rangers...we have to be responsible and know this is still a kids brand .\" Though not affiliated with Power Rangers rightsowner Saban Brands, this short film is one of darkest, if not the darkest, adaptations of our colorful defenders of Earth. JASON DAVID FRANK - Official Fan Page. For the uninitiated, the Power Rangers are high school students who are given superpowers to defeat bad guys from destroying Earth. The TV series from 1993 has since catapulted into an international brand fueled by clothes, games, comic books and toys. But <mark>Kahn</mark>'s morbid version, with a cackling twist at the end, puts the Power Rangers in more grown-up situations filled with drugs, murder and mysterious connections. Lionsgate and Saban Brands, which owns the rights to the Mighty Morphin Power Ranger s franchise, plan to \"re-envision\" the fighters of evil for the silver screen in <mark>Kahn</mark> is facing pressure from Saban Brands to take down his short film, which has already been removed from Vimeo. A tamer version (above) remains on YouTube at the time of this writing. \"Y' all better watch the shit out of POWER/RANGERS. No idea how long it'll be up. Going to bed. Goodnight,\" <mark>Kahn</mark> Vimeo took down my NSFW POWER/RANGERS short. Hope you guys downloaded it. The SFW version is still on Youtube: my POWER/RANGERS short you took down is protected under fair/use/free speech/satire. If anyone wants to see it, holla at Everyone is noticing you took down the short but youtube didn't. Tons of fan films exist online. Free speech/fair use. Every image in POWER/RANGERS is original footage. Nothing was pre-existing. There is no copyrighted footage in the short. I am not making any money on it and I refuse to accept any from anyone. It was not even kickstarted, I paid for it myself. This was made to be given away for free. It is just as if I drew a pic of Power Rangers on a napkin and I gave it to my friend. Is it illegal to give pic I drew of a character on a napkin to someone for free? No. . The world is watching your actions right now. If you are going to brand yourself as a place for filmmakers and shorts, then protect. Otherwise, we all go elsewhere. Soon. Saban is trying to shut POWER/RANGERS down. If you'd like to keep watching, tell them to stop harassing me Y' all better watch the shit out of POWER/RANGERS. No idea how long it'll be up. Going to bed. Goodnight. Can't sleep. 1.1 million views on youtube for POWER/RANGERS so far, plus 300k in vimeo views iced hours ago. Holy. Shit. Download POWER/RANGERS if you can. It's free. Take it. Hurry up. 3 million views now. wut wut wut wu t - <mark>Joseph Kahn</mark> (@ JosephKahn) February 25, 2015 Aside from directing Swift's \"Blank Space,\" <mark>Kahn</mark> has helmed music videos for Madonna, Rihanna, Lady Gaga, Britney Spears, Janet Jackson and many more big-name artists. He also directed the films It's Morphin' Time: 10 Things You Didn't Know About Power Rangers 10 Things You May Not Know About The Power Rangers 1. The American writers had to build plot lines around action sequences from the Japanese series. In the early days, English writers had no idea what was going on in the show and built plots around action scenes that were sent to them from the Japanese production. In the 1970s, the Japanese Toei Company produced a television show based on Marvel's Spider-Man comics. 3. Power Rangers were banned until 2011 in New Zealand. In 1994, the New Zealand Broadcasting Standards Authority (BSA) removed the show from the air due to the number of complaints from concerned parents who were thought the show taught kids to solve their problems with violence. 4. The show is heavily edited for Malaysian TV because censors think it will get kids addicted to drugs. Malaysian censors think \"Morphin\" is too close to \"morphine\". Bryan Cranston did some voice acting in the early 90s. 6. The character Tommy Oliver has been six different types of Ranger. The Green Ranger, White Ranger, White Ninja Ranger, Red Zeo Ranger, Red Turbo Ranger and the Black Dino Thunder Ranger. 7. In the original Japanese series, the Yellow Ranger is a man. This is why the Pink Ranger has a skirt and the Yellow Ranger doesn't. 8. The original Black Ranger has only four fingers on one hand. Actor Walter Emanuel Jones lost one of his fingers in a childhood accident. 9. The original Blue Ranger quit the show due to harassment. 10. Power Rangers has been on the air for 20 years. That's 20 action packed seasons and more than 700 episodes. is a leading source for news, information and resources for the Connected Generation. Mashable reports on the importance of digital innovation and how it empowers and inspires people around the world. Mashable's record 42 million unique visitors worldwide and 21 million social media followers are one of the most influential and engaged online communities. Founded in 2005, Mashable is headquartered in New York City with an office in San Francisco."}]