[{"articleID": "2013091822_00097126_W", "names": {"Tony Perkins": ["Q16193791", "Q5135408"], "Patrick Kennedy": ["Q16105663", "Q17541361", "Q247915", "Q7146936", "Q7146939"]}, "date": "2013-09-18", "url": "http://www.salon.com/2013/09/18/gop_deludes_itself_on_shutdown_threat/", "content": "Mitch McConnell, John Boehner, Eric Cantor There's a tendency on the right - I don't know if it's delusion or a subtle psychological operation - to speak as if Republicans control the House of Representatives by a wide majority, and that bills supported by 218 Republicans will be viable in the Senate and possibly signed by the president. \"We have a real chance of getting defund or delay of Obamacare,\" said conservative Rep. Steve Scalise, R-La. wrote that the recent turbulence over Obamacare is a result of the fact that \"Republican leaders are struggling mightily to come up with [government funding] legislation that can pass the House .\" If either of these statements were true, it would be huge news that House Republicans are veering further right, and giving hardliners in the party a vote on a bill that actually ties funding for the government to defunding the health care law. But they're both false. Here are the odds that Scalise and his colleagues will defund or delay Obamacare. Costa's so in the thick of the GOP's internal debate he elided the obvious point that \"passing the House\" doesn't equal winning 218 Republican votes. Plenty of reasonable stuff can pass the House above and beyond a simple bill extending funding for the government, once it gets a vote. Put those irreducible facts together, and it's easier to remember that what we're hearing on the right is the din of 275 Republicans and thousands of movement conservatives caterwauling at each other. It's a fascinating story. It's genuinely newsworthy that John Boehner and company were cowed into giving Ted Cruz and his boosters on the right a vote on the doomed strategy they've been demanding. Assuming the defund Obamacare bill passes the House - not a given! - it'll be extremely revealing to watch Senate Republicans figure out what to do with it, and hear what they say when it inevitably fails. But at the end of the day, it's really just a subplot in the ongoing saga of the GOP's devolution since 2006 or so. It's an internal bluff calling, intended to both placate conservative House members, and prove to others that their strategies aren't workable. Once that happens, then Congress can get on with the entirely separate and much simpler business of funding the government. Boehner's already copped to this! If he's able to placate enough Republicans along the way, they might even walk away with a substantial win. In a way this is actually good news. The debt limit will likely be increased through a similar process of internal deleveraging. But when the news broke, a lot of news outlets treated it like an escalation. The odds of a shutdown just increased, according to the political media. The only reason to believe that, though, is that all this whipsawing takes time. Is it possible there just aren't enough days on the calendar for Congress to pass a spending bill before the government shuts down? Perhaps. I continue to think it's unlikely. Twelve days is an eternity on Capitol Hill when leaders get down to brass tacks. Even if I'm wrong, though, and there's a brief lapse in funding for the government, it'll be an error of timing, not of broader legislative strategy. GOP leaders are still working toward a much different set of objectives than their conservative antagonists, or than Newt Gingrich was in 1995. National Review might have forgotten about the 200-plus Democrats in the House, but John Boehner has not. Industry puppets spew obscene lies while people drown Finally! Alabama ends segregated sororities after public shaming Republicans ramp up war on poor people Diane Ravitch: Testing and vouchers hurt our schools. Here's what works \"I scared the crap out of them!\" : Alan Grayson details how to work with the GOP Help, we're drowning!: Please pay attention to our disaster Cutbacks to the stimulus hang over Fed meeting FLOTUS wants you to drink more water Yellen seen as likely Fed nominee after Summers exit Ken Cuccinelli supporter tells Jewish joke at rally Census bureau: Women earn $11,500 less than men annually <mark>Tony Perkins</mark>: Being fair to gay soldiers is unfair to straight soldiers! New York Times legitimizes anti-choice propaganda Why I'm not returning to Zuccotti Park today Gun nuts peddle gruesome lies in face of tragedy Brazil threatens Facebook, Google over Snowden Leak Lone suspect in Navy yard rampage had history of gun arrests Ted Cruz's nightmare: Obamacare helps people! Colorado floods Residents of an apartment house work to divert flood water from their building in Boulder, Colo., on Thursday, Sept. 12, 2013. brandash/Instagram Colorado floods Colorado floods A man begins cleaning up Canon Avenue in Manitou Springs, Colo. after a flash flood burst through a manhole and sent water rushing down the streets Thursday, Sept. 12, 2013. Colorado floods A couple plays in flood water at Utah Park in Aurora, Colo., on Thursday, Sept. 12, 2013. ekohlfeld/Instragram Colorado floods \"Meanwhile in boulder - it's flooding so we are going to tube down the streets\" wrote Instagram user ekohlfeld. jvaleski/Instagram Colorado floods Colorado floods This image provided by Jason Stillman, shows flooding in Lyons Colo., Thursday Sept. 12, 2013. Boulder County Sheriff Joe Pelle said the town of Lyons was completely cut off because of flooded roads. krbsmith211/Instagram Colorado floods Instagram user krbsmith211 captioned this photo: \"so this used to be lyons\". Colorado floods This image provided by Jason Stillman, shows flooding in Lyons Colo., Thursday Sept. 12, 2013. Boulder County Sheriff Joe Pelle said the town of Lyons was completely cut off because of flooded roads. Colorado floods Residents of a neighborhood on the northern side of Boulder, Colo., work to divert floodwaters away from their homes on Thursday, Sept. 12, 2013. Autorities say flooding in the area has washed out roads, left rural communities isolated and is responsible for at least three deaths. myohmyemily/Instagram Colorado floods \"Well there goes my running path. Thanks, #Boulderflood\" wrote Instagram user myohmyemily. raulfox31/Instagram Colorado floods Obama Calls On CEOs To Help Avoid Debt Ceiling Battle With Republicans OMG, You Guys, Allison Janney Did \"The Jackal' On Arsenio...Everything Is Going To Be Ok! Under Secretary <mark>Patrick Kennedy</mark> and His\" Expeditionary Diplomacy' in Benghazi New Hampshire Senate Candidate: More Women In The Workplace Led To More Mass Shootings Rand Paul's Mom Says He Won't Announce Presidential Decision Until \"After 2014\" Young Members Of Congress Team Up To Create \"Future Caucus\" Torturing Animals At These Places Isn't Illegal, But It Is Illegal To Film It Patton Oswalt's Tale Of Catastrophic Failure Is Hilarious. And Surprisingly Inspiring. One Of The Best Comebacks I've Ever Heard Was Made In A Single Word Why Is One Fast Food Restaurant Paying Double The Minimum Wage? Copyright? 2013 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON? is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. ."}, {"articleID": "2019021016_00201137_W", "names": {"Jerry Anderson": ["Q14950481", "Q16096792", "Q6183201"]}, "date": "2019-02-10", "url": "https://www.kansas.com/news/business/article226062840.html#storylink=rss", "content": "Some Alaska lawmakers say new ethics rules are too limiting | The Wichita Eagle Some Alaska lawmakers say new ethics rules are too limiting By BECKY BOHRER Associated Press ORDER REPRINT → February 10, 2019 10:02 AM In this Feb. 5, 2019, photo Alaska state Sen. Shelley Hughes poses in her office in Juneau, Alaska. Hughes is among the state legislators who have raised concerns with new ethics rules they see as too restrictive. Becky Bohrer AP Photo In this Feb. 5, 2019, photo Alaska state Sen. Shelley Hughes poses in her office in Juneau, Alaska. Hughes is among the state legislators who have raised concerns with new ethics rules they see as too restrictive. Becky Bohrer AP Photo JUNEAU, Alaska Alaska state Sen. Shelley Hughes withdrew a health care bill she's been working on for more than two years and declined meetings on health care policy to avoid running afoul of new ethics rules she and other lawmakers see as too restrictive. The ethics law passed last year details circumstances under which a lawmaker would have a conflict and limits what action the lawmaker can take if he or she has one. Under the legislative ethics committee's interpretation of the law, legislators can participate in committee and floor debate and vote on bills where they have conflicts, as long as they declare those conflicts. But they can't have similar discussions in private with fellow lawmakers or anyone else. The bill's sponsor said that goes far beyond his original intent, and he and others are looking at possible changes. Sign Up and Save SUBSCRIBE WITH GOOGLE #ReadLocal The law bars legislators from taking or withholding official action or exerting official influence that could substantially hurt or help the financial interests of an immediate family member; the employer of a lawmaker or their immediate family; someone with whom a lawmaker is seeking employment; or someone from whom the lawmaker or an immediate family member has made more than $10,000 over the prior 12 months. The definition used by the Select Committee on Legislative Ethics for \"official action\" is broad, including development, sponsorship, advocacy of or opposition to a law, amendment, resolution or other matter affected by legislative action or inaction. Hughes said the law prevents her from discussing health care policy with her husband, a physician assistant. In a speech to colleagues, Hughes said she withdrew her bill aimed at lowering health care costs because her husband and the clinic where he works could be financially harmed by it, and that was seen as a conflict. Ethics laws should keep lawmakers from manipulating the system for their own gain, Hughes said. \"But when the law prevents us from drawing from our own experience...and from the knowledge that we gain from living with the people we love, it needs to be fixed,\" the Palmer Republican said. \"When the law prevents us from working in the best interests of the people we serve...to address the problems they face, the law needs to be fixed .\" Lawmakers with conflicts can have general discussions in private that avoid specifics of pending legislation or that aren't used to develop legislation related to their conflict, legislative ethics committee administrator <mark>Jerry Anderson</mark> said. But, some lawmakers worry, if the seed for an eventual bill is sown during a general conversation, could that be a violation? That's a realistic concern, <mark>Anderson</mark> said. Senate Majority Leader Mia Costello said legislators are erring on the side of caution and in some cases declining meetings. The state does not have a full-time Legislature. Some lawmakers have other jobs, including attorneys, fishermen and a doctor. Some also have working spouses. Costello is an Anchorage Republican who flies, is married to a commercial pilot and represents a district that holds Alaska's largest commercial airport. In a floor speech, she said she intended to introduce a bill that would have given the Legislature approval of certain aviation-related fees, but didn't because of the new law. \"Everything we do, we're wondering, can I do that? Can I talk to this person?\" Costello said in an interview, adding later: \"We don't want to overreact, either. I don't think we are doing anything but trying to figure out right now what this actually means .\" Former Rep. Jason Grenn, who sponsored the ethics law, said he intended for it to force legislators to be more public about potential conflicts in committees and on the House or Senate floor--and didn't intend to delve into private meetings. \"When it comes to private discussions, you have to have some level of trust with our elected officials,\" Grenn said. The ethics committee's interpretation acts to \"kind of kick common sense out the door,\" the Anchorage independent said. He lost his re-election bid in November but said he's spoken with current legislators about possible revisions. Grenn said the aim was public transparency, not trying to address any potential corruption that other laws or rules already address. Senate Democratic Leader Tom Begich, who serves on the ethics committee, cautioned against \"over-interpreting\" the new law and said legislators with questions can check with <mark>Anderson</mark>'s office. Begich is open to changes that clarify the law but not a wholesale rewrite. The Legislature needs to find the right language \"to ensure that we protect the right of the public to have legislators with integrity on one hand and on the other hand protect the right of the public to have access to the expertise of the people they elect,\" he said. \"That, believe me, is a fine line, and we must find it .\" "}, {"articleID": "2019020910_00266474_W", "names": {"Bruce Hill": ["Q14951084", "Q4209690", "Q4977656"]}, "date": "2019-02-08", "url": "http://www.presstelegram.com/2019/02/08/1-7-tons-of-meth-bound-for-australia-seized-from-ports-of-l-a-and-long-beach-in-record-setting-operation-authorities-say/?fbclid=iwar10zg8pydrl5s8iluig4v1e7vasul8kbtcu8epdlqo3qurxfunp7mlkp-4", "content": "By Megan Barnes | mbarnes @ scng.com | Long Beach Press-Telegram PUBLISHED: February 8, 2019 at 3:21 pm | UPDATED: February 8, 2019 at 4:16 pm This photo provided by U.S. Customs and Border Protection shows an officer extracting methamphetamine from a loudspeaker on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) This photo provided by U.S. Customs and Border Protection shows loudspeakers that contained methamphetamine on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) This photo provided by U.S. Customs and Border Protection shows an officer extracting methamphetamine from a loudspeaker on Jan. 11, 2019 at the Los Angeles-Long Beach seaport. Australian police arrested six people after what authorities said Friday, Feb. 8, 2019 was the largest single seizure of methamphetamine in the United States and the biggest drug haul bound for Australia. U.S. Customs and Border Protection said 1,728 kilograms (3,800 pounds) of the drug were seized mid-January at the Los Angeles-Long Beach port complex along with smaller amounts of cocaine and heroin. (U.S. Customs and Border Protection via AP) Sound The gallery will resume in seconds A U.S. Homeland Security Investigations agent works to open a metal box containing hidden drugs that was part of a shipment of 1.7 tons of methamphetamine bound for Australia and seized at the twin ports of Los Angeles and Long Beach in January 2019. (Photo courtesy U.S. Immigration and Customs Enforcement) Authorities say 1.7 tons of methamphetamine bound for Australia was concealed in this shipment marked as loudspeakers and intercepted at the twin ports of Los Angeles and Long Beach in January 2019. (Photo courtesy Australian Federal Police) Show Caption of Expand Six people were arrested this week in connection with the planned shipment of nearly two tons of drugs bound for Australia that was intercepted at the twin ports complex of Los Angeles and Long Beach--in the largest-ever domestic seizure of methamphetamine, authorities said. The 3,810 pounds of meth was hidden with 56 pounds of cocaine and nearly 12 pounds of heroin in a shipment of loudspeakers seized in mid-January, according to U.S. Immigration and Customs Enforcement. The joint operation by U.S. and Australian authorities began when Australian agents found out about a massive planned shipment of narcotics and alerted Homeland Security Investigations, officials said. The drugs were concealed in dozens of metal boxes in two containers marked \"Single Loud Speakers\" that were targeted for inspection by U.S. Customs and Border Protection officers. They had yet to be loaded onto a ship. Australian Federal Police estimated the meth had a street value of $1.29 billion, or 17 million \"hits .\" Two Americans--a 52-year-old man and a 46-year-old woman--and four Australians allegedly involved in a drug-smuggling operation behind the shipment were apprehended in Victoria and New South Wales, Australian officials said. Authorities found more meth and \"hundreds of thousands of dollars of proceeds of crime,\" during a raid in Woodstock, a suburb of Melbourne where the Americans were arrested, they said. Three of the suspects were set to appear in court in Melbourne on Friday. If convicted of the drug charges, they each face up to life in prison. All are being prosecuted by the Australian court system. Officials heralded the effort as a major blow to the transnational crime syndicate. \"Along with our law-enforcement partners here and around the world, we continue in a day-to-day battle against the blight of methamphetamine that continues to devastate our communities,\" Joseph Macias, special agent in charge of Homeland Security Investigations in Los Angeles, said in a statement. \"We are keeping this dangerous contraband from reaching our streets and potentially saving lives .\" <mark>Bruce Hill</mark>, assistant commissioner with the Australian Federal Police, said \"by stopping this, we have ensured criminals will not profit from the immense pain these drugs would have caused our community .\" Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter RSS"}, {"articleID": "2018111420_00099448_W", "names": {"Michael Griffin": ["Q16223638", "Q25352626", "Q42245847"]}, "date": "2018-10-17", "url": "http://defenseone.com/technology/2018/10/chinas-moon-missions-could-threaten-us-satellites-pentagon/152084/?oref=d-dontmiss", "content": "China's Moon Missions Could Threaten US Satellites: Pentagon By Patrick Tucker Technology Editor Read bio October 16, 2018 Topics China Space BOEING A A Font size + Print A concept of an orbital moon station from Boeing. Facebook Twitter LinkedIn Email this article By Patrick Tucker Technology Editor Read bio October 16, 2018 A satellite on the far side of the moon might not be quite what the Chinese say, Air Force official warns. China's lunar probes may one day threaten critical U.S. satellites, said one of the military's top experts on space threats. \"We've seen [reports] in open press...that say the Chinese have a relay satellite flying around...the flipside of the moon. That's very telling to us,\" Jeff Gossel, the senior intelligence engineer in the Space and Missile Analysis Group at the Air Force's National Air and Space Intelligence Center, said at an Air Force Association event on Friday. In May, China launched the Chang' e 4 lunar relay satellite on an unusual trajectory: a lunar swing-by that pulled the satellite in a wide arc before settling it into a \"parking orbit\" at Lagrangian 2 on the moon's far side. The Chinese government has said the mission is part of a four-stage plan to build a moon base. \"We hope to start the construction of the [robot-manned] lunar base around 2025 and realize a manned landing on the moon around 2030,\" Zhao Xiaojin of the China Aerospace Science and Technology Group told Xinhuanet in March. Subscribe Receive daily email updates: Subscribe to the Defense One daily. Be the first to receive updates. But Gossel said putting a satellite at L2 could also enable Chinese attack spacecraft to zoom past the moon--about a quarter-million miles away--and then sneak up on critical U.S. intelligence and communications satellites in geosynchronous orbit, just 28,300 miles up--as occurred in the 2011 apocalypse-themed film \"Melancholia .\" A dipiction of a lunar swing-by trajectory, courtesy of NASA \"You could fly some sort of a weapon around the moon and it comes back--it could literally come at [objects] in GEO...and we would never know because there is nothing watching in that direction,\" he said. \"Why do you need a relay satellite flying around L2? So you can communicate with something that's going to land on the other side of the moon--or so you can fly around the other side of the moon? And what would that mean for our assets at GEO?\" <mark>Michael Griffin</mark>, defense undersecretary for research and engineering, has been pushing for a more robust response to threats against U.S. assets in space. It's one reason he and others want to move away from big, easily targetable satellites in GEO toward large constellations of small, cheap ones in low-earth orbit. \"China and Russia now have the capability to go after\" intelligence and communications satellites in GEO, <mark>Griffin</mark> told reporters in August. \"Those assets are what we use for communication and reconnaissance and missile warning and position, timing and navigation, a whole bunch of features that we use for war fighting .\" Gossel said that the actual threat from lunar satellites like the Chang' e 4 is very small--but that it's his job to be a bit \"paranoid\" and seriously think about even highly unlikely threat scenarios. Brian Weeden, who directs program planning at the Secure World Foundation, argued that the possibility was too low to constitute a significant threat. \"I think speculating about military applications for China's lunar program is akin to Soviet concerns about the Space Shuttle being a potential weapon,\" Weeden said. \"There is a grain of truth behind the Shuttle being a space weapon and the Chinese lunar program having possible military applications. Doesn't mean either is reality, though .\" Still, Gossel said, the national-security community's interest in China's lunar activities is \"building steam .\" Stephen Kitay, deputy assistant defense secretary for space policy, as well as the office of the Director of National Intelligence have \"an interest in it,\" he said. \"That's where I come into play .\" Paulina Glass contributed to this post. Patrick Tucker is technology editor for Defense One. He's also the author of The Naked Future: What Happens in a World That Anticipates Your Every Move? (Current, 2014). Previously, Tucker was deputy editor for The Futurist for nine years. Tucker has written about emerging technology in Slate,...Full bio Facebook Twitter LinkedIn Email this article"}, {"articleID": "2011100723_00016994_W", "names": {"Charles Taylor": ["Q311757", "Q49090", "Q5082865", "Q5082866"]}, "date": "2011-10-08", "url": "http://news.scotsman.com/news/Nobel-Peace-Prize-is-awarded.6849635.jp", "content": "africa's first democratically elected female president, a liberian campaigner against rape and a woman who stood up to yemen's autocratic regime were jointly awarded the nobel peace prize yesterday in recognition of the importance of women's rights in the spread of global peace. the award was split three ways between liberian president ellen johnson sirleaf, women's rights activist leymah gbowee from the same african country and democracy activist tawakkul karman of yemen - the first arab woman to win the prize. the cha advertisement irman of the norwegian nobel committee, thorbj? rn jagland, said that ms karman's award should be seen as a signal that both women and islam have important roles to play in the arab spring, the wave of anti-authoritarian revolts that have challenged rulers across the arab world. \"the arab spring cannot be successful without including the women in it,\" he said. yemen is an extremely conservative society but a feature of the revolt there has been a prominent role for women who turned out for protests in large numbers. the uprising has, however, been one of the least successful, failing to unseat president ali abdullah saleh as the country descends into failed state status and armed groups take increasingly important roles. in libya's and syria's uprisings, women have been largely absent. while there were many women protesters in egypt's revolution, few had key leadership positions. profiles of the nobel peace prize winners leymah gbowee: mobilised women across ethnic and religious divides to help bring an end to the war in liberia and ensure women's participation in elections. since 2006, she has been executive director of women in peace and security network africa, which promotes peace, literacy, and electoral politics. ellen johnson sirleaf: earned the nickname \"iron lady\" by challenging warlord <mark>charles taylor</mark> for the presidency in 1997 during liberia's civil war. won the 2005 presidential election and became africa's first elected female head of state in january 2006, vowing to create a \"government of inclusion\". tawwakul karman: played a leading part in the struggle for women's rights in yemen. vowed in february to galvanise a youth-led uprising against president ali abdullah saleh, who has ruled yemen for 33 years. by thorbj? rn jagland on 23 january, ms karman was arrested at her home. after widespread protests against her detention - it is rare for yemen women to be taken to jail - she was released early the next day. she has been dubbed \"iron woman,\" the mother of revolution \"and\" the spirit of the yemeni revolution \"by fellow protesters. no woman had won the prize since 2004, when the committee recognised wangari maathai of kenya, who died last month at 71. that was also the last year the prize went to an african. liberia was ravaged by civil wars for years until 2003. the drawn-out conflict that began in 1989 left about 200,000 people dead and displaced half the country's population of 3 million. ms sirleaf, 72, became africa's first democratically elected female leader in 2005. she was seen as a reformer and peacemaker in liberia when she took office. she is running for re-election on tuesday and opponents in the presidential campaign have accused her of buying votes and using government funds to campaign - a charge her camp denies .\" this gives me a stronger commitment to work for reconciliation, \"she said yesterday."}, {"articleID": "2015041307_00026710_W", "names": {"Michael Bauer": ["Q1282419", "Q13194754", "Q21091340", "Q23559839", "Q3313220", "Q43127233", "Q50638837", "Q52833454", "Q55688645", "Q56953337", "Q6828496"], "Thomas Lee": ["Q49764058", "Q53953082", "Q54556224", "Q54557092", "Q54635300", "Q57434756", "Q7791777", "Q7791780", "Q9031661"], "Ryan Reynolds": ["Q192682", "Q7384463"]}, "date": "2015-04-13", "url": "http://www.sfgate.com/news/crime/article/Police-seek-arrest-of-mother-of-disabled-man-left-6195571.php", "content": "Contact SFGate visit | Home-Contact SFGate | navigation-www | 1 Contact SFGate visit | Home-Contact SFGate | navigation-www | 1 visit | Home-Contact SFGate-Customer Support | navigation-www | 2 Submissions & Tips visit | Home-Contact SFGate-Submissions & Tips | navigation-www | 3 About SFGate visit | Home-About SFGate | navigation-www | 2 About SFGate visit | Home-About SFGate | navigation-www | 2 Register on SFGate visit | Home-About SFGate-Register on SFGate | navigation-www | 3 SFGate Newsletters visit | Home-About SFGate-SFGate Newsletters | navigation-www | 4 visit | Home-About SFGate-SFGate Staff | navigation-www | 5 Careers visit | Home-About SFGate-Careers | navigation-www | 6 Hearst visit | Home-About SFGate-Hearst | navigation-www | 7 About SF Chronicle visit | Home-About SF Chronicle | navigation-www | 3 About SF Chronicle visit | Home-About SF Chronicle | navigation-www | 3 SF Chronicle Staff visit | Home-About SF Chronicle-SF Chronicle Staff | navigation-www | 2 Become a Subscriber visit | Home-About SF Chronicle-Become a Subscriber | navigation-www | 3 Manage Your Subscription visit | Home-About SF Chronicle-Manage Your Subscription | navigation-www | 4 SF Chronicle Delivery visit | Home-About SF Chronicle-SF Chronicle Delivery | navigation-www | 5 E-Edition visit | Home-About SF Chronicle-E-Edition | navigation-www | 6 Back Copies visit | Home-About SF Chronicle-Back Copies | navigation-www | 7 Chron in Education visit | Home-About SF Chronicle-Chron in Education | navigation-www | 8 Corrections visit | Home-About SF Chronicle-Corrections | navigation-www | 9 Advertise with us visit | Home-Advertise with us | navigation-www | 4 Advertise with us visit | Home-Advertise with us | navigation-www | 4 Media Kit visit | Home-Advertise with us-Media Kit | navigation-www | 2 Place a Classified Ad visit | Home-Advertise with us-Place a Classified Ad | navigation-www | 3 About Our Ads visit | Home-Advertise with us-About Our Ads | navigation-www | 4 Public Notices visit | Home-Advertise with us-Public Notices | navigation-www | 5 Local Business Directory visit | Home-Advertise with us-Local Business Directory | navigation-www | 6 Careers visit | Home-Careers | navigation-www | 5 Store visit | Home-Store | navigation-www | 6 Privacy policy visit | Home-Privacy policy | navigation-www | 7 Privacy policy visit | Home-Privacy policy | navigation-www | 7 Ad Choices visit | Home-Privacy policy-Ad Choices | navigation-www | 2 Your CA Privacy Rights visit | Home-Your CA Privacy Rights | navigation-www | 8 Terms of Use visit | Home-Terms of Use | navigation-www | 9 Site Index visit | Home-Site Index | navigation-www | 10 Newsletters visit | Home-Newsletters | navigation-www | 11 Get news alerts visit | Home-Get news alerts | navigation-www | 12 Get VIP access with SF Chronicle Membership Get SFGate newsletters for the latest from the Bay Bay Area & State visit | News-Bay Area & State | navigation-www | 1 Traffic visit | News-Traffic | navigation-www | 2 Nation visit | News-Nation | navigation-www | 3 World visit | News-World | navigation-www | 4 Politics visit | News-Politics | navigation-www | 5 Crime visit | News-Crime | navigation-www | 6 Tech visit | News-Tech | navigation-www | 7 Obituaries visit | News-Obituaries | navigation-www | 8 Opinion visit | News-Opinion | navigation-www | 9 You visit | News-You | navigation-www | 10 Health visit | News-Health | navigation-www | 11 Education visit | News-Education | navigation-www | 12 Video visit | News-Video | navigation-www | 13 News Blogs visit | News-News Blogs | navigation-www | 14 Lifelong Learning visit | News-Lifelong Learning | navigation-www | 15 Black man killed by white Oklahoma deputy in Taser error Hillary Clinton? Yes, she's running for president Man held in slaying of his daughter's mother 49ers visit | Sports-49ers | navigation-www | 1 Raiders visit | Sports-Raiders | navigation-www | 2 Giants visit | Sports-Giants | navigation-www | 3 Giants Fandom visit | Sports-Giants Fandom | navigation-www | 4 A's visit | Sports-A's | navigation-www | 5 Warriors visit | Sports-Warriors | navigation-www | 6 Sharks visit | Sports-Sharks | navigation-www | 7 Sports Blogs visit | Sports-Sports Blogs | navigation-www | 8 Sports Calendar visit | Sports-Sports Calendar | navigation-www | 9 MLB visit | Sports-MLB | navigation-www | 10 NBA visit | Sports-NBA | navigation-www | 11 College visit | Sports-College | navigation-www | 12 Preps visit | Sports-Preps | navigation-www | 13 Golf visit | Sports-Golf | navigation-www | 14 Outdoors visit | Sports-Outdoors | navigation-www | 15 Justin Suh, Sara Banke win S.F. City Golf titles visit | article-6195478 | Sports-nav-hcat | 1 Mickelson hopes to build on 2nd-place finish at Masters visit | article-6195499 | Sports-nav-hcat | 2 A's loss to Mariners caps week of extreme highs and lows visit | article-6195198 | Sports-nav-hcat | 3 Jordan Spieth wins Masters at record-tying 18-under Technology visit | Business-Technology | navigation-www | 1 Finance visit | Business-Finance | navigation-www | 2 Innovation visit | Business-Innovation | navigation-www | 3 Mortgage Rates visit | Business-Mortgage Rates | navigation-www | 4 Home Guides visit | Business-Home Guides | navigation-www | 5 Public Notices visit | Business-Public Notices | navigation-www | 6 Sponsored Content visit | Business-Sponsored Content | navigation-www | 7 Office Space visit | Business-Office Space | navigation-www | 8 The Tech Chronicles visit | Business-The Tech Chronicles | navigation-www | 9 Net Worth visit | Business-Net Worth | navigation-www | 10 Fossils & Photons visit | Business-Fossils & Photons | navigation-www | 11 Mind Your Business visit | Business-Mind Your Business | navigation-www | 12 S.F. tech scene unplugs, gets down at Daybreaker visit | article-6189977 | Business-nav-hcat | 1 LinkedIn buying online learning company Lynda.com visit | article-6190062 | Business-nav-hcat | 2 Apple Watch developers create apps for gadget they've never visit | article-6190387 | Business-nav-hcat | 3 Apple fans get to touch - but not take home - the Watch The Daily Dish visit | A & E - The Daily Dish | navigation-www | 1 Movies visit | A & E - Movies | navigation-www | 2 Music & Nightlife visit | A & E - Music & Nightlife | navigation-www | 3 Performance visit | A & E - Performance | navigation-www | 4 Art visit | A & E - Art | navigation-www | 5 Blogs visit | A & E - Blogs | navigation-www | 6 Videos visit | A & E - Videos | navigation-www | 7 Events visit | A & E - Events | navigation-www | 8 Books visit | A & E - Books | navigation-www | 9 TV visit | A & E - TV | navigation-www | 10 Horoscope visit | A & E - Horoscope | navigation-www | 11 Comics visit | A & E - Comics | navigation-www | 12 Games visit | A & E - Games | navigation-www | 13 Things To Do visit | A & E - Things To Do | navigation-www | 14 Adams family shows graceful progression in pair of concerts \"Talley's Folly' a solid and graceful Aurora presentation The Medea Project's\" Birthright? \"a powerful voice for women Music by living composers is faring well Restaurants visit | Food-Restaurants | navigation-www | 1 Recipes visit | Food-Recipes | navigation-www | 2 Wine visit | Food-Wine | navigation-www | 3 Top 100 Restaurants visit | Food-Top 100 Restaurants | navigation-www | 4 Top 100 Wines visit | Food-Top 100 Wines | navigation-www | 5 Bargain Bites visit | Food-Bargain Bites | navigation-www | 6 Reservations visit | Food-Reservations | navigation-www | 7 Inside Scoop SF visit | Food-Inside Scoop SF | navigation-www | 8 Healthy Eating visit | Food-Healthy Eating | navigation-www | 9 Lake County wine: Tasting without the traffic Red volcanic soil is real gem for Lake County vintners San Francisco now has a JuiceBot juice vending machine thing Home & Garden visit | Living-Home & Garden | navigation-www | 1 Style visit | Living-Style | navigation-www | 2 Parties visit | Living-Parties | navigation-www | 3 Lust visit | Living-Lust | navigation-www | 4 Weekend Warrior visit | Living-Weekend Warrior | navigation-www | 5 Ski visit | Living-Ski | navigation-www | 6 LGBT visit | Living-LGBT | navigation-www | 7 Houzz visit | Living-Houzz | navigation-www | 8 Outdoors visit | Living-Outdoors | navigation-www | 9 Blogs visit | Living-Blogs | navigation-www | 10 Sponsored visit | Living-Sponsored | navigation-www | 11 Schools, Camps & Activities visit | Living-Schools, Camps & Activities | navigation-www | 12 Mom creates powerful photo series of her daughters visit | blogPost-1660622 | Living-nav-hcat | 1 Lane Bryant's sexy new #ImNoAngel campaign Weekend Getaways visit | Travel-Weekend Getaways | navigation-www | 1 Neighborhoods visit | Travel-Neighborhoods | navigation-www | 2 Wine Country visit | Travel-Wine Country | navigation-www | 3 Monterey-Carmel visit | Travel-Monterey-Carmel | navigation-www | 4 Tahoe visit | Travel-Tahoe | navigation-www | 5 Hawaii visit | Travel-Hawaii | navigation-www | 6 Mexico visit | Travel-Mexico | navigation-www | 7 Vegas visit | Travel-Vegas | navigation-www | 8 Blogs visit | Travel-Blogs | navigation-www | 9 Virgin America announces SFO-Hawaii nonstops visit | blogPost-1657943 | Travel-nav-hcat | 1 An incredible volcano-inspired hotel in Patagonia visit | article-6184396 | Travel-nav-hcat | 2 Business travelers opt for Airbnb listings instead of hotels visit | article-6182342 | Travel-nav-hcat | 3 New Orleans' Tremé neighborhood helped shape U.S. culture visit | article-6176405 | Travel-nav-hcat | 4 Real Estate visit | Real Estate | navigation-www | 9 New Homes visit | Real Estate-New Homes | navigation-www | 1 Open Homes visit | Real Estate-Open Homes | navigation-www | 2 Luxury visit | Real Estate-Luxury | navigation-www | 3 Rentals visit | Real Estate-Rentals | navigation-www | 4 Mortgage Rates visit | Real Estate-Mortgage Rates | navigation-www | 5 Commercial visit | Real Estate-Commercial | navigation-www | 6 Place an ad visit | Real Estate-Place an ad | navigation-www | 7 Home Guides visit | Real Estate-Home Guides | navigation-www | 8 Homesales visit | Real Estate-Homesales | navigation-www | 9 On the Block Blog visit | Real Estate-On the Block Blog | navigation-www | 10 Couple Revives Classic Piedmont Pines Home, Moving On After visit | article-6192294 | Real Estate-nav-hcat | 1 Dilapidated Marin County cottage sells for $70K over asking visit | blogPost-1661744 | Real Estate-nav-hcat | 2 Occidental retreat celebrates great outdoors visit | article-6190089 | Real Estate-nav-hcat | 3 Zynga's Mark Pincus delists $18-million Gold Coast home visit | blogPost-1659875 | Real Estate-nav-hcat | 4 Cars visit | Cars | navigation-www | 1 Dealers visit | Cars-Dealers | navigation-www | 1 Click and Clack visit | Cars-Click and Clack | navigation-www | 2 Car Blog visit | Cars-Car Blog | navigation-www | 3 My Ride visit | Cars-My Ride | navigation-www | 4 Sell Your Car visit | Cars-Sell Your Car | navigation-www | 5 Job Events visit | Jobs-Job Events | navigation-www | 1 Advertise visit | Jobs-Advertise | navigation-www | 2 Salary Wizard visit | Jobs-Salary Wizard | navigation-www | 3 Take the mystery out of recruitment: Part 2 San Francisco is among the best cities for recent grads Think twice before complaining about your job on social media SFChronicle visit | SFChronicle | navigation-www | 3 Latest columns visit | SFChronicle-Latest columns | navigation-www | 1 <mark>Michael Bauer</mark> visit | SFChronicle-Michael <mark>Bauer</mark> | navigation-www | 2 Jon Carroll visit | SFChronicle-Jon Carroll | navigation-www | 3 Leah Garchik visit | SFChronicle-Leah Garchik | navigation-www | 4 Bruce Jenkins visit | SFChronicle-Bruce Jenkins | navigation-www | 5 Chip Johnson visit | SFChronicle-Chip Johnson | navigation-www | 6 Ann Killion visit | SFChronicle-Ann Killion | navigation-www | 7 <mark>Thomas Lee</mark> visit | SFChronicle-Thomas <mark>Lee</mark> | navigation-www | 8 Matier & Ross visit | SFChronicle-Matier & Ross | navigation-www | 9 C.W Nevius visit | SFChronicle-C. W Nevius | navigation-www | 10 Kathleen Pender visit | SFChronicle-Kathleen Pender | navigation-www | 11 Scott Ostler visit | SFChronicle-Scott Ostler | navigation-www | 12 http: //www.sfgate.com/news/crime/article/Police-seek-arrest-of-mother-of-disabled-man-left-6195571.php Police seek arrest of mother of disabled man left in woods print_article | article-6195571 | article-share-redesign | 7 comments_jump | article-6195571 | article-share-redesign | 1 email_share | article-6195571 | article-share-redesign | 1 facebook_share | article-6195571 | article-share-redesign | 2 twitter_share | article-6195571 | article-share-redesign | 3 pinterest_share | article-6195571 | article-share-redesign | 4 reddit_share | article-6195571 | article-share-redesign | 5 google_share | article-6195571 | article-share-redesign | 6 PHILADELPHIA (AP) - An arrest warrant has been issued for the mother of a severely disabled man left in the woods for several days near a Philadelphia park, authorities said. Nyia Parler left her 21-year-old son - who is quadriplegic and has cerebral palsy - lying in leaves and covered with a blanket next to a wheelchair and Bible while she left town, police said. He was found Friday night near Cobbs Creek Park. Police believe he was left there between the time he and his mother were seen together on Easter Sunday and before his mother boarded a bus Monday for Maryland to visit her boyfriend, said Lt. Walker said the victim was found was around the corner from their home and described the scenario authorities believe to have taken place this way:\" She pushes him about 150 yards from the highway into the wooded area, takes him out of wheelchair, lays him on the ground, puts a blanket over him and leaves a Bible with him, and then just walks away. \"During the period he was exposed to the elements, the young man was\" completely defenseless \"in an area with wild animals, with no water and in cold, damp weather, Walker said .\" It's only by the grace of God that he survived this. Amazing, \"he said. Contacted in Maryland after the young man's school became concerned about her absence, the victim's mother told relatives and authorities that he was with her, Walker said .\" Obviously her statements made during the week were not truthful, \"he said. Her boyfriend, however, assumed other relatives were caring for the young man and\" was in shock when he learned what happened, \"Walker said. A 16-year-old son also residing with the family is now the care of other family relatives, Walker said. Parler, 41, of Philadelphia, will face charges including aggravated assault, reckless endangering, neglect of a care-dependent person, kidnapping, unlawful restraint and false imprisonment, according to police. Philadelphia Inquirer reported that Maryland authorities said Parler was admitted to a hospital Sunday morning for treatment of an undisclosed condition .\" When her treatment is completed, we will take her to court and she can either waive or fight extradition, \"Capt. Paul Starks of the Montgomery County, Maryland, police told the newspaper. Walker said the son was hospitalized with dehydration, malnutrition, a deep cut on his back that caused concern about potential infection and possible eye injuries, but he appeared to be improving .\" He seemed to be a little happier yesterday, \"Walker said .\" You could tell he knew his family was around and felt more comfortable. \"Dear Abby: Friendly divorce may be best for unhappy wife Emotional memorial for pedestrian killed in S.F. car chase Actor <mark>Ryan Reynolds</mark> hit, not injured, by car in Vancouver Consumer Reports survey identifies cheapest, most expensive...4-year-old's tip leads to discovery of her parent's bodies Activate! Activate for access to SFChronicle.com!"}, {"articleID": "2010120105_00072494_W", "names": {"Bill Jones": ["Q1178906", "Q14954814", "Q17916915", "Q18630842", "Q23301575", "Q27909554", "Q2903260", "Q47128575", "Q4909636", "Q4909638", "Q4909639", "Q4909640", "Q55375228", "Q58239070"]}, "date": "2010-12-01", "url": "http://muskogeephoenix.com/homepage/x1199041967/Two-hurt-in-rollover-accident", "content": "two fort gibson women were injured tuesday afternoon in a rollover accident on oklahoma 62 near the og & e generating plant east of muskogee. muskogee police officer jody standridge said the incident happened shortly before 2:15 p.m. robbie martin, 49, was eastbound in her black ford explorer with passenger rose martin, 29. standridge said the accident occurred when she came upon a maroon toyota tundra driven by <mark>bill jones</mark>, 71, of park hill. he was eastbound and was trying to make a u-turn in the median after he missed the muskogee turnpike exit. \"when she tried to avoid him, she shot through the median, struck the edge (of the pavement shoulder) of the westbound late and over-compensated, which caused her to roll,\" standridge said. robbie martin and rose martin were transported to muskogee regional medical center. neither <mark>jones</mark> nor his passenger, 69-year-old randy griffin, were injured. conditions were clear and visibility was good. both robbie and rose martin were wearing their seat belts. robbie martin was being held at mrmc late tuesday for medical evaluation. rose martin was treated and released. reach keith purtell at 684-2925 or kpurtell @ muskogeephoenix.com."}, {"articleID": "2010041923_00041656_W", "names": {"Omar Hassan": ["Q19818787", "Q22278151", "Q7089712"]}, "date": "2010-04-19", "url": "http://africanews.com/site/Somalia_HIV_education_in_the_schools/list_messages/31439?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+AfricanewsWeblogs+%28AfricaNews+Weblogs%29", "content": "the content of this article is not verified by the editorial team of africanews.com. read our about 800 students in the somalia's breakaway region of somaliland are getting hiv/aids education in thier schools, officails said. the students are running primary and junior high school in somaliland and this massage is the first time in the country. somaliland health and social care organization (sohasco) told that the students who get this education are the ages from seven to nineteen. \"most of them are not sexually active now - we targeted them for several reasons. every student comes from a family and he will pass the message to his family. also, they are the next generation at high risk of hiv,\" said mohamoud hassan abdillahi, executive director of somaliland health and social care organization (sohasco) told irin. the massage will increase awareness in thousands of people who will know how hiv transmitted and how to prevent infection with the level of the epidemic in somaliland. an estimated report says 1.4 percent of people, who live in somaliland, are infected. \"our slogans were carrying messages like,\" stop hiv/aids', \"hiv/aids is very dangerous to every human being, including whites, blacks and muslims',\" abstinence is the best way of avoiding hiv/aids' and \"together we can stop hiv/aids',\" abdillahi said. somaliland plans to guarantee that at least 75 percent of populations would be able to read and write by 2015 while there were 225,853 learners in primary school and 21,331 others attended secondary school in 2008 and 2009, as 26,156 were in adult education. 19/04 uganda has crowned \"the world's youngest king' to assume official duties. 19/04 two german men have been kidnapped from a beach in nigeria's oil-producing southeast. 19/04 the president of sudan, <mark>omar hassan</mark> al-bashir, scored overwhelming victories in a sample of results from national elections. 19/04 a presidential aspirant for dr congo says the current president is taking the country backwards. 18/04 two oil tankers collided and burst into flames in nigeria's ogun state killing five people. 17/04 about 113 illegal ethiopian migrants in a 48-hour raid in puntland, security officials said. 17/04 sudan\" struggled to meet international standards \"in its recent controversial elections, eu observers said. 16/04 kenya airways has cancelled its flights to europe due to a volcanic eruption in iceland 16/04 nine people were killed, including a member of president <mark>omar</mark> al-beshir's party in sudan. 15/04 africanews reporter isaac eshun visited the first tedxyouthinspire event, held in accra, ghana on april 10, 2010. a crowd of young ghanains attended t...15/04 the malawi government will soon draft a law that will outlaw polygamy in that country. 15/04 ten suspected somali pirates who attacked a german cargo ship are in netherlands. 15/04 a $4.2 m deal to manage climate change has been signed between malawi and the undp. 15/04 about 50 people have died after consuming methanol spiked alcohol in uganda. news by african reporters all content on this website is created by african reporters. the editorial team of africanews.com supervises the content in the news section. join our network! muhyadin ahmed roble is a somali freelance journalist based at kenya who works with both local and international news networks in reporting the crisis in the horn of africa. he was editor of local newspaper called xiddigta and producer of simba fm. muhyadin is well qualified journalist with over six years working experience in print and online journalism. in those years he was working as writer, columnist, reporter, correspondent and editor. he has a certificate in mass communication and journalism from the institute of commercial management, (icm) in london, britain. he has two more other certificates in peace reporting, conflict reporting and also humanitarian reporting. he writes on matters related and touching crisis in the horn of africa."}, {"articleID": "2016071817_00368786_W", "names": {"Chris Boyd": ["Q15229743", "Q21464160"], "Mark Mitchell": ["Q16228506", "Q18217067", "Q18217753", "Q1900287", "Q20190581", "Q22006951", "Q28939744", "Q6768909", "Q6768910", "Q6768911"]}, "date": "2016-07-18", "url": "http://home.nzcity.co.nz/nl.aspx?3639672", "content": "Rugby: Unknowns in road to the finals By Campbell Burnes 5:00 AM Tuesday Jul 19, 2016 Not saved Facebook 0 Twitter 0 LinkedIn 0 Google + 0 Email Print Highlanders Rugby Team Rugby Super Rugby Hurricanes coach <mark>Chris Boyd</mark> suggests things are not as cut and dried as some pundits say. Photo / <mark>Mark Mitchell</mark> <mark>Chris Boyd</mark> is not so sure that the chances of four New Zealand sides reaching the semifinals are as cut and dried as many pundits and the form book would suggest. \"The sides are close enough together for travel to be a factor, but it's not going to be the factor. I think sides can win this competition home and away,\" says the Hurricanes coach, reflecting on his charges' top billing heading into the Super Rugby playoffs. \"The Stormers are an unknown because no New Zealand side has played them this year. It's very hard to get a handle on just how strong the Stormers are, but they'll be hard to beat at Newlands. A very well rested Lions side will be tough to beat in Jo\" burg. The Brumbies are capable on their own patch as well. \"<mark>Boyd</mark> noted how tough the Crusaders' travel schedule is, given they did not depart for the Republic until today .\" I wouldn't like to say there are going to be four Kiwi sides [in the semis]. I hope there are. \"While he acknowledged the Sharks will have a long travel haul to come to the capital and face a side riding high and smarting from the 32-15 reverse they suffered in Durban in May, that will not alter the Hurricanes' mindset or preparation this week .\" That performance is a long time ago now and we've got some reasonable momentum at the moment, so we just have to make sure we get our preparation right and tick the boxes. We've found with this side that our preparation is crucial to our performance, so we need to make sure it's nice and tidy this week, and enjoy the fact that we can come out and play a quarter at home, where we probably didn't think that would happen, even though that was always the goal, \"says <mark>Boyd</mark>. One shift in mindset is that the Hurricanes no longer have to go all-out in search of a bonus point. They can play percentage rugby if that is required. Beauden Barrett did, however, kick the ball 12 times against the Crusaders, so expect something similar on Saturday night, especially if things get gnarly in the packs. And expect Barrett to have more penalty shots at goal than he had against the Crusaders, where he had none. <mark>Boyd</mark> may have selection puzzles in his front-row if Reggie Goodes does not fully recover from a head knock. He will need to train fully by Thursday, leaving the\" Tongan Bear \"Loni Uhila to make another big impact off the bench. Midfielders Vince Aso and Matt Proctor are likely to be available, though it would be a tough call on Willis Halaholo if he was demoted. <mark>Boyd</mark> can reflect on a solid 11-4 regular season:\" We've dropped four games, two of them by a point, to the Highlanders and Chiefs, and had two blowouts, in round one [against the Brumbies] and then against the Sharks, \"he says. It looks like he has the making of a champion team, and one that was ranked seventh on the table before the dramatic victory last weekend .\" On paper, it's possibly not even the best side in the playoffs, but it's a good team. \"- NZ Herald Read more by Campbell Burnes Email Campbell Burnes Email Print Get the news delivered straight to your inbox Receive the day's news, sport and entertainment in our daily email newsletter SIGN UP NOW 00 days 00 hours 00 minutes--V. view match---- Loading Olympics 18 Since NZ sent its first official team in 1920, the country has twice failed to secure a medal: At London in 1948 and Moscow in 1980. Loading Is this what Milf means? Breakfast has all the answers! Late Night Big Breakfast - Men's Panel Best Bits EP .16 Coach Steve - Gotta Catch 'Em All! EP .8 watchme. co. nz & raquo;"}, {"articleID": "2013110104_00003446_W", "names": {"Nancy Cartwright": ["Q229211", "Q512979"]}, "date": "2013-10-31", "url": "http://www.inquisitr.com/1014854/the-simpsons-to-air-marcia-wallace-tribute/", "content": "Tampa Bay Buccaneers Stick With Coach Greg Schiano As Masses Call For His Ouster Kate Upton: \"Golf Digest' Cover Makes Golfing, And Arnold Palmer, Look Sexy Tobacco-Buying Age In NYC Becomes 21, Will Other States Increase Smoking Age? The Simpsons will air a tribute to voice actress Marcia Wallace Sunday, November 3. died October 25 due to complications from pneumonia. She was 70. Wallace, along with five other Simpsons voice actors, earned the first ever Emmy for Outstanding Voice-Over performance in 1992. Wallace won the award for the episode\" Bart the Lover, \"in which Bart (<mark>Nancy Cartwright</mark>) responds to a personal ad Mrs. Krabappel placed in the newspaper. Bart creates an alter ego named Woodrow as revenge for being given a month's detention for breaking the class fish tank with his yo-yo. When Bart sees Mrs. Krabappel sitting in an empty restaurant, he feels guilty and writes her a romantic letter explaining why Woodrow had to leave, which makes her feel better. Fox will re-air the episode, the 16th episode of its third season, Sunday. An all-new episode will follow at 8 pm, The Simpsons and we intend to retire her irreplaceable character .\" \"Marcia would come in, and she was always a ray of light. She's in 178 episodes - a lot more than people might think. That's more episodes than most standard shows,\" <mark>Cartwright</mark> told The Hollywood Reporter. \"Marcia was always a very big part of the group. Always a treat. The room was always a little bit better with her in it .\" <mark>Cartwright</mark> added, \"She had recorded some upcoming episodes, I don't know how they will use it. I don't know what they're going to do with the character. I'm curious to see what they do .\" <mark>Cartwright</mark> also said that \"Bart the Love\" showed that \"deep down inside there was caring there in [Edna's] voice .\" She explained, \"That's the brilliance of the writing of the show.... Of all the kids in the school, it was Mrs. Krabappel and Bart that had this loving relationship. I think Bart gave her a little more joy than grading papers. He provided her with a real relationship .\" Edna Krabappel first appeared in \"Bart the Genius,\" the second episode of the first season in 1990. h4 class = \"icon-inq-social-friends widgettitle\" > Inquisitr With Friends Halloween Obese Letter: Woman Criticized For Plan To Shame Fat Trick-Or-Treaters Heidi Montag: Kristin Cavallari Is Having A Boy! Oops, Nevermind Giraffe Riddle Answer: Creator Of Facebook Question Reveals Answer, Promises More Riddles Nona Gaye Lawsuit Claims Robin Thicke Stole Musical Elements From Marvin Gaye South Carolina Shooting Ends With Six Dead, Police Suspect Murder-Suicide h4 class = \"icon-inq-facebook widgettitle\" > Facebook h4 class = \"widgettitle icon-inq-featured-news\" > Featured Stories George Zimmerman Sends Estranged Wife A Message: A Bullet-Riddled Target [Report] Kim Kardashian Says Bikini Picture Was \"Big Middle Finger' To Weight Critics Halloween 2013 Gaming: The Scariest Games To Get You Ready For Tonight Mick Jagger Hit On Katy Perry? Rolling Stones Singer Says Perry Was Teenage Dreaming Kelly Ripa Twerks On Michael Strahern In Miley Cyrus Halloween Costume, Pair Then Make Numerous Costume Changes"}]