[{"articleID": "2016072715_00239660_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-27", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/qw7sqDmAvkY/", "content": "Comment Share Tweet Stumble Email President Obama on Tuesday didn't rule out the idea that the Russians hacked into internal emails at the Democratic National Committee in order to influence the U.S. presidential election this November. \"Anything's possible,\" Mr. Obama said in an interview with NBC News' Savannah Guthrie. In depth: Democratic convention 2016 The 2016 Democratic convention - live updates The president pointed out that the FBI is still investigating the breach, which resulted in the disclosure of more than 19,000 DNC emails, and he also acknowledged that experts are pointing to the Russians. Play Video CBSN Was Russia behind hack on DNC email servers? CBS News' Jeff Pegues and Michael Isikoff, chief investigative reporter for Yahoo News, discuss the DNC email leak. \"What we do know is the Russians hack our systems, not just government systems, but private systems,\" he said. \"But what the motives were in terms of the leaks and all that, I can't say directly, but what I do know is that <mark>Donald Trump</mark> has repeatedly expressed admiration for Vladimir Putin.\" Asked if the president was suggesting that Putin is motivated to prefer <mark>Trump</mark> in the White House, Mr. Obama said, \"I am basing this on what Mr. <mark>Trump</mark> himself has said. And I think that <mark>Trump</mark>'s gotten pretty favorable coverage back in Russia.\" On Tuesday, U.S. officials confirmed to CBS News that they believe that people working for the Russian government are behind the hack. In an interview with CBS's Miami affiliate, <mark>Trump</mark> denied that he has any ties to Russia and that its government is trying to help him win this election. \"I don't know anything about it. I can tell you, I think if I came up with that, they'd say,\" Oh, it's a conspiracy theory,' it's ridiculous. I mean I have nothing to do with Russia. I don't have any jobs in Russia. I'm all over the world but we're not involved in Russia. \"Mr. Obama is set to deliver remarks at the Democratic convention in Philadelphia Wednesday night. & copy; 2016 CBS Interactive Inc.. All Rights Reserved. Comment Share Tweet Stumble Email Rebecca Shabad Rebecca Shabad is a video reporter for CBS News Digital."}, {"articleID": "2016121422_00214482_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-12-14", "url": "http://westport-news.com/news/crime/article/Trump-urged-to-tackle-campaign-finance-in-swamp-10796555.php", "content": "http: //www.westport-news.com/news/crime/article/Trump-urged-to-tackle-campaign-finance-in-swamp-10796555.php <mark>Trump</mark> urged to tackle campaign finance in \"swamp draining' Julie Bykowicz, Associated Press Updated 5:01 pm, Wednesday, December 14, 2016 Photo: Evan Vucci, AP Image 1of/1 Caption Close Image 1 of 1 President-elect <mark>Donald Trump</mark> speaks during a rally at the Wisconsin State Fair Exposition Center, Tuesday, Dec. 13, 2016, in West Allis, Wis.. President-elect <mark>Donald Trump</mark> speaks during a rally at the Wisconsin State Fair Exposition Center, Tuesday, Dec. 13, 2016, in West Allis, Wis.. Photo: Evan Vucci, AP <mark>Trump</mark> urged to tackle campaign finance in\" swamp draining' 1 / 1 Back to Gallery WASHINGTON (AP)--Washington lawmakers acknowledge they spend a \"sickening\" amount of time raising money--and a bipartisan advocacy group sees President-elect <mark>Donald Trump</mark> as part of the cure. Issue One has united 165 former members of Congress, governors and administration officials behind a plan to rewrite campaign finance laws to give small donors more power in the political process. The coalition is led by former Indiana Rep. Tim Roemer, who says Republican and Democratic lawmakers often describe their fundraising duties as \"sickening.\" \"You had <mark>Trump</mark> saying he was going to do something about this,\" Roemer told a news conference Wednesday. He said <mark>Trump</mark> and Democratic presidential candidate Bernie Sanders, both of whom raised hundreds of millions of dollars from small donors, \"launched a hand grenade into Washington with this election.\" As presidential candidates, both lambasted the influence that money--particularly from big donors--holds over politicians. Lawmakers, Roemer said, think <mark>Trump</mark> could use his political juice next year to help pass the first major campaign finance overhaul in more than a decade. After the 2002 legislation known as McCain-Feingold, which limited how much special interests could give to the political parties, court rulings and legal and regulatory changes have cleared a path for unlimited donations to outside groups. That has reduced the importance of smaller donations. Republican former Transportation Secretary Ray LaHood, part of the Issue One effort, said the current system is \"awash in money, with little or no accountability\" and said Washington should embrace voters' calls for change. Issue One has passed along its policy proposals to <mark>Trump</mark> transition aides Kellyanne Conway, <mark>Donald Trump</mark> Jr., Steve Bannon and others, said Nick Penniman, the group's executive director. Key pieces include incentivizing small donors by providing them a tax rebate and restructuring the Federal Election Commission. The group is hoping to break through to <mark>Trump</mark>, who has put forward no policy proposals on campaign finance even as he has repeatedly pledged to \"drain the swamp\" of Washington. His swamp-draining platform centers on curbing the influence of lobbyists, and Penniman says its failure to include campaign finance proposals is a major oversight. Yet many of <mark>Trump</mark>'s actions and comments on the campaign trail have campaign-finance reformers feeling hopeful. Throughout the primary campaign, when he was largely paying out of his own pocket, the billionaire New York businessman called out rivals as \"puppets\" of big donors and promised to change the system. In the general election, <mark>Trump</mark> dialed back that rhetoric as he began raising money--including from donors writing half-million-dollar checks to his campaign and party allies. Still, <mark>Trump</mark> was one of most successful low-dollar fundraisers in history. His campaign raised more than twice as much from people giving less than $200 than from larger donors, fundraising documents show. Democratic former Agriculture Secretary Dan Glickman, who also signed on to the Issue One plan, said <mark>Trump</mark> might be able to achieve what President Barack Obama couldn't--sweeping changes in how federal campaigns are financed. Despite running on such a mantra in 2008, Obama \"did not engage in this issue very strongly at all,\" Glickman said. <mark>Trump</mark> can take up the fight because \"he doesn't have a stake in this current system like I think previous presidents have,\" Glickman said. __ Follow Julie Bykowicz on Twitter at http: //www.twitter.com/bykowicz Most Popular 1 Video: Troopers save driver from burning car 2 Staples winter preview: Seideman, Pritchett form 1-2 punch for...3 Greens Farms opens new squash facility with Staples 4 Police: Westport man ran from cops after crash 5 Westport police: Weston man drove drunk, ran red light 6 To Kill a Mockingbird: Still relevant after 50 years 7 Stratford man allegedly shoplifted in Westport View Comments & copy; 2016 Hearst Communications, Inc. ."}, {"articleID": "2017050313_00564384_W", "names": {"Michael Garvey": ["Q16232116", "Q57033300", "Q6830539"]}, "date": "2017-05-03", "url": "http://www.tiftongazette.com/sports/marlowe-wins-state-hurdles-championship/article_96dff0ce-2f84-11e7-9451-fb8cb7676825.html", "content": "Marlowe wins state hurdles championship TIFTON--Tiftarea Academy's Marlee Marlowe was crowned state champion Saturday in the Georgia Independent Schools Association state Class AAA track meet in the 100-meter hurdles. More Headlines The Tifton Gazette is releasing \"Our United States Presidents,\" a magazine-style book briefly chronicling the history of our 45 United States presidents. More Headlines The Tifton Gazette is releasing \"Our United States Presidents,\" a magazine-style book briefly chronicling the history of our 45 United States presidents. More Headlines Close Sarge Dorsey Marlee Marlowe won an individual championship at Saturday's state track meet for Tiftarea Academy, running the 100 hurdles in 16.04 seconds. Marlowe wins state hurdles championship Becky Taylor 3 min ago Sarge Dorsey Marlee Marlowe won an individual championship at Saturday's state track meet for Tiftarea Academy, running the 100 hurdles in 16.04 seconds. TIFTON--Tiftarea Academy's Marlee Marlowe was crowned state champion Saturday in the Georgia Independent Schools Association state Class AAA track meet in the 100-meter hurdles. Competing at Albany's Hugh Mills Stadium, Tiftarea finished 13th overall in the boys meet and 14th in the girls, accumulating four and 16 points, respectively. Deerfield-Windsor swept the meet, though it had to settle with Trinity Christian of Dublin for a tie in boys. Both Deerfield and Trinity totaled 114.5 points. The Lady Knights scored 92 points to defeat Augusta Prep by seven. Marlowe's win \"feels really great,\" said David Dark, head coach of Tiftarea's track team. \"She blew the competition away,\" he said. \"She ran almost a full second faster in the finals.\" Marlowe, who also won the region hurdles title earlier in April, had qualified in a preliminary Thursday for the finals at the top of the heap in 16.7 seconds. She then improved upon that time in the finals by running in 16.04 seconds. The time allowed her to finish more than a half-second ahead of her nearest competitor, Teresa Dominguez of Holy Spirit Prep, who finished in 16.83 seconds. Dark said the competition was actually stiffer in the preliminary. One of Marlowe's top opponents fell in the qualifier and did not finish in time to make the final round. He refused to accept any credit for Marlowe's championship. That, he said, should be split among two people: Marlowe and Newell \"Sarge\" Dorsey. A Tiftarea stalwart for all sports, Dorsey coached the 1984 Lady Panthers to the state title. \"Marlee's hard work and Sarge's great,\" Dark said. \"He's really her coach.\" Tiftarea earned points in four other events, the girls 400 meters, girls long jump, boys 800 meters and boys 4x400. Adylein Hunt was sixth in the long jump at 15' 04.25. \"\"Adylein jumped a foot farther than she had all season,\" said Dark. Sixth place also went to Abby Carswell in the 400. He said he was \"really proud\" of her finish, as well as Adam McKinney, who was eighth in the 800. Even more impressive for McKinney, he shaved 10 seconds off his previous time. McKinney was also on the sixth place 4x400 relay team with Jackson Cook, Logan Carswell and Spence Massey. McKinney was not originally set to run with the group, but was forced into duty after an injury to Dallas Hunt. Hunt was injured during state and did not finish his individual race, the 1,600 meters. Dark said Hunt sacrificed his own race for the 4x400 team to help them qualify for the finals. \"He didn't finish that race so he had something to give.\" McKinney had not trained much for the 4x400, but quickly jumped into the slot. Tiftarea didn't miss a beat, finishing within a second of their qualifying time. Dark said the meet was bittersweet. Logan Carswell and Cook are seniors and this was their last ever meet for Tiftarea. Though they did not earn points, he was also proud of Kassidy Goodman and <mark>Michael Garvey</mark>. Goodman won region in shot put and was 12th in the finals. <mark>Garvey</mark> was 10th in discus. Tags"}, {"articleID": "2008112709_00033561_W", "names": {"Todd Peterson": ["Q42581285", "Q7812563"], "Bill Callahan": ["Q3639958", "Q4908389", "Q862005"]}, "date": "2008-11-27", "url": "http://fremonttribune.com/articles/2008/11/27/sports/college/doc492e58dbe37ad438361635.txt", "content": "by brian christopherson/lincoln journal star thursday, nov 27, 2008 - 02:30:49 am cst the days of saturday autumn glory seem boundless about the time youâ € ™ re stacking mountain dew in the dorm fridge, but it always ends like this: a guy shaking his head, wondering where the time went. joe ganz feels it this week. heâ € ™ s a senior. itâ € ™ s his turn to feel it. \"youâ € ™ re in the middle of the season and youâ € ™ re like, â € ˜god, is this thing ever going to end? â € ™ and now youâ € ™ re here and itâ € ™ s like,\" wow, itâ € ™ s really over, â € ™ \"the husker senior quarterback said tuesday.\" so itâ € ™ s going to be a special time. hopefully i can control my emotions. i have to go out there and still play a game. itâ € ™ s going to be tough. itâ € ™ s going to be pretty emotionally high on our end. \"whatâ € ™ s one more emotional roller coaster for these husker seniors? theyâ € ™ ve already been on a ride more wild than anything found at the nearest amusement park. for those who committed to this program during the 2003 season, theyâ € ™ ve endured the firing of two head coaches, two bowlless winters and more angst surrounding the husker football program than probably has ever been.\" just like anything else in life, thereâ € ™ s been a lot of ups and downs, probably more extreme as far as this football programâ € ™ s been used to, \"husker senior wide receiver <mark>todd peterson</mark> said.\" but itâ € ™ s just something you kind of ride out. they always say sports can teach you a lot about life and you can kind of see that through everything weâ € ™ ve been through since iâ € ™ ve been here. itâ € ™ s been a wild ride. \"and yet for whatever dips this ride has featured, seniors will take on their last game at memorial stadium on friday against colorado with the chance to place a big happy face above whatever turmoil came before.\" a couple years from now i think weâ € ™ ll all feel pretty good about ourselves, maybe, \"husker senior defensive tackle ty steinkuhler said.\" get a few more wins here, 9-4, and weâ € ™ ve left this place on a high note. it will be a good feeling. \"foundation is the word first-year head coach bo pelini has used this season when talking about his seniors. their job is to build the foundation that greater things might be built upon in future years. not everythingâ € ™ s gone the way it was hoped for this year, <mark>peterson</mark> said,\" but i think weâ € ™ re setting it up for some of the younger guys to show them the path it takes to get there. \"it will be the final home game for 21 seniors, and 12 of those are players in their fifth year. some committed even while pelini was the defensive coordinator here in 2003. some have been on board long enough to have seen the firing of frank solich, the hope that came with the hiring of <mark>bill callahan</mark>, the firing of <mark>bill callahan</mark>, and now the hope that has come with the hiring of pelini.\" theyâ € ™ ve been through a lot, \"pelini said.\" going into their senior year they had to deal with another coaching change and that is never easy, especially going into your senior year. i thought theyâ € ™ ve responded well. theyâ € ™ ve led this football team. i have a lot of respect or these guys. they come to work every day, they practice hard, they have great attitudes, there is a lot of character and weâ € ™ re going to miss those guys. \"during the past four seasons, nebraska football has gone 29-20 and all kind of mood changes have revolved around that record. this senior class was there in 2005 when the huskers stormed into colorado and won 30-3 and the words\" restore the order \"came into the lexicon of nebraskans. an alamo victory followed and so did a big 12 north title in 2006. but then came a loss to oklahoma and a cotton bowl loss to auburn. and then came 5-7. kansas scored 76. colorado scored 65. a new coach came aboard. bo shirts hit the shopping malls. a better vibe hit nebraska.\" he just came in with a positive attitude, \"<mark>peterson</mark> said.\" heâ € ™ s got a lot of grief this year for yelling on the sidelines and being so intense, but heâ € ™ s a positive guy for the most part. heâ € ™ s come here from day one and heâ € ™ s pushed us, heâ € ™ s made us work, but heâ € ™ s always had our back and heâ € ™ s always been a guy you could go talk to. \"the seniors fed off that, but they also fed off each other.\" we really came together in spring ball and summer, and just really told our guys that we werenâ € ™ t going to go out like that, \"said senior defensive end zach potter. so how will they go out? theyâ € ™ ve won four of their last five, but they know total satisfaction wonâ € ™ t be reached without a win friday against colorado. follow that with a bowl win and it would be just nuâ € ™ s second nine-win season in the last five years. thereâ € ™ d be plenty of pride in that. a wild ride, sure. but ganz, a guy who patiently sat off to the side until given his chance to start at the end of last year, said heâ € ™ d do it all over again in a heartbeat.\" itâ € ™ s made me the man i am today, \"he said.\" itâ € ™ s done a lot more than shape me as a football player. itâ € ™ s shaped me as a man and a person, somebody who just understands life a lot better. i wouldnâ € ™ t trade this experience for anything in the world. \""}, {"articleID": "2014121113_00063702_W", "names": {"John Longworth": ["Q21462338", "Q23010148"]}, "date": "2014-12-11", "url": "http://www.scottishconstructionnow.com/2014/12/11/building-firms-enjoy-output-growth/", "content": "<mark>John Longworth</mark> The recovery of the construction sector should continue over the coming two years, according to new forecasts, with further growth predicted. The latest economic forecasts from the British Chambers of Commerce (BCC) indicate that the UK's overall Gross Domestic Product (GDP) rate should improve by 3 per cent this year. In response to weakening economic signals from abroad and lower-than-expected household consumption growth, this is slightly down on the group's earlier prediction of 3.2 per cent. However, despite the slight downgrade, the business group said further growth is expected to be seen in the building industry between now and 2016. It said the output of the construction sector should grow by 4.9 per cent in 2014, in full-year terms. Looking further ahead, the body added that construction output growth rates of 1.9 per cent and 1.6 per cent should also be witnessed respectively in 2015 and in the following year. Employers in the construction trade continue to offer apprenticeship schemes, in order to plug skill gaps and provide work opportunities to young people. These efforts appear to be having a positive impact, with the BCC suggesting that the unemployment total among 16 to 24 year-olds should drop from 737,000 in the third quarter of this year, to 533,000 in the same period of 2017. The UK's wider unemployment figure should dip from 1.959 million to 1.839 million by the third quarter of next year, meanwhile, the group suggested. Despite the downgrade in the headline GDP forecast, BCC director general <mark>John Longworth</mark> said the UK should remain one of the world's quickest-growing developed economies this year. He added: \"This is a great achievement, and businesses up and down the country should be congratulated for their hard work and resolve to drive the recovery in the face of challenges and uncertainty both at home and abroad.\" As Britain continues to recover from the effects of the recession, the BCC said businesses should see further economic growth in both 2015 and 2016. It said the country's GDP reading is likely to improve by 2.6 per cent next year and by another 2.4 per cent in 2016. Among its other predictions, the trade body said business investment levels should stay strong. It said these investments should go up by 7.5 per cent in 2014 alone. Share: More Share on Tumblr Pocket Print Press This Related"}, {"articleID": "2009043005_00085619_W", "names": {"Mary Hughes": ["Q47123906", "Q47129175", "Q52584092"], "John Hood": ["Q19325421", "Q30603484", "Q56597744", "Q6239743"]}, "date": "2009-04-30", "url": "http://financialpost.com/reports/oil-watch/story.html?id=1545227", "content": "six big u.s. banks need capital, tests reveal at least six of the 19 largest u.s. banks require additional capital, according to preliminary results of government stress tests, people briefed on the matter said. while some of the lenders may need extra cash injections from the government, most of the capital is likely to come from converting preferred shares to common equity, the people said. the federal reserve is now hearing appeals from banks, including citigroup inc. and bank of america corp., that regulators have determined need more of a cushion against losses, they added. by pushing conversions, rather than federal assistance, the government would allow banks to shore themselves up without the political taint that has soured both wall street and congress on the bailouts. the risk is that, along with diluting existing shareholders, the government action won't seem strong enough. \"the challenge that policy makers will confront is that more will be needed and it's not clear they have the resources currently in place or the political capability to deliver more,\" said david greenlaw, the chief financial economist at morgan stanley, one of the 19 banks that are being tested, in new york. final results of the tests are due to be released next week. the banking agencies overseeing the reviews and the treasury are still debating how much of the information to disclose. fed chairman ben bernanke, treasury secretary timothy geithner and other regulators are scheduled to meet this week to discuss the tests. geithner has said that banks can add capital by a variety of ways, including converting government-held preferred shares dating from capital injections made last year, raising private funds or getting more taxpayer cash. with regulators putting an emphasis on common equity in their stress tests, converting privately held preferred shares is another option. firms that receive exceptional assistance could face stiffer government controls, including the firing of executives or board members, the treasury chief has warned. today, kenneth lewis, chief executive officer of bank of america, faces a shareholder vote on whether he should be re - elected as the company's chairman of the board. while lewis has been at the helm, the bank has received us $45-billion in government aid. scott silvestri, a spokesman for charlotte, north carolina - based bank of america, declined to comment on lewis yesterday. lewis said earlier this month that the firm \"absolutely\" doesn't need more capital, while adding that the decision on whether to convert the u.s.'s previous investments into common equity is \"now out of our hands.\" citigroup, in a statement, said the bank's \"regulatory capital base is strong, and we have previously announced our intention to conduct an exchange offer that will significantly improve our tangible common ratios.\" along with bank of america and new york-based citigroup, some regional banks are likely to need additional capital, analysts have said. suntrust banks inc., keycorp, and regions financial corp. are the banks that are most likely to require additional capital, according to an april 24 analysis by morgan stanley. bank of america advanced 2.6% to us $8.36 in german trading and citigroup climbed 3.5% to us $2.99. suntrust slipped 0.2% to us $13.69 in germany. by taking the less onerous path of converting preferred shares, the treasury is husbanding the diminishing resources from the $700 billion bailout passed by congress last october. \"does that indicate that's what the regulators actually believe, or is it that they felt politically constrained from doing much more than that?\" said douglas elliott, a former investment banker who is now a fellow at the brookings institution in washington. geithner said april 21 that us $109.6-billion of tarp funds remain, or us $134.6-billion including expected repayments in the coming year. lawmakers have warned repeatedly not to expect approval of any request for additional money. some forecasts predict much greater losses are still on the horizon for the financial system. the international monetary fund calculates global losses tied to bad loans and securitized assets may reach us $4.1-trillion next year. geithner has said repeatedly that the \"vast majority\" of u.s. banks have more capital than regulatory guidelines indicate. the stress tests are designed to ensure that firms have enough reserves to weather a deeper economic downturn and sustain lending to consumers and businesses. he also said there are signs of \"thawing\" in credit markets and some indication that confidence is beginning to return. his remarks reflected an improvement in earnings in several lenders' results for the first quarter, and a reduction in benchmark lending rates this month. financial shares are poised for their first back-to-back monthly gain since september 2007. the standard & poor's 500 financials index has climbed 18% this month, while still 73% below the high reached in may 2007. national post - wednesday, april 22, 2009 bank of america, citi still short of capital: reports national post - wednesday, april 29, 2009 inside indiana business - thursday, april 30, 2009 independent, ireland - thursday, april 30, 2009 new cuts could doom late-night subway service, m.t.a. director says new york times - thursday, april 30, 2009 economy dominates agenda star, south africa - thursday, april 30, 2009 san francisco chronicle - thursday, april 30, 2009 independent, ireland - thursday, april 30, 2009 the economist: free exchange - wednesday, april 29, 2009 barry fish part 1 barry fish on his new book, where there's an inheritance cameron heaps cameron heaps, co-founder of steam whistle brewing, discusses quantum shift--the richard ivey school of business executive education program for entrepreneurs. hank cunningham, part 3 hank cunningham, fixed income strategist for odlum brown and author of in your best interest on the unseen costs of buying and selling bonds joe canavan part 2 are canada's fund companies manipulating their expense ratios: joe canavan's take. joe canavan part 1 assante chairman and ceo joe canavan critique's ontario tax on mutual funds. intel virtualization technology intro in a time when application responsiveness is more critical than ever to your business, when it infrastructures are being flooded with data that needs to be processed quickly and efficiently, when data centres must perform faster while consuming less power and requiring less space your servers must be up to the challenge. intel ® xeon ® processor 5500 series-based servers are designed from the ground up with breakthrough innovations to meet those objectives. harmonized tax marred by taxes. they call it a tax harmonization but really they should label this a tax grab. ontario is the latest province to harmonize the federal and provincial taxes. hank cunningham, part 2 hank cunningham, fixed income strategist for odlum brown and author of in your best interest on buying corporate bonds hank cunningham, part 1 fixed income hank cunningham on his new book, in your best interest mj bulmer if you can't attend class can you still do an executive mba? mj bulmer asked herself that question and found the answer at athabasca university. the busy executive and mom tells fp executive about her experience doing an emba. <mark>mary hughes</mark> <mark>mary hughes</mark> isn't your typical mba student. she is a mother of two, a scientist with a phd and the senior director at a large company. <mark>mary</mark> tells fp executive why she decided to do an mba finansense episode 6 twitter part 1 what is \"twitter\" and how can it help you make money? can an adult actually say \"twittered\" or \"i tweeted\" free from absolute humiliation? let todd \"tweets\" diamond show you the way! finansense epsiode 6 twitter part 2 in \"twitter: part two,\" todd expands on the social ramifications of \"twittering\" and how it affects our culture. finansense episode 6 twitter part 3 in \"twitter: part three,\" todd dissects e-commerce and reforms it into something palatable to the average person: you, mr/ms. average. fp executive sarah costa fp executive interviews sarah costa, who decided to do an mba at wilfrid laurier university and start a family. john lawrence reynolds part 2 bubbles bankers & bailouts author on how to survive the global financial crisis. john lawrence reynolds part 1 author john lawrence reynolds on how the global financial crisis occurred. <mark>john hood</mark>, part 2 <mark>john hood</mark>, president of j.c. <mark>hood</mark> investment counsel on using etfs and bonds to cut portfolio costs. non-farm payroll employment fell by 79,600 jobs in february: statscan"}, {"articleID": "2012090502_00052970_W", "names": {"J. Scott": ["Q54036785", "Q6107076"], "Clint Eastwood": ["Q2979323", "Q43203"], "John Cho": ["Q312705", "Q57616370"], "Marc Anthony": ["Q17403224", "Q26625", "Q3287757", "Q3845353"], "Elizabeth Banks": ["Q219373", "Q47295776"], "Tim Daly": ["Q351479", "Q56636261"], "James Taylor": ["Q11075364", "Q1168698", "Q16561148", "Q17092246", "Q17140631", "Q18218071", "Q20631287", "Q21064423", "Q21996614", "Q23618920", "Q24005465", "Q25190090", "Q2536187", "Q28465652", "Q30362443", "Q310300", "Q39073622", "Q42322786", "Q43910676", "Q56885192", "Q58492697", "Q59162274", "Q6128460", "Q6128651", "Q6141741", "Q6144041", "Q6144043", "Q6144049", "Q6144051", "Q6144058"]}, "date": "2012-09-05", "url": "http://cleveland.com/open/index.ssf/2012/09/hollywood_at_the_dnc_harold_an.html", "content": "<mark>j. scott</mark> applewhite / ap photo \"harold and kumar go to white castle\" actor kal penn addresses the democratic national convention in charlotte, n.c., on tuesday, sept. 4, 2012. geoff herbert, special to cleveland.com in 2008's \"harold & kumar go to guantanamo bay,\" the white castle-loving stoner kumar (played by kal penn) smoked marijuana with a fictional george w. bush. in real life, the 35-year-old actor served as associate director of the white house office of public engagement under president barack obama for two years. \"my favorite job was working for a boss who gave the order to take out bin laden,\" he said at tuesday night's democratic national convention in charlotte, north carolina. \"so thank you, invisible man in the chair, for that.\" the \"invisible man\" penn referred to is pres. obama, who was \"interviewed\" by veteran actor <mark>clint eastwood</mark> at last week's republican national convention. the 82-year-old actor talked to an empty chair as if obama were sitting there, inadvertently starting a internet meme called \"eastwooding.\" according to the new york daily news, penn's speech at the 2012 dnc was aimed to help the obama campaign with reaching younger voters, asking them to register to vote online: \"you don't even have to put pants on!\" penn also told viewers to tweet about his speech using the hashtag #sexyface, and the word instantly became a trending topic on twitter. the hill notes that he and his \"harold and kumar\" co-star <mark>john cho</mark> also appear in a youtube video promoting \"live from charlotte,\" a online program for the dnc to be hosted by penn on thursday night before the president's speech. the convention special will feature celebrities like <mark>marc anthony</mark>, <mark>elizabeth banks</mark>, aisha tyler and olivia wilde. in the 53-second spot, pres. obama is seen calling penn and asking him to take the job seriously as the two actors laugh and munch on junk food in front of the television. other hollywood stars have already appeared at the dnc in charlotte, too. \"glee\" actress amber riley sang the national anthem tuesday night, and celebrities spotted in the audience included \"wings\" actor <mark>tim daly</mark>, patricia arquette, wayne knight, alfre woodard, \"monk\" star tony shalhoub and john leguizamo. according to the guardian, even bigger names will be in town when pres. obama speaks thursday night. <mark>james taylor</mark>, foo fighters and mary j. blige are expected to perform, and actress jessica alba is hosting a convention closing party with musical guests scissor sisters and pitbull. todd williamson/invision/ap this aug. 22, 2012 photo shows betty white attending \"hot in cleveland\" co-star valerie bertinelli's star ceremony on the hollywood walk of fame in los angeles. but will there be a speaker that draws as much attention as <mark>eastwood</mark> at the rnc? perhaps \"off their rockers\" star betty white could do it. as of tuesday evening, more than 12,000 hopefuls have signed a petition and another 35,000 fans joined a facebook group to bring white to the democratic national convention. a similar online campaign in 2010 earned enough support to make the 90-year-old actress guest host for an episode of \"saturday night live.\" cbs reports white endorsed pres. obama for re-election in may, saying she liked \"how he represents us.\" he filmed a birthday greeting for the former \"golden girls\" star earlier this year as well, joking that she didn't believe her age and asked to see a copy of her birth certificate. both obama and vice president joe biden are scheduled to speak at the dnc on thursday. the petition is calling for white to introduce the commander in chief before his speech. what do you think? would you like to see betty white speak at the democratic national convention? could she get as much attention as <mark>clint eastwood</mark>?? the new york times: a tmz moment at the democratic convention? new york daily news: not as many stars attending dnc as they did in 2008"}, {"articleID": "2017081622_00108944_W", "names": {"John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2017-08-16", "url": "http://tv.yahoo.com/tv/seth-meyers-calls-trumps-charlottesville-press-conference-clinically-insane-214031608.html", "content": "Superfan Superfan TV • August 16, 2017 Late night hosts have been sharply rebuking President Trump's handling of the recent events in Charlottesville, Virginia, in which white supremacists clashed with protesters, leading to the death of one woman, Heather Heyer, and dozens more being injured. Trump took several days to specifically address the hate groups' actions but in a recent press conference said there were \"very fine people\" on both sides of the conflict. On Late Night, Seth Meyers spoke out about Trump's refusal to fully condemn the hate groups who participated, saying, \"President Trump this afternoon gave a press conference that can only be described as clinically insane.\" Meyers went on to highlight Trump's comparison of a Confederate general to George Washington. He also highlighted White House Chief of Staff <mark>John Kelly</mark>'s slumped posture during the speech. The late-night host joked, \"Trump is so fully out of his mind he broke a general. That guy's been in wars.\" Seth Meyers ended his segment, titled \"Breaking Crazy,\" with a call to Congress to \"cut bait\" on the President. Watch: \"He is not a president': Seth Meyer's statement on Trump's response to Charlottesville: Read more from Yahoo TV:\" Bachelor in Paradise' Season 4 Week 1 recap: Trouble in you know where Our favorite Elvis Presley TV sightings on the 40th anniversary of his death \"The Walking Dead's' most unforgettable foodie moments: From Crazy Cheese to S’Getti Rings Tell us what you think! Hit us up on Twitter, Facebook, or Instagram or leave your comments below. And check out our host, Khail Anonymous, on Twitter."}, {"articleID": "2015082006_00048169_W", "names": {"Mr. Wonderful": ["Q1388872", "Q190152"]}, "date": "2015-08-20", "url": "http://www.msn.com/en-us/money/technologyinvesting/this-guy-turned-his-failure-on-shark-tank-into-a-dollar28-million-investment-from-richard-branson/ar-BBlScJ9?srcref=rss", "content": "10 States Where Taxes Are Going Up 19 longest-reigning CEOs & copy; Provided by Business Insider Inc IMG_7289. JPG Ring In September 2013, Jamie Siminoff went on ABC's \"Shark Tank\" in hopes of raising $700,000 for his company, DoorBot. He thought it was worth $7 million. His company made a video doorbell that connected to your smartphone, so you could remotely see and talk to the person at the door through your mobile device. The idea was largely based on the fact that burglars tend to ring the bell before breaking in. With DoorBot, you could see who's at the door, and even pretend you're at home when you're not, making it a convenient home security device. Siminoff was already making about $1 million in annual sales then, and he had high hopes of getting one of the \"sharks\" in as investors of his company. But the sharks weren't impressed. One by one, the sharks dropped out, leaving only Kevin O’Leary, also known as \"<mark>Mr. Wonderful</mark>,\" as the last potential investor. O’Leary's offer wasn't too enticing: he'd offer a $700,000 loan, then take 10% of all sales until the loan was paid off. After that, O'Leary wanted to collect a 7% royalty on all future sales, forever, plus 5% stake of the company's equity. Siminoff rejected the offer and walked away with nothing. \"It's that moment when I say you're dead to me, because you don't want to take my offer,\" <mark>Mr. Wonderful</mark> told him. You can watch Siminoff's appearance on \"Shark Tank\" below (it starts at 2:03): Youtube Embed: The most important thing that's ever happened to the business Going on \"Shark Tank\" doesn't guarantee you airtime. Siminoff says when you leave the set, the producers simply tell you, \"Someone will call you.\" \"It's like you literally have no way of contacting anyone when you leave that set that day,\" Siminoff told Business Insider. \"We were like,\" Ah, s--t.' So we just had to block it out as if it just never happened because that was a possibility. We were pretty significantly disappointed by not being able to raise money on the show. \"But DoorBot still had a pretty solid business and was growing fast. It had $250,000 in sales in the month before going on\" Shark Tank, \"all online. And after two months, Siminoff was able to raise $700,000 at a $7 million valuation (the exact amount he had offered the sharks). And a week after raising, he also received a call from the\" Shark Tank \"producers.\" It's going to air, \"they told him. The episode featuring Siminoff ended up airing in November 2013. And as soon as the show aired, DoorBot took off like crazy.\" We think we got at least $5 million of additional sales through the airing of \"Shark Tank,\" ' Siminoff said. \"It just absolutely throttled our revenue, awareness in the market from every level. Everything just popped after that.\" \"It was probably the most important thing that's ever happened to the business,\" he continued. \"It's almost like it gave us a free check.\" Richard Branson's call As the company grew, Siminoff wanted to create a more serious image, and so he changed the name of the company to Ring. His company's credibility went up too, and soon he was able to get into some of the world's top retailers, including Home Depot, Target, and BesetBuy. Now Ring's products are sold in 93 countries worldwide. Its wider reach also led to what Siminoff describes as a \"lucky break\" with one very prominent investor: Richard Branson, the founder of Virgin Group with a net worth of $4.8 billion. & copy; Provided by Business Insider Inc RBransonRing Siminoff says a Ring customer happened to be vacationing at Branson's island a couple months ago. He used Ring to talk to a UPS delivery guy who was at his home in San Francisco. Branson, who happened to be next to that person, saw the interaction and was immediately hooked by the product. In fact, Branson liked it so much, he asked for Siminoff's email address and soon started talking business with Siminoff. He wanted to invest in the product. \"I didn't even figure he'd invest,\" Siminoff said, who at the time was just about to close a Series B round. \"But then he was like,\" What if I send someone right now?' And then I got on with a couple of his guys from his team of investment the next day. \"In less than 48 hours, Branson agreed to join the round. And on Wednesday, Ring made it official: a $28 million funding that gives it a $60 million valuation. Other investors include: Shea Ventures, American Family Insurance, True Ventures, and multiple angels, including Sky Dayton.\" [Branson's team] was actually really careful with their due diligence. Probably more than any other investor we had, \"Siminoff said. Looking back, Siminoff says it's still hard to believe everything unfolded the way it has.\" It's like beyond surreal. I still can't believe it. \"But it also makes him feel pretty good about his business, especially after getting turned down in a public manner by some of the top celebrity investors.\" I think it's a little bit of redemption that I'll take a slight smile on, \"he said.\" But I got to get back to focus, get back to work now. \"NOW WATCH: All the incredibly useful things you didn't know your iPhone headphones could do Go to MSN Home Go to MSN Money Join the conversation Report inappropriate content Sorry! There was a problem. Please try again. Help us maintain a healthy and vibrant community by reporting any illegal or inappropriate behavior that violates Microsoft's Code of Conduct. Select a category Spam Child pornography or exploitation Profanity, vulgarity or obscenity Copyright infringement Harassment or threat Threats of suicide Other Who posted the inappropriate comment (Required) Please write a brief description (Optional) submit Leave your comment More in Money 8 great stocks to own when you retire Kiplinger 10 Things You're Paying Too Much For GoBankingRates 10 states to live in if you want low utility bills Depending on which state you live in, your monthly energy costs can vary widely. The Street The 25 Worst-Paying Cities for High School Teachers Teaching can often be a thankless job. In these 25 cities, high school teachers receive even less financial appreciation than their peers. FindTheBest.com 22 college majors with the highest starting salaries Payscale, the creator of the world's largest compensation database, recently looked at the starting pay for millions of professionals and sorted the results by college major. Here are the top 22. Business Insider How to live off $500 a month at Costco Stretch your budget with groceries from Costco. Cheapism More from Tech Insider Drone on a leash is the affordable flying camera you've been waiting for For most people, the average drone camera is overly complicated. Remote controls, apps, landing gear--it all sounds great until the drone makes a beeline into the nearest tree and the app controller suddenly isn't as precise as you'd like ....Tech Insider The 15 best apps for curing your forgetfulness <p> We all forget things. And sometimes it seems that the technology meant to make our lives easier just gives us more things to forget. </ p> Tech Insider Uber hired a convicted murderer who applied with a fake name, complaint claims *** ImagePlaceholder *** http: //static1.techinsider.io/image/55d5153edd0895f1048b4636-603-452/screen-shot-2013-09-25-at-11.20.39-am.png American Psycho screengrab Thanks to flaws in Uber's background checking system, 25 drivers with criminal records--including murder, child abuse, and assault--were allowed to drive for the car service app in San Francisco and Los Angeles, according a...Tech Insider Tech Insider View the full site"}, {"articleID": "2010021221_00150355_W", "names": {"Raymond Smith": ["Q28203858", "Q28421898"]}, "date": "2010-02-12", "url": "http://wktv.com/news/local/84254927.html", "content": "story created: feb 12, 2010 at 4:07 pm est story updated: feb 12, 2010 at 4:07 pm est fairfield town board votes unanimously to allow wind turbine project local residents fear dangers of more turbines after one collapses turbine collapse draws concern from other proposed project areas on friday, the herkimer county legislature held a special session to vote on a pilot agreement to continue negotiations on the hardscrabble wind project. the project has been in the planning stage for five years already and on friday, the proposal passed with 14 votes in favor and only one abstention from bruce weakley of poland. two legislators were absent from the vote - helen rose of herkimer and jeffrey stone of ilion. last month, the fairfield town board unanimously voted to issue a permit to build wind turbines on hardscrabble road. the council of norway has also expressed its approval in the project. <mark>raymond smith</mark>, chairman of the herkimer county legislature, believes the project is in everyone's interest. \"so, we're not standing in the way of progress,\" <mark>smith</mark> said. \"the legislature feels it's the right thing to move forward with the project.\" the next step is for the industrial development agency (ida) to hold a public hearing for final arrangements. after the ida makes the final agreements, the legislature will need to approve it before the project is officially started. \"i think it's a good thing for the county,\" <mark>smith</mark> said. \"it's going to bring quite a bit of new money into the county.\" <mark>smith</mark> expects nearly $17 million into the county from payments alone, saying construction workers working on the project will stimulate the local economy by staying in motels as well as dining here. previous article ap source: official confirms death of georgian luger radio publicity stunt confuses morning motorists in new hartford radio publicity stunt confuses morning motorists in new hartford oneida county corrections officers indicted for allegedly selling steroids state department of labor: all empire aero employees will be laid off"}]