[{"articleID": "2017111310_00297922_W", "names": {"John Woo": ["Q16887100", "Q55432"]}, "date": "2017-11-13", "url": "http://www.ibtimes.sg/k-pop-band-got7-member-jackson-wangs-presence-mtv-ema-2017-makes-everyone-go-gaga-over-him-19867", "content": "Jackson Wang Instagram The 2017 MTV EMAs hosted by the dazzling \"Your Song\" singer Rita Ora, held at the SSE Arena in Wembley, London on November 12, had lots of eye-catching moments. One of the major highlights of the show was the presence of K-pop member GOT7 member Jackson Wang, who attended the awards show as the official ambassador of Greater China. Soon the social media is abuzz with questions enquiring about this mysteriously handsome guy. Jackson with his good looks and awesome personality has surely left a mark in the minds of people all around the world not failing to show his importance in his debut presence at the 2017 MTA EMAs. Jackson was seen standing next to British star Liam Payne when host Rita was interviewing the former. People all over the world have created a frenzy on Twitter over his presence. Check out their tweets: who is jackson wang bcs he's cute as hell? #MTVEMA--Lizzyrart (@ lizzy_roberts_) November 12, 2017 Okay can someone please send me some hot ass pics of that cute asian who was next to Liam this isn't enough for me #MTVEMA--Gazal (@ Artflavoredsoul) November 12, 2017 Aww Jackson was so nice to us man, we didn't even have time to see him and he quickly came to us, I cried after?? #MTVEMA #Jacksonwanginlondon pic.twitter.com/7MIWd2juVm--Latifah (@ LatifahDankwa) November 13, 2017 \"The hot asian guy beside Liam\" aka Jackson Wang hands down owned the MTV EMAs 2017. I'm so proud of this bb #MTVEMA pic.twitter.com/EsjVNNSfVG--Jea? (@ maneniiiiiiiii) November 13, 2017 I come to twitter to everyone asking \"who's the hot Asian guy next to Liam\" his name is Jackson Wang? #MTVEMA pic.twitter.com/DdglgTO3wq--edniaris? (@ seojohnny_) November 12, 2017 I literally can't breathe...jackson is absolutely gorgeous pic.twitter.com/m38c6wkKGn--londonson (@ sseunah) November 13, 2017 So who's exactly Jackson Wang? Born in Hong-Kong, Wang is singer, rapper, dancer and member of famous K-pop band Got7. He made his debut through the group's 2014 single \"Frozen in Time\". The band is popular for its hit songs like Fly, Hard, Girls Girls Girls, Stop Stop it, A and I Like You. JYP Entertainment took Jackson in 2011 when he signed the production house's talent program in the summer of the same year. He rose to stardom as a member of the boy group GOT7. The top winners of the night included Shawn Mendes (Best Artiste), Coldplay (Best Rock), Eminem (Best Hip Hop), Fifth Harmony (Best US Act) and Camilla Cabello (Best Pop). Moreover, kudos to Jackson on hitting another Jackpot, said one of his fans, who tweeted saying, \"look at this #mtvema impact jacks gained 10k followers on Instagram in one day akssjsjaja .\" look at this #mtvema impact jacks gained 10k followers on instagram in one day akssjsjaja pic.twitter.com/sJFXgzsGjx--londonson (@ sseunah) November 13, 2017 Check out GOT7 Jackson Wang speaking English at MTV EMA 2017: Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup Related BTS members tweet in celebration of their official account crossing 10m followers on Twitter Picture of Song Joong ki, Song Hye Kyo showing off director <mark>John Woo</mark>'s wedding gift breaks internet From Song Hye Kyo to Park Shin Hye: Check out 6 naturally beautiful South Korean actresses without plastic surgery Kim Hee Sun, YoonA join Asia Artist Awards 2017 lineup"}, {"articleID": "2016071114_01033293_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Iain Mcnicol": ["Q29643248", "Q5980556"]}, "date": "2016-07-11", "url": "http://www.morningstar.co.uk/uk/news/AN_1468248204011689400/theresa-may-to-be-next-uk-pm-as-leadsom-bows-out.aspx", "content": "<mark>Theresa May</mark> To Be Next UK PM As Leadsom Bows Out VIENNA (Alliance News) - Britain is set to have a new female Prime Minister as Home Secretary...Alliance News 11 July, 2016 | 3:43 PM Share via Email Add Your Note (Optional): VIENNA (Alliance News) - Britain is set to have a new female Prime Minister as Home Secretary <mark>Theresa May</mark> is the only contender left in the Tory Leadership race, after Energy Minister Andrea Leadsom withdrew on Monday. Graham Brady, the chair of the 1922 Committee that oversees the election, said <mark>May</mark> was the only remaining candidate to become Tory leader. She will be confirmed as the new Conservative Party leader after consulting the board, Brady said. The contest will not re-open, he added. In a speech earlier on Monday, <mark>May</mark>, 59, a remain-campaigner, reiterated that there will not be a second referendum on EU membership. \"Brexit means Brexit and we are going to make a success of it\" , she said. In the June 23 referendum, 52% Britons voted to leave the EU in a surprise and historic move. It remains unclear whether the confirmation will come by the end of Monday or this week. After party confirmation, <mark>May</mark> must meet the Queen, who will return to London only tomorrow or Wednesday. <mark>May</mark> will likely meet the Queen during teatime. The final result of the Tory leadership election was set to be announced on September 9. Brady suggested that now it will not take that long for the announcement. While announcing his resignation in the aftermath of the \"Brexit\" vote, Prime Minister <mark>David Cameron</mark> had said he will continue until October and that the exit talks with the EU should continue under the new PM. Reports suggest that <mark>Cameron</mark> will take his last Prime Minister's Questions on Wednesday, and hand over the role to <mark>May</mark> afterwards. <mark>May</mark> is a known face for the EU. In her campaign manifesto, she said the Article 50, which governs the EU exit process, will not be triggered this year. She has also ruled out a general election before 2020 and abandoned the target of achieving a budget surplus by that year. Her stance on the status of EU nationals living in the UK has attracted criticism. She has only said that they will be part of the \"Brexit\" negotiations, refusing to guarantee that they can remain in the country. Earlier on Monday, Leadsom bowed out from the race, saying she lacked \"sufficient support to lead a strong and stable government\". She had less than 25% backing of MPs. She also said that it was in the interests of the country that a new strong PM is appointed immediately. \"A nine-week leadership campaign at such a critical moment for our country is highly undesirable,\" she said. With over 60% of Tory MPs' backing, <mark>May</mark> is \"ideally placed to implement\" Brexit \"on the best possible terms for the British people and she has promised that she will do so\" , the energy minister said. Leadsom's withdrawal came after she faced severe criticism for her comments in an interview in the Times last week, which implied that being a mother gave her a \"real stake\" in Britain's future. <mark>May</mark> is childless and Leadsom texted an apology to her on Monday, reports said. Responding to Leadsom's withdrawal, <mark>May</mark>'s campaign manager Chris Gayling said her statement showed she is a \"true public servant\" and a decent person. <mark>May</mark> is set to make a statement later on Monday. Prominent \"Leave\" campaigner Boris Johnson called for quick transition of the PM role to <mark>May</mark>. The former London mayor had quit the Tory leadership bid after his close ally Michael Gove launched a surprise bid. Gove, who was eliminated from the race last week, also sought a quick handover of the leadership to <mark>May</mark>. Following the Tory news, Labour called for a general election. \"It is crucial, given the instability caused by the Brexit vote, that the country has a democratically elected prime minister,\" Labour's Election Coordinator Jon Trickett said. \"It is time for the Labour party to unite and ensure the millions of people in the country left behind by the Tories' failed economic policies, have the opportunity to elect a Labour government .\" However, unity in the Labour party seems a distant prospect for now. Leadsom's announcement coincided with Labour MP Angela Eagle's launch of her bid for the Labour Party leadership. \"These are dark times for Labour,\" Eagle said in a statement announcing her formal challenge to Jeremy Corbyn leadership. \"And they are dangerous times for our country .\" Corbyn had publicly declared that he will remain as the Labour Party leader \"come what <mark>may</mark>\" , allowing crucial talks with unions to find a solution to the crisis fall apart. \"Jeremy Corbyn is unable to provide the leadership this huge task needs,\" Eagle said. \"I believe I can .\" Labour Party General Secretary <mark>Iain McNicol</mark> confirmed that there will be a contest for the leadership position. Like the Conservatives, the main UK opposition party has also witnessed chaos after the surprise \"Brexit\" vote. Several members of the shadow cabinet, including Eagle, quit in a revolt against Corbyn leadership. The crisis also led to a no-confidence move against Corbyn that he lost. Eagle, 55, has been the MP for Wallasey. She is openly gay and has championed social causes such as smoking bans, hunting ban and same sex marriages. She had campaigned for the UK to remain in the EU. Copyright RTT News/dpa-AFX"}, {"articleID": "2010101809_00165155_W", "names": {"Abdul Lateef": ["Q4665496", "Q59627598"]}, "date": "2010-10-18", "url": "http://gulfnews.com/news/gulf/qatar/qatar-allays-fears-of-h1n1-outbreak-1.698105", "content": "qatar allays fears of h1n1 outbreak supreme council of health denies new outbreak of h1n1 in qatar, but urges public to get vaccinated against influenza by habib toumi, bahrain bureau chief qatar recently received 40,000 doses of a new version of the seasonal influenza vaccine, which is currently being administered. manama: qatar's supreme council of health (sec) has allayed fears of a new outbreak of h1n1 in the country, following the death of a qatari woman last week. four people have died of h1n1 in qatar since the beginning of the year; the fourth was a pregnant qatari woman. however, the sch was quick to point out that such incidents are sporadic and do not indicate a return of the pandemic. the council, nevertheless, is strongly urging the public, especially high risk groups like pregnant women, to get vaccinated against seasonal influenza as a precautionary measure, qatari daily the peninsula reported on monday. the first death from h1n1 this year occurred in january and was followed by two more deaths in august, one in september and one in october. two of the last four victims were qatari women and the other two were indian nationals. however, the sch did not announce any of the deaths. \"we did not feel it necessary to announce each death because they were isolated incidents. there is no threat of a pandemic in qatar at this moment. the world health organisation (who) has also ruled out the possibility of a new outbreak of the disease,\" said dr mohammad al thani, director of the public health department at sch. however, he added that the latest incident involving the pregnant woman had come as a reminder of the need for vaccinating all vulnerable groups against seasonal flu. \"sch will launch an investigation into this incident to identify the causes and circumstances that led to the death of the woman. the twins she was bearing have been saved and are in healthy condition now. a medical team from the sch will be visiting the family of the deceased to check if any other members in the family are infected,\" he was quoted by the daily as saying. dr <mark>abdul lateef</mark> al khal, head of the communicable diseases section at hmc, said the woman, who was admitted into the intensive care unit of the hmc with pneumonia, was treated normally. \"she was tested negative of the influenza virus even though she was infected. this happens in some patients,\" said al khal. dr mohammad al hajari, head of the health protection and communicable disease control department at sch, highlighted the need for the seasonal flu vaccination. he pointed out that hundreds of people around the world die every year from seasonal influenza. qatar recently received 40,000 doses of a new version of the seasonal influenza vaccine, which is currently being administered. another consignment of 160,000 doses is expected by the end of this month. email a friend emailing an article to friend is a simple way to share a news item. your friend will receive an email with your name and email address as well any personal message you choose to send. the information you provide on this page will not be used to send unsolicited emails. german integration debate heats up chancellor angela merkel's declaration that germany's attempts to build a multicultural society had \"utterly failed\" is feeding a growing debate"}, {"articleID": "2009092317_00123954_W", "names": {"Phil Roe": ["Q1665842", "Q7182346"]}, "date": "2009-09-23", "url": "http://navytimes.com/news/2009/09/military_VA_bonuses_092309w/", "content": "digg news/2009/09 / military_va_bonuses_092309w lawmakers question $30k bonuses for va execs rick maze - staff writer posted: wednesday sep 23, 2009 13:17:19 edt voters and veterans won't understand if the veterans affairs department pays big performance and retention bonuses to its workers, members of a house subcommittee said wednesday. at a hearing that focused on a va inspector general investigation into misuse of retention bonuses in the va's information and technology division and into plans for 2009 senior executive service bonuses, lawmakers urged va officials to make sure extra pay is kept to a reasonable amount and is paid based on performance directly tied to helping veterans. deputy va secretary w. scott gould said revised rules for awarding executive bonuses cap payments at $30,000, lower than previous years. but even a $30,000 bonus can seem like a lot to someone who has no job or a low-paying job. \"that is more money than a lot of people see in a year,\" said rep. <mark>phil roe</mark>, r-tenn., who said he hopes the va keeps economic conditions in mind as it sets payments. <mark>roe</mark>, ranking republican on the house veterans affairs subcommittee on oversight and investigations, said there are counties in his congressional district with an unemployment rate of 17 percent and where \"we are shedding jobs like a dog sheds hair .\" gould said new procedures are in place to make certain performance bonuses are earned, and agreed that the overall economic state of the country needs to be considered. converse 8 sage green composite safety toe boot authentic converse ® athletic fit, comfort and performance with tactical design and non-metallic safety toe. in honor of your military service, you can find regular and name brand products at a special discount. two carrier strike groups to be extended, and yours could be next."}, {"articleID": "2018041900_00286835_W", "names": {"Andrew Mackenzie": ["Q15042554", "Q21456523", "Q4275769", "Q43914061"], "Tom Brown": ["Q1305209", "Q15992805", "Q16194983", "Q16195439", "Q28209484", "Q500029", "Q7002060", "Q7815092", "Q7815094", "Q7815097", "Q7815099", "Q7815100"]}, "date": "2018-04-19", "url": "http://www.mining.com/web/bhp-cuts-2018-iron-ore-forecast-cites-rail-car-upload-problems/", "content": "BHP cuts 2018 iron ore forecast, cites rail car upload problems Apr. 18, 2018, 5:07 PM | PeopleMine Facebook LinkedIn Twitter Email Print Haul truck at an iron ore mine in western Australia. (Image courtesy of BHP .) BHP Billiton Ltd cut its 2018 fiscal year iron ore output guidance on Thursday citing issues in its railroad car unloading system, while reporting an 8 percent rise in third-quarter iron ore production. The miner cut its fiscal 2018 production guidance to between 272-274 million tonnes of iron ore from 275-280 million tonnes. It also narrowed its full-year copper guidance to 1.70-1 .785 million tonnes from the earlier range of 1.655-1 .790 million tonnes. BHP, the world's biggest miner, said its copper production target was affected by a \"slower than planned\" ramp-up in production during the March quarter at its Olympic Dam facility in South Australia. BHP's iron ore output rose to 67 million tonnes in the three months ended March 31, compared with 62 million tonnes a year ago. \"BHP remains on track to achieve six per cent volume growth for the 2018 financial year,\" BHP Chief Executive <mark>Andrew Mackenzie</mark> said in the group's quarterly operations review. The miner said its decision to exit its underperforming U.S. shale oil and gas business last year was going as planned. BHP reiterated it expected bids by June 2018 and added that transactions could be announced in the first half of the 2019 financial year. Sky News last month reported Royal Dutch Shell Plc and U.S. private equity firm Blackstone Group LP were working on a joint $10 billion bid for BHP's U.S. shale assets. Reporting by Rushil Dutta in Bengaluru Editing by <mark>Tom Brown</mark> and Eric Meijer."}, {"articleID": "2018042802_00101282_W", "names": {"Yong Peng": ["Q51570293", "Q58814502"]}, "date": "2018-04-28", "url": "http://www.themalaymailonline.com/s/1625024/the-fight-for-ayer-hitam-begins", "content": "Datuk Seri Wee Ka Siong (pic), Datuk Samsol Bari Jamali, and Ling Tian Soon were almost disqualified today .--Bernama pic AYER HITAM, April 28--Barisan Nasional's (BN) candidates for Ayer Hitam parliamentary and state seats were almost disqualified today after they arrived at the nomination centre a minute later after 9am. In response, their supporters started chanting for Datuk Seri Wee Ka Siong, Datuk Samsol Bari Jamali, and Ling Tian Soon to run to the centre. Shouts of \"calon mana? (Where's the candidate?)\" , \"Suruh dia cepat lari\" (Ask them to run) and \"Dah pukul sembilan! (It's already nine o’clock!)\" were heard as the group arrived at the school. Meanwhile, a sea of red and blue enveloped <mark>Yong Peng</mark> on Nomination Day. About 400 Pakatan Harapan (PH) supporters gathered at PH <mark>Yong Peng</mark> Ops Centre before they marched to SMK Dato Seth at around 7.50 am. Supporters chanted \"Pakatan Harapan\" and \"Hidup Rakyat\" as they marched along Jalan <mark>Yong Peng</mark> to Dataran Gemilang <mark>Yong Peng</mark> food court about a kilometre away for a short break. PH Ayer Hitam candidate Liew Chin Tong said he hoped the nomination process would go smoothly. \"I also hope in the next 11 days the battle here in Ayer Hitam will be able to change the political landscape of Malaysia,\" he said on the sidelines before the march. Meanwhile, at BN's camp, about 400 supporters gathered at Bilik Gerakan MCA <mark>Yong Peng</mark> before making their way towards Dataran Gemilang <mark>Yong Peng</mark>. PH Ayer Hitam candidate Liew Chin Tong said he hoped the nomination process would be incident-free."}, {"articleID": "2015041606_00016124_W", "names": {"Paul O'Connell": ["Q2038034", "Q7152770"]}, "date": "2015-04-16", "url": "http://www.limerickleader.ie/limerick-students-await-day-of-destiny-1-6691795", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Horrific powerlift in Limerick becomes viral sensation <mark>Paul O'Connell</mark> selfie pic was \"perfect timing' Limerick friends appeal for missing student Karen Buckley Widow, 72 sues over exploding lemonade at Limerick store Judge says child is real loser after parents' split Call to name Limerick street in honour of Bobby Sands Developer's\" delight' as € 100m Limerick shopping centre gets green light Collins backs developer behind € 100m Limerick shopping centre Limerick councillor says road will alleviate Corbally traffic STUDENTS from across Limerick will descend on Croke Park next week to take part in the national enterprise final. Business-minded youngsters from Scoil na Tríonóide in Doon and Desmond College in Newcastle West will travel to the capital after being named the most enterprising students in Co Limerick. They will join 300 other students from around the countries at the April 22 showpiece. Students from Desmond College impressed judges of the Limerick Student Enterprise Awards with their project \"Guide a Key'. This is a device which aids people with limited dexterity inserting their key into a lock. It is affixed onto the area around the keyhole, and the user then simply slides their key into the top part of the keyhole. Another Desmond College student, Emily Duffy, 15, will travel to Dublin after winning the first prize in the intermediate category for her product, the imaginatively named\" Duffily Wrap'. Made with metallic bubble wrap, and aluminium, the sleeping-bag inspired product is designed to help the homeless. Emily started working on the idea when she took part in a fundraiser for the Novas Initiatives charity last year. And three best friends from Scoil na Tríonóide will complete Limerick's delegation in Dublin. Jayne Ryan, Lisa Meehan and Aoife Ryan, all 13, approached a number of companies in Limerick including Subway, Diesel, New Look and Wacky Shoes to offer discounts through a special card for second level students. The Enterprise Awards are co-ordinated in Limerick by the Local Enterprise Office. It is the largest programme of its kind for young entrepreneurs in Ireland, with 17,000 students entering from 370 secondary schools. Speaking ahead of the students' trip to Croke Park, the Head of Enterprise for Limerick, Eamon Ryan wished them all well, saying: \"Since last September, budding entrepreneurs from schools all over the county have been researching and running their own enterprises, learning about business in the real-world. The teachers, students and schools participating in the Student Enterprise Awards deserve huge recognition for what they have achieved and the Local Enterprise Office is proud to support them all the way to\" National Final Day' in Croke Park on April 22nd. \"The teams from Limerick will have to impress a tough panel of judges at the final including former enterprise board staff from around the country, management consultants, software developers and entrepreneurs. Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Create your own advertisement or send someone a special message. Limerick Leader provides news, events and sport features from the Limerick area. For the best up to date information relating to Limerick and the surrounding areas visit us at Limerick Leader regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Digital Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2015041621_00038343_W", "names": {"Paul Moriarty": ["Q16107434", "Q3371870", "Q7152604"]}, "date": "2015-04-16", "url": "http://www.komando.com/happening-now/304421/we-have-to-end-swatting-before-somebody-gets-killed", "content": "JavaScript is currently disabled in your browser. In order to watch videos and to navigate this website, JavaScript needs to be enabled. Here are the I've told you about swatting before. It's an idiotic pranking trend popular with online gamers that involves making fake emergency calls to law enforcement in order to send SWAT teams barreling down on the intended target of the prank. One lawmaker in New Jersey is trying to stop it and became a swatting victim himself because of his efforts. Swatting is dumb, dangerous and could get someone killed. That's why New Jersey Assemblyman <mark>Paul Moriarty</mark> is trying to end it for good by promoting legislation that would increase the penalties for people who make prank calls to the police like this. <mark>Moriarty</mark> found out firsthand how dangerous swatting is recently when an anonymous caller reported a shooting at his home. \"I look out my front door. There's six cop cars. They have the street closed off. They have helmets, flak jackets and rifles,\" <mark>Moriarty</mark> said. \"I walk out and walk towards them. They motion me to keep walking towards them. The minute I walked out the door, I was still on the phone with the dispatch person, I said' I think I've just been swatted .' It just then occurred to me what happened .\" "}, {"articleID": "2020010914_00182645_W", "names": {"Mike Burgess": ["Q6846186", "Q6846189"]}, "date": "2020-01-09", "url": "http://www.smh.com.au/world/asia/police-brief-taiwan-authorities-on-alleged-election-bribery-plot-20200109-p53q73.html", "content": "Play video Mr Wang caused an international scandal in November when he told The Age, the Herald and 60 Minutes that he had worked on behalf of a Beijing-directed foreign interference ring targeting independence and democracy movements in Hong Kong and Taiwan. Mr Wang fled to Australia to seek asylum and assist the Australian Security Intelligence Organisation (ASIO). The Chinese government dismissed his claims as false and said he was a convicted criminal, while ASIO director-general <mark>Mike Burgess</mark> issued a rare statement saying his agency took claims of foreign interference seriously. On Thursday, The Age and the Herald revealed that Mr Wang was warned on Christmas Eve and the following days that he could be sent back to China and killed unless he publicly retracted his story and read from a script prepared by a Chinese businessman working together with a senior operative from Taiwan's Kuomintang opposition party, Deputy Secretary-General Alex Tsai. Mr Tsai, who is being investigated by the federal police over his role in the plot, held a press conference on Thursday morning where he denied having threatened Mr Wang. He also denied being involved in the attempt to have Mr Wang falsely implicate the ruling DPP in bribery, instead repeating the allegations the DPP was involved in misconduct. Messages between Alex Tsai (wearing a business suit) and Mr Sun (wearing a hat). And several of Mr Tsai's denials about his involvement in a potentially illegal plot appear to be inconsistent with messages he sent the second man being investigating over the Christmas Eve plot, a Chinese businessman called Mr Sun. In messages obtained by The Age and the Herald, Mr Tsai sent Mr Sun three guarantees that he allegedly agreed to offer Mr Wang if he followed Mr Tsai's directives. Another message between Mr Tsai and Mr Sun. They include promises that the Chinese Communist Party would assist Mr Wang and cease harassing him. While Mr Tsai has also denied having offered financial inducements to Mr Wang, the messages show that he also promised to organise the repayment of any debts held by Mr Wang. In another message, Mr Tsai appears to ask Mr Sun to urge Mr Wang to issue a statement in return for a benefit: \"Please have Wang Liqiang record a video\" , in return for which the Kuomintang would allow him to freely settle in Taiwan. Shortly after these promises were made, Mr Wang was sent a script in which he recants his original claims and states he was paid by the DPP to fabricate them. Other messages show Mr Sun telling Wang Liqiang he was acting on behalf of Mr Tsai's Kuomintang party. Mr Tsai also sent Mr Wang photos of himself with China's President Xi Jinping in what appears to be an attempt to demonstrate his close connections to the Chinese Communist Party. Other messages show the Chinese businessman Mr Sun telling Mr Wang that he was acting on behalf of Mr Tsai's Kuomintang party. \"All your problems will be resolved by the Kuomintang,\" reads one message from the businessman. The AFP is treating seriously the alleged threats and inducements directed at Mr Wang, with sources confirming they opened an investigation in the hours after the first message was received by Mr Wang on Christmas Eve. \"The Australian Federal Police is aware of threats made against a man currently residing in Australia,\" a spokesman said on Wednesday. \"The AFP takes threats of this nature seriously and has commenced an investigation .\" Loading Mr Wang's November television interview sparked a political firestorm in Taiwan. The Chinese government is seeking to unify Taiwan with the mainland despite overwhelming opposition to reunification among Taiwanese citizens, and Chinese influence in Taiwan has become a key political issue."}, {"articleID": "2019102320_00044498_W", "names": {"Francis Collins": ["Q20740726", "Q336658"]}, "date": "2019-10-23", "url": "https://www.voanews.com/science-health/us-gates-foundation-plan-200m-sickle-cell-hiv-cures", "content": "Share on Facebook Share on Twitter Share via Email Print this page Comments Science & Health US, Gates Foundation Plan $200M for Sickle Cell, HIV Cures By Agence France-Presse October 23, 2019 03:29 PM Share on Facebook Share on Twitter Share via Email Print this page Comments FILE - Bill and Melinda Gates are interviewed in Kirkland, Washington, Feb. 1, 2019. The philantropist couple has teamed up with the U.S. government to more forcefully tackle HIV and sickle cell disease. WASHINGTON - The U.S. government and the Bill and Melinda Gates Foundation pledged Wednesday to jointly invest $200 million over the next four years to achieve affordable gene therapy-based cures for sickle cell disease (SCD) and HIV. The administration of President Donald Trump announced earlier this year its intention to end the HIV epidemic over the next decade and has also identified SCD, which disproportionately affects people of African descent, as a condition requiring greater attention. Gene therapy is a relatively new area of medicine designed to replace faulty genes in the body that are responsible for a disorder, and has been responsible for new treatments for blindness and certain types of leukemia. But the treatments are complex and costly, ruling them out as an option for most of the world. <mark>Francis Collins</mark>, director of the National Institutes of Health, said the collaboration would focus therefore on \"access, scalability and affordability\" to make sure the eventual treatments are available globally. The NIH and Gates Foundation aim to achieve clinical trials in the United States and countries in sub-Saharan Africa within the next seven to 10 years. Sickle cell disease is a group of inherited red blood cell disorders characterized by the presence of an abnormal protein in the red blood cells, causing the feet and hands to swell, fatigue, jaundice, and episodic or chronic pain. Over time the disease can harm a patients' vital organs, bones, joints and skin and it is currently only curable via a blood and bone marrow transplant, available to only a tiny fraction of people who have the disease. When it comes to HIV, antiretroviral therapy (ART) are now able to reduce patients' viral load to the point that they are undetectable and cannot be further transmitted. But \"a major goal is to find a cure, whereby lifelong ART would not be required,\" said the NIH's Anthony Fauci. Though SCD is a genetically inherited disease, and HIV is acquired from infection, gene-based treatments are said to hold promise for both, and \"many of the technical challenges for gene-based cures are expected to be common to both diseases .\" The goal for SCD is to achieve a gene-based intervention that either corrects the gene mutation responsible or promotes fetal hemoglobin gene expression to achieve normal hemoglobin function. For HIV, the proposed cure would involve targeting the reservoir of proviral DNA that lurks inside a small number of cells even after many years of ART. The NIH said that approximately 95 percent of the 38 million people living with HIV globally are in the developing world, with 67 percent in sub-Saharan Africa, half of whom are living untreated. Around 1.1 million Americans are affected SCD affects approximately 100,000 Americans, according to official figures. Fifteen million babies will be born with SCD globally over the next 30 years, with about 75 percent of those births occurring in sub-Saharan Africans, said the NIH. Written By Agence France-Presse"}]