[{"articleID": "2019091214_00005444_W", "names": {"Matt Clark": ["Q1768022", "Q22277379", "Q3180807", "Q6788489", "Q6788491"], "Jonathan Bell": ["Q3183317", "Q54932937", "Q6272557"]}, "date": "2019-09-12", "url": "http://www.prnewswire.co.uk/news-releases/lg-signature-at-london-design-festival-2019-uniting-art-and-technology-811071898.html", "content": "LG SIGNATURE at London Design Festival 2019: Uniting Art and Technology News provided by 12 Sep, 2019, 13:00 BST Share this article Ultra-Premium Brand Will Host Exclusive Event with Prominent Artists at Prestigious London Fair LONDON, Sept. 12, 2019 / PRNewswire /--LG SIGNATURE, the ultra-premium brand from LG Electronics, will for the first time be participating at London Design Festival 2019. Exploring the relationship between art and technology and their impact on contemporary design, LG SIGNATURE will be inviting prominent industry leaders to host an exclusive lecture and panel talk while showcasing the latest range of luxury products at this year's prominent event. LG SIGNATURE at London Design Festival 2019: Uniting Art and Technology Under the theme of \"Art Inspires Technology. Technology Completes Art .\" award-winning architects Massimiliano and Doriana Fuksas of \"Studio Fuksas', Antoine Preziuso, one of the world's top luxury watches experts and founder of London based collective UVA (United Visual Artists) <mark>Matt Clark</mark> will join Chung WookJun, head of Home Appliance & Air Solution Design Lab. at LG Electronics to share their insights on how the interaction between technology and art can bring masterpieces to life. <mark>Jonathan Bell</mark>, editor-at-large at Wallpaper * magazine will serve as moderator for the panel discussion which will introduce new perspectives on the ways that technology and art inspire and complete one another. The latest range of LG SIGNATURE products including the OLED TV W, French Door Refrigerator and Bottom-freezer Refrigerator, Wine Cellar, Washer & Dryer, Air Purifier and Air Conditioner will be exhibited in a set designed in collaboration with Wallpaper * .\" We're excited to be participating at this year's London Design Festival and to be able to work with such renowned individuals on this project. We hope this event will provide consumers with an eye-opening experience into the world of technology, through the lens of art, \"said Brian Na, CEO of LG Europe. Visitors to London Design Festival 2019 can experience the LG SIGNATURE exhibition at the East Wing of Somerset House from 18 to 21 September. About LG SIGNATURE LG SIGNATURE is the first ultra-premium brand across multiple product categories from global innovator LG Electronics. Catering to the most discerning consumers, LG SIGNATURE is designed to provide a state-of-the-art living experience that feels pure, sophisticated and luxurious. Combining the very best of everything LG has to offer, the distinctive LG SIGNATURE products were designed with their true essence in mind - streamlined to focus on each product's essential function while maintaining the LG SIGNATURE's modern, signature design. www.LGSIGNATURE.com."}, {"articleID": "2019122701_00054251_W", "names": {"Amit Sharma": ["Q42710044", "Q47150541", "Q4746882", "Q50583295"]}, "date": "2019-12-26", "url": "https://timesofindia.indiatimes.com/city/delhi/businessman-with-bullet-injury-found-dead-in-car/articleshow/72986788.cms", "content": "Delhi: Businessman with bullet injury found dead in car Top Searches: Delhi: Businessman with bullet injury found dead in car TNN | Updated: Dec 27, 2019, 5:35 IST Sachin Agarwal NEW DELHI: A 36-year-old businessman was found dead with a gunshot wound on his right temple in Vivek Vihar area in east Delhi on Thursday morning. A friend of the deceased, who was also with him when the incident took place, claimed that he shot himself. <mark>Amit Sharma</mark>, deputy commissioner of police, Shahdara, said \"The weapon has been seized. Whether the businessman shot himself or not will only be clear once we get the forensic report .\" Police were informed around 11.30 am about a man found dead in an SUV car. The deceased was identified as Sachin Agarwal, a resident of Surajmal Vihar C Block area. He ran a tiles business. Agarwal was in his car outside his house with another friend Prasoon when the incident took place. Prasoon later told police that while they were in the car, he shot himself. Agarwal is survived by his wife and two children. While a police officer said that prima facie it appears to be a case of suicide, his relatives say that he couldn't have committed suicide. \"The weapon used was unlicensed,\" said a police officer. Agarwal, along with his wife and friends, had gone to attend a party at a hotel in his Fortuner car. They all returned in the morning and after having breakfast, he stepped out to drop his friends. \"Agarwal dropped one of his friends after which he and Prasoon were sitting in the car outside his house. Prasoon claimed that Agarwal shot himself soon after which he informed a security guard and called the family members. They rushed him to a nearby hospital but Agarwal was declared dead on arrival,\" the officer added."}, {"articleID": "2015022417_00068535_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2015-02-24", "url": "http://uk.reuters.com/article/2015/02/24/uk-mideast-crisis-britain-schoolgirls-idUKKBN0LS22Y20150224?feedType=RSS&feedName=topNews", "content": "British teenage girls Shamima Begun, Amira Abase and Kadiza Sultana (L-R) walk through security at Gatwick airport before they boarded a flight to Turkey on February 17, 2015, in this combination picture made from handout still images taken from CCTV and released by the Metropolitan Police on February 22, 2015. LONDON (Reuters) - British police said on Tuesday they believed that three London schoolgirls who travelled to Turkey and are thought to be trying to join militant Sunni Islamist group Islamic State, have now crossed into Syria. Friends Amira Abase, 15, Shamima Begum, 15, and Kadiza Sultana, 16, flew to Istanbul from London on Feb. 17. \"Officers...leading the investigation into the three missing schoolgirls from east London, now have reason to believe that they are no longer in Turkey and have crossed into Syria,\" police said in a statement. They gave no further details but said they continued to work closely with Turkish authorities on the investigation. The girls' plight has prompted widespread concern in Britain, with Prime Minister <mark>David Cameron</mark> urging social media firms to do more to deal with online extremism, saying the girls appeared to have been radicalised \"in their bedrooms\". He also said airlines needed new systems to vet children travelling alone. The three are friends with a fourth teenage girl from the same school who police believe is already in Syria, having travelled to Turkey in December. Police said their families, who have issued urgent appeals for their daughters to return, have been surprised and devastated by their disappearance. Security forces estimate some 600 British Muslims have travelled to the region to join the conflict there, some of them with Islamic State. Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance Thomson Reuters is the world's largest international multimedia news agency, providing, and interactive television platforms. Thomson Reuters journalists are subject to an"}, {"articleID": "2014070722_00024651_W", "names": {"Bruce Murray": ["Q4978050", "Q4978052", "Q4978054", "Q961130"]}, "date": "2014-07-07", "url": "http://www.prnewswire.com/news-releases/wanted-launches-canadian-talent-analytics-expanding-its-global-footprint-of-big-data-for-hr-266047171.html", "content": "Canada, extending the Company's coverage of the global talent marketplace WANTED Technologies (TSX-V: WAN), the leading supplier of \"big data\" analytics for the human capital marketplace, announced the launch of its talent supply and demand products for Canada. WANTED provides insight into supply and demand for talent using a data warehouse of more than one billion records describing continuous hiring activity since 2005. The Company's clients, which include corporate HR departments, staffing agencies, and government analysts, use these insights to make more intelligent decisions in areas such as recruiting, workforce planning, economic development, and educational policy. \"We currently are collecting and storing data on hiring activity in more than 150 countries,\" said <mark>Bruce Murray</mark>, President and CEO of WANTED Technologies. \"The launch of our talent analytics product for Canada is the beginning of a series of releases covering key talent marketplaces around the world .\" WANTED's products include both real-time measurements of hiring activity, as well as historical trends for more than 11,000 individual occupational categories. The real-time hiring activity will provide Canadian corporate HR departments and staffing firms with detailed competitive intelligence on hiring and how to overcome recruiting challenges. \"It allows them to make decisions on how to better manage human capital, quickly and easily with real, proven data,\" commented <mark>Murray</mark>. The historical trend data illustrates hiring behavior before, during, and after the recession of 2009, providing financial, economic, and policy analysts a complete measurement of the labor market through the most recent economic cycle. WANTED's cloud-based, global data warehouse is made up of more than one billion records, each containing 100 individual data elements, including the date of a job opening, the occupation, the employer, the location, and the industry of the hiring company. The complete job description with skills, certifications and other requirements for the position is also stored in the WANTED database. In total, the number of data elements in WANTED's database exceeds 100 billion. \"We aggregate hiring demand and talent supply, then make the results available to our clients through our online dashboard, WANTED Analytics ™,\" said <mark>Murray</mark>. \"Clients have access to the data to conduct their own analysis .\" WANTED captures information from online job sites and corporate career sites. In addition to providing its own analytic products, the Company partners with other organizations who access WANTED's data and analytics on an automated basis through Application Programming Interfaces, or APIs. For more information about WANTED ™ helps recruiting organizations make better decisions faster with real-time business intelligence on jobs, employers, and talent. Analytics brings together, for the first time, years of hiring demand and talent supply data to create a true talent intelligence platform for hard-to-fill positions. Clients in the staffing, HR, RPO, media, and government sectors use WANTED Analytics ™ to find sales leads, analyze employment trends, gather competitive intelligence, forecast economic conditions, and source hard-to-fill positions. About WANTED Technologies Corporation WANTED Technologies (TSX-V: WAN) provides real-time business intelligence for the talent marketplace. Founded in 1999, the company's headquarters are in, and it maintains a US-based subsidiary with primary offices in. WANTED began collecting detailed Hiring Demand data in June 2005, and currently maintains a database of more than one billion unique job listings. For more information or to sample WANTED's services, visit www.wantedanalytics.com. WANTED is also the exclusive data provider for The Conference Board Help Wanted OnLine Data Series ®, the monthly economic indicator of Hiring Demand in View fullscreen. More by this Source"}, {"articleID": "2017062816_00006799_W", "names": {"Mike Rivera": ["Q3313520", "Q6848583"]}, "date": "2017-06-28", "url": "https://www.alligatorarmy.com/2017/6/28/15886390/florida-gators-baseball-national-title-highlights-mick-hubert-call-video", "content": "Watch, listen: Highlights from Florida's baseball national title, and Mick Hubert's call \"OH MY! They've done it! They've won it!\" Dunno if you caught that. Wasn't that big a deal. Here are all the relevant highlights, though. National Championship highlights are the best highlights! Check out everything from the 6-1 win, and all the celebration after! #GoGators pic.twitter.com/YwbyOClmOT--Gators Baseball (@ GatorsBB) June 28, 2017 Notable highlights missing from this? Nick Horvath's sweet catch to end the seventh, and the spin move he did after making it; Jonathan India's \"LET'S FUCKING GO!\" after his leadoff double in the eighth inning. (Lamentably missing from it: The saga of the LSU fan quixotically straining for foul balls. Not so lamentably missing: Karl Ravech's play-by-play call .) History...MADE .--Savanna E. Collins (@ savannaecollins) June 28, 2017 That feeling when you win your school's first ever College World Series. pic.twitter.com/jWvaC0Ewj3 Dogpiles are cool. I am also envious of Jackson Kowar's hair. That NATIONAL CHAMPIONSHIP call we've waited so long to hear! #OmahaGators #GoGators pic.twitter.com/kOZZDTOG2x--Gators Baseball (@ GatorsBB) June 28, 2017 Even written out, longtime Florida play-by-play man Mick Hubert's call of the final out is a great one: \"Here's Kowar, coming set. The pitch...swung on, bouncing ball! Second base! Liput! On the outfield grass, throws to first--that's it! The ballgame is all over! Gloves go flying in the air, as the fireworks come bursting out of the stands out in the outfield! The dogpile is on, to the right of the mound, the Gators heaping on one another! Florida has won the national championship in baseball! OH MY! They've done it! They've won it!\" But the best thing I saw last night? The thing that made my heart swell two sizes? It's this video of Florida catcher <mark>Mike Rivera</mark> getting hugged, with a wonderful addition at the end of it. GROUP HUG FOR MIKEY!! pic.twitter.com/JwKZwIcjZW--Gators Baseball (@ GatorsBB) June 28, 2017 At the end of it all--at the end of our lives, which all will end--I think we will be measured by the love we have given, the love we have shared. I see a lot of that love right there. Trending"}, {"articleID": "2010122209_00021890_W", "names": {"Sue Bird": ["Q240672", "Q56682147"], "Tina Charles": ["Q261365", "Q289172"], "Natasha Howard": ["Q16729933", "Q44039100", "Q6968465"]}, "date": "2010-12-22", "url": "http://newshound.montereycountyweekly.com/items/No_89_UConn_tops_UCLA_beats_Florida_St_93_62/forward", "content": "your browser's security settings are preventing some features from appearing. hartford, conn. - men's teams. women's teams. no. 89 belongs to uconn. it beats them all. the no. 1-ranked huskies women's basketball team topped the 88-game winning streak set by john wooden's ucla men's team from 1971-74, beating no. 22 florida state 93-62 on tuesday night. playing with the relentlessness that has become its trademark - and would have made wooden proud - connecticut blew past the seminoles as it has so many other teams in the last 2? years. maya moore had a double-double with a career-high 41 points and 10 rebounds and bria hartley added 21 points for the huskies, who have not lost since april 6, 2008, in the ncaa tournament semifinals. only twice during the record run has a team come within single digits of uconn - stanford in the ncaa championship game last season and baylor in early november. when the final buzzer sounded, uconn players sprinted across the floor to shake hands with the student section as fans held up signs with \"89\" and the huskies logo on them. a couple of other fans raised a banner that read \"the sorcerer of storrs .\" after a brief huddle in front of their bench, uconn players re-emerged wearing \"89 and counting\" t-shirts and bounced around at center court before posing for photos. \"i'm not john wooden and this isn't ucla,\" coach geno auriemma said. \"this is connecticut and that's good enough .\" it is one more chapter of history for uconn, and perhaps the grandest. connecticut long ago established itself as the marquee program in the women's game, the benchmark by which all others are measured. the huskies already own seven national titles and four perfect seasons under auriemma, and they've produced a galaxy of stars that includes rebecca lobo, diana taurasi, jennifer rizzotti, <mark>sue bird</mark> and <mark>tina charles</mark>. the streak, though, takes it to another level, certainly raising the profile of women's basketball and maybe all of women's athletics. two days after beating no. 11 ohio state to tie ucla, uconn toppled the mark in front of a sellout crowd of 16,294 at the xl center that included wooden's grandson, greg, attending his first women's game. \"my grandfather would have been thrilled. he would have been absolutely thrilled to see his streak broken by a women's basketball team,\" the 47-year-old wooden said. \"he thought, especially in the last 10 years, that the best basketball was played at the collegiate level - and it wasn't by the men .\" john wooden, the beloved wizard of westwood, died june 4 at age 99. there was a festive atmosphere throughout the city, where building lights gleamed blue and white, and it was as electric as any final four inside the arena. <mark>charles</mark> and uconn men's star kemba walker sat behind the huskies' bench, and football coach randy edsall was there, too. former nfl star warrick dunn, meanwhile, was cheering for his alma mater, florida state. with the game tied at 6, moore and uconn (11-0) took command. the senior all-american had seven points during a 15-2 run to give connecticut its first double-digit lead, and moore's fadeaway jumper from the baseline extended the advantage to 34-15. florida state (9-3) made a quick run to cut the lead to 11, but the huskies weren't about to let anyone spoil this night. uconn ripped off the next 16 points, capped by consecutive 3-pointers from freshman bria hartley and a pull-up by moore. auriemma gave hartley a kiss at the next timeout, and the tough-to-please coach was still grinning at halftime. \"she doesn't feel any of this,\" auriemma said as he left the court. \"she's kind of immune to all of this as a freshman. i love kids like that .\" uconn's rise to prominence began in 1995, when lobo led the huskies to their first national championship and unbeaten season. since then, the best players in the country have made their way to the rural campus in storrs, 30 miles outside of hartford. the excellence and confidence that defines great teams defines this one because auriemma won't have it any other way. perfection is expected, not simply a goal, and auriemma goes to extraordinary lengths to get it. he goads his players with criticisms of their games - sarcastic remarks that may strike outsiders as harsh but somehow trigger just the right response with gusto. he makes them play games of seven-on-five in practice. he rounds up bigger, stronger male students around campus to serve as practice players. he runs endless drills to hone skills the players thought they had mastered in junior high. it hardly seems to matter who is on the floor because uconn players don't wear names on the back of their uniforms. the only one that counts is the one on the front. when uconn - led by taurasi - won 70 straight games from 2001-03, a record in the women's game, it seemed unfathomable that it would be toppled, like ucla's 88. but what fans have learned over the years is that nothing this team does should be surprising. they have beaten 16 top-10 teams during the latest streak - four more than ucla did during its run - and five of those wins came against the no. 2 team. it's been more than 17 years since uconn lost consecutive games. \"we never talked about the streak,\" said <mark>charles</mark>, last season's national player of the year. \"we were playing for each other, what we did at practice, all the hard work we did, and just trying to do it on the court. there wasn't anything about the streak .\" the huskies have won by any average of more than 33 points during the streak and rarely found themselves in trouble. they have trailed for 134 minutes, including only 13 in the second half. they've won back-to-back national championships, and are now one short of tennessee's record for overall titles by a women's team. even before uconn tied ucla's record, the two programs were linked. auriemma acknowledges that his team runs the same offense that wooden perfected 37 years earlier. but it's not just the xs and os. the top block of wooden's pyramid of success reads: \"competitive greatness: perform at your best when your best is required. your best is required every day .\" that's been auriemma's mantra all along. greg wooden, who lives in california, said he came east because, \"i kind of thought that somebody should come here from the family and show support .\" he also was aware that \"certain players have said they're not really supportive of the streak .\" but he came knowing \"my grandfather would have loved to have been here to see this .\" the day notre dame broke ucla's streak, john wooden was asked how long it would be before somebody surpassed it. \"i have no idea how long it will be before somebody else wins that many. i know it takes at least three years,\" he replied. connecticut forward maya moore (23) drives for a layup in front of florida state forward <mark>natasha howard</mark> (33) in the first half of tuesday's game in hartford, conn. ."}, {"articleID": "2011031205_00068256_W", "names": {"Ryan Harrison": ["Q16223656", "Q53563", "Q7384128"], "Benjamin Becker": ["Q47166941", "Q77176"], "Michael Chang": ["Q11882363", "Q24832289", "Q37393331", "Q53370", "Q57047317"]}, "date": "2011-03-12", "url": "http://news.smh.com.au/breaking-news-sport/tomic-advances-in-indian-wells-20110312-1bs0m.html", "content": "australian teenager bernard tomic vindicated his wildcard entry with a first-round win at the prestigious indian wells masters in california. tomic downed india's rohan bopanna 6-7 (5-7) 7-6 (7-1) 6-4 to set up a second-round clash with serbian 16th seed viktor troicki. but fellow australian jarmila groth crashed out of the women's event with a 7-5 4-6 6-2 second-round loss to italian sara errani. world no. 2 kim clijsters and defending women's champion jelena jankovic had no such trouble, each advancing with easy straight-set victories. clijsters - the 2003 and 2005 champion - swept past russian alla kudryavtseva 6-2 6-0, while jankovic beat american coco vandeweghe 6-2 6-1. elsewhere in the second round there were wins for vera zvonareva, francesca schiavone, yanina wickmayer, marion bartoli, alize cornet, barbora zahlavova strycova and anastasia pavlyuchenkova. in other men's matches, france's julien benneteau defeated spain's feliciano lopez 6-4 6-4 to reach the second round. benneteau and tomic was joined by milos raonic, pablo cuevas, ricardo mello, <mark>ryan harrison</mark>, philipp petzschner, santiago giraldo, <mark>benjamin becker</mark>, florent serra, igor andreev and lukasz kubot. world no. 1 rafael nadal opens his campaign on saturday taking anything for granted as he seeks to snap a string of back luck this season with a first-up win over south african rick de vost. \"the goal is to win my match tomorrow,\" nadal said. \"i felt i was in very good position at the start of the season. i am just trying to find again the performance of the beginning of the season .\" if i start winning matches then everything is going to be a little bit easier. \"indian wells is just nadal's fourth tournament of the season. in his last outing earlier this month he won both his davis cup matches for spain .\" every day i'm playing better. every practice i am improving, \"said nadal .\" i have to play well tomorrow to be in the second round. so that's what i gonna try. \"it's impossible to be playing perfect all the time, but i hope to be playing well this week .\" the 24-year-old spaniard ended a five-week layoff in the first-round davis cup tie against belgium. he seeks another deep run at indian wells after losing to ivan ljubicic in last year's semi-finals. the nine-times grand slam champion had a promising start to 2011 but his season got derailed when he crashed out of the australian open on january 26 after struggling with a thigh muscle tear in a quarter-final match against compatriot david ferrer. his loss to ferrer deprived him of a \"rafa slam' - a fourth straight non-calendar year grand slam after winning the french open, wimbledon and us open crowns last year. but even before the leg injury, nadal said he was battling a virus .\" this year i started the season a little bit of unlucky because i get sick in doha, and i was playing really well at the time, \"he said. nadal could join us legends jimmy connors and <mark>michael chang</mark> and world no. 2 roger federer as a three-time winner at indian wells. bangladesh captain shakib al hasan has pledged his team will\" fight to the end \"to secure qualification for the world cup knockout phase. anxious wait for souths star burgess south sydney face an anxious wait with star forward sam burgess to see a specialist this week. cowboys start the year with a big scalp the old firm of thurston and bowen fired the cowboys to a 16-14 nrl season-opening upset of brisbane on friday night. pollard powers windies to beat ireland kieron pollard has inspired the west indies to a 44 run win over a defiant ireland and helped them one foot in the world cup quarter-finals. manou ushered out of cricket former australian wicketkeeper graham manou has been ushered out the gates of adelaide oval, stressing the decision to retire was his to make. bangladesh stun england at cricket wc lion-hearted bangladesh have stunned england by two wickets to keep alive their world cup quarter-final hopes. proteas look to repeat nagpur magic south africa's cricketers are hoping for a repeat of nagpur magic when they meet india in a world cup group b clash on saturday. panthers have inside story on henry penrith are in no doubt about what to expect from newcastle young gun beau henry when he makes his nrl debut. india captain banks on openers to fire india skipper mahendra singh dhoni is looking to his openers to fire against south africa at nagpur on saturday."}, {"articleID": "2011123014_00110190_W", "names": {"Ashley Westwood": ["Q10857014", "Q59428"], "Steve Davis": ["Q1275803", "Q16201101", "Q30122863", "Q310450", "Q3529787", "Q7612349", "Q7612350", "Q7612351", "Q7612353", "Q7612354", "Q7612355", "Q7612356", "Q7612358"], "Andy White": ["Q18159160", "Q1878971", "Q4761470", "Q4761471", "Q4761473", "Q528036"], "Andy Hamilton": ["Q1379814", "Q18619609", "Q371382", "Q4760759", "Q4760760", "Q526108"]}, "date": "2011-12-30", "url": "http://clubcall.com/crewe-alexandra/westwood-set-for-alex-starting-spot-1360518.html", "content": "<mark>ashley westwood</mark> is pushing for a recall to the crewe starting line-up for their new year's eve clash with bristol rovers. midfielder <mark>westwood</mark> lost his place after being dismissed in the fa cup encounter against colchester, with loanee jamie lowry impressing during his subsequent three-match suspension. the 21-year-old has only made substitute appearances in the draw with crawley as well as the 3-0 loss at bradford, and now alex manager <mark>steve davis</mark> has hinted <mark>westwood</mark> justifies a return to his starting xi. \"i thought he came off the bench at bradford and got hold of the ball for us and passed it better,\" <mark>davis</mark> told the club's official website. \"he got a grip on the game a bit and the chances we created came from that .\" he also offers us better quality at set-plays and corners and of course he can take a penalty. \"joint-top scorer shaun miller will serve the second game of a three-match ban for a straight red card against crawley, while young left-back <mark>andy white</mark> is <mark>davis</mark>' only injury concern. here are some betting tips from betfair's tipsters: david cleary says: back street entertainer in the 16:00 at taunton @ 9.0 nick shiambouros says: back rowan tiger in the 14.20 at taunton to win and place timeform daily says: back royal acclamation @ 6.8 in the 15:20 at lingfield jaymes monte says: back kim huybrechts to beat <mark>andy hamilton</mark> @ 2.5"}, {"articleID": "2017072220_01183562_W", "names": {"Robert Lang": ["Q16731223", "Q2157973", "Q56433508", "Q914398"], "Jim Vance": ["Q16106127", "Q27042411"]}, "date": "2017-07-22", "url": "http://www.wbal.com/article/253488/2/longtime-washington-news-anchor-jim-vance-dies-at-age-75", "content": "WBAL's <mark>Robert Lang</mark> and NBC 4's <mark>Jim Vance</mark> at the University of Maryland in March WASHINGTON (AP)--A longtime television news anchor in the nation's capital has died. WRC-TV President and General Manager Jackie Bradford said in a statement that <mark>Jim Vance</mark> died Saturday morning. He was 75 years old. <mark>Vance</mark> told viewers earlier this year that he was undergoing treatment for cancer. <mark>Vance</mark> joined the NBC station in 1969 and moved to the anchor chair in 1972. The Washington Post reports that <mark>Vance</mark>'s 11 p.m. shows with longtime broadcast partner Doreen Gentzler regularly attracted more viewers than the prime-time programs on the three major cable networks combined. Bradford said <mark>Vance</mark>'s was \"not only the soul of NBC4 but of the entire Washington area .\" Washington Mayor Muriel Bowser tweeted that <mark>Vance</mark> was a \"steady voice who shared the news - good or bad - with grace .\" <mark>Jim Vance</mark>'s smooth voice and calm presence made viewers feel like, no matter how bad the news was, it would be OK. https: //t.co/hwoPOiT6wO"}, {"articleID": "2019040210_00281310_W", "names": {"Adam Marshall": ["Q16732034", "Q22237120"]}, "date": "2019-04-02", "url": "http://feeds.manchestereveningnews.co.uk/~r/menews/~3/9uhjErjTDq8/british-businesses-slowing-down-amid-16062802", "content": "Get the biggest daily stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email A new study shows that growth in the UK economy has practically \"ground to a halt\" due to the lack of clarity surrounding Brexit. The British Chambers of Commerce (BCC), who produced the report, concluded that exports, orders, investments, and cashflow have all been affected by the uncertainty over the UK's relationship with the EU. Surveying 7,000 businesses with one million workers collectively, the results highlighted how services and manufacturing firms were being negatively impacted. Looking at the first three months of the year, the BCC said that the study indicated that businesses were \"hitting the brakes .\" The BCC has called for an end to the lack of clarity and the \"relentless uncertainty\" over Brexit, which it says has hurt investment plans and business confidence. Head of economics for the BCC, Suren Thiru, said: \"\"Our latest survey suggests that UK growth nearly ground to a halt in the first quarter of 2019, with increasing anxiety over Brexit and weakening global economic conditions driving a significant deterioration in almost all the key indicators in the quarter .\" The services sector suffered the more substantial loss of momentum in the first quarter, with both domestic and international activity slowing sharply in the quarter. \"The manufacturing sector continues to struggle amid tougher global and domestic trading conditions and rising cost pressures .\" The forward-looking indicators are disappointingly downbeat with weakening orders, confidence and investment intentions pointing to precious little growth over the coming quarters, unless substantial action is taken. \"Dr <mark>Adam Marshall</mark>, director general for the BCC, added:\" Our findings should serve as a clear warning that the ongoing impasse at Westminster is contributing to a sharp slowdown in the real economy across the UK. Business is hitting the brakes - hard."}]