[{"articleID": "2015092701_00084532_W", "names": {"Brian Jenkins": ["Q4964201", "Q4964202", "Q4964204", "Q50365977"], "Sue Smith": ["Q15040075", "Q16150449", "Q21458567", "Q24809547", "Q530143", "Q57451503"]}, "date": "2015-09-27", "url": "http://www.pennlive.com/midstate/index.ssf/2015/09/pope_francis_homeless_philadel.html#comments", "content": "What happened to Philly's homeless while Pope Francis was in town? Comments This is a good, spiritual event, but you don't hear anyone talking about the homeless. \"Lanir Evans PHILADELPHIA--As Pope Francis prepared to take the podium at Independence Hall, a group of 15 men and women departed from Chosen 300 Ministries. They weren't tardy pilgrims making the last-minute trip. They set out on foot, guiding hand carts full of food and water across a mile of cracked pavement, over cement barriers and through the long line at a security checkpoint en route to the Benjamin Franklin Parkway. The group typically makes its deliveries via car .\" We've been doing this every Saturday for 19 years, \"said Executive Director <mark>Brian Jenkins</mark>, as he led the procession down an eerily vacant Broad Street .\" We're not going to miss a day. \"The parkway, a thoroughfare that runs from City Hall down to the Museum of Art, has become the epicenter of the pope's visit with key stops and a parade along its length. But it also has long housed a large contingent of Philadelphia's homeless population. In a city with a fraught history of dealing with its poorest citizens, preparations for dealing with the homeless during Pope Francis' visit began many months ago. It involved the relocation of homeless residents from the papal security zones, although they were allowed to re-enter certain areas--such as the parade route--on Friday morning. <mark>Jenkins</mark> and a number of the homeless themselves say Philadelphia displaced a group of people for whom the pope has become a strong advocate. City officials say their efforts were a necessary part of the Secret Service protocols and that they were particularly sensitive to the needs of the homeless .\" The city failed and they put the homeless last on the agenda, \"said <mark>Jenkins</mark>, whose group was one of four charities who successfully sued to block the city's ban on feeding the homeless in 2012. Marie Nahikian, the city's director of supportive housing, said the sweeps of the parkway and Independence Mall succeeded with some homeless individuals where previous outreach attempts had failed. In all, some 200 residents were directed to shelters and other resources made available during the pope's visit .\" We know many of those residents by name, \"she said .\" We've spent a lot of energy, with our nonprofit partners, making sure everyone understood what was going to happen. \"A number of those homeless residents accepted help from the teams for the first time during the lead-up to the pope's visit, Nahikian said. That was due, in large part, to the increased manpower funneled into the effort .\" Certainly, the additional resources helped, \"she said .\" People, by and large, don't want to be homeless. They just need to understand and trust that they can make a better choice. \"<mark>Sue Smith</mark>, vice president of residential and homeless programs for Project HOME, said the homeless were inconvenienced about as much as the average resident--no more or less. The nonprofit provides social services, including homeless outreach teams, through a contract with the city .\" So far, everyone sort of understands that these are strange times, \"she said .\" Whether you're homeless or not, you're going to be inconvenienced. \"Based on what she had seen, <mark>Smith</mark> said nobody was forced to do anything. In at least one case, she said, an individual with a shopping cart full of possessions was able to take them with her in a van. <mark>Smith</mark> said a normal late-night shift may have one or two outreach teams working citywide. Nahikian, meanwhile, said six teams were on the ground for the sweeps on Thursday and Friday. During the pope's visit on Saturday and Sunday, five teams and one back-up team were working to respond to any homeless individuals in distress. Adam Bruckner, another homeless advocate who has been critical of the city's past policies, said its plan for the papal visit looks good on paper. But it's too soon to judge how well it actually worked in practice, said Bruckner, who heads Philly Restart, a nonprofit that provides ID to homeless residents, among other programs .\" It has not been for lack of planning, \"he said .\" I think they're very aware that this is a big issue. They don't want to look to be against the homeless at the same time the pope is in town. \"The city has also distributed meal vouchers for the homeless to use during the pope's visit, although <mark>Jenkins</mark> said he's heard of many people who have yet to see them. Those who did reported that the vouchers were for eateries outside of the papal security zone. Eva Gladstein, who lead's Mayor Michael Nutter's Office of Community Empowerment and Opportunity, said she has not heard of any problems associated with the vouchers. The city meanwhile, had already reached an agreement that would allow <mark>Jenkins</mark>' group to distribute food within the security zone, Gladstein said. Even so, the process would still be difficult .\" Logistically, even finding the (distribution) site would be difficult given the number of people there, \"she said. <mark>Jenkins</mark> said the city's agreement allowed Chosen 300 to use a vehicle to haul the food. Unfortunately, he said, the parking spot was just three blocks closer to the parkway from the charity's headquarters. Homeless During Pope Francis Visit <mark>Brian Jenkins</mark>, of Chosen 300 Ministries, led a group of volunteers bringing food to homeless along the Pope Francis parade route. That ultimately prompted the group to make its journey across a mile of cordoned-off city streets to its usual spot near JFK Plaza along the parkway. At one point, the contents of the carts--chicken wings, potato salad, chips and water--had to be offloaded in order to get through concrete barriers .\" I wonder if (Pope Francis) knew what we were doing, would he really be down there? \"Jason Doctor, one of the volunteers, muttered as the group approached a checkpoint at 15 th Street and Cherry. Once the group arrived, they were detained as agents tried to determine whether they could pass through the checkpoint. A half-hour later, they were waved through. A group of people began to converge upon Chosen 300's impromptu food kitchen almost as soon as the carts were unloaded near JFK Plaza .\" He assured us he'd be here today and he is, \"said Russell Price, 62, who was driven to the streets after a fire destroyed his apartment two years ago. He has come to rely on <mark>Jenkins</mark>' group to help out. The presence of thousands of papal spectators lined up along the Benjamin Franklin Parkway, a short distance away, wasn't lost on Price and the others .\" The pope is supposed to be for these people, \"he said .\" Why is Bryan the only one out here? \"A similar sentiment came from Lanir Evans, 48, a former cook who was left homeless amid mounting medical bills related to blood clots found in his brain. His father recently helped pay for a room to keep him off the streets, but Evans still comes down to the open-air food line when his own pantry runs bare .\" This is a good, spiritual event, \"he said, motioning to the throngs of faithful around him,\" but you don't hear anyone talking about the homeless. \""}, {"articleID": "2014041602_00014782_W", "names": {"Bill Brown": ["Q16188871", "Q2667644", "Q27147689", "Q4908278", "Q4908280", "Q4908282", "Q4908284", "Q4908288", "Q4908289", "Q4908293", "Q861987"]}, "date": "2014-04-15", "url": "http://www.independent.com/news/2014/apr/15/morua-pleads-guilty-dui-and-fatal-hit-and-run-char/", "content": "Morua Pleads Guilty to DUI and Fatal Hit-and-Run Charges Will Be Sentenced to 20 Years to Life in Prison Judge James Voysey (center) accepts guilty pleas from Raymond Morua (right) with attorney Darryl Genis Morua appeared in court dressed in a dark suit and shed silent tears as he pleaded guilty to felony charges of gross vehicular manslaughter while intoxicated (which carries a sentence of 15 years to life) and fleeing the scene (which carries a sentence of 5 years). The terms will be served consecutively, and the crimes count as a strike on his record. Morua also admitted to two prior DUI convictions. He will be formally sentenced on May 28, and has agreed to issue a formal apology to the Dies family, pay restitution, and participate in an anti-drunk driving video. You're right John. We should all just kill ourselves and let nature take back the earth and it will be like we were...Bottom Line: <mark>Bill Brown</mark> blew it badly by NOT closing down the streets as authorized by the Supes. His excuse that it could...Draxor on \"Teams Retrieve Body of Man Swept out to Sea During Baptism\" blahblahmoreblah on \"Man Accused of Assaulting Officer Competent to Stand Trial?\" Either Atascadero or Patterson for this guy, but DO NOT DISMISS CHARGES AGAINST HIM. The guy is one of those people whom \"trouble...Small water price to pay for the dam totally effing up the Santa Ynez river and its steelhead habitat. The fish were here...How could such a high-density utopia flounder so badly. Perhaps we need an\" I.V. Injunction \"where no one under 25 can go to...AZ2SB on\" Man Accused of Assaulting Officer Competent to Stand Trial? \"The man has issues, which our mental health system will probably never be able to resolve."}, {"articleID": "2015031201_00017245_W", "names": {"John Howard": ["Q1467025", "Q51330", "Q5670833", "Q58363217", "Q6228200", "Q6236889", "Q6240028", "Q6240032", "Q6240035", "Q6240041", "Q6240047"]}, "date": "2015-03-11", "url": "http://www.abc.net.au/lateline/content/2015/s4195092.htm", "content": "Email Australian Broadcasting Corporation Reporter: Margot O'Neill In the online and mobile age, big companies are already collecting lots of information about us. The concern now is what the government intends to use it for. Transcript EMMA ALBERICI, PRESENTER: Some time in the past decade, what it means to be a \"private citizen\" changed. Tonight, we're going to examine the concept of privacy. What does it mean any more? And what's the Government doing snooping around our metadata? Shortly we'll cross to the US to speak to Bruce Schneier. He's one of the world's leading experts in online security. But before we get to that, let's talk about just how much of what we do and say is being tracked. EDWARD SNOWDEN, NSA WHISTLEBLOWER (The Guardian online, July 2014): Why are our private details that are transmitted online, why are our private details that are stored on our personal devices any different than the details and private records of our lives that are stored in our private journals? EMMA ALBERICI: Edward Snowden blew the whistle on how states and corporations are furiously scooping up what we thought was our private information. In the main, we don't think too much of protecting ourselves from the prying eyes of the Government. It's the trade-off, right? For the great convenience of having a phone in your pocket that's also an internet connection, a gaming tool, cinema and recording device. Giving up some of our privacy also doesn't seem so bad if it means we'll all be safer; if it's going to help authorities catch terrorists. But are we giving away too much? Australians wouldn't cop it when the Hawke government tried to introduce the Australia Card. Back in the mid-80s, they wanted us all tagged and numbered on one centralised ID card combining information from 13 government agencies into one database. You'd have to present your card to open a bank account, buy or sell real estate or get a job. All that was to stop tax and welfare cheats. But opposition came fast from both the left and the right. <mark>JOHN HOWARD</mark>, FMR OPPOSITION LEADER (1987): It accumulates an enormous store of information on all of us throughout the country. PETER GARRETT, MIDNIGHT OIL (1987): By numbering Australians, we now ensure that governments of the future can control us. EMMA ALBERICI: The Australia Card, though, was nothing compared to what's being proposed today. And this time the idea is supported by both major parties. They want internet and phone companies to store all our so-called metadata for two years. They want to keep the times and dates of your phone calls, how long the calls lasted, who you spoke to and from where the call was made. Likewise for your emails: where and when they were sent and received and who they were sent to. The actual content of your calls and emails won't be included, but police will have access to all the rest without the need for a warrant. Companies are already collecting all this information. The concern now is what the Government intends to use it for. Margot O'Neill conducted a little social experiment on how much we value our privacy. (footage of a café) CUSTOMER 1: Can I get a small hot chocolate? CAFE EMPLOYEE: Small hot chocolate? CUSTOMER 1: Yep. CAFE EMPLOYEE: That's $2.50. CUSTOMER 1: Thank you. CAFE EMPLOYEE: Can I see your four last text messages? CUSTOMER 1: Pardon? CAFE EMPLOYEE: Can I see your four last texts? CUSTOMER 1: Ah, sorry? (cut to second customer at till) CAFE EMPLOYEE: Where's your home? Can I have the address? (customer 2 simply smiles) CAFE EMPLOYEE: OK, can I have the email address? CUSTOMER 2: I haven't got an email. No. CAFE EMPLOYEE: Can I have your phone number? CUSTOMER 2: Why? (cut to third customer at till) CAFE EMPLOYEE: Um, can I see your last four text messages? CUSTOMER 3: Hey? CAFE EMPLOYEE: Your last four text messages. CUSTOMER 3: My what? (laughs) (Employee laughs. Cut to fourth customer at till) CAFE EMPLOYEE: Where were you last night at 8 o'clock? (Customer 4 laughs) EMMA O'NEILL, REPORTER: Every hour, every day, we're haemorrhaging personal details on the internet: what we buy, where we are, who we contact. We're being harvested, often surreptitiously. We wouldn't put up with it in the real world, which made us wonder: what if a shop assistant behaved like an online app? CAFE EMPLOYEE: Can I have your email then? CUSTOMER 5: My email (laughs)? CAFE EMPLOYEE: Your email. CUSTOMER 5 (laughing): No. . No. . CAFE EMPLOYEE: We want to try to provide a better service. CUSTOMER 6: You want to provide a better service in knowing what I did, 8 o'clock at night? CAFE EMPLOYEE: Yep. CUSTOMER 6: For what reason? CAFE EMPLOYEE: Just provide a better service. CUSTOMER 6: Explain it to me. EMMA O'NEILL: Our little hidden camera experiment was inspired by a recent Danish consumer campaign, which also shows that people don't like sharing personal information with strangers. CUSTOMER 1 (Danish consumer advertisement, translation): My telephone number? (Laughs) Then I want yours too. CUSTOMER 2 (Danish consumer advertisement, translation): No way. No, I refuse. EMMA O'NEILL: There's so many slick, fast, convenient services because of the digital economy. But the price is a slice of your life. Apps like Facebook, Instagram, Snapchat, Twitter and Messenger, to name just a few, can access your contacts, calendar, messages, photos, texts and your location data - which, by the way, may not be considered personal information under Australian law. Hey, check this out: deep in my privacy settings there's a thing called \"frequent location\" which shows exactly when and where, for how long I've been, even providing a handy little map. I think I'll just be turning that off. The average Australian now connects to the internet through four or five different devices: smart phones, tablets, PCs, laptops, TVs, work computers. From morning to night, your digital exhaust is logged for the global information economy. And most of us don't really understand what that means. Behind every keystroke there's a global buyer's market, itching to target who they think you are. Searching for a holiday, an abortion clinic, a cure for herpes: Google and its advertisers go there with you. (to Wade Alcorn) Is it our fault? Are we not reading privacy policies? WADE ALCORN, CYBER SECURITY EXPERT: I think those privacy policies are massive and you pretty much need a legal degree to understand them. (excerpt from AAMI advertisement) ACTOR (AAMI Safe Driver App advertisement): Are you ready for this? ACTOR (AAMI Safe Driver App advertisement): Bring it on, muchacho. EMMA O'NEILL: Using AAMI's safe driving app, AAMI hopes it will help uncover dangerous traffic spots to make the road safer. But it can also record when you speed or if you're in an accident. And it could turn over that data to the police if legally required to do so. AAMI says currently the data won't negatively affect insurance premiums, but there's no guarantees about the future. (excerpt ends) EMMA O'NEILL: And that's true of just about all data collection: it can be repurposed. WADE ALCORN: Maybe in a few years' time they can use it in a whole different way that isn't what you initially intended when you provided them access to your data. EMMA O'NEILL: Mega-data corporations like Google and Facebook say, \"Don't worry. The data's anonymous. Only machines read it to better target personal ads .\" But Stanford University researchers found that by analysing even limited information from mobile phones, they could predict individual medical conditions, hobbies and relationships. WADE ALCORN: For example, your GPS data: possibly, if an application is tracking where you're going, they may be releasing that information or, rather, selling that information on around how often you visit the doctor. EMMA O'NEILL: Companies also say we can trust them to keep the data safe. (excerpt from the film \"The Lord Of The Rings: The Fellowship Of The Ring') IAN McKELLEN (as Gandalf): Keep it secret. Keep it safe. (excerpt ends) EMMA O'NEILL: But last year computer hack attacks surged worldwide by 48 per cent. In Australia, companies don't have to tell the public if their information has been compromised. Some experts say there's really only two types of organisations: WADE ALCORN: Ones that have been hacked and ones that don't know they've been hacked. EMMA O'NEILL: And if it's not crooks hacking your data, governments want your stuff. All of it, apparently. The US electronic spy agency, the NSA, is like an intelligence super-trawler slurping up everything it can from internet servers around the world, including Australia. (excerpt from the film\" Signs'. Two children are wearing hats made of aluminium foil) RORY CULKIN (as Morgan): So the aliens can't read our minds. (excerpt ends) EMMA O'NEILL: It's no wonder encryption is becoming more popular. Getting off the grid is even becoming cool: like fashion wear with shield pockets to block mobile phone signals. Just ask Malcolm Turnbull. The Federal Communications Minister admits using the secret messaging app Wickr, which encrypts and then destroys messages. (to Wade Alcorn) Do you use encryption? WADE ALCORN: Absolutely, absolutely. Yeah. Absolutely. For business purposes, to ensure that communications are secure and also for personal communication as well. EMMA O'NEILL: And what should you do when you're asked to give up personal details? (footage of café) CAFE EMPLOYEE: Can I have your e mail? CUSTOMER 7: No, I don't hand out my private information. CAFE EMPLOYEE: OK. Can I have your phone number please? CUSTOMER 7: No, unfortunately not. You can't have that either. JUANITA PHILLIPS, NEWSREADER (ABC News, Feb. 10): The technology giant Samsung has admitted that its new Smart TV could be eavesdropping. EMMA O'NEILL: Now, you probably don't want to hear this but the potential to hack your life is about to get much worse. A new wave of wearable technology, like the Apple Watch, will be able to transmit every heartbeat, every footstep, every REM sleep cycle. And in the next decade, a looming tsunami of sensor-driven technology built into your home, your car, your office will mean just about every gadget from your desk chair to your fridge will be able to gossip about you on the internet. Cyber privacy is dead and we all have to get over it. At least, that's what Silicon Valley executives have been predicting for the last 15 years. No-one could have predicted how quickly, how willingly we would just give away our privacy. And there's no going back. But with technology now running so far ahead of consumer awareness and legal safeguards, a fight-back may be stirring. You can Google it - or maybe not .----------------------------------In response to a story posted by ABC News Online, AAMI provided the following statement: \"We are very disappointed in ABC Lateline's web story this afternoon on the AAMI Safe Driver App. We view running such a piece based on highly unlikely scenarios as scaremongering .\" The intention of the app was never to collect data to provide to police nor have the police request data from us. This is no different from the obligations we have today. Every company is required to provide information to police when legally compelled to do so. \"Our pilot study of the App involving more than 1000 drivers suggested that it had a significant positive impact on the way people drive .\" "}, {"articleID": "2015032907_00002411_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}, "date": "2015-03-29", "url": "http://www.caughtoffside.com/2015/03/29/jordan-henderson-wants-to-be-at-liverpool-for-years/", "content": "Jordan Henderson vowed to stay at Liverpool for \"many years' and said he wants to do the best for his club and country. Nine hidden Premier League stars who could be the next <mark>Harry Kane</mark>, featuring Arsenal duo & Liverpool wonderkid (Image) Former WAG of Liverpool's Daniel Sturridge looks fed up on makeup-free shopping trip The 24-year-old will have only one-year left on his Liverpool deal at the end of the season amid claims he has rejected a new deal at Anfield but according to the Daily Star he has now said he wants to remain at the club .\" The contract issue is definitely not a distraction and it's not a major issue, \"said Henderson, reports Daily Star .\" I love playing for Liverpool and I want to be there for many years. \"Henderson added that whilst everyone else will make an issue of it it does bother him that he has yet to agree to a new contract .\" ...for me, it's just letting my agent and the club deal with it and whenever it gets sorted, it gets sorted. \"All I want to do is my best for club and country. Contracts and stuff can be sorted out by clubs and agents .\" That's why we've got agents and hopefully this can get done soon. \"All I want to do is concentrate on my football and not let this get in the way .\" "}, {"articleID": "2017111805_00325423_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2017-11-18", "url": "http://heraldscotland.com/opinion/15668612.Alison_Rowat_s_week__billionaires_in_need__no_escaping_blonde_ambition_of_the_Johnsons__high_five_to_one_brave_dog/", "content": "Alison Rowat's week: billionaires in need; no escaping blonde ambition of the Johnsons; high five to one brave dog 0 comments BILLIONAIRES IN NEED AS Christmas approaches there is no shortage of appeals to your charitable instincts. Should you give to this good cause or that, buy one charity's Christmas cards or another's? It's a strain on both principles and wallet. Nevertheless, there is one cause that is exceptional, and so worthy of your immediate attention that you will be ashamed for not thinking of these poor souls before. Yes, it's billionaires. Loading article content The Swiss bank UBS estimates there are 1542 of them in the world. America has the most (563), then China (318) and Germany (117). If you prefer your good causes to be local, the UK has 55. Their plight came to light this week with the sale of Leonardo da Vinci's Salvator Mundi for £ 341 million--the highest price ever paid for a painting. Searching for an explanation as to why anyone would hand over so much, the Today programme turned to Georgina Adam, author of Dark Side of the Boom: The Excesses of the Art Market in the 21st Century (yours for a very reasonable £ 19.99 on Amazon, as owned by Jeff Bezos, the world's number one billionaire). Ms Adam said the market was being fuelled by \"the sheer amount of money that billionaires have\". If you are worth tens of billions, £ 341 million is not a huge chunk out of one's fortune. Suddenly, the plight of billionaires became all too clear. It's supply and demand, innit? There are only so many London townhouses, Manhattan apartments, yachts, diamonds, bottles of rare wine and private islands in the world. Yet the number of folk who want to buy them is increasing in number, and the mountain of money they have to spend is growing by the second. The market cannot meet the demands being placed on it. How could Marx not foresee such a glaring deficiency in the capitalist system? Too busy fretting about class struggle to predict there would one day be billionaires scrambling to find things to spend money on. I jest, of course. Any billionaire worth his or her salt and place in heaven can easily find a home for their money in a good cause, and many do. What the likes of the da Vinci painting, and before that the Paradise Papers leak, make clear, however, is the increasing gulf between the super rich and the rest of us. They don't just live in bigger homes; they might as well be on a different planet. Here on Earth, in the UK to be precise, we are about to have our own ponder about haves and have nots. It's Budget time, when we turn back the political clocks and pretend that the Chancellor of the Exchequer has ability to make huge differences to millions of lives with one speech to the Commons. Yet that has not been the case for some time. Budgets used to be momentous events, now they largely exist as political theatre, an occasion for Westminster to dress up and think of how it used to be. But the days of Jenkins, Healey, Lawson, even Brown and those extra billions for the NHS in his 2000 Budget, are gone. Only accountants, think tanks and the media can get excited about Budgets now. One could blame globalisation, the crash of 2008, or a looming Brexit, but there is also the not inconsiderable problem every Chancellor now faces: the Great British public has become allergic to income tax rises. As with full percentage hikes in the interest rate, an electorate worn down by stagnant pay and rising prices simply won't tolerate being asked to hand over more. Denied the means to bring in the big bucks via income tax, Chancellors are forced to tinker around the margins, nipping here and tucking there. Not every party, of course, agrees that tax rises are taboo. Labour's Shadow Chancellor, <mark>John McDonnell</mark>, said this week he would raise an extra £ 17 billion through taxes to spend on public services. Scotland, the First Minister has promised, is to have its own great debate on tax. Given the outcry in some quarters over the SNP Government's freezing of the 40p threshold, and this week's row over how many Scots were paying more in tax than their counterparts in England, any \"debate\" is going to be of the stairheid variety. Or will Scotland buck the perceived trend on income tax the way it has with minimum pricing for alcohol? In the meantime, prepare for a lot of sound, perhaps even fury, after <mark>Philip Hammond</mark> resumes his seat next Wednesday afternoon. And don't worry. Unless he is getting ready to pull the mother and father of rabbits out of his hat, his Budget will contain nothing to trouble any billionaires on the hunt for that next special something to buy. Small seasonal mercies, eh? GRUMBLE IN THE JUNGLE THERE is something about the Johnson family that reminds me of the old story about Mike and Bernie Winters at the Glasgow Empire. You know the one: Mike comes on stage to a tumbleweed welcome, Bernie joins him, only for someone to shatter the silence with the cry: \"Oh God, there's two of them!\" Except in the case of the Johnsons there are more than two. Among the most prominent are Boris the Foreign Secretary, Jo the Universities Minister, Rachel the columnist, and their father Stanley, whose long list of jobs includes writer and conservationist. Now Stanley is to take part in I'm a Celebrity, Get Me Out of Here!, which starts its annual run tomorrow. For those who have been holed up in an Australian rainforest for the past 15 years, I'm A Celeb is an ITV reality show in which a group of people, many of whom you have never heard, endure all sorts of indignities to win food for their campmates. The 77-year-old is favourite to win, too. One way or another there is just no escaping the blonde ambitions of the Johnsons. HIGH FIVE TO ONE BRAVE DOG HERE'S to Mali, the eight-year-old dog yesterday awarded the PDSA Dickin Medal for his contribution to a British Special Forces assault on a Taliban position in Kabul. The citation says the Belgian Malinois \"displayed outstanding courage in the face of fire\" and there was no doubt that his actions, including searching for explosives, had helped to save lives. Mali was hit by shrapnel during the 2012 assault, but carried on despite his injuries. Taking their name from Maria Dickin, founder of the PDSA, the medals were first handed out in 1943. Over the years they have gone to dogs, cats, horses, pigeons and other creatures. Just as no human knows how they will fare under fire till it happens, so it is hard to imagine our pets in such extreme circumstances. Take a look at that big lump on the sofa (the dog, not your other half), or that little darling who has just stormed through the door demanding her dinner (the cat, not the daughter). Are they the stuff of medal winners? In the eyes of those who love them, too right they are. 0 comments"}, {"articleID": "2015012910_00044565_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2015-01-29", "url": "http://www.cbronline.com/news/uk-oracle-user-groups-ceo-resigns-for-career-break-4499322", "content": "James Haslam, who joined in July 1997, is leaving UKOUG on 6 March 2015. James Haslam, who joined in July 1997 as financial controller, is leaving UKOUG on 6 March 2015 for a career break, using the opportunity to travel. During his tenure, Haslam held a range of leading positions, including operations manager, general manager, director of operations to the CEO and board member. In its announcement, the association said he played a \"pivotol role\" in building the UKOUG's position as a leading user group worldwide, and expanding the group's portfolio to include the user groups of PeopleSoft, JD Edwards, Hyperion, Siebel, Solaris and Taleo. \"The role James is vacating is a key leadership role to both UKOUG and in the wider User Group community. As such it is important that James' replacement is selected with care. To that end, until a replacement is selected, we will be appointing an interim CEO supported by the Senior Management Team,\" Fiona Martin, UKOUG's members advocate chair, said in a statement. <mark>David Cameron</mark> plans crackdown on encrypted communications ICT Priorities in Financial Markets - Enterprise ICT investment plans Capscan is a leading supplier of international address management solutions and data integrity services. Capscan has more than 1800 customers...Teneo is an infrastructure optimization company, providing solutions that help customers with the management, performance and virtualization of...Absolute ® Software specialises in technology and services for the management and security of mobile computers and smartphones."}, {"articleID": "2010081513_00255540_W", "names": {"Adam Wainwright": ["Q1185516", "Q57305474"], "Jose Reyes": ["Q220096", "Q282400", "Q6293856"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Carlos Beltran": ["Q1042743", "Q5041829"], "Jimmy Rollins": ["Q15059522", "Q601982"]}, "date": "2010-08-15", "url": "http://philly.com/r?19=961&43=168491&44=100706924&32=3796&7=195227&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fsports%2Fphillies%2F20100815_Citi_Hex_Ends.html", "content": "new york - charlie manuel was well aware of the streak, the one that finally ended when roy halladay (of all people) crossed home plate in the third inning saturday night. \"it was 38 innings, but we put one across,\" a smirking manuel said. frank franklin ii / associated press so he was keeping track? \"four games plus two innings,\" he said. \"even i can count that far .\" now they can joke about it. the phillies beat the mets, 4-0, in the process of snapping a scoreless stretch at citi field. new york helped the cause with three errors that led to three unearned runs. and on the day chase utley began his rehab 1,000 miles south, the phils moved back to within two games of the first-place atlanta braves. on saturday, halladay played the familiar role of stopper as the importance of a single game increases. that's an unusual feeling for halladay. he's pitching in a pennant race for the first time since his rookie season. \"it's going to be fun,\" halladay said. \"this is obviously the biggest reason i wanted to play here .\" in addition to notching the team's first hit of the night - as well as the game's first run - halladay pitched eight shutout innings. his season era is 2.24, third-best in the majors behind only <mark>adam wainwright</mark> and tim hudson. the hit elicited a smile from manuel and some dugout chatter, the manager said. halladay might be on the most modest five-game hitting streak ever. \"he finally hit the grass tonight, didn't he?\" manuel quipped. \"i haven't gotten too many out of the infield,\" halladay said. \"i'll take it .\" on the mound, halladay was dominant. immediately after he plated the first run, halladay surrendered a leadoff triple to <mark>jose reyes</mark>. he never advanced. angel pagan hit a 93 m.p.h. fastball weakly to third for the first out. <mark>david wright</mark> whiffed on a dastardly curveball for strike three. on the sixth pitch to the next hitter, <mark>carlos beltran</mark>, halladay threw the same knee-bending curve. it elicited the same response: <mark>beltran</mark> swung and missed. \"my command was better,\" halladay said. \"i didn't have as many balls over the plate .\" the one run was enough for halladay, but he had breathing room courtesy of new york's sloppy defense. in the fifth, raul ibanez hit a grounder to second that could have been a double play. but ruben tejada threw wildly to second, which allowed <mark>jimmy rollins</mark> to score. in the sixth, <mark>wright</mark> let a slow grounder go between his legs. instead of the inning ending, two more phillies runs scored and the boos rained down on <mark>wright</mark>. \"i don't think you're going to win too many games making three errors,\" <mark>wright</mark> said. \"when you have [halladay] on the mound, you know you're going to have to play pretty perfect baseball to beat him and we were far from that tonight .\" manuel denied halladay the chance for his ninth complete game of the season, which would have tied his total from all of 2009. having thrown 113 pitches in eight innings and the phillies comfortably holding a four-run lead, the manager decided his ace had done enough. manuel said he is monitoring halladay, who leads the majors in innings, more closely than before. halladay, for his part, said he is ready for a heavy workload down the stretch. \"today and the last couple of times i felt strong,\" he said. \"it's just a matter of maintaining that. the closer you get to the end of the season and you're in it, you get a little boost .\" after the game, manuel, relaxed by halladay's standard performance, sat back in his office chair in a jovial mood. his team is coming together at the right moment. when asked a question about ryan madson's shaky ninth inning, manuel began to answer. then he stopped. \"don't forget,\" he said, \"utley had a triple .\" confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse confirm your registration to report abuse because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. account update needed you must indicate according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to"}, {"articleID": "2019072600_00104003_W", "names": {"Tony Martin": ["Q16207079", "Q18394782", "Q2442726", "Q30329692", "Q3531818", "Q3531821", "Q3993273", "Q434220", "Q61049", "Q725874", "Q7822886", "Q7822887", "Q7822888", "Q7822889", "Q7822890", "Q7822891", "Q7822893"], "Lars Bak": ["Q447780", "Q6491418"]}, "date": "2019-07-25", "url": "https://forum.bikeradar.com/viewtopic.php?t=13106279&p=20551978#p20551978", "content": "The Lanterne Rouge Thread 2019 ** Spoilers ** Quote Post by \"underlayunderlay Thu Jul 25, 2019 22:02 pm The one sporting event in British sporting culture that epitomises the\" choke' (other than the England Men's Cricket Team (1877 - present), the English men's football team (1872-1966, 1966 - present), England - well, you get the idea) is of course Devon Loch. Miles ahead in the most prestigious race of the year, with nothing to do but amble to the finish line, this noble horse took the ultimate revenge on the sadistic sod that had made him do all that jumping and inexplicably belly-flopped barely forty yards from the line. Lanterne Rouge aficionados will note that Deven Loch failed to actually finish the race and thus what was otherwise a brilliant display of snatching immortality from a winning position will be forever tainted. The reason for bringing this up is because French hope Yoyo Offredo is currently mid-air and about to crash land in the most publicly embarrassing way possible, and the French public, to continue the metaphor, are about to smash the bottle of Dubonnet firmly over the head of the nearest footman. Anyone suggesting the Queen Mum really reacted by saying \"That's racing\" are perpetuating a conspiracy around the death of Mr A Scroggins, Royal Footman, mysteriously found dead by Dubonnet overdose in the Royal Box. I will now demonstrate the Masonic numbers attached to this-Hang on, I'm literally being buzzed by military helicopters at this point and hadn't even posted it. I'm not ordinarily a tin-foil-hatter, but this is a bit spooky...Anyway, after another brilliant ride by Langeveld it looks like Offredo is about to dash French hopes and surrender the most prestigious title in cycling. The reasons for this urgent collapse in form are totally opaque, but it seems the decision of the commissaires to protect him from <mark>Tony Martin</mark> has not been enough. The slight time Offredo took back from Langeveld yesterday appears to have been a dead cat bounce, or in cycling terms \"Cofidis rider making the break on stage 20\". Offredo remains LR by just three seconds, and surely this will disappear in the next couple of stages - although we've been saying something similar at the wrong end of the race about the man my predictive text is currently calling Julie-Ann's Fillip. The drama in the competition for the LR has overshadowed a brilliant ride from fourth-vowel-abolitionist Michael Mrkv, who soloed to a huge six minute gap over everyone else on today's stage. With the TV cameras inexplicably focused on the travails of Tommy 2.0 (eg AKA Phillip), capturing this immense ride was left to our very own Chief Livestock Correspondent, ATC, who cleverly applied some sort of filter to imply progress was being made. In true LR fashion I note she filed her copy late but just about within the cutoff. Superb work. Elsewhere De Busker is surely out of it, no matter how many Ed Sheeran numbers he butchers, though Mrkv's ride means the final podium spot is very much a live question, Lar \"Sytting <mark>Bak</mark>\" <mark>Bak</mark> is showing the benefit of experience, moving smoothly up to a decent position, Rich Cheeze appears to have panicked about someone playing Beck's Odelay and finished far too quickly. He'll learn, I'm sure, but it takes him back out of the top ten White feather to ATC, whose photographic evidence suggests started up the Galibier well before the field yet got overtaken by the whole bally lot of them. Excellent stuff. Public Service Broadcasting:147 ANTHONY TURGIS 178 TOTAL DIRECT ENERGIE 06H 09' 01 \"+ 00H 34' 46\" - -148 CALEB EWAN 161 LOTTO SOUDAL 06H 09' 01 \"+ 00H 34' 46\" - -149 REIN TAARAMÄE 176 TOTAL DIRECT ENERGIE 06H 09' 06 \"+ 00H 34' 51\" - -150 MATTEO TRENTIN 107 MITCHELTON - SCOTT 06H 09' 39 \"+ 00H 35' 24\" - -151 <mark>LARS BAK</mark> YTTING 202 TEAM DIMENSION DATA 06H 10' 02 \"+ 00H 35' 47\" - -152 MARCUS BURGHARDT 13 BORA - HANSGROHE 06H 10' 51 \"+ 00H 36' 36\" - -153 ELIA VIVIANI 28 DECEUNINCK - QUICK - STEP 06H 10' 51 \"+ 00H 36' 36\" - -154 PETER SAGAN 11 BORA - HANSGROHE 06H 10' 51 \"+ 00H 36' 36\" - -155 SEBASTIAN LANGEVELD 95 EF EDUCATION FIRST 06H 10' 51 \"+ 00H 36' 36\" - - 156 MICHAEL MØRKØV 26 DECEUNINCK - QUICK - STEP 06H 16' 17 \"+ 00H 42' 02\" - - Pubic Service Broadcasting:147 149 ▲ 2 VAN MELSEN Kevin Wanty - Gobert Cycling Team 3:24:53148 150 ▲ 2 BONIFAZIO Niccolò Team Total Direct Energie 3:25:12149 144 ▼ 5 KLUGE Roger Lotto Soudal 3:25:31150 143 ▼ 7 <mark>BAK</mark> <mark>Lars</mark> Ytting Team Dimension Data 3:26:24151 153 ▲ 2 HALLER Marco Team Katusha Alpecin 3:26:33152 155 ▲ 3 MONFORT Maxime Lotto Soudal 3:30:49 153 151 ▼ 2 MØRKØV Michael Deceuninck - Quick Step 3:34:59 154 156 ▲ 2 DEBUSSCHERE Jens Team Katusha Alpecin 3:35:41155 157 ▲ 2 LANGEVELD Sebastian EF Education First 3:49:49 156 158 ▲ 2 OFFREDO Yoann Wanty - Gobert Cycling Team 3:49:52 @ canocola"}, {"articleID": "2011030616_00092884_W", "names": {"John Locke": ["Q21198546", "Q6245090"]}, "date": "2011-03-06", "url": "http://lostpedia.wikia.com/index.php?title=The_Life_and_Death_of_Jeremy_Bentham&diff=1026033&oldid=prev", "content": "* hurley calls [[abaddon]] evil. {{crossref | good and bad people}} * hurley calls [[abaddon]] evil. {{crossref | good and bad people}} * [[abaddon]] tells <mark>locke</mark> that no matter what he did or will do, he will go back to the island. {{crossref | fate versus free will}} * [[abaddon]] tells <mark>locke</mark> that no matter what he did or will do, he will go back to the island. {{crossref | fate versus free will}} * after his accident, <mark>locke</mark> awakes at same hospital that jack works at. {{crossref | character connections}} the same hospital jack works at. {{crossref | character connections}} * ben kills <mark>locke</mark> after convincing him not to commit suicide, then stages it to look like a suicide. {{crossref | life and death | deceptions and cons}} * ben kills <mark>locke</mark> after convincing him not to commit suicide, then stages it to look like a suicide. {{crossref | life and death | deceptions and cons}} * <mark>locke</mark> believes it was fate that brought him to jack, jack believes it was probability. {{crossref | fate versus free will | coincidence}} episode transcript [[{{{transcript2}}} | part two]] [[{{{audiotranscript}}} | commentary transcript]] theories \"the life and death of jeremy bentham\" <mark>locke</mark> awakens in the tunisian desert. tunisian desert three years after the oceanic 6 left the island. he vomits upon arriving. he is lying in direct view of a surveillance camera. he repeatedly calls for help towards the camera to no avail. at night, he is recovered by a pickup truck full of men who roughly bring him to a poorly-equipped rural hospital, arriving in the daytime. the charles widmore who is sitting by his hospital bed. widmore tells <mark>locke</mark> that he had a specialist flown in to do a better job of setting the leg. widmore relates how he was 17 when he first met <mark>locke</mark> on the island. intrigued by the fact that <mark>locke</mark> looks no different now then when they originally met over 50 years ago (for widmore), he asks <mark>locke</mark> how long it has been since richard. <mark>locke</mark> replies that it has only been four days. <mark>locke</mark> confirms that the camera in the desert is widmore's, asking how widmore knew the he would be there. widmore replies \"that's matthew abaddon. widmore assumes aloud that <mark>locke</mark> was exiled by ben as well, but <mark>locke</mark> corrects him, saying that he left voluntarily, to bring his friends back to the island. <mark>locke</mark> mentions that ben left the island before he did. <mark>locke</mark> questions why widmore should want <mark>locke</mark> and the others back on the island. widmore says that there is a war coming and if <mark>locke</mark> is not back, the\" wrong side \"is going to win. later, during the daytime, widmore and <mark>locke</mark> sit outside the hospital and widmore tells <mark>locke</mark> that he will help him find the oceanic six. widmore gives him dossiers on their locations, as he has been keeping an extensive eye on them. he also offers matthew abaddon as a driver and introduces him to <mark>locke</mark>. sayid is seen helping to construct a school as part of a charity called build our world. <mark>locke</mark> approaches him and speaks with him, but sayid refuses to return. he explains that nadia, with whom he spent nine months, before her death. sayid questions if the only reason that <mark>locke</mark> wants to return to the island is because he has nowhere else to go. before leaving, <mark>locke</mark> tells sayid that he can be contacted under the name <mark>locke</mark> after three years of separation. abaddon stop opposite a school in uptown new york. while waiting, <mark>locke</mark> asks abaddon to locate helen norwood for him. abaddon asks if she is an old girlfriend, a question to which <mark>locke</mark> doesn't reply. as the school bell rings, <mark>locke</mark> asks abaddon to help him out of the car. a group of students leaves the school, and amongst them is? <mark>locke</mark> waves to walt, who promptly leaves his friends and crosses the street to talk to <mark>locke</mark>. <mark>locke</mark> asks why walt isn't surprised to see him, and walt explains that he'd been having dreams of <mark>locke</mark> in a suit on the island, surrounded by people who wanted to hurt him. <mark>locke</mark> says that it is good that they are just dreams, to which walt gives him a nervous and confused look. walt also asks about his father, whom he suspects of returning to the island after dropping out of contact for three years. <mark>locke</mark> says that the last he had heard of hurley in his wheelchair, hurley is seen drawing a picture of an egyptian sphinx. hurley, completely nonchalant, asks <mark>locke</mark> why he is in a wheelchair, to which <mark>locke</mark> replies that he fell down a hole. hurley asks him if this is how he died, assuming <mark>locke</mark> is dead as he has been having regular conversations with dead people. however, hurley asks a nurse if he is talking to a man in a wheelchair, and she confirms it, letting hurley believe <mark>locke</mark> is alive. he asks him how he got off the island, and <mark>locke</mark> attempts to persuade hurley to return to the island. the attempt fails when hurley sees matthew abaddon and panics, refusing to have any more to do with either of them, insisting that\" that guy is evil. \"hurley recounts how abaddon posed as an employee of oceanic airlines at santa rosa hospital. the island. <mark>locke</mark> is at kate's house, who refuses to return in spite of the consequences to those still on the island. kate tells <mark>locke</mark> that she believes the only reason he wanted to stay on the island was because he didn't love anybody. he disagrees, and talks about his relationship with helen which, didn't work out because he was\" angry and obsessed. \"kate sarcastically replies\" look how far you've come. \"ben. <mark>locke</mark> and abaddon are in a cemetery, before a stone memorializing? abaddon states that she died of a brain aneurysm. <mark>john</mark> laments that helen loved him and if he had stayed, they would have been together. abaddon states that it wouldn't change anything, she'd still be dead, but <mark>locke</mark> seems unconvinced. abaddon reasons that helen is where she is supposed to be and that <mark>locke</mark> is destined to end up on the island. <mark>locke</mark> questions whether he believes that everything is predetermined and that he doesn't have a choice; abaddon asks whether richard alpert's prediction that <mark>locke</mark> must die is predetermined or whether it's a choice. <mark>locke</mark>, confused, wonders aloud how it could possibly be his choice to die. as abaddon is loading <mark>john</mark>'s wheelchair into the car's trunk, he is shot three times by an unseen <mark>locke</mark>. he wakes up in a hospital bed, with a disheveled ben. as he helps <mark>locke</mark> down, ben tells <mark>locke</mark> he has too much work to do to die and suggests contacting sun. <mark>locke</mark> says he promised jin he wouldn't contact her, and shows ben the wedding ring jin gave him. ben is surprised that jin is alive. <mark>locke</mark> states that he knows what he must do next - he must contact a woman who lives in los angeles named daniel's map. daniel's map has mysteriously been augmented to include ilana then comes in and asks him if he's found anything, and he says no. when she presses him, he takes a flashlight out of the sack and tosses it to her, not mentioning the gun. she tells him that there is a man on the beach in a suit who was not on the plane. on the way back to the gravel path, the plane sits on the path at an angle, but is intact. when they arrive to the camp, they meet a following day, <mark>locke</mark> stands at the edge of the surf, gazing toward the main island. christian shephard's shoes lie on the sand nearby. ilana walks up to <mark>locke</mark> and introduces herself, and offers him a mango, which he muses may be the best mango he has ever tasted. <mark>locke</mark> inquires about two outrigger canoes which sit nearby on the shore. ilana says that the canoes were already there, and that there had been a third one, but ben as the man who killed him. later, <mark>locke</mark> visits caesar in the office in dharma initiative, whose logo appears on the document caesar is reading. caesar questions <mark>locke</mark>'s knowledge of this, and <mark>locke</mark> replies that he has been on the island before, for over 100 days. caesar, confused but curious, asks <mark>locke</mark> if he can explain what he witnessed on the plane, describing how he was sitting next to a heavyset man with curly hair who disappeared during the flash of light, and that other survivors of the crash also reported seeing passengers disappear. realizing from his description that caesar is talking about hurley, <mark>locke</mark> responds that he now has a better idea of how he came to be on the island. the people who disappeared are accounted for. caesar says that they are, other than those who were injured in the crash. he leads <mark>locke</mark> to a makeshift infirmary where the injured passengers are resting. <mark>locke</mark> moves between them, closely looking at each person. he seems disappointed, until he comes to the last of the injured, who is revealed to be <mark>locke</mark> purchased the power cord to hang himself with from\" angel's hardware \", which is also the name of a southern california hardware retail chain defunct since the 1980s. the mango is considered by many in india to be the tree/fruit of knowledge/life. appear to read\" northward travel \"and\" time of kings/ancients \". station is from april 19, 1954. it features an article about a charles widmore shows <mark>locke</mark> is a copy of the fictitious london daily tribune oceanic six dominates the front page. stories on a car crash and the dollar/euro exchange rate also appear on the page. southfield's auction house, the same auction company which auctioned the rousseau's map. there appears to be some discrepancy between the events depicted in this episode and those referenced in\" redshirt survivors) because the oceanic six left the island. while talking to ben, jack also claimed that <mark>john locke</mark> told him that he was off the island. similarly, walt appeared to know <mark>locke</mark>'s alias of jeremy bentham. this is possibly a blooper/continuity error or a suggestion that <mark>locke</mark> may have visited them both a second time not shown in this episode. apart from the reused footage of <mark>locke</mark> turning the frozen wheel, this entire episode takes place off the island. the only real-time events take place on hydra island, while the rest is a flashback. abaddon's license plate is szu 766. this is not (as some have conjectured) a reference to sun tzu. rather, it is the same stock license plate used by marlon brando in the film don juan demarco. when <mark>john</mark> visits hurley in the santa rosa mental health institute, he is wearing a name tag with the name \"jeremy bentham\" , which would explain how hurley knew about his alias in \"this marks the first time in the show's history in which) has not appeared for two consecutive episodes. for his appearance, walt) is credited as a guest star only in the alphabetical guest cast list and not\" special guest star \". this trend would continue in aaron, but does not appear in this episode. aaron is shown but as an infant on the cover of a newspaper. christian shephard in the press release for this episode, but is not listed in the actual credits, and appears only in earlier footage from\" \"at the beginning of <mark>locke</mark>'s flashbacks. this episode was originally intended to be the sixth of the season, but was later switched to air after\" 316 \". this is only the second time in the show's history that the order of the episodes had been switched, having happened only in darkufo, the opening scene of this episode was originally intended to be the opening scene of\" [1] a \"lost: on location\" featurette for this episode is available on the the \"new york\" extras are shown several times throughout the scene in an inconsistent manner, such as walking behind <mark>locke</mark> and abaddon twice, each time headed in the same directions (see screencaps). walt asks <mark>locke</mark> why he came to see him, shot changes from <mark>locke</mark>'s face, to walt and then back to <mark>locke</mark>'s face before he responds. when camera changes to walt, we can clearly see <mark>locke</mark> turn his head. but when camera goes back to <mark>locke</mark>'s face, he is still facing exactly in same direction as he was before he turned his head. santa rosa, they both instantly switch places on either side of him between subsequent shots. the license plate clearly visible on the car driven by abaddon is an out of date new york plate. the statue of liberty plate was replaced in 2001 with a new, redesigned plate and virtually no current automobiles feature the old plate. series numbers' which as of the end of february 2009 didn't exist and the highest possible was 137. as abaddon is driving <mark>locke</mark> down the road to the airport in tunisia, an american 45mph speed limit sign can be seen briefly outside the passenger window. the canadian passport <mark>locke</mark> is given by widmore was issued in 2007 and expires in 2017. however, canadian passports must be renewed every 5 years, not 10. furthermore, the passport style is the one employed by passports canada between 1993 and 2002. the issuing office is said to be vancouver: so, for <mark>john</mark> to be using a valid canadian passport it should have been the new style design featuring a printed digital photograph and holographic maple leaves. [3] the handwriting in <mark>locke</mark>'s letter to jack (\"i wish you had believed me\" ) is slightly different between the version we see <mark>locke</mark> write, and the one jack reads on the plane (the word \"believed\" is most notable). santa rosa mental health institute location has been repeatedly portrayed, and once stated, as outside los angeles, california. however in this episode, its location was identified as santa rosa, ca., which is over 400 miles to the north of los angeles. secrets there is a close up of <mark>locke</mark>'s eyes, when he wakes up in tunisia. death) <mark>locke</mark> discovers that helen is dead. numbers) <mark>john</mark> remembers dying and points ben as his killer. character connections) the pills that the tunisian doctor gives to <mark>john</mark> are black and white. walt says that he has been having dreams about <mark>locke</mark>. abaddon mentions that he was an orderly when <mark>locke</mark> was in the hospital before. widmore says that if <mark>locke</mark> ever needs to contact him, all he has to do is dial ilana about the gun he finds, saying that it was a flashlight. abaddon tells <mark>locke</mark> that no matter what he did or will do, he will go back to the island. fate versus free will) after his accident, <mark>locke</mark> awakes at the same hospital jack works at. character connections) ben kills <mark>locke</mark> after convincing him not to commit suicide, then stages it to look like a suicide. deceptions and cons) <mark>locke</mark> believes it was fate that brought him to jack, jack believes it was probability .) despite widmore's promise that he would keep imprisonment) a flock of goats crosses the path of <mark>locke</mark> and abaddon's car as they leave the hospital. despite widmore's promise that he would keep <mark>locke</mark> alive, ben states that deceptions and cons) walt asks <mark>locke</mark> about his father. abaddon: hurley says \"he's evil\" about abaddon. abaddon, in the bible, means \"place of destruction\". life: caesar finds the april 19, 1954 issue of life life magazine, a photograph from the 1954 film creature from the black lagoon santa rosa mental institute, hurley is seen painting a picture presumably of the great sphinx of giza in egypt. unreliable narrator <mark>locke</mark> tells jack, \"we have to go back .\" regularly spoken phrases) ben tells <mark>john</mark> he cannot die because he has too much \"work to do .\" regularly spoken phrases) hurley tells <mark>locke</mark>, \"i'm not going anywhere with you .\" regularly spoken phrases) hurley has become so used to his visions of dead people, that he is more surprised when he finds out that <mark>locke</mark> is really alive. <mark>locke</mark> survives a massive car accident and is talked out of suicide, but he's finally murdered by the person who talked him out of killing himself. <mark>locke</mark> dismisses the possibility of having ever thought about suicide. not much later, he chooses this exact way to die. <mark>locke</mark> dies in the same way that the most hated man in his life, abaddon is shot and killed in a cemetary. (irony) moments earlier, abaddon stated \"helen is where she's supposed to be. sad as it is, her path led here .\" as it turns out, his did as well. we find that <mark>john locke</mark> is alive on the island after ben said to him, \"you can't die\" , and proceeds to kill him. ben tells <mark>locke</mark> that widmore was planning to kill him, not protect him. jack berates <mark>locke</mark> for his \"delusions\" of being \"special\". kate asks <mark>locke</mark> if he's ever been in love, and he tells her about his relationship with lockdown \") flight 316 lands on the\" ) widmore says he hasn't tried to kill <mark>locke</mark>, and asks if he could say the same about ben. \") ben mentions that jack has booked round trips from l.a. to sydney .\" ) we finally see how <mark>locke</mark> ends up in the coffin. \") hurley refers to his meeting with abaddon at santa rosa. sayid tells <mark>locke</mark> that ben was manipulating him .\" ) <mark>locke</mark> mentions to widmore that he sent the the other woman \") widmore reveals he was the leader of the others, that the island was his, before ben exiled him by tricking him into leaving. <mark>locke</mark> refers to alpert telling him he was going to have to die. widmore mentions that he met <mark>locke</mark> when he was seventeen years old. jughead\" ) <mark>locke</mark> refers to christian telling him to say \"hi\" to his son. \") <mark>locke</mark> writes his suicide note to jack. 316\" ) <mark>locke</mark> takes off christian's shoes. 316 \") caesar tells <mark>locke</mark> about hurley and some other passengers disappearing from the flight. episode allusions <mark>locke</mark> previously referenced his relationship with helen to kate, but he finally talks about it to her. walkabout\" ) <mark>locke</mark> is the second character to be hanged and left for dead. the other woman \") <mark>locke</mark> is transported to the exit, where ben arrived two years prior. do not answer the questions here. keep the questions open-ended and neutral: do not suggest an answer. more details...for fan theories about these unanswered questions, see:"}, {"articleID": "2012010402_00038573_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "Simon Cowell": ["Q162629", "Q7518530"], "Elton John": ["Q16209157", "Q2808"]}, "date": "2012-01-04", "url": "http://wetpaint.com/the-vampire-diaries/articles/vampire-diaries-spoilers-for-season-3-episode-10-the-new-deal-whos-getting-slapped", "content": "photo credit: bob mahoney/the cw? 2011 the cw network photo: the couple that broods together...the thing about love triangles is, sometimes they get obtuse. when paul wesley) will find themselves tussling with high stakes - and each other. e isn't happy with her former boyfriend, but all three players will find get into it with each other, and one of the spats ends with a slap, according to tvline. want more spoilers? in season 3, episode 12, show up in mystic falls, but the mother-daughter reunion won't be \"all hallmark cards and cookies,\" executive producer julie plec tells tvline. \"there's a lot of tension there. there's [also a] surprising explanation about why [her] mother felt like she needed to walk away and never come back to mystic falls .\" we'll also get a look at bonnie's past, which will \"play an interesting role in solving a present-day mythology puzzle .\" does this mean they're headed back to the cave for more viking hieroglyphics? vampire diaries spoilers for season 3, episode 10, \"the new deal\" : is someone leaving mystic falls for good? robert pattinson gave kristen stewart exactly what she needed on christmas - the stir russell brand could score $20m payday in katy perry divorce - zap2it vampire diaries extended promo for season 3, episode 10, \"the new deal\" : how far is stefan willin...sneak peek photos for the vampire diaries season 3, episode 11, \"our town\" : caroline's deadly bir...2011's most ridiculous, embarrassing, and omg-worthy twit pics you've got to see which scripted series are you most excited to see return in january 2012? celebrity bikini body secrets (something to inspire you to get your butt to the gym in 2012) what to watch on tv: wetpaint entertainment's hottest shows for the week of january 2 boob flashes and camel rides: wetpaint entertainment's most ridiculous photos of 2011 vampire diaries spoilers for season 3, episode 10, \"the new deal\" : is someone leaving mystic fall...the vampire diaries sneak peek photos for season 3, episode 10, \"the new deal\" : elena cuddles up...taylor kinney: actor, model, heartthrob, and lady gaga's new boyfriend (photos) double take! wetpaint entertainment stars' celebrity look-alikes taylor kinney and lady gaga go public with their romance - hot photo! \"portlandia' loves\" battlestar galactica' how \"big bang theory' ladies are like\" sex and the city' crew jjj book club pick for january:' a million suns' by beth revis abigail breslin: new year's eve with nivea! \"jane by design' premieres tonight! david beckham strips in sexy new underwear ad minka kelly & derek jeter: kissing in paris! what naya rivera will look like in 50 + years david beckham turns down france offer, doesn't want to move his family kanye west & fergie ring in the new year at 1oak in las vegas! justin timberlake, <mark>bradley cooper</mark> and leonardo dicaprio take girlfriends on joint ski vacation! <mark>simon cowell</mark> returning full-time to\" britain's got talent' \"top chef: texas' is back with a super-sized episode\" portlandia' season 2: watch the \"bsg' episode ahead of the premiere lana del rey - 2012 new album preview beyonce baby pictures: what we know so far selena gomez cosmopolitan cover outtakes revealed gwyneth paltrow gives new bff courtney love advice for 2012 <mark>elton john</mark> knows justin timberlake is fabulous enough to play him"}]