[{"articleID": "2019111823_00026745_W", "names": {"Denis Shapovalov": ["Q20979382", "Q4520285"]}, "date": "2019-11-18", "url": "http://www.clactonandfrintongazette.co.uk/sport/national/18044734.new-look-davis-cup-launches-hiccups-madrid/", "content": "New-look Davis Cup launches with few hiccups in Madrid By Press Association 2019 Karen Khachanov helped Russia to a 3-0 win over defending champions Croatia 0 comment The new-look Davis Cup finals began with a few hiccups but no disasters in Madrid on Monday. After all the talk about the new format and the influence of Barcelona footballer Gerard Pique, who persuaded the International Tennis Federation to partner with him on the World Cup-style event, the first three ties were played at the Caja Magica. Most of the scepticism has been about whether fans would travel to watch their countries at a neutral venue and whether the atmosphere could come anywhere close to matching the traditional home-and-away format. Are you sure there are just 15?????????? pic.twitter.com/SouZ8FnBG7--Gerard Piqué (@ 3gerardpique) November 18, 2019 The initial results were largely positive. The clash between Russia and Croatia on the largest court, which seats more than 12,000 spectators, felt a little flat but the stands were around half full and the Croatia fans, in particular, were noisy. The tie on the second court, pitting Canada against Italy, was lively throughout, as was Belgium's clash with Colombia, despite a significant number of empty seats. A tweet from Belgium's former French Open semi-finalist Filip Dewulf, who is now a journalist, about the sparse crowd was met with a pithy response from Pique. French player Alize Cornet then bit back at the defender, saying: \"Dear Gerard, I can see that you've never been to a REAL Davis Cup! And that's not it.\" Day 1. @ DavisCupFinals pic.twitter.com/OYuDgimw6o--Gerard Piqué (@ 3gerardpique) November 18, 2019 The Madrid Open, which has long hosted a tour event at the same site in the spring, weighed in with a picture of full stands accompanied by the message: \"NOTHING like this!\" It was subsequently deleted. It is understandable that Pique is touchy about criticism, particularly given the negativity with which his involvement has been met by many in tennis, but he would be better off staying out of such spats and hoping his product does the talking. The Spaniard has spoken of wanting this week to be a show, and it began with a somewhat bizarre opening ceremony an hour and a half before the matches, for which the stands were understandably largely empty. Rather less technological thought had gone into providing live scores on the tournament's app and website, although they did eventually appear. Canada's Vasek Pospisil produced the upset of the day against Fabio Fognini (Bernat Armangue/AP) On court, Canada claimed top honours with an impressive victory over Italy. Despite being without their number two Felix Auger-Aliassime, who has been sidelined by injury, 150th-ranked Vasek Pospisil upset world number 12 Fabio Fognini 7-6 (5) 7-5 before <mark>Denis Shapovalov</mark> edged a very tight encounter against eighth-ranked Matteo Berrettini 7-6 (5) 6-7 (3) 7-6 (5). Defending champions Croatia were severely weakened by the withdrawal of their number one Marin Cilic through injury and were beaten 3-0 by Spain. Borna Gojo, making his debut, lost 6-3 6-3 to Andrey Rublev and Borna Coric's losing run continued with a 6-7 (4) 6-4 6-4 loss to Karen Khachanov. Cheer Cheer!?? #DavisCupMadridFinals #ByRakuten pic.twitter.com/0pMYyil3r2--Davis Cup by Rakuten Madrid Finals (@ DavisCupFinals) November 18, 2019 Daniil Medvedev's withdrawal on the eve of the tournament left Russia with only three players but Khachanov and Rublev teamed up to win the doubles 7-6 (3) 6-4 against Ivan Dodig and Nikola Mektic. With hosts Spain the other team in their group and only two of the eight runners-up going through to the quarter-finals, all the teams are well aware that every rubber, set and even game could be vital. Belgium have punched well above their weight in recent years and they beat Colombia 2-1, with singles victories for Steve Darcis and David Goffin before world number one doubles team Juan Sebastian Cabal and Robert Farah got the South Americans on the board. Tuesday sees Spain contest a rare sold-out tie against Russia, while France, the USA and Australia also begin their campaigns. 0 comment"}, {"articleID": "2019062609_00029828_W", "names": {"Seán Mccarthy": ["Q7459558", "Q7459560"]}, "date": "2019-06-25", "url": "https://www.irishexaminer.com/breakingnews/ireland/man-shouted-at-ex-wife-on-sideline-as-they-watched-son-play-football-court-hears-932987.html", "content": "Man shouted at ex-wife on sideline as they watched son play football, court hears By Liam Heylin Tuesday, June 25, 2019 - 09:04 PM A woman was put in fear when her ex-husband screamed at her to let their young son go to another soccer club after his team had lost yet again. The 40-year-old man pleaded guilty at an in-camera sitting of Cork District Court to breaching a safety order by putting his wife in fear on the sideline of a pitch after a match. The woman told Judge Con O’Leary that she and the defendant were separated for years and were, at this stage, divorced. \"I kept as far away from him as possible,\" the woman testified at the sentencing hearing. \"I keep out of his way. It is an ongoing fear I have with him. These issues have to stop.\" Judge O’Leary wanted to know what had triggered the outburst by her husband on this occasion. \"He wants the child to change soccer clubs,\" she said in relation to their primary school-age son. Inspector <mark>Seán McCarthy</mark> said the defendant had two previous convictions for engaging in threatening behaviour and three convictions for breaching domestic orders by putting his wife in fear. Judge O’Leary asked: \"What does he expect if he breaches an order for the fourth time? What is wrong with him?\" Donal Daly, solicitor, said: \"The young fella was playing with this club. They had lost again. He was anxious his son would play with another club. He thought he would be less upset if he was on a team that was winning.\" Mr Daly said the defendant did not verbally abuse his wife. He said that the defendant did ask her: \"Why the hell don't you leave the young fella join the other club?\" Judge Con O’Leary said following submissions from Mr Daly that he would put the defendant on a 12-month probation bond. READ MORE"}, {"articleID": "2018123122_00544527_W", "names": {"Dennis Richardson": ["Q13572036", "Q5258898", "Q5258899"]}, "date": "2018-12-31", "url": "http://wweek.com/news/state/2018/12/31/dennis-richardson-says-hell-seek-re-election/#disqus_thread", "content": "<mark>Dennis Richardson</mark> says He'll Seek Re-Election Oregon's only Republican statewide officeholder has been battling brain cancer since May. <mark>Dennis Richardson</mark> (Oregon National Guard) Published 1:48 PM Updated 1:48 PM Secretary of State <mark>Dennis Richardson</mark>, Oregon's only Republican statewide officeholder, has been battling brain cancer since May. He's reduced his public schedule to almost nothing and no longer attends meetings of the State Land Board in person. But last week, in a rare interview, <mark>Richardson</mark> told Jim Pasero, publisher of the conservative Oregon Transformation newsletter, he's optimistic about his future and his ability to hold onto a position Democrats covet. \"With God's help, I'll complete this term in office, and with the voters' help, I'll win re-election,\" <mark>Richardson</mark> told Pasero. \"My 2020 campaign engine is fired up and moving forward. In fact, last week, I sent my first fundraising letter for the 2020 election.\" "}, {"articleID": "2019022810_00141052_W", "names": {"Mark Hilton": ["Q6768049", "Q6768050", "Q6768051", "Q6768052"]}, "date": "2019-02-28", "url": "https://www.tvbeurope.com/technology/grass-valley-img-and-telstra-deploy-ip-link-over-20000km", "content": "Grass Valley has successfully deployed its DirectIP connectivity solution to establish a remote link between cameras based in Telstra's Tokyo office with an XCU base station in IMG Studios' London headquarters, delivering uncompressed, ultra-low latency video over 20,000 km. The longest true remote IP production connection on record, the Tokyo-London link is said by Grass Valley to d emonstrate a robust IP workflow between camera, IP switches and XCU that supports HD, 3G, UHD and SlowMotion feeds over large distances. Using a centralised control room to ensure high performance levels and easy set-up/maintenance, DirectIP ensures that signal availability is unaffected, allowing the remote site to integrate seamlessly with the production, regardless of distance. Trevor Boal, head of Telstra broadcast services, said: \"This trial confirms that resolution and speed are not a barrier to remote production. Getting signals from one side of the world to the other with low latency and assured quality over the Telstra network is now a reality. The transmission of remote signals via the Telstra network over such long distances between Grass Valley's cameras and the production centre is a real gamechanger that will enable productions and workflows that were not previously possible.\" Grass Valley live production VP <mark>Mark Hilton</mark> added: \"IP-based remote production is a great way to address the cost pressures of live productions as they strive to meet the growing demand for first-class content and immersive viewing experiences.\" This unique real-life field test strongly underscores the unmatched capability of Grass Valley's DirectIP workflow. As the only camera manufacturer that delivers all-IP communication between a camera head and its base station, our customers can achieve enormous savings on time, budget and resources by only sending camera heads to on-site production venues. This model maximises equipment usage at their production facilities for a higher return on investment while still supporting high-end productions--it really is a major win for them and with that, a win for the whole industry. \""}, {"articleID": "2009062221_00058074_W", "names": {"John Leahy": ["Q3181922", "Q41805872", "Q48817243", "Q6244309", "Q6244313"], "Li Xiaopeng": ["Q360605", "Q483477", "Q698688"]}, "date": "2009-06-22", "url": "http://webwire.com/ViewPressRel.asp?aId=97679", "content": "airbus and the chinese bank icbc sign mou on aircraft financing solutions airbus today signed a memorandum of understanding with the industrial and commercial bank of china (icbc), one of china's leading banks, on cooperation in aircraft financing and leasing. the mou was signed by <mark>john leahy</mark>, airbus chief operating officer customer affairs and <mark>li xiaopeng</mark>, vice president of icbc and chairman of icbc financial leasing co. ltd. (icbc leasing), the wholly-owned subsidiary of icbc, based in tianjin. airbus and icbc endeavour to share competence and experience to cooperate on aircraft financing and management activities, including structuring of operating and finance lease transactions as well as portfolio management and aircraft placement remarketing. under the mou, icbc leasing will provide aircraft delivery financing solutions to airlines domiciled in the people's republic of china for the acquisition of aircraft ordered from airbus. icbc leasing could provide financing solutions for up to 70 a320 airbus aircraft assembled at final assembly line china (falc) over the next five years. the total value of the financing support will be over 20 billion rmb (some us $3 billion). the financing solutions such as purchase and lease back transactions will be provided directly to chinese airlines. furthermore, icbc leasing shall also consider offering these services for aircraft delivered by airbus from other final assembly lines around the world. finally, icbc leasing shall consider purchasing a certain number of aircraft directly from airbus for future leasing needs of airlines. \"we are proud to provide financing solutions for customers taking deliveries of aircraft assembled at falc. our objective is to support the whole aeronautic community in china; the airlines when enabling them to acquire airbus aircraft as well as falc to ensure its smooth ramp up\" said jiang jianqing, chairman of icbc. \"in the current economic environment, aircraft financing remains very challenging. but aircraft remain very attractive investments. our modern portfolio of aircraft is delivering an excellent return on investment and an outstanding value for money to our customers\" said tom enders, airbus president and ceo. \"the timely financing support from icbc leasing will surely help chinese airlines to take deliveries of their new airbus aircraft and enhance their competitiveness\" icbc is one of the leading banks in china with wide networks across the country and in the world. icbc financial leasing co., ltd. (\"icbc leasing) is 100 percent owned by icbc, set up in november 2007. airbus is a leading aircraft manufacturer offering three highly successful families of aircraft, ranging from 107 to 525 seats, the most modern, comprehensive and eco-efficient product line on the market. headquartered in toulouse, france, airbus is an eads company."}, {"articleID": "2019080409_00185377_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-08-04", "url": "http://www.gamereactor.eu/overwatch/?sid=cc56359faa371866471db2aa49705560", "content": "OVERWATCH REVIEW. Written by Rasmus Lund-Hansen on the 26th of May 2016 at 16 \"Overwatch is, without a doubt, the best multiplayer-shooter I've ever had my hands on.\" 0 ESPORTS. Written by Ben Lyons on the 2nd of August 2019 at 07 The roster has plenty of Contenders talent, and joins the growing list of countries revealing teams. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 11 This is coming to the Melbourne Esports Open next month, and there will be meet and greets and signings too. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 10 A new report claims that the Overwatch League team is getting sold to a new owner for $40 million USD. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 1st of August 2019 at 10 This would be in order to boost viewership for the competition, and several ideas have allegedly been discussed."}, {"articleID": "2020021917_00157185_W", "names": {"George Bush": ["Q207", "Q23505"], "President Bush": ["Q207", "Q23505"]}, "date": "2020-02-18", "url": "https://hypervocal.com/items/3250282", "content": "Bernard Kerik Trump Issues Pardon for Ex-NYPD Commissioner Bernard Kerik Kerik was police commissioner during the 9/11 attacks but later went to federal prison on tax and other charges Published February 18, 2020 • Updated on February 19, 2020 at 12:05 am NBCUniversal, Inc.. What to Know President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government Kerik, a confidant of Trump lawyer and former mayor Rudy Giuliani, was released from prison in 2013 The informant who helped bring Kerik down was himself recently charged with sex trafficking President Donald Trump announced he has pardoned Bernard Kerik, the former NYPD commissioner who later went to federal prison for tax fraud and lying to the government. Trump also commuted former Illinois Gov. Rod Blagojevich. The news comes mere hours after Trump pardoned Edward DeBartolo Jr., the former San Francisco 49ers owner convicted in a gambling fraud scandal who built one of the most successful NFL teams in the game's history. Kerik, a one-time nominee to be the nation's homeland security chief, served three years in federal prison before his 2013 release. The former NYPD commissioner and 9/11 hero spent more than three years in federal prison for tax fraud and lying to the government, but was pardoned by President Trump on Tuesday. Others granted clemency include Rod Blagojevich, junk bond king Michael Milken and former 49ers owner Eddie DeBartolo. NBC New York's Jonathan Dienst reports. Hailed as a hero for leading the NYPD during the 9/11 attacks, Kerik fell from grace when he became the first New York City police commissioner ever imprisoned on federal crimes. His legal problems clouded the political fortunes of other elected officials, especially that of his mentor, former Mayor Rudy Giuliani. While departing the White House Tuesday afternoon, Trump said he \"pardoned\" Kerik \"a man who had many recommendations from a lot of good people.\" Thank you President @ realDonaldTrump. pic.twitter.com/nnDGa55Hgo--Bernard B. Kerik (@ BernardKerik) February 18, 2020 Following his pardon, Kerik took to Twitter to thank the president writing that \"there are no words to express my appreciation and gratitude to President Trump,\" adding that \"with the exception of the birth of my children, today is one of the greatest days in my life.\" Also thanking President Trump was Giuliani, who called Kerik a \"true patriot\" and said Trump's pardon was a \"wise decision.\" Bernie Kerik and I faced 9/11 together. I can tell you he is a brave man through and through and a brother. He's a true patriot and has learned so much from what happened to him. He has helped, and will continue to help, others. @ realDonaldTrump made a wise decision .--Rudy W. Giuliani (@ RudyGiuliani) February 18, 2020 Kerik went on to describe going to prison as \"dying with your eyes open,\" citing the \"collateral consequences and the permanent loss of many of your civil and constitutional rights are personally devastating.\" Trump also mentioned he pardoned Michael Milken, who became a face of the insider trading financial scandals of the 1980s. Trump cited the \"incredible job\" that Milken has done in the \"world with all of his research on cancer,\" adding that Milken suffered \"greatly\" and paid a \"big price.\" The two had met when Kerik volunteered to chauffeur Giuliani and provide security during his first unsuccessful race for mayor. Once elected in 1993, Giuliani promoted Kerik, a high school dropout, to the highest levels of city government. The mayor eventually tapped his former bodyguard as the city's 40th police commissioner in 2001, despite his attaining only the lowest rank for a detective and failing to earn a college degree--a requirement for officers above the rank of sergeant. Crime and Courts Feb 12 \"Unspeakable Abuse': Informant Who Helped Arrest Ex-NYPD Boss Faces Sex Trafficking Charges Nov 1, 2013 NYPD Chief-Turned-Felon Kerik: Prison System\" Broken \"Kerik nearly became President <mark>George Bush</mark>'s homeland security secretary in 2004, but his name was abruptly withdrawn as the nominee. Two days later, The Daily News reported that Larry Ray, who had been the best man at Kerik's wedding, had come forward with evidence that Kerik failed to report thousands of dollars in gifts he'd received while working for the city. A the time, Ray was under indictment in a $40 million stock scam. During his failed presidential bid in 2008, Giuliani had to admit that he erred in recommending Kerik to President <mark>Bush</mark>. Kerik was in the news earlier this month when Ray was arrested on sex trafficking charges. Blagojevich, who was impeached and removed from office in 2009 on corruption charges, was also commuted by the president. Blagojevich, 63, was found guilty of corruption charges related to his solicitation of bribes in an attempt to\" sell \"the Senate seat Barack Obama left open after being elected president. He was sentenced in 2011 to 14 years in federal prison. On Tuesday, Trump said he commuted Blagojevich's sentence\" so he'll be able to go home to his family after serving eight years in jail, \"calling Blagojevich's sentence\" ridiculous \"and that\" many people disagree with the sentence. \"Blagojevich was a contestant on Trump's reality TV show\" The Celebrity Apprentice \"in 2010. NBC New York / The Associated Press This article tagged under: Bernard Kerik NYPD President Trump Pardons 0"}, {"articleID": "2018062013_00040277_W", "names": {"Brad Baker": ["Q22003274", "Q4953788"]}, "date": "2018-06-20", "url": "http://www.journal-news.com/news/new-business-alert-bar-arcade-coming-hamilton/o9C1LOV66PoOL6z13ZZ7jL/", "content": "By Eric Schwartzberg, Staff Writer Share on Facebook Share on Twitter...More Reddit Pinterest Email HAMILTON--A Butler County business that creates virtual pinball machines is planning to move to a high-profile downtown Hamilton storefront and create a fun place to hang out while playing the classic game. MORE: You see the top level of a parking garage. Hamilton sees its next party space. VPcabs Virtual Pinball, will move this summer from Fairfield to a space that is three times larger at 113 North 3rd St., and work to introduce a separate \"barcade\" --a combination arcade, bar and restaurant--to the mix. \"I've had the amazing opportunity of being on Season 7 of Shark Tank and made a deal with (businessman and investor) Daymond John,\" said owner <mark>Brad Baker</mark>. \"Since then we've grown quite a bit and need more room. I was hoping to eventually be able to get more space, but none has come available where we're at.\" The business builds virtual, WiFi-ready pinball machines that can download thousands of games, giving home gamers the opportunity to play \"just about any pinball game ever made\" on one machine, he said. MORE: The wait for rooftop dining in Hamilton is over <mark>Baker</mark>, who also owns a home theater business, started VPCabs Virtual Pinball in 2013 by building the machines out of his garage, then moved to a Fairfield storefront in 2017. The extra space in the new Hamilton location means double the amount of manufacturing space for the pinball company's nine employees, which should help it expand its manufacturing into other video game-related areas, <mark>Baker</mark> said. The manufacturing portion of the business is expected to move to the new location, right next door to the George McDulin Parking Garage, in July and August. The arcade/bar portion of the business, tentatively named The Pinball Garage, should open there soon thereafter, he said. VPcabs Virtual Pinball manufactures four different machines, none of them coin-operated, with the vast majority purchased not by businesses but by individuals for home use. It typically sells between 300 to 500 machines each year, he said. MORE: Plan to enjoy a beer while strolling the streets in Hamilton? 5 rules to know about new outdoor drinking program <mark>Baker</mark> said he plans to purchase between 30 and 50 mechanical pinball machines to feature in the Pinball Garage alongside VPcabs' own creations. \"We really want this to be an old-school, retro pinball barcade concept where you can come in and play pinball games from the 1950s all the way up until...brand new mechanical pinball games,\" he said. The Pinball Garage name, if used, would be an homage to the storefront's configuration, which was home to Jim's Auto Service Store until that business moved to 1270 Clinton Ave. in Hamilton earlier this year. Recommended for you Recommended for you Recommended for you Most read 1 No trial date yet for Middletown teens charged with murder 2 Americana amusement park demolition nears 3 Bullet hits fire chief's vehicle after false alarm Share on Facebook Share on Twitter...More Reddit Pinterest Email"}, {"articleID": "2015020501_00037195_W", "names": {"David Axelrod": ["Q1251914", "Q519838"]}, "date": "2015-02-05", "url": "http://clickorlando.com/news/politics/obamas-longestserving-staffer-leaving-post/31091906", "content": "Dan Pfeiffer is one of president's longest-serving strategists, closest advisers Chip Somodevilla/Getty Images/Public domain WASHINGTON (CNN) - The White House announced the parallel departures of two top aides to President Barack Obama on Wednesday, just past the midway mark of Obama's final term. Dan Pfeiffer, one of the President's longest-serving strategists and closest advisers, will depart the White House in early March, officials said. The second adviser, communications director Jennifer Palmieri, will leave in the spring. A Democratic source said she'll fill the same role on Hillary Clinton's all-but-certain presidential campaign. \"While their departures are significant, there is indeed value in bringing in new, energized staff with fresh ideas and new perspectives,\" a White House official said, noting Palmieri and Pfeiffer had made their decisions to leave independent from one another. \"Instead of filling jobs as one-offs, this timing presents an opportunity to build a cohesive team that is expressly designed to achieve and implement the President's priorities for the fourth quarter of his presidency,\" the official said. Pfeiffer is one of the longest-serving Obama staffers, with ties to the President's first presidential campaign in 2008. A previous White House communications director, Pfeiffer currently serves as assistant to the President and senior adviser--a role he's used to hone the administration's messaging in a shifting media environment. \"Dan has been beside me on every step of this incredible journey, starting with those earliest days of the campaign in 2007,\" Obama said in a statement on Wednesday. \"And through it all, he's been smart, steady, tireless and true to the values we started with.\" An official at the White House said Pfeiffer, who'd been contemplating leaving the administration for a \"long time,\" told Obama the day after this year's State of the Union address that he'd made his decision to depart. \"Given the position of strength we are in right now...he is now comfortable moving on,\" the official said. Palmieri--who also served in former President Bill Clinton's administration--is expected to assume a role on Hillary Clinton's campaign for the Democratic presidential nomination, should she decide to make a run. Two sources familiar with the campaign's planning said Palmieri was likely to take on the top communications job. She'll join another former Obama adviser, John Podesta, who is also expected to assume a major role on Clinton's campaign, potentially as its chairman. A top aide who helmed the administration's efforts combating climate change, Podesa is slated to leave the White House this month. As one of Pfeiffer's final tasks at the White House, he's been reviewing how the communications staff engages in a social media-driven news environment. The White House official said Pfeiffer had traveled to Silicon Valley recently to garner recommendations from American tech firms on how best to engage audiences using their platforms. The evidence of those efforts were on display last month leading up to Obama's annual State of the Union address: key elements of the speech were unveiled ahead of time on Facebook and Twitter, and the entire text of the speech was published on the website Medium before Obama stepped to the podium. In an interview on CNN's \"Reliable Sources\" in December, Pfeiffer said his White House position \"has been the greatest job I've ever had.\" He acknowledged \"there will be a day when it makes sense for me to do something else,\" but said he hadn't made up his mind about what's next. \"I think when I leave the White House, whenever that will be, I will spend a significant amount of time on a beach with an adult beverage for a long time,\" he said with a laugh. \"And then figure out what the next chapter is.\" In December, Pfeiffer spoke animatedly about American media being \"on the cusp of a massively disruptive revolution.\" \"There are big things that are going to happen,\" he said. \"The old models are starting to fall. And how we adjust to them, and how everyone adjusts to them--you know, entertainment television, the movies, the news, politicians and the government trying to get their message out--is going to be a massively fascinating thing.\" Pfeiffer added that he thinks these changes are \"even more interesting and potentially consequential than the invention of television and the invention of the Internet, because it's all those things combined at the same time.\" Pfeiffer's departure leaves few remaining \"Obama originals\" --those trusted aides and advisers who helped Obama win the White House and navigate the early years of his presidency. Valerie Jarrett and Anita Decker Breckenridge, both senior advisers who have served Obama for years, are two trusted aides who will remain in the West Wing. Others, however, have moved on: <mark>David Axelrod</mark>, David Plouffe and Alyssa Mastromonaco, three former senior advisers who served on Obama's 2008 campaign, have all left government for now. Obama said Wednesday that Pfeiffer had served not only as a top aide but as a friend. \"I'm going to miss having him just down the hall from me,\" he said. The views expressed are not those of clickorlando.com, WKMG or its affiliated companies. This is a community moderated forum (Please note the \"Flag' button). By posting your comments you agree to accept our Terms Of service Please set an email address for your profile. To complete your registration on this site, please supply an address."}, {"articleID": "2015113000_00188505_W", "names": {"George Miller": ["Q21166588", "Q23826617", "Q25171612", "Q28137208", "Q446960", "Q51584537", "Q5542479", "Q5542483", "Q5542484", "Q5542485", "Q670658", "Q966352"], "Tom Hardy": ["Q208026", "Q21572165", "Q7816088", "Q7816089"]}, "date": "2015-05-16", "url": "http://movies.mxdwn.com/reviews/movie-review-mad-max-fury-road/", "content": "A few months ago, after a string of mediocre-to-bad reviews of what I maintain were mediocre-to-bad schlocky action movies, I had a coworker accuse me of simply not liking action movies. I tried quickly to defend myself, saying no, it was just the beginning of the year and there weren't any good action movies which had come out recently. But it got me second guessing myself. Do I occasionally get annoyed with shallow characters, weak plots, and the waste of brilliant concepts? Yes. Maybe even more than \"occasionally.\" All it takes is a movie like Mad Max: Fury Road to put those sort of niggling criticisms out of mind. Yes, there are still some ways Fury Road occasionally lets itself down, but these are by far the exceptions to the rule. Mad Max: Fury Road is a great action movie, and one that does world building better than most any other movie in recent memory of any genre. Who cares if the plot is a massive excuse to make the characters go from point A to point B and back? That journey is way too much fun. Fury Road drops us into its post-apocalyptic landscape with hardly an iota of exposition. I've actually seen none of the previous Mad Max movies, but to the best of my knowledge I suffered not at all for the oversight. With a few minor--but notable--exceptions, director <mark>George Miller</mark> puts on a clinic for giving the audience just enough information to keep us abreast of world and story unfolding around us, while still leaving plenty to figure out as we go. The opening shot establishes a two-headed lizard only to have it quickly eaten by our main character (played by <mark>Tom Hardy</mark>), this only moments before he and his car are chased down by a murderous gang riding an assortment of cobbled together motor vehicles that are about what you'd imagine car zombies would look like. The food chain--and its immediacy in this world--are established, and we're whisked off to the main plot. The, ahem, driving forces in Fury Road are a warlord's thirst for control over what he considers to be his property and a group of women's thirst for freedom from this dictator. Charlize Theron plays the Imperator Furiosa, trusted vanguard of warlord Immortan Joe (Hugh Keays-Byrne), who is sent to trade with another warlord for a shipment of gasoline, now a precious resource in a post-nuclear winter world. Little does he know, Furiousa is escaping with his harem of wives, and soon Immortan Joe is hot in pursuit with his motorized army of fanatical War Boys. Max, kidnapped by War Boys in that opening scene, finds himself but a bystander to this initial action, nothing but the living blood bag for a wounded War Boy named Nux (Nicholas Hoult). And by the way, along with others like \"Max Rockansteady,\" \"Rictus Erectus,\" and \"Toast the Knowing,\" if you can't get a kick out of these names, you're just not living. This, by the way, is Immortan Joe Humor, in fact, is one of the most important qualities of Mad Max: Fury Road, or at least, the self-allowance to have fun within its semiabsurdist post-apocalyptic world is. The world of Max Max is one that is highly mechanical but largely devoid of precision. It's also one that's more car-obsessed than the Fast & Furious franchise. Combined, that means that war is waged only in small part by gunfire--guns absolutely exist and are utilized, but without reliable means (it would seem) to manufacture ammunition, bullets are always at a Why yes, that is a double-necked guitar that is also a flamethrower. premium. Instead, Fury Road takes full advantage of the wide open vistas of barren desert flats, setting nitrus-infused cars loose like war chariots upon the field of battle. Explosives are the weapon of choice, often strapped to the end of spears and flung at one another in close quarters. Wheel spikes, using cars as battering rams, and leaping from vehicle to vehicle are also common tactics. And of course, there's the military band to make sure the whole formation is well-marshalled. <mark>Miller</mark> does an amazing job of making sure the audience never forgets this world is just beyond the pale, yet still stained by the dirt and grime of a place imminently recognizable. A couple key tactics play into this. First, action scenes routinely drop frames to give them a hyper-real look. Things are undoubtedly moving faster than they should, but only barely. It makes car and foot chases alike all the more spectacular, while visually reinforcing just how actually-mentally-crazy everyone in frame is. Max, as he says himself, is a man who must obey the instinct to survive at all costs. He is by definition both animal and man, and it's a great duality. But back to <mark>Miller</mark>'s directing. While daytime scenes are an unyielding reddish-orangeish-brown that looks like a real desert, night is swathed in an otherworldly blue. The scenes taking place at night tend to be less extraordinarily proportioned than their daytime counterparts, but the forced blue hue maintains the haunted, almost sickly tone of the barren world. The illusion breaks a little when bright spots and shadows reveal just how clearly this is a color filter over a daytime shoot, but I appreciated the artistry that <mark>Miller</mark> was shooting for more than I was annoyed by the blunt instrument he used to achieve it. Most surprising, however, I think this is actually one of the rare movies that you really want to see in 3D. <mark>Miller</mark> and cinematographer John Seale's (Cold Mountain) framing is immaculate, and makes a brilliant show of the added depth of field. There's a predilection for skyboxes, which is perfectly fine considering how striking the landscape is, particularly with the movie almost always giving an eye for the horizon ahead. The camera does a wonderful job of reinforcing the twisted reality and charge-forward-on-a-fast-car mentality of the rest of the movie. A few bits do get left by the wayside. The plot, as mentioned, is little more than a series of excuses to make the characters do their best to flee from one point to another, then embark on a seeming suicide mission to get back to where they started. That's mostly ok, because, hey, more of some absolutely top-notch action, but a few links in the chain are noticeably weak, particularly a couple to do with Nux, who makes the biggest emotional and philosophical arc of any of the characters. The midpoint of the film, in particular, lags a bit because having achieved one goal, Max and Furiosa have trouble defining the next. It's also worth mentioning, on that note, that both characters could have done with a bit more depth (there's sort of a singular and largely unexplored motivator driving each). Still, there are some top-notch scenes on their way to discovering their mutual benefit in working together. It's worth mentioning again that the action here really is spectacularly imaginative, fitting perfectly with the film' s bizarro reality, and that's probably the biggest draw the movie has to offer. But one of the things that should give Fury Road some staying power is a surprisingly complex motif of women's empowerment. Furiosa is an obvious embodiment of physical prowess, but where <mark>Miller</mark> makes things particularly interesting is with Immortan Joe's wives. When they're first revealed, the wives are shown in a gaze that is decidedly male and culturally traditional--clothed in a few strips of linen each, they bathe in pure water, a living oasis in the middle of an ugly and lifeless plain. Moreover, they initially seem to be sheltered and without the skills that have perpetuated Max's or Furiosa's survival. It's an uncomfortable view of the women that hammers home just how much they were property in Joe's eyes. (Unfortunately, he also says this aloud a couple of times, so some of the poetry is lost .) But as the movie progresses, the different wives show themselves remarkably capable in a number of different ways, and it becomes impossible not to see them as fully embodied and independent people. And actually some of the events around that midpoint lull are most important to the completion of this arc. Also noteworthy, the only male characters who can be seen in a heroic light end up working with these women, not only protecting them, but being protected by them. And thematically, the movie has a lot to do with the reparation of wounds inflicted by the same men who first ruined the world, and the establishment of a new and equitable society. The Verdict: 5 out of 5 Here's the deal: Mad Max: Fury Road does have some problems when it comes to both its plotline and the development of its three main characters, Max Rockansteady (<mark>Tom Hardy</mark>), Imperator Furiosa (Charlise Theron), and Nux (Nicholas Hoult). But here's the other deal: the things it does well, it does so well that it doesn't matter if it's lagging a little in those areas. The plot and the characters are merely good, and they're surrounded by phenomenal world building, great design, wonderful direction from <mark>George Miller</mark>, quality thematic development, and a stellar score by <mark>Tom</mark> Holkanborg I haven't even had the chance to praise up until now because there is so much other stuff of quality in this movie worth talking about. \"Oh what a day! What a lovely day!\" "}]