[{"articleID": "2019030715_00332406_W", "names": {"Jess Phillips": ["Q19979409", "Q6185996"]}, "date": "2019-03-07", "url": "http://www.wiltsglosstandard.co.uk/news/national/17484632.silence-in-the-commons-as-mp-reads-out-names-of-women-killed-by-men/", "content": "Silence in the Commons as MP reads out names of women killed by men By Press Association 2019 The Houses of Parliament, as <mark>Jess Phillips</mark> was speaking during the parliamentary debate marking International Women's Day 0 comment The House of Commons listened in silence as an MP read out the names of some 130 women killed by men in the last year. Labour's <mark>Jess Phillips</mark> said she wanted to use the parliamentary debate marking International Women's Day to honour her promise to share the names of those women who had died since the previous debate. The MP for Birmingham Yardley added she could \"feel the nervousness in the room\" that she would not finish reading the list within the seven-minute time limit imposed on speeches, telling the Commons: \"That is how we should feel every single minute of every single day--nervous that one of our constituents will wake up dead.\" Labour MP <mark>Jess Phillips</mark> reads out the names of women killed by men in the last 12 months (PA) It took Ms <mark>Phillips</mark> more than four minutes to read out the names and she thanked Karen Ingala Smith, of the Counting Dead Women project, for \"tirelessly\" recording the lives of the women affected. Ms <mark>Phillips</mark> explained: \"In the first International Women's Day debate I ever attended I promised to read out the names of women killed by men since the last International Women's Day--today I will honour that promise.\" Over the years I have had the pleasure of meeting the families of these women, grateful that their loved ones were being remembered. \"I read these names not only to continue to highlight how male violence can terrorise ordinary women's lives but to pay tribute to them and those who didn't survive, and give them the opportunity to be heard because the reason these women are no longer with us is because they are hard to see, they are hard to hear and they are hard to believe.\" So shocking to listen to @ jessphillips reading out a list of women killed by male violence since last International Womens Day. The list seems never ending. Each of these a victim. Terrible .--Anna Turley MP (@ annaturley) March 7, 2019 After reading out the names, Ms <mark>Phillips</mark> added: \"I could feel the nervousness in the room that I wouldn't finish reading the list within seven minutes and that is how we should feel every single minute of every single day--nervous that one of our constituents will wake up dead.\" The fear and tension that we felt in our bodies that I wouldn't get through the list and I'd be made to sit down is what victims of domestic violence feel every minute that they walk around their houses, the second they wake up in the morning they feel frightened and that they're going to have to walk on awkward eggshells all day long. \"These women need us in this place to hear their names and hear their stories so that we can change and make it so next year's list might at least be a little bit shorter\" . Conservative Helen Whately (Faversham and Mid Kent) later highlighted how \"unconscious bias and discrimination\" are still holding women back. She added: \"Just last week a man told me that women don't want to stand for election because they'd rather stay at home in the evening because men are the breadwinners and they're the ones who like to work hard.\" I've lost count of the number of times people have asked me how I manage to be an MP and look after my children, as if this is some sort of incredible feat as opposed to what women do day in day out--juggling being a Member of Parliament or any demanding career. \"0 comment"}, {"articleID": "2018020122_01112723_W", "names": {"David Meltzer": ["Q19664344", "Q3018441"], "Gerald Anderson": ["Q16146030", "Q2412115", "Q596137"]}, "date": "2018-02-01", "url": "http://www.nationalmemo.com/red-cross-general-counsel-resigns-handling-sexual-assault-allegations/", "content": "Red Cross General Counsel Resigns Over Handling of Sexual Assault Allegations February 1, 2018 sexual harassment American Red Cross General Counsel <mark>David Meltzer</mark> has resigned after a ProPublica story detailed troubling aspects of how he handled a sexual misconduct case involving another senior official at the charity. In his resignation letter, dated Jan. 31 and effective immediately, <mark>Meltzer</mark> wrote to American Red Cross CEO Gail McGovern that he deeply regretted his handling of the case. \"I want to ensure that the reputation of the institution remains strong and that nothing interferes with the organization's ability to effectively carry out its important mission,\" his letter says. In an organization-wide email this morning, McGovern announced the resignation. \"Over the course of the last year, we have seen news accounts of other organizations and institutions contending with serious instances of sexual harassment and the harmful repercussions that such misconduct can create. Last week, it was our organization's turn to again struggle with these issues,\" McGovern wrote. \"I am committed to moving forward in a way that strengthens us as an organization.\" ProPublica's story last week reported that in 2012 the charity pushed out a senior executive in its international division, <mark>Gerald Anderson</mark>, after an internal investigation concluded he sexually harassed at least one subordinate. Another Red Cross employee accused him of rape. Through his lawyer, <mark>Anderson</mark> has denied any sexual misconduct. Save the Children, which hired <mark>Anderson</mark> after he left the Red Cross, said in a statement today that \"<mark>Anderson</mark> is no longer employed by Save the Children.\" At the conclusion of the investigation in 2012, <mark>Meltzer</mark> sent out an email announcing <mark>Anderson</mark>'s departure in which <mark>Meltzer</mark> praised <mark>Anderson</mark> for his \"dedication\" and \"leadership.\" <mark>Meltzer</mark> then angered some employees at a staff meeting when he said he wished <mark>Anderson</mark> were staying at the charity, according to several people who attended. Shortly after he left the Red Cross, <mark>Anderson</mark> got a job as senior director for humanitarian response at Save the Children, a global charity based in Connecticut. <mark>Anderson</mark> was given a positive reference by a senior Red Cross official, according to Save the Children. The Red Cross said last week it was taking disciplinary action because of the positive reference but declined to provide details. In his resignation letter, <mark>Meltzer</mark> apologized for his statements around <mark>Anderson</mark>'s departure. \"I deeply regret the damage this language may have caused the organization and its wonderful staff--particularly the employees involved in this matter,\" he wrote. \"I also deeply regret that my words could have undermined confidence in the commitment of the Red Cross to properly address complaints of this nature. I would never want to be the cause of such a result. Rather, I feel strongly that every employee must feel comfortable and protected in reporting harassment and other misconduct to management.\" <mark>Meltzer</mark> couldn't immediately be reached for comment. <mark>Meltzer</mark>'s resignation follows what multiple staffers described as a tense week at the charity. At an emotional staff meeting last week of the International Services Department, where <mark>Anderson</mark> and his accusers had worked, multiple employees called for <mark>Meltzer</mark>'s resignation and a public apology to the two women who made the allegations in 2012. <mark>Meltzer</mark> worked for the Red Cross for over 12 years, rising from senior vice president for international services to a dual role as general counsel and chief international officer. In those positions, he helped oversee some of the charity's largest--and at times, most troubled--projects. He played a leading role in its half-billion-dollar relief program after the 2010 Haiti earthquake, the subject of a previous investigation by ProPublica and NPR. <mark>Meltzer</mark> has also tried to manage the charity's relationship with overseers on Capitol Hill. A 2016 Senate report found that <mark>Meltzer</mark> had successfully maneuvered to limit the scope of an inquiry into the charity's disaster relief operations by the Government Accountability Office. ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for their newsletter."}, {"articleID": "2017091320_00673162_W", "names": {"Brian White": ["Q21461106", "Q3644521", "Q4965621", "Q4965623", "Q57408280", "Q912278", "Q913226"]}, "date": "2017-09-13", "url": "http://www.bustle.com/p/what-does-iphone-x-mean-you-probably-didnt-notice-this-interesting-thing-about-the-name-2347652", "content": "What Does iPhone X Mean? You Probably Didn't Notice This Interesting Thing About The Name Justin Sullivan/Getty Images News/Getty Images Share By Brandi Neal 11 min ago While the Sept. 22 release of the iPhone 8 is is almost upon us, another new iPhone is coming out on Nov. 3: The iPhone X. Now, it's really pronounced out loud as \"iPhone 10,\" but typed out, it seems Apple took more of a Roman numeral route rather than sticking to numbers. Interestingly enough, though, in addition to utilizing Roman numerals, iPhone X is an anagram for Phoenix, which in Greek mythology is a bird that is cyclically regenerated or reborn from its own ashes. Coincidence? I'm not sure, but the description of the iPhone X sounds like one continuous experience, so even if it is coincidental, the anagram is fitting. \"Our vision has always been to create an iPhone that is entirely screen. One so immersive the device itself disappears into the experience. And so intelligent it can respond to a tap, your voice, and even a glance,\" Apple reported on its website. \"The display employs new techniques and technology to precisely follow the curves of the design, all the way to the elegantly rounded corner.\" Apple is billing the iPhone X as the phone of the future. With facial recognition ID, wireless charging, and more, it's certainly beyond what anyone ever imagine a phone could be. In comparison, the phoenix is, \"A mythical bird that never dies, the phoenix flies far ahead to the front, always scanning the landscape and distant space. It represents our capacity for vision, for collecting sensory information about our environment and the events unfolding within it. The phoenix, with its great beauty, creates intense excitement and deathless inspiration,\" The Feng Shui Handbook, Feng Shui Master Lam Kam Chuen, according to the website Mythic Realm. And, that description represents the iPhone X with stunning accuracy. Apple According to Digital Trends, the iPhone X commemorates the iPhones 10-year anniversary. But, this is where we may be able to dispel the phoenix rumors because Digital Trends reported that it's actually pronounced iPhone 10 to celebrate the milestone. However, that doesn't mean the comparison isn't accurate. \"In our view, Apple took the iPhone franchise to a whole new level with the iPhone X, pushing the company deep into the ultra-luxury smartphone market,\" <mark>Brian White</mark>, an analyst Drexel Hamilton, wrote in an investor note Wednesday, CNN reported. The evolution of the iPhone during its 10 years can be compared to the phoenix. According to the website Ancient Origins, \"Legend paints a picture of a magical bird, radiant and shimmering, which lives for several hundred years before it dies by bursting into flames. It is then reborn from the ashes, to start a new, long life.\" Giphy So, you can think of the iPhone X as Apple's rebirth, and it's swift move to reclaim its throne as the queen of all smartphones. Kind of like if a smartphone were BeyoncÃ © or Lady Gaga, who both engage in a constant cycle of reinvention and rebirth, always emerging on top. And, like these two women, Apple went about its rebirth in the same way the phoenix does. \"When it feels its end approaching, [the phoenix] builds a nest with the finest aromatic woods, sets it on fire, and is consumed by the flames,\" Tina Garnet wrote in The Phoenix in Egyptian, Arab, & Greek Mythology, according to Ancient Origins. \"From the pile of ashes, a new phoenix arises, young and powerful.\" And, with some of the most sophisticated technology Apple has ever developed, including the cameras and sensors that enable Face ID, the iPhone X is definitely a phoenix."}, {"articleID": "2013042405_00040675_W", "names": {"Mark Ellis": ["Q1350758", "Q16207268", "Q19655045", "Q28031537", "Q3294069", "Q6767512", "Q6767513", "Q6767514", "Q6767515", "Q6767516"]}, "date": "2013-04-24", "url": "http://nypost.com/p/news/national/beyonce_shutter_it_05q00P7BWuQRNLtJ3ZvRTK?utm_medium=rss&utm_content=National", "content": "\"mad\" ening the historians at \"mad men\" pride themselves on getting things right, but...fig leaf for nude gallery model a nude model who used a topless tour to convince cops not to shut down a.. . virtuous cycle washington - president obama jumped on a stationary mountain bike and...crisis help embattled \"today\" host matt lauer urged nbc to bring in a crack crisis p.r....gala catches fire for social a socialite nearly went up in flames at memorial sloan-kettering's gala...man of the people zac efron made time for his rabid fans at a tribeca film festival party for...knicks win carmelo anthony called tuesday night a \"must-win\" and he took that...yankees win st. petersburg, fla. - across the first three weeks of a very long season...mets lose niese, game that's one tough <mark>mark</mark> to erase. between the bruise <mark>mark ellis</mark> planted on...i'm no angel kylie bisutti, 23, saw her dream come true when she beat 10,000 other girls...by leonard greene last updated: beyonc? put a ban on it. the pop diva was so upset when unflattering pictures of her performing at the super bowl went viral that she's no longer allowing independent photographers to shoot her world tour, sources said. the ban came after a web site posted the string of harsh photos. \"there are some unflattering photos on your current feed that we are respectfully asking you to change,\" beyonc?'s publicist wrote in an e-mail to buzzfeed.com days after the february performance. but instead of replacing the pictures, buzzfeed did what any self-promoting entertainment web site would do: it reposted the pictures and the publicist's e-mail with a brand new headline: \"the\" unflattering' photos beyonc?'s publicist doesn't want you to see. \"soon the pictures were everywhere, some photoshopped to show the diva as a bloody zombie, a\" she hulk,' and an olympic weightlifter. hunt for boston marathon bombing suspect new york post is a registered trademark of nyp holdings, inc. ."}, {"articleID": "2017042620_00440412_W", "names": {"Kevin Kerr": ["Q22005779", "Q326761", "Q6379284", "Q6396687"]}, "date": "2017-04-26", "url": "http://www.13wmaz.com/sports/mayhem-practice-out-of-town-before-sphl-finals/434307587", "content": "Mayhem practice out of town before SPHL finals D Hunter Joyce, WMAZ 4:26 PM. EDT April 26, 2017 CONNECT TWEET LINKEDIN GOOGLE + PINTEREST The top seeded Macon Mayhem have the home ice in the SPHL finals. But before the series closes out at the Centreplex, the Mayhem are on the road, facing the Peoria Rivermen in game 1 Friday night. Due to another scheduling conflict at the coliseum, the team is unable to practice in Macon. So, head coach <mark>Kevin Kerr</mark> and the gang loaded up the bus this morning and headed down to Columbus to get in some practice on their ice. Coach says the extended road trip will give the team some time to bond before their toughest test of the season, but he's excited for the opportunity to come home and win a championship in front of the home fans. \"It's something I've wished for for our guys and I think that's why you play for home ice all year,\" says <mark>Kerr</mark>. \"You play for home ice to give yourself an opportunity and a chance to play in front of your home crowd and win a championship. And we're right there. if we can take care of business on Friday and come back home Sunday, hopefully we close it out. If not, if we need two games, we have two games at home.\" Here's the schedule for the championship series against the Rivermen. Game 1 is Friday night in Peoria. The puck drops at 8:30 EST.. Game 2 is Sunday evening in Macon. That game will start at 6 PM. Game 3, if necessary, is scheduled for Monday at 7:30. Tickets are available through the Macon Centreplex box office. Glass seats are $20 dollars. All other seats are general admission, only $14. Sunday only, tickets for kids 12 and under are just $7. © 2017 WMAZ-TV"}, {"articleID": "2014100813_00042309_W", "names": {"Paul Currie": ["Q7150070", "Q7150071"], "Christopher Gordon": ["Q2966583", "Q3332332", "Q43109056", "Q57902219"], "Jack O'Connell": ["Q16028203", "Q16184113", "Q16733588", "Q16733590", "Q22680912", "Q348066", "Q43379437", "Q6114376", "Q6114380"], "Lee Smith": ["Q1078252", "Q13563113", "Q1811998", "Q3228933", "Q3829387", "Q6515097"], "Tommy Murphy": ["Q22979519", "Q7819726", "Q7819734"], "Stephen Collins": ["Q2346903", "Q42715096", "Q435434", "Q7608927", "Q7608929"]}, "date": "2014-10-08", "url": "http://www.brisbanetimes.com.au/entertainment/movies/new-teresa-palmer-thriller-screen-music-nominees-and-early-oscar-buzz-short-cuts-column-20141008-10rjr5.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Teresa Palmer. Photo: Hugh Hamilton Teresa Palmer thriller lined up for a Sydney shoot While there was no word on funding for the Hollywood movie that has brought Robert Redford to Sydney - he is playing newcaster Dan Rather in James Vanderbilt's drama Truth opposite Cate Blanchett and Elisabeth Moss - the NSW government has backed another film with Hollywood connections. Former Fox Filmed Entertainment executive Bill Mechanic, who produced the Pierce Brosnan-William Hurt historical fantasy The Moon and The Sun in Melbourne earlier this year, is part of the high-profile team behind <mark>Paul Currie</mark>'s thriller 2.22. Due to start filming at Fox Studios in January, it centres on an air traffic controller who finds himself returning to New York's Grand Central Station at 2.22 pm every day - an event that threatens the life of the woman he loves. While the male lead is still to be confirmed, Teresa Palmer will star in the film once she finishes shooting the Nicholas Sparks romance The Choice. With Screen Australia backing 2.22 in August, the state government has now put up $600,000 for an expected spend of $8.1 million in NSW. Arts Minister Troy Grant describes it as \"a great example of how our entrepreneurial filmmakers are working on the world stage and partnering with international producers\" . Hirschfelder has two shots at winning best feature film score Colin Firth in The Railway Man. Composer David Hirschfelder has been a regular award winner over the years for his scores for the likes of Shine, Elizabeth and Better Than Sex. And as he works on Russell Crowe's The Water Diviner, he has claimed two of the four nominations for best feature film score at the Screen Music Awards to be held next month. Nominated for The Railway Man and Healing, Hirschfelder is up against <mark>Christopher Gordon</mark> for Adoration and <mark>Christopher</mark> de Groot for the little-known thriller Sororal. But two other composers have done even better with six nominations each - Antony Partos, whose work includes Redfern Now, Rake and Fallout, and Cezary Skubiszewski, whose work includes Once My Mother, The Broken Shore and Serangoon Road. Held by the Australian Guild of Screen Composers with the Australasian Performing Right Association and the Australasian Copyright Owners Society, the awards will be held at Sydney's City Recital Hall on November 12. Advertisement Early Oscar buzz has only one Australian actor in contention With Charlie's Country selected as Australia's entry for the foreign-language category, the Oscars are back in the news. And it looks like the near certainty that at least one Australian actor will be nominated might not eventuate next year. In the 16 years since Geoffrey Rush won best actor for Shine, the country's actors have only missed out twice, with a remarkable 23 nominations for five wins. While there are still three months before the nominations are announced, The Hollywood Reporter has framed a list of the leading contenders. With no mention of Cate Blanchett, Nicole Kidman, Geoffrey Rush, Russell Crowe, Hugh Jackman and other leading lights, only one Australian actor features - Mia Wasikowska is considered a long-shot for a best actress nomination for Tracks. For best actor, the only (tenuous) Australian connection is <mark>Jack O'Connell</mark> as a frontrunner for Unbroken, which was shot here. Two Australian editors who were both nominated five years ago are deep in the running again - two-time winner Kirk Baxter for Gone Girl and <mark>Lee Smith</mark> for Interstellar. And, deservedly, the Sydney-shot The Lego Movie is one of the favourites for best animated feature. Mia Wasikowksa in Tracks. Gone Girl arrives with a flourish at the box office On the back of strong reviews and the the popularity of the bestselling novel, Gone Girl zoomed to the top of the Australian box office on the weekend. Director David Fincher's follow-up to The Social Network and The Girl With The Dragon Tattoo took $4.7 million with a strong average of $11,700 per cinema. In a country where horror films often perform modestly, Annabelle also opened well with $1.9 million for an average of $11,500 per cinema. A prequel to The Conjuring, it continues an impressive run with low-budget horror for prolific Australian filmmaker James Wan, who broke through with Saw a decade ago. Wan was one of the producers of Annabelle after directing last year's hits The Conjuring and Insidious: Chapter 2. He has Fast & Furious 7 out next April. Social media popularity leads to surprising results at the US box office Ben Affleck in Gone Girl. The importance of social media in film marketing was shown at the US box office at the weekend, when Gone Girl and Annabelle surprisingly outperformed box office projections - both taking more than $US37 million at the top of the charts. According to Deadline Hollywood, tracking showed that Annabelle's trailers and promotional videos had 16.2 million YouTube views and the movie had 2.4 million Facebook posts and 2.8 million Tweets. More popular on older-skewing social media, Gone Girl had 9.2 million YouTube views, 30.1 million Facebook posts and 18.7 million Tweets. While Short Cuts will always encourage newspaper advertising, the value of a powerful trailer and promotional clips as part of a social media campaign has become increasingly important to a movie's release. Playwright live tweets film shoot Speaking of which, playwright <mark>Tommy Murphy</mark> boosted the social media presence of the film adaptation of his play Holding The Man by live tweeting from the Sydney set this week. He posted a series of photos of the crew, including director Neil Armfield (Neil Armfield on the set of Holding The Man. Photo: Photo: <mark>Tommy Murphy</mark> Academy in best financial position in years after new sponsor With a new two-year sponsorship deal with Hyundai and another new sponsor to be announced soon, chief executive Damian Trewhella says the Australian Academy of Cinema and Television Arts is in its best financial position for a long time as its award judging screenings get under way. The deal will see the car company present Social Shorts, which Trewhella describes as a chance for \"emerging filmmakers to have their work seen, shared and acknowledged by film enthusists and industry\" through a web site linked to social media voting. The academy does not having a naming rights partner for the awards but isn't chasing one either. Instead, Trewhella says it's looking for a presenting rights partner. \"We'd like to keep the AACTA Awards clean but\" the AACTA Awards presented by X or Y' is a really great opportunity now that these strong mid-tier building blocks are put in place. \"Free concert of film scores to launch Melbourne Symphony Orchestra season 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? Morrissey fans in shock over his cancer revelation:\" If I die, I die' 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse The Bachelor's sham proposal: Why is Network Ten not the villain? The Bachelor's sham proposal: Why is Network Ten not the villain? 7th Heaven father <mark>Stephen Collins</mark> allegedly confesses to sex abuse"}, {"articleID": "2011101114_00064767_W", "names": {"Jay Cutler": ["Q312811", "Q937778"], "John Fox": ["Q12892062", "Q13459838", "Q19662010", "Q19750869", "Q24285717", "Q3809274", "Q44786513", "Q6233800", "Q6233806", "Q6233808", "Q6233810", "Q719030"]}, "date": "2011-10-11", "url": "http://neighbors.denverpost.com/viewtopic.php?p=2147577#p2147577", "content": "forget the naysayers. right now the broncos are driving into the same brick wall in the same, old way, and expecting new, and different results. they have to do something to get this team excited, and orton just isn't cutting it as team leader. hey, when they have a chance to win, and the offense goes three-and-out on three plays that weren't even close, that hurts morale. it's hard to have confidence in a guy who goes 6-13 for 34 yards with one interception, and is tied for the league lead in interceptions. i do not put all of the onus on orton, but it is the job of the qb to be the team leader, to be the spark in offensive engine, and to rally the troops when it's rally time. orton may be the best qb they have, and their best option under center in terms of talent, ability, and experience, but, when it comes to motivating a team, and getting them to believe they can win, orton isn't cutting it and has lost the confidence not only of the fans, but of his teammates as well. orton won the job in training camp, and pretty much came out and stunk up the place on the way to a 1-4 record at the bye. watching <mark>jay cutler</mark> on monday night, and realizing that his offensive line was as bad or worse than the broncos, and also realizing that he was finding ways to overcome that when orton could not even come close really sealed the deal for me. orton gives up too easily, and resigns himself to, \"there's nothing i can do,\" but tebow, no matter how much he still has yet to learn will take whatever you give him, and keep trying no matter what. i truly can't believe it. the fans in denver really do run the football team. how else do you explain a 3rd string qb jumping to starter with no injuries involve? orton and quinn should both be asking for trades. of course, if i ran the team i would trade all 3. i could care less about entertainment. i want the team to win. that is the point of this sport. okay, please tell us what trades you would make, which qarterback out there you could aquire and how you would teach him the offense fast enough that he would have a better chance of winning the current qb. with the records of the past coaching staffs, the fans can do just a good a job...rathbone7 wrote: i truly can't believe it. the fans in denver really do run the football team. how else do you explain a 3rd string qb jumping to starter with no injuries involve? orton and quinn should both be asking for trades. of course, if i ran the team i would trade all 3. i could care less about entertainment. i want the team to win. that is the point of this sport. mr mojo risin wrote: might be a good idea for those of us who have been calling for tim to start to get a little thick skinned ourselves. probably gonna be some asinine arguments and statements made until tebow does what we said he would do. it's all about making plays when it matters and w's. mojo, i'm telling you, it won't matter what tebow does, there will be asinine arguments and statements regardless. every incomplete pass, every int you'll see the usual crew on here talking about \"i thought god loved timmay\" or some such nonsense. ya know what i'm waiting for tho? i can't wait for them to cry about missing out on luck when he starts winning. he beats miami and you'll get some moron in here saying \"now we're 2 games behind miami in the luck sweepstakes! waaaaah!!!\" take it to the bank. the last 2 1/2 half years have been very frustrating and trying for all bronco fans. through it all i learned 3 valuable lessons. 1. i gave orton more credit than he deserved. 2. that there are quite a few tebow fans that have more football knowledge than i gave them credit. rathbone7 wrote: i truly can't believe it. the fans in denver really do run the football team. how else do you explain a 3rd string qb jumping to starter with no injuries involve? orton and quinn should both be asking for trades. of course, if i ran the team i would trade all 3. i could care less about entertainment. i want the team to win. that is the point of this sport. first, doesn't sound like you're from denver or have much invested in our broncos, so you can leave whenever you'd like. second, it was obviously clear that tebow in no way was ever \"3rd string\" , like many on these boards tried to claim (scott silver also said he was 4th string???? yeah good call silver). <mark>fox</mark> came out and literally said anyone who thought he was 3rd string was just flat out wrong. <mark>fox</mark> hasnt really handled this teams affairs all that well.he seems to be a day late and a dollar short all the time. i give him bringing miller in...but thats it. where is this high powered running game/sure mcaghee is running his off. . but i doubt hell last the season this way. moreno has become a reciever. wheres ball in all this? seldom seen. he played ortons card till he literly had to pull the guy from embarassment. trying to prove some damn thing??? for being known as a great defensive coach...im not seeing it. it looks to me like, these guys are trying but they are doing it on fumes...from other organaizations and their own knowledge. wheres is the <mark>john fox</mark> stamp on this defense? im a little mcd!!! again!!! he does chew gum rather well...with an open mouth...nice...i will admit i supported mcdaniels and orton more than both deserve. with the lockout, coaching change and a pretty bare bones football team i can't really blame coach <mark>fox</mark> for the current teams lackluster play. as fans we know of the major problems the broncos have been going through and most would agree we need a franchise qb to start, but we also know how pathetic the defense was and how porous our o-line and terrible running game has been. orton earned the opportunity to be the starting quarterback, he simply couldn't produce with it. therefore, <mark>fox</mark> has to make this change and that change has to be tebow. when you have an \"o'\" line that can't block and receivers who can't get open, a quarterback that can run is your only options. broncocrusader wrote: mr mojo risin wrote: might be a good idea for those of us who have been calling for tim to start to get a little thick skinned ourselves. probably gonna be some asinine arguments and statements made until tebow does what we said he would do. it's all about making plays when it matters and w's. mojo, i'm telling you, it won't matter what tebow does, there will be asinine arguments and statements regardless. every incomplete pass, every int you'll see the usual crew on here talking about \"i thought god loved timmay\" or some such nonsense. ya know what i'm waiting for tho? i can't wait for them to cry about missing out on luck when he starts winning. he beats miami and you'll get some moron in here saying \"now we're 2 games behind miami in the luck sweepstakes! waaaaah!!!\" take it to the bank. the last 2 1/2 half years have been very frustrating and trying for all bronco fans. through it all i learned 3 valuable lessons. 1. i gave orton more credit than he deserved. 2. that there are quite a few tebow fans that have more football knowledge than i gave them credit. 3. a minion will always be a minion and have no rational thoughts to convey and should keep their thought to themselves anyone who \"gave orton more credit that he deserved\" especially after his last two seasons should have their nfl viewing rights stripped. face it, your ttds prevented you from seeing what was right in front of you. irrational hate can do that to ya. you wanted orton to be good, in the face of his recent history, because it would have justified your hate of tt. how'd that delusion work out for ya? there are no \"tebow\" fans, as much as you and the few remaining ttdsers would like to believe. the fact that you can't name names or point to posts tells you that. the reality is we are bronco fans who thought the best interest of the franchise was in finding out what tebow can do on the football field for a whole season before throwing away 3 drafts on another qb. but again, ttds prevented you from seeing the reality of the situation. even now you can't admit you were wrong, and only grudgingly give \"tebow fans\" credit. does the fact that i joined this board in 2009, while tt was still in college, mean anything to you, or does your ttds require you to just dismiss facts if they don't fit your delusion? johnnyk7 wrote: ok, so tebow had to shake off a little rust in the third quarter. no problem, it s/b expected. a few bobbled exchanges under center are ok. we want him in there to learn and give us the entertainment of days gone past. i remember elway doing the same thing when he was first starting out. shucks, on occaision, <mark>john</mark> used to line up under the guard instead of the center. the way i see it, three or four passes should have been caught by our receivers (even though they were a little under thrown). 95% of the time, if it hits them in two hands, it should be caught. end of story. boy-oh-boy, i especially wish decker wouldve caught his. even more so, i wish that he had one more step when he stormed in towards the right side of the endzone on the last play of the game and ultimately redeemed himself by catching the winning touchdown. decker & tebow have a pretty good chance to become a thing of legends just like elway & sharpe, or elway & smith, or elway and mccaffery. tim has all of the intangibles. tim is a student of the game. i do not know about you all, but i can see the difference already in regards to tebow staying in the pocket and looking for the receivers first before taking off. he showed it in the pre-season and he showed it on sunday. he is the kind of person that will not let himself fail. here's what i'd like to see happen. we finally trade orton to miami in the next two weeks. he starts for miami agianst us, against tebow, and von miller is unleashed on him hmmmm, it could happen. wishful thinking! hey, by the way, when rivers fumbled the ball and we got it overturned by the refs, would you not enforce the kenny stabler rule (wink) \"he gave us a spark. that's tim tebow,\" running back willis mcgahee said afterward. \"everybody's been cheering for him for the longest, and now he finally got in and came in and moved the ball for us.\" careful there willis, that almost sounds like the locker room was pulling for tebow from the start. of course willis is a miami product and should be a big supporter of tebow. i also think kuper is in that category. why it seemed as if the whole team played harder after tebow came in as qb. who could possibly imaging such a metamorphosis. well maybe some of those stupid fans. you know the one's that aren't the coaches. the one's who should just sit back and shut up, because the coaches are the professionals, and.... yada,...yada,...yada .>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> spider wrote: the last 2 1/2 half years have been very frustrating and trying for all bronco fans. through it all i learned 3 valuable lessons. 1. i gave orton more credit than he deserved. 2. that there are quite a few tebow fans that have more football knowledge than i gave them credit. 3. a minion will always be a minion and have no rational thoughts to convey and should keep their thought to themselves i can't tell if this is a serious comment or if you're being sarcastic. i hope that you do truly realize that some tebow fans do know football. i hope you give credit to people who, from day one, said this is what would happen. also, i don't know what your minion comment is about. i think the previous posters comment has validity to it. no matter what tim does in the coming weeks, there will be people (yourself included most likely) that will still scrutinize his faults. he could win the game with 300 + yards and 3 tds but they will find his 10 incompletions and say how they were way off target or terrible decisions. \"man, the broncos just can't catch a break at dt. before too long, they may have to make a midseason defensive shift back to a 3-4 because they won't have enough tackles to effectively run a 4-3 anymore. really too bad about vickerson too, he was pl...\"aaron j 2 minutes ago\" {quoted text} reverend tebow is the only way. when the broncos win, it will only be because of <mark>fox</mark> news analyst tebow. when the broncos lose, it will only be because coach <mark>fox</mark> and the rest of the broncos intentionally sa...\"rev t 3 minutes ago\" hey midwestfan what part of afc west champions do you not understand? i know this might be hard for you because of all the time your donkteam spent in the cellar last year with that 4 win season they put up but work with me on this. i assume that wit...\"kc broncohater 3 minutes ago\" luck has been built up so high it will be interesting to see how he lives up to those expectations. talk about pressure...especially if he goes to a bad team with a bad o-line. \"krieger: tim tebow gets his audition as broncos' qb of the future"}, {"articleID": "2017112016_00754946_W", "names": {"Mark Lawrence": ["Q1649595", "Q641046", "Q6768507", "Q6768508", "Q6768509", "Q6768510", "Q6768511", "Q6768512", "Q6768513"], "Jim Lewis": ["Q15485791", "Q16731449", "Q3178877", "Q47091330", "Q57243784", "Q6196406", "Q6196408", "Q6196413", "Q6196418"]}, "date": "2017-11-20", "url": "http://www.christianpost.com/news/sc-high-court-rejects-breakaway-dioceses-appeal-to-decision-giving-properties-to-episcopal-church-207208/", "content": "SC High Court Rejects Breakaway Diocese's Appeal to Decision Giving Properties to Episcopal Church Free sign up cp newsletter! Sign up By, Christian Post Reporter | Nov 20, 2017 10:44 AM Michael Gryboski (Photo: Wikimedia Commons) The building of the South Carolina Supreme Court, located in Columbia, South Carolina. The South Carolina Supreme Court has denied a motion by a breakaway diocese to reconsider a decision granting ownership of nearly all of their properties to The Episcopal Church. In a divided decision released Friday, the state's highest court denied a motion from the Episcopal Diocese of South Carolina, with the motion failing to get the necessary majority vote from the judges. \"In light of the above, the petitions for rehearing have failed to recieve a majority vote. Therefore the petitions for rehearing have been denied, and the opinions previously filed in this case reflect the final decision of this Court,\" stated the denial notice. The decision garnered praise from The Episcopal Church in South Carolina, which is the name for those Episcopalians within the diocese who stayed loyal to the national denomination. Expand | Collapse (Photo: Joy Hunter) The Reverend <mark>Mark Lawrence</mark>, bishop of the Protestant Episcopal Diocese of South Carolina, on the steps of Cathedral of St. Luke and St. Paul in Charleston, South Carolina, in April of 2014. In a statement released Sunday, TECSC Bishop Skip Adams expressed thanks for the decision, but also said that \"the hope of reconciliation has been our guiding principle.\" \"We understand that the many people in the parishes affected by this ruling may be experiencing pain, fear and confusion,\" stated Bishop Adams. \"Let me say to all that The Episcopal Church in South Carolina is committed to finding a path that will allow the people of God to continue to live their lives as a part of the Anglican Communion in and through the Episcopal Church.\" In November 2012, the South Carolina Diocese voted to leave the national denomination (The Episcopal Church) due to theological differences and the apparent mistreatment of diocesan bishop the Rev. <mark>Mark Lawrence</mark>. In January 2013, a lawsuit was filed by the breakaway diocesan leadership over the rightful ownership of the name and property of the regional body. The estimated value of the property is $500 million. In August, the state supreme court ruled that nearly all the church properties belonged to the national denomination, overturning a lower court decision from 2015. Acting Justice Costa Pleicones authored the majority opinion, in which he argued that the lower court ruling had an \"error of law\" which produced \"a distorted view of the issues in this case.\" \"I conclude that the present property and church governance disputes are not appropriate for resolution in the civil courts and would reverse the order to the extent it purports to resolve these questions,\" wrote Justice Pleicones. \"Finally, I find the trial court erred in holding that the Respondents' state-registered trademarks prevail over TEC's federally-protected trademarks, and therefore would also reverse that portion of the order.\" Regarding the Friday denial of motion to rehear, the Rev. Canon <mark>Jim Lewis</mark> of the South Carolina Diocese said in a statement released Saturday that he was \"deeply disappointed.\" <mark>Lewis</mark> believed that there were many concerns with how the state court handled the case, which will lead them to consider appealing to the U.S. Supreme Court. \"We believe the number and character of the issues at stake in this ruling merit review by the high court. Because of the long road of litigation that has brought us to this day, all the parties to this case will need to take counsel together before deciding our next steps,\" stated <mark>Lewis</mark>. \"We remain confident that God is at work in even these circumstances to redeem and use them, as He does all things, for His glory and the building up of His Church.\" Free sign up cp newsletter! Sign up Related"}, {"articleID": "2011102411_00078368_W", "names": {"Douglas Evans": ["Q16842769", "Q57402615"], "Charlie Cox": ["Q454231", "Q5084731", "Q5084734"]}, "date": "2011-10-24", "url": "http://sent-trib.com/ap-news/local-bodies-say-ohio-state-cuts-leading-to-levies", "content": "local bodies say ohio state cuts leading to levies columbus, ohio (ap) - despite warnings by gov. john kasich that raising local taxes could hurt ohio's development efforts, local governing bodies say they have no choice but to ask voters for more money this november after enduring cuts in state aid. on nov. 8, voters throughout ohio will decide nearly 1,100 requests for more tax dollars, ranging from school operations and improvements to parks and senior services, the columbus dispatch reported. \"the economy is incredibly tough, and there is a lot of competition for property taxes,\" said matt detemple, executive director of the ohio township association. kasich and gop leaders have said their budget, which went into effect in july, closed a massive budget hole without raising taxes, but cuts in state dollars flowing to local government have combined with cuts from earlier years to create an urgent need for cash, the newspaper reported. dozens of townships are asking their residents for more money on the ballot to make up a 25 percent cut in state aid, with an additional 25 percent cut expected next year. \"it's a huge hit for township budgets,\" detemple said. \"they have no choice but to ask local voters.\" cuts in state money have meant some libraries have had to cut back on staff and hours, despite increased demand. <mark>douglas evans</mark>, executive director of the ohio library council, tells the newspaper that state aid for libraries has been reduced by 30 percent in the last decade - most of which was cut in the past four years. throughout ohio, 20 library levies will ask taxpayers to either maintain taxes passed previously or increase the level residents are giving. \"the new levies are not excessive, libraries are just trying to make up for what they've lose,\" <mark>evans</mark> said. voters seem to be growing weary of continual requests for tax revenue. <mark>charlie cox</mark>, a 68-year-old retired car salesman in westerville, tells the newspaper that \"enough is enough.\" \"i love my neighborhood, and i love my schools, and westerville has great ideas,\" said <mark>cox</mark>, who has campaign sign in his yard that reads \"the time has come. vote no on everything.\" \"they spend money before they know where it's coming from, and it gets to the point where you have to say:\" stop'. \"eric sanchez, 42, also of westerville, said he is researching all of the city's three levies, but he feels like they come back every year.\" i wonder where this money is being spent and whether we can't hold off a few years until the economy turns around, \"he said. the 1,100 levies this year are actually down from previous years. some school districts have leftover money from the federal stimulus, and other local government leaders may not want to be on the same ballot as state issue 2 - the effort to repeal ohio's contested new collective bargaining law. for his part, kasich said he's still studying the issues for his local genoa township ballot.\" i intend to find out what they're all about, if they merit a vote in favor, i'll vote in favor, \"he told the dispatch.\" and when i do vote, i'm not going to tell you how i voted because it's a private ballot. \""}, {"articleID": "2017122307_00174035_W", "names": {"Maurice Smith": ["Q2698144", "Q30122557", "Q3301416", "Q6793475", "Q6793476", "Q721093"], "Donald Trump": ["Q22686", "Q27947481"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Stephen Curry": ["Q352159", "Q43981708", "Q5573861"]}, "date": "2017-12-23", "url": "http://www.rappler.com/sports/world/192095-nfl-nba-political-protest-year", "content": "NFL, NBA go political in year of protests World Sports NFL, NBA go political in year of protests 2017 is a year that saw sports figures make a stand - and kneel - against Trump and a culture of inequality Published 3:12 PM, December 23, 2017 Updated 3:12 PM, December 23, 2017 PROTEST. <mark>Maurice Smith</mark> #27 and Julius Thomas #89 kneel with Jarvis Landry #14 of the Miami Dolphins during the National Anthem prior to an NFL game against the New York Jets. Steven Ryan/Getty Images/AFP LOS ANGELES--From the US President describing protesting NFL players as \"sons of bitches\" to the pre-eminent superstar of the NBA disparaging the occupant of the White House as a \"bum\" , 2017 was the year that American sport went political. Decades of convention which had allowed the two phenomenally successful professional sports leagues to chug along peacefully, and apolitically, were swept away in the course on one tumultuous weekend in September. In February, as protests erupted across the nation after <mark>Donald Trump</mark>'s new administration issued restrictions on visitors from several Muslim nations, participants in Super Bowl 52 mostly stuck to the line that sport and politics should be kept apart. \"I'm not talking politics at all,\" said New England Patriots quarterback <mark>Tom Brady</mark>. \"If people want to take sides, they have a right to do that. I have a right to stay out of it too.\" <mark>Brady</mark> would subsequently go on to lead the Patriots to an astonishing comeback from 28-3 down to defeat the Atlanta Falcons for a record fifth Super Bowl. In the immediate aftermath of that win, there was no hint of the controversy that would engulf America's most popular sport soon after the 2017-2018 season kicked off 7 months later. The seeds had been sown a year earlier, when San Francisco 49ers quarterback Colin Kaepernick refused to stand for the national anthem in a protest aimed at drawing attention to injustices suffered by minorities at the hands of law enforcement. Trump tirade Yet as September rolled around, Kaepernick's protest movement had largely fizzled. Kaepernick, a free agent, had found himself frozen out of the sport, with none of the 32 teams in the NFL seeing any value in a 30-year-old quarterback who had led the 49ers to the brink of a Super Bowl victory only 4 years earlier. A handful of players continued to kneel for the anthem in early season games, but as a story, the issue had been mostly forgotten. That all changed on September 22, when Trump, speaking at a rally in Alabama, raised the issue of NFL players who refused to stand for the anthem. To loud cheers, Trump said NFL owners should respond to the players by saying, \"Get that son of a bitch off the field right now, he's fired. He's fired!\" . The following day, Trump turned his attention to the NBA's reigning champions Golden State and their star point guard, <mark>Stephen Curry</mark>. <mark>Curry</mark>, like many of his Warriors team-mates an outspoken critic of Trump, had earlier indicated he would be reluctant to visit a White House reception if the team was invited. Trump responded by withdrawing the team's invitation. \"Going to the White House is considered a great honor for a championship team. <mark>Stephen Curry</mark> is hesitating, therefore invitation is withdrawn!\" he wrote. Trump's outburst drew sharp criticism, with Cleveland Cavaliers superstar LeBron James leading the charge. \"U bum @ StephenCurry already said he ain't going!\" James wrote on Twitter. \"So therefore ain't no invite. Going to White House was a great honor until you showed up.\" \"Lack of respect' The NFL, meanwhile, united in its response to Trump's criticism of players who protest.\" Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players, \"NFL commissioner Roger Goodell wrote in a statement. NFL team owners issued statements condemning Trump's comments. (READ: Fil-Am NFL star Baldwin believes\" dehumanized' Trump's comments can unify sports world) But the most resounding statement came on the following Sunday, two days after Trump's comments, when a wave of player protests erupted across the league in the biggest single demonstration of political activism in NFL history. All told, around 150 players across the league took to one knee during the playing of the US national anthem, instantly reigniting Kaepernick's cause. \"We felt like President Trump's speech was an assault on our most cherished right--freedom of speech,\" Denver star Von Miller explained. Trump's anti-NFL invective has continued, as have the player protests, albeit on a smaller scale. The NFL meanwhile has had to navigate a difficult course, on the one hand defending protesting players from political attack while at the same time not antagonizing fans who see refusal to stand for the anthem as an affront bordering on treason. Goodell has led talks with protesting players and the NFL has pledged nearly $100 million to charities which deal with criminal justice reform, law enforcement/community relations and education. The NFL hierarchy hopes the pledge will help draw a line under its season of protest, although there is no explicit requirement for players to refrain from demonstrating during the anthem .--Rappler.com"}]