[{"articleID": "2019040114_00450996_W", "names": {"Mark Fuller": ["Q50326821", "Q6767691", "Q6767692"]}, "date": "2019-04-01", "url": "http://www.nbcconnecticut.com/entertainment/entertainment-news/Game-of-Thrones-Takes-Over-Bellagio-Fountains-in-Las-Vegas-507943121.html", "content": "\"Game of Thrones' Takes Over Bellagio Fountains in Las Vegas The 3 1/2 - minute spectacle that left a crowd of onlookers cheering debuted two weeks ahead of the scheduled premiere of the HBO fantasy series' final season Published 2 minutes ago NEWSLETTERS Receive the latest entertainment-news updates in your inbox Email Privacy policy | More Newsletters AP A woman watches during a\" Game of Thrones \"- themed show at the fountains at the Bellagio casino-resort, Sunday, March 31, 2019, in Las Vegas. Winter came to Las Vegas. Fire-breathing dragons held court over the world-famous fountains at the Bellagio casino-resort Sunday, as familiar elements from the TV phenomenon\" Game of Thrones \"were projected on the rising water. The jets danced to a score incorporating the recognizable theme song before one of the colossal beasts lit up the lake along the Las Vegas Strip in a blaze of pyrotechnics. The 3 1/2 - minute spectacle that left a crowd of onlookers cheering debuted two weeks ahead of the scheduled premiere of the HBO fantasy series' final season. The streaming water formed the show's iconic throne and crown. A towering 800-foot-long (244-meter) wall of water emerged from the lake. In Memoriam:\" Victory Lap' Rapper Nipsey Hussle Matt Winkelmeyer/Getty Images for Warner Music The display, however, intentionally did not reveal any elements of the new season. \"We didn't just want to portray literally scenes from\" Game of Thrones' here, not like a teaser or a preview of season eight, \"said <mark>Mark Fuller</mark>, CEO of WET Design, the company that created the fountains and show.\" We want to bring you the emotion. \"At the heart of the fountain show is the giant wall of water. It represents the ice wall that defines the TV show, but also serves as a surface onto which the creators project falling snow, the series' logo and the silhouettes of the dragons breathing orange and blue flames. Fox's Pirro Back on-Air After Remarks on Muslim Politician The company worked with the series' composer Ramin Djawadi to create a special score that along with the dancing water aimed to capture the excitement of the TV hit. The fountain show begins by dropping musical hints of the TV series, using Djawadi's\" Winter is Here \"from the seventh season. It comes to full force as the show's recognizable\" Main Titles \"theme song comes on.\" We have to make sure that the fountain gives the same kind of energy, the same kind of drama, that people are associating this music with, \"said Peter Kopik, director of design and choreography for WET Design.\" (That) was the hard part of the choreography because it's continuously energetic and continuously up and loud and strong, and choreography had to reflect the same thing and not being tiring at the same time. \"WATCH: Jussie Smollett Speaks After Charges Dropped Jussie Smollett makes a statement after appearing in court where prosecutors dropped all charges against him. (Published Tuesday, March 26, 2019) The spectacle ends as the shadow of the Night King appears one last time, and flames cover part of the roughly 9-acre (3.6-hectare) lake. Oklahoma resident Josh Elliott stopped by the lake with his wife Sunday as part of their anniversary trip. They were amazed by what they saw.\" We have probably seen a hundred fountain shows, and this is by far the best, \"he said while waiting for the show to start for a second time.\" Oh yeah, we are not moving. \"Live-Action\" Dumbo' Struggles to Soar at Box Office Las Vegas resident Gaile Tiquia is re-watching all seasons ahead of the upcoming premiere. She said she came to the casino-resort after seeing a mention on social media about the special show and wondering if it would include any spoilers. \"I had chills for the entire show,\" she said. \"It's amazing! It's too much.\" The \"Game of Thrones\" fountain show marks the first time the lake has been set ablaze, but artists and others have previously used the fountains for a variety of stunts. Billionaire Richard Branson rode a jet ski on the lake in 2010, and Drake performed one of his hits there during the 2017 Billboard Music Awards. Top Celeb Photos: Vice and Netflix Premiere \"The Beach Bum' Richard Shotwell/Invision/AP The landmark at the luxury property owned by MGM Resorts International attracts millions of visitors every year. It has nightly shows with recorded music ranging from Andrea Bocelli and Sarah Brightman's duet\" Time to Say Goodbye \"to Sin City's unofficial hymn\" Viva Las Vegas \"sung by Elvis Presley.\" The Bellagio fountain is iconic. It's known around the world, and so is \"Game of Thrones,'\" Djawadi said. \"So, I think putting them together and seeing the music choreographed to a fountain like that is quite the spectacle. I think it will get everybody really pumped for this final season coming up.\" The special fountain show will run nightly until April 13, the day before the eighth season's premiere. Elon Musk Releases Rap Single About Harambe the Gorilla Copyright Associated Press"}, {"articleID": "2009110806_00140494_W", "names": {"Liaquat Ali Khan": ["Q48719872", "Q56275283"], "Abdul Malik": ["Q18670599", "Q19840595", "Q20565623", "Q30612131", "Q4665536", "Q58206067", "Q59627439"]}, "date": "2009-11-08", "url": "http://publicbroadcasting.net/wabe/news.newsmain/article/0/3/1575502/World/Market.attack.in.NW.Pakistan.kills.at.least.8", "content": "by faris <mark>ali</mark> peshawar, pakistan (reuters) - a suicide bomber killed an anti-taliban village mayor and seven other people in an attack on the outskirts of pakistan's volatile city of peshawar on sunday, officials said. the bomber blew himself up as <mark>abdul malik</mark>, mayor of matni village, was standing in a busy market. matni is close to the lawless tribal lands where islamist militants are active. \"so far, eight people have died, including <mark>abdul malik</mark>,\" sahibzada anis, peshawar's top administration official, told reuters. hospital officials said at least nine people were killed and 36 wounded, several of them seriously. islamist militants have unleashed a campaign of bomb and suicide attacks in pakistan in recent weeks in retaliation for a major offensive launched by security forces in their main bastion, south waziristan, on the afghan border. that assault in south waziristan's rugged landscape of barren mountains and hidden ravines, now a center of global islamist militancy, is being closely watched by the united states and other powers embroiled in afghanistan. to support their overall anti-militant drive, pakistani authorities have encouraged pashtun tribes to revive traditional militia to counter rising islamist militancy. \"deadly against taliban' <mark>malik</mark> was head of a lashkar, or tribal militia, raised by the villagers against the militants.\" he was pro-government and was deadly against the taliban, \"peshawar police chief <mark>liaquat ali khan</mark> said. militants have killed numerous pro-government tribal elders over the past few years, and have stepped up attacks recently. last month, more than 100 people were killed in a car bombing in peshawar in the deadliest attack in the country in two years. more than 150 people were killed in attacks before the army began the assault in south waziristan. the army went on the offensive in the ethnic pashtun region on october 17 aiming to root out pakistani taliban militants behind a wave of violence in urban areas. soldiers have been advancing into the militant heartland from three directions and had entered their headquarters of makeen on friday."}, {"articleID": "2014092710_00050153_W", "names": {"Paulo Coelho": ["Q12881", "Q46727943", "Q56420084"]}, "date": "2014-09-27", "url": "http://manilastandardtoday.com/2014/09/27/noreen-capili/", "content": "Don't use big words just to impress your readers. It doesn't matter how you say it. You never go wrong if you write from the heart. \"Noreen Capili, also known as Noringai, author of the best-selling books\" Parang Kayo Pero Hindi, \"and\" Buti Pa ang Roma May Bagong Papa, \"has this advice to give to aspiring writers and she makes use of this to the hilt in getting her message across to her readers. Her two books were the result of years of hard work as a blogger, a contributor to an online community, a love advice columnist for a magazine and a similar job for a maritime company, and a soap opera writer for a local TV network. A graduate of BA Creative Writing in UP Diliman, Capili dreamed of seeing her name on the TV screen, releasing her own book, and writing for movies. She has already written for TV shows like the sitcom\" My Juan and Only, \"the anthology\" Your Song, \"and soap operas\" Katorse, \"\"My Binondo Girl,\" \"Rubi,\" \"Walang Hanggan,\" \"Mutya,\" \"Sabel,\" \"Aryana,\" and \"Mirabella,\" just to name a few. And from the books that she published, she might soon write for movies based on their adaptations. \"Star Cinema just bought the rights to\" Parang Kayo Pero Hindi' for a movie adaptation. We're now developing the story. I'm writing the storyline. This might be my first film as a writer. There were also inquiries about \"Buti Pa ang Roma May Bagong Papa' to turn it into a movie,\" Capili disclosed. \"I initially joined a writing workshop conducted by director Joey Reyes while I had a day job in Makati. I took a leave every Monday for three months so I could attend the workshop. After that, Direk Joey invited me to work with him in a sitcom. When it ended, our producer got me to write for an anthology. That's my first drama. I wrote different stories every week. From there on, I got other writing jobs. I resigned from my day job so I could write full-time. I took another workshop, this time under Bing Lao in 2007,\" said Capili, who makes people laugh, cry, and fall in love for a living. It really matters to Capili what Direk Joey says about her writing. She considers his films \"May Minamahal\" and \"Pare Ko\" among her inspirations in becoming a scriptwriter. \"I really want to make something like those films.\" She is also fortunate for having director Jun Lana as her teacher in Playwriting and Screenwriting back in college. \"You really need to have the right mentors for your motivation. Direk Jun told me that if I want to be a writer, I must be conscious with my grammar.\" Capili has long dreamed of writing her own book. \"When I was just starting, around the time when I wrote\" Kuwentong Jelly Beans,' some of my readers told me to compile my articles and they will buy it. That was about six or seven years ago so I inquired how to get published. I did not receive any reply through text message or email from the first publisher I approached until I forgot about it. \"On January 11, 2011, Capili was hospitalized after falling into a coma due to a ruptured aneurysm. After surviving her near-death experience, she became more driven to fulfill one of her dreams. She even wrote about it in one of her essays\" Alam Mo Ba \"Yung Aneurysm?\" for her second book. \"I learned that Anvil Publishing, Inc. is open for submissions from unpublished authors. However, applications for that year had just closed so I made sure to submit the following year. I just tried my luck. I was not expecting too much because I know Anvil is not the type which publishes my essays. Fortunately, they liked the ten articles I submitted and they asked for more samples,\" Capili recalled. \"Anvil asked for a sample. I gave them the whole compilation and they told me to divide them into two. What I did was to put everything about relationships and for boys in Book 1 and placed the rest for girls in Book 2. That's the way I categorized them.\" The result was a resounding success. \"All of those I have written in my books are based on real experiences. I neither invented nor imagined them. If they are not my experiences, they are experiences of my friends. Maybe that's why many people can relate to them because they really happen. The stories were not fabricated. Some came from my blog so they are personal,\" Capili shared on why her books became popular. \"In my previous job, I had a love column for a magazine. That time I was just 22. I don't know anything much about love. I took on the challenge because that was what my editor in chief assigned to me. That time I didn't really give advices. I just gave them options on what would happen depending on their decision. In a way, it's still up to them,\" Capili recounted. She had more mature readers when she moved to a maritime company. \"At Maritime Magsaysay they had a website for seafarers and their families. Some wives wrote to me and asked for advice. This helped me a lot.\" The book author considered Barbara Conklin, Sidney Sheldon, and Danielle Steele among her favorite writers in high school and Jennifer Weiner, Mitch Albom, and <mark>Paulo Coelho</mark> when she reached her twenties. \"I have a different set of favorite books depending on my age. When I was a teenager, I liked\" The Other Side of Midnight \"and\" Rage of Angels \"by Sidney Sheldon. When I was in my twenties, I enjoyed\" Tuesdays with Morrie, \"\"She's Come Undone,\" \"Stardust,\" and \"Good in Bed.\" Now in my thirties, I like \"Thirteenth Tale,\" \"Belong to Me,\" and \"Shopgirl,\" she revealed. Aside from writing to express, not to impress, and writing from the heart, Capili has this to share to starting writers, \"Don't give up. I was rejected many times when I was just starting out. It's not easy being a writer. It's not mechanical. You should read a lot. You need to be curious of what is happening around you. You can get a lot of stories from what you hear. You need to be observant.\" \"Urbana at Feliza' at 150 39 minutes ago Art events: Sikap Pinoy National Art Fair\" Strawberry Lane' rates high on pilot week Controversial hosts about 1 hour ago Piolo Pascual bares all about 1 hour ago"}, {"articleID": "2014011322_00096162_W", "names": {"Joel Johnson": ["Q16192777", "Q16730355", "Q55362478", "Q58490764", "Q6213614"]}, "date": "2014-01-13", "url": "http://www.forbes.com/sites/steveschaefer/2014/01/13/financial-planning-starts-with-the-truth-about-your-bottom-line/?ss=personalfinance", "content": "There are plenty of things to worry about when it comes to your finances: Are you saving enough? Is your debt dragging you down? Will you be able to afford retirement or sending a child to college? Those types of questions have their place, but they aren't a starting point. To <mark>Joel Johnson</mark>, a Connecticut-based financial planner, the starting point is an honest assessment of your financial standing. <mark>Johnson</mark>'s firm <mark>Johnson</mark> Brunetti manages more than $300 million in client assets, and he says the first thing he tries to do is get a handle on reality with three key questions: What are your goals? What are your job prospects for the next 5-10 years? How much debt do you have? \"Don't be afraid to look at the problems,\" he says, because when you're honest about those the solutions often present themselves. I started covering markets at Forbes in the summer of 2007. Right around then a pair of Bear Stearns hedge funds imploded in the first tremors of the financial crisis, but I swear the recession isn't my fault. Armed with only a basic knowledge of Wall Street at the start, after a few thousand stories I've got a pretty good handle on this business. My contributions to the Forbes brand don't end when I leave the office either: I'm also a two-time MVP of the Forbes .400 softball team. Tips, story ideas, criticism, questions? Follow me here (click under my picture), on Twitter Google +, subscribe on Facebook or e-mail me at sschaefer_at_forbesdotcom."}, {"articleID": "2013100108_00065987_W", "names": {"Christopher Mccormick": ["Q39031838", "Q5112839"]}, "date": "2013-10-01", "url": "http://highschoolsports.silive.com/news/article/-1792473454155855770/late-surge-propels-tottenville-past-new-dorp-in-boys-soccer-3-1/", "content": "Talk about making the most of an opportunity. Tottenville reserve Ethan Francis hadn't received playing time in three straight games entering Monday's PSAL encounter against host New Dorp, but when coach Ron Nathanson called his number during a desperate stretch against the Central Cougars, he delivered in a big way. Just five minutes after the Pirates tied the score, Francis tallied off a header on a rebound as Tottenville registered a 3-1 victory over New Dorp. The Pirates, who also received goals from <mark>Christopher McCormick</mark> and Adrian Cosovic, entered Monday's game tied for second in Staten Island's PSAL division with the Central Cougars and McKee/S. I. Tech. The victory helped Tottenville remain tied with MSIT (which defeated CSI/McCown Monday) for second with 5-1-2 records. New Dorp dropped to fourth with a 4-2-2 mark. Tottenville, meanwhile, has had its troubles finishing this season and including its first game against New Dorp back on Sept. 9, Nathanson's troops had gone 145 minutes without scoring a goal against the Central Cougars this season. \"We really hadn't got many breaks or calls the whole season and I just told the kids,\" we have to make our own breaks, \"said Nathanson, whose team trailed 1-0 when ND's Mark Shnadshteyn scored in the 36th minute on Monday.\" But I do believe we have a good team. We just have been having trouble finding the net. \"But the Pirates finally ended their scoring drought at the 65-minute mark when <mark>McCormick</mark> took a feed from Cosimo Guarnera along the left end line, spun and shot with his left foot in one motion to beat first-time starter Arturo Reyes (in place of Stefan Zima, who is resting a pulled calf muscle) with a shot into the upper right corner. And just five minutes later, senior Francis, who entered the game for the first time 15 minutes into the second half, took center stage.\" I just wanted some energy out there (when I put him in) and (Francis) gave it to us, \"said Nathanson, whose team had only three shots at halftime, but wound up outshooting ND 18-9.\" I obviously finally did something right, \"laughed the coach. With just 10 minutes left in the game, Tottenville's Oscar Macareno (two assists) entered the top of the box with a head of steam before unleashing a shot in close. Reyes (three saves) made a nice stop to preserve the tie and the ball caromed to the netminder's right, where Francis was closing in. Francis proceeded to get his head on the ball, deflecting it off Reyes' hands and into the right portion of the net to give the Pirates there first lead.\" I saw the ball come off the goalie's hands and I needed to go get it, \"who said even when he doesn't get much playing time, he always stays ready for when Nathanson does call his number.\" It was too high to lift my leg, so I got my head on it and then everything just went in slow motion. But I saw it go off the goalie's hands and in and it felt great. \"The Pirates, who received solid defensive work from Michael Catanzaro and Macareno in front of netminder Keith Pecoraro (four saves), capped their three-goal outburst in a six-minute span when Cosovic did a superb job heading home a shot off a Macareno free kick from midfield. New Dorp, which played superbly defensively behind Taofiki Adeyombo, Peter Zima and Thomas Ambrosino for a large portion of the game, opened the scoring late in the first half when Shnadshteyn took a nifty right-side cross from Donik Mollabeciri and scored from inside the box."}, {"articleID": "2017070905_00663518_W", "names": {"Kyle Larson": ["Q11751789", "Q21184548", "Q5308142"], "Kurt Busch": ["Q201820", "Q42507470"], "Jimmie Johnson": ["Q217238", "Q6199355"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"], "Erik Jones": ["Q16239574", "Q57422872"], "Daniel Suarez": ["Q1162833", "Q16302254"], "Paul Menard": ["Q16732470", "Q2879369"], "Ryan Newman": ["Q18989", "Q525980"], "Michael Mcdowell": ["Q1928579", "Q1928582"]}, "date": "2017-07-09", "url": "http://autoweek.com/article/monster-energy-nascar-cup/martin-truex-jr-survives-overtime-restart-win-monster-energy", "content": "Martin Truex Jr. had a lead that hovered between 10 and 15 seconds in the closing laps Saturday. Photo by LAT Photographic Martin Truex Jr. survives overtime restart to win Monster Energy NASCAR Cup race at Kentucky Stages dominating performance for third win this season July 9, 2017 Pinterest Email After all was said and done, the dominant car won the race--but not without extreme complications. With just over a lap to go in Saturday night's Quaker State 400 at Kentucky Speedway, Martin Truex Jr. held a lead of more than 15 seconds over second-place <mark>Kyle Larson</mark>, with only eight cars remaining on the lead lap. But before Truex could take the white flag signaling the final lap, the engine in <mark>Kurt Busch</mark>'s Ford expired, dumping oil on the 1.5-mile track. Under the caution, only Truex stayed out, with all other lead-lap cars coming to pit road for fresh tires. \"I thought we were dead,\" Truex said. \"I thought we were done.\" On old rubber and with a hard shove from <mark>Larson</mark>, who lined up behind him in the outside lane, Truex surged past Kyle Busch through the first two corners and held the lead until a wreck behind him at the end of the first overtime lap caused the ninth caution of the night and froze the field with Truex in the lead. The victory completed a perfect night for Truex, who won the first and second stages and then took the checkered flag. The win was Truex's third of the season, his first at Kentucky and the 10th of his career. Truex increased his series-leading playoff point total to 28, 12 more than that of second-place <mark>Jimmie Johnson</mark>. \"It's just...this is completely unbelievable,\" said Truex, who is tied with <mark>Johnson</mark> for the series lead in victories this season. \"I'm so excited to win here. It felt like we had a shot last year and it got away from us on fuel mileage, and (I) just wanted to win here so, so bad after that. This is sweet redemption.\" Before <mark>Kurt Busch</mark>'s engine blew, the green-flag run after the second stage had extended to 100 laps, and the final minutes of the race had only increased Truex's anxiety, despite his colossal lead. \"Worried every lap, waiting for a caution,\" Truex said. \"Especially at the end. You're counting them down--you know, 30, the last 30, the last 20, the last 10 and then you get inside of five, and you're like\" Oh my god, there's no way there's not going to be a caution, and sure enough there was. \"Fortunately (I was) able to hold them off. This thing was just so stout tonight. A good push from <mark>Larson</mark> (on the final restart) helped us a bunch.\" The win was the third of the 2017 season for Truex. Photo by LAT Photographic <mark>Larson</mark> started the race in 40th because his car failed to pass inspection before qualifying. In the first 80-lap stage, he charged forward to the third position but sped on pit road during caution between stages and restarted at the rear of the field on lap 88. Again he charged through the field, and when the cars lined up for the final restart in overtime, <mark>Larson</mark> took advantage of four new tires to grab second place. Even on new rubber, he had nothing for Truex, who led a race-high 152 laps. \"Yeah, I don't know what we could have done to beat him,\" said <mark>Larson</mark>, who retained a one-point lead over Truex in the championship standings. \"He was obviously pretty fast with the lead there. It would have been fun to get to race him, because I felt like I had the second-best car today; and it would have been interesting to get a restart with him earlier and get to hang with him that last run there.\" But we brought the Target Chevy home second after not being able to qualify and having to start last in the race and then having my speeding penalty there. I guess I was just a little too fast leaving my stall and got a penalty. So I've got to clean that stuff up. I'm mad at myself that I made that mistake. I don't really know if it affected the outcome, but you never know. \"Chase Elliott came home third, followed by <mark>Joe Gibbs</mark> Racing teammates Denny Hamlin and Kyle Busch. <mark>Erik Jones</mark>, Truex's Furniture Row Racing teammate, ran sixth, with Jamie McMurray, Joey Logano and Kevin Harvick finishing seventh through ninth, respectively, as the only remaining cars on the lead lap. For <mark>Johnson</mark>, the jinx continued at Kentucky, one of three active tracks at which the seven-time champion hasn't won (the others being Watkins Glen and Chicagoland). On lap 88, after the start of the second stage, Brad Keselowski's No. 2 Ford got loose on the entry to turn three and collected Clint Bowyer's No. 14 Ford. <mark>Johnson</mark> couldn't avoid the wreck in front of him.\" The car felt great, \"<mark>Johnson</mark> said.\" I feel like we were probably in the position for a good top five tonight, with all things considered. But, the No. 2 car (Keselowski) got into the corner and he was sideways before we got there. I feel like the car on the outside of him (Bowyer) left him some room. \"But then, talking to Brad inside (the infield care center), he said he was just sideways before he ever got to the corner. And I thought I almost had him missed. I really thought I had him missed, and I just clipped him with my right front. It broke something in the suspension and took me into the fence.\" Keselowski confirmed the diagnosis after both cars had retired from the race, Keselowski in 38th and <mark>Johnson</mark> in 39th. \"I just wrecked it,\" Keselowski said. \"It stinks. I got loose into (turn) three. I was underneath the 14 (Bowyer). I was trying to lay up and give room but just spun out as soon as I got anywhere near the corner.\" I wrecked myself and a bunch of other guys. It's part of it I guess, but not a part that you have to like. \"The win was the 10th of Martin Truex Jr.'s NASCAR Cup career. Photo by Getty Images for NASCAR Monster Energy NASCAR Cup Series Race Results Quaker State 400 Presented by Advance Auto PartsKentucky Speedway 1. (2) Martin Truex Jr., Toyota, 274. 2. (40) <mark>Kyle Larson</mark>, Chevrolet, 274. 3. (12) Chase Elliott, Chevrolet, 274. 4. (5) Denny Hamlin, Toyota, 274. 5. (1) Kyle Busch, Toyota, 274. 6. (14) <mark>Erik Jones</mark> #, Toyota, 274. 7. (4) Jamie McMurray, Chevrolet, 274. 8. (11) Joey Logano, Ford, 274. 9. (7) Kevin Harvick, Ford, 274. 10. (6) Ryan Blaney, Ford, 273. 11. (17) Darrell Wallace Jr. (i), Ford, 273. 12. (13) Dale Earnhardt Jr., Chevrolet, 273. 13. (16) Clint Bowyer, Ford, 273. 14. (18) Ricky Stenhouse Jr., Ford, 273. 15. (20) Danica Patrick, Ford, 273. 16. (22) Chris Buescher, Chevrolet, 273. 17. (3) Matt Kenseth, Toyota, 273. 18. (9) <mark>Daniel Suarez</mark> #, Toyota, 273. 19. (25) Austin Dillon, Chevrolet, 272. 20. (28) AJ Allmendinger, Chevrolet, 272. 21. (24) <mark>Paul Menard</mark>, Chevrolet, 272. 22. (29) <mark>Ryan Newman</mark>, Chevrolet, 272. 23. (21) <mark>Michael McDowell</mark>, Chevrolet, 271. 24. (26) David Ragan, Ford, 270. 25. (30) Matt DiBenedetto, Ford, 270. 26. (35) Landon Cassill, Ford, 268. 27. (31) * Ryan Sieg (i), Toyota, 266. 28. (33) Reed Sorenson, Chevrolet, 265. 29. (36) Jeffrey Earnhardt, Chevrolet, 265. 30. (15) <mark>Kurt Busch</mark>, Ford, Engine, 264. 31. (38) * Timmy Hill (i), Chevrolet, 261. 32. (37) * BJ McLeod (i), Chevrolet, 260. 33. (27) Ty Dillon #, Chevrolet, 253. 34. (32) Cole Whitt, Chevrolet, Engine, 212. 35. (39) * Gray Gaulding #, Toyota, 207. 36. (34) Joey Gase (i), Toyota, Accident, 129. 37. (19) Trevor Bayne, Ford, Accident, 101. 38. (23) Kasey Kahne, Chevrolet, Accident, 93. 39. (10) Brad Keselowski, Ford, Accident, 89. 40. (8) <mark>Jimmie Johnson</mark>, Chevrolet, Accident, 87. Average Speed of Race Winner: 138.604 mph. Time of Race: 2 Hrs, 57 Mins, 55 Secs. Margin of Victory: Caution. Caution Flags: 9 for 39 laps. Lead Changes: 9 among 4 drivers. Lap Leaders: Kyle Busch 1-28; M. Truex Jr. 29; Kyle Busch 30-67; M. Truex Jr. 68-87; Kyle Busch 88-133; M. Truex Jr. 134-163; J. Logano 164-170; M. Truex Jr. 171-225; D. Earnhardt Jr. 226-228; M. Truex Jr. 229-274. Leaders Summary (Driver, Times Lead, Laps Led): M. Truex Jr. 5 times for 152 laps; Kyle Busch 3 times for 112 laps; J. Logano 1 time for 7 laps; D. Earnhardt Jr. 1 time for 3 laps. Stage #1 Top Ten: 78,18,42,4,1,20,11,77,48,24 Stage #2 Top Ten: 78,18,20,4,77,1,41,11,14,24"}, {"articleID": "2013112706_00024184_W", "names": {"Randy Scott": ["Q28421781", "Q7292422", "Q7292423"]}, "date": "2013-11-26", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/6666163", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. Invitae Responds to Myriad Genetics Lawsuit Tuesday, November 26, 2013 5:05 PM Invitae Responds to Myriad Genetics Lawsuit Invitae Corporation, a genetic diagnostics company, today announced that it plans to defend its right to provide naturally occurring genetic information and services to physicians for their cancer patients through its genetic testing services. Invitae has been named a defendant in a lawsuit filed by Myriad Genetics, Inc. regarding Invitae's BRCA and MUTYH genetic tests. Invitae disagrees with the allegations of the lawsuit and plans to vigorously defend itself against the lawsuit, which it believes has no merit. Earlier this year, the Supreme Court ruled that naturally occurring DNA and the information it encodes cannot be patented (Assn 'n for Molecular Pathology v. Myriad Genetics, Inc., 133 S. Ct. 2107 [2013]) and thus ushered in a new era of personalized medicine. This followed on a prior Supreme Court ruling establishing that naturally occurring biological correlations were not patentable subject matter (Mayo Collaborative Servs. v. Prometheus Labs ., Inc., 132 S. Ct. 1289 [2011]). The breast cancer community will benefit from these decisions with the introduction of multiple new diagnostic tests to analyze BRCA1 and BRCA2 mutations, increasing the availability and options for patients and physicians. Invitae and its collaborators recently presented results at scientific conferences demonstrating the validity of next generation DNA sequencing technology to accurately identify pathogenic variants in a variety of cancer genes including BRCA1 and 2. Invitae's mission is to reinvent genetic testing by making it more affordable and accessible than ever before. The company's goal is to bring multi-use genetic testing into routine medical practice. Invitae offers full gene sequencing for both BRCA1 and BRCA2 with deletion and duplication analysis to physicians with the ability to upgrade to a larger hereditary cancer syndromes panel of 27 genes--all for just $1,500. \"The issue of DNA patents goes far beyond BRCA testing,\" said <mark>Randy Scott</mark>, co-founder of Invitae. \"Our company was founded around the core belief that every individual has the right to self-knowledge (meaning they have a right to know their own DNA sequence information), and we believe that the Supreme Court rulings validate our view that no company can claim ownership over naturally occurring genetic information.\" Dr. <mark>Scott</mark> continued, \"Today, clinically-observed genetic variants are often held in proprietary databases, restricting their access by the medical community. By broadening access and sharing genetic information, we can collectively harness the power of the genome to improve our understanding of disease and improve healthcare for everyone. Providing broad access to genetic testing will allow the medical community to collectively diagnose disease better, faster and cheaper; offer patients more effective healthcare and reduce costs to the healthcare system.\" Commitment to Sharing Genetic Information: Invitae Supports the Free the Data! Initiative The Free the Data! initiative is a grassroots patient and physician movement to build an open access database to enable the interpretation and diagnosis of clinical variants, including BRCA1 and BRCA2 mutations. The goal of Free the Data! is to fill the public information gap caused by the lack of available genetic information for the BRCA1 and BRCA2 genes with plans to expand to provide other types of genetic information in open, searchable databases, including the National Center for Biotechnology Information's database, ClinVar. Free the Data! invites individuals to share their genetic variation safely, securely and with appropriate privacy settings, in a public database. The medical and scientific community can then access this collective data to accelerate our understanding of genetic disease, find new therapies and eventually prevent disease. Please visit www.free-the-data.org or contact 202.966.5557 x201 for more information about Free the Data! Invitae is a founding member of the Free The Data! Coalition. Other coalition members include Genetic Alliance, UCSF, Facing Our Risk of Cancer Empowered (FORCE), a group of patient advocates, Partners Healthcare & ICCG, GeneDX, amongst others. About Invitae Corporation Specializing in genetic diagnostics for hereditary disorders, Invitae's mission is to make multi-use genetic testing more accessible and affordable than ever before. The company is pursuing a strategy over the next several years to aggregate all the world's medical genetic tests (> 3,000 known Mendelian conditions) into a single assay at a lower cost than most single gene tests today. This capability is increasingly enabled by the rapid advancements in DNA sequencing technology. Invitae hopes to lead the way from an era of genetic scarcity to genetic abundance to significantly improve healthcare worldwide. Huntsman Corporation (HUN): Needs A Perfect Trip To Hit Goldman'S $29 Salesforce.com, Inc. (CRM): Well-Positioned To Capitalize Emerging Mobile Opportunity Time Warner Cable Inc (TWC): Who Could Buy TWC--Charter Or Comcast? VIQ Solutions' Subsidiary Awarded Contract by Australian Capital Territory GNC Holdings, Inc.. Announces $500 million Share Repurchase Authorization, Term Loan increase and repricing Tesla Motors Inc (TSLA): How Tesla Fares Against Upcoming Electric Cars 3D Systems Corporation (DDD): A 3T Look At 3D - D? j? Vu All Over Again? Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein."}, {"articleID": "2020022416_00024386_W", "names": {"Taj Mahal": ["Q353023", "Q59627566"]}, "date": "2020-02-24", "url": "https://abc17news.com/news/politics/national-politics/2020/02/24/trumps-cherish-an-iconic-moment-touring-the-taj-mahal/", "content": "National Politics By CNN Published February 24, 2020 9:39 am It's the most popular tourist attraction in India, but for a few moments on Monday evening, all was still while the first couple of the United States took a romantic, sunset stroll outside the <mark>Taj Mahal</mark>. President Donald Trump, joined by first lady Melania Trump and at times a tour guide, spent more than an hour touring the grounds, including winding down on a path in front of the majestic white marble building and posing for countless pictures during the Indian golden hour. Despite naming his Atlantic City hotel after the iconic landmark, it was the President's first visit to the real <mark>Taj Mahal</mark>, a symbol of lasting love built in the 17th century by Mughal Emperor Shah Jahan to honor his third wife, Mumtaz <mark>Mahal</mark>, who died giving birth to the couple's fourteenth child. Today, it is among the busiest tourist sites in the world; in 2018, almost 6.5 million people visited the <mark>Taj Mahal</mark>, according to statistics from the Indian Ministry of Tourism. The tour came hours after the President arrived in India for a visit marked by pomp and circumstance, the quiet <mark>Taj Mahal</mark> standing in stark contrast to a \"Namaste Trump\" campaign-style rally earlier Monday afternoon in Ahmedabad, where Trump was greeted by more than 100,000 spectators. \"Do you want to do a press conference now?\" Trump joked to the traveling reporters. \"Have any questions about anything?\" He called the the <mark>Taj Mahal</mark> \"truly incredible\" before turning around to observe its majesty, holding hands with the first lady, who called it \"lovely, beautiful.\" \"One of you is going to get a Pulitzer for this,\" Trump said to photographers as he posed for a photo in front of the reflecting pool with a smiling Melania Trump. Like many of the stops along Trump's brief trip, officials took extreme care in preparations for his <mark>Taj Mahal</mark> visit. Fresh water was funneled into the adjacent Yamuna River to dilute its usual smell, according to local reports. Roads between the <mark>Taj Mahal</mark> and the nearby airport were cleared, pavements were leveled, footpaths \"beautified,\" walls painted a uniform color, and the roads sprinkled with water to ensure that dust didn't fly up when Trump's convoy drives past, said Rajiv Rathi, executive engineer at the environment department of Agra Municipal Corporation. \"We have also put in barricades for people to stand behind and flower pots for decoration,\" he said, adding that authorities are \"expecting around 30,000 people on the road to <mark>Taj Mahal</mark> when Trump arrives.\" Despite an initial local report of concerns regarding aggressive monkeys near the memorial, there were no apparent presidential primate interruptions during an overall peaceful trip. Trump also received a key to the city of Agra. \"This is a long standing tradition, whenever any dignitary comes to the city we give them a key to the city and he is the mayor of the city for the day, we will be giving a key to President Trump as well,\" Rathi said. The Trumps paused for several moments as they walked along the <mark>Taj Mahal</mark>'s reflecting pool and spent more than 15 minutes inside the marble mausoleum, according to reporters traveling with the President. Other presidents and first ladies have made a pilgrimage to the iconic structure; Jackie Kennedy held a solo photo opportunity at the <mark>Taj Mahal</mark>, President George H. W. Bush and his wife Barbara visited, and first lady Hillary Clinton visited with daughter Chelsea during a 12-day tour of South Asia. The Obamas cancelled a planned trip to the iconic landmark, cutting their Indian visit short after the death of Saudi Arabian King Abduhllah."}, {"articleID": "2017122421_00549652_W", "names": {"James Thompson": ["Q16324360", "Q19666426", "Q2031218", "Q21457741", "Q25413093", "Q2740371", "Q3806742", "Q41446776", "Q51587826", "Q54833499", "Q55863509", "Q55937953", "Q58323221", "Q58332042", "Q6133231", "Q6144184", "Q6144186", "Q6144196", "Q780129"], "Anthony Fisher": ["Q11686326", "Q18637364", "Q573256"]}, "date": "2017-12-24", "url": "http://msn.com/en-au/news/australia/parts-of-australia-set-to-sizzle-on-christmas-church-leaders-reflect-and-tweet/ar-BBHfDFu?li=AAgfIYZ", "content": "© AAP Image/Anglican Media Sydney The Anglican Archbishop of Sydney, Dr Glenn Davies. As people in some parts of Australia get ready to celebrate Christmas in sizzling heat, the nation's Church leaders have offered messages of hope, love and generosity, with one even condensing his spiritual remarks into a single tweet. People in Queensland are set to flock to the beach for Christmas, with temperatures tipped to soar above 40 degrees Celsius in some areas and severe thunderstorms expected to hit in the afternoon. \"It's looking warm really across the entire of Queensland,\" Bureau of Meteorology forecaster <mark>James Thompson</mark> said, saying Birdsville would likely hit 45C. A top of 34C is expected in Brisbane, compared to 32C on the Sunshine Coast and 31C on the Gold Coast. \"It looks like it'll probably be pretty close to the warmest day for December this year across the south-east,\" Mr <mark>Thompson</mark> said. Severe afternoon thunderstorms are likely south of the Gold Coast and down to the NSW border. On the other side of the country, Perth is expected to enjoy a sunny 32C, while other parts of Western Australia are predicted to have temperatures hovering in the low to mid-40s. Coastal areas in the state's southern half are expected to experience similar weather to Perth, such as Esperance and Bunbury, while Albany is likely to be a cooler 26C. In New South Wales, Christmas Day barbecues are expected to take place under grey skies after a cool change rolled across the state's east following scorching temperatures on Christmas Eve. Sydney's observatory hill reached 37.7 C just after 2:00 pm on Sunday but it was well shy of Penrith's 42.1 C. Penrith came close to breaking a record set just 10 days ago when it reached 43.5 C. A thunderstorm and cool change helped drop temperatures from mid-afternoon and Christmas Day is expected to reach a maximum of 23C in the city and 26C in the west. Cooler weather is also expected for Melbourne, where people will be able to break out the ugly holiday-themed jumpers. The city is predicted to hit a top of 22C, with a chance of drizzle and mild winds before the sun comes out in the afternoon. The cooler forecast is set to be repeated across the south of the state, with Gippsland towns likely to hit 21C in the east and Warrnambool set to hit the same temperature in the west. Religious leaders offer Christmas messages In a twist on the traditional Christmas message, Anglican Archbishop of Sydney Glenn Davies, for the first time, took to Twitter to send out his wish. \"In short--a baby born in a shed saves the world #canyoubelieveit,\" the tweet reads. The Archbishop remarked Twitter had become the preferred communication method for at least one world leader--a thinly veiled reference to US President Donald Trump. \"With a limit of 280 characters--it is difficult to say much, let alone explain anything complex,\" he said in a statement earlier this week. \"Who knows what might happen if the leader of another country takes something the wrong way?\" Australia's leading Catholic issued his Christmas message last week, calling 2017 an \"annus horribilis\" partly due to the same-sex marriage and euthanasia debates which have challenged the Christian conceptions of life and love. Catholic Archbishop of Sydney <mark>Anthony Fisher</mark> said the year's end united people in their need for hope. \"For people of faith you might say it's been an annus horribilis,\" he said. \"But the Christmas story insists there is a star in the dark sky, light amidst the fears and failures. Christmas speaks of new hope.\" In his Christmas message, Dr Philip Freier, the Anglican Primate of Australia and Archbishop of Melbourne, said there was \"widespread mistrust and dissatisfaction\" in Australia and more suffering than there should be. \"Yet, in the worst times and worst of situations, salvation is at hand through God's precious gift of his son, Jesus Christ,\" he said. Moderator of the Uniting Church in NSW and the ACT, Simon Hansford, recounted how embracing his new-born daughter changed him as a person, and urged his followed to similarly embrace the baby Jesus. \"When we engage with the child we are changed,\" he said in a statement. \"One of the highlights of Christmas is that the birth of the baby Jesus is God in all his vulnerability.\" He is here in our hands for holding. I wish you a blessed and peaceful Christmas. \"God creates the world We rebel God sends his Son Jesus into our world to be born in a stable + grow up to die on a cross but that's not the end He defeats death + is raised to life offering every1 freedom from death. In short--a baby born in a shed saves the world #canyoubelieveit--Archbp Glenn Davies (@ abpdavies) December 21, 2017"}, {"articleID": "2016072501_00616436_W", "names": {"Carlos Beltran": ["Q1042743", "Q5041829"], "Chad Green": ["Q24548598", "Q3427247"], "Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"]}, "date": "2016-07-25", "url": "http://wbtw.com/ap/ap-source-yanks-discussing-deal-to-send-chapman-to-cubs/", "content": "AP source: Yanks discussing deal to send Chapman to Cubs RONALD BLUM, The Associated Press Published: July 24, 2016, 9:28 pm Updated: July 24, 2016, 9:38 pm NEW YORK (AP)--Aroldis Chapman and the rest of the New York Yankees dressed in their Sunday best for a flight to Houston following a 5-2 win over the San Francisco Giants that completed a 6-4 homestand. Who returns in 10 days is unclear. New York was discussing a trade that would send Chapman to the Chicago Cubs as part of a swap that would bring 19-year-old shortstop prospect Gleyber Torres to the Yankees, a person familiar with the discussions told The Associated Press. The person spoke to the AP on condition of anonymity because talks were ongoing and New York owner Hal Steinbrenner had not made any final decision. Nathan Eovaldi (9-6) pitched shutout ball into the seventh inning, <mark>Carlos Beltran</mark> and Mark Teixeira hit early solo home runs of Jeff Samardzija (9-6) and <mark>Chad Green</mark> pitched 2 1/3 scoreless innings. \"We're very much in this,\" Brett Gardner said. \"There's no point in me sitting here campaigning for us to stay together.\" But the Yankees (50-48), who matched their season high of two games over .500, may have shown their management too little, too late to prevent a selloff of veterans ahead of the Aug. 1 deadline for trades without waivers. New York trails AL East-leading Baltimore by 7 1/2 games and is 4 1/2 games behind Toronto for the league's second wild card, with the Astros and Detroit also ahead. Chapman has 20 saves in 21 chances and his fastball, at up to 105.1 mph, has entertained fans focusing on the scoreboard velocity of every pitch. \"It's tough. I feel comfortable here. I feel like part of the family here,\" he said through an interpreter, adding that the Yankees have been talking to his agent. Chapman has formed the Yankees' No Runs DMC bullpen trio with Dellin Betances and <mark>Andrew Miller</mark>, which has 203 strikeouts in 123 2/3 innings. Chapman, pitcher Ivan Nova, <mark>Beltran</mark> and Teixeira are eligible for free agency at the end of the season; <mark>Miller</mark>, signed through 2018 at $9 million, also is of interest to contenders. \"We don't want to see him go,\" Teixeira said of Chapman. \"We're trying to win games, and he's a big part of that.\" Chapman maintained he could be dealt and still re-sign with the Yankees as a free agent during the offseason. \"Oh yeah, if there's a possibility, and God willing, yes,\" he said. Torres was scratched from the starting lineup of the Class A Myrtle Beach Pelicans on Sunday. <mark>Beltran</mark> hit his team-best 21st home run in the first and Teixeira doubled the lead on the second with his 200th home run for the Yankees, his sixth in 20 games since returning from the disabled list. Teixeira and Jacoby Ellsbury wore white Ken Griffey Jr.. Nike Swingman spikes with gold soles as a tribute to Junior's induction Sunday into baseball's Hall of Fame. New York chased Samardzija in the sixth, when Ellsbury grounded into a run-scoring double play, Starlin Castro singled in a run and Didi Gregorius hit an RBI double. Making his second start following a brief bullpen banishment, Eovaldi used a new cutter for the second time in the homestand. He escaped bases-loaded, one-out trouble in a 33-pitch fourth inning when Mac Williamson fouled out and Ramiro Pena grounded out. Eovaldi left after Angel Pagan's two-out double on his 118th pitch, two shy of his career high. With the No Runs DMC trio unavailable after two days of heavy use, Chasen Shreve came in and loaded the bases with a walk to Brandon Belt, and Buster Posey poked an opposite-field, two-run single to right against <mark>Green</mark>, who then retired Brandon Crawford on a groundout. After losing the first two games of the homestand to Boston, the Yankees won six of eight against the Red Sox, Orioles and Giants. \"We've told our players, and it includes me, you have to stay away from the noise, what you're hearing and rumors and things that might be going on,\" Yankees manager Joe Girardi said. <mark>Beltran</mark>, traded in midseason from Kansas City to Houston in 2004 and from the New York Mets to San Francisco in 2011, knows not to think too far ahead. \"I've been in this situation before,\" the 39-year-old said. \"For me it's day by day.\" WEB GEM New York turned a spectacular 4-1-5 inning-ending double play in the eighth. Pena grounded past a diving Teixeira at first but Castro slid on his stomach to come up with the ball on the outfield grass between first and second, and from his knees threw to <mark>Green</mark> covering first. The pitcher made a one-hop throw to third, where Chase Headley tagged a sliding Williamson. \"That's a play we work on a lot in spring training,\" <mark>Green</mark> said. UP NEXT Yankees: RHP Michael Pineda (4-9) starts Monday and LHP Dallas Keuchel (6-9), the AL Cy Young Award winner, goes for the Astros. Opponents are hitting .181 in Pineda's last five starts. Advertisement More Headlines Previous post in this category Texas League Sports Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Please log in using one of these methods to post your comment: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement Advertisement Advertisement Advertisement"}]