[{"articleID": "2011040719_00068545_W", "names": {"Luis Guzman": ["Q3266716", "Q347395", "Q5679615"]}, "date": "2011-04-07", "url": "http://orlandosentinel.com/entertainment/os-movie-review-arthur,0,7836053.story?track=rss", "content": "the remake of \"arthur\" goes wrong some time before the tipsy millionaire shows up in an alcoholics anonymous meeting. it's merely the latest amble into tone-deafness for a movie that, despite a lot of funny lines and a committed performance by the big screen's newest professional drunk, russell brand, fails. the original arthur (dudley moore) wouldn't have dreamed of twelve step meetings. the makers of that first film, which was a huge hit and won john gielgud an oscar, were just as politically incorrect in their day. but they knew, even while making a giggling drunken wastrel their hero in the early days of mothers against drunk driving, of celebrating a wealthy spendthrift in the reagan recession, how much of a buzz-kill the very idea of of aa interrupting arthur's bender would be. the new \"arthur\" has a winning cast - brand, helen mirren in the john gielgud role, jennifer garner as the rich girl arthur is ordered to marry and the charming greta gerwig in the poor little liza minnelli role. it's got some zingers recycled from the first movie and more than a few new one-liners that land. \"did you kill minnie mouse, or did she surrender that dress willingly?\" hobson (mirren) sneers at arthur's new infatuation (gerwig). brand is arthur bach, a rich brit brat whose wicked wicked ways have made him a fixture in the new york tabloids. we meet him as he and his chauffeur (<mark>luis guzman</mark>) run the batmobile - yes, he's bought it - under the wall street bull statue. arthur has more cars than jay leno, more toys that toys r us and has grown up so pampered and spoiled that he knows nothing of the real world. but one arrest too many - he extravagantly and generously bails everybody at the jail - forces a meeting with his frosty, distant mum (geraldine james). \"i remember from when i used to live in your womb!\" when mother stops going on about \"that charming coffee-colored gentleman who runs the country,\" she decrees that arthur must marry susan, her favorite ruthless go-getter executive. she's played with a venal verve by jennifer garner, and the fact you kind of root for her throws the whole story out of balance. then there's the hand-to-mouth tour guide arthur meets on his way home from the auction where he bought the suit lincoln wore to his second inaugural, a suit he promptly dons. he rescues naomi (gerwig) from arrest (she has no license) with a bit of fanciful invention. the cops want to see his id. arthur produces a penny. there isn't any chemistry between brand and gerwig, which may explain why she's not in the commercials or the poster. she's winsome and fetching, but the spark isn't there. meanwhile, the wedding plans continue apace, and we see just how far gone nick nolte's voice is - he's the two-fisted, menacing builder who is the father of the bride. arthur accidentally shoots him with his own nail gun and jokes about how nails in the hands \"made a hero out of jesus .\" oh no he didn't. the first 45 minutes of this have plenty of laughs as we navigate \"the vast moat of champagne called last night\" and enjoy mirren's way with a one-liner. brand's offhand delivery of a whispered \"help me\" to the diners in a restaurant where arthur is forced to propose and garner's drunken seduction scene - the one involving arthur's magnetic levitation bed that you see in the commercials - are a stitch. but i never bought mirren's nanny snobbery (gielgud sold it, and how), arthur's foray into the world of working people (a job at dylan's, new york's most famous candy store) and i don't want to know why arthur drinks. not for a comedy. overlong, overcast and a lot more politically correct than it lets on, this \"arthur\" is on the rocks long before last call .: pg-13 for alcohol use throughout, sexual content, language and some drug references. cast:. russell brand, jennifer garner, helen mirren, nick nolte, greta gerwig, <mark>luis guzman</mark> comments are moderated. by posting a comment, you affirm that you are 13 years of age or older and you agree to our copyright and"}, {"articleID": "2012041816_00092698_W", "names": {"Mark Sullivan": ["Q16885951", "Q17010973", "Q48852063", "Q53935183", "Q6769901"], "Susan Collins": ["Q22279", "Q7647692"], "Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"]}, "date": "2012-04-18", "url": "http://clickorlando.com/news/U-S-Special-Forces-members-involved-in-prostitution-scandal-sources-say/-/1637132/10960730/-/84pqlq/-/index.html", "content": "u.s. special forces members involved in prostitution scandal, sources say colombian officials hoped to showcase city of catagena published on: apr 18 2012 03:03:32 am edt washington (cnn) - five u.s. army special forces service members are among those under investigation in a prostitution scandal in colombia, according to two u.s. officials, as the scandal continues to swell in both countries. eleven secret service members have been implicated in the investigation, while as many as 10 u.s. military personnel from all branches of the armed forces are being questioned about potential involvement in any misconduct. moyer becomes oldest winning pitcher at...middleton's friend apologizes for gun...interior minister nausicrate perez said officials are waiting to get more information on the allegations that secret service agents brought prostitutes back to their hotel in colombia ahead of u.s. president barack obama's visit to the summit over the weekend. the americans were in cartagena to prepare for obama's visit, and the u.s. president has said he expects a \"rigorous\" investigation. the investigation is being led by secret service director <mark>mark sullivan</mark>, who has been briefing members of congress. homeland security secretary janet napolitano lauded the director for taking \"immediate and decisive action,\" which reflects the \"professionalism, honor, and integrity\" of the service. \"the u.s. secret service has a history of executing its mission with professionalism, honor and integrity and director <mark>sullivan</mark>'s six-year stewardship of the agency has been marked by these traits,\" napolitano said in a statement tuesday. \"in the aftermath of allegations of personnel misconduct in colombia, director <mark>sullivan</mark> took immediate and decisive action to remove the agents involved, investigate what transpired and ensure the secret service continued performing their vital protection mission .\" a leading senator said tuesday that she had been told as many as 21 women had been involved and questioned whether the incident could have endangered the president. \"who were these women? could they have been members of groups hostile to the united states? could they have planted bugs, disabled weapons or in any other (ways) jeopardized security of the president or our country?\" asked maine's <mark>susan collins</mark>, the ranking republican on the senate homeland security and governmental affairs committee. that account was disputed by u.s. secret service spokesman ed donovan, who said the exact number of women was still under investigation. \"sen. <mark>susan collins</mark>, in a conversation with the secret service, was told that 21 u.s. personnel are involved in the investigation, and she evidently misconstrued that to mean that 21 prostitutes were involved,\" a source familiar with the investigation said. <mark>collins</mark>' office disagreed with that account, saying, \"there was no misunderstanding .\" \"the whole behavior is so incredibly dangerous and risky particularly for those who are charged with the solemn obligation of protecting the president of our country,\" <mark>collins</mark> told cnn. later, kevin kelley, a spokesman for <mark>collins</mark>, said the number is not the issue. \"it's outrageous that the department is arguing about the number when, clearly, this incident never should have happened in the first place,\" kelley said. the secret service agents and officers involved range in experience from relative newcomers to nearly 20-year veterans, and all have been interviewed at least once, two government officials with knowledge of the investigation said monday. their security clearances have been pulled while the investigation is under way and could be reinstated if they are cleared, the officials said. the agents were offered an opportunity to take a polygraph test, according to a u.s. official. some of the agents and military personnel maintain that they didn't know the women were prostitutes, the official said. \"even if they weren't (prostitutes), it was totally wrong to take a foreign national back to a hotel when the president is about to arrive,\" rep. <mark>peter king</mark>, r-new york, the chairman of the house homeland security committee, said on cnn's \"piers morgan tonight .\" house oversight committee chairman rep. darrell issa, r-california, said the agents should take the polygraph tests. \"for these individuals, if they want to have any career at all, they have to decide on telling the entire truth and seeing whether they have something going forward .\" issa said his level of confidence in <mark>sullivan</mark> is \"high .\" while soliciting prostitution is legal in certain areas of colombia, it is considered a breach of the agency's conduct code, the government sources said. military law also bars service members from patronizing prostitutes, displaying conduct unbecoming an officer or, for enlisted personnel, conduct \"prejudicial to good order and discipline .\" comments the views expressed are not those of clickorlando.com, wkmg or its affiliated companies. this is a community moderated forum (please note the \"flag' button). by posting your comments you agree to accept our terms of service"}, {"articleID": "2014022208_00056902_W", "names": {"Thiago Silva": ["Q210453", "Q59245327", "Q604996", "Q7783822"], "Glenn Robinson": ["Q16150182", "Q18151664", "Q5569076", "Q926311"]}, "date": "2014-02-22", "url": "http://www.nbcmiami.com/news/local/Mixed-Martial-Arts-Fighter-Thiago-Silva-to-Remain-in-Broward-Jail-as-Bond-Hearing-Is-Delayed-246618911.html", "content": "Mixed Martial Arts Fighter <mark>Thiago Silva</mark> to Remain in Broward Jail as Bond Hearing Is Delayed <mark>Thiago Silva</mark> lost a round in court Friday. \"Nobody's deliberately doing it, but he's definitely falling through the cracks,\" said attorney Scott Saul in a Broward County courtroom, speaking at what was supposed to be a bond hearing for <mark>Silva</mark>, 31. The mixed martial arts fighter sat in his jailhouse scrubs, watching his lawyer do the fighting. Saul argued that <mark>Silva</mark> should be out on bond, since he is no longer being charged with a non-bondable crime. \"And here we are two weeks later, my client is sitting in jail, not on the felonies, on bondable offenses, and he has no bond,\" Saul told the judge. Broward Sheriff's Office deputies arrested <mark>Silva</mark> on Feb. 6, saying he pulled a gun on his estranged wife in the parking lot of a gym, put the gun in her mouth, threatened to kill her, and then locked himself into a townhouse until SWAT team deputies talked him into surrendering peacefully. He was booked into the Broward County Main Jail, and there he stays. On Friday the state moved his case to the domestic violence court, delaying a bond hearing by about a week. \"We're gonna get him out of prison, this is (expletive), honestly, the state has known for a week this hearing was scheduled for today and did nothing,\" said <mark>Silva</mark>'s manager, <mark>Glenn Robinson</mark>. More than a dozen friends showed up in the courtroom to be in <mark>Silva</mark>'s corner. \"He has a tremendous amount of support, he's a very beloved person,\" Saul said. <mark>Silva</mark>'s lawyer says this case is an aberration, and that <mark>Silva</mark> has no criminal record. His manager doesn't believe the charges. \"It's not true, and the truth will come out,\" <mark>Robinson</mark> said. This much is definitely true: the criminal case has knocked out <mark>Silva</mark>'s career. The UFC fired him, and assuming he eventually bonds out of jail, he still faces a trial, and prison time if convicted. Get Our New iPad App Now optimized for iPad, NBC 6 ..."}, {"articleID": "2018120302_00167437_W", "names": {"G. Smith": ["Q51589268", "Q5593252"]}, "date": "2018-12-02", "url": "http://www.businesswire.com/portal/site/home/template.PAGE/welcome/?javax.portlet.tpst=9ee47ea3678ece48256bb762f04eca4a&javax.portlet.prp_9ee47ea3678ece48256bb762f04eca4a_viewID=MY_PORTAL_VIEW&javax.portlet.prp_9ee47ea3678ece48256bb762f04eca4a_ndmHsc=v2*A1541156400000*B1543803566976*DgroupByDate*G5*N1010492&javax.portlet.begCacheTok=com.vignette.cachetoken&javax.portlet.endCacheTok=com.vignette.cachetoken", "content": "11/30/2018 - 10:50 PM NEW ORLEANS--()--ClaimsFiler, a FREE shareholder information service, reminds investors that they have until December 26, 2018 to file lead plaintiff applications in a securities class...\"BUSINESS WIRE more 11/30/2018 - 10:50 PM NEW ORLEANS--()--Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\" ), announces that KSF has commenced an...\"BUSINESS WIRE more 11/30/2018 - 10:50 PM NEW ORLEANS--()--Former Attorney General of Louisiana, Charles C. Foti, Jr., Esq., a partner at the law firm of Kahn Swick & Foti, LLC (\"KSF\" ), announces that KSF has commenced an...\"BUSINESS WIRE more 11/30/2018 - 09:09 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces the Filing of a Securities Class Action on Behalf of PPDAI Group Inc.. Investors (PPDF)\" BUSINESS WIRE more 11/30/2018 - 08:16 PM BOSTON--()--\"Uma visão comum para a economia digital árabe\" é um plano ousado conduzido pelo Council of Arab Economic Unity (CAEU) na Liga dos Estados Árabes para impulsionar a estabil...\"BUSINESS WIRE more 11/30/2018 - 08:15 PM BOSTON--()--\"Una visión común para la economía digital árabe\" es el plan audaz impulsado por el Consejo de la Unidad Económica Árabe (Council of Arab Economic Unity, CAEU) en la Liga d.. . \"BUSINESS WIRE more 11/30/2018 - 08:07 PM BENSALEM, Pa.--()--Deadline Alert: The Law Offices of Howard <mark>G. Smith</mark> Reminds Investors of Looming Deadline in the Class Action Lawsuit Against GreenSky, Inc. .\" BUSINESS WIRE more 11/30/2018 - 08:00 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces Investigation on Behalf of Marriott International, Inc.. Investors (MAR) \"BUSINESS WIRE more 11/30/2018 - 07:30 PM LOS ANGELES--()--Glancy Prongay & Murray LLP Announces the Filing of a Securities Class Action on Behalf of McKesson Corporation Investors (MCK)\" BUSINESS WIRE more 11/30/2018 - 07:23 PM WASHINGTON--()--CDC Once Again Completely Ignores Safer Sex Promotion in World AIDS Day Message, Says AHF \"BUSINESS WIRE more 11/30/2018 - 07:05 PM NEW YORK--()--Rosen Law Firm, a global investor rights law firm, announces the filing of a class action lawsuit on behalf of purchasers of the securities of The Boeing Company (NYSE: BA...\"BUSINESS WIRE more 11/30/2018 - 07:00 PM SASKATOON, Saskatchewan--()--Gensource Potash Corporation (\"Gensource\" or the \"Company\" ) (TSX. V: GSP) is pleased to announce a proposed best efforts non-brokered private placement for...\"BUSINESS WIRE more 11/30/2018 - 06:56 PM NEW YORK--()--Rosen Law Firm, a global investor rights law firm, announces the filing of a securities class action lawsuit on behalf of purchasers of the securities of Synchrony Financ...\"BUSINESS WIRE more 11/30/2018 - 06:42 PM SAN FRANCISCO--()--Vaquero Capital received the Technology Investment Bank of the Year Award from the Global M & A Network at the 10th Annual Americas M & A Atlas Awards held in Ne...\"BUSINESS WIRE more 11/30/2018 - 06:38 PM WASHINGTON--()--PSB, un servizio di consulenza globale basato sulla ricerca, ha annunciato oggi che Char Popp è entrata a far parte della società con l'incarico di vicepresidente senio...\"BUSINESS WIRE more"}, {"articleID": "2017053106_00652169_W", "names": {"Stephen Brady": ["Q1831756", "Q7608762"]}, "date": "2017-05-31", "url": "http://lithgowmercury.com.au/story/4700368/breaking-government-jobs-to-stay-in-lithgow/?cs=1464", "content": "The Office of State Revenue said it has listened to feedback from the community and staff members. After a scare earlier this week the 25 jobs are set to stay at the State Office Block on Railway Parade in Lithgow. Lithgow can breathe a little easier after the Office of State Revenue back flipped on its decision to transfer 25 jobs from Lithgow to Gosford. Office of State Revenue deputy secretary <mark>Stephen Brady</mark> said the organisation had listened to feedback from the community and staff members. \"Following consideration of this feedback, we have decided not to move the Collection Centre positions in Lithgow and Maitland to the new Gosford office through natural attrition. These positions will remain in their current locations,\" Mr <mark>Brady</mark> said. \"We continue to be committed to supporting our staff .\" Councillor Cassandra Coleman had earlier revealed the plans to move the jobs away from Lithgow at Monday night's council meeting. \"This is a great concern for our community. It's 25 times $67,000 worth of wages that we need to consider as a great urgency,\" she said. A total of $1.68 million that would have been funneled out of the Lithgow economy but is now here to stay for the foreseeable future."}, {"articleID": "2012090412_00046641_W", "names": {"Peter Spencer": ["Q7177044", "Q7177045", "Q7177047", "Q7177048"]}, "date": "2012-09-04", "url": "http://inverurieherald.co.uk/news/scottish-headlines/cfs-patients-neglected-by-nhs-1-2505262", "content": "patients with chronic fatigue syndrome (cfs) are still suffering from neglect within the nhs despite initiatives aimed at improving services for those with the condition, according to a new report. a survey of services for the estimated 250,000 people in the uk with me - myalgic encephalomyelitis - or cfs - has shown more than a quarter of primary care trusts (pcts) do not commission specialist secondary care for people with the condition. less than a quarter of the trusts said they provided home visits for me patients who are too disabled to travel. the statistics were compiled by the charity action for me using freedom of information requests to 151 pcts in england, 14 health boards in scotland, seven health boards in wales and five local commissioning groups in northern ireland. the findings were compiled from responses or part responses received from 143 pcts, 11 scottish health boards, six welsh health boards and three health and social care boards in northern ireland, the charity said. it added that it had reported six pcts and one scottish health board to the information commissioner over their failure to respond at all to the questionnaire. only 37 pcts, along with one scottish, one welsh and one northern irish board, said they provided home visits for people with the condition. the charity described the situation in england as \"profoundly depressing\" given a series of initiatives and repeated assurances from ministers in successive governments that the needs of me patients would be addressed by local care commissioners. in scotland and wales statements of good intent have been made by each of the governments but so far there has been no evidence of implementing any significant initiative to provide \"appropriate\" secondary care for patients, the report said. the study added that progress in northern ireland \"lags well behind\" and the nhs has not yet \"even grasped the scale or the seriousness\" of the impact of me on patients and their families. action for me chief executive, sir <mark>peter spencer</mark>, said: \"these figures are a disgraceful indictment of institutionalised discrimination and neglect. health services in all of the four home nations are still not even beginning to address the needs of this vulnerable patient group properly. rhetoric and prevarication from ministers is simply not good enough. we need action now to put this right once and for all .\" temperature: 9 c to 17 c wind speed: 24 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. inverurie herald provides news, events and sport features from the inverurie area. for the best up to date information relating to inverurie and the surrounding areas visit us at inverurie herald regularly or bookmark this page. can i opt out of receiving cookies? cookies are small data files which are sent to your browser (internet explorer, firefox, chrome etc) from a website you visit. they are stored on your electronic device. this is a type of cookie which is collected by adobe flash media player (it is also called a local shared object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. however, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. the types of cookies we, our ad network and technology partners use are listed below: a tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. to opt out of this type of targeting you can visit the \"your online choices' website by clicking here. google ads? our sites contain advertising from google; these use cookies to ensure you get adverts relevant to you. you can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" your online choices' website by clicking here. webtrends / google analytics? this is used to help us identify unique visitors to our websites. this data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. dart for publishers? this comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. this information is not used by us for any other type of audience recording or monitoring. comscore? comscore monitor and externally verify our site traffic data for use within the advertising industry. any data collected is anonymous statistical data and cannot be traced back to an individual. local targeting? our classified websites (photos, motors, jobs and property today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. these cookies store no personally identifiable information. grapeshot? we use grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. grapeshot stores the categories of story you have been exposed to. their privacy policy and opt out option can be accessed here. subscriptions online? our partner for newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. add this? add this provides the social networking widget found in many of our pages. this widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. temperature: 9 c to 17 c wind speed: 14 mph temperature: 11 c to 17 c wind speed: 18 mph temperature: 11 c to 18 c wind speed: 12 mph temperature: 12 c to 19 c wind speed: 16 mph"}, {"articleID": "2011062415_00108664_W", "names": {"Brian Murphy": ["Q1231556", "Q16733026", "Q2924968", "Q41758821", "Q4964834", "Q4964836", "Q4964839", "Q4964840", "Q4964843", "Q4964845", "Q4964848", "Q617288"]}, "date": "2011-06-24", "url": "http://newschannel10.com/story/14970802/hard-line-sunni-voice-gains-audience-in-bahrain", "content": "with afghan withdrawal, us focus turns to pakistan small checks drive michele bachmann's big bucks stranded penguin moved to nz zoo, set for surgery slow river rise nears a roar in north dakota city house weighs cutting off funds for libya mission gangster caught in calif. expected back in mass. cavaliers take irving with no. 1 pick in nba draft osama wanted new name for al-qaida to repair image boehner: debt increase can't pass with tax hikes us and others plan biggest release of reserve oil us and other nations will free 60 million barrels of oil, largest strategic release ever in minot, focus on protecting critical services north dakota authorities recommend more evacuations as river in minot moves higher illegal immigrant youth \"come out' in reform push illegal immigrant youth\" come out' in risky bid to ease rules for those brought to us as kids ny pharmacy shooting suspect pleads not guilty ex-soldier pleads not guilty in shooting deaths at ny pharmacy during robbery for painkillers mullen sees risk in obama's afghanistan withdrawal nancy pelosi remarks on obama's afghanistan withdrawal nancy pelosi remarks on obama's afghanistan withdrawal bulger described as robin hood, diabolical killer feared and revered in boston, bulger described as \"diabolical' mob boss who enjoyed killing accused seattle attackers wanted media attention court docs: 2 accused of plotting recruiting station attack wanted to attract media coverage va. man charged in 2010 dc-area military shootings man arrested in pentagon scare charged with shooting at dc-area military buildings in 2010 by <mark>brian murphy</mark> associated press dubai, united arab emirates (ap) - a visit by bahrain's king to sunni supporters this week was also something of a royal blessing for a rising political star: an islamic scholar who claims the gulf kingdom is under threat from both foe iran and ally america. once consigned to the fringes, sunni hard-liners like abdullatif al-mahmood are suddenly gaining a receptive audience amid a government crackdown on pro-democracy protesters. it's another sign of bahrain's deeply polarized atmosphere as the kingdom's sunni rulers try to open talks with the shiite opposition after violence that has left 31 people dead since february. al-mahmood's group appears to be tapping into deep-rooted fears over shiite giant iran and growing questions about commitment from washington, which bases the u.s. navy's 5th fleet in bahrain .\" we won't compromise on the safety of our nation, \"al-mahmood said during the tuesday visit by king hamad bin isa al khalifa. it was a clear slap at iran, who bahrain's leaders and gulf arab allies accuse of stirring the shiite-led demonstrations in bahrain. he also rejected calls by some u.s. officials to cut bahrain's special trade status following the clampdown on dissent .\" crises don't scare us, \"said the king as al-mahmood stood nearby. bahrain's shiites account for about 70 percent of the island, but they have few allies in high places. they claim the sunni ruling system is built to block shiites from any key positions in government or security forces. the sunni monarchy's western backers, led by the u.s., have denounced the unrest and harsh crackdowns. on wednesday, eight shiite activists were sentenced to life in prison for their roles in the unrest and next week more than 30 doctors and nurses accused of supporting the protests are due to go on trial. but washington and others still have not followed up with any tangible punishments against bahrain's rulers. at the same time, bahrain has pushed a narrative that splits the nation into patriots or traitors .\" loyalty \"books and website have been set up to publicly support the monarchy, and anyone challenging the system is branded a potential enemy of the state by official media. this is where al-mahmood and other sunni hard-liners have found a new voice in bahrain's political affairs. al-mahmood's ultra-nationalist sunni bloc failed to win parliament seats in elections last year. now the bahrain university lecturer is drawing new attention as he accuses iran and lebanese-based hezbollah of meddling in bahrain .\" this is a well-known fact that iran has a project to expand its influence all over the region and dominate the arab world, \"he told the associated press .\" this is their ideology. \"washington would have few objections to that point of view. but al-mahmood also comes down hard against the u.s., saying that american criticism of bahrain has\" made us suspicious that they also have a hand in the recent crisis. \"in an interview in april with an islamic-oriented malaysian website, al-akham. net, al-mahmood portrayed many shiites as fundamentally unable to support a sunni-ruled state .\" how can you trust them when they put up pictures of (iranian revolution founder ruhollah) khomeini...how can the state trust them? \"he was quoted as saying. he went further, however, to claim that the u.s. is somehow supporting iran to create a\" vast shiite state \"in the gulf and iraq .\" the truth is there is no hostility between iran and the u.s., \"he told the website .\" there are mutual interests and roles between the two. \"such claims are light-years outside the standard policy views. they do, however, shed some light on the extreme outlooks among some of those who have gained favor with bahrain's rulers since the uprising began. in april, bahrain's prime minister praised al-mahmood's national unity gathering group as a symbol of\" everything pertaining to the nation's interest and future. \"opposition groups consider the organization a haven for hard-liners. a message on a pro-reform website called al-mahmood the\" latest weapon against the pro-democracy movement. \"officials appear to sense the shiite unhappiness with al-mahmood's comments. the prime minister - who praised al-mahmood's group two months ago - requested it cancel a march last week. on friday, bahrain's most senior shiite cleric, sheik isa qassim, cast doubt on the chances for talks with the government and sunni groups - including the national unity gathering - that are scheduled to begin july 1 .\" this is no environment for a political solution when people are suffering, \"he told worshippers .\" we cannot see a meaningful and truthful dialogue. \"al-mahmood declined to say whether his group would support opposition demands to weaken the sunni leaders' hold on power .\" everything will be addressed at the discussion table, \"he said. (this version corrects corrects spelling of abdullatif in 2nd paragraph) with afghan withdrawal, us focus turns to pakistan stranded penguin moved to nz zoo, set for surgery get inspired. click here to listen to kurt talk. connect with local businesses. click here. click here to view\" the early show \"section. find the enhanced content and links. issues facing the 2011 texas legislature the latest wildfire information, updates, and video find out what and when programs come on newschannel 10."}, {"articleID": "2018112104_00367417_W", "names": {"Karen Walker": ["Q6370114", "Q6370115"], "Eric Mccormack": ["Q15653760", "Q436686"], "Sean Hayes": ["Q223033", "Q7441065"], "Ben Reed": ["Q50093923", "Q9653992"]}, "date": "2018-11-21", "url": "http://willandgrace.wikia.com/wiki/Will_Works_Out?diff=15150&oldid=13602", "content": "Revision as of 11:39, August 9, 2018 (view source) NeverInNeverland (wall | contribs) ← Older edit Latest revision as of 04:08, November 21, 2018 (view source) Eddvaldez (wall | contribs) (→ Cultural references) (2 intermediate revisions by one user not shown) Line 1: Line 1: {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} {{Episode_Infobox | title1 = Will Works Out | episode = 1.19 | written_by = [[Michael Patrick King]] & [[Tracy Poust]] & [[Jon Kinnally]] | directed_by = [[James Burrows]] | original_network = NBC | original_airdate = April 22, 1999 | previous = [[Grace, Replaced]] | next = [[Saving Grace]] | image1 = Vlcsnap-2017-04-11-10h19m47s210. png}} \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. \"\"Will Works Out\" ' is the 19th episode of the [[Season 1 | first season]]. + + [[Jack]] overhears [[Will]] describe him as a \"[https: //en.wikipedia.org/wiki/Faggot_ (slang) fag]\". [[<mark>Karen</mark>]] and [[Grace]] spend a girls night for the first time. = = Synopsis = = = = Synopsis = = − [[Will]] invites [[Jack]] to his gym on a \"buddy pass,\" but when he expresses his embarrassment to [[Grace]] over his buddy's gay behavior, Jack overhears the comments and looks to set him straight about prejudice. Meanwhile, Grace continues to lend her ear when <mark>Karen</mark>'s marriage hits rocky ground and she and [[<mark>Karen</mark>]] share an evening of girl talk. = = Cast = = = = Cast = = Line 18: Line 19: = = Notes = = = = Notes = = − * \"[[Alley Cats]]\" was originally scheduled to be shown, but was swapped at the last minute with \"Will Works Out .\" + * The episode [[Alley Cats]] was originally scheduled to be shown, but was swapped at the last minute with this episode. − * The slur Will uses to describe Jack has a polarizing effect, although the same word is reused numerous times throughout the rest of the series. + * In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode [[Lows in the Mid-Eighties]] that Will actually came out in 1985 during his freshman year in college. + * At the start of their girls night, Grace mentions that she has a copy of the 1998 film [https: //en.wikipedia.org/wiki/Hope_Floats Hope Floats] which stars [[Harry Connick, Jr.]] Connick eventually appears as Grace's future husband [[Leo Markus | Leo]]. + + = = Cultural references = = + * Will and Grace are \"shocked\" to see an episode of [https: //en.wikipedia.org/wiki/Intimate_Portrait Intimate Portrait] featuring former teen actress [https: //en.wikipedia.org/wiki/Molly_Ringwald Molly Ringwald]. + * At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. + * The Mikado + * When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" + * While making a point to Will, Jack mentions the sayings \"a rolling\" stone \"gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". + * In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay [https: //en.wikipedia.org/wiki/Popeye Popeye]. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". + * Princess of Tides after the 1991 film [https: //en.wikipedia.org/wiki/The_Prince_of_Tides The Prince of Tides]. + * While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to [https: //en.wikipedia.org/wiki/Cinderella_ (2015_Disney_film) Cinderella's] fairy godmother who says something similar thing when she magically fixes Cinderella's dress. + * Sufferin' sappho = = Quotes = = = = Quotes = = − {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something other than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} + {{Multi-line Quote | Character 1 = Jack | Line 1 = I got busted at the gym. | Character 2 = Will | Line 2 = For what? Feeling something <i> other </ i> than the burn? | Character 3 = | Line 3 = | Character 4 = | Line 4 = | Episode =}} {{Single-line Quote | Quote = I have to work out. I come from a very fat family. We store more fat than otters. | Character = Jack}} {{Single-line Quote | Quote = Let's work out during the day, buddy. Unemployed guys are so much hotter. | Character = Jack}} {{Multi-line Quote | Character 1 = Will | Line 1 = This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! | Character 2 = Jack | Line 2 = There were women at my old gym. | Character 3 = Will | Line 3 = Not on their birth certificate .}} {{Single-line Quote | Quote = Somebody's sports bra's a little snug. | Character = Jack}} {{Multi-line Quote | Character 1 = Jack | Line 1 = Shielding a desirable carcass from a much hotter vulture. | Character 2 = Will | Line 2 = See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture. | Context = discussing the jock block}} {{Single-line Quote | Quote = It can't be National Butch Day, 'cause the banks are still open. | Character = Will}} {{Single-line Quote | Quote = I'd rather be a fag than afraid. | Character = Jack}} {{Single-line Quote | Quote = Sometimes the things we don't like in others are the things we really don't like in ourselves. | Character = Grace}} {{Multi-line Quote | Character 1 = <mark>Karen</mark> | Line 1 = My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. | Character 2 = Grace | Line 2 = Great. I'll go put them in water .}} [[Category: Episodes]] − [[Category: Episodes]] [[Category: Season 1]] [[Category: Season 1]] Latest revision as of 04:08, November 21, 2018 Will Works Out Episode 1.19 Written by Michael Patrick King & Tracy Poust & Jon Kinnally Directed by James Burrows Will Works Out is the 19th episode of the first season. Jack overhears Will describe him as a \"fag\". <mark>Karen</mark> and Grace spend a girls night for the first time. Contents [show] Synopsis Edit Cast Edit Main Edit <mark>Eric McCormack</mark> (Will Truman) Debra Messing (Grace Adler) <mark>Sean Hayes</mark> (Jack McFarland) Megan Mullally (<mark>Karen Walker</mark>) Guest Edit <mark>Ben Reed</mark> (Richard Keller) Vanessa Giorgio (Woman) Notes Edit The episode Alley Cats was originally scheduled to be shown, but was swapped at the last minute with this episode. In this episode, Will implies that he came out in 1982. Jack also mentions that he first had a gay experience \"at sleep-away camp\" in 1978. However, it is shown in the flashback in the episode Lows in the Mid-Eighties that Will actually came out in 1985 during his freshman year in college. At the start of their girls night, Grace mentions that she has a copy of the 1998 film Hope Floats which stars Harry Connick, Jr.. Connick eventually appears as Grace's future husband Leo. Cultural references Edit Will and Grace are \"shocked\" to see an episode of Intimate Portrait featuring former teen actress Molly Ringwald. At the gym, Will refers to Jack as \"swish-burger\" , a play on Swiss burger and the term \"swish\" , a slang for an effeminate man. The Mikado When Will first hears of the jock block, he claims he does not speak \"pidgin homo\" While making a point to Will, Jack mentions the sayings \"a rolling stone gathers no moss\" and \"you can lead a horse to water but you can't make him drink\" , but replaced \"stone\" and \"horse\" with \"fag\". In affirming his pride in who he is, Jack says, \"I am what I am\" and Will rhetorically asks if that makes him the gay Popeye. This is a reference to Popeye's catchphrase (and song) \"I yam what I yam, and that's all what I yam\". Princess of Tides after the 1991 film The Prince of Tides. While trying to explain how they switched clothes, <mark>Karen</mark> says \"bibbity-bobbity-boob\" , a reference to Cinderella's fairy godmother who says something similar thing when she magically fixes Cinderella's dress. Sufferin' sappho Quotes Edit Jack: I got busted at the gym. Will: For what? Feeling something other than the burn? I have to work out. I come from a very fat family. We store more fat than otters .--Jack Let's work out during the day, buddy. Unemployed guys are so much hotter .--Jack Will: This is not like your old gym. Look around. Nary a nipple ring in sight. No men in Flashdance collars. And behold: women! Jack: There were women at my old gym. Will: Not on their birth certificate. Somebody's sports bra's a little snug .--Jack Jack: Shielding a desirable carcass from a much hotter vulture. Will: See, this is what happens when you watch Wild Kingdom and gay porn with picture in picture .--discussing the jock block It can't be National Butch Day, 'cause the banks are still open .--Will I'd rather be a fag than afraid .--Jack Sometimes the things we don't like in others are the things we really don't like in ourselves .--Grace <mark>Karen</mark>: My mother told me never to show up empty-handed, but I didn't have time to shop, so...Here's a dozen shares of G.E. Grace: Great. I'll go put them in water. Retrieved from \"http: //willandgrace.wikia.com/wiki/Will_Works_Out? oldid=15150\" Categories: Episodes Season 1"}, {"articleID": "2014101400_00057527_W", "names": {"Robert Morrison": ["Q10363204", "Q27528639", "Q7347826", "Q7347828"]}, "date": "2014-10-14", "url": "http://www.nj.com/mercer/index.ssf/2014/10/live_report_princeton_discusses_towns_first_post-consolidation_audit.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to comments Live report: Princeton discusses town's first post-consolidation audit PRINCETON - Council is discussing the town's first post-consolidation audit, with a \"corrective action\" resolution on the agenda to address recommendations. The former Princeton borough and township officially consolidated on Jan. 1, 2013. \"Given the complication of bringing two municipalities together, I'm pleased with the results of that audit,\" Mayor Liz Lempert said Monday afternoon. \"There are some items on there in the corrective action plan that will be adopted .\" The audit was conducted by Hodulik & <mark>Morrison</mark> of Highland Park. One recommendation is that the financial accounting software budget module's data entry privileges be reviewed and modified to limit the ability to override controls to authorized personnel. In response to that recommendation, the town said new finance software is in place to limit the ability to override system controls to Kathy Monzo, director of finance, and Sandra Webb, chief financial officer, according to the corrective action resolution. Another recommendation included making sure reports of credit card payments of parking costs be obtained and checked against amounts paid by the card companies to assure all parking revenues are received timely. Princeton said software changes were made at the Bank of America, and \"this is an on-going issue that we are still attempting to resolve,\" according to the resolution. mandatory quarantine issued Friday by state health officials for members of an NBC crew - which includes Princeton resident Dr. Nancy Snyderman - that was exposed to Ebola. Stay with The Times as we provide live updates of the audit discussion. Please be sure to refresh your browser for up-to-the-minute reports. 8:50 p.m. Lempert thanks the <mark>Morrison</mark> and municipal staff for undertaking the \"enormous, enormous task .\" 8:46 p.m. Resolutions pass unanimously to accept the 2013 audit and approve the corrective action plan. 8:35 p.m. <mark>Morrison</mark> said he would not be surprised if this year's audit produces a lot less recommendations because merging the towns' two databases was a large task for staff. 8:30 p.m. Auditor <mark>Robert Morrison</mark> kicks off the discussion, saying any concerns with the report are minor and do not impact the \"fairness of the financial statements\" at a great magnitude. \"By the time we met with management at the conclusion of the audit, several of these matters were corrected,\" <mark>Morrison</mark> said. \"These were not critical issues to the consolidation but they should be and must be addressed .\" \"We're satisfied that if the management implements actions in that corrective action plan, these matters will clear themselves up,\" he said. From local news to politics to entertainment and sports, the twice daily Right Now eNewsletter has all of the New Jersey news you need! Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 New Jersey On-Line LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of New Jersey On-Line LLC."}, {"articleID": "2014061722_00102567_W", "names": {"Iker Casillas": ["Q11584", "Q1190369"], "Sergio Ramos": ["Q483309", "Q514286"], "Juan Mata": ["Q168740", "Q41839093"], "Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"]}, "date": "2014-06-17", "url": "http://theworldgame.sbs.com.au/article/2014/06/17/spain-aiming-spark-campaign-against-chile", "content": "Chile must be braced for a Spain backlash after the reigning champion was humiliated by Netherlands in its FIFA World Cup opener. Vicente del Bosque's men arrived in Brazil as one of the pre-tournament favourites having triumphed in South Africa four years ago, as well as retaining its UEFA European Championship title in 2012. However, Spain's World Cup defence began in a disastrous fashion as Louis van Gaal's side stormed to a shock 5-1 Group B victory in Salvador on Saturday (AEST). Xabi Alonso's 27th-minute penalty had appeared to put Spain in a strong position, but Robin van Persie's superb headed equaliser shortly before the break triggered a second-half demolition from the Dutch. Several Spain stars came in for heavy criticism after the crushing defeat, none more so than <mark>Iker Casillas</mark>, with some calling for the Real Madrid goalkeeper to be dropped from the starting XI. Del Bosque may retain faith in his captain, however, as David de Gea is struggling for fitness owing to a muscle injury, leaving Pepe Reina as the only alternative. Central defensive pair <mark>Sergio Ramos</mark> and Gerard Pique as well as Brazil-born striker Diego Costa also faced scrutiny for their performances, but it remains to be seen if Del Bosque will change his line-up or hand an opportunity to the side that failed so spectacularly last week. Regardless of who gets the nod at the Maracana in Rio de Janeiro on Thursday (AEST), the result will offer some indication as to whether Spain can mount a challenge to return to the iconic stadium for the final on 14 July (AEST). It is the second time in as many World Cups that the teams have faced off, Spain triumphing 2-1 in 2010, although both sides still progressed from Group H. A repeat victory could re-invigorate Spain - which lost its first match in South Africa before going all the way - and forward <mark>Juan Mata</mark> believes a strong team bond can help it overcome the poor start. \"We have strong faith in our football, in our ideas and we really believe we can overcome the situation,\" he said. \"This group is like a family since I arrived here .\" I think it's vital this kind of friendship between all of us, this familiar feelings which have made the Spain national team into a successful team. \"Chile started its campaign with a 3-1 victory over Australia, but that scoreline somewhat belied the difficulty that Jorge Sampaoli's side faced in Cuiaba. The South Americans were fluent in attack, with Barcelona forward Alexis Sanchez particularly lively, yet goalkeeper <mark>Claudio Bravo</mark> was required to make a series of saves to deny Australia at least a draw. Chile has failed to beat Spain in 10 meetings between the teams and even a point could prove crucial in its bid to qualify for the knockout stages. However, midfielder Arturo Vidal - who managed 60 minutes against Australia as he continues to recover from knee surgery and has declared himself fit to play Spain - insists Chile is only interested in a maximum haul."}]