[{"articleID": "2014060909_00001661_W", "names": {"William Scott": ["Q28853025", "Q43390409", "Q43912263"]}, "date": "2014-06-09", "url": "http://lasvegassun.com/news/2014/jun/08/two-officers-shot-cicis-nellis-suspects-run-wal-ma/?utm_source=mostpopular&utm_medium=banner&utm_campaign=mostRead", "content": "Two officers, three others dead in shootings at restaurant, Wal-Mart BREAKING: 5 Dead, Including 2 Officers In Vegas Two suspects declaring the start of \"a revolution\" shot and killed two police officers this morning at a pizza restaurant on Nellis Boulevard, then ran into a nearby Wal-Mart and shot at least one other person before killing themselves, according to Metro Police. Sheriff Douglas Gillespie, in an afternoon news conference, identified the dead officers as Alyn Beck, 41, and Igor Soldo, 31. The two were patrol officers in the area. \"What precipitated this event, we do not know,\" a subdued Gillespie said. \"My officers were simply having lunch when the shooting started .\" He did not identify the dead assailants or the victim shot in the Wal-Mart. A woman who said she witnessed the start of the bloodshed described an execution-style assault on two officers who were eating pizza and probably never saw the attack coming. Assistant Sheriff Kevin McMahill said the two suspects ambushed and shot the two officers shortly before 11:30 a.m. at the CiCi's Pizza at 309 N. Nellis Blvd., near Stewart Avenue. Officer Larry Hadfield, a Metro spokesman, said one of the suspects yelled, \"This is a revolution .\" Gillespie, however, said at the news conference he could not confirm the revolution comment. One of the officers was able to fire back during the ambush, Gillespie said. The assailants then took the officers' ammunition and reportedly ran inside the Wal-Mart on Nellis Boulevard between Charleston Boulevard and Stewart Avenue. A number of responding officers followed the suspects into the store, McMahill said. There, the assailants shot and killed at least one person inside the front door of the store. They exchanged gunfire with police inside the store before the female suspect shot the male suspect and then killed herself in an apparent suicide pact, according to Gillespie. McMahill described the assailants' lives ending an an \"apparent suicide pact .\" Sheree Burns, 48, said she left church early, lured by the all-you-can-eat pizza for $5.55 at CiCi's. She said she was seated just behind the two officers, who already were eating. A man came up to one of the officers - a balding man - and shot him in the head, Burns said. Instinctively, Burns ducked under her table but peeked up to see who she thought was a woman shoot the other officer in the head. Burns said she saw the male assailant - whom she described as tall with scruff on his face - hovering over the balding officer and remove his handgun from his holster. The two assailants then left CiCi's, en route to the Wal-Mart, Burns learned after talking to police. \"I'll never leave church early again,\" Burns said. McMahill said there were \"literally a thousand\" witnesses to the midday events at the busy shopping center. \"It is a very complex, very dynamic crime scene,\" he said. Inside the Wal-Mart, Mayra Calvillo, 19, was working near the front of the store when she heard someone yell, \"Get out of Wal-Mart!\" Calvillo said she turned around and saw a man with a handgun raised in the air. The man, whom Calvillo described as white and dressed in a navy blue shirt, jean shorts and a hat, fired at least one round. Calvillo described the unfolding scene as surreal. She said she started to run, then realized she needed to help direct the store's customers safely out of the store. Others described a pandemonium-filled scene. Jesus Bustamante, 26, said he was in the electronics section of the store when he heard a muzzled sound and people screaming, \"It's a shooting! It's a shooting!\" Bustamante said he wasn't sure whether to run out or take cover in the store, but he saw a Metro officer run past him saying, \"Get the (expletive) out of here!\" Bustamante said those trying to get out of the store was typical for a busy Wal-Mart: elderly, children, parents. A mother at the scene who asked not to be identified said she was in a dressing room with her 7-year-old daughter and 9-year-old son, who were looking for outfits for a relative's graduation. The mother said she heard two gunshots followed by pandemonium breaking out inside the store. Her first thought; How do we get out alive? She said she immediately grabbed her children and sprinted out a backdoor near the changing room. Once outside the store, she said she saw police officers swarming near the CiCi's and hear bystanders screaming that two officers had been shot. Alex Estrada, who was at an IHOP nearby, said he saw a crowd of about 30 to 40 people run out the back door of Wal-Mart around 11:30, and people on the streets and at nearby businesses were talking about the incident. Still dazed from the midday events, Burns stood outside Applebee's a few blocks away awaiting a ride home. When her friend arrived, Burns wept into her arms. \"I saw it all,\" Burns said. Residents of the area had mixed feelings about where they lived. A few employees at a nearby restaurant said it didn't surprise them. A schoolteacher who has lived here 13 years said, \"It can happen anywhere .\" Calvillo, who has worked for 11 months at the Wal-Mart, expressed similar sentiments. \"I'm still in shock. I feel like it hasn't hit me yet. I'm scared. I don't feel safe anymore,\" she said. Nell Jones and her daughter, JaNell, have lived here for two years. They are getting out in August. Almost nightly, Nell said, Metro helicopters, \"ghetto birds,\" pass overhead presumably on a suspect's tail. \"It's all these gang-bangers,\" Nell said angrily. Metro has doubled up its officers on patrol while officers gather more information about the shooting. Officers also are wearing badges shrouded with black ribbons in honor of their deceased colleagues. The media wasn't initially allowed into the entrance of University Medical Center Trauma, where some victims of the shooting had been rushed in. Metro put police tape around the entrance, just north of Charleston Boulevard, and large Command Center utility vehicle from the North Las Vegas Police Department was parked nearby, its telescopic antenna jutting into the air. The police tape came down around 5:30 p.m. Capt. <mark>William Scott</mark>, who oversees Bolden Area Command, which is just north of U.S. 95 and abuts the command area where the shootings took place, said tough times would be coming as officers ponder the senseless act. \"We'll talk a lot about this,\" he said of himself and his officers. \"We will always have each other's backs .\" NBA Finals in Vegas: Heat vs. Spurs Game 2 betting preview, odds and picks"}, {"articleID": "2019062915_00118819_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "John Mcenroe": ["Q16474", "Q37772659"], "Peter Fleming": ["Q21463755", "Q729789"]}, "date": "2019-06-29", "url": "http://tewkesburyadmag.co.uk/sport/national/17738907.murray-calls-for-doubles-shake-up-at-wimbledon/", "content": "<mark>Murray</mark> calls for doubles shake-up at Wimbledon By Press Association 2019 <mark>Andy Murray</mark> warming up to compete in the doubles at Wimbledon 0 comment <mark>Andy Murray</mark> would like to see matches at Wimbledon shortened to encourage more singles players to play doubles. The Scot is making his return to grand slam tennis purely in doubles as he builds up his fitness and stamina following a hip resurfacing operation in January. <mark>Murray</mark>'s presence will certainly mean a lot more focus than normal on the men's doubles this fortnight, where he is playing with Frenchman Pierre-Hugues Herbert and could meet brother Jamie and Neal Skupski in the third round. How many words will be written about this doubles partnership over the next week, and maybe more? <mark>Andy Murray</mark> and Pierre-Hugues Herbert practising together. pic.twitter.com/Ppn1d6hw9A--Eleanor Crooks (@ EleanorcrooksPA) June 28, 2019 Singles and doubles have become almost different sports in terms of the players who compete, with few of the leading singles players also committing themselves to doubles. It is especially hard at Wimbledon, with the doubles tournament, uniquely among the slams, also being played over best of five sets. <mark>Murray</mark> said: \"Beforehand you had a lot more of the top singles players that were playing the doubles. Like when (<mark>John</mark>) <mark>McEnroe</mark> was playing, around that time .\" A lot of the top doubles teams, they were pretty well known, like the Woodies (Todd Woodbridge and Mark Woodforde) and stuff. I grew up kind of watching quite a bit of doubles myself, too. <mark>John McEnroe</mark>, right, with <mark>Peter Fleming</mark> after winning the Wimbledon men's doubles title for the third time in 1983 (PA Archive) \"I think when the top singles players are involved in the doubles, it does draw a little bit more attention to it. That's something that I think will be a positive thing for tennis, if more guys were playing doubles .\" But here it's difficult because of the format, the best-of-five sets. For me, even though I'm playing doubles here, it's even a consideration if I'm going to play mixed, as well. I would never expect a top singles player to enter the doubles here because playing potentially 10 sets in one day is just too much. \"That's something that maybe would be worth looking at, to give more value to the doubles event, to get more of the top singles players playing, is to reduce the length of the matches a bit .\" It will be a different Wimbledon experience for <mark>Murray</mark> this year, with the former world number one having to wait until Wednesday at the earliest to get his campaign under way. <mark>Andy Murray</mark> insists he has not been watching very much tennis during his rehabilitation (Steven Paston/PA) And <mark>Murray</mark>, known as an obsessive follower of tennis, revealed he has mostly stayed away from the sport while he has been working his way back from surgery. \"I haven't really hardly watched any tennis in the last 12 months\" he said. \"Since the operation I had in January, I literally didn't watch anything hardly at all .\" When you're around the event, there's matches on the TV. I wouldn't sit from the first point of a match and watch a best-of-five-set match because it can be four hours of the day. I'm here to do stuff. I want to be with my family and things. I'll watch bits and pieces of it. \"<mark>Murray</mark> had a remarkably successful first outing as a doubles player at Queen's Club, winning the title last weekend with Feliciano Lopez, before a first-round loss at Eastbourne alongside Marcelo Melo. View this post on Instagram Dreams Do Come True???? #QueensTennis #FeverTreeChampionships A post shared by Fever-Tree Championships (@ fevertreechampionships) on Jun 23, 2019 at 11:56 am PDT He admitted his first practice with Herbert, who has won all four slam titles alongside countryman Nicolas Mahut, on Friday did not go particularly well and, although he would love to challenge for another Wimbledon title, he will not be putting too much pressure on himself. The Scot said:\" I think that's probably one of the things that I will try to make sure doesn't change over the next few years. I think a lot of that stuff kind of comes out from other people. I'm just happy to be playing tennis again really. \"I would like to do well when I get on the court. I play to win. I'm really competitive. But four or five weeks ago I didn't know if I'd even be playing over the grass. I shouldn't be expecting too much .\" 0 comment"}, {"articleID": "2019011611_00052061_W", "names": {"Gareth Williams": ["Q16232033", "Q18411896", "Q195021", "Q266062", "Q27051587", "Q3098316", "Q44219721", "Q45623541", "Q47125916", "Q5247441", "Q5522999", "Q5523000", "Q5523001", "Q5523002", "Q5523003", "Q5523004", "Q5523005", "Q56654342", "Q56948825"]}, "date": "2019-01-16", "url": "https://www.warwickdailynews.com.au/news/boxing-trainer-gareth-williams-says-justin-hodges-/3624091/", "content": "Former Broncos captain Justin Hodges during boxing training at The Boxing Shop gym, Nathan. Photo: Liam Kidston. News The boxing trainer helping \"underdog' Hodges by Kristy Muir & Joe McDonough 16th Jan 2019 8:19 PM premium_icon Subscriber only 0 WELL-KNOWN Brisbane boxing trainer <mark>Gareth Williams</mark> has been working with former Brisbane Bronco Justin Hodges for about nine years. So when Hodges steps in the ring next month for his first professional fight, the Boxing Shop owner will be there in the rugby league star's corner. Mr <mark>Williams</mark>, a former Australian national amateur coach, said he couldn't be more proud of Hodges' efforts .\" I've been coaching him all these years, \"Mr <mark>Williams</mark> said .\" He's a champion, a great guy who's always got time for people. \"He's definitely an underdog .\" <mark>Gareth Williams</mark> from The Boxing Shop. (AAP Image/Richard Walker) Mr <mark>Williams</mark> said Hodges was the \"most high-profile\" person he had coached. \"He just wants to have a go - he told me\" the one thing I don't want to do is disrespect the sport', \"Mr <mark>Williams</mark> said .\" As an athlete, losing is not something he talks about - he says' I am here to win'. \"Mr <mark>Williams</mark> said Hodges had ramped up his training from one session daily, to two ahead of his February 8 fight .\" He's committed, \"Mr <mark>Williams</mark>. He said there was a\" lot to improve \"but his charge had certainly shown a natural ability in the ring, including\" good hand speed \". Former Broncos captain Justin Hodges during boxing training at The Boxing Shop gym, Nathan. Photo: Liam Kidston .\" I noticed once we made our mind up that this fight was going to happen, I saw the training and the attitude change from training generally just for health and fitness, and a bit of fun with the boys, to \"right, it's business time now' .\" He's got a good jab, he's got some pop in his shots too, and he's got a bit of mongrel in him, as the NSW team would know. \"Mr <mark>Williams</mark> said it had taken a while for Hodges to get his mum and wife on side for him to go pro but it finally happened\" He is a family man and is well-respected, \"he said 0 broncos Read More Login to follow editors picks Read More Login to follow justin hodges Read More Login to follow nrl Read More Login to follow broncos editors picks justin hodges nrl"}, {"articleID": "2013043003_00036956_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2013-04-29", "url": "http://zdnet.com/apple-versus-microsoft-the-ticker-tape-tells-the-tale-7000014556?s_cid=e539&ttag=e539", "content": "windows 8 was released to the general public exactly six months ago. during that time, the pc industry has contracted sharply and windows 8 buyers have been less than fully enthusiastic. the conventional wisdom is that microsoft is flailing and apple is a productivity machine. apple's products are uniformly loved and microsoft's are unable to get any traction. apple's cool, microsoft's not. and yet the company's stock prices have gone in completely opposite directions since the launch of windows 8. this chart begins on the day windows 8 was released to the public. now, the market has been known to be dead wrong before. but it's odd to see this big a divergence between public perception and market performance. last week microsoft released its quarterly results. this week apple weighed in with its numbers. that gave me a chance to look at both companies in a little more detail. and when i did, i saw far more similarities than differences, including two ceos who have drawn their share of fire from critics who think they need to be replaced. at microsoft, steve ballmer gets dinged for the company's inability to make any serious inroads into the mobile category. after six months on the market, neither windows phone 8 nor windows 8 have managed to get out of the single digits in terms of usage. and yet the company managed to increase its profit 19 percent over the corresponding quarter last year. how? by concentrating on the boring, yet highly profitable units that most tech bloggers yawn at. microsoft business division (responsible for office 365, which is about to become a billion-dollar business) and server and tools (with multiple billion-dollar businesses under its umbrella) are both bigger than windows. meanwhile, the windows division reported flat revenues even though pc shipments dropped by 14 percent during the same period. i've read several critiques from armchair financial analysts implying that ballmer and co. are somehow cheating by including its new surface hardware line in the windows division's results. but that's microsoft's strategy for windows, part of its initiative to become a \"devices and services\" company. you can argue about the execution of that strategy, and you can place bets on whether it will succeed. but there's nothing timid or tentative about it. and then there's apple. superficially, its business looks as diversified as microsoft's, with revenue and profits coming from a variety of products. but in the same quarter where microsoft's profits were up 19 percent, apple's were down almost 18 percent. there's no question that apple will sell lots more iphones and ipads. but as ceo <mark>tim cook</mark> acknowledged on the earnings call, \"we acknowledge that our growth rate has slowed and our margins have decreased from the exceptionally high level we experienced in 2012 .\" in developed markets, apple has masterfully executed against its plan to sell high-priced, high-margin products to the wealthier segments of the buying public. but there's evidence that that market is saturated, and the first-mover advantage is gone. on the same earnings call, <mark>cook</mark> conceded as much: \"we can't control items such as exchange rates and world economies and even certain cost pressures .\" growth for apple in its existing product lines means appealing to more price-conscious buyers and moving into markets where the $618 average selling price of an iphone isn't an option. is there another breakthrough hardware product in apple's back pocket? it's hard to believe that a smart watch or a tv has the potential to define a category as the iphone and ipad did. maybe services? revenue on the itunes/software/services line in apple's just-completed quarter was up 30 percent. but as the latest 10-q report makes clear, that's a by-product of the larger installed base of ios devices: this increase was due primarily to growth of itunes [which] reflects continued growth in the installed base of ios devices and expanded itunes digital content and applications offerings around the world, resulting in higher net sales on the app store and higher net sales of digital content. outside of itunes, apple hasn't exactly excelled at delivering services to its own customer base, let alone expanding those services to a larger market. so it's hard to see that as a real growth opportunity. indeed, that's the real difference between steve ballmer's microsoft and <mark>tim cook</mark>'s apple. ballmer has a significant challenge in one division that represents about a quarter of his company's revenue, while other divisions are growing steadily outside the gaze of the gadget-obsessed tech press. meanwhile, apple has become downright boring and predictable. as felix salmon today's earnings report marks the point at which apple is officially no longer a high-growth tech stock, valued on its monster potential. instead, it has become a cash cow, valued on its ability to pump hundreds of billions of dollars into its shareholders' pockets. that's actually a fairly accurate description of microsoft's performance in the ballmer era. and given the challenges of the economy and a fickle technology market, it's a significant accomplishment for both men. ed bott ed bott is an award-winning technology writer with more than two decades' experience writing for mainstream media outlets and online publications. imagine a document and it is shipped off instantly...first i never saw george do that, second what the hell are you talking about? google \"microsoft cooler than apple\" looks like to most, other than you, microsoft is seen as cooler today than in many moons. that being said, some typewriters were pretty neat. you know, it's typical here for people to equate proprietary with features. actually, by not using active-x, alternatives just as applications, contrary to ms office which is deeply entrenched into the os, similar to internet explorer. confusing proprietary to essential feature is born from microsofts' monopolistic tendencies, nothing more. how ironic and ridiculous to make an apples-to-oranges comparison type analogy by referring to the price of cows and goats. the author was not, for example, comparing the price of an iphone to the price of a microsoft surface pro. he specifically was looking at common measures of both companies? revenue growth or decline rates, stock price rise or decline rates, etc. how ironic also for this commentator to be talking about others' state of denial when in fact he is ignoring the actual growth in microsoft revenues in absolute and relative terms. i suggest refresher courses, e.g. comparisons 101, irony 101, reality 101, etc.; -) way up overall. way up on office 365. way up on cloud services. way up on server systems. windows flat. wp8 only slightly up. the point is that microsoft redesigned itself years ago to be ready for a shift away from windows. they will do fine. and maybe they will even get some traction. who knows?? remember windows live? countless of cloud-based services too many to count with little popularity, they've bundles all * of those into windows 8 because they weren't making a name for themselves as services and microsoft's products were fractured, they're all in windows 8 now (including zune which they call xbox music & xbox video now), even bing is big in windows 8, if there's anything to microsoft, it's that they preserve everything, no matter how much they've failed, microsoft keeps supporting them. * = many windows live services have feen merged, example: windows live mesh, windows live skydrive and several \"minor -\" services have been merged into microsoft skydrive. if windows 8 is an indication of anything, it's that microsoft believes in windows, and thinks \"windows 8 is the way to the cloud\". if i understand you correctly you practically hate microsoft for allowing integrated search, skydrive, cloud sync et al. actually it is a great way to connect windows to the cloud which people will be using more and more every day. windows live was no failure (hotmail, live mail, skydrive, msn messenger, office web apps), they were used more than comparable services. having all of those present without any additional downloads is brilliant. something i've wanted since xp. @ stevenababy see? this guy here is the most common kind of prime example of really stupid writing, talking like he has a point, actually says nothing substantive, but makes a claim, a claim by the way provably and obviously wrong, but says it as if he means it and as if its based on some common truth. its obvious and uncontestable crap. his claim: \"face it ed, the world is beginning to realize that it can live without windows and office\" the world is beginning to realize no such thing. what a joke. neither the particular business i am in or any of the businesses i have been through nor any of the homes or anyplace ive been to over the years seems to have had any so called \"realization' that windows isnt needed. what a load of guff. its like someone took a pile of nonsense and distilled it down to its finest form. what the world may have realized is that you don't need windows to run a cell phone or tablet. this in itself is a joke. its like saying\" the united states is beginning to realize that you don't need russian built rockets to go into outer space \". ummm? i don't get it? are you claiming they just recently came to realize this? like? didn' t the u.s.a. go to the moon or something already without russian rockets? like, a bunch of years back? and similarly, when did the world ever think that windows was needed for a cell phone or a tablet??? my guess would be something like the 12th of never. it seems to me that the whole world in so far as business and home use of windows goes that years ago they would walk into best buy and look at desktop computers and laptop computers, there been an area for macs for some time. if they were not buying a mac they were buying a windows computer. sometimes, although we know rarely, people will now sometimes buy a chromebook. we know that people don't buy nearly as many desktops and laptops as in the past because everyone already has one. and we know, just exactly like the\" good old days \"about 90% of the computers sold are still windows computers. it dosnt fly in any sense of the term that the world is coming to realize that they don't need windows. its just impossible given the facts that the world actually knows exists. hopers and dreamers that want windows and usually ms to disappear and die use such phrases based on the fact non windows os tablets and cell phones have sold amazingly well, but it has shown absolutely nothing to the notion the world can get by without windows. nothing, as like in not a thing. its like saying that now we have airplanes and submarines the world is coming to realize we don't need automobiles. we know why people say these really stupid things. it allows them to dream of a world in the near future where things are more like the way they would like them to be. it gives some fertile ground for them to hope and dream there is some rational belief for thinking that their dream world is somehow closer to a reality than it actually is. the world still needs windows every bit as much as they always have. at least certainly in general. and worse yet for the ridiculous dreamers who for odd reasons hate windows and ms so much they live to exist in this dream world, is that we are not really much closer in significant ways to being any closer to any kind of world that can get by without windows yet. cayble, a very well written and thought out piece. my only thoughts are: for pretty much every windows hater, there are an equal amount of apple haters, which is very evident on this site, whom also want to see the demise of apple. what many of these haters don't seem to understand, is that we really don't need or should want any company to go down, the resulting effects it has on everyone is bad. people will be out of a job in an economy that is already strained enough, and then the other businesses that deal with those products also loose business and customers. and then of course, the consumers loose in the end as well. i prefer to have choice, just as i prefer to use different platforms for different parts of my job, or at home. but if it's one thing i've learned over my life, a lot of people just like to complain, and they need something or someone to take it out on. and they never seem happy unless their bashing something, trying to make themselves feel better than others...but it's none of the people you mentioned. where in mr. bott's article did you find any reference to goats? the only reference to cow, as in cash cow, was in a quote from another article. mr. bott did not promote microsoft. all he did was take readily available data, and do a side-by-side comparison. he even said that the stock market was known to be way off. his point was that the evidence does not support the assumptions - for either ms or apple. microsoft hit with competition complaint over windows 8 uefi secure boot zdnet newsletters get the best of zdnet delivered straight to your inbox we're temporarily in maintenance mode, which means you won't be able to sign up for a newsletter. please check back shortly to resume the subscription process. thanks for your patience. white papers, webcasts, & resources explore the features and functionality of oracle real application clusters 11g release 2 oracle exalogic elastic cloud deploys and upgrades applications quickly, handles massive transaction volumes, maintains a consistent set of technological standards, and connects seamlessly. learn more in this"}, {"articleID": "2016121515_01209085_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"]}, "date": "2016-12-15", "url": "http://duncanbanner.com/oklahoma/news/firefighter-applicants-undergo-testing-this-week/article_baebef25-4add-5ddd-aaea-24f301a7a0df.html", "content": "1of 2Staff photo by <mark>Mark Hughes</mark> Basic firefighter applicants leave a smoke-filled building as part of their testing to become a member of Muskogee's Fire Department. About 49 candidates arrived for the agility test, and by the end of the day only 18 made it. There are four basic firefighters position open. Staff photo by <mark>Mark Hughes</mark> A candidate applying for one of four basic firefighter positions climbs a 75-foot ladder tilted to 75 degrees. The test's purpose is to find out if applicants are afraid of heights. The candidate is wearing a safety belt with lines attached. Firefighter applicants undergo testing this week By <mark>Mark Hughes</mark> | CNHI News Oklahoma6 hrs agoStaff photo by <mark>Mark Hughes</mark> Basic firefighter applicants leave a smoke-filled building as part of their testing to become a member of Muskogee's Fire Department. About 49 candidates arrived for the agility test, and by the end of the day only 18 made it. There are four basic firefighters position open. Staff photo by <mark>Mark Hughes</mark> A candidate applying for one of four basic firefighter positions climbs a 75-foot ladder tilted to 75 degrees. The test's purpose is to find out if applicants are afraid of heights. The candidate is wearing a safety belt with lines attached. ENID, Okla.--Zack Gamble said that since he was a child he's known he wanted to be a firefighter. \"Firefighters have always been my hero,\" the Broken Arrow man said. Honor, community service and employment were some of the reasons given by applicants taking Muskogee Fire Department's employment tests this week. \"There were 86 applications submitted, and about 49 of them showed up to compete for four entry level firefighter positions,\" said Jeff Watkins, training officer, about Tuesday's agility test. The first test was to run or walk 1 1/2 miles in 13 minutes, and 21 made it through the run and three could not complete 35 sit-ups in two minutes. They were also required to finish 25 pushups in two minutes. Austin Seabolt of Muskogee had a leg up on his competitors. While in the U.S. Navy, he was required to run 1 1/2 miles in 13 minutes and 30 seconds. By coincidence, he was trained to work in the Navy police and fire departments. He was pretty confident of passing the agility test because he works out at the gym about five days a week, he said. Teddy Baker of Fort Gibson is one of the applicants. \"It has always been my nature to help others. That is my calling, and this is a godsend,\" Baker said. Levi Drier of Vian said finding employment near home is difficult. \"There's not many good jobs to choose from,\" Drier said. Muskogee resident Jake Woodard said the agility test wasn't easy. \"The run was most difficult with the cold wind,\" Woodard said. During their run, and remaining portion of their test, the temperature was 44 degrees with wind chill making it feel like 37 degrees, said a National Weather Service meteorologist. \"We typically lose 50 percent on the run, but some years 40 percent and other years 60 percent,\" Watkins said. The candidates also will take a written test and be interviewed by the chief officers. Once the four candidates are selected a drug test and physical evaluation is conducted. Watkins said that the selectees are on probation for a year and will receive a monthly evaluation that includes their performance, attitude and respectfulness. They also have to pass an emergency medical responders course and a basic firefighters course. The remaining agility events determined whether applicants had back problems, were claustrophobic or afraid of heights. The final test was ascending and descending a 75-foot ladder positioned at 75 degrees to discover whether they were afraid of heights, said Fire Chief Mike O’Dell. Other events included carrying 125 pounds 100 feet that simulated carrying fire equipment and carrying a rolled hose while walking on a 4-inch beam simulating a roof's plank. Reach <mark>Mark Hughes</mark> at (918) 684-2908 or mhughes @ muskogeephoenix.com. Tags"}, {"articleID": "2017021518_01211731_W", "names": {"Frank Caprio": ["Q5485673", "Q5489862"], "John Howard": ["Q1467025", "Q51330", "Q5670833", "Q58363217", "Q6228200", "Q6236889", "Q6240028", "Q6240032", "Q6240035", "Q6240041", "Q6240047"]}, "date": "2017-02-15", "url": "http://wect.com/story/34511253/woman-contests-ticket-issued-for-parking-1-minute-early", "content": "Woman contests ticket issued for parking 1 minute early - WECT TV6-WECT. com: News, weather & sports Wilmington, NC Woman contests ticket issued for parking 1 minute early - WECT TV6-WECT. com: News, weather & sports Wilmington, NC Member Center: Woman contests ticket issued for parking 1 minute early 2017-02-15T17:22:01 Z PROVIDENCE, RI (RNN)--A woman appeared in a Rhode Island traffic court to contest a ticket she received for parking one minute too early. Well, 2 seconds too early. The woman, who is called Sarah in the video, received the ticket for parking in a \"no parking zone\" that ended at 10 a.m.. The ticket was issued at 9:59 and 58 seconds. Judge <mark>Frank Caprio</mark>, who has his own YouTube show \"Caught in Providence\" turned his disbelief over the ticket into humor. \"You've taken the wrong path in life,\" he told the woman with a smile. The woman said her car clock said 10 a.m., and the judge teased her for blaming the clock. <mark>Caprio</mark> also joked that Providence's parking enforcement officers \"were second to none in the country\" before dismissing the violation. \"I think 9:59 is close enough to 10,\" <mark>Caprio</mark> said. Copyright 2017 Raycom News Network. All rights reserved. Updated: Wednesday, February 15 2017 1:47 PM EST 2017-02-15 18:47:44 GMT Outside of a hard rain that typically floods Water Street, you don't find many water hazards in downtown Wilmington. Sand traps aren't in abundance either. But that will change for at least one week in May. Updated: Wednesday, February 15 2017 1:44 PM EST 2017-02-15 18:44:17 GMT A community is heartbroken after a head-on collision sent three people to the hospital, where two elderly people eventually died. <mark>John Howard</mark>, 84, and Betty Erdman,87, were leaving an 84th birthday celebration for <mark>Howard</mark> the night of February 2nd. They never made it out of the driveway."}, {"articleID": "2019110900_00096151_W", "names": {"Raymond Chow": ["Q1194523", "Q27922756", "Q7298668"]}, "date": "2019-11-09", "url": "http://www.kpbs.org/news/2019/nov/08/cinema-junkie-episode-182-ford-ferrari-and-asian-a/", "content": "Cinema Junkie Episode 182: Ford, Ferrari And An Asian American Film Canon Making history and making lists with director James Mangold and programmer Brian Hu Friday, November 8, 2019 By Beth Accomando Photo credit: Twentieth Century Fox Director James Mangold (center) on the set of \"Ford v Ferrari\" with actors Matt Damon and Christian Bale. Listen to the Podcast Episode Cinema Junkie goes from the Le Mans track to debating the best in Asian American films from the past two decades. First up, director James Mangold discusses his new film \"Ford v Ferrari,\" about the showdown between the two car icons in 1966 at the 24-hour Le Mans race. It may be called \"Ford v Ferrari\" but the story is...Read more → Aired: November 8, 2019 | + Subscribe to this podcast Director James Mangold discusses making history as he looks to the story of \"Ford v Ferrari;\" while San Diego Asian Film Festival artistic director and programmer Brian Hu talks about the list he helped create for the Los Angeles Times of the \"20 Best Asian American Films of the Past 20 Years .\" The film is called \"Ford v Ferrari\" but that's a bit of a misdirection because it's less about those famous brands and more about the two men--car designer Caroll Shelby and driver Ken Miles--who designed and raced the Ford that would challenge Ferrari at the 1966 Le Mans in France. For this episode I hit the track at Le Mans to find out what it takes to push a car and a driver to the limit during that celebrated 24-hour race as director James Mangold talks about his new film \"Ford v Ferrari,\" and then I discuss the recent Los Angeles Times list of the \"20 Best Asian American Films of the Past 20 Years\" with San Diego Asian Film Festival artistic director Brian Hu, who initiated the list with film critic Justin Chang as the festival prepared to celebrate two decades of showcasing Asian and Asian American films. Photo by Roland Lizarondo San Diego Asian Film Festival's artistic director Brian Hu demonstrating how to enjoy a VR short playing on opening night of the festival's 20th anniversary. Nov. 7, 2019 I recommend checking out Cinema Junkie Episode 155 in which my friend and stunt driver Steve Lepper picks his favorite car movies and discusses the best car chases ever put on film. Plus, you can hear me on Frank Woodward's latest episode of his podcast Film Sense debating what is cinema and what's the best way to watch a movie to truly enjoy a cinematic experience. FEATURED PODCAST Satisfy your celluloid addiction with the Cinema Junkie podcast, where you can mainline film 24/7. This film and entertainment series is run by KPBS Film Critic Beth Accomando. So if you need a film fix, want to hear what filmmakers have to say about their work, or just want to know what's worth seeing this weekend, then you've come to the right place Want more KPBS news? Find us on Twitter and Facebook, or sign up for our newsletters. + Subscribe to our podcasts To view PDF documents, Download Acrobat Reader. Related Stories San Diego Asian Film Festival At 20 Podcast 155: Stunt Driver Picks Best Car Movies Podcast Episode 154: From <mark>Raymond Chow</mark> To Current Asian Cinema More Like This San Diego Asian Film Festival At 20 Nov. 7, 2019 Examining The Racial Stereotypes Of 1932's \"The Mask Of Fu Manchu' Jul. 2, 2019 Pac-Arts' Spring Showcase Serves Up Eight Days Of Asian Film Apr. 10, 2019 Midday Edition Special: Best Of KPBS Podcasts Dec. 24, 2018 Latest News Got A Weird Text? A Telecom Vendor Says It's To Blame Union-Tribune: CBP Agents Altering Asylum Seekers' Court Documents Immigrant Activism And The Legacy Of Proposition 187"}, {"articleID": "2011012415_00177057_W", "names": {"David Grossman": ["Q160263", "Q16729464", "Q3017993", "Q3018013", "Q5234444"]}, "date": "2011-01-24", "url": "http://rochester.edu/College/translation/threepercent?id=3050&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+ThreePercent-Article+%28Three+Percent%29", "content": "ncbb fiction finalists 24 january 11 | chad w. post over the weekend, the national book critics circle announced the list of finalists for this year's awards, which consist of six categories: fiction, nonfiction, poetry, autobiography, biography, and criticism. you can find the complete list of finalists at the link above, but i just want to list the fiction finalists, since 40% of the list is literature in translation: jennifer egan, a visit from the goon squad <mark>david grossman</mark>, to the end of the land, translated from the hebrew by jessica cohen (knopf) translated from the german by damion searls (farrar, straus and giroux) (faber & faber) interesting that there's literally no overlap between this list and the national book awards shortlist...not terribly surprised that freedom is on here, but i really, really hope it doesn't win. the death of the adversary for us earlier this year. every since then (and after reading the almost over-the-top review in the new york times), i've wanted to read this. we never actually received a copy of to the end of the land, but i've heard it's pretty awesome...on a side-note, i had a sit-com like experience with <mark>david grossman</mark> at the last frankfurt book fair. when i was waiting to meet people for dinner, i crashed the fancy hanser party, right during the time when michael kruger was introducing all the famous guests who were in the audience. i was circling around the back, trying to make myself invisible, when suddenly kruger pointed right at me and said, \"and we even have the recipient of the german book trade peace prize in the audience!\" everyone-truly everyone-turned to stare right through my guilty-looking self and applaud <mark>david grossman</mark>, who was quite literally, right behind me...anyway, hopefully knopf will send us a review copy at some point...and in terms of award announcements, we might have more about the reviewed by tim nassau literary critic edmund wilson, writing in the 1930s, said that the pieces of gertrude stein's reviewed by will eells roberto bola? o has recently become one of the new stars of latin american fiction, which is made all the more tragic by his death in 2003. his mammoth novel reviewed by acacia o'connor they say \"see naples and die\" (reviewed by erica mena birds for a demolition reviewed by phillip witte jenny erpenbeck has already received a great deal of well-deserved critical acclaim in the wake of her third novel, visitation (new directions, translated by susan bernofsky), which vogue has called \"a remarkable achievement .\" such a response (especially coming from the...museum of eterna's novel (the first good novel) by macedonio fernandez reviewed by heath mayhew prologue to the review macedonio fernandez is little known outside argentina. unfortunately i foresee this remaining the case for some time. even with the recent translation and publication of his posthumous novel, reviewed by adelaide kuehn the princess, the king, and the anarchist"}, {"articleID": "2014082003_00048717_W", "names": {"Brian Carroll": ["Q18205841", "Q265252", "Q48362944", "Q4963300", "Q911994"]}, "date": "2014-08-19", "url": "http://wgrz.com/story/sports/high-school/2014/08/19/hamburg-volleyball/14300947", "content": "MORE HAMBURG, N.Y. - A huge weight has been lifted off the shoulders of Hamburg volleyball player, Zachary Yerington. The senior middle hitter has chosen to play at Ohio State in the fall of 2015. Yerington verbally committed to play for the Buckeyes last week and couldn't be more excited. \"It's been one of my dreams since I was probably in seventh or eighth grade to go to Ohio State and play a sport there. At first I wanted to play football because I was playing football at the time and then I switched to volleyball my freshman year so that was kind of my dream to get there and play there,\" Yerington said. Yerington explains how the recruiting process all came together. \"Coach Hanson actually sent me an email and asked for my phone number so he could call me and talk about it. I didn't really have words at the time I was kind of just exuberant almost,\" Yerington explained. With a skilled player like Yerington, it's hard not to talk about his success at Hamburg. Head Coach <mark>Brian Carroll</mark> explains how he's been able to be so successful. \"Zach's a big part of our team but it's not all about him. He's definitely a person who can put a ball away when we need that but we also have some very high skill players in other positions that allow him to have the success he has. He's talked about how he's going to be going to Ohio State, he needed to have a team get him there to have the skill to be able to get looked at. He has a lot of kids here who have helped him along the way so in a way really our whole program is going there which is kind of nice,\" Coach <mark>Carroll</mark> explained. Even though Yerington already has his college career lined up, he still has one more season left with Hamburg and expectations are high as usual. \"I think we're going to be good I think we can push for the sectional championships again and hopefully further but we've got a tough road ahead of us because there's a lot of tough teams in our division,\" Yerington pointed out. \"Our team is solid, pretty well rounded, we're pretty deep and have a team of eleven but a majority of the kids will be able to get on the floor during the season. We have a lot of experienced players returning as well as some nice youth coming up to fill the roster out,\" Coach <mark>Carroll</mark> pointed out. The Bulldogs look to win back-to-back sectional titles this year and Coach <mark>Carroll</mark> seems confident in his group's work ethic this season."}, {"articleID": "2018042719_00062723_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Kim Jong-Un": ["Q10855883", "Q56226"], "Barbara Bush": ["Q153730", "Q190628", "Q2884044"]}, "date": "2018-04-27", "url": "http://wdel.com/blogs/allan-loudell/open-friday-weekend-forum-special-korea-edition/article_f08360d6-4a34-11e8-9138-8769dc2ad455.html", "content": "So which stories / issues / topics grab your attention here at the end of the week? At week's end, Delaware's media, political, and academic establishments were still rocked by that homicide-suicide in Radnor Township, Pennsylvania. So many folks knew Meredith Chapman. And, as we've learned, homicide-suicides perpetrated by women are quite rare. Looks like Delaware's three casinos could be on track to get a tax break to keep them viable. At least, the state Senate finance committee has okayed a measure to reduce taxes and fees; it remains to be seen if this package will clear the legislature. I realize jobs are on the line, but casinos are no panacea for jobs, as even some very impoverished places--such as Tunica County, Mississippi--have discovered. Casinos are no elixir. In fact, with all kinds of gambling, we have an oversaturation of casinos. Just look at Atlantic City. So would Delaware lawmakers be throwing good money after bad? And let's not forget the ugly social costs from all this gambling. From casinos to state lotteries, a charlatan's way to raise revenue. That task force that reviewed the pros and cons of consolidating school districts in Delaware decides consolidation is not the way to go. No matter the calls to talk-shows and letters to the editor of newspapers. The benefits of consolidation are also illusory. It's interesting how many of the proponents of consolidation also somehow favor charter schools, which require principals, assistant principals, and, of course, buildings. Can't people comprehend the inherent contradiction? Not to mention making a school board and superintendent even more remote from the general community? I happen to come from a part of the country (suburban Chicago), where each village or town generally has its own school board and administrators for the elementary schools (K-8). But the high schools come under the township level, with their separate school boards and administrators. Could you imagine? Yet, because the public schools enjoy widespread public support in most cases--with hardly any competition from Catholic or other private schools--you don't hear all that consolidation talk. Even with much higher property taxes. Consolidation is also not some elixir. During the \"Susan Monday Show\" this (Friday) morning, I heard Susan and callers debate whether President <mark>Trump</mark> should get most of the credit for the two Koreas seemingly come together. Not so fast. From my analysis, such talk is unrealistically premature. What good is a vague North Korean pledge to denuclearize? People have short memories. We've seen this before. Arguably, North Korea's dictator <mark>Kim Jong-Un</mark> is just trying to detach South Korea from its U.S. alliance. Arguably, Pyongyang has set a trap for President <mark>Trump</mark>. Has \"Rocket Man\" not pulled out the rug from underneath President <mark>Trump</mark>? Because if President <mark>Trump</mark>, in a summit, cannot win intense verifiable inspections of North Korea's nukes - and he withdraws from any talks, or even again threatens North Korea--Mr. <mark>Trump</mark> comes off looking like the global bully. From The Guardian...And a reality check from The Asia Times...Yet, clearly, in South Korea, at least some people are optimistic, given all the hopeful visual symbolism. But again, this could serve to detach South Korea's interests from America's. From The Korea Times of Seoul...Yet, there's something to the argument that President <mark>Trump</mark>'s \"Crazy-like-a-Fox\" posture brought North Korean leader <mark>Kim Jong-Un</mark> to the negotiating table. From Australia's Melbourne Age...Still, one can't help but think: Either this unorthodox President has achieved a great breakthrough precisely because he's avoided all the usual diplomatic niceties, or he's fallen into the same trap as all his predecessors, but doesn't even realize it yet. From The Atlantic...Of course, the buzz has begun: <mark>Donald Trump</mark> for the Nobel Peace Prize! From New York Magazine...I continue to believe the <mark>Trump</mark> Administration is toxic for nearly all who serve in it. Almost everyone who serves comes out diminished or degraded. This analysis from Politico Magazine...Also, from Politico Magazine: \"The Puzzle of Sarah Huckabee Sanders\" Article continues below advertisement Remember so-called \"Freedom Fries\" (in response to France's opposition to the proposed second invasion of Iraq, in 2003)? That seems so long ago, when many Americans were enraged with France. Now, France has arguably eclipsed Britain and Germany as a top international player with the U.S., following French President Macron's state visit to Washington. The Germans certainly are aware. From Spiegel...What is so ironic is that the French President's speech to Congress was, in so many ways, a sharp rebuke to Trumpism. From Time...A revealing behind-the-scenes look from the Presidential photographer after the <mark>Barbara Bush</mark> funeral. Special Michelle--Melania bond? From The Daily Mail...Aftermath of the guilty verdict returned against Bill Cosby: Yanking honorary degrees and other awards. The big question mark is Philadelphia's Temple University. From The Philadelphia Inquirer / philly.com ..."}]