[{"articleID": "2012091123_00074925_W", "names": {"Ryan Griffin": ["Q14918294", "Q14950701"]}, "date": "2012-09-11", "url": "http://courant.com/sports/uconn-huskies/hc-jacobs-randy-edsall-column-0912-20120912,0,2709610.column?track=rss", "content": "randy edsall had his one-liner as ready as that inside handoff on first down that used to go for 2 yards and a cloud of vanilla. \"we'll try to keep it brief so you guys can get to lunch,\" the deserter said. \"i know you're all waiting to get your lunch in.\" the truth is nobody was in a rush to get to the lasagna tuesday at uconn's weekly media luncheon, not even the big, fat, out-of-shape media. everybody was dying to hear what the deserter had to say, even though everybody figured he'd play it closer to the vest than his play-calling. he finally got to what people wanted to know. \"if i could do it over again, i wished there was some way i was able to see the players and tell them face to face that i was going to leave,\" edsall said. \"but due to the circumstances surrounding that, i wasn't able to do that. that's something i've got to live with.\" edsall spoke on the teleconference for nine minutes. his opening statement lasted four minutes, 45 seconds. he was in control. in case anybody forgot, he always is in control. randy edsall put the freak in control freak and, yes, that is meant both as a compliment and a criticism. \"i'm deeply indebted to uconn and the state of connecticut,\" edsall said. he thanked lew perkins, phil austin, jeff hathaway. give edsall his marks. he wasn't disingenuous on that point. he did turn around and rave that the uconn offensive line is really jelling, which if he had watched the game film half as much i suspect he did, he was entirely disingenuous. as randy's old team readies itself to play randy's new team saturday at 12:30 p.m. at byrd stadium, the truth is the fan base of neither school cares much for edsall these days. his alleged \"dream job\" at maryland became a nightmare last season, ending with john feinstein of the washington post calling for his immediate firing. although his terps are off to a 2-0 start with tight wins over william & mary and temple, he's only a loss to uconn away from more incoming fire. once he spoke about the way he left, that was it. edsall made it clear he'd only take questions about saturday. when asked how his relationship with the uconn players he recruited is and if he plans to talk to them after the game, edsall was at his anal-retentive best: \"you have ncaa rules where you can't talk to players that aren't on your campus. i'm sure after the game i'll get a chance to see some of them and say hello.\" and what will they say back? \"we'll see how it goes,\" blidi wreh-wilson said. wilson told the courant last season, \"coach pasqualoni has his rules, too, but it's not like we feel it's something out to get us.\" north carolina state, yes, <mark>ryan</mark> wirth did talk about how fired up the team would be to face edsall and maryland. \"you caught him at the wrong time. he was emotional,\" wreh-wilson said. \"we put a block on it for this week. together, we made a commitment to avoid [bulletin board material].\" so there would be nothing said about the rules and regulations, precious little about edsall abandoning his ship. \"the wound is healed,\" <mark>ryan griffin</mark> said. \"this program, this building [the burton family complex], he built it.\" so edsall is an architect. \"i'm glad he got his dream job,\" trevardo williams said. \"i would do the same thing. i won't lie.\" making jordan todman stand up after the game to tell the team he was leaving early for the nfl, yet not saying anything to his assistants or players and bolting directly on a jet for maryland? temple fell short, and next it's uconn's turn against edsall's terps"}, {"articleID": "2013111109_00000895_W", "names": {"Steve Murphy": ["Q18600435", "Q21090563", "Q26816955", "Q3499030", "Q7613439", "Q7613440"]}, "date": "2013-11-11", "url": "http://komu.com/news/using-ethanol-to-fuel-missouri-s-economy-sparks-debate/#comments", "content": "Using Ethanol To Fuel Missouri's Economy Sparks Debate LADDONIA - Drivers could see new options at the gas pumps in 2014. Federal regulations require an increase in biofuels starting next year. Six ethanol plants in Missouri turn corn into fuel for your car. John Eggleston, a farmer in Northern Missouri, sells his corn to the POET Ethanol Plant in Macon. \"It helps in the economics of what we receive as far as income because ethanol does help the overall market,\" Eggleston said. \"Ethanol has made the producer able to raise more acres of corn as long as the increasing technology is there to make higher yields.\" <mark>Steve Murphy</mark>, manager of Laddonia's POET plant, says the Renewable Fuel Standard could bring more money into Missouri's economy. \"In Missouri, agriculture is the biggest industry so it can have a huge ripple effect,\" <mark>Murphy</mark> said. The Laddonia plant receives all of its corn from Missouri farmers and generated 180 million dollars of economic activity last year. \"In Audrain County and in other rural counties, that's a big economic engine for fertilizers, for seeds, for fuel for all of the supplies farmers need and we provide a local source for them to sell their product,\" <mark>Murphy</mark> said. \"We are a big consumer of gasoline and yeah, it's going to have a tremendous impact because of the volume of gasoline that we have to maintain every year,\" Eggleston said. Nearly all of the ethanol produced at Laddonia stays in state. Missouri currently mandates ten percent of ethanol in regular gasoline. E85, which contains 85% ethanol, is an option at some gas stations. Opponents of increasing ethanol use say it would increase food prices, because farmers are working to produce crops for gas tanks instead of grocery stores. \"There are several ways the effects of the Renewable Fuel Standard on a national market could affect Missouri in terms of the corn prices that farmers get, the prices for corn or the distillers grains that farmers or feed lots might pay,\" Wyatt Thompson, MU Professor at Food and Agricultural Policy Institute (FAPRI), said. Thompson says increasing ethanol use could affect the price of food, but it would be small. <mark>Murphy</mark> adds that the corn used to make ethanol is not a sweet corn that you would buy at the grocery store. It's corn used for animal feed, which the plant sells back to farmers. \"Beef poultry pork prices can be affected but the acres planted have caught up with the demand the ethanol industry has put in,\" <mark>Murphy</mark> said. AAA also released a statement warning buyers: \"AAA's automotive engineering experts believe that sustained use of E15 could result in costly problems such as accelerated engine wear and failure, fuel-system damage and false\" check engine \"lights in some cars. An overwhelming 95 percent of consumers surveyed by AAA were not familiar with E15, indicating a strong likelihood of consumer confusion leading to misfueling.\" Filling up with E15 also causes your car to get worse gas mileage. The Environmental Protection Agency approved the use of E15 for all cars newer than 2001. Thompson says it's unclear whether the economy can meet the demands E15 might bring. \"Given what was going on in the markets it seems like the mandates were running against the blend wall and it was becoming harder to mandate,\" Thompson said. The blend wall is the limit on the amount of ethanol that can be used beyond E10. Thompson's research on this issue is ongoing. \"The EPA gave a signal that it might reduce the mandates, which it has the authority to do in 2014, so there's been a lot of debate about what sorts of levels might be appropriate,\" Thompson said. The Missouri Department of Agriculture recently proposed a rule change to add an E15 fuel, a blend of 15% ethanol in gasoline. Lawmakers decided in an October hearing they would have to go through the legislative process to approve the rule change."}, {"articleID": "2019053120_00065484_W", "names": {"Kevin Cooper": ["Q1740103", "Q19877167", "Q58150295", "Q6396066", "Q6584008"], "Jerry Brown": ["Q152451", "Q717620"]}, "date": "2019-05-31", "url": "http://mobile.sfgate.com/entertainment/article/Kim-Kardashian-visited-San-Quentin-kevin-cooper-13912025.php", "content": "Kim Kardashian visited San Quentin's death row on Thursday Michelle Robertson, SFGATE | on May 31, 2019 In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. Photo: Valerie Macon, AFP/Getty Images Photo: Valerie Macon, AFP/Getty Images Image 1 of / 22 Close Image 1 of 22 In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. In this file photo taken on June 16, 2018 US TV personality Kim Kardashian attends the 2018 MTV Movie & TV awards, at the Barker Hangar in Santa Monica. Photo: Valerie Macon, AFP/Getty Images Kim Kardashian visited San Quentin's death row on Thursday 1 / 22 Back to Gallery Kim Kardashian West continued her prison reform crusade with a Thursday visit to San Quentin State Prison. Gossip site TMZ spotted West entering the prison Thursday, where she reportedly spent two hours chatting with death-row inmate <mark>Kevin Cooper</mark>. A spokesperson for the California prison system would not confirm West's visit with SFGATE for privacy reasons. <mark>Cooper</mark>, 61, was convicted of four murders in Chino Hills, Calif., in the 1980s and sent directly to death row. Since the conviction, <mark>Cooper</mark> has vehemently asserted his innocence and protested racism in the criminal justice system as well as the death penalty. In 2018, after widespread media coverage of <mark>Cooper</mark>'s case--some of which put forth the possibility that <mark>Cooper</mark> had been framed for the Chino Hills murders--Former Governor of California <mark>Jerry Brown</mark> ordered new DNA testing of the evidence. Governor Gavin Newsom, who has suspended state executions since taking office, expanded the order in February. The testing is ongoing. Related Stories Kim Kardashian West shares picture studying for law exam West, who is studying to become a lawyer at a San Francisco law firm, has been publicly involved with the <mark>Cooper</mark> case since last year. In June, she tweeted: \"Governor <mark>Brown</mark>, can you please test the DNA of <mark>Kevin Cooper</mark>?\" During her Thursday visit with <mark>Cooper</mark>, West \"spent 2 hours with him and is more convinced than ever he was framed,\" TMZ reported. Last year, she played a crucial role in the release of Alice Marie Johnson, a 63-year-old woman imprisoned since 1996 on nonviolent drug charges. West plans to take the bar in 2022 and began an apprenticeship at a law firm last summer. Michelle Robertson is an SFGATE producer. Email: michelle.robertson @ sfgate.com | Twitter: @ mrobertsonsf Michelle Robertson | Producer"}, {"articleID": "2018122802_00158377_W", "names": {"David Rudman": ["Q2469960", "Q5239285"], "Richard Hunt": ["Q54556031", "Q7323687", "Q7326608", "Q7326609", "Q7326613", "Q7326615"], "Jerry Nelson": ["Q1645447", "Q468028"], "Sonia Manzano": ["Q6132224", "Q7561732"], "Lisa Simon": ["Q16226405", "Q51026810"], "Jon Stone": ["Q18392764", "Q37839943"], "Jeff Moss": ["Q16116039", "Q6174569"], "John Weidman": ["Q57768392", "Q6263373"], "Christopher Cerf": ["Q41787905", "Q5112078"], "Tim Lester": ["Q2434130", "Q7803830"]}, "date": "2018-12-28", "url": "http://muppet.wikia.com/wiki/Season_19_(1987-1988)?diff=1133830&oldid=1126309", "content": "Revision as of 02:46, November 27, 2018 (view source) Aleal (wall | contribs) m ← Older edit Revision as of 02:08, December 28, 2018 (view source) FortheSesameFans (wall | contribs) Newer edit → Line 17: Line 17: * [[Episode 2357]] * [[Episode 2357]] * [[Episode 2358]]--<mark>David</mark> hires [[Gina]] to work at Hooper's * [[Episode 2358]]--<mark>David</mark> hires [[Gina]] to work at Hooper's + * [[Episode 2359]] + * [[Episode 2360]] + * [[Episode 2361]] * [[Episode 2362]]--The Count's suitcases * [[Episode 2362]]--The Count's suitcases * [[Episode 2363]]--[[Big Bird]] practices magic * [[Episode 2363]]--[[Big Bird]] practices magic + * [[Episode 2364]] * [[Episode 2365]]--[[Forgetful Jones]] joins the Birdketeers * [[Episode 2365]]--[[Forgetful Jones]] joins the Birdketeers * [[Episode 2366]]--Night time on Sesame Street (repeat) * [[Episode 2366]]--Night time on Sesame Street (repeat) * [[Episode 2367]]--Jiffy the turtle / Barkley the cow (repeat) * [[Episode 2367]]--Jiffy the turtle / Barkley the cow (repeat) + * [[Episode 2368]] + * [[Episode 2369]] + * [[Episode 2370]] + * [[Episode 2371]] + * [[Episode 2372]] + * [[Episode 2373]] + * [[Episode 2374]] * [[Episode 2375]]--Oscar writes poems (repeat) * [[Episode 2375]]--Oscar writes poems (repeat) * [[Episode 2376]]--A hot day on Sesame Street (repeat) * [[Episode 2376]]--A hot day on Sesame Street (repeat) + * [[Episode 2377]] + * [[Episode 2378]] + * [[Episode 2379]] + * [[Episode 2380]] + * [[Episode 2381]] + * [[Episode 2382]] + * [[Episode 2383]] * [[Episode 2384]] * [[Episode 2384]] * [[Episode 2385]]--Luis and Maria develop feelings for each other * [[Episode 2385]]--Luis and Maria develop feelings for each other * [[Episode 2386]] * [[Episode 2386]] + * [[Episode 2387]] + * [[Episode 2388]] + * [[Episode 2389]] + * [[Episode 2390]] + * [[Episode 2391]] + * [[Episode 2392]] * [[Episode 2393]] * [[Episode 2393]] * [[Episode 2394]]--[[Count von Count | The Count]] conducts Bob's band * [[Episode 2394]]--[[Count von Count | The Count]] conducts Bob's band * [[Episode 2395]]--[[Elmo]] plays with his new goldfish, Barkley * [[Episode 2395]]--[[Elmo]] plays with his new goldfish, Barkley * [[Episode 2396]]--Big Bird's day with keys * [[Episode 2396]]--Big Bird's day with keys + * [[Episode 2397]] * [[Episode 2398]]--Barkley's tricks * [[Episode 2398]]--Barkley's tricks * [[Episode 2399]]--Ronald Grump builds the Grump Tower * [[Episode 2399]]--Ronald Grump builds the Grump Tower Line 42: Line 67: * [[Episode 2407]]--The Count's paintings * [[Episode 2407]]--The Count's paintings * [[Episode 2408]] * [[Episode 2408]] + * [[Episode 2409]] * [[Episode 2410]]--Introducing Snuffy's sister Alice * [[Episode 2410]]--Introducing Snuffy's sister Alice * [[Episode 2411]]--Big Bird learns about love * [[Episode 2411]]--Big Bird learns about love * [[Episode 2412]]--Snuffy walks Barkley * [[Episode 2412]]--Snuffy walks Barkley + * [[Episode 2413]] * [[Episode 2414]]--Love in the [[Fix-It Shop]] * [[Episode 2414]]--Love in the [[Fix-It Shop]] * [[Episode 2415]]--Placido falls for Maria * [[Episode 2415]]--Placido falls for Maria − * [[Episode 2417]] + * [[Episode 2416]] + * [[Episode 2417]] + * [[Episode 2418]] * [[Episode 2419]] * [[Episode 2419]] + * [[Episode 2420]] + * [[Episode 2421]] * [[Episode 2422]]--Señor Zero strikes again! * [[Episode 2422]]--Señor Zero strikes again! * [[Episode 2423]]--Bob plays [[Name That Sound]] / The Count watches the Fix-It Shop * [[Episode 2423]]--Bob plays [[Name That Sound]] / The Count watches the Fix-It Shop * [[Episode 2424]]--Big Bird learns about sadness * [[Episode 2424]]--Big Bird learns about sadness * [[Episode 2425]] * [[Episode 2425]] + * [[Episode 2426]] + * [[Episode 2427]] + * [[Episode 2428]] * [[Episode 2429]] * [[Episode 2429]] + * [[Episode 2430]] * [[Episode 2431]]--Big Bird's gift for Luis / Elmo watches for stars * [[Episode 2431]]--Big Bird's gift for Luis / Elmo watches for stars * [[Episode 2432]] * [[Episode 2432]] + * [[Episode 2433]] + * [[Episode 2434]] + * [[Episode 2435]] + * [[Episode 2436]] + * [[Episode 2437]] * [[Episode 2438]] * [[Episode 2438]] + * [[Episode 2439]] * [[Episode 2440]]--The Count gives up counting * [[Episode 2440]]--The Count gives up counting + * [[Episode 2441]] + * [[Episode 2442]] * [[Episode 2443]]--Rooftop sing along (repeat) * [[Episode 2443]]--Rooftop sing along (repeat) + * [[Episode 2444]] + * [[Episode 2445]] + * [[Episode 2446]] * [[Episode 2447]]--Lovebirds at Birdland * [[Episode 2447]]--Lovebirds at Birdland * [[Episode 2448]]--Snuffy's store, etc.. * [[Episode 2448]]--Snuffy's store, etc.. * [[Episode 2449]]--Big Bird and Snuffy send a letter * [[Episode 2449]]--Big Bird and Snuffy send a letter * [[Episode 2450]]--Telly's magic pencil * [[Episode 2450]]--Telly's magic pencil + * [[Episode 2451]] + * [[Episode 2452]] * [[Episode 2453]]--Making rhythms with the Honker and Dinger * [[Episode 2453]]--Making rhythms with the Honker and Dinger * [[Episode 2454]] * [[Episode 2454]] * [[Episode 2455]]--Maria and Luis decide to get married * [[Episode 2455]]--Maria and Luis decide to get married * [[Episode 2456]]--Natasha joins clubs * [[Episode 2456]]--Natasha joins clubs + * [[Episode 2457]] * [[Episode 2458]]--Big Bird listens * [[Episode 2458]]--Big Bird listens * [[Episode 2459]]--Hiroshi visits from Japan * [[Episode 2459]]--Hiroshi visits from Japan * [[Episode 2460]]--Big Bird and Snuffy play games / Elmo sleeps over * [[Episode 2460]]--Big Bird and Snuffy play games / Elmo sleeps over + * [[Episode 2461]] + * [[Episode 2462]] + * [[Episode 2463]] + * [[Episode 2464]] + * [[Episode 2465]] + * [[Episode 2466]] + * [[Episode 2467]] + * [[Episode 2468]] + * [[Episode 2469]] + * [[Episode 2470]] + * [[Episode 2471]] + * [[Episode 2472]] + * [[Episode 2473]] * [[Episode 2474]] * [[Episode 2474]] * [[Episode 2475]] * [[Episode 2475]] Revision as of 02:08, December 28, 2018 Sesame Street Premiere November 16, 1987 (2356) Finale May 13, 1988 (2485) Episodes 130 Said Oscar of Maria's wedding, \"Yes, I was there--I threw some of the rice. But they weren't too happy because I had cooked it first.\" [1] \"African Alphabet\" \"Bert's Blanket\" Jay Leno plays a challenging game with Big Bird. Spaceship Surprise, a Star Trek - inspired science-fiction series. \"Don't Sing This Song\" Sesame Street Season 19 aired from November 16, 1987 to May 13, 1988. Contents [show] Episodes Episodes 2356 - 2485 (130 episodes) Episode 2356--19th season premiere; Gordon brings Elmo and Miles to the zoo Episode 2357 Episode 2358--<mark>David</mark> hires Gina to work at Hooper's Episode 2359 Episode 2360 Episode 2361 Episode 2362--The Count's suitcases Episode 2363--Big Bird practices magic Episode 2364 Episode 2365--Forgetful Jones joins the Birdketeers Episode 2366--Night time on Sesame Street (repeat) Episode 2367--Jiffy the turtle / Barkley the cow (repeat) Episode 2368 Episode 2369 Episode 2370 Episode 2371 Episode 2372 Episode 2373 Episode 2374 Episode 2375--Oscar writes poems (repeat) Episode 2376--A hot day on Sesame Street (repeat) Episode 2377 Episode 2378 Episode 2379 Episode 2380 Episode 2381 Episode 2382 Episode 2383 Episode 2384 Episode 2385--Luis and Maria develop feelings for each other Episode 2386 Episode 2387 Episode 2388 Episode 2389 Episode 2390 Episode 2391 Episode 2392 Episode 2393 Episode 2394--The Count conducts Bob's band Episode 2395--Elmo plays with his new goldfish, Barkley Episode 2396--Big Bird's day with keys Episode 2397 Episode 2398--Barkley's tricks Episode 2399--Ronald Grump builds the Grump Tower Episode 2400 Episode 2401--Big Bird's Happy Meter Episode 2402--Maria can't get Irvine to go back to sleep Episode 2403--Planet Zingo Episode 2404--Maria and Luis realize they're in love Episode 2405--Maria and Luis love each other Episode 2406--Oscar's School for Worms Episode 2407--The Count's paintings Episode 2408 Episode 2409 Episode 2410--Introducing Snuffy's sister Alice Episode 2411--Big Bird learns about love Episode 2412--Snuffy walks Barkley Episode 2413 Episode 2414--Love in the Fix-It Shop Episode 2415--Placido falls for Maria Episode 2416 Episode 2417 Episode 2418 Episode 2419 Episode 2420 Episode 2421 Episode 2422--Señor Zero strikes again! Episode 2423--Bob plays Name That Sound / The Count watches the Fix-It Shop Episode 2424--Big Bird learns about sadness Episode 2425 Episode 2426 Episode 2427 Episode 2428 Episode 2429 Episode 2430 Episode 2431--Big Bird's gift for Luis / Elmo watches for stars Episode 2432 Episode 2433 Episode 2434 Episode 2435 Episode 2436 Episode 2437 Episode 2438 Episode 2439 Episode 2440--The Count gives up counting Episode 2441 Episode 2442 Episode 2443--Rooftop sing along (repeat) Episode 2444 Episode 2445 Episode 2446 Episode 2447--Lovebirds at Birdland Episode 2448--Snuffy's store, etc.. Episode 2449--Big Bird and Snuffy send a letter Episode 2450--Telly's magic pencil Episode 2451 Episode 2452 Episode 2453--Making rhythms with the Honker and Dinger Episode 2454 Episode 2455--Maria and Luis decide to get married Episode 2456--Natasha joins clubs Episode 2457 Episode 2458--Big Bird listens Episode 2459--Hiroshi visits from Japan Episode 2460--Big Bird and Snuffy play games / Elmo sleeps over Episode 2461 Episode 2462 Episode 2463 Episode 2464 Episode 2465 Episode 2466 Episode 2467 Episode 2468 Episode 2469 Episode 2470 Episode 2471 Episode 2472 Episode 2473 Episode 2474 Episode 2475 Episode 2476--Shelly the Turtle and Gordon race Episode 2477--Telly and Alice practice saying hello and goodbye Episode 2478 Episode 2479 Episode 2480 Episode 2481--Don Music's song of \"AMOR\" Episode 2482--The Big Zero Game Episode 2483--Maria and Luis hold a pre-wedding party for Maria's mother and Luis' uncle Episode 2484--Maria and Luis prepare for their wedding Episode 2485--19th season finale; Maria and Luis get married Notes This was Alaina Reed's final season as Olivia. This is also the final seasons where the number sponsors only go from 2 through 12. Cast Muppet Characters Alice Snuffleupagus, The Amazing Mumford, Anything Muppets, Baby Natasha, Barkley, Bert, Big Bird, Buster the Horse, Cookie Monster, Count von Count, Elmo, Ernie, Gladys the Cow, Grover, Grundgetta, Herry Monster, Mr. Honker, Honkers, Hoots the Owl, Juliet, Kermit the Frog, The Martians, Meryl Sheep, Dr. Nobel Price, the Oinker Sisters, Oscar the Grouch, Ruby, Mr. Snuffleupagus, Telly Monster, Two-Headed Monster Other Characters Gordon, Susan, Maria, Luis, Linda, Bob, <mark>David</mark>, Uncle Wally, Olivia, Gina, Miles, Mr. Macintosh Muppets of Sesame Street Caroll Spinney, Pam Arciero, Camille Bonora, Kevin Clash, Fred Garbo, Jim Henson, <mark>Richard Hunt</mark>, <mark>Jerry Nelson</mark>, Frank Oz, Martin P. Robinson, <mark>David Rudman</mark>, Judy Sladky, Bryant Young Actors Alison Bartlett-O'Reilly, Linda Bove, Northern Calloway, Emilio Delgado, Loretta Long, <mark>Sonia Manzano</mark>, Bill McCutcheon, Bob McGrath, Roscoe Orman, Miles Orman, Alaina Reed Guest Stars José Ferrer, Keith Hernandez, Pee-Wee Herman, Lillian Hurst, Jay Leno, Mookie Wilson Credits Executive Producer: Dulcy Singer Producer: <mark>Lisa Simon</mark> Director: <mark>Jon Stone</mark>, Emily Squires Head Writer: Norman Stiles Writers: Nancy Sans, Luis Santeiro, Cathi Rosenberg-Turow, Belinda Ward, <mark>Sonia Manzano</mark>, <mark>Jeff Moss</mark>, Sara Compton, Judy Freudberg, <mark>David</mark> Korr, <mark>John Weidman</mark>, Tony Geiss, Emily Perl Kingsley, Mark Saltzman, Jocelyn Stevenson, Christian Clark, Tom Dunsmuir, <mark>Jon Stone</mark> Supervising Film Producer: Edith Zornow Coordinating Producer: Arlene Sherman Muppets by: Kermit Love, Caroly Wilcox, Connie Peterson, Peter MacKennan, Stephen Rotondaro, Mark Zeszotek, Jitka Exler, <mark>Richard</mark> Termine Music Director: Joe Raposo Special Songs: Joe Raposo, <mark>Jeff Moss</mark>, <mark>Christopher Cerf</mark>, Cheryl Hardwick Associate Music Director: Dave Conner Music Coordinator: Danny Epstein Production Supervisor: Frieda Lipp Editing Supervisor: Robert J. Emerick Associate Directors: Ted May, Diane P. Mitchell, Eulogio Ortiz, Jr.. Production Designer: Victor DiNapoli Costume Designer: Bill Kellard Graphic Artist: Mike Pantuso Set Decorator: Nat Mongioi Production Stage Manager: Chet O'Brien Stage Manager: Mortimer J. O'Brien Curriculum Coordinator: Diane P. Mitchell Production Assistants: Cheryl Ann Jung, Ruthie E. Hiatt, Carol D. Mayes, Rudy Vallecillo Assistant to the Producers: Danette DeSena Script Coordinator: Thelma Moses Children's Casting: Martha O'Connor, Gabrielle Howard Unit Manager: Eleanor McIntosh Technical Director: Ralph Mensch Lighting Director: Dick Weiss Sound Effects: Dick Maitland Audio: Blake Norton, <mark>Tim Lester</mark> Cameras: Frank Biondo, Dave Driscoll Videotape Editor: Evamarie Keller Make-Up: Lee Halls Hair Stylist: Karen Specht Wardrobe: Grisha Mynova Vice President for Research: Keith W. Mielke, Ph.D.. Director of Research: Valeria Lovelace, Ph.D.. Curriculum Specialist: Margarita Perez Chairman, Board of Advisors: Gerald S. Lesser, Ph.D.. Vice Presidents for Production: <mark>David</mark> D. Connell, Al Hyslop Facilities by Unitel Video, Inc.. Sources ↑ \"The Reflections of Oscar the Grouch\" , Oscar the Grouch, Guest editor, November 5, 2009. Life Magazine. Previous season: Next season: Season 18 (1986-1987) Season 20 (1988-1989) Retrieved from \"http: //muppet.wikia.com/wiki/Season_19_ (1987-1988)? oldid = 1133830\" Categories: Sesame Street Seasons"}, {"articleID": "2008121000_00006123_W", "names": {"Greg Byrne": ["Q3116191", "Q57633545"], "Kevin Wilson": ["Q19665226", "Q55362441", "Q57440043", "Q6397778", "Q6397779", "Q6397780"], "Ellis Johnson": ["Q5365917", "Q5365919"], "Chris Petersen": ["Q5107742", "Q5107743", "Q5107744", "Q5107747"]}, "date": "2008-12-10", "url": "http://djbulldogs.wordpress.com/?p=2109", "content": "your source for bulldog sports talk <mark>greg byrne</mark>: secret agent man by brad locke <mark>greg byrne</mark> for his mastery of covert ops during this coach search. dude must have navy seal training or something. from what i've gathered, he's either a) kept the big-shot boosters completely in the dark, or b) he's found a way to keep them quiet. people say boosters hire coaches, but i'm not so sure in this case. i tried calling <mark>byrne</mark> this morning to gauge his reaction to sylvester croom's recent public comments, and then i texted him a few minutes ago. he said on the day croom resigned that he would not speak to the media about the search until a coach was hired, and i guess he's through talking about croom. speaking of croom, in light of the revelation that there was going to be a change at offensive coordinator, i do wonder what else, if anything, <mark>byrne</mark> wanted croom to change. maybe croom could elaborate, but that would require returning my call. but i digress. <mark>byrne</mark> can't keep everyone quiet. as i and/or others have already noted, he was in kansas city over the weekend - ostensibly to see oklahoma offensive coordinator <mark>kevin wilson</mark>, and perhaps others - and florida offensive coordinator dan mullen has possibly been in touch with msu. and south carolina defensive coordinator <mark>ellis johnson</mark>, formerly of msu, has expressed interest in the position but has had no formal discussions with state. we don't know what the heck is up with boise state's <mark>chris petersen</mark>. we don't know much at all, do we? i can't wait until <mark>byrne</mark> announces a new hire - and that's another thing, will anyone break the story before he does? - so that we can ask him how he pulled this off. possibly related posts: (automatically generated) this entry was posted on december 9, 2008 at 4:26 pm and is filed under football. you can follow any responses to this entry through the 7 responses to \"<mark>greg byrne</mark>: secret agent man\" december 9, 2008 at 4:32 pm <mark>greg byrne</mark> doesn't breath air, air breaths <mark>greg byrne</mark>! december 9, 2008 at 4:40 pm caoch peterson was on the blog today. ask him what's up. december 9, 2008 at 5:42 pm brad - is that your goal to break the news before <mark>greg</mark> does? on croom statements - guess oc change was not good enuff - al borges good canidate for oc. feel <mark>greg</mark> has was he wants in mind for msu - croom and his staff not in the picture, if he is out west recruiting - he said he wanted someone to \"open it up\" at state."}, {"articleID": "2010032316_00185647_W", "names": {"Brandon Marshall": ["Q3643713", "Q898156"], "Marcus Thomas": ["Q14950371", "Q30122071", "Q6758481", "Q6758482"]}, "date": "2010-03-23", "url": "http://neighbors.denverpost.com/viewtopic.php?p=1353922#p1353922", "content": "sickandtired wrote: believing what mcdaniels says makes as much sense as believing what a president says. none. glad to get your political views on the broncos blog...why don't you move over to the editorial blog - probably a true rhino over there! key word here is \"a\" . a president does not mean one side or the other. it means all of them. another angle is president of what? maybe the attack dog club. or the blind loyalists committee? i'm not the biggest fan of the new england style communication with the media, but in this case i'm not all that upset. every single suggestion that it's simply a matter of time until brady supplants orton is predicated on this kid doing what he has yet to do in the nfl. he's not some amazing freak of nature that just needs to glance at the playbook. he's been overrated his whole career, throws just as shaky a deep ball as orton, and has played in a \"variant\" of this system, but not this system. he's a cast off from cleveland. period. quinn will be a good backup. if he evolves to be some amazing starter and helps us win games, well then glory be! but right now, he's just a dude who has not lived up to the hype. there are plenty of better stories this offseason. like some of the other readers here, i am really excited to see what martindale can do with the defense. i'm likining what i'm seeing, and would love to see us develop depth at the d-line where we have traditionally ran thin. if we settle for anything less than a first rounder for <mark>marshall</mark>, it better be a haul. the state of the broncos today can be summed up like this: somehow it is \"exciting\" for some that there might be a quarterback competition between two has beens who never were, kyle orton and brady quinn. virtually everywhere else in the nfl save perhaps oakland you would be laughed at if given these two choices. lets put this in perspective, if rex grossman can beat out kyle orton, why couldnt quinn? heres a quote from josh last march. \"he's our quarterback and - and - we will always do what's in the best interests of our football team,\" mcdaniels said. \"but we're committed to him, and i'm looking forward to him being back. and as long as that's the case and we're both committed to each other, then he'll absolutely be our quarterback in the opener.\" missingnyc wrote: i don't understand what's with mcdaniels unwavering support for orton...he's just an average qb, he's no peyton manning. mcd is slobbering and gushing all over orton because he knows he has to try and justify getting rid of cutler. the only way to do that is for orton to lead us where cutler couldnt. and of course orton couldnt do that last year with a 6-0 start and 3 game division lead. geez, when will you and mojo, trees and the rest of the whiners stop crying over the jaybaby? this is a dumb-as-a-post, lazy hump who hasn't had a winning season at any level since he was in high school nine years ago! kirk101 wrote: i rarely write in. mainly because about 800 of you guys chime in to bash the broncos. i'm so tired of the pessimism. if you guys don't like the moves coach has made on the defensive front, maybe you should take a look at how much <mark>marcus thomas</mark> has improved. remember? should of been a top 5 pick. being a physical football team is exactly what this town needs. when we start busting people in the mouth, you guys better start changing your tune. or better yet. shut up. now i see why you don't write in much...you don't say anything when you do. i'm so tired of your pessimism towards the 800 guys that chime in. wahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh lets hear your thoughts on the broncos moves instead of what everyone else thinks about them. lax65 wrote: missingnyc wrote: i don't understand what's with mcdaniels unwavering support for orton...he's just an average qb, he's no peyton manning. mcd is slobbering and gushing all over orton because he knows he has to try and justify getting rid of cutler. the only way to do that is for orton to lead us where cutler couldnt. and of course orton couldnt do that last year with a 6-0 start and 3 game division lead. geez, when will you and mojo, trees and the rest of the this is a dumb-as-a-post, lazy hump who hasn't had a winning season at any level since he was in high school nine years ago! superfan wrote: this has clearly been the plan since orton was first brought in. if he makes significant strides this year and runs the offense effectively, he will be given a contract extension and will continue to start for the broncos in 2011 and beyond. if he doesn't, which is a distinct possibility, then he will be gone next year and quinn will be given a shot to start. it is highly unlikely that quinn will start on opening day, and probably will not start at all this season, barring injury or severe regression by orton. does throwing a couple pick six's in a game that cost us the playoffs count as regression? or is that just another qb making costly mistakes in the red zone when it matters? the perspiring minds want to know if this is a cringing milksop like progression towards that regression. jk80906 wrote: geez, when will you and mojo, trees and the rest of the whiners stop crying over the jaybaby? this is a dumb-as-a-post, lazy hump who hasn't had a winning season at any level since he was in high school nine years ago! get over it, you pathetic, cringing milksops! jk always adds a lot to the discussion with his name calling. in jay's senior year vanderbilt was 5-6 but jay was named the sec offensive player of the year. the following from the vandy website might add some context to \"his\" losing season: \"cutler's impact on vanderbilt's 5-6 campaign was greatest in outcomes in doubt. in the commodores' first two games--road encounters at wake forest and arkansas--cutler guided vanderbilt to come-from-behind victories with last-minute touchdown drives. in the season finale at knoxville, cutler again led a winning fourth-quarter rally, capping a late drive with a touchdown pass to bennett giving the commodores their first victory over tennessee in two decades. cutler's importance to the commodores was clear in narrow vanderbilt losses. with a 4-0 record on the line versus mtsu, cutler guided the commodores 80 yards for a last-second field goal that would have provided the winning margin, only to have the attempt blocked. in two late-season road games, south carolina and florida, cutler directed two-touchdown, fourth quarter comebacks to give the commodores a chance to win. in the home finale versus kentucky, cutler threw for four second half touchdowns to narrow a 31-point deficit to five points. superfan wrote: this has clearly been the plan since orton was first brought in. if he makes significant strides this year and runs the offense effectively, he will be given a contract extension and will continue to start for the broncos in 2011 and beyond. if he doesn't, which is a distinct possibility, then he will be gone next year and quinn will be given a shot to start. it is highly unlikely that quinn will start on opening day, and probably will not start at all this season, barring injury or severe regression by orton. it comes down to what the definition of\" significant strides \"means. he's gotta make more plays. he's gotta look off the safety and throw the ball to the other side of the field. he's gotta hit guys in stride. he's gotta at least show he's got the stones to take a shot downfield to open up the short game and the running game. he's gotta stop going down when an engaged d-lineman puts a hand on him. he's gotta slide in the pocket. he's gotta relax in the pocket so the game slows down and he can make the right reads. he's gotta do a better job of converting on 3rd down (22nd in the league last year at 36.3% is terrible) to keep the chains moving and keep our defense rested. if he can make those\" significant strides \", then this team will be a good team, give him a big contract and i'll buy both my kids a kyle orton jersey. if you were wondering...in 2008, the denver broncos offense was 3rd in the league with a 47.5 3rd down efficiency (indy was 1st, new orleans was 2nd)... but i'm sure some mcd apologist will find a way to spin a drop of 11% and 19 places in the league as a sign the offense is getting better. why aren't these the things being reported in the dp instead of butt kissing hero worship to mcd and the front office? jk80906 wrote: geez, when will you and mojo, trees and the rest of the whiners stop crying over the jaybaby? this is a dumb-as-a-post, lazy hump who hasn't had a winning season at any level since he was in high school nine years ago! get over it, you pathetic, cringing milksops! jk always adds a lot to the discussion with his name calling. in jay's senior year vanderbilt was 5-6 but jay was named the sec offensive player of the year. the following from the vandy website might add some context to\" his \"losing season:\" cutler's impact on vanderbilt's 5-6 campaign was greatest in outcomes in doubt. in the commodores' first two games--road encounters at wake forest and arkansas--cutler guided vanderbilt to come-from-behind victories with last-minute touchdown drives. in the season finale at knoxville, cutler again led a winning fourth-quarter rally, capping a late drive with a touchdown pass to bennett giving the commodores their first victory over tennessee in two decades. cutler's importance to the commodores was clear in narrow vanderbilt losses. with a 4-0 record on the line versus mtsu, cutler guided the commodores 80 yards for a last-second field goal that would have provided the winning margin, only to have the attempt blocked. in two late-season road games, south carolina and florida, cutler directed two-touchdown, fourth quarter comebacks to give the commodores a chance to win. in the home finale versus kentucky, cutler threw for four second half touchdowns to narrow a 31-point deficit to five points. cutler ended the season with a superb four-game stretch against south carolina, florida, kentucky and tennessee, averaging 352 passing yards while throwing for 13 touchdowns. \"superfan wrote: this has clearly been the plan since orton was first brought in. if he makes significant strides this year and runs the offense effectively, he will be given a contract extension and will continue to start for the broncos in 2011 and beyond. if he doesn't, which is a distinct possibility, then he will be gone next year and quinn will be given a shot to start. it is highly unlikely that quinn will start on opening day, and probably will not start at all this season, barring injury or severe regression by orton. it comes down to what the definition of\" significant strides \"means. he's gotta make more plays. he's gotta look off the safety and throw the ball to the other side of the field. he's gotta hit guys in stride. he's gotta at least show he's got the stones to take a shot downfield to open up the short game and the running game. he's gotta stop going down when an engaged d-lineman puts a hand on him. he's gotta slide in the pocket. he's gotta relax in the pocket so the game slows down and he can make the right reads. he's gotta do a better job of converting on 3rd down (22nd in the league last year at 36.3% is terrible) to keep the chains moving and keep our defense rested. if he can make those\" significant strides \", then this team will be a good team, give him a big contract and i'll buy both my kids a kyle orton jersey. but if\" signifcant strides \"is just some vague, unspecified term that can't be quantified except by people who will always have orton and mcd's back then no...let quinn or tater play. i couldn't agree more. i don't think we can quantify significant strides, though. ultimately that analysis is going to be subjective, and the coaching staff is going to be the one making the decision. unfortunately, nobody calls to ask my opinion on these matters. in all seriousness, though, hopefully those\" strides \"are significant enough for even the most adamant doubters to recognize. if he improves in half of the areas you mentioned, i would think that something like 10-6 and perhaps even a playoff win could be in the cards. let the ridicule begin. my skin is feeling extra thick today.\" yep. no question, \"broncos coach josh mcdaniels said here monday at the nfl meetings.\" he's earned it. he's a guy who made the most of an opportunity he was given last year. it's really hard to say whether or not mcdaniels' public praise of orton is genuine or not. listening to troy aikman during the dallas/denver game last year, orton is a fantastic practice player...makes all the throws, makes all the right reads, good rhythm. but that is not translating to game day. it makes a big difference when a 260 pound man with 4.6 speed is running at you with intent to do great bodily harm...and you've got to stand there, make your reads and make an accurate throw right before that animal turns you into a tackling dummy. the last thing a head coach wants to do is bury his starting qb verbally in the media (although apparently it's okay to do it to your 2 time pro bowl wr) even if he doesn't believe his qb is great. last year, i was clamoring for son of simms to get some snaps. when he did, i was clamoring for them to put orton back in...there was no competition at the qb position because son of simms was zero competition and tater was a puppy. but i've gotta believe that deep down, mcd knows orton is not gonna go moses for bronco nation and lead us to the promise land. however, that's the option he's looking at right now and the last thing he wants to do is destroy the confidence of a guy who, let's be honest, doesn't exude the swagger of an upper echelon nfl qb but if he improves in a lot of areas can allow our playmakers (royal, <mark>marshall</mark>, stokley, um...gaffney?) to make plays. \"yep. no question,\" broncos coach josh mcdaniels said here monday at the nfl meetings. \"he's earned it. he's a guy who made the most of an opportunity he was given last year. the kiss of death, orton as fredo corleone for sure. haha! thats great bro...orton as fredo...\"{quoted text} i couldn't agree more. i don't think we can quantify significant strides, though. ultimately that analysis is going to be subjective, and the coaching staff is going to be the one making the decision. unfortunately, no...\"jared t 51 minutes ago\" i don't care who starts, orton or quinn, if the broncos front office don't start looking at signing <mark>brandon marshall</mark> and find a way to keep and fit scheffler in the game plan royal, gaffney, mckinnely or llyoyd won't help either qb's become very succ...\"brian b 52 minutes ago\" {quoted text} the 49ers just won when they got to the big game under walsh mt. i get what you are saying about montana but his teams were great at so many positions. the 9ers were stocked from top to bottom with great defenders, wrs,...\"todd os 55 minutes ago\" {quoted text} i can't wait for the day when bowlen tells him, \"you'll get nothing and like it!\" \""}, {"articleID": "2019053112_00075369_W", "names": {"Tom Lehman": ["Q26922239", "Q949710"], "Vijay Singh": ["Q16122677", "Q21170857", "Q24005696", "Q331942", "Q3558246", "Q58483984", "Q58484934", "Q7929210"]}, "date": "2019-05-30", "url": "https://www.kansascity.com/sports/article230993738.html?src=rss", "content": "Scott McCarron watches his tee shot on the first hole during the final round of the Senior PGA Championship golf tournament, Sunday, May 26, 2019, in Rochester, N.Y. Adrian Kraus AP Photo DES MOINES, Iowa <mark>Tom Lehman</mark> won the PGA Tour Champions event in Iowa last year without swinging a club on Sunday. <mark>Lehman</mark> will look for a measure of vindication this weekend at Wakonda Club in Des Moines after finding out he'd won in 2018 while waiting out a weather delay in a local mall. <mark>Lehman</mark> shot a 13-under 131 total last year in Iowa, two shots better than Bernhard Langer, before the final round was canceled because of thunderstorms. \"Everyone loves to win. There's no doubt about it, so I'd never trade in a victory for any reason,\" <mark>Lehman</mark> said. \"However, it's a hollow ending for everybody ....I think part of the deal with golf is to sleep on the lead and then go out and win it.\" <mark>Lehman</mark> will likely be in the mix to at least prove that last year's two-round victory wasn't a fluke though. He has never finished worse than eighth at Wakonda, including a tie for fifth two years ago. Unlimited Digital Access: Only $0.99 For Your First Month Get full access to The Kansas City Star content across all your devices. SAVE NOW <mark>Lehman</mark> won the season opener in Hawaii in January and is eighth on the money list. \"I think it plays to my strengths,\" <mark>Lehman</mark> said of Wakonda, a 97-year-old course tucked into downtown Des Moines that ranked as the fourth-easiest on the senior circuit a year ago. \"It's a tricky golf course. You have to keep it in play.\" No one might do that better this weekend than circuit leader Scott McCarron. He has two wins and over $1.3 million in earnings so far this season--nearly $500,000 more than last week's Senior PGA Championship winner, Ken Tanigawa--and scored his first senior win in Iowa in 2016. McCarron has won nine more times since then. He has also finished in the top 10 in seven tournaments in 2019. McCarron and Tanigawa, who rallied from three shots down to beat McCarron by one stroke last weekend, will play together again Friday in the opening round. They will be joined by 2017 Iowa winner Brandt Jobe. All three went to UCLA and have remained close friends. \"Having the lead right now really doesn't mean too much,\" McCarron said. \"But I can keep increasing that lead, and that's what I'm trying to do. I want to go into the playoffs with a big enough lead that I can secure this thing up.\" Langer, who entered the week ranked third on the money list, withdrew Thursday to attend the funeral of his son's father-in-law. Langer always seemed to struggle at Wakonda, but he'd begun to turn it around in recent seasons. He was fourth in 2017 and finished tied for second a year ago. <mark>Vijay Singh</mark> (back) also withdrew from the field. Comments"}, {"articleID": "2010120602_00045648_W", "names": {"Tom O'Brien": ["Q7817071", "Q7817073", "Q7817074", "Q9359097"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"]}, "date": "2010-12-06", "url": "http://sportsday.typepad.com/sportsday/2010/12/champs-sports-bowl-west-virginia-and-nc-state-to-square-off.html", "content": "college football: fsu will make its first appearance in atlanta bowl since 1983 college football: site for new college football hall of fame selected jax sports news: ju men win sixth straight with 71-56 victory over fgcu capital one bowl: michigan state and alabama invited to capital one bowl? champs sports bowl: west virginia and nc state to square off on behalf of its selection committee, florida citrus sports' chairman chuck beverly and ceo steve hogan announced today that the nc state wolfpack and west virginia mountaineers have been selected to play in this year's champs sports bowl, the first matchup in the current agreement matching top teams from the acc and big east. set to take place december 28th from orlando's citrus bowl stadium, the game will kick off at 6:30 p.m. and be televised on espn. the no. 22/21 mountaineers clinched at least a share of its fifth conference title since 2003 and just missed a bcs appearance when connecticut made a last-second field goal last night. wvu (9-3, 5-2 big east) hits the postseason riding a four-game win streak and boasting one of the nation's top defenses. the mountaineers rank in the top 10 nationally in five team categories, most notably scoring defense (2nd, 12.8 ppg) and total defense (3rd, 251.3). standout pass-rushers julian miller (8.0) and transfer bruce irvin (12.0) will also make it difficult on any opposing offense as they alone have accounted for 20 sacks this year. nc state heads to the city beautiful for the first time since a philip rivers-led wolfpack defeated kansas in the 2003 mazda tangerine bowl. the wolfpack (8-4, 5-3 acc) saw a resurgence in 2010 under head coach <mark>tom o'brien</mark>, posting their most wins since 2003 and just one shy of the second-best record in school history. ncsu brings one of the nation's top passing offense (19th, 281.7 ypg) and stingiest run defenses (12th, 113.0) to orlando, as well as a fan base which set a school record for attendance in 2010. junior qb <mark>russell wilson</mark> will enter the game 11th nationally and tops in the acc with an average of 306.8 yards of offense per game. \"both nc state and west virginia have enjoyed very successful seasons and we are already seeing a lot of excitement for this game in orlando,\" said selection committee chairman chuck beverly. \"it's going to be fun watching one of the nation's best offenses face one of the best defenses.\" the mountaineers and wolfpack have squared off nine times in their history, but this will be the first meeting in 22 years. the two schools last met in 1979 with wvu holding a slight edge in the all-time series at 5-4. the two schools have met twice in the postseason (1972 and 1975 peach bowls), splitting the pair of meetings."}, {"articleID": "2018043011_00219254_W", "names": {"Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}, "date": "2018-04-30", "url": "http://www.koimoi.com/box-office/avengers-infinity-war-is-one-of-the-highest-weekend-grossers-of-all-time-in-india-see-where-it-stands/", "content": "Box Office Trending tweet Marvel Studio's Avengers: Infinity War has created a storm at every box office in the world. Smashing records left and right without even breaking a sweat, the film has managed create new milestones for Hollywood films in India as well. After the crown for the highest opening day collection of 2018 with 31.30 crores, the film has also successfully become the second highest weekend grosser of 2018 at 94.30 crores, after Padmaavat's whooping 114.00 crores (Extended weekend). But that is not all. The superhero flick has also managed to become one of the highest weekend grossers of all time in India, a feat not yet achieved by any other Hollywood film. Avengers: Infinity War Is One Of The Highest Weekend Grossers Of All Time In India; See Where It Stands! Avengers: Infinity War currently ranks 14th on the list, with a close competition between it and Hrithik Roshan starrer Bang Bang, which now stand 15th at 94.13 crores. However, the Marvel film didn't manage to surpass the Khans' films like PK, Jab Tak Hai Jaan, Chennai Express and Bajrangi Bhaijaan. Still, the film has made history, achieving such numbers even though it had a much lower screen count compared to the others on the list. Trending Akshay Kumar Rustom Uniform Controversy: \"It's A Crime To Sell Uniform,\" Says GD Bakshi WATCH: Ranveer Singh Looks Like A Splitting Image Of Queen's Freddie Mercury! Here's the complete list of the top 15 highest weekend grossers in India: Sultan - 180.36 cores Prem Ratan Dhan Payo - 129.77 crores Baahubali 2 - 128 crores Ek Tha Tiger - 116.05 crores Tiger Zinda Hai - 1 14.93 crores Padmaavat - 114.00 crores Happy New Year - 108.86 crores Dhoom 3 - 107.00 crores Dangal - 106.95 crores Bajrangi Bhaijaan - 102.60 crores Chennai Express - 100.35 crores Jab Tak Hai Jaan - 98 crores PK - 95.21 crores Avengers: Infinity War - 94.30 crores Bang Bang - 94.13 crores The first week collections of Avengers: Infinity War will be a clear indicator of where the film stands. Since it is not facing any competition from other films at the India Box office, it should make the most of it. Also the film is receiving a lot of positive word of mouth, which will help the film's collections in the weeks to come. RELATED ARTICLES BOLLYWOOD NEWS Dadasaheb Phalke Film Foundation Awards 2018: Farida Jalal, Akshay Kumar & Manisha Koirala Shine Bright! Anil Kapoor: <mark>Salman Khan</mark> Has Done Things Wholeheartedly In Race 3! WATCH: Ranveer Singh Looks Like A Splitting Image Of Queen's Freddie Mercury! Check This Out When Deepika Padukone Turned \"Desi Girl' At TIME 100 Gala Ranbir Kapoor On His Own Biopic:\" Don't Think My Life Is...Naseeruddin Shah Feels More Rape Cases Being Reported Is A Good...Sanju Teaser: The Widest Viewed, Most Searched & Most Talked About! Aanand L. Rai's Unconventional Love Story Meri Nimmo Sees A Major...Will <mark>Salman Khan</mark> Repeat The Biwi No. 1 Magic With Bharat...LEAVE A REPLY Cancel reply Please enter your comment! Please enter your name here You have entered an incorrect email address! Please enter your email address here Box Office Verdict 2018 Avengers: Infinity War 94.30 Cr October 42.50 Cr Rampage 26.50 Cr Blackmail 19.11 Cr Baaghi 2 155.65 Cr Top 10 Bollywood Movies 2018 Padmaavat 300.26 Cr Baaghi 2 155.65 Cr Sonu Ke Titu Ki Sweety 108.71 Cr Raid 101.54 Cr PadMan 78.95 Cr Don't miss Race 3 New Poster: <mark>Salman Khan</mark> & Jacqueline Fernandez's SEXY Stare...Aamir Khan's 30 Years In Bollywood Leads To Fan Frenzy On...Happy Birthday Varun Dhawan: GRAND Box Office Total Of All His...Box Office Star Ranking <mark>Salman Khan</mark> 2100 Points Aamir Khan 1350 Points Shah Rukh Khan 1000 Points Ajay Devgn 900 Points Akshay Kumar 800 Points Ranveer Singh 550 Points Hrithik Roshan 500 Points Varun Dhawan 400 Points Upcoming Movies 4th May Omerta 4th May Laila Majnu 4th May 102 Not Out 11th May Raazi 11th May Hope Aur Hum 11th May Fry Day 25th May Bhavesh Joshi Superhero Previous Next View Complete List Reviews Avengers: Infinity War Movie Review: Marvel Will Hold Your Breath & BLOW Your Mind Away! Avengers: Infinity War Movie Review Quicker: Marvel Has Done The Unimaginable! Nanu Ki Jaanu Movie Review: Read This & Save Yourself From Some Horrendous Torture"}, {"articleID": "2020031500_00074089_W", "names": {"James Mason": ["Q16151850", "Q27915132", "Q54100456", "Q5925812", "Q6132912", "Q6139038", "Q6139041", "Q6139043", "Q6140558", "Q6196661"], "John Cameron": ["Q10468938", "Q1699530", "Q18164439", "Q24817361", "Q56718151"]}, "date": "2020-03-15", "url": "https://www.vice.com/en_us/article/qjdnam/audio-recording-claims-neo-nazi-terror-group-is-disbanding", "content": "Audio Recording Claims Neo-Nazi Terror Group Is Disbanding <mark>James Mason</mark>, the well known American neo-Nazi is claiming Atomwaffen Division is no more. by Ben Makuch Mar 15 2020, 12:13 am Share Tweet Snap A past appearance by <mark>James Mason</mark> in an Atomwaffen Division propaganda video. The chief philosophical influence of an American neo-Nazi extremist group that is the subject of a nationwide FBI crackdown and is believed to be on the cusp of being declared a Foreign Terrorist Organization by the State Department, is claiming in an audio message obtained by Motherboard that the group is disbanding. In the recording, <mark>James Mason</mark>, a longtime figure within the U.S. neo-Nazi movement and the author of what's considered an important work in the racist canon of the far-right, claims to officially announce the demise of Atomwaffen Division, a group that has become synonymous in recent years with white nationalist terrorism and is linked to five murders. \"This is a press announcement from <mark>James Mason</mark> on the evening of March 9 of this year,\" said <mark>Mason</mark>, who is known to be an advisor to the group and has made personal appearances in some of its propaganda videos. \"I was approached by members of the group known as Atomwaffen Division with the request that I make the official announcement of that group's disbanding, effective at once.\" Motherboard spoke to sources familiar with <mark>Mason</mark>'s voice who believe it to be him on the recording, which is already circulating online. While the statement does not necessarily prove the group or its supporters are abandoning their activities, it does show the sustained pressure by federal authorities is having a negative effect on the militant neo-Nazi movement. In late February, the FBI arrested five members of the group, including its former leader <mark>John Cameron</mark> Denton, 26, who goes by the online alias \"Rape,\" for allegedly swatting journalists and members of the Trump Administration. A month earlier the FBI announced the arrest of six members of The Base, another neo-Nazi terror group linked to Atomwaffen Division, on charges of planning assassinations and mass shootings. Federal prosectors in Virginia where Denton is being tried recently alleged in court the former leader shared child pornography with another unnamed individual. In 1992, <mark>Mason</mark>, known for his writings advocating for a white ethnostate, pleaded guilty to two misdemeanor counts of possessing child pornography. <mark>Mason</mark> made it clear in the latest recording that the notice of disbanding comes on the heels of FBI pressure on the group. \"Over the course of past weeks and months, the level and degree of federal infiltration and the numerous arrests stemming from that have so severely hampered the group's ability to function as a group that it would be pointless to even pretend that anything resembling organizational activity could continue,\" he said. <mark>Mason</mark> went on to declare, \"anything found on the internet henceforth claiming to be or bearing the mark of Atomwaffen Division\" was to be considered an impostor. Last fall, a group claiming to be Atomwaffen Division released a widely circulated propaganda video, which was swiftly denounced by <mark>Mason</mark> as a fraud. Tagged: FBI Atomwaffen white supremecists The Base Subscribe to the VICE newsletter. Subscribe"}]