[{"articleID": "2009120411_00294255_W", "names": {"Franc Rode": ["Q468883", "Q5478312"]}, "date": "2009-12-04", "url": "http://bulletin.aarp.org/states/az/2009/48/articles/study_catholic_sisters_focuses_religious_role.html", "content": "study of catholic sisters focuses on religious role of women thank you for submitting your comment or question to aarp bulletin today. your post is now on its way to the appropriate bulletin writer. due to the large volume of communications we receive, we regret that we cannot answer or acknowledge all correspondence. disclaimer: aarp.org does not share this information or keep it permanently, as it is for the sole purpose of sending this one time e-mail. patty machelor dec. 4, 2009 (mcclatchy-tribune regional news delivered by newstex)--a vatican study of roman catholic sisters in the united states is discouraging and intrusive to some local women while others say it is a chance to emphasize good works and call more women to religious life. the $1.1 million study--which some view as more of an investigation--includes hundreds of questions on the spiritual and personal lives of this country's 59,000 catholic sisters. u.s. bishops are being asked to fund the three-year undertaking. topics range from finances to attracting new members to nuns who dissent publicly from church teachings in such areas as civil disobedience and sexuality. \"we are closing schools and churches and they are asking the diocese to spend money on this type of thing?\" said sister lil mattingly, a maryknoll missioner who said she is speaking for herself and not as a maryknoll. mattingly said she has a hard time reconciling the wealth in rome with funding problems here. \"we try very hard to review our own lives and how jesus is calling us to live, but i'd like to call on rome to work on that,\" she said. the women being studied are those who work in \"apostolic activities,\" as opposed to cloistered nuns who live in relative seclusion and lead lives of prayer and contemplation. tucson bishop gerald f. kicanas said there are far more apostolic nuns than cloistered nuns in the u.s. today, which might be the reason for the vatican's focus. he said the study is being done to \"strengthen religious life, and to explore ways our religious communities in the united states can...increase in numbers.\" sister elizabeth ohmann, a franciscan nun who works for humane borders, believes there's a different reason the focus is on apostolic nuns. \"i think--and this is my opinion--that they are saying they believe it's the active communities that are really encouraging, say, women priests and are also upholding the rights of homosexuals and even homosexual marriage,\" she said. ohmann said some of her personal beliefs, and those of some of her fellow sisters, are not in keeping with what the church proclaims. \"are we going contrary to rome's teachings? i say,\" yes, it is contrary to rome's teachings .' but it is not contrary to my own conscience, \"she said. kicanas said the bishops are being invited to pay for the study, but it is not required. he doesn't know if they will help with the cost. the diocese of tucson filed for chapter 11 bankruptcy protection in 2004. the nun study was announced last january and written portions were due last week. next, there will be on-site visitations to some congregations. a vatican-approved web site on the study (www.apostolic visitation.org) includes information from cardinal <mark>franc rode</mark> on the reasons for the study.\" like other vocations in the church, religious life has passed through challenging times, \"<mark>rode</mark> wrote.\" apostolic works have also changed significantly because of societal changes. these and other areas need to be better understood and assessed in order to safeguard and promote consecrated life in the united states. \"kicanas said people often react to inquiries like this with fear.\" there's always a level of trepidation that comes with a review and yet it has always been extremely beneficial, \"he said.\" i think our religious communities will have an opportunity, through this study, to identify the significant contributions they have made to the mission of the church. \"laurie olson, a local member of call to action, a national catholic reform movement, said other vatican studies have been conducted following a crisis or scandal, which is not the case this time.\" one can only conclude it's an attack on the sisters, that they are trying to rein them in in some fashion, \"she said.\" it seems to be the pattern of the hierarchy, to attack and further diminish the role of women in the church. \"sister rina cappellazzo, the tucson diocese's vicar for religious, said the study is a chance to look at all the contributions nuns are making, and how things can be done better in the future.\" it's another review of who we are, what we do and why we do it, \"she said.\" after any kind of study, there is a new direction, a clarified vision and sometimes you take a new direction. \"she hopes the study will help attract more women to religious life. there are 194 sisters in the diocese of tucson.\" one of the things that we're hoping is that women will look at this and say, \"this is what i want to join. i want to be a part of this,'\" she said."}, {"articleID": "2019030420_00016431_W", "names": {"Andy Mcdonald": ["Q23011622", "Q4761018", "Q526689"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-03-04", "url": "https://www.mirror.co.uk/news/politics/chris-grayling-accused-running-scared-14086903", "content": "Get the biggest politics stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Chris Grayling was accused by Labour of running scared after the government sent the Health Secretary Matt Hancock to answer an urgent question on the pay out to Eurotunnel. Labour's <mark>Andy McDonald</mark> described the Transport Secretary as an \"international embarrassment\" who should be sacked without delay. The Government settled with Eurotunnel at a cost of £ 33 million over the award of Brexit contracts to ferry firms Eurotunnel, which operates the Channel Tunnel, has now dropped its challenge to the Department for Transport's decision to award deals worth £ 108 million to Seaborne Freight, DFDS and Brittany Ferries to lay on additional crossings to ports other than Dover in the case of a no-deal Brexit. Today Downing Street was yet again forced to confirm that the Prime Minister continues to have full confidence in Mr Grayling. Mr Grayling's catalogue of controversies gained international recognition in a New York Times article questioning how he survives. <mark>Andy McDonald</mark> called Mr Grayling an \"international embarrassment' (Image: Katie Lunn/Teesside Live) Read More Government pays £ 33m to Eurotunnel over no-deal Brexit ferry contracts The piece said:\" He has bumbled his way from one government post to another, accused of making a hash of each, and becoming a byword for haplessness in a golden age of political blundering in Britain. \"Mr <mark>McDonald</mark> told the Commons:\" Once again the Transport Secretary is not in his place to answer a question directed at him. His disregard for taxpayers in this House is clear. \"He added:\" Even in this golden age of ministerial incompetence, the Transport Secretary stands out from the crowd. He leaves a trail of destruction in his wake, causing chaos and wasting billions of pounds yet he shows no contrition, no acknowledgement of his mistakes nor any resolve to learn and improve. \"He's now ridiculed in the New York Times, the mayor of Calais has banned him from his town - the Transport Secretary has become an international embarrassment.\" Mr <mark>McDonald</mark> went on: \"The Prime Minister is the only person in the country who retains confidence in this failing Transport Secretary and only does so because of her own political weakness.\" The public deserve to know how many more calamities is the Prime Minister prepared to tolerate and how many more billions of pounds will she allow him to waste before saying enough is enough. Matt Hancock was forced to answer on behalf of the government (Image: PA) Read More More than 60 <mark>Donald Trump</mark> associates asked to hand over documents in fresh corruption probe \"This country cannot afford this Transport Secretary. He should be sacked without delay.\" In his response, Mr Hancock did not defend Mr Grayling but he did defend the legal settlement with Eurotunnel, adding: \"The purpose of the decision was to ensure the unhindered flow of medicines.\" The purpose of this is to make sure that whatever happens in Brexit people can be safe. \"Mr Hancock earlier urged MPs to back the Government's Brexit agreement with the EU to avoid a no-deal Brexit. It came after the Commons had heard an urgent question on probation changes overseen by Chris Grayling as Justice Secretary which saw a 22% rise in re-offences / The Government's part-privatisation of probation was criticised as a\" dangerous experiment that left the public less safe and out of pocket \"by Labour i Labour MP Diana Johnson said:\" I think this must be making parliamentary history - two urgent questions about the same incompetent minister and chaos and mayhem in two different departments and he doesn't even have the face to come here and front it out and what we're left with is Hancock's half hour. \"Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Labour claimed Mr Hancock was\" acting as a human shield \"for Mr Grayling, who has faced repeated calls to resign over the fiasco. Asked why the Transport Secretary was not answering a question from his Labour shadow about ferry contracts, Downing Street said today:\" The settlement with Eurotunnel was a cross-Government decision, as the provision of freight capacity was largely designed to secure the ongoing supply of crucial medicines, medical supplies and veterinary medicines. \"So it's entirely appropriate for the Health Secretary to answer the question.\" The Labour Whips Office described the decision to put Mr Hancock forward to answer Mr <mark>McDonald</mark>'s question on the floor of the Commons as \"extraordinary\" . \"The Government have confirmed that Matt Hancock, the Health Secretary, will be acting as a human shield for Chris Grayling,\" the Labour whips tweeted. \"When you are unwilling, or the Government are not prepared to field you, to face the scrutiny of your peers and explain why the department you lead has had to pay £ 33 million of taxpayers money, you know the game is up.\" Read More Latest Brexit news Official Brexit delay plan - explained Northern Ireland backstop explained Key dates as the clock ticks down 21 ways No Deal will hit you What EU citizens must do to stay Northern Labour voters back referendum PM's \"shameless bung' for Labour towns UK\" abandons' key backstop demand"}, {"articleID": "2011070815_00028181_W", "names": {"John Carroll": ["Q1609153", "Q19878958", "Q24005518", "Q30056685", "Q48618528", "Q6225292", "Q6225298", "Q6225300", "Q6225302"]}, "date": "2011-07-08", "url": "http://sys-con.com/node/1901667", "content": "roadmap to enterprise cloud computing the move is on: cloud strategies for businesses unlocking the value of the cloud today sap the journey to on demand - lessons learned from small, high-growth customers what if you could transform it your way, using cloud 2.0? changing the game: how to get a cloud service up and running in less than 30 days cisco cloud strategy, within and across data centers next cloud on the horizon: exascale to microservers cloud computing - extending your it infrastructure it's all cloud: blurring the line between dedicated and cloud service parting the clouds - evaluating clouds and cloud providers for the enterprise eliminate vendor lock-in with next-generation virtualization management building the cloud blueprint for enterprise it continuous business transformation: the cloud value chain microsoft's cloud services approach defining enterprise-class cloud computing: managed cloud services deploy an enterprise private cloud in less than 30 days with surgient parting the clouds - evaluating clouds and cloud providers for the enterprise the cloud's not the revolution: cloud usage is storm clouds - disruptive technologies creating the \"new normal\" from the wires instec appoints two new members to board of directors instec, a leading provider of software and services to the commercial property and casualty insurance industry, announced today it has added two new members to the board of directors: thomas caprel and kent a. nelson. kent a. nelson currently serves as managing director of american westbrook insurance services, westchester, il, and is a partner and co-founder of dknu holdings, inc. he serves as an advisor to risk management solutions of america in chicago il, and acrisure group llc, east lansing, michigan. he has also been a director of advantec-hr of tampa, florida for the past six years, and is currently a director of the chicago crime commission and has been active in that organization for the past 8 years. prior to his current position, he served as chairman and ceo of hrh, chicago. mr. nelson has also held leadership positions with other top chicago area insurance brokers such as marsh mclennan, aon risk services of illinois, frank b. hall company of illinois, and a. j. gallagher and company. along with a wealth of experience in insurance operations, mr. nelson's expertise includes strategic planning, mergers and acquisitions, recruiting, other human resource functions (outsourcing), and corporate communications. mr. nelson brings more than 30 years of insurance experience to the instec board of directors. mr. nelson holds a b.s. in marketing and an mba from northern illinois university in addition, he served as an adjunct professor of management for northern illinois university's mba program. thomas caprel has been an entrepreneur for more than 25 years and serves on numerous boards, human resources innovation groups and research groups. he is called upon by the senior leadership teams to work with their teams and the top managers in the organization to enhance performance. mr. caprel is also brought in to help organizations undergoing great transformation and to operate in new ways to sustain growth. mr. caprel holds a b.s. in political science and an mba from western illinois university, and is a depaul certified business architect and has completed the curriculum for living through landmark education. mr. caprel has worked with instec as a strategic advisor since 2008. in addition to mr. nelson and mr. caprel, instec's board of directors includes ray simon, president and ceo of instec, donald landgraf, and <mark>john carroll</mark>. \"by electing additional expert advisors in the insurance field and leadership to our board of directors, instec is poised to continue the strong growth we experienced in 2010,\" said ray simon, president and ceo for instec. \"the tenets of our strong growth - delivering well-engineered, practical software and services, executing efficiently and effectively, and our honest, genuine client attention-will continue to flourish with the help of their leadership on our board of directors.\" about instec instec is a leading provider of software and services to the commercial property and casualty insurance industry. founded in 1982, instec's flagship product, quicksolver, is a best-of-breed rating and policy administration solution that supports the full lifecycle for all major lines of business, in all 50 states, and with native bureau rate, rules, forms, and statistical content. as a microsoft gold certified partner, instec delivers insurance software solutions that enable our clients to drive competitive advantages in rating, issuing, and reporting to maximize profitability. for more information, visit copyright? 2011 sys-con media, inc. - all rights reserved. about business wire copyright? 2009 business wire. all rights reserved. republication or redistribution of business wire content is expressly prohibited without the prior written consent of business wire. business wire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. subscribe to the world's most powerful newsletters subscribe to our rss feeds & get your sys-con news live! publish your article! please send it to editorial (at) sys-con. com! copyright? 1994-2008 sys-con publications, inc. all rights reserved. all marks are trademarks of sys-con media."}, {"articleID": "2018101309_00093768_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"]}, "date": "2018-10-13", "url": "http://www.surreycomet.co.uk/sport/national/16981050.gareth-southgate-four-man-defence-can-boost-england-in-attack/", "content": "Gareth Southgate 0 comments Gareth Southgate believes England's players are now established and equipped enough to use a four-man defence that can boost their attacking threat. After sealing World Cup qualification against Slovenia this time last year, the 48-year-old moved to a three-man defence that had its kinks but provided the platform for a summer to remember. Southgate ended a run of 16 matches using that defensive structure on Friday as England reverted to a four-man backline against the side that halted their progress at the semi-final stage in Russia, where Croatia's midfield ran amok as they came back to secure a 2-1 extra-time win. Thanks to everyone supporting us from afar. See you in Seville .?? #threelions pic.twitter.com/EOgBKHeDcO--England (@ England) October 12, 2018 But, just 93 days on, England managed to nullify that threat, with their re-shaped defence working well as the side began to threaten from open play in a Nations League encounter that should have been an away win rather than a 0-0 draw. \"In the last few matches, we have been pinned back in different ways,\" Southgate said after a match played behind closed doors. \"With three opponents pinning our five back--against Spain that was the two wingers and centre forward, against Switzerland that was the wing-backs--so we were then getting outnumbered without the ball.\" We'd also had some problems building up against the pressure, so tonight I was really pleased that we did both things very well. \"We were able to get more pressure higher up the pitch, we were able to get tighter to their midfielder. I thought our three midfield players did an excellent job.\" We used the ball well against a very good team, so very pleased with it. The players adapted quickly and well. \"The three at the back, the 3-5-2, allowed some players to bed into international football. People like (<mark>Harry</mark>) Maguire.\" Going into the World Cup, I felt we needed a little bit more protection for the defence and the opportunity to get two forwards in the game. \"Now, I think some of those players are a bit more established. They look very comfortable as a back four.\" So, I think that gives us good opportunities because some of the players that we've got coming through--we've got some very strong No. 8s and wingers coming through the system--so it's good that we have got the opportunity to play different systems. \"Jordan Henderson (left) and John Stones are suspended for the clash with Spain (Adam Davy/PA) Southgate now has to decide whether to stick or twist against a Spain side that mauled Croatia 6-0 after winning the Nations League opener 2-1 at Wembley last month. Luke Shaw, Jesse Lingard and Dele Alli all started that game but miss the Group A4 rematch through injury, while John Stones and Jordan Henderson are suspended in Seville after picking up bookings on Friday.\" Well, it doesn't make life any easier! \"Southgate said with a smile.\" But there's opportunities for other players. \"It's going to be a really good test for us in Seville. We'll have thousands of fans there, so we want to give another good performance.\" These players give absolutely everything. I could never, ever question their commitment or the intensity of their game. The youngest player in 63 years to make a competitive debut for @ England. Bravo, @ Sanchooo10?????? #NationsLeague pic.twitter.com/pnqR2RsgeB--UEFA Nations League (@ UEFAEURO) October 12, 2018 \"And, again, tonight a couple of players have emerged. I thought (debutant Jadon) Sancho had a really good impact when we eventually got the ball to him, so I think lots of encouraging things from the game.\" Southgate has some decisions to make, but there appears little doubt that captain <mark>Harry Kane</mark> will start again despite hitting the bar on a night that saw his scoreless run to a sixth match. \"I think he had the chance that he was just offside that he buried,\" the England manager added. \"<mark>Harry</mark> will get his goals. I've no (doubt).\" 0 comments"}, {"articleID": "2012102216_00039336_W", "names": {"John Bell": ["Q15992759", "Q18385324", "Q18763865", "Q20708042", "Q21556167", "Q22003352", "Q24007403", "Q29642355", "Q46996241", "Q53764859", "Q53764863", "Q5569327", "Q56236218", "Q57446419", "Q6221426", "Q6221438", "Q6221440", "Q6221443"], "Robert Gordon": ["Q16224376", "Q20711957", "Q22111694", "Q25189314", "Q25412059", "Q56516629", "Q633219", "Q7341234", "Q7344854", "Q7344858", "Q7344860", "Q7344864", "Q7344867", "Q7345891", "Q7346038", "Q7346564", "Q7347124"]}, "date": "2012-10-22", "url": "http://yourindustrynews.com/aberdeen+graduate+takes+unconventional+route_83017.html", "content": "aberdeen graduate takes unconventional route monday, oct 22, 2012 in scotland we are fortunate to have nineteen universities located throughout the country, not only in all of scotland's seven cities but far beyond into our remote and rural communities. this accessibility coupled with the no fees policy for scottish students means that leaving school at eighteen, going to university and then hopefully starting work is a fairly typical route for many of our young people. not so for local student natalie kane, who with the help of inverurie based <mark>john bell</mark> pipeline was able to realise her dream career in a slightly less conventional route than most students. \"after leaving school i started work at aberdeen cyrenians in an administration role where i gained experience with a number of marketing type activities such as event management and fundraising. this experience whetted my appetite for all things marketing and so after two years i left and went to aberdeen college to study full time for an hnd in marketing, advertising & pr,\" explained natalie. two years on and with her hnd behind her, natalie was determined to go one stage further and study for her ba in communications and public relations at <mark>robert gordon</mark> university. \"i was very lucky that through a networking event i attended whilst at college, i met a recruitment consultant who put me in touch with <mark>john bell</mark> pipeline.\" as a result <mark>john bell</mark> offered me a part time position to fit in around my study hours and so i was able to self-fund my way through university, \"said natalie. three years after she left full time work, she has now achieved her academic goals and has secured a full time position at <mark>john bell</mark> as their marketing co-ordinator.\" my job is so varied and there is never a dull moment. one day i can be researching new market opportunities and the next optimising the website or attending exhibitions and networking events. i really enjoy my job and am so fortunate that i was put in touch with <mark>john bell</mark> pipeline while i was at college as they are so supportive and open to fresh ideas. \"natalie believes that all students should try and attend networking events if possible so they can meet up with other likeminded people as you never know where it might lead."}, {"articleID": "2020021119_00099070_W", "names": {"Asim Khan": ["Q45845593", "Q4806970"], "Bharat Bhushan": ["Q30541659", "Q42119414", "Q42884182", "Q4901100", "Q57332897"]}, "date": "2020-02-11", "url": "http://www.dailypioneer.com/2020/state-editions/amanatullah-wins-okhla-with-huge-margin.html", "content": "Home State Editions Delhi Amanatullah wins Okhla with huge margin Wednesday, 12 February 2020 | Staff Reporter | NEW DELHI Share T T T T 0 Amanatullah wins Okhla with huge margin Wednesday, 12 February 2020 | Staff Reporter | NEW DELHI The Aam Aadmi Party's (AAP) Amanatullah Khan won the Okhla seat by over 71,827 votes after defeating Bharatiya Janata Party's (BJP) Braham Singh. In the initial trends, Singh was leading by 194 votes, but <mark>Khan</mark> later took a huge lead and till the end of the counting retained the lead and won it with a huge margin. The city's Shaheen Bagh and Jamia Nagar fall under the Okhla constituency. Shaheen Bagh has become the epicentre of protest against the Citizenship (Amendment Act) as women with young children have been on a sit-in protest there for nearly two months. \"It is the victory of all of us. We all elected Amanat bhai (Amanatullah Khan) as our leader. He has helped the women and youth of this area in every sphere, that is, from health to education, infrastructure to jobs. He got many youth from this area employed,\" Shamima Bano from Shaheen Bagh said. Women protesters erupted in joy with loud rounds of applause as they hugged each other. \"The AAP truly brought development to an aam aadmi (common man). My kids go to a nearby Government school. We all go to the AAP government's Mohalla clinic for treatment. My mother-in-law is being treated for her knee problem since four years,\" Mehjabeen Qureshi said at the protest site. \"AAP understands the needs of its citizens,\" she added. There was also a wave of excitement in Batla House, Noor Nagar, Abu Fazal Enclave, Zakir Nagar and the adjoining areas when the news of the AAP winning big emerged. <mark>Asim Khan</mark>, a garment dealer said, \"We have seen Jamia Nagar change in the last five years. We voted for AAP's honesty and transparent policies. Not only Jamia Nagar, the entire Delhi voted for real\" vikas' (development) which is Arvind Kejriwal \". Sharvari (75) of Shaheen Bagh said,\" Amanatullah is like our son and his victory is not by chance. The AAP has understood the pulse of Delhi. Today we want to distribute \"biryani' to all those politicians who called our protest politically motivated and accused us of eating sponsored Biryani.\" The elections in the national capital took place in the midst of massive protests in the city and elsewhere over the new citizenship law, an issue which was strongly raised by the BJP top leadership during the campaigning which often turned bitter and vitriolic. Trending News Mallya arrives for High Court appeal against extradition to India Iran's Rouhani says Islamic Revolution \"unbearable' for US At least five dead in suicide attack in Kabul: officials Amazon wants to depose Trump over loss of military contract Guterres to visit Gurdwara Kartarpur Sahib during trip to Pakistan Coronavirus death toll in China crosses 1,000 Gunman dead, 2 officers hurt in shooting at Arkansas Walmart Elon Musk tweets #DeleteFacebook, says\" it's lame' Oscar Awards 2020: Complete list of Winners China praises PM Modi's letter to XI on coronavirus assistance Bong Joon Ho creates Oscar history with best picture win for \"Parasite' Iran satellite launch fails, in blow to space programme more State Editions Cabinet approves UP Groundwater Protection Bill 12 February 2020 | PNS | Lucknow CM stresses need for awareness on women empowerment 12 February 2020 | PNS | Lucknow 3-year-old girl raped, murdered in Sitpaur 12 February 2020 | PNS | Lucknow BJP MLA accused of raping widow 12 February 2020 | PNS | Lucknow Father of rape survivor shot dead by rapist 12 February 2020 | PNS | Lucknow Power Corporation Trust moves NCLT to recover dues from DHFL 12 February 2020 | PNS | Lucknow Delhi, Bhopal, Bhubaneswar, Ranchi, Lucknow, Chandigarh, Dehradun, Raipur Sunday Edition Eat safe to live well 09 February 2020 | Kavita Devgan | Agenda Time to love 09 February 2020 | Navneet Mendiratta | Agenda The art of ageing gracefully 09 February 2020 | Suparna Trikha | Agenda Astroturf | Astrology and destiny indications 09 February 2020 | <mark>Bharat Bhushan</mark> Padmadeo | Agenda Talktime |\" I'll never compromise on individuality' 09 February 2020 | Pioneer | Sunday Pioneer Kia ora with new connect 09 February 2020 | Shalini Saksena | Sunday Pioneer E-mail this link to a friend. Email of your friend: Your Name (Sender's): Your Email (Sender's): Subject: Home About Us Contact Us Advertise with us Archives © 2020 The Pioneer. All Rights Reserved. Site Designed and Developed by: Infomedia Web Solutions"}, {"articleID": "2010092216_00400373_W", "names": {"Peter Gould": ["Q21535066", "Q7174311"]}, "date": "2010-09-22", "url": "http://environmentalgeography.wordpress.com/2010/09/22/nature-8-9-coates/", "content": "nature 8-9 (coates) environmental racism deliberate location of environmentally hazardous facilities in disempowered, low-income and ethnic / racial minority communities facilities are primarily located in areas where voter registration and education are low and citizens are presumed to be less informed, less aware, and less concerned with the hazardous waste hurricane katrina: african americans, as compared to their white counterparts, were less likely to be evacuated before the storm, four times more likely to lose their jobs after the storm? lead - there is a particularly high concentration of lead problems in low-income and culturally diverse populations, who live in the inner city where the public housing units were built before 1970. waste sites - low income, and quite often culturally diverse populations, are more likely than other groups to live near landfills, incinerators, and hazardous waste treatment facilities. regent's park built to offer outlet for \"suffocated energies and suppressed aesthetic desires\" designer said it was designed to be \"a scenery of nature\" but it is constructed, not \"naturally\" occurring. biotechnology: gmo's, test-tube babies crops: monsanto-corn \"designer animals\" - teacup pigs, ornamental aquarium fish species made fluorescent by inserting jellyfish genes into their dna - driven by eugenicist ideology? random blurb: in the last issue of newsweek, there was an article about the impact we are having on the earth and if it really matters when you take into geological time. it states \"what humans do to, and ostensibly for, the earth does not matter in the long run, and the long run is what matters to the earth\" . the article was a interesting take on the whole \"we're hurting the earth' thing? other topics/ideas:\" every culture projects its values onto nature and then holds them up as nature's own authority, deploying this apparently unimpeachable and independent source of authority to justify its vision of society and the world. \"(p. 146) marx:\" soil as eternal communal property \"and not for short-term gain. anna bramwell: ecology cannot put man first, which marx did <mark>peter gould</mark>:\" back to nature \"thinking characterized by pacifism, vegetarianism, decentralization, nature worship and animal rights. (p. 155) this entry was posted on wednesday, september 22nd, 2010 at 11:47 am and is filed under"}, {"articleID": "2018020123_00016086_W", "names": {"Douglas Sloan": ["Q4354495", "Q5301980"], "Joe Rosenthal": ["Q17483916", "Q6212081"], "Stephen Young": ["Q21458224", "Q27924846", "Q3498689", "Q50365763", "Q7609865"]}, "date": "2018-02-01", "url": "http://pilotonline.com/news/nation-world/world/article_51e938e1-72a1-5b64-bd27-2e890127dd1e.html", "content": "Save wire A grisly photo of an execution 50 years ago shocked the world and helped end the Vietnam war By Michael E. Ruane Buy Now In this Feb. 1, 1968, file photo, South Vietnamese Gen. Nguyen Ngoc Loan, chief of the National Police, fires his pistol into the head of suspected Viet Cong officer Nguyen Van Lem (also known as Bay Lop) on a Saigon street, early in the Tet Offensive. The photo showed the war's brutality in a way Americans hadn't seen before. Protesters saw it as graphic evidence that the U.S. was fighting on the side of an unjust government. Eddie Adams | Associated Press Save WASHINGTON Before he pulls the trigger, the South Vietnamese general waves his soldiers out of the way so they don't get hurt. He shoos them with the pistol he holds in his right hand, and flicks out his left hand as he approaches the prisoner standing before him. His men guess what's coming, and scatter. The general raises the shiny snub-nose .38, points it at the prisoner's right temple and pulls the trigger. At that instant on the sunny Thursday of Feb. 1, 1968, in what was then called Saigon, Associated Press photographer Eddie Adams' camera shutter clicked once and one of the most powerful pictures of the Vietnam War, or any war, was taken. In 1/500th of a second, Adams caught the moment the bullet crashed through the Viet Cong prisoner's skull at about 600 mph, distorting his face, tousling his hair and shoving his head off center. Some people say you can see the bullet coming out the other side. Adams thought it was still inside. It's hard to tell. In the picture, Gen. Nguyen Ngoc Loan, the head of South Vietnam's National Police, stares coldly at his victim. Loan, who had a reputation as a government enforcer, is a thin man with a receding hairline who seems to be wearing a bulky flak vest. His shirt sleeves are rolled up, showing the sinews in his forearm. The gun looks like it has recoiled slightly upward. Off to the left in the frame, another soldier winces. The prisoner, whose hands are bound behind him, already has a fat lip, likely acquired when he was captured after leading a brutal commando raid. He wears dark shorts, a plaid shirt and no shoes. On film footage of the incident, the shooting scene unfolds in about 10 seconds. (Adams can be seen for an instant in an earlier part of the footage .) The prisoner, Viet Cong officer Nguyen Van Lem, tumbles to the pavement, blood spouting from his head. Loan calmly holsters his pistol, saying to Adams, \"they killed many of my men and many of your people,\" and walks away. Adams waits until the blood stops gushing. \"It was gross,\" he would say later. He takes a few more pictures of the body then returns to the Associated Press office to drop off his film. No big deal. \"I thought absolutely nothing of it,\" he said in an interview that later became part of a Newseum podcast. \"I said' I think I got some guy shooting somebody .' And, uh, I went to lunch.\" Just another day on the bloody streets of Saigon in the midst of the enemy's famous Tet offensive - sweeping guerrilla attacks across South Vietnam - during the endless Vietnam War. \"So what?\" Adams, a former U.S. Marine from a small town north of Pittsburgh, said later. \"It was a war. I'm serious. That's how I felt. I had seen so many people die at that point in my life.\" Adams did not realize he had taken one of history's great pictures. He did not know it was a shot that would summarize in a millisecond the savage, seemingly mindless, violence of the war. He had no idea that his photograph, snapped 50 years ago Thursday, would help change history, and echo throughout his life and that of his surviving subject. \"He wasn't allowed to forget that photograph,\" Loan's son, August, said in a 2008 documentary. \"It stuck with him everywhere he went.\" The picture ran on the front pages of many U.S. newspapers and the footage ran on TV. But it was the photograph, and its frozen portrait of agony, that fueled the antiwar movement and helped end U.S. involvement. \"It just kind of summed up the whole war,\" former CBS News anchor Bob Schieffer said in the short film \"Eddie Adams: Saigon' 68\" by <mark>Douglas Sloan</mark>. \"The horrificness of it stops you,\" the late Life Magazine photographer Bill Eppridge said in the 20128 documentary. \"I think his picture was the moment that changed the war.\" David Hume Kennerly, a fellow Vietnam War photographer, who was the former chief White House photographer and a friend of Adams's, compared the picture with that of <mark>Joe Rosenthal</mark>'s famous shot of U.S. Marines raising the flag on Iwo Jima in World War II. \"Where <mark>Joe Rosenthal</mark>'s picture represented the heroism...and courage in war and patriotism...Eddie's picture was exactly the opposite,\" Kennerly said in a telephone interview. \"Eddie's picture was the real underbelly of violence and summary execution...It's what war is really like.\" \"I don't know that it ended the Vietnam War, but it sure as hell didn't help the cause for the government,\" he said. \"One thing I know for sure, anybody who's ever seen that photo has never forgotten it.\" In 1969, Adams was awarded a Pulitzer Prize for the shot. But he felt terrible about the photo, which he didn't think was that good, and bitter about the prize, according to interviews he gave over the years. He believed he had taken far more worthy pictures, and that the execution photo was viewed out of context by most people: The slain Viet Cong prisoner was suspected in the murder of a South Vietnamese officer, his wife and children. Adams believed he had destroyed Gen. Loan's life. \"Two people died in that photograph,\" Adams wrote in Time magazine years later. \"The recipient of the bullet and General Nguyen Ngoc Loan. The general killed the Viet Cong; I killed the general with my camera.\" \"General Loan was...a real warrior,\" Adams wrote in a Time eulogy for Loan. \"I'm not saying what he did was right, but you have to put yourself in his position...He never blamed me. He told me if I hadn't taken the picture, someone else would have, but I've felt bad for him and his family for a long time.\" Loan, who later lost a leg in combat, was treated for the injury at Washington's old Walter Reed Army Hospital in 1969, which outraged some people. The late Sen. <mark>Stephen Young</mark>, D-Ohio, called Loan a \"brutal murderer,\" and his treatment in the U.S. \"a disgraceful end to a...disgraceful episode.\" Loan was university-educated and had become a jet pilot before he was named national police chief. He was married and had five children. After the war, he made his way with his family to the United States and ran a restaurant in northern Virginia. But the photograph stalked him. In the restaurant men's room, someone scrawled on the wall: \"We know who you are, you f--\"In 1976, he told a Washington Post reporter he was trying\" to think about the present and the future of my children. I have no time to think back or regrets. \"In 1978, the government moved to deport him.\" Gen Loan cold-bloodedly shot and killed another human being, \"former Rep. Elizabeth Holtzman, D-N.Y., wrote at the time.\" By any standard what he did was immoral. \"But Loan had local support and was never deported. Twenty years later, on July 14, 1998, he died at home in Burke, Virginia, at the age of 67. Adams, a rough-edged, cantankerous figure who had great fame after the war, also was haunted by the photo, among other things. In the documentary, he said that when he died he wanted to be buried in his Marine Corps\" dress blues \"uniform. He wanted a 35mm camera with a wide-angle lens, and he wanted some slow speed color film.\" Because where I go there's going to be a lot of light, \"he said.\" And it (won't be) from up above either. Fire, you can photograph really well with a slow speed film. \"Adams died of Lou Gehrig's disease on Sept. 18, 2004, in New York City. He was 71. He was laid to rest beside his father just outside his home town of New Kensington, Pa.. He didn't fit into his old uniform, his widow, Alyssa, said. But she did bury him with a camera. --"}, {"articleID": "2010111411_00033750_W", "names": {"Ryan Jackson": ["Q43084035", "Q493427", "Q7384176", "Q7384177", "Q7384178"]}, "date": "2010-11-14", "url": "http://callofduty.wikia.com/index.php?title=Grigori_Weaver&diff=657139&oldid=prev", "content": "** according to <mark>ryan jackson</mark>'s emails, weaver approached <mark>jackson</mark> shortly after x tipped him, to ask his help to dig up what info can be found for kristina; but <mark>jackson</mark>'s superior, richard kain, told <mark>jackson</mark> to feed weaver whatever \"to get him off his back\" . ** according to <mark>ryan jackson</mark>'s emails, weaver approached <mark>jackson</mark> shortly after x tipped him, to ask his help to dig up what info can be found for kristina; but <mark>jackson</mark>'s superior, richard kain, told <mark>jackson</mark> to feed weaver whatever \"to get him off his back\" . ** the arctic black ops multiplayer character is similar to weaver. ** the arctic black ops multiplayer character is similar to weaver. + ** even though weaver lost his eye earlier, in the \"safe\" house at the start of wmd he subdues a guard and then shoots another guard in the head without looking. ** his signature weapon appears to be an aug. be advised, you will not be at a safe distance in the event that spoiler goes off, do you understand? warning! this article contains spoilers and/or leaked info studies and observation group and is a part of a squad (with the playable character) infiltrating a soviet base during the mission \"hudson, as they torture dr. clarke. he loses one of his eyes during the mission alex mason. according to weaver's cia dossier, weaver was born in russia in 11/10/1936, his father was a local political figure who was executed during stalin's great purge, he and his mother defected to the us during ww2. after the baikonur mission, weaver developed a comradeship bond with woods and mason, for saving his life. however, mason's deteriorating mental condition has caused rift in the friendship, from worry to mistrust, and by february 1968, weaver was convinced that mason is burnt during the latter's days in vorkuta, and advised to hudson once they got the info they need, they should deal with mason as in\" two in the chest, one in the head \". throwing knife on an enemy. this is the first confirmed npc to use (and kill with) the throwing knife. it is also the only time a throwing knife is actually seen in call of duty: black ops, as it has been replaced by the tomahawk. it should be noted that after weaver's eye is cut out, there is no effect on his aim. he should have had a problem with depth perception, going back to the fact that he had lost his eye. gamescom demonstration (including the gamestop commercial), weaver is seen wearing an eye patch. [4] it is very unusual that a russian is a member of the cia during the cold war, even if he was a double agent as weaver was. until 1977 weaver didn't know he still has a blood relative that survived the great purge. but unknown to him (or what x didn't told him, to be exact), kristina, daughter of his sister olga, is a gru agent, and a double-agent who works for the cia. according to her dossier within <mark>ryan jackson</mark>'s account, kristina's current gru assignment is to locate, seduce and detain mason. and that makes her the perfect candidate for operational asset in the upcoming operation charybdis. according to <mark>ryan jackson</mark>'s emails, weaver approached <mark>jackson</mark> shortly after x tipped him, to ask his help to dig up what info can be found for kristina; but <mark>jackson</mark>'s superior, richard kain, told <mark>jackson</mark> to feed weaver whatever\" to get him off his back \". the arctic black ops multiplayer character is similar to weaver. even though weaver lost his eye earlier, in the\" safe \"house at the start of wmd he subdues a guard and then shoots another guard in the head without looking. his signature weapon appears to be an aug. ."}, {"articleID": "2013052706_00004376_W", "names": {"Ben Cohen": ["Q2278517", "Q816463"]}, "date": "2013-05-26", "url": "http://www.newnownext.com/tell-us-where-it-hurts-rugby-god-ben-cohen-gets-sunburn/05/2013/", "content": "Ex-rugby star and current athlete ally <mark>Ben Cohen</mark> posted this picture from sunny Mauritius, where he and his family are shooting a spread for Hello! magazine. The caption read, \"chillin #Sunburnt #Mauritius at Long Beach Hotel.\" <mark>Ben</mark>, dear, you just tell us where to put the lotion. Tags: <mark>Ben Cohen</mark> | hello magazine | Long Beach Hotel. | Mauritius | standup"}]