[{"articleID": "2019101413_00240695_W", "names": {"Anurag Kashyap": ["Q2839609", "Q56248257"]}, "date": "2019-10-14", "url": "https://www.thehindu.com/entertainment/movies/irfan-pathan-all-set-to-make-cinema-debut/article29682012.ece", "content": "Irfan Pathan all set to make cinema debut October 14, 2019 19:03 IST Updated: October 14, 2019 19:03 IST Share Article October 14, 2019 19:03 IST Updated: October 14, 2019 19:03 IST more-in The producers of the film announced taking Pathan on-board the film, directed by Ajay Gnanamuthu. Indian cricketer Irfan Pathan is all set to make his cinema debut, with the left-arm pacer being roped in for a Tamil film featuring popular star Vikram. The producers of the film, who have tentatively titled the movie \"ChiyaanVikram58,' announced taking Pathan on-board the film, directed by Ajay Gnanamuthu. Vikram is addressed as\" Chiyaan' by his fans. \"Proud and honoured to introduce @ IrfanPathan in #ChiyaanVikram 58 in a super stylish action avatar!! Welcome on Board sir and wish you a sensational debut,\" the film's co-producer Seven Screen Studio said on Twitter. Gnanamuthu has directed the critically acclaimed crime thrillers \"Demonte Colony' and\" Imaikka Nodigal', the latter featuring popular Hindi cinema director <mark>Anurag Kashyap</mark> in a leading role. Gnanamuthu tweeted: \"Welcome on board @ IrfanPathan Can't wait to unleash your new avatar to the audience!! Time for some solid action!! .\" The director also tweeted a picture of himself and Pathan. You have reached your limit for free articles this month. Register to The Hindu for free and get unlimited access for 30 days."}, {"articleID": "2015110102_00030486_W", "names": {"Chris Young": ["Q2964901", "Q2964905", "Q2964906", "Q47541480", "Q5108544", "Q952176"], "Daniel Murphy": ["Q3014492", "Q528318"], "Jim Wolf": ["Q19958282", "Q6199020"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"]}, "date": "2015-11-01", "url": "http://kdwn.com/2015/10/31/the-latest-conforto-homers-as-mets-lead-royals-2-0/", "content": "NEW YORK (AP)--The latest on the World Series, where the New York Mets will try to pull even with the Kansas City Royals in Game 4 on Saturday night (all times EDT):--9:10 p.m. Michael Conforto's leadoff home run in the third against <mark>Chris Young</mark> and a gaffe by Kansas City right fielder Alex Rios later in the inning gave the Mets a 2-0 lead. Conforto, a rookie who did not face <mark>Young</mark> during his relief outing in the 14-inning opener, pulled an 87 mph pitch 395 feet into the right field upper deck. Wilmer Flores singled, ending an 0-for-10 Series start, advanced on a wild pitch and was sacrificed to third by Mets starter Steven Matz. Curtis Granderson hit a 254-foot fly ball to right. Rios caught it and took a casual step toward Kansas City's dugout, apparently thinking it was the final out of the inning. In the middle of his second step, he threw to the plate, but not in time to get Flores coming home from third. Kansas City asked umpires to check whether Flores left third base early. After a video review of 2 minutes, 22 seconds, the safe call on the field was allowed to stand .--8:50 p.m. Toronto's Josh Donaldson, speaking at the Hank Aaron Award news conference, was asked how he came up with his \"BringerOfRain\" Twitter handle. \"It was actually a series called\" Spartacus: Blood and Sand, \"he said .\" And the main character's name, Spartacus, and he becomes a gladiator. To make a long story short, he's fighting this guy, his name is Theokoles. He's a legend in the ring. The story is he's been stabbed a thousand times. I mean, it's crazy. To say the least, Spartacus ends up defeating him and killing him, and their country was in a drought at the time. And after he was able to defeat him, the rain had been brought. So he was called Spartacus, \"Bringer of Rain .' I thought it was pretty neat, so I stole it .\" --8:30 p.m. Edinson Volquez remains scheduled to start Game 5 for the Royals following his father's death, pending a conversation with manager Ned Yost. The pitcher was in the dugout for Saturday evening's Game 4 at Citi Field. \"I've got to sit down and talk to Edi. But we're still planning on him pitching tomorrow,\" Yost said before the game. \"He'll be here tonight, yeah. He should be here anytime .\" Volquez started the Series opener Tuesday night, hours after his father died. Volquez said he learned about his father's death when he stepped off the mound after allowing three runs over six innings. He then flew home to the Dominican Republic. \"These are huge games. Edi's been with this team all year long. He's worked so hard to get to this point,\" Yost said. \"And it was like <mark>Chris Young</mark> when his dad passed away. <mark>Chris</mark> just knew how proud his dad was of him and that his dad would want him to carry on. His dad would want him to be on that mound and helping his team win. And I imagine that Edi's dad would want the same thing .\" Volquez's father, 63-year-old <mark>Daniel</mark> Volquez, died of heart failure .--8:27 p.m. Toronto's Josh Donaldson won the American League's Hank Aaron Award and Washington's Bryce Harper was voted the NL honor. The award, established in 1999, is given to the most outstanding offensive performer in each league as determined by fans and a panel of' Hall of Famers selected by Aaron. Donaldson hit .297 with 122 runs, 41 doubles, 41 homers and 123 RBIs as the Blue Jays reached the playoffs for the first time since winning the 1993 title. Harper batted .330 with 118 runs, 38 doubles, 42 homers and 99 RBIs .--8:17 p.m. Well, plate umpire <mark>Jim Wolf</mark> came out firing. Known for a good arm--his brother is big league pitcher Randy Wolf--he tried to fire a strike when Royals starter <mark>Chris Young</mark> took the mound to begin the bottom of the first inning. Instead, Wolf tossed it right past the 6-foot-10 righty. Wolf wound up again and his second throw was right on the money. <mark>Young</mark> and Wolf seemed to smile, enjoying the moment .--8:04 p.m. Starting pitchers Steven Matz and <mark>Chris Young</mark> are ready to throw. So is plate umpire <mark>Jim Wolf</mark>. Wolf is known around baseball for tossing sharp strikes back to the pitcher after foul balls. It makes sense--his brother is major league pitcher Randy Wolf. This is Wolf's first year working the World Series, and this is his first plate job. A former pitcher in college, the right-hander was set. \"If my elbow cracks on my first throw, I'm good,\" he said. \"I'm ready. I'm here, I got to try it out .\" --6:45 p.m. Ruben Tejada thinks Chase Utley's late slide that broke his right leg was dirty. Speaking about the play for the first time since Utley ended Tejada's season in Game 2 of the NL Division Series against the Los Angeles Dodgers, the Mets shortstop said he's no longer upset over it. Using a blue cane adorned with a Mets logo giving to him by the team's owners, Tejada hung out with teammates in the dugout before Game 4 of the World Series. He says he's come to terms with what happened, even though he never responded to the message Utley sent him through captain <mark>David Wright</mark>. Tejada may never respond to Utley. But he's not angry. \"I'm really happy we're here and he's home,\" Tejada said. Tejada said he needs to be in a walking boot for two more weeks, but vows he'll be ready for spring training .--6:40 p.m.. If the scouting report on <mark>David Wright</mark> was to go after him with hard stuff, <mark>Wright</mark> made the Royals pay for that approach in Game 3. The New York Mets' captain hit a two-run homer in the first inning on a 96 mph fastball from Yordano Ventura. According to Major League Baseball's PITCH f/x computer, that was the second home run on a pitch of 96 mph or greater that <mark>Wright</mark> hit since it began tracking data in 2007. The other was against Atlanta closer Craig Kimbrel in 2013. <mark>Wright</mark> added a two-run single on a 97 mph fastball from reliever Kelvin Herrera in the sixth .--6:30 p.m. Noah Syndergaard's high-and-tight fastball to Alcides Escobar was still a hot topic before Game 4. The rookie's first pitch Friday night for the Mets was a 97 mph heater just off the inside corner and above the head of a ducking Escobar. The ball sailed all the way to the backstop, and the Kansas City shortstop went down to the dirt on his rear end. Royals players shouted angrily at Syndergaard from the dugout. After the game, the <mark>young</mark> right-hander made it clear the pitch indeed had a purpose--to make Escobar and the rest of the Royals uncomfortable in the batter's box. Syndergaard had alluded Thursday to having \"a few tricks\" up his sleeve for the aggressive Escobar leading off the game. \"I didn't expect him to throw a strike, but I didn't expect him to throw it under his chin, either,\" Royals manager Ned Yost said. \"But we've got a few tricks up our sleeves, too .\" The 6-foot-6, 240-pound Syndergaard said he certainly wasn't trying to hit Escobar. \"If they have a problem with me throwing inside, then they can meet me 60 feet, 6 inches away. I've got no problem with that,\" he said. Yost said throwing near an opponent's head is too dangerous, even if the intent is not to hit him. \"You can end a player's career by not intentionally hitting them in the head,\" the manager said. Yost views the chest as the dividing line these days for what's acceptable when pitching inside. \"You've seen us at times with <mark>Daniel Murphy</mark> pitch in on him, but it's never been up and in,\" Yost said. \"It was an acceptable thing to be able to move guys away, up top. And we've kind of gotten away from that now .\" Mets manager Terry Collins thought Syndergaard's purpose pitch set a tone. \"Hey, look, we're in this World Series, too, and we're going to get after it,\" Collins said, adding it showed Syndergaard is \"not afraid of anybody .\" Collins called pitching inside \"a lost art\" and acknowledged \"guys take a huge offense to it .\" \"But I still think it's got to be part of the game,\" Collins said."}, {"articleID": "2013022714_00054404_W", "names": {"Mary Walsh": ["Q3296255", "Q58120228", "Q6780910", "Q6780911", "Q6780914"]}, "date": "2013-02-27", "url": "http://cbc.ca/news/canada/newfoundland-labrador/story/2013/02/26/nl-rnc-rcmp-synthetic-marijuana-227.html?cmp=rss", "content": "new n.l. police say synthetic weed illegal police in newfoundland say they would investigate, test samples of suspicious product last updated: feb 27, 2013 10:24 am nt police in newfoundland and labrador agree that synthetic marijuana is illegal, and if there was suspicion of it being sold over the counter in local stores, they would launch an investigation. cbc news bought herbal incense from two local stores - <mark>mary</mark> janes smoke shop in downtown st. john's and the chad smoke shop 420 in mount pearl. the product was sold under brand names like fusion warped, fusion fission, zap \"r, and kick ass white rabbit. the zap' r herbal incense blend has this label on the back of the package. (cbc) the foil packaging clearly states the product is not meant for human consumption. the vast majority of u.s. states have tried to ban similar products sold as marijuana substitutes. but the herbal incense - which may be sprayed with a synthetic version of tetrahydrocannabinol, or thc, the active chemical in marijuana - seems to exist in a regulatory grey area in canada. a cbc news investigation has sparked police forces across the country to have a look at the product. unfamiliar with synthetic weed royal newfoundland constabulary const. garry crocker said he wasn't very familiar with synthetic weed .\" i haven't had any experience with it, and our drug section, as far as i know, haven't seized any, \"he said. crocker, the rnc's drug awareness co-ordinator, said it is covered under the controlled drugs and substances act (cdsa). const. garry crocker is the drug awareness co-ordinator with the royal newfoundland constabulary. (cbc)\" it is illegal to buy it, sell it, and produce it, \"he said. he said stores selling it would be investigated, and have their product sent to a laboratory for testing .\" it is man-made, and the chemicals in it are unknown until they are tested with the lab, \"he said. but not all synthetic cannabinoids are declared as being banned substances, putting them in a legal grey area. health canada, however, considers anything a controlled substance if it gives the same effect as marijuana. rcmp sgt. steve conohan said it can be a difficult issue to address .\" there are some that are just what they say - there are some that are just potpourri, \"said conohan, the rcmp's co-ordinator of drugs and organized crime awareness .\" because of the varying number of names and whatnot that they put on them, sometimes it's difficult to determine whether or not they have synthetic cannabinoids in them. \"sgt. steve conohan is the rcmp's co-ordinator of drugs and organized crime awareness. (cbc) conohan noted that there are some 140 different varieties of synthetic cannabinoids. while such chemicals have been prevalent in north america for several years, conohan said they haven't had much of an impact in newfoundland and labrador. but conohan said if the rcmp did receive any information on these products being available,\" it would definitely warrant some checking into if it was happening in rcmp jurisdiction. \"the federal force covers most of the province, except for the northeast avalon, corner brook and western labrador regions .\" if we received information, then we would have to do a thorough investigation to determine if in fact it were synthetic cannabinoids that were being sold, \"conohan said. adverse health effects both officers agreed such drugs can be dangerous. conohan said they can produce adverse health effects such as elevated heart rates, paranoia, vomiting, hallucinations, and even renal failure .\" it's man-made, and you don't know what you're taking, what chemicals are in it, what's being used, and the effects that it's going to have on you .' - rnc const. garry crocker crocker said it's also worrisome because people aren't aware of what they're smoking. \"it's man-made, and you don't know what you're taking, what chemicals are in it, what's being used, and the effects that it's going to have on you,\" he said. the manager at <mark>mary</mark> janes smoke shop told cbc news the store only sells the herbal incense for \"a relaxing aroma in your home,\" and not for any kind of human consumption. the owner of the chad smoke shop 420 declined to comment. cbc news is taking steps to securely destroy the packages it purchased during this investigation. \"putting your life at risk' paul daeninck is an oncologist and palliative care physician at st. boniface hospital for cancercare manitoba. one of his interests is the use of cannabinoids in the management of symptoms for cancer patients. he is warning the public to stay away from synthetic weed products. daeninck said synthetic cannabinoids were primarily developed for scientific research purposes, and carry a much stronger concentration than the levels of thc found in marijuana cigarettes. winnipeg oncologist paul daeninck is warning people to stay away from synthetic cannabinoids. (cbc) he says it can be 50 to hundreds of times more potent .\" they have not gone through any sort of toxicology, they haven't gone through any sort of testing to look at human consumption, \"daeninck said .\" from a health point of view, it's extremely dangerous, incredibly dangerous to be playing with any of this stuff. \"daeninck said people who use synthetic weed may experience psychosis, and there have even been documented cases of people committing suicide .\" these people literally are putting their life at risk by taking this stuff, \"he said. research in the united states suggests that the 12 - to 17-year-old demographic are the primary users of these products. as a parent, daeninck said he's concerned about synthetic weed being marketed to kids. a vehicle slid into a school bus in the cowan heights area of st. john's on wednesday morning. seniors looking for affordable housing in springdale now have more options, with the opening of new two-bedroom apartments. after 50 years, horse racing in newfoundland and labrador appears to be coming to an end. if you're planning on travelling to or through toronto from newfoundland and labrador today, you might want to check your flight schedule. the greater toronto area is being hit with a mix of snow and rain, creating a sloppy mess throughout the region for the morning commute. with only three days to go until the rrsp deadline for the 2012 tax year, many people are scrambling to scrape together a last-minute contribution, but recent statistics suggest many more are not bothering. canadians save only four per cent of their disposable income and owe $1.65 for every $1 in after-tax household income. we break down the numbers. will annie opsquotch find her true love? sports hardly swept away with brad gushue's success don power writes on the expected lift that local curling never got on the park's 40th anniversary, land & sea looks back at the park's early years burton winters: one year later improvements have been made to search and rescue, but concerns remain your photos download the 2013 your photos calendar your favourite your photos images are featured in this year's calendar our great geography quiz check out our recent group chat and quiz on geography in a guest column, don power says repulsive acts have no place in the game video misses enid and eulalia pitch in for a park <mark>mary walsh</mark> and cathy jones help with bannerman park fundraiser tweeting an astronaut lee pitts writes on the experience of catching chris hadfield's attention bologna behind our love affair with a processed meat heather barrett presents a documentary on a deep-rooted love for bologna interactive test your memory with our annual news quiz we have 20 questions on some of the stories of 2012 santa reunited with mount cashel survivors decades later, orphans reunite with american who brought them hope rnc surveillance footage and interviews about one of n.l.'s biggest drug busts our coverage of the new neighbourhoods expanding across the northeast avalon why should i give a dam? click here for full coverage of muskrat falls - stories, opinions, and video enjoy cecil haire's driving tutorials with expert rudy singleton"}, {"articleID": "2018082005_00125314_W", "names": {"David Mcintosh": ["Q27981538", "Q3703259", "Q5237379", "Q55989505"], "Anthony Kennedy": ["Q11171", "Q59192346"]}, "date": "2018-08-20", "url": "http://journalgazette.net/opinion/columns/20180820/one-nominee-two-views", "content": "Monday, August 20, 2018 1:00 am One nominee, two views Trump pick faithful constitutional adherent <mark>David McIntosh</mark> <mark>David McIntosh</mark>, founding director of the Federalist Society, was a three-term member of the U.S. House for Indiana's 2nd District. He is a native of Kendallville. Outside the White House, no one knew the name of President Donald Trump's Supreme Court nominee until minutes before Judge Brett Kavanaugh stepped into the East Room. And yet on the most important question of all--the judicial philosophy of the nominee, whomever the president had chosen--the event was mercifully free of suspense. From the outset, we all knew that to be considered by Trump, any prospective justice would have to be a judicial conservative, understanding that courts exist to interpret our Constitution and laws without venturing to set national policy. In his 2016 campaign, the president again and again promised to appoint justices in the mold of Antonin Scalia. And now, for the second time, he has delivered exactly that. Over 12 years as a federal appeals court judge, Kava-naugh's opinions reflect a clear understanding of the judicial role under the Constitution. This is a judge who has firmly defended the separation of powers as designed by the framers; consistently adhered to the Constitution and laws as written; and left political issues to the executive and legislative branches, where they belong. He has authored more than 300 opinions for the U.S. Court of Appeals for the D.C. Circuit. Not one of them displays an impulse to overreach, grandstand or achieve any objective beyond a fair decision in the case at hand. At the appeals level, one measure of a judge's influence is how often his or her reasoning is later adopted by the Supreme Court. This has happened at least 11 times with opinions by Kavanaugh. In fact, some of those opinions were dissents that the high court found more persuasive than the majority view of Kavanaugh's circuit court colleagues. And whatever side the judge was on, his position rested on the clearest of principles. As he said on the night of his nomination, \"A judge must be independent and must interpret the law, not make the law ....A judge must interpret the Constitution as written, informed by history and tradition and precedent .\" As one of the founding directors of the Federalist Society, I of course agree with him because that philosophy is faithful to the vision of the framers. This does not mean I can predict how a Justice Kavanaugh would rule in any given case. Indeed, two of the court's most conservative members, Clarence Thomas and Samuel Alito, do not always come down on the same side, even when applying fundamental constitutional principles. It does mean that Kavanaugh would not use his judicial powers to reach a desired result or to create rights not found in the law or traditions of our country. Should Kavanaugh be confirmed by the Senate, his modest, Constitution-based approach to judging would be the prevailing one on the Supreme Court, a turn of events no one on the political left was expecting just two years ago. For decades, liberal activists have depended on federal courts to further agendas that have little or nothing to do with constitutional law, and that would go nowhere if pursued by democratic means. These endless judicial power plays have brought deep divisions to the country. Now, so very suddenly, the winds have changed and the era of judicial supremacy is coming to a close. This explains the spreading panic in progressive circles over an obviously well qualified nominee. Lacking serious objections, all that Senate Democrats will have against Kavanaugh are menacing caricatures and hysterical warnings--tactics likely to work as well as they did against Justice Neil Gorsuch. As the nomination advances, it will be little noted that Trump's model justice, Scalia, was confirmed by a unanimous vote, as was the departing Justice <mark>Anthony Kennedy</mark>. That's a reminder of a time when obvious merit made for a straight path to confirmation. We're now in a different day, when Senate Democrats are reduced to vowing, as Minority Leader Charles Schumer has put it, to resisting the nominee \"with everything I've got .\" The need for such bluster, however, only draws attention to what Kavanaugh's got--which is, by every measure, the ability, temperament and character we should all expect in a Supreme Court justice."}, {"articleID": "2010021906_00077159_W", "names": {"Sir John": ["Q28124344", "Q45996744"]}, "date": "2010-02-19", "url": "http://lubbockonline.com/stories/021910/fea_564847494.shtml", "content": "one almost feels sorry for director joe johnston, who parlayed his work as an art director on the original \"star wars\" trilogy into increased budgets and respect as a director of family-oriented movies. the wolfman': hollywood horror classic reduced to shaggy dog story in remake by william kerns | a-j entertainment editor story last updated at 2/19/2010 - 12:10 am one almost feels sorry for director joe johnston, who parlayed his work as an art director on the original \"star wars\" trilogy into increased budgets and respect as a director of family-oriented movies. his attempt to remake george waggner's 1941 \"wolf man\" is little more than an ineffective overdose of cgi effects, gore and body parts, none of which are frightening. the shame is that johnston had so skillfully avoided r-rated products to this point. he made studios money with 1995's \"jumanji\" and \"jurassic park iii\" in 2001. and his best efforts are 1991's \"the rocketeer\" and the critically acclaimed \"october sky\" in 1999. all shine when compared to this new horror film. but then, who could blame johnston for jumping at the offer, especially with universal pictures ready to hand him a $100 million budget? unfortunately, \"the wolfman\" appears to have eaten up a half decade of his life, with little positive to show for it. indeed, the film is never clever or scary. those hoping to see a nightmarish \"wolfman\" most likely will just leave bored. to johnston's credit, even the studio's revolving release dates between 2007 and 2010 did not stop him from at least attempting to stress atmosphere and mood over pacing and blood. his fog machines never lost power, giving one the impression that things have been wrong for quite some time at talbot hall. mere candlelight is strong enough to reveal <mark>sir john</mark> talbot (anthony hopkins) taking no notice of cobwebs hanging from the staircase. the family has issues. that much becomes clear even before benicio del toro's lawrence talbot reveals affection for his late brother's wife, and recalls how his father committed him to life inside an asylum for a year as a child. a return to that asylum provides medicinal torture, only serving to make one look forward to martin scorsese's \"shutter island .\" more than once, hopkins welcomes del toro home as a \"prodigal son,\" but this is hardly preparation for the ridiculous departure taken by the screenwriters in the film's final conflict. production design and danny elfman's music score are proof that johnston at least put some thought into homage as much as horror. opening subtlety is lost quickly. there is no mystery, in fact, not when hopkins spends years locking himself behind bars in the family crypt during years of full moons. performances are disappointing overall. the villagers' combination of fear and superstition is well acted, but hopkins mails in his own performance and del toro cannot drum up enough believable passion even during his most important transformation. emily blunt is forgettable as the woman who attracts the love of two brothers. faring only somewhat better is hugo weaving as the scotland yard officer who actually asks, \"do you have any silver bullets?\" during a foot pursuit. photo credit: frank connor / uni / ap (l to r) lawrence talbot (benicio del toro) is taunted by <mark>sir john</mark> talbot (anthony hopkins) in the action-horror inspired by the classic universal film that launched a legacy of horror,? the wolfman?. a-j reviews...\"the wolfman' • stars: benicio del toro, anthony hopkins, emily blunt, hugo weaving, art malik and geraldine chaplin. • rated: r for bloody horror, violence and gore - tinseltown 17, movies 16 and the stars & stripes drive-in."}, {"articleID": "2013021004_00024742_W", "names": {"Robin Singh": ["Q3520910", "Q3527347", "Q7352786"]}, "date": "2013-02-10", "url": "http://deccanchronicle.com/130209/sports-cricket/article/i-need-convert-fifties-hundreds-ambati-rayudu", "content": "hyderabad: fajar: 5.44 am zohar: 12.40 pm mumbai: rest of india batsman ambati rayudu, who cracked an unbeaten 118 against mumbai, is happy with the way his batting is shaping up but said he needs to convert the fifties into hundreds. \"rest of my career i need to convert those fifties i think. i have lot more fifties than hundreds. it is 27. the ratio should go up. hopefully it will go up in the next half of my career,\" he told reporters here. rayudu notched up his 14th first-class century on saturday, while playing his first irani cup match and he said, \"i threw it away in the first innings, so i was just thinking to make sure to keep batting no matter how many runs i get. to be honest i have had a very quality season. it is not that i am disappointed. i am obviously disappointed that i haven't got big hundreds as such but the crucial innings i have played in difficult conditions, i am happy with the way i am shaping up and my batting. hopefully now the innings will come,\" he added. on his move from hyderabad to baroda, rayudu said, \"it is not about the move from hyderabad to bardoda as such, being with people like <mark>robin singh</mark> and our coach sanath kumar, that really helped me grow as a batsman and get my mind right. it is more of that which has helped me .\" ambati rayudu says that is happy with the way his batting is shaping up but needs to convert the fifties into hundreds. asked how this knock would augur for him, with the selectors meeting on sunday to decide the squad for the australia series, he said, \"i don't know. i haven't actually thought about it. i am just happy with the way i am batting .\" "}, {"articleID": "2018020217_00902559_W", "names": {"Hugo Chavez": ["Q732006", "Q8440"], "Andrew Hay": ["Q21174027", "Q21456447", "Q39078862", "Q43912209"]}, "date": "2018-02-02", "url": "http://uk.reuters.com/article/uk-venezuela-politics-usa/venezuela-derides-u-s-comments-on-military-ouster-of-maduro-idUKKBN1FM1ZE?il=0", "content": "February 2, 2018 / 3:34 PM / Updated 19 minutes ago Venezuela derides U.S. comments on military ouster of Maduro Alexandra Ulmer, Vivian Sequera 4 Min Read CARACAS (Reuters) - Venezuela condemned on Friday U.S. comments that its own military could topple President Nicolas Maduro and said a Latin American tour by Secretary of State Rex Tillerson was seeking a regional \"intervention\" against the socialist government. Accusing Washington of seeking to undermine democracy in Latin America and return to the days of \"imperialism,\" Defence Minister Vladimir Padrino lashed out at Tillerson during a broadcast on state television. \"Every day he distances himself more from diplomacy to enter into war-mongering. You have no moral authority,\" said Padrino, flanked by armed forces' top brass who swore loyalty to Maduro. \"This man...will try to persuade Latin America governments to intervene in Venezuela. That's a publicity stunt,\" he added, blaming U.S. President Donald Trump's sanctions for economic hardship in Venezuela. On Thursday, Tillerson raised the prospect of a Venezuelan military coup ahead of a five-day tour of Latin America. Discussing Venezuela, the U.S. official said militaries in Latin America often \"handled\" transitions from bad governments, but insisted he was not advocating \"regime change .\" \"If the kitchen gets a little too hot for him, I am sure that he's got some friends over in Cuba that could give him a nice hacienda on the beach and he could have a nice life over there,\" Tillerson said, referring to 55-year-old Maduro, who has a close relationship with Cuba's communist government. U.S. Secretary of State Rex Tillerson steps off his plane as he arrives to the presidential hangar in Mexico City, Mexico February 1, 2018. REUTERS/Henry Romero Many opposition leaders would love for Maduro to seek exile abroad. The former bus driver and union leader is widely disliked in Venezuela due to a brutal economic crisis that has sparked malnutrition, disease and mass emigration. But even some anti-government activists fear Washington's heavy-handed approach will only foster unity between the Socialist Party and the armed forces, as they would be loathe to seem to be taking orders from Washington. The U.S. comments will likely also cause unease in capitals of Latin America, where memories are rife of U.S. backing for right-wing dictators during the Cold War. That could hamper Tillerson's ability to reach a consensus on Venezuela during his trip. Senior military leaders have consistently stood by Maduro, whom critics accuse of turning Venezuela into a dictatorship and wrecking its economy. But discontent among the rank-and-file, especially at their own economic penuries, is evident. There have been some small uprisings against Maduro from within the security forces. A National Guard captain led an attack on a barracks but was later arrested, and a police helicopter pilot lobbed grenades at government buildings but was tracked down and killed last month. Venezuela's opposition leaders have long urged the military to take action to force Maduro to follow the constitution. He maintains the United States and opposition parties are part of an international right-wing conspiracy to oust him and get their hands on the OPEC nation's oil wealth. Trump has himself suggested possible military intervention in Venezuela, though that was widely rejected in Latin America. Trump has imposed individual and economic sanctions on Venezuela's government, accusing it of rights abuses and corruption. Venezuelan officials say Tillerson is particularly bitter towards them because he was chief executive of Exxon Mobil Corp when late leader <mark>Hugo Chavez</mark> nationalized one of its oil projects in the South American nation a decade ago. Additional reporting by Girish Gupta, Andreina Aponte, <mark>Andrew</mark> Cawthorne; Writing by Alexandra Ulmer and <mark>Andrew</mark> Cawthorne; Editing by Bernadette Baum and <mark>Andrew Hay</mark>"}, {"articleID": "2014051607_00013606_W", "names": {"Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"]}, "date": "2014-05-15", "url": "http://www.politico.com/story/2014/05/scott-brown-2014-romneycare-obamacare-106669.html", "content": "He has called Obamacare a \"disaster,' a\" fiasco' and a \"government takeover .' | Getty CONCORD, N.H. - <mark>Scott Brown</mark> is on an\" Obamacare isn't working \"tour. Yet for all the vitriol, <mark>Brown</mark> may not be the purest critic. Obamacare is an offshoot of Romneycare, which <mark>Brown</mark> supported as a Republican state lawmaker in Massachusetts. That gives <mark>Brown</mark> the same problem Mitt Romney had while running for president in 2012: explaining why he likes and still defends a health reform law packed with mandates in Massachusetts while declaring its central elements unfit for the nation. <mark>Brown</mark> insisted in an interview that although Obamacare is\" the biggest issue in New Hampshire \"he is not taking health care cues from Romney .\" He's not told me anything, \"he said .\" I haven't talked to anybody about it. I understand the issues and do my own research. \"Yet <mark>Brown</mark> is not reticent about enlisting Romney to make his case, including a fundraising appeal highlighting the very topic that confounded Romney's own candidacy .\" The only way to get rid of Obamacare once and for all is to get rid of the Obamacare Democrats who forced it upon the American people in the first place...starting with Sen. Jeanne Shaheen, \"Romney wrote on <mark>Brown</mark>'s behalf. No candidate's political identity is more intertwined with Obamacare than <mark>Scott Brown</mark>'s. His ongoing praise for Romneycare and condemnation of Obamacare is the conundrum of his unusual bid to unseat Democrat Shaheen and become the first person to represent two states in the Senate since 1879. Also on POLITICO: Massachusetts ditches RomneyCare health exchange) Opposition to President Barack Obama's health law worked for <mark>Brown</mark> - once. It propelled him from the backbenches of the Massachusetts State Senate to Washington in 2010. Less than three years later, he was voted out. It was arguably easier to attack the federal version of the law when Massachusetts already had a state-based program to cover its own people. It may be harder to finesse as <mark>Brown</mark> transplants himself to New Hampshire, where enrollment in Obamacare exceeded goals. More than 40,000 people signed up, including 31,000 with subsidies, and the GOP-led state Senate recently joined Democrats to expand Medicaid, covering more low-income people in the state by embracing a key piece of the federal health law. Shaheen, like many of the vulnerable Democrats up for reelection in November, has been reticent about Obamacare. But she said in an interview outside the Senate chamber this week that\" successes \"are emerging .\" I think people are beginning to see the changes the health care law has made, \"she said, while again pledging to keep addressing its flaws. CARTOONS: Matt Wuerker on Obamacare) There are, of course, plenty of voters in New Hampshire who oppose the president's health law fiercely, and <mark>Brown</mark> barreled into the state promising to be their champion. One health insurer dominates the exchange, he notes, and there's been a particular outcry here from people who can't see the doctor they are used to, or go to the nearest hospital without incurring extra costs. And there were those politically toxic canceled health plans. <mark>Brown</mark> hammers on those points on his tour, and he spends most of his stump speech slamming the law and the ills he says it has wrought on New Hampshire. He makes passing mentions of high energy costs and emphasizes his\" long and strong ties \"to New Hampshire. But he repeatedly returns to the harm of Obamacare - and he lays the blame in Shaheen's lap .\" She's the deciding vote on Obamacare, along with all the other Democrats that rammed it through Congress, \"<mark>Brown</mark> said on his tour stop .\" Since when does the federal government tell us what to do and how to do it? That's not what we believe in here, that's not what I believe in. \") Shaheen has been talking about small businesses, jobs and veterans more than the Affordable Care Act. Her campaign notes her support for the health law but emphasizes her efforts to\" improve \"it, a staple for embattled Democrats. Lately though, she's beginning to describe more bright spots, including robust enrollment numbers. She also said as many as five insurers are thinking about joining New Hampshire's exchange next year, undercutting <mark>Brown</mark>'s argument about a lack of competition. She also pounced on <mark>Brown</mark>'s role in passing Massachusetts's health care law, accusing him of having\" changed his mind \"on policies he supported as a state senator .\" I don't know where <mark>Scott Brown</mark>'s been, \"she said .\" There are fixes that we need to make but the answer is not to repeal the law. \"For his part, <mark>Brown</mark> says he's not conflicted about his health record .\" I have no challenge. I'm very clear. I know what I did. I know how I voted, \"he said in the interview .\" We addressed a situation in Massachusetts that everybody worked on together...That's not what the federal plan did. And we didn't raise taxes, and we didn't cut Medicare. \"Polls show Shaheen leading by a few points, but it's early and lots of voters are undecided. Americans for Prosperity recently announced a\" six-figure \"ad buy here, hammering Shaheen on Obamacare and helping <mark>Brown</mark>. Republicans need to pick up six seats to take control of the Senate. They want New Hampshire to be one of them."}, {"articleID": "2016122218_00481205_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-12-22", "url": "http://www.chieftain.com/news/5471134-120/health-law-pelosi-care?#comments", "content": "Pelosi rallies House Democrats to oppose health law repeal By MARY CLARE JALONICK Associated Press Published: December 22, 2016; Last modified: December 22, 2016 09:54 AM WASHINGTON--House Democratic Leader Nancy Pelosi is calling on members of her caucus to begin the new Congress by highlighting the risks of repealing the health care law. In a letter to Democratic colleagues late Wednesday, Pelosi said 2016 has been a difficult year for the country and that House Democrats \"stand ready to fight vigorously for America's hard-working families .\" Pelosi asked the lawmakers to hold press events in early January to tell voters about Republican plans to repeal the law, called the Affordable Care Act, at the beginning of the year. Republicans will begin work immediately next year toward repealing the health care law. Some Republicans, including <mark>Donald Trump</mark>'s nominee to lead the Health and Human Services Department, have also sought to overhaul Medicare. Discuss this story"}, {"articleID": "2008111822_00010777_W", "names": {"Seth Green": ["Q186757", "Q7456486"], "Steve Martin": ["Q16473", "Q2347163", "Q48152466", "Q55085130", "Q55085225", "Q7613276", "Q7613279", "Q7613281", "Q7613283"]}, "date": "2008-11-18", "url": "http://feeds.sfgate.com/click.phdo?i=9d372f2512c3b25f423e8d05fb94aa89", "content": "sunday november 16th <mark>seth green</mark> and friends continue to lampoon the star wars franchise with has been canceled, although it appears nbc will continue to air the remaining episodes. normally, this would be the time to totally abandon a mediocre show; it'll be gone soon, and it wasn't very good anyway. but maybe the show's creators will go totally nuts and quickly add some craziness to the plot, like having it turn out that everyone is a robot, or the spies are actually controlled by a super-secret agency run by monkeys! or robot monkeys!...at least, that's what i'd do if it were my show. 10 p.m. on nbc. tuesday november 18th big boi from outkast guest stars on \"law & order: svu\" as a hip hop artist named gots money...and i think i just broke word's spelling and grammar check with that sentence. 10 p.m. on nbc. wednesday november 19th another model is destined for obscurity in the eleventh season finale of \"america's next top model .\" 8 p.m. on the cw. thursday november 20th this week's \"30 rock\" superstar guest appearance: <mark>steve martin</mark>!...i know the show has been hurting for ratings in the past, but i really hope they don't go on much longer with the stunt casting. i don't want spencer and heidi showing up trying to get into tracy's posse. save that for \"how i met your mother .\" 9:30 p.m. on nbc. friday november 21st \"15 most infamous child star mugshots .\" two-hours worth. nothing else needs to be said, really. 8 p.m. on e! an episode of \"mystery science theater 3000,\" but it's also pretty hilarious on its own. check it. watch it at 12:15 a.m. (late friday night) on tcm. san francisco native rain jokinen watches too much tv and thinks you should, too. she's been writing about tv for over 10 years in her musty tv email newsletter and tube tops column for the culture blog and the chronicle's tv week listings guide every sunday, and"}]