[{"articleID": "2018042600_00039931_W", "names": {"James Richardson": ["Q16226010", "Q18637809", "Q43912606", "Q4394973", "Q6142072", "Q6142076", "Q6142078"], "Michael Hecht": ["Q1423703", "Q6831048"], "Eric Smith": ["Q18145133", "Q21822473", "Q30122558", "Q3731526", "Q51745810", "Q5387537", "Q5387540", "Q5387541", "Q5387543", "Q57895239"], "Anthony Davis": ["Q20961727", "Q317008", "Q344683", "Q4770853", "Q4772366", "Q4772367", "Q4772368", "Q4772369", "Q675140", "Q730880"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"]}, "date": "2018-04-25", "url": "http://www.washingtontimes.com/news/2018/apr/25/louisiana-editorial-roundup/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Louisiana editorial roundup After Macron visit, will Trump come back to Paris climate deal? Question of the Day By The Associated Press - Associated Press - Wednesday, April 25, 2018 Recent editorials from Louisiana newspapers: ___ April 24 The Town Talk on responsibility for pollution: In sports, fans of top-ranked teams will sometimes be accused of trash talking. Today we're going to do some trash talking of our own based on a high rating, but it's not in a proud way. Just in time for Earth Day, which was celebrated Sunday, Louisiana ranked 5th overall in the nation in a recent survey of the \"most polluted\" states. Texas, New Jersey, Michigan and Pennsylvania took the top four spots. Nevada, South Carolina, Georgia, Kansas, and Oklahoma rounded out the top 10. The \"most polluted\" rankings are based on evaluated indicators from government, nonprofit and private sources, including observations by citizens, deaths from collisions with rubbish, \"profiled litterer\" population percentages, effectiveness of litter abatement spending, public entity corruption rankings and discernible maintenance by employees, contractors and volunteers. Pollution results vary in Central Louisiana. On the one end you have communities like Pineville that routinely earn recognition in the annual Cleanest Cities contest. On the other end of the spectrum, Grant Parish recently created a traveling garbage display to help residents realize just how much trash is being tossed out in their community. Recent Gallup Polls have found a majority of Americans have a \"great deal of concern\" about toxic pollutants lingering at water and landed areas managed by states and localities. We have seen those government-regulated environmental concerns grow locally, most notably regarding the Clean Harbors open-burn facility in Grant Parish where expired and surplus explosive materials are destroyed. The most visible sources of litter are the fast-food wrappers and plastic drink bottles that dot our roadways. But it's not uncommon to find larger items along local roadways, from full trash bags to chunks of truck tires to furniture items that have fallen from vehicles. Littering damages landscapes, breeds diseases, causes injuries and deaths to animals and humans. You may be surprised to learn more than 800 Americans die every year from vehicle crashes with ordinary litter like the aforementioned tire chunks and furniture items. Even coolers or other unsecured loads falling from trucks and trailers can appear out of nowhere in front of a driver and cause a fatal crash. We're somewhat more fortunate in Rapides Parish than other areas as inmate crews routinely work local roadways picking up trash and a number of communities have made maintaining a clean community a priority. We're grateful to those who are working to keep Central Louisiana clean, and we encourage all residents to do their part to lessen the workload. Rather than carelessly tossing trash from the car, please wait and throw it out when you reach your destination. If you have a pickup truck or open trailer, please take the time to secure any loose items so they don't blow out while you are driving. It's nothing more than using some common sense and common courtesy to be a good - and clean - member of the community. Online: https: //www.thetowntalk.com April 25 The Advocate cheers the announcement of a petrochemical plant: The numbers really are staggering: $9.4 billion in direct foreign investment, 1,200 permanent jobs, 8,000 construction jobs at its peak. The announcement of the petrochemical plant in St. <mark>James</mark> Parish just south of the Sunshine Bridge is a huge win for the community but also for the state as a whole. Sunshine, indeed. The company bought 2,400 acres for the site and anticipates that construction - lasting over a decade - could begin as soon as next year. Because of the size of Formosa's investment and the number of jobs the plant will create, it will \"fundamentally alter the economy and the wealth of the River Region,\" said <mark>Michael Hecht</mark>, president and chief executive officer of Greater New Orleans Inc., the regional economic development agency. \"This is a big one,\" he said. We congratulate Gov. John Bel Edwards, GNO Inc. and the state's economic developers for this success. We note that this has been a long time in the works, beginning in the administration of former Gov. Bobby Jindal and continuing into today. There's a lot of credit to go around. Louisiana's banks of the Mississippi are among the world's great concentrations of petrochemical refining and manufacturing. Our state is home to a network of pipelines and railroad connections and also a direct source of natural gas, cheap and plentiful, to fuel such a major plant. An economic impact study done by LSU economist <mark>James Richardson</mark> forecast the 10-year construction period will yield $362 million in new state and local tax receipts, plus $313 million in new state and local taxes during the initial 10 years of operation, beginning in 2025. The project will take advantage of the state' Industrial Tax Exemption Program. Although state and community leaders have not always been strategic in the tax breaks they grant to business, we're heartened that tax policy here seems aimed at capital investments representing a long-term commitment to the region. And we're hopeful that the environmental impacts of the project can be addressed in a way that balances progress and sound stewardship of land, air and water. This is a long-term investment. It is one that we hope will not become embroiled in the pointless trade debate with China that has begun, but has not yet escalated, under President Donald Trump. However, steel tariffs - and a $9 billion plant uses a lot of steel - can be an additional cost for the company. Even the president cannot object to the Formosa plant: The company is not from the mainland Communist-ruled China but the independent and democratic Republic of China on Taiwan. The island was formerly named Formosa; its namesake company already has been an investor and contributor to Louisiana's economy since 1981 with facilities in Baton Rouge and in Pointe Coupee Parish. This is, as <mark>Eric Smith</mark> of Tulane's Energy Institute said, a nice confirmation of Louisiana's vitality in petrochemical manufacturing. A very nice confirmation, we think, and one that is sweeter because our friends in Texas competed vigorously for the site selection. Online: http: //www.theadvocate.com The Houma Courier on the New Orleans Pelicans: The New Orleans Saints have held a place in local sports fans' hearts for decades. Often the lovable losers, they had enjoyed a few brief brushes with success over the years, but none of the good runs continued. The past decade, though, has seen the fan base turn from steady, local and faithful to rabid and nationwide. That's due in large part to the team's recent success with coach Sean Payton and quarterback Drew Brees. The New Orleans Pelicans are hoping they've tapped into a similar vein of success with All-Star forward <mark>Anthony Davis</mark> and a host of young stars around him. Since his arrival last season as a free agent, center Demarcus Cousins has added fuel to the excitement surrounding the team. Unfortunately, a misstep in the final seconds of a game back in January left Cousins with a torn Achilles tendon, unable to play the remainder of the season. The team and its fans worried that their hopes for a playoffs appearance could be dashed. And the team went on a losing streak that saw it drop five of its next six games and looking increasingly unlikely to make the postseason. But <mark>Davis</mark> and his healthy teammates then went on a 10-game winning streak and a strong finish to the season that propelled them into the playoffs. Their playoff matchup was the Portland Trailblazers, who had split the season series with the Pelicans - with each team winning two of the four games. The Blazers finished with the third seed in the West, the Pelicans the sixth. Most national observers assumed Portland would beat New Orleans handily. They were wrong. The Pelicans won four straight games to sweep Portland out of the playoffs and await their Round 2 opponents. In fact, the Pelicans were the only team in the first round to sweep its opponent - an impressive feat for a team that just a few months ago seemed on the verge of collapse. Their fans, meanwhile, remain hopeful that they can once again defy the odds, as they will likely face the defending champion Golden State Warriors in the second round. But with the Pelicans riding the longest active winning streak in the NBA, anything is possible. The Pelicans might never enjoy the kind of love the Saints have with their fan base. But they are doing everything they can to make local fans once again embrace the winning tradition in New Orleans - a feeling many haven't felt since point guard <mark>Chris Paul</mark> was leading the team to multiple postseason appearances. If nothing else, <mark>Davis</mark> and his team are helping south Louisiana fans through the long months that precede the football season. Let's go, Pelicans! Online: http: //www.houmatoday.com/"}, {"articleID": "2009072414_00066303_W", "names": {"Thomas Moore": ["Q16929722", "Q20707242", "Q30122690", "Q3525423", "Q3725484", "Q53770004", "Q57633659", "Q58887370"]}, "date": "2009-07-24", "url": "http://publishersweekly.com/article/CA6672574.html?rssid=192", "content": "cpsc issues policy statement on cpsia tracking labels this article originally appeared in pw's children's bookshelf. sign up now! by karen raugust--publishers weekly, 7/23/2009 3:00:00 pm the consumer product safety commission issued its long-awaited statement of policy on the tracking labels required for all manufacturers of children's products, under the consumer product safety improvement act. new chairman inez tenenbaum, as well as commissioners <mark>thomas moore</mark> and nancy nord, voted on monday to approve the guidelines. the tracking label provision, section 103 (a) of the cpsia, goes into effect on august 14 and affects only products manufactured on or after that date. the guidelines allow publishers to be flexible in how they comply with the provision, which is what the industry, through the association of american publishers, had been pushing for. in a statement about the new policy, tenenbaum said: \"the commission...has agreed that section 103 (a) does not require a uniform\" one size fits all' labeling system. rather, the only \"uniform' requirement is that the tracking information required by statute be ascertainable from the distinguishing marks made on the children's product and its packaging. how an individual manufacturer chooses to achieve this end is left to the reasonable judgment of each individual manufacturer .\" in other words, publishers can print the \"tracking label,\" which must be permanent and appear on the product and packaging, anywhere on the book and in any form, as long as it contains the specific source of the product, including the country, city and state where the product was manufacturered, the date of production, and cohort information such as the batch or run number. the information can be printed in full on the product, or a code can be used to allow consumers to find the information online. click here to read a list of faqs about compliance with section 103 (a). test older books. all publishers of books printed from august 14 forward must include tracking labels on their products, whether or not they must test for lead. alison morris, children's book buyer, wellesley booksmith, wellesley, mass. josie leavitt, co-owner, flying pig bookstore, shelburne, vt. images from barbary vey's trip to the 2008 romantic times booklovers convention. here are some photos from the new york anime festival all rights reserved. use of this web site is subject to its"}, {"articleID": "2018112723_00078089_W", "names": {"Dennis Green": ["Q26986595", "Q464128", "Q5258464"], "Scott Cutler": ["Q21005492", "Q7436203"]}, "date": "2018-11-28", "url": "https://www.businessinsider.in/ebay-says-that-cyber-monday-and-black-friday-set-sales-records-for-the-site/articleshow/66836646.cms", "content": "Ebay says that Cyber Monday and Black Friday set sales records for the site <mark>Dennis Green</mark> Nov 28, 2018, 04.29 AM Facebook Linkedin WhatsApp Twitter Google + Reddit Read full story Getty/Ki Price Ebay has hit another milestone in its bid to become a big online player. Auction-site-turned-online-marketplace Ebay says it had record-setting Black Friday and Cyber Monday events this year. The site also revealed some of the items that customers purchased the most. The days from Thanksgiving to Cyber Monday - which Ebay refers to as the \"Cyber 5\" - have been good for online retailers this year, the data shows. Ebay had a blockbuster Black Friday and Cyber Monday, the company said on Tuesday. Both Black Friday and Cyber Monday marked records for the site. Cyber Monday beat Black Friday in terms of dollar sales, meaning it was likely the company's biggest day in history, though an Ebay spokesperson would not confirm that. Cyber Monday was Ebay's largest sales day ever in 2017, according to TechCrunch. \"Ebay drove record sales on Black Friday and Cyber Monday,\" <mark>Scott Cutler</mark>, SVP of the Americas for Ebay, said in a statement. \"We're delivering what customers want - the best prices with guaranteed delivery .\" Ebay also released some top sellers for Cyber Monday and Black Friday. It said it sold a Nintendo Switch console every 13 seconds and an Apple Watch every 26, while deals on the Apple iPhone X, Apple MacBook Air, and Adidas Yeezy 350 Boost V2 Cream Triple White shoes sold quickly. Read more: Amazon reveals the best-selling items that it says helped Cyber Monday become its biggest shopping day in history The website did not say how much its sales increased over last year in either hard numbers or by percentage. According to Adobe Analytics, which takes data from 80 of the top 100 online retailers, Cyber Monday saw an estimated $7.9 billion in online sales, representing about 19% growth over last year. It's still a record, but it didn't match the pace of growth seen on Black Friday this year, when online sales grew by 23.6% to reach $6.2 billion. In recent years, Ebay has pivoted from its auction-style roots to become a marketplace for brands to sell to consumers, much like Amazon. Now, about 80% of its sales are non-auction, buy-it-now offerings. It often offers deals on shopping holidays in the hopes of becoming a holiday-shopping destination like Amazon, Target, Best Buy, and others. More on Cyber Monday 2018: More people shopped online than in stores as the holiday shopping season kicked off, signaling the end of Black Friday as we know it Amazon's emphasis on \"the Turkey 5' reveals Black Friday and Cyber Monday as we know them are dying Walmart and Amazon are offering massive deals to keep Cyber Monday from getting killed Amazon's best late-night Cyber Monday deals you don't want to miss - here's your cheat sheet NOW WATCH: 7 things you shouldn't buy on Black Friday {{}} Facebook Linkedin WhatsApp Twitter Google + Reddit Next Story Salesforce delivers\" beat and raise' despite rocky few months on the market More from this author Amazon's emphasis on the \"Turkey 5' revea...Amazon reveals the best-selling items tha...Amazon may have just had its best Black F.. . Walmart and Amazon are offering massive d.. . Amazon reveals top-selling Black Friday i.. . Related Stories Moody's is signaling that the retail apocalypse is...Target's CEO just signaled the end of the retail a.. . Business Insider is hiring a paid retail reporting...Promoted Stories When you travel to India, you travel within Incredible India Sign Up & Refer 10 friends to get an iPhone XR InstaReM Travel to India, discover an evolved self Incredible India"}, {"articleID": "2012060215_00017508_W", "names": {"Paul Lambert": ["Q246724", "Q42306921", "Q47511367", "Q52134533", "Q7151926", "Q7151928", "Q7151929", "Q7151930"]}, "date": "2012-06-02", "url": "http://chesterchronicle.co.uk/chester-sport/national-sport/2012/06/02/villa-fans-back-lambert-appointment-59067-31100257/", "content": "villa fans back <mark>lambert</mark> appointment jun 2 2012 aston villa fans have given their backing to the appointment of <mark>paul lambert</mark> as their new manager. press association sport understands <mark>lambert</mark> has signed a three-year contract with the midlands club. it is believed villa have not paid any compensation after <mark>lambert</mark> resigned as canaries boss on thursday having been refused permission to speak to villa. jonathan fear, of the leading villa fans website \"vital villa', said:\" i think it is a smashing appointment. he was the number one target and they were prepared to wait for him. it is a good, solid appointment and he can have a look from top to bottom at what is needed at villa. \"he continued:\" he has worked wonders at every club he has been at. we had a poll on our site of 14 managers and he led from start to finish as the first choice. it is the opposite of last year and we've got a fans' favourite coming in this time. \"leading german manager ottmar hitzfeld - now manager of switzerland - has praised the qualities of <mark>lambert</mark>, whom he managed when in charge of borussia dortmund. hitzfeld, who led dortmund and bayern munich to champions league success, said:\" i have always followed <mark>paul</mark> since he left dortmund, and i congratulated him on his promotion to the premier league with norwich city. \"as a player, he always thought like a coach. he was a leader so it is no surprise that he has become a successful manager. <mark>paul</mark> was a very good team player. that is one of the most important qualities as a coach and manager of a team .\" villa confirmed the appointment via a one-line statement on their official website. it read: \"the board of aston villa are delighted to confirm that <mark>paul lambert</mark> has been appointed villa manager .\" <mark>lambert</mark> fits the profile of the young and hungry manager wanted by club owner randy lerner. but it was chief executive <mark>paul</mark> faulkner who has played a leading role in securing <mark>lambert</mark>'s services and he was this week elected onto the fa council. keep up to date with the news. sign up for have your say! post your views and comments and have your say on the chester stories and issues that affect you."}, {"articleID": "2016082601_00417550_W", "names": {"Robert Thomas": ["Q18158780", "Q30689603", "Q3938440", "Q42765313", "Q56598167", "Q7350339"]}, "date": "2016-08-26", "url": "http://wspa.com/ap/illinois-redistricting-referendum-wont-appear-on-ballot/", "content": "Illinois redistricting referendum won't appear on ballot SOPHIA TAREEN, The Associated Press Published: August 25, 2016, 9:22 pm CHICAGO (AP)--A divided Illinois Supreme Court narrowly ruled Thursday that a voter referendum seeking to change how Illinois draws political boundaries is unconstitutional, making it ineligible to appear on the November ballot. The high court, in a 4-3 decision, affirmed the ruling by a Cook County judge who determined the ballot initiative seeking to give legislative mapmaking power to an independent commission instead of lawmakers didn't meet constitutional muster. It's the second failed attempt to overhaul redistricting by petition in two years. The ruling in the high-stakes case--falling the day before an election deadline to certify fall ballots--had the potential to alter Illinois' political power dynamic, where elected officials in the Democratic-leaning state run the once-a-decade process. But in a 63-page ruling the majority justices said the measure didn't meet narrow constitutional requirements. \"The intent demonstrated by both the plain constitutional language and this court's prior case law imposes clear restrictions on the scope of permissible ballot initiatives,\" Chief Justice <mark>Thomas</mark> Kilbride wrote for the majority. \"We may not ignore our mandate by simply deferring to the redistricting approach proffered by a particular ballot proposal, no matter how appealing it may be .\" The legal arguments in the case have largely centered on whether the ballot measure met the constitutional scope of being \"structural and procedural\" to the state's Legislature. It's a high bar. Only one other petition-driven measure has made it to the ballot. Justices were sharply divided. Dissenting Justice <mark>Robert Thomas</mark> blasted the majority decision as \"nothing less than the nullification of a critical component\" of the constitution with \"particularly unfortunate\" timing. \"In Illinois, as throughout the United States, there is a palpable sense of frustration by voters of every political affiliation that self-perpetuating institutions of government have excluded them from meaningful participation in the political process,\" he wrote. Backers of the measure--called the Independent Maps coalition--said they would consider whether to seek a rehearing. They collected about 563,000 signatures for the ballot measure, claiming the current mapmaking process is too political. They wanted voters to endorse a complex new system that would include an 11-member bipartisan commission, the state auditor general and a random drawing. \"Mapmaking by legislators--the very people whose re-elections depend on partisan maps--has led to a decline in competitive elections and voter dissatisfaction,\" said Dennis FitzSimons, the group's chairman. \"Drafters of the Illinois Constitution would not recognize the interpretation made by the Supreme Court majority .\" The ballot measure was challenged through a lawsuit brought by an attorney who has long represented top Democrats, including the leader of the state party, House Speaker Michael Madigan. The complaint was filed on behalf of minority business and community leaders called the People's Map who claimed a new process would diminish minority representation. However, those arguments weren't addressed in court. \"Any attempt to weaken the rights of minority voters is an attack on democracy itself, making today's ruling a victory for a fair and truly accountable electoral process,\" People's Map chairman John Hooker said in a statement. Independent Maps, whose members included Republican former Gov. Jim Edgar and former White House chief of staff Bill Daley, dismissed the lawsuit as the work of \"entrenched\" interests. Democratic leaders have said they weren't involved in the lawsuit. Independent Maps attorneys had argued that since legislative districts are the \"building blocks of the General Assembly,\" redistricting is by its nature structural and procedural. In briefs to the high court, they addressed the intent of the Illinois Constitution, last rewritten in 1970, and argued that not reversing the Cook County judge's ruling would \"eviscerate the constitutional right\" to directly propose reforms. Gov. Bruce Rauner, the state's first GOP governor in over a decade, supported a 2014 redistricting effort as part of his gubernatorial run. A Cook County judge rejected that attempt. \"Fair maps create fair districts,\" Rauner said in a statement. \"The system is broken and controlled by career politicians,\" State election officials had already determined the measure appeared to have enough valid signatures ahead of Friday's deadline to certify ballots. ___ Follow Sophia Tareen at http: //twitter.com/sophiatareen. Advertisement & laquo; Previous Story Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Fill in your details below or click an icon to log in: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement More Stories on WSPA SC Democratic Party Defending Decision to Rename Jefferson-Jackson Dinner - COLUMBIA, S.C. (WSPA)--The South Carolina Democratic Party has decided to rename its annual Jefferson-Jackson Dinner, dropping the names of...Football practice causing more head injuries than actual games, research shows - New research is helping to pinpoint when and why younger football players get head injuries. 1 on the run, 2 in custody after police chase in Anderson - Two people are in custody and another is on the run after a police chase in Anderson. Sheriff's deputy shot in TN, suspect in custody - A Blount County deputy was shot Thursday afternoon near Maryville, Tennessee. The suspect is in custody. \"Game changing\" diabetes test created by Clemson researchers - A better test for diabetes could be on the way, thanks to two Clemson researchers. It's not just helping man, but also man's best friend. Man exposes himself to Byrnes HS students in front of school - Duncan Police have arrested a man they say exposed himself to two Byrnes High School students near the school on Monday. 11 without a home after fire in Oconee Co. - A house fire has left 11 people without a home in Oconee County. Upstate Boy Scout Councils Pilot Kindergarten Programs - Even younger boys will be able to get involved with Boy Scouts. A new pilot program called \"Lions\" will allow the Cub Scouts to include kind...Cherokee Co. deputies search for \"kind robber\" - Cherokee County Deputies are investigating a string of armed robberies in Blacksburg off of Interstate 85. Car fire closes lane on I-85 S near Exit 54 (Pelham Rd.) - Traffic is backed up on I-85 southbound due to a car fire that has closed the right lane near Exit 54 (Pelham Road). Advertisement Advertisement Advertisement"}, {"articleID": "2017071005_00716150_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}, "date": "2017-07-10", "url": "http://www.kiro7.com/news/local/senators-express-concern-over-white-house-interference-in-att-time-warner-merger/554942221", "content": "Senators express concern over White House interference in AT & T - Time Warner Merger Updated: Jul 9, 2017 - 10:38 PM The--the parent company of CNN--is widely expected to close by the end of the year, if not earlier, should it win government approval. But the question of whether it will be approved was raised this week, after that the White House, which has an adversarial relationship with CNN, was considering using the deal as \"leverage .\" $85 billion mega-merger between AT & T and Time Warner the New York Times reported TRENDING NOW: DOWNLOAD OUR FREE NEWS APP Democratic senators reacted with dismay to the Times report and warned against any White House involvement in antitrust enforcement. \"Any political interference in antitrust enforcement is unacceptable,\" Minnesota Sen. Amy Klobuchar wrote in a letter to Attorney General Jeff Sessions. \"Even more concerning, in this instance, is that it appears that some advisers to the President may believe that it is appropriate for the government to use its law enforcement authority to alter or censor the press. Such an action would violate the First Amendment .\" Fellow Minnesotan Sen. Al Franken, who opposes the merger, echoed Klobuchar's sentiment in his own statement: \"The Trump Administration's war against the media must not influence the fate of this transaction .\" During the presidential campaign, when the deal between AT & T and Time Warner was announced, on its merits, calling it \"a deal we will not approve in my administration because it's too much concentration of power in the hands of too few .\" Mr. Trump promised to block the merger But his open war on CNN has been escalating in recent days. In Warsaw this week, Mr. Trump said CNN has been \"fake news\" for a long time. \"They've been covering me in a very, very dishonest way,\" he said. And linking Trump supporter Anthony Scaramucci to a Russian billionaire, causing three journalists to resign over the report, the president responded with a \"Wow,\" and wondered \"about all the other phony stories they do .\" after CNN retracted a story But animus aside, it's not the White House that makes the call on whether the merger goes through. That's up to the FCC and the Justice Department. The FCC evaluates mergers on the basis of whether they're in the public interest. In February, FCC Chairman <mark>Ajit Pai</mark> told the Wall Street Journal that his agency would likely not be reviewing the deal because no airwave licenses would be transferred. This was, according to the Journal, a development that investors had been watching for, since an FCC review is considered to to be broader than the antitrust review conducted by the Justice Department. The AT & T - Time Warner merger is a vertical merger, meaning that the two companies are not direct competitors. This, according to the Journal, is one of the main reasons the companies are confident that the Justice Department won't reject the deal on antitrust grounds. Currently, the Justice Department does not have anyone heading the Antitrust Division, but Andrew Finch is currently serving as Acting Assistant Attorney General responsible for overseeing the division. © 2017 Cox Media Group."}, {"articleID": "2016051716_00747971_W", "names": {"Ben Bishop": ["Q12956342", "Q816445"], "Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "Joe Smith": ["Q16094198", "Q20981949", "Q22670690", "Q23662319", "Q3180189", "Q3808717", "Q42715286", "Q511111", "Q6212404", "Q6212410", "Q6212412", "Q6212415"], "Jon Cooper": ["Q16196878", "Q3183185"]}, "date": "2016-05-17", "url": "http://boltsbythebay.com/2016/05/17/tampa-bay-lightning-andrei-vasilevskiy-stood-strong-despite-loss/", "content": "Tampa Bay Lightning G Andrei Vasilevskiy Has Stood Strong Despite Loss Comment Despite losing Game 2 of the Eastern Conference Final to the Pittsburgh Penguins, Tampa Bay Lightning goaltender Andrei Vasilevskiy has stood strong in net. The Tampa Bay Lightning may have come up short in Game 2 of the Eastern Conference Final against the Pittsburgh Penguins, but it certainly was not for a lack of effort by Lightning goaltender. If anything, he is the one who consistently stood strong and really came up big when his team needed him. Andrei Vasilevskiy Andrei Vasilevskiy had a rocky start to the 2015-16 season. Just before the preseason started, Andrei Vasilevskiy was diagnosed with a blood clot near his collarbone, the same injury currently plaguing Lightning captain, which required him to have surgery and miss the whole of the preseason and the first full month of the regular season. Steven Stamkos Vasilevskiy didn't see near as many starts this season as Lightning goaltender, but in order to keep away the rust, the 21-year-old Russian netminder was sent down to the Tampa Bay Lightning's American Hockey League affiliate, the Syracuse Crunch, in order for him to get some playing time. <mark>Ben Bishop</mark> More News at Bolts by the Bay In the 24 games he was able to play in with the Tampa Bay Lightning this season, he maintained a record of 11-10-0 with a Goals Against Average of 2.76 and a Save Percentage of .910. These may not look like spectacular numbers. Being honest, they really aren't; however, there were a number of games where the Lightning came up short and the onus of the loss did not fall on the goaltender. This brings us to the postseason. Vasilevskiy has only taken the ice for three games thus far in the postseason. The second of those games came after the entire Tampa Bay Lightning fan base ceased to breathe for a few minutes when Lightning goaltender <mark>Ben Bishop</mark> was injured in the latter moments of the first period of Game 1 against the Pittsburgh Penguins at the Consol Energy Center in Pittsburgh. In relief of <mark>Ben Bishop</mark>, Vasilevskiy only allowed one goal to get past him and into the back of the net. This was the power play goal scored by Penguins right wing in the final minute of the second period. Andrei Vasilevskiy was able to stop 25 of the 26 shots brought against him, giving Vasilevskiy a Save Percentage of .962. Patric Hornqvist Now, we find ourselves on Monday night when the Lightning would once again make their way into the Consol Energy Center in order to take on the Pittsburgh Penguins in Game 2 of the Eastern Conference Final. As expected, <mark>Ben Bishop</mark> would sit this game out while he allowed his injury to heal a little bit more. This would give Vasilevskiy the start. After a pretty intense first period, which saw the Lightning and the Penguins score two goals apiece, the Tampa Bay Lightning seemed to fall flat, allowing the Penguins to walk right into the offensive zone unopposed and failed to capitalize on a number of good scoring chances. The Lightning would be able to push the Penguins into overtime. Unfortunately, a defensive miscue allowed Penguins captain to score his first career postseason overtime goal and split the series down the middle. It was quite clear when the goal horn sounded that Vasilevskiy wasn't pleased and he quickly made his way off the ice and down the tunnel to the Tampa Bay Lightning locker room. Sidney Crosby More lightning: The Jersey Restriction Argument Is In Full Force Again Being completely honest, we can't blame Vasy for being upset. For a good portion of the game, he had next to no help in front of the net. This was noticeably strange given the way the Tampa Bay Lightning defense has improved over the course of the season. While the Tampa Bay Lightning only brought a total of 21 shots against Penguins goaltender over the course of the game, the Penguins bombarded Andrei Vasilevskiy with 41 shots on goal, of which he was able to turn away 38 of those shots. <mark>Matt Murray</mark> Here is a look at one of the amazing saves Vasilevskiy made against the Penguins on Monday night. It involved the young Russian netminder sliding clear across the crease in order to rob Sidney Crosby on a backhander that went right into the glove of Vasilevskiy. Andrei Vasilevskiy's 38 save night gave him a Save Percentage of .927. Adding these numbers into his postseason totals, Vasilevskiy now has a Goals Allowed Average of 1.74 and a Save Percentage of .947. These numbers put him in league with goaltenders like Washington Capitals netminder Braden Holtby. Unsurprisingly, it is more than just Tampa Bay Lightning fans who are showering Vasilevskiy with praise. <mark>Joe Smith</mark> of the Tampa Bay Times had an opportunity to speak with Tampa Bay Lightning Head Coach <mark>Jon Cooper</mark> after the game. <mark>Cooper</mark> had nothing but good things to say about his 1A plus goaltender. \"You never want to lose your No 1 guy in Bish. But we've got 1A + behind him. He was outstanding tonight .\" <mark>Cooper</mark> said via <mark>Smith</mark>. \"He was probably the reason the game went into overtime in the first place .\" also via <mark>Joe Smith</mark>. Coach <mark>Cooper</mark> wasn't the only one showering praise on the young Russian netminder. Recently returned Lightning defenseman has nothing put positive things to say about his teammate. Anton Stralman \"He was tremendous. He played like he's done nothing else but play in playoff games. It was fun to see .\" Stralman told <mark>Joe Smith</mark>. The Tampa Bay Lightning have a long road ahead of them. The last time these two teams met in the postseason it took all seven games to decide a victor. Given the way this series has started out, there is a good chance the Lightning will be faced with the same challenge. The good news is, the next two games will be played right here in the Bolts Nation. <mark>Ben Bishop</mark> is currently listed as day-to-day. There is a chance he may be ready to go when the Lightning take the ice for Game 3 of the Eastern Conference Final. On the bright side, if <mark>Bishop</mark> isn't quite ready to go, at least Lightning fans know they have someone like Andrei Vasilevsky in net who can stand up to players like Sidney Crosby and. Evgeni Malkin Next: Lightning Look To Regain Momentum In Game 3 As we mentioned before, the Tampa Bay Lightning will be back in action on Wednesday night at the Amalie Arena in Tampa. The puck is scheduled to drop at 8:00 p.m.. If you can't make it to the game, you can always catch the live broadcast of the encounter on the NBC Sports Network. Should you desire to listen to Dave Mishkin make the call instead, all you need to do is tune into 970WFLA. More NHL coverage from FanSided: Top Stories"}, {"articleID": "2011011118_00066806_W", "names": {"Mark Siegel": ["Q28007123", "Q6769716"], "Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2011-01-11", "url": "http://appleinsider.com/articles/11/01/11/att_wont_speculate_on_plans_to_match_verizons_iphone_wi_fi_tethering/", "content": "verizon iphone to arrive february 10th, read all the details here at & t won't \"speculate' on plans to match verizon's iphone wi-fi tethering with verizon announcing plans to offer its iphone 4 customers the option to tether several devices to the handset's 3g connection over wi-fi, rival at & t is remaining mum on whether it plans to match that offer for its own iphone customers. iphone announcement tuesday, verizon said that each iphone 4 for its network will come bundled with a free 3g mobile hotspot app for tethering the handset's data connection over wi-fi to up to 5 devices, such as notebooks, ipads, ipods and other mobile devices. upon closer inspection following the announcement, it appears that the hotspot app is actually a native component built into the yet-to-be-released ios version 4.2.5, which was running on the cdma iphone 4 handsets present at verizon's presentation tuesday. verizon is likely to charge a standard monthly fee for the actual tethering service, though pricing details were note made available as part of tuesday's announcements. nevertheless, the offer promises more flexibility that at & t's existing tethering option for iphone customers, which offers tethering only via bluetooth or usb for $20 per month. that means at & t iphone users can't have their ipad (and most other devices outside of macs and pcs) piggyback on their handset's data connection. when asked by appleinsider whether it has any plans to turn around and match verizon's wifi tethering, at & t wouldn't confirm or deny a move in either direction .\" as you can appreciate, i am not going to speculate on what we might or might not do in the future, \"said at & t spokesman <mark>mark siegel</mark>.\" for iphone users who want the fastest speeds, the ability to talk and use apps at the same time, and unsurpassed global coverage, the only choice is at & t. \"apple's cdma iphone runs ios 4.2.5 with a built in hotspot setting | source: arstechnica recently, at & t has been unwilling to be upstaged by its largest rival. for instance, it took the carrier only a matter of hours last january to verizon media event on jan. 11 fuels apple iphone speculation [u] apple's new cdma iphone has built-in wi-fi hotspot with ios 4.2.5 at & t won't\" speculate' on plans to match verizon's iphone wi-fi tethering verizon iphone offers wi-fi tethering but no simultaneous data and voice [u] apple's verizon iphone could mean tough year for at & t, analysts say verizon may spend more than $5 billion subsidizing iphone sales in 2011 apple releases mac os x 10.6.6 with mac app...verizon iphone to use existing plans, similar...first look: apple's mac app store simplifies...google android passes apple's iphone in total...verizon, apple announce cdma variant of iphone...ces: microsoft keynote underwhelms with few...wsj: verizon to announce cdma iphone 4 on...briefly: apple shareholder proposal, vlc app...at & t says verizon iphone users will...(117) rim announces 4g playbook coming to sprint...report: tablet buyers will rapidly upgrade,...ces: motorola challenging apple's ipad with...ces: samsung eyes smart tv as center of...(94) apple restricting employee vacations as first...apple's new cdma iphone has built-in wi-fi hotspot with ios 4.2.5 at & t won't \"speculate' on plans to match verizon's iphone wi-fi tethering verizon publishes frequently asked iphone 4-related questions verizon iphone offers wi-fi tethering but no simultaneous data and voice [u] as iphone debut looms, verizon says at & t not known for reliable network intel and nvidia settle patent dispute with 6-year $1.5 b deal apple's verizon iphone could mean tough year for at & t, analysts say verizon may spend more than $5 billion subsidizing iphone sales in 2011 best buy rumored to add apple genius bars, display more macs in stores mac app store dramatically boosts evernote users, apple a top developer news corp's\" the daily' to debut on apple ipad jan. 19 - report post-ces, apple's ipad still viewed as tablet leader by wall street apple expands keynote support, online storage options in iwork.com beta at & t says verizon iphone users will experience \"life in the slow lane' cdma components could drive price of apple's verizon iphone up $20 - $30 apple's verizon iphone could\" cannibalize' 6.5 m sales from at & t apple follows at & t, drops official us iphone 3gs price to $49 verizon iphone to attract 9 to 12 million new us users for apple verizon iphone to offer unlimited data in contrast to at & t [u] briefly: apple shareholder proposal, vlc app removed, intel tablets pixelmator banks on mac app store for exclusive distribution apple's steve jobs could appear onstage at jan. 11 verizon event ces: samsung eyes smart tv as center of \"digital hub' as it takes on apple verizon media event on jan. 11 fuels apple iphone speculation [u] google android passes apple's iphone in total us subscribers - comscore ces: analysts grow skeptical of ipad competitors due to itunes evidence points to apple launching verizon iphone feb. 3 - rumor bonuses help apple's <mark>tim cook</mark> earn $59m in 2010, steve jobs keeps $1 salary apple announces mac app store downloads top 1m in first 24 hours unique, lucrative licensing deal brought beatles to apple's itunes"}, {"articleID": "2015022117_00004330_W", "names": {"Eric Holder": ["Q312644", "Q3591180"]}, "date": "2015-02-21", "url": "http://talkingpointsmemo.com/news/mexican-man-rock-police-shooting", "content": "Sorry, this feature is only available to TPM Prime members In a hurry? Bookmarks allow you to save an article to read later at your convenience. There isn't a limit, either, so you can store your favorites, too. Sorry, this feature is only available to TPM Prime members Sign In Dont ever miss an article again. PASCO, Wash. (AP) - The rallying cry in Ferguson, Missouri, was \"Hands up, don't shoot!\" In New York, it was \"I can't breathe!\" In Pasco these days, the protest signs say things like \"It was just a rock!!!\" In a case with unmistakable echoes of Ferguson and New York, demonstrators have gathered every day during the past week in front of City Hall to demand answers in the deadly police shooting of Antonio Zambrano-Montes, a 35-year-old Mexican immigrant and former orchard worker who authorities say was throwing rocks at officers. The Feb. 10 killing - captured on cellphone video by an onlooker - was the fourth by law enforcement officers in Pasco in less than a year. It has sparked calls for a federal investigation and roiled this fast-growing agricultural city of 68,000, where more than half the residents are Hispanic but few are members of the police force or the power structure. Protesters and police officials alike say they want to avoid the violence and acrimony that happened in Ferguson last year when officers shot and killed an unarmed black 18-year-old. \"We will continue to be calm, until they give us a reason not to,\" said protester Hector Alamillo, 62, of Pasco. \"We are not a Ferguson. We will not burn things down .\" But Alamillo said Hispanics are \"very distrustful right now\" and are wondering why officers did not use non-lethal force to subdue Zambrano-Montes. In the cellphone video, Zambrano-Montes is seen running across a busy street, pursued by three officers. As he stops and turns around, gunshots ring out and he falls dead. While the shooting is under investigation by a regional task force - and being watched by the FBI - police have said that Zambrano-Montes had hit two officers with rocks and had refused to put down other stones. They also said a stun gun failed to subdue him. The case has cast a spotlight on the ethnic makeup of working-class Pasco, an apple -, grape - and potato-growing center about 220 miles from Seattle that has more than doubled in size since 2000. The city is more than 55 percent Hispanic; many members of the community flocked here from Mexico to work in the fields and at food-processing plants. Starting in the 1960s and '70s, many of those migrant workers settled down here. Pasco's modest downtown is now lined with Mexican restaurants, bakeries and clothing stores, and city business is conducted in English and Spanish. The police force of 71 uniformed officers has just 15 Hispanics, and only one person on the seven-member City Council is Hispanic. Once a hotbed of gang - and drug-related violence, the city has seen crime plummet in the past 20 years, in large part because the Hispanic community worked with police to drive out the bad guys, said police Capt. Ken Roske. But there are worries that future cooperation will be jeopardized if the investigation clears the officers. \"We are asking for more training for our officers,\" said protester Lorian Reavely, 39, of Pasco, who stood in front of a sign reading \"Stop Police Brutality. It was just a rock!!!\" Police said officers felt threatened by Zambrano-Montes. He had been arrested by Pasco police early last year for assault after throwing objects at officers and trying to grab an officer's pistol, court records show. Police have said Zambrano-Montes was not armed with either a gun or a knife. Whether he had a rock in his hand when he was shot is still under investigation, said Kennewick police Sgt. Ken Lattin, spokesman for the regional investigative unit. All three officers - two whites and one Hispanic - opened fire; the number of shots has not been disclosed. Zambrano-Montes had recently spent time in a homeless shelter after his home burned. But investigators have been unable to interview anyone who saw him in the two weeks leading up to his death, Lattin said. Officers want to know if he had mental problems. \"His actions were not normal,\" Lattin said at a news conference. \"None of you would stand out there at 10th and Lewis Street and throw rocks at cars. And when the police show up, throw rocks at them and then run .\" Investigators' findings will be turned over to prosecutors, who will decide whether to bring charges. The county coroner has also ordered a public inquest in hopes of calming \"some of the fears and outrage of the community .\" In a letter to Attorney General <mark>Eric Holder</mark>, Felix Vargas, chairman of Consejo Latino, a local Hispanic group, said the investigation by the regional unit will have \"no credibility whatsoever .\" He noted that the unit exonerated officers in three other recent fatal shootings in Pasco. \"The eyes of the world are on Pasco,\" Vargas said. \"We fully expect charges to be brought .\" Last month, a Pasco officer was cleared in the deadly shooting of a suspected car thief who pulled a pellet gun. In December, an investigation concluded that a sheriff's deputy was justified in killing an intoxicated man who fired more than 60 rounds at officers. In November, a prosecutor cleared two Pasco officers who shot and killed a knife-wielding man. Zambrano-Montes' widow and two daughters have filed a $25 million claim with the city in the first step toward a lawsuit. And a makeshift memorial to Zambrano-Montes has taken shape outside Vinny's Bakery, a Mexican business near the spot where he was gunned down. \"The gentleman was being disruptive, but he was not violent enough to warrant guns,\" said Ben Patrick, who said he witnessed the shooting. \"It was wrong .\" Sen. Rand Paul (R-KY) said on Friday \"it's a mistake\" to question whether President...Just a day after refusing to comment on whether President Obama loves America, Wisconsin...Fox Analyst: Giuliani's Obama Remark \"Invites All Kinds Of Racial Tension' Fox News analyst Juan Williams said on Friday that former New York City Mayor...A spokeswoman for former Florida Gov. Jeb Bush (R) sidestepped the dustup surrounding former...× Bookmarking is a TPM Prime feature Amanda Hale Director of Product & Creative Development"}, {"articleID": "2012120416_00073792_W", "names": {"Mike Rogers": ["Q1933467", "Q970515"], "Sean Gallagher": ["Q21707208", "Q732324", "Q7441018", "Q984574"], "Todd Reed": ["Q16735084", "Q19667729"], "Christopher J. Coyne": ["Q1086592", "Q3675843"]}, "date": "2012-12-04", "url": "http://livingstondaily.com/usatoday/article/1745255?odyssey=mod|newswell|text|Frontpage|s", "content": "a 34-year-old pinckney man was stabbed to death, killed by the husband of an old friend he was...tears were shed as children rushed to their re-turning parents' arms and as distance-torn...youth suicide is heartbreaking, all the moreso because its causes unnecessarily remain a mystery...dewayne wickham: florida's \"stand your ground' law full of flaws the latest victim of florida's\" stand your ground \"law was buried saturday in georgia - eight days...u.s. rep. <mark>mike rogers</mark>' no-tax pledge is in line with his voters' wishes despite a 1-10 record on the road, the pistons are now 5-3 at home, thanks to an 89-79 victory over...grant's second shot sticks - brighton goalkeeper nets player of the year honor brighton - brighton senior jack grant knows a thing or two about shutouts - and also being shut out. brighton icer off to bc - haley mclean signs with women's hockey team light it up, livingston! - 3:09 am engagement: textor-hilton mark and kristyn textor of howell, michigan, announce the engagement of their daughter, ms. don and barb horan and another couple died when a small plane, piloted by don horan, crashed sunday near greensburg, ind., airport. / <mark>sean gallagher</mark>, the criterion/file by ryan sabalow and jill disis, the indianapolis star lifelong friends and their wives died over the weekend in a plane crash, a tragedy that has left this small community reeling as federal investigators try to determine why the single-engine plane went down at about 6:20 p.m. sunday. late monday, officials confirmed what family and friends feared when authorities found four bodies in wreckage strewn across nearly 3 acres of fog-covered farmland southeast of the airport here. donald horan, 46, a licensed pilot and businessman known for donating generously to his church and the state's catholic archdiocese, and his wife, barbara, 44, were killed. they had four daughters, now in their teens and 20s. the crash also killed stephen butz, 45, and his wife, denise, 42. they had two teenage sons .\" they leave behind six beautiful children who are hurting and grieving over the loss of their parents, \"brian wenning, a friend of the families, said monday at a news conference. the two men went to the same grade school together. they worshipped together at st. mary catholic church. their families vacationed together. they coached their children's sports teams together. the two couples had spent the weekend in destin, fla., on the gulf of mexico where the horans owned a five-bedroom home. they flew to florida from here friday evening. three other greensburg, ind., couples, including donald's brother, tom horan, and his wife, suzanne, also flew to florida in a separate plane, piloted by <mark>todd reed</mark> of greensburg. the two planes departed florida on sunday afternoon, and encountered a thick blanket of fog as they approached their small, home airport. the national transportation safety board is heading the investigation, which is likely to include a focus on weather conditions sunday .\" the conditions that night were horrible, \"said jon dooley, vice president of the greensburg board of aviation commissioners .\" it was such that an aircraft wouldn't have seen the runway unless they were very close. \"dooley said <mark>reed</mark> tried to land at the airport before horan's plane arrived about 45 minutes later. but <mark>reed</mark> missed his approach, dooley said. he said that normally means the pilot couldn't see the runway. the plane diverted to the airport in columbus, ind., a larger, better-equipped facility with a tower about 30 miles southwest. it landed safely. horan's plane continued on to the greensburg airport. the weather at that time\" would have been similar or, if anything, even worse \"than when <mark>reed</mark> decided to divert to columbus, dooley said. horan, who earlier this year earned an instrument rating that allowed him to fly at night and in low-visibility situations, had bought the plane he was flying in october, dooley said. greensburg police detective william meyerrose said federal crash investigators were expected to examine the crash site tuesday. he said it would be up to them to determine why the plane went down. meyerrose declined to say whether it's believed weather was a factor. but capt. lindsay shipps, a spokeswoman for the civil air patrol, said it was so foggy sunday night that weather conditions kept searchers grounded as they looked for wreckage. the fog was dense across the state that night and only pilots such as horan, licensed for instrument-only flying, could take off and land at airports, she said. as federal investigators headed to the crash monday afternoon, those who knew the victims shared stories of generosity and kindness - and loss. childhood friend mark burkert said the horans would host get-togethers at their house, not just for family friends but virtually for everyone .\" you never know who you're going to meet over there, from some highly influential people to common people, \"burkert said .\" he was always willing to have people over. don never met a stranger. \"burkert also said he never saw horan and butz without smiles on their faces .\" he could be having the worst day of his life, \"burkert said of horan,\" and you would never know it. \"mark schabel, the chief executive of the greensburg company that horan founded, receivables management partners, said horan loved to fly and often took his friends on trips. horan had bought the piper so he could fly at night, schabel said. in 2007, horan stepped down from day-to-day involvement at the company, which provides account and billing services to businesses involved in the health-care industry. that gave horan more time to support catholic causes, including for the archdiocese of indianapolis. his philanthropy also extended to his home parish, which he supported with a sizable contribution to the new st. mary catholic school here .\" don is a fantastic guy, \"said paul walston, 84, who lived near the horans .\" his whole family is great. \"greg otolski, a spokesman for the archdiocese of indianapolis, confirmed horan's generous contributions to the st. mary catholic school and other church causes .\" a year ago, st. mary's catholic school in greensburg built a new school, probably an $8 million project, \"otolski said .\" i don't know how much specifically don contributed to that, but he and his wife were significant donors and actively involved with efforts to raise funds there. \"the archdiocese's auxiliary bishop, <mark>christopher j. coyne</mark>, said the horans\" have been very active in serving their parish and the greater archdiocese over the years. \"\"they traveled to every corner of the archdiocese to raise funds for ministry needs,\" <mark>coyne</mark> said. horan also was a member of the board of directors of the catholic community foundation and served as president of the foundation in 2011. the foundation oversees 407 endowments with nearly $138 million in assets. u.s. rep. <mark>mike rogers</mark>' no-tax pledge is in line with his voters' wishes ind. plane crash leaves 6 children without parents two couples flying back from destin, fla., encountered fog that socked in their airport. paid archives for news older than a week."}]