[{"articleID": "2016070817_00858692_W", "names": {"Sunil Shroff": ["Q17074754", "Q57317610"]}, "date": "2016-07-08", "url": "http://www.thehindubusinessline.com/specials/pulse/why-it-is-difficult-to-cut-out-organ-blackmarketers/article8824813.ece?homepage=true", "content": "Why it is difficult to cut out organ black-marketers PT Jyothi Datta Catch them young India requires about two lakh kidneys but only 2 per cent of this demand gets met Sophisticated fraudsters continue to sell body-parts, despite stringent laws. Can the Israel or Singapore models work? It was during a visit to a Chennai colony over 20 years ago that one became painfully aware of the disturbing practice of organ trade. The vulnerable residents there, largely living with leprosy, were targeted by middle-men to sell their kidney to individuals who desperately needed one. Soon enough, the government stepped in and put in place stringent laws to stop the commercial trade of organs. After all, the reputation of doctors, the state and eventually the country itself was at stake here. It is for this very same reason that the kidney racket reported from Delhi's Indraprastha Apollo Hospital last month needs to ring alarm bells. The incident did not happen in a back alley in a remote part of the country, but in the national capital, seat of both the Delhi State and Union Governments. As investigating agencies unravel how deep the rot may have spread in the Delhi case, doctors complain that it is becoming increasingly difficult to call the bluff of scamsters. Despite approval committees at State and hospital levels that assess every organ donor and \"related\" recipient, frauds seem to happen. And it's not always because there are black sheep in the medical fraternity, says a doctor unwilling to be named. In some cases, the donors and recipients are able to furnish fake Aadhaar cards and documents to prove they are related, there is no way even a committee of doctors can spot the fraud here, says the doctor. Future committees may need to include forensic experts and interrogators to sniff out such frauds, he says. <mark>Sunil Shroff</mark>, Managing Trustee with Chennai's Mohan Foundation, echoes these views. \"Doctors cannot police each case,\" he says, adding that passports and ration cards are fabricated to prove that the organ donor and the recipient are related (as mandated by law). As a kidney surgeon himself, <mark>Shroff</mark> says, despite having stringent procedures to weed out fraudsters, \"later we (have) realised we were duped\". The case involved a woman and a person who was supposedly her son. Such incidents can take place even in the best of institutions, he says, admitting that in some cases it could involve bad eggs in the profession. The Transplantation of Human Organs Act, 1994 and subsequent amendments have brought in checks, punishment and penalties on frauds. A huge deterrent is the fact that the doctor's image can get tarnished if he or she is linked to such frauds, he says. Go public Amar Jesani, Editor with the Indian Journal of Medical Ethics, observes that a hospital cannot absolve itself from an incident of fraud happening in its portals, as every organ transplant is overseen by a committee of doctors including those not involved with the surgery, such as psychiatrists. The Apollo incident provides a unique opportunity to bring in greater regulatory governance, says Jesani. The system needs to be made more transparent and the process, transplant decisions, minutes, etc., need to be in public domain, he says, even as patient names are kept confidential. Donor initiatives <mark>Shroff</mark> says that frauds can be plugged if the donor-recipient shortage is addressed, and the number of voluntary organ donations increases substantially. At any given point in time, India reportedly requires about two lakh kidneys but only 2 per cent of this demand gets met. Israel and Singapore encourage people to become donors by promising to prioritise their case if they ever need an organ later. Those not interested in volunteering can opt out. Another more debatable initiative exists in Iran, where a donor is legally paid, but under the government's watch. But Iran is set to review it, says <mark>Shroff</mark>. As the demand increases for organs (kidney, liver, heart, other tissues), a key method to outlaw the commercial trade of organs is by increasing voluntary supplies. And for that much greater awareness is needed. Last year, Prime Minister Narendra Modi's Mann ki Baat spoke of voluntary organ donation. And earlier this week, Apple said that iPhone users would be able to sign up for organ donation though an app. Its initiative was a recognition of the \"excruciating\" wait no less than Steve Jobs had to go through for a liver transplant in 2009. (This article was published on July 8, 2016)"}, {"articleID": "2014041704_00025424_W", "names": {"Ivan Lopez": ["Q37377397", "Q3804960", "Q5923485", "Q6100103"]}, "date": "2014-04-16", "url": "http://www.texastribune.org/2014/04/16/texas-could-get-millions-active-shooter-training/?utm_source=texastribune.org&utm_medium=rss&utm_campaign=Tribune", "content": "Gov. Rick Perry and other officials brief the media at Fort Hood on April 4, 2014. WASHINGTON - A law enforcement training center based at Texas State University in San Marcos may receive $15 million in federal money to support programs that train officers how to handle situations like the recent Fort Hood shooting. on Tuesday cited the recent tragedy at Fort Hood as he asked Congress to authorize the money for these training programs, called \"active shooter response training .\" \"In the face of this urgent and growing threat - when the lives of innocent people are at stake - those who stand on the front lines need our full and unwavering support,\" Holder said. Advanced Law Enforcement Rapid Response Training (ALERRT) Center is the national leader for active shooter training programs funded by the Department of Justice. It has trained more than 50,000 officers nationwide in the past decade, using more than $30 million in state and federal grant money, according to the center. Active shooter training teaches law enforcement how to isolate, distract and neutralize an active shooter. It also shows officers how to effectively enter and move around a room when they're handling a situation alone. \"The additional funds would allow us to reach more people,\" said Pete Blair, director of research at ALERRT. \"Obviously, we'd like to roll out the training to every officer we can reach - the more funding, the more officers we can reach .\" Blair said that ALERRT has a waitlist with more than 300 requests for training from 42 states. If the center receives the $15 million, ALERRT could train about 60,000 officers in 12 months, he said. In Woodway, Texas, outside of Waco, the current president of the said the potential cash influx would be a boon for first responders. \"We're very much in favor of additional support for active shooter training,\" said Yousry Zakhary, who is also director of the Woodway public safety department. \"We must be prepared for the worst .\" Zakhary said he hopes that active shooter training becomes standard for officers, \"just like learning how to drive a car or shoot a weapon .\" He said that he has visited many officers who would appreciate additional training. \"ALERRT at Texas State has been on the job for years, through these recurrent tragedies, preparing law enforcement and educators in responding to active shooters,\" said U.S. Rep. Lloyd Doggett, D-Austin, whose district includes San Marcos. \"Approving the attorney general's recommendation for more federal funding would help ALERRT to do more and protect more by giving first responders the tools they need to react as effectively and efficiently as possible .\" Holder said the average number of annual active shooter incidents has roughly tripled since 2009. \"Each of these tragic events is a heartbreaking reminder that mass shootings are all too common,\" he said. Four people were killed and 16 injured earlier this month at Fort Hood when Spc. <mark>Ivan Lopez</mark> opened fire on the base. <mark>Lopez</mark> was among the dead. In 2009, 13 people were killed and 32 were wounded in a similar mass shooting on base. The $15 million for active shooter training is part of the $27 billion Justice Department budget for the fiscal year beginning Oct. 1. It is currently being debated by Congress, with subcommittee hearings set for later this month. Disclosure: The Texas State University System is a corporate sponsor of The Texas Tribune. A complete list of Texas Tribune donors and"}, {"articleID": "2016081000_00396002_W", "names": {"Phil Collins": ["Q144622", "Q7181796", "Q7181800"], "Ray Charles": ["Q7297319", "Q872846"], "Tony Bennett": ["Q19946119", "Q23048751", "Q296729", "Q3993198", "Q4772102", "Q7821881", "Q7821882", "Q7821883"]}, "date": "2016-08-09", "url": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-star-plaza-raze-st-0810-20160809-story.html#nt=oft06a-4li2", "content": "Merrillville's Star Plaza Theatre, Radisson Hotel to close Five for Valentines Philip Potempa / Post-Tribune The waterfall in the lobby of the Radisson Hotel at Star Plaza soon will splash no more. Hotel officials said the hotel and adjacent Holiday Star Theatre would be razed and replaced by a new upscale hotel. The waterfall in the lobby of the Radisson Hotel at Star Plaza soon will splash no more. Hotel officials said the hotel and adjacent Holiday Star Theatre would be razed and replaced by a new upscale hotel. (Philip Potempa / Post-Tribune) Michelle L. Quinn Post-Tribune Northwest Indiana's Star Plaza Theatre will be demolished next year, turning to rubble one of the region's main entertainment venues that's been in operation for nearly four decades. Merrillville based White Lodging Services Corp. announced Tuesday it will close the Radisson Hotel in January and the adjacent Star Plaza Theatre in May 2017. The 330-room hotel will make way for a 250-room, higher-end hotel with some meeting and banquet space, but there are no plans to rebuild the theater. The theatre's booking company, Star Productions, meanwhile, will expand its services to other venues, according to the release. Events will continue through the spring. Charlie Blum, CEO of Star Productions, said in the release that as White Lodging surveyed the hotel for renovations, it concluded the aging building and theater wouldn't be able to structurally accommodate its plans. \"It is with a heavy heart that we have come to the conclusion that the Star Plaza, which has been a cultural mecca for Northwest Indiana and Chicago area residents since 1979, must close its doors,\" Blum said in the release. \"We all recognize what the theater means to our community and, of course, it has played a huge role in my life and the lives of my dedicated, hard-working staff .\" White Lodging Services Corp.. Founder Bruce White, who also serves as Chairman of the Board, said in a statement that he was \"saddened\" by the pending closing of The Star Plaza Theatre and noted that it's still successful. \"The theater has always been successful, thanks to the hard work of Charlie and his team, and in fact, this most recent season was one of our most successful in our history, which makes this decision to raze the building even harder,\" White said in the statement. \"I know how much it has meant to the community, our patrons from throughout the Midwest, and so many in the entertainment industry during its 37 years of operation, and I personally have spent countless hours enjoying incredible performances at the theater .\" South Shore Convention and Visitor Authority CEO Speros Batistatos said he had \"mixed feelings\" about the closing. \"That theater launched many a career in Northwest Indiana in hospitality, mine and others,\" Batistatos said. \"But (razing the facility) is long overdue. You're looking at a Holidome Holiday Inn built in the 1970s, and there comes a point where you can throw a bunch of money at something, and no amount of carpeting or new curtains or bedding is going to help. We understand the decision .\" While Batistatos is concerned that Northwest Indiana will be losing at least 100 hotel rooms in the next 18 months, what concerns him even more is that the area will be losing between 20,000 and 30,000 square-feet of convention space when the Radisson is torn down. \"This opens the door to have a much-needed conversation about a public-private partnership to build a convention and meeting space that we've been talking about for years,\" he said. \"This conference space (in the Radisson) is gone, and they're not replacing it. This is what happens when a private company says,\" We're done .' \"Nevertheless, Batistatos said it could turn out to be a benefit for the area .\" This is a fork in the road, and it's going to take some work, but do we want to step up? We can make the argument that we can change the look of the region for the next 40 or 50 years, \"Batistatos said .\" This could be a real platinum-lined cloud if we have the willingness to do it. \"White Lodging Communications Director Kathleen Sebastian said the company is still determining what will happen with the Radisson's employees as well as any events customers have booked with the hotel past its closing date. The Star Plaza opened in 1979 as the Holiday Star Theatre with a concert by Donna Summer and has been in continuous operation since. It was renamed the Star Plaza Theatre when the hotel converted to a Radisson property. It has played host to many entertainment giants, including legendary Sammy Davis, Jr., Whitney Houston, Christina Aguilera, ZZ Top, Alice Cooper, Diana Ross, Garth Brooks, Jamie Foxx, Luther Vandross, Bette Midler, Barry Manilow, Crosby, Stills and Nash, Tina Turner, Miles Davis, Patti LaBelle, <mark>Phil Collins</mark>, <mark>Ray Charles</mark>, Reba McEntire, Tim McGraw, <mark>Tony Bennett</mark>, BB King, Night Ranger, Kenny Chesney and Aretha Franklin. Michelle Quinn is a freelance reporter for the Post-Tribune."}, {"articleID": "2010021920_00080161_W", "names": {"Mark Bradley": ["Q25190093", "Q3849450", "Q55111709", "Q56549811", "Q6766814", "Q6766815", "Q6766817"]}, "date": "2010-02-19", "url": "http://ajc.com/news/georgia-politics-elections/5-million-so-far-314963.html?cxtype=rss_georgia-politics-elections", "content": "ariel hart the atlanta journal-constitution the atlanta bargain hunter rana cash shows you how to go out and have fun on a budget. rachel cardina lasserre says her style is \"decorative, feminine and artsy-intellectual .\" <mark>mark bradley</mark> gives his abbreviated look at the braves upcoming season. editorial cartoonist mike luckovich gives his take on local news, politics, sports, and celebrities. what's altered in the two photos? see how you score when you play the find 5 challenge! tell us what you think about the site"}, {"articleID": "2015041610_00046002_W", "names": {"Bruce Thompson": ["Q16886106", "Q4978357"]}, "date": "2015-04-16", "url": "http://www.pymnts.com/news/2015/bank-of-america-sees-2m-mobile-banking-customer-growth/", "content": "Overstocked Retail Inventory Raises Alarms For Commerce Department Mobile Commerce> Bank Of America Sees 2M Mobile Banking Customer Growth Showing its own strength in a growing trend among banks, In fact, the number of mobile banking customers jumped 13 percent from last year's Q1 to just under 17 million users. Mobile now accounts for 13 percent of all consumer deposit transactions, which is a 3 percent increase on a year-to-year basis. Tailoring its growth strategy toward the mobile customer aligns with one goal of BoA. \"We have added new financial centers in areas of opportunity and we continue to invest in products and innovation, as well as efficiency,\" said CEO Brian Moynihan during the company's call with analysts April 15. \"A simple example - in our Consumer Mobile Banking space, we now have 70 million mobile banking customers up over 2 million from last year .\" But like other banks are seeing, with more customers going online for their banking needs, Bank of America is evaluating its physical banking needs as more consumers go digital. \"We continue to reduce our financial centers in the associated cost driven by consumer behavior patterns shifting to more digital,\" CFO <mark>Bruce Thompson</mark> said during the same call. In Bank of America's earning press release, the company shared more about how the growth in mobile banking and self-service customer touch points is changing the banking ecosystem. \"The company continued to refine its retail footprint and has closed or divested 287 locations and added 27 locations since the first quarter of 2014, resulting in a total of 4,835 financial centers at the end of the first quarter of 2015,\" according to the release. On the card side, card issuance also jumped 13 percent. BoA issued 1.2 million new credit cards in Q1, which is up by 200,000 from Q1 in 2014. Of its credit cards issued in the quarter, roughly 34 percent were from new customers and 66 percent of those were from existing customers. In terms of earnings figures, BoA reported a $1.3 billion revenue decline, year over year, but saw a profit of $3.4 billion for its Q1, which was a stark increase from last year's Q1 loss of $276 million. BBVA Acquisition Will Enhance Digital Banking Experience Intel, IoT And The Case For Commerce Reserve - The M-Payments Dining App - Breezes Into The Windy City How UK Consumers Use Mobile To Shop"}, {"articleID": "2017101903_00143249_W", "names": {"Ian Simpson": ["Q21455115", "Q59303806", "Q5982901", "Q5982902"]}, "date": "2017-10-19", "url": "http://www.metro.us/news/reuters/suspect-maryland-shooting-killed-three-arrested-delaware", "content": "Reuters Suspect in Maryland shooting that killed three arrested in Delaware By <mark>Ian Simpson</mark> Facebook Twitter LinkedIn Reddit StumbleUpon Email By <mark>Ian Simpson</mark> (Reuters) - An employee of a Maryland kitchen countertop company suspected of fatally shooting three co-workers and critically wounding two others on Wednesday was arrested in neighboring Delaware, a Maryland county sheriff said. The suspected gunman, Radee Prince, 37, was apprehended by U.S. agents and others, the Harford County Sheriff's Office said on Twitter, without providing further details. Prince was also being sought for a shooting in Delaware that took place after the Maryland shooting. Prince entered Advanced Granite Solutions in Edgewood, Maryland, just before 9 a.m. and fired multiple shots from a handgun, Harford County Sheriff Jeffrey Gahler told reporters. Three people died at the company's premises in a business park northeast of Baltimore. Two people were taken to a hospital, one of whom had come out of surgery, he said. Those killed were identified as Jose Romero, 34; Enis Mrvoljak; and Bayarsaikhan Tudev, the Harford County Sheriff's Office said in a statement. Two other people shot in the attack were in critical condition at the University of Maryland Shock Trauma Center, it said. Gahler called the shooting a \"targeted attack .\" Asked about the gunman's possible motive, he said: \"We believe he's tied into a relationship here at work .\" Prince had worked for Advanced Granite Solutions for the past four months and had been scheduled to work on Wednesday, the sheriff said. The suspect fled in a black GMC Acadia with Delaware license plates. Police in Wilmington, Delaware, about 30 miles (50 km) northeast of Edgewood, said Prince was also being sought for a shooting there at 10:46 a.m. that injured a man. Wilmington police spokeswoman Stephanie Castellani said the victim identified the shooter as Prince, who fled in the same vehicle. Prince had been arrested 42 times in Delaware and had 15 felony convictions, she said. \"He is a dangerous individual,\" said Castellani, adding that the motive was not yet known but that Prince was associated with all six victims. \"We do not know if there is a beef going on between the victims and the suspect .\" (Reporting by <mark>Ian Simpson</mark> in Washington; Additional reporting by Chris Kenning in Chicago, Jon Herskovitz in Austin, Texas and Keith Coffman in Denver; Editing by Lisa Shumaker and Peter Cooney) By Reuters Top News Published: October 18, 2017 | Updated: October 18, 2017 Facebook Twitter LinkedIn Reddit StumbleUpon Email More Share this article Facebook Twitter Mail Google Plus Reddit LinkedIn"}, {"articleID": "2019060217_00165017_W", "names": {"Michael Angelo": ["Q24705684", "Q56000278"]}, "date": "2019-06-03", "url": "https://www.bworldonline.com/ultra-lagree-caters-to-busy-bodies-who-want-to-stay-fit/", "content": "Advertisement Font Size A A A Lagree Fitness is both high intensity and low impact, which means one's body works harder and burns more calories while the joints and connective tissues are kept safe from potential damage due to overexertion .--ULTRA LAGREE THE local Lagree Fitness scene has taken further root with the recent opening of a studio dedicated to the workout. Ultra Lagree, located at the second floor of Estancia Mall at Capital Commons in Pasig City, promises members another good reason to wear their gym clothes and experience a different approach to staying fit. Introduced in Hollywood by noted fitness practitioner Sebastian Lagree, the 45-minute workout effectively combines strength, endurance, core, cardio, balance and flexibility training. It is both high intensity and low impact, which means one's body works harder and burns more calories while the joints and connective tissues are kept safe from potential damage due to overexertion. Proponents of the fitness workout said is suitable for people who can't get started or sustain their fitness regimen because of their busy schedules. The Lagree Fitness workout is done on a machine called the Megaformer, which has tension springs that can be adjusted according to the preference of the client. It allows one to perform coach-guided routines efficiently and at optimal form, which results in more calories burned. Because of the high intensity of the activity, you continue to burn calories even after the workout--up to 800 calories, studies show. \"You can hit so many things with this one full-body workout which uses tension springs in order for you to get the best workout. You cannot plateau with this. That's the beautiful thing about this,\" said Will Devaughn, master instructor at Ultra Lagree, in an interview with BusinessWorld. \"Forty-five minutes on this is more than enough. Of course, it depends on the intensity of the client and how they want to push themselves. This is for everybody. All walks of life, all shapes and sizes. The instructors here are very skilled and can help members in their fitness journey,\" added Mr. Devaughn, who personally trained under Mr. Lagree in Los Angeles. Mr. Devaughn went on to say that Lagree Fitness is suitable for Filipinos and that part of the reason they put up Ultra Lagree is to grow the community in the Philippines for the workout. \"Fitness is really blowing up in the Philippines and we see this enhancing that. We want to make the workout more accessible to more Filipinos, and, at the same time, create a space for like-minded individuals to thrive together,\" he said. He added, \"For me, Lagree is in a class of its own. It really is. It works your mind and body at the same time. It's very cerebral. This is a lifelong exercise. You can do this for the rest of your life .\" Ultra Lagree is part of a network of less than 300 Lagree Fitness-certified studios all over the world. In the Philippines, it is the only Lagree Fitness-certified studio in a convenient mall setting. Those who are interested to try the Lagree Fitness workout at Ultra Lagree can inquire at info @ ultralagree.ph, or check them out on Facebook (/ ultralagree. ph) or Instagram (@ ultralagree. ph). The studio is open every day from 6 a.m. to 9 p.m.--<mark>Michael Angelo</mark> S. Murillo Advertisement SPOTLIGHT Economy Alternative investments in emerging economies There's a continued increase in alternative investment asset classes throughout the ASEAN nations--a breakaway from traditional established financial assets. This was made...LATEST NEWS Price hikes could have steadied from Apr.. PEZA approved pledges drop in first 4 months Analysts' May Inflation Rate Estimates Q4 2018 labor turnover flat from third quarter Your fish is your future Policy continuity Innovation: The only way Advertisement"}, {"articleID": "2008091515_00028277_W", "names": {"Peter Costello": ["Q2546246", "Q7173405", "Q7173406"]}, "date": "2008-09-15", "url": "http://theaustralian.news.com.au/story/0,25197,24353040-2702,00.html", "content": "dennis shanahan, political editor | brendan nelson has thrown down the gauntlet on the liberal leadership, gambling that he will catch malcolm turnbull off balance and without the numbers to successfully challenge. after weeks of speculation that the opposition leader would face a challenge from his treasury spokesman, dr nelson last night, without warning, announced a ballot. he demanded the liberals \"draw a line in the sand\" and move into \"a new phase\". dr nelson, who assumed the leadership almost 10 months ago, having defeated mr turnbull in a ballot by 45 votes to 42, said he would declare his leadership position vacant at the scheduled partyroom meeting this morning in canberra and then stand immediately as a candidate. mr turnbull declared that he would stand against dr nelson and would spend the night \"consulting his colleagues\". he was believed to be personally contacting every mp, while dr nelson was instead relying on former <mark>costello</mark> backers to rally support for him. because of the surprise, there was no certainty about the relative strength of the two camps--or if there would be a third candidate--but dr nelson's supporters were last night confident he had enough votes to win. an angry dr nelson told his colleagues that the opposition needed \"new discipline\" , \"new personnel\" and an end to the undermining of his leadership. at the partyroom meeting last night, called with just 45 minutes' notice, dr nelson lashed out at those mps accusing him of \"trashing the liberal brand\" and threatening to challenge in mid to late october. some of dr nelson's supporters said his impassioned speech about disloyalty was a signal that, should he retain the leadership, he planned to dump mr turnbull as opposition treasury spokesman. surprised liberal mps, who had little inkling of what the purpose of the meeting was before entering the partyroom, were last night trying to calculate support for both dr nelson and mr turnbull, although one senior frontbencher told the australian: \"brendan will have the numbers .\" at the very least, people think he has not been given a fair go and he deserves to have a refreshed mandate. \"the suggestions that malcolm's supporters were going to launch a challenge in october crystallised the decision to call aballot .\" <mark>peter costello</mark>'s announcement that he would not seek the leadership after the release of his political biography--which he launches at the national press club in canberra today--accelerated moves by mr turnbull's supporters. within hours of winning the leadership last november, dr nelson was subjected to undermining from colleagues and has languished in the opinion polls against the record popularity of kevin rudd as prime minister. a newspoll published in the australian last week put dr nelson's rating as preferred prime minister at just 16 per cent. his march rating of 7 per cent was a record low in the history of newspoll. the timing of the november meeting was a matter of controversy, coming just five days after more than 11 years of coalition rule came to a sudden end. then there was the matter of who attended and voted. northern territory liberal mp david tollner is believed to have supported dr nelson. he conceded his marginal seat of solomon just days after. reports over the weekend, including in the weekend australian, that mr turnbull's supporters were planning to challenge next month made dr nelson's position untenable. last night, mr <mark>costello</mark> told the australian that dr nelson deserved a fair chance as liberal leader and that he had been denied clear space to operate. \"i believe brendan nelson has done a very good job in difficult circumstances and is entitled to enjoy the support of his colleagues to continue to lead,\" mr <mark>costello</mark> said. last night, dr nelson told his colleagues he was thankful for the former treasurer's support. in a statement after the half-hour meeting of liberal mps and senators, dr nelson said: \"if i am re-endorsed as leader, i will remain absolutely determined and committed to the future of our party and australia. but as we move forward, i am asking our party to draw a line in the sand and mark a transition from the difficult aftermath of an election defeat to the building and presentation of a credible, attractive and inspiring alternative government .\" in doing so, we will make a renewed commitment to unity and discipline, to focus less on internal preoccupations and more on the rudd government, policy and the important issues concerning everyday australians. millions of australians are counting on us to hold the government to account and provide australians with a credible, attractive and inspiring alternative. \"in an appeal for loyalty andfocus, he added:\" i am asking my colleagues to make arenewed commitment to do just that. \"dr nelson told his colleagues he would not be canvassing for their support individually, as he did in december, but would talk to anyone who contacted him. he told the meeting his record as leader would speak for itself. he made a pitch for the leadership last night based on two key themes: toughening the party's position on climate change and delivering equality for same-sex couples. some mps interpreted his remarks as suggesting he would move again to break ranks on an emissions trading scheme, possibly reversing the party's policy .\" brendan's made it clear we're going to show leadership on climate change, but we're not going to junk the economy along the way, \"liberal frontbencher bruce billson told abc tv's lateline last night. the issue sparked a battle within shadow cabinet earlier this year, with mr turnbull and his supporters prevailing amid a push by dr nelson to consider different models or even reserving the right to oppose a scheme in parliament if international polluters did not agree to tough reduction targets. the dual themes were interpreted as a pitch to the left and the right of the party. mps described the speech as\" gutsy \", but turnbull backers said cooler heads were prevailing and that mps knew they had to make a choice for the future. share this article from here you can use the social web links to save the australian news bites bite sized news all in one place brought to you by the new holden caprice l'exhibition' 08lexus premier sales event on now. events like this rarely strike twice. jaguar xf is here explore the features. click here for more info hanoi & halong bay5-night vietnam package including flights from $2,226 pp too green is no good michael stutchbury, economics editor feel-good commitments to deep cuts in emissions are more dangerous for the economy and the environment than realistic ones. malcolm colless: think before ditching howard's ir refor"}, {"articleID": "2019021009_00140279_W", "names": {"Elton John": ["Q16209157", "Q2808"]}, "date": "2019-02-10", "url": "https://www.pressherald.com/2019/02/10/some-call-greta-van-fleet-the-saviors-of-rock-but-not-them/", "content": "NEW YORK--When the members of the rock band Greta Van Fleet put their last touches on their first full-length album, they didn't celebrate with a round of beers or a fancy dinner. They immediately started working on new songs. \"Once we finished\" Anthem of the Peaceful Army'--the very day that we'd OK'd all the mixing--we started writing the next album, \"said Jake Kiszka, the band's guitarist .\" If we're stagnant, it becomes boring. \"The young Michigan rockers whose sound and classic rock look is reminiscent of Led Zeppelin have done the opposite of stagnate in the last 18 months. It's been more like an explosion, capped by four Grammy Award nominations, including best new artist and best rock album. Since their April 2017 breakthrough with the song\" Highway Tune, \"they've put out two EPs and their\" Anthem of the Peaceful Army \"debuted at No. 1 on Billboard's rock chart and No. 3 on the all-genre albums chart last year. It has also reached the Top 10 in Canada, Italy and Germany. They've played\" Saturday Night Live \"and\" The Tonight Show Starring Jimmy Fallon, \"count <mark>Elton John</mark> as a fan and have been embraced as the four guys who can save rock\" n' roll, a tag they politely decline. \"It's a silly thing to consider anyone a savior of rock\" n' roll. In our opinion, no one king can wear that crown, \"said Jake Kiszka, 22 .\" There's always someone who carries the torch and takes that into the future and interprets that through their influences. \"Jason Flom, who signed Greta Van Fleet to his Lava Records, said there's nothing calculated about the band, saying they make music because it's what they were born to do:\" It's almost like they were sent in a time capsule to save rock \"n' roll,\" he said. \"They wouldn't say that, but I will .\" Keeping the members grounded through all this fuss is blood--three of the members are brothers. Kiszka's twin, Josh, is the howling singer, and his younger brother, 19-year-old Sam, plays bass and keyboards. The quartet is rounded out by drummer and family friend Danny Wagner, 19. The Kiszka brothers are so passionate about what they do that they used to get into fistfights when they were younger over musical choices. Now they rely on each other to get through the noise. \"When someone starts to steer one way or another away from the herd, it seems like there's always someone there to pull you back in,\" said Jake Kiszka, who called the past year \"being in the eye of a storm. There's so much chaos around you but the very center seems so calm .\" At the Grammys, taking place Feb. 10 in Los Angeles, the band is up for best rock song (\"Black Smoke Rising\" ), best rock performance (\"Highway Tune\" ) and best rock album (\"From the Fires\" EP). Competition in those categories include the late Chris Cornell, Arctic Monkeys, twenty one pilots, St. Vincent, Weezer, Fall Out Boy and more. Greta Van Fleet, whose name was inspired by the octogenarian bluegrass musician Gretna VanFleet, also are nominated for best new artist, up against Chloe x Halle, Luke Combs, H.E.R., Dua Lipa, Margo Price, Bebe Rexha and Jorja Smith. Asked which of the four awards the band most coveted, Jake Kiszka was diplomatic. \"I think best album and best performance would be some of the more highlighted categories I'd like us to win. It seems to me the best new artist is sort of a cursed category .\" Does that mean they won't accept it? \"We'll accept it,\" he answered, laughing. \"That would be rude .\" Rudeness is not something baked into the band, which also hasn't relied on social media to fuel its rise. Flom, who has also guided the careers of artists like Lorde and Jessie J, said he's impressed by Greta Van Fleet's work ethic and comradery. \"They get a week off, they go rent a cabin in the hills of Tennessee and write songs,\" he said. \"That is their idea of a good time .\" The band hasn't won over everyone, as proved by the snarky comments online following their \"SNL\" appearance last week. Some criticized them for their ’60s - styled outfits and for mimicking classic rock gestures. One viewer called them \"a glorified college cover band who have just found their dad's Led Zeppelin records .\" Music critics also have been mixed, but the band isn't letting any of that get under their skin. \"Every individual is entitled to an opinion,\" said Jake Kiszka. \"I think we'll always be humbled with the references and honored by the affiliation of those who have influenced us and inspired us to be musicians. But I think there isn't a band in this world that somebody doesn't hate .\" The Zeppelin comparisons once were certainly warranted but increasingly less apt. The band's early bluesy rock has evolved into a more diverse, mature sound, including the laid-back, \"You're the One,\" the last song created for the latest album. Jake Kiszka said Greta Van Fleet has moved on from their stripped-down sonic beginnings. \"It was sort of an objective of ours to achieve somewhat simplicity--to get to the emotion of it and the truth of it and the feel of it,\" he said. \"Once that was achieved, in our minds, it was time to start moving forward in a more technical manner--to grow .\" Share Read or Post Comments Send questions/comments to the editors. Related Stories Latest Articles Business CMP facing a backlog of thousands of faulty bills Green Plate Special Recipe: Mixed Frozen Fruit Curd Cops & Courts 20 years later: A Saco teenager's murder remains unsolved Food More Portland restaurants embrace charging fees for \"no-shows' Politics Federal lawsuit hangs over Eves, LePage as private citizens Want the news vital to Maine? Our daily headlines email is delivered each morning. Email * Newsletter Choices * Daily Headlines and Evening Express Breaking News Business Headlines Maine Cannabis Report High School Sports Real Estate * I understand the Terms of Service. Comments This field is for validation purposes and should be left unchanged. This iframe contains the logic required to handle Ajax powered Gravity Forms."}, {"articleID": "2009083018_00073078_W", "names": {"Kevin Campbell": ["Q22305539", "Q42725237", "Q6395969", "Q6395970", "Q6395971", "Q927006"], "Bill Moseley": ["Q27917099", "Q862342"]}, "date": "2009-08-30", "url": "http://citizen.co.za/index/News/923826.page", "content": "johannesburg - while political factions question the judicial service commission's (jsc) decision to end investigations of misconduct complaints against western cape judge president john hlophe, law experts say the decision rings vindication for the judge. \"the fact that you do not like someone does not result in a stacking up of evidence against them .\" justice is not done when it has outcomes that favour our own private prejudices. \"it is done when it conforms to the principles of natural justice, due process and the constitution,\" said advocate <mark>kevin</mark> malunga of the high court of south africa. \"the jsc has engaged in an act of solomonic wisdom and has staved off a constitutional crisis as this decision is an embodiment of the conciliatory values found in south africa's constitution .\" in its announcement last week, the jsc said there was no prima facie evidence that hlophe sought to influence constitutional court judges on pending judgments against jacob zuma before he became president. however, congress of the people spokesman phillip dexter said the decision by the jsc was a political deal and not a finding based on evidence. \"judge hlophe's excuse, that he did know it was wrong to discuss the case pending against then-anc president jacob zuma, calls into question his suitability as a judge, let alone his nomination to the constitutional court,\" dexter said. meanwhile, independent democrats leader patricia de lille said the decision by the jsc should have been made after a full cross-examination of hlophe. notify me by email of new comments on this article all comments on this website are moderated. this process can take up to 24 hours. off the hook but still fishy the judicial service commission's (jsc's) majority decision not to proceed with an investigation into an allegation of gross misconduct against judge john hlophe is a watershed in our judicial history. hlophe says he's still in the dark cape town - western cape judge president and constitutional court nominee judge hlophe was on friday afternoon still waiting to hear whether the judicial service commission (jsc) had dropped a probe against him that carried the risk of impeachment. international bowls stars <mark>bill moseley</mark> and <mark>kevin campbell</mark> will be the celebrity guests at the opening of the delville trips tournament at the club next thursday evening. jsc hlophe decision on friday johannesburg - all eyes will be on the judicial service commission on friday when it makes known its initial findings on the complaints relating to western cape judge president john hlophe. \"no place for intolerance' johannesburg - south africa has no place for racism, tribalism, anti-semitism or xenophobia, president jacob zuma said at the south african jewish board of deputies 45th national conference at the weekend. women's event focuses on safety tshwane - tshwane metro's final women's month event was safety and security-orientated rather than feminine-focused. johannesburg - alleged samurai-sword killer morne harmse returns to the south gauteng high court today. colombo - sri lanka clinched second spot behind south africa in the official rankings as they swept aside new zealand by 96 runs in the final test yesterday to sweep the series 2-0. rain washes out t20 opener manchester - rain thwarted australia's bid to win a first twenty20 international in six matches after their series opener against england ended in a no-result washout at old trafford here yesterday."}]