[{"articleID": "2017100723_00024173_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Joe Mcknight": ["Q18749091", "Q6211275"]}, "date": "2017-10-07", "url": "http://www.theneworleansadvocate.com/baton_rouge/opinion/article_be52a350-a94a-11e7-b182-7b4b76aa3323.html", "content": "New Orleans Saints Coach Sean Payton has developed a new pattern of violating a fundamental rule of human behavior. That is saying something people don't want to hear. Most of us typically <mark>will</mark> say things we think people want to hear. If a woman asks if the dress she's wearing makes her look fat, most <mark>will</mark> say no, even if it makes her look so big she requires her own Zip code. But these days, politics has motivated many of us, including Coach Payton, to say things knowing full well it <mark>will</mark> anger many. As a country, we have split along ideological lines gravitating toward groupthink and tribalism. Saying anything political <mark>will</mark> be met with resistance and scorn. We do it anyway. I think that's a good thing. Coach Payton had to know back in April of last year after former Saints player <mark>Will Smith</mark> was tragically shot to death, his calling for stricter gun control would not sit well with many in red-state Louisiana. And then a couple of weeks ago, Payton praised the 10 Saints players sitting during the national anthem, saying he was proud of them. But the coach wasn't finished. He also questioned the wisdom of our current president. The very same president who overwhelmingly won the state in which Payton coaches. Coach Payton has apparently gotten used to his newfound political punditry, doubling down on his passion for gun control this past week by calling for it once again after the Las Vegas shooting. Even though I disagree with Payton on his views, I admire him for having the courage to express them. He <mark>will</mark> pay a price for it in that some <mark>will</mark> place their allegiance to their worldview above their loyalty to their football team. At least Coach Payton isn't as harsh and vitriolic as others calling for gun control. A Facebook friend of mine is extremely passionate about the issue. The Las Vegas shooting motivated him to post this about his heartache that the gun control debate seems to be over: Sean Payton again calls for gun reform after Vegas shooting: \"We need to be better' The Las Vegas shooting that claimed the lives of 59 people and injured 527 more prompted New...\"It was over when America decided that two dozen dead first - and second-graders were an acceptable price to pay for the right to own weapons that exist for no other purpose than killing large numbers of people in a short amount of time. All that's left for us to do now is document record-breaking atrocity after record-breaking atrocity .\" My friend's assertion that those opposing gun control are OK with the Sandy Hook massacre is obviously misguided, absurd and foggy thinking caused by an over-the-top emotional tantrum. I understand why this is a such a gut-level issue for gun control zealots. If what they believe is true, which is conservatives are OK with the mass shooting of kids, they should be outraged. This further illustrates the divide that separates us ideologically. Unfortunately, conservatives often see leftists as nuts, and many leftists view conservatives as evil. It's hard to unite with that dynamic in play. Saints shaken by <mark>McKnight</mark> killing, N.O. shootings: \"It has nothing to do with race' The news of <mark>Joe McKnight</mark>'s shooting death hit the New Orleans Saints' locker room hard. So what do we do about all of this dissension, disunity, and enmity between us? Keep our deeply held views to ourselves? Of course not. Truth is, we couldn't if we tried. We are all closely married to our beliefs and take them very personally. They are a part of who we are. What would be nice is if we could find the strength, grit, and determination to stop assuming the worst of each other. As a conservative, it appears to me this problem is much more severe and common from my friends on the left, but then again, I am obviously biased. My fellow conservatives should stop thinking leftists are crazy just because we view their logic as nutty, emotionally based, and unreasonable. I think Coach Payton may have struck the right cord. He courageously expressed controversial opinions without insulting anyone, assigning malice, or questioning motives. I heard once that we are never weaker in our arguments than when we attempt to explain what motivates those we are debating. None of us can see inside the human heart. We would all do well to remember that."}, {"articleID": "2011070512_00117956_W", "names": {"Barry Cooper": ["Q4864115", "Q4864116", "Q4864118", "Q706646"]}, "date": "2011-07-05", "url": "http://rawstory.com/rs/2011/07/05/greenpeace-ship-rainbow-warrior-iii-debuts/", "content": "greenpeace ship rainbow warrior iii debuts greenpeace unveiled a new weapon in its campaign against environmental destruction on monday--a 23 million euro ($33.4 million) ship dubbed the rainbow warrior iii. the state-of-the-art vessel went afloat in berne-motzen in northern germany ahead of its official launch to mark greenpeace's 40th birthday in october. the original rainbow warrior, a converted fishing trawler, was sunk by french agents in new zealand in 1985 while attempting to stop nuclear testing in the pacific. the second is more than 50 years old and is being retired after having been \"rammed, raided and bombed\" in numerous campaigns against nuclear testing, over-fishing and illegal logging, greenpeace says. the 58-metre-long (190-foot-long) rainbow warrior iii is the first to be built from scratch to its own specifications. the boat is powered by sails on its 50-metre masts, by an electric motor allowing it to reach a top speed of 10 knots (18 km/h) and a diesel engine giving it 15 knots (28 km/h). capable of housing a crew of up to 33 for four weeks without outside supplies, it also has a helipad in the stern and its masts will be decked out with 48 antennae and other pieces of electronic gadgetry. \"it's a symbol of our fight,\" said greenpeace germany member christian bussau. \"we want the greenpeace tradition of protecting the sea to continue, and that's why, for a third time, we're calling this vessel the rainbow warrior .\" activists rally to push for maximum sentence for nypd cops acquitted of rape new cooperative programs may jumpstart hiv vaccine development where to from here?: aids' anniversary prompts speculation about the future exclusive: hackers unearth fbi report on \"kopbusters' filmmaker <mark>barry cooper</mark>"}, {"articleID": "2009050401_00125606_W", "names": {"Tony Green": ["Q16209660", "Q7822483", "Q7822485", "Q7822486"], "Christopher Kelly": ["Q15982089", "Q24705180", "Q5112665", "Q5112666", "Q57452850", "Q58216989", "Q58331187"], "Brent Jones": ["Q18208348", "Q19895523", "Q3373154"]}, "date": "2009-05-04", "url": "http://usatoday.com/news/health/2009-05-01-compounding-pharmacies_N.htm", "content": "pharmacist ephrem degefu mixes medication at his coastal compounding pharmacy in west palm beach, fla. compounding pharmacies, thousands of which operate nationwide, have attracted attention with the recent deaths of 21 polo horses that died after being given a poorly mixed batch of vitamin and mineral supplements. by brian skoloff, associated press west palm beach, fla. - pharmacist ephrem degefu's shelves are stocked with clean, white bottles of powdered chemicals, all essential ingredients in hundreds of commonly used medications. but degefu isn't repackaging medications like your typical corner drugstore. he's making them. degefu is a compounder, a pharmacist who custom-mixes drugs for patients. although they have been around for centuries, compounding pharmacies are getting attention because of the recent deaths of 21 elite polo horses that were given a lethal cocktail of drugs erroneously mixed up by a compounding pharmacy in florida. in contrast to the arduous and expensive process by which new pharmaceutical products come to market, critics say oversight of compounders is spotty and that patients - human and animal - are sometimes given medications that regulators never tested. occasionally, the results are deadly. \"the whole system is full of holes, or maybe it's not even a system,\" said larry sasich, a pharmacist and professor at the lake erie college of osteopathic medicine school of pharmacy in erie, penn. others say they serve a vital role and that mistakes are rare. \"there are just a lot of patients who need a medication that's not commercially manufactured,\" said l.d. king, executive director of the international academy of compounding pharmacists. \"and i think it's well-regulated, and it's improving .\" patients who turn to compounders include people who are allergic to inactive ingredients in fda-approved medicines, or those who need a different dose or a different form of delivery - such as a cream, powder or injectable liquid - than what is commercially available. any licensed pharmacist can compound drugs, but a doctor's prescription is required. the polo horses began dying on april 19, just before a championship match near west palm beach. they were given a cocktail of vitamins and minerals from a florida compounding pharmacy that has acknowledged using too much selenium in the mix. like many others, the pharmacy mixes medications for both animals and people. florida officials later determined that the horses died of an overdose of selenium, a common mineral that is used to combat muscle fatigue but can be toxic at very high doses. from 1990 to 2005, the u.s. food and drug administration documented at least 240 serious illnesses and deaths associated with improperly compounded products. the agency noted that the numbers may be considerably higher because compounders aren't required to report ill effects. still, it's a tiny fraction of the thousands who suffer adverse reactions to manufactured, fda-approved drugs every year. in 2007, three people in oregon died after using a poorly made compounded drug that was 10 times stronger than it was supposed to be. the oregon department of justice sued the texas pharmacy that produced it, later settling the case. while department spokesman <mark>tony green</mark> said oregon officials believe drug compounding has legitimate uses, he added: \"we are concerned that drug compounding creates a loophole for marketing of drugs for purposes that are neither approved nor backed up by science .\" the fda has issued numerous warning letters over the years, but in almost every instance - including the oregon deaths - the pharmacy remains open. in 2006, the fda issued a warning letter to a maryland pharmacy for a bacteria-contaminated solution it created for use in open-heart surgeries. the drug caused severe infections in five patients at a virginia hospital. three of them died. and in 2005, the agency recalled a product that was distributed to eight states after two washington, d.c., patients were blinded and several others injured from use of a compound that was also contaminated with bacteria. there are about 5,000 pharmacies nationwide that specialize in compounding, according to king. they fill about 38 million prescriptions each year - about 1% of the roughly 4 billion prescriptions dispensed annually, he said. but many more traditional pharmacies also do some form of compounding, he said, including walgreens and other national chains. and hospitals also do it regularly. \"hospitals have a huge rate of medication errors, whether it's a wrong dose or a wrong drug,\" king said. \"mistakes are unfortunately all too common in health care and compounding pharmacies are not going to be immune .\" the fda does recognize the need for compounding pharmacies that alter and create medications to meet patients' needs, but the agency considers them all unapproved drugs and has not verified their safety or effectiveness. instead, regulation is left mostly to the states, but the rules vary from state to state and enforcement is sparse, said sasich, who called it a \"shadowy industry\" operating under standards \"more akin to the third world .\" and unlike drug manufacturers, compounders don't need to have their products tested before giving them to patients. in a 2006 study of compounded drugs, including female hormone medications, inhalation products, and local anesthetics, fda tests of 36 samples found that 12, or 33%, failed quality standards, including potency requirements. according to the study, the potency of the drugs ranged from 67.5% to 268.4% of the level declared on the product's label. by contrast, the agency's routine sampling of thousands of drug products made by commercial manufacturers yields a failure rate of less than 2%. \"the quality of compounded drugs creates an important public health concern,\" the agency wrote in its findings. still, the fda recognizes the need for compounding pharmacies that serve patients whose medications are not commercially available, agency spokesman <mark>christopher kelly</mark> said. basically, the fda recognizes the need, but doesn't officially condone the practice. \"that opens up pandora's box and a whole gray area, and that's where we all find ourselves,\" said dr. eleanor m. <mark>green</mark>, dean of the college of veterinary medicine and biomedical sciences at texas a & m university. \"and not all physicians and veterinarians clearly understand the issue .\" dr. eugene mironer, medical director at the greenville, s.c.-based carolina center for advanced management of pain, often turns to compounders to convert drugs into creams or gels when they aren't available in those forms. he also occasionally asks compounders to create more affordable versions of fda-approved drugs, or higher or lower dosages. and in some instances, he has medications made that are not fda-approved for treatment of a specific ailment. \"we use quite a few things that fda has not approved for certain uses,\" mironer said. \"we don't need to follow exactly how they have approved it for use. we do whatever is benefiting the patients .\" to report corrections and clarifications, contact reader editor <mark>brent jones</mark>. for publication consideration in the newspaper, send comments to"}, {"articleID": "2019011705_00248118_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Chris Cuomo": ["Q16728305", "Q5112179"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"]}, "date": "2019-01-17", "url": "http://europe.newsweek.com/rudy-giuliani-i-never-said-there-was-no-collusion-trump-campaign-1295066", "content": "Rudy Giuliani:' I Never Said There Was No Collusion' With <mark>Trump</mark> Campaign On 1/17/19 at 12:27 AM Share U.S. Rudy Giuliani said Wednesday that President <mark>Donald Trump</mark> didn't collude with the Russians during the 2016 presidential campaign, but never denied the campaign colluded with the Russian government. In an interview with CNN's <mark>Chris Cuomo</mark>, Giuliani said he can't speak for anyone who worked for the campaign, including former campaign chairman Paul Manafort. \"I never said there was no collusion between the campaign or people in the campaign,\" Giuliani said on <mark>Cuomo</mark> Prime Time. \"I said the President of the United States. There is not a single bit of evidence the President of the United States committed the only crime you can commit here, conspiring with the Russians to hack the DNC .\" The president and his closest allies have maintained they never had collusion between the campaign and the Russian government. A report says an insider close to the <mark>Trump</mark> campaign admits that Manafort tried swapping polling data to Ukrainian associates tied together with Russian intelligence officials. Giuliani told <mark>Cuomo</mark> that his client, <mark>Trump</mark>, only learned of such accusations through the news, and that the president never shared polling data. CNN \"<mark>Donald Trump</mark> wasn't giving polling data to anyone,\" Giuliani said. \"He did not know about it until it was revealed a few weeks ago in an article .\" The president has repeatedly denied any link between his campaign and the Russian government--at least 13 times through tweets. \"Democrats can't find a Smocking (sic) Gun tying the <mark>Trump</mark> campaign to Russia after James Comey's testimony. No Smocking (sic) Gun...No Collusion .' @ FoxNews. That's because there was NO COLLUSION. So now the Dems go to a simple private transaction, wrongly call it a campaign contribution,\" <mark>Trump</mark> tweeted on Dec. 13. The president has often said the Democrats are on a \"witch hunt\" in efforts to find any evidence of corruption, including the court case against former attorney <mark>Michael Cohen</mark> and his payment of hush money to two women in 2016 for alleged extramarital affairs with the future president. \"Which it was not (but even if it was, it is only a CIVIL CASE, like Obama's - but it was done correctly by a lawyer and there would not even be a fine. Lawyer's liability if he made a mistake, not me),\" <mark>Trump</mark> said. \"<mark>Cohen</mark> just trying to get his sentence reduced. WITCH HUNT!\" "}, {"articleID": "2018032912_00165744_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-03-29", "url": "http://www.sandiegouniontribune.com/la-me-ln-essential-california-20180329-story.html#nt=oft11aH-15li2", "content": "Good morning, and welcome to the Essential California newsletter. It's Thursday, March 29, and here's what's happening across California: TOP STORIES Across the country, the presidency of <mark>Donald Trump</mark> has put immigrants who are here illegally on edge. In Lincoln Heights, a neighborhood of 28,000 just northeast of downtown Los Angeles, that tension has become a part of daily life. A team of Times reporters spent months there last year to capture how one of California's oldest ports-of-call for immigrants has wrestled with the changing tone of the national debate--and to see the day-to-day adjustments residents have made in their lives. Los Angeles Times Plus: Léelo aquí en español. Los Angeles Times Getting ready for the Big One A number of cities big and small in Southern California are taking steps to identify seismically vulnerable buildings for the first time in a generation, acting in part on the devastating images of earthquake damage in Mexico and elsewhere around the world. In hopes of mitigating the loss of life from a major quake that experts say is inevitable, Long Beach is discussing spending up to $1 million to identify as many as 5,000 potentially vulnerable buildings. The city of Moorpark already has agreed to spend up to $10,000 for its own survey of at-risk buildings. Los Angeles Times DiFi and the guns The violent experience of being the first person to discover Supervisor Harvey Milk on the floor of his office, shot, has shaped the views and career of Dianne Feinstein. Now a U.S. senator, she is perhaps best known for her quest over 25 years in Congress to enact stricter national gun control, including authoring the now-expired original assault weapons ban. Los Angeles Times L.A. STORIES What's going on here? Why does a city without its own police force have a weapons vault? Questions are mounting after 31 pistols go missing in Compton. Los Angeles Times Big new rivalry: The Galaxy and Los Angeles Football Club meet for the first time in a crosstown rivalry in which emotions are already running high. The StubHub Center sold out nearly two weeks ahead of time, and supporters of the two teams are trading insults--and worse--both on social media and in person. Los Angeles Times Beisbol is back! In advance of opening day, Vin Scully comes out of retirement for 60 seconds. Los Angeles Times Plus: Learn how one enterprising graphic reporter at The Times used data to pick the perfect seat at Dodger Stadium. Los Angeles Times Funny: The streets of Los Angeles, if they were your garbage friends. The New Yorker IMMIGRATION AND THE BORDER More backlash: \"Two Huntington Beach city councilmen said they want to follow the lead of Los Alamitos and other cities in an effort to seek relief from state mandates that expand protections\" for immigrants here illegally. Los Angeles Times POLITICS AND GOVERNMENT Look who's tweeting! President Trump appears to have finally found a part of California he likes--Orange County. Los Angeles Times Plus: \"Orange County's anti-sanctuary fervor is all but guaranteed to backfire,\" argues Gustavo Arellano. Los Angeles Times Mum's the word: Gubernatorial front-runner Gavin Newsom will not participate in any more debates until early May, a spokesman for this campaign said Wednesday. Los Angeles Times Census trouble: \"With the Trump administration in charge, voting rights advocates fear the undercount [of minorities in the census] could be amplified, shifting economic resources and political power toward rural, white, and Republican communities .\" Nowhere would that be felt more than in California. Mother Jones Wow! \"California signed up an estimated 450,000 people under Medicaid expansion who may not have been eligible for coverage, according to a report by the U.S. Health and Human Services' chief watchdog .\" Kaiser Health News CRIME AND COURTS Body identified: A body discovered in a shallow grave in Northern California earlier this week has been identified as missing Macedonian model Adea Shabani, authorities said Wednesday. Los Angeles Times Sad: \"Mendocino County Sheriff Tom Allman said Wednesday it's likely all six children of a Washington state couple perished with their two mothers when their family car plunged over a cliff on the north Mendocino Coast on Monday night .\" Press-Democrat The world today: \"Law enforcement at Coachella is bracing for the possibility of a Vegas-like massacre, and it's taking radical steps to make sure it thwarts any plot and protects concertgoers .\" TMZ THE ENVIRONMENT Big change if it happens: \"Southern California's biggest water agency is considering picking up most of the bill for overhauling the state's waterworks without any guarantee that it will eventually recoup its additional, multibillion-dollar investment .\" Los Angeles Times In the desert: The Department of Energy is trying to turn the Salton Sea into \"a farm for renewable fuels--and clean its infamously polluted water in the process .\" Vice News CALIFORNIA CULTURE The big picture: Facebook and other technology companies use sophisticated design strategies intended to convince users to hand over their data. That's fueling a huge ethical debate. Los Angeles Times Ooof: \"Uber will not renew its permit to test autonomous vehicles on public roads in California .\" The Verge History lesson: In 1986, a spring break riot changed Palm Springs. Here is the video. Desert Sun Down it goes: A three-judge panel has handed a defeat to historic preservationists, upholding the city's plan for demolishing a 1960 bank building on the site of a planned Frank Gehry-designed mixed-use complex. Los Angeles Times CALIFORNIA ALMANAC Los Angeles area: sunny, 78, Thursday; partly cloudy, 80, Friday. San Diego: sunny, 72, Thursday; partly cloudy, 74, Friday. San Francisco area: partly cloudy, 71, Thursday; partly cloudy, 68, Friday. Sacramento: partly cloudy, 81, Thursday; partly cloudy, 82, Friday. More weather is here. AND FINALLY Today's California memory comes from Katie Raddon: \"In 1980 my family piled into our station wagon and drove from Utah to Oceanside. Listening to the ocean crash against the shore all night long in our beach rental was magical. After that I would get homesick for the ocean every time I heard\" The Tide Is High' by Blondie. I got the opportunity to move to Los Angeles after college, and I jumped at the chance. Finally, I felt I had arrived home. It's been over 23 years, and I've not left yet. I met my husband here, and now we have kids of our own. We love L.A.! \"CAPTION Compton officials are scrambling to explain the theft of 31 handguns from a municipal vault Compton officials are scrambling to explain the theft of 31 handguns from a municipal vault CAPTION Compton officials are scrambling to explain the theft of 31 handguns from a municipal vault Compton officials are scrambling to explain the theft of 31 handguns from a municipal vault CAPTION Dodger Stadium is one of the most beautiful places in the world to watch a baseball game--if you pick the right seat. Dodger Stadium is one of the most beautiful places in the world to watch a baseball game--if you pick the right seat. CAPTION Mojave Max officially emerged from his burrow on Friday at 11:11 a.m. to certify that spring has arrived in Las Vegas. Mojave Max officially emerged from his burrow on Friday at 11:11 a.m. to certify that spring has arrived in Las Vegas. CAPTION People met at Self-Help Graphics in Boyle Heights to create signs they'll carry to the march calling for action to end gun violence and mass shootings in schools. People met at Self-Help Graphics in Boyle Heights to create signs they'll carry to the march calling for action to end gun violence and mass shootings in schools. CAPTION President Trump has struggled to hire top-shelf lawyers who typically relish the prestige of representing a president. President Trump has struggled to hire top-shelf lawyers who typically relish the prestige of representing a president. If you have a memory or story about the Golden State, share it with us. Send us an email to let us know what you love or fondly remember about our state. (Please keep your story to 100 words .) Please let us know what we can do to make this newsletter more useful to you. Send comments, complaints and ideas to Benjamin Oreskes and Shelby Grad. Also follow them on Twitter @ boreskes and @ shelbygrad."}, {"articleID": "2017082412_01044261_W", "names": {"Matt Baker": ["Q11771606", "Q30555607", "Q6788298", "Q6788301"]}, "date": "2017-08-24", "url": "http://tbo.com/blogs/gators/fsu-bama-almost-feels-like-a-national-championship-game-week-1/2334907", "content": "FSU-Bama \"almost feels like a national championship game Week 1' MONICA HERNDON | Times <mark>Matt Baker</mark> Published: August 24, 2017 The buzz is continuing to build for next Saturday's blockbuster showdown between No. 1 Alabama and No. 3 Florida State .\" It almost feels like a national championship game Week 1, \"ESPN analyst Kirk Herbstreit said during a teleconference Wednesday. It's the highest season-opening matchup ever and one of only four top-five season openers. One of the most interesting aspects to the game in Atlanta is the coaching matchup - Nick Saban against his former pupil, Seminoles coach Jimbo Fisher .\" If you put those two guys in a cornhole game together for halftime entertainment, that might be as good as the actual game itself, \"Herbstreit said .\" They want to win and compete. That has a lot to do with why they've both enjoyed so much success. \"I'd totally watch that competition. It's better than the chest-pass-the-ball-into-a-soda-can-thing games. A few other excerpts from Herbstreit: * He said a Jim McElwain offense typically has a cerebral quarterback who\" was literally an extension of him into the huddle, \"even if that player wasn't the most talented. Herbstreit didn't say this, but I will: That sounds like Luke Del Rio to me. * He predicts FSU to meet Miami (again) in the ACC title game and said Mark Richt clearly looks refreshed since rejoining his alma mater .\" He looks as young and energetic as I've seen him, \"Herbstreit said. * Herbstreit said he was blown away by the toughness of FSU quarterback Deondre Francois .\" It seemed like every play he played, he was on his back, or he was throwing a touchdown pass, \"Herbstreit said. Francois, for the record, threw 20 touchdown passes and was sacked 36 times."}, {"articleID": "2016051712_00379082_W", "names": {"Jack Williams": ["Q21063370", "Q21665118", "Q39078979", "Q55362692", "Q57887052", "Q6115801", "Q6115805"]}, "date": "2016-05-17", "url": "http://www.dailypost.co.uk/news/north-wales-news/crash-left-freerunner-jack-bellis-11344512", "content": "A teenager famous for his free running, dare-devil stunts was left with potentially permanent brain damage after a car crashed while his best friend was at the wheel. <mark>Jack</mark> Bellis, 19, who has been pulling off stunts including scaling Chester Cathedral since he was 13, had to be sectioned under the Mental Health Act at one stage because his injuries had caused a personality disorder. Today, as the youth driving the vehicle - 19-year-old Jonathan <mark>Jack Williams</mark> - was sentenced to 28 months youth detention - his family spoke of their heartbreak at <mark>Jack</mark>'s ordeal. In a victim impact statement read to Mold Crown Court <mark>Jack</mark>'s mother said that it was difficult to know to what extent her son might improve, which was heart-breaking. She had found it very difficult to deal with the prospect of her son having changed for ever. In her statement, read by prosecutor David Mainstone, she said she had to come to terms with the realisation that he might not well get back to the way he was before the crash occurred. Stacey Oliver <mark>Jack</mark> Bellis suffered serious injuries in a head-on crash in Tanyfron in Wrexham He had started to improve and the family were also trying to come to terms with the possibility that his recovery would be a very long term proposition. It had been very difficult to see him on life support at Stoke, she travelled there every day and it had been easier for family to visit when he was transferred to Wrexham. She said that it had been upsetting for <mark>Jack</mark> himself to be in a mental health unit. He had been sectioned because he refused to co-operate. READ: WATCH: Freerunner <mark>Jack</mark> Bellis's incredible street acrobatics He had begun to talk and while his family could understand him it was difficult for other people to understand him. The effect of the crash had a massive impact on the family, she explained. <mark>Williams</mark>, of Bryn Awel, New Broughton, previously admitted causing serious injuries by driving his Ford Fiesta dangerously, as well as driving above the legal cannabis limit, having no insurance, licence or MOT. The crash happened on November 26 last year, when the Fiesta ran head-on into another vehicle on Heritage Way in Tanyfron, Wrexham. \"You very nearly killed him' Gareth Morris was driving properly on the correct side of the road when he saw the on-coming headlights of a car weaving from side to side. The car then crashed head-on into him causing serious injuries to all three. Both vehicles suffered\" catastrophic \"damage. It turned out that <mark>Williams</mark> had been smoking cannabis and had a level of 5.7 microgrammes compared to the legal limit of two. <mark>Jack</mark> Bellis had suffered severe injuries including an organic brain injury and spent five at the regional trauma unit at Stoke before being returned to the Wrexham Maelor Hospital where he was still an in-patient. He had been sectioned and was being treated at a specialist unit. Mr Mainstone said that it was very difficult to know the long term prognosis in view of the severity of the initial injury. He suffered a fractured spleen and other injuries. The court heard the two had grown up together, were firm friends and remained so, and the defendant continued to visit him. Mr Morris had difficulty sleeping and suffered flash-backs, and was thousands of pounds out of pocket following the crash. Judge Rowlands said that the case should serve as a lesson of the dangers of drug driving, which could have very serious consequences. <mark>Williams</mark> would have to live with the fact that he caused such dreadful injuries to <mark>Jack</mark> Bellis that night as a result of his irresponsibility .\" You very nearly killed him, \"the judge said .\" He suffered life-changing injuries. \"\"Guilt will stay with you for rest of your life' The view captured by <mark>Jack</mark> Bellis from the top of Rhyl's SkyTower during one of his stunts Judge Rowlands said that judging from the photographs of the vehicles after the collision\" it was the greatest good fortune that the injuries were not worse, if not fatal, for all three involved, \"he said .\" This is an extremely serious offence when you caused serious injury by driving dangerously when you were not in a fit state because you had smoked cannabis and were over the limit for doing so, \"he explained. Peter Barnett, defending, said that his client and <mark>Jack</mark> Bellis had been friends most of their lives and had bought the Fiesta together in order to do up and make some money. READ: WATCH: Daredevil Wrexham teen slammed after filming himself scaling 120ft cathedral tower Both went out that night, it was by chance that <mark>Williams</mark> was behind the wheel. It was aggravated by the fact that he had smoked cannabis and by the condition of the vehicle. An investigation showed the road surface was inadequate and there had been several collisions due to its condition - but his client accepted his responsibility. There was no excessive speed, the combined impact speed was between 40 and 50 mph. The collision caused catastrophic damage which had severe consequences, his friend had been left with brain damage, the other driver was injured, and his own client had received broken bones and other injuries, had been in hospital eight weeks and now still used a crutch. He himself had effectively been a prisoner in his own home and slept on a bed in the living room because of his own mobility problems. The fact that he had caused his friend such serious injuries would be with him for the rest of his life. He was not particularly mature, was naive and probably at the time of the offence he probably did not appreciate the danger he was putting himself and his best friend in, Mr Barnett said."}, {"articleID": "2011071014_00069332_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"], "Julia Roberts": ["Q40523", "Q6306690", "Q6306692"]}, "date": "2011-07-08", "url": "http://thefader.com/2011/07/08/video-beyonce-best-thing-i-never-had/", "content": "we postulated once that beyonce was a mini-michelle obama, her democratic principles of hard work and love for the people firmly in tact. but b is a modern woman, rife with all kinds of conflicting fantasies, and in her video for \"best thing i never had,\" she seems keen to emulate more traditional princesses like <mark>kate middleton</mark> and <mark>julia roberts</mark>, women whose smiles, charm and nice hair had them walking down the pop culture aisle, <mark>middleton</mark> at buckingham palace and <mark>roberts</mark> over and over again in romantic comedies. that's fine: the 21st century provides all kinds of options for women. it's nice to see beyonce playing dress up, checking which shoe (glass slipper? sensible stiletto?) fits her best of all."}, {"articleID": "2009092114_00114158_W", "names": {"Nancy Johnson": ["Q2580287", "Q519074"]}, "date": "2009-09-21", "url": "http://onenewspage.com/news/Front+Page/20090921/4585801/Health-Care-issues-Mandated-individual-coverage.htm", "content": "register to store your twitter account details clintcast the morning shift report in health care sets the tone for everything. it needs to be with everyone present and dealing with big issues. justinbernier former rep. <mark>nancy johnson</mark> showed great support for our campaign yesterday in farmington. good thing she is still working health care issues. @ foxandfriends it sounds like all he cares about health care. but all issues are important. tom are health insurance companies generally being fair and honest when they reject claims from policy...spawning salmon the gravitational change in the media that has left some formerly influential journalists floating...full text of barack obama's speech to congress on healthcare reform madame speaker, vice president biden, members of congress, and the american people: when i spoke here...excerpted from the book \"1001 things they won't tell you .\" 1. \"my title may...in his remarks at organizing for america \\'s national health care forum on thursday, president obama ..."}, {"articleID": "2014090506_00018092_W", "names": {"Peter Orszag": ["Q13538222", "Q730580"]}, "date": "2014-09-05", "url": "http://abqjournal.com/457046/news/democrats-health-proposal-targets-cost.html", "content": "PUBLISHED: Friday, September 5, 2014 at 12:02 am...............................................................................................................WASHINGTON - Borrowing a Republican idea, a group including former senior Obama and Clinton advisers is unveiling a novel proposal to let states take the lead in controlling health costs. Individual states would set their own targets to curb the growth of health care spending. If they succeed, they'd pocket a share of federal Medicare and Medicaid savings, ranging from tens of millions to $1 billion or more, depending on the state. The plan, released Thursday, comes from the Center for American Progress, a public policy think tank closely associated with the White House. The center's former president, John Podesta, currently serves as counselor to President Barack Obama. Called \"Accountable Care States,\" the new option would be voluntary, reflecting longstanding Republican preferences. To address Democratic concerns, participating states would have to maintain insurance coverage levels and enforce consumer quality standards to claim their financial dividends. The state spending targets would encompass private spending, as well as Medicare, Medicaid, state and local employee insurance plans, and subsidized private coverage under the new health law. States would not have to expand Medicaid under Obama's health care overhaul to participate. Release of the plan follows a government report earlier this week that projects a return to unsustainable levels of health care inflation. Spending has been held in check the past five years largely because of a weak economy. The proposal is also a sign of Democratic sensitivity to a major piece of unfinished business for Obama's Affordable Care Act - cost control. Obamacare remains politically risky for Democrats in this fall's political campaigns. \"Given the current political gridlock, it is unlikely that the federal government will take the lead on reforms to control health care costs systemwide,\" the proposal said. \"States must therefore play a leadership role, with the federal government empowering...them to act .\" EMANUEL: Plan has roots from both parties (AP Photo/J. Scott Applewhite) Authors include Neera Tanden, a former top policy adviser to Obama as well as to Hillary Clinton; <mark>Peter Orszag</mark>, Obama's first budget director; Joshua Sharfstein, former deputy commissioner at the Food and Drug Administration under Obama, and Ezekiel Emanuel, a physician, former Obama health policy adviser and older brother to the president's first chief of staff, current Chicago Mayor Rahm Emanuel. Podesta was not on the list. \"It's got some Republican roots to it, and it's got some Democratic roots to it,\" Ezekiel Emanuel said. \"We wanted to create a bipartisan proposal that does take advantage of some Republican ideas and is cognizant of Democratic concerns, and use it to transform the whole delivery system .\" Authors plan to shop the idea around to top policymakers on Capitol Hill and in the administration. Congressional approval is needed to fully develop the concept. Obama's health care overhaul faces big challenges Catacomb-hopping horror flick \"As Above, So Below' is hopeless and hardly credible"}]