[{"articleID": "2014120513_00073352_W", "names": {"Sofia Vergara": ["Q231911", "Q28111741"], "Beverly Hills": ["Q4899544", "Q923258"], "Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2014-12-05", "url": "http://latino.foxnews.com/latino/entertainment/2014/12/05/sofia-vergara-reveals-passed-her-us-citizenship-with-perfect-score", "content": "<mark>Sofia Vergara</mark> attends the Hollywood Foreign Press Association's Grants Banquet on August 14, 2014 in <mark>Beverly Hills</mark>. <mark>Sofia Vergara</mark> revealed on \"<mark>Jimmy Kimmel</mark> Live\" that she has completed the process of being a U.S. citizen - she even got a perfect score on her citizenship test. \"I didn't know that you went through the official process of becoming an American citizen,\" <mark>Kimmel</mark> noted at the beginning of the interview. \"That's good news for us .\" \"You though I was here illegal?\" the Colombian native quipped back. \"I mean I couldn't be illegal and show my face on national TV. I mean I would have to be low key .\" <mark>Vergara</mark>, 42, said her process to become a U.S. citizen was not made easier because of her celebrity status. She said she had to jump through all the hoops \"because they have to make sure that you deserve to be part of the country .\" \"The most interesting thing for me was they give you like a hundred questions that you have to learn, and then they give you a quiz, like a test, and then you swear you are going to fight for the United States,\" she said. <mark>Vergara</mark> went on to say that it was a \"very emotional moment\" for her. \"It took me a lot of time to get my residency even though I was working here for a long time,\" she explained. \"But it was fun, and I got all my questions perfect .\" <mark>Sofia Vergara</mark> gushes about boyfriend Joe Manganiello, has awkward run-in with ex <mark>Vergara</mark> says she seduced boyfriend Joe Manganiello...with her smell Miss BumBum runner-up hospitalized after bad plastic surgery to enlarge thighs Topless Miss Bum Bum contestant shows off her assets in Paris Move over Kim Kardashian, Indianara Carvalho crowned Miss BumBum 2014 Colombian cycling team defends racy uniform: \"we are not considering changing it' The Miss BumBum Girls Go Selfie Crazy Mexican version of Miss BumBum competition now seeking\" aesthetic behinds' Piñata of nude Kim Kardashian turns tiny Mexican shop into international sensation Cámara de EE. UU. aprueba el bloqueo al alivio migratorio anunciado por Barack Obama Al menos 22.000 policías de Nueva York serán reentrenados para evitar nuevos incidentes Nuevo caso: Policía mata a un afroamericano desarmado en la ciudad de Phoenix, Arizona Peña Nieto anuncia \"Estrategia Emergente para la Reactivación Económica\" en Guerrero Christina Milian--All I Want for Christmas From Lil Wayne Is...Ariana Grande--I Can Make You Hot...With My Chocolate (PHOTO) Ariana Grande--Obsessed Fan in Santa Suit Placed on Psych Hold Splurge-Worthy Christmas Gifts That Will Delight Friends This Christmas"}, {"articleID": "2018101208_00104161_W", "names": {"Chris Weston": ["Q27889126", "Q5108451"]}, "date": "2018-10-12", "url": "https://wdef.com/2018/10/12/asian-stock-markets-stem-bleeding-left-behind-by-wall-street-2/#respond", "content": "International News US & World News Share on Facebook Tweet on Twitter Currency traders watch monitors at foreign exchange dealing room of KEB Hana Bank headquarters in Seoul, South Korea, on October 12, 2018 Ahn Young-joon / AP - Advertisement - Last Updated Oct 12, 2018 4:09 AM EDT SINGAPORE--Share prices in Asia rebounded Friday on a report that President Trump and his Chinese counterpart Xi Jinping may meet at the Group of 20 summit in Argentina in late November. The Wall Street Journal said the White House had informed officials in Beijing that it would go ahead with a summit meeting in Buenos Aires. It cited unnamed sources from both sides. There was no immediate word from Chinese officials in Beijing. The aim was to find a way out of the impasse over trade that has led both countries to impose penalty tariffs on billions of dollars of each other's exports. Strong Chinese export data also helped breathe life into share benchmarks that had languished in recent days. Defying tariffs, China's trade surplus with the United States grew to a record $34.1 billion in September, customs data showed. This marked a jump of 13 percent over a year earlier. Its exports to the United States rose to $46.7 billion although growth was slower than in August. Imports of U.S. goods grew too, but at a slower pace than before. On the overall, China's global exports picked up and its imports steadily increased. Asia's rebound followed another rout Thursday on Wall Street, where indexes tumbled for a second straight day on worries that rising interest rates and trade tensions could hurt global growth. \"It seems Asia has had a reassessment, and calmer heads have prevailed as we close out the week,\" <mark>Chris Weston</mark> of Pepperstone Group Limited said in a commentary. Japan's Nikkei 225 index gained 0.5 percent Friday to 22,694.66 after sinking early in the day following a nearly 4 percent loss on Thursday. Australia's S & P ASX 200 rose 0.2 percent to 5,895.70. Hong Kong's Hang Seng surged 1.8 percent to 25,726.78. The Shanghai Composite index advanced 0.9 percent to 2,606.91. Shares rallied in Taiwan and rose throughout Southeast Asia. A decline in the yield on 10-year Treasury yields hit bank stocks, while technology and retail companies stumbled. The benchmark S & P 500 index started the day with gains, but ended losing 2.1 percent to 2,728.37, its lowest close in three months and sixth straight loss. The Dow Jones Industrial Average dropped 2.1 percent to 25,052.83 and the Nasdaq composite gave up 1.3 percent to 7,329.06. The Russell 2000 index of smaller-company stocks fell 1.9 percent to 1,545.38. The U.S. Treasury will soon release a currency report that some analysts suggest might change the official stance on China's exchange rate policy. Reports that U.S. Treasury Secretary Steven Mnuchin was advised against labeling China as a currency manipulator--a status that could trigger penalties--have eased tensions, Stephen Innes of OANDA said. Despite \"a semblance of sanity returning,\" the markets are ultimately \"not out of the weeds,\" he added. Officials at the IMF-World Bank annual meeting, held on the Indonesian island of Bali this week, have called on the U.S. and China to work out their dispute over technology while abiding by world trade rules. On Friday, Indonesian President Joko Widodo alluded the tensions to popular TV series \"Game of Thrones\". He said fighting among the \"great houses\" was distracting them from the threat of an \"evil winter .\" \"Victory or defeat in wars always brings the same result--destruction,\" Widodo said. In other trading, U.S. crude oil added 84 cents to $71.81. The contract dropped 3 percent to close at $70.97 in New York. Brent crude, the international standard, was $1 higher at $81.26. It dropped 3.4 percent to $80.26 in London. The dollar strengthened to 112.40 yen from 112.13 yen late Thursday. The euro rose to $1.1598 from $1.1586. Wall Street was set for an optimistic open. S & P 500 futures rebounded 1.3 percent to 2,781.50. Dow futures was 1.2 percent higher at 25,494.00. © 2018 CBS Interactive Inc.. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report."}, {"articleID": "2012050921_00080965_W", "names": {"Al Lewis": ["Q4704293", "Q4704294"]}, "date": "2012-02-29", "url": "http://denverpost.com/breakingnews/ci_20063447?source=rss", "content": "with all the news focused on warren buffett's annual shareholders' letter, it was easy to miss jeremy grantham's more urgent missive. like buffett, grantham is a legendary value investor. he's co-founder of boston-based investment firm, gmo llc, which manages $97 billion. that's about half the market value of berkshire hathaway inc., but still big enough to produce a noteworthy letter. buffett, in his widely anticipated letter, is content to repeat platitudes, such as \"america's best days lie ahead .\" the oracle of omaha proclaimed \"the banking industry was back on its feet\" and even managed to find the bright side of foreclosures: \"large numbers of people who have\" lost' their house through foreclosure have actually realized a profit because they carried out refinancings earlier that gave them cash in excess of their cost. \"grantham, however, takes a longer view, and isn't so\" awe-shucks \"about the future of our broken economic system .\" capitalism, \"he writes,\" threatens our existence. \"already, capitalism is proving that karl marx and friedrich engels were at least partially correct. they\" looked forward to globalization and the supranational company because they argued it would make capitalism even more powerful, over reaching, and eventually reckless, \"grantham writes. globalization\" would...offer the capitalists more rope to hang themselves with...rope...bought from briskly competing capitalists, eager till the end for a good deal. \"grantham, who is british, studied economics at the university of sheffield and got his mba from harvard business school. he started his investment career as an economist with royal dutch shell before starting gmo in 1977. he says capitalism does almost everything better than any other economic system. it's just that its two or three main flaws are potentially fatal and have gone largely unaddressed. a sustainable economic system, for instance, can't be based on ever-increasing debt, corporations can't be allowed to run governments and loot treasuries, and\" growth at any cost \"is a recipe for planetary suicide. here are some of grantham's finer points:? capitalism too heavily discounts the future value of cash flows as it seeks to raise debts:\" your grandchildren have no value. \"? companies foolishly reward executives for taking on debt:\" total remuneration...for senior officers...rose as a percentage of the average worker's pay from 40 times in eisenhower's era to over 600 times today with no indication of any general improvement in talent. \"? it's about profits, not people:\" capitalism in general has no sense of ethics or conscience. whatever the supreme court may think, it is not a person. \"? the more people borrow, the more they just gamble:\" leverage...increases your returns over and over until, suddenly, it ruins you ....there are no investors anonymous meetings to attend. \"? this time, it's not so different:\" ignore the...inevitable cheerleaders who will assure you that this time it's a new high plateau...even if that view comes from the federal reserve itself. no. make that, especially if it comes from there. \"? washington is becoming a corporate subsidiary:\" what capitalism has always had is money with which to try to buy influence ....the issues they influence are precisely...the ones that are most important to society's...very existence. \"? big companies can't help it:\" ethical ceos can drag a company along for a while, but this is an undependable and temporary fix. \"? economic theory ignores natural laws. it suffers an\" absolute inability to process the finiteness of resources ....capitalism wants to eat into...limited resources at an accelerating rate with the subtext that everyone on the planet has the right to live like the wasteful polluting developed countries do today. \"? it's not just inexpensive oil we are running out of: the\" loss of our collective ability to feed ourselves, through erosion and fertilizer depletion - has received little or no attention. \"? americans are too optimistic:\" they adopt a hear-no-evil approach to life and listen exclusively to good news ....there are always a few experts lacking in long-horizon vision, simple common sense, or whose co-operation has been rented, like \"expert' witnesses at a murder trial, who can be dragged out to reliably say that everything will always work out fine .\" ? governments must step in. \"to interfere with marx's apocalyptic vision, we need some enlightened governmental moderation...before capitalism gets so cocky that we have some serious social reaction .\" ? where marx and engels got it wrong was in thinking workers would unite. \"it's going to be hard to have a workers' revolution with no workers. organizing robotic machine tools will not be easy .\" <mark>al lewis</mark>: 212-416-2617 or al.lewis @ dowjones.com; read his blog at tellittoal.com. copyright 2012 the denver post. all rights reserved."}, {"articleID": "2019101012_00044775_W", "names": {"Alex Cruz": ["Q19560299", "Q21196486", "Q27064245", "Q4717262", "Q9286389"]}, "date": "2019-10-10", "url": "http://www.burytimes.co.uk/news/national/17960231.british-airways-offset-carbon-emissions-uk-flights/", "content": "British Airways to offset carbon emissions from UK flights By Press Association 2019 British Airways aircraft 0 comment British Airways says it will become the first UK airline to offset carbon emissions on all its domestic flights. From January 2020, the carrier will invest in carbon reduction projects around the world to offset emissions from its flights within the UK. The airline operates up to 75 flights a day between London and 10 other UK cities, generating around 400,000 tonnes of CO2 each year. The projects being supported include those involving renewable energy, rainforest protection and reforestation. British Airways's parent company IAG has also committed to achieving net zero carbon emissions by 2050. The group claimed it can achieve this target through environmental initiatives such as investing more than 400 million dollars (£ 327 million) in the development of sustainable aviation fuels over the next 20 years. British Airways chief executive <mark>Alex Cruz</mark> said: \"British Airways is determined to play its part in reducing aviation's CO2 emissions .\" To solve such a multi-faceted issue requires a multi-faceted response and this initiative further demonstrates our commitment to a sustainable future. \"It also follows our announcement to partner with renewable fuels company, Velocys, to build a facility which converts household and commercial waste into renewable sustainable jet fuel to power our fleet .\" The airline is inviting passengers on non-domestic flights to \"reduce their impact on the environment\" through carbon offsetting. It offers a tool which calculates emissions, resulting in a flight from London to Madrid in economy costing £ 1 to offset, while London to Los Angeles in business comes with a £ 24 fee. 0 comment"}, {"articleID": "2010090609_00005308_W", "names": {"Edward Smith": ["Q19039805", "Q20899768", "Q21166160", "Q21166163", "Q21288800", "Q21288801", "Q25209592", "Q30441587", "Q51588961", "Q5345354"], "Simon Cowell": ["Q162629", "Q7518530"]}, "date": "2010-09-06", "url": "http://truthdive.com/2010/09/06/Kris-is-a-brilliant-dad-says-Dannii-Minogue.html", "content": "sydney, sep 06 (ani): dannii minogue is elated with the birth of her newborn son, ethan <mark>edward smith</mark> and has confessed that boyfriend kris smith is a brilliant dad. minogue and her partner smith recently enjoyed their first holiday with their son, ethan at qualia resort at hamilton island. \"it's good. i've just been absolutely blessed with a pretty good baby and a fantastic boyfriend who loves being a dad. ethan doesn't really cry unless he's hungry or really needs something,\" the sydney morning herald quoted her as saying. the new mum also admitted that smith knows everything related to child. \"oh, brilliant! he's the one who knows how to do everything and i just look at him and learn. he's really chilled,\" she said. the singer also hinted that her son might have a sibling, as her partner is keen for it and is also sure that ethan will not follow her footsteps. \"i don't know but i think kris is quite keen. he wants a rugby team!\" i would say ethan definitely won't follow in my footsteps. we were laughing the other day when we were having a family portrait and, of course, he peed and crapped all over us. i said, \"this is protest .' he is definitely not a minogue; he doesn't have the performing gene!\" she added. (ani) share @ facebook | google bookmarks | twitter related stories dannii minogue \"to be axed from next series of' x factor' dannii minogue's baby a man u fan kylie minogue obsessed with skin and sunscreen' x factor' boss <mark>simon cowell</mark> orders cheryl cole, dannii minogue\" to toughen up' my songs are sexier than me, says kylie minogue"}, {"articleID": "2015010519_00010100_W", "names": {"Luis Suarez": ["Q26517", "Q270367"]}, "date": "2015-01-05", "url": "http://www.laprensasa.com/309_america-in-english/2867180_british-royals-staff-deny-prince-andrew-sex-scandal-involvement.html", "content": "Ampliar Buckingham Palace, the British Royal Family's official residence, asserted Monday that Queen Elizabeth II never had any acquaintance or contact with the woman that filed a lawsuit accusing her son, Prince Andrew (seen in this file photo), of sexually abusing her while she was still a minor. EFE/File London, Jan 5 (EFE). - Buckingham Palace, the British Royal Family's official residence, asserted Monday that Queen Elizabeth II never had any acquaintance or contact with the woman that filed a lawsuit accusing her son, Prince Andrew, of sexually abusing her while she was still a minor. Prince Andrew, the Duke of York, is at the center of controversy after the press revealed that his name appears in a U.S. lawsuit against billionaire Jeffrey Epstein, which includes accusations by a woman claiming she was forced to have sex with the queen's third son when she was just 17 years old. U.K. media identified the woman as Virginia Roberts, whose father, Sky Roberts, told the tabloid \"Daily Mail\" that his daughter mentioned her acquaintance with Prince Andrew a few years ago, when she was living in London. She also told him that she had met the Queen during her stay in the British capital. However, a Buckingham Palace spokesman insisted that there is no evidence suggesting that these statements are true, especially since the Royal Palace does not have any record of the alleged meetings. Buckingham Palace recently denied that Prince Andrew was involved in any kind of relationship with Roberts while insisting that her allegations \"are false and without foundation .\" The name of Prince Andrew, 54, was mentioned in documents filed in a Florida court during the Jeffrey Epstein trial, in which Virginia Roberts accused him of forcing her to have sex with the Duke of York three times (in London, New York and on a private Caribbean island owned by Epstein) between 1999 and 2002, according to U.K. media. Roberts claimed that Epstein, Prince Andrew's personal friend who was sentenced in 2008 to a year and a half in prison for sex with minors, loaned her to \"rich and powerful friends\" as a \"sex slave .\" The Metropolitan Police Service noted that it has not received any notification regarding this case until now, but assured it will start an investigation once an official report is filed. Prince Andrew, one of the Royal Family's most controversial members, stepped down in 2011 from his position as special representative tasked with attracting foreign investment to Britain after his friendship with Epstein was revealed. Normas de comentarios www.laprensasa.com no se hace responsable de las ideas expresadas por los autores de los comentarios y se reserva el derecho a eliminar aquellos contenidos que: resulten ofensivos y/o discriminatorios que tengan como fin promover el boicot contra personas, productos empresas o instituciones que atenten contra el derecho a la intimidad, al honor y/o a la propia imagen o nombre British Royals' staff deny Prince Andrew sex scandal involvement Bull beaten to death by 20 people angers Colombians 13 Inmates escape from detention centers in Colombia Ecuadorean president in China on state visit South Florida city gears up for big Miss Universe party Tokyo contemplates reimposing sanctions on Pyongyang Colts and Cowboys book spots in NFL divisional playoffs <mark>Luis Suarez</mark>, Cristiano Ronaldo top league scorers in 2014"}, {"articleID": "2010092522_00111315_W", "names": {"Jose Ramos": ["Q3810558", "Q57974824", "Q5944854", "Q6279533", "Q6293794", "Q6293796"]}, "date": "2010-09-25", "url": "http://aaj.tv/2010/09/ahmadinejad-911-comments-obscenity-says-asian-president/", "content": "(0 votes, average: 0.00 out of 5, ahmadinejad 9/11 comments \"obscenity', says asian president united nations (26th september 2010 (4 seconds ago)) east timor's nobel peace prize-winning president, <mark>jose ramos</mark> horta, on saturday accused iran's outspoken leader of speaking\" obscenities \"when he evoked us government involvement in the september 11 attacks. horta said that president mahmud ahmadinejad went too far with his speech at the un general assembly on thursday when he said most people believe the us government orchestrated the 2001 attacks on new york and washington .\" president ahmadinejad is entitled to believe in, and regurgitate, whatever intellectual, philosophical or theological concoctions his unique mind may fabricate, \"horta said in his speech to the un assembly .\" however, i do not agree that any one of us should disregard basic rules and practices of conduct among leaders and utter obscenities in this august assembly. \"east timor's independence leader said that ahmadinejad's comments were\" an obscenity. \"\"he went too far as he has done many times before in this assembly and in other fora as when he questioned the facts of the holocaust .\" september 23, 2010 (4 seconds ago) us president barack obama and iran's leader mahmoud ahmadinejad take their political september 19, 2010 (4 seconds ago) iranian president mahmoud ahmadinejad held two hours of talks with his algerian counterpart september 25, 2010 (4 seconds ago) iran's president mahmoud ahmadinejad provoked yet another controversy on thursday saying a september 25, 2010 (4 seconds ago) iranian president mahmoud ahmadinejad said sunday that \"the future belongs to iran,\" september 26, 2010 (4 seconds ago) president mahmoud ahmadinejad has said iran would consider halting its 20 percent september 25, 2010 (4 seconds ago) all-rounder fawad alam is being investigated by the uk border agency following match-fixing claims: icc investigating pakistan's two slow overs"}, {"articleID": "2013061322_00088116_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"]}, "date": "2013-06-13", "url": "http://www.popsugar.co.uk/Jennifer-Aniston-Wedding-Hair-30795328", "content": "\"I Was Fat Cavill\" and More of Henry Cavill's Best Quotes Double Debut: Anna Paquin and Stephen Moyer Reveal Twins' Names at Their True Blood Premiere Inside Stella McCartney's 2014 Resort Collection Garden Party See Sienna Miller Blooming in Burberry from All Angles Jennifer Aniston is known for her fabulous hair, so it's only fitting that it was the subject of a special Q & A with Marie Claire. Jen was joined by her longtime stylist, Chris McMillan, as they discussed her least favorite hairstyle of all time and how she may wear her hair for her \"<mark>Kate Middleton</mark>. Does she do her hair herself? She's got a hard job, being scrutinized like that. When I have a bad hair day, my hair just goes in a clip .\" On her ideal wedding hair: \"For my wedding, I wouldn't do an updo, but I think a veil is always pretty. I like loose and natural hair because it goes against the formality of the dress. Loose, like' I just got out of bed, maybe had a romp' hair .\" Stylist Chris McMillan on the Rachel: \"I know that was Jen's least favorite hairstyle because I hear about it every time I style her hair .\" See Robert Pattinson's First Dior Ad"}, {"articleID": "2018052623_00281791_W", "names": {"Tom Keegan": ["Q57433677", "Q7816407"]}, "date": "2018-05-26", "url": "http://www2.ljworld.com/news/2018/may/26/kansas-fades-long-hot-day-ncaa-golf-championships/", "content": "By <mark>Tom Keegan</mark> Twitter: @ TomKeeganLJW Stillwater, Okla.--Even at the highest level of college golf, not many can pull off what freshman Harry Hillier did to finish his steamy, long day in the sun Saturday at unforgiving Karsten Creek in the NCAA championship. Hillier crushed a drive and stuck a 4-iron to 6 feet on the 575-yard 18th hole, which runs alongside Lake Louise. He made the putt for an eagle. And shot 81. \"Kind of like making a 3 at the buzzer when you're down four, isn't it?\" sixth-year Kansas coach Jamie Bermel said. \"Didn't really matter. That's about the way our day went too .\" Precisely. When the Jayhawks walked off the course, they were in dead last, 21 over par, in the field of 30 schools with a chance of moving up because some schools were just getting started. Friday's rain delay forced KU to play one-and-a-half rounds Saturday. The players started teeing off at 7 a.m. after finishing past 8:30 p.m. Friday. The difficulty of the course, the short turnaround, the searing heat and the enormity of the stage combined to make this not just another Saturday on the golf course for the Jayhawks. So far, KU's two seniors have handled it the best. Daniel Sutton, the team's straightest driver, has shot 71-73 to enter Sunday's round at even par. Daniel Hudson shot 76-72 and is 4 over, battling back from a triple-bogey 7 on his first hole of the tournament, No. 10 on Friday. Sophomore Andy Spencer (72-78) is 6 over. Harry Hillier (76-81) is 13 over, junior Charlie Hillier 82-79) 17 over. After Sunday's round, the field will be trimmed to 15 schools and the eight best of those after Monday will advance to match play. Do you believe in miracles? KU has so much ground left to make up, which in many instances would mean taking more chances is the way to go, but Karsten Creek counterpunches so viciously that might not be wise. \"I just don't know if you can be real aggressive out here because you're going to get punched in the nose if you get overly aggressive,\" Kansas coach Jamie Bermel said. \"The holes where we made big numbers on, a lot of the guys hit 3-woods and couldn't keep it in play. That part of it we just have to get better at. A lot of courses we play you can hit a driver and if it goes wayward you can still find it. Not out here .\" Sutton, who came to KU from Birmingham, England, wants to go out in style. \"For me and Hud, potentially it can be our last round of college golf,\" Sutton said. \"We're going to give it our all .\" Sutton has no ambivalence about the approach with the team so far behind. \"Same as always,\" he said. \"We're going to keep it in the fairway. If the putts start to fall and and a bunch of us start making birdies, you never know what can happen. We just need to stick to the game plan of hitting it in the fairway, post a respectable score and see where that leaves us .\" Kansas is one of seven Big 12 schools competing. Texas Tech (-5), Oklahoma State (-4), Oklahoma (+2), Texas (+4) need to hold their positions in the field to make the first cut. Baylor (+21) is just two strokes ahead of Kansas, and Iowa State, which teed off later than the rest of the Big 12 schools, hovered right around the cut line in the early going of its second round. Hudson did a nice job of capturing what makes Karsten Creek such a difficult challenge to negotiate. \"You can hit good shots off the tee and you have to aim to where the wind's going to push the ball to the fat part of the fairway,\" Hudson said. \"And that's if you're comfortable over the shot. But if you don't feel like you have a consistent flight off the tee, you're standing up there on a hole that's 40 yards wide and if you don't hit it in that 40-yard gap, you're re-teeing .\" KU's second round was marred by four triple-bogeys and two doubles. Copyright 2018 The Lawrence Journal-World. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. We strive to uphold our values for every story published."}, {"articleID": "2009031119_00011514_W", "names": {"George Galloway": ["Q332483", "Q42322064", "Q5539601"]}, "date": "2009-03-11", "url": "http://foxnews.com/wires/2009Mar11/0,4670,MLHamasBritishLawmaker,00.html", "content": "gaza city, gaza strip - a renegade british lawmaker who had financial dealings with saddam hussein and praised fidel castro in cuba can add this to his resume: an honorary palestinian passport, awarded during a secret meeting with the prime minister of hamas. a statement from the militant group that rules gaza said <mark>george galloway</mark> met with prime minister ismail haniyeh at an undisclosed location tuesday. haniyeh's office released a photo of the two men embracing. \"not only are you the prime minister of palestine, but you are our prime minister, too,\" <mark>galloway</mark> told haniyeh, on footage shown by israel's channel 10 tv. haniyeh has kept largely out of sight since israel launched a devastating military offensive against hamas last december in an effort to stop rocket fire from gaza. the european union considers hamas to be a terrorist organization. <mark>galloway</mark> entered gaza from egypt on monday, leading an aid caravan for victims of the israeli offensive. \"the lifeline from britain to gaza is in,\" he said. israel allows daily convoys of aid into gaza and denies that there are shortages of food, fuel or medicine. <mark>galloway</mark> left gaza on wednesday through the egyptian border. in recent years, the lawmaker has also been expelled from the labour party for urging british soldiers not to fight in iraq, claimed it would be \"morally justified\" for an assassin to target then-prime minister tony blair in response for britain's support for the war _ and lapped up imaginary milk and purred like a cat during his stint on the reality tv show \"celebrity big brother\" <mark>galloway</mark> was suspended in 2007 after an investigation found that a charity he set up was partly funded by the iraqi dictator. on a visit to iraq in 1994, he told hussein, \"sir, i salute your courage, your strength, your indefatigability .\" <mark>galloway</mark> later said he had been referring to the iraqi people. french climber who calls himself \"spider-man' climbs the building of hong kong's richest man."}]