[{"articleID": "2012021712_00033859_W", "names": {"Richard Lee": ["Q11890658", "Q16735186", "Q2150065", "Q2493449", "Q3934832", "Q54634631", "Q7327304", "Q7327305", "Q7327306", "Q7327309"], "John Wade": ["Q18593299", "Q3809668", "Q52691396", "Q54007499", "Q54007500", "Q56253538"]}, "date": "2012-02-17", "url": "http://sportinglife.com/story_get.cgi?STORY_NAME=racing/12/02/17/RACING_Trial.html", "content": "the prospect of testing conditions is giving <mark>richard lee</mark> plenty of confidence ahead of le beau bai's run in saturday's betfred grand national trial at haydock. after getting off the mark for the campaign in a chepstow handicap chase in early december, the nine-year-old returned to monmouthshire to secure welsh national glory in bottomless ground. with the emphasis sure to be on stamina again over three and a half miles on merseyside, <mark>lee</mark> feels le beau bai has plenty going for him as he bids to land a race in which he has finished third for the past two seasons. \"le beau bai has been fine since his win in the national, absolutely perfect,\" said <mark>lee</mark>. \"it can't be soft enough for him so the ground at haydock will be a big plus .\" he only went up 9lb for winning, which seems fair enough, you can go up that for winning a little race. \"seven lengths back in second in the welsh national was giles cross, filling the runner-up spot in the chepstow feature for the second year running. victor dartnall's charge is slightly better off at the weights with le beau bai this weekend and the trainer believes there will be little between them. dartnall said:\" he's in very good form, but it's not going to be easy beating le beau bai. \"he will enjoy the testing conditions and going up for chepstow was not the end of the world .\" that said, le beau bai has gone up 9lb so it will be very tight. \"i imagine denis (o'regan) will ride him positively. we are hopeful of a good run .\" heading the weights is the paul nicholls-trained neptune collonges, a horse who has competed in four runnings of the cheltenham gold cup. the 11-year-old has twice run well in the blue riband behind esteemed stablemates kauto star and denman and conditional jockey harry derham, who gets the leg up this weekend, feels he heads to haydock with solid claims. he said: \"the trip is right for him, which could be the main thing .\" three and a half miles looks ideal nowadays as he's been staying on over three in his races this season. \"his mark has dropped down a little from the start of the season and you'd like to think he had a good chance in a race like this .\" he looks fantastic and we've done plenty of work at home. \"hopefully his three runs have put him spot-on for this .\" next in the handicap is <mark>john wade</mark>'s pride and joy always right, who impressed on his seasonal return at kelso, but was a big disappointment when sent off favourite for the rowland meyrick chase at wetherby on boxing day. \"he's really well and i'm looking forward to a nice run from him,\" said <mark>wade</mark>. \"he had a bit of a virus on him later after he ran disappointingly at wetherby on boxing day .\" the run was too bad to be true so there had to be something there. he's in good fettle now. \"rey nacarado runs from out of the weights, but is still considered a major player by his trainer, charlie longsdon .\" we're 5lb out of the handicap so we've got that to find, but we think he is an improving horse, \"he said .\" he's improved all his career and even from earlier on this season. it is a big pot and it's a big prize go for. \"he's a good each-way price and he'll be nearer the top of the betting than the bottom .\" malcolm jefferson's king fontaine has won twice at the track and has slipped back down to his last winning mark following some disappointing efforts. he is set to go off a big price this weekend but jefferson would not be surprised to see his nine-year-old run a huge race. \"one of these days he's going to win a big race,\" said the norton-based handler. \"i really fancied him at haydock last time but he didn't jump well and it was a bit disappointing .\" he's done that twice with dougie (costello) now, so whether he doesn't get on with him, i don't know. \"we've done a lot of schooling with him and if he runs to his best form, he'd have a hell of a chance .\" fantasy f1----------------------------------------------------------------"}, {"articleID": "2016050310_00441503_W", "names": {"Anil Joshi": ["Q16148280", "Q2722277"]}, "date": "2016-05-02", "url": "http://www.rediff.com/news/special/did-the-timber-mafia-cause-the-forest-fires/20160502.htm", "content": "\"The kind of losses the nation is facing are incalculable .' Rashme Sehgal reports for Rediff.com on how fires are blazing across Jammu and Kashmir, Uttarakhand and have reached the doorstep of Himachal Pradesh's capital city Shimla. The Himalayas have turned into a veritable inferno. Fires are blazing across Jammu and Kashmir, Uttarakhand and have reached the doorstep of Himachal Pradesh's capital city Shimla. The rare oak forest stretching from the verdant hills of Mashobra to Anandpur in Himachal are ablaze and though desperate municipal corporation officials of Shimla have pressed the fire brigade into service, acute water scarcity has rendered the fire tenders ineffective .\" I brought my family to Shimla for a vacation. We came here to escape the heat of the plains and now we find ourselves trapped in this situation made worse by the erratic wind patterns and rising temperatures, \"says chartered accountant Harish Malhotra who had booked himself and his family into a hotel in Anandpur facing Shimla. The situation is even worse in Uttarakhand where the Char Dham Yatra is at its peak between the months of April to end June when the rains start. This year, lack of winter rains had seen forest fires start as early as the month of February. The state administration's failure to take effective action has seen this wall of fire stretch from Rudraprayag, Pauri, Almora, Chamoli, Nainital, Chakrata and Dehra Dun districts. The situation is so alarming that these fires have stretched to the sparsely populate remote hill areas which lack accessibility and where the local population is not in a position to tackle such a major fire. A thick pall of smog has spread across these districts right down to Rishikesh frightening thousands of tourists who are in the process of cancelling their visit to the shrines of Badrinath and Kedarnath right up to Gaurinath. Tour operators warn of heavy cancellations by tourists triggered by reports of the devastating fires .\" These forest fires are bound to impact tourism at a time when we were hoping that we would see a much larger footfall, \"says C Ravishankar, managing director, Garhwal Mandal Vikas Nigam which oversees tourism in this state. Already, over 3,000 hectares of pristine forest comprising deodars, chir trees and oak have been destroyed. Along with this, an entire eco-system of rare medicinal plants have been lost. The impact of these fires will be felt on the fragile water systems of these hills which provide the catchment area for all our major rivers. If this was not enough bad news, the forest department of Jammu and Kashmir has confirmed that the fires have spread to the state's Rajouri district with fires having erupted in and around Bathuni and Gambhir areas. With no chief minister to take responsibility for the situation, Uttarakhand Governor K K Paul has reviewed the rescue efforts through video conferencing with officials in the field. Union Environment Minister Prakash Javadekar, who is also in charge of forests, told the media on Sunday that the Centre and he were taking the issue of controlling these fires\" very seriously .' \"Over 6,000 people are presently deployed fighting these fires. We have also granted Rs 5 crore (Rs 50 million) to the state,' said Javdekar who had not visited the areas at the time of filing this report. The environment ministry also started trial runs Sunday for a pre-fire alert system that will issue warnings via SMS regarding the location of a fire to every state government, the Met department and other concerned organisations. Javadekar also pointed out that the Union government would study the reasons behind such major fires and prepare an action plan on how to control such fires in the future. The home ministry has deployed three National Disaster Response Force contingents, army jawans and officers and two Indian Air Force Mi-17 helicopters to help douse the fires, but the thick layer of smog is causing a major visibility problem not allowing the choppers to function. Ecologist Dr Yogesh Gokhale of The Energy and Resources Institute believes the state governments have failed to follow simple management practices including the cleaning up of the forest floors of the accumulated pine needles. This, Dr Gokhale pointed out, is highly combustible material and if it had been cleared by the local people themselves, this problem would not have arisen. These pines can be used for a variety of purposes including preparing biomass briquettes and so provide an incentive for the local people to use them. Dr <mark>Anil Joshi</mark>, who heads the Himalayan Environmental Studies and Conservation Organisation, believes the time has come to revoke the Forest Conservation Act 1980 .\" Earlier, the local communities in a spirit of collective responsibility were in the forefront of controlling the fires, \"Dr <mark>Joshi</mark> said .\" This was because they had a stake in the forests. But after the passing of this Act, the forests have been handed over to the ministry of environment and forests, thereby not allowing the local people to enter these reserved forests. \"The MoEF, Dr <mark>Joshi</mark> maintained, lacks the resources to handle the situation on the ground .\" Under the present regime, there is a forest guard posted after every 80 km and there is also a fire watcher who issues an alert in case of a fire. But the local guys hired to be fire watchers in 2015 have not been paid their emoluments to date, so what motivation would they have to give alerts or to put out the fire? \"Dr <mark>Joshi</mark> did concede that the cause of these devastating forest fires could be the handiwork of either the timber mafia or the lack of rain during two successive winters, which have resulted in a lack of moisture both in the soil and in the air. Environmentalists agree about the role of the timber mafia. Uttarakhand's Forest Development Corporation is entitled to auction trees which have dried up or are dead .\" They now have crores worth of dried trees which can be auctioned and from which they can earn a lot of money, \"an environmentalist pointed out on condition of anonymity .\" This huge fire shows a complete lack of preparedness on the part of the administration who should have played a much more pro-active role, \"felt Dr Ravi Chopra, director, Dehra Dun People's Institute .\" Till 30 years ago, \"he added,\" there was an intense relationship between the community and the forest land. Today the alienation is so high that I have seen villagers living at the edge of a forest who will make no effort to douse a fire. They say the land belongs to the forest department so let them put out the fire. \"\"We need to get local communities involved with forests as was the case 150 years ago,\" Dr Chopra said. Peter Smetacek, the Bhimtal-based lepidopterist who is a member of the Uttarakhand State Wildlife Advisory Board, has warned that these fires would have destroyed an entire ecosystem of insects, butterflies, reptiles and thousands of larger animals. \"In 2009,\" Smetacek said, \"we were witness to a major fire and it took two to three years for the population of insects and butterflies to recover. But this time, the situation is much worse and this will have terrible consequences because we all belong to one ecosystem .\" Dr Chopra pointed out how in 1991, he along with other environmentalists had calculated the worth of a forest in Jharkhand. \"We found that the net present value of a typical tree was between Rs 500 and Rs 1,000. And this did not include the worth of its timber. Today, the cost of each tree in these forests would have multiplied several fold so the losses caused by this fire run into thousands of crores of rupees .\" \"Even worse is that this fire will result in the soil becoming very dry. Climate change is resulting in fewer spells of heavier rainfall which will see huge amounts of soil erosion,\" Dr Chopra added. \"All this eroded soil is going to end up in our rivers and dams,\" he warned. \"This will reduce the life span of our dams including the Tehri Dam. The kind of losses the nation is facing are incalculable .\" "}, {"articleID": "2018061122_00154473_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Marco Antonio Rubio": ["Q324546", "Q3845892"]}, "date": "2018-06-11", "url": "http://thehill.com/blogs/floor-action/senate/391720-deal-to-include-zte-penalties-in-must-pass-defense-bill", "content": "© Greg Nash Senators announced Monday that legislation keeping in place penalties against Chinese telecommunications giant ZTE will be included in a must-pass defense policy bill. \"By including this provision to undo the ZTE deal in the defense bill, the Senate is saying loudly and in a bipartisan fashion that the president is dead wrong to back off on ZTE,\" Senate Minority Leader Charles Schumer Charles (Chuck) Ellis Schumer Dem leaders condemn <mark>Trump</mark> after reversal on G-7 communique endorsement Dem lawmaker: <mark>Trump</mark> conceding \"role as leader of the free world' after G-7 summit Schumer: <mark>Trump</mark>\" turning our foreign policy into an international joke' MORE (D-N.Y.), a supporter of the amendment, said in a statement. The amendment keeping in place penalties against ZTE is expected to be added to the National Defense Authorization Act (NDAA), an annual defense policy bill that the Senate is poised to pass as soon as this week. ADVERTISEMENT The amendment would also ban government agencies from buying or leasing telecommunications equipment and services from Chinese telecom firms Huawei and ZTE and ban the government from providing loans to or subsidizing either company. The provision still needs to survive a conference with the House, which passed its own defense bill. If it's in the final bill it could provoke a showdown with President <mark>Trump</mark> <mark>Donald</mark> John <mark>Trump</mark> <mark>Trump</mark>: \"Excitement in the air' ahead of Kim meeting <mark>Trump</mark> doubles down on criticism of EU, Canada Merkel: EU will retaliate against <mark>Trump</mark> tariffs MORE, who needs to sign the must-bill defense policy bill. The <mark>Trump</mark> administration announced late last week that it had reached a deal to lift penalties against the company in exchange for ZTE paying a $1 billion fine and embedding a U.S.-selected compliance team in the firm. But talk of a deal to save ZTE has sparked bipartisan backlash on Capitol Hill, where lawmakers have been frustrated with the administration's efforts. Schumer said earlier on Monday that the agreement was as\" weak as a wet noodle \"and argued the administration had been\" outmaneuvered \"in the agreement. Schumer, as well as Sens. Chris Van Hollen Christopher (Chris) Van Hollen Hillicon Valley: Deal reached on ZTE, but lawmakers look to block it | New encryption bill | Dems push Ryan for net neutrality vote | Google vows it won't use AI for weapons Overnight Defense: <mark>Trump</mark> hopes to normalize relations with North Korea | Senate defense bill would limit help for Saudis in Yemen | US to honor temporary Taliban ceasefire Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint MORE (D-Md .), Tom Cotton Thomas (Tom) Bryant Cotton Hillicon Valley: Deal reached on ZTE, but lawmakers look to block it | New encryption bill | Dems push Ryan for net neutrality vote | Google vows it won't use AI for weapons Overnight Defense: <mark>Trump</mark> hopes to normalize relations with North Korea | Senate defense bill would limit help for Saudis in Yemen | US to honor temporary Taliban ceasefire Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint MORE (R-Ark .) and Marco Rubio <mark>Marco Antonio Rubio</mark> Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint <mark>Rubio</mark>: ZTE a greater threat than steel from Argentina and Europe <mark>Trump</mark> throws ZTE a lifeline as part of broader China strategy MORE (R-Fla .), filed the amendment last week to the NDAA to restore the Commerce Department's penalties on ZTE for violating U.S. sanctions against Iran and North Korea .\" ZTE has repeatedly violated U.S. law and represents a threat to our national security--Congress cannot and will not allow the Administration to let ZTE off the hook in the interest of Chinese jobs, \"Van Hollen said in a statement .\" The threat Huawei and ZTE pose to our national security is too great to ignore. This amendment will help keep Americans' private information out of the hands of the Chinese Communist Party, and I'm pleased it will be included in the NDAA, \"Cotton added. Senators have been privately discussing adding the bipartisan proposal into the NDAA. <mark>Rubio</mark> told reporters earlier on Monday that he expected it to be included, while GOP Sen. John Cornyn John Cornyn GOP senators want NAFTA deal from <mark>Trump</mark> by Labor Day Overnight Finance: US reaches deal with ZTE | Lawmakers look to block it | <mark>Trump</mark> blasts Macron, Trudeau ahead of G-7 | Mexico files WTO complaint The Hill's Morning Report--Sponsored by PhRMA--Some GOP lawmakers reject script on <mark>Trump</mark> MORE (Texas) cautioned that talks were ongoing but no final decision had been made. Commerce Secretary Wilbur Ross Wilbur Louis Ross ZTE ordeal shows allied cooperation key to keeping bad actors in check Census Bureau's chief scientist warned secretary in memo against adding citizenship question Lawmakers spar at hearing over census citizenship question MORE is meeting with senators on Monday evening to walk them through the details of the agreement. Tags Chris Van Hollen Charles Schumer <mark>Donald Trump</mark> Wilbur Ross John Cornyn Marco Rubio Tom Cotton"}, {"articleID": "2016081215_00172740_W", "names": {"Eduardo Garcia": ["Q1290941", "Q17183066", "Q18686283", "Q5340616", "Q5819236", "Q5819238"]}, "date": "2016-08-12", "url": "http://desertsun.com/story/news/health/2016/08/12/california-senate-asks-obama-end-gay-blood-donation-ban/88609834/", "content": "Buy Photo (Photo: Richard Lui/The Desert Sun) Buy Photo CONNECT TWEET LINKEDIN COMMENTEMAILMORE California state lawmakers are asking President Barack Obama to end policies that still make it extremely difficult for gay and bisexual men to donate blood. The state Senate on Thursday approved a resolution, 34-0, asking the president to push the Department of Health and Human Services to repeal current blood donations and instead \"direct the FDA to develop science-based policies such as criteria based on risky behavior in lieu of sexual orientation .\" The Food and Drug Administration took a step last year to relax a complete ban on blood donations from men who had ever had sex with another man since the earliest years of the AIDS crisis. The new policy instead banned donations from men if they've had sex with another man in the previous year. DESERT SUN FDA eases restrictions on blood donations from gay men LGBT advocates strongly criticized the new rules when they were introduced last year, and again following the July mass shooting at the Pulse gay nightclub in Orlando, where 49 people were killed and dozens more were injured. \"When so many otherwise eligible gay and bisexual men who wanted to donate blood after the recent tragedy in Orlando were turned away, the need to reform the FDA's outdated policy on blood donation once again became painfully clear,\" Rick Zbur, executive director of Equality California, said in a statement Thursday regarding the California Senate vote. Equality California is supporting the resolution. The resolution, which has no direct effect on policy, has bipartisan support from state lawmakers. Its co-authors include Republican Assemblyman Chad Mayes of Yucca Valley, whose district includes Palm Springs, and Democratic Assemblyman <mark>Eduardo Garcia</mark> of Coachella. \"America is facing a critical blood supply shortage. Many healthy men want to donate blood, yet are being denied due to an outdated, discriminatory policy. This is wrong,\" Mayes, the Assembly's Republican Leader, said in the news release from Equality California. \"No healthy person should be turned away when they want to help save people's lives .\" Health reporter Barrett Newkirk can be reached at (760) 778-4767, barrett.newkirk @ desertsun.com or on Twitter @ barrettnewkirk. DESERT SUN Zika virus: What the Coachella Valley needs to know CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //desert.sn/2bcbpHX"}, {"articleID": "2013071019_00043635_W", "names": {"Elton John": ["Q16209157", "Q2808"]}, "date": "2013-07-10", "url": "http://www.freep.com/article/20130710/ENT04/307100053/1035/ent", "content": "Detroit's legal fees could top $100 million for a Chapter 9 bankruptcy Detroit on the brink: As Kevyn Orr pushes for a settlement outside of bankruptcy among Detroit's...Left behind at DTW security: Bolt cutters, snow globes, weapons, more weird stuff From bowling pins to snow globes, hundreds of items are left at Detroit Metropolitan Airport...Storms knocked down trees and power lines in parts of Michigan as heavy rains brought flooding to...Michigan marijuana supporters to tout economic clout by spending $2 bills Jeff Seidel: Lions' Stafford the big winner with short-term deal Did the Lions make the right move by signing Matthew Stafford to a three-year extension? Heck yes. Can the Tigers resume their White Sox hiatus? WHAT HAPPENED: After putting on seven two-out baserunners in the first five innings with Justin...Helene St. James: Chelios, Shanahan helped define glorious decade for Red Wings Top 10 places to see Detroit's pain, promise - with or without Orr's tour for creditors Okay, so Detroit Emergency Manager Kevyn Orr scubbed his bus tour for creditors to visit the city's...China's auto sales growth held steady in June and Japanese brands rebounded from a slump despite a.. . 30 arrested as miners union protests Patriot Coal plan to cut benefits Thirty people were arrested Tuesday as some 5,000 coal miners and their families protested bankrupt...He thought he had food poisoning, but it was appendicitis. Barenaked Ladies back with a new confidence and the old sense of humor Barenaked Ladies hit DTE Energy Music Theatre on Friday with a renewed sense of confidence--and...Elisabeth Hasselbeck is leaving the desk at \"The View' for the couch on Fox News Channel's\" Fox &...The Detroit Zoo is hoping there'll be romance in the air on Thursday. Federal regulations require drug and alcohol testing of critical crewmembers after an accident, but...I'm marking my 10-year anniversary of writing the \"Ask Amy' column by rerunning some of my favorite...Carolyn Hax: Husband needs to stop being woman's shoulder to cry on Detroit Emergency Manager won't be showing bankers and creditors the city today. Editorial: Don't let House Republicans thwart immigration reform House Republicans - including four from southeast Michigan - will meet behind closed doors today to...How would you caption this photo of Detroit Tiger slugger Prince Fielder? E-mail your best ideas by...LONDON - <mark>Elton John</mark> says he is grateful to be alive after learning he had been playing European tour dates while suffering from undiagnosed appendicitis. The 66-year-old musician is quoted in The Sun newspaper today as saying he had struggled through the shows in pain, thinking he had food poisoning. He later learned\" I was a ticking time bomb. I guess I could have died at any time. \"He added:\" I feel so lucky and grateful to be alive. \"On Tuesday, <mark>John</mark> canceled a show in London's Hyde Park and other summer dates while he is treated for an inflamed appendix and surrounding abscess. He is due to have surgery in the next few weeks after treatment with antibiotics. Jeff Seidel: Lions' Matthew Stafford the big winner with short-term deal Emergency Manager Kevyn Orr cancels creditor bus tour of Detroit Appendicitis-hit <mark>Elton John</mark>\" grateful to be alive' He thought he had food poisoning, but it was appendicitis. Jeff Seidel: Lions' Matthew Stafford the big winner with short-term deal Top 10 places to see Detroit's pain, promise - with or without Orr's tour for creditors Detroit's legal fees could top $100 million for a Chapter 9 bankruptcy Left behind at DTW security: Bolt cutters, snow globes, weapons, more weird stuff Metro + state: Livonia's Casey Skinner named to U.S. Senior Trampoline and Tumbling National Team Prep Persons of the Year: Meier twins know meaning of sportsmanship"}, {"articleID": "2019021721_00303935_W", "names": {"Amanda Holden": ["Q237204", "Q4739651"]}, "date": "2019-02-17", "url": "https://www.mirror.co.uk/3am/celebrity-news/tamzin-outhwaite-daughter-crying-scared-14012965", "content": "Get the biggest soaps stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Tamzin Outhwaite has revealed that she and her young daughter were refused entry to India. The EastEnders star was taking her 10-year-old daughter Florence on a \"healing\" yoga holiday following a \"difficult\" year, but instead, they were left crying and feeling scared in immigration. Tamzin, who plays Mel Owen in the BBC soap, says her plans were ruined by immigration officials over an issue with her visa. And her daughter was terrified that she'd be separated from her mother in the unfamiliar country. The actress said in a series of tweets: \"My 10 yr old and I have just been refused entry into India due to my visa, which was still valid, but apparently a passport stamp in Mumbai to get a connaecting flight to London at new year, counts as entry. We both sat crying in immigration at Goa airport but...Read More Ageless <mark>Amanda Holden</mark> stuns as she celebrates 48th birthday with famous pals Tamzin and Florence were going on a yoga holiday (Image: Instagram) They were refused entry (Image: Instagram)\" ...nobody died and after another 9 hr flight we are back in Blighty! Only having one week for a mother/daughter healing holiday after a difficult year means we are now looking for a new trip. It won't be a family yoga retreat but a bonding trip will suffice. \"I feel very proud of my daughter, who cried, as I did, but was mostly worried that we may be separated like families in the U.S, as her visa was valid but mine not. Fortunately we are home .\" I'm a country I feel lucky and proud to live in please excuse previous spelling and grammar mistakes. Jaded, jet lag and just exhausted! If anyone knows of any last min trips??? All suggestions welcome. (Not India) \"Read More EastEnders' Tamzin Outhwaite teases extended stay for Mel Owen Tamzin as Mel Owen (Image: BBC / Kieron McCarron) Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Tamzin also thanked the kind strangers who comforted them at the airport by handing them tissues to dry their tears. She was later forced to hit back at trolls after they berated her for sharing her story online. She said:\" Nothing spouty about it...feeling lucky and blessed...and extremely proud of my 10 yr old daughter who just went through an ordeal. \"Do you have a story to sell? Get in touch with us at webcelebs @ trinitymirror.com or call us direct 0207 29 33033 Read More Showbiz and TV editor's picks Beckhams on the FROW Megan leaves club with villa-mate Inside Joey Essex's plush pad Coleen forgives Wayne...again"}, {"articleID": "2019053105_00198478_W", "names": {"Mike Tyson": ["Q30122587", "Q6849116", "Q79031"]}, "date": "2019-05-31", "url": "https://www.mirror.co.uk/sport/boxing/boxing-news-anthony-joshua-praised-16230700", "content": "Get the biggest daily news stories by email Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Anthony Joshua has already established himself as a British sporting superstar as he looks to crack the American market on his US debut on Saturday night. The Watford-born heavyweight king has regularly sold out huge stadiums in the UK over the last few years leading him to take the step across the pond to Madison Square Garden against Andy Ruiz Jr.. Joshua is undoubtedly the biggest name in British boxing - and he's been praised for \"carrying\" the sport in this country by Tony Bellew. The recently-retired former cruiserweight champion says Joshua has catapulted the sport to another level on his own and deserves a huge amount of credit. Anthony Joshua makes his US debut against Andy Ruiz Jr on Saturday night (Image: Action Images via Reuters) Read More Boxing news: Andy Ruiz Jr's gruesome claim before Anthony Joshua title challenge \"For the UK, Anthony Joshua is flying the flag, he really is,\" said Bellew, speaking as a guest of the SportPesa Racing Point F1 team at last weekend's race in Monaco. \"He's carrying boxing and single handedly taking it to another level, that's what he's done for boxing in this country .\" His impact has been unbelievable, and he's been absolutely phenomenal so far in his career. \"Tony Bellew has hailed Joshua for his impact on British boxing (Image: Glenn Dunbar/LAT Photographic) Read More Boxing news: What Andy Ruiz Jr texted Eddie Hearn to earn himself Anthony Joshua fight Joshua defends his WBO, WBA, IBF and IBO straps against Ruiz this weekend after the California-based Mexican was drafted in as a late replacement for Jarrell Miller. Bellew reckons Ruiz is a strong replacement after Miller's failed drugs tests - but he reckons Joshua's class will shine through having labelled him the\" best heavyweight in the world \"ahead of rivals Tyson Fury and Deontay Wilder .\" The opponent change to Ruiz is a very good chance to be fair, in such short time, \"Bellew commented. Bellew reckons Andy Ruiz Jr is a strong late replacement for Jarrell Miller (Image: Sportsfile via Getty Images) Read More Boxing news: Tyson Fury's hilarious guide to Anthony Joshua and the heavyweight division\" It's a good change, I'm looking forward to it. I'll be there watching and I can't wait to see it. \"I believe Anthony Joshua is the best heavyweight in the world, then it's Fury, then Wilder .\" I'm excited to see how it goes against Ruiz, but everyone just wants to see them fight each other now. \"Tony Bellew is an ambassador for SportPesa. Find out more about SportPesa's products and SportPesa Racing Point here. Read More Boxing stories Anthony Joshua may ban\" curse' Drake Tyson Fury's fierce message to Whyte <mark>Mike Tyson</mark> on whether he'd beat Joshua Fury's x-rated advice to rival Joshua"}, {"articleID": "2019082417_00103722_W", "names": {"Joe Russo": ["Q1691583", "Q20675767", "Q24734137"], "Greg Humphreys": ["Q22115382", "Q38338350", "Q41695902"], "Bob Weir": ["Q3938462", "Q888316"], "Paul Simon": ["Q27908296", "Q4028", "Q7153617"], "David Shaw": ["Q3018779", "Q42297525", "Q5239683", "Q5239685", "Q5239686", "Q5239687", "Q5239688", "Q5239690", "Q5239692"]}, "date": "2019-08-24", "url": "https://jambands.com/news/2019/08/24/from-the-saturday-lockn-times-everythings-right/", "content": "From the Saturday \"LOCKN' Times': Everything's Right photo by Jay Blakesberg Trey Anastasio and Derek Trucks crossed paths onstage for the first time just over 20 years ago, when Trucks joined Phish at Charlotte, N.C.'s Blockbuster Pavilion for a pair of songs during the Vermont Quartet's encore. At that point in his singular career, Trucks was just a few weeks into his tenure with the Allman Brothers Band and about to open up his bluesy Derek Trucks Band to incorporate a range of Eastern, African and fusion-inspired sounds. Anastasio had also recently launched his first tour with the combo that would blossom into his longtime solo band, focusing on a similar mix of open-ended originals, loose covers and guitar-rock improvisational vehicles. Trucks sat in with Phish for their encore on two blues-rock songs from their catalog, including former guitarist Jeff Holdsworth's\" Possum \"and Son Seals'\" Funky Bitch. \"Anastasio's three bandmates had already shared the stage with Trucks during the previous two years. As time went on, both guitarists' projects evolved, with Anastasio expanding his outfit into the orchestra-size Trey Anastasio Band and Trucks partnering with his wife, Susan Tedeschi, to form the similarly soulful and horn-abetted Tedeschi Trucks Band. The musicians have shared the stage a few times over the past two decades--mostly with the Allman Brothers Band, though Trucks guested with TAB in 2002, and Anastasio returned the favor at New York's Beacon Theatre in 2017. But it wasn't until last night that the two musicians shared the stage for a full set (for which they spent multiple days rehearsing). Trucks blended in seamlessly with the Trey Anastasio Band from the start of their second set, using his trademark slide skills to color the group's layered arrangements and take a number of well-placed solos. Their joint performance opened with two relatively new Anastasio compositions that Phish has also embraced,\" Set Your Soul Free \"and\" Everything's Right, \"and then shifted to three Phish originals Anastasio has added to TAB's canon since rebooting the group last year after a short break:\" Camel Walk, \"\"Ghost\" and \"Blaze On .\" Both \"Camel Walk\" and \"Ghost\" served as perfect vehicles for Trucks, who accented the former song's bluesy roots and added a new, spooky feeling to the latter Story of the Ghost gem. (Interestingly, Trucks has now joined Anastasio for both of Holdsworth's lasting contributions to the Phish repertoire .) As he continued to find his way around TAB's full sound, Trucks shined on the meditative \"Dark and Down\" and the Phish-adopted groove-vehicle \"Sand .\" Though she was not originally billed as part of today's lineup, Susan Tedeschi emerged as the song came to a close to sing on a tender moment from Anastasio's Ghosts of the Forest project, \"A Life Beyond the Dream,\" and another tune that hugs the Phish and TAB worlds, \"Rise Up/Come Together .\" Finally, Anastasio, Trucks and the members of TAB closed the main portion of their show with the high-energy rave-up \"Push On\" Til the Day. \"Another element Anastasio has added to his TAB shows with more frequency since touring as a solo act in recent years is an unplugged encore segment. Last night, the guitarists returned for acoustic duets with Trucks on the Ghosts of the Forest number\" Brief Time \"and a newer Phish song that has recently grown into a dependable rocker,\" More. \"Most of TAB then returned for another Phish favorite,\" 46 Days, \"and Anastasio's horns slid back onstage for the classic show-closing celebration\" First Tube. \"The day's main-stage musical offerings kicked off over 12 hours earlier with Rockin' to Lockn' winner, Washington, DC's Surprise Attack, who offered a high-energy set of their trademark\" Mountain funk. \"(Elsewhere onsite, it has already been an eventful day: <mark>Joe Russo</mark> emerged during recent recording partners Circles Around the Sun's late-night show in Garcia's Forest around 2:45 am, and about eight hours later the Doobie Decibel Duo held court on the Pianos on the Porch nook .) Soon after, the New York--based <mark>Greg Humphreys</mark> Electric Trio, whose namesake has deep ties to the improvisational world through his previous projects Dillon Fence and Hobex, provided the day's first interlocking set when they kicked off their performance while circling toward the audience on the venue's rotating stage. Lockn' has built its reputation on its unique collaborative performances and, after the trio's set, Moonalice offered the first of several special\" Lockn' moments, \"welcoming the sweet-voiced T Sisters and legendary soul singer Lester Chambers and his son Dylan at various points during their performance. The T Sisters shined on a swirl of the Grateful Dead's\" Uncle John's Band, \"\"Bird Song\" and \"Attics of My Life,\" while Lester and Dylan helped Moonalice and the singers close their set with two songs long associated with The Chamber Brothers, \"People Get Ready\" and \"Time Has Come Today .\" Unfortunately, after the ensemble's set, the concert field was cleared temporally as the second storm of the weekend passed through the area. Music resumed after a short delay, although a few acts ended up playing slightly truncated sets to help put things back on schedule. Melvin Seal & JGB and their current featured guitarist, Furthur's John Kadlecik, welcomed fans back with a set comprised mostly of classics from the Jerry Garcia Band songbook, kicking off with staples like \"Cats Under the Stars,\" \"Run for the Roses\" and an appropriate \"Mission in the Rain .\" Their set came to a close with a Garcia-Robert Hunter tune from outside the traditional JGB well, \"Eyes of the World,\" before turning over the stage to the recently reunited Edie Brickell & New Bohemians. <mark>Bob Weir</mark> and Edie Brickell photo by Dean Budnick Brickell has a long history with the Dead world, having collaborated with Garcia and opened for the Dead, but it's been a while since she has been on the jam circuit. Yet, at the end of their performance, Brickell & New Bohemians brought out <mark>Bob Weir</mark> for a choice take on \"Deep Elem Blues,\" marking his first appearance with the group. (Earlier this month, <mark>Weir</mark> sat in with Brickell's husband, <mark>Paul Simon</mark>, at San Francisco's Outside Lands and TAB percussionist Cyro Baptista has been part of his band. Though he did not perform, <mark>Simon</mark> was on hand for his wife's performance .) Form there, the rest of the evening's focus shifted to some of the leading lights of the modern jamband and roots scenes, beginning with funky Mid-Atlantic favorites Pigeons Playing Ping Pong. The quartet, who were energized by their enthusiastic crowd, ran through \"High As Five,\" \"Porcupine\" and a segue from \"Somethin’ For Ya\" into \"Julia,\" before bringing out their previously announced guest, Vulfpeck associate Cory Wong, for \"Lightning .\" Soon after, The Revivalists horn section joined the members of Pigeons Playing Ping Pong for a run from \"FU\" into Prince's \"1999,\" before returning to \"FU,\" before PPPP closed their show by themselves with \"The Liquid .\" The group also took the opportunity to announce two big December gigs: a stop at Washington, DC's The Anthem and their first area date, New Year's Eve at Asheville, N.C.'s ExploreAsheville.com Arena. Several members of the day's next entertainers, Old Crow Medicine Show, used to live in nearby Charlottesville, Va., and the musicians opened things up appropriately with \"Carry Me Back to Virginia .\" The early part of their show was filled with theatrics and sing-alongs like their signature tune \"Wagon Wheel,\" but things peaked when they brought out <mark>Weir</mark> for acoustic-guitar driven takes on \"Mexicali Blues,\" \"Cumberland Blues\" and \"Will the Circle Be Unbroken?\" Old Crow founder Ketch Secor described the surprise sit in as a \"dream\" from the stage. The main stage's penultimate act, The Revivalists, kept the evening's energy up, spicing their set with a cover of The Who's \"Eminence Front\" and their own crossover hit, \"Wish I Knew You .\" In recent years, The Revivalists have grown to embody the festival spirit with their mix of string, brass and improv-schooled energy, and frontman <mark>David Shaw</mark> took advantage of the band's surroundings, moving to the lip of the large Lockn' stage to address his audience several times. Before welcoming Trucks for his second set, Anastasio and his seven-person backing band ran through a mix of classic TAB songs during what he jokingly described as the \"shortest set ever .\" The octet kicked things off with \"Cayman Review,\" one of the standout tunes from Anastasio's 2002 solo release, and charged through rhythmic, Afro-beat influenced originals \"Mozambique\" and \"Alive Again,\" as well as \"Valentine,\" \"Night Speaks to a Woman,\" \"Simple Twist Up Dave\" and the 70 Volt Parade-era single \"Tuesday .\" After the final note of \"First Tube\" drifted into the ether, much of the crowd moved to Garcia's Forrest, where Galactic had set up shop. Meanwhile, Anastasio, Tedeschi and Trucks were preparing for the second part of their two-set, two-day collaboration."}, {"articleID": "2016121312_00409997_W", "names": {"Paul Barber": ["Q7149214", "Q7149215", "Q7149216", "Q7149218"]}, "date": "2016-12-13", "url": "http://www.indcatholicnews.com/news.php?viewStory=31543", "content": "Diocese of East Anglia to lead the way in opening new Catholic schools December 13, 2016 The Catholic Diocese of East Anglia is to be among the first to open new Catholic schools after the proposed removal of the 50% faith admissions cap, with plans for up to eight in the pipeline. East Anglia has some of the most severe shortage of places in Catholic schools in the country due to the demographic changes that have taken place in the region over the past decade. Since Prime Minister Theresa May announced the proposed removal of the 50% cap on faith admissions, the Diocese has been progressing with a number of bids. Should the policy be lifted after the Government's consultation on the issue closed on December 12, the Diocese is in a position to act straight away to move towards the opening of new schools. The areas of East Anglia where the new schools are being proposed are those with some of the highest need for places and where possible sites for the schools have already been identified. In Cambridgeshire, the Diocese wants to establish a high school and a primary school in West Cambourne and another primary in the Cherry Hinton area. The Diocese also wants to establish a new primary school in Peterborough. A new Catholic primary school is also being proposed in Thetford within the significant new housing development planned to the north of the town, whilst two primaries and possible sixth form provision are hoped for in Norwich. In addition, the Sacred Heart Convent School in Swaffham is also considering proposals for a new free school as well as possible expansion plans. Assistant Director for the Schools Commission for the Diocese of East Anglia, Helen Bates, said: \"It is a very exciting time and we are really looking forward to opening new schools which are desperately needed to meet the demand we already have here in East Anglia .\" For the Catholic Church, the cap has meant it has been unable to open any new Catholic schools in case it results in Catholic children being turned away from a Catholic school. In East Anglia we have some of the most severe shortages of places, which is why we want to bid for so many new schools. \"Brian Conway, Chief Executive Officer of the St John the Baptist Catholic Multi-Academy Trust, which currently covers six primaries and a high school in Norfolk and north Suffolk, said:\" The possibility of new Catholic schools is hugely exciting. Catholic schools have a long history of providing a successful education to widely diverse pupil populations. For example, our current primary school in Norwich, St Francis of Assisi, has more than 40% of its pupils whose first language is not English. \"We also have a real need for Catholic primary school places in north Norwich and this is growing as large housing developments in places like Sprowston and Rackheath are planned. A school in north Norwich could serve a Catholic need from this housing as well as an existing need across north Norfolk where there are no Catholic schools. We are also considering the possibility of new sixth form provision in central Norwich, which could be linked to extra 11-16 places at Notre Dame High School .\" Director of the Catholic Education Service, <mark>Paul Barber</mark>, said: \"This is fantastic news from the Diocese of East Anglia and we warmly welcome their announcement. Up and down the country we are seeing pockets of high demand for Catholic education and if the cap is lifted we will be able to answer that call. Catholic schools are the most ethnically diverse in the country and consistently outperform the national average when it comes to KS2 and KS4 results. We are excited at this opportunity to give more children an outstanding Catholic education .\" Notre Dame pupils in Science class Parents can register their interest in any of the new schools at: http: //rcdea.org.uk/freeschools/ Share:"}, {"articleID": "2014060703_00019929_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Scott Thompson": ["Q16214236", "Q2886450", "Q324114", "Q559081", "Q7437374", "Q7437375", "Q7437376", "Q7437377"]}, "date": "2014-06-06", "url": "http://www.latimes.com/entertainment/la-et-mg-casey-kasem-hospitalized-critical-condition-20140606-story.html?track=rss", "content": "Casey Kasem makes an audition tape in 1971. Casey Kasem broadcasts on radio station KIQQ in 1981. Casey Kasem receives the Radio Icon award during the 2003 Radio Music Awards in Las Vegas. Caption Kasems at tribute to Barbara Walters Casey Kasem and his wife, Jean, arrive at the Museum of Television and Radio's gala tribute to Barbara Walters at the <mark>Beverly Hills</mark> Hotel in 2004. Casey Kasem's health has continued to falter during the radio host's stay in a Washington State hospital, according to several reports. Related story: Raw meat, King David latest in bizarre Casey Kasem family drama Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. (Nardine Saad) \"Mr. Kasem is alert and appears comfortable at this time,\" said hospital spokesman <mark>Scott Thompson</mark>. \"Any further updates on Mr. Kasem's condition will be at the discretion and approval of his children .\" The ailing radio icon, who suffers from Lewy body dementia, is said to be receiving antibiotics through IVs, medicine for blood pressure support and care for his bed sores, <mark>Thompson</mark> told CNN. Kasem has been bedridden for some time now. CNN noted that a patient could be in both critical and stable condition if his or her health is not deteriorating further. People reported, and his two daughters were already there when he suffered a sharp drop in blood pressure. His son was said to be en route. \"His health is worse. We're just not sure how bad at this point,\" a rep for the radio icon's daughter Kerri Kasem told the mag on Thursday. taken to the hospital on Sunday by his daughter, whom he had from his first marriage. Kerri Kasem was embroiled in a dramatic scene outside a Washington home where Kasem and his wife of 34 years, Jean Kasem, were staying with friends. In a bizarre turn of events, his wife hurled a package of raw hamburger meat at her stepdaughter after a dispute broke out following the radio host's removal at his daughter's discretion. \"I believe in the power of prayer. I believe in the power of intention. I believe that when a person or group of people focus on what is needed they can create a certain outcome,\" she wrote. \"Whatever it is you believe in, I ask that you take a moment and pray, or focus on sending love and healing energy to my father. He needs it right now .\" Jean Kasem and her three stepchildren--Kerri Kasem; her sister, Julie; and their brother, Mike Kasem--have been feuding over the radio host's care since last year. The family drama was highlighted last month when his children filed a missing person's report when his wife removed him from a Santa Monica facility to Washington state without the family's knowledge. judge turned the radio host's primary care back to his children Casey Kasem's daughter gets expanded power over dad's health care Edie Falco loves playing the lying, seriously flawed \"Nurse Jackie' Datebook: Boxing painters, teen idols and John Altoon's short career Vincent van Gogh ear replica made from relative's DNA goes on display Holding even-year L.A. city elections to boost turnout gets second nod\" The Fault in Our Stars' elevates sad story by cutting the sap GM fires 15 at top levels; report on ignition switches \"brutally tough' GM fires 15 at top levels; report on ignition switches\" brutally tough '"}]