[{"articleID": "2012051906_00011595_W", "names": {"Sean King": ["Q53105723", "Q7441135", "Q7441138"], "Steve Klein": ["Q4442555", "Q7613047"]}, "date": "2012-05-19", "url": "http://dailycamera.com/state-west-news/ci_20659880/mlk-re-enactor-sent-home-from-colorado-springs?source=rss", "content": "colorado springs--a white colorado second-grade student who wore black face paint as part of a martin luther <mark>king</mark> costume has drawn criticism from school officials. <mark>sean king</mark> was pulled out of class wednesday after donning the makeup for a project requiring students to dress up as a historical figure. the colorado springs boy said he was trying to honor the slain civil rights leader. his parents knew about his costume and came to watch the presentations. school officials \"thought it was inappropriate and would be disrespectful to black people, but i say that it's not, i like black people,\" the 7-year-old <mark>king</mark> told krdo-tv. the parents refused a request from the principal to remove the student's makeup and took him home, the station said. school officials say the student will be welcomed back in school. blackface was common in minstrel shows in the 19th century when featured white performers played stereotyped black characters. <mark>steve klein</mark> of the <mark>king</mark> center in atlanta told the station the youth apparently had good intentions but he said the child and his family need to understand some people are still offended by white people wearing the makeup. \"these shows portrayed blacks as subservient, childish and had negative stereotypes,\" he told the associated press on friday. meridian elementary principal erica mason hopes to turn the situation into a teaching moment by asking the local chapter of the naacp for help while setting up a class for adults and children to understand why stereotypes can be offensive. copyright 2012 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. print email font resize return to top article id:"}, {"articleID": "2014040508_00014126_W", "names": {"Stephanie Bell": ["Q11341858", "Q19802802"]}, "date": "2014-04-04", "url": "http://www.mcclatchydc.com/2014/04/04/223525/miami-woman-arrested-in-connection.html#storylink=rss", "content": "Unlike other spy matters, Senate's probe of CIA's harsh interrogations raises partisan hackles Court rejects claims by family members of U.S. drone strike victims Senate's findings on CIA interrogations likely to become roadmap for litigation China's tiger parks under fire from conservationists, animal cruelty experts For Crimea's residents, a difficult choice: Become Russian or leave Syria ordnance disarming effort will be bigger job than Afghanistan, UN says MIAMI - MIAMI_A Miami woman took fetish pornography to a disturbing extreme, police say - repeatedly decapitating live chickens and killing rabbits while engaging in sex acts during the filming of an animal torture video. Sara Zamora, 28, was arrested Friday on eight felony counts of animal cruelty for her feature role in a video called \"SOS Barn\" that a Miami-Dade police arrest report described in gory, stomach-turning detail. \"The chicken is enduring extreme pain and suffering during this process,\" according to the arrest report. The video clips - filmed for a twisted animal torture genre called \"crush\" - depicted her and other porn actresses \"torturing and killing a wide variety of animals, including chickens, rabbits and more for the sexual gratification of its viewers,\" according to police. The barnyard snuff video was filmed at the South Miami-Dade home of Adam Redford, according to the police report, who is listed as a co-defendant. He is already on probation for a similar animal cruelty case in Lee County last year but had not been charged in the Miami-Dade case as of Friday night. Redford, a boat captain who claims on his web site to be have filmed a variety of videos \"related to South Florida fishing,\" said he knew nothing about Zamora's case. \"I haven't seen or talked to her in close to a year,\" Redford said. Detectives from Miami-Dade's agricultural unit learned of the video clips from the People for the Ethical Treatment of Animals, a prominent animal rights group. <mark>Stephanie Bell</mark>, director of cruelty cases for PETA, called the arrest \"excellent news. We have been waiting for this .\" <mark>Bell</mark> said the group also had tipped off authorities in Redford's case in Lee County, where she said he had moved. <mark>Bell</mark> said such videos, graphically depicting animal torture and death, are illegal under state and federal laws. \"These videos are unfortunately in demand and it's hard to fathom that anyone would produce or enjoy them,\" she said. In one clip of \"SOS Barn,\" Miami-Dade police say, Zamora gropes a man's genitals with her left hand while \"repeatedly cutting a chicken's neck using hedge clippers with her right .\" In others, she posed \"in a sexy outfit\" after hacking off the head of another screaming bird or beat chickens to death with a wooden stick. Chickens weren't the only victims. She also karate-chopped the necks of several rabbits as they howled in pain, according to the report, then admitted to killing them. On the Internet, Zamora goes by the moniker Gloria Shynez. On a web site called Model Mayhem, Zamora claims she has been \"modeling\" since age 19. Her rates are flexible. \"My middle-eastern look distinguishes from many models and I am so excited to see what fun, beautiful shots we create together!\" she writes. Zamora was arrested while already in jail. She had been on probation on two separate cases, on charges including grand-theft with a firearm, credit card fraud, possession of a fictitious drivers license and cocaine possession. If convicted on the animal cruelty charges, she could face up to five years in prison on each count. She had been in jail for the past month after failing a probation drug test but would likely have been released Friday \"if not for the fickle finger of fate,\" said defense attorney Theodore Mastos. On Friday, Miami-Dade prosecutor Jason Pizzo informed the court and Mastos of the new charges. Mastos, while questioning whether the state could mount a \"viable prosecution,\" told The Miami Herald he was shown portions of the video outside court during a brief hearing. \"I'm glad I didn't have breakfast because I would have puked all over the place,\" said Mastos, who used to prosecute pornography cases in the 1970s. \"It was disgusting .\" As for Redford, he is on probation in a 2013 case on charges of causing the cruel death and torturing animals in Lee County. On Friday, he acknowledged the earlier arrest was a matter of public record but that \"it had been resolved .\" So-called \"crush\" animal torture videos aren't new and have been the target of past legal crackdowns. In 2010, the U.S. Supreme Court struck down a law that outlawed depictions of \"intentionally maimed, mutilated, tortured, wounded, or killed,\" saying it was too broad and violated the right to free speech. The federal law had been aimed at videos that often depict women slowly crushing animals to death \"with their bare feet or while wearing high heeled shoes,\" sometimes while \"talking to the animals in a kind of dominatrix patter,\" the opinion read. But the 2010 decision did not apply to the actual acts themselves of extreme cruelty to animals - and did not preclude the passing of future laws that narrowly applied to crush videos .> Apps and services for tablet devices> Apps and services for your mobile phone"}, {"articleID": "2010121322_00211158_W", "names": {"Joseph Campbell": ["Q17388234", "Q6281966"]}, "date": "2010-11-28", "url": "http://enleuk.wordpress.com/2010/11/28/my-debate-with-a-solipsist-taoist-advaitin/", "content": "a beacon for glocal news and eternal nonsense my debate with a solipsist/taoist/advaitin by enleuk november 15, 2010 at 10:20 am i believe in the experience of being, that which is beyond words. this also means i don't believe it is god or metaphysical or anything i can name. it just is. i see the network of my brain and realize all my knowledge is relative because the network is a part of the universe and so i can only judge truth as subjective and relative (except the absolute truth which is beyond all concepts). and through relativity (logical deductions) i see there is no immaterial free will, there is only one life, i am my body and nothing else. this makes me happy; i am a body, i may not know what that ultimate means, but november 18, 2010 at 7:42 am i have had that experience, but i don't call it god because that sounds like it's not a metaphor for something else, but a real factual personal god. god implies a judeo-christian god, a god as defined by the people of the levant. that is not what i experienced. i experienced the unnameable, the mystery, that which has been metaphorized as the tunder of t.s. eliot's the waste land, the unity behind the duality of yin/yang, the necessary connection of all things related as portrayed in the black dot in the white field and the white dot in the black field, the emptiness, sunyata, of nagarjuna, the love of jesus or the father he describes by saying \"love your enemies and pray for those who persecute you, so that you may be sons of your father who is in heaven; for he makes the sun rise on the evil and the good, and sends rain on the just and the unjust\" , that which is beyond being and not being, beyond neither being nor not being, the transcendence of leela, the sun god ra, nirvana, brahman. <mark>joseph campbell</mark> said: \"you have to break past your image of god to get through to the connoted illumination. the psychologist jung has a relevant saying:\" religion is a defense against the experience of god .' the mystery has been reduced to a set of concepts and ideas, and emphasizing these concepts and ideas can short-circuit the transcendent, connoted experience. an intense experience of mystery is what one has to regard as the ultimate religious experience. \"beyond kantian concepts, beyond nietzschean relativity, beyond all derridian traces, that's where the experience is, at the bottom of apsu. i am a materialist because i see the coherency of logically deduced material theories, and i will not misrepresent the mystery with personal interpretations of it, for your thoughts are subjective and so all your interpretations are flawed. maybe you believe in an ineffable mystery, but i don't think you'd call it god if you did. and if you believe in a judeo-christian god, then you're basing your conceptual interpretations of that mystery on a literal history of philosophy and must defend your concept against other philosophers and historians, and in the case of the judeo-christian god the battle was over long ago, as nietzsche says:\" could it be possible! this old saint in the forest hath not yet heard of it, that god is dead! \"you say that my subjective experience doesn't invalidate your subjective experience, which would have been true, but you're not talking about a pure experience. my ineffable experience is not up against your conceptual interpretation of your experience, but you cling to a conceptual interpretation november 18, 2010 at 4:28 pm i understand your idea of not want to give it a name, however in your discourse you use many times conceptual names to describe your experience, names that are derived of particular cosmologies, like leela, the sun god ra, nirvana, brahman, etc. with their correspondent particular religions, and their particular historical, socio-cultural negative baggage. some religions in the past have tried to refer to it as the great mystery, the not named, because they were aware that one word do not encompass the divine, and it is true the word god bring in many of us preconceived ideas with negative connotations, and that is unavoidable. however billions of people they give it a name; allah, brahman, jehovah, etc. and that is fine with me also. shaykh muhyiddin ibn\" arabi is concerned with believers becoming limited to what they have found to be true from the real. he reminds us that god - allah - as he really is, is not the same as the god that people may imagine to be, although allah is not absent from this specific form either allah is unlimited, but the believer's imagination, or opinion of god - allah - is naturally limited. november 25, 2010 at 10:34 am first you tell me about your experience using religious, and metaphysical analogies, now you tell me you are a materialist that doesn't believe but the objective universe out there because our brain is part of it. you being a materialist that is easy to understand. but what was all that about: \"my ineffable experience\" how can you have an ineffable experience, if you say in your latest comment and again i quote you: \"there's no reason to believe anything about it\" please tell me more about that ineffable experience, that now seems more like a product of hocus-pocus. .? november 28, 2010 at 6:10 am i use metaphors because that's all we have. i say \"there is no reason to believe anything about it\" because it is ineffable, not just linguistically; it is unthinkable and therefore a moot point, it is the very definition of nonsense to believe in something you cannot imagine. \"truth can be likened to the bright moon in the sky. words, in this case, can be likened to a finger. the finger can point to the moon's location .\" no, words cannot point at it, because all words are metaphors and ultimately flawed. our understanding of the moon must be internally coherent (logical deduction) and anything we can't epistemologically think about must be disregarded. god can be epistemologically thought of, but is either incoherent or an absolute other, which, as i just said, is per definition nonsense. solipsism is not the only belief that requires a leap of faith into a completely unknowable ontology. brahman-atman, leela and pantheism are identical to solipsism in this respect. november 28, 2010 at 8:09 pm i respect your point of not wanting to give it a name, but splitting hairs about semantics for those that do, and consider that by giving it a name you limit it, that is totally your subjective view, and i accept that as well, but by no means believe that to be superior to those that give it a name. we all have a different qualitative understanding for the same word, that may trigger different responses. as a self confessed materialist, and atheist you are inescapable defined by those terms, that by the nature of semantics are limited as well, and subject to misinterpretations. if you have an ineffable experience, you admit to the ineffable, and that is the moon. november 30, 2010 at 5:54 pm no, i'm only negating the finger-pointing, not the moon itself. i'm negating the attributes you put on the unattributable. and if you think your subjective opinion can do battle with mine and not lose, then please, explain why deduction is not the most useful method of describing the universe. december 1, 2010 at 3:37 pm i am sorry i forgot metaphysics it is not associated to a mystical experience from your materialistic point of view, what i mean in lack of a materialistic, and atheist definition to describe the process of enlightenment, in what context, medium, vehicle, practice, or whatever you want to name it, you have the experience? december 2, 2010 at 4:49 pm so, you mean to tell me one day you woke up and decided you were enlightened? with no practice, no context, and no vision, except for your materialist and atheistic philosophy, and the books you read? that is for sure a new one. alas, if cows could fly! look henrik you seem like a nice guy, but somehow confused, you want to have it both ways, to have your cake, and eat it too, and that is not possible. i got no idea how old are you, but sometimes you sound like a young person, i had been to your blog and there is potentiality in you for real spiritual progress, you may look like a buddha, speak like a buddha, but if you do not act like a buddha, you are not a buddha! and i do not mean disrespect, but you are like a parrot repeating with no real wisdom, all talk, no praxis! there is knowledge in books, wisdom is for you to add, knowledge without realization, is of little use. some years ago i wrote a letter to a friend, and decided to post it a few months ago, you can find it at my blog under the title: letter to a friend about montaigne, writing, and other matters. that apply to you like a charm! read it, is short, you may benefit, your ego is a little out of hand, you are here to win arguments, and feed your ego, you are not fooling anybody, but yourself. and there cannot be any progress in the spiritual path if you do not start to tame the ego, and for that you need a real spiritual discipline, under a competent master, and many years of hard work, so be diligent. by the way anything you want to find about me, all you got to do is read my blog. it is short, only have sixteen posts so far. i am here to serve people in the path, if you need confidential advice, just let me know, get in contact with me, you are welcome. december 3, 2010 at 7:16 pm \"i got no idea how old are you, but sometimes you sound like a young person\". i am 27. \"so, you mean to tell me one day you woke up and decided you were enlightened?\" i've never called myself enlightened. i didn't wake up one day knowing everything after having known nothing the day before. \"your ego is a little out of hand, you are here to win arguments, and feed your ego, you are not fooling anybody, but yourself .\" i didn't come here to win an argument, i came here to challenge your words, so that i might learn something, so that i might challenge my beliefs. \"if you do not act like a buddha, you are not a buddha\" i've never claimed to either be, have been, gonna be or want to be a buddha. you also say \"you seem like a nice guy, but somehow confused\" and \"you are like a parrot repeating with no real wisdom\". it's not often i get so many presumptuous and condescending personal attacks all in one comment. i've read all your posts. in the montaigne letter post you talk about western heartless egos, and i assume that's what you're referring to when you say \"that applies to you like a charm\". is this your prejudice or do you have quotes from my blog to support all of these accusations? \"i experienced the unnameable, the mystery, that which has been metaphorized as the tunder of t.s. eliot's the waste land, the unity behind the duality of yin/yang, the necessary connection of all things related as portrayed in the black dot in the white field and the white dot in the black field, the emptiness, sunyata, of nagarjuna, the love of jesus or the father he describes by saying\" love your enemies and pray for those who persecute you, so that you may be sons of your father who is in heaven; for he makes the sun rise on the evil and the good, and sends rain on the just and the unjust \", that which is beyond being and not being, beyond neither being nor not being, the transcendence of leela, the sun god ra, nirvana, brahman .\" are those not your words? i warned you of borrowing terms for your experience with religious and well known metaphysical, connotations. now those are big claims for a person who confess not even a practice of those beliefs, but furthermore that also deny their possibility as valid. again i quote you: \"tao/sunyata is a linguistically relative metaphor for the absolute truth, and it is ineffable/empty because the objective reality is unobtainable by subjects .\" therefore you can't have your cake and eat it too. those last words unobtainable by subjects, what do you think they mean, or imply? henrik, it is not my purpose to offend you, but to make you aware that it is not the same reading a book let's say about kara-te, and believe you are already a black belt without ever practiced the art! sorry, if it hurt your feelings, but if you think i have being tough, wait until you start a real practice! and you are right i wish this would challenge your beliefs, otherwise all our conversation is useless. december 5, 2010 at 7:50 am \"so if you believe that to be impossible, is not true, that you ever experience the ineffable, right?\" december 5, 2010 at 7:59 pm yes, subjectively! and according to your materialistic and nihilistic beliefs totally meaningless, and therefore useless! but i do not care about it if you believe you are clark kent. i am not claiming that, i am claiming that is not possible to use analogies or metaphors using well know religious origins dismissing their cultural, doctrinaire, dogmatic, historical, cosmological view of those experiences, that is cultural relativism. and no i do not have a prejudice against you, or western society in general but when you claim: \"i have had that experience, but i don't call it god because that sounds like it's not a metaphor for something else, but a real factual personal god. god implies a judeo-christian god, a god as defined by the people of the levant. that is not what i experienced. i experienced the unnameable, the mystery, that which has been metaphorized as the tunder of t.s. eliot's the waste land, the unity behind the duality of yin/yang, the necessary connection of all things related as portrayed in the black dot in the white field and the white dot in the black field, the emptiness, sunyata, of nagarjuna, the love of jesus or the father he describes by saying\" love your enemies and pray for those who persecute you, so that you may be sons of your father who is in heaven; for he makes the sun rise on the evil and the good, and sends rain on the just and the unjust \", that which is beyond being and not being, beyond neither being nor not being, the transcendence of leela, the sun god ra, nirvana, brahman .\" you are committing a grievous mistake of equaling your experience, to theirs and that is what i am talking about when i said in my post of letter to a friend about montaigne, writing, and other matters: \"which take to my posterior reflection, about the lack of sympathy i feel in regard for many members of the western intelligentsia who embrace buddhism, out of their idea that it conforms to our way of thinking, and therefore suits our intellectual proclivities,\" you cheery pick those metaphors to suit your materialistic philosophy, without respecting their true meaning based in their proper context. december 6, 2010 at 3:17 am it is true that i cherry-pick, in the sense that i dismiss all the nonsens of \"fire, earth, water and air\" and 7 chakras and so on. i'm only using the metaphors to explain that the psychology is no different in their experience than in mine. you are clearly not a materialist and can therefore not accept this, but that is your subjectivity, not mine. december 7, 2010 at 4:38 pm here we come full circle, you want to convince me of your subjective ideas based in your intellectual understanding of somebody else experience, and that is why you see them similar. we can't live by proxy, our experience is unique, and it will never can be exactly the same regardless, this is the ship of theseus paradox. the whole idea of a spiritual practice is to come to the realization of your own experience, using methods that have been tried in the past and are effective, regardless of your preconceived ideas about them, if you do not have a practice you will never go too far, granted it takes work, and a lot of effort, but for the skeptics, there are easier, but riskier ways; ayahuasca, iboga, etc. you dismiss too easily what you do not know, or doesn't sound like fit your cosmology, just to give you an example you said: \"it is true that i cherry-pick, in the sense that i dismiss all the nonsens of\" fire, earth, water and air \"and 7 chakras and so on. over billions of chinese people have used acupuncture for over two thousand years, even chairman mao, a staunch materialist and an atheist confronted with the need of medics, and medicines for his troops during the long march, come to the realization that acupuncture was good enough for his troops, and to this day the practice of acupuncture is alive and well not only in modern communist china but also in many other places including western nations. well, as you may guess acupuncture is based on taoist cosmology, that to our modern western understanding may seem unbelivable, in great part based in those same things you arrogantly dismiss as nonsense, here:\" the whole idea of a spiritual practice is to come to the realization of your own experience, using methods that have been tried in the past \"that's a contradiction:\" we can only use other people methods to have a unique experience \". it's interesting that you bring up acupuncture because acupuncture has been proven fake, it's pseudo-science, which means it's all placebo. i can't know their experience no, but then again, you can't know their experience either, you have to make a subjective judgment whether you believe your experience is somewhat like the experience of those who claim attributes like the word\" enlightenment \"based on your subjective understanding of their subjective experience and their subjective intellectual description to you about it. that means we're no different you and i when we evaluate our own and others' experiences and so you can't use that as a argument against me and not at the same time against yourself. you may think your heart cannot lie to you, but that's your subjective opinion, but even if it were you have to make a knowledge-based (even if it's\" knowledge of the heart \") decision whether the experienec other people describe to you and which you can only evaluate through their linguistic description of it, then it comes down to who is intellectually better informed about the experience. i am well aware of the effects of ayahuasca and many other drugs, like dmt, mdma, mushrooms, lsd, peyote, marijuana, cocaine, heroine, amphetamine, opium, alcohol, tobacco and so on. not that i have taken all of them, but it's only the intellectual description of them that matters since we can't feel what others feel. and regardless of our own experiences, under influence or not, we have to relate those experiences subjectively to the language we share and that's our only way of making this judgment. i was talking to a scientologist on his blog, it's in swedish but i can tell you about it. he said that billions or trillions of years ago, metaphysical enteties created the universe and eventually got entangled in it and forget who they used to be, obsessed with the material reality in which they started to believe was real. to free yourself and again become master of time and space, you have to pay a lot of money and go to meeting with an auditor, which is like a spiritual master or guide. the auditor has a device which measures electrical resistance of the skin, but claims that it measures spiritual resistance and is used to unblock the mind, free the spirit. at one point the scientologist i was talking to, during one of these therapy sessions, has an out-of-body experience. i said that oobs are common neurological phenomena, we know what happens in the brain to create these sensations and that it's an illusion of the brain and you're not actually a metaphysical soul that ventures outside the physical body, but he had had this experience and so had a lot of other scientologists and therefore scientology is true and ghosts exist and medium are for real and so on and so on. that's the problem with subjectivity. but even if it were you have to make a knowledge-based (even if it's\" knowledge of the heart \") decision whether the experienec other people describe to you and which you can only evaluate through their linguistic description of it, then it comes down to who is intellectually better informed about the experience. my response to you rather than judging and try to discriminate with your intellect about it, which since my first response to you i clearly told you: you could be perfectly content with yourself believing whatever you wish, but your subjective ideas don't invalidate somebody else experience, that it is not the process of subjective discourse, like i believe the universe work this way, or that other way, therefore it is impossible for god to exist, or oh, if you were under the influence of ayahuasca, it is perfectly reasonable to understand that the chemical process in your brain made you believe all this weird stuff! my answer to you is; you try it and experience it, then we argue if your experience was real, or it was just another idea that cross your mind! either you have experienced god, or you don't, but if you never have a mystical experience that open your heart, all your ideas it is just the chatter box you carry on your head that never stop talking! henrik is not about who is intellectually better informed about china or not, is about if you have ever been to china! you dismiss acupuncture as a fake, you arrogantly negate billions of chinese experience just because you read somewhere is a fake, rather than rely in someone else account you try it! go have a shot of ayahuasca! we have come full circle, here henrik, this is for you: once, a long time ago, there was a wise zen master. people from far and near would seek his counsel and ask for his wisdom. many would come and ask him to teach them, enlighten them in the way of zen. he seldom turned any away. one day an important man, a man used to command and obedience came to visit the master .\" i have come today to ask you to teach me about zen. open my mind to enlightenment. \"the tone of the important man's voice was one used to getting his own way. the zen master smiled and said that they should discuss the matter over a cup of tea. when the tea was served the master poured his visitor a cup. he poured and he poured and the tea rose to the rim and began to spill over the table and finally onto the robes of the wealthy man. finally the visitor shouted,\" enough. you are spilling the tea all over. can't you see the cup is full? \"december 8, 2010 at 5:56 pm the flaws of anecdotal evidence is exactly what i was pointing at with my reference to the perceived enlightenment of the scientologist. doesn't matter how many people claim that acupuncture works for them when all unbiased tests show that it's just placebo. and i have had that experience, why do you keep saying i will learn something after i have one when i've made it clear i've already had the experience. you don't think it can be achieved by a materialist or without drugs, but that's a problem of your limited, or perchance even deluded, mind, and not a problem of my limited, and perchance deluded, mind. also, i've invited you to my tea party (my blog), but you refuse my tea even before tasting it solely because it smells strange to you. i have been to your blog and read here, and there. and what you say about quantum physics from a materialist point of view is sound, i am not opposed to the study of matter by science, but ultimately what they have found it is what hindu cosmology have been telling us for quite a long time the universe is maya, illusion. the chinese: the tao that can be told is not the eternal tao the name that can be named is not the eternal name. the unnamable is the eternally real. naming is the origin of all particular things. free from desire, you realize the mystery. caught in desire, you see only the manifestations. yet mystery and manifestations arise from the same source. this source is called darkness. darkness within darkness. the gateway to all understanding. the sufis also speak of creation not only in the past, but as a continuous process, this is what is called the renewal of creation at every instant. at every moment the universe is absorbed in to the principle and recreated at every moment, in fact existence is not a state, but an act, as the existenciating command of god,\" be \"the sufis tell us that the absolute see itself on creation like in a mirror, so no wonder if you study the image of the mirror you will only find a reflection that is not the real. most people problems with god arise of trying to find him, not realizing that in a mirror right is left, and left is right! in the spiritual world things are inverse, you do not go looking for god, you do not realize god. god realize himself in you! if you only allow it. here the chinese again:\" if you overesteem great men, people become powerless. if you overvalue possessions, people begin to steal. the master leads by emptying people's minds and filling their cores, by weakening their ambition and toughening their resolve. he helps people lose everything they know, everything they desire, and creates confusion in those who think that they know. practice not-doing, and everything will fall into place. \"if you would realize that emptiness that you talk so much about, but seem not to understand, it is precisely what the mystic strive for. now, those same guys who give us all that nonsense of earth, water, air, fire and the seven chakras come with a brilliant fellow named patanjali who expose a method of union (yoga) the yoga sutras of patanjali tell us:\" before beginning any spiritual text it is customary to clear the mind of all distracting thoughts, to calm the breath and to purify the heart. 1.1 now, instruction in union. 1.2. union is restraining the thought-streams natural to the mind. 1.3. then the seer dwells in his own nature. 1.4. otherwise he is of the same form as the thought-streams. 1.5. the thought-streams are five-fold, painful and not painful. 1.6. right knowledge, wrong knowledge, fancy, sleep and memory. 1.7. right knowledge is inference, tradition and genuine cognition. 1.8. wrong knowledge is false, illusory, erroneous beliefs or notions. 1.9. fancy is following after word-knowledge empty of substance. 1.10. deep sleep is the modification of the mind which has for its substratum nothingness. 1.11. memory is not allowing mental impressions to escape. 1.12. these thought-streams are controlled by practice and non-attachment. 1.13. practice is the effort to secure steadiness. \"etc. pay attention in particular to 1.2 you have to stop the flow of thought, if you don't you will never achieve emptiness, in this life, even if emptiness is our true nature. december 9, 2010 at 3:17 am\" the sufis also speak of creation not only in the past, but as a continuous process, this is what is called the renewal of creation at every instant. \"if you had actually read my blog you'd see that i talk about that a lot, but very rarely of quantum mechanics. maya is the real world, the illusion is the subjective experience of maya. i can accept that god is the inverse of maya, but if so, then god is just another name for maya and it would be pointless to talk about god instead of maya. you talk a lot but you say nothing, just repeating lengthy quotes and not being able to see the whole picture. december 9, 2010 at 7:31 am you see henrik, the problem with label yourself with a ism, or a ist, like in materliasm, or atheist, or any other ism for that matter, is that it force you in to dogmas, here you affirm that it is not possible to stop the flow of thought just because under the tenets of your religion, oh, i am sorry, your materialism that is impossible. but let's see how somebody else not bound by your limitations can see things: the universe is absolutely huge, so huge that every possible combination of events that you can imagine inside your head really exists! to give you an example of how the universe is infinite we must look at how the universe branches to infinity on the small side. if i had an apple and made it? as large and did this over and over again. there would always be an apple whether its original size was divided down and down ex .5, .25, .125, .0625 and so on. the apple would never disappear because the universe will always accommodate it. we must eliminate human measurements from our head because we have labeled certain sizes terms that make mathematical sense in our mathematical calculations of the universe. what people have failed to realize is that the earth's circumference is not really 24,902 miles because that it all relative to our idea of size and our measurements. the earth could indeed be .0000024902 cm in the overall scheme of the universe and humans could be .0000000000001 mm at their real height where we have labeled ourselves as perhaps 6 feet tall. let us imagine a universe with endless possibilities, do not waste time with concepts of dimensions and alternative realities that have been theorized. simply focus on the term infinite and the concept that infinite is never ending, therefore everything that you can imagine exists. your mom and dad are being born somewhere zillions of miles away, you are a grandparent, the president of the united states, the emperor of the chinese dynasty. somewhere you can even fly if in that given situation and in that given world, physics enable it. perhaps gravity is far weaker on that earth 9,999,999,999 human measured miles from here in the universe. back to concept of the ocean and land, just because you cannot see these things does not mean they do not exist. just because you cannot see those other planets does not mean they do not exist. for example let us look at the moon, humans weigh far less due to gravity and can therefore bounce along while that is not a possibility on our planet due to gravity. under creative commons license: attribution you say:\" also, it is impossible to stop the flow of thought. when i meditate i am under the illusion that i am not thinking, in actuality i am just thinking of emptiness, i will never get rid of the activity even when i'm not aware of it, evidenced by dreams and the subconscious. the fourth letter of aum is this same illusion. \"\"my response to you is if the universe is an illusion, why can't you have any illusion you may desire? why you have to add: so are all the experiences of the heart. in reality you are created by the neural network. i know people have wanted to believe in metaphysics for a long time because the discrepancy between the subjective experience of being and the detailed description of the body creates an insurpassable abyss, a mystery, and this lack of understanding leads us to assume that thunder is a force of will, that trees are inhabited by djinns, that the sun is pulled by a god, that the material world is not an explanation, we have to invent the idea of\" there's gotta be something more \", literally\" meta - \". december 9, 2010 at 4:55 pm\" the earth could indeed be .0000024902 cm in the overall scheme of the universe and humans could be .0000000000001 mm at their real height \"yes, but the point about deduction, which i've mentioned several times already, is that the relationship is the same regardless of the definition. i actually thought you had some good arguments behind your strong convictions, but it seems you just thought:\" space and time is infinite and i have a soul, therefore? \", which is a deduction based on two very weak presuppositions, because a) space is not infinite and b) the soul does not exist. space is huge, but not infinite. if you divide an apple enough times you come down to an apple cell, if you divide that cell, is it still an apple? if you divide the cell down to a single hydrogen atom, is that still an apple? if you divide that atom, is it still an apple? when does the apple become a human if you eat the apple atoms? the soul does not exist. like all language, the soul is a metaphysical simplification of a complex process. just because it's difficult to understand the discrepancy between our\" experience \"and our experience of our experiencers (the body) (i.e. between the experience and the being) doesn't mean it's sound to say it's gotta be magic. also, even if the idea of infinite space was true, lets say that the billions of galaxies we today believe is what makes up the universe are actually just a quark in a larger existence and the reason we can't see other quarks (other collections of billions of galaxies) is because quarks are so far apart and don't have a noticeble effect on each other. thus, this quark might very well be a part of a giant apple or any other structure. now, even if this was true, why should we believe it? nothing in the power of the human can justify this belief. there's no thinkable reason to believe it, (your arguments are indeed very poor). no delusional\" emotional reason \"to believe it. no evidence either by measurement or inference can be produced. so even if it was the truth, it would be foolish to believe in it. i only use - isms to spark debate, my arguments are not based on - isms. if someone offers a more likely explanation of the universe that doesn't fit with the acceptable definition of e.g. materialism, i will either propose that our understanding of matter be changed or if that is not logically or consensually possible reject materialism .\" why can't you have any illusion you may desire? \"because we're not metaphysical. the illusion is caused by the structuralization of matter. december 10, 2010 at 12:17 am i confess that i choose this article to see if you would catch this one! actually i agree partially with you jamison fisher makes the crass mistake of equating the universe with god in a pantheistic fashion, forgetting that the universe is finite. as for when an apple stop being an apple at the level of the atom, it is not important, before it was an apple, it was an atom of something else, that you eat the apple will be just like the earth in about 5 billion years, the sun will have used up its hydrogen reserves and will expand to become a red giant, with a radius of about earth's orbital distance. the earth will most likely be swallowed up when this occurs, so the apple! but it is not the apple that should concern you, but the lack of ontological reality (maya) of the apple, the atom of the apple, the earth, the sun, and the universe itself! yes, i read your: an arbitrary theory of creation, but honestly find them, semantically contrived, painfully tortuous to follow, the nearest to the truth of the matter is when you resume and say:\" in actuality, nobody knows the nature of water. but we are finite and therefore need to/do believe that we know. \"december 10, 2010 at 6:07 pm yes, but the implications of our lack of knowledge is the interesting part. to say that we don't know is far from a resum?, it's merely the prologue. we can't just say\" i have no clue \"and be done with it, and even worse would be to say\" i have no clue, therefore metaphysics is real. \"subsequent conclusions come from the same question that descartes answered with\" cogito ergo sum \", namely: what can i know? my answer is that you can't know the absolute nature of anything. ultimately nothing exists. but we have dependent-arising, meaning relativity, and we can judge the relative (internal) coherence of a world-view. thus, in the end, we can't even speculate about the ultimate nature of things, we can only think of/have to accept the deduced description of the world. december 10, 2010 at 7:53 pm in the house build by the materials of illusion whose inhabitant is more deluded? when you say: we can't just say\" i have no clue \"and be done with it, and even worse would be to say\" i have no clue, therefore metaphysics is real. \"conclusion:\" metaphysics is real. \"you truly don't understand why this is impossible to say? i don't know if there's an apple in my hand, therefore there is a spider in my hand, necessarily and without doubt a spider. i don't have a clue whether it's an apple or not, whether it's something else or not, therefore it must be a spider!\" i don't know, therefore metaphysics is real \". the point about deduction is not only that we must reduce our knowledge to unprovable deduction, but that this is necessarily what we must build our knowledge on. we can accept that we have no ultimate knowledge of course and say\" i don't know if i exist, i don't know if you exist, i don't know if god exists, i don't know if if anything exists, i don't know if eating will keep me alive, i don't know if there is water in my body, i don't know if there's any point in drinking water, i don't know how babies are made, i don't know et cetera, \"which is perfectly fine, but it doesn't seem very usable. and we can't get rid of deduction even if we did arrive at that conclusion, because we arrive at that conclusion through deduction of our knowledge. we use deduction to evaluate the idea that\" we can't know anything \", we came to this conclusion through deducing our experiences of the world. the problem of deduction is that the premises are absolutely unknowable, but the strength of deduction is that we can evaluate the internal coherency of ideas. and this is the relationship we inescapably build our knowledge with, no matter what delusional concepts are invented to circumvent this realization. in a house of illusion, the people who understand the laws of the illusion will be able to navigate through it. if the laws of illusion are sometimes altered by anyone or anything, the people who understand that one or that thing will understand how the laws change and thus fare best. if the laws of the illusion are constant, then there either is no thing or one to alter them or the thing or one is itself part of the laws or the laws themselves and therefore a superfluous element in the understanding of the house, which then is the entirety of existence and includes thing like love and bliss and consciousness and everything, at least to the person who understands that the house houses it-all. i'm not trying to convince you to just make me happy, i also want to share my thoughts with you and i want to explore my own thoughts and i want to explore language and i want a bunch of other stuff besides becoming happy through your conversion, which is far from a top priority of mine. december 12, 2010 at 12:28 pm cervantes taught us there is madness that can be sublime, in india the babas, mad people to our western eyes, people just call them god intoxicated, not as mockery, but as a sign of respect, if you argue with a mad man who is the fool? as to who would fare best will always be subjective, and therefore relative. meanwhile you reduce existence at a long series of i don't knows, and look for enlightenment in the workings of matter, always changing and voluble and dependent to a new discoveries, new hypothesis, photons, a new particle, or distant quarks, and black holes, somewhere in outer space, and dream of building science fiction technology like connecting your brain to a giant machine, not an original idea, and in my subjective judgment not a good one either, and to explore the universe it in a future still not existent, the outer realms of it, that is your privilege, and if it brings you joy, even better, meanwhile we suffer today the backlash of lesser technology, product of that knowledge, and the irresponsibility of those who menace not only us, but every other creature on earth. i understand the materialist position of consciousness to be a byproduct of matter, but then there is wisdom in matter, which would mean a sort of consciousness, self awareness, a guiding principle, that current scientist deny and attribute to chance, the laws of physics, time etc. and if pressed at all, some begrudgingly concede to name it a mystery not unveiled yet. this estate of affairs in contemporary science reduce men to a common lower denominator, a throw of the dice of a nihilistic, and purposeless existence, this is contrary to my experience, of life existence as a precious, and meaningful. on your views this wouldn't mater, i guess, it just will be a chemical reaction in my brain. maybe the common man one day would be able to realize truth through science, i do not deny that possibility, but in any case still would be a subjective experience, in the individual, and very likely not different of mystical experience were the vehicle for it, is not the mind, or the facts out there, but the heart. but unlike you, others before, and in the present as myself, have chosen a different way, i am unconstrained either by an scholastic necessity to conform, or an academic prestige to keep, that free me to speak my mind openly, and without restrains, without the fear of burning up my reputation, like e.f. schumacher that gave her daughter the book that will be his testament in his deathbed\" a guide for the perplex \"no doubt to escape criticism. when religions talk about different levels of being, is anathema, or just nonsense, when theoretical physicists talk about different dimensions, and all sorts of things, with little compunction. advaita vedanta speaks of three levels of truth. the transcendental or the p? ram? rthika level in which brahman is the only reality and nothing else; the pragmatic or the vy? vah? rika level in which both jiva (living creatures or individual souls) and iswara are true; here, the material world is also true, and, the apparent or the pr? thibh? sika level in which material world reality is actually false, like illusion of a snake over a rope or a dream. the third school of vedanta philosophy is the school of advaita vedanta. in this, the only reality that exists is brahman. this does not mean that the world does not exist, but that it has a lower level of reality. in advaita vedanta philosophy, the world exists, but it exists with only ambiguous reality, and it exists with brahman at its root. hence the true reality of the world is brahman and the reality that we see around us is a false reality, an ambiguous reality. so the world is really brahman, that which is not brahman has only relative reality and is to be disregarded. brahman is the only truth, the world is an illusion, and there is ultimately no difference between brahman and individual self. if i am mad so be it, unlike a young atheist that exclaimed that he was so sure of his beliefs, that if he by any chance would experience a mystical experience, he would run and check himself in to a clinic for the mentally disabled, i have no reason to distrust my experience, there is no two. subjectivity this entry was posted on november 28, 2010 at 1:24 pm and is filed under like be the first to like this post."}, {"articleID": "2017110608_00020043_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"]}, "date": "2017-11-06", "url": "https://www.fin24.com/Markets/International-Markets/stocks-mixed-yen-slides-to-lowest-since-march-20171106", "content": "1549,97 (-0.10%) Loading...We're currently experiencing serious technical problems on the site, and as a result are unable to update the news--even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard .--<mark>David McKay</mark> (editor) & team Stocks mixed, yen slides to lowest since March 0 minutes ago Dollar gains before US jobs report, stocks rise Sydney - The yen tumbled to the weakest since March after Bank of Japan (BoJ) Governor Haruhiko Kuroda said it's crucial for inflation to exceed the 2% target. Stocks were mixed after China's central bank chief warned again about excessive leverage and President Donald Trump brought up trade grievances on a trip to the region. Hong Kong's Hang Seng Index reversed losses after dropping the most in more than two weeks in the wake of People's Bank of China Governor Zhou Xiaochuan's latest salvo on the continuing accumulation of financial risks. Japanese equities were little changed after the yen's decline offered support earlier. Kuroda underscored in a speech Monday that the BOJ is committed to overshooting its inflation goal, auguring no appetite for tapering stimulus. Oil extended an advance above $55 a barrel, with traders keeping an eye on the surprise power shakeup in Saudi Arabia over the weekend. Iron ore climbed percent. \"Governor Kuroda is repeating what he said after the BoJ's meeting last week but the dollar-yen is getting more support as the market starts to anticipate dollar divergence becoming a key driver again of price action,\" said Mansoor Mohi-uddin, head of currency strategy in Singapore at NatWest Markets, a unit of Royal Bank of Scotland. \"The BoJ, like other major central banks, is signaling it will not lift interest rates anytime for the foreseeable future. In contrast, the Fed continues to stress its tightening bias. That is laying the conditions for a broader-based rally for the greenback across the board .\" Trump in Tokyo on Monday complained of unfair trade with Japan, pressing the country to step up investment in the US. He goes on to South Korea and China this week, with further prospects for trade tensions to pop up. Read more on Trump's trip to Asia here. Over the weekend, the president claimed credit for the rise in US stocks, which on Friday capped the longest run of weekly advances since 2013. The anti-corruption crackdown in Saudi Arabia has ensnared top officials and billionaires, including Prince Alwaleed bin Talal, known for his investments in companies such as Citigroup and Apple. Saudi Arabia's Tadawul All Share Index fell as much as 2.2% on Sunday before erasing losses to end up 0.3%. Kingdom, Alwaleed's investment vehicle, tumbled 7.6%. News on central bankers also will be closely watched. Federal Reserve Bank of New York President William Dudley is close to announcing his retirement, according to CNBC. His early departure would mean the top three positions at the Fed changing over within a relatively short period. Trump announced last week that Fed Governor Jerome Powell will be nominated to replace Janet Yellen when her term expires in February. Vice Chairperson Stanley Fischer retired in mid-October. Friday's US payrolls data provided a mixed picture of the strength of the labour market, though distortions from the hurricanes in August made it difficult to draw firm conclusions. Based on fed fund futures, the odds for a rate hike in December were little changed. Here are key events to watch out for this week: • The Reserve Bank of Australia is expected to keep interest rates on hold at a policy-setting meeting on Tuesday. Other central banks setting monetary policy this week include: Argentina, Mexico, New Zealand, Peru, Malaysia, Poland, Serbia and Thailand. • China releases third-quarter current account; October foreign-exchange reserves and October CPI and PPI this week. • Indonesia's third-quarter GDP expanded at a slower-than-expected pace, rising 5.06% from a year earlier versus a median estimate of 5.2%. • US consumer sentiment probably cooled in early November from a more than 13-year high. • The University of Michigan's report on Friday wraps up a light week for US economic data that also includes figures on job openings in September. New York Fed's Dudley gives a speech on \"Lessons from the Financial Crisis\" at an Economic Club of New York luncheon on Monday. • OPEC releases its World Oil Outlook. • Earnings season continues with announcements from Toyota, BMW, Walt Disney, Adidas, and Siemens. • Also this week, the European Central Bank publishes its economic bulletin and the European Commission updates its economic projections for the eurozone. Stocks • Euro Stoxx 50 futures fell 0.2% in early European trading. • Futures on the S & P 500 were little changed. • The main gauge rose 0.3% on Friday. • The Topix index was down 0.1% at the close, while the Nikkei 225 Stock Average was little changed. • Australia's S & P / ASX 200 Index fell 0.1%, while the Shanghai Composite Index climbed 0.5%. • South Korea's Kospi index fell 0.3%. • Hong Kong's Hang Seng Index rose 0.1%. • The CBOE Volatility Index, known as the VIX, dropped 8% to a record-low 9.14 on Friday. • The MSCI Asia Pacific Index declined 0.1%. Currencies • The yen dropped 0.3% to 114.40 / $, paring an earlier decline of more than 0.5%. • The Aussie dollar traded at 76.49 US cents. • The South Korean won fell 0.1% to 1 115.09 per dollar. • The euro was steady at $1.1612. • The Bloomberg Dollar Spot Index was little changed. Bonds • The yield on 10-year Treasuries was little changed at 2.34%. It fell more than seven basis points last week. • German 10-year bund yields were steady at 0.36%. Commodities • West Texas Intermediate crude rose 0.4% to $55.86 a barrel. It jumped 2% on Friday. • Gold slipped 0.1% to $1 263.43 an ounce. • Iron ore rose 3% to 454 yuan per ton on the Dalian Commodity Exchange. SUBSCRIBE FOR FREE UPDATE: Get Fin24's top morning business news and opinions in your inbox."}, {"articleID": "2012052601_00004098_W", "names": {"Shannon Williams": ["Q15730804", "Q18199818"]}, "date": "2012-05-26", "url": "http://newsday.com/entertainment/gregg-allman-engaged-for-7th-time-1.3740942", "content": "7:55 pm in babylon montauk hwy between little east rd and great east neck rd change region change your region do you want to make westchester / rockland your default region? gregg allman engaged for 7th time is getting married for the seventh time. the rock and roll hall of fame member has told several interviewers this week that he's engaged to his 24-year-old girlfriend, <mark>shannon williams</mark>, and allman's publicist and manager confirmed the news friday morning. allman talked about the unexpected love he felt for <mark>williams</mark> in an interview with the associated press earlier this year for a story about his memoir, \"my cross to bear,\" but admitted he was leery about taking the relationship further because of his past difficulties in his love life. but allman told howard stern, piers morgan and a siriusxm town hall audience this week that he's taken the relationship to the next stage. little is known about <mark>williams</mark>, who entered the 64-year-old rock pioneer's life after a liver transplant and a run of health difficulties. allman told the ap in a love-struck voice he met her while in florida on friday, jan. 13, and \"i am totally in love .\" allman's failed marriages make up a significant part of \"my cross to bear,\" a best-seller after its release may 1. he offers a rare glimpse into his private life, detailing the rise and collapse of his relationship with"}, {"articleID": "2013033022_00059106_W", "names": {"Martin Taylor": ["Q3790292", "Q470727", "Q6550111", "Q6776725", "Q6776726", "Q6776728"]}, "date": "2013-03-30", "url": "http://mcall.com/entertainment/music/mc-berks-jazz-fest-reading-20130330,0,3565419.story?track=rss", "content": "r d annual berks fest to give fans an education in jazz by john j. moser, of the morning call the berks jazz fest, which opens friday april 5 for its 23 r d year, has always been about entertainment. but audiences this year also might learn more than ever about the distinctly american musical genre from the nearly 140 performances in the festival's 10 days at major venues, clubs and restaurants throughout the reading area. some of that education will come just from listening. the effects jazz has had on other styles will be evident in programs that offer jazz mixed with rock, funk, blues, latin, pop and gospel. salutes to artists such as steely dan will further drive home that concept. festival headliner esperanza spalding, the only jazz artist to win the grammy award for best new artist, will give listeners a schooling in the rising popularity of traditional jazz when she plays april 9 at reading's scottish rite cathedral. the bassist/singer has been a music educator herself. if you want more formal education, there are workshops and master classes. new this year is get jazzed, an educational series that offers a mix of live performances, workshops and film at goggleworks center for the arts in downtown reading. \"we do a lot with education every year but our education committee really put together a comprehensive program,\" says festival general manager john ernesto. the 2013 festival is part of the smithsonian institute's national jazz appreciation month celebration. as always, the fest offers an impressive lineup that includes six 2013 grammy nominees. in all, the fest will feature 44 headline concerts with tickets costing $15 - $48, and nearly 100 free performances. organizers have expanded the boundaries of the fest. smooth jazz trumpet player and multi-instrumentalist rick braun, an allentown native, played a preview of his fest appearances at musikfest cafe in bethlehem on march 30 - his first public lehigh valley show ever. braun will play three shows at the fest - he's part of berks bop iii on april 10 and the all-star jazz jam on april 11, both at crowne plaza reading, and the jazz attack on april 12 at scottish rite cathedral. after the fest, blues-jam-rock group tedeschi trucks band, featuring allman brothers guitarist derek trucks and his wife susan tedeschi, will play an april 28 show at reading's sovereign center under the umbrella of the festival. after a preview night thursday, april 4 featuring concerts at kutztown university and the reading public museum, the fest officially opens friday, april 5 with a concert by dianne reeves, the only singer to win the grammy award for best jazz vocal performance for three consecutive albums (she's won four grammys overall), at sovereign performing arts center. the show also will mark the 100th anniversary season of reading symphony orchestra, which will back reeves. \"i'm really excited about opening night,\" ernesto says. \"there's no one better than dianne. man, she's an amazing jazz singer, and a singer, period - four-time grammy winner .\" adding the reading symphony anniversary celebration will be a \"great way to kick off the festival,\" he says. the festival has tried to get spalding to play in reading since she beat justin bieber for the best new artist grammy, ernesto says. \"we could never get her schedule to match up with the festival,\" he says. the festival is slightly later this year, pushing it into the path of the east coast leg of spalding's tour. ernesto says because easter is early this year, the fest \"made the decision to go after easter; not push the festival too far up into march .\" that decision was serendipitous for the fest's focus on education, ernesto says. it put the entire festival in april, which happens to be the smithsonian institute's national jazz appreciation month. so the festival applied for and got the smithsonian's official designation. \"we wanted to really take advantage of that and be part of that whole program,\" ernesto says. \"it's kind of neat, and it's really good because it ties in with a lot of the educational stuff that we do .\" for the get jazzed series, ernesto says, the fest rented the 120-seat goggleworks theatre for seven days. all the programs but one are free. wynton marsalis and eric clapton play the blues, \"followed by local blues band lil' ragu and the blues all-stars. the blues all stars are part of the festival's berks jazz jam, where young musicians play with the pros. on saturday, british guitar legend <mark>martin taylor</mark> will off the series' only paid-attendance event, a workshop and concert, followed by free performances by the berks high school all-star jazz chorus and jazz band."}, {"articleID": "2009101410_00000440_W", "names": {"Ping An": ["Q11060842", "Q45505601", "Q55283699", "Q59564024"]}, "date": "2009-10-14", "url": "http://sfexaminer.com/economy/ap/64197452.html", "content": "china shares rise on hopes for better 3q corporate earnings, led by financials, property associated press 10/14/09 1:40 am pdt shanghai - chinese shares extended gains wednesday, led by financial and real estate shares, on expectations for better corporate earnings for the third quarter. the benchmark shanghai composite index jumped 34.34 points, or 1.2 percent, to 2,970.53. the shenzhen composite index for china's second exchange gained 0.8 percent to 1,021.10. sentiment rose after xie shikun, a senior official at the china securities regulatory commission, said tuesday that corporate earnings sharply improved in the third quarter. \"this boosted the benchmark, as the market could no longer rely on excessive bank lending for gains,\" said deng hongguang, <mark>an</mark> analyst for oriental securities in shanghai. analysts played down the impact of the release wednesday of better-than-expected trade data for september. the figures might just reflect a short-term rebound in demand due to orders for christmas, deng said. industrial & commercial bank of china ltd., china's biggest commercial lender, edged up 0.6 percent to 5.02 yuan. bank of china ltd. added 0.3 percent to 4.04 yuan. <mark>ping an</mark> insurance ltd. increased 1.6 percent to 55.27 yuan, and china life insurance ltd., the country's biggest life insurer, advanced 1.4 percent to 29.32 yuan. property rose on expectations that the chinese yuan will appreciate against the dollar, attracting investment, or so-called \"hot money,\" flows from overseas. china vanke ltd., the country's biggest developer, gained 3.8 percent to 11.42 yuan, while china merchants property development co. soared 5.2 percent to 27.30 yuan. resource shares were buoyed by higher oil prices with petrochina ltd., asia's largest oil and gas producer, up 1.5 percent to 13.31 yuan and china petroleum & chemical corp. adding 2 percent to 11.98 yuan. oil prices surged above $75 a barrel wednesday in asia for the first time in a year on investor optimism that crude demand will improve ahead of the christmas shopping season. datong coal industry co. surged 4.7 percent to 41.34 yuan, while china shenhua energy co., the country's biggest coal producer, climbed 2.5 percent to 33.89 yuan."}, {"articleID": "2009042702_00013028_W", "names": {"Nick Moore": ["Q3876026", "Q7027567", "Q7027569"]}, "date": "2009-04-27", "url": "http://forbes.com/feeds/reuters/2009/04/26/2009-04-27T012656Z_01_SP417869_RTRIDST_0_CHINA-GOLD-ANALYSIS.html", "content": "rpt-analysis-china's big gold buy barely kept pace with forex - forbes.com reuters rpt-analysis-china's big gold buy barely kept pace with forex china-gold / (analysis): rpt-analysis-china's big gold buy barely kept pace with forex * china reveals gold reserve rise after years of talk rss * but diversification may quicken as dollar anxiety grows (repeats story filed on friday) by <mark>nick</mark> trevethan singapore, april 24 (reuters) - the big surprise in china's revelation on friday that it had secretly added over 450 tonnes of gold to its foreign reserves over the past six years may be the fact that it hasn't bought far more than that. now, many analysts say the rare public disclosure may be a prelude to beijing accelerating its purchases--possibly from big government agencies or central banks--as it worries about the erosion of its $2 trillion cash pile. in the first public comment on top-secret gold holdings in years, hu xiaolian, head of the state administration of foreign exchange (safe), told xinhua news agency that the country's reserves had risen by 454 tonnes from 600 tonnes since 2003. he said the gold had been purchased from domestic production. the figure confirmed what many gold bugs have suspected for years--that beijing has been quietly amassing reserves. the surprise is actually how conservative its approach has been. as a proportion of foreign exchange reserves, which have risen five-fold over the same period, gold now stands at a tiny 1.6 percent, versus 1.7 percent in 2003, according to reuters calculations, suggesting chinese disenchantment with the dollar has yet to significantly influence its buying patterns. but things may be changing, and a quickening pace of gold buying would lend considerable support to prices that have threatened to stall at around $900 an ounce--unless, as many analysts expect, it buys the gold through private channels. the imf has approved selling just over 400 tonnes of its gold. \"central banks will go straight to china rather than mess about or spook the market. china will be a ready buyer and pay a decent price,\" said jonathan barratt, managing director of commodity broking services in sydney. for years china has used its trade surplus to buy up u.s. treasury bills--effectively paying for the consumer boom that collapsed last year--but worries about inflation and the slide in the dollar mean beijing wants to diversify into other assets. more recently, china suggested a move toward a world currency system linked to the international monetary fund's special drawing rights, an idea dismissed last month by senior obama adviser paul volcker not practical. [id: nn25309260] \"in terms of china, there's substantial currency and debt risk with the current holdings of reserves, so this reflects an ongoing pattern of diversification that we've seen across both public and private sector institutional funds,\" said daniel wills, senior analyst at etf securities in london. gold prices rose a modest 1 percent after the news on friday, but few dealers expect beijing to abandon its discreet approach and embark on a buying spree. china in six years, etf in six months the announcement that beijing was sitting on 1,054 tonnes of gold bullion, up 75 percent in the past six years, pushed china up to the fifth place in the table of gold-holding nations. for a graphic showing the world's biggest gold holders: in some regards, the sum is sizeable, about the same amount that europe's central banks and the international monetary fund sell each year as they gradually and publicly destock. by other measures the sum is paltry. the spdr gold trust, the biggest exchange traded fund, saw its holdings rise by the same sum over just six months. by reuters calculation, china's holdings of gold are worth around $30.9 billion at current prices, while the u.s. gold mountain is valued at $238 billion. the united states holds 79 percent of its foreign currency reserves in gold. \"we recommend our clients hold 5 percent of their investments in gold. on that basis china has another 3,300 tonnes to buy,\" says anz's senior commodities analyst mark pervan. and buying more gold would fit well with beijing's publicly stated aim to build a bigger inventory of all raw materials, which would also reduce its exposure to the greenback. \"i see this as very supportive for sentiment towards gold--i suspect that the chinese will seek further opportunities to rebalance their gold holdings, in line with other central banks,\" said <mark>nick moore</mark>, global head of commodity strategy at rbs global banking and markets in london."}, {"articleID": "2018100211_00283010_W", "names": {"Sebastian Aho": ["Q13402197", "Q16158994"], "Tyler Johnson": ["Q17489372", "Q30122141", "Q57423105", "Q7585450", "Q7860052"], "Jon Cooper": ["Q16196878", "Q3183185"], "Derek Ryan": ["Q15304937", "Q15626910", "Q15805302"], "James Neal": ["Q24557998", "Q539743"]}, "date": "2018-10-02", "url": "http://wlos.com/sports/content/hurricanes-foegele-among-surprises-to-make-nhl-rosters", "content": "Hurricanes' Foegele among surprises to make NHL rosters by STEPHEN WHYNO, AP Hockey Writer Carolina Hurricanes left wing Warren Foegele (13) celebrates with center Clark Bishop (64) and right wing Saku Maenalanen (8), of Finland, after Foegele scored a goal against the Nashville Predators during the first period of an NHL preseason hockey game Tuesday, Sept. 25, 2018, in Nashville, Tenn. (AP Photo/Mark Zaleski) A A (AP)--Warren Foegele carried his Charlotte Checkers bag out of the visiting locker room and insisted he hadn't yet earned an upgrade. Foegele needs a new bag now because he beat the odds and made the Carolina Hurricanes' opening night roster with an impressive preseason. Only reigning Art Ross Trophy winner Connor McDavid and last year's rookie of the year Mathew Barzal had more preseason assists than Foegele, the top surprise player to make an NHL team out of training camp. \"I just came to camp, just put my head down and tried to work hard and tried to make good plays,\" Foegele said. \"I'm a hard-working player and I think I can fit anywhere in the lineup. I think I can grind, I think I can make plays, but I think the work ethic is what I really take a lot of pride in and that's what I try to show .\" With seven points in eight preseason games--only nine players around the league had more--Foegele beat out other forwards on one-way contracts to make Carolina's roster. He's a Rod Brind \"Amour kind of player because the coach said Foegele is always around the play and\" even if he doesn't produce points or whatever, you just feel like he wins his shifts. \"Foegele was at his best against the defending Stanley Cup champion Capitals when he forced turnovers and set up a pair of goals. The late-blooming 22-year-old who went from the University of New Hampshire to the Ontario Hockey League to the American Hockey League doesn't stand out with his skill but can do a little bit of everything .\" He really can skate and also he can score some goals, \"Hurricanes forward <mark>Sebastian Aho</mark> said .\" He's not just a grinder. I think he can really make some plays, too. \"Foegele will get that chance this season. Here are some other players who surprised by making NHL season-opening rosters: MIKHAIL VOROBYEV, FLYERS The 6-foot-2, 194-pound Russian center didn't just challenge for a spot with Philadelphia. General manager Ron Hextall said the 2015 fourth-round pick broke down the door and forced the organization's hand. Vorobyev led the Flyers with seven preseason points and has stood out since Day One of training camp .\" It's what you're looking for with your young players: Come in and make an impact, and he did, \"Hextall said .\" He's a real good two-way player. He's not a young guy that you're afraid to put him out there because of the defensive side of the puck. \"MATHIEU JOSEPH, LIGHTNING An injury to forward <mark>Tyler Johnson</mark> opened up a role for Joseph on Tampa Bay's third line and second power-play unit. Joseph's quickness is his most noticeable attribute, and he made the Lighting in large part because he led them in preseason scoring with eight points on four goals and four assists .\" Speed is probably the big thing, \"coach <mark>Jon Cooper</mark> told reporters Monday .\" What we really liked in the preseason: He was finishing a lot. \"DILLON DUBE, FLAMES It would have been very easy for Calgary to keep Curtis Lazar, but GM Brad Treliving knew Dube would play for the Flames someday. The 20-year-old made sure it was now. Dube had four goals in the preseason and could open the season on the third line with <mark>Derek Ryan</mark> and free agent signing <mark>James Neal</mark>, giving him an opportunity to put up plenty of points when the games count. JESPERI KOTKANIEMI, CANADIENS It's no surprise the top two picks from June's draft, Buffalo defenseman Rasmus Dahlin and Carolina forward Andrei Svechnikov, are in the NHL right away. So maybe it shouldn't be a shock about Kotkaniemi, but Montreal seemed to take him third as a long-range investment. Instead, the Finnish center was one of the Canadiens' best players in exhibition action and never looked out of place. In an organization short on big centers, Kotkaniemi is a welcome addition right away. ___"}, {"articleID": "2020030301_00019382_W", "names": {"Mark Mcgowan": ["Q16197112", "Q5981811", "Q6768808"], "Brendan Murphy": ["Q4961012", "Q4961017", "Q4961018", "Q58447534", "Q59545990"], "Andrew Miller": ["Q1455614", "Q17385571", "Q21535598", "Q25929397", "Q2846688", "Q2846690", "Q4758025", "Q4758026", "Q4758027", "Q4758028", "Q4758029", "Q4758032", "Q580927", "Q720306"]}, "date": "2020-03-03", "url": "http://www.ipswichadvertiser.com.au/news/the-month-that-has-authorities-worried/3958197/", "content": "Health The month that has authorities worried by Shannon Molloy 3rd Mar 2020 10:38 AM 0 The risk of the deadly coronavirus spreading in Australia will increase over coming months as the mercury drops and instances of colds and flu spike, official modelling shows. West Australian Premier <mark>Mark McGowan</mark> has revealed that authorities are bracing for the worst, as the number of countries battling the virus passes 60 and the death toll hits 3000. \"The modelling indicates that potentially, in late April or May, there may be greater spread of the illness here in Australia, and at that point in time obviously we would need to ramp up some of our activities,\" Mr <mark>McGowan</mark> told reporters. \"The peak would then hit us in potentially August, which is obviously not a great month because our coldest months with the highest level of flu .\" The emergency response to the virus entered a worrying new phase yesterday, with confirmation of the first human-to-human infection. It's likely the government will enter an escalated phase of containment efforts in a bid to slow the spread. Australian chief medical officer Professor <mark>Brendan Murphy</mark> said an outbreak in Australia was likely inevitable, stating \"it's no longer possible to absolutely prevent new cases coming in\". Western Australia will host a meeting to assess its preparedness for a potential COVID-19 outbreak tomorrow, in the wake of the death of an elderly man in a Perth hospital. The 78-year-old contracted the virus while on board the Diamond Princess cruise ship with his wife and the pair was transported back to Australia for treatment. Sadly, he passed away yesterday. His wife, 79, remains in hospital in a stable condition. <mark>Andrew Miller</mark>, president of the WA branch of the Australian Medical Association, told the ABC that the death should be \"a wake-up call\". \"I guess we're used to being warned about things, and as Australians we tend to say,\" She'll be OK and it will work out on the day', but in this instance we really do need to take a call to prepare very seriously. \"Dr Miller likened the coronavirus to the deadly Spanish flu, a pandemic that killed 50 million people globally in the early part of the 20th Century .\" The truth is we probably haven't seen a virus like this one since 1918 with the Spanish flu, so I understand why it's been a little slow to get the wheels going, \"he said. Although, he said the focus should be on preparing - not panicking .\" It's not a time to panic. It's not a time to be moving to the hills. It is a time to be thinking about what will we do if this hits, how will it affect our life and what can we do to help others. \"A traveller from China at the International Airport in Brisbane. Picture: AAP Last week, Australia activated its emergency response plan for pandemics and the Commonwealth is working with states and territories to prepare for potential outbreaks. Professor Robert Booy from the National Centre for Immunisation Research and Surveillance told the ABC that Australia needed to focus on older people living in aged care and the elderly still living at home, as they were most at risk .\" People with chronic medical conditions of the lung or the heart also need to be closely monitored, \"he said. More than 87,000 people worldwide have been infected, with the virus appearing on every continent but Antarctica. More Stories Six coronavirus facts you need to know Queensland's 10th coronavirus case confirmed Aldi mums react to virus\" madness' premium_icon \"Non-urgent' medical care to be delayed due to coronavirus premium_icon Why fist bumps are becoming all the rage Indonesia confirms first coronavirus infection Show More More Stories Six coronavirus facts you need to know Queensland's 10th coronavirus case confirmed Aldi mums react to virus\" madness' premium_icon \"Non-urgent' medical care to be delayed due to coronavirus premium_icon Why fist bumps are becoming all the rage Indonesia confirms first coronavirus infection Show More 0 coronavirus Read More Login to follow covid-19 Read More Login to follow editors picks Read More Login to follow health Read More Login to follow outbreak Read More Login to follow coronavirus covid-19 editors picks health outbreak"}]