[{"articleID": "2011021819_00066948_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2011-02-18", "url": "http://blogs.sacbee.com/capitolalertlatest/2011/02/jerry-brown-orders-state-to-st.html", "content": "gov. <mark>jerry brown</mark> this morning ordered state agencies to stop buying key chains, coffee mugs and other swag, saying the state spent $7.5 million on such items from 2007 to 2010. \"not a cent of taxpayer money should be spent on flashlights, ashtrays or other unnecessary items, most of which likely end up in landfills,\" <mark>brown</mark> said in a prepared statement. \"every taxpayer dollar we save by cutting waste is a dollar than can be used to pay for critical public safety and social services.\" the order follows measures by the democratic governor to recall thousands of state-issued cell phones and to reduce the state vehicle fleet in california's budget crisis. he ordered a hiring freeze this week. <mark>brown</mark>, seeking to close a $26.6 billion budget deficit through cuts and tax extensions, faces a budget deadline next month. <mark>brown</mark> said in his order that state agencies spent $7.5 million on \"items including key chains, squeeze toys, pens, hats, trinkets, shirts, cups and other gift items known colloquially as's. w.a.g,' or\" stuff we all get .' \"<mark>brown</mark>'s office said the majority of spending on swag, $5.1 million, was by the business, transportation and housing agency."}, {"articleID": "2018032913_00107567_W", "names": {"Jack Montgomery": ["Q16234831", "Q6114173"], "Theresa May": ["Q264766", "Q30161835"]}, "date": "2018-03-29", "url": "http://www.breitbart.com/london/2018/03/29/australia-eu-customs-union-britain-irrelevant-humiliated-dependency/#disqus_thread", "content": "Australia: Staying in EU Customs Union Would Turn Britain into \"Irrelevant, Humiliated Dependency' Chris Ratcliffe/Getty Images by <mark>Jack Montgomery</mark> 29 Mar 2018 0 29 Mar, 201829 Mar, 2018 The Australian High Commissioner to the United Kingdom has warned that staying in the EU's Customs Union after Brexit would render Britain\" irrelevant \".\" For us in the outside world, Britain would become, at least in economic terms, irrelevant to international diplomacy, \"explained Alexander Downer.\" You would be better off remaining within the EU or being completely out of it in every way than leaving yourselves in such a position of weakness and irrelevancy. It would be humiliating for a once-great country to end up by being little more than a dependency of the European Union. \"Life outside the EU\" can be pretty good \"--Australian High Commissioner to the UK, @ AusHCUK tells #bbcsp https: //t.co/gRNMtrasXA--BBC Daily Politics and Sunday Politics (@ daily_politics) December 18, 2016 The High Commissioner--the Commonwealth equivalent of an ambassador--told the Policy Exchange think tank he was\" surprised that there is any debate at all \"about remaining in the Customs Union. Countries within the Customs Union and subject to the EU's Common Commerical Policy are cannot sign their own trade agreements, with trade policy being managed by Brussels. This has held Britain back from striking deals with its old allies in countries like Australia and New Zealand for decades, and saw Australian beef and New Zealand butter largely displaced by more expensive EU produce when the country first joined the EU, then known as the EEC, and began applying the bloc's external tariffs. This caused substantial damage to the diplomatic and economic relationship between the United Kingdom and its former colonies, and saw many of them reorient towards Asia. Brexit Boost: Australia Slams\" Hugely Damaging' EU Policies, Commits to Quick Deal with Britain https: //t.co/qdFCZKSji1--Breitbart London (@ BreitbartLondon) October 19, 2017 Mr. Downer has previously slammed the EU for its Common Agricultural Policy as well, describing it as \"hugely damaging to global agriculture\" and pointing out that it has done \"far more harm than good\" . Prospects for a swift trade agreement between Britain and Australia after Brexit--provided <mark>Theresa May</mark> does not leave Britain's trade policy in the hands of the European Union--are extremely bright. Australian trade minister Steve Ciob is keen to begin negotiations on \"day one\" of Brexit, with the aim of having a \"high-quality trade agreement ready to go essentially on January 1, 2021\" , when the mooted \"transition deal' between Britain and Brussels is supposed to expire. Follow <mark>Jack Montgomery</mark> on Twitter: @ JackBMontgomery Follow Breitbart London on Facebook: Breitbart London Read More Stories About:"}, {"articleID": "2017080722_00226609_W", "names": {"Tony Adams": ["Q299391", "Q4772792", "Q7821744", "Q7821745"], "Andy Johnson": ["Q276306", "Q3616274", "Q4760860", "Q4760862", "Q4760864"]}, "date": "2017-08-07", "url": "http://holmesdale.net/page.php?id=106&tid=167751", "content": "Crystal Palace FC Supporters' Website - The Holmesdale Online You are here: Home> Message Board> Palace Talk> This is a joke right??!! August 7 2017 11.12 pm Page 1 of 2 1 2> Last \"Palace Talk is sponsored by I just read that online to...I hope it's a joke...Its the daily star so don't know how trust worthy it is. Dan89 Se25 Today 10.41 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Dan89 Se25 Today 10.42 pm This post has been merged from a topic called \"<mark>Tony Adams</mark> Buys Crystal Palace (Daily Star)' by Guntrisoft Sorry didn't realise there was a thread - sorry mods Few more threads on this now! romford essex via another galaxy Today 10.44 pm It's in the daily star, a very crappy paper Originally posted by collier row eagle It's in the daily star, a very crappy paper 100% True. However, the wording of the article is very explicit - no\" talks are ongoing \"or\" expressed an interest \"or even\" about to start talks with CFPC2010 \". Blimey. He want player manager role <mark>Andy Johnson</mark> Magic, He wears a Magic HatWhen he Sees the match ball, he says he having thatHe scores one with left foot, he scores one with his rightAnd When his playing Brighton, He scores all f *** ING Night! laddo london Today 10.47 pm If so explains slow transfer dealings. As long as Parish is still on the board as chairman I'm ok with it. laddo\" People say, live fast, die young. I say live fast, die old. That's me, the non-conformist \". David Brent. Hevon Today 10.48 pm This post has been merged from a topic called\" <mark>Tony Adams</mark> £ 200m takeover' by Guntrisoft That valuation makes SPs original investment of £ 2.5 mill worth now £ 40mill. Not bad for seven years work. He'd be bonkers not to sell though obviously he won't \"if it's not right for the club\" "}, {"articleID": "2014071321_00062577_W", "names": {"Michael Lindsay": ["Q3856208", "Q6847677"], "John Rhodes": ["Q173566", "Q20830770", "Q21549083", "Q47545610", "Q48789261", "Q6254694", "Q6254696"]}, "date": "2014-07-13", "url": "http://blog.masslive.com/criesandwhispers/2014/07/westfields_lt_michael_ldeane_a.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to <mark>Michael</mark> L. Deane, a Westfield High School graduate was killed in Vietnam on May 24, 1968, at age 23. He was an Army lieutenant and graduate of St. Lawrence University. Westfield, is now remembered on the Vietnam Veterans Memorial Fund's Wall of Faces virtual gallery. The fund is seeking photographs of all of the nearly 58,000 soldiers killed in Vietnam whose names are commemorated on the national memorial wall in Washington, D.C. Deane's Westfield HIgh School graduation photograph was submitted by classmate and friend Rich Girard in response to a \"We played on the Westfield football team, and he was on full scholarship at St. Lawrence (University),\" Girard recalled. \"We both were in ROTC, and Mike went immediately into the Army.\" Added Girard, \"Mike was a very special person. He could have been governor or anything else he wanted.\" Within days of the column's publication, a number of readers, including some family members, wrote to say they remembered Deane well from growing up with him in Westfield. Said former Mayor <mark>Michael</mark> E. O'Connell, also a classmate, \"Lt. <mark>Michael Lindsay</mark> Deane was supposed to be the politician, not (former mayor <mark>John Rhodes</mark>) or me. He was half\" Frank the Tank' from (the movie) \"Old School' and half Kramer (from\" Seinfeld'), an extraordinary prankster. \"When the big stories break, we'll send you an alert. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 MassLive LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of MassLive LLC."}, {"articleID": "2014060822_00028924_W", "names": {"Bob Harrison": ["Q2329453", "Q2907695", "Q4932704", "Q4932705", "Q4932706"]}, "date": "2014-06-08", "url": "http://iol.co.za:80/news/world/remains-recovered-in-australia-croc-attack-1.1700228", "content": "Sydney - Human remains were recovered on Sunday in the hunt for a man snatched by a crocodile in front of terrified relatives on a boat trip in northern Australia. The man, 62, was taken from his boat on the South Alligator River in northern Australia's Kakadu national park late Saturday afternoon as his wife, son and daughter-in-law looked on. Northern Territory police sergeant Andrew Hocking said two large crocodiles were shot and cut open by search crews Sunday at the waterhole where the man was last seen. \"One of those crocs was later examined and a quantity of human remains was recovered,\" Hocking told reporters, adding that the creature had been 4.7 metres long. The remains were yet to be formally identified, but Hocking said the animal was recovered just 1.5 kilometres from the attack site. \"The difficulty in this location is getting in large boats, we're only able to bring in small boats. But using the expertise of the Territory Parks and Wildlife staff, they managed to help us bring it to a conclusion,\" he said. \"Thankfully this was carried out and (the remains) recovered very, very quickly.\" Crocodile expert Graeme Webb said it was unusual for a crocodile to attack at this time of the year, when Australia experiences cooler weather. \"I don't know what has happened in this case but it just sounds horrific. It's just awful, you just can't begin to understand how (the man's family) must feel.\" While the man's wife and daughter-in-law drove two hours to the nearest lodge to raise the alarm his son remained in the area searching for his father, which Superintendent <mark>Bob Harrison</mark> earlier described as \"obviously traumatising\" \"Anyone's heart would go out to the family in that sort of incident,\" <mark>Harrison</mark> told ABC radio. Crocodiles are a common feature of Australia's tropical north, and their numbers have increased steadily since the introduction of protection laws in 1971, with government estimates putting the population at 75 000 - 100 000. Saltwater crocs can grow up to seven metres long and weigh more than a tonne. Saturday's attack is Australia's first fatality since January, when a 12-year-old boy was taken by a crocodile in the Kakadu national park, a sprawling World Heritage-listed nature and cultural reserve in Australia's Top End. Another boy suffered bite wounds in that incident as he fought the crocodile off. According to the international CrocBITE database of attacks set up at Australia's Charles Darwin University last year, there have been 66 fatalities globally so far in 2014. comment guidelines. Login and register, if you haven' t already. Write your comment in the block below and click (Post As) Has a comment offended you? Hover your mouse over the comment and wait until a small triangle appears on the right-hand side. Click triangle (© Copyright 1999 - 2014 Independent Online, a division of Independent Newspapers (Pty) Limited. The copyright in the literary and artistic works contained in this online news publication and its other related and connected websites, as well as in the published editions of group newspapers, their supplements and any other content or material, belongs exclusively to Independent Newspapers (Pty) Limited unless otherwise stated."}, {"articleID": "2019102320_00088298_W", "names": {"Gail Miller": ["Q21176469", "Q5517132"], "Donovan Mitchell": ["Q30122104", "Q5296848"], "Tony Jones": ["Q1798305", "Q20710818", "Q22673586", "Q4160430", "Q53812649", "Q7822672", "Q7822675", "Q7822676", "Q7822677", "Q7822678", "Q7822679", "Q7822680"], "Ryan Miller": ["Q1521532", "Q24005534", "Q250011", "Q29998663", "Q3943079", "Q58227811", "Q7384338", "Q7384339"]}, "date": "2019-10-23", "url": "https://www.sltrib.com/sports/2019/10/23/weekly-run-newsletter/", "content": "The Weekly Run is The Salt Lake Tribune's weekly newsletter on the Utah Jazz. Subscribe here. There was a sense of anticipation Wednesday morning at the Zions Bank Basketball Campus, as the Jazz went through shootaround a few hours ahead of their regular-season opener against the Oklahoma City Thunder. After all the talk, the team is ready to get out there and see how they actually look in a game that matters. \"It's hard to gauge everything that you see in practice until you start playing games, whether it's preseason games or, obviously the regular season. First and foremost, we'll get a chance to see where we are,\" said coach Quin Snyder. \"...It's gotta be about the process of how we're coming together. Also, what's our level today?\" While opening nights are now old hat for veteran point guard Mike Conley, even he couldn't deny that the circumstances will make this one a bit unique and special. \"This is new--it's all new for me. It's my 13th year, but my first year outside of Memphis, so a whole new environment, new fans, new team. I'm just excited to get going,\" he said. He offered that the week of practices between the preseason finale and tonight's opener were devoted pretty much exclusively to defensive improvement, noting, \"I don't think we took any shots.\" He expects that as all the new players become increasingly familiar with both the concepts and each other, progress will come. That's what Snyder will be on the lookout for, as well, to determine how to proceed. \"There's a lot of analysis, and we don't want to overreact to a result, but also, there's nothing that you ignore,\" Snyder said. \"You go with the plan, and then you figure out when to implement and what to implement. If I see 10 things I'd like us to do better, we're not gonna fix 10 things in just a few days.\" In case you missed it First off, the important stuff: The Jazz will be making a \"major\" announcement Wednesday at 3:30. Owner <mark>Gail Miller</mark> will be joined by CEO Steve Starks, Gov. Gary Herbert, Salt Lake City Mayor Jackie Biskupski, and NBA commissioner Adam Silver. All signs point to Utah being awarded the 2023 NBA All-Star Game. Article continues below Related Article s This time it's for real: New-look Jazz open season against new-look Thunder at Vivint Arena <mark>Donovan Mitchell</mark> and other Jazz players lose some inches as official heights are released Jazz to make major announcement Wednesday afternoon; 2023 All-Star Game coming to Utah? Jazz renew 5 For The Fight jersey patch sponsorship; Joe Ingles gets one more year Beyond that interesting tidbit, there's been plenty of coverage leading up to Wednesday's season opener vs. the Thunder. For what it's worth, the team seemed pretty at ease in Tuesday's final practice. There's been no shortage of other news, either: <mark>Donovan Mitchell</mark>, among others, losing some height in the new official measurements; the renewal of the 5 for the Fight jersey patch sponsorship, and Joe Ingles getting a contract extension; and Quin Snyder getting a multiyear contract extension, too. Quin also gave a great interview explaining why the offense is so far ahead of the defense right now. Finally, we produced a special section in advance of the season. Among its contents: Asking if, in fact, the Jazz can compete for an NBA title; a player-by-player breakdown of the roster; a look at goings-on of the players who did not return from last season; a profile of general manager Justin Zanik by new Trib sports writer Julie Jag; a column from Gordon Monson examining the likelihood of the team's championship aspirations; a look at 10 key games on the schedule; an examination of the new backcourt pairing of <mark>Donovan Mitchell</mark> and Mike Conley; and a set of predictions about the best and worst of the coming season. Other people's stuff • John Hollinger of The Athletic (and formerly of the MemphisGrizzlies' front office) picks Jazz point guard Mike Conley as the \"captain\" of his \"2019-20 NBA All-Breakout Team.\" • Also from The Athletic, <mark>Tony Jones</mark> takes a look at <mark>Donovan Mitchell</mark> and asks if the third-year guard can make the leap to superstardom this coming season. • Jasen Lee of the Deseret News did a nice profile of reserve forward Georges Niang, and his journey from \"overweight\" freshman at Iowa State to rotation piece on an NBA team. • <mark>Ryan Miller</mark> of KSL went behind the scenes of the latest Vivint Smart Home television ad featuring Rudy Gobert and <mark>Donovan Mitchell</mark>. • Aaron Falk of utahjazz.com talked to several team members about the lackluster defensive showing from the preseason. The consensus? Not too worried. Up next The regular season begins tonight at Vivint Smart Home Arena against the Thunder. On Friday, the Jazz will their first road game of the season, heading out to Los Angeles to take on the Lakers. That game marks the front end of a back-to-back. The latter part comes Saturday in SLC against the Sacramento Kings. Then, on Monday, they're on the road again, taking on Ricky Rubio and the Phoenix Suns."}, {"articleID": "2018092411_00073998_W", "names": {"Ed Smith": ["Q1282498", "Q28935720", "Q5335419", "Q5335422", "Q5335423", "Q5335424", "Q5335426"]}, "date": "2018-09-24", "url": "https://www.cricket365.com/countries/englands-adil-rashid-agrees-all-format-deal-with-yorkshire/", "content": "cricket365 - September 24, 2018September 24, 2018 England spinner Adil Rashid on Monday agreed a new one-year all-format deal with his county, Yorrkshire. The new contract will see the 30-year-old make himself available for all forms of the game, continuing his 12-year affiliation with the White Rose county. Rashid, who made his first-class debut for Yorkshire in 2006, had initially signed a one-year contract at the start of the year so that he was only involved in one-day formats. But he was selected for England's recent home Test series against India, playing all five Tests in a 4-1 victory. He has also included for the tour to Sri Lanka in October and he will hope good form for Yorkshire can strengthen his claim for next summer's home Ashes. Yorkshire's Director of Cricket, Martyn Moxon, said: \"There's been a lot of talk and speculation but Adil is a very valuable cricketer for us.\" Now he's in the Test team, how much he'll be available for us next season is unclear. But when he is available we'd be delighted to have him and for him to be part of what would hopefully be a successful summer. \"For now, it will just be for a year because it's still not clear what career path he's going to take. He's back in the Test team and continues to do well, so we'll see where that takes us.\" Obviously going into 2020 and with the new competition, players are waiting to see how that will affect contracts. \"I think for now it's good to have the one year and see how the winter goes for Adil. We'll probably have another look at it after the World Cup and see where he is, particularly with England and how much he's involved with them.\" In the short-term it's good to know when he's available he'll be playing for us. \"Rashid has taken 500 first-class wickets at an average of 34.98. All of his 10 hundreds have come for the White Rose. The leg-spinner made his Test bow in 2015 on tour of the UAE against Pakistan and has made 15 appearances to date in te longest format. Rashid was recently told by England selector <mark>Ed Smith</mark> that he must be available across the board from the start of next summer to be considered for Test cricket. Moxon continued:\" It was a big surprise that he wanted to play white ball only and asked us for a white-ball only contract. That changed very quickly and unexpectedly so that created a bit of confusion and instability for a little while. \"But I think we've been clear from the outset that we wanted to keep Adil at the club. When it became known he had to have a red-ball contract, we were more than happy to put that in place.\" Speaking to Adil he's keen to stay here and has been here all his life. He's in no mood to change that. We're really pleased to keep him. \"We all know he's a matchwinner for us. Leg-spin bowlers, wrist-spin bowlers are vital part of the game and that's what we want from Adil, that potential to be a matchwinner for us in all formats.\" Share on Facebook Share Share on Twitter Tweet Send email Mail Countries County Cricket England News Top Story"}, {"articleID": "2019102315_00152167_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Greg Hill": ["Q11163426", "Q16729823", "Q19663103", "Q30612101", "Q5605708", "Q5605710"], "Alex Guerrero": ["Q15119311", "Q4717106", "Q56275288"]}, "date": "2019-10-23", "url": "http://www.bostonherald.com/2019/10/23/patriots-qb-tom-brady-on-retirement-speculation-i-dont-know-what-the-future-holds/", "content": "FOXBORO, MA .--OCTOBER 8: <mark>Tom Brady</mark> #12 of the New England Patriots speaks to reporters at Gillette Stadium on October 8, 2019 in Foxboro, Massachusetts. (Staff Photo By Matt Stone/MediaNews Group/Boston Herald) By Karen Guregian | karen.guregian @ bostonherald.com | Boston Herald PUBLISHED: October 23, 2019 at 9:10 am | UPDATED: October 23, 2019 at 9:28 am Talk of this being <mark>Tom Brady</mark>'s final season stirred Monday night with ESPN's Adam Schefter strongly hinting during the pregrame show the Patriots quarterback is \"setting it up to move on,\" although he wasn't sure what <mark>Brady</mark>'s plans were and what that meant down the road. In other words, that might mean retirement or playing for another team. Appearing on \"The <mark>Greg Hill</mark> Show\" Wednesday morning, <mark>Brady</mark> was asked for his thoughts on the retirement speculation surrounding him. He didn't exactly shoot down any of the talk. He said he was uncertain about his future. \"That is the great part for me, I don't know,\" <mark>Brady</mark> said. \"I think that has been a unique situation that I have been in because I think when you commit to a team for a certain amount of years you kind feel like (there is) the responsibility to always fulfill the contract. For me, it's been good because I am just taking it day-by-day and I am enjoying what I have. I don't know what the future holds and the great part is for me, football at this point is all borrowed time. I never expected to play 20 years and I am playing on a great team and it's just been an incredible 20 years of my life. To play for Mr. Kraft, and Jonathan and the Kraft family and for Coach Belichick and to have so much success is a dream come true.\" One day I will wake up and I will feel like, \"OK, that will be enough .' When that day comes, that day comes. I don't know if it will be after this year. I don't know if it will be five years from now. I don't have to determine those things right now, either. That is kind of a good part of where I am at. Just take advantage of the opportunities that I have this year and do the very best I can do and then those decisions come at probably more appropriate times.\" Both <mark>Brady</mark> along with personal trainer <mark>Alex Guerrero</mark> have put their homes on the market and he's in the last year of his contract. That's added to the speculation this could be <mark>Brady</mark>'s final year in New England, or final year, period. Sign up for email newsletters Subscribe Follow Us Facebook Twitter Instagram RSS"}, {"articleID": "2016050616_00137254_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2016-05-06", "url": "http://abc7.com/news/what-aprils-jobs-report-means-for-college-grads/1326670/", "content": "NEWS What April's Jobs Report Means for College Grads ABCNews SUSANNA KIM Friday, May 06, 2016 09:05 AM Hiring in the U.S. slowed last month as employers added significantly fewer jobs than expected in April, but college grads are still about to enter the best job market in a decade. Employers added only 160,000 jobs in April, lower than the 200,000 many economists had predicted. The unemployment rate held steady at 5 percent, the Labor Department said today. Over the past three months, job gains have averaged 200,000 per month, with April's gains the weakest since last September. The Labor Department also revised down its employment figures in February and March by a combined 19,000. While the report may worry some economists, college grads entering the labor force can still remain optimistic. The unemployment rate for college graduates ages 25 and over as of April was 2.4 percent, the lowest level since June 2008. \"This year's graduating college seniors aren't looking at the monthly numbers so much, or the story of the day,\" said Mark Hamrick, Bankrate.com senior economic analyst. The addition of an average of 224,000 jobs per month over the past year is \"far above\" what is needed to keep up with normal growth in the labor force, said Gus Faucher, PNC deputy chief economist. Wage growth is also picking up as the job market tightens, which means higher starting pay, he explained. Students graduating with degrees in science, technology, engineering or business, should fare even better in the job market, Hamrick said. Labor force participation in April edged down a bit to 62.8 percent. \"That's not what we want to see, but also not a huge surprise,\" Hamrick said. On the positive side, there was a modest rise in wage growth with average hourly earnings up 2.5 percent over the past year. \"That's not a jackpot for American workers, but it is progress,\" he said. PNC chief economist Stuart Hoffman pointed out that there has been noteworthy job increases in nearly every sector but energy-related ones. He is upbeat on graduates entering the financial services industries, such as accounting, as well as those with science and engineering degrees. \"If your major is engineering in mining, obviously it's not a good time, but still those skills are applicable in a lot of industries,\" Hoffman said. Health care fields are another bright spot for graduating seniors. \"Four or five yeas ago, that was really tough job market particularly for younger people out of school. It's a much more hospitable, but not to say easy job market for recent or soon-to-be graduates,\" Hoffman said. \"I wouldn't take the April jobs report to be a bummer.\" Hoffman also expects the number of job listings to reach a record high. He added, \"I would say for graduating college and technical high school seniors, this is a promising job market to get started on their career.\" Related Topics: news abc news national (Copyright & copy; 2016 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. NEWS Newt Gingrich's Most Out-of-This-World Ideas Afghan Commandos Rescue 60 Hostages Held By Taliban Suspect dead following barricade in South Gate garage ANALYSIS: <mark>Paul Ryan</mark> Battling Trump for Soul of GOP More News Top Stories Attempted murder suspect smoked out after hours-long 91 Fwy standoff Stretch of 5 Fwy to be renamed for slain Downey officer Man's body found inside burning Fullerton home Suspect dead following barricade in South Gate garage Many without services after Frontier Communications takes over Verizon landlines Residents discuss 91 Freeway expansion project in Corona Man charged with stabbing 2-year-old girl to death Show More US employers added 160K jobs in April Lonnie Franklin Jr. found guilty in \"Grim Sleeper' case Arsenio Hall suing Sinead O'Connor over claims he supplied drugs to Prince Tow truck driver refuses to help Bernie Sanders supporter Homeless crisis growing in Los Angeles County, data shows More News Photos PHOTOS: 2016 Met Gala red carpet fashion PHOTOS: Monuments light up in purple to honor Prince See photos of Queen Elizabeth through the years in honor of her 90th birthday PHOTOS: Opening Day means new food at Dodger Stadium More Photos"}, {"articleID": "2009091905_00031992_W", "names": {"William Davies": ["Q27915070", "Q46996248", "Q47238054", "Q54371178", "Q56598277", "Q56604657", "Q8007635", "Q8007643", "Q8007644", "Q8007645"], "Chris Collins": ["Q1077119", "Q21284804", "Q26935189", "Q27831017", "Q4228021", "Q50671707", "Q5106218", "Q5106219", "Q5106220", "Q5106221", "Q5106222", "Q5106223", "Q749772", "Q861156"]}, "date": "2009-09-19", "url": "http://star-telegram.com/metro_news/story/1622196.html", "content": "njones @ star-telegram.com fort worth - lawyers for texas motor speedway told a tarrant county jury on friday that no one could have imagined that a 12-year-old boy in a miniature race car would speed erratically through a parking lot before striking an 11-year-old teammate, leaving him permanently disabled. entrances and exits to the track were clearly marked, and before children could get behind the wheel, parents had watch an instructional video on vehicle and track safety with them and sign releases, attorneys said. \"this is a professionally designed track,\" said reagan simpson, an attorney representing tms. \"there are many safety mechanisms on the car and barriers surrounding the track to protect people.\" the parents of ryan davies, the boy who was struck in october 2006, have sued the speedway, and tms filed a third-party suit against the family of the young driver. the jury is to determine who is responsible for ryan's injuries and how much should be paid in damages. friday's closing arguments ended two weeks of testimony in judge dana womack's 348th district court. jurors began deliberating about 1 p.m. and stopped for the weekend at 4:30 p.m. deliberations are scheduled to resume at 8:30 a.m. monday. tms' lone star legends attraction operates at lil' texas motor speedway, a paved fifth-mile track. it offers driving schools and events for amateur adult drivers and children as young as 8. ryan and his flower mound volunteers baseball team were there on oct. 20, 2006, to celebrate the end of their season. each team member got to drive a few laps on the asphalt track in a 500-pound bandolero, a miniature race car. ryan, who had already taken his turn, was tossing a football in a parking lot when a teammate driving toward the track lost control of the vehicle and struck ryan. ryan's parents, karen zina and <mark>william davies</mark>, contend that tms officials didn't take the extra precautions that would have prevented the collision. track operators could have provided extra barricades, signs and a \"kill-switch\" on the car, the parents' attorneys contended in court. \"how could they not foresee that a car would go out of control,\" said the davieses' attorney, <mark>chris collins</mark>. \"these are kids, it's dangerous, and they knew it.\" tms' suit against the car driver and his parents, angela and richard kenyon, contends that they were responsible because they knew that their son had a \"mental and/or emotional condition\" that made him \"incompetent\" to drive the race car. richard kenyon testified that his son was diagnosed with \"pervasive development disorder,\" a broad-spectrum disorder that doctors likened to mild forms of asperger's syndrome or autism. \"we heard testimony that he had a very low tolerance for stress,\" melinda burke, a tms attorney, said in her closing. \"the family had a wealth of information.\" a neuropsychologist and a counselor testified the kenyons' son had some problems with fine motor skills, academics and anger but nothing that restricted his activities, including athletics, in which he excelled."}]