[{"articleID": "2017030711_00729105_W", "names": {"Paul Weller": ["Q371986", "Q7154286", "Q7154289"], "Paul Atkinson": ["Q38545438", "Q57687338", "Q7149127", "Q7149129"], "Chris White": ["Q1077846", "Q19560238", "Q264420", "Q2964892", "Q2964894", "Q42434048", "Q5108458", "Q5108459", "Q5108461", "Q5108462", "Q5108463", "Q5108464", "Q56422264", "Q727678"]}, "date": "2017-03-07", "url": "http://www.mojo4music.com/25239/zombies-odessey-and-oracle-returns/", "content": "THE LATEST VOLUME of MOJO ’60s, MOJO's decade-specific sister magazine, features a brand new catch-up with ’60s cult heroes The Zombies. MOJO ’60s Volume 9, featuring The Zombies, Keith Moon and more. The venerable group, still led by original undead Colin Blunstone and Rod Argent, are set to tour the US later this month, and are also due to play their classic Odessey And Oracle album in its entirety at the prestigious London Palladium on September 29. \"I'm mystified that people are still discovering the record,\" says Blunstone, speaking to Lois Wilson in MOJO ’60s Volume 9. \"I can only explain the renewed interest through word of mouth. Musicians like <mark>Paul Weller</mark> and Dave Grohl often say how much they like the album and that has led to its reassessment and helped introduce it to new generations.\" Odessey And Oracle occupies an exceptional place in the rock canon. Widely proclaimed a work of genius comparable with The Beach Boys' Pet Sounds and The Beatles' Sgt. Pepper, it is also, simultaneously somehow, a well-kept secret. In many respects, this dichotomy is symptomatic of the position in which the band found themselves back in early 1968 just prior to the album's release. Formed in St Albans, Hertfordshire, in the early ’60s, The Zombies arrived in the disguise of a typical beat group of the time. Their debut single, She's Not There (released in August 1964), provided them with a Top 20 UK hit and peaked at Number 2 in the US, the track characterised by Colin Blunstone's winsome vocal and composer Rod Argent's electric piano. In terms of commercial pop success, they never bettered it. However, by 1967 The Zombies' sound had grown more sophisticated and they'd signed to CBS, beginning work on a more ambitious second album. Their budget was modest--a mere £ 1000, with sessions beginning in June and using downtime at Abbey Road and Olympic Studios. However, by the time Odessey And Oracle emerged in April' 68, the five-piece of Blunstone, Argent, <mark>Paul Atkinson</mark> (guitar), <mark>Chris White</mark> (bass) and Hugh Grundy (drums) had effectively split. The failure of two singles prior to the album's release--Friends Of Mine (October' 67) and Care Of Cell 44 (released November' 67)--contributed to their disillusionment with the industry, exacerbating internal tensions over the band's musical direction. Since then Odessey's reputation has grown amongst connoisseurs and, to a degree, mainstream audiences. The album was afforded further exposure when, from the late ’90s onwards, key track Time Of The Season was used in a string of TV commercials to sell goods as diverse as women's hygiene products, soft drinks and cider. In addition to their appearance in MOJO ’60s, the group and their masterpiece album are documented in a brand new book entitled The Odessey: The Zombies In Words And Images which is published by Reel Art Press/BMG Books. The band's touring plans can be found at their website www.thezombiesmusic.com. MOJO ’60s Volume 9, featuring The Zombies, Keith Moon, The Doors, Dusty Springfield, The Temptations, The Bonzo Dog Doo-Dah Band, Zappa and Beefheart posters, and more, is in UK shops now. Or you can have a copy sent straight to your home."}, {"articleID": "2011082513_00056069_W", "names": {"J. Cole": ["Q204018", "Q56604513", "Q6105158"]}, "date": "2011-08-25", "url": "http://celebuzz.com/2011-08-25/rihanna-chalks-up-sex-tape-rumor-to-slow-news-day/", "content": "riri's stunning body in skimpy white bikini. rihanna's good time! the \"s & m\" singer dazzled in a floor-length dress as she hung out with her gal pals wednesday night in portofino, italy. meanwhile back in the states, rumors have been swirling that there's a sex tape out there that stars riri and <mark>j. cole</mark>. the pop star light heartedly responded to the reports via twitter, writing: \"we don't believe u, u need more people? and of course an actual sextape! #slownewsday\" 9 photos? be sure to follow celebuzz on for more celebrity news, vids and pics! ashton kutcher gears up for battle, reveals tidbits from \"two and a half men' (video) ponytail style showdown: nicole richie vs. kelly osbourne (photos)"}, {"articleID": "2015120319_00185772_W", "names": {"Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}, "date": "2015-12-03", "url": "http://www.usatoday.com/story/life/music/2015/12/03/coldplay-a-head-full-of-dreams-album-of-the-week/76565784/", "content": "Coldplay's seventh album,' A Head Full Of Dreams,' arrives Friday. (Photo: None) CONNECT TWEET LINKEDIN EMAILMORE \"Conscious uncoupling\" doesn't always spell trouble. After Coldplay frontman <mark>Chris Martin</mark> and now-ex-wife Gwyneth Paltrow announced their split in March 2014, the British band released its sullen Ghost Stories just two months later: a sparse, muted breakup album which they didn't support on tour and was generally dismissed as a forgettable, phoned-in effort. USA TODAY \"Head Full of Dreams' finds Coldplay in a happy place But more than a year and a couple famous girlfriends (Jennifer Lawrence, Annabelle Wallis) later, <mark>Martin</mark> sounds reinvigorated and ready to move forward. On seventh (and possibly final) album A Head Full of Dreams, the wistful rockers are sonically adventurous and optimistic, even while occasionally offering more of the same. Dreams (*** out of four) starts with the euphoric title track, as <mark>Martin</mark> sings about his flights of fancy over a bright, throttling rush of drums and guitar. Birds is similarly urgent and uplifting in its lofty ambitions of escape and one day\" flying free, \"and like Dreams, could have fit right in on Coldplay's full-bore pop album Mylo Xyloto in 2011. But where the album truly takes off is on Beyoncé collaboration Hymn for the Weekend: a blistering duet on which she and <mark>Martin</mark> trade verses about feeling drunk and high on love over producer Stargate's lurching, vibrant beat. More than any Dreams cut, Hymn is poised to be a Top 40 staple next year and deservedly so. While the album's jaunty mood signals a new beginning for <mark>Martin</mark>, Paltrow's presence is felt in more ways than one. For starters, the actress/singer's faint vocals are heard on piano ballad Everglow, in which he sings that\" you're with me wherever I go. \"<mark>Martin</mark> is more blunt about their 10-year relationship on the Tove Lo-assisted Fun, saying that although it's over and done,\" don't say it was all a waste / didn't we have fun? \"Other lyrics will surely be picked over as fans scour for clues into the couple's demise (most intriguingly:\" I know it's over before she says / Now someone else has taken your place \"). Coldplay's <mark>Chris Martin</mark> performs during the American Music Awards late last month. (Photo: Getty Images) If Paltrow's cameo is slightly awkward, it at least shows that <mark>Martin</mark> has made peace as he moves into the next stage of his life. It's a point he drives home in the album's more overwrought second half through songs such as Amazing Day, Up & Up and Army of One, which brim with as many positive platitudes as their titles suggest (although Army's hip-hop leanings make it Dreams' most curiously enjoyable oddity). Perhaps the most telling song is not <mark>Martin</mark>'s at all, but a piano interlude called Kaleidoscope, which excerpts poem The Guest House by the philosopher Rumi. Suggesting that one must welcome joy, depression and meanness, and\" be grateful for whoever comes, \"the two-minute inclusion encapsulates <mark>Martin</mark>'s current zen, and sets the stage for his future creative endeavors, whether he's joined by his band or not. Download: Hymn for the Weekend, Fun, Army of One CONNECT TWEET LINKEDIN EMAILMORE Read or Share this story: http: //usat.ly/1Qi629H"}, {"articleID": "2008121606_00028050_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"], "Oliver Bell": ["Q16320541", "Q27929714", "Q57321405"]}, "date": "2008-12-16", "url": "http://chron.com/disp/story.mpl/metropolitan/6166726.html", "content": "attempt to keep inmates from using smuggled devices could violate law, ag tells officials austin - state prison officials, looking for ways to stop contraband cell phones from landing in the hands of inmates, had planned thursday to take a look at the latest technology: phone jamming. but the demonstration was summarily canceled monday after texas attorney general <mark>greg abbott</mark> told them it could violate a 1934 federal law prohibiting states from interfering with federal airways. the law has been a sticking point as prison officials and lawmakers deal with an epidemic of smuggled cell phones into prison units, including death row. \"at every turn, we have attempted to identify a legal way to perform this test so that we could move forward,\" said <mark>oliver bell</mark>, chairman of the texas board of criminal justice, which oversees the prison system. \"i cannot, in good faith, violate the law in front of our nearly 38,000 employees and then demand they violate no law under threat of prosecution.\" the decision disappointed sen. john whitmire, d-houston, who received threatening calls from a death row inmate on a smuggled cell phone. those calls prompted a systemwide sweep that uncovered hundreds of the devices, including 18 on death row. other states have been struggling with the issue, and prison officials in south carolina demonstrated the jamming technology last month. \"i do question why they changed their mind,\" said whitmire. \"the federal statute should not be a roadblock. they did it in south carolina, and there were no repercussions.\" cellantenna corp. of coral springs, fla., conducted the presentation in south carolina and was scheduled to do the same in austin this week. howard melamed, ceo of the company, said he doesn't believe there were any legal issues because the company was not marketing or selling its equipment to texas. the company wanted to show technology could be safely confined to the lockup and wouldn't affect emergency calls and police radios, melamed said. he said officials from several other states had planned to attend the demonstration, which cellantenna was doing at no charge to the state. brad livingston, executive director of the criminal justice department, said the jamming technology would be a valuable tool in controlling illegal cell phones brought into prisons. the department is working with gov. rick perry, members of congress and the federal communications commission to have the law changed, he said. meanwhile, prison officials are seeking nearly $66 million for new security equipment to rid prisons of cell phones and other contraband. readers are solely responsible for the content of the comments they post here. comments are subject to the site 's"}, {"articleID": "2010030814_00223275_W", "names": {"Matt Harrington": ["Q21285192", "Q6788766"]}, "date": "2010-03-08", "url": "http://oxfordmail.co.uk/news/5047708.Takeover_leads_way_for_expansion/?ref=rss", "content": "comments (0) a company which specialises in running innovation centres is set for nationwide expansion after a major takeover deal. sqw, which owns oxford innovation, has bought regional technology park operator fasset for an undisclosed sum. as part of the deal the number of innovation centres run by sqw, based at mill street, oxford, will increase from 12 to 14, with plans to develop the network across the country as a team of senior managers from fasset transfer to oxford innovation. sqw group chairman ian laing said: \"the deal will allow oxford innovation to scale up its existing network of innovation and enterprise centres while also developing to include business centres and managed workspace in future.\" chris allington, formerly managing director for business development at fasset, becomes managing director of the oxford innovation centres business and a member of sqw group's executive board. <mark>matt harrington</mark> joins as commercial director and dianne heath joins as programme manager. find jobs in oxford, banbury and oxfordshire dating make a date in oxfordshire and find friendship find homes in oxford, banbury and oxfordshire"}, {"articleID": "2010122016_00171423_W", "names": {"Jorge Cordero": ["Q16567841", "Q24263753"], "Erik Morales": ["Q17302890", "Q26914130", "Q557887"]}, "date": "2010-12-20", "url": "http://philboxing.com/news/story-48956.html", "content": "philboxing.com tue, 21 dec 2010 dulorme (l) and sanchez. morovis, puerto rico - undefeated prospect thomas dulorme (8-0, 7ko's) stopped jos? ram? n s? nchez in the second round of their fight. \"joseph showed resistance in the first round, but i was able to find a way to get to him and achieved victory by knockout. i feel good and i'm positive,\" dulorme said. the next fight for dulorme is scheduled for friday, february 18 at coliseo juan \"pach? n\" vicens in ponce. in addition, puerto rican boxer marcos \"el tigre\" jimenez scored a tko victory at a minute and 39 seconds of the first round againt ricardo blackman. \"in recent months i've been working new techniques in the gym and used them on blackman. i want to return to the ring as soon as possible in 2011 and fight for a world title,\" said jimenez. his next fight is to be confirmed. carlos valcarcel, in a show of force and grace, won by unanimous decision, but not before <mark>jorge cordero</mark> went down twice in the final round. the dynamic duo of morovis, miguel marrero and carlos narvaez, achieved success in their debuts by grabbing first round knockout wins. \"i am grateful for the opportunity to debut before my people. it is a dream come true,\" said narvaez. marrero said, \"i am very happy to debut before the people who saw me grow.\" in addition, rookie <mark>jorge</mark> maisonet (1-0 1ko's) knocked out emanuel samuel hernandez in 19 seconds of the first. meanwhile, jos? valderrama (2-1-0, 2ko's) knocked out elvin gonzalez in the first. emanuel gonzalez (7-0, 6ko's) won via majority decision over pedro salcedo. click here to view a list of other articles written by bantigue tko's ikehara in japan! by salven l. lagumbay, mon, 20 dec 2010 by rene bonsubre, jr., mon, 20 dec 2010 by ronnie nathanielsz, mon, 20 dec 2010 by ronnie nathanielsz, mon, 20 dec 2010 nervous indonesian coach relieved after win over the philippines by ronnie nathanielsz, mon, 20 dec 2010 by ronnie nathanielsz, mon, 20 dec 2010 by ronnie nathanielsz, mon, 20 dec 2010 by rene bonsubre, jr., mon, 20 dec 2010 roach supports mosley fight says pacquiao has a few years left in him by ronnie nathanielsz, mon, 20 dec 2010 indonesia enters finals with 1-0 win in second leg by ronnie nathanielsz, mon, 20 dec 2010 by ronnie nathanielsz, sun, 19 dec 2010 by ronnie nathanielsz, sun, 19 dec 2010 indonesia still committed to attack by ronnie nathanielsz, sun, 19 dec 2010 vote in world boxing council 2010 award nominations; pacquiao nominated boxer of the decade <mark>erik morales</mark> wins by dong secuya, sun, 19 dec 2010 for mosley fight, roach wants six weeks training for pacquiao in the u.s. paul upham's new book \"undisputed: a golden era in australian boxing\" now on sale! hopkins versus pascal: history making or a passing of the torch?"}, {"articleID": "2019081922_00203848_W", "names": {"John Harrington": ["Q6237901", "Q6237905", "Q6237907", "Q963654"]}, "date": "2019-08-17", "url": "https://www.duluthnewstribune.com/sports/hockey/4620136-Gophers-Mavericks-womens-hockey-teams-to-meet-in-USHHF-game", "content": "Hockey Gophers, Mavericks women's hockey teams to meet in USHHF game The annual college women's hockey game to raise awareness of the United States Hockey Hall of Fame will feature Minnesota vs. Minnesota State Mankato and will be played in Prior Lake, Minn., in December. Written By: Jess Myers | Aug 19th 2019 - 4pm. Gophers women's hockey coach Brad Frost. (St. Paul Pioneer Press file photo) MINNEAPOLIS--Since they skated to 1-1 tie in Minneapolis on Nov. 14, 2009, the Minnesota Gophers women's hockey team has a winning streak of more than 40 consecutive games over in-state rival Minnesota State Mankato in the past decade. But the Mavericks will get a shot at stopping the slide in a unique setting this season. On Dec. 7, the Gophers and Mavericks will meet in the annual U.S. Hockey Hall of Fame Museum Women's Face-Off Classic, to be played at the at the Dakotah! Ice Center in Prior Lake, Minn. \"We are thrilled to once again be playing in the Hall of Fame game versus Minnesota State Mankato,\" said Gophers coach Brad Frost in a statement. \"We know the atmosphere will be great as Division I women's hockey comes to a community arena in Prior Lake.\" The game raises awareness of the U.S. Hockey Hall of Fame Museum in Eveleth, Minn., along with bringing women's Division I hockey to a local community. Last season, the event was held in Brainerd, Minn., with St. Cloud State beating Bemidji State, 3-0. In addition to the college game in Prior Lake, there will be a girls high school game between Prior Lake and Rosemount, and a girls 12UA & 12UB tournament. Game proceeds will go to the Community Action Partnership of Scott, Carver & Dakota counties plus the Greater Mankato Area United Way. The Gophers won the WCHA last season and advanced to the NCAA title game, falling to archrival Wisconsin there, and finishing with a 32-6-1 overall record. The Mavericks, in former Olympian <mark>John Harrington</mark>'s fourth season as their coach, were 9-19-7 overall. Dakotah! Ice Center is the home of Prior Lake/Savage youth hockey and is located adjacent to Mystic Lake Casino and Hotel. Additional event details will be announced in coming months. 1 / 2 <mark>John Harrington</mark>. (Courtesy of Minnesota State Mankato) Related Topics"}, {"articleID": "2010011910_00121625_W", "names": {"Jim Young": ["Q55436204", "Q6199064", "Q6199066", "Q6199069"], "Tom Adams": ["Q11296399", "Q16197244", "Q18394630", "Q25189667", "Q7814740"]}, "date": "2010-01-19", "url": "http://fifetoday.co.uk/east-fife-mail-news/Levenmouth--Fury-at-shopkeepers39.5975003.jp", "content": "\"daylight robbery.\" that was the reaction from buckhaven, methil and wemyss councillor <mark>jim young</mark> towards shops across fife cashing in on the freezing temperatures by selling tiny bags of grit to desperate customers for £ 1. the grit which is made up of crushed brown and pink rock salt appeared in shops throughout the kingdom including in leven and methil last week coinciding with fife council temporarily running out of its own supplies. the bags are marked up by six advertisement times their original price but some residents have purchased them feeling they have no choice in order to grit their paths and to help dig their cars out. angry at the morality of shopowners selling such small bags to members of their own communities, cllr <mark>young</mark> said: \"it's diabolical.\" i weighed one of the bags on my kitchen scales and it only came to 1kg. \"it's no heavier than a bag of sugar and would not even fill an old fireside shovel - there is hardly enough in it to grit your own path.\" originally concerned the bags may be illegally made up of grit from fife council's yellow bins which are situated on some street corners the councillor contacted the police who told him they had checked with one shopowner who had receipts showing he purchased grit in bulk from an online supplier. cllr <mark>young</mark> continued: \"they may be selling it legitimately but it's obscene.\" i looked online and bags of 1000kg are on sale for £ 155 plus vat; all they are doing is breaking these up into small bags. \"i can see where shops want to make a profit but to mark it up by so much is not on.\" a lot of older people will be going into these shops and buying it for their paths when, hopefully, soon enough fife council will have restocked the bins. \"cllr <mark>young</mark> added he walked around levenmouth with cllr <mark>tom adams</mark> on new years day and both were\" appalled \"at the lack of gritting that had been carried out. cllr <mark>adams</mark> called for an explanation. he said:\" it just isn't good enough to say that it is all down to a bad winter. \"services need to get a bit of joined up working.\" i witnessed a lorry putting grit down on a main road only for a road sweeper to come in the other direction and sweep it up. \""}, {"articleID": "2019090305_00220905_W", "names": {"Paul Weston": ["Q16189565", "Q16751402"], "David Fifita": ["Q16232568", "Q55609104"], "Josh Jackson": ["Q19757619", "Q3185977", "Q39075458", "Q44749654", "Q6289014"], "Jordan Mclean": ["Q16234016", "Q1703633"]}, "date": "2019-09-03", "url": "http://www.news-mail.com.au/news/meningas-titans-christmas-shopping-list/3821606/", "content": "Mal Meninga has his sights set on signing new talent. Rugby League Meninga's Titans Christmas shopping list by <mark>Paul Weston</mark> 3rd Sep 2019 3:35 PM premium_icon Subscriber only 0 MAL Meninga says the Titans will go shopping for new players as soon as the November 1 deadline when clubs can table offers to off-contract players. Their hit list includes Bronco sensation <mark>David Fifita</mark>. The Titans head of performance and culture said the season may finish on Saturday night with the final home against the Dragons but the hard work begins on Monday morning. \"The focus of the players and coaches may not extend much further than Saturday night, but for us working behind the scenes at the club, the view is a little further afield. November 1, to be precise,\" Meninga told members. \"Much has been made of the fact that the Titans have Jai Arrow and AJ Brimson off-contract at the end of 2020 - and therefore, both players are able to be approached by rival clubs from November 1.\" But it seems to have been forgotten there are 15 other NRL clubs with talented players able to negotiate in the first week of November. And there are some that we are very, very interested in having a chat with. \"Meninga says the Titans have 14 players - including Arrow and Brimson - coming off contract at the end of 2020.\" Will all 14 of those players be at the Titans in 2021? Realistically, the answer is no. . But that means we will have the money and roster places available to chase players that we want to be here, \"he said. Titans Football Director Mal Meninga--season 2019 a tough one. (AAP Image/Dave Hunt) Meninga is acutely aware of the rosters of rival teams.\" Brisbane have 12 players off contract, Canberra have 15, South Sydney have 9, the Roosters have 11, and the Melbourne Storm have 21 players able to negotiate on November 1, \"he told members, in his regular club column.\" It is a buyer's market, and we are keen to go shopping. We will apply our new recruitment criteria in assessing the credentials of players we are interested in. \"Are they from the Gold Coast? Are they the right character to be Titans? Can they improve us as a club on and off the field with the standards they expect from themselves and demand from others?\" Plenty fit that criteria. Will we be talking to <mark>David Fifita</mark> about returning to the Gold Coast? Where he went to school at Palm Beach Currumbin High School. Of course we will. <mark>David Fifita</mark>, the Broncos boom forward--on the Titans shopping list. (AAP Image/Dave Hunt) \"What about his Broncos teammate Thomas Flegler, who could follow Jai Arrow's path to State of Origin by becoming a senior player at the Titans. Absolutely.\" Canberra's Charnze Nicoll-Klokstad. <mark>Josh Jackson</mark> and Dallin Watene-Zelezniak from the Dogs. \"Felise Kaufusi and Ryan Papenhuyzen at Melbourne. Kyle Feldt and <mark>Jordan McLean</mark> at the Cowboys. We would be keen to have a chat with all of them.\" Thomas Flegler--the young Bronco is on the Titans shopping list. (AAP Image/Darren England) While many Titans fans have vented their frustrations on social media, Meninga has defended the club's decision to let Arrow's manager go to the open market before November 1 saying it was \"commonsense\" . \"We have made it clear that Jai is seen as a player this club can build around for the years ahead. He is undoubtedly a future leader of the Titans,\" Meninga said. \"But if, despite our best efforts, Jai's manager should decide his client's future is away from the Gold Coast, we can begin the difficult task to try to replace him.\" <mark>Jordan McLean</mark> of the Cowboys--also on the Titans shopping list. (AAP Image/Michael Chambers) Meninga in his final words to fans for season 2019 asked them to \"stick solid\" because the club was \"going in the right direction\" and better days were ahead. \"It is doubly-hard to take with people outside of the club putting the boot in to the Titans, and accusing you - our fans - of not caring about the club enough to see it survive.\" We are building something special here and we want you to be a part of it, \"he said. More Stories $3m star's reveal is a problem for Titans premium_icon Monday Buzz: Simple solution for a second Brisbane NRL team premium_icon Final round: How will the NRL top eight finish up? More Stories $3m star's reveal is a problem for Titans premium_icon Monday Buzz: Simple solution for a second Brisbane NRL team premium_icon Final round: How will the NRL top eight finish up? 0 <mark>david fifita</mark> Read More Login to follow gold coast titans Read More Login to follow mal meninga Read More Login to follow nrl Read More Login to follow rugby league Read More Login to follow <mark>david fifita</mark> gold coast titans mal meninga nrl rugby league"}, {"articleID": "2012070105_00024294_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"], "John Dickinson": ["Q1101262", "Q29642559", "Q6229390"]}, "date": "2012-06-28", "url": "http://timesdaily.com/stories/America-Independent-entrepreneurial,192214", "content": "the first plantagenet king of england, henry ii, is important to contemporary small business owners because he founded the legal system that paved the way for modern entrepreneurship. ambitious and intelligent, henry's consolidation of the 12th century british isles under his rule created the need for order. while his reforms were more for his political expediency than to empower the people, they actually gave birth to the english common law, which replaced feudal practices such as trial by ordeal. six centuries after henry's death, the tide of freedoms and property rights that evolved from his reforms washed up on the other side of the atlantic. in the colonies, a group of malcontents - america's founders - created and fought for a new interpretation of henry's legacy, which is to say, sans kings. in \"the fortune of the republic,\" ralph waldo emerson wrote, \"we began with freedom. america was opened after the feudal mischief was spent. no inquisitions here, no kings...\"in\" origins of the bill of rights, \"leonard w. levy wrote,\" freedom was a product of new world conditions. \"those conditions, as <mark>thomas jefferson</mark> so artfully wrote in the declaration of independence, were,\" ? life, liberty and the pursuit of happiness. \"these were 18th century words for freedom and embryonic conditions for which the 56 signers of <mark>jefferson</mark>'s document put their lives and liberties at risk on july 4, 1776. but america's founding documents weren't perfected until they perpetuated rights that were, as <mark>john dickinson</mark> declared a decade earlier in 1766,\" ...born with us, exists with us and cannot be taken from us by any human without taking our lives. \"by definition entrepreneurs take risks. but only freedom to enjoy success makes risks acceptable. thank you, henry ii. research shows a direct connection between entrepreneurship and economic growth. and the american experiment has demonstrated that a robust entrepreneurship fosters national economic well-being. thank you, founders. without their vision, courage and sacrifice entrepreneurship as we know it would not exist today. and if capitalism is the economic lever of democracy, entrepreneurship renews the strength and reliability of that lever for each generation. we began with freedom: freedom to dream and to try; to succeed and to fail; to own and to enjoy; to accumulate and to pass on to the next generation. we began with freedom and entrepreneurship was born. we began with freedom and capitalism was made to flourish. write this on a rock: america began with freedom. happy independence day."}]