[{"articleID": "2017090616_00644774_W", "names": {"Don Mattingly": ["Q19843097", "Q679120"]}, "date": "2017-09-06", "url": "http://www.foxsports.com/florida/story/washington-nationals-at-miami-marlins-preview-wednesday-september-6-090617", "content": "CAN'T GET TO A TV? WATCH IT LIVE ON FOX SPORTS GO MIAMI--Miami Marlins players and coaches this week are no doubt mixing some weather reports in with their scouting reports. Fortunately for the Marlins (67-71), they hit the road after the series finale against the Washington Nationals (84-54) on Wednesday. That flight out of town will help the Marlins avoid the expected effects of Hurricane Irma, which is supposed to strike the Miami area by Sunday morning. Marlins manager <mark>Don Mattingly</mark> said he is grateful team owner Jeffrey Loria is picking up the tab to take families of players and coaches on their upcoming seven-day road trip, including four games at Atlanta and three at Philadelphia. Watch the Miami Marlins on FOX Sports Florida Marlins Clubhouse \"(The Marlins) are providing a service for our families,\" <mark>Mattingly</mark> said. \"I think it's really nice for the organization.\" Before the Marlins can bolt out of town, they have to conclude the three-game set against Washington. Miami lost 2-1 on Tuesday and could get swept Wednesday. In search of the sweep, the Nationals will throw left-hander Gio Gonzalez (13-6, 2.58 ERA) against Marlins rookie lefty Dillon Peters (0-0, 0.00). Gonzalez, who is from Miami Dade County, is 3-0 with a 1.29 ERA against the Marlins this year. For his career, he is 9-3 with a 1.94 ERA in 15 career starts against the Marlins. At Marlins Park, he is 3-2 with a 3.29 ERA. The last time he was here, he nearly threw a no-hitter on July 31, settling for a 1-0 victory, allowing one hit in eight-plus innings. Peters tossed seven scoreless innings in his major league debut Friday against the Phillies. The Nationals won't have Bryce Harper available Wednesday, but the star right fielder played catch Tuesday for the first time since injuring his left knee Aug. 12. \"It's encouraging,\" said Nationals manager Dusty Baker, who is using Jayson Werth in right field in place of Harper. \"When you see him doing light baseball activities, you know he is on his way.\" Nobody can predict where he is (in terms of the rate of his recovery), but be at least initiated signs of progress. \"Harper has yet to swing a bat, however, and the first-place Nationals are hoping there is enough time on the schedule to get him back in time for the playoffs.\" At some point, we're going to need \"Harp',\" Baker said. \"They say injuries are no excuse, and they aren't, but it depends on who is hurt.\" The Marlins, who seemed to a viable playoff contender 10 days ago, have fallen to the fringes of the wild-card race after losing eight of their past nine games. Even so, there are some Marlins players worth watching, including Giancarlo Stanton, who leads the majors with 53 homers, and Marcell Ozuna, who is enjoying a breakout year with 32 homers and 107 RBIs. <mark>Mattingly</mark>, though, is not as interested in talking about anything except team goals. \"Teams in pennant races are the most interesting to watch--at least for me,\" he said. \"Individual stuff gets pushed to the side.\" <mark>Mattingly</mark> also said he likes the expanded playoffs, with a second wild-card berth now available. \"It gets more teams involved,\" he said. \"It makes things exciting down the stretch.\" "}, {"articleID": "2016072203_00105909_W", "names": {"David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"], "Robert Deutsch": ["Q23761554", "Q28971235"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-22", "url": "http://11alive.com/news/politics/national-politics/trump-declares-himself-voice-of-the-people/279383673", "content": "Trump declares himself \"voice' of the people <mark>David Jackson</mark>, USA TODAY, WUSA11:05 PM. EDT July 21, 2016Donald Trump delivers his acceptance speech for the GOP nomination during the Republican National Convention on July 21, 2016. (Photo: <mark>Robert Deutsch</mark>, USA TODAY) CONNECTTWEETLINKEDINGOOGLE+PINTEREST CLEVELAND--Completing his historic drive to the Republican presidential nomination, <mark>Donald Trump</mark> told a divided Republican Party Thursday he will be the\" voice \"for frustrated Americans who have been let down by government and the\" elites \"who run it.\" So to every parent who dreams for their child, and every child who dreams for their future, I say these words to you tonight: I'm with you, I will fight for you, and I will win for you, \"Trump plans to proclaim Thursday night in his acceptance speech at the GOP convention, according to an advance text. After ascending the stage to the theme from the action film Air Force One, Trump said he\" humbly and gratefully \"accepted the Republican nomination to the presidency, then launched into a prepared Teleprompter speech peppered with caustic asides about career politicians. In addition to promoting his own qualifications for the job, Trump's speech was aimed at uniting a convention in which the runner-up in the primary campaign refused to endorse him, critical delegates staged a noisy floor fight over the rules and a string of high-profile Republicans boycotted the entire event. Trump argued that the United States is in decline under the Obama administration, citing a litany of grim statistics about crime and violence, terrorism and national security, and the rising number of Americans who have stopped looking for work. Election opponent Hillary Clinton and other Democrats are to blame for many of the nation's ills, Trump said, and\" the problems we face now--poverty and violence at home, war and destruction abroad--will last only as long as we continue relying on the same politicians who created them. \"Hitting the former secretary of State for foreign policy problems ranging from Libya to the Islamic State, Trump said that Clinton's legacy is one of\" death, destruction, terrorism and weakness. \"The candidate brought the crowd to its feet when he said of Clinton,\" let's defeat her in November. \"Citing the recent spate of police killings and terrorism, the businessman who has never held public promised that\" the crime and violence that today afflicts our nation will soon--and I mean very soon--come to an end...Beginning on January 20th 2017, safety will be restored. \"Echoing promises he has made since hitting the campaign trail 13 months ago, Trump said he will stop illegal immigration with a wall along the U.S.-Mexico border, and change trade agreements that he claims have sucked manufacturing jobs out of the United States to foreign countries. Throughout the day, the Clinton campaign and other Democratic groups sent out statements denouncing various Trump polices as ineffectual, divisive or simply wrong-headed, and accusing him of distorting Clinton's records. They also cited Republican infighting over Trump, including the refusal of many high-profile Republicans to endorse the party's new standard-bearer. Trump's week-long convention in Cleveland has been plagued with problems, one of which surfaced just hours before he was to take the podium: The pro-Clinton group Correct The Record got a hold of a Trump speech draft and distributed it to reporters. In his remarks, Trump recited a string of slogans he used at rallies across the country in the past year, including\" Law and Order, \"\"America First,\" a \"rigged system,\" and--the original campaign theme--\"Make America Great Again.\" The crowd responded with repeated ovations and chants like \"build that wall!\" and \"U-S-A!\" Mocking the pro-Clinton slogan--\"I'm With Her\" --Trump told delegates: \"I'm with you, the American people: I am your voice.\" And as in previous rallies, Trump had to pause at one point as a protester heckled him and had to be removed by security. As Trump put the final touches on his speech and did a walk-though of the stage set-up, the Republican nominee took to Twitter to proclaim the convention a success. \"Other than a small group of people who have suffered massive and embarrassing losses, the party is VERY united,\" Trump said. \"Great love in the arena!\" Other than a small group of people who have suffered massive and embarrassing losses, the party is VERY united. Great love in the arena!--Donald J. Trump (@ realDonaldTrump) July 21, 2016 Daughter Ivanka Trump introduced her father to the noisy crowd that packed Cleveland's basketball arena, telling them he is a \"fighter\" who became \"the people's nominee.\" As with other speakers throughout the week, Trump is expected to seek Republican unity by going after Clinton. Republican delegates have attacked Clinton in extraordinary ways throughout the week, including convention hall chants to \"lock her up!\" Trump prepared for his big night amid another flap over his commitment to U.S. military alliances, including NATO. <mark>Donald Trump</mark> walks on stage to greet his running mate, Mike Pence, after Pence addressed the audience during the 2016 Republican National Convention in Cleveland on July 20, 2016. (Photo: <mark>Robert Deutsch</mark>, USA TODAY) When The New York Times asked the candidate about the prospect of a Russian attack on NATO allies in the Baltic States, Trump said he would authorize help only after deciding whether those countries \"have fulfilled their obligations to us.\" Republicans who have questioned Trump's grasp of foreign policy reacted with indignation. Sen. Lindsey Graham, R-S.C., said Trump \"is essentially telling Russians/other bad actors\" that the United States \"is not fully committed to supporting NATO alliance.\" Trump's convention ends a day after a former primary rival, Sen. Ted Cruz of Texas, pointedly refused to endorse the party's nominee during his convention speech, inciting a chorus of boos and catcalls from pro-Trump delegates. Cruz stuck to his non-endorsement Thursday, reminding a meeting of the Texas delegation that Trump has criticized his wife's looks and all but accused his father of participating in a plot to assassinate President John F. Kennedy. \"I wasn't going to come like a servile puppy dog and say\" Thank you very much' for maligning my wife and father, \"Cruz told angry pro-Trump delegates from the Lone Star State. On Monday, the convention's opening day, a group of anti-Trump delegates that included Cruz backers tried to force a roll call on convention rules in a bid to force an\" open convention \"in which they could vote for any candidate they wanted. When GOP leaders blocked that effort, the anti-Trump delegates staged a noisy protest on the floor. As Trump prepared to close out the convention on Thursday, his remarks have been vetted via software that ferrets out plagiarism, seeking to avoid the kinds of problems that followed wife Melania Trump's speech on Monday. During his walk through at the Quicken Loans Arena, Trump tested the sound system by mocking another likely target of tonight's speech: the media\" I love the media, \"Trump joked.\" They're so honest...They're such honorable people...It's about time I said that, right? \""}, {"articleID": "2019102204_00113583_W", "names": {"Oscar Rivas": ["Q3428624", "Q7106230"], "Yvon Michel": ["Q52896469", "Q530848"]}, "date": "2019-10-22", "url": "https://www.boxingscene.com/oscar-rivas-being-pursued-by-top-rank-eddie-hearn--143567", "content": "<mark>Oscar Rivas</mark> Being Pursued By Top Rank and Eddie Hearn By Luke Furman Published On Tue Oct 22, 2019, 12:20 AM EDT Heavyweight contender <mark>Oscar Rivas</mark> (26-1, 18 KOs) continues to be a hot commodity, despite suffering his first career defeat back in July. <mark>Rivas</mark> suffered a twelve round unanimous decision loss to Dillian Whyte in a WBC final eliminator. Whyte was down in the ninth round. There was controversy in the aftermath of that bout, when it was revealed that Whyte had tested positive for two metabolites of a banned substance in an anti-doping test administered by UKAD in June. <mark>Rivas</mark> and his handlers were unaware of the positive test, and they had no knowledge that a confidential hearing took place on the morning of fight - where a panel allowed Whyte to move forward with the contest. Whyte is still involved in a confidential legal process with UKAD. The WBC have suspended his mandatory status - until the situation with UKAD is resolved. If Whyte is suspended by UKAD, <mark>Rivas</mark> and his handlers would likely petition the WBC for a mandatory title shot. Top Rank Vice President Carl Moretti confirmed that a multi-fight deal has been presented to <mark>Rivas</mark> and his promoter, <mark>Yvon Michel</mark>. That multi-fight deal includes a future fight with undefeated Tyson Fury. But Moretti is not alone in his chase. Eddie Hearn, who promoted <mark>Rivas</mark>' fight with Whyte, is also offering the Canadian heavyweight a multi-fight deal. Top Rank is aligned with ESPN, while Hearn has an exclusive deal with streaming service DAZN. \"I'm aware of Hearn's offer to <mark>Rivas</mark>. It's part of the boxing business. It's up to <mark>Oscar</mark> and his team to make their decision. If he decides not to take our offer [and go with Hearn], it will be more difficult to offer him a fight against Fury,\" Moretti confirmed to The Montreal Journal. This week, <mark>Michel</mark> will travel to Cancún for the WBC convention with the boxer and the manager of <mark>Rivas</mark>, Stéphane Lépine. At the end of the week, they will make a decision on the direction of the heavyweight's career. Tags:"}, {"articleID": "2015113017_00017219_W", "names": {"Jennifer Morgan": ["Q29643302", "Q42413972"]}, "date": "2015-11-30", "url": "http://www.todayszaman.com/world_leaders-of-warming-earth-seek-ways-to-cut-emissions_405727.html", "content": "Addressing the twin threats of global warming and extremist violence, the largest group of world leaders ever to stand together kicked off two weeks of high-stakes climate talks outside Paris on Monday, saying that by striking an ambitious deal to cut emissions they can show terrorists what countries can achieve when they are united. \"What greater rejection of those who would tear down our world than marshaling our best efforts to save it?\" US President Barack Obama asked his fellow world leaders. The gathering of 151 heads of state and government comes at a somber time for France, two weeks after militants linked to the Islamic State in Iraq and the Levant (ISIL) killed 130 people around Paris. Fears of more attacks prompted extra-high security and a crackdown on environmental protests--and threatened to eclipse longer-term concerns about rising seas and extreme weather linked to man-made global warming. \"The challenge of an international meeting has never been so great because it's the future of the planet, the future of life,\" French President Fran & ccedil; ois Hollande said after a moment of silence for attack victims in France, Lebanon, Iraq, Tunisia and Mali. He urged leaders to work toward a world free from both environmental destruction and extremist violence. A climate deal is by no means guaranteed. More than 180 countries have already submitted individual national plans, but that's just a foundation for a binding agreement that <mark>Jennifer Morgan</mark>, a climate policy expert at World Resources Institute, calls \"the international glue that puts them all together.\" Many of the leaders called for a binding agreement and emphasized the role of private funding. They said the world must keep the average temperature within 1 degree Celsius (1.8 degrees Fahrenheit) of current levels--and if possible to half that, to spare island nations threatened by rising seas. \"We just have 11 short days before us,\" French Foreign Minister Laurent Fabius said as he took over as president of the negotiations. \"Success is not yet assured, but it is within our grasp...The eyes of the world are upon us and there are great hopes.\" The world has already warmed nearly 1 degree Celsius since the beginning of the industrial age, and factories and cars continue to belch pollution around the world. Many of the leaders framed the problem as a generational issue, where current leaders owe it a liveable Earth to future generations. Britain's Prince Charles said: \"None of us should assume that for our today they should give up tomorrow.\" But while the relatively short speeches by world leaders pledged to do something about climate change, not all of them advocated ambitious worldwide action, perhaps giving a glimpse of sticking points to come in negotiations. Reviving the rich-poor differences that caused earlier climate talks to fail, Chinese President Xi Jinping said an eventual global climate deal must include aid for poor countries and acknowledge differences between developing and established economies. \"Addressing climate change should not deny the legitimate needs of developing countries to reduce poverty and improve living standards,\" he said. UN Secretary-General Ban Ki-moon, in his opening remarks, noted the rallies on Sunday in which hundreds of thousands of people around the world called on the leaders to make real progress at the talks. \"The future of the people of the world, the future of our planet, is in your hands,\" he told negotiators. \"We cannot afford indecision, half measures or merely gradual approaches. Our goal must be a transformation.\" Leaders called their attendance at the conference in Paris an act of defiance after the Nov. 13 attacks, some of which occurred near the airfield north of the city where the conference is taking place. Wide highways usually packed with commuters were cordoned off to clear the way for the VIPs. Riot police vans and plainclothes officers were stationed around the capital. People take part in a climate change protest around New York City Hall in Lower Manhattan, New York. (Photo: Reuters) Many of the leaders paid their respects at sites linked to the attacks. Obama, in a late-night visit, placed a single flower outside the concert hall where dozens were killed, and bowed his head in silence. \"We stand with Paris,\" UN climate change agency chief Christina Figueres said. \"The city of light, now more than ever, is a beacon of hope for the world.\" The conference is aimed at the most far-reaching deal ever to tackle global warming. The last major agreement, the 1997 Kyoto Protocol, required only rich countries to cut emissions, and the US never signed on. Among several sticking points is money--how much rich countries should invest to help poor countries cope with climate change, how much should be invested in renewable energy, and how much traditional oil and gas producers stand to lose if countries agree to forever reduce emissions. With that in mind, at least 19 governments and 28 leading world investors were announcing billions of dollars in investments to research and develop clean energy technology, with the goal of making it cheaper. Backers include Obama, Microsoft co-founder Bill Gates, Facebook founder Mark Zuckerberg, billionaires George Soros and Saudi Prince Alaweed bin Talal, and Jack Ma of China's Alibaba. Under the initiative, 19 countries pledge to double their spending on low - or no-carbon energy over the next five years. They currently spend about $10 billion a year, about half of that from the US."}, {"articleID": "2012030500_00058598_W", "names": {"Jeff Jones": ["Q16730405", "Q18688091", "Q2454089", "Q55614985", "Q56988644", "Q6174180", "Q6174181", "Q6174182", "Q6174185", "Q6174186", "Q6174188", "Q6174190"], "Michael Rosenberg": ["Q12326988", "Q28421667", "Q31661195", "Q6833968"], "Victor Martinez": ["Q1133552", "Q64756", "Q7926138"], "Miguel Cabrera": ["Q51612870", "Q735354"]}, "date": "2012-03-04", "url": "http://freep.com/article/20120304/SPORTS02/203040571/1048/rss03", "content": "suspect arraigned in gas-station carjacking of veteran, 86, caught on video paris gomillion, 20, of detroit faces one count of carjacking, and could face life behind bars if...why did delta airliner strike parked shuttle bus after detroit metro landing? feds investigate the shuttle was empty and no injuries were reported, paul skrbec, a delta air lines spokesman, said...president barack obama said today he would not hesitate to attack iran to keep it from getting a.. . super tuesday's stakes are super high--but the battle for gop nomination is far from over osu 72, msu 70: spartans can't clinch title outright; will share with u-m, osu the michigan state spartans couldn't claim outright possession of the big ten championship on...the michigan wolverines clinched at least a shot at a share of the big ten title on sunday with a.. . justin verlander's 2011 season was historic. it is also history. chicago 2, detroit 1: wings lose howard, another one-goal game to blackhawks flashy new models will vie for attention with boardroom drama and economic dread at the geneva auto...as automakers prepare to roll out new models this week at the geneva auto show - one of the major...fiesta st, kuga suv to launch ford will launch the fiesta st and a new kuga suv monday at the geneva motor show. when online ticket sales opened a couple of weeks ago for an indonesian dinner at the museum of...the envelope, please. and the grand prize winner of the free press' 33rd oscar derby is...brian mccollum: local country rocker ty stone is finally ready for the big time if good things indeed come to those who wait, ty stone should have an absolute blockbuster on his...bothaina kamel, egypt's 1st female presidential candidate, brings message to u-m bothaina kamel is to egypt what oprah winfrey is to america. therapy, electro-shock treatments put depressed clarkston woman back on track eight years into a routine she enjoyed as a school social worker, nancy brown struggled to adjust...visitors are welcome at u.s. olympic training centers in colorado, californiac kara patterson holds a long, heavy javelin above her head. she waits. <mark>jeff</mark> gerritt: salvaging lives, saving money: eight pilot courts that divert mentally ill offenders from prison over the last two decades, mental health care in michigan has eroded, leaving hundreds of thousands...mackinac center: health spending caps a plus for school districts the michigan legislature enacted a slew of helpful public school reforms last year, including...on feb. 17, i purchased gas at my local speedway for $3.19 per gallon. <mark>michael rosenberg</mark>: for tigers' justin verlander, being best not good enough detroit tigers 18, atlanta 3: tigers' nine home runs blow out braves injured <mark>victor martinez</mark> makes first visit to tigers camp: \"it's tough' detroit tigers 2, atlanta 0: brandon inge dazzles in field, tigers pitchers dominate on mound tigers' prince fielder, <mark>miguel cabrera</mark>, delmon young all will get to dh detroit tigers manager jim leyland expresses confidence with brandon inge at second detroit tigers 11, florida southern 1: reliever matt hoffman impresses in tigers' blowout win brandon inge will start at second base in tigers' big-league exhibition opener lakeland, fla.--al alburquerque struck out 13 in 7 1/3 innings in spring training last year. he didn't make the opening day team. but with the way he overpowered several hitters in spring training, he made an impression on the tigers' coaching staff. two weeks into the season, alburquerque was called up to the majors for the first time. he quickly became a valuable part of the bullpen.\" i don't think we would have gotten where we got to last year without him, \"pitching coach <mark>jeff jones</mark> said. now, six pitchers are competing for the open spot in the rotation: jacob turner, andy oliver, duane below, adam wilk, casey crosby and drew smyly. (turner was the only one to pitch saturday. he retired the side in order in his only inning .) one or more candidates could be this year's alburquerque--a pitcher who doesn't make the opening day team but whose strong showings in spring training contribute to a call-up during the season. <mark>jones</mark> said how the young starting candidates do in spring training\" could mean a lot \"in any decision about when to call them up later in the year.\" a lot of times, guys that make a really good impression will get an opportunity that year, \"<mark>jones</mark> said.\" you're always looking, always watching, to see how guys react to different things. that's what we'll judge a lot in the games. what if you get hit a little bit? how will you react? a lot of these guys haven't been hit around very much. \"the majority of the time, the pitchers who get called up during the season are the ones who made a good impression in big league camp.\" happy to be here: prince fielder continues to sound delighted to be a tiger. \"i really like this team,\" he said. \"it's a lot of fun. everybody works hard. it's a lot of fun being with a bunch of guys that all want to be at their best.\" batter up: after he got in the box against justin verlander in batting practice wednesday, <mark>miguel cabrera</mark> was asked how happy he is that he doesn't have to hit against verlander during the season. \"a lot,\" he said. \"we're lucky we have him.\" even though it happened on a practice field, <mark>cabrera</mark> against verlander was a riveting moment: the batting champion against the cy young winner. <mark>cabrera</mark> didn't swing at any of the five pitches verlander threw him. \"i wanted to know what the hitters are feeling when they face verlander,\" <mark>cabrera</mark> said. male birth control pill in sight, may right imbalance in options spring is good time for tigers to make your pitch al alburquerque struck out 13 in 7 1/3 innings in spring training last year. he didn't make the opening day team. but with the way he overpowered several hitters in spring training, he made an div. 1 wrestling: catholic central's kevin beazley wins family's first title div. 2 wrestling: greenville's thomas wins third title, thanks former competitor"}, {"articleID": "2015120216_00041763_W", "names": {"Abdul Samad Khan": ["Q51200948", "Q59490523"]}, "date": "2015-12-02", "url": "http://geo.tv/article-206092-Achakzai-for-foreign-policy-based-on-provinces-recommendations", "content": "Achakzai for foreign policy based on provinces' recommendations Posted: December 02, 2015 - 1930 PKT | Comment QUETTA: Pakhtunkhwa Milli Awami Party (PK-MAP) leader Mehmood <mark>Khan</mark> Achakzai on Wednesday said the country's foreign police should be based on recommendations put forth by all the four provinces. Addressing a rally on the occasion of nationalist leader <mark>Abdul Samad Khan</mark>'s death anniversary, the PK-MAP leader said the provinces should be given their basic rights. Achakzai linked completion of China-Pakistan Economic Corridor (CPEC) with peace in the region. He said peace cannot be achieved until the environment of distrust between Afghanistan and Pakistan is eliminated. \"Both the countries (Pakistan and Afghanistan) need peace,\" he added. He said the soil is dearest to Pashtun after the holy Quran and Kalima and the nation will not make any compromise on it. The PK-MAP leader said the people of Balochistan should also be given their basic rights. Print this story Tweet \"Previous Next' More from: PAKISTAN Sacrifices of security personnel in Karachi will not go in vain: Asif Chehlum Imam Hussain: Govt refuses to suspend mobile phone service in Karachi Indian External Affairs minister to visit Pakistan next week: reports Karachi operation will be expanded across Sindh: Chandio Comments Please enable JavaScript to view the comments."}, {"articleID": "2009040604_00012179_W", "names": {"David Copperfield": ["Q139637", "Q5232562"], "Richard Hilton": ["Q24054274", "Q948705"]}, "date": "2009-04-06", "url": "http://topnews.in/buy-charles-dickens-bleak-house-2m-2147745", "content": "london, april 6: victorian novelist charles dickens's former home bleak house in broadstairs, kent, is up for sale. the cliff top building, which has six bedrooms, is being sold for two million pounds. it went on the market with estate agent terence painter properties. the fort-like building is the same house where dickens wrote one of his most famous novels <mark>david copperfield</mark>. \"bleak house commands one of the most prominent positions - high up on the cliffs on the coast of kent. this mansion is known far and wide as the seaside residence of the great novelist, charles dickens,\" the telegraph quoted a spokesman for the estate agent as saying. \"the grade ii listed house was built in 1801 and has to be one of the country\" s most renowned homes, \"he added. bleak house underwent a 40,000-pound restoration after being damaged by fire in 2006. while it has yet to be determined why the house has been put up for sale, the paper suggests that the family business of its current owner, local jewellery tycoon <mark>richard hilton</mark>, is in a difficulty for mislabelling their wares. his daughter kelly is said to be awaiting sentencing after admitting offences under the hallmark act before local magistrates last month. (ani)"}, {"articleID": "2019110318_00095029_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}, "date": "2019-11-03", "url": "https://www.newscenter1.tv/former-president-jimmy-carter-is-back-teaching-sunday-school/", "content": "Former President <mark>Jimmy Carter</mark> is back teaching Sunday school November 3, 2019 Associated Press, PLAINS, Ga. (AP)--Former President <mark>Jimmy Carter</mark> taught a Bible lesson on life after death Sunday less than two weeks after breaking his pelvis in a fall. Using a walker, the 95-year-old Democrat slowly entered the crowded sanctuary at Maranatha Baptist Church in the southwest Georgia town of Plains. \"Morning, everybody,\" he said cheerfully. With help, <mark>Carter</mark> sat on a motorized lift chair at the front of the room to teach a 45-minute lesson based on the Old Testament book of Job. Referring to a cancer diagnosis that resulted in the removal of part of his liver in 2015, <mark>Carter</mark> said he was is \"at ease\" with the idea of dying and believes in life after death. More than 400 people were on hand in the main hall and smaller, overflow rooms where the lesson was shown on television. <mark>Carter</mark> was briefly hospitalized and has since been recovering at home since fracturing his pelvis on Oct. 21. He also fell shortly before that and needed stitches above his left eye. <mark>Carter</mark> is the oldest U.S. ex-President ever and has been teaching Bible lessons since he was in his teens. He missed one Sunday school class after the pelvis fracture. Rev. Tony Lowden said Secret Service agents, relatives and fellow church members all discouraged <mark>Carter</mark> from teaching because of the injury, but he insisted. \"He is pouring out that you might see Christ while he is suffering,\" Lowden told the crowd. <mark>Carter</mark> remained for the worship service after teaching, sitting in a pew beside his wife, Rosalynn, and singing hymns with the congregation. Referring to the former president and Jesus Christ by their initials, Lowden gave thanks for <mark>Carter</mark> in prayer. \"The greatest thing I've learned as a pastor here is watching J.C. follow J.C.,\" Lowden said. Categories: National News Tags: <mark>Jimmy Carter</mark>, sunday school AlertMe Facebook Twitter"}, {"articleID": "2020021520_00299038_W", "names": {"James O'Connor": ["Q1992813", "Q2203638", "Q30147930", "Q6140465", "Q6140467"]}, "date": "2020-02-12", "url": "http://yasstribune.com.au/story/6626997/birdlife-australia-urges-residents-to-keep-their-eyes-on-the-skies/?cs=1554", "content": "Birdlife Australia urges residents to keep their eyes on the skies whatsapp FOWL: Birdlife Australia has urged members of the community to contribute to science by counting birds. Photo: Hannah Neale. Everyday people have been encouraged to grab their binoculars and take out their phones to help scientists record bird population numbers after recent fires. Birdlife Australia has urged members of the community to contribute to science by counting birds. The observations will be critical to inform post-bushfire recovery planning. READ ALSO: Food, fun and dancing at Goulburn Multicultural Festival Budding citizen scientists can download the Birdata app or head to the web page to get involved with the project. Goulburn Field and Naturalist Society president Frank Antram, known as the \"Bird Man', said the full effects of bushfires to the bird population were not yet known.\" A lot of their habitat has been destroyed and it'll take a couple of years before we understand the impact, \"he said.\" If there is no habitat and food they are not going to survive, it will take years to come back. \"Despite this Mr Antram said birds were quite resourceful. The Goulburn Field and Naturalist Society has been involved with survey work for NSW Parks and Wildlife and other organisations.\" We [donate our time] because we like to do it,' Mr Antam said. CHECK OUT: Public schools maintain $4m A preliminary study by Birdlife Australia revealed 19 species of bird had more than half of their habitat heavily impacted by fire, and another 58 had lost more than a third. Head of research <mark>James O'Connor</mark> said \"the number of threatened Australian birds may rise by over 25 per cent in a matter of months, it's staggering and tragic.\" \"We're picking ourselves up and dusting ourselves off for the challenges ahead.\" Once we've completed these assessments, the next steps are to get people out there to see what is left, find the refuges fire has spared, and start working to protect them. \"These birds are going to need a lot of help on the ground, whether that be translocating birds, providing emergency food resources, or working with fire managers to improve protection from future fires.\" Birdlife Australia urged people to only enter bushfire affected areas when it was safe to do so. Head to birdata.birdlife.org. au for more information and to record numbers. READ MORE: Why global warming is such a turn-off for Canberra's favourite bir d While you're with us...Did you know the Goulburn Post is now offering breaking news alerts and a weekly email newsletter? Keep up-to-date with all the local news: sign up here."}, {"articleID": "2017052205_00250277_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-05-22", "url": "https://tribune.com.pk/story/1415742/is-globalisation-dead/", "content": "The Express Tribune Share Tweet Email The writer is a former caretaker finance minister and served as vice-president at the World Bank A decade or two ago, there was great confidence on the part of most social scientists that the world was finally settling down in ways that would help all countries and all people. With the Soviet Union having collapsed in 1991, with Eastern Europe having abandoned communism and with China and its southern neighbours having adopted forms of capitalism to manage their economic systems, ideological conflict ended. The American sociologist Francis Fukuyama in his book titled The End of History celebrated these developments. He laid out the direction in which the world was headed. It was moving towards Western liberalism. This sense of confidence led a number of economists to develop policies they lumped together in what they called The Washington Consensus. This was done to help developing countries adopt policies that would quicken the rate of growth of their economies. This policy set had two important components. The most important of these concerned the size of the state and the functions the governments should perform. The Consensus opted for a minimalistic approach to governance. The state should leave the running of the economies to private enterprises. The government should lightly regulate private activity. The second important component concerned flow of trade, capital information and, to a limited extent, people. All these should flow across international borders without much hindrance. That way these factors will go to the places where return was high that would result in increased economic activities and add to global growth. However, with borders open, the benefits from increased global output would spread across the globe. That is the way the world did go for a couple of decades until two things happened and the freed private sector acted irresponsibly, in particular its financial component. Banks in the US lent huge amounts for housing to those who could not afford to service the loans that were being aggressively marketed. The banks did not keep these loans on their books. They combined them into fancy products that were rated highly by the rating agencies and sold to the institutions, such as pension funds and insurance companies that had large amounts of long-term capital at their disposal. Thus was built a house of cards that collapsed in 2007, plunging the world into what came to be called the Great Recession. This lasted for a couple of years and changed for good the structure of the global economy. A \"new norm\" came into being in which the rates of growth slowed down to the point that equalled increase in productivity and in the size of the labour force. However, in most developed countries natural increase in the workforce was negative unless immigration was allowed. People came in from the crowded parts of the world to fill the job markets in rich countries. People-flows became important for the economies of the US and the UK. The former received a lot of illegal labour from Mexico, while the latter had legal migrants from Eastern Europe, in particular from Poland. The migrants affected the labour market in ways that hurt the low-income earners. This group included what sociologists call \"low-income, non-college educated white population.\" They formed the base of support for the <mark>Donald Trump</mark> and the movement in Britain to leave the EU. In both countries this disaffected and disgruntled population was fed anti-globalism. Banning the entry of immigrants and walking out of trade deals were sold as the policies that will rescue this group from its economic troubles. With <mark>Trump</mark> elected president and with Britain's Prime Minister Theresa May having sent the divorce letter to Brussels, the stage is set for more anti-globalisation moves. But has globalisation really hurt these countries? The answer comes from a recently published Washington-based study by the Peterson Institute for International Economics. According to the report, trade has contributed significantly to the rise of living standards in the US. Since the end of WWII, the US has gained $2.1 trillion a year, which is equivalent to 11 per cent of the current estimate of the size of the country's economy of $18.5 trillion. This has benefited low-income groups whose budgets are weighted towards such manufactured products as shoes, clothing and electronics. Also, only modest job losses resulted from trade. In recent years, imports displaced 312,500 jobs per year but the economy on average created 156,250 jobs. Most of the job losses were because of technological advances, not because of trade. The report also found that since 2003, benefits from trade have exceeded costs by a factor of five to one. However, as the economist Mancur Olson pointed out, some time ago, gains from trade are spread among millions of consumers while the pain of job loss is concentrated in the areas where factories close. These were the areas that voted for <mark>Trump</mark> and cast their votes in favour of Brexit. As the economic writer Robert J Samuelson wrote in a recent article, \"politically globalisation shifts blame abroad. Foreigners--their exports, subsidies, exchange rates or whatever--are the villains. We are the victims. Little wonder that <mark>Trump</mark> has found anti-globalisation an irresistible pitch. So have many others. Yet this has created a dilemma for trade policy. What's good politics is bad economics and vice versa.\" It is hard to predict what is in store for the <mark>Trump</mark> presidency. On May 17th, the Justice Department appointed a Special Counsel to investigate the nature of president's and his team's contacts with Russia. No matter what they find from this investigation, a great deal of damage has already been done to globalisation. Published in The Express Tribune, May 22 nd, 2017. Like Opinion & Editorial on Facebook, follow @ ETOpEd on Twitter to receive all updates on all our daily pieces."}]