[{"articleID": "2018031516_00055450_W", "names": {"Morgan Evans": ["Q21954811", "Q30122234", "Q56598028"], "Craig Morgan": ["Q1138616", "Q1771428", "Q3002042", "Q39927282"]}, "date": "2018-03-15", "url": "http://wincountry.com/news/articles/2018/mar/15/dive-bars-dahlonega-and-worst-days-a-crash-course-in-ashley-mcbrydes-breakthrough-hit/", "content": "Dive bars, Dahlonega and \"worst day [s]\" : A crash course in Ashley McBryde's breakthrough hit Thursday, March 15, 2018 11 a.m. CDT Image courtesy of Warner Music Nashville (via ABC News Radio) If you're trying to unravel the mysteries of Ashley McBryde's first top forty hit, \"A Little Dive Bar in Dahlonega,\" here's a crash course: Dahlonega is a town in the mountains of North Georgia, and the watering hole in question is a place called the Crimson Moon. The song was based on something that actually happened to songwriter Jesse Rice. \"Jesse did a really good job of explaining the town of Dahlonega to us, and his exact situation, the car breaking down and pulling into the Crimson Moon, just to kind of ride it out and have a beer, and Shawn Mullins was in [the bar] singing,\" Ashley says of the session where the tune was written. \"[Our co-writer] Nicolette Hayford and I were taking notes as fast as we possibly could,\" Ashley recalls. \"And [Jesse]'s like,\" Well, anyway, I guess we're not writing today .' And I was like, \"No, no, no! Listen to this .\" She recalls that she then started sing, \"Here's to the breakups that didn't break us,\" and adds, \"45 minutes after that, we had the song .\" The Arkansas native says the tune about \"making the best of the worst day\" is having a bigger effect than she ever imagined. \"I started getting emails and Snapchats from people saying,\" This song changed my life,' \"Ashley tells ABC Radio .\" And I'm Snapping back, immediately. \"What do you mean? What happened?' You know like,\" Did your car break down?' \"\"And [one fan] said I kept her from taking a phone call from her abusive ex,\" Ashley reveals. \"That's way bigger than us. So what we touched on--our terrible day--became way bigger than we can comprehend .\" Ashley's debut album for Warner Nashville, Girl Going Nowhere, comes out March 30. Copyright © 2018, ABC Radio. All rights reserved. More From Music \"Happens Like That\" : The spontaneous beginning of Granger Smith's latest hit <mark>Morgan Evans</mark>' \"Kiss Somebody\" competes for a major award Down Under Blake Shelton, <mark>Craig Morgan</mark> and MercyMe will be Jammin' to Beat the Blues with Trace Adkins Jon Pardi's adorable wedding present for Maren Morris and Ryan Hurd Reba and the cast are rarin' to go for a \"Reba\" reboot Jason Aldean reunites Hootie & the Blowfish to play Braves' stadium this summer Comments"}, {"articleID": "2019070605_00142585_W", "names": {"Jennifer Brady": ["Q13562450", "Q17612134"]}, "date": "2019-07-06", "url": "https://wwos.nine.com.au/tennis/wimbledon-nick-kyrgios-caught-pub-party-planning/840f085b-3b3a-40ae-a7cf-fc835228c91b", "content": "Did Nick Kyrgios get caught planning \"club' visit after Wimbledon doubles loss? By Melanie Dinjaski 5 hours ago F Share T Tweet Q SMS W WhatsApp B Email G J Tumblr L LinkedIn 5 hours ago Nick Kyrgios has said one of the reasons he loves basketball and Davis Cup tennis is because of the team environment, and the Aussie never looked happier after a loss than he did following his mixed doubles defeat at Wimbledon. So much so, he was seemingly caught planning his evening at a\" club \"before the post-match press conference. Kyrgios teamed up with American Desirae Krawczyk but unfortunately the pair were defeated 7-6, 6-7, 5-7 by Marcus Daniell and <mark>Jennifer Brady</mark>. Earlier this week, Kyrgios drew criticism for being snapped at a London pub the night before his second-round loss to Rafael Nadal, and it seems the Canberran had similar plans after his mixed doubles exit .\" Yeh we're probably going to start there. Then we've got a club set-up. It's going to be outrageous, \"Kyrgios said into his phone, appearing to leave a voice message .\" Oooh, where are we going? \"Krawczyk then asked. Kyrgios leaves a voice message on his phone making plans for his evening (Wimbledon) It's not known if Kyrgios was actually making evening plans or simply trying to toy with the media, but a Wimbledon staffer quickly went up to the table to remind them both that the microphones were live. With a grin on his face and Krawczyk giggling, Kyrgios then leaned closer to the microphones and said:\" I'm going out tonight. Let me know if you want to come. It's going to be a crazy good night. \"When the press conference did get underway properly, Krawczyk also joked that the Aussie was\" full of s--\"when he claimed that he was planning an\" early night \".\" I had about eight-and-a-half hours of match play in three days just from singles, so my body is actually feeling okay. I'm going to get a good rest tonight, \"Kyrgios said before his doubles partner chimed in .\" Are you? Full of s--. Full of s--. Sorry for my language, \"she said in good humour, prompting Kyrgios to burst out laughing .\" I'm going to get a good rest tonight. You know just eat up, stretch and get an early night, \"Kyrgios continued .\" I'm sure they [the media] all believe that, \"Krawczyk added. Krawczyk calls out Kyrgios'\" early night' plans Kyrgios, 24, and Krawczyk, 25, seemed to have developed a good relationship despite the tennis pairing beginning by the Aussie \"sliding into her DMs\". \"I didn't want to, you know, come off like a creep when I asked her. I just genuinely wanted to play. You know, just have a lot of fun,\" he said. \"It wasn't creepy. I was just caught off-guard,\" Krawczyk said. \"He just asked a question,\" Do you want to play mixed at Wimby?' I was like, \"Sure, why not?' Thought it would be fun .\" Kyrgios explained that he actually felt the losses a lot more in doubles than he does in the singles matches he plays. Nick Kyrgios and Desirae Krawczyk in action during the mixed doubles on day five (AAP) \"I take these losses harder actually than I do in singles. It hurts not to win. I really wanted to win. I'm always up for that team environment,\" he said. Both players were questioned about their on-court chemistry, with a British journalist pointing out they appeared to be \"nattering throughout\" the match. This caught Kyrgios out when a reporter noted he described her as \"crazy bossy\" earlier, which Krawczyk was shocked by. \"Wow? Bossy? Seriously?\" she laughed as Kyrgios cowered below the desk smirking. \"I just call plays .\" \"No, she played awesome. I thought she was really good,\" Kyrgios said. \"I had a lot of fun today. I thought it was a pretty high level .\" Kyrgios jokes with \"bossy' doubles partner When asked how she felt about playing alongside Kyrgios and the big crowd he drew to the court, Krawczyk said she'd never experienced anything like it before .\" He's a big name so everyone wants to come and watch him, \"she said. But Kyrgios was less impressed with some of the supporters he attracted .\" Drunk guys hitting on [Krawczyk] all the time, \"he said .\" They were like seagulls, like, \"Des, Des, Des, Des',\" Krawczyk added. \"It was definitely fun. I didn't have to do much on the serves. It was great. It was a lot of fun .\" tennis wimbledon Nick Kyrgios More Tennis News Previous Wimbledon draw opens up for \"sickeningly consistent' Novak Djokovic Next Caroline Wozniacki loses in Wimbledon third round amid Hawkeye controversy"}, {"articleID": "2018030617_00294835_W", "names": {"Derek Savage": ["Q24592005", "Q5262332"], "Jimmy Allen": ["Q30122330", "Q5999007"]}, "date": "2018-03-06", "url": "http://capegazette.villagesoup.com/article/derek-delivers-domino’s-hall-fame-athlete-high-character/152284", "content": "<mark>Derek</mark> delivers like Domino's - a hall of fame athlete of high character Dave Frederick March 6, 2018 <mark>Derek Savage</mark> will be inducted into Goldey-Beacom Athletics Hall of Fame this May. You can find <mark>Derek</mark> between The Factory and Milford Boys & Girls Club, working with youth programs. DAVE FREDERICK PHOTO Ed Bordley with his guide dog. SUBMITTED PHOTO <mark>Jimmy Allen</mark> with a ball signed by the 1975 starting five. DAVE FREDERICK PHOTO Luke Oliphant is an outfielder at UMass. SOURCE: UMASS ATHLETICS Izzy Cryne is a freshman starting goalie for the Mercer University lacrosse team. DAVE FREDERICK PHOTO <mark>Derek</mark> delivers like Domino's - <mark>Derek Savage</mark>, the Doctor of Dunk when he played for Cape, will be inducted into the Goldey-Beacom College Athletic Hall of Fame April 22 during a ceremony at the Deerfield Golf Club in Newark. According to the school website, \"<mark>Savage</mark> was one of the outstanding players for the Lightning's men's basketball team during a very special era .\" He was named first-team All-Central Atlantic Collegiate Conference and to the CACC All-Tournament Team in 2008, when he helped Goldey-Beacom reach the conference quarterfinals. <mark>Savage</mark> also was picked second-team all-league in 2007, when he helped the squad to the Eastern Collegiate Athletic Conference title. <mark>Savage</mark> graduated first in school history with 1,333 points, 772 rebounds, 293 assists, 219 free throws, 96 blocks and 236 steals. <mark>Derek</mark> is the youngest of three boys. His older brothers are Mike and Elliott. They are all super nice young men and first cousins to the <mark>Savage</mark> family that includes Willie, Taiwan, Princess, Tranesha, Chimire and Janelle. Like his cousins, <mark>Derek</mark> was a track star, excelling in the high jump and triple jump. Ed Bordley - A blind wrestler from Caesar Rodney won a state championship at 167 pounds his junior year in 1975. I saw Bordley wrestle a novice Cape recruit in 1976, whom Bordley was wearing out, and so the kid escaped then hid and would not re-engage. Pete Basile, who now runs in several local road races, was Bordley's high school wrestling coach. The ref awarded a tech fall. Bordley then wrestled at Harvard. Neil deGrasse Tyson, the future astrophysicist, was a mat partner. Bordley later graduated from Harvard Law School. He spent the next 30 years working for the Justice Department as a lawyer. Ed Bordley died Dec. 16 from a rare cancer of the thymus at the age of 61. I remember him at a Lower Gridiron Club banquet emceed by Joe Purzycki, former Caesar Rodney football coach and first white man to be named head football coach at a historically black college, Delaware State 1981-84 and James Madison 1985-90. Back to the banquet, Bordley worked for Attorney General Janet Reno (1993-2001), so of course coach Purzycki had a few Reno jokes. When Bordley got to the podium, he said, \"Coach I don't appreciate you making fun of my boss, Janet Reno,\" and Coach Joe quickly quipped, \"I'm sure she looks good to you .\" And that was that. Two guys and friends from the world of sports jousting at the head table. Jokes scripted in advance are like batting practice home runs--so what?--take the changeup deep in real-time game action, then come talk to me. Crime Dog - Bruce Barrett, Cape Class of 1979, who bears a striking resemblance to former Major League Baseball player Fred \"Crime Dog\" McGriff, is one of the best three-sport athletes in the 49-year history of the school district. Bruce will be inducted into the Delaware Afro-American Sports Hall of Fame April 21 at the Modern Maturity Center in Dover. Bruce is going in as a football player. He is part of the Cape/University of New Haven connection. Bruce had a crazy good college career and was a real pro prospect, but was hobbled by injury. He also played basketball and ran track at Cape. I was his track coach and have a ton of funny stories to tell but nowhere to sell them. Bruce lives in Texas, works in the oil fields, drives a big old truck and looks like he can still play. Delaware Sports Hall of Fame - Contemporary candidates for 2018 include downstate basketball guys <mark>Jimmy Allen</mark> and Charles Rayne, and Heidi Pearce, former women's lacrosse coach at St. Andrew's who is now the head coach at Washington College. Eddie Pettyjohn, a native of Milton and noted race car driver, is nominated in the veterans category. Snippets - Luke Oliphant (Sussex Tech), a freshman on the UMass baseball team, started in the outfield for the Minutemen in the season opener March 2 versus Pitt in Kissimmee, Fla.. Luke scored the tying run in the top of the ninth, after walking and moving to third on a pair of groundouts. He scored on a passed ball, tying the game at 2-2. But the Panthers scored in the bottom of the ninth to win the game. Good job, Luke. Starting for UMass as a freshman is no joke. I w atched Mercer University beat Gardner Webb 16-6 on the Big South Network March 2. Freshman Izzy Cryne (Cape) had five saves and earned her first college lacrosse win. Mercer followed that up with a win over Davidson. Izzy looked good, very quick, locked in and clearing passes on the money. Smyrna is the only downstate boys' team still alive in the semifinal round of the DIAA state tournament. St. Thomas More is still alive on the girls' side. Go on now, git! Sports Editor Emeritus"}, {"articleID": "2018071314_00052593_W", "names": {"David Garcia": ["Q21284974", "Q27830908", "Q3703187", "Q56281988", "Q56928231"]}, "date": "2018-07-13", "url": "http://phoenixnewtimes.com/news/arizona-abolish-ice-david-garcia-kyrsten-sinema-doug-ducey-steve-farley-10606198", "content": "\"I do not support abolishing ICE,\" Congresswoman Kyrsten Sinema says in Welton's cellphone video of the prickly exchange on July 5. \"That wasn't the question I asked,\" Welton says. Sinema cuts him off. \"I do believe that ICE does provide some important functions in our community,\" she says, explaining that ICE deports dangerous people. \"But I do believe we should reform ICE, so that ICE is not targeting individuals who have done nothing wrong in our country,\" Sinema continues. Welton asks the question again, interrupting her, but Sinema tells him that she has to move on. \"I will not call for the abolition of ICE, but I do believe I just explained my opinion,\" she says. \"So, thanks .\" Part 2: I asked @ RepSinema @ kyrstensinema again: \"Will you use your platform as a member of congress to call for a halt in ICE operations that target immigrants with no criminal history?\" She has chosen not to speak up. pic.twitter.com/IIzK2UOjA3--connor (@ c_boy17) July 6, 2018 A 24-year-old who lives outside Tucson, Welton was there to watch Congresswoman Kyrsten Sinema speak about her quest to become an independent - minded senator. Sinema chatted. She snapped photos. And shortly after the awkward exchange about ICE, she was whisked away to the next campaign stop. Sinema is not the only Arizona Democrat grappling with the abolish ICE movement from the party's unapologetic left flank. But not every Democrat has responded like her. This week, Democratic gubernatorial candidate and Arizona State University Professor <mark>David Garcia</mark> threw his support behind the movement to erase ICE as a federal agency, though he has eschewed the specific phrase of abolishing ICE. Both are running competitive races in a red state, yet they've charted wholly different strategies: <mark>Garcia</mark> has mounted a full-throated progressive campaign for the governor's office; Sinema barely qualifies as a member of the Democratic Party in the eyes of left-leaning voters like Welton. ICE is a relatively new agency that was formed just 15 years ago during the creation of the Department of Homeland Security. And because of the Trump administration's crackdown on immigrants and the traumatic family separation policy, Democratic candidates are increasingly fielding calls to deep-six the agency. Alexandria Ocasio-Cortez, a 28-year-old Democrat in New York, stunned the political establishment last month by taking out a 10-term congressman in a primary. Since then, abolishing ICE, one of her planks, has taken over the mainstream debate. But as for Sinema, Ocasio-Cortez she is not. Sinema endlessly talks about a pragmatic approach to governing and touts her bipartisan credentials. She's right in that respect: In her Congressional voting record, Sinema has voted in line with Trump's position more than half the time, according to FiveThirtyEight. She voted for the anti-immigrant Kate's Law last year. A priority of Attorney General Jeff Sessions, the bill adds years to the prison sentences of people who repeatedly cross the border illegally. Sinema voted for the proposal \"to keep convicted and dangerous felons off our streets,\" she said at the time. And in 2015, Sinema voted to prevent the resettlement of Syrian and Iraqi refugees, citing \"a duty to keep our country safe from terrorism .\" She calls it pragmatism. Left-of-center voters call it something else. A spokesperson for Sinema did not respond to questions about specific reforms to ICE or why Sinema continues to field criticism from left-leaning voters. Gubernatorial candidate <mark>David Garcia</mark>. Joseph Flaherty Compare Sinema to <mark>Garcia</mark>, a veteran who has adopted a menu of liberal policy positions in his race to unseat Governor Doug Ducey. <mark>Garcia</mark> is proposing free community college for Arizonans and supports universal health care through a Medicare-for-all plan. He was a constant presence at the #RedForEd protests during the teachers' strike at the Capitol in late April--<mark>Garcia</mark> has a Ph.D. from the University of Chicago and works at ASU's college of education--and supports raising taxes to fund schools. So it makes sense that for <mark>Garcia</mark>, tweaking ICE is not enough. He issued a statement on Monday that condemned the administration's family separation policy, saying that Trump's actions \"demand that we rebuild our immigration system top-to-bottom and start by replacing ICE with an immigration system that reflects our American values, values I and so many before have served to protect .\" <mark>Garcia</mark>'s communications director Sarah Elliott suggested that a new agency, better attuned to human rights and the rights of families, could replace ICE, just as ICE replaced its predecessor, the Immigration and Naturalization Service. \"Our message is that we need to get away from the false choice of open borders versus Trump and Ducey's cruelty,\" Elliott wrote in an email. Ducey, on the other hand, spent the week leaning heavily on his experience as a border-state governor and the idea that the existing law-enforcement regime (and, by extension, him) protect Arizona. On Tuesday, Ducey published an op-ed in USA Today in which he called ICE a \"lifeline\" for border communities and criticized in stark terms the push to abolish ICE. \"I want to be clear--this call to abolish ICE is not only wrong--it is reckless, and puts the people of my state and others in direct threat,\" Ducey wrote. The governor has also spent this week touting the operations of the Arizona Border Strike Force, an amalgam agency Ducey created to combat smuggling and drug trafficking that includes state, federal, and local officers. Evidently, his campaign views these efforts as part of a winning strategy--Ducey's re-election slogan is \"Securing Arizona's Future .\" Running for statewide office in Arizona as a Democrat is difficult--certainly a contributing factor for Sinema moderating her positions over the years between her time as a more outspoken, liberal state legislator before she became a three-term congresswoman. Courtesy of Kyrsten Sinema/Facebook <mark>Garcia</mark> could tell you as much. He lost narrowly to Diane Douglas in the 2014 contest for superintendent of public instruction even though Douglas was widely viewed as a weak candidate. Nevertheless, in a midterm year when Democrats might capitalize on anti-Trump energy, the same year that a popular uprising of underpaid teachers swept Arizona, <mark>Garcia</mark>'s timing for the governor's race certainly seems right. Whether the broader voting public in Arizona is on board with his idea to abolish ICE is another question. Local polling firm Data Orbital released a poll on Wednesday that suggests Arizona voters at the moment are not sold on getting rid of ICE. Surveying 550 likely general election voters, the firm found that 80 percent of Republicans, 70 percent of Independents, and 39 percent of Democrats do not support abolishing ICE. In an email, Ducey campaign spokesperson Patrick Ptak said that based on these polls, \"it's no surprise (<mark>Garcia</mark>) is now trying to nuance his comments .\" Ptak called abolishing ICE an \"extreme position .\" Data Orbital President George Khalaf said that the poll is another sign of Sinema's canny sense for what will win over Arizona voters. \"Sinema knows how to not just read her base, but she knows how to have a good finger on the pulse of the state,\" Khalaf told New Times. \"She has been the loudest Democrat to ensure that she would not favor abolishing ICE .\" Khalaf's background includes a stint as a political director with the state Republican Party. <mark>Garcia</mark>'s main opponent in the Democratic primary, State Senator Steve Farley, said Monday that he favors fixing ICE as opposed to abolishing the agency. Polls show <mark>Garcia</mark> has a strong lead in the three-way Democratic primary matchup, and perhaps even a tiny edge over Ducey in the general election. The daylight that exists between <mark>Garcia</mark> and Sinema on ICE is tied up in a perennial question for Arizona Democrats. Do you run to the left, winning over voters like Welton--the future of a Democratic party in which abolishing ICE might become a platform plank--and lose in the general election? Or, like Sinema, do you absorb the criticism from your own party, cast highly questionable votes for Kate's Law and a halt to refugee settlement, and emerge as a victorious senator as a result? From Khalaf's point of view, the political fighting turf could be the determining factor for whether <mark>Garcia</mark> and Sinema succeed. \"It is a tale of two campaigns,\" Khalaf said. \"I just think that Sinema's running a campaign that's more like Arizona and, quite frankly, I think <mark>David Garcia</mark> is running as if he's running in a California or a New York .\" If you like this story, consider signing up for our email newsletters. SHOW ME HOW X SUCCESS! You have successfully signed up for your selected newsletter (s) - please keep an eye on your mailbox, we're movin' in! Welton, like Ocasio-Cortez, identifies as a socialist. After confronting Sinema last week, he left the Pima County headquarters unsatisfied with her response--Welton noted that during their exchange, he never even specifically asked Sinema if she would abolish ICE. Sinema is \"doing everything she can do to court conservative--frankly, racist--white voters hoping that will put her over the top,\" Welton said in an interview. \"And in the course of that, she is abandoning the actual people who are the Democratic Party base .\" In spite of his discomfort with Sinema, Welton conceded that in November, he'll vote strategically and definitely won't support the Republican in the race. But questions about immigration enforcement are going to continue to trail Arizona Democrats, Welton said. \"Democrats definitely should stand up for immigrants' rights and oppose abuses by government agencies that are targeting immigrants,\" Welton said. \"And that's going to be messaged in different ways in different districts, but that should be the message .\" Joseph Flaherty is a staff writer at New Times. Originally from Wisconsin, he is a graduate of Middlebury College and Columbia University's Graduate School of Journalism. Contact:"}, {"articleID": "2010072213_00369241_W", "names": {"Elizabeth Gilbert": ["Q231424", "Q43395012"]}, "date": "2010-07-22", "url": "http://nypost.com/p/news/national/sherrod_offered_usda_job_dealing_nTpCzWIaxYOddT1sVJiw6J", "content": "ousted usda (u.s. department of agriculture) official shirley sherrod said thursday that the department offered her a new position which would involve dealing with discrimination and civil rights in its office of outreach. u.s. agriculture secretary tom vilsack extended the offer alongside an apology wednesday, after it emerged that apparently racist comments she made in a video clip that led to her resignation were taken out of context. sherrod told cnn's \"american morning\" thursday that she told vilsack she appreciated the apology but was \"not so sure\" about accepting the new position, the exact nature of which was not yet clear. \"i need time to think about it,\" sherrod said, adding that she wanted to see how committed the department was to addressing civil rights issues. sherrod--an african american and the department's former georgia director of rural development--also questioned vilsack's claim that the white house was not involved in his decision to pressure for her resignation. \"if not the president, someone there at the white house was involved in that,\" she said, noting that \"it would be great to talk to the president, but...i would not insist on an apology from him .\" in a separate interview on abc's \"good morning america,\" she commented, \"i can't say that the president is fully behind me...i would hope that he is .\" sherrod was pressured to resign monday after an edited video clip of her remarks to an naacp (national association for the advancement of colored people) audience was circulated by conservative blogger andrew breitbart. the clip apparently portrayed her saying she withheld help to a white farmer--but when the complete video of her remarks emerged, it showed that her comments were taken out of context. vilsack apologized privately to sherrod wednesday before issuing a publicly apology before reporters. \"the buck stops with me, as it should...this is a good woman, she's been put through hell. i could have done and should have done a better job,\" vilsack said. asked repeatedly about possible white house involvement in the decision to get rid of sherrod, vilsack said that a white house liaison may have been contacted about the matter, but that ultimately the decision was his and he bore full responsibility for it. cons fuming method acting russell simmons kimora lee ready to sell 13.9 m manse sumner redstone basks in bribe uproar <mark>elizabeth gilbert</mark>'s hubby won't publish his version of \"eat pray love' story celebrity photos: july 22, 2010 celebrity mugshots whale vs. sailboat mercedes-benz fashion week swim 2011: luli fama angels rock reeling hughes, rout yankees jaw and order five yankees make si's top earners list; tiger woods tops list, but loses 9m new york post is a registered trademark of nyp holdings, inc. ."}, {"articleID": "2019080809_00144406_W", "names": {"Thomas Frank": ["Q13469562", "Q1497420", "Q2744752", "Q57481970"]}, "date": "2019-08-08", "url": "https://footballleagueworld.co.uk/arsenal-player-finalises-switch-to-london-club/", "content": "Share Tweet Arsenal defender Dominic Thompson has made a deadline day move to Championship side Brentford, as reported by the Gunners' official website. The 19-year-old has not broken through at the Emirates during his time there and makes a permanent switch to West London. The left back made the news back in November when he was selected by Unai Emery to travel for a Europa League game against FC Vorskla. He didn't get on the field and hasn't been able to capitalise on being noticed by the manager. He captained the Arsenal Under 16 side and occasionally played central midfield, but converted to a left back by the time he hit the Under 18s. He was a key part of the side that reached the FA Youth Cup final against Chelsea in 2017/18. He earned his first professional contract on the back of that run, signing the deal in June 2018. He progressed to their Under 23 setup but has now been allowed to leave the Emirates in search of first team football. <mark>Thomas Frank</mark> is delighted to have secured the deal, telling his club's official site: \"Dominic is a very talented young player and over the past two years the speed of his development has increased. He is a technically very good left back or left wing back .\" The Verdict This could be a great signing for Brentford; you only have to look at the rapid progress Marc Bola has made since leaving their academy and venturing out into senior football. Thompson won't be an immediate starter for Brentford, he'll play second fiddle to Rico Henry, but he's sure to be on the edge of the first team. He's not a traditional full back, he's the new breed that is able to get forward and help out in attack, suited to a wing back role as much as a traditional left-sided player in a flat back four. That will suit Brentford's quick build-up play and high rate of chance creation. If he gets a run in the first team he could be an understated signing that turns into a real gem. Related Topics: arsenal brentford dominic thompson Don't Miss \"He's not here to make up numbers'--Plenty of Leeds fans react to fresh Deadline Day arrival Gary Hutchinson"}, {"articleID": "2018020710_00009389_W", "names": {"Roberto Pereyra": ["Q42398698", "Q55468620", "Q93504"]}, "date": "2018-02-07", "url": "https://www.thesportreview.com/2018/02/chelsea-fc-west-brom-thibaut-courtois-positive-message/", "content": "Terms of use Thibaut Courtois sends positive message to Chelsea FC squad ahead of West Brom The Chelsea FC goalkeeper underlines the unity in the Blues squad despite Monday night's 4-1 loss at Watford By The Sport Review staff Wednesday 7 February 2018, 09:15 UK @ thesportreview Chelsea FC goalkeeper Thibaut Courtois Photo: Thibaut Courtois / Instagram Thibaut Courtois has urged the Chelsea FC squad to regroup ahead of next week's trip to West Brom. The defending Premier League champions lost 4-1 to Premier League strugglers Watford at Vicarage Road on Monday night to slump to successive top-flight defeats. Troy Deeney broke the deadlock in the first half after Courtois brought down Gerard Deulofeu inside the Chelsea FC penalty area minutes after Tiemoue Bakayoko's sending off. The Belgium international Eden Hazard levelled in the 82nd minute before goals from Darryl Janmaat, Deulofeu and <mark>Roberto Pereyra</mark> in the final six minutes sealed a 4-1 home win. The west London side have lost successive Premier League games following a 3-0 loss to Bournemouth at Stamford Bridge last week. Chelsea FC are in fourth place in the Premier League table and a mere point ahead of Tottenham Hotspur. Courtois was searching for the positives ahead of Chelsea FC's home clash against West Brom at Stamford Bridge next Monday. \"Obviously we are disappointed with the two results we have had in the last week, obviously it is not good but we have to regroup in training, have heads high and continue the hard work and just continue what we were doing,\" Conte told Chelsea's website. \"We have now two bad losses but we are a team with the manager, and everyone is positive about that, and we will try to do our best to win next week .\" Chelsea FC won the Premier League title with two games to spare last season after finishing seven points ahead of Tottenham Hotspur. The Blues will take on La Liga giants Barcelona in the Champions League round of 16 later this month."}, {"articleID": "2010093014_00099154_W", "names": {"Ian Macdonald": ["Q16244231", "Q20877160", "Q21455018", "Q43093838", "Q56253516", "Q56945677", "Q59347362", "Q5982106", "Q5982109", "Q5982110", "Q5982140", "Q5982142"], "Tom Mueller": ["Q16957590", "Q47112851"]}, "date": "2010-09-30", "url": "http://mnn.com/earth-matters/wilderness-resources/stories/gold-rush-on-the-gulf-researchers-clamor-for-cash", "content": "wilderness & resources gold rush on the gulf: researchers clamor for cash oil research: biologist eric hoffmayer of the university of southern mississippi's gulf coast research laboratory holds a satellite tag that he'll attach to a whale shark in the gulf. (photo: john flesher/ap) once a backwater in the world of oceanographic research, the gulf of mexico has suddenly become the site of a scientific gold rush, all because of the sharethe environmental disaster represents a once-in-a-generation research opportunity that has oceanographers salivating. there's big money - $500 million from bp alone - up for grabs. and for scientists who usually toil in near-obscurity, there's the prospect of lots of media attention. researchers are suddenly in demand, with more than 100 hired guns on the job. bp has signed up nearly 50 scientists to help defend it from legal action. the federal government has its paid experts, and so do attorneys suing bp. environmental activists have their own research vessels and scientists. at least 165 proposed studies are registered through a federal clearinghouse. some crucial supplies - such as boats - are hard to find. \"we've never had this many research vessels concentrated in the gulf at any one time - never,\" said corpus christi. \"it's been a flat-out crazy time .\" to try to bring order to what's going on, scientists studying the spill from around the country will gather in white house science office to talk about coordination and priorities. also in the next week or so, gulf states are expected to complete an agreement on how to hand out the $500 million in bp-pledged research money over the next decade. the gulf of mexico has gotten relatively little federal research support in the past. in the 20 years before the oil spill, the great lakes received more than $1 billion, while the chesapeake bay got just shy of half a billion. spending for the same time period on the much-larger gulf of mexico: $85 million. \"it's the hardest working of our ocean basins, but it's the most underfunded in terms of research monitoring and science,\" said <mark>ian macdonald</mark>. that's changing because of the worst offshore oil spill in u.s. history. hour after hour on a hot and windy september day, biologist eric hoffmayer bounced over choppy gulf waters in a fishing boat, hunting for whale sharks - one species among many that scientists are studying to measure how the spill has affected people and the environment. gulf coast research laboratory, is among the fortunate scholars who have snagged funding. he has had more luck landing money than whale sharks, at least on this outing, when none turned up. \"there's multiple sources of funding out there. you just have to know how to tap into it,\" hoffmayer said. two major types of research are taking place, and they often get confused by the public. one involves basic inquiries into questions such as where the oil has gone and what it means for the ecosystem, food web and public health. that is where bp has pledged to spend a half-billion dollars, with all findings to be made publicly available. the other type of research supports the federal government's natural resource damage assessment, or nrda, a part of the legal battle that eventually will determine how much money bp will pay for restoration. in the nrda process, both sides have hired experts and pledged them to secrecy. \"it is standard practice to ask such a litigation expert to maintain the confidentiality of communications with legal counsel,\" bp spokesman <mark>tom mueller</mark> wrote in an e-mail. likewise, the government may keep some data in this process secret, said national oceanic and atmospheric administration. noaa has 17 damage assessment teams working the spill, he said. under the 1990 oil spill law written after the exxon valdez disaster, both sides hire scientists, economists and attorneys and collect data in a legal process designed to \"make the public whole\" for loss of natural resources. billions of dollars are at stake with court fights likely to go on for years. but that's only a fraction of the research that's going on, scientists said. it's the general research money - including bp's half-billion - that most are seeking. the only stipulation from bp is \"the data is shared publicly when the results are in,\" <mark>mueller</mark> said. researchers and deans at several universities confirmed this. \"at one point i was sorely tempted to give the money back because frankly i didn't want the sea lab associated with bp money,\" said george crozier. but when he saw there were no strings, he accepted the money. national institutes of health, which then divided it among dozens of researchers. in florida, 233 proposals competed for $10 million in grants with only 27 getting funded. the gulf of mexico alliance, a consortium of state officials, is setting up a more permanent process for distributing the remaining $460 million from bp. \"i don't think $50 million a year is enough to study the problem as we know the scope of it,\" noaa's murawski said. environmental groups are getting into the act. greenpeace dispatched its 164-foot research ship arctic sunrise for a three-month tour of the gulf, where it is hosting university scientists for a variety of spill-related studies and collecting water samples. the funding scramble has created a geographical rift. scientists in the gulf region contend they should get most of the money because they know the area better and have been shortchanged in the past. those from elsewhere say grants should be awarded on the basis of researchers' credentials and the worthiness of their study proposals. gulf coast lab. many scientists in gulf states believe \"this is our time, this is our spill,\" he added. there's a sense of urgency behind the push for funding. ideally, scientists would have taken measurements before, during and after the spill to see how the ecosystem changed. their efforts were hampered for months by a shortage of vessels and poor access to the spill area as the government and bp focused on plugging the leak. now, the oil is becoming harder to find with each passing day. notify me with an email when other people comment on this article. worldshares lets you earn donations for your favorite nonprofit. earn up to 20 points now."}, {"articleID": "2018061506_00153703_W", "names": {"Paul Cunningham": ["Q10518573", "Q23014437", "Q7150060", "Q7150061"]}, "date": "2018-06-15", "url": "http://kgun9.com/news/local-news/jesse-owens-park-makeover-nearly-complete", "content": "Jesse Owens Park makeover nearly complete 10:31 PM, Jun 14, 2018 Share Article Previous Next Ward 2 City Council member <mark>Paul Cunningham</mark> has high hopes for the future of Jesse Owens Park KGUN9 On Your Side Copyright 2017 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next TUCSON, Ariz. - It's been more than a year in the making, but Jesse Owens Park on Tucson's east side is nearly complete. While some parts are fenced off and still being renovated, much of the park has come back to life, like the baseball and softball fields. Debi Beatty, who's son plays on the field, feels that he can now play safely. \"They can play on that field without falling in holes,\" she said. \"It's great .\" About a year ago, Beatty approached her City Council representative, Ward 2's <mark>Paul Cunningham</mark>, and KGUN9 On Your Side, explaining she felt that the park was in a state of disrepair. Soon afterwards, the park began to transform. But this past April, well into renovations, Beatty didn't think the park would be ready for the summertime. \"No,\" she said. \"No. . Not at all .\" But now, with much of it usable, she's on board and pleased with the progress. \"They're really kicking some booty out here,\" Beatty said. \"I mean, look at the fields, they're awesome .\" <mark>Cunningham</mark> says this project was long overdue. \"It's really coming together,\" he said. \"There's no use in having a park if no one is going to use it .\" Once all of the pieces are complete, including the pool, parking lot, and basketball court, <mark>Cunningham</mark> has high hopes for the future of Jesse Owens Park. That being said, he is asking people in the area to be patient and stick to the parts that are totally complete for now, so that the grass will grow in well. \"Try to curb that use just a little bit longer, as the monsoon comes in and we get the benefit of the rain,\" <mark>Cunningham</mark> said. \"When we do re-open we'll have a lush, green park. I'm really excited about it and I think so is the neighborhood .\" The City Council member explained the nearly $2 million for the project came from seven different sources. <mark>Cunningham</mark> plans to have a soft re-opening for Jesse Owens Park sometime in August. Beatty plans to be there, and is looking forward to the future of the park. \"We all worked together, all came through. It's great,\" she said. \"This is just the beginning of what its going to be. It's amazing already, can you imagine it in another month?\" Copyright 2018 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2012050921_00024870_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2012-05-09", "url": "http://washingtonpost.com/blogs/right-turn/post/interview-with-paul-ryan-part-1/2012/05/09/gIQA1WyhDU_blog.html?wprss=rss_opinions", "content": "rep. <mark>paul ryan</mark> (r-wis .) isn't saying anything about the vice-presidential nomination that he hasn't said over and over again. his attitude these days is that it is somebody's else decision down the road, and the chatter only takes the focus off the substance of the presidential race. so when i sat down with <mark>ryan</mark> in a conference room across the hall from the house budget committee hearing room, we instead talked about europe, the defense sequestration cuts, immigration and the presidential race. we start with the big news this week from greece and france's elections. liberals are accusing <mark>ryan</mark> of preaching the same \"austerity\" supposedly favored by defeated european governments. he exclaims, \"we're not doing austerity! we need to preempt austerity and get our fiscal problems solved on our own terms .\" countering that in real austerity you won't have the luxury of \"exempting seniors from changes\" in entitlement programs as he has proposed, he tries to put his plan in context: \"we're growing spending at 3 percent instead of 4 1/2 percent to allow the economy to grow and to get the debt [to a point that it is] containable .\" he says his liberal critics are attempting to \"change reality to fit a narrative:\" if only a few people paid a few more dollars in taxes ...' \"that's not only dishonest, but, he says,\" it will lull us into complacency. \"and, he fears, that attitude will therefore make it all the more difficult to tackle our problems. we moved on to the budget sequestration. the exercise is to come up with cuts that would substitute for the defense sequestration cuts mandated by the 2011 budget control act and the failure of the supercommittee. as only a wonk like <mark>ryan</mark> can say, he cheerily remarks on the reconciliation process going on across the hall:\" i'm enjoying it. \"he makes the point that the last time reconciliation was used for its intended purpose - budget reduction - was 2005 when $40 billion was cut over five years .\" we are doing more than three times that. \"<mark>ryan</mark> reminds me,\" defense secretary [leon] panetta said [the defense cuts] would be \"devastating .'\" so the house is going through the budget, focusing especially on so-called mandatory spending. this isn't just an academic exercise, <mark>ryan</mark> says: \"the purpose is to be specific with the american people .\" as for alternatives to sequestration, <mark>ryan</mark> notes that the office of management and budget, the senate and the white house \"have none .\" he stresses that in putting up a concrete substitute for sequestration of defense funds, \"we are doing what leaders do .\" that entails coming up with cuts of 405 percent (over five years) of the total of one year of sequestration cuts. he explains that much of this is obtained by removing duplicative programs and practicing good government. for example, currently there are 47 overlapping job training programs spread across 9 different government agencies. on food stamps, <mark>ryan</mark> would block grant the program for greater efficiency as was done with welfare reform in the 1990's. food stamp spending has increased by 270%. under <mark>ryan</mark>'s reforms to curb waste, pair back the failed stimulus, and end duplication food stamp spending would still be 260% higher in 2013 than in 2002. . <mark>ryan</mark> says his proposal does include some basics: \"you need to be eligible in order to receive food stamps .\" in other cases, <mark>ryan</mark>'s proposal would shut down what he calls \"slush funds,\" for example the bailout monies in the dodd-frank legislation, and shut down inefficient bureaucracies (e.g. the office of financial research) or bloated ones that don't target those in need (e.g. federal flood insurance). <mark>ryan</mark> is candid that after the house does its work \"it will go on the shelf .\" nevertheless, he adds, \"it will show we are prepared to lead .\" and he doesn't rule out the possibility some of this could be accomplished in the lame duck session (\"it depends who wins .\" ) as for the presidential race, he says he has been in touch with the romney campaign: \"they're pleased to see we are leading. they are pleased to see we have put out specifics .\" <mark>ryan</mark> says the president's rhetoric is \"so politically crass. we're used to it. we're used to the demagoguery .\" he continues, \"i really think people will grow tired of it. it's cynical divide - and-conquer politics,\" in contrast to romney's \"uplifting, unifying message\" and totally different vision is precisely the way to go. romney is putting out a pro-growth, pro-free market vision. <mark>ryan</mark> says that in contrast to romney, \"the president thinks life is a zero sum game. he thinks the economy is a zero sum game .\" if someone gets ahead, in obama's view, it was because someone else got less or was exploited. <mark>ryan</mark> says, \"that's not how it works .\" in part two of the interview, <mark>ryan</mark> talks about immigration reform, entitlement reform and the choice in the 2012 election."}]