[{"articleID": "2020020909_00056340_W", "names": {"Susan Rice": ["Q23848423", "Q50612"]}, "date": "2020-02-09", "url": "https://www.onenewspage.com/n/Entertainment/1zlqhn9p4t/Susan-Rice-tells-Snoop-Dogg-to-back-the.htm", "content": "One News Page <mark>Susan Rice</mark> tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making threat Sunday, 9 February 2020 (31 minutes ago) Former national security adviser <mark>Susan Rice</mark> Friday told rapper Snoop Dogg to\" back the **** off \"of CBS journalist Gayle King after the rapper slammed her for an interview she did about Kobe Bryant last week. Bill Cosby thanks Snoop Dogg for going after Gayle King, Nicki Minaj is saying,\" Yikes \"with her new song and Meghan Trainor covers Harry Style's\" Adore You. \"These are the top stories in music for Friday, February 7th. You Might Like SKIPPACK TOWNSHIP, PA--Snoop Dogg made it abundantly clear how he felt about Oprah Winfrey and Gayle King earlier this week. On Thursday (February 6), Uncle Snoop blasted the two media heavyweights. . Credit: HipHopDX Duration: 02:49 Published Snoop Dogg attacked Gayle King for bringing up Kobe Bryant's sexual assault case and added,\" Free Bill Cosby. \"Credit: HuffPost NOW News Duration: 01:32 Published 2 days ago Recent related news from verified sources Hip-hop star made a number of explicit comments about the journalist after an interview in which she addressed the rape case against late NBA star Kobe Bryant Independent 22 hours ago Jailed TV icon Bill Cosby is riding with Snoop Dogg. The former Hollywood superstar has social media's attention after making a rare Twitter appearance to...SOHH Tweets about this pop. finna #f 4f76412d8e952ceb09ad678f8116f08 #foxnewsentertainmentmedia <mark>Susan Rice</mark> tells Snoop Dogg to\" back the **** off' Gay...https: //t.co/k9lXi632Yc 1 minute ago <mark>SPORTZCODetroit Susan</mark> Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/bxWt3TBqa8 1 minute ago Drake The Type <mark>To\"</mark> Susan Rice tells Snoop Dogg to \"back the **** off' Gayle King after rapper's profane video; he later denies making...https: //t.co/mPuhFeusp1 3 minutes <mark>ago Andrea</mark> Wells Susan Rice Tells Snoop Dogg to\" Back the **** Off \"Attack on Gayle King for Kobe Bryant Question https: //t.co/dFhwwXGUZY 8 <mark>minutes ago</mark> Nalanda Library Susan Rice tells Snoop Dogg to\" back the f *** off' after he lashed out at Gayle King for Kobe Bryant rape questions...https: //t.co/TkjjiVklRy 50 <mark>minutes ago</mark> Natural Born Sinner Susan Rice Tells Snoop Dogg to \"Back The F ** k Off\" Gayle King https: //t.co/XtrCgmwzYM 3 hours ago Larry Winston = Amigo, this is serious. She bravely stood up for a friend, something we must ALWAYS <mark>do</mark>, plus the fact that Susan b <mark>... https: //t.co/aGX7pVjLxs</mark> 3 hours ago Kaboon_Viper Susan Rice tells snoop dogg to back the f #@ $k off. #rkelly #snoopdog #gayle #Oprah https: //t.co/pWjZvNZTZA 3 hours ago"}, {"articleID": "2009022803_00001226_W", "names": {"Wayne Dyer": ["Q4018598", "Q545901"]}, "date": "2009-02-28", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=179071744&blogId=452331753", "content": "gender: female status: in a relationship i may not always like this \"aging process' or\" how the world has changed', but as i was recently reminded by my brother, \"it is was it is .\" i now have that saying plastered up above my front door where i can see it before i leave the house each day. the other saying i have up over the kitchen door, \"remember rule 6\" which comes from a story that dr <mark>wayne dyer</mark> tells in his book \"inspiration'. in a nut shell, rule 6 is\" don't take yourself so damn serouisly!' i have 2 older brothers and 1 sister, (she's my favorite sister!). i love my siblings. they had more to do with raising me than our parents did, for the most part. i will be forever grateful for them. they are who i watch and listen to with each phase of life we go through. i think to myself, \"if they can do it so can i.' not much different from being 1 to being 51 as far as looking up to one's siblings. our parents teach and guide us through childhood with the consistent feeling of protection and safety that only a parent can provide in a hug or in the explanation of why solider ants won't eat you. from my father i learned to think with both sides of my brain, which helped me to solve a problem mathematically and then write a sonnet or poem to complement it, from my mother i learned the history of paintings and artists, through books and museums, paintings, sculptures & books. to not only see color and shapes but to see their movement and feel them as they are in nature in 3 dimensional layers, how to study faces & things and then draw them as i saw them. as siblings, we teach and guide each other without realizing it at the time of the lesson which becomes crucial knowledge that is used again and again through out our life time without conscious thought of where the knowledge originated from, like a family heirloom that we temporarily forgot who gave it to us. from lance i learned the importance of a different vantage point when he put me on his shoulders to see in a big mirror how to learn by just being still and listening to a room full of people and to hear the quiet voice inside that keeps us from danger, to find strength & answers in nature; solace in creativity & music. from denise i learned the art of matching stripes & plaids in sewing, how to bake breads & cookies that keep people dropping by for more. how to preserve special memories in journaling and leave out inapplicable, the patience of sharing with in a family & how to play with children, the importance in letting go of past hurts to make room for happier memories from marc i learned team work and strategy in playing football and basketball, i learned responsibility and financial accountability by discerning want vs. need, the value in not showing feelings through facial expression in business, how to stand up for my own integrity and not be backed into a corner, teach a man to fish; and you have fed him for a lifetime\" my family has and continues to teach me well, and i hope"}, {"articleID": "2013092523_00055157_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Mike Lee": ["Q21064126", "Q30122331", "Q55622025", "Q627098", "Q6847648", "Q6847650", "Q6847651", "Q6847652", "Q6847653"], "Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"]}, "date": "2013-09-25", "url": "http://www.denverpost.com/politics/ci_24170331/cruz-vows-speak-till-he-cant-against-obamacare?source=rss", "content": "WASHINGTON-Tea party conservative Sen. Ted Cruz ended his all-night talkathon to dismantle President Barack Obama's health care law after 21 hours and 19 minutes as the Senate pushed ahead to a test vote Wednesday on a bill to avert a government shutdown. Weary after a day and night on his feet, Cruz simply sat down at 12 noon EDT, the predetermined time for the Senate to adjourn, as several of his colleagues applauded. Senate Republicans and some House members congratulated the Texas freshman. As Cruz' allotted speaking time was nearing its end, he offered to skip the initial vote and shorten debate on the underlying stopgap spending bill that's required to avert a government shutdown after midnight on Monday. The Senate's top Democrat, Majority Leader <mark>Harry Reid</mark>, said the vote would go ahead as planned. <mark>Reid</mark> shrugged off Cruz' effort. \"For lack of a better way of describing this, it has been a big waste of time,\" <mark>Reid</mark> said. Since Tuesday afternoon, Cruz-with occasional remarks by Sen. <mark>Mike Lee</mark>, R-Utah, and other GOP conservatives-has controlled the Senate floor and railed against Obamacare. At 10:41 a.m. EDT Wednesday, Cruz and his allies reached the 20-hour mark, the fourth-longest Senate speech since precise record-keeping began in 1900. That exceeded March's 12-hour, 52-minute speech by Sen. Rand Paul, R-Ky ., like Cruz a tea party lawmaker and potential 2016 presidential contender, and filibusters by such Senate icons as Huey Long of Louisiana and <mark>Robert Byrd</mark> of West Virginia. With no food or restroom breaks, his tie finally loosened, Cruz was helped by eight of his conservative allies who gave him brief respites by asking lengthy questions as permitted under Senate rules, though he was required to remain on his feet. Cruz said he has learned that defying party leaders is \"survivable,\" adding, \"Ultimately, it is liberating\" and that his long evening involved \"sometimes some pain, sometimes fatigue .\" But he added, \"You know what? There's far more pain in rolling over ....Far more pain in not standing up for principle .\" Republican leaders and several rank-and-file GOP lawmakers had opposed Cruz's time-consuming effort with the end of the fiscal year looming. They fear that Speaker John Boehner and House Republicans won't have enough time to respond to the Senate's eventual action. Two financial deadlines loom-keeping the government operating after Oct. 1 and raising the nation's borrowing authority. In a letter to Congress on Wednesday, Treasury Secretary Jacob Lew said the government will have exhausted its borrowing authority by Oct. 17, leaving the United States with just $30 billion cash on hand to pay its bills. That's a slightly worse financial position than Treasury predicted last month and it adds to the pressure on Congress to increase the government's borrowing cap to avert a first-ever U.S. default on its obligations. Determined to pressure the Democrats, Republicans have raised the possibility of adding a one-year delay to the individual mandate of the health care law to any legislation to raise the borrowing authority. Paul, who has questioned Cruz's tactics, gave the admittedly tired Texan a respite Wednesday morning by joining the debate and criticizing Obamacare. But in a reflection of the limited GOP support for Cruz' effort, no members of the Senate leadership came to the Texan's aid. Cruz did, however, get help through the wee hours of the morning from <mark>Lee</mark>. <mark>Reid</mark> downplayed the significance of Cruz's speech after arriving at the Capitol Wednesday morning. \"He raised some money with the tea party folks,\" <mark>Reid</mark> said. \"That's what it's all about .\" The House-passed measure is required to prevent a government shutdown after midnight Monday and contains a tea party-backed provision to \"defund\" implementation of what's come to be known as \"Obamacare\". Cruz is opposed to moving ahead on it under debate terms choreographed by Democrats to defeat the Obamacare provision. The mechanics of advancing the bill were overshadowed by Cruz's speech, which included a reading of Dr. Seuss' \"Green Eggs and Ham\" to his daughters back home in Texas. \"When Americans tried it, they discovered they did not like green eggs and ham and they did not like Obamacare either,\" Cruz said. \"They did not like Obamacare in a box, with a fox, in a house or with a mouse. It is not working .\" Senate rules are working against Cruz, who also has angered many GOP colleagues who complain privately that the freshman has set impossible expectations at the expense of other Republicans. Some of Cruz's leading allies include organizations like the Senate Conservatives Fund and the Club for Growth, organizations which frequently donate money to conservatives challenging more moderate Republicans in primaries. At issue is a temporary spending bill required to keep the government fully open after the Oct. 1 start of the new budget year. Hard-charging conservatives like Cruz see the measure as an opportunity to use a must-pass measure to try to derail Obama's signature health care law. Under pressure from Cruz and tea party activists, House GOP leaders added the anti-Obamacare language to the funding measure despite fears it could spark a partial government shutdown that could hurt Republicans in the run-up to midterm elections next year-just as GOP-driven government shutdowns in 1995-96 help revive the political fortunes of President Bill Clinton. \"I just don't believe anybody benefits from shutting the government down, and certainly Republicans don't,\" said Sen. Orrin Hatch, R-Utah. \"We learned that in 1995 .\" Cruz took the floor at 2:41 p.m. Tuesday, vowing to speak until he's \"no longer able to stand .\" Wearing black athletic shoes, he filled the time in a largely empty chamber, criticizing the law and comparing the fight to the battle against the Nazis. He talked about the Revolutionary War, the Washington ruling class and his Cuban-born father who worked as a cook. Missing from the debate were top Republicans like Senate Minority Leader Mitch McConnell of Kentucky and Cruz's home-state GOP colleague John Cornyn, who say that on a second vote later this week, they will support ending Cruz's effort to derail the funding bill. That vote is crucial because it would allow top <mark>Reid</mark> of Nevada to kill the Obamacare provision on a simple majority, instead of the 60 votes often needed for victory. Democrats control the chamber with 54 votes. \"I think we'd all be hard-pressed to explain why we were opposed to a bill that we're in favor of,\" McConnell told reporters Tuesday. \"And invoking cloture on a bill that defunds Obamacare...strikes me as a no-brainer .\" The overnight debate included some diversions. Despite his tenacity, Cruz did not surpass the longest Senate speech on record, a 24-hour, 18-minute filibuster by South Carolina Sen. Strom Thurmond against the civil rights act in 1957. Read this. Note: Our article pages automatically refresh every ten minutes. We cannot change this. If you start writing your comment on this page, please refresh the page before you do so - this will reset the ten-minute counter (your comment will be saved for you while you register). It's quick (it takes about 30 seconds) and we only require your email and name. Comments that include Use the \"Report Abuse\" link when necessary (you don't have to be a member, or be logged in) Lars Ulrich is keeping things in perspective when it comes to his band's new film, \"Metallica: Through the Never .\" Marvel's Agents of S.H.I.E.L.D.' is most buzzed-about fall show"}, {"articleID": "2018051419_00156316_W", "names": {"Rebecca Smith": ["Q30907428", "Q39072694", "Q43525202", "Q440719", "Q45729447", "Q47452564", "Q7301927"]}, "date": "2018-05-14", "url": "http://www.fox46charlotte.com/home/getting-results/memorial-honors-us-army-soliders-father-buried-on-family-farm", "content": "Image Gallery 2 PHOTOS MONROE, NC (FOX 46 WJZY) - A young military couple in Monroe was honored for their service this weekend. Purple Heart Homes created a memorial for the woman's dad who served in the Special Forces. \"He was totally supportive of me joining the military,\" Leah Schumacher said. Schumacher joined the U.S. Army when she was 22. Her dad was Special Forces and served in Vietnam. \"I had heard stories about him being a Green Berets, but I didn't really fully grasp the gravity of that,\" Schumacher said. Their bond as father and daughter strengthened as fellow soldiers. Leah deployed to Iraq in 2003. \"I called my father from Germany. Of course I was sobbing. He said,\" Sweet girl, the Lord is going to protect you in Iraq just like he protected me in Vietnam .' And he was right, \"Schumacher said. She's the first woman in her family to join the military .\" Being the first in your family to do something I think is already pretty special. Then being the first female in your family to serve your country is pretty special as well, \"Schumacher said. Fast-forward a few years, Leah met her husband Jason, also an Army veteran. They have two little boys Gavin and Bryce and live in Monroe where Leah grew up .\" I lived here for 22 years before I joined the Army. I joined the Army in 2003. When I got out and after my husband and I both met, my parents vacated the property and we moved in. It's been a huge blessing to live where I grew up. \"Her childhood home needed some time, love, and care. These people had the time, love, and care to give .\" It's important to give back to these families and make an impact on their lives, \"<mark>Rebecca Smith</mark> said. <mark>Smith</mark> is giving back through a charity called Purple Heart Homes. Many of the people helping paint, plant, and weed are colleagues from MSC Industrial Supplies in Davidson. Her job is special. Leah explains .\" March 31st of last year, my father passed away from Agent Orange-related diabetes. He died unexpectedly. One of his final wishes is that he be buried here on our property, \"Schumacher said. <mark>Rebecca</mark> and her colleagues created a space that honors both Leah and her father William C. Sganga .\" He received a Purple Heart and a Bronze Star Metal for Valor for saving other people's lives on the battlefield, \"Schumacher said. <mark>Rebecca</mark>'s dad also died from an Agent Orange related illness. He was a Marine .\" My father was a Vietnam vet and that is dear to my heart. To be able to work on the grave-site was very endearing, \"she said. At the end of the day, everyone took a tour of their handiwork. Leah's husband Jason thanked Purple Heart Homes and MSC. Jason was injured in Iraq so even small tasks, he says, are a big help .\" A lot of it may have seemed small jobs or whatever. It's a tremendous help to us. It all adds up. Even pulling weeds wears me out on a normal basis. Don't think you didn't make a big difference today. In my mind you sure did, \"Jason said. A big difference that honored these two young veterans and the man who inspired Leah to serve her country .\" This is so awesome you all. This is so awesome, \"Leah said .\" Your dad would be proud, \"Jason said .\" He would. He would be very proud, \"Leah said. They placed two American flags next to the Green Berets' headstone."}, {"articleID": "2009101018_00121208_W", "names": {"Kevin Curtis": ["Q14950065", "Q1740112"], "Michael Johnson": ["Q16195604", "Q16238908", "Q190924", "Q1928051", "Q20667583", "Q21458865", "Q21484117", "Q29456", "Q29964620", "Q3856198", "Q4896337", "Q496521", "Q54667230", "Q55313528", "Q56853023", "Q57056207", "Q57427460", "Q5889087", "Q6831672", "Q6831675", "Q6831677", "Q6831678", "Q6831679", "Q6831680", "Q6831682", "Q6831683", "Q6831685", "Q6831687", "Q6831690", "Q6831692", "Q898451"], "Sean Mcdermott": ["Q7441226", "Q7441228", "Q7441229"], "Jason Campbell": ["Q19606939", "Q22003549", "Q82118"], "Chris Canty": ["Q3675459", "Q5106084"], "John Fox": ["Q12892062", "Q13459838", "Q19662010", "Q19750869", "Q24285717", "Q3809274", "Q44786513", "Q6233800", "Q6233806", "Q6233808", "Q6233810", "Q719030"], "David Carr": ["Q25189752", "Q27067531", "Q28421931", "Q3017629", "Q53546742", "Q55998472", "Q56395776", "Q669059"], "Tom Coughlin": ["Q1378304", "Q7815428"], "Richard Seymour": ["Q23657219", "Q2606618", "Q28421769", "Q51588642", "Q7328973"], "Greg Ellis": ["Q1332872", "Q18164749", "Q5605529", "Q940850"], "Darcy Johnson": ["Q3016007", "Q5222379"]}, "date": "2009-10-10", "url": "http://bloggingtheboys.com/2009/10/10/1077899/keeping-an-eye-on-the-other-beasts", "content": "more photos \"by rick havner - ap donovan mcnabb has been missing from the eagles' lineup since week 1. browse more photos\" and round and round the nfc south we go! in week four, the giants handled the cowboys on sunday. the redskins squeezed past the bucs and ship them off to face the eagles. panthers last played against the cowboys and will now host the redskins. and for those unbeaten giants...they get to sit at home while the jamarcus russell-led raiders pay a visit. 5-0 looks to be an expected reality for them. the combined record of teams the beast plays this week? 1-14. last game: bye next up: home vs. tampa bay (0-4) lesean mccoy productively available, the team has the option of rotating backs. mornhinweg was asked if the days of one feature back in the nfl are over. \"this is a tough, physical game,\" mornhinweg said. \"it's become very specialized as well. many teams have a normal-down back and then a third-down back and then a change-up guy. i think it's been over for quite some time with a few exceptions with those rare special players, which brian was and is .\" the question is whether westbrook would benefit from less work at this stage of his career. \"you don't know that,\" mornhinweg said. \"i would think that brian, when he's healthy, could handle a big load .\" healthy offensive weapons and a new, but old familiar face donovan mcnabb and brian westbrook will start on offensive, with michael vick in the wildcat as a bonus. newly signed jeremiah trotter will rotate at middle linebacker with <mark>kevin curtis</mark> may be held out as a precaution, but the eagles still have \"i've watched him his whole career,\" <mark>johnson</mark> said. \"he's a special player. i feel like it's an honor just to go out and finally see him live and be on the other side of the field .\" after a rough first start last weekend at washington, <mark>johnson</mark> can benefit from a good example. he arguably played too timidly and lacked the sort of dynamic plays mcnabb has made a career of - though that's probably expected given the difference in age (23 versus 32) and experience. <mark>johnson</mark> finished 13 of 22 for 106 yards with one touchdown and one interception for a 67.6 passer rating. jeremiah trotter, who has played for both philly and tampa, may only play on running downs. defensive coordinator <mark>sean mcdermott</mark>, though, emphasized incumbent starter omar gaither still figures into the plans. \"it's important to understand that omar gaither is a heck of a football player,\" he said. \"and his impact on this defense will not change .\" last game:16 -13 home win vs. tampa bay next up: @ carolina (0-3) at some point soon, however, lewis is expected to make recommendations on how to improve an offense that ranks 27th in the league in scoring with an average of 14 points. owner daniel snyder determined that zorn, who had never been a coordinator or head coach in the nfl before snyder gave him both jobs, needs outside help, and as lewis watches tape, he will develop opinions about zorn's schemes, zorn's ability as a play-caller and the team's talent level. through all the cutler-talk and the loss to the <mark>jason campbell</mark>. \"when there was speculation that we were going to get another guy to come on board and compete against him he worked hard,\" redskins coach jim zorn said. \"so that's just the way it was. he just worked hard, and worked extremely hard to get himself ready. there's never been another issue .\" well, other than the four-turnover game last week, the kind of sloppy effort (albeit in a 16-13 win over tampa bay) that had folks wishing the talk had turned into something tangible. \"up until last game, i was having a pretty good season,\" <mark>campbell</mark> said. \"you couldn't tell, after we won against st. louis, we still got beat up pretty good because we didn't win the way people thought we should have won. but our objective is just to win the game. it's not about how pretty it is. it's just about us winning the game .\" \"it's always good to have all of your guys out there at one time and being on the same page,\" said linebacker na'il diggs. \"<mark>chris</mark> got all of the reps in camp and we kind of got accustomed to his style of play and just hearing his voice. so it's big to get him back. it's good to have somebody back there with a vast knowledge of this defense .\" the panthers have sorely lacked in creating turnovers and that's an area harris has excelled in in the past. he set a team record with eight forced fumbles two years ago. \"i knew the head coach, spags (steve spagnuolo), from when i was in philadelphia, and he said he needed to get some young guys playing and see what they had, so i understood,\" thomas said. \"he said he wished i could have a three-week vacation and come back, but that's not the nature of the business. my agent called carolina and the rest is history, one day old .\" the panthers knew well of thomas' exploits, having faced him as a division rival during three seasons (2006-08) with the new orleans saints. head coach <mark>john fox</mark> also conferred with thomas when he was a free agent on the open market. new york giants (4-0) last game: 27-16 win @ kansas city next up: home vs. oakland (1-3) while some reports suggest that <mark>david carr</mark> would get the start. manning, of course, practiced for the first time this week on friday, taking about half the snaps with the first-team offense during the giants' practice. if he had a setback overnight, the giants probably wouldn't have allowed him to take the field saturday morning. but, when <mark>tom coughlin</mark> addressed reporters on friday, he said he would let manning participate if he had \"made some progress overnight .\" if eli's foot bothers him, the giants will have to rely more on their running game. this is an area the raiders could look to control. [t] he giants will be hard pressed to get off the edge because one of the raiders' few strengths is the play of their des: <mark>richard seymour</mark> and former cowboy <mark>greg ellis</mark>. the giants will have their work cut out for them to block those two, especially since starting te kevin boss likely won't play because of his ankle injury. te <mark>darcy johnson</mark> will have to show off the blocking skills he's developed over the past two years while rookie ot william beatty will have to be a big force as a second te. because of a torn meniscus, giants' lb michel boley will chase blackburn and others are expected to take his place. blackburn technically will replace boley in the starting lineup, but in reality it will take several people to replace what boley was able to do. losing him creates a chain reaction of change throughout the defense. because boley is such an athletic linebacker, he was able to stay on the field in sub packages and help with pass coverage. now the giants likely will take the linebacker off the field in those situations and replace him with safety <mark>michael johnson</mark> as the nickel linebacker. the giants are coming off a five-sack performance against kansas city last week and are allowing just 115 yards passing per game. a matchup against the league's lowest-ranked offense featuring a rebuilt offensive line must have the giants' eyes lighting up. he's the leader of the raider offense. is he? \"yes i feel [i am the leader] because if you look at it, the quarterback touches the ball every play. if i can do the smallest things to get guys in position to become successful, then that's what i look at it as. if anything is not going right, i might get a 2-yard gain or anything just to spark the guys to get going and move forward .\" however, on monday cable all but said the offense has no leaders, \"until the offense finds their leaders, who those guys are going to be, i think you're leadership's gotta come from anywhere on this football team .\" list of injured giants. out: lb michael boley (knee), dt <mark>chris canty</mark> (calf), lb bryan kehl (finger), cb aaron ross (hamstring). doubtful: te kevin boss (ankle). questionable: qb eli manning (foot), rb danny ware (elbow). probable: rb ahmad bradshaw (ankle, foot), wr domenik hixon (knee), g rich seubert (shoulder), lb clint sintim (groin), de justin tuck (shoulder). sure, the giants beat up on the bucs and chiefs the last two weeks and get another seemingly easy one against the raiders. but in week 6, dallas cowboys blog for the sb nation network. we talk cowboys 24/7/365. join the discussion but follow the 24 days ago 4 comments | 0 recs the vrr: cowboys must move forward by throwing back with the chiefs"}, {"articleID": "2016092516_01018920_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-25", "url": "http://in.reuters.com/article/usa-election-clinton-idINKCN11V0MW", "content": "For some Democrats, it's voting for Clinton - and keeping it quiet World News | Sun Sep 25, 2016 | 9:08 pm IST For some Democrats, it's voting for Clinton - and keeping it quiet U.S. Democratic presidential candidate Hillary Clinton talks with a member of her staff inside of her campaign plane as she flies back to White Plains, U.S. September 21, 2016. REUTERS/Carlos Barria By Amy Tennery | NEW YORKNEW YORK One would expect voters from the heavily Democratic Brooklyn neighborhood of Cobble Hill to pick presidential candidate Hillary Clinton in the Nov. 8 general election. Just don't expect them to advertise it. Like lawns and windowsills in liberal pockets across the country, much of the neighborhood is bereft of pro-Clinton signage in the final weeks before the election. It's a stark contrast to the 2012 and 2008 campaigns, when President Barack Obama whipped up a frenzy of support from Democrats and his signature \"Hope\" and \"Forward\" signs were ubiquitous. The scarcity of lawn and window signs is an indication of the Democratic nominee's struggle to generate enthusiasm among left-leaning voters, a challenge that's borne out in polling data, and could potentially haunt her if voters fail to turn out on election day. Clinton leads Republican challenger <mark>Donald Trump</mark> by four percentage points among likely voters, according to a Reuters/Ipsos poll released Friday. But Americans of all political stripes have been more critical of Clinton than they were of Obama when he was running for his second term four years ago, according to the daily tracking poll. Among Democrats, 78 percent say they have a favorable view of Clinton, lower than the 89 percent favorability rating Obama had at this point in the race in 2012. Clinton's favorability drops to 28 percent among independents versus Obama's 47 percent. Nancy Kimmel Viola, a 63-year-old social worker who lives about a mile away from Clinton's campaign headquarters in Brooklyn, keeps a \"Bernie 2016\" sticker taped to the front door of her Carroll Gardens home, a vestige of her support for the unsuccessful bid of Sen. Bernie Sanders. While she plans to vote for Clinton, she confesses that her \"heart's not in it .\" \"I have to vote for her .\" Viola said. \"Having <mark>Trump</mark> in there is too scary .\" In Denver, residents in the Democratic stronghold of Park Hill posted many yard signs over a local zoning issue, but few for the presidential race. \"Most of us around here will vote Democratic, we always do, but we're not overly enthusiastic for Clinton,\" said resident Pablo Marron. \"But we are united in our opposition to <mark>Trump</mark>.\" \"HOLD YOUR NOSE' In the heavily Democratic Denver suburb of Northglenn, banners for local office-seekers littered a major roadway, but there were no accompanying Clinton signs. In the affluent liberal Washington DC suburb of Chevy Chase, Maryland, signs for the Democratic nominee appeared only roughly once every 10 blocks. The lack of enthusiasm isn't just hitting the Clinton campaign. Americans from both major parties say they are generally less interested in voting this year than they were in 2012, according to the Reuters/Ipsos opinion poll, which compared results gathered during the first 20 days of September with the same period of 2012. The Clinton campaign did not respond to emailed requests for comment. Clinton's online store displayed roughly a dozen different signs and banners for sale, ranging from an 11-inch by 17-inch sign, sold at $10 for a pack of two, to a four-foot by six-foot\" Hillary for America \"banner, which retailed for $100. Sales data was not immediately available and a request for comment from the store went unanswered. For some, there is a\" hold your nose quality \"to this election, said Matthew Dallek, associate professor at George Washington University's Graduate School of Political Management .\" The lack of signage \"in liberal enclaves may indicate, Dallek said,\" that there just isn't this sort of enthusiasm that existed for Obama. \"But there are some blocks that buck the trend. On a street in Gowanus, Brooklyn, no fewer than four homes bore pro-Clinton signage, including a life-size cutout of the Democratic nominee, which rests in the windowsill of retired lawyer Chris Morrison's home. The beaming cardboard Clinton prompts many passersby to take pictures, said Morrison, a staunch Clinton supporter .\" You don't see as much signage this time around. In this neighborhood I don't get so concerned (because everyone is) more or less on the same page, \"said Morrison, 66 .\" I worry when I go to some other places. \"(Reporting By Amy Tennery in New York, additional reporting by Keith Coffman in Colorado, Jim Oliphant in Washington, D.C. and Chris Kahn in New York; Editing by Mary Milliken) Next In World News"}, {"articleID": "2010110117_00019424_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2010-11-01", "url": "http://thestar.com/entertainment/celebrities/conan/article/883795--conan-spins-a-late-night-web", "content": "the king of late night is dead. love live the king of the morning after web check. for all the hullabaloo of the great late night skirmish of 2010, when hosts kicked out the jams and became must-see tv again last january, the reality is that most of us went to bed safely knowing that the really good bits would be easily found the next morning: blogged, twittered, facebooked or forwarded. for everything else it does, social media is also a pretty good tivo. so by those standards, what's really important for monday night's 11 p.m. webcast of conan o'brien's show zero - a web only, streaming preview of his oncoming tbs series able to be viewed at www.youtube.com - is that there is some genius bit of comedy that becomes part of tomorrow's web churn and helps build buzz before his proper return next week. this is o'brien's early shot to engage all those netizens who mobilized - or at least changed their facebook profiles to team coco images, which hey dude, means something - before he returns to tv nov. 8 on tbs with conan. his site, teamcoco.com, has been broadcasting behind-the-scenes bit and sketches, and while some have been amusing, none have really set the world on fire. last january's backbiting between the late night hosts was the perfect media storm. the late night show ratings all spiked and web videos dominated online water coolers with the ongoing viral play by play. it also caused the contenders to up their game, particularly o'brien, whose tonight show was a mess before the scheduling controversy. (remember, all the drama started about moving his show back 30 minutes, but it re-energized all of the players, benefiting the red-haired comedian the most .) conan walked away with fans' sympathy, his integrity and a boatload of cash. he's now had some time and the opportunity to do make something new, hopefully with the added assurance of knowing exactly who the audience is. from early reports, it sounds like conan will stickfairly close to the established late-night formula. we'll all be watching live for the first week at least. after that, i'll just wait to see what survives past first airing on my monitor the next morning. late night hosts are fighting for more than out hearts and minds; it's our clicks and browsers. here's a first to worst comparison of the late night hosts and their web hits and misses: to borrow a colbert-ism, speaking truthiness to power. here in canada, there's still ongoing grumblings about the geo-blocked comedy central u.s. site, but stewart is the guy who first drove most of us to see what we missed last night and remains the best. best moment: there are plenty, although we'll pick his stop on cnn's crossfire as his best viral moment. most recent: ystewart and colbert hosted a rally the washington mall this weekend and many desk warriors are playing catch-up with that now. also last week, the daily show posted an entire barack obama interview online, which was shortened for broadcast. strategy: nerds! after a rocky start, fallon has settled in and is doing a great showcasing technology on his program. he reads fan tweets and just gets it. a perfect example: the most popular youtube video right now is a gears of war 3 trailer from six months ago that he premiered on the show. best and most recent: while reuniting the saved by the bell cast wasn't bad last year, his recent history of rap with justin timberlake was awesome and another sign of his savvy approach. the show cleared the musical rights for all the songs used in it, so it could be posted online after the show. conan o'brien strategy: all aboard the team coco express. o'brien galvanized his web fans when his tonight show was cancelled. now the question is whether he can take him with him to cable. best: he obviously gets it, as many of his most-viewed clips show, but we still like his closing remarks on cynicism from his last show. most recent: his tbs promos are pretty funny, especially the desk washing one set to def leppard's \"pour some sugar on me .\" <mark>jimmy kimmel</mark> strategy: with a little help from my famous friends. <mark>kimmel</mark> knows how to grab the web's attention, as he has in the past with great star-studded bits like the dueling f------ben affleck-matt damon songs. he also knows the power of justin bieber, as his most-viewed youtube clip has the bieb meeting a fan, with more than 16 million views. best: the songs were good, but post the academy awards handsome men's club ruled. most recent: it feels like it's been a while since <mark>kimmel</mark> found his way into our inboxes. we wonder if he's waiting until o'brien returns and needs to pull out the stops again. letterman is old school, and couldn't seem to care less, like the pointed way he says \"www\" when talking about websites. that said, he's had plenty of viral-worthy moments coming out of his show. best: joaquin phoenix's bearded fake-out. most recent: phoenix's come clean after the release of casey affleck's film i'm still here, which obviously was nowhere near as good as the first. punch me in the chin. leno's got to feel weird knowing that his tonight show actions helped benefit his competitors on the air and online. a perfect example is <mark>kimmel</mark>'s host - skewering appearance as part of his ten at 10 segment on his old show. it's one of the top hits when leno's name is searched on youtube. best: there's not much, how about jim carrey as jay leno from careers @ the star advertise with us"}, {"articleID": "2018031807_00024833_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}, "date": "2018-03-18", "url": "http://www.stuff.co.nz/sport/cricket/102378260/South-Africa-sweat-on-Kagiso-Rabada-hearing-as-NZ-lawyer-takes-centre-stage", "content": "South Africa sweat on Kagiso Rabada hearing as NZ lawyer takes centre stage ROB FORSAITH Last updated 19:57, March 18 2018 GALLO IMAGES South African fast bowler Kagiso Rabada, centre, appears hopeful rather than optimistic of having his ban overturned for the third test against Australia. Comments emanating from South Africa's cricket team suggest they will enter Monday's hearing over Kagiso Rabada's two-test ban with high hopes but low expectations. Judicial commissioner Michael Heron, who is based in New Zealand and more commonly assesses tip tackles and other Super Rugby incidents, will soon chair a video conference over Rabada's charge of making \"inappropriate and deliberate physical contact\" with <mark>Steve Smith</mark> during the second test. Heron then has 48 hours to reach a verdict. MONIQUE FORD/STUFF Lawyer Michael Heron will preside over South African fast bowler Kagiso Rabada's appeal against a two-test ban. That timeline ensures the saga, which started when the Proteas spearhead brushed <mark>Smith</mark>'s shoulder during a screaming send-off, should be over before the four-test series continues in Cape Town on Thursday. READ MORE: * Rabada: 50/50 it's my fault * Rabada's path to the Proteas * Bangladesh nearly forfeit T20 The judicial stoush has captivated much of the Rainbow Nation's attention. Rabada's representative Dali Mpofu opined it \"has implications for our shared project of nation-building\" , while former Springboks behemoth Bakkies Botha is among those to have weighed in. GALLO IMAGES Former New Zealand captain and now match referee Jeff Crowe, second from right, ruled Kagiso Rabada's contact with Australian captain <mark>Steve Smith</mark> was deliberate. Rabada would be a huge loss for the hosts, with the series level at 1-1 after he bowled them to victory in Port Elizabeth. But the 22-year-old is seemingly resigned to the fact he won't be playing at Newlands, having admitted he erred during the press conference that followed a haul of 11-150. \"It's going to have to stop. I can't keep doing this because I am letting the team down and I am letting myself down. I would've loved to have been playing the next game,\" he said at the time. Later in the week, the world's top-ranked test bowler told reporters he takes \"responsibility for what happened\". Ad Feedback That was the view taken by match referee Jeff Crowe - the former New Zealand captain and later team manager - who noted in a public statement that Rabada \"had the opportunity to avoid the contact\". \"I could not see any evidence to support the argument that the contact was accidental,\" Crowe said. Faf du Plessis knows as well as anybody how hard it can be to overturn a match referee's verdict at a formal appeal. South Africa's skipper unsuccessfully took his ball-tampering charge resulting from \"mint-gate' to a judicial commissioner .\" Our strike rate is zero per cent at the moment with trying to challenge these cases, it will probably stay at zero, \"du Plessis said after the second test. It is unclear whether Mpofu intends presenting new evidence. He is expected to argue both Rabada and <mark>Smith</mark> are culpable. Heron has the option to settle on a new punishment for Rabada but it would be a major surprise if he opts for a harsher punishment. Rabada's problem is his poor disciplinary record, having started the series with five demerit points. The International Cricket Council's laws dictate that eight points result in an automatic two-test ban, so he will most likely miss the next two tests unless the charge is thrown out altogether. - AAP Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Cricket story: Legspinner Ish Sodhi stars with seven wickets in Plunket Shield for ND Sport Homepage"}, {"articleID": "2019112617_00056000_W", "names": {"David Duffy": ["Q42888203", "Q5233096"]}, "date": "2019-11-26", "url": "https://www.scotsman.com/business/virgin-money-kicks-off-brand-roll-out-to-phase-out-clydesdale-bank-1-5052694", "content": "Virgin Money kicks off brand roll out to phase out Clydesdale Bank The re-branding programme will see the centuries-old Clydesdale Bank name disappear. Picture: John Devlin Hannah Burley Updated: 17:14 Tuesday 26 November 2019 Share this article Sign Up To Our Daily Newsletter Sign up Have your say Virgin Money will open its first wave of \"ground-breaking\" new branches next month as it phases out the Glasgow-headquartered Clydesdale Bank brand. The banking group will open the doors to newly re-branded Virgin Money flagship \"stores\" in Manchester, Birmingham and London in December--the first tranche of a wider roll-out in major cities across the UK. Virgin Money chief <mark>David Duffy</mark> praised the launch. Picture: Contributed It fires the starting gun on a £ 60 million re-branding programme that will see the centuries-old Clydesdale Bank name disappear from the high street. This comes just two months after the group announced it will close Virgin Money's St Andrew Square office in Edinburgh, along with sites in Norwich and Leeds, before the end of the year, as it looked to axe 330 jobs and cut \"duplication\". The Virgin Money brand roll-out follows the acquisition of Virgin Money by CYBG, the owner of Clydesdale and Yorkshire banks, for £ 1.7 billion in 2018. Its new stores, open to both customers and non-customers, are designed to be a place for entrepreneurs to co-work and create, with an offering including free coffee, a venue for events and concerts, and a social media studio for content creation. Alongside this, Virgin Money will also push the button on its first digital current account and mobile app, which it claims will position the group as a \"genuine disrupter\" in the banking market. Virgin Money chief executive <mark>David Duffy</mark> described the new account as \"bringing together the best in digital and mobile technology\" ."}, {"articleID": "2019020616_00281743_W", "names": {"Micah Hyde": ["Q1032003", "Q14918180"], "Kevin King": ["Q12032914", "Q15707484", "Q29789611", "Q36695446", "Q52151815", "Q6396702", "Q6396703", "Q6396704"], "Josh Jones": ["Q26269516", "Q29862025", "Q30122055", "Q6289030"], "Adrian Peterson": ["Q1398352", "Q373983"], "Josh Jackson": ["Q19757619", "Q3185977", "Q39075458", "Q44749654", "Q6289014"]}, "date": "2019-02-06", "url": "https://www.forbes.com/sites/robreischel/2019/02/06/jaire-alexander-provides-ray-of-hope-for-packers-secondary/", "content": "Jaire Alexander Provides Ray Of Hope For Packers' Secondary Opinions expressed by Forbes Contributors are their own. SportsMoney I report on the Green Bay Packers. Share to facebook Share to twitter Share to linkedin Green Bay Packers cornerback Jaire Alexander (23), shown here lineing up against Atlanta Falcons No. 1 wide receiver Julio Jones (11), was named to the NFL's all-rookie team in 2018. (Jeff Haynes/AP Images for Panini) This is the fifth story in a series examining Green Bay's positional groups. The Green Bay Packers mistakenly let defensive backs Casey Hayward and <mark>Micah Hyde</mark> walk in free agency in recent seasons. The Packers missed on their top two draft picks in 2015, cornerbacks Damarious Randall and Quinten Rollins. And it's looking like cornerback <mark>Kevin King</mark>, a second round pick in 2017, will be a bust, as well. But it certainly appears the Packers got it right in 2018 with first round cornerback Jaire Alexander. And today, Alexander is the top reason that there's hope for a Green Bay secondary that has struggled immensely in recent seasons. \"I mean the thing that really jumps out...is his consistency,\" Packers defensive coordinator Mike Pettine said of Alexander. \"It's just developed over time. He certainly earned our trust .\" With good reason. Alexander was named to the NFL's all-rookie team, becoming just the second Green Bay cornerback to receive that honor since the team was first selected in 1974. Hayward was the first Packers corner named to that team in 2012. Alexander, a bold and bombastic individual, played with a swagger that's been missing from Green Bay's defense for years now. The lightning-quick Alexander also competed with a rare fire and aggression level that more than compensated for his height (5-foot-10). In fact, by midseason, the Packers were lining Alexander up on No. 1 receivers and having him shadow them throughout the game. \"I enjoyed it. It was fun,\" Alexander said of facing No. 1 wideouts. \"That's something that every corner wants to follow the best. I don't know why you're playing the game if you don't want to. It was fun .\" I learned a lot, learned a lot of different things as far as being able to stay in there when I'm in press instead of running out--things like that. It was fun, though. It was pretty exciting. It got to a point where I'd come in for the installs and I had already figured I'd be on the best guy. That's how competitive it got. It was fun. \"Watching Alexander was fun for Packer Nation, as well. Alexander led the Green Bay's defensive backs in passes defensed per snap (one every 50.7). He was also second in tackles per snap (one every 10.0) and committed just two penalties. Alexander did allow a team-high 12 passes of at least 20 yards, though. At the end of the season, Alexander said he was surprised the jump to the NFL wasn't more difficult .\" I thought people would be much faster, \"he said .\" I thought the skill level would be like (Atlanta's) Julio (<mark>Jones</mark>) every week, you know what I'm saying? But there's receivers who aren't like that. There are running backs that aren't like <mark>Adrian Peterson</mark>. It's a good little mix. I just thought it would be hard. \"Alexander's play was a major reason the Packers jumped to 12 th in passing yards allowed after finishing 23 rd in 2017. But Green Bay also had just seven interceptions--the lowest total in franchise history--and the secondary still has far more questions than answers. The 6-foot-3 <mark>King</mark>, drafted in 2017 to be a shutdown corner, simply can't stay on the field due to a bevy of injuries. In two seasons, <mark>King</mark> has played in just 15 games, finished only 10 of those and has played just 32.4% of the defensive snaps. Cornerback <mark>Josh Jackson</mark>, a second round draft pick in 2018, had a rough rookie year. <mark>Jackson</mark> was picked on by opposing quarterbacks, benched for a stretch at midseason and struggled tackling all season. Veteran corner Bashaud Breeland, signed midway through the season, doesn't run well (4.60) and is unlikely to return. Green Bay's safety group is in even worse shape. The best safety was Tramon Williams, who moved from cornerback after the Packers traded Ha Ha Clinton-Dix at midseason. Williams, 36, is as smart as they get and remains an extension of Pettine on the field. But Williams also didn't have an interception for the first time in his 13-year career and would be best in a reserve role in 2019. The problem, of course, is Green Bay's roster is devoid of talent at the safety position. And the Packers need a substantial upgrade via the draft or free agency. <mark>Josh Jones</mark>, a second round draft pick in 2017, has had two extremely uninspiring seasons and will have to fight for a roster spot in 2019. Kentrell Brice was handed a starting safety spot in August, then proceeded to play the position as poorly as any Packer in recent memory. Brice, a restricted free agent, was torched for a string of deep balls early in the year, was benched at midseason and is unlikely to receive an offer from the Packers for 2019. While Alexander was an enormous bright spot in 2018, the Packers need to surround him with far better talent than they currently possess .\" Well, we have to get better, obviously, \"Williams said .\" It's one of those things to where you hear it all the time: Guys jump from Year 1 to Year 2. That's what you want to see. I think that's the next step. We've done some good things, but at the same time, we know we have a lot of room for improvement. I think that's the next step. \""}]