[{"articleID": "2020020211_00130795_W", "names": {"Steve Nash": ["Q16137022", "Q192955", "Q42316961"]}, "date": "2020-02-02", "url": "https://sports.inquirer.net/384345/nu-bullpups-near-uaap-juniors-elims-sweep", "content": "sports / Basketball Basketball NU Bullpups near UAAP juniors elims sweep By: Bong Lozada - Reporter / @ BLozadaINQ INQUIRER.net / 07:22 PM February 02, 2020 Photo from UAAP MANILA, Philippines--National University-Nazareth School moved on the verge of an elimination round sweep after it decimated hapless University of the Philippines Integrated School, 113-76, Sunday in the UAAP Season 82 high school boys' basketball tournament at Filoil Flying V Center in San Juan. <mark>Steve Nash</mark> Enriquez and Terrence Fortea led the defending champions, who hiked their record to 13-0, with 17 points apiece while Gerry Abadiano added 12 points and six assists. ADVERTISEMENT Big men Carl Tamayo and Kevin Quiambao did their work in the post with 10 points each and 18 rebounds combined. \"If we could get the sweep, then okay, but we're always focused on the game that we will play next,\" said NU head coach Goldwin Monteverde in Filipino. FEATURED STORIES SPORTS Standard bearer SPORTS Folayang thrown off his game by Dutch foe's height advantage SPORTS Lakers honor Kobe Bryant, Gianna in emotional pregame tribute Jordi Gomez de Liano paced UPIS with 27 points while Sean Torculas added 17 points, 22 rebounds but had nine turnovers. Meanwhile, Ateneo High School clinched a spot in the semifinals after brushing off De La Salle-Zobel, 79-52. Forthsky Padrigao had 19 points, six rebounds, three assists and four steals while LeBron Lopez added 17 points and had two blocks as the third-running Blue Eaglets improved to 8-5 record. Ranz Uniza led La Salle with 14 points. Adamson University grabbed sole possession of the fourth seed with a 124-68 humiliation of University of the East while second seed Far Eastern University-Diliman held off University of Santo Tomas, 81-73. The Baby Tamaraws (12-1) still have a chance to claim the top seed if they beat the Bullpups by 16 or more points on Feb. 5. ADVERTISEMENT For the complete collegiate sports coverage including scores, schedules and stories, visit Inquirer Varsity. Read Next Taduran keeps IBF belt after technical draw vs Mexican EDITORS' PICK SM continues to send relief assistance to remote towns in Batangas A Chinese national, the second confirmed coronavirus case in PH, dies; the first death outside China IN DETAIL: Duterte's temporary travel ban on visitors from China, Hong Kong, Macau Beyond Lifetimes: Sun Life Philippines celebrates 125 years of making life brighter for Filipinos Smart's Siklab Saya invigorates Mobile Legends scene this 2020 EDITORIAL: Irresponsible dithering MOST READ Man kills coworker who allegedly mocked him for being fat What remains of the day DOH confirms 2nd case of nCoV in PH, says patient died Saturday New Chinese city locked down over virus, first foreign death Don't miss out on the latest news and information. View comments Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer & other 70 + titles, share up to 5 gadgets, listen to the news, download as early as 4am & share articles on social media. Call 896 6000. TAGS: Adamson University Baby Falcons, Ateneo Blue Eaglets, Far Eastern University Baby Tamaraws, FEU, Juniors, National University-Nazareth School Bullpups, NU, Sports, UAAP, UAAP Season 82 juniors' basketball tournament For feedback, complaints, or inquiries, contact us. EDITORS' PICK MOST READ globalnation SM continues to send relief assistance to remote towns in Batangas cebudailynews A Chinese national, the second confirmed coronavirus case in PH, dies; the first death outside China newsinfo IN DETAIL: Duterte's temporary travel ban on visitors from China, Hong Kong, Macau business Beyond Lifetimes: Sun Life Philippines celebrates 125 years of making life brighter for Filipinos technology Smart's Siklab Saya invigorates Mobile Legends scene this 2020 opinion EDITORIAL: Irresponsible dithering newsinfo Man kills coworker who allegedly mocked him for being fat February 02, 2020 opinion What remains of the day February 02, 2020 newsinfo DOH confirms 2nd case of nCoV in PH, says patient died Saturday February 02, 2020 newsinfo New Chinese city locked down over virus, first foreign death February 02, 2020 newsinfo Coldest weather recorded so far in Baguio, Manila February 02, 2020 sports Standard bearer February 02, 2020"}, {"articleID": "2011022215_00080853_W", "names": {"Sergio Perez": ["Q7454371", "Q82805"]}, "date": "2011-02-21", "url": "http://thecheckeredflag.co.uk/2011/02/perez-quite-happy-with-barcelona-test-performance/", "content": "<mark>sergio perez</mark> had \"another positive' day as he brought this pre-season test session in barcelona to a close for his sauber team. the mexican completed 74 laps of the circuit de catalunya with his main focus working on the set-up of the car.\" it was another positive day, \"<mark>perez</mark> said.\" i learnt a lot, in particular about the tyres. they kept changing, but now we have the final spec for the beginning of the season, so it was good i was able to run them today to learn how to maximise their potential. we did a lot of work over the two days, so i'm quite happy. \"technical director james key explained how the team went about their business on the fourth and final day of this test session.\" today we spent most of the time working on the set-up of the car, and we tried some new test items, \"he said.\" we have to look at the data, but certainly we found some new directions. \"we also found some useful directions with the different compounds of tyres between the start in the morning, which was cold, and the afternoon when it was quite warm. the temperatures, the set up and the tyre compound are all very closely linked. there's a lot of factors to consider, and we were able to learn more about all of them.\" now we head off to the next test where we will introduce onto the car the first part of the update for the start of the season. \"the next test, originally scheduled to be in bahrain next week, will now be on 8-11 march, back in barcelona. tweet"}, {"articleID": "2019032918_00245728_W", "names": {"Mats Andersson": ["Q27523043", "Q30106599", "Q43108969", "Q5555453", "Q5555464", "Q5555469", "Q5555471"], "Sam Bishop": ["Q10387701", "Q11305227"], "Alex Preston": ["Q16213147", "Q4717649"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2019-03-29", "url": "http://www.gamereactor.eu/?system=xboxone&sid=e1eb5c51cc62c2b7e9631348063fff40", "content": "Written by Ben Lyons on the 29th of March 2019 at 16:08 We spoke to Fatshark's <mark>Mats Andersson</mark> about the upcoming Warhammer Vermintide 2 expansion called Winds of Magic. 0 Here is 20 minutes of Dauntless gameplay from PAX East Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 15:09 We got to try the action-RPG in Boston and headed out into the cold to take on some challenges with our fellow warriors. 0 Check out our Void Bastards gameplay Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 14:45 We tried the Bioshock-inspired game for ourselves at GDC in California, and saw the art style and mechanics in action. 0 A Hyper Light Drifter TV series is being worked on Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 14:33 Developer <mark>Alex Preston</mark> has been in talks with Castlevania's Adi Shankar about how to translate the game into a series. 0 Ash in Dead by Daylight was \"the worst kept secret\" Written by Bengt Lemne on the 29th of March 2019 at 14:21 We talk to Behaviour Interactive's Mathieu Coté and Dave Richard about the decision to bring in the iconic Evil Dead hero. 0 Watch us play The Forgotten City Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 13:42 We got a taste of the game at GDC last week, where we experienced the opening of the adventure that bends time in strange ways. 0 Divinity: Fallen Heroes mixes Original Sin and Dragon Commander Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 12:31 We spoke to Larian's founder Swen Vencke at PAX East about the newly-revealed game, and where the idea came from in the first place. 0 Control more \"open-ended and\" sandboxy \"than Quantum Break Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 12:05 Remedy's Thomas Puha told us that the goal is to\" give you reasons to play once the story is over \"with their upcoming game. 0 CD Projekt\" probably \"providing 250 new jobs with expansion Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11:38 Chief Financial Officer Piotr Nielubowicz revealed the news when discussing the financial report for 2018, which includes dips in profit and revenues. 0 Mortal Kombat 11's beta is on today's stream Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11:14 We head into the heat of battle to check Netherrealm's fighting game out ahead of launch, and see if we can become the best. 0 Here are our impressions of the Borderlands 3 reveal Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 09:33 The sequel was finally confirmed at PAX East, and we were there to witness it for ourselves and get a sense of what's coming. 0 We Happy Few's They Came From Below DLC landing next week Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 09:00 James and Roger must locate the source of the robot invasion and find Dr. Faraday in an adventure that's included in the Season Pass. 0 Scuf Gaming reveals official NBA 2K League controller Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 08 The Scuf Vantage NBA 2KL is available now for players in the US and Canada, being the official controller of the esports league. 0 Written by <mark>Mike Holmes</mark> on the 28th of March 2019 at 20:10 Trailer and screens land for the recently announced current-gen update of Gearbox's shooter. 0 Borderlands 3 finally confirmed Written by <mark>Sam Bishop</mark> on the 28th of March 2019 at 19:52 This wasn't the only Borderlands news Gearbox had for us at PAX East, as the GOTY edition of the first game was revealed alongside Ultra HD Texture Packs."}, {"articleID": "2011032006_00024702_W", "names": {"Taylor Thompson": ["Q17397734", "Q3981675"]}, "date": "2011-03-20", "url": "http://fresnobee.com/2011/03/19/2317217/tight-knit-group-of-bulldogs-proud.html", "content": "fresno state seniors helped the team to four straight ncaa tourney appearances. bulldogs women lose to unc in ncaa first round \"tooltipid =\" mi_tt1 \"> bulldogs women lose to unc in ncaa first round the most decorated class in fresno state women's basketball history waved goodbye to fans a final time on the court of the pit, some 900 miles from the city they put on the map with four straight trips to the ncaa tournament. lucas turns tables on fresno st in unc's 82-68 win\" tooltipid = \"mi_tt2\" > lucas turns tables on fresno st in unc's 82-68 win italee lucas gave the nation's top 3-point shooting team a dose of her long-range game. bulldogs women hope to land their 3s vs. unc \"tooltipid =\" mi_tt3 \"> bulldogs women hope to land their 3s vs. unc for the second time in three seasons, fresno state leads the nation in 3-point baskets--310--and in average 3s made with 9.7 per game. but in ncaa appearances the previous three years, the bulldogs have failed to live up to their 3-point billing. they made just 17 of 69 (24.6%) in two losses to baylor and one to cal. they hope to get their groove back today against north carolina in this year's ncaa tournament. bulldogs women put trust in freshman point guard\" tooltipid = \"mi_tt4\" > bulldogs women put trust in freshman point guard fresno state again is putting the ball in the hands of a freshman to guide its women's basketball team in the ncaa tournament, this time against 14th-ranked north carolina. no. 14 unc beats kennesaw state 98-52 \"tooltipid =\" mi_tt5 \"> no. 14 unc beats kennesaw state 98-52 jessica breland and the rest of the tar heels are ready for the ncaa tournament. albuquerque, n.m.--jaleesa ross draped her arm around marnique arnold's shoulder as the longtime friends and teammates walked off a college basketball court saturday for the final time. the two met when they were 12, played together at pinole high and both landed at fresno state in 2007.\" i told marnique: \"fresno state has done a lot for us .' and she has done a lot for me,\" ross said. \"we decided to come to fresno state together ....i just told her that we had the best time; we made the right choice.\" ross and arnold, joined by taja edwards, hayley munro and emma andrews, were the nucleus of fresno state teams that made four consecutive ncaa appearances. the last one ended like the first three, with a loss, 82-68 to north carolina at the pit. the bulldogs also won three western athletic conference regular-season and tournament championships, more firsts for the program. \"i'm proud of our senior class,\" ross said. \"we made great leaps for the program.\" ross finished with a school-record 2,002 points. her 389 3-pointers was a record, falling three short of tying the ncaa division i mark, and she leaves with a steals record of 247. munro, with her team-high 15 points saturday, finished with 1,410--sixth on the school list. she also had 764 rebounds to move into third place in the program. big blow <mark>taylor thompson</mark>, welcome to the big dance. fresno state's 5-5 freshman point guard ran into a screen and was leveled by north carolina's 6-1 laura broomfield 51/2 minutes into the game. broomfield stuck out an elbow just as <mark>thompson</mark> ran into her but wasn't called for a foul. <mark>thompson</mark> hit the deck, lay prone for about two minutes and had to be helped off the court. \"it felt like hitting a brick wall pretty much,\" <mark>thompson</mark> said as she rubbed her left temple. \"i wasn't sure what happened. i felt dizzy.\" <mark>thompson</mark> returned to the court about five minutes later and helped the bulldogs draw within 40-36 of the tar heels at halftime. in her ncaa debut, she finished with no points, three rebounds and two steals in 18 minutes. shooting issues ross had another tough day in the ncaa tournament, but said she never felt frustrated trying to shoot over north carolina's taller defenders. the tar heels tried not to let her out of their sight and she made just 5 of 21 shots, including 4 of 20 from 3-point range. in the second half, with fresno state trailing by four points, ross took 13 shots--all 3s--and made only one. \"i took a couple rushed shots i shouldn't have,\" she said. \"but i didn't focus on being frustrated. they weren't going in, but the more we worked it, the more my other teammates got shots.\" that's a lot of 3s fresno state's school-record 50 3-pointers attempted was 10 more than north carolina had allowed in sylvia hatchell's 25 years as coach. the 50 also were the most in a regulation ncaa tournament game. hatchell put 5-10 tierra ruffin-pratt on the 5-9 ross much of the game. ruffin-pratt said her team was well aware that ross was trying to set the ncaa 3-point record. \"we knew we had to stay on her because she puts up a lot of shots,\" ruffin-pratt said. \"we just tried not to let her get her seven for the record. we tried to keep her from getting 2,000 points, too, but we didn't accomplish that.\" the bee's story-comment system is provided by disqus. to read more about it, see our disqus faq page. if you post comments, please be respectful of other readers. your comments may be removed and you may be blocked from commenting if you violate our"}, {"articleID": "2010111702_00089435_W", "names": {"John Holder": ["Q30122027", "Q6239558", "Q6239559"]}, "date": "2010-11-17", "url": "http://fox17.com/newsroom/top_stories/videos/wztv_vid_5451.shtml?wap=0", "content": "the cheatham county sheriff's department and tbi are investigatin a deadly shooting near ashland city. one person is dead and two others seriously injured including the presumed shooter. investigators say it's a case of domestic trouble turned deadly. investigators continue piecing together the puzzling shooting on trouble road. cheatham county sheriff <mark>john holder</mark> said, \"we've got three people shot. don't know anything about why or what - maybe boyfriend, gilrlfriend thing - i'm not sure. we're just trying to get it all looked at and see where we're at.\" what's known is two women and a man were shot. investigators believe david hundley is the shooter - he has a history with the sheriff's department. responders found him - with a gunshot wound to the head - outside his house; it's also where they found a dead woman - who neighbor's say was his ex-gilrfriend - inside this car. she, too, was shot in the head. a neighbor told fox 17 the other female gunshot victim ran up the street to another house...calling for help. that woman suffered from a bullet wound to the stomach. the investigation includes a third location--nearby, on waynoe road. it's where sheriff's deputies took a man into custody...his involvement is unclear, but investigators say his wife might be the surviving female victim. it's a tragedy that's shaken this community. david hundley's children arrived on scene mid-afternoon, shocked and unaware he was hospitilized. they say hundley and his ex-girlfriend recently split up because of a tumultuous relationship. hundley's daughter said, \"a few days ago he had an order of protection put out against her - she's not supposed to be nowhere around him. he had a 3 o'clock appointment with his lawyer to discuss all this. they had lived together and they were separating - and she kept coming over there with people trying to start stuff.\" now, investigators must pick up the pieces and determine what happened. triple-shooting in cheatham county tuesday, november 16 2010, 07:37 pm cst military: 8 fort campbell soldiers killed november 16, 2010 17:53 est fort campell, ky. (ap)--the military says eight fort campbell soldiers were killed over the weekend in two separate incidents in afghanistan. the military identified three soldiers killed in kandahar province on saturday as 27-year-old staff sgt. juan l. rivadeneira of davie, fla.; 20-year-old cpl. jacob r. carver of freeman, mo.; and 20-year-old spc. jacob c. carroll of clemmons, n.c. all three were assigned to company b, 2nd battalion, 502nd infantry regiment, 2nd brigade combat team, 101st airborne division stocks fall, dow edges back below 11k new york (ap)--it has been a tough day so far for the stock market. consumer info chrysler recalls jeep suvs; gm recalls sedans washington (ap)--general motors is recalling nearly 14,000 sedans to address potential problems with power steering. and chrysler is recalling about 16,000 jeep liberty suvs to fix faulty windshield wiper systems ....science/tech news in the news: facebook unveils new messaging system san francisco (ap)--facebook is trotting out a new system for sending messages--one that the social network's founders believe could prove to be the beginning of the end of e-mail as we know it."}, {"articleID": "2014011802_00042523_W", "names": {"Chris Gilbert": ["Q5106657", "Q5106661"]}, "date": "2014-01-17", "url": "http://worthplaying.com/article/2014/1/17/news/91091/", "content": "PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox One Namco Bandai Picks Up \"Enemy Front' And\" Lords of the Fallen' Lords Of The Fallen is an action RPG set within a medieval fantasy world ruled by a Fallen God where you will fight against the formidable Lords and Generals that command his demonic army. Namco Bandai Games America has signed an agreement with CI Games to become the exclusive distributor for the console versions of Enemy Front and Lords of the Fallen. \"We are very excited to be partnering with CI Games for Lords of the Fallen, and looking forward to maximizing the success of both games across the Americas.\" said <mark>Chris Gilbert</mark>, Senior Vice President of Sales and Marketing for, Namco Bandai Games America Inc.. Enemy Front is an innovative First-Person Shooter combining the latest visuals, game mechanics and open-ended maps with an original approach to the fan-favorite setting of World War II. is an Action RPG which takes place in an original setting, co-developed by CI Games and Deck 13 under the direction of executive producer Tomasz Gop whose past projects include the role of senior producer on two installments of"}, {"articleID": "2018013006_00641086_W", "names": {"Dmitry Medvedev": ["Q23530", "Q47858657"]}, "date": "2018-01-30", "url": "http://timesunion.com/news/politics/article/State-Department-says-no-new-Russia-sanctions-at-12535008.php", "content": "http: //www.timesunion.com/news/politics/article/State-Department-says-no-new-Russia-sanctions-at-12535008.php US issues \"Putin list' of Russian politicians, oligarchs Josh Lederman, Associated Press Updated 1:51 am, Tuesday, January 30, 2018 Photo: Mikhail Klimentyev, AP Image 1 of / 1 Caption Close Image 1 of 1 In this Jan. 26, 2018, photo, Russian President Vladimir Putin chairs a Security Council meeting in Moscow, Russia. The State Department has notified Congress that it will not impose new sanctions on Russia at this time. The State Department says it is confident that new legislation enacted last year is significantly deterring Russian defense sales. (Mikhail Klimentyev, Sputnik, Kremlin Pool Photo via AP) less In this Jan. 26, 2018, photo, Russian President Vladimir Putin chairs a Security Council meeting in Moscow, Russia. The State Department has notified Congress that it will not impose new sanctions on Russia at...more Photo: Mikhail Klimentyev, AP US issues\" Putin list' of Russian politicians, oligarchs 1 / 1 Back to Gallery WASHINGTON (AP)--The Trump administration late Monday released a long-awaited list of 114 Russian politicians and 96 \"oligarchs\" who have flourished during the reign of President Vladimir Putin, fulfilling a demand by Congress that the U.S. punish Moscow for interfering in the 2016 U.S. election. Yet the administration paired that move with a surprising announcement that it had decided not to punish anybody--for now--under new sanctions retaliating for the election-meddling. Some U.S. lawmakers accused President Donald Trump of giving Russia a free pass, fueling further questions about whether the president is unwilling to confront America's Cold War foe. Known informally as the \"Putin list,\" the seven-page unclassified document is a who's who of politically connected Russians in the country's elite class. The idea, as envisioned by Congress, is to name-and-shame those believed to be benefiting from Putin's tenure just as the United States works to isolate his government diplomatically and economically. Being on the list doesn't trigger any U.S. sanctions on the individuals, although more than a dozen are already targeted under earlier sanctions. Prime Minister <mark>Dmitry Medvedev</mark> is among the 114 senior political figures in Russia's government who made the list, along with 42 of Putin's aides, Cabinet ministers such as Foreign Minister Sergey Lavrov, and top officials in Russia's leading spy agencies, the FSB and GRU. The CEOs of major state-owned companies, including energy giant Rosneft and Sberbank, are also on the list. So are 96 wealthy Russians deemed \"oligarchs\" by the Treasury Department, which said each is believed to have assets totaling $1 billion or more. Some are the most famous of wealthy Russians, among them tycoons Roman Abramovich and Mikhail Prokhorov, who challenged Putin in the 2012 election. Aluminum magnate Oleg Deripaska, a figure in the Russia investigation over his ties to former Trump campaign chairman Paul Manafort, is included. The Trump administration had until Monday to issue the list under a law passed last year. After declining to answer questions about it throughout the day Monday, the Treasury Department released it with little fanfare 12 minutes before midnight. Even more names, including those of less-senior politicians or businesspeople worth less than $1 billion, are on a classified version of the list being provided to Congress, officials said. Drawing on U.S. intelligence, Treasury also finalized a list of at least partially state-owned companies in Russia, but that list, too, was classified and sent only to Congress. There was no immediate comment early Tuesday from the Kremlin or the Russian Embassy in Washington. In the works for months, the list has induced fear among rich Russians who are concerned that it could lead to U.S. sanctions or to being informally blacklisted in the global financial system. It triggered a fierce lobbying campaign, with Russia hawks in Congress pushing the administration to include certain names and lobbyists hired by Russian businessmen urging the administration to keep their clients off. The list's release was likely to at least partially diffuse the disappointment from some lawmakers that Trump's administration opted against targeting anyone with new Russia sanctions that took effect Monday. Under the same law that authorized the \"Putin list,\" the government was required to slap sanctions on anyone doing \"significant\" business with people linked to Russia's defense and intelligence agencies, using a blacklist the U.S. released in October. But the administration decided it didn't need to penalize anyone, even though several countries have had multibillion-dollar arms deals with Russia in the works. State Department officials said the threat of sanctions had been deterrent enough, and that \"sanctions on specific entities or individuals will not need to be imposed.\" \"We estimate that foreign governments have abandoned planned or announced purchases of several billion dollars in Russian defense acquisitions,\" said State Department spokeswoman Heather Nauert. She did not provide evidence or cite any examples. Companies or foreign governments that had been doing business with blacklisted Russian entities had been given a three-month grace period to extricate themselves from transactions, starting in October when the blacklist was published and ending Monday. But only those engaged in \"significant transactions\" are to be punished, and the United States has never defined that term or given a dollar figure. That ambiguity has made it impossible for the public to know exactly what is and isn't permissible. Late last year, Secretary of State Rex Tillerson said one reason the U.S. was proceeding cautiously was that major U.S. allies have much at stake. Turkey, a NATO ally, has a deal to buy the S-400, Russia's most advanced air defense missile system. And key security partner Saudi Arabia recently struck an array of deals with Moscow, including contracts for weapons. It was unclear whether either country had since abandoned those deals to avoid running afoul of the U.S. sanctions. New York Rep. Eliot Engel, the top Democrat on the House Foreign Affairs Committee, lambasted the move to punish no one, saying he was \"fed up\" and that Trump's administration had chosen to \"let Russia off the hook yet again.\" He dismissed the State Department's claim that \"the mere threat of sanctions\" would stop Moscow from further meddling in America's elections. \"How do you deter an attack that happened two years ago, and another that's already underway?\" Engel said. \"It just doesn't make sense.\" ___ Associated Press writer Jill Colvin contributed to this report. ___ Reach Josh Lederman on Twitter at http: //twitter.com/joshledermanAP Most Popular 1 Sheriff: Couple forges real estate transaction, moves in 2 2 homes razed after Schenectady mudslide 3 Emails: Executives gleeful over influence of Percoco, Howe 4 Longtime TU track writer Matt Graves dies at 70 5 20 things you don't know about me: Yvonne Perry 6 20 things you don't know about me: Yvonne Perry 7 RPI alumni stop donating amid concerns over leadership, campus...View Comments © 2018 Hearst Communications, Inc. ."}, {"articleID": "2012031320_00025540_W", "names": {"Miao Wei": ["Q45710050", "Q8292013"]}, "date": "2012-03-13", "url": "http://kgmi.com/EU-U-S-Japan-launch-rare-earth-WTO-case-against-Ch/11461903?newsId=132144", "content": "washington/brussels (reuters) - the united states, europe and japan joined forces on tuesday against china's restrictions on exports of rare earth minerals that are critical to production of advanced technology and clean energy goods expected to provide the jobs of the future. \"we want our companies building those products right here in america. but to do that, american manufacturers need to have access to rare earth materials which china supplies,\" president barack obama said at the white house. \"now, if china would simply let the market work on its own, we'd have no objections. but their policies currently are preventing that from happening and they go against the very rules that china agreed to follow,\" obama said. he cast the decision to take action with the european union and japan at the world trade organization as part of stepped-up u.s. effort to make sure countries play by global trade rules. \"our competitors should be on notice. they will not get away with skirting the rules,\" obama said. ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ chart on rare earth production ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ obama, a democrat, has been toughening his stance on chinese trade practices amid criticism from his republican rivals that his administration has not been strict enough with beijing, as he girds for his re-election fight for the white house this november. he also on tuesday signed a bipartisan bill that restores the u.s. ability to impose countervailing, or anti-subsidy, duties on goods from china and other \"non-market economies\" after a court ruling struck the practice down. three against one the rare earths dispute is one of several between beijing and the other three economic powers, as chinese industry remolds the world economic order. the dispute is the first to be jointly filed by the european union, the united states and japan. though dependent on the outside world for vast qualities of industrial inputs such as iron and coal, china accounts for about 97 percent of world output of the 17 rare earth metals. they are crucial for the defense, electronics and renewable-energy industries and are used in a range of products such as mobile phones, disk drives, wind turbines and electric cars. \"china continues to make its export restraints more restrictive, resulting in massive distortions and harmful disruptions in supply chains for these materials throughout the global marketplace,\" u.s. trade representative ron kirk said. the action over china's export curbs involving rare earths, as well as tungsten and molybdenum, begins a 60-day process for the two sides to try to resolve the dispute. if unsuccessful, the next step would be for the united states, the european union and japan to ask the wto to establish a dispute-settlement panel to decide the case, which with appeals could take as long as two years. \"china's restrictions on rare earths and other products violate international trade rules and must be removed,\" european union trade commissioner karel de gucht said in a statement. \"these measures hurt our producers and consumers in the eu and across the world, including manufacturers of pioneering hi-tech and\" green' business applications. \"environmental defense beijing said the export curbs are necessary to control environmental problems caused by rare earth mining and to preserve supplies of an exhaustible natural resource.\" we regret their decision to complain to the wto, \"china's minister of industry and information technology <mark>miao wei</mark> said, according to the official xinhua news agency.\" in the meantime, we are actively preparing to defend ourselves. \"china's export quotas were not trade protectionism and did not target any specific country, he added. the eu, the united states and mexico won a similar case against china in january concerning other raw materials. but a european official close to the case said despite this ruling, china had not removed wider export restrictions. in particular, the eu said in a statement,\" the latest rare earth quota announcements are further tightening the restrictions and are a clear signal in the wrong direction. \"beijing has until the end of march to tell the united states, the eu and mexico how it intends to comply with the january ruling, providing an opportunity for china to address both that case and the rare earth restrictions at the same time, a senior u.s. administration official said. foreign companies pay up to twice as much as chinese firms for rare earth metals, the eu says.\" these restrictions...benefit chinese industry, \"the official said.\" therefore they are against wto rules. \"the eu directly imports 350 million euros worth of rare earths from china each year, and also brings in products of far greater value containing rare earths from japan and elsewhere. the damage done to european manufacturing runs into billions of euros, the official said because it was nearly impossible to diversify from chinese supply. china said its export policies stemmed from environmental concerns, but failed to prove its curbs helped conserve resources, cut pollution or improve public health in that case, the eu said. trade spats trade friction between the eu and china has been growing. de gucht said on a recent visit to hong kong that china needed to be sensitive to perceptions that its economy is a threat in europe, even as eu-china trade has boomed to almost 400 billion euros in 2010. eu complaints against chinese dumping range from shoes to kitchenware, and de gucht has previously complained that china subsidizes\" nearly everything \". meanwhile china, along with the united states and russia, recently complained about an eu plan to levy a carbon emissions charge on all airlines using eu airports. china has said it would not buy aircraft from european maker airbus because of the emissions scheme. japanese worries over supplies of rare earths heightened in 2010 when china held back shipments after a territorial dispute. in the united states, obama recently created a new inter-agency trade enforcement center, is expected to start work in the coming months with a focus on chinese honoring of wto rules. the obama administration is also considering a wto complaint against anti-dumping and retaliatory duties on u.s. auto exports that china imposed late last year. (additional reporting by michael martina and ben blanchard in beijing, jeff mason and alister bull in washington; editing by luke baker, rex merrifield and philip barbara)"}, {"articleID": "2017112407_00510764_W", "names": {"Josh White": ["Q20710668", "Q22338540", "Q27830874", "Q6289511"]}, "date": "2017-11-24", "url": "https://www.digitallook.com/news/news-and-announcements/rio-tinto-extends-sinosteel-joint-venture-for-third-time--2991561.html", "content": "Rio Tinto extends Sinosteel joint venture for third time Rio Tinto extends Sinosteel joint venture for third time <mark>Josh White</mark> WebFG News | 24 Nov, 2017 07:44 - Updated: 07:44 | | | MM 200: n/a 17:17 25/09/06 Rio Tinto and China's Sinosteel Corporation have agreed to extend their Channar Mining joint venture, the pair announced on Friday. The third extension of the joint venture, confirmed in Beijing by Rio Tinto chief executive J-S Jacques and Sinosteel chairman Xu Siwei, would see an additional 10 million tonnes of iron ore delivered into the venture from Western Australia. FTSE 100 firm Rio Tinto said the extension would see Sinosteel make an upfront payment of $15m to it, as well as production royalties linked to the iron ore price. It remained conditional on approvals from the Western Australian, Australian and Chinese governments. \"The Channar joint venture is one of Australia's most significant trading partnerships and has helped pave the way for the incredibly strong relationship we have forged with China today,\" said Rio Tinto Iron Ore chief executive Chris Salisbury. \"This extension represents another milestone in our 30-year partnership that has seen more than 250 million tonnes of iron ore delivered from the Pilbara to China.\" The original Channar joint venture was signed in 1987 and provided for the production of 200 million tonnes of iron ore. Rio Tinto said the third extension would increase the life of the joint venture to cover production totalling 290 million tonnes. Advertising"}, {"articleID": "2019052911_00091866_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Christopher Steele": ["Q28216818", "Q51167589"], "Andrew Mccarthy": ["Q30122369", "Q457836", "Q55187938"], "Abby Johnson": ["Q306885", "Q321125"]}, "date": "2019-05-29", "url": "http://www.renewamerica.com/news.php?s=20083", "content": "Statesville tries to stop RV dealership from flying massive American flag WSOC TV--The controversy over a massive American flag is now reaching a new level as the company responsible for flying the flag is rallying community support to fight the City of Statesville, which has reportedly filed a lawsuit to have the flag removed...(more) May 21, 2019 Judgment, trust, LGBT issues driving millennials from Mormon church UPI--Mormon millennials are leaving the church at about double the rate of their parents and grandparents, according to a new book that draws on a study of four generations of current and former members of The Church of Jesus Christ of Latter-day Saints...(more) May 20, 2019 Alan Keyes targets \"Deathocrats' for lulling Americans into support ALAN KEYES--As a black American, I cannot pretend to be surprised that many people who profess the truth of the Gospel of Jesus Christ nonetheless support the. Many black Americans, including members of my own family, have done so throughout my adult life. Like other so-called Democrats, black Americans pretend to see a valid trade-off between the murder of millions of innocent, helpless human beings and the good supposedly done by government programs assisting low-income families...(more) Deathocratic Party May 20, 2019 America is starting to run out of Americans BRYAN FISCHER--America is beginning to run out of Americans. We are breeding ourselves out of existence. Our fertility rate has plunged to 1.7 births per woman, the lowest it has ever been. Since the replacement rate is 2.1, this generation isn't even making enough babies to replace itself...(more) May 20, 2019 Romney says he doesn't support Alabama abortion law POLITICAL--Sen. Mitt Romney on Sunday said he doesn't support a recently enacted law prohibiting nearly all abortions at any point during pregnancy in Alabama.\" I don't support the Alabama law, \"the Utah Republican and 2012 GOP nominee for president told CNN's Jake Tapper on\" State of the Union. \"\"I believe that there ought to be exceptions. I'm pro-life, but there ought to be exceptions for rape and incest and where the life of the mother is at risk.\" ...(more) May 20, 2019 AOC: \"GOP doesn't care about babies' because they won't support the Green New Deal WASHINGTON EXAMINER--Rep. Alexandria Ocasio-Cortez, D-N.Y. claimed Friday that Republicans do not care about babies because they refuse to sign onto her signature climate change legislation.\" The GOP doesn't care about babies at all - especially brown, black, or poor ones. If they did, they'd: cosponsor the Green New Deal or at LEAST have a real climate plan - guarantee healthcare so ALL can get prenatal care - not stand for the death + caging of babies on our border, \"Ocasio-Cortez tweeted...(more) May 20, 2019 Physician says threat of world ending in 12 years no\" joke' WORLDNETDAILY--Public officials making threats about the end of the world is no \"joke,\" according to a health expert who says socialist U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., stepped out of line. The freshman lawmaker warned the earth would end in 12 years unless extreme action, such as her \"Green New Deal,\" is undertaken. Cortez later claimed she was joking...(more) Mueller changed everything BYRON YORK--From now on, the Trump-Russia affair, the investigation that dominated the first years of <mark>Donald Trump</mark>'s presidency, will be divided into two parts: before and after the release of the Mueller report. Before the special counsel's findings were made public last month, the president's adversaries were on the offensive. Now, they are playing defense...(more) May 20, 2019 The <mark>Steele</mark> Dossier and the \"verified application' that wasn't <mark>ANDREW MCCARTHY</mark>--Here's what you need to know: In rushing out their assessment of Russia's interference in the 2016 election, Obama-administration officials chose not to include the risible Steele-dossier allegations that they had put in their\" VERIFIED APPLICATION \"for warrants from the Foreign Intelligence Surveillance Court (FISC) because...wait for it...the allegations weren't verified...(more) May 19, 2019 The Guardian: Ecuador to give Assange belongings to U.S. NEWSMAX--Ecuador will hand over to U.S. prosecutors on Monday the belongings of Julian Assange that remain in the country's London embassy, WikiLeaks told The Guardian on Sunday. Ecuadorian officials are travelling to London to permit the Americans to\" help themselves \"to the possessions, which include two of Assange's manuscripts, other legal papers, medical records and electronic equipment, so that they can expand their extradition case before the British deadline on June 14, WikiLeaks editor-in-chief Kristinn Hrafnsson told The Guardian...(more) David Limbaugh looks forward to\" glorious day' when SCOTUS overrules Roe v. Wade DAVID LIMBAUGH--Alabama's mostly Republican lawmakers and governor passed a strong abortion ban this week, and liberals are fit to be tied. \"Today, I signed into law the Alabama Human Life Protection Act, a bill that was approved by overwhelming majorities in both chambers of the legislature,\" said Gov. Kay Ivey. \"To the bill's many supporters, this legislation stands as a powerful testament to Alabamians' deeply held belief that every life is precious and that every life is a sacred gift from God.\" ...(more) May 19, 2019 \"Unplanned' is driving abortion workers out of the industry DAILIY SIGNAL--The pro-life movie\" Unplanned \"surpassed all expectations in theaters, and is now leading abortion workers to leave the industry. In this episode, Rachel del Guidice talks to <mark>Abby Johnson</mark>, a former Planned Parenthood worker, about the stunning trend. Plus: Alabama is set for a legal showdown after passing a law that bans abortion. Thomas Jipping joins us to unpack what could come next and analyzes the prospects of overturning Roe v. Wade...(more) May 19, 2019 DNA tests reveal 30% of suspected fraudulent migrant families were unrelated WASHINGTON EXAMINER--Some of the migrant families arrested at the southern border weren't actually families. In a pilot program, approximately 30% of rapid DNA tests of immigrant adults who were suspected of arriving at the southern border with children who weren't theirs revealed the adults were not related to the children, an official involved in the system's temporary rollout who asked to be anonymous in order to speak freely told the Washington Examiner Friday...(more) May 19, 2019 Socialism is about taking, not giving NATIONAL REVIEW--The snakiest of snake-oil pitches goes like this: Give us some of your freedom and we'll take care of you. Socialists have been making similar claims back as far as Plato. The end result doesn't have to be Venezuela. It can just be...Europe...(more) May 16, 2019 NEWSMAX--Nearly three decades ago, when Democratic Louisiana Gov. John Bel Edwards' wife was 20 weeks pregnant with their first child, a doctor discovered their daughter had spina bifida and encouraged an abortion. The Edwardses refused...(more) May 16, 2019\" The time is coming for the Supreme Court' to act WORLDNETDAILY--Lawmakers in Alabama have adopted a law that makes conducting an abortion punishable by up to 99 years in prison. The governor signed it late Wednesday. And lawsuits from the American Civil Liberties Union or Planned Parenthood are likely, rulings that inevitably would be appealed...(more) White House creates online portal for reporting social media censorship HUMAN EVENTS--This afternoon, the White House launched a new online portal that will allow users who have been banned or suspended from social media platforms to share their stories with the White House. The portal, called the \"Tech Bias Story Sharing Tool,\" asks users if any social media platform--Facebook, Instagram, Twitter, Youtube, or any other--has taken action against the user's account. The user is given an opportunity to explain the circumstances of their banning, link to the offending post or tweet, and include any screenshots of emails from the social media platforms explaining why they took adverse action against the user's account...(more) WORLDNETDAILY--A former Justice Department official said Democrats should be \"quite worried\" about U.S. Attorney General Barr's appointment of a U.S. attorney to look into the origins of the FBI's Trump-Russia investigation...(more) May 15, 2019 Why was FBI so wrong in Trump-Russia wiretap warrant? BYRON YORK--A huge controversy erupted last year when President Trump declassified parts of the FBI's secret request to wiretap former Trump campaign volunteer foreign policy adviser Carter Page. Defenders and critics of the president argued over whether the October 2016 warrant application to the Foreign Intelligence Surveillance Act court relied extensively on the so-called <mark>Steele</mark> dossier, which was a collection of anti-Trump allegations compiled by the former British spy <mark>Christopher Steele</mark> on behalf of the Hillary Clinton campaign...(more)"}]