[{"articleID": "2011112104_00047461_W", "names": {"Jay Cutler": ["Q312811", "Q937778"], "Gary Smith": ["Q16145764", "Q16195339", "Q17028702", "Q17091652", "Q18764075", "Q28868084", "Q3098620", "Q362372", "Q5525950", "Q5525951", "Q5525953", "Q5525954", "Q5525955", "Q5525956", "Q5525957", "Q5525958", "Q5525959", "Q5525963"], "John Meyer": ["Q6248589", "Q6248590", "Q6248592"]}, "date": "2011-11-21", "url": "http://neighbors.denverpost.com/viewtopic.php?p=2210491#p2210491", "content": "chicago - the chicago tribune is reporting chicago bears quarterback <mark>jay cutler</mark> broke his right thumb during sunday's 31-20 victory over the san diego chargers and will miss six to eight weeks. if confirmed, that would mean <mark>cutler</mark> won't play in his return to denver to face the broncos on dec. 11. ex-colorado state quarterback caleb hanie would probably get the start instead ....post your comments on the denver post article, \"congratulations csu-pueblo! wow. what a great season. remarkable. we're backing you the rest of the way. those of us that are alumni of csu-pueblo (usc) are walking with our chins high, guts in and chest out because of your accomplishmen...\"doug rodriguez 3 hours ago\" just go to salt lake on friday, get the next blowout over with, and end this miserable season. what a gutless, heartless, brainless team this has turned out to be. anybody need the 8 tickets i bought for the utah game? for free? crickets...... \"lv b 7 hours ago\" it's great to know so many fans appreciate <mark>gary smith</mark>. i hope he returns as the head coach sooner rather than later. thanks to <mark>john meyer</mark> for great coverage of the rapids specifically and soccer in general. groups plan farewell, thank-you party for ex-rapids coach <mark>gary smith</mark> michael beck-gifford 8 hours ago \"if there's any fighter that has been unlucky it is prescott. i watched him against paul mccloskey and i had him winning the fight??? i couldn't believe it when mccloskey was given the decision. against alvarado he wasn't unlucky exactly, beca...\""}, {"articleID": "2013021216_00024389_W", "names": {"Duncan Williams": ["Q25205747", "Q5314654", "Q57552310"]}, "date": "2013-02-12", "url": "http://modernghana.com/news/445192/1/us-govt-committed-to-africas-peace-pat-alsup.html", "content": "u.s gov' t committed to africa's peace - pat alsup by evans osei baffour 2/12/2013 5:11:58 pm - a deputy chief of mission, pat alsup has observed that \"as threats to peace and stability continue to be on the rise in west africa, the u.s. government welcomes the opportunity to work with our partners in the region on capacity building and knowledge transfer .\" according to her, the u.s government will continue to assist countries in the sub-saharan region to keep peace among its citizens, adding that being at peace with its people would also enhance rapid development thereby improving their living standards. since november 2011, inl has trained over one hundred participants in ghana, but this course marks the first hosted in the regional training center. she made this remarks when she joined hands with the national security coordinator lt. col. larry gbevlo-lartey to address trainees who have completed their course work on financial and transnational organized crime investigations. the training hosted in the west africa regional training center (rtc) and established by the united states bureau of international narcotics and law enforcement affairs (inl) in cooperation with the government of ghana was the first to be held in accra. the new rtc supports the west africa cooperative security initiative (wacsi) and the strategy to combat transnational organized crime and rtc seeks to improve cooperation, build new partnerships, and to invest in the creation of regional networks in west africa to combat transnational crime. the courses planned for the rtc offer opportunities for prosecutors to network and build skills side-by-side with law enforcement officers, helping all participants comprehend cases from investigation through prosecution. the rtc has two fully equipped classrooms for up to 50 students as well as a conference room, production facilities, and a student lounge. 12-02-2013 u.s gov' t committed to africa's peace - pat alsup 12-02-2013 united nations ghana message on first observance of world radio day in ghana 12-02-2013 in italy prisons, conditions are poor, but theater is thriving 12-02-2013 i will abide by the supreme court's ruling - prez mahama 12-02-2013 libya to close borders during revolt anniversary 12-02-2013 united nations ghana congratulates pioneering and present radio producers, presenters and 12-02-2013 un secretary-general's message for world radio day 12-02-2013 gcpp appoints frederick dadzie as acting general secretary 12-02-2013 mugabe suspends top officials over \"diamond graft' 12-02-2013 libya - paris ministerial meeting - italy among top three contributors to security 12-02-2013 ghanaian investigative journalist anas testifies in sierra leone corruption case 12-02-2013 libya - terzi in paris for international meeting on security 12-02-2013 ecowas salutes african football champions, super eagles of nigeria 12-02-2013 iom rushes emergency aid to stranded chadian migrants deported from libya 12-02-2013 musing of an ordinary ghanaian youth!!!!! 12-02-2013 $80 million gold fraud: are security agencies failing ghana? 12-02-2013 s.africa opposition predicts anc polls\" hammering' 12-02-2013 somalia arrests second reporter in rape trial case 12-02-2013 lmvca is worthless of attention-mustapha 12-02-2013 u.s gov' t committed to africa's peace - pat alsup 12-02-2013 united nations ghana message on first observance of world radio day in ghana 12-02-2013 united nations ghana congratulates pioneering and present radio producers, presenters and j 12-02-2013 gcpp appoints frederick dadzie as acting general secretary 12-02-2013 removal of fuel subsidy is draconian - afag laments 12-02-2013 woyome case adjourned for 6th time as prosecution fails to produce witness 12-02-2013 doctors' strike is \"an uncivilized act' - labour expert 12-02-2013 angry prophet fires back at <mark>duncan williams</mark>:\" who trained me? 12-02-2013 judgment debt chief recalls auditor-general 12-02-2013 wereko-brobby vows court action over fuel price increase 12-02-2013 clergy ask: are doctors recalcitrant or somebody is not doing his work?"}, {"articleID": "2016071911_00438253_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"]}, "date": "2016-07-19", "url": "http://businesstimes.com.sg/government-economy/new-uk-finance-minister-hammond-says-to-work-with-boe-on-brexit-response", "content": "The Business Times New UK finance minister Hammond says to work with BoE on Brexit response Jul 19, 2016 7:26 PM [LONDON] British finance minister <mark>Philip Hammond</mark> said on Tuesday he would work closely with the Bank of England to help steer the economy through the shock of last month's referendum vote to leave the European Union. Mr Hammond, who was named as chancellor of the exchequer by Prime Minister Theresa May last week to replace <mark>George Osborne</mark>, said the immediate response to Brexit slowdown lay with the BoE while he would spell out his fiscal plans in the autumn. \"The initial response to this kind of a shock must be a monetary response delivered by the Bank of England,\" Mr Hammond told lawmakers. \"And the governor, in announcing that interest rates were not to be lowered last week, did make it clear that the Bank is developing a monetary package that it will announce in due course .\" The BoE said on July 14 it was working on a possible package of measures to be announced on Aug 4 to cushion the expected blow from the referendum result to Britain's economy. Many economists expect it will halve its already record low Bank Rate to 0.25 per cent and possibly revive its bond-buying programme. Some have also speculated that the BoE might buy bonds issued specifically to fund infrastructure spending. In his comments to parliament on Tuesday, Mr Hammond said Britain needed a new framework to address its budget deficit, which he said was \"very large\" and needed to be addressed. Britain's budget deficit stands at around 4 per cent of gross domestic product, down from more than 10 per cent in 2010 but still among the largest of rich nations around the world. Mr Hammond reiterated his aim of protecting Britain's huge financial services industry from the Brexit fallout by securing its continued ability to provide services across the EU, and he said Britain would not be open to \"asset strippers\" seeking to buy companies in the country. REUTERS"}, {"articleID": "2019070516_00133811_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-07-05", "url": "https://www.pulse.ng/bi/politics/trump-blamed-his-confusing-reference-to-airports-being-seized-during-the/qfnbpel", "content": "Business Insider Politics President <mark>Donald Trump</mark> attributed his confusing and ahistorical reference to soldiers seizing airports during the Revolutionary War on a weather-induced teleprompter failure. Evan Vucci/AP Photo <mark>Donald Trump</mark> Washington, DC experienced heavy rainfall and poor visibility during <mark>Trump</mark>'s 4th of July \"Salute to America\" celebration on National Mall. <mark>Trump</mark> made the airport-related gaffe during his speech to the crowd. \"Our Army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do, and at Fort McHenry,\" <mark>Trump</mark> said. When asked about the gaffe, <mark>Trump</mark> said that the heavy rains \"knocked out\" his teleprompter in the middle of that sentence, adding, \"that's not a good feeling when you are standing in frontof millions and millions ofpeople on television .\" Visit Business Insider's homepage for more stories. President <mark>Donald Trump</mark> attributed his confusing and ahistorical reference to soldiers seizing airports during the Revolutionary War on a weather-induced teleprompter failure. Washington, DC experienced heavy rainfall and poor visibility during <mark>Trump</mark>'s 4th of July \"Salute to America\" celebration on National Mall. <mark>Trump</mark> made the airport-related gaffe during his speech to the crowd. \"Our Army manned the air, it rammed the ramparts, it took over the airports, it did everything it had to do, and at Fort McHenry, under the rockets' red glare, it had nothing but victory. And when dawn came, their star-spangled banner waved defiant,\" <mark>Trump</mark> said in the speech. When asked on Friday about the gaffe, <mark>Trump</mark> said the poor weather conditions caused his teleprompter to malfunction. \"The teleprompter went out, right in the middle of that sentence it just went out, it went kaput, and that's not a good feeling when you are standing in frontof millions and millions ofpeople on television,\" <mark>Trump</mark> said while speaking to reporters outside the White House. He added: \"The rain knocked out theteleprompter. But no, it's not that. I knew the speech very well. I was able to do it without ateleprompter. But the teleprompterdid go out. It was actually hard to look atanyway because it was rain allover it .\" Read more: The internet blew up with hilarious #RevolutionaryWarAirportStories jokes after <mark>Trump</mark>'s puzzling reference to US soldiers seizing airports Neither airplanes nor airports existed in America until the early 20th century when the Wright brothers first took flight in 1903, and the world's first airport was established in College Park, Maryland in 1909, well over a century after the revolutionaries won independence from Britian. From <mark>Trump</mark>'s comments, it was still unclear whether the airport mistake was written into the speech, or whether the speech as written mentioned seaports instead of airports and <mark>Trump</mark> simply misspoke. Regardless, <mark>Trump</mark> didn't seem to be fazed by the gaffe and viewed the event as a success even suggesting that it could bolster military recruitment. \"Despite the rain, that was just a fantastic evening...and it was really a recruitment situation,\" he said. \"A lot of people are going to be joining our Army, Navy, Air Force, Marines, and Coast Guard .\" Read more: In hour-long Fourth of July speech, <mark>Trump</mark> mistakenly claims US soldiers \"seized airports' during the Revolutionary War <mark>Trump</mark>'s\" Salute to America' Fourth of July event drew supporters and protesters, despite pouring rain Military flyovers stunned crowds at <mark>Trump</mark>'s controversial \"Salute to America' Fourth of July event NOW WATCH: Why the US border facilities are\" concentration camps,' according to historians See Also: The internet blew up with hilarious #RevolutionaryWarAirportStories jokes after <mark>Trump</mark>'s puzzling reference to US soldiers seizing airports The <mark>Trump</mark> reelection campaign's monster fundraising numbers should scare Democrats What the food is like at <mark>Trump</mark>'s White House events SEE ALSO: Many people incorrectly think that the Founding Fathers signed the Declaration of Independence on July 4 here's the real reason the US celebrates that day Author: Grace Panetta Source: Business Insider USA Tell your friends LIKE PULSE NIGERIA FOLLOW PULSE NIGERIA Eyewitness? Submit your stories now via social or: WhatsApp: +2349055172167 Email: eyewitness @ pulse.ng"}, {"articleID": "2017042415_00645742_W", "names": {"Larry Page": ["Q4934", "Q6490923"]}, "date": "2017-04-24", "url": "http://rss.cnn.com/~r/rss/money_technology/~3/KeHY-pfcRO0/index.html", "content": "See Google co-founder <mark>Larry Page</mark>'s \"flying car' in action <mark>Larry Page</mark>'s long-rumored\" flying car \"project is finally ready for takeoff. Kitty Hawk, a startup backed by the Google (GOOGL, Tech30) cofounder, unveiled its prototype for an\" ultralight \"aircraft that can take off vertically--as long as you're flying over open water. In a demonstration shared online Monday, the Kitty Hawk Flyer is shown lifting off over a lake with the help of small propellers under its base. The prototype looks less like a car than a jet ski with wings. The Flyer is expected to go on sale by the end of this year, according to the company's website. The price has yet to be announced. The startup says it has received approval from the Federal Aviation Administration for the aircraft to be flown in\" uncongested areas. \"Customers will not need a pilot's license to use it .\" We've all had dreams of flying effortlessly. I'm excited that one day very soon I'll be able to climb onto my Kitty Hawk Flyer for a quick and easy personal flight, \"<mark>Page</mark> said in a statement provided to The New York Times, which was first to report the news. Related: As Uber makes a pitch for flying cars, transit hype jumps the shark Nearly a year ago, <mark>Page</mark> was reported to have invested more than $100 million in flying car startups. Reps for the company did not immediately respond to a request for comment. Sebastian Thrun, CEO of Kitty Hawk and a former Google exec who led the company's self-driving car efforts, described the mission on Twitter as nothing short of\" changing the future of personal transportation. \"If the Kitty Hawk prototype doesn't exactly look like the flying car of your sci-fi fantasies, you're probably not alone. Several firms, including Aeromobil and Terrafugia, are developing flying cars that look more like tiny planes than cars. Many rely on vertical takeoff and landing, or VTOL, eliminating the need for a runway. The Kitty Hawk announcement also gets out of in front of Uber, which is scheduled to hold an event Tuesday related to its own flying car efforts. <mark>Page</mark>'s Google has a complicated relationship with Uber. Google is an investor in the ride-hailing startup, but Google's self-driving car unit is currently suing Uber for allegedly stealing its intellectual property. CNNMoney (New York) First published April 24, 2017: 10:52 AM ET"}, {"articleID": "2010101002_00007456_W", "names": {"Gene Smith": ["Q18151512", "Q5531453", "Q5531454", "Q5531455"]}, "date": "2010-10-10", "url": "http://us.rd.yahoo.com/dailynews/rss/sports/*http://news.yahoo.com/s/ap/20101010/ap_on_sp_co_ga_su/fbc_t25_indiana_ohio_st", "content": "ap - ohio state's terrelle pryor throws a pass against indiana during the first quarter of an ncaa college? by rusty miller, ap sports writer rusty miller, ap sports writer 38 mins ago columbus, ohio - even though he says he never looks back, ohio state coach jim tressel couldn't help but reflect on his 100th victory with the buckeyes. \"it's exciting every time you win,\" he said after terrelle pryor's three touchdown passes and 334 yards led the second-ranked buckeyes to a 38-10 victory over indiana on saturday. \"we've had a lot of awfully good players here and our coaching staff has been outstanding. a lot of those 100 wins have been here at home and we've got great fans .\" this is a place that, if they let you stay long enough, you should win 100. \"after the game, tressel was congratulated by athletic director <mark>gene smith</mark>. tressel's wife, ellen, joined him on the dais. he went on to remember his father, hall of fame college coach lee tressel, whom he played for at baldwin-wallace .\" this was always his team, \"tressel said of his father, who died in 1981 - four years before jim got his first head coaching job .\" no matter where he coached in high school or college, ohio state was very special. \"tressel improved to 235-78-2 in 25 years (the first 15 at football championship subdivision youngstown state). he won his 100th at ohio state in his 121st game, the third-fastest among big ten coaches. and he is likely to be coaching the no. 1 team in the country by sunday afternoon when the new rankings come out after no. 1 alabama lost 35-21 at south carolina. pryor, who had strained a left thigh muscle a week ago at illinois, proved he was the picture of health. he threw for a career-best 334 yards and three touchdowns. pryor hit on scoring passes covering 22 yards to dane sanzenbacher, 60 yards to brandon saine and 17 yards to devier posey as the buckeyes (6-0, 2-0 big ten) rolled to their 12th consecutive win - and 16th in a row over the hoosiers (3-2, 0-2). it was a big deal that he helped tressel get a watershed win .\" i was messing with him in the quarterback meeting today about the 100th win, \"pryor said .\" i look at him as a father figure. every week, i learn something new from him. \"indiana came in averaging 40 points and almost 350 passing yards a game, but quarterback ben chappell was harassed all day, completing 16 of 26 for 106 yards with two interceptions .\" believe me, we didn't come over here thinking we were going to move the ball up and down the field on them, \"iu coach bill lynch said .\" we've watched a lot of football through our careers. and you could tell that's a great defensive football team. \"the buckeyes piled up 478 yards while the hoosiers finished with just 210, less than half their average of 455 yards a game. dan herron added two touchdowns while rushing for 68 yards on 12 carries. pryor's passing yardage easily surpassed his previous high of 266 in a victory over oregon in the 2010 rose bowl. with his sixth straight game of at least 300 yards of total offense, he tied the school record held by joe germaine (1996-98). pryor, who also moved into fourth place in total offense at ohio state with 6,518 yards, finished 24 of 30 .\" he's coming along, \"tressel said of pryor .\" (completing) 24 for 30's pretty good. the big one is no interceptions. if we can do that, we have a chance in every game. \"much like michigan did last week in a 42-35 victory over the hoosiers, the buckeyes scored quickly. it took them just four plays after the opening kickoff for herron to race through a big hole at left tackle for a 39-yard touchdown. after chappell was picked off by devon torrence, pryor hit a wide-open sanzenbacher for the score. saine's long bomb made it 21-0 and the rout was on. indiana, which has not beaten the buckeyes since 1988, has never beaten a team ranked no. 1 or no. 2 in 27 attempts. a week after passing 64 times against michigan, the hoosiers ran almost as much as they threw it for most of the day. photo: ohio state head coach jim tressel claps during their ncaa? sports video: no. 19 south carolina shocks no. 1 alabama report abuse fear the sweater vest. osu will crush boise state in the bcs game. abc news: crist, ruffer lead nd to 23-17 win over pittsburgh holiday shoppingsimple steps to saving an extra $1,000 for the big sales. how to avoid unemploymentstatistics show a clear link between education and employment. read more ..."}, {"articleID": "2012101112_00072231_W", "names": {"Jonathan Green": ["Q16224579", "Q21464071", "Q3183381", "Q38546221", "Q39078590", "Q42422030", "Q56459375", "Q59561474"]}, "date": "2012-10-11", "url": "http://news.sky.com/story/996342/mentally-ill-prisoner-executed-in-texas", "content": "\"mentally ill' prisoner executed in texas a texas man, described by his lawyers as mentally ill and incompetent for execution, has been put to death for killing a 12-year-old girl. <mark>jonathan green</mark>, 44, received a lethal injection after the us supreme court rejected last-minute appeals to spare him. a judge earlier this week stopped the punishment, but an appeals court overturned the reprieve. <mark>green</mark> used his final words to deny his guilt:\" i'm an innocent man. i never killed anyone. y' all are killing an innocent man. \"he then looked down at his left arm, where one of the needles carrying the lethal drug was inserted, and said:\" it's hurting me bad. \"he fell unconscious soon after and was pronounced dead 18 minutes later. <mark>green</mark> was convicted of abducting, raping and strangling christina neal, whose body was found stuffed inside a laundry bag at his home in dobbin in 2000. <mark>green</mark> claimed someone else had placed the body there and that he was set up. his execution by lethal injection is the 10th this year in texas, and the first of four scheduled for this month in the nation's most active death penalty state. supreme court guidance says mental illness cannot disqualify someone from execution if they understand the sentence and reasons for the punishment. breaking news abuse claims: savile had keys to broadmoor"}, {"articleID": "2020030915_00067916_W", "names": {"Robert Koch": ["Q1114522", "Q18844133", "Q2798377", "Q823423"]}, "date": "2020-03-09", "url": "http://www.deccanherald.com/international/world-news-politics/germany-coronavirus-cases-cross-1000-812031.html", "content": "Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Budget 2020 Business News Family Finance Technology DH Wheels Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Videos Latest Videos Bengaluru Karnataka People Popular Features Metrolife Entertainment Travel Spectrum Sunday Herald Living DH Education Specials Insight Point Blank Sunday Spotlight Newsletter Get the best of news in your inbox everyday GET IT Monday 9 Mar 2020 updated: 8:40 pm IST E-Paper Classifieds BLR 28 ° C Clouds Sensex: 35634.95 -1941.67 Nifty: 10451.45 -538 Home Bengaluru Top Stories Crime Politics Infrastructure Life in the City Bengaluru 2040 Karnataka Top Stories 20 in' 20 Politics Districts National Top Stories Politics North and Central South East and Northeast West Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Budget 2020 Business News Family Finance Technology DH Wheels World Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Metrolife Your Bond With Bengaluru Cityscape On The Move Lifestyle Videos Latest Videos Bengaluru Karnataka People Popular Entertainment DH Showtime Entertainment News DH Talkies Arts, Books & Culture Specials Insight Point Blank Sunday Spotlight Travel Spectrum Top Stories Statescan Living Front Page Health 'n' Well-Being Fashion Folio Food Fiesta Sunday Herald SH Top Stories Entertainment Articulations Art & Culture Melange Books Photos Pics of the Day DH Galleries 70 Years of DH My Take Your Space DH Education E-Paper Newsletter IN BRIEF: No selfies during SA series? 86 dolphins dead in Namibia Iran COVID-19 toll touches 237 Bolsonaro needs new surgery Press freedom has taken a hit More COVID-19 labs in K'taka Home International World News & Politics Germany coronavirus cases cross 1,000 Germany coronavirus cases cross 1,000 Germany coronavirus cases cross 1,000 X Share via Share permalink AFP, Berlin, Mar 09 2020, 15:18 pm ist updated: Mar 09 2020, 20:43 pm ist The number of coronavirus cases in Germany has passed 1,000, official data from the <mark>Robert Koch</mark> Institute disease control centre showed on Monday. There are now a total of 1,112 confirmed cases in Europe's biggest economy, with the region of North Rhine-Westphalia (NRW) reporting 484 infections--the highest number among Germany's 16 states. In a bid to slow contagion, Health Minister Jens Spahn has called for gatherings of more than 1,000 people to be scrapped across Germany, which could affect many events including Bundesliga football matches. NRW state premier Armin Laschet said he planned to follow Spahn's advice in scrapping large gatherings in the state, meaning that several football games, including Saturday's derby between Dortmund and Schalke could be played in empty stadiums. Wednesday's game between Borussia Moenchengladbach and Cologne would also be affected, said NRW health minister Karl-Josef Laumann. \"I will let the clubs decide if they want to play without spectators or if they prefer to not play at all,\" he told public broadcaster ARD. Also based in the region, second-division club VfL Bochum said Monday it has stopped selling tickets for upcoming matches. German Football League chief Christian Seifert has said the season must end by mid-May, in a sign that matches would likely be played behind closed doors in a bid to keep to the schedule. With measures taken to halt the virus hitting the economy hard, leaders of Chancellor Angela Merkel's right-left coalition agreed an aid package. The coalition \"is taking action in the corona-crisis. Besides medical protection measures, we have agreed on a big aid package for the German economy,\" tweeted Markus Soeder, leader of Merkel's Bavarian allies CSU, calling the package \"comprehensive\". Deccan Herald News now on Telegram - Click here to subscribe DH Newsletter Privacy Policy Get top news in your inbox daily GET IT Germany Coronavirus COVID-19 0 Comments (+) Related stories COVID-19: No selfie, fan interaction during SA series?...Coronavirus: B'luru primary schools shut indefinitely COVID-19: All DTC, Delhi Metro to be disinfected daily...Bengaluru confirms 1st coronavirus case in Whitefield How the coronavirus has hit global sports IMF calls for \"substantial' stimulus against COVID-19 DH Picks Bengaluru confirms 1st coronavirus case in Whitefield MP govt in crisis? Scindia and 17 MLAs\" untraceable'...Coronavirus live updates: Karnataka reports first positive case; Total...Live Who is UK-based Bihar CM aspirant Pushpam Priya?...Yes Bank Crisis Live: ED scanner on big loans...Live social feed What does your star sign say? Explore National Politics North and Central South East and Northeast West Karnataka Top Stories Politics Districts Bengaluru Top Stories Bengaluru Crime Politics Infrastructure Life in the City Sports Cricket Formula 1 with DH Football Tennis Sportscene Other Sports Business Business News Budget 2019 Family Finance Technology DH Wheels Multimedia Videos Photos Opinion DH Views Editorials Panorama Comment In Perspective Right in the Middle Entertainment Entertainment News DH Talkies Arts, Books & Culture Coronavirus Outbreak YES Bank Crisis Madhya Pradesh govt in crisis? Infy staffers caught taking Rs 15L bribe DH Picks Bengaluru confirms 1st coronavirus case in Whitefield MP govt in crisis? Scindia and 17 MLAs \"untraceable' Coronavirus live updates: Karnataka reports first positive case; Total number of India cases rises to 45 Who is UK-based Bihar CM aspirant Pushpam Priya? Yes Bank Crisis Live: ED scanner on big loans issued by Yes Bank, Kapoor's foreign assets Latest stories J & K: ED raids real estate cos, seizes Rs 25 c assets COVID-19: No selfie, fan interaction during SA series? Sudan PM unharmed in assassination attempt: Aide Coronavirus: B'luru primary schools shut indefinitely Delhi riots similar to 2002 Gujarat riots: Congress Trending news No discovery of 3,000-tonne gold deposits in UP: GSI\" Let her rot in jail, let police break her bones' Lord Shiva gets his own berth in Kashi Mahakal Express Fire breaks out behind Prestige Lakeview in Bengaluru Trump is coming to boost his economy, not ours: Swamy Services About Epaper Newsletter Archives Sitemap Classifieds Contact Our group sites Printers Mysore Prajavani Sudha Mayura Privacy Policy Terms Disclaimer © 2020 The Printers (Mysore) Private Ltd.. X Share via Share permalink We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. Learn more I agree X We use cookies. Learn more X"}, {"articleID": "2018110822_00371402_W", "names": {"Danny Rose": ["Q5220782", "Q5220783", "Q5220785", "Q83498"]}, "date": "2018-11-08", "url": "http://www.wirralglobe.co.uk/sport/national/17211770.pochettino-would-prefer-not-to-send-players-on-international-duty/", "content": "Mauricio Pochettino 0 comments Tottenham manager Mauricio Pochettino would prefer not to send his players on international duty if he had the choice. Spurs are battling their way through a hectic run of five games in 13 days, culminating in Saturday's Premier League trip to Crystal Palace. They have had to do it with a lengthy injury list, which has seen them robbed of Dele Alli, Eric Dier and Christian Eriksen among others .???????????????? Our #FiveLions named in Gareth Southgate's latest @ England squad. pic.twitter.com/826clZFbwh--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 Alli has been managing a hamstring problem, Dier has missed the last three games with a thigh injury and Eriksen has not fully recovered from an abdomen injury, yet all three have been called up by their countries for the games next week. That is not ideal for Pochettino, not to mention the other players that are still playing catch up from an extended stint at the World Cup, but he has no choice but to wave them off. \"Yes it is true if you said to me would you prefer all my international players stay here and rest for two weeks without competition, I would say yes,\" he said. \"But that is impossible. That is why we were talking before about Dele Alli and Christian Eriksen and international duty. Eric Dier has been called up for England despite missing Tottenham's last three games with injury (Nick Potts/PA)\" It is play, play, then move them there and play again. If you see our schedule for the next few months it will be so tough. How do you manage that? \"I understand we need to sacrifice some games for some players so they can cope with the demand in the future .\" Dier was named in Gareth Southgate's England squad for the games against the United States and Croatia shortly after Spurs had confirmed he was fit after his recent injury. With Mousa Dembele out for the rest of 2018 it seems likely that Dier will come straight back into the side at Selhurst Park. TEAM NEWS: @ mousadembele (ankle)--scans have confirmed ligament damage to right ankle and is unlikely to be available until the New Year. pic.twitter.com/twfAUTMoKh--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 Even if he does not play, Spurs have no power to keep him. \"If he is fit and the manager calls him, he must go,\" Pochettino added. \"If he is fit but I decide not to put him in the starting XI we will need to get permission as well from the national team .\" Despite the injury problems, which have also seen Victor Wanyama, <mark>Danny Rose</mark> and Jan Vertonghen spend time out, Spurs have recorded their best-ever Premier League start, with eight wins from 11 games. Pochettino has masterminded it by using more players than any other side and he finally feels happy with his back-up players. TEAM NEWS: @ ericdier (thigh) and @ VictorWanyama (knee) have both returned to training with the squad. pic.twitter.com/pTCu6HUgh1--Tottenham Hotspur (@ SpursOfficial) November 8, 2018 \"Of course now every time I decide to pick my starting XI I have a name I feel comfortable to play,\" he added. \"It's so important. Because competition in football is an important thing that puts pressure on yourself. It's not only the pressure from the coaching staff, fans and club .\" It's from your team-mate. \"If you are not ready I'll take your place' .\" The most important thing is when you players start to feel pressure from their team-mates pushing you to move and be conscious and responsible to increase your level. That is a very good thing that happens in teams that need to win. \"0 comments"}, {"articleID": "2014110416_00090767_W", "names": {"Ian Holmes": ["Q22005026", "Q37389869", "Q5981826", "Q5981830"], "Stephen Thompson": ["Q11253984", "Q18588210", "Q57878587", "Q59587831", "Q7610676", "Q7610677", "Q7610681", "Q782348"]}, "date": "2014-11-04", "url": "http://www.mtbeurope.info/news/2014/1411003.htm", "content": "Auspherix secures AU $1m from MRCF to advance novel antibiotics pipeline Auspherix Pty Ltd, an early stage company developing novel antibiotics to treat bacterial drug resistance, has announced that it has secured a further with AU $1 million in a series A financing from Australia's Medical Research Commercialisation Fund (MRCF). It has also strengthened its research team. In less than 12 months since its foundation 2013, Auspherix has identified a number of antibacterial compounds with broad spectrum activity against a panel of clinical isolates of antibiotic resistant Gram-positive and Gram-negative bacteria. Through a hit-to-lead programme conducted in collaboration with Domainex, Auspherix now has a better understanding of the SAR necessary to target the organisms and has improved the antibiotic activity of the initial compounds. The new investment will be used to further refine the lead compound series, and to screen these in in vivo models in collaboration with Evotec (previously Euprotec). Auspherix has adopted a virtual business model with research being directed by Professor Ian Charles CSO and founder of Auspherix, who is Director of the ithree institute at the University of Technology Sydney (UTS). The founding intellectual property behind Auspherix was in-licensed from the ithree institute based on research led by Professor Charles, together with Dr Dagmar Alber, ithree Senior Research Fellow. Professor Charles and Dr Alber previously worked together successfully at Arrow Therapeutics as CSO and head of virology respectively. The scientific team has been further strengthened by the appointment of Dr <mark>Ian Holmes</mark> as head of chemistry alongside Dr Alber as head of biology. Dr <mark>Holmes</mark> is an experienced medicinal chemist and pre-clinical project leader with a proven track record of program milestone delivery in large pharma and biotech environments. Past positions include Director of Medicinal Chemistry at Cancer Therapeutics CRC, Melbourne, Australia and prior to that at GSK. Auspherix has appointed two independent consultants to advise the Company: Dr Alan Naylor and Dr Mike Tarbit. Prior to his consulting career Dr Naylor spent 30 years in medicinal chemistry at GSK, latterly as Vice President, Head of Strategy and Operations and Director of Medicinal Chemistry at a UK-based centre of excellence in drug discovery. Dr Tarbit's career has spanned biotech and pharma, including at Inpharmatica, ArQule, GSK and Pfizer. Professor Charles said, \"It is now widely recognized that we desperately need to find new ways to combat infectious diseases including resistant bacterial infections. At Auspherix we are making rapid advances in optimizing potential antibacterial compounds with completely novel chemical structures which, if successful, will deliver the drugs needed to keep the threat from superbugs in check .\" Commenting on the second tranche of investment into Auspherix, <mark>Stephen Thompson</mark>, Chairman of Auspherix and Partner at Brandon Capital, the venture capital firm that manages the MRCF said \"Auspherix has made astonishing progress in less than a year, successfully achieving all of the key milestones. The potential to bring a new class of anti-infectives to market is an extremely exciting opportunity and we are pleased to have made an additional investment into the Company .\" "}]