[{"articleID": "2014071803_00006764_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2014-07-17", "url": "http://texasgopvote.com/issues/restore-families/democrats-declare-war-catholic-church-006877", "content": "Palin And West Are Wrong Calling For Impeachment Before November We Will Not Conform LIVE: Making Common Core History-A <mark>Glenn Beck</mark> Event Sen. Cruz: Israel's fight against radical Islamic terrorism, and the Iranian regime that supports it, is our fight as well The Democrats have waged war on the religious liberty, particularly the Catholic Church. Forty-six Senate Democrats are cosponsoring legislation to reverse the Supreme Court's Burwell v. Hobby Lobby decision and force businesses and religious non-profits, such as the Little Sisters of the Poor, to authorize abortion-inducing drugs for employees or pay millions in faith fines. The bill that is being voted on this floor, if it were adopted, would fine the Little Sisters of the Poor millions of dollars unless these Catholic nuns are willing to pay for abortion-producing drugs for others. When did the Democratic Party declare war on the Catholic Church? Let me make a basic suggestion. If you're litigating against nuns, you have probably done something wrong, and the Obama Administration is doing so right now. Mr. President, drop your faith fines. Mr. Majority leader, drop your faith fines. To all of my Democratic colleagues, drop your faith fines. Get back to the shared values that stitch all of us together as Americans. Faith fines have no place in our democracy. President John F. Kennedy, in an historic speech to the nation said, \"I would not look with favor upon a president working to subvert the first amendment's guarantees of religious liberty .\" Where are the Kennedys today? Does any Democrat have the courage to stand up and speak for the First Amendment today? Does any Democrat have the courage to stand up and speak for the constitutional rights of practicing Catholics? Does any Democrat have the courage to stand up and speak for the Little Sisters of the Poor? Do any Democrats have the courage to listen to the Catholic Conference of Bishops and speak for religious liberty?"}, {"articleID": "2010101316_00060326_W", "names": {"Nate Robinson": ["Q16233511", "Q27043427", "Q315104", "Q40104481", "Q6968707"], "Arthur Mitchell": ["Q19948230", "Q3753500", "Q935160"], "Doug Collins": ["Q18352424", "Q3162841", "Q5300375", "Q919954"], "Nick Young": ["Q14949301", "Q28531164", "Q7028182", "Q703908"], "Eddie Jordan": ["Q1134403", "Q173175", "Q5336171"], "Michael Lee": ["Q22278822", "Q25172140", "Q27527204", "Q30042262", "Q3856209", "Q41250809", "Q43103230", "Q433281", "Q47815020", "Q52840757", "Q53925019", "Q5943492", "Q627098", "Q6832154", "Q6832156"]}, "date": "2010-10-13", "url": "http://libertyballers.com/2010/10/13/1748817/sixers-pre-season-links-featuring-j-k-not-rowling-and-fake-injuries", "content": "more photos? h. rumph jr - ap <mark>nate robinson</mark>, thinking he's at bed bath and beyond, tests the new jrue holiday chest pillow. <mark>arthur mitchell</mark>'s out there in the world! the sixers got their first win of the pre-season last night against the reigning eastern conference champion boston celtics who were playing at full strength and with the intensity of a playoff game. what's that? none of their starters played? i don't believe you. nonetheless, a win is a win is a win. derek was check out his excellent recap if you get the chance. the sixers continue their pre-season adventures tonight against the toronto raptors. and in case you were worried, mike preston confirmed that they landed in toronto late last night. sources close to me saying they flew on hippogriffs the entire way but i'm still searching for confirmation. tonight's match-up will be televised on nba league pass (channel game1) which i believe is currently free to anybody who's cable provider supports it. unfortunately, it's the raptors broadcast team so no ear candy in the name of marc zumoff for us tonight. but let's get to the links of the day, shall we? today we will recap last night's win, address <mark>collins</mark>' bold jrue holiday prediction, learn about tiered ticket pricing, and 10 reasons to check out the sixers this season. kapono came off the bench and threw down four three-pointers to account for his 12 points and also dealt four assists in 19 very active minutes. \"it was cool,\" he said. \"i didn't expect to play as i sat the whole first half, but i'm a professional, and i'm ready to play and help this team. i feel that my skill of shooting can really help this team .\" williams led the sixers with 19 points and marreese speights added 16 to lead seven players in double-digit scoring. <mark>collins</mark> was pleased that the team had 29 fastbreak points and made 10 of 12 from three-point range. \"as frustrating as it is, especially since i felt like i came into training camp in great shape and was doing well, you just have to look at the big picture at the end of the day. i thought it was just soreness from training camp, but it just never really got better. now, compared to, like, 3 or 4 days ago, i'm feeling a lot better. before, just walking around was kind of a struggle. but now with all the stretching, i'm making progress. i would say about a week more now .\" <mark>collins</mark> addresses his jrue holiday early prediction: phillyburbs.com unlike in his rookie campaign, holiday is facing high expectations - some of which were brought on by <mark>doug collins</mark> saying he could be one of the league's top five point guards by the end of this year. \"you know what, that's good,\" <mark>collins</mark> said before tuesday's 103-92 victory over the shorthanded celtics at the wells fargo center. \"expectations are only placed on people with talent. i've always said i like people to put expectations on me because they feel i'm supposed to do a good job. i think you learn to deal with that .\" \"expectations can either derail you or they can drive you to bigger things. i think jrue's the kind of kid who's going to be lifted by expectations .\" thaddeus young said he and his teammates are confident holiday will be fine. \"he has a whole new system and a whole new everything,\" <mark>young</mark> said. \"he's going to figure a way to accommodate us and get back to his old self .\" \"i know the celtics' starters didn't play, but still that's a very tough defensive team,\" sixers coach <mark>doug collins</mark> said. \"was it against the celtics' second team? yeah, but i'm not going to diminish the fact that our guys fought back and won that game, because it looked pretty ugly with about six minutes gone in the third .\" none of <mark>collins</mark>' starters - jrue holiday, andre iguodala, <mark>young</mark>, and brand - played fewer than 28 minutes, but both iguodala and brand sat for the fourth quarter. <mark>collins</mark> played 10 players, using four substitutes (lou williams, marreese speights, andres nocioni) for more than 18 minutes. speights led the sixers with 19 points. dei lynam recaps last night's pre-season matchup: csn philly with 20 seconds left in third andre iguodala was pusing the ball in transition he spotted an open kapono for three. kapono thought about it and then made the extra pass to williams for a corner three which is closer. <mark>collins</mark> had emphasized such execution on sunday. his team was up two heading into the final frame. \"offensively we got a little better spacing,\" iguodala said of the team turning a corner. \"two shooters out there opens the court up for myself and lou williams penetrating. j.k. came in and got to his spot, i hit him and then he drew somebody that left someone else open. from there we just got a good flow. if you are a team that doesn't have a shooter out there they pack it in and you start second guessing yourself with open shots. you can shoot too many threes when you don't have good shooters, but when nocioni and kapono came out there it changed .\" turner made his second start of this preseason and he isn't shy in saying he hopes he can hold onto the spot. \"you get to warm up and then going from warm-ups to the starting lineup helps a lot and i also think you get a better feel for the rhythm of the game,\" the rookie explained of his preference to be on the floor for the opening tip. \"i am used to being out there. it is kind of hard to get used to (coming off the bench), but hopefully i keep playing well and it's the best situation and best for the team i think i might stay in the lineup .\" sixer fans, meet tiered pricing: philadelphia business journal for the opening night game oct. 27 against the miami heat, single-game tickets are priced at between $25 and $238, with the highest-priced tickets in six center-court, lower-level sections. for the team's second home game against the indiana pacers on nov. 3, and for all its other games except for the heat and lakers contests, the price range is $15 to $119. when the lakers visit in december, single game tickets are priced at between $25 and $139. 3. jrue holliday: he really looks like he could join the crop of <mark>young</mark> point guards that are changing the nba. with turner, holliday, and thaddeus young, you have 3 <mark>young</mark> guys on the court with some real basketball iq. 2. <mark>eddie jordan</mark> is not the coach: it bears repeating. completely un-sixer-related news of the day: gilbert fakes an injury when the washington post's <mark>michael lee</mark> and other reporters approached arenas after the game to ask about his sore knee that kept him out, he said he faked it to help get <mark>nick young</mark> some more playing time. \"i know he's kind of frustrated he's not getting a chance to crack the three position, especially since we're going three guards, so i told him i'd go ahead and fake an injury or say something's wrong with me so you can start,\" a smiling arenas said in the locker room. yahoo! sports says jrue holiday is a candidate to be a breakout fantasy player. speaking of, we...tragic end to a great story and the story that started it all for me nba coach power rankings: which head coaches are the best of an elite group? 2010-11 minnesota timberwolves preview: are they finally headed in the right direction?"}, {"articleID": "2009042816_00029593_W", "names": {"David Smith": ["Q1176671", "Q1176674", "Q16194812", "Q16201315", "Q1916387", "Q1951382", "Q21165896", "Q21453047", "Q25184192", "Q25397428", "Q26848960", "Q28855433", "Q3018800", "Q3369644", "Q3527050", "Q39620757", "Q42761997", "Q42793405", "Q43240849", "Q43914056", "Q47451204", "Q50098593", "Q5229871", "Q5230807", "Q5231728", "Q5239876", "Q5239878", "Q5239879", "Q5239882", "Q5239883", "Q5239884", "Q5239886", "Q5239887", "Q5239888", "Q5239889", "Q5239891", "Q5239892", "Q5239893", "Q5239895", "Q5239896", "Q5239899", "Q5239900", "Q5239901", "Q5239902", "Q5239903", "Q5239904", "Q5239905", "Q5239906", "Q5239907", "Q5239908", "Q5239909", "Q53960880", "Q55965901", "Q57053421", "Q902736"], "Dan Henderson": ["Q19282274", "Q33120424", "Q548861"], "Michael David Smith": ["Q16885753", "Q6829665"]}, "date": "2009-04-28", "url": "http://mmajunkie.com/news/14708/strikeforce-nick-diaz-vs-scott-smith-added-to-june-6-event-in-st-louis.mma", "content": "interested in betting on the ufc? check out the mmajunkie strikeforce: nick diaz vs. scott <mark>smith</mark> added to june 6 event (updated) while strikeforce took a recent hit with the loss of renato \"babalu\" sobral for its june 6 event in st. louis, the organization has rebounded in style with the addition of a 180-pound catchweight bout between nick diaz (19-7) and scott <mark>smith</mark> (15-5). both diaz and <mark>smith</mark> were victorious at strikeforce's april 11 event in san jose, calif. headlined by a 182-pound contest between robbie lawler and jake shields, strikeforce's june 6 event from the scottrade center will be broadcast on showtime. mmajunkie.com (www.mmajunkie.com) was able to confirm the addition to the card with strikeforce director of communications mike afromowitz. diaz is currently riding a four-fight win streak, including a second-round tko of mma pioneer frank shamrock at strikeforce's april 11 event. while diaz is one of only three cesar gracie jiu-jitsu black belts, his current streak has been built on the strength of four tko wins. while looking forward to the contest, diaz stated in an official release from the organization that he's upset that he'll be forced to hurt <mark>smith</mark> in the presence of his children. \"i think this is a great fight for me, but i really hate that [<mark>smith</mark>] brings his kids to every one of his fights because now i'm going to be made out to be the bad guy or some sort of villain after i beat him up,\" diaz stated. <mark>smith</mark> is currently riding a two-fight win streak of his own. both victories were earned under the strikeforce banner, including a stunning, come-from-behind win over benji radach at the april 11 event. \"diaz is a great fighter,\" <mark>smith</mark> stated. \"he's going to come in there and out-grapple me and out-strike me so what i have to do is go in there and beat him up. i actually think this is more of a dangerous fight for him than it is for me .\" while <mark>smith</mark> typically fights as a middleweight, \"hands of steel\" has admitted in the past that he believes he could compete below the 185-pound weight class. thirteen of the california native's 15 wins have come via knockout or tko. while the original report from khtk-am stated that strikeforce heavyweight champion alistair overeem was set to return to action in a title defense against undefeated challenger brett rogers, afromowitz said that report was simply untrue. \"we're looking at a lot of options for both overeem and rogers right now,\" afromowitz said. \"nothing has been signed for either of them .\" afromowitz said that a bout between the two heavyweight sluggers was certainly a possibility but that neither fighter was currently guaranteed to appear at the event. overeem hasn't fought for strikeforce since winning the title in october 2007. mma rumors section of mmajunkie.com. (pictured: nick diaz) to join the mmajunkie.com discussions with your fellow mma junkies, mma forums. rules: no spam. no fighter bashing. no insulting other posters. no disruptive posts. nothing \"not safe for work\" or illegal, including links to illegal videos. mmajunkie.com reserves the right to moderate all posts. even though many people say rogers is a can, he is a big dude that hits hard. oh, i wasn't implying that you were saying he is a can!:) it just seems like a lot of people think that way or maybe i'm assuming. yeah, i forgot about overeems muay thai style. i see it too coming if it does happen. this is a tough fight for diaz for one reason: he seems convinced that he's an elite striker (he isn't). he's a very good striker who has managed to put together a string of tko's. i'm pulling diaz too but he's right. <mark>smith</mark> lives up to his nickname and i truely think he can ko about anyone if he lands it. against lawler (who i was rooting for) he just never really caught him. coker said he wants le to fight by the end of summer/early september last i heard. i see another broken arm in diaz (shamrock style). diaz needs to know how to take le down first. le's doesn't throw traditional mma kicks. he throws kicks that take a long time to setup. if diaz is smart he will close the distance and counter-punch before the kick lands. it depends on what kicks you are talking about. le probably has the most variety of kicks/combos besides for machida. he could use those combos to offset diaz's reach. let's not forget that le is very accomplished in san shou. . he has excellent throws and takedown defence. maybe that is why shamrock didn't even try taking le down. le is good on the ground as well. . not to the extent of diaz but still. i think shamrocks arrogance is what kept the fight standing. he has said before he likes to beat his opponent at his own game, and shamrock is definitely no slouch on the mat. true. agreed on the shamrock statement all the way. i still question though if he was cautious of taken him down. le is very underated on the ground. i don't see le trying to take down diaz at all either. i think le would be too much for diaz even with his huge reach. le is on another level with his combinations. i know nate trains in judo but i have never seen anywhere that said nick trains in it as well. i've been wondering if for sometime and been trying look it up and theres nothing. by watching his fighting style i really see no judo skills at all. he dosn't portray your typical judo throws at all. sokoudjou is a best example of a judo athlete. you don't see that at all with nick. oh, i wasn't saying i didn't believe you in anway. just in his fighting style he has shown no skills in judo at all from what i have seen. like i said, his brother shows judo skills. i hope scott <mark>smith</mark> knocks diaz dead not really just cant stand the diaz brothers they need to learn how to speak i think there cousins might also be there parents <mark>smith</mark> by right hand although i would like to see a rematch between diaz and lawler there good fighters not great anyways good luck too both ufc needs to open up and do some cross promotions would love to see le vs silva shields vs gsp overeeem vs lesnar hahaha i think the reason they don't do cross promotion is because of how wanderlei screwed them when he was going to fight chuck while still in pride. i can see diaz's cardio playing a big part in this one! i remember seeing <mark>smith</mark> looking really tired in that last fight before his right hand came from outta nowhere. and i bet <mark>smith</mark> is gonna want nothing to do with diaz on the ground, so, as long as diaz can control where the fight goes, he has the upper hand. (imo). not to sound too uninformed, but what's with this war diaz seems like you really don't know why they aren't in the ufc!! sorry if i offended u killit420 y dont u smoke a bomb and forget about it \"while looking forward to the contest, diaz stated in an official release from the organization that he's upset that he'll be forced to hurt <mark>smith</mark> in the presence of his children .\" awesome. glad they did this to sorta fill the gap i think babalu left. this should be another solid strikeforce card! gj guys. it's interesting how people always say diaz has no power but the majority of his fights through his career have ended in him tkoing/koing fighters. i think his record proves he has power he just doesn't use in every punch. he peppers you then when you start to wear down he sets up the big power shot. we've seen him do it time after time in his career. i'm tired of waiting, i want to see nick back in the ufc, like him or not, he shows up to fight every single time. he doesn't fight \"not to lose\" and i as a mma appreciate that, despite his antics. more dudes who will put on the line please!! i still cant believe diaz demolished shamrock how he did. either shamrock was never as good as i thought he was or his skills have declined severely. or he is just fighting with the mentality of a ameteur these days for reasons that evade me. perhaps he thinks making himself a sacrificial lamb and standing there as a open target is entertaining the fans? i cant help but feel that something was wrong with shamrock that night because he was like a walking punchbag. has anyone seen the youtube videos of shamrock submitting legends like <mark>dan henderson</mark> in seconds in submission competitions? how shamrock submitted ground and pounders like tito. how he won against the likes of bas rutten? all due respect to frank shamrock, but diaz is a really decent boxer, and his jujitsu is fantastic. the difference, though, was his hands. he uses lots of jabs, and they might not look like much, but they a) frustrate the hell out of his opponents, b) keep them at a distance, c) sets them up for the bigger shots. seems like such a simple thing, but if you look at mma across the board, jabs are underused sorta like leg kicks, but both of those aspects seem to be making the difference in many fights. frank was the prototype of the complete mma fighter back in his heyday (and i agree, he's not finished at 36), but i don't believe he has imrpoved his style enough to be able to beat a guy as talented as diaz on most days. omg! this fight announcement is awesome! and i don't care what anyone says, in my opinion this is the fight i am most looking forward to in the future. it trumps everything else. yes indeed. this is gonna be a great night for mma! i love watching both of these guys fight, and interview, and for totally different reasons. i've got kids too, so <mark>smith</mark> usually has the heart strings attatched when he fights. i can't help but like the way diaz $hit talkes his opponents, when he feels it's deserved. so far i haven't heard him say anything bad about <mark>smith</mark>, other than the thing about beating him up in front of his kids. that's really not so bad. we'll see if any sparks fly before the fight, but there's sure to be fireworks in the cage! this'll be a tough one for ufc to counter, other than spike is free. i wonder which one they'll play. not to sound too uninformed, but what's with this war diaz thing? i keep seeing war (fill in the fighter). war diaz is just that. two dude in a cage going to war with one winnir nick diaz!!!!!!!!!!!!! as far as all the diaz haters diaz already knocked out lawler! as for why he couldn't corner his bro that was that bs weed suspencion. hell he got a crip for it. nick diaz la times interview by lance pugmire april 9, 2009 by lance pugmire april 9, 2009 for mainstream sports fans thirsting for an athlete to come completely clean about taboo subjects in sports, here's an introduction to mixed martial arts fighter nick diaz, who not only speaks openly but is willing to answer follow-up questions. \"i'm more consistent about everything being a cannabis user,\" diaz said in an interview with the times last week. \"i'm happy to get loaded, hear some good music...i remain consistent. and i have an easy way to deal with [the drug tests].\" i can pass a drug test in eight days with herbal cleansers. i drink 10 pounds of water and sweat out 10 pounds of water every day. i'll be fine. \"stockton's diaz, 25, is pitted against mma veteran frank shamrock on saturday night in san jose in the main event of the first strikeforce card on showtime since the former promotional organization elite xc folded last year.strikeforce inherited much of the elite xc roster, and shamrock-diaz will be a 179-pound catchweight bout as shamrock moves down from 185 and diaz moves up from 160 .\" this is a super important fight--for showtime to show the mma world there's a clear alternative to the ufc--and that's exactly why you're seeing this matchup of exciting, forward-moving fighters who bang, \"shamrock, 36, said .\" i respect [diaz's] talent, he brings it. \"what diaz brings beyond flying fists and the ability to shut off a foe's breathing by holding the opponent's throat against his bottom leg is unbending honesty about his marijuana use, his frustration with his former bosses at the ultimate fighting championship and his belief that steroids are pervasive in his sport .\" let 'em do it, they'll have a shorter career than me, \"said diaz (18-7 with 10 knockouts, five submissions and a no-contest).\" with all that wear and tear on their tendons, something's going to explode. i feel like these guys are hurting themselves. you can't consistently fight on steroids. \"unfortunately for diaz, state athletic commissions also ban marijuana use, and he tested positive for the illegal drug in las vegas after his impressive win over japan's takanori gomi in early 2007. a state athletic commissioner in nevada argued diaz was numb to pain because of excessive marijuana in his system. diaz's victory was vacated; he was fined and suspended for six months .\" the drug is banned because of the damage it does to the person taking it, \"said keith kizer, nevada state athletic commission executive officer .\" it could make you lethargic, slow your reflexes, and those are dangerous things in a combat sport. \"the california state athletic commission said diaz would undergo drug testing before and after saturday's fight. diaz, however, argues marijuana eases problems he has battled since childhood when, he says, he was diagnosed with attention deficit disorder and prescribed mood-altering medication. his rebellion as a youth forced him to relocate to schools where he continually felt out of place and he ultimately became a high school dropout .\" i like the idea of being able to fight my way out of something, \"diaz said.diaz fought on his first professional mma card at 18 and was on the ufc roster two years later. he was 7-4 in mma's premier organization, losing to two fighters who have since been suspended for steroids (sean sherk) and pain-killers (karo parisyan) and dropping another decision to current ufc lightweight title contender diego sanchez.in 2006, diaz was extended an invitation to compete on the ufc's popular\" the ultimate fighter 4 \"reality television series. he said he didn't like the idea of being continually followed by cameras and speculated his presence was more a threatened order than a request.shortly after, diaz and the ufc parted ways, although his brother nate still fights in the organization. in nick's first post-ufc fight, he tested positive for marijuana. he suspects someone tipped off authorities .\" i got high in my [hotel] room the night before every [ufc] fight, \"diaz said. but kizer said diaz was merely among 10 of 16 pride fighting championships athletes who were tested that night.diaz is 4-1 since, earning a brazilian jujitsu black belt in 2007 and complementing his intense mma training by competing in triathlons. on march 29, diaz finished fourth in his age group in an event in sacramento as part of his training for saturday's fight.said shamrock of diaz:\" he definitely smokes marijuana. that's his own business, but it's not the greatest thing for the sport. we're fighting a stigma. still, there's something refreshing about his honesty. \"diaz says he believes mma fans admire his attitude, more so than his peers .\" i don't worry about the sport, i worry about my own...teeth getting kicked in, \"diaz said. cesar pre-fight interview by <mark>michael david smith</mark> nick diaz has created quite a stir in mma circles this week by telling the los angeles times that he smokes marijuana and drinks large quantities of water to help him pass drug tests before and after his fights. i requested an interview with diaz to ask him to explain those comments, and diaz, through spokesmen, declined.but on friday i caught up with diaz's coach and manager, cesar gracie, for an interview in which we discussed diaz's marijuana use and his fight on saturday night with frank shamrock. the full interview, which touches on everything from michael phelps to diaz's participation in triathlons to the family tree of the legendary gracies, is below.michael <mark>david smith</mark>: nick told the los angeles times that he smokes marijuana. what do you make of those comments? cesar gracie: nick has a prescription for marijuana in california. he has had a prescription for the last couple years, so it's a legal drug for him. he has the prescription for adhd (attention-deficit hyperactivity disorder), and he says it helps him. i'm not a doctor, but he says it helps him and using marijuana is legal in california with a prescription. obviously, i'd rather he focus more on talking about fighting than on being a cannabis spokesperson, but he has a right to do what's legal in california, so i don't think it's that big a deal. it's legal by california law, but he still has to pass a test from the california state athletic commission, and he'll be in trouble if he tests positive, right? cesar: if he tests positive, yes. but what he'll do is not smoke for weeks leading up to the fight so he'll test negative. he's fought in california and passed the marijuana test. so it all worked out.he said he drinks 10 pounds of water a day. i interpreted that as saying that large quantities of water help you get the drugs out of your system. is that what he meant by that? cesar: i beileve so. he was talking about not smoking and flushing it out of his system. as much as he exercises, he burns off fat and flushes it out of his system. but remember, in california it's legal. you just can't be stoned during your fight--you can't test positive during your fight.your name is legendary in mma and brazilian jiu jitsu. what is your opinion of whether smoking marijuana is consistent with being an mma fighter or a brazilian jiu jitsu practitioner? cesar: i would have always said no, and i've told nick several times,\" athletes can't do this. \"but i guess i've been proven wrong. look at michael phelps. look at nick, who fights and does triathlons. i definitely wouldn't encourage people to use marijuana. it's my personal opinion that any kind of smoke, whether it be cigarette smoke or marijuana smoke isn't good. common sense would say it's detrimental. watching nick fight, and knowing that he participates in triathlons, it's obvious that he has very good cardio. i would think that wouldn't be consistent with smoking anything, but he has good cardio and obviously michael phelps has good cardio. cesar: i'm not a scientist and i'm not a doctor. i would be concerned with long term, 20 years from now what are his lungs going to look like? i just wouldn't gamble with that. most of the people i've met in my life who are habitual marijuana smokers are couch potatoes and don't have a lot of motivation. obviously guys like phelps, and other athletes who smoke marijuana--i've heard of pro football players smoking marijuana and they are still great athletes .--i just don't have a right to tell them don't have a beer and i also don't have a right to say not to smoke marijuana. it's a medical prescription that he has a prescription for. i don't think it's that big of a deal. it's not cheating. remember, the athletic commission, their argument for banning marijuana is actually that it could hurt you--you could be lethargic and unable to protect yourself. it's not cheating, it's that it could be to your detriment. that's why they don't want you to be on it. it's not like steroids. i think the media should focus on serious issues like steroids and pain pills, not minor issues like this.let's talk about the fight. you have fought frank shamrock. what's your scouting report on him? cesar: i think he's a hard hitter. he's an athlete. he's explosive. he's very strong. he's a really good mma striker. he's got so much experience and he brings that experience into the cage with him, so you're not going to surprise him. he's got a winner's mentality. he's going to make you earn it, for sure. i was a little surprised when this fight was announced, just because nick has fought at lightweight and frank shamrock has fought at middleweight. is 179 pounds a good weight for this fight? cesar: nick would have taken that fight at any weight. he's a fighter. he's one of those guys who's going to take the fight because he wants the challenge. when he was fighting at lightweight, that was a tremendous cut for him and i really didn't like to see him that light. it took him a long time to get there and i don't think he was at his best at lightweight. i think nick and frank will walk into the cage at about the same weight. obviously frank is more used to fighting around that weight so that might be an advantage. we're a couple of hours from the weigh in. what will nick weigh in at today? cesar: about 180, same as frank, probably. the weight class is 179 with a one-pound allowance, so i assume both guys will come in at 180. what kind of shape is nick in right now? will he have any rust because he hasn't fought in a while? cesar: it's been a while but frank is coming off a layoff and his arm was broken from a kick. he's in good shape and i think it's going to be a good fight.how do you think strikeforce is coming along after buying the elitexc assets? cesar: it's doing well. i've been around some of these mma promotions that were like a dot-com start-up, coming in and spending crazy money, hiring too many people and giving ridiculous contracts to some of the fighters, paying people what they weren't worth. scott coker, the head of strikeforce, is a different kind of planner. he's doing things the right way. i think he's going to be very successful. i know you also coach gilbert melendez, who's on the co-main event. how's he doing and what do you expect us to see from him saturday night? cesar: gilbert is in phenomenal shape. he really is. unfortunately josh thomson broke his leg, and now gilbert is fighting a different kind of opponent in rodrigo damm, so he's having to make some adjustments. he's a dangerous submission specialist with good stand-up and good wrestling skills, so he's well rounded. gilbert doesn't have quite the pedigree in submission grappling that (damm) does, but i think he's ready for this fight and in shape for a five-rounder. you have by far the most famous last name in brazilian jiu jitsu. just to clarify, are you royce gracie's first cousin? cesar: you know, i don't know what that is. second cousin, i think. his father is my great uncle. we've had people in the family having kids until they're 60 years old or something, so it's kind of funny. royce should be a lot older than me. so he's a generation older than you but he's not many years older than you? yeah. exactly. cesar: i think that makes him your cousin once removed.that sounds right. cousin once removed? that sounds good.well, thanks for your time. is there anything else you want to say? cesar: just that i hope it's clear that i'm definitely not a proponent of the whole marijuana thing or whatever ....which makes me think...can anyone else see strikeforce booking"}, {"articleID": "2011062103_00094044_W", "names": {"Mark Reynolds": ["Q1047714", "Q1265875", "Q16223397", "Q26936702", "Q928463"], "Adam Jones": ["Q1060788", "Q16232662", "Q2537838", "Q2823965", "Q29787083", "Q349892", "Q350686", "Q43101011", "Q4679305"]}, "date": "2011-06-21", "url": "http://kdwn.com/index.php?page=2&section=SPORTS_NEWS&title=Markakis,_Orioles_pound_struggling_Pirates_8-3", "content": "sports news? markakis, orioles pound struggling pirates 8-3 pittsburgh (ap)--baltimore orioles pitcher jake arrieta didn't have his best stuff on monday night against the pittsburgh pirates. the way his teammates are hitting when he's on the mound these days, his best is hardly required. arrieta moved into a tie for the american league lead in wins, taking advantage of another offensive outburst as the orioles pounded the struggling pirates 8-3. \"i really don't know what it is, the team, they find a way to put runs on the board when i'm on the mound,\" arrieta said. \"it's a good feeling for me. i'm not going to argue with it .\" the orioles are averaging 6.5 runs when arrieta (9-4) starts, a number they topped in the second inning while chasing pittsburgh starter charlie morton (7-4). baltimore has scored at least seven runs 11 times this season, and arrieta has started seven of those games. nick markakis added three hits to extend his hitting streak to 11 games as baltimore continued to light up the scoreboard when arrieta takes the hill. and for a night anyway, arrieta got in on the act. he collected his first major league hit, a bloop to shallow right field that scored <mark>mark reynolds</mark> to cap baltimore's five-run first inning. \"i got an at-bat in the first, something i really didn't expect to do,\" arrieta said. \"it was a fun game to be a part of .\" the hit helped take some of the pressure off on a night when arrieta was hardly dominant. he gave up three runs in five innings on a sticky night in which he labored through 87 pitches. orioles manager buck showalter called arrieta's performance \"so-so,\" yet it was enough to lift him into a five-way tie with for the al lead in victories. the rest of the list includes some of the top pitchers in the game, including detroit's justin verlander and new york's cc sabathia. though his era is a pedestrian 4.50, arrieta is more concerned with the scoreboard at the end of the night. \"it's a good feeling, being on top of the board with some of the big names around the league,\" he said. \"i'd like to stay on pace with them. i feel like i have the stuff and ability .\" baltimore handed the pirates their fourth straight loss by pouncing on morton, whose june swoon continued on a night in which he gave up seven runs - six earned - and eight hits in two innings. he fell to 2-2 this month with an era of 8.50. his resurgence has been one of the pleasant surprises in a pleasantly surprising season for the pirates. he endured a miserable 2010 in which he went 2-12 with a 7.57 era, but has revived his career thanks to an improved sinker. it rarely worked against the orioles, who took morton's favorite pitch and sprayed it all over pnc park, which had a fair share of orange in the stands from baltimore fans who made the relatively short trip west for the game. pittsburgh manager clint hurdle blamed morton's woes on a heavy workload. \"i think it's a stamina issue that he's trying to fight through,\" hurdle said. \"that has caused him to elevate the ball much more than he was earlier this season .\" maybe, but morton's issues began well before his pitch count could get out of hand. j.j. hardy led off the game with an infield hit and markakis followed a double. both came home on a two-run single by <mark>adam jones</mark> and surging derrek lee added another rbi single before morton managed to get an out. \"it's nice to get an early lead like that, but more importantly we continued to build on it,\" lee said. morton's misery, however, was just beginning as robert andino chipped in an rbi single before arrieta got in on the act, lofting a flare into shallow right field, a run-scoring single that gave the orioles a 5-0 lead. the onslaught continued in the second behind an rbi double by matt wieters and a sacrifice fly by <mark>mark reynolds</mark>. that was more than enough for arrieta, who labored at times but was never in any real danger against the suddenly reeling pirates. pittsburgh appeared to be on the verge of a breakthrough last week, ripping off four straight wins to climb two games above .500 this late in the season for the first time in 12 years. four losses have followed, all to american league teams that have found a way to quiet pittsburgh's bats. the pirates have managed just seven runs during the slide, their longest since dropping six straight from may 10-16. the victory gave the orioles consecutive wins for the first time in nearly two weeks as baltimore improved to 33-37. the orioles didn't win their 33rd game last year until aug. 3. \"i feel like this team has been pretty relaxed all year, we've just been a little bit streaky,\" lee said. \"we need to find a way to play like this more often .\" "}, {"articleID": "2016052914_00523282_W", "names": {"George Robertson": ["Q27918263", "Q55362564", "Q5543953", "Q56597390"]}, "date": "2016-05-29", "url": "http://columbiatribune.com/news/local/salute-to-veterans-air-show-brings-out-families-friends/article_7ddb5ee6-aff4-5854-bdf5-b5ab76426137.html?comments=focus", "content": "Given the number of families in attendance Saturday at Columbia Regional Airport, it would be safe to call the Salute to Veterans air show a family-friendly event. The annual air show started Saturday and continues from 9 a.m. to 4 p.m. Sunday. It's the 28th year for the event. Related collection: Salute to Veterans Air Show 2016 article: Memorial Day parade taking new route Monday Subscription Required An online service is needed to view this article in its entirety. You need an online service to view this article in its entirety. Have an online subscription? Login Now Need an online subscription? Subscribe Login Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Or, use your facebook account: facebook Need an account? Create one now. Choose an online service. 1 Online $13.00 for 30 days Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. 2 Online (Previously Online + Webapp) $13.00 for 31 days Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone, as well as the Web App on your computer or iPad. 3 7 Day Home Delivery $16.46 for 30 days Home delivery of the print edition every day *, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. 4 Print Only $14.28 for 28 days Home delivery of the print edition *, including coupons, specials from major retailers and expanded news and analysis. Includes online. 5 Add online to print subscription Free! Your bill will be updated to include online as of this date. 6 MU Student Subscriptions Free! Online Student Access to the ColumbiaTribune.com 7 16 weeks for $20 Online and Print $21.36 for 112 days Home delivery of the print edition every day, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone, as well as the Web App on your computer or iPad. 8 13 for $13 | Wednesday + Sunday Home Delivery $14.10 for 91 days Get 13 weeks of our Sunday and Wednesday paper delivered to your home or office for just $1 per week. 9 16 Weeks for $16 Print Home Delivery $17.36 for 112 days Get 16 weeks of home delivery for just $1 a week. 10 26 for $26 | 7-Day Home Delivery $28.20 for 182 days Get 26 weeks delivered to your home every day for just $1 per week. 11 26 weeks for $26 | 7-Day Home Delivery $28.20 for 182 days Get 26 weeks of home delivery for just $1 a week and save 71% off the regular home delivery subscription rate. 12 7-Day Home Delivery (1 Year) $211.53 for 365 days Home delivery of the print edition every day *, unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. Paid in advance for a year, for your convenience. 13 Special: 13 weeks for $20 | Wed, Sat, Sun $21.70 for 91 days Get 13 weeks of our weekend home delivery with expanded pro, college and prep sports coverage. Delivered to your home or office at 38% off the regular home delivery subscription rate. 14 Wed-Sat-Sun Home Delivery $11.75 for 31 days Home delivery of the print edition on Wednesday, Saturday and Sunday. Unlimited access to ColumbiaTribune.com on your computer, tablet and smart phone. Monthly recurring. None of these apply to you? Back Need an account? Create one now. You must login to view the full content on this page. Screen Name or Email Password Forgot? Remember me on this computer Login Screen Name or Email Now I remember! Or, use your facebook account: facebook Need an account? Create one now. Shannon Hackett was in attendance with her husband, Zach Hackett, daughter Allison, 7, and sons Jackson, 10, and Jordan, 9 months. The family traveled all the way from Russellville for the air show. Shannon said the trip was Jackson's idea. \"I like planes,\" Jackson said. Sharon Hackett said the air show was a perfect family outing for Memorial Day weekend. The clear, sunny weather was a nice bonus, she said. \"It's wonderful that it's free,\" she said. \"This is our first time. It's been fun so far .\" The Hackett children spent some time exploring an A-10 Warthog. Luke Gabriel, a senior airman in the U.S. Air Force, said the plane is used for ground support and that its 30 mm gun can fire 30 rounds per second. He said the gun can only fire two - to three-second bursts before it overheats. Dorothy and <mark>George Robertson</mark> traveled to the air show from Vienna, Mo. \"We got up this morning and thought we would drive up here,\" she said. \"It's a nice day, so we thought we would check it out .\" Levi Clark, 7, talked with members of the Canadian Armed Forces SkyHawks parachute team after they landed. He posed with the team as his mom, Lisa Clark, snapped a photo. \"I thought they were good,\" Levi said. Asked if he might jump out of airplanes one day, he said he might consider it. Lisa Clark said their family enjoyed celebrating Memorial Day in a unique way. \"It's a really amazing tribute to our country,\" she said. Nic Thompson of Columbia went to the air show with his wife, Ashley, and his father-in-law, Dan Steuerwald. Thompson, a Marine Corps veteran, discussed the features of a World War II-era B-25 bomber that was on display. \"World War II fascinates me,\" he said, noting how amazed he was by the capability of a plane the size of the B-25. Not everyone attended the air show as a family affair. David You, a doctoral student in economics at the University of Missouri, came with a group of fellow students. With classes finished for the year, he said the air show provided a nice way to unwind. \"We just heard there's an air show,\" he said. \"I'm kind of a fan of these kind of aircraft .\" You said he missed the air show last year but that he thinks it's worth a return trip next year. \"The skydiving really impressed me,\" he said. The U.S. Army Golden Knights parachute team and the Skyhawks appeared to be the crowd favorites among the morning performances. The Golden Knights prepared for an afternoon jump, which was set to feature a mass formation. They even rehearsed the jump on the ground in what they called a \"dirt dive .\" High winds Saturday afternoon ultimately forced the team to cancel the afternoon jump. Sgt. 1st Class Jonathan Clevenger, a member of the Golden Knights, said the team averages about 500 jumps a year, with performances at different air shows or events almost every weekend. Clevenger said he has completed 1,727 jumps. Deputy City Manager Tony St. Romaine was set to be part of a tandem jump with the Golden Knights, but those plans were delayed until Sunday because of the cancellation. St. Romaine said the team offered him the opportunity to jump in appreciation for all the work he does coordinating the air show. \"I've been looking forward all day to this,\" he said. \"I'm very hopeful we can jump on Sunday .\" St. Romaine said he was looking forward to the 13-second free fall from 13,500 feet. & copy; 2016 Columbia Daily Tribune. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Thank you for visiting ColumbiaTribune.com You have viewed your 10 free stories. You can come back at the end of your 30-day period for another 10 free articles, or you can purchase a subscription and enjoy unlimited access to local news, sports, photos and thoughtful analysis to help make sense of it all. If you need help, please contact our customer service office at 573-815-1600. Have an online subscription? Log in Now Need an online subscription? Subscribe Login Username or Email Address Password Forgot? Remember me on this computer Username or Email Address Now I remember! Log in to comment with Facebook account: facebook Need an account? Create one now. None of these apply to you? Back Close Window [x]"}, {"articleID": "2018031219_00239339_W", "names": {"Jamal Lewis": ["Q1452212", "Q46996227"]}, "date": "2018-03-12", "url": "http://the72.co.uk/99322/norwich-youngster-called-international-friendlies/", "content": "Norwich City youngster, <mark>Jamal Lewis</mark>, has today been called up to represent Northern Ireland during the upcoming international break. <mark>Lewis</mark> has made 13 appearances for the Canaries in the Sky Bet Championship this season, after being thrown in at the deep end by City boss Daniel Farke. The full-back has never previously been called up by the senior team has made three appearances for the U18's as well as a single appearance for the U21's. <mark>Lewis</mark> has impressed for the Canaries so far this season with his goal in the FA Cup 3rd round replay against current Premier League champions Chelsea thrusting the 20 year old into the limelight. Speaking in his press conference this afternoon, City boss Farke praised his young defender for his recent call-up on the international front: \"It's brilliant news for him and well-deserved .\" He's a brilliant lad. I'm really happy for him. He's totally happy and it's great for him. \"<mark>Lewis</mark> and his international teammates will face South Korea at Windsor Park on the 24th of March"}, {"articleID": "2017072414_00506554_W", "names": {"John Smith": ["Q14948763", "Q16225555", "Q16674228", "Q1701779", "Q18633303", "Q18706057", "Q2031229", "Q20856697", "Q21228107", "Q23008642", "Q23008647", "Q29643615", "Q30612639", "Q3809625", "Q40765031", "Q42225247", "Q43392856", "Q43910764", "Q444388", "Q47126468", "Q47452313", "Q48810908", "Q51586908", "Q54577013", "Q54635521", "Q54635522", "Q6258245", "Q6258251", "Q6258294", "Q6258296", "Q6258298", "Q6258312", "Q6258332", "Q6258338", "Q6258342", "Q6258344", "Q6258352", "Q6258362", "Q6258364", "Q6258373"], "Chris Lowe": ["Q15994592", "Q433587", "Q46939502", "Q5107275", "Q5107277"], "Tommy Smith": ["Q10581", "Q1179411", "Q13131957", "Q16235031", "Q1770763", "Q462503", "Q652743", "Q7819862", "Q7819863", "Q7819864", "Q7819865", "Q7819866"], "David Wagner": ["Q1177029", "Q13102284", "Q5240764", "Q871069", "Q93041"]}, "date": "2017-07-24", "url": "http://www.skysports.com/football/news/12040/10959868/huddersfield-town-defender-christopher-schindler-signs-new-three-year-contract", "content": "Huddersfield Town defender Christopher Schindler signs new three-year contract By Sky Sports News HQ Last Updated: 24/07/17 3:04 pm Huddersfield's Wembley hero Christopher Schindler celebrates his winning penalty in the Sky Bet Championship play-off Huddersfield Town defender Christopher Schindler has signed a new three-year contract. Schindler, who scored the winning penalty at Wembley as the Terriers secured promotion to the Premier League, has committed his future to the club until 2020, with Huddersfield having the option of a further year's extension. The 27-year-old centre-back made the move to the <mark>John Smith</mark>'s Stadium from 1860 Munich for a then-club record fee in June 2016 and became a regular in the side, starting 46 matches. Schindler joins <mark>Chris Lowe</mark>, Elias Kachunga, Jonathan Hogg, <mark>Tommy Smith</mark> and Rajiv van La Parra in committing their futures to the club. SIGNED! Promotion winner Christopher Schindler has committed his future to #htafc penning a new deal until 2020 https: //t.co/Zmvu9C9iT0 (AT) pic.twitter.com/9BhtyGMeey--Huddersfield Town (@ htafcdotcom) July 24, 2017 \"When Christopher Schindler joined the club, I always said I was comfortable to break the transfer record to bring him in and I think he totally proved his worth last season,\" said Huddersfield head coach <mark>David Wagner</mark>. \"Christopher was one of our standout players last year; he adapted really well to English football and has developed during the year he's been with us .\" He is a very strong character, who leads the group both on and off the pitch and he's responsible not only for himself but the team and the football club as well. \"Everyone could see at Wembley how strong he is as a person, when he stepped-up and scored the winning penalty; it's great to have a person like him in our dressing room. Huddersfield Town have been showing off their new kit as they prepare for a first-ever season in the Premier League .\" He is an excellent defender who suits our style of play but now the challenge for him and his teammates is to make the step-up into the Premier League. \"Watch Huddersfield v Newcastle on August 20. Coverage begins on Sky Sports Main Event and Sky Sports Premier League at 12:30 pm."}, {"articleID": "2017072417_01082947_W", "names": {"Susan Collins": ["Q22279", "Q7647692"], "Shelley Moore Capito": ["Q459618", "Q47506415"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "John Thune": ["Q4571225", "Q462981"]}, "date": "2017-07-24", "url": "http://www.nydailynews.com/newswires/news/national/latest-lawmaker-blames-female-senators-failed-bill-article-1.3351186", "content": "WASHINGTON (AP)--The Latest on the ongoing effort by congressional Republicans to pass a health care bill (all times local): 1:15 p.m.. A Texas Republican congressman says it's \"absolutely repugnant\" that the GOP-led Senate hasn't acted on repealing the health care law and he singled out \"some female senators from the Northeast .\" In a radio interview with \"1440 Keys,\" Rep. Blake Farenthold said the Senate has failed to show the courage to dismantle the health care law. The Senate is expected to vote Tuesday on whether to move ahead on legislation. Farenthold complained about some female lawmakers and said, \"If it was a guy from south Texas, I might ask him to step outside and settle this Aaron Burr-style .\" Maine Sen. <mark>Susan Collins</mark> has been consistent in opposing the GOP replacement to Obamacare. Other female senators who have expressed reservations are <mark>Shelley Moore Capito</mark> of West Virginia and Lisa Murkowski of Alaska. ___ 12:25 p.m.. The Republican governor of Ohio says it would be a mistake for the Senate to move ahead on health and \"force a one-sided deal that the American people are clearly against .\" FILE - In this March 1, 2017 file photo, President Donald Trump, flanked by Senate Majority Leader Mitch McConnell of Ky., left, and House Speaker <mark>Paul Ryan</mark> of Wis., speaks during a meeting with House and Senate leadership, in the Roosevelt Room of the White House in Washington. Repeal and replace \"Obamacare .\" Just repeal. Or let it fail _ maybe with a little nudge. President Donald Trump has sent a flurry of mixed messages, raising questions about the White House strategy on health care. (AP Photo/Evan Vucci, File) In a statement on Monday, Gov. John Kasich says Republicans and Democrats should work together openly to address the failings of the Obama health law and come up with a bipartisan solution. Kasich, who sought the GOP presidential nomination last year, said the American people will come out on the losing end if Republicans try to force a vote without open dialogue and transparency. Kasich's comments add pressure to Ohio's Republican senator, Rob Portman, ahead of the vote. ___ 9:30 a.m. President Donald Trump has a message for Republican lawmakers deliberating the latest proposed health care bill: this is your last chance. Trump is tweeting that \"Republicans have a last chance to do the right thing on Repeal & Replace after years of talking & campaigning on it .\" Senate Majority Leader Mitch McConnell has struggled to get the votes needed from GOP lawmakers to pass the bill, particularly in the face of solid opposition from the Democrats. In this July 18, 2017 photo, Senate Majority Leader Mitch McConnell of Ky. speaks at a news conference on Capitol Hill in Washington. There are many reasons why the Senate will probably reject Republicans' crowning bill razing much of \"Obamacare .\" There are fewer why Senate Majority Leader Mitch McConnell might revive it and avert a GOP humiliation. (AP Photo/Andrew Harnik) Facing criticism from the president, the Senate postponed its summer break as it works to break through the stalemate. The White House remains adamant that a path to passing the bill remains, but concedes that the longer the process drag on, the harder it will be to move the bill forward. ___ 3:10 a.m.. The Senate will move forward with a key vote this week on a Republican health bill but it's a mystery what exactly they will be voting on. It's not yet known whether the legislation will seek to replace President Barack Obama's health care law or simply repeal it. Sen. <mark>John Thune</mark> of South Dakota says Senate Majority Leader Mitch McConnell will make a decision soon on which bill to bring up for a vote, depending on ongoing discussions with GOP senators. <mark>Thune</mark> sought to cast this week's initial vote as important but mostly procedural, allowing senators to begin debate and propose amendments. But he acknowledged senators should be able to know beforehand what bill they will be considering. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags: newswires associated press us newswires Send a Letter to the Editor Join the Conversation: facebook Tweet"}, {"articleID": "2015101815_00056650_W", "names": {"Matt Harvey": ["Q3299470", "Q6788770"]}, "date": "2015-10-18", "url": "http://www.nj.com/mets/index.ssf/2015/10/will_chris_christie_go_with_the_mets_to_wrigley_fi.html", "content": "Will Chris Christie go with the Mets to Wrigley Field? Comments NEW YORK--Chris Christie was among the happy Mets fans exiting Citi Field after Game 1, still marveling at the dominant performance of starter <mark>Matt Harvey</mark> in a 4-2 victory over the Cubs, when he was asked if he would truly go all out to support his favorite baseball team in the NLCS. Coming to Citi Field on Sunday night for Game 2? That's a given. But what about on Tuesday night, when the series shifts to Chicago's famous Wrigley Field? Would the governor cut into a week of campaigning to take this show on the road? \"Probably not,\" he told NJ Advance Media as he made his way past the Mets clubhouse and out of the ballpark late Saturday night. \"I'm going to Iowa. I'll be close, but not close enough .\" It wouldn't have been the first time that Christie left the area to support one of his favorite teams. He flew to Green Bay to watch his beloved Cowboys lose a heartbreaker to the Packers at Lambeau Field last winter, and if anything, his Mets fandom is just as strong if not stronger. RELATED: <mark>Harvey</mark> was \"an animal\" in his memorable NLCS debut Christie told me a great story in 2010 about showing up at a book signing in Mendham--and, despite being governor, standing in line with everyone else until the organizers saw him--to meet Darryl Strawberry. \"In our house,\" Christie said then, \"it is absolutely mandatory that you're Mets fans. You're not allowed to be anything else .\" It's far too early to know what will happen in this series, but the 1-0 series lead means that the Mets could have a shot to clinch a World Series berth in Chicago. Maybe, if that's the case, Iowa won't be far enough to keep him from making the trip. Steve Politi may be reached at spoliti @ njadvancemedia.com. Follow him on Twitter @ StevePoliti. Find Steve on Facebook."}, {"articleID": "2019102112_00046940_W", "names": {"Pradeep Kumar": ["Q22108021", "Q30689544", "Q37837571", "Q43111538", "Q45813198", "Q48720240", "Q7237408"]}, "date": "2019-10-21", "url": "http://gulfnews.com/uae/uae-based-couple-create-top-ranking-school-in-kerala-india-1.67171990", "content": "A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. Image Credit: Supplied Dubai A UAE-based Indian couple's efforts to elevate the standard of a girl's government school in Kozhikode of India's Kerala has paid rich dividends, with the local government now set to implement its exemplary model across 1,000 government schools in the state. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for Girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, has also been ranked as the No. 2 government school in the country in the Education World (EW) India School Rankings in 2019-2020. EW, India, is the world's largest survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. A once-crumbling school, the 120-year-old GVHSS underwent an infrastructural transformation in 2015 with funds from UAE based Faizal and Shabana Foundation, the philanthropy arm of KEF holdings, a Dubai-based company. The school is run by Faizal and Shabana Kottikolon, co-founders of the foundation. Faizal, founder and chairman of KEF Holdings, said: \"The top ranking for Nadakkavu school is a true testament to the success of our foundation's vision,\" Giving to Create Impact'. Our goal is to drive the positive transformation of government--and private--schools through an integrated and participatory approach. We are honoured to have created this benchmark of excellence for education in India. We will continue to drive our education engagement initiatives across the country as well as in other nations. \"How it all began As Faizal said,\" It all started with an interview where someone asked me what I thought India needed to do to change the face of public education. I realised dilapidated infrastructure was the first thing that needed change. Poor conditions not only lowered self-esteem of children but was the main cause of absenteeism and high dropout rate. So in collaboration with <mark>Pradeep Kumar</mark>, a local legislator, we began our work. When we arrived at this school the first time in 2014, we saw the structure was dilapidated. The building housed classes for 2,400 girls, but had only eight toilets. The mid-day meals were not providing enough nutrition and teachers were qualified but had no upgrading of skills programme. \"<mark>Pradeep Kumar</mark>, who had founded Prism (Promoting Regionals Schools to International Standards through Multiple Interventions) was planning to utilise a portion of the development funds granted to local legislators--in this case around Rs10 million (around Dh561,445)--to repair the crumbling school. The Kottikolon's invited the Indian Institute of Managemnt (IIM) Calicut to conduct research into why students were not inspired to study despite free education and free meals along with well qualified teachers. Armed with research and feedback on what was required and with consultation from iternational architects from Denmark and UK, the school underwent the transformation. Faizal said:\" We did not want to disrupt the school for a single day and undertook the project during the summer vacations, completing it in 95 days, Old walls were pulled down, new ones designed, toilets built and teachers imparted training through IIM Calicut. Suddenly the self-confidence of students and teachers went up manifold when the school reopened for the new academic year in 2015. New look New structures at the school included a 132,000-sq ft landscaped garden, a library with around 25,000 books and an 18,110-sq-ft astro-turf multipurpose playing field for athletics, football and hockey. A new sports complex with a 13,000-sq-ft indoor stadium, wood-floored basketball and badminton courts, and spacious changing and locker rooms for students were also built. Learning became fun and interactive as the classrooms were digitally equipped. Students took pride in carrying out experiments in modern laboratories for physics, chemistry and botany. Sanity and hygiene went up several notches with the construction of 92 spotless toilets, a corporate-style kitchen and dining hall that could seat about 600 students at a time. In an economically empowering experiment, village women found employment cooking at the school kitchen providing healthy, wholesome meals to the students and earning a modest income. All this brought about a dramatic turnaround of the average performance of the students as results indicated. In the 2015 board examinations, every student who took the exam passed, with 21 out of 393 students securing A + (above 92 per cent) in all subjects--a 400 per cent increase in A + grades since 2012. Self-sustainable The school has become the pride of Calicut and a central hub for the community, said Faizal. The facilities are utilised for a fee by the community. The entire neighbourhood uses the school grounds for morning walks and yoga camps during the weekends. The modern stadium and playgrounds are also leased out for community functions. Shabana, co-founder of the foundation, and vice chairperson of KEF Holdings, said: \"Since the inception of the foundation over 10 years ago, our single-minded focus was on driving social impact through our programmes. We are privileged to undertake the opportunity to support this school with a history of over 120 years, and to transform it into one of India's leading schools. More importantly, we see incremental value from this transformation. All our students benefit from high-quality education, delivered by a team of committed teachers. We see these students evolving as well-rounded individuals who can contribute incredible value to the society .\" What the students say Ayina P. P: Class 12, studying in Nadakkavu school since 5th std (2013) \"I am from a middle class family. I came here in 5th std and that time there was a small canteen and buildings were not clean. Then suddenly things changed, though I didn't understand that time what happened, today I know the effort it took .\" One important feeling I have is in this school we are asked to decide for ourselves and this has made me responsible and confident about taking decisions, making mistakes and still believing in myself. I am happy to be part of this school and this has changed my outlook in life. \"Neehara E: Class 12, studying in Nadakkavu school since 5th std (2013)\" The school gives us opportunities to grow and develop ideas on our own. Shiju sir my present teacher pushes me to present speeches, thoughts for the day which helps me develop my skills. I feel more confident and my efficiency has grown over the years, My dream is to become an entrepreneur and I would like to study at IIMK. My personal life too has become positive because of this school. \"Suhina Cherott: studied at Nadakkavu from 2010 - 2012 and is now a health care technician planning to do her PhD\" Earlier, when I was studying, the school was in a bad condition. When I passed out, the sudden change happened. I wish I had been there during this change. \"A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Mr. Faizal E. Kottikollon and Mrs. Shabana Faizal, Co-Founders of Faizal & Shabana Foundation Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: Image Credit: Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: A UAE-based Indian couple's efforts and perseverance at elevating the conditions of girl's government school in Kozhikode cty, Kerala, India has paid rich dividends catapulting it to the top 2 government schools in the country by the Education World (EW) India School Rankings in 2019-2020. The Nadakkavu Government Vocational Higher Secondary School (GVHSS) for girls, now a flagbearer of excellence in education in India with a focus on the holistic development of students, secured a total score of 1,061 points. EW, India, is the world's largest and most comprehensive survey of primary-secondary schools with scores based on interviews with parents, senior school students, principals and teachers. The schools are evaluated on 14 different categories. Image Credit: View gallery as list The Morning and Evening Brief A daily brief with the biggest stories of the day Subscribe Please enter your email address This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."}]