[{"articleID": "2017083016_00680717_W", "names": {"Miguel Angel Lopez": ["Q17711593", "Q459799", "Q6015707"], "Steve Clark": ["Q1370741", "Q20676404", "Q3431192", "Q3499197", "Q7612213", "Q7612214", "Q7612215"]}, "date": "2017-08-30", "url": "http://brownsvilleherald.com/business/article_f94c946e-8d9f-11e7-8113-339e9f6364b5.html", "content": "Brownsville port signs MOU; Mission part of economic development agreement - Brownsville Herald: Business Los Fresnos Consolidated Independent School District trustees approved a $114.3 million budget that includes the same tax rate as last year and a 3 percent raise for all employees at a meeting Monday in Los Fresnos. Posted: August 29 CALAR ALTO, Spain (AP)--Chris Froome increased his lead of the Spanish Vuelta on Wednesday, finishing second in the mountainous 11th stage behind Astana rider <mark>Miguel Angel Lopez</mark>. Updated: 11:31 am Port of Brownsville logo Posted: Wednesday, August 23, 2017 10:05 pm Brownsville port signs MOU; Mission part of economic development agreement BY <mark>STEVE CLARK</mark> STAFF WRITER Brownsville Herald Officials from the Brownsville Navigation District and Mission Economic Development Corporation have signed a memorandum of understanding to collaborate on international trade opportunities with Mexico and other economic development projects. The legally nonbinding agreement signals that the parties aim to \"work to connect and grow business between the Mission Business Park and the Port of Brownsville,\" according to an official statement. Patty Gonzales, the port's director of communications, said that although the MOU is nonbinding, it does indicate and \"seriousness and mutual respect .\" \"While the port has long worked with all chambers and EDCs up and down the Valley, this just kind of defines our relationship a little bit more,\" she said. \"Where it makes sense we'll share information that pertains to economic development in the region, not just economic development for Mission or the Port of Brownsville, but up and down the Valley .\" The port, which already has ties with economic development organizations in Cameron County, made overtures to EDOs across the Valley and Mission was the first to respond, Gonzales said. She cited Southwest Steel Coil, a Mission-based company that imports steel through the port, as one instance of the cross-Valley bond. \"That's one example of how we work together,\" Gonzales said. \"This is really the port working to fulfill its regional potential. The Port of Brownsville is the Valley's port .\" Teclo Garcia, Mission EDC's director of strategic partnerships, said his organization and the port had been talking for some time about coordinating, which makes sense given the asset of Hidalgo County's international bridges. \"We can try to drive traffic to the port and vice versa,\" he said. Garcia said having a deepwater port just down the road is an effective tool for recruiting companies to the business park. \"Especially when you're talking to a bigger factory or company that needs deepwater port access, they ask those kind of questions: What kind of interstate access to do you have? Do you have a port nearby? We haven't had the occasion yet but we hope to be able to use that,\" he said."}, {"articleID": "2017072413_00543668_W", "names": {"Richard Robinson": ["Q22280073", "Q25711399", "Q28058362", "Q51590316", "Q55713112", "Q7328701"]}, "date": "2017-07-24", "url": "http://www.shropshirestar.com/entertainment/showbiz/2017/07/24/mental-health-crisis-in-music-industry-as-campaign-launched-following-chester-benningtons-death/", "content": "\"Mental health crisis' in music industry as campaign launched following Chester Bennington's death Less than an hour ago Music Minds Matter aims to provide a 24/7 phone line. Subscribe to our daily newsletter Sign UpChester Bennington (PA) A funding campaign has been launched to address the\" mental health crisis \"in the British music industry. Prompted by the death of Linkin Park frontman Chester Bennington, charity Help Musicians has launched Music Minds Matter with the aim of providing a 24/7 mental health service phone line. The charity kicked off the funding drive with a $100,000 injection as CEO <mark>Richard Robinson</mark> described the situation as\" urgent \". He called on the music industry and philanthropists to offer\" arm in arm \"support. Chester Bennington inspired many with his music (Lewis Stickley/PA) The helpline will combine listening, advice and signposting with medical, clinical, therapeutic and welfare support for those who need it and is set to launch later this year. The campaign has been backed by Linkin Park's management according to Madina Lake bassist Matthew Leone, who has toured with the band. CHARITY EXCLUSIVE Help Musicians has announced a £ 100k #MentalHealth Fund on @ bbc5live as a response to the death of #ChesterBennington pic.twitter.com/hkMVtuqeJM--Help Musicians UK (@ HelpMusiciansUK) July 23, 2017 Advertising He said Bennington would have approved of the helpline, adding:\" I spent many hours working alongside Chester and he was an incredibly passionate man. \"\"Likewise, having spoken to Linkin Park's management, I know that they are anxious to follow this campaign through to a successful conclusion .\" This unique service will revolutionise the way musicians and the music industry think about mental health. It's been a long time in coming and I strongly urge the music community to support this brand new fund. \"Artists/fans @ HelpMusiciansUK @ SweetRelief & like orgs exist 4 YOU! Ur never alone, there's always a solution. Life is tough Love is tougher--Matthew Leone (@ Madinafire) July 21, 2017 Advertising A number of other stars from the world of music also lent their support including Enter Shikari frontman Rou Reynolds who said:\" Whilst creating and playing music has a wonderfully positive influence on mental health, it is not an all encompassing elixir for the vast swathes of mental health problems that our society breeds. \"The music industry has a dark history with the tragic loss of too many amazing people to suicide, so I'm very happy to hear about Music Minds Matter and support them in all they're about to do .\" Donate to Music Minds Matter campaign here."}, {"articleID": "2009030514_00051399_W", "names": {"Geraint Williams": ["Q4575731", "Q51123722"], "Joe Lewis": ["Q16185440", "Q268953", "Q712934", "Q942248"]}, "date": "2009-03-05", "url": "http://ilfordrecorder.co.uk/content/redbridge/recorder/sport/story.aspx?brand=RECOnline&category=spLeytonOrientFC&tBrand=northlondon24&tCategory=sportnewham&itemid=WeED05%20Mar%202009%2010%3A32%3A02%3A060", "content": "striker wayne gray returned to the orient side for the first time since august and insisted afterwards that the o's can beat the drop, writes trevor davies. the forward, who suffered a cruciate ligament injury during the game against carlisle, came on as a second half substitute against peterborough on tuesday night and went within a whisker of grabbing an injury-time leveller. orient's relegation worries worsened following the 3-2 defeat at the hands of the promotion-chasers, but gray is convinced the side can stay up. the striker hopes to keep his place in the squad for saturday's massive relegation showdown with brighton & hove albion in a must-win match for <mark>geraint williams</mark>' side. gray said after tuesday's match: \"every game is a massive one for us now and we need to get back to winning ways after a bit of a sticky patch .\" but we won two games on the bounce recently and we have got to go on a similar run. \"we have only won three at home all season, which is a problem but, hopefully, we can turn it around on saturday. the players have not given up by any stretch of the imagination and there are still 12 games to go and plenty of points to play for .\" we have got to try and take our second-half performance against peterborough into saturday's game and i believe we have enough ability in the dressing room to get out of trouble. \"after spending most of the season on the treatment table, gray was delighted to make a return on tuesday night .\" it was nice to be out there, i just hope i can make a difference and with four strikers and adam boyd coming back from injury, there is real competition for places, \"he added. gray could have marked his return with a sensational late leveller after sean thornton's free-kick bounced off visiting keeper <mark>joe lewis</mark>.\" as a striker you're always told to hit the target and that's what i did. but the keeper made a great save, although i expected to score, but next time i'll put it away. i feel good and very strong and want to keep playing, \"added gray."}, {"articleID": "2019111302_00027141_W", "names": {"William Barr": ["Q16683338", "Q43123958", "Q43911234", "Q8005104"]}, "date": "2019-11-13", "url": "http://stamfordadvocate.com/news/crime/article/Attorney-General-Barr-plans-visit-to-tout-14827420.php", "content": "https: //www.stamfordadvocate.com/news/crime/article/Attorney-General-Barr-plans-visit-to-tout-14827420.php US attorney general says feds will focus on high-crime areas Mary Hudetz, Associated Press Updated 8:55 pm EST, Tuesday, November 12, 2019 U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New Mexico, at a news conference at the office of the Bernalillo County Sheriff in Albuquerque Tuesday, Nov. 12, 2019. <mark>Barr</mark> was in Albuquerque to highlight the results of Operation Triple Beam, a program that has been conducted in numerous U.S. cities and has led to hundreds of arrests. less U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New...more Photo: Mary Hudetz, AP Photo: Mary Hudetz, AP Image 1 of / 4 Caption Close Image 1 of 4 U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New Mexico, at a news conference at the office of the Bernalillo County Sheriff in Albuquerque Tuesday, Nov. 12, 2019. <mark>Barr</mark> was in Albuquerque to highlight the results of Operation Triple Beam, a program that has been conducted in numerous U.S. cities and has led to hundreds of arrests. less U.S. Attorney General <mark>William Barr</mark>, left, with other federal and officials, announces that nearly 330 fugitives suspected of violent crimes have been arrested as part of a crime-fighting initiative in New...more Photo: Mary Hudetz, AP US attorney general says feds will focus on high-crime areas 1 / 4 Back to Gallery ALBUQUERQUE, N.M. (AP)--Federal authorities will coordinate with state and local law enforcement officers to crack down on violence in cities with high crime rates in the coming months after arresting hundreds of fugitives under a program underway nationwide, U.S. Attorney General <mark>William Barr</mark> said Tuesday. <mark>Barr</mark>'s announcement came as he joined other federal authorities and about 30 state and local law enforcement agents in New Mexico following the recent arrests of 330 fugitives in the state. The arrests had resulted from an initiative known as Operation Triple Beam, a U.S. Marshal-led program that began in 2011, officials said. <mark>Barr</mark> said a push in the past two years to increase arrests under the program had paved the way for more federal crime-fighting efforts that would see a boost in the coming weeks. He did not elaborate or say which cities would be targeted during a news conference in Albuquerque, where he said violent crime rates \"remain stubbornly high\" in comparison to the rest of the country. \"I don't think it's a secret to anyone here that New Mexico generally and Albuquerque specifically are experiencing a violent crime crisis,\" <mark>Barr</mark> said. The state has long struggled to overcome persistently high crime rates, which it has tried to curb with state law enforcement units deployed to arrest fugitives. Lawmakers also have pushed a range of reform measures, including a bill that called for more inmates to be enrolled in Medicaid so they have better access to drug and mental health treatment options after their release. The most recent FBI figures show New Mexico had the nation's second highest violent crime rate and its highest property crime rate last year. That's despite Albuquerque reporting a slight decrease in both categories for the first time in years. Crime in New Mexico's largest city accounted for more than half the state's crime overall. The data offers a broad look at crime in thousands of U.S. cities but can be inconsistent and incomplete. Jessie Damazyn, a spokeswoman for Albuquerque Mayor Tim Keller, a Democrat, did not comment directly on <mark>Barr</mark>'s visit in an email to The Associated Press. But she said the public safety mandate among community members called for long-term partnerships and more community policing, which typically calls for officers to spend enough time in specific neighborhoods to become a familiar and trusted face among residents. \"It takes all of us working together with our community to fight violent crime,\" said Jessie Damazyn, a spokeswoman for Albuquerque Mayor Tim Keller. At the news conference, <mark>Barr</mark> called the state's criminal justice system \"subpar,\" which he blamed on policies that give judges broad discretion over whether to detain suspects awaiting trial. Bennett Bauer, the state's chief public defender, said he has seen no evidence that the state's pretrial release system has spurred more crime in the state. He added that <mark>Barr</mark>'s criticism amounted to a \"blame game\" on judges. \"If the feds really want to help our communities, they should stick around and help fund solutions to the problems underlying crime,\" said Bennett Bauer, the state's chief public defender. \"Help us provide more drug treatment, education, jobs and rehabilitation in our prison system .\" Of the 330 arrests in New Mexico, 10 of the suspects were wanted in homicide cases and 50 faced assault charges, the Justice Department said. About 90 of those arrested were wanted on drug charges, and about 56 pounds of methamphetamine and other drugs were seized. In the past year, federal authorities also touted arrests, and gun and drug seizures under the program in Salinas, California; Phoenix; Tucson, Arizona; and Lawrence, Massachusetts. In New Mexico, the arrests resulted from a three-month operation. <mark>Barr</mark>'s visit follows Gov. Michelle Lujan Grisham's recent announcement that a special state law enforcement unit would renew efforts to find fugitives. The unit's seven state police officers and seven corrections officers are expected to help reduce the 1,600 warrants for people linked to violent crimes in New Mexico. Bernalillo County Sheriff Manuel Gonzales said he welcomed the help fighting crime. His office assigned 100 officers--a third of its force--to assist with Operation Triple Beam, officials said. \"We're not done,\" he said. \"This is just the start .\" Most Popular 1 Anguillan authorities prepare arrest warrant for \"fugitive' Scott Hapgood 2 Worker killed in SoNo Collection construction accident 3 37 pounds of pot seized in two busts in Stamford 4 Attorney: Scott Hapgood\" cannot clear his name if he is dead' 5 Support flows in for gymnast fatally injured in training 6 Police: Man charged with smashing bottle over head of Stamford man 7 Regis Philbin selling Greenwich mansion at a substantial loss View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2012093001_00014816_W", "names": {"Stephen Harper": ["Q206", "Q7609425"], "John Norris": ["Q1701228", "Q28099914", "Q6250649"]}, "date": "2012-09-30", "url": "http://jconline.com/usatoday/article/1602661?odyssey=mod|newswell|text|FRONTPAGE|p", "content": "tippecanoe county roads leave few, if any, scars of the casualties and lives lost. journal & courier photo editor michael heinz takes you to washington, d.c., with the honor flight. the black cultural center at purdue university in west lafayette hosted future and current students...purdue outlasts marshall 51-41 purdue improved to 3-1 for the first time since 2007 following the 51-41 victory over marshall at...purdue outlasts marshall 51-41 purdue improved to 3-1 for the first time since 2007 following the 51-41 victory over marshall at...purdue kicks off today's game against marshall at 3:15 p.m. daughtry has posted the video for its latest single, \"start of something good .' toronto (ap)--the last western detainee held at the u.s. military prison in guantanamo bay returned to canada saturday after a decade in custody following his capture in afghanistan at age 15 after being wounded in a firefight with u.s. soldiers, officials said. canadian public safety minister vic toews said that 26-year-old omar khadr arrived at a canadian military base on a u.s. government plane early saturday and was transferred to the millhaven maximum security prison in bath, ontario. the son of an alleged al-qaida financier, khadr pleaded guilty in 2010 to killing a u.s. soldier in afghanistan and was eligible to return to canada from guantanamo bay last october under terms of a plea deal. but canadian prime minister <mark>stephen harper</mark>'s conservative government had long refused to request the return of khadr, the youngest detainee held at guantanamo. the reluctance was partly due to suspicions about the khadr family, which has been called\" the first family of terrorism. \"the u.s. defense department confirmed the transfer in a statement and said 166 detainees remain in detention at guantanamo bay. the toronto-born khadr was 15 when he was captured in 2002 in afghanistan, and has spent a decade at the guantanamo prison set up on the u.s. naval base in cuba to hold suspected terrorists after the sept. 11, 2001, attacks. he received an eight-year sentence in 2010 after being convicted of throwing a grenade that killed army sgt. 1st class christopher speer during a 2002 firefight .\" his head is spinning a bit and it's going to be a real adjustment for him, but at the same time he is so happy to be home, \"<mark>john norris</mark>, khadr's canadian lawyer, said after speaking with his client .\" he can't believe that it is finally true. he simply can't. for very good reason he was quite fearful that the government would not follow through on its word and he's pinching himself right now not believing that this government has finally kept its word, \"he said. <mark>norris</mark> said khadr would be eligible for parole as early as the summer of 2013. he said khadr's return to canada comes 10 years too late. toews said the u.s. government initiated khadr's transfer and suggested that canada had little choice but to accept him because he is a canadian citizen. it will be up to canada's national parole board to release him, toews said .\" omar khadr is a known supporter of the al-qaida terrorist network and a convicted terrorist, \"toews said. toews called for\" robust conditions of supervision \"if khadr is granted parole. toews said in his written decision that he reviewed all the files forwarded by the u.s. government and said the parole board should consider his concerns that omar\" idealizes \"his father and\" appears to deny \"ahmed khadr's lengthy history of terrorist action and association with al-qaida .\" toews also said that omar khadr's mother and sister \"have openly applauded\" his father's \"crimes and terrorist activities\" and noted that omar has had \"little contact with canadian society and will require substantial management in order to ensure safe integration in canada .\" \"i am satisfied the correctional service of canada can administer omar khadr's sentence in a manner which recognizes the serious nature of the crimes that he has committed and ensure the safety of canadians is protected during incarceration,\" toews said. <mark>norris</mark> said it is regrettable that the minister is trying to influence the parole board. \"most of what he has said there is simply not true. it's part of the stereotype of omar that this government has been disseminating from the beginning,\" <mark>norris</mark> said. he added that once the correctional service \"will get to know omar\" they will \"recommend appropriate conditions .\" defense attorneys have said khadr was pushed into fighting the americans in afghanistan by his father, ahmed said khadr, an alleged al-qaida financier whose family stayed with osama bin laden briefly when omar khadr was a boy. the egyptian-born father was killed in 2003 when a pakistani military helicopter shelled the house where he was staying with senior al-qaida operatives. omar's youngest brother lives in toronto and is paralyzed after being shot in the attack that killed his father. another brother was released from a canadian jail last year after successfully fighting extradition to the u.s. on charges he supplied al-qaida with weapons in pakistan. the father was arrested in pakistan in 1995 after a bomb attack targeting the egyptian embassy in islamabad, but was released after former canadian prime minister jean chretien appealed to pakistan to give him due process. canada was embarrassed when he later emerged as a senior al-qaida figure. canadian governments have since refused to speak out on behalf of the khadr family. omar was found in the rubble of a bombed-out compound badly wounded and near death in afghanistan in 2002. his case received international attention after some dubbed him a child soldier. khadr's family did not immediately respond to messages seeking comment about his release. <mark>norris</mark> said he told the family saturday morning that omar had returned to canada. <mark>norris</mark> said it's not for him to say whether omar should live with his family once he's released. \"you can't change the fact that they are his family,\" <mark>norris</mark> said. \"they love him and i know that they'll find a way .\" <mark>norris</mark> said khadr has received some education in guantanamo bay and hopes that will continue so that he's able to reintegrate into the community. khadr has claimed in the past that he was abused at guantanamo, but canadian foreign affairs officials said they accept u.s. assurances that khadr was treated humanely. human rights groups have long criticized <mark>harper</mark>'s conservative government for not doing enough for khadr, and the supreme court of canada twice ruled that the canadian government had violated his rights. canada's three opposition parties demanded that <mark>harper</mark>'s government bring khadr home. he has received some sympathy from canadians, largely due to his age and the torture allegations, but his family has been widely criticized. u.s. defense secretary leon panetta signed off on khadr's transfer in april. panetta said in ottawa earlier this year that sending khadr back to canada would be an important step because it would serve as an example to other detainees who are looking to return to their home countries or other places. some guantanamo detainees have been reluctant to agree to plea deals after noting that khadr had remained in guantanamo despite being eligible to leave since last october. suzanne nossel, amnesty international usa executive director, said the guantanamo prison should finally be closed. she said canada now has a chance to right what she called the many wrongs against khadr and called for an investigation into khadr's allegations of torture. \"given the obama administration's glacial pace towards closing the u.s.-controlled detention center, little and late though it is, today's news represents progress,\" nossell said in a statement. \"khadr was imprisoned at the age of 15, subjected to ill-treatment and then prosecuted in a military commissions system that does not meet international fair trial standards. growing up in guantanamo and facing more prison time in canada, his future remains uncertain .\" the new york-based center for constitutional rights released a statement calling khadr's case \"one of the ugliest chapters in the decade-long history of guantanamo .\" 2 injured workers rescued after fall into empty lafayette sewage tank last western detainee at gitmo returning to canada omar khadr, 26, is on his way back to canada. work for us can't find what you're looking for? visit our become a subscriber today to enjoy these benefits: ipad-optimized edition mobile site & iphone app are you currently a subscriber? set up your digital access now. you now have full access. thank you for subscribing. access the tablet-optimized site, mobile site and iphone app share your access with any friend or family member subscriber exclusive top 5 daily email newsletter create an account or if you have a digital profile to continue using your current web browser, adobe flash must be installed or upgraded:"}, {"articleID": "2019011123_01065540_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2019-01-11", "url": "http://feeds.businessinsider.com.au/~/591710770/0/businessinsideraustralia~of-the-weirdest-facts-you-didnt-know-about-the-Real-Housewives-franchises", "content": "17 of the weirdest facts you didn't know about the \"Real Housewives' franchises Louis Baragona Bravo\" Real Housewives of Miami .' The \"Real Housewives\" franchise make up some of Bravo's most popular shows, spanning from New York to <mark>Beverly Hills</mark> and beyond. What goes on behind the scenes may be even more dramatic than what you see on television. These are 17 things you probably didn't know about the \"Real Housewives\" franchise. From the outside, Bravo's \"Real Housewives\" appears ultra-glam. There are luxurious trips, fancy cars, and designer clothes, all appearing among drama-packed feuds as well as silly, meme-worthy moments. Sometimes, it's hard to know what exactly is real about the popular reality show. Are those phone calls happening in real time? Is the drama organic? These 17 strange, little-known facts prove that sometimes the truth behind the glamorous world of reality television is much stranger than fiction--and the lines between the two are often blurry. The \"Real Housewives\" franchise isn't limited just to the United States. Slice \"Real Housewives of Vancouver .' Though the show has seen hundreds of wives in its iterations across the country, spanning from <mark>Beverly Hills</mark> and Orange County to New York and New Jersey, those aren't the only wives on TV screens. International versions of the show, including\" Real Housewives of Vancouver, \"\"Real Housewives of Athens,\" and \"Real Housewives of Israel,\" are broadcast in their respective countries. Vicki Gunvalson is the first (and longest-running) housewife in the original franchises. Gunvalson was a member of the original \"Real Housewives of Orange County\" cast, which made up the very first version of the show. Over nearly 13 years, fans have seen Gunvalson in just about any and every situation, from screaming about \"never having been with multiple partners\" on a ski slope to screaming about being forced to ride in a \"family van\" to the airport. \"Real Housewives of Atlanta\" scores the highest ratings most consistently. Bravo Nene Leakes on \"Real Housewives of Atlanta .' The wives of Atlanta tend to garner the most consistent ratings. Nene Leakes was, at one point, considered the\" highest rated \"castmate in the franchise. At its peak,\" RHOA \"captured an audience of nearly 4 million live viewers. Recently, though,\" Real Housewives of Orange County \"came out on top in terms of ratings. Currently, it's the most-watched version of the series. Bethenny Frankel may be a millionaire now, but she made way less her first season. Rodin Eckenroth/Getty Images Bethenny Frankel. Bethenny Frankel is known as one of the show's biggest breakout stars, having used her fame to create major wealth for herself and her business, SkinnyGirl Cocktails. In 2015, Frankel told INSIDER she made only $US7,250 total for her first season as a castmate on the show. The first castmate to ever throw a glass of wine was Tamra Judge. Bravo The moment the wine was thrown. Wine throwing has become a\" Real Housewives \"signature move, all thanks to the originator of the action:\" Real Housewives of Orange County \"star, Tamra Judge. At the time, Judge was fighting with a former cast member, Jeana Keough, and threatening her with a\" cyst and deceased. \"After things got heated, Judge threw red wine in Keough's face. Eventually, Judge apologised. Since then, Brandi Glanville, Danielle Staub, and many other wives have taken to chucking vino during heated arguments. And the first wife to ever walk off a reunion was Ramona Singer. Reunion walk-offs have become par for the course, with wives bolting due to sadness, anger, or just for dramatic effect .\" Real Housewives of New York \"castmate Ramona Singer was the first to walk off at a reunion, simply because she didn't want to continue the conversation. As the rest of the cast discussed fellow wife Alex McCord's nude photos, Singer made her exit. At the time, she said she had to use the restroom, but it was later revealed Singer was uncomfortable with the racy subject manner and the possibility of her daughter being somehow affected by the topic. Cast members have claimed that some on-camera phone calls are staged. Bravo Teresa Guidice on\" Real Housewives of New Jersey .' According to the aforementioned McCord, scenes in which the shows' stars are using the phone are usually doctored. According to accounts, producers will instruct castmates to call each other at pivotal moments of high emotion, usually when the timing is ripe for drama. And those dining scenes can apparently be filmed during very weird hours. Bravo \"The Real Housewives of Orange County .' Turns out\" Real Housewives \"stars don't eat in the emptiest restaurants in their respective cities. Instead, McCord revealed, producers arrange for the stars to eat at off-peak hours in restaurants. Why? The answer is surprisingly technical. A crowded restaurant means more people could end up on film. For people to appear on television, they must sign release forms. The more people there are in a restaurant, the more releases production is responsible for procuring. To avoid losing track of all the extra paperwork, production asks the wives to eat meals before or after typical times. For example, the cast might grab lunch at 10:00 a.m. as opposed to noon. Reunions take a ton of time to film. Bravo\" Real Housewives of Atlanta' reunion. Reunions typically air in two-to-three-part specials, all broken up into around an hour per special episode. Filming the reunion actually takes up to twelve hours, according to E! Online. The idea for \"Real Housewives\" came from a not-so-real television show. ABC \"Desperate Housewives .' According to former\" Real Housewives of Orange County \"cast member Gretchen Rossi, the inspiration behind the franchise was the fictional television drama\" Desperate Housewives. \"\"[Desperate Housewives] inspired the\" Real Housewives' franchise, \"Rossi told Hollywood.com in 2012 .\" Honestly, I feel I owe a lot to [\"Desperate Housewives\" creator Marc Cherry] for creating a show that inspired a real-life version. One of the show's greatest villains may have paid for his spot on the series. Bravo Slade Smiley and Gretchen Rossi. Slade Smiley was known for dating multiple members of the \"Real Housewives of Orange County\" cast, but Smiley's role on the Bravo show may have started with a $US2,500 donation. According to then-girlfriend Jo De La Rosa, he paid $US2,500 in a charity auction for the prize of landing a small part on an unnamed reality show. Eventually, Smiley and Rosa ended up on the cast of \"RHOC .\" \"It was something that he wanted to do, we were engaged and as corny as it sounds, I did it for love,\" Rosa said on the 100th episode anniversary special. Smiley went on to date another wife, Gretchen Rossi, with whom he's now expecting a child. The two are no longer on the show. \"Real Housewives of New Jersey\" has a strange connection to a Jonas Brother. In 2014, Former \"Real Housewives of New Jersey\" star Kathy Wakile enlisted the help of Kevin Jonas to build her New Jersey mansion. Jonas served as the contractor for the project, and runs his own business based out of the state. \"Kevin has an extensive knowledge of home automation and electronic features for the home,\" Wakile said. The shows apparently weren't always going to be known as \"Real Housewives .\" Flickr/Tony Hisgett <mark>Beverly Hills</mark>. According to a lawsuit filed against Bravo, the original idea for \"Real Housewives of Orange County\" was a show allegedly called \"Behind the Gates .\" The title came from the gates surrounding Coto de Caza, a private neighbourhood in Orange County, California, where some of the cast lives. For its part, \"Real Housewives of New York\" was allegedly going to be known as \"Manhattan Mums\" when it first came to development in 2007, according to Alex McCord. Teresa Giudice served her prison sentence in a location that may sound familiar. In 2015, \"Real Housewives of New Jersey\" breakout star Teresa Giudice was sentenced to serve a 15-month stint at Danbury, a correctional institution in Danbury, Connecticut. The prison was the inspiration for the facility featured in \"Orange Is the New Black .\" According to a former cast member, Housewives sign contracts to prevent them from suing each other. Bravo It is in their Bravo contract not to sue each other, according to a former cast member. \"Real Housewives of New York\" cast member Carole Radziwell said in 2014 that she was unable to sue fellow \"RHONY\" star Aviva Drescher for accusing her of using a ghostwriter on her book because she had signed away the right. \"There were people who were saying,\" Why don't you sue?' It's not an easy answer, \"Radziwell told BuzzFeed .\" There were several reasons. One is we sign contracts, so we can't sue each other. So you'd have to break the Bravo contract. \"Wives are able to sue, according to Radziwell, but only if they're willing to break a contract with the network. In her case, Radziwell said she didn't want to take on Bravo. Housewives are reportedly instructed not to discuss being on the show while they're on the show. Bravo Lisa Vanderpump in a confessional. In 2014, Radziwell also told BuzzFeed that she was unable to refer to any behind-the-scenes or production-based incidents that might break the fourth wall .\" We can't say that on the show because it refers to the show, \"Radziwell said. Instead, confessionals are filmed in the present tense, with the women discussing events that likely happened months ago, sitting in rooms designed to look like their homes, according to former\" Real Housewives of New York \"castmate Aviva Drescher. Aviva Drescher alleged that wives who bring the drama are rewarded. Bravo Drescher and her prosthetic leg. Drescher appeared on two seasons of\" RHONY \"and was known for her feuds with several castmates, which culminated in Drescher throwing her prosthetic leg during a finale episode. In explaining herself, Drescher revealed that producers reward castmates who stir things up. According to Drescher, she was given an eight-week contract and told that, if she\" delivered drama \"during that time, her contract would be extended. Drescher accused the aforementioned Radziwell of hiring a ghostwriter, and according to Drescher, her contract was extended. Visit INSIDER's homepage for more. NOW WATCH: Briefing videos"}, {"articleID": "2014082502_00027560_W", "names": {"Steve Holt": ["Q3498958", "Q42597657", "Q42870065", "Q7612878"]}, "date": "2014-08-24", "url": "http://ft.com/cms/s/0/522dcca2-c633-11e3-9839-00144feabdc0.html", "content": "April 21, 2014 9:55 pm Bank of England to oversee \"ethical hacking' of financial groups By Sam Fleming, Financial Policy Correspondent © Reuters Top financial institutions face simulated attacks on their computer infrastructure as authorities step up attempts to assess the UK's ability to weather Bank of England is this year helping to oversee an unprecedented programme of\" ethical hacking \"as part of a broader assessment of the resilience of the computer systems of more than 20 major banks and other financial players in the UK. The scenarios will draw on intelligence reports of the latest threats from hackers in the criminal world, terrorists and rogue states .\" The UK is leading the world on this - it is groundbreaking stuff, \"said one person familiar with the process. As online threats race up national security agendas and governments look at ways of protecting their national infrastructures a cyber arms race is causing concern to the developed world The move comes amid heightened attention to online security amid widespread damage from the so-called Heartbleed bug, which has made parts of the web vulnerable to cyber criminals. American Funds, a large mutual fund provider, warned this month that its customers might be at risk from the bug. The UK programme will involve cyber specialists from companies officially approved to do\" penetration testing \", drawing on an industry certification scheme called Crest. The exercise, known as cyber threat and vulnerability management, is being overseen by Andrew Gracie, the director of the UK's special resolution unit within the BoE. Waking Shark II process, which happened late last year, when City institutions conducted a simulated war game to check where vulnerabilities lay. UK garment makers face skills shortage Many businesses conduct internal penetration testing but this is the first time that the authorities will oversee such a broad process, with the goal of rooting out vulnerabilities in computer infrastructure including the payment system. The BoE has conducted a pilot of the scheme, according to two people familiar with the process. Royal Bank of Scotland, leading insurers and financial infrastructure providers such as the London Stock Exchange. The BoE's Financial Policy Committee made cyber threats a key focus last year, recommending that the Treasury, Prudential Regulation Authority and Financial Conduct Authority put in place a\" programme of work \"to test the system's resilience. The BoE declined to comment .\" It will be interesting how US and EU regulatory authorities respond, especially as the US followed the Waking Shark market-wide exercise with their own Quantum Dawn, \"said <mark>Steve Holt</mark>, a partner at Ernst & Young, the professional services firm. Concern about a possible state-sponsored attack on the City of London was heightened after last year's hacking of computer systems at South Korean broadcasters and banks, which originated from a Chinese internet address and was blamed by Seoul on North Korea. Financial Conduct Authority in its risk outlook for this year said it would work with the BoE and Treasury to test the resilience of the UK's critical national infrastructure to cyber attack. Copyright The Financial Times Limited 2014. You may share using our article tools. Scottish independence news headlines http: //www.ft.com/cms/s/0/522dcca2-c633-11e3-9839-00144feabdc0.html Contact us if you wish to print more to distribute to others."}, {"articleID": "2017050316_00362777_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2017-05-03", "url": "https://www.eveningexpress.co.uk/pipe/news/international/trump-hoping-for-resumed-middle-east-peace-talks/?share=email", "content": "by Press Association, 3 May 2017 17:28 President Donald Trump has expressed optimism for resumed peace talks between the Palestinians and Israel. He made the comment at the start of his Oval Office meeting with Palestinian leader <mark>Mahmoud Abbas</mark>. President Trump says that \"hopefully something terrific can come out between the Palestinians and Israel\" and that \"we've been working on that one a long time\". Mr Trump added: \"Maybe we can end that journey and start a much better journey .\" It is the first direct meeting between President Trump and Mr <mark>Abbas</mark>. More from the Evening Express"}, {"articleID": "2012120903_00000743_W", "names": {"Christopher Harrison": ["Q21464596", "Q5112489", "Q51448703"], "Daniel Harrison": ["Q48294929", "Q5217438", "Q5217439", "Q57757681"], "Steven Evans": ["Q16233781", "Q19975842"]}, "date": "2012-12-09", "url": "http://thescottishsun.co.uk/scotsol/homepage/news/4688778/To-hell-and-back.html", "content": "a grieving gran told last night how she endured a year of hell before finally being cleared of threatening a member of the crime clan who murdered her son. we told how horrified cancer sufferer sheena faulds was locked up following the accusations by lee-anne <mark>harrison</mark>. just two months earlier, lee-anne's brother <mark>christopher</mark> and cousin <mark>daniel harrison</mark> had killed sheena's son billy, 31, in an unprovoked knife attack. the 55-year-old had already faced the agony of losing her first son david in a fight in 1995. and sheena had the threat of her own trial hanging over her as she coped with the trauma of the hearing about billy's death. she had been due to face court this week, despite lee-anne twice failing to turn up for hearings. but sheriff margaret liddell deserted the case - ending a year of torture for the heartbroken mum. last night sheena, of millerston, glasgow, said: \"this has been utter agony from start to finish .\" i've had to deal with two killings, a day behind bars, a murder trial, lies made up against me and poor health. \"i think the harrisons, the police and the fiscal forgot who the victims were in all this - me and my family .\" sheena had been visiting son david's grave when she spotted lee-anne at a window. she sped off to avoid a confrontation, but two hours later cops arrived and told her they had evidence she had made threatening gestures. her first trial was due to take place during the trial of billy's killers, but was put off when lee-anne refused to turn up. it is believed prosecutors were told she'd no intention of giving evidence but the crown decided to plough on regardless. sheena said: \"this was a horrific circus that should never have gone this far. the police said i would never have been thrown in the cells if basic checks on the background to the complainer and possible motivation had been done .\" i'm told the police spoke to the crown about getting this dropped in february but it fell on deaf ears. they had another chance to drop it in july but battered on and wanted to do so again this week despite having no witnesses. \"lee-anne's brother <mark>christopher harrison</mark>, 20, and their 16-year-old cousin were convicted of billy's murder in august along with accomplice <mark>steven evans</mark>, 28. the killers stabbed their victim 31 times and sliced his heart in two during the frenzied attack on bonfire night in 2011 .? news group newspapers limited registered in england no. 679215 registered office: 3 thomas more square, london e98 1xy .\" the sun \",\" sun \",\" sun online \"are registered trademarks or trade names of news group newspapers limited. this service is provided on news group newspapers' privacy & cookie policy. to inquire about a licence to reproduce material, visit our syndication site. view our online press pack. for other inquiries,"}, {"articleID": "2020012001_00060145_W", "names": {"Mitchell Peters": ["Q25208140", "Q6881343"]}, "date": "2020-01-19", "url": "https://www.billboard.com/articles/columns/pop/8548430/michelle-obama-shares-2020-workout-playlist-featuring-lizzo-cardi-b", "content": "POP Michelle Obama Shares 2020 Workout Playlist Featuring Lizzo, Cardi B & More: Listen 1/19/2020 by <mark>Mitchell Peters</mark> FACEBOOK TWITTER EMAIL ME Monty Brinton/CBS via Getty Images Michelle Obama at The 61st Annual Grammy Awards in Los Angeles on Feb. 10, 2019. Michelle Obama is hoping to inspire lots of exercising in the new year by sharing her 2020 workout playlist. On Sunday (Jan. 19), the former first lady and dedicated health advocate shared some of her favorite tunes to listen to while hitting the gym. The 35-song playlist includes Lizzo's \"Soulmate,\" Cardi B's \"Press,\" The Carters' \"Apeshit,\" Bruno Mars' \"Perm,\" Nipsey Hussle, Ed Sheeran, and many more. It's about that time when New Year's resolutions get a bit harder to stick to. To offer a little inspiration, I want to share my go-to #WorkoutPlaylist with you. These songs always seem to give me that extra boost to get through my toughest workouts. What's on your playlist? pic.twitter.com/GFP56Yi9A6--Michelle Obama (@ MichelleObama) January 19, 2020 \"It's about that time when New Year's resolutions get a bit harder to stick to,\" Obama captioned the list on social media. \"To offer a little inspiration, I want to share my go-to #WorkoutPlaylist with you. These songs always seem to give me that extra boost to get through my toughest workouts. What's on your playlist?\" Over the years, Barack and Michelle Obama have regularly shared the music they're listening to. Last month, the former president shared his favorite songs of 2019, which included superstars like Beyoncé (\"Mood 4 Eva\" ), Rosalía (\"Con Altura\" ), Maggie Rogers (\"Burning\" ) and more. Stream Michelle Obama's full 2020 workout playlist below. FACEBOOK TWITTER EMAIL ME"}]