[{"articleID": "2019013120_00597528_W", "names": {"John C. Anderson": ["Q47539904", "Q48743453"]}, "date": "2019-01-31", "url": "https://www.thegardenisland.com/2019/01/31/news/the-latest-michigan-man-found-dead-outside-in-frigid-cold/", "content": "The Latest: Michigan man found dead outside in frigid cold By Bill Buley The Garden Island | Thursday, January 31, 2019, 7:59 a.m. Share this story <mark>John C. Anderson</mark>, 74, of Silvis, braves minus 27 windchill to do shirtless pull-ups on a tree branch outside Warren Tower Wednesday, Jan. 30, 2019, in Silvis, Ill. \"It's going to be a historically cold day and I wanted to do something nobody else dare do,\" said <mark>Anderson</mark>, who is known for his fitness stunts. \"A lot of people think all old people are cold, they got cold blood...I wanted to show them not all old people are that cold blooded, certainly I'm not,\" said <mark>Anderson</mark>. (Todd Mizener/The Dispatch - The Rock Island Argus via AP) People enjoy at the Lake Michigan at 31st Street Harbor, Wednesday, Jan. 30, 2019, in Chicago. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) A sign shows the current outdoor temperature in Glenview, Ill., Wednesday, Jan. 30, 2019. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) A harbor light is covered by snow and ice on the Lake Michigan at 39th Street Harbor, Wednesday, Jan. 30, 2019, in Chicago. A deadly arctic deep freeze enveloped the Midwest with record-breaking temperatures on Wednesday, triggering widespread closures of schools and businesses, and prompting the U.S. Postal Service to take the rare step of suspending mail delivery to a wide swath of the region. (AP Photo/Nam Y. Huh) Photographers set up tripods along the shore of Lake Michigan before sunrise, Thursday, Jan. 31, 2019, in Chicago. The painfully cold weather system that put much of the Midwest into a historic deep freeze was expected to ease Thursday, though temperatures still tumbled to record lows in some places. (AP Photo/Kiichiro Sato) Ice forms on the eyelashes of Aubreyanne Edwards, of Rock Island, Ill., as she braves minus 27 windchill while walking to The Fort Armstrong apartments Wednesday, Jan. 30, 2019, in Rock Island, Ill.. A blast of polar air enveloped much of the Midwest on Wednesday, cracking train rails, breaking water pipes and straining electrical systems across the Rust Belt with some of the lowest temperatures in a generation. (Todd Mizener/The Dispatch - The Rock Island Argus via AP) CHICAGO--The Latest on a major snowstorm and frigid weather in the Midwest (all times local): 10:25 a.m. Police say a 60-year-old Michigan man has been found dead outdoors amid frigid temperatures. Police say the man's body was discovered in east Lansing on Wednesday. An autopsy will determine the cause of death, although police say foul play is not suspected. The deaths of at least two other Michigan residents have been connected to the extreme cold weather. In Ecorse, police identified a 70-year-old victim as Gary Sammons, a former city council member and teacher. He was found Tuesday outside his home .------10:05 a.m. Officials say a suburban Detroit fundraiser in which people were to sleep outdoors to raise awareness about homelessness has been replaced with a drive to get people indoors during the extreme cold. The Detroit News reports Roseville police on Thursday cancelled the \"Sleep Out for the Homeless\" event scheduled for Friday night. The group organizing it, Macomb Feeding The Need, instead will open a temporary shelter. The change in plans comes amid bitterly cold weather. The National Weather Service says minus 13 degrees (minus 25 degrees Celsius) was recorded Thursday morning in the Detroit area, breaking the record for Jan. 31 of minus 7 degrees (minus 27 degrees Celsius) set in 1920. Meteorologist Alex Manion tells the Detroit Free Press people should stay inside if possible and wear multiple layers .------9:45 a.m.. The dangerously cold weather system that is enveloping much the Midwest has brought an icy record low to a northern Indiana city. The National Weather Service says the temperature fell to minus 20 degrees (minus 29 Celsius) Thursday morning in South Bend, setting a record low for Jan. 31. The previous record was minus 11 (minus 24 Celsius), set in 1936. National Weather Service meteorologist Chris Roller says South Bend's record low is \"odd\" because when temperature records are set they're usually within a few degrees of the previous record and not nine degrees different .------9:30 a.m.. A Michigan utility that warned residents that they risk brief interruptions of natural gas service for heat amid bitterly cold weather if they don't reduce energy use says efforts to conserve energy are making a difference. Consumers Energy said in a statement Thursday that it's \"cautiously optimistic\" its requests to curb natural gas use \"are having a positive effect.\" Auto plants and other big energy users throughout Michigan are joining residential customers in cutting back. Consumers Energy's CEO Patti Poppe made an appeal Wednesday following a fire at one of its suburban Detroit facilities that affected natural gas supplies. An emergency alert was sent late Wednesday to cellphones asking people to lower thermostats to 65 degrees (18 degrees Celsius) or below through Friday .------9:10 a.m.. About 1,700 flights in and out of Chicago's airports have been canceled in the last 24 hours amid the frigid weather in the Midwest, with experts saying the cold is affecting transit operations. The temperature Thursday morning at O’Hare International Airport was negative 20 degrees (negative 29 Celsius). About 1,450 flights were canceled at O’Hare, one of the nation's busiest airports. Midway International Airport had about 250 cancellations. Both airports were reporting delays of about 15 minutes. Airline experts say the double-digit subzero temperatures affect manpower, equipment and fueling at airports. United Airlines has brought in heated tents for its employees at O’Hare and added workers to increase shifts. The low temperatures also affected rail service in Chicago, the nation's third-largest city. Some commuter lines are shutting down or altering schedules amid the cold .------8:15 a.m. Officials are warning Michigan residents that they risk brief interruptions of natural gas service for heat amid bitterly cold weather if they don't help reduce energy. The warning comes after a fire at a utility's suburban Detroit facility that affected natural gas supplies. Consumers Energy's CEO Patti Poppe made an appeal Wednesday night for customers to reduce their natural gas usage. She later told The Detroit News that \"localized planned curtailments: for some homes and business if demand isn't reduced. An emergency alert was sent late Wednesday to cellphones asking people to lower thermostats to 65 degrees (18 Celsius) or below through Friday. Gov. Gretchen Whitmer asked everyone to\" to do your part. \"------8 a.m.. A good Samaritan offered to pay for hotel rooms for 70 homeless people in Chicago who were camped out in tents amid the bitter cold that blanketed Chicago. The offer came after the Chicago Fire Department on Wednesday confiscated nearly 100 propane tanks given the group to keep them warm as temperatures sank to negative 22 (negative 20 Celsius). The department acted after one of the donated tanks exploded. Salvation Army spokeswoman Jacqueline Rachev said city officials told the organization about their actions at the camp. The Salvation Army was about to move the people to a warming center when the city called again and informed them of the gesture. Rachev was not sure of the identity of the good Samaritan and only knew the hotel was on the city's South Side .------7:30 a.m. Temperature records have been broken in northern Illinois amid the arctic deep freeze enveloping the Midwest. The National Weather Service says the temperature Thursday morning in Rockford hit a record-breaking negative 30 degrees (negative 34 Celsius). The previous record of negative 27 degrees (negative 33 Celsius) was set on Jan. 10, 1982. The city's records date back to 1905. Rockford is about 80 miles (129 kilometers) northwest of Chicago. Meteorologists say warmer weather is on the way for the weekend .------7:20 a.m. Another day of dangerously cold weather in the Midwest is closing hundreds of schools, businesses and government offices in Wisconsin and Minnesota, but students are heading back to school in the Dakotas. Two of Wisconsin's largest school districts canceled classes again Thursday, when morning temperatures hovered around negative 20 degrees (negative 29 Celsius). In Minnesota, where wind chill readings could reach negative 55 degrees (negative 48 Celsius), several large school districts also called off classes. The extreme cold has also sent dozens of people to hospitals in Minnesota. Hennepin Healthcare in Minneapolis says it has treated 22 patients for frostbite since Friday, including 13 admitted to the hospital. But in North Dakota, students in Fargo and other nearby cities are heading back to school. Temperatures in the region dropped to minus 25 degrees (minus 31 Celsius) Thursday morning but forecasters are predicting a high of minus 2 degrees (minus 16 Celsius). It's a bit warmer in South Dakota, where the National Weather Service says the high temperature in Sioux Falls on Thursday is expected to be 12 degrees (minus 11 Celsius).------12 a.m.. The painfully cold weather system that put much of the Midwest into a historic deep freeze is expected to ease Thursday, though temperatures could still tumble to record lows in some places before the region begins to thaw out. Disruptions caused by the cold will persist, too, including power outages and canceled flights and trains. Before the worst of the cold begins to lift, the National Weather Service says Chicago could hit lows early Thursday that break the city's record of minus 27 set on Jan. 20, 1985. Temperatures should bounce back into the single digits later Thursday and into the comparative balmy 20s by Friday. More people are expected to return to work in Chicago, which resembled a ghost town Wednesday after most offices told employees to stay home."}, {"articleID": "2015040814_00018868_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Brian Mccann": ["Q1059152", "Q4964655"], "Masahiro Tanaka": ["Q11575599", "Q11575656", "Q911463"]}, "date": "2015-04-08", "url": "http://riveraveblues.com/2015/04/thoughts-following-opening-day-2-117033/", "content": "Opening Day and the traditional post-Opening Day off-day are in the rear-view mirror. The grind begins for real tonight, when the Yankees resume their series with the Blue Jays and play five games in the next five days. That's both the best and worst thing about baseball. They play every damn day. Here are some thoughts prior to tonight's game. <mark>Alex Rodriguez</mark> on Monday. Some boos, sure, but mostly cheers - he got the loudest ovation during the baseline introductions by a not small margin (video) - all throughout the game. Both before and after his at-bats. It helped that he was the team's most productive non - Brett Gardner hitter, so let's see what happens when he goes 0-for-4 with three strikeouts for the first time before saying the fans are on his side. <mark>Alex</mark> is going to get booed unmercifully on the road this year. It's unavoidable. A little fan support at home would be nice to see this summer. Let's face it, this Yankees team isn't particularly fun to watch aside from a handful of individual players, so a productive A-Rod will make the season more enjoyable. To me, anyway. 2. On that note: how long until A-Rod is hitting third, fourth, or fifth? I have close to zero confidence in Mark Teixeira rebounding, and only slightly more confidence than that in <mark>Brian McCann</mark> rebounding. <mark>Alex</mark> had the best at-bats on the team Monday, which, while just a one game sample, was a continuation of what we saw in Spring Training. Even if <mark>Alex</mark> is a 10-15 home run guy across a full season at this point of his career, he still looks like he might be able to hit .280 with enough walks to get his on-base percentage up to .340 or .350. I'm not sure I can say the same for Beltran, Teixeira, or <mark>McCann</mark>. I think A-Rod is hitting in the middle third of the order by May 1st. If <mark>Rodriguez</mark> shows he can still handle low-90s fastballs and work a walk, it'll make him one of the better offensive threats on the roster. 3. Remember a few years ago - gosh, it's been about eight or nine years now - when A-Rod dropped two foul pop-ups in one game? I'm pretty sure it was in Anaheim. <mark>Alex</mark> was slapped with the \"he struggles with pop-ups\" tag after that and it's stuck even though he's never really had any other problems since. Just the random dropped pop-up once or twice a year like every other player. I get the feeling that's what's going to happen with Didi Gregorius after his foolish attempted steal of third base on Monday. It was a terrible play, those extra 90-feet aren't worth the risk down five runs, and Didi admitted as much after the game. \"It was a bad mistake by me, I'll admit it. I'll admit that it was my mistake and it won't happen again,\" he said to Chad Jennings. And yet, I think that's going to stick with him. He's trying to do too much because he's replacing Derek Jeter, he's not a smart base-runners, he's too aggressive, yadda yadda yadda. We'll hear it all in the coming days and weeks. And, you know what, that might be true! If he does it again and again, then it'll be a problem. Sometimes things are just an isolated incidence and a baseball play though. A young player making a mistake. Not everything is a referendum on a player's style or mentality. Gregorius made a really bad play and it's okay to leave it at that. Ty Hensley is just awful. That poor kid can't catch a break. He had no arm problems up until this recent Tommy John surgery - the shoulder \"abnormality\" the team found in his physical didn't affect him on the mound - it was just a lot of unfortunate injuries. Hensley's going to go into 2016 having thrown roughly 42.1 innings from 2012-15. That's development time he simply can't get back. He's been dealt a crappy hand by the pitching gods and yet I have no reason to believe Hensley will do anything other than work his tail off to get healthy and get to MLB. If you follow him on Twitter, you know Ty has been relentlessly upbeat through all of this and he's incredibly easy to root for. As a fan I so very much want to see him on the mound at Yankee Stadium one day. I'm rooting like hell for the kid. Hughes was a disappointment relative to expectations but he still managed to turn into a serviceable big leaguer - he had a 95 ERA + in 780.2 innings with the Yankees, including one electric season in relief (2009) and two solid seasons as a starter (2010 and 2012). Joba was the poor man's version of Hughes, basically. Kennedy and Cole have had all their success with other teams. (Kennedy signed with the Yankees and was traded for Some people are worried over <mark>Tanaka</mark>'s stuff, I'm not. In that 5 run inning only Encarnacion's HR was actually hit hard. The 2 walks were a little troubling but he did strike out 6 over 4.1 innings. 1. Arod paid his time.... he should be treated like everyone else at this point. 2. . <mark>Alex</mark> does look like maybe their best overall hitter at the moment..... and while that would be great if he can be productive..... it's really a terrible thing if a 40 year old is even close to your best hitter. I had confidence in Beltran rebounding before I saw him play this spring.... but he looks old man..... Jeter got old really fast after his injury.... sometimes old guys just can't get it back after being hurt late in their career. I hope this isn't the case..... the Yankees really need it not to be the case. 1. A-Rod is an anti-hero. He will be embraced, especially if he hits. 2. He could be a good 3 hitter but he's not a power threat at 4 or 5. Beltran is done, such a horrific signing. Teixera and <mark>McCann</mark> will pop one every now and then but otherwise will just continue to hit the ball right into the shift. Teixera said, they want me to hit the other way! No, they want you to hit it right into their shift, that's why they're shifting dummy. 3. Didi will be just fine. He should be able to equal or surpass Jeter's meager offensive output last season. 4. Poor kid. We said a prayer for him last night. One day in, <mark>Alex Rodriguez</mark>'s return to the Yankees is a success so far Postgame Notebook: <mark>Tanaka</mark> hit hard in Yankees' fourth straight Opening Day loss New York Yankees fall to Toronto Blue Jays in season opener as <mark>Masahiro Tanaka</mark> struggles New York Yankees set 25-man roster, designate Austin Romine for assignment New York Yankees end spring on high note with 4-3 victory over Washington Nationals New York Yankees ace <mark>Masahiro Tanaka</mark> says velocity will be down this season"}, {"articleID": "2015092301_00024809_W", "names": {"Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}, "date": "2015-09-23", "url": "https://ca.celebrity.yahoo.com/post/129676427063/azealia-banks-defends-using-homophobic-slur", "content": "Azealia Banks Defends Using Homophobic Slur Against Flight Attendant After Facing Backlash etonline-yahoopartner: Azealia Banks is firing back at the outrage. After the 24-year-old rapper was shown in a heated altercation on a Delta Airlines plane that led to her calling a flight attendant a \"fu * king fa ** ot\" in video obtained by TMZ, Azealia is defending her use of the homophobic slur on Twitter. \"I am bisexual. my brother is trans. My employees are all gay men. Nothing else to say,\" Azealia tweeted on Tuesday .--AZEALIABANKS (@ AZEALIABANKS) September 22, 2015 She also tweeted, \"Cause y' all KNOW, that they would've politely handed a white woman her bags and a spritzer. #whatever\" Cause yall KNOW, that they would've politely handed a white woman her bags and a spritzer. #whatever MORE: Azealia Banks on Nicki Minaj's Wax Figure: \"They Had to Put Her on All Fours?' In addition, the rapper has been retweeting fans who are supporting her through the controversy. However, many have been critical of Azealia on Twitter. One fan replied,\" You think because you associate with ppl of the LGBT community, that justify this negative things u do. You're the problem. \"\"@ AZEALIABANKS they would've given you your bags if you hadn't acted like a spoiled brat,\" another fan wrote. This is not the first time Azealia has found herself in hot water over use of a homophobic term. After the rapper was called out for calling Perez Hilton the slur in early 2013, Azealia defended her use of the word a year later, although she told The Guardian that she wouldn't be using it again. \"A lot of gay men are way more misogynistic than straight men,\" Azealia said at the time. \"The sh * t they say about women behind their backs, it's like,\" Wow, oh my God!' WATCH: <mark>Sam Smith</mark> Posts Homophobic Poem: \"This Genuinely Doesn't Offend Me'\" A f *** ot is anybody that hates women, \"Azealia claimed. One person who doesn't share Azealia's opinion of the slur is British singer <mark>Sam Smith</mark>, who in August, posted a picture of a homophobic poem written about him, while taking the opportunity to highlight homophobia in society.\" This genuinely doesn't offend me, coz I'm way too thick skinned when it comes to this kind of sh **, \"he wrote.\" BUT I just wanted to share this with everyone, so you can see how homophobia is still SO PRESENT in our society!! \"Watch below."}, {"articleID": "2017101612_00415458_W", "names": {"Daniel Webster": ["Q1163099", "Q22047723"]}, "date": "2017-10-16", "url": "http://www.jdsupra.com/legalnews/cybersecurity-guidance-on-the-way-for-13808/", "content": "Cybersecurity Guidance on the Way for Small Businesses Embed To embed, copy and paste the code into your website or blog: <iframe src = \"/ / www.jdsupra.com/post/contentViewerEmbed.aspx? fid=da4eb4f8-f1d0-4236-996c-0f266a7095e4\" width = \"100%\" height = \"620\" frameborder = \"1\" style = \"border: 2px solid #ccc; overflow-x: hidden! important; overflow: hidden;\" scrolling = \"auto\" > </ iframe> On October 11, 2017, the House passed a bill that would provide guidance to small business on how to deal with cybersecurity issues. This legislation passed on the heels of a similar Senate bill that passed just weeks before on September 28. The NIST Small Business Cybersecurity Act (H.R. 2105) would require the Department of Commerce's National Institute of Standards and Technology (NIST) to issue voluntary guidelines specifically addressing the needs of the many small businesses across the country. Much like other voluntary guidelines enacted by NIST, the guidance for small business would not seek to add additional regulation, but rather would provide small business owners with a set of best practices to keep themselves safe in the constantly growing cyber world. According to the bill, small businesses account \"for 54 percent of all United States sales and 55 percent of jobs in the United States.\" Not only do attacks targeting small and medium businesses account for a high percentage of cyberattacks in the United States, according to the National Cyber Security Alliance, but \"[s] ixty percent of small businesses that suffer a cyberattack are out of business within 6 months.\" House sponsor <mark>Daniel Webster</mark> (R-Fla .), an owner of a multi-generational small business, stated that small businesses \"are more susceptible to attacks\" because of the limited cybersecurity resources and the \"tools they need to prepare for such an event.\" (via Bloomberg BNA .) According to <mark>Webster</mark>, the NIST cybersecurity framework would act to \"protect business owners, their employees, and their customer base, all while contributing positively to the economy.\" H.R. 2105 received bipartisan support and passed by a voice vote. The similar Senate bill, the MAIN STREET Cybersecurity Act (S. 770), also received bipartisan support. DISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. © Reed Smith + Follow more + Follow more Reed Smith on: \"My best business intelligence, in one easy email...\"Your first step to building a free, personalized, morning email brief covering pertinent authors and topics on JD Supra: Sign up using * Already signed up? Log in here * By using the service, you signify your acceptance of JD Supra's Privacy Policy. Privacy Policy (Updated: October 8, 2015): hide JD Supra provides users with access to its legal industry publishing services (the\" Service \") through its website (the\" Website \") as well as through other sources. Our policies with regard to data collection and use of personal information of users of the Service, regardless of the manner in which users access the Service, and visitors to the Website are set forth in this statement (\"Policy\" ). By using the Service, you signify your acceptance of this Policy. Information Collection and Use by JD Supra JD Supra collects users' names, companies, titles, e-mail address and industry. JD Supra also tracks the pages that users visit, logs IP addresses and aggregates non-personally identifiable user data and browser type. This data is gathered using cookies and other technologies. The information and data collected is used to authenticate users and to send notifications relating to the Service, including email alerts to which users have subscribed; to manage the Service and Website, to improve the Service and to customize the user's experience. This information is also provided to the authors of the content to give them insight into their readership and help them to improve their content, so that it is most useful for our users. JD Supra does not sell, rent or otherwise provide your details to third parties, other than to the authors of the content on JD Supra. If you prefer not to enable cookies, you may change your browser settings to disable cookies; however, please note that rejecting cookies while visiting the Website may result in certain parts of the Website not operating correctly or as efficiently as if cookies were allowed. Email Choice/Opt-out Users who opt in to receive emails may choose to no longer receive e-mail updates and newsletters by selecting the \"opt-out of future email\" option in the email they receive from JD Supra or in their JD Supra account management screen. Security JD Supra takes reasonable precautions to insure that user information is kept private. We restrict access to user information to those individuals who reasonably need access to perform their job functions, such as our third party email service, customer service personnel and technical staff. However, please note that no method of transmitting or storing data is completely secure and we cannot guarantee the security of user information. Unauthorized entry or use, hardware or software failure, and other factors may compromise the security of user information at any time. If you have reason to believe that your interaction with us is no longer secure, you must immediately notify us of the problem by contacting us at info @ jdsupra.com. In the unlikely event that we believe that the security of your user information in our possession or control may have been compromised, we may seek to notify you of that development and, if so, will endeavor to do so as promptly as practicable under the circumstances. Sharing and Disclosure of Information JD Supra Collects Except as otherwise described in this privacy statement, JD Supra will not disclose personal information to any third party unless we believe that disclosure is necessary to: (1) comply with applicable laws; (2) respond to governmental inquiries or requests; (3) comply with valid legal process; (4) protect the rights, privacy, safety or property of JD Supra, users of the Service, Website visitors or the public; (5) permit us to pursue available remedies or limit the damages that we may sustain; and (6) enforce our Terms & Conditions of Use. In the event there is a change in the corporate structure of JD Supra such as, but not limited to, merger, consolidation, sale, liquidation or transfer of substantial assets, JD Supra may, in its sole discretion, transfer, sell or assign information collected on and through the Service to one or more affiliated or unaffiliated third parties. Links to Other Websites This Website and the Service may contain links to other websites. The operator of such other websites may collect information about you, including through cookies or other technologies. If you are using the Service through the Website and link to another site, you will leave the Website and this Policy will not apply to your use of and activity on those other sites. We encourage you to read the legal notices posted on those sites, including their privacy policies. We shall have no responsibility or liability for your visitation to, and the data collection and use practices of, such other sites. This Policy applies solely to the information collected in connection with your use of this Website and does not apply to any practices conducted offline or in connection with any other websites. Changes in Our Privacy Policy We reserve the right to change this Policy at any time. Please refer to the date at the top of this page to determine when this Policy was last revised. Any changes to our privacy policy will become effective upon posting of the revised policy on the Website. By continuing to use the Service or Website following such changes, you will be deemed to have agreed to such changes. If you do not agree with the terms of this Policy, as it may be amended from time to time, in whole or part, please do not continue using the Service or the Website. Contacting JD Supra If you have any questions about this privacy statement, the practices of this site, your dealings with this Web site, or if you would like to change any of the information you have provided to us, please contact us at: info @ jdsupra.com. - hide * With LinkedIn, you don't need to create a separate login to manage your free JD Supra account, and we can make suggestions based on your needs and interests. We will not post anything on LinkedIn in your name. Or, sign up using your email address."}, {"articleID": "2010072001_00133346_W", "names": {"Robert Long": ["Q14945507", "Q18658534", "Q24176230", "Q30610665"]}, "date": "2010-07-20", "url": "http://.scnow.com/scp/news/local/article/darlington_county_council_oks_i-20_corridor_alliance_agreement/229056/", "content": "darlington - darlington county officially became a part of the newly organized i-20 corridor alliance monday with unanimous approval of an agreement by darlington county council. the i-20 corridor alliance is a coalition of counties, cities and regional economic development agencies formed to promote economic development and improve the quality of life along the eastern portion of interstate 20 between columbia and florence by coordinating and supporting regional infrastructure extension and expansion, industrial site and industrial park development and improving access to technical training in the area. the coalition has made the i-20 corridor a priority for increasing future infrastructure investments to make the region more competitive and better position it for economic growth, according to an august 2009 report on an economic impact study of the corridor performed for the coalition. the report says the i-20 corridor from columbia to florence is one of the most underdeveloped areas in south carolina, with major job losses occurring in 2008 and 2009 in the area, higher unemployment than much of the rest of the state, higher poverty levels and lower per capita income in the rural areas along the corridor. darlington county economic development partnership executive director <mark>robert long</mark> said the effort to establish the alliance started with former columbia mayor bob coble and former florence mayor frank willis. <mark>long</mark> said he has been involved with the project for more than a year. participating entities include the cities of columbia and florence, darlington, lee, kershaw and sumter counties and the economic development agencies of the participating counties and cities. the agreement approved by council gives the organization some formal structure, <mark>long</mark> said. the organization will have no employees. decisions will be made by a board consisting of the mayors of participating cities and chairmen of participating county councils or their designees. city and county administrators will serve as the organization's technical advisory committee and provide administrative support to the board. <mark>long</mark> said start-up dues will be $10,000 per member entity per year for three years to provide funding for preliminary engineering when required for grants, legal and other administrative costs. the economic impact report says prioritizing the needs in the area will cost an estimated $275,000. \"this funding will allow the coalition to prioritize infrastructure projects through meetings, engineering analysis, reviewing existing plans and preparing preliminary cost estimates,\" the report says. \"it is projected that this region will have approximately 812,000 residents by the year 2020, which will be approximately 17 percent of the entire population of the state,\" the report says. current figures put the population of the targeted area at 738,714, according to the report. \"with this in mind, it should be noted that along with providing for the economic benefits of the citizens, infrastructure improvements would also improve the health, safety and well-being of all citizens in the region,\" the report says. \"these infrastructure improvements will support the future economic growth and create more of an opportunity to stimulate capital investment from new industries and businesses,\" the report says. \"this new economic growth will then provide for more and better paying jobs for citizens within the corridor and entire region.\" the agreement itself cites a number of opportunities that it says can enhance economic development in the region through a collaborative approach. those include rail links in columbia and florence, the proximity of the corridor to the planned boeing plant coming to the charleston area and the presence of technical colleges in the area. the corridor could also take advantage of south carolina's potential for the development of biofuel industries, the agreement states. in other business, council scheduled a special called meeting for 6 p.m. wednesday to begin discussing how it will proceed with finding a new county administrator. darlington county administrator phyllis griffitts announced on july 6 that she is retiring from the position she has held for nearly 12 years on july 30. free registration) please avoid offensive, vulgar, or hateful language."}, {"articleID": "2012061317_00108555_W", "names": {"John Merrick": ["Q28232785", "Q6248531"], "Chad Campbell": ["Q1058564", "Q16214361"], "Dustin Johnson": ["Q1002293", "Q30015838"], "Luke Donald": ["Q6701919", "Q712150"], "Sean Foley": ["Q7441004", "Q7441005", "Q7459522"]}, "date": "2012-06-13", "url": "http://golfweek.com/news/2012/jun/13/5-things-what-you-need-know-eve-us-open/", "content": "fedex st. jude classic | updated: 5:18:44 pm et. 06/10/2012 2. <mark>john merrick</mark> -2 thru f | total: -8 t3. <mark>chad campbell</mark> -2 thru f | total: -7 regions tradition | updated: 5:32:09 pm et. 06/10/2012 t2. bernhard langer -6 thru f | total: -12 4. fred couples -7 thru f | total: -10 mexico open presented by banamex | updated: 6:57:06 pm et. 06/10/2012 2. paul haley ii -4 thru f | total: -13 tyrone van aswegen -1 thru f | total: -11 5 things: what you need to know on eve of u.s. open san francisco--five things you need to know on the eve of the u.s. open: 1. back on track?: the defending champion arrives at olympic club off a seventh-place showing at last week's fedex st. jude classic. mcilroy's memphis finish may not have pleased him - he made double-bogey on the final hole after hitting his tee shot into the water - but 71 strong holes were a nice consolation, considering he'd missed his previous three cuts. mcilroy finished three shots behind winner <mark>dustin johnson</mark> at tpc southwind. \"it was important for me,\" mcilroy said. \"that was the whole reason to go to memphis last week, was to try to get some competitive golf and to feel like i shot a couple of good scores. and i saw some really positive signs out there.\" i definitely feel more comfortable about my game going into this week (than) if i hadn't have played. \"??? 2. three of a kind: mcilroy will tee off at 1:29 p.m. thursday. he's paired with <mark>luke donald</mark> and lee westwood in a grouping of the world's top three players. it's an impressive collection of talent, but probably not the group that will garner the most attention during the open's first round. no, most eyes will be on tiger woods, phil mickelson and bubba watson, who tee off at 7:33 a.m. woods, seeking his first major since the 2008 u.s. open at torrey pines, is coming off a victory at memorial. as we saw at augusta, he's still unpredictable as he undergoes swing changes with <mark>sean foley</mark>. mickelson is seeking his first open title after a record five runners-up, most recently in 2009. watson, the masters champion, said,\" it's going to be like sunday at the masters, huge galleries. \"watson is still adjusting to life as a father and major champion, but there's one aspect of olympic club that suits him.\" you have to curve it more off the tees here than any other golf course that we play, \"woods said .??? 3. rough start: don't be upset if your favorite player gets off to a poor start at olympic club. the course's first six holes make for a brutal opening stretch. watson played those holes 2 over in a practice round,\" and i made some good par putts, \"he said\" if you can get through there (even-par), it's like you're shooting well under par, almost like you birdied all the holes, \"watson said.\" if i shot 2 over every single day in the four days, i'd be pretty happy. \"olympic club's first hole, a par-5 in the first four u.s. opens at olympic, will play as a 520-yard par-4. no. 2 is an uphill 428-yard, par-4 with a fairway that narrows at 270 yards, forcing many players to lay back off the tee. that's followed by a 247-yard par-3 with a green well-protected by bunkers. the fourth hole is an uphill 438-yard, par-4 with a fairway that slopes severely from left-to-right, making it difficult for tee shots to stay in the short grass. the fifth and sixth holes are par-4s of 498 and 489 yards, respectively.\" i've heard that first six come up a few times, \"steve stricker said.\" but i kind of chuckle because they're all pretty good. \"??? 4. what a finish: players will have a chance to end their rounds on a high note, though. nos. 16 and 17 are olympic club's only par-5s, while the 18th is a 344-yard par-4 with a green whose slope has been softened since the 1998 debacle. players have an opportunity to pick up a couple birdies on this closing trio.\" it gives you a chance to finish off a round, \"woods said.\" you're trying to make a bunch of pars throughout most of the day, and then all of a sudden you've got to change gears. \"if you hit two good shots into 16 you're going to have a wedge in there, which you should make birdie. same thing on 17. and same thing on 18. you have three holes back-to-back either you're chipping, you're wedging, so you're going to have to make some birdies there, absolutely.\" this is a u.s. open, though, so there are no easy holes. the 16th has been lengthened to 670 yards, making it the longest par-5 in u.s. open history. watson, the pga tour's leader in driving distance, said he still had 60 yards remaining to 16 after hitting driver-driver. mickelson said he has yet to have an approach shorter than 200 yards into the 16th. players who drive in the rough on the severe dogleg-left will struggle to reach the green in three. \"i believe that you play 15 holes of really tough, tough golf,\" mickelson said. \"and you finally get your first par-5 and it's the toughest hole on the course.\" ??? 5. kuchar's return: matt kuchar returns to olympic club, where 14 years ago he was a grinning amateur who charmed fans and contended for a major. he finished 14th at the 1998 open at olympic, the year after he won the u.s. amateur. kuchar is back this year after contending at the year's first major and winning the largest title of his career, the players championship. \"that still amazes me to be 14 years ago,\" kuchar said. \"i remember finishing rounds of golf and just being flat-out exhausted.\" "}, {"articleID": "2017042315_00972509_W", "names": {"Robert Cohen": ["Q1522318", "Q20878812", "Q3434831", "Q3434832", "Q360504", "Q4237199", "Q503966", "Q56548780"], "Jason Zucker": ["Q1684008", "Q56332306"]}, "date": "2017-04-22", "url": "http://www.stltoday.com/sports/hockey/professional/upshall-takes-over-pest-role-against-wild/article_2232e18c-f906-55f1-9eaf-12d3b14da998.html?src=rss", "content": "Buy Now <mark>Robert Cohen</mark> • rcohen @ post-dispatch.com Minnesota Wild's Nate Prosser loses his footing while tangling with St. Louis Blues Scottie Upshall (10) and Kyle Brodziak during Game 3 of the first round of Stanley Cup playoffs at Scottrade Center on Sunday, April 16, 2017. Photo by <mark>Robert Cohen</mark>, rcohen @ post-dispatch.com Upshall takes over \"pest' role against Wild Buy Now <mark>Robert Cohen</mark> • rcohen @ post-dispatch.com Minnesota Wild's Nate Prosser loses his footing while tangling with St. Louis Blues Scottie Upshall (10) and Kyle Brodziak during Game 3 of the first round of Stanley Cup playoffs at Scottrade Center on Sunday, April 16, 2017. Photo by <mark>Robert Cohen</mark>, rcohen @ post-dispatch.com Two years ago, when the Blues played the Wild in the first round of the playoffs, everyone in the state of Minnesota, it seemed, hated Blues forward Steve Ott. Ott has made a career out of being a professional nuisance, and he was at his most annoying in that series. There he was trading shoves with former teammate Jordan Leopold, getting whacked in the leg by Wild goalie Devan Dubnyk for parking in front of the net, and somewhat mysteriously, petting the helmet of forward <mark>Jason Zucker</mark>. If there was one guy everyone wanted to take a swing at, it was Ott. Ott is gone now. He was an unrestricted free agent after last season, and the Blues didn't re-sign him, allowing him to agree to a one-year deal with Detroit. When the Red Wings weren't going to make the playoffs, they traded him to Montreal, where he's making another playoff run. His spirit lives on this season in the form of forward Scottie Upshall. He may not reach the standards Ott set, but he's been a royal pain in the keister. He's been called for three penalties and the Wild would probably maintain there should have been a few more. Late in Game 4, after a goalmouth scramble in front of Dubnyk, two Wild players sought out Upshall for some after-the-whistle shoving.\" He's doing a good job, \"said forward Ryan Reaves, a linemate of both Ott and Upshall.\" He's getting some good licks in on some of their top guys. I think he's getting in their grill. \"He's a pest.\" That's Upshall's job on the Blues' fourth line, alongside Reaves and Kyle Brodziak. The line has been the most consistent for the Blues all season and certainly the one that has played together the most. With all the line changing that goes on, there have been only a few games this season that when those three have been healthy they haven't been on the ice together. And in the playoffs, it's safe to say that the Wild have been aware when those three have been on the ice. \"That's playoff hockey,\" Upshall said. \"It happens. You play in between the whistles as much as you can. You provide energy.\" Our job as an energy line is to create energy, to stay out of the penalty box, and provide just the spark for our guys. Lately, I think we've been doing a good job of taking time away from the defensemen ....We're in Game 5 now, you start to feel things you didn't in Game 1, and that's what hockey's all about. You continue to play hard, play strong and you've got to be physical. \"Brodziak was on the Wild for that series two years ago, so he remembers Ott and sees some validity to the comparison.\" That's pretty fair, \"he said.\" He does his job well. I don't feel like he's getting out of his game, trying too hard to be a pest. Some guys when they feel they need to do something, go out of their way and end up doing something that's uncharacteristic or take a dumb penalty, but he's staying within his game, and at the same time finding ways to be physical and be a pain in the ass for the other team. \"You always want to have guys like that, capable of walking the line but not crossing over it. He's done a good job for us. If it gets the attention of the guys on the other team, or just awareness he's on the ice, it's going to be a hard shift, then he's done his job.\" Mike Yeo was the coach of Minnesota at the time and, at least publicly, acknowledged Ott's contributions. He feels much the same way about Upshall. \"I think he's trying to be physical,\" Yeo said. \"He's trying to impact games, and that's what he can do. We've said it before, that line, we need them to be good hockey players first and foremost. That's what they do for us when they're on top of their game. They can influence the play and disrupt the opposition because of their physicality. But you know, when they're on top of their game, they're also not running around, they're not chasing. They're managing the puck the right way.\" \"I think as a group, we've done a good job of playing good defensive hockey but also in-your-face, protecting the front of the net,\" Upshall said. \"They've got some big guys, big mobile defensemen that you've got to get licks on when you can. It's part of the game. As the playoffs go on it gets harder and harder but it becomes more fun.\" Reaves, a pest in his own right, noted that Upshall is a pest in general. \"He's a pest to everybody on this team, everybody on the other team,\" Reaves said. \"He's a pest. But he's doing a good job.\" He also noted that one of the reasons teams go after Upshall is because the alternative is to go after Reaves, who's an inch taller and weighs 25 pounds more. Upshall agrees. \"I accept that proudly,\" he said. \"It's a job that I enjoy to the utmost. It's fun going out there and playing hard and getting under guys' skin. This time of year it's all about winning games and doing what you can to help your team. It's a big role to fill.\" Apr 22, 2017 (...) See what the Post-Dispatch hockey writer had to say about the Blues and their first-round playoff series against the Minnesota Wild."}, {"articleID": "2012110101_00053235_W", "names": {"Peter Williams": ["Q12798640", "Q16106852", "Q16189569", "Q16751058", "Q19877010", "Q21066726", "Q23020690", "Q23900914", "Q24192582", "Q24704507", "Q24716880", "Q29034177", "Q29643792", "Q3376966", "Q37842905", "Q56989523", "Q57313212", "Q6193763", "Q7177725", "Q7177726", "Q7177727", "Q7177728", "Q7177730", "Q929719"]}, "date": "2012-11-01", "url": "http://nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=10844375&ref=rss", "content": "a plane carrying 46 people skidded along a runway on its nose landing gear doors because the plane's pilots ignored two warnings that the landing gear was unsafe, an inquiry into the incident has found. none of the three crew or passengers were injured and the dash 8 suffered minimal damage during the incident on september 30, 2010, the transport accident investigation commission inquiry said. the air nelson flight had been travelling to nelson from wellington but was diverted to blenheim because of poor weather. when the two pilots moved the landing gear selector lever to down, the left and right main landing gear legs extended normally but the nose landing gear stopped before it had fully extended, probably because debris within the hydraulic fluid blocked a small opening that worked the nose landing gear, the taic report said. a warning system indicated to the pilots the landing gear was \"unsafe\" , that the nose landing gear was not down and locked, and that the nose landing gear forward doors were open. however, a second independent system showed the pilots that all the landing gear was down and locked in spite of the other indications that it was not. the pilots assumed there was a fault in one of the landing gear sensors and continued the approach to land expecting that all the landing gear was locked down. on the final approach the landing gear warning horn sounded to alert the pilots that the landing gear was not safe. however, the pilots ignored both of these warnings in the belief that they had been generated from a single sensor that they assumed was faulty and had given them the original unsafe nose landing gear indications. when the plane touched down the nose landing gear was pushed into the wheel well and the aeroplane completed the landing roll skidding on the nose landing gear doors. taic lead investigator <mark>peter williams</mark> said the actions of the pilots were \"understandable\" in terms of the information they had. he said the pilots could have asked someone from the ground to have a look at their undercarriage to say what was happening with the nose wheel. \"the most important thing in this case was to have accepted the other warnings they got towards the end, the oral warnings, and rather than rationalising why they were occurring and flown the circuit again and asked someone outside to see what it looked like.\" if the pilots were still unable to unblock the debris from the landing gear, the pilots would have still needed to land the plane, mr <mark>williams</mark> said. \"the only difference is they would have known the nose gear wasn't down and they could have been a bit better prepared. but the outcome would have been the same.\" air nelson limited and the canadian aeroplane manufacturer, bombardier, took a number of safety actions to address issues raised in the taic's report. the commission also recommended to the director of the new zealand civil aviation authority to work with canadian authorities to require the manufacturer to improve the reliability of the landing gear verification system. key lessons arising from this inquiry were: * when critical systems begin intermittently to malfunction or behave abnormally, this is often a precursor to total failure; * the more a pilot knows about aircraft systems, the better armed they will be to deal with emergency and abnormal situations' * aircraft warning systems are designed to alert pilots to abnormal conditions. alerts should not be dismissed without considering all other available information; and"}, {"articleID": "2015090616_00100638_W", "names": {"Kim Davis": ["Q17386180", "Q20924746", "Q6408552"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2015-09-06", "url": "http://kwch.com/news/politics-elections/huckabee-compares-clerk-jailing-to-slavery-ruling/35132106?ver=139", "content": "Home Huckabee compares clerk jailing to slavery ruling Republican candidates rally around <mark>Kim Davis</mark> since she drew national headlines By Tom LoBianco CNN Justin Sullivan/Getty Images WASHINGTON (CNN) - Former Arkansas Gov. Mike Huckabee compared Rowan County clerk <mark>Kim Davis</mark>' refusal to issue marriage licenses to same-sex couples to conscientious objections to slavery Sunday. More from KWCH.com Opinion: <mark>Kim Davis</mark> jailed over gay marriage? Asked if <mark>Davis</mark>, who was jailed last week for refusing to issue the licenses, should be forced to obey the Supreme Court ruling on marriage, Huckabee cited the landmark Dred Scott decision. \"You obey it if it's right,\" Huckabee said on ABC's \"This Week.\" \"So I go back to my question. Is slavery the law of the land? Should it have been the law of the land because Dred Scott said so? Was that a correct decision? Should the courts have been irrevocably followed on that? Should Lincoln have been put in jail? Because he ignored it.\" Many Republican candidates have rallied around <mark>Davis</mark> since she drew national headlines for refusing issue the licenses and asked her deputies not to comply with the high court ruling. After she was arrested, the first license was issued to a gay couple. \"Do we have a check and balance system? Do we have three equal branches or do we have one supreme branch, not just the Supreme Court? That's the fundamental question,\" Huckabee said. Democrats who supported same-sex marriage rights before the Supreme Court ruling weren't jailed, Huckabee said. \"Gavin Newsom in San Francisco as mayor performed same-sex weddings even though it was illegal. Did he ever get put in jail? He most certainly did not,\" he said. \"You have Barack Obama and <mark>Eric Holder</mark>, when he was Attorney General. They ignored the rulings of (the Defense of Marriage Act). Did they get put in jail for ignoring the law? They most certainly did not.\" Ohio Gov. John Kasich, who is running strong in New Hampshire polling, said he did not believe <mark>Davis</mark> should be jailed, but also said the ruling is the law. The bigger problem, he told ABC's \"This Week,\" is that fights are turning off younger generations to Christianity. \"We have a lot of young people who sit on the fence on an issue like this. And they also think about their, you know, their belief in God,\" Kasich said. \"And when we see these kind of battles going on I get a little bit afraid that it turns people off to the idea of faith in God, what it means to be a Christian.\" Copyright 2015 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2015021015_00071947_W", "names": {"Don Collins": ["Q1626928", "Q28059278", "Q5292441"]}, "date": "2015-02-10", "url": "http://abc13.com/news/white-house-american-isis-hostage-has-died/511492/", "content": "Personalize your weather by entering a location. WASHINGTON--Kayla Mueller, a 26-year-old American woman held by Islamic State militants, has been confirmed dead, her parents and the Obama administration said Tuesday. The White House said that Mueller's family received a private message from her captors over the weekend. The information in the message was authenticated by the U.S. intelligence community. \"We are heartbroken to share that we've received confirmation that Kayla Jean Mueller, has lost her life,\" Carl and Marsha Mueller said in a statement. \"Kayla was a compassionate and devoted humanitarian. She dedicated the whole of her young life to helping those in need of freedom, justice, and peace.\" President Barack Obama said that Mueller, who was worked with Syrian refugees, \"epitomized all that is good in our world.\" \"No matter how long it takes, the United States will find and bring to justice the terrorists who are responsible for Kayla's captivity and death,\" the president said. The Islamic State group said Friday that Mueller had died in a Jordanian airstrike. HPD: Top 10 most stolen cars in Houston Plane makes emergency landing at Bush IAH without nose gear Plane makes emergency landing at Bush IAH without nose gear RAW VIDEO: Plane makes emergency landing at Bush IAH Family loses $500,000 lawsuit over barking dog Son accused in parents' and sibling's murder back in Houston Spider-Man set to join the Avengers' world VIDEO: Implosion of old Las Vegas casino Recipe you can create at home for Valentine's Day dinner <mark>Don Collins</mark> guilty of capital murder in Robbie Middleton's death PHOTOS: Grammys red carpet fashion Inside ABC-13: Behind the scenes photos PHOTOS: Kids' race raises funds for reading program Copyright © 2015 ABC Inc., KTRK-TV Houston. All Rights Reserved. Personalize your weather by entering a location."}]