[{"articleID": "2011112200_00007127_W", "names": {"Pat Sullivan": ["Q2056577", "Q22096536", "Q28672846", "Q7144051", "Q7144053", "Q7144054"], "Andre Johnson": ["Q4754810", "Q748287"], "Jeff Garcia": ["Q1373024", "Q3990"], "Chase Clement": ["Q14950669", "Q14950810"], "Mike Shanahan": ["Q17025605", "Q1857407", "Q27973761", "Q47467791"]}, "date": "2011-11-21", "url": "http://themonitor.com/sports/houston-56760-leinart-texans.html", "content": "<mark>pat sullivan</mark> | the associated press houston - the first name is the same, and the houston texans say not much else is changing, either. matt leinart practiced for the first time as the texans' starting quarterback on monday, with matt schaub likely out for the season with a right foot injury. the texans (7-3) are coming off a bye week and play at jacksonville (3-7) on sunday. leinart has been anxiously awaiting a chance to start again ever since he was demoted in arizona in 2008 in favor of kurt warner. he signed with the texans after the cardinals cut him in september 2010. \"i've worked hard, i've been focused every day since i've been here, preparing for an opportunity like this, just in case this ever came up,\" leinart said. \"now it's just time to take all that preparation onto the field .\" the 2004 heisman trophy winner did not take a snap in a game as a backup to schaub last season. he became a free agent, but re-signed with houston because he was comfortable with coach gary kubiak and the texans' offensive system. he's also found a strong support system within the team that he feels will help get his career back on track. \"i've been surrounded by positivity, i've gotten my confidence back over the last 18 months,\" leinart said. \"i feel good, ready for this opportunity .\" schaub sustained a right foot injury during houston's 37-9 win over tampa bay on nov. 13. he watched monday's practice in a protective boot will visit a foot specialist in charlotte on wednesday. kubiak is hoping to get a \"definitive answer\" on whether schaub will need season-ending surgery. he's holding out hope that schaub will return this season, but he's comfortable using leinart for the rest of the season, if it comes to that. \"you can see the fire in his eyes,\" kubiak said. \"what a great opportunity for him in his career. he'll give us everything he's got .\" leinart is left-handed and schaub throws right-handed, but kubiak said that won't alter the offensive game plans much. and the linemen say there's nothing different with leinart taking snaps, other than right tackle eric winston becoming the quarterback's blind-side protector. \"there's no difference in the running game, there's no difference in protections, there's no difference in anything else,\" said winston, who's made 81 consecutive starts. \"i haven't seen us put anything (new) in yet. we're going to run the same running plays we always have .\" left-handed, right-handed, under-handed, \"winston said,\" i don't think it really matters. \"and leinart should benefit from the return of all-pro receiver <mark>andre johnson</mark>, who's expected to play sunday after missing six games with a right hamstring injury. he can also lean on the league's second-best rushing offense (158 yards per game), with arian foster and ben tate in the backfield behind him .\" i don't think much is going to change, \"leinart said .\" i just think we're going to go out there and execute the offense that we've been doing, and that's running the football, and play - (action) pass and getting out on the outside and making some plays. \"rookie t.j. yates, a fifth-round pick out of north carolina, is leinart's backup, but kubiak isn't ruling out adding another quarterback this week. <mark>jeff garcia</mark>, brodie croyle, trent edwards, kellen clemens and former rice star <mark>chase clement</mark> tried out for the team monday morning. the 41-year-old <mark>garcia</mark> hasn't played in the nfl since 2009. he played for omaha in the ufl last year. edwards was cut by oakland in training camp after spending three full seasons with buffalo and one in jacksonville. clemens was cut by washington during training camp, and that may give him an edge - the redskins are coached by <mark>mike shanahan</mark>, kubiak's longtime mentor. the contents of this website may not be reproduced without written"}, {"articleID": "2014120712_00059412_W", "names": {"Stephen Turnbull": ["Q3176384", "Q7610717"], "Tom Wade": ["Q10420373", "Q22762714"]}, "date": "2014-12-07", "url": "http://chroniclelive.co.uk/sport/football/football-news/blyth-spartans-hero-admits-didnt-8241141", "content": "Newcastle clubs introduce state of the art ID scanners to help pinpoint trouble makers Blyth Spartans hero reveals his joy at scoring 90th minute winner Hatem Ben Arfa will return to Newcastle United in January after Hull move turns sour Rob Elliot reveals he played on through the pain barrier for Newcastle United Newcastle 2-1 Chelsea: Five things we learned as soaring Magpies shoot down Premier League leaders <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night \"data-type =\" fb-share \"data-action =\" article:8241141 \"> <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night\" data-type = \"tw-share\" data-action = \"article:8241141\" > <mark>Stephen Turnbull</mark>, one of Blyth Spartans' FA Cup heroes, admits he didn't see his goal coming against Hartlepool on Friday night Blyth Spartans goalscorer <mark>Stephen Turnbull</mark> celebrates after the FA Cup Second round match between Hartlepool United and Blyth Spartans <mark>Stephen Turnbull</mark> has admitted he did not see one of the best goals of FA Cup second-round weekend coming. The League Two side bossed the opening half-hour and took the lead through Jonathan Franks. But once Turnbull equalised in the 56th minute there was only one team in it - even if it did take until the 90th minute for Jarrett Rivers to confirm his side's place in tomorrow's third-round draw. And Turnbull admitted he had not been on that sort of form on the training ground. \"I'd been practising them all week in training and couldn't hit a barn door,\" said Turnbull, who started his career at Victoria Park. \"I said to Robbie Dale,\" I'm going to hit this \". Never in my dreams did I think I'd catch it like I did .\" It didn't just go in the top corner, it curled into the side-netting. \"Afterwards, our manager <mark>Tom Wade</mark> said that Alan Shearer (working for BBC television on the night) said it was the best free-kick he'd ever seen. Wow. That's good enough for me .\" Turnbull also set up the winner, releasing Rivers for the fairytale finish which sparked a bench clearance and a pitch invasion. \"I gave him (Rivers) the ball, it was a good pass, and I just thought,\" Go on, run at them', \"said Turnbull, part of the Bury team expelled from the competition for fielding an ineligible player in 2006 .\" Unbelievable. It was just incredible. \"I can't wait for tomorrow's draw - at least I know we'll definitely be playing in it this time .\" After the game <mark>Wade</mark> was keen to stress Turnbull's contribution went way beyond the pitch. \"<mark>Stephen</mark> and Phil Turnbull are probably two of the best midfield players around the area,\" he said. \"<mark>Stephen Turnbull</mark>'s just a great lad. He's got great ability and he's great in the changing room because he gets the young lads playing and gives them confidence .\" It was a fantastic goal but his overall play was fantastic. \"You saw the bench go up when the goals went in and even the lads who weren't stripped. I think that's the difference .\" We're a very, very close team and a close changing room. \"Blyth's win was extra sweet for Nathan Buddle. The defender was released by Pools club at the end of the 2012-13 season, much to his disappointment, and that gave Friday night's game at Victoria Park added spice for him. The Blyth Spartans boys have been sold short because football has done an Oasis and completely lost the plot Joe Allon can't wait for FA Cup clash between Blyth Spartans and Hartlepool Former Hartlepool striker and columnist Joe Allon says the draw proves the romance of the FA Cup isn't dead Gateshead FC hosts lowest rank team left in FA Cup, Warrington and Blyth head to Hartlepool Jak Alnwick: Five facts on Newcastle United's rookie goalkeeper Hatem Ben Arfa will return to Newcastle United in January after Hull move turns sour Newcastle 2-1 Chelsea: Five things we learned as soaring Magpies shoot down Premier League leaders Rob Elliot reveals he played on through the pain barrier for Newcastle United Contact us Got a story in your area? Is there something happening in your area you would like us to report on? Competitions and promotions Michelle Morgan Print The Chronicle is read by more adults than any other regional newspaper on sale in the area. With 170,115 average issue readers, this reach extends to 366,753 weekly readers - that's over 1/4 of adults in the area! The average time spent reading the Chronicle is 31 minutes; which shows the length of time that readers are engaging with the editorial and advertising content. 49,199 * copies of the Chronicle are sold on average each day as it continues to be an integral part of the region. * ABC Newcastle Chronicle 100% paid, Mon - Sat, JICREG, 1/10/2012 Page Views: 10m Audience figures from Omniture, monthly average (Jan - Jun 2014). More than 1 in 3 ChronicleLive users have clicked through to an online advertisement, demonstrating that our users are responsive and receptive to Internet advertising messages. ChronicleLive reaches an internet-savvy audience, with 84% of users having purchased products or services online in the past 12 months. Download our rate cards for all the prices of our print and digital products. Editor, The Chronicle Editor-in-Chief, Trinity Mirror North East Darren was appointed editor of the Chronicle in September 2011, following a six-year spell as editor of the Evening Gazette in Teesside."}, {"articleID": "2015030507_00003633_W", "names": {"Amy Jackson": ["Q2121695", "Q2121703"]}, "date": "2015-03-05", "url": "http://www.daijiworld.com/news/news_disp.asp?n_id=301698", "content": "Thursday, March 05, 2015 12:25:47 PM (IST) <mark>Amy Jackson</mark>'s near-death experience Chennai, March 5 (IANS): Actress <mark>Amy Jackson</mark>, while shooting for a yet-untitled Tamil action drama, miraculously escaped a fatal fall from a cliff thanks to the timely intervention of her co-star Karunakaran, who saved her. Being directed by Thirukumaran, the film features Udhayanidhi Stalin in the lead. \"Udhay and I were on our bike, while <mark>Amy</mark> was driving another two-wheeler. As we started shooting, <mark>Amy</mark> lost control of her vehicle and started drifting towards the edge of the cliff. I quickly got down from my bike and stopped her bike from falling down,\" Karunakaran told IANS. <mark>Amy</mark> was in momentary shock but she eventually completed the shot. The team has successfully completed the first schedule and <mark>Amy</mark> has returned to Mumbai to start working on her Hindi projects. Stay updated wherever you go with Daijiworld.com and Daijiworld 24X7 tv channel mobile apps. Your Comment [Please limit your comments within 2000 characters] Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that under 66A of the IT Act, sending offensive or menacing messages through electronic communication service and sending false messages to cheat, mislead or deceive people or to cause annoyance to them is punishable. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Published by Daijiworld Media Pvt Ltd Mangalore Editor-in-chief: Walter Nandalike Corporate Office: Daijiworld Residency, Airport Road, Bondel Post, Mangalore - 575 008 Karnataka India City Office: First Floor, Divya Deepa Arcade, About Us Copyright © 2001 - 2015. All rights reserved. Kishoo Enterprises, Maithri Complex, 3rd Floor, Udupi Service Bus Stand, Udupi, Karnataka. Pin 576101 Telephone: 0091-820-4295571 Daijiworld Middle East FZE P.O. Box: 84772, Dubai, UAE Tel: 971-50-6597629 Fax: 971-4-2639207"}, {"articleID": "2010100411_00425512_W", "names": {"Bernard Shaw": ["Q10537487", "Q322736", "Q4893642"]}, "date": "2010-09-10", "url": "http://blueberrypie.typepad.com/peach_cobbler/2010/09/business-administration.html", "content": "but managers also is a necessity for the defense of this profession should support those who have been trained since formed to be responsible for managing, managing companies, organizations that require this profession. unfortunately, the reality of professional behavior of the guild, college has left much to be said for many years, where their participation is negative, it failed to seize the opportunities presented to it, and as indicated by mr. secundino camacaro regard: \"the history of the guild is a continuing lack of struggle to overcome the contradiction between change and resistance to innovation. creativity in business administration\" imagination is the beginning of creation. imagine what we want, we create a strong desire for what we imagine and finally, we created what we wanted. \"george <mark>bernard shaw</mark>\" we live in a society deeply dependent on science and technology...top video tutorials for the construction of a website and start your own business on the internet e-commerce"}, {"articleID": "2010032508_00114245_W", "names": {"David Dunn": ["Q18763995", "Q312042", "Q51879854", "Q5233121", "Q5233123", "Q57312975"], "Joe Hart": ["Q16729685", "Q187184"], "James Mcfadden": ["Q310700", "Q6139307"]}, "date": "2010-03-25", "url": "http://theargus.co.uk/uk_national_sport/5082131.Allardyce__We_can_play_without_fear/?ref=rss", "content": "sam allardyce believes blackburn can afford to \"relax\" ahead of sunday's east lancashire derby at burnley after virtually guaranteeing their barclays premier league survival with victory over birmingham. <mark>david dunn</mark> - who spent three and a half years with birmingham before rejoining rovers in 2007 - netted a brace against his old club at ewood park, opening the scoring by firing past <mark>joe hart</mark> after just five minutes. <mark>james mcfadden</mark> equalised early in the second half with a fine free-kick before <mark>dunn</mark> struck again in the 67th minute, heading home el-hadji diouf's corner to seal the win. \"the victory was the most important thing and we've got that, leaving us with a very good opportunity to play our local rivals on sunday with less fear,\" the blackburn boss said. \"we can go there, relax, just try and enjoy the game as best we can and see if we can play and get a result .\" wednesday night could have been even sweeter for <mark>dunn</mark> had referee mark clattenburg not disallowed his emphatic strike just before half-time, with michel salgado adjudged to have committed a foul in the build-up. \"it was supposed to be for a foul on (lee) bowyer but if you look at it again, there has been much worse that has gone on, and i think it was a great shame when you've had a finish as good as that,\" allardyce said. \"dunny could be sat with the ball signed, with a hat-trick ball, but it doesn't really matter now because we have won the game and he has scored two. he is very happy, as all the players are .\" birmingham boss alex mcleish acknowledged <mark>dunn</mark>'s role in his team's defeat, but felt clattenburg had failed to spot two infringements that led to blackburn's second goal. \"he scored the two goals and there is no doubt that <mark>dunn</mark> is a good player,\" mcleish said. search for jobs in brighton, hove, lewes, worthing, crawley and more...find the right person in brighton, hove, lewes, worthing, crawley...search for homes in brighton, worthing, hove, lewes ..."}, {"articleID": "2010010512_00055212_W", "names": {"Martin O'Neill": ["Q16733787", "Q310263"], "Steven Reid": ["Q334693", "Q7615188"], "Phil Jones": ["Q14329218", "Q16730412", "Q18632136", "Q206641", "Q20709445", "Q57014836", "Q601435", "Q7182047", "Q7182049", "Q7182050"]}, "date": "2010-01-05", "url": "http://lancashiretelegraph.co.uk/sport/football/blackburnrovers/news/4828435.Carling_Cup_is_January_priority_for_Blackburn_Rovers__says_Allardyce/?ref=rss", "content": "carling cup is january priority for blackburn rovers, says allardyce (from lancashire telegraph) blackburn rovers this month as boss sam allardyce admits reaching the carling cup final is january's priority. rovers travel to <mark>martin o'neill</mark>'s aston villa this afternoon for an fa cup third round tie but allardyce admits he already has more than half an eye on tuesday's villa visit in the carling cup semi final first leg. allardyce's men also face a trip to manchester city and a home game against fulham in their battle for premier league points in the coming weeks but, for the moment, the rovers boss is dreaming of glory. he said: \"this month becomes one thing and one thing only first and that is trying to get to wembley .\" alright, premier league is what we are all about and definitely the most important for the football club but not this month. \"we will deal with the premier league when it comes around .\" this month is going to determine whether we slip into a battle for premier league survival only or whether we are top of the tree in terms of going relatively well in the premier league and looking forward to a wembley final and even possibly getting through to the next round of the fa cup. \"this is the biggest month of the season for us and every player will have to give more than they have given all year, and they have given a lot, but they will have to give a whole lot more if they want to achieve something special and we are on the brink of achieving something special .\" they have to take it by the horns and make sure they are not miserable by the end of it. \"rovers fans can expect a number of changes to be made for today's clash as allardyce uses his squad to the limit to ensure freshness for the games ahead. <mark>steven reid</mark> could be set for a rare start, after returning from a loan spell at qpr, while young defender <mark>phil jones</mark> is also expected to be handed another senior chance. villa are also expected to name a weakened line-up, for a match <mark>martin o'neill</mark> has at the bottom of his list of priorities, as both managers look to limit the effects of a busy month .\" it doesn't happen very often in life does it?, \"said allardyce .\" i had to chuckle when the draw came out, i thought what have we got here. \"from my point of view seven games in january and we have built of squad of players that are there to be used in times like this .\" we now begin to use the squad to its full potential because of the amount of games we have got and the size of the games we have got. \"first we have the fa cup third round, which is always a glitzy thing but in the month term is not the top priority so we have to manage as best we can to get the golden prize .\" if we beat villa on saturday that would be fantastic but it won't be as important as beating them on tuesday night. \"then going on from there we have manchester city and we have to pick up more premier league points because we have let too many slip and then going to next semi final. morst the 88th min heartbreaker of dingles!, accrington says...great to hear it bs - days like wembley are what its all about! miracles do happen! just look at the team that started the 2002 final against spurs all-stars. we have already beaten villa in the league with 10 men so ant rovers fan giving up already is plain daft - come on you blues!. for the older rovers fans on here you may like to know the 2002 final dvd also has a section that looks back at 1960 and 1987 wembley trips - bring a tear to tha eye! well worth the £ 6.67 in the 3 for £ 20 offer. . now lets do it again - get down to ewood tuesday night. . security - east-ride - well i suppose wembley is slightly east of us! paolowhite, oswaldtwistle says...11:55 am sat 2 jan 10 think i would make the league more priority...can play the carling cup every season...dont take were eye off the prem completely bed and breakfast man _!, the riverside says...while i welcome what sam says about going to wembley, i also think he should also start putting a bit more effort into our position in the premiership. good chance's missed over christmas, but i think i will be saying the same, at the end of the season. kevin e, portugal says...12:49 pm sat 2 jan 10 the premiership should be the number one priority in my opinion. . how gutted will we all be if we can look back at having won the carling cup but have still been relegated?. as long as those squad members coming in give of their best we can maybe do both - let's hope so. villa will be approaching the tie in the same way so we should have a decent chance of matching them. . it's good to hear that reidy is in contention and that dunny is nearing fitness once again. we will need a fully-functioning midfield if we are to come through january in good style. woody riversider, blackburn says...2:11 pm sat 2 jan 10 1:56 pm sat 2 jan 10 oh i'll be there no matter what the weather or climate at the moment down ewood:) the chelsea game was pulsating & i don't see this game being any different? we all know what\" dirge' is being surved up at ewood at present in the main but, this isn't about sa this is about our football club' y' know the one that is pushing all the boundary's. the one that as seen finals, semi finals, top 6 finishes in the last 5/6 years. tough? course it's chuffin tough, well what do they say?: \"when the going gets tough the tough get going'!! their will be 20,000 brfc on tues or thats what i would expect along with villa, so 25/26000? come on you\" blues' this isn't the prem this is a chance to go to: wembleeee!! this is any-ones game & do you want to miss it for £ 15 dabs? just think crappy luke warm bovril & cardboard chips & seconds pie's!! you'll soon be warm when the lads run out under the warm glow of ewood floodlights:) this is our club asking for your support. put aside all \"grrrrr's' & shout us on the another final at the new wembley. this is a 50/50 game & we know our club is capable of pulling it off .' i was born in the blackburn end':) rovergeoff, blackburn says...2:20 pm sat 2 jan 10 i think the league should b priority our perfoamances are nt good enough we need to start winning games 12 months on and nothings changed still struggling with results rovergeoff, blackburn says...2:20 pm sat 2 jan 10 i think the league should b priority our perfoamances are nt good enough we need to start winning games 12 months on and nothings changed still struggling with results jonny bovril, blackburn says...2:58 pm sat 2 jan 10 aye well said woody and morst. we are all feeling a bit underwhelmed with the fare offered at the mo - but lets not let this semi final pass us by. this is a chance for glory and lifetime memories. lets not deny ourselves to spite sa. if sa is too stubborn to change his style then he will fall on his sword eventually regardless of his record in the cup. this one is for us. we have done well in the cups recently but you never know this could be our last chance for years? lets get ourselves down and roar on the lads - and while we are at it lets force some humble pie down the throats of messrs freidel and warnock! morst the 88th min heartbreaker of dingles!, accrington says...short memories? - it was winning the league cup in 2002 that gave us confidence and spurred us on to finish 10th! we were in the bottom 3 on final day!. exactly how is having a real go on tuesday night going to be a problem for our prem form? dating find the right person for you search houses, flats, and all properties"}, {"articleID": "2012090818_00018388_W", "names": {"Jose Reyes": ["Q220096", "Q282400", "Q6293856"], "Jose Fernandez": ["Q2052820", "Q21006773", "Q57192176", "Q6292174", "Q705656"]}, "date": "2012-09-08", "url": "http://mlb.mlb.com/news/article.jsp?ymd=20120908&content_id=38092560&notebook_id=38092562&vkey=notebook_mia&c_id=mia&partnerId=rss_mia", "content": "washington--lost amid the thrill of the marlins' extra-inning win after blowing a four-run lead on friday night was the best outing of jacob turner's rookie season. the 21-year-old right-hander tossed six innings of two-run, four-hit ball while striking out three and walking just one. but with a predetermined pitch count falling somewhere between 80 and 85 pitches, turner's night ended at 81. considering the marlins have the 23rd-ranked bullpen era (4.08) in baseball, manager ozzie guillen's decision to pull turner seemed surprising--especially considering the pitch count wasn't revealed until after the game. \"i felt good, but obviously that's not my decision,\" turner said. \"i felt like i got stronger as the game went on .\" after the game, guillen said the front office will decide if turner pitches under a pitch count for the remainder of the season. acquired from the tigers in a late-july trade, turner is the marlins' third-ranked prospect according to mlb.com, and is considered one of the best pitching prospects in baseball, with a mid-90s sinker and poise on the mound. on the year, turner is 1-3 with a 6.44 era in 29 1/3 innings. with miami, he is 0-2 with a 5.29 era in 17 innings. \"we have to take care of everybody,\" guillen said. \"that's the reason we tried to stay away from him .\" washington--<mark>jose reyes</mark> added two triples in the marlins' 9-7 win over the nationals on friday night, tying him for the major league lead with 11. <mark>reyes</mark>' first triple came in the fourth inning and drove in justin ruggiano to put the marlins ahead 6-2. his second three-base hit in the 10th scored ruggiano and bryan petersen, giving miami the go-ahead runs. \"in that situation, maybe i like [triples] better,\" <mark>reyes</mark> said. \"the last one was to put my team ahead, and that was good, because it's never easy against the nationals. they always find a way to fight back. we're just happy with a win .\" <mark>reyes</mark> is now 5-for-9 in extra innings this season, with a single, a double, two triples and a home run. according to elias sports bureau, the last major league player to have a season with an \"extra-inning cycle\" was the cubs' ryne sandberg in 1984. worth noting? on friday, the marlins named outfielder marcell ozuna their minor league player of the month and right-hander <mark>jose fernandez</mark> minor league pitcher of the month for august. at class a jupiter, ozuna batted .365 (38-for-104) with eight home runs and 32 rbis in 27 games last month. <mark>fernandez</mark>, also with jupiter, went 4-0 with an 0.72 era over 25 innings and five starts .? after friday night's 9-7, 10-inning win, the marlins are 10-3 in extra-inning games. those 10 wins are a new franchise record. mia @ wsh: <mark>reyes</mark> triples in fourth to score ruggiano 00:00:57 mia @ wsh: <mark>reyes</mark> triples twice, drives in game-winner 9/7/12: after night gets dark, <mark>reyes</mark> rises in 10th 00:02:49 <mark>jose reyes</mark> bio, stats, photos and highlights? 2001 - mlb advanced media, l.p. all rights reserved."}, {"articleID": "2010082500_00671149_W", "names": {"W. F.": ["Q47068652", "Q56462652"], "James Cook": ["Q11309434", "Q18009158", "Q26281510", "Q28155375", "Q50360082", "Q59309681", "Q6131673", "Q6131676", "Q6143873"], "Neil Burgess": ["Q23657268", "Q42822075", "Q6988330"]}, "date": "2010-08-24", "url": "http://nature.com/news/2010/100824/full/news.2010.421.html?s=news_rss", "content": "globally, india ranks second in terms of total land area under plantation. <mark>w.</mark> laurance native forests in india are disappearing at a rate of up to 2.7% per year. the figures, published in an analysis of the country's forest cover, stand in stark contrast to those of a 2009 survey by an indian governmental organization, which said that forests have expanded by 5% over the past decade. india is among the most densely forested countries in the world, and in 2008 the government announced goals to increase forest cover by nearly 10% by 2012. the india state of forest report 2009 by the forest survey of india (fsi) indicated that the outlook was good. but william laurance, a conservation biologist at <mark>james cook</mark> university in cairns, queensland, australia, and one of the authors of the analysis, to be published in the journal conservation letters 1, says that while the figures showing that forest cover in india has grown are \"technically correct\" , they are also \"misleading\". \"we found a very real and serious loss of native forest,\" he says, adding that it could put india ahead of most other countries in terms of deforestation. nature contacted the fsi for comment, but they did not respond by the time of publication. india has been busy planting trees, including non-native eucalyptus and acacia, to provide timber and fuel wood - and in some cases to earn money from selling carbon credits under the clean development mechanism established in 2001 as part of the kyoto protocol. the country now ranks second globally in terms of total land area under plantation. laurance says that much of india's claimed growth in forest cover has come from plantations, and that this is masking a fall in native forests. \"the indian government has made a big deal of increasing forest cover. but they are not distinguishing between natural and artificial forests,\" he says. a growing problem this is bad for the environment because replanting native forests with non-native trees damages local biodiversity, says <mark>neil burgess</mark>, a conservation biologist at the university of copenhagen. \"most plantations of non-native trees have very low biological value. they are only good to store carbon,\" he says. this distinction between native and non-native trees is important for an accurate picture of the state of the world's forests, says laurance. in the analysis, the researchers assessed data on the growth in indian plantations collected for the food and agricultural organization (fao) of the united nations. it estimates that plantations grew by around 15,400 square kilometres a year between 1995 and 2005. the researchers subtracted the rates of plantation expansion from the growth in total forest cover as measured by remote-sensing imagery, and found that coverage of native indian forests actually declined by 1.5-2 .7% between 1995 and 2005 - an \"alarming\" average of 2.4% a year and a loss of more than 124,000 square kilometres over the decade. the researchers checked these figures against changes in forest biovolume (the volume of wood and other above-ground forest material), estimated from field observations in the fsi report. they found a loss in native forest biovolume of around 2.7% per year. a resolution for change laurance says that some assessments of forest cover, such as that carried out by the fao, do not distinguish between native forests and plantations. they rely on relatively coarse data from sources including the us national oceanic and atmospheric administration's advanced very high resolution radiometer satellites, which have a resolution of 1.1 square kilometres per pixel. but the indian remote sensing satellites used by the fsi have a much higher resolution - up to 23.5 square metres per pixel - so the agency has the means to distinguish native forests from plantations of non-native trees. laurance says he is hopeful that the united nations' redd + initiative to reduce carbon emissions from deforestation and forest degradation - which includes a focus on conservation and sustainable management of forests - will encourage india and other countries in similar situations to distinguish between native and artificial forests, and pay more attention to protecting the former. advertisement he says that countries such as norway - the programme's first and largest donor - will be interested more in paying to stop deforestation of native forests than in expanding plantations. bhaskar vira, an environmental economist at the university of cambridge, uk, says that he thinks \"there is probably some truth\" in the study's finding. but he warns that not all the trees planted each year reach maturity and show up in satellite imagery. because the authors subtracted the fao figures for the total area covered by plantations from a satellite-based estimate of total forest cover, the study may have overestimated the amount of deforestation taking place. laurance agrees that the data on plantations is \"rough\" , but points out that the calculations of loss in biovolume used forest survey of india data. the figures derived were similar to his estimates for deforestation, so he is confident in the results. references puyravaud, j.-p ., davidar, p. & laurance, <mark>w. f.</mark> conserv. lett. doi:10.1111 / j.1755-263x .2010.00141 (2010)."}, {"articleID": "2018120322_00308811_W", "names": {"Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"], "Roger Stone": ["Q19653753", "Q7358961"], "Mark Warner": ["Q14949474", "Q1617921", "Q21166633", "Q453893", "Q51299121", "Q6770231"], "David Weinstein": ["Q1177127", "Q1177128"]}, "date": "2018-12-03", "url": "http://wjtv.com/news/national/trump-praises-witness-who-refuses-to-testify-against-him/1637396094", "content": "Trump praises witness who refuses to testify against him By: Posted: Dec 03, 2018 04:29 PM CST Updated: Dec 03, 2018 04:29 PM CST WASHINGTON (AP) - President Donald Trump praised a key witness in the Russia investigation Monday for having the \"guts\" not to testify against him, and said his former lawyer - who cut a deal with prosecutors - should head straight to prison. In a pair of politically charged tweets, Trump made clear that he is closely watching those who turn on him in the special counsel's probe, which has ensnared some of the president's closest advisers. So far, five people in Trump's orbit have pleaded guilty to federal charges. The tweets add to mounting questions about whether Trump is taking steps to improperly influence witnesses in an investigation that has enraged him and shadowed his administration. Some legal experts, though, say they may not amount to witness tampering if Trump didn't directly tell others what to say or not say. Trump already has come under scrutiny from critics who fear he may use his executive power to protect himself as well as friends and supporters. Last week, Trump told the New York Post that a pardon for his former campaign chairman Paul Manafort was not off the table. Prosecutors say Manafort torpedoed his plea deal with special counsel Robert Mueller by repeatedly lying to them, although Manafort denies that he lied. In one of Monday's tweets, Trump took aim at <mark>Michael Cohen</mark>, his former personal attorney who once grandly declared he would \"take a bullet\" for the president but ultimately took a plea deal. <mark>Cohen</mark> pleaded guilty last week to lying to Congress about negotiations he had on Trump's behalf for a real estate deal in Moscow. Though he told lawmakers the talks were done by January 2016, he admitted they actually lasted as late as June - after Trump had clinched the Republican nomination and after Russians had penetrated Democratic email accounts for communications later released through WikiLeaks. <mark>Cohen</mark> said he lied out of loyalty to Trump, who insisted throughout the campaign that he had no business dealings in Russia, and to be consistent with his political messaging. On Monday, Trump ripped into <mark>Cohen</mark> on Twitter. \"You mean he can do all of the TERRIBLE, unrelated to Trump, things having to do with fraud, big loans, Taxis, etc., and not serve a long prison term?\" Trump added that <mark>Cohen</mark> \"makes up stories to get a GREAT & ALREADY reduced deal for himself .\" Trump added: \"He lied for this outcome and should, in my opinion, serve a full and complete sentence .\" Minutes later, Trump lavished praise on his former campaign adviser <mark>Roger Stone</mark>. Mueller's prosecutors are investigating <mark>Stone</mark> to learn whether he had advance knowledge of WikiLeaks' plans to release hacked material damaging to Hillary Clinton's presidential effort. Trump lauded <mark>Stone</mark> for saying he'd never testify against the president. \"This statement was recently made by <mark>Roger Stone</mark>, essentially stating that he will not be forced by a rogue and out of control prosecutor to make up lies and stories about\" President Trump,' \"he tweeted .\" Nice to know that some people still have \"guts!'\" <mark>Stone</mark> then posted a screenshot of Trump's tweet with a caption that said he was proud of their 40-year relationship and \"prouder still of the amazing job he is doing making America Great Again!\" Sen. <mark>Mark Warner</mark>, the top Democrat on the Senate intelligence committee, said Trump's tweet was inappropriate. \"The President of the United States should not be using his platform to influence potential witnesses in a federal investigation involving his campaign,\" <mark>Warner</mark> said in a tweet. <mark>Stone</mark> said the idea that Trump's tweet amount to witness tampering is \"hysterical .\" \"I'm not a witness to any proceeding,\" he said. <mark>David Weinstein</mark>, a former Justice Department prosecutor in Florida, said he was surprised by Trump's comments Monday, but didn't believe the tweets alone rose to the level of obstruction or witness tampering because Trump did not explicitly tell anyone what to say or not to say. Subjects of an investigation can still communicate to others entangled in a probe, and though they can encourage them to tell the truth, they cannot coach them to lie, he said. \"What he seems to be saying is that people who continue to show support for him, in some way, may be rewarded for that support,\" <mark>Weinstein</mark> said. \"I don't think it rises to the level of obstruction yet, but it certainly would cause people who are conducting the investigation to start asking questions about whether or not the target has reached out to them .\" Trump's message had an immediate effect on supporters. His remarks prompted Michael Caputo, the president's former campaign aide and a longtime <mark>Stone</mark> friend, to launch a \"GoFundMe\" account to help pay <mark>Stone</mark>'s mounting legal fees. <mark>Stone</mark> said he's paid about half a million in legal fees already and is projecting that total to reach $2 million. \"I require a small platoon of excellent lawyers and they're not inexpensive,\" he said. A conservative author, who is an associate of <mark>Stone</mark> and in the crosshairs of Mueller's investigation, filed a complaint Monday with the Justice Department, alleging prosecutors tried to coerce him to give false testimony and threatened to indict him. Investigators are looking into whether Jerome Corsi had contact with WikiLeaks or knew about their plans to release emails damaging to Clinton. Corsi has released documents showing Mueller's prosecutors offered him a deal to plead guilty to a false statements charge but he's rejected the offer. Corsi says he didn't knowingly mislead investigators and wasn't in contact with WikiLeaks. The Justice Department declined to comment on his complaint. The Russia investigation has dogged Trump for two years. In recent weeks, Trump has sharpened his criticism, accusing Mueller's prosecutors of dirty tactics and pressuring witnesses to lie. <mark>Cohen</mark>'s decision to turn on his former boss was a particularly striking blow for the president. <mark>Cohen</mark> pleaded guilty in August to eight criminal counts, including campaign-finance violations, in a separate case unrelated to Mueller's investigation. He said Trump directed him to arrange the payment of hush money to porn star Stormy Daniels and a former Playboy model in the run-up to the 2016 campaign. <mark>Cohen</mark>'s admission during that court appearance marked the first time that a Trump associate had gone to court and implicated Trump in a crime. Whether - or when - a president can be prosecuted remains a matter of legal dispute. Trump has denied any wrongdoing as well as the extramarital affairs. ___"}, {"articleID": "2015080903_00035832_W", "names": {"Liz Johnson": ["Q6660194", "Q6660196"]}, "date": "2015-08-09", "url": "http://cjonline.com/sports/bowling/2015-08-08/kuhlkin-sweeps-finals-claim-first-pwba-crown", "content": "The bowling lanes at the west end of West Ridge Lanes don't look any different to the untrained eye than the rest of the center's 32 lanes. But, oh, how wonderful they looked to 21-year-old <mark>Liz</mark> Kuhlkin on Saturday during the PWBA Topeka Open presented by Prairie Band Casino & Resort. Kuhlkin, of Schenectady, N.Y., used lanes 29 and 30 during two rounds of match play Saturday morning and afternoon to earn a berth in the stepladder finals, and then won three matches Saturday night on lanes 25 and 26 to claim her first PWBA title and a $10,000 prize. Kuhlkin's Korner, the west end should be called. \"I definitely was not upset when I heard the finals would be on the high (numbered) end of the house,\" Kuhlkin said. \"I don't think I had many games above 200 on the low end. But I still had a tough go ahead of me .\" Entering the finals as the No. 3 seed, Kuhlkin, a three-time NCAA All-American at Nebraska and a 2015 graduate, ousted Clara Guerrero, 224-205, and <mark>Liz Johnson</mark>, 247-202, before stopping top qualifier Danielle McEwan, 241-203, for the championship. \"It's just amazing,\" said Kuhlkin, the 2015 NCAA Division I Player of the Year and the fifth-place finisher at the USBC Queens in May. \"I actually made a goal for myself this week to make the top 16, and I exceeded that, and then I made the stepladder finals, and to win is just incredible .\" That would be a good way to describe Kuhlkin's performance on lanes 29 and 30 during the tournament. Kuhlkin capped the first round of match play Saturday with a perfect game to move into contention, and then shot 267 in the final, position-round game of the second match play session to move from fifth to third and make the TV show (streamed live on Xtra Frame). \"Honestly, it felt like I was bowling league, and it wasn't like that for anybody else,\" said Kuhlkin, who rolled a 243 game earlier on 29-30, which means she shot 810 on the pair overall. \"It just felt like I had the entire right side. As long as I kept it right, it struck. I struck light, I struck high, I tripped fours. It was fortunate that I drew that pair .\" While Kuhlkin was working toward a big finish, the 23-year-old McEwan, of Stony Point, N.Y., was dominating the field throughout most of the event. She led by 36 pins after 12 games of qualifying Friday, by 99 pins after the first round of match play Saturday and, after overcoming a slow start, by 107 pins at the end of match play. But after waiting through the first two matches Saturday night, and opening the championship game with a pair of strikes, McEwan failed to strike again on the lane 25. Kuhlkin, who took the lead by opening with four strikes, doubled in the sixth and seventh and ninth and 10th frames to seal the victory. \"It did not go as planned at all,\" said McEwan, who was a three-time NCAA All-American at Fairleigh Dickinson and the 2012 and 2013 NCAA Player of the Year. \"I'd planned on striking a lot more, which I did on one lane, but I couldn't figure out the other one .\" If anything, when I was practicing, I was actually more comfortable on the left lane, and then they kind of flip-flopped at the start of the (championship) game. \"<mark>Johnson</mark>, 41, of Cheektowaga, N.Y., charged into the stepladder finals by opening the second round of match play with games of 245, 212, 244, 238 and 236 (she average 227.38 for the round), but struggled on the championship lanes, striking only three times in her loss to Kuhlkin. Guerrero, 33, of Pflugerville, Texas, and an 18-year member of the national team in her native Colombia, held on to earn the last spot in the finals, but could only strike on the left lane. She succumbed when Kuhlkin strung strikes in frames four through nine. McEwan took home $5,000 for finishing second, while <mark>Johnson</mark> earned $3,500 and Guerrero $3,000. The PWBA Tour moves to Kuhlkin's collegiate stomping grounds next week in Lincoln, Neb.. PWBA Topeka Open Results Saturday at West Ridge Lanes STEPLADDER FINALS Match one--<mark>Liz</mark> Kuhlkin, Schenectady, N.Y., def. Clara Guerrero, Pflugerville, Texas, 224-205 ($3,000 to Guerrero) Match two--<mark>Liz</mark> Kuhlkin def. <mark>Liz Johnson</mark>, Cheektowaga, N.Y., 247-202 ($3,500 to <mark>Johnson</mark>) Championship match--<mark>Liz</mark> Kuhlkin def. Danielle McEwan, Stony Point, N.Y., 241-203 ($10,000 to Kuhlkin; $5,000 to McEwan) STANDINGS AFTER 28 GAMES Note: Includes 12-game qualifying pinfall, eight-game pinfall and won-lost record for two match play rounds, total pinfall and tournament average through 28 games, overall won-lost record and prize money: 1. Danielle McEwan, Stony Point, N.Y.: 2,701; 1,744 / 7-1-0; 1,675 / 4-4-0; 6,450; 218.57; 11-5-0 2. <mark>Liz Johnson</mark> Cheektowaga, N.Y.: 2,576; 1,648 / 4-4-0; 1,819 / 6-2-0; 6,343; 215.82; 10-6-0 3. <mark>Liz</mark> Kuhlkin Schenectady, N.Y.: 2,548; 1,780 / 4-4-0; 1,655 / 5-3-0; 6,253; 213.68; 9-7-0 4. Clara Guerrero Pflugerville, Texas: 2,509; 1,711 / 5-3-0; 1,676 / 5-3-0; 6,196; 210.57; 10-6-0 5. Diana Zavjalova Beavercreek, Ohio: 2,579; 1,690 / 5-3-0; 1,649 / 4-4-0; 6,188; 211.3; 9-7-0; $2,000 6. Jodi Woessner Oregon, Ohio: 2,600; 1,701 / 6-2-0; 1,641 / 2-6-0; 6,182; 212.21; 8-8-0; $1,850 7. Kamilah Dammers, Aruba: 2,588; 1,584 / 6-2-0; 1,654 / 4-4-0; 6,126; 208.07; 10-6-0; $1,800 8. Kelly Kulick Union, N.J.: 2,665; 1,586 / 3-5-0; 1,617 / 5-3-0; 6,108; 209.57; 8-8-0; $1,750 9. Shannon Sellens Copiague, N.Y.: 2,651; 1,725 / 6-2-0; 1,454 / 3-5-0; 6,100; 208.21; 9-7-0; $1,700 10. Jennifer Higgins Westerville, Ohio: 2,570; 1,578 / 3-5-0; 1,629 / 5-3-0; 6,017; 206.32; 8-8-0; $1,650 11. Brandi Branka Momence, Ill.: 2,537; 1,601 / 3-5-0; 1645/4 -4 -0; 5,993; 206.54; 7-9-0; $1,550 12. Bryanna Caldwell, Red Rock, Ariz.: 2,534; 1,538 / 3-5-0; 1,639 / 4-4-0; 5,921; 203.96; 7-9-0; $1,500 13. Stefanie <mark>Johnson</mark>, Grand Prairie, Texas: 2,609; 1,552 / 3-5-0; 1,568 / 3-5-0; 5,909; 204.61; 6-10-0; $1,450 14. Sarah Lokker, New Baltimore, Mich.: 2,469; 1,552 / 1-7-0; 1,573 / 4-4-0; 5,744; 199.79; 5-11-0; $1,400 15. s-Carolyn Dorin-Ballard, Keller, Texas: 2,501; 1,530 / 3-5-0; 1,545 / 2-6-0; 5,726; 199.14; 5-11-0; $1,350 16. Diandra Asbaty, Chicago, Ill.: 2,487; 1,535 / 2-6-0; 1,492 / 4-4-0; 5,694; 196.93; 6-10-0; $1,300 300 game--<mark>Liz</mark> Kuhlkin s--senior"}]