[{"articleID": "2012091218_00004788_W", "names": {"Ron Wells": ["Q17402554", "Q7364526"], "Tim Burns": ["Q21034422", "Q3528602", "Q7803252", "Q7803254", "Q7803255"], "David Condon": ["Q16214791", "Q18206047"]}, "date": "2012-09-12", "url": "http://inlander.com/spokane/article-18401-cut-and-paste.html", "content": "cut-and-pastegate mud season continues. and for nancy mclaughlin, it's been particularly messy. mclaughlin, a spokane city councilwoman and 3rd district state senate candidate, acknowledged this week that some of the issue positions on her website were copied straight from a gop site. \"if i had actually been aware that it only had been copied and pasted, i would have made it my own,\" she tells the inlander. but \"plagiarizing to me means an unauthorized use? for school, work or whatever,\" mclaughlin says, adding that since so many of her \"ideals as a conservative candidate line up,\" she didn't think the senate campaign committee would disapprove. the councilwoman adds that the pasted portion represented about 15 percent of her issues page. her acknowledgement comes less than a week after she apologized to her opponent, rep. andy billig, for misstating his position on campaign mailers she sent. the allegations arose when the inland northwest leadership pac - a political action committee that billig has contributed to - began circulating screenshots of mclaughlin's campaign site appearing alongside the copied portion of a website for gop state senate candidates. \"her approach is to recycle old republican talking points,\" billig says. while he had heard of the issue with mclaughlin's website, billig adds that he no involvement with the inland northwest leadership pac's release of the screenshot. mclaughlin says she is rebuilding her website. the ridpath apartments? for months, apartment developer <mark>ron wells</mark>, well known for restoring historic buildings in spokane, has been rumored to be first in line to try to save the troubled ridpath hotel. but when asked about it, he's kept consistently silent. minutes from an aug. 21 predevelopment conference, however, reveal <mark>wells</mark>' plans for a $2 million project called the ridpath club apartment, possibly beginning this october. the project would convert ridpath tower and the next door y building into apartments on top of restaurants, storefronts and basement parking. there'd still be lot of hoops to jump through, of course: permits, inspections, repairs and actually purchasing the building from its entangled owners. mickey brown, with eagle river development, confirms that he is one of <mark>wells</mark>' partners on the project. brown already owns a very small piece of the ridpath and says he's under an agreement with a third party not to elaborate more on the details of the project. he does hint that there's at least one more person involved on the project with him and <mark>wells</mark>. \"anyone who's had success in spokane over the last 40 years, he's done it,\" brown says of the mystery party. \"not a bad track record .\" a town full of ombudsmen when the united states ombudsmen association holds its national convention in spokane next month, will the city still have a police ombudsman? probably. police ombudsman <mark>tim burns</mark> - who says he helped bring the convention the spokane for oct. 8-12 - says he'll be here for it. spokane mayor <mark>david condon</mark> decided not to extend <mark>burns</mark>' three-year contract, which ended in late august. but the city said it would let <mark>burns</mark> stay through september. <mark>burns</mark> now says he's in negotiations with <mark>condon</mark>'s office for a new contract, possibly one that will keep him here into next year. stopping short spokane city council shoots down a proposal for neighborhood c.o.p. shops; plus, washington benefits from the country's drought chris stein | wednesday, july 18,2012 stop the presses the spokesman's future as a daily. plus, laptops heading to the classroom. daniel walters | wednesday, june 6,2012"}, {"articleID": "2015031422_00012646_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2015-03-14", "url": "http://www.realclearpolitics.com/video/2015/03/14/krauthammer_explains_why_obama_will_have_utterly_defeated_congress_if_he_goes_to_un_over_iran.html", "content": "Krauthammer Explains Why Obama Will Have \"Utterly Defeated Congress\" If He Goes To U.N. Over Iran CHARLES KRAUTHAMMER: None of this is going to matter. It's obvious the administration wants to go to the U.N. and to cut out the Congress regardless of the legalities here. If he goes to the U.N. and he gets the Security Council to approve the deal, assuming he signs this deal, what's going to happen overnight, it will be approved and the Europeans, the Chinese and the Russians are going to end their sanctions. And that means that even if we retain our sanctions it will make little difference the sanctions regime will be over, we have seen during the months that Obama has been saying Iran is isolated and all that, delegation after delegation of Europeans and others arriving, business delegation arriving in Tehran, working out deals, anticipating that when this process is over--the one that started year and a half ago--that sanctions will be lifted they are ready to come out of the gate with billions of dollars of business which will revive the Iranian economy. At which point even if Congress hangs on to sanctions, it will make no difference. In fact it will be the worst of both worlds because we'll be cutting out--the Europeans will have suspended their sanctions. Iran will be progressing economically and we will have given Iran an excuse not to honor the agreement. So we'll have no inspections, no control and nothing and that's the strategy of the administration. Regardless of tradition or legality, if he goes to the Security Council he has utterly defeated Congress and completely overstepped his authority. Gen. Dempsey on Fight Against ISIS: \"Activities Of The Iranians Is A Positive Thing\" <mark>Jon Stewart</mark> Calls Out Hypocrisy of Right And Left For Conducting Foreign Policy Without President FP's Yochi Dreazen: Gulf States Fear An Iran With \"Hegemonic Influence\" Psaki: GOP Letter to Iran \"Brings Into Question Whether They Want To Prevent Iran From Acquiring A Nuclear Weapon\" "}, {"articleID": "2018121216_00844231_W", "names": {"Geoff Moore": ["Q21063119", "Q5534235"]}, "date": "2018-12-12", "url": "https://cdn2.benzinga.com/pressreleases/18/12/r12839058/dallas-fuel-to-host-first-home-games-in-overwatch-league-history", "content": "Dallas Fuel To Host First Home Games in Overwatch League History December 12, 2018 11:00 am Comments Share: DALLAS, Dec. 12, 2018 / PRNewswire /--The Overwatch League ™ is coming to North Texas. The Overwatch League, the first global professional esports league with city-based teams, today revealed the 2019 season schedule, which includes a weekend of eight matches hosted in North Texas by the Dallas Fuel franchise on April 27--28, 2019. This is the first time in Overwatch League history that regular-season matches will be played anywhere other than Blizzard Arena Los Angeles. The Dallas Fuel will host the first-ever home match for a franchise, taking on the Los Angeles Valiant on Saturday, April 27. Ultimate Weekend--Dallas will feature competition among eight of the 20 Overwatch League teams, with four matches played each day. The weekend will conclude with the sole regular-season meeting between the Dallas Fuel and their in-state rivals the Houston Outlaws on Sunday, April 28. Fans interested in tickets can sign up now at DallasFuel.com for the priority access ticket sale, which will launch on December 19, at 10 a.m. CST. Only reserved seating will be offered. \"It is an honor to have Dallas selected as the first team to bring Overwatch League matches into a home market,\" said Mike Rufail, owner of the Dallas Fuel. \"Texas is where I was born and raised. I know our home crowd will want to be a big part of this experience and fans from all around the world will have a chance to make esports history with us in North Texas. We will deliver an experience and weekend of entertainment that lives up to Texas standards .\" All matches during Ultimate Weekend--Dallas will be played at the Allen Event Center, a versatile sports and event venue located in the heart of the Dallas-Fort Worth metroplex. The event is expected to draw the largest spectator crowd ever to watch a live regular-season Overwatch League match. The Allen Event Center is situated near one of the largest mixed-use developments in the U.S., with ample parking, hotel accommodations, restaurants, and retail within a short distance. The Dallas Fuel and the Overwatch League are planning a weekend-long series of festival-style events, including autograph signings with Overwatch League teams and players, sponsor exhibitions, and family-friendly activations. \"This is going to be an incredible weekend on a number of levels: local gaming enthusiasts are going to get a can't - miss event in their backyard, Overwatch fans will have the opportunity to travel to North Texas for a historic weekend of matchups, and the streaming audience from around the world will get to join in on the excitement,\" said <mark>Geoff Moore</mark>, president of the Dallas Fuel. \"We're thrilled that our first-ever home match is part of a two-day Overwatch League festival that will showcase this region's passion for esports and make for a unique debut among the storied Dallas sports franchises .\" In addition to the Dallas Fuel, reigning Overwatch League champions the London Spitfire will play two matches during the weekend. Chengdu, Hangzhou, Houston, Los Angeles, Paris, and Seoul round out the eight Overwatch League teams scheduled to compete. For ticket information or more details on programming and events, follow @ DallasFuel on Twitter or visit DallasFuel.com. Match Schedule"}, {"articleID": "2017031601_00281800_W", "names": {"Stephen Scott": ["Q2345068", "Q7610488"]}, "date": "2017-03-16", "url": "http://brisbanetimes.com.au/wa-news/men-handed-long-jail-terms-over-meth-in-the-spa-drug-raid-20170315-guyxv3.html", "content": "March 16 2017 - 11:28 AM Save Print License article Men handed long jail terms over \"meth in the spa drug raid' Phil Hickey facebook SHARE twitter TWEET email google-plus linkedin reddit More Millions of dollars of methamphetamine was thrown into a spa at a Perth home in a panicked attempt to destroy the drugs during a police raid, a WA court has heard. Christopher Neil Rowson, 31, and Shaun Michael Mather, 35, were both handed long jail terms in the WA District Court last week over the multimillion dollar drug bust. SHARE Share on Facebook SHARE Share on Twitter TWEET Link The meth dealers poured the drug in a hot tub in the hope of getting away with the crime, but testing uncovered $2m worth of ice. (file pic) Photo: AP The pair were inside a home south-east of Perth in April 2015 when police came calling with a search warrant. Federal police officers had been monitoring Mather, the court heard, as part of an operation targeting the Lone Wolf outlaw motorcycle gang. SHARE Share on Facebook SHARE Share on Twitter TWEET Link Police seized 2.1 kg of meth from the scene, including 1.7 kg from the spa water. Photo: Supplied Police raided the Mount Richon rental home after Mather arrived there and after he had met with a patched member of the Lone Wolf gang. As police officers made their way to the back of the property, they saw Mather holding open the lid of the spa and emptying methamphetamine from plastic bags into it. Advertisement In doing so, he also spilled a quantity of the drug onto the ground next to the spa. Details of how police were able to extract large quantities of the drug from the spa water were revealed in court as the pair were sentenced. Police had intended to empty the entire contents of the spa - some 700 litres of water - into 25 large plastic containers. But the containers were only able to hold 595 litres, so only 595 litres of the spa water was tested. Police emptied the other 105 litres of remaining spa water onto the back lawn. ChemCentre specialists took samples from each of the 25 containers. The samples were tested and the concentration levels of methamphetamine in each one was determined. From those concentration levels, police were able to calculate the amount of meth in each of the 25 containers. The total amount of methamphetamine seized by police from the scene was 2.1 kg, including 1.7 kg from the spa water. The drugs had a street value of more than $2 million. Mather pleaded guilty to one count of possessing methamphetamine with intent to sell or supply. He was jailed for 13 years. Rowson was convicted after a trial of three offences relating to the seized drugs and weapons found in the home. He was jailed for 15 years. Judge <mark>Stephen Scott</mark> said he had to send a strong message to methamphetamine dealers who were fuelling the significant crime rate being committed by those who seek the drug .\" Those crimes being burglaries, robberies and significant gratuitous violence, \"Judge <mark>Scott</mark> said .\" The court does need to demonstrate, as best sentencing, a zero tolerance with respect to those who deal in this insidious drug. \"Both Rowson and Mather were made eligible for parole after 11 and 13 years respectively."}, {"articleID": "2009051517_00000148_W", "names": {"Larry Cox": ["Q15430381", "Q23054920", "Q6490131"]}, "date": "2009-05-15", "url": "http://yubanet.com/opinions/Amnesty-International-Obama-Breaks-Major-Campaign-Promise-as-Military-Commissions-Resume.php", "content": "amnesty international: obama breaks major campaign promise as military commissions resume human rights organization reiterates call for detainees to be tried in u.s. federal courts printer friendly page by: amnesty international washington may 15, 2009 - in response to president barack obama restarting the military commissions at the u.s.-controlled detention facility in guantanamo bay, amnesty international's executive director <mark>larry cox</mark> issued the following statement: \"president obama is reinstating the same deeply-flawed military commissions that in june 2008 he called an\" enormous failure .' in one swift move, obama both backtracks on a major campaign promise to change the way the united states fights terrorism and undermines the nation's core respect for the rule of law by sacrificing due process for political expediency. \"whatever revisions the obama administration has made to the commissions do not change the fact that the commissions do not provide an adequate standard of justice for the detainees nor the victims of terrorism--they merely mock the u.s. constitution, international laws and undermine fundamental human rights standards .\" what happened to president obama's confidence in the u.s. justice system's ability to try detainees? he himself said that \"we need not throw away 200 years of american jurisprudence while we fight terrorism .'\" u.s. federal courts are a perfectly sound system to try any and all detainees. they have brought other terror suspects to justice, and there is no reason why these courts cannot continue to do the same. \"amnesty international is a nobel peace prize-winning grassroots activist organization with more than 2.2 million supporters, activists and volunteers in more than 150 countries campaigning for human rights worldwide. the organization investigates and exposes abuses, educates and mobilizes the public, and works to protect people wherever justice, freedom, truth and dignity are denied. amnesty international: obama breaks major campaign promise as military commissions resume constitution project: president obama to revive flawed military commissions doug peacock: yellowstone's grizzly bears face threats on two fronts andy borowitz: palin-prejean alliance predicted in book of revelations"}, {"articleID": "2017082813_00703680_W", "names": {"Greg Abbott": ["Q5605224", "Q5605225"]}, "date": "2017-08-28", "url": "https://www.texastribune.org/2017/08/28/federal-official-texas-needs-help-finding-new-normal-hurricane-afterma/", "content": "WASHINGTON--Officials leading the federal Hurricane Harvey relief operation emphatically called on all Americans to support rescue efforts in Southeast Texas. \"Helping Texas overcome this disaster is going to be far greater than FEMA coordinating the mission of the entire federal government,\" Federal Emergency Management Agency Director Brock Long said at a Monday morning news conference. \"We need citizens to be involved. This is a landmark event. We have not seen an event like this. You could not...dream this forecast up .\" Long said he planned to travel to Corpus Christi and San Antonio on Monday morning to be with Gov. <mark>Greg Abbott</mark>. Long refused to criticize the decision of Houston-area leaders to direct constituents to stay put, rather than evacuate. \"I believe that every local official, state official and including us, are operating with the best information we've been provided at the time,\" Long said. The Texas Tribune thanks its sponsors. Become one. \"We will strive to get better, but right now guys, it's not a time to start pointing blame,\" he added. A federal official at the news conference said that President Donald Trump still planned to visit the state on Tuesday. Long offered guidance to Texans: People in the flooded regions should not get into their cars. That could put their lives at risk and drain resources that could be used to rescue citizens elsewhere. Those wanting to support relief efforts should visit the website National Voluntary Organization Active in Disaster. For those who need assistance, visit www.disasterassistance.gov. If a person does not have internet access, call 1-800-621-FEMA. The U.S. Army Corps of Engineers was working to restore electrical power to \"critical infrastructure .\" National Flood Insurance Program policy holders should \"call your insurance agent. Go ahead and start that ball rolling .\" Long called on Congress to reauthorize the federal flood insurance program but also suggested this was an opportunity for major reforms. But overall, his refrain on Monday morning was that while the government is coordinated in its response, this hurricane is a stunning natural disaster and has exceeded the federal government's capacity to help every Texan in need. \"We need the whole community, not only the federal government forces, but this is a whole community effort from all levels of government, and it's going to require all citizens to get involved,\" he said. The Texas Tribune thanks its sponsors. Become one. \"I'm asking for all citizens to get involved, here,\" he added. \"Donate your money, figure out how you can get involved as we help Texas find a new normal going forward after this devastating disaster .\" Long maintained the refrain from most federal officials working on the effort: Federal agencies are taking cues from local officials and aim to back up each rung of government as resources are expended. \"They set the mission priorities right now; we fall in line to support those,\" he added. Hide all comments Comment Policy The Texas Tribune is pleased to provide the opportunity for you to share your observations about this story. We encourage lively debate on the issues of the day, but we ask that you refrain from using profanity or other offensive speech, engaging in personal attacks or name-calling, posting advertising, or wandering away from the topic at hand. To comment, you must be a registered user of the Tribune, and your real name will be displayed. Thanks for taking time to offer your thoughts. You must be logged in to leave a comment. | Login | Sign Up Your Comment Read More Comments Related News Most Read Republish This Story Find out how you can put this story on your website. Be a citizen, not a spectator. Support independent, fact-based journalism. Donate to our 501 (c) (3) nonprofit newsroom. Donate today by visiting: texastribune.org/donate The Texas Tribune thanks its sponsors."}, {"articleID": "2013060516_00081766_W", "names": {"Paul Lambert": ["Q246724", "Q42306921", "Q47511367", "Q52134533", "Q7151926", "Q7151928", "Q7151929", "Q7151930"], "Simon Cowell": ["Q162629", "Q7518530"], "Ashley Westwood": ["Q10857014", "Q59428"], "Jeff Wood": ["Q6175285", "Q6175286", "Q6175287", "Q6175288", "Q6175782"], "Dean Smith": ["Q1181130", "Q1181132", "Q18171697", "Q202584", "Q5246469", "Q5246470", "Q5246471", "Q5246472", "Q5246473", "Q5246474"], "John Gorman": ["Q1700251", "Q6235810", "Q6235813", "Q6235815"], "Martin O'Neill": ["Q16733787", "Q310263"], "Tony Barton": ["Q30122079", "Q666255"]}, "date": "2013-06-05", "url": "http://www.birminghammail.co.uk/sport/football/football-news/aston-villa-special-feature-look-4051836", "content": "A lot of people believe that when a player is linked to a club this way that it is reality and a cert to happen when nothing could be further from the truth. \"City turns back the clock at Birmingham Museum and Art Gallery Echoes exhibition at Birmingham Museum and Art Gallery celebrates the city's diverse recent history. In an age where the economy is leaving most of us with little cash to splash, it's only right to expect to get value for money .\" Fionnuala Bourke on J-Lo's saucy outfit and candles that smell of bacon! Jobs Search for jobs in the Midlands Motors Find new & used cars for sale Property Buying, Selling or Renting? Directory Search our local business directory Family Notices View latest announcements online Mail Cashback Earn cashback on your everyday shopping Dating Looking for a date in Birmingham? BuySell Buy or sell 1000s of new and used items Birmingham Mail The best of the Birmingham Mail in your Facebook feed @ birminghammail The latest Birmingham news, sport, weather and events @ BCFC_News The Birmingham Mail provides the best online coverage of Birmingham City FC @ AVFC_News Aston Villa FC news updated around the clock from the Birmingham Mail @ bhamcommunities Localised community news from your area News A daily bulletin of the best Midlands news Comments Special feature: A closer look at Ian Culverhouse effect \"My assistant boss Ian Culverhouse has a real eye for a player. If he reckons we should go for someone I will back his judgement 100 per cent .\" As <mark>Paul Lambert</mark> plots the next phase of Villa's recruitment he can rely on a talent-spotter who puts <mark>Simon Cowell</mark> and Co to shame. <mark>Lambert</mark> uses Culverhouse as a sounding board for all transfer transactions and the right-hand man has an impressive track record for identifying potential signings, too. During their seven-year association at Wycombe, Colchester, Norwich and now Villa, Culverhouse has alerted <mark>Lambert</mark> to a host of promising players, who the Scottish boss has subsequently signed. <mark>Ashley Westwood</mark> is one such example, with Culverhouse spotting very early the ability the former Crewe midfielder is now showcasing on the Premier League stage. \"I remember Ian saying a few years back\" there's a lad at Crewe you should keep your eye on'. <mark>Ashley</mark> has been fantastic for us. \"It is not just player recruitment where <mark>Lambert</mark> trusts Culverhouse implicitly - their entire football philosophy has been in sync since teaming up at Wycombe in 2006. Culverhouse was a youth coach at Adams Park then, having made more moves during his fledgling coaching career than the loyal Norwich stalwart did during his playing days. Regarded as a Canaries legend for his part in their early 1990s heyday, the full-back-turned-sweeper spent almost a decade there, helping them challenge towards the top of the top-flight table and embark on a UEFA Cup adventure, including a famous victory over Bayern Munich. The former Tottenham trainee left to join Swindon in 1994, spent four years at the County Ground and then went to Brighton, where he hung up his playing boots in 2000. Seagulls boss <mark>Jeff Wood</mark> gave him his first taste of coaching with a backroom role and Culverhouse later returned the favour by recruiting him as Norwich's goalkeeping coach. After leaving Brighton, Culverhouse coached at Barnet and Leyton Orient, progressing to assistant manager under John Still and Martin Ling .\" Ian was an excellent coach but things broke down on a personal front between us, \"explained Ling, who replaced Culverhouse with <mark>Dean Smith</mark> - now Walsall manager - in August 2005. Culverhouse was snapped up by Wycome boss <mark>John Gorman</mark>, initially in a youth team capacity and continued in that post when <mark>Lambert</mark> took charge of the Chairboys in August 2006. Soon Culverhouse found a kindred spirit in <mark>Lambert</mark>, who elevated him to a first-team role. The pair have never looked back since. Through Culverhouse's experiences at Norwich and <mark>Lambert</mark>'s at Borussia Dortmund, the duo developed a philosophy based around a strong team ethic and giving unknown players a chance to shine. <mark>Lambert</mark> took Culverhouse to Colchester as his assistant in October 2008 and again to Norwich less than a year later. They inspired a rapid rise from League One lowliness to Premier League mid-table comfort. Culverhouse is trusted to take the lead in the Bodymoor Heath training sessions. Their rapport allows <mark>Lambert</mark> to get his ideas across to the squad, but still maintain a distance - an approach he picked up from managerial mentor and former Villa boss <mark>Martin O'Neill</mark>.\" One of the things the gaffer told me was \"don't let them hear your voice all the time every day because you'll want them to hear it and listen to it on Saturday\" ', said <mark>Lambert</mark> \"So at training Ian does the sessions and I walk around and tell the players if I don't think the standard is what it should be .\" Villa know all about assistant managers going out on their own as bosses from their European Cup triumph under <mark>Tony Barton</mark> in 1982 But while Culverhouse's brother David has dabbled with non-league management, the former right-back has previously spoken of his satisfaction at staying as a No. 2 for now. \"I'm quite happy with what I'm doing. I suppose it's something you'd like to do, to test yourself as No. 1 .\" said Culverhouse. \"But the freedom I get now is good enough for me. <mark>Paul</mark> and I have had a successful relationship, so it's not something I'm thinking about at the moment .\" Their close bond was evident when <mark>Lambert</mark> jumped on Culverhouse with a jubilant piggy-back celebration during the win over QPR, and the manager had no qualms about putting his No. 2 in charge when he served a touchline ban against Arsenal. So as Villa embark on another busy summer it is no surprise to learn <mark>Lambert</mark> once described Culverhouse as one of the best signings he has ever made. \"With the quality of the coaching, Ian has been equally as important as anybody who has ever played under me,\" beamed <mark>Lambert</mark>. \"I'm grateful to have such a good assistant. <mark>Lambert</mark> was pleased a dramatic upturn in form and fortunes guided Villa to Premier League safety during a testing first campaign at the club. Special feature: Twenty years ago Villa went to United with the same ambitions Darts Diary with Alan Towe: Sheldon chief Alan has a Jubilee celebration Patients suffer 12-hour A & E wait as three NHS trusts running Birmingham hospitals miss targets Contact us Got a story in your area? Is there something happening in your area you would like us to report on? 0121? 234? 5536 / 5564 Postal Address BPM Media (Midlands) Floor 6, Fort Dunlop, Fort Parkway, Contacts Newsdesk 0121? 234? 5536 / 5564 Head of Web: Anna Jeys 0121? 234? 5280 Photosales: Patricia O'Gorman 0121? 234? 5450 Competitions and promotions: 0121? 234? 5707 Organised a special event? Tell us about it and, if possible, send us a picture Postal Address BPM Media (Midlands) Floor 6, Fort Dunlop, Fort Parkway, Birmingham, B24 9FF Advertise with the Birmingham Mail We reach over 784,967 * unique users a month with dedicated coverage of Birmingham and the West Midlands. Over 66% of our visitors, who view over 4m * page impressions every month, are in the desirable ABC1 socio-economic groups. To book an advert with the Birmingham Mail team call 0121? 234? 5000, email Trinity Mirror Midlands, offering you unique access to our audience across the region online and in print. * Source: Omniture (UK 6 month average Jan-Jun 12) / Survey Interactive 09 Editor, Birmingham Mail Editor-in-Chief, Trinity Mirror Midlands A born and bred Brummie, David was appointed editor of the Birmingham Mail in November 2009. He has over 30 years experience as a journalist in the West Midlands including editorships on the Coventry Telegraph and Sunday Mercury. Chris Lepkowski West Bromwich Albion reporter"}, {"articleID": "2009101021_00000258_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Marvin Sapp": ["Q4008540", "Q6778477"]}, "date": "2009-10-10", "url": "http://examiner.com/a-2261119~Missouri_gospel_group_gains_fans.html?cid=rss-Missouri_Headlines", "content": "for nearly four hours, about 7,000 people, almost all of them african-american, made a joyful noise unto the lord singing along with gospel classics, cheering on their favorite choir and praising god. st. louis regional finals for \"how sweet the sound: the search for the best church choir in verizon wireless as a straight-forward competition among eight local church choirs. but by the end of the night, contestants and audience members alike had participated in a powerful, if heartbreakingly brief, moment of racial harmony. racism has been a nasty undercurrent in plenty of national and local debates over the last six months. many commentators, including former and despite backtracking by police who first floated the theory, many who have watched the videotape are convinced that a recent attack on a white gospel music itself was founded within an institution that embodied evil the american slave trade. for generations, african-americans have stayed in touch with their past through their churches, transforming a distinct style of musical worship from harrowing history into celebration .\" african-americans have a way of delivering a song with a certain spirit, \"said anita watkins stevens, director of music ministries at new sunny mount missionary baptist church in north st. louis .\" for us, it's not a performance, but the essence of what we are. \"stevens leads new sunny mount's choir, which came into the contest at scottrade as the defending champion. last year, its choir won the overall prize and went on to compete in the national finals in atlanta .\" how sweet the sound \"organizers asked choirs from across the country to audition via a dvd performance. judges chose eight choirs four of 35 members or fewer, and four of 36 members and up to perform. during the regional contests, each choir sings one song, and a panel of three judges chooses the best small choir, the best large choir and an overall winner in each region. there's also a people's choice winner, selected by text messages from the audience. of the eight choirs competing, three were mostly white. and one after another, they sang traditionally african-american gospel songs in an african-american style, surprising and delighting the crowd and judges. but it was the choir from festus that brought the audience to its feet. most of the choirs performed wearing colorful choir robes. one was costumed in traditional african garb. all 75 faith baptist choir members walked onstage in either a black cocktail dress or a tuxedo. choir director <mark>michael</mark> nickelson wore black tails. all night, there had been an aura of insider knowledge to\" how sweet the sound. \"the judges included the rev. <mark>marvin sapp</mark>, a dorinda clark cole. this was an audience that knew gospel music, and that made nickelson and some choir members nervous. jenny horn said later. nickelson said he thought his choir\" might look like a bunch of wannabes. \"\"i didn't want to be a white choir trying to be a black choir,\" he added. the choir began slowly and quietly, harmonizing a gospel classic, andrae crouch's \"soon and very soon .\" then, at the beginning of the second verse, nickelson shed his tails, tossing his coat stage left, just as the choir picked up the tempo. he was in the zone, employing a time-honored african-american choir director tradition of using his entire body to guide his band and singers. he kicked his legs as he summoned certain notes. a mimed pujols-like swing of his arms was a signal for more volume. he may have attempted a moon walk. the crowd roared its approval. choir members got into the spirit, too, clapping and moving their bodies to the music. when faith baptist finished, a standing ovation was unnecessary. audience members were already on their feet. the judges seemed equally amazed. \"i have never seen a white brother move like that,\" said cole, speaking of nickelson's performance. dwight stone, a dj from 100.3 the beat (katz-fm). \"that sounded like it was straight out of calif. nickelson said later that faith baptist's audition dvd was nothing like its performance. the choir's musical style is typical of large contemporary christian evangelical churches an up-tempo, soft-rock feel. nickelson said he realized his choir's version of the famous song needed more life. he wasn't sure how to achieve that, but then, in the weeks before the competition, nickelson saw something he thought could help. while watching <mark>michael jackson</mark>'s memorial service, he noticed that as the singer's casket was brought into the staples center, a choir sang\" soon and very soon. \"\"they started slow and built the tempo up to the third verse,\" nickelson said. \"i thought,\" we've got to try that .' \"<mark>marvin sapp</mark> said faith baptist's performance\" caught me off guard. \"thirty hours after their big win, faith baptist choir members gathered in their sanctuary, this time wearing red shirts and jeans. it was 5:30 on a wednesday morning, and a ksdk (channel 5) crew had come to festus to shoot a few songs for its morning show. in between songs, choir members said the enthusiasm of the audience had moved them .\" it felt very surreal and like a dream, \"horn said .\" i've never felt so encouraged, welcomed and loved by a large group. \"choir members said the crowd reaction was the biggest honor of their night .\" if it hadn't been for that audience, we wouldn't have performed the way we did, \"said tracy vittoe. ultimately, though, choir members credited a larger force for their win .\" music has that power to cross barriers, \"said patty colbertson .\" it didn't matter what color we were or what color the audience was, faith and music brought us together. \"copyright 2009 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2018071320_00036638_W", "names": {"Amina Mohamed": ["Q23809287", "Q4746345"]}, "date": "2018-07-13", "url": "http://www.the-star.co.ke/news/2018/07/14/policy-requires-ecde-tutors-to-hold-diplomas_c1786701", "content": "Policy requires ECDE tutors to hold diplomas Jul. 14, 2018, 12:30 am By LEWIS NYAUNDI @ xnyaundih Education CS <mark>Amina Mohamed</mark> and TSC CEO Nancy Macharia after a meeting with Parliamentary committee on Education on recruitment of teachers in the country. April 10, 2018. Photo/Jack Owuor Early childhood development and education teachers will be required to hold diplomas once a draft policy comes into force. A draft framework to guide the scheme of service in the sector states that the teachers will have to undergo two-and-a-half-year training, while assistant teachers will be required to have certificate qualification. The scheme was developed by the Council of Governors, the Teachers Service Commission, the Ministry of Education and the Salaries and Renumeration Commission in conjunction with Unicef. Upon employment, the teachers will have a chance to move up the promotion ladder in six grades. The scheme also allows bachelor degree holders to compete for administrative roles currently reserved for P1 teachers. The framework has yet to be launched as the sector players await the approval of the ECDE Bill of 2014. On Thursday, Council of Governors education committee chairman Paul Chepkwony (Kericho) said the main problem hampering proper facilitation of ECDE education is inadequate funding from the Exchequer. \"The CoG is lobbying for more funds from the national government to support the sector. It has not been the most successful sector in the country because it is highly underfunded,\" he said. Chepkwony spoke during a joint meeting of ECDE teachers, the Kenya Institute of Curriculum Development and other players. He said the scheme seeks to harmonise salaries to reduce pay disparityies among the counties. Education CS <mark>Amina Mohamed</mark> said the government is finalising quality standard guidelines, the national pre-primary education policy, the national competence-based assessment tool and review of teacher education curriculum. Kenya Publishers' Association chairman Lawrence Njagi raised concerns over misleading teaching materials for ECDE. He said unapproved materials hurt education quality. He cited charts with wrong sounds mismatched with letters."}, {"articleID": "2013123002_00055443_W", "names": {"Kyle Smith": ["Q11863385", "Q15043215", "Q24005542", "Q26837179", "Q6451443", "Q6451444"]}, "date": "2013-12-29", "url": "http://www.wnd.com/2013/12/navy-seals-humiliated-by-political-correctness/", "content": "WND Exclusive: N.Y. Times serves up baloney on Benghazi WND Exclusive: Obamacare used to elevate \"gay' lifestyle WND Exclusive: Spy vs. spy: 2 famous defectors on Russian super-deception WND Exclusive: Ordinance challenged for targeting pro-lifers WND Exclusive: No place to hide from Jesus in this city WND Exclusive: Theologian:\" Brain-dead' doesn't really count WND Exclusive: U.S. slams \"conservative gender norms' WND Exclusive: Obama's NSA watchdog:\" Reasonable' to track cars WND Exclusive: Duck Commander's faith persuades A & E to back down Navy SEALS humiliated by political correctness The night of Sept. 1, 2009, Echo Platoon of Navy SEAL Team 10 headed out into the Fallujah night. Their goal: concluding a five-year search for the al Qaeda killer who had been responsible for the shocking 2004 murders of four American military contractors - one of them an ex-SEAL - whose bodies were then burned, dragged through the streets and hanged from a bridge. This night the SEALs departed with these words from their commanding officer: \"Gents, stay sharp, and expect a firefight .\" In the event, no shots were fired, but the SEALs faced another kind of ambush: a humiliating, baffling, infuriating struggle with the military-justice system that would end with an unsatisfying victory. (Rate this) meta itemprop = \"description\" content = \"(NEW YORK POST) By <mark>Kyle Smith</mark> The night of Sept. 1, 2009, Echo Platoon of Navy SEAL Team 10 headed out into the Fallujah night. Their goal: concluding a five-year search for the al Qaeda killer...\"> div style =\" display: none; \"itemprop =\" aggregateRating \"itemscope itemtype =\" http: //schema.org/AggregateRating \">"}]