[{"articleID": "2012032904_00011792_W", "names": {"Joe Adams": ["Q18612493", "Q27915185", "Q3179959"]}, "date": "2012-03-29", "url": "http://istockanalyst.com/article/viewarticle/articleid/5753208", "content": "u.s. stocks retreat as commodities slump; hot stocks: (pnr, tyc, amat, rht, amln, josb) box brings new mobile and social capabilities to the post-pc era enterprise san francisco, ca--(marketwire)--03/28/12--box today announced major social and mobile updates designed to better connect people, applications and information in the enterprise. before an audience of hundreds of customers at box world tour san francisco, the company unveiled all-new social workflow features to enhance engagement on box, along with box onecloud, the first mobile enterprise platform to unify business information. box is working with leading global systems integrators like deloitte to bring a new level of mobile, social, and cloud services to enterprise clients. \"the massive fragmentation of apps and data that organizations are experiencing in the post-pc world is antithetical to the promise of the cloud,\" said aaron levie, co-founder and ceo of box. \"we're giving enterprises the power to manage and secure critical information in the cloud, while making it easy for employees to take advantage of the bleeding edge of social and mobile collaboration.\" more than 120,000 businesses, including 82% of the fortune 500, use box to share and manage information online and from mobile devices. with 200 million files accessed each month, finding innovative ways to connect people and content on box is critical. box's all-new social workflow features enable fluid collaboration capabilities that reflect the fast-moving, dynamic nature of today's organizations. updates include: assign tasks to colleagues directly within the comment stream mention (or \"tag\" ) a collaborator within a comment in order to automatically send them an email notification respond to comments via email by responding directly to an email notification alert edit content directly from the file preview page using native applications, with revisions automatically saved back to box the new social workflow features will be available to all box users in the coming weeks. to see these new features in action, visit the corresponding blog post. extending the ecosystem as the world's largest enterprises navigate the transition to the cloud, they're turning to trusted systems integrators and service providers in business and technology consulting. box announced that it is working with deloitte to help businesses recognize the benefits of box's collaboration and mobile cloud services. \"enterprises increasingly see cloud computing as an opportunity to gain flexibility and enhance their competitive capabilities,\" said chris weitz, director, cloud computing services, deloitte consulting llp. \"we are excited to work with box to help our respective clients address their mobility and cloud delivery challenges.\" uniting information with onecloud box also announced the launch of box onecloud, the first mobile cloud for the post-pc era enterprise. box onecloud provides a suite of more than 30 powerful, easily discovered productivity applications that enable workers to securely access, edit and share content from their mobile device. available immediately on ios for all users, box onecloud applications are deeply integrated with box's content platform, and can be viewed on a mobile gallery directly within the box apps for iphone and ipad. premier app integrations include quickoffice, paperport, echosign and pdf expert. to learn more about box, visit www.box.com. post comment--login is required to post message iij announces appointment of three new executive officers and promotion of two executive officers arkansas' <mark>joe adams</mark> to receive \"the jet\" return specialist award box brings new mobile and social capabilities to the post-pc era enterprise zacks investment research, and commentary, news and press releases provided by yellowbrix and quotemedia. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. istockanalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. the blog articles are opinions by respective blogger. by using this site you are agreeing to terms and conditions posted on respective bloggers' website. the postings/comments on the site may or may not be from reliable sources. neither istockanalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. you are solely responsible for the investment decisions made by you and the consequences resulting therefrom. by accessing the istockanalyst.com site, you agree not to redistribute the information found therein. we prefer not to publish articles related to otcbb or pink sheet securities. we do not accept articles containing offesive language, racial remarks, sex / pornography beyond the requirement of the story."}, {"articleID": "2017060922_00548935_W", "names": {"Mike Evans": ["Q14951064", "Q1621683", "Q25189874", "Q6846717", "Q6846719"], "Richard Sherman": ["Q16205086", "Q2947411"], "Justin Evans": ["Q15975248", "Q30122523", "Q6317576"], "Vincent Jackson": ["Q204172", "Q4013045"]}, "date": "2017-06-09", "url": "http://web.tampabay.com/sports/football/bucs/why-bucs-receiver-mike-evans-is-feeling-older/2326809", "content": "TAMPA--Last week, while explaining a play against the Seattle Seahawks last year, Bucs receiver <mark>Mike Evans</mark> dropped a throwaway line about Seahawks cornerback <mark>Richard Sherman</mark>. Related News/Archive Bucs want to make <mark>Mike Evans</mark> \"Buc for life' 2 Months Ago The next step Bucs' <mark>Mike Evans</mark> knows he needs to take 1 Month Ago Bucs grab safety <mark>Justin Evans</mark> in second round, receiver Chris Godwin in third 1 Month Ago\" Even though we're close in age, he's had a few more years than me in the league. \"They're not that close in age. <mark>Sherman</mark> is 29 years old; <mark>Evans</mark> is just 23. When the Buccaneers selected <mark>Evans</mark> in 2014, he was among the youngest players in the league. Last season, the former Texas A & M receiver was still younger than many 2016 rookies. But <mark>Evans</mark> is feeling like a veteran, and it isn't simply his three years of leading the Bucss in receiving yards and touchdowns (he's 1,440 yards and seven touchdowns from the team record in both categories). It's his status within the team. With the departure of <mark>Vincent Jackson</mark> this offseason, <mark>Evans</mark> has become a relative veteran compared to rookie and third year receivers Chris Godwin and Adam Humphries or the similarly young tight end group. While DeSean Jackson adds experience from his nine seasons combined in Philadelphia and Washington, <mark>Evans</mark> said he's always felt like a leader.\" I was a leader since I've been here, \"<mark>Evans</mark> said.\" First along with [<mark>Vincent Jackson</mark>], and then when he went down this year I was able to lead the guys and that's carried over without him. They're older than me, but I've got a lot of experience. We've got a lot of capable guys and it's been fun. \"That leadership starts with the fact that he's even at One Buc Place during voluntary OTAs. Every team hopes for full attendance, but a star player approaching the end of their rookie contract might just be the type to wait it out. Yet there was <mark>Evans</mark>, making a trademark high-point catch from a Jameis Winston catch for a touchdown Thursday and throwing down a powerful dunk over the goal posts to celebrate. <mark>Evans</mark> said he values the importance of organized team activities (OTAs) at his position too much to miss.\" Receivers and quarterbacks can get a lot more out of OTAs than other positions, \"<mark>Evans</mark> said.\" They can't use their pads, but we can run routes and get the timing right, which is really important. \"It wasn't simply other receivers watching <mark>Evans</mark> Thursday in practice. Orlando-born boxer Erickson Lubin--formerly the world's No. 1-ranked junior middleweight before turning professional last year--was in attendance, too. <mark>Evans</mark>, a boxing fan and a fan of Lubin in particular, said he specifically wanted to meet the 21-year-old fighter, while Lubin said he was a fan of <mark>Evans</mark> both on and off the field.\" I love his personality, \"Lubin said.\" He has a great personality. He's a welcoming person. And he's a fighter, just like I am. He goes out and gives his all every game. He told me that he's a big fan of me, and I'm a big fan of him. \"Within a season's reach of the franchise's key receiving records and with a major contract likely on the way, perhaps <mark>Evans</mark> could be forgiven for focusing on his own stats. But with Jameis Winston possessing a greater array of weapons in 2017 than ever before, <mark>Evans</mark>' goals for the year are team-focused.\" If I catch zero passes but we win the Super Bowl, I wouldn't have a problem. \""}, {"articleID": "2018021418_00227529_W", "names": {"Ray Allen": ["Q208623", "Q2438891"], "John Peck": ["Q16731792", "Q20890188", "Q6252402"]}, "date": "2018-02-14", "url": "http://www.tribdem.com/news/prosecution-rests-in-capital-murder-trial-shetler-s-girlfriend-claims/article_9ee56926-11b4-11e8-8f8d-cb20f0ccbbcc.html", "content": "Prosecution rests in capital murder trial; Shetler's girlfriend claims defendant \"tried to surrender' David Hurst 13 min ago <mark>Ray Allen</mark> Shetler arrives at the scene of the fatal shooting of St. Clair Township police Officer Lloyd Reed Jr. on Friday, Feb. 9, 2018. tberkey @ tribdem.com GREENSBURG--The New Florence man accused in a St. Clair Township officer's murder lifted his hands to surrender--and then was shot anyway, his girlfriend testified Wednesday. Kristin Luther, the woman who called for police that night following a fight with <mark>Ray</mark> Shetler, said her boyfriend had his rifle slung over his shoulder until after officer Lloyd Reed Jr. opened fire several times. Once Shetler was struck, it knocked his hunting rifle\" right into his hands \"and he reacted while trying to escape, she said.\" Once he was shot...he just started aimlessly shooting from his waist, \"Luther testified, saying he wasn't aiming at Reed. Luther spent well over an hour on the witness stand as the opening witness for Shetler's defense, after a morning that saw the Westmoreland County District Attorney's Office rest its case against the New Florence man. Prosecutors' final witness assisted investigators during their reconstruction efforts in the days following the Nov. 28, 2015, shooting. Longtime FBI Special Agent Michael Hochrein said he processed and mapped\" thousands of different points \"in the area surrounding Luther's home, areas where shell casings fell and bullets struck trees and other objects to map out the gunfight scene. Bullet impact points, holes and other evidence were used to determine the path Shetler's .270 rounds traveled, leading Hochrein to dispute statements that at 6 foot tall, Shetler was firing\" from the hip. \"A round that struck Reed hit him horizontally across his chest, not an upward motion, he said. And it damaged a tree in a horizontal path as well--at more than 5 feet 4 inches above the ground, he told jurors. Through his attorney, Shetler has admitted firing the shot that killed Reed, 54. But while statements he has apparently made to state police, paramedics and others have varied about what led to the exchange, the New Florence man has said several times that he reacted to gunfire that night by firing with his rifle held low. Luther made the same statement Wednesday, saying she remembered it clearly, even after District Attorney <mark>John Peck</mark> reminded her about Hochrein's findings. <mark>Peck</mark> responded soon after by noting that she once told Shetler she would\" do anything for him \"and hoped to marry the man. Luther agreed.\" I would do anything...to help him, \"she said.\" But not lie. \"Wednesday is the fifth day of Shetler's trial. If convicted of first-degree murder, his most serious offense, a second phase of the trial would be held to determine if he should face the death penalty. Testimony in the case is expected to continue Wednesday afternoon. Check back for additional information on this developing story. David Hurst is a reporter for The Tribune-Democrat. He can be reached at (814) 532-5053. Follow him on Twitter @ TDDavidHurst and Instagram @ TDDavidHurst. Tags"}, {"articleID": "2016070809_00520710_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-08", "url": "http://naharnet.com/stories/en/212762-us-state-department-to-reopen-clinton-emails-probe", "content": "Tweet The US State Department said Thursday it will reopen its internal investigation into whether Democratic White House hopeful Hillary Clinton's use of a private email account and server compromised her handling of classified material. \"We will aim to be as expeditious as possible, but we will not put artificial deadlines on the process,\" department spokesman <mark>John Kirby</mark> said, noting that the internal review could proceed now that the Justice Department investigation wrapped up with no charges filed against the former secretary of state. The FBI advised earlier in the week that no charges be brought over Clinton's use of a private email account and homebrew server during her time as secretary of state from 2009 to 2013, a recommendation that the Justice Department then followed. Although the announcement took a huge weight off the presumptive Democratic nominee, FBI chief James Comey nonetheless said Clinton and her staff were \"extremely careless in their handling of very sensitive, highly classified information.\" Republicans, including Clinton's White House rival <mark>Donald Trump</mark>, have cried foul over the lack of charges, alleging that Clinton's influence as a prominent politician helped her escape criminal proceedings. <mark>Trump</mark>, who polls show faces an uphill battle against Clinton in November, has repeatedly accused Clinton of masking her involvement in illegal activity by deleting more than 30,000 emails she claimed were personal and not related to her job as top US diplomat. On Thursday, Comey was forced to vigorously defend his recommendation before the House Committee on Oversight, which summoned him to testify. Despite tense moments, Comey, a Republican former prosecutor, maintained his cool throughout the marathon grilling that lasted four hours and 40 minutes. Although <mark>Kirby</mark> declined to provide specific information about the State Department's latest review, he said it would aim to be \"as transparent as possible about our results, while complying with our various legal obligations.\" Of some 30,000 emails Clinton turned over to the FBI, Comey said 110 contained classified information--Clinton had said none was classified at the time they were sent. Another 2,000 emails were later \"up-classified\" to confidential."}, {"articleID": "2011123017_00011822_W", "names": {"Larry Edwards": ["Q27830862", "Q6490247"]}, "date": "2011-12-30", "url": "http://examiner.com/event-recipes-in-national/celebrating-kwanzaa-with-chef-larry-edwards-african-curried-beef", "content": "if you really want to look at the roots of american cooking, you need look no further than the dishes and recipes brought to this country via the slaves. the fact of the matter is, american cooking is simply a bastardization of african cooking. this is not a bad thing as anyone who has studied the culinary arts will attest, the cuisines of africa are indeed truly special. as we celebrate the holiday of kwanzaa, let me share with you some of my favorite dishes native to africa. long before there were trade routes between the america's and the far east, there was a trade route between africa and and countries around india. this trade route was across the arabian sea and this is how curry made its way to africa. with accute culinary minds, the tribal cooks of africa used this curry to accentuate their native food. when slavery began, they brought curry to america. one of the reasons why african cuisine is a favorite of mine is due to the simple fact that most african dishes are a perfect marriage of taste and texture. this curry dish proves my point. only the genius of the african culinary mind would think of pairing the pungent and spiciness of curry with the natural sweetness of fruit. advertisement african curried beef may be the first curry dish ever made in america. due to the rather bland tastes of american cooking at the time of its introduction, i'm sure it was not a big hit. this recipe has been adapted for both modern times and the modern kitchen but the taste is the same as it was back then. ingredients needed to make african curried beef (serves 4): 1 cup dry breadcrumbs 1 cup milk 5 eggs, beaten 2 tbs. butter 2 pounds ground beef 1 yellow onion, chopped 1 bosc pear, peeled, cored and chopped 4 cloves garlic, minced 2 tbs. curry powder 1 tbs. grated lemon zest 3 tbs. lemon juice? cup slivered almonds? cup chopped dried apricots 1 tsp. salt? tsp. cayenne pepper? cup whipping cream 4 bay leaves steps: pre-heat oven to 350. lightly oil a 9x13 baking dish. in a large bowl stir together the breadcrumbs, milk and 1 egg. set the bowl aside. in a medium saut? pan or skillet melt the butter over medium heat. add the ground beef, onion and pear and cook 10 minutes. stir in the garlic, curry powder, lemon zest, lemon juice, almonds, apricots, salt and cayenne pepper and cook 5 minutes. remove the pan from the heat. spoon the meat mixture into the breadcrumbs and combine. spoon the beef into the prepared baking dish and lay the bay leaves atop. in a medium bowl whisk together the remaining eggs and cream until smooth. pour this mixture over the meat. place in oven and bake 50 minutes before serving. ** inside google calls chef <mark>larry edwards</mark> \"quite possibly the most popular chef in the world\" and now you can find out what chef <mark>larry edwards</mark> has coming up in the kitchen, on the road, in the restaurants and in the media by joining him on facebook where the chef's snarky personality and often controversial comments are always sure to cause a stir!"}, {"articleID": "2011051821_00021158_W", "names": {"Helen Alexander": ["Q20090888", "Q43393812"]}, "date": "2011-05-18", "url": "http://chroniclelive.co.uk/north-east-news/uk-and-world-news/2011/05/18/no-blinking-on-deficit-says-clegg-84229-28721396/", "content": "there must be \"no blinking\" on the government's programme of deficit reduction, deputy prime minister nick clegg has said, insisting the shared agenda of cutting debt is the \"glue which binds this coalition together\" . the liberal democrat leader, who has faced grassroots discontent over the scale of spending cuts in the wake of his party's poor showing in this month's elections, insisted the government must \"hold our nerve\" and press ahead with its plans to restore economic stability. but he risked ruffling feathers among his conservative coalition partners by appearing to trace the origins of the 2008 financial crisis to margaret thatcher's administration of the 1980s. calling for a \"new, liberal economy\" with a focus on investment and stability rather than speculation and debt, mr clegg said that it is time to \"turn the page on...an era that began with a big bang and ended with a monumental crash\" . the big bang was the popular name for lady thatcher's 1986 deregulation of the markets, which opened the way for massive growth in the city of london's financial sector. speaking to the cbi in london, mr clegg called for a move away from the short-termist debt-driven economy of recent decades and towards a \"less spectacular\" but \"more prosperous and more profitable\" future. he said: \"the economy is out of the danger zone. but we need to hold our nerve. that means no blinking on deficit reduction. the government has a plan to restore stability and we will stick to it.\" liberal democrats and conservatives \"may differ on the nature and shape of the state, but we agree its finances must be sound,\" mr clegg said. \"tackling deficit is a necessary response to an immediate emergency. it is the glue that binds this coalition together.\" cbi president <mark>helen alexander</mark> told the dinner that the government's intentions had been \"good\" but it was \"taking too long to get there\" . chroniclelive, the evening chronicle newspaper online. latest newcastle news, north east and national news. newcastle united, sunderland afc updates, videos, pics, forums. for our complaints procedure,"}, {"articleID": "2013050318_00045817_W", "names": {"Pat Baker": ["Q16105028", "Q7143202"], "Teresa Paiva": ["Q18857593", "Q42795317"]}, "date": "2013-05-03", "url": "http://www.bellinghamherald.com/2013/05/03/2993545/ri-now-10th-state-to-allow-gay.html#storylink=rss", "content": "PROVIDENCE, R.I. - Rhode Island has become the nation's 10th state to allow gay and lesbian couples to wed, after a 16-year effort to extend marriage rights in this heavily Roman Catholic state. Gays, lesbians, their friends and families erupted into cheers Thursday following a final 56-15 vote in the Rhode Island House, and then again an hour later when Gov. Lincoln Chafee signed the bill into law on the Statehouse steps. \"Democracy feels good, doesn't it?\" said House Speaker Gordon Fox, D-Providence, who is gay. Fox struggled to keep his composure as he addressed the crowd at the Statehouse, looking over at his longtime partner, Marcus LaFond. \"This tells me our relationship does matter. It means that we mean something.\" The first marriages will take place Aug. 1, when the new law takes effect. The day was bittersweet for Deborah Tevyaw, whose wife, state corrections officer <mark>Pat Baker</mark>, succumbed to lung cancer two years ago. Months before she died, <mark>Baker</mark>, relying on an oxygen tank, angrily told lawmakers that it was unfair that Tevyaw wasn't considered her wife in Rhode Island despite their marriage in Massachusetts. \"I'm ecstatic, but sad she's not here to see this,\" Tevyaw said. \"I'm sure she's watching, but she's not here next to me. Before she died, she told me,' I started this, and now I'm leaving it in your hands .' We worked hard for this. There were petitions, door knocking, phone calls. I think people decided,\" just let people be happy .' \"Once consigned to the political fringe, gay marriage advocates succeeded this year thanks to a sprawling lobbying effort that included support from organized labor leaders, religious clergy, leaders including Chafee and Providence Mayor Angel Taveras and hundreds of volunteers. Their efforts overcame the opposition of the Roman Catholic Church and lawmakers including Senate President <mark>Teresa Paiva</mark> Weed, who voted no but allowed the issue to come to a vote anyway. Supporters framed the issue as one of civil rights, arguing in daylong legislative hearings that gay and lesbian couples deserve the same rights and protections given to opposite-sex married couples. The Catholic Church was the most significant opponent, with Bishop Thomas Tobin urging lawmakers to defeat what he called an\" immoral and unnecessary \"change to traditional marriage law. On Thursday, Tobin repeated his opposition, writing in a letter to the state's Catholics that\" homosexual acts are...always sinful. \"\"Catholics should examine their consciences very carefully before deciding whether or not to endorse same-sex relationships or attend same-sex ceremonies,\" Tobin wrote. \"To do so might harm their relationship with God.\" The Rhode Island legislation states that religious institutions may set their own rules regarding who is eligible to marry within the faith and specifies that no religious leader is obligated to officiate at any marriage ceremony and no religious group is required to provide facilities or services related to a gay marriage. While ministers already cannot be forced to marry anyone, the exemption helped assuage concerns from some lawmakers that clergy could face lawsuits for abiding by their religious convictions. Under the new law, civil unions will no longer be available to same-sex couples as of Aug. 1, though the state would continue to recognize existing civil unions. Lawmakers approved civil unions two years ago, though few couples have sought them. The first marriages will take place Aug. 1, when the new law takes effect. Raymond Beausejour, 66, used to photograph weddings, but the gay North Providence man never expected he would have one himself. \"I've been waiting 32 years for this day, and I never thought it would come in my lifetime,\" said Beausejour, who has been with his partner for 32 years. \"For the first time in my life, I feel welcome in my own state.\" Delaware could be the next state to approve gay marriage. Legislation legalizing same-sex marriage has narrowly passed the Delaware House and now awaits a vote in the state Senate. Advocates in Rhode Island say that while they're proud the state is the 10th to legalize gay marriage, they expect other states to quickly follow as support for gay marriage grows around the country. According to polling experts at Gallup, 53 percent of Americans support giving gay and lesbian couples the right to marry, up from 27 percent in 1996. Rep. Frank Ferri, D-Warwick, who lobbied for gay marriage before becoming a lawmaker himself, recalled that years ago he asked a sitting lawmaker if he would consider supporting same-sex marriage. \"He said\" I'll pour gasoline on my head and light myself on fire before that bill passes,' \"Ferri recalled. That has changed, said Ferri, who is gay. Ferri said he hopes Fox can marry him and his partner on Aug. 1, which also happens to be the couple's 32nd anniversary.\" Today a dream has come true, \"he said.\" No more hiding in the shadows. No more being ashamed of who we are. \"ANALYST Lummi Natural Resources> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2009111203_00157486_W", "names": {"Shimon Peres": ["Q55277572", "Q57410"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2009-11-12", "url": "http://newkerala.com/nkfullnews-1-149033.html", "content": "world-news israel urges brazil to join mideast peace efforts brasilia, nov 12: visiting israeli president <mark>shimon peres</mark> has urged his brazilian counterpart luiz inacio lula da silva to join the middle east peace process. \"come, president, and light the light of peace in the middle east,\" <mark>peres</mark> told lula during a joint press conference here wednesday after a closed-door meeting. in response, lula said all countries in the region \"can count on brazil for the construction of an enduring peace, the positive repercussions of which will transcend the borders of the middle east and will benefit all mankind\" . the brazilian leader, however, said peace will not be possible \"without concessions\" and without a dialogue among all parties involved in the conflict. lula will also meet palestine leader <mark>mahmoud abbas</mark> and iranian president <mark>mahmoud</mark> admadinejad here next week. he defended his intention to speak with ahmadinejad in the face of criticism from opposition politicians and jewish organisations. the brazilian leader insisted that peace would only be achieved through \"dialogue with everyone\" ."}, {"articleID": "2015121016_00627103_W", "names": {"Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "John Mcmahon": ["Q27915237", "Q27915238", "Q6248117", "Q6248119", "Q6248121"]}, "date": "2015-12-10", "url": "http://stamfordadvocate.com/news/crime/article/For-police-shootings-reinforce-need-for-6687070.php", "content": "http: //www.stamfordadvocate.com/news/crime/article/For-police-shootings-reinforce-need-for-6687070.php For police, shootings reinforce need for military-style gear <mark>Michael</mark> Kunzelman, Associated Press Updated 10:39 pm, Wednesday, December 9, 2015 Photo: Charlie Riedel, AP Image 1of/2 Caption Close Image 1 of 2 FILE - In this Aug. 17, 2014 file photo, a law enforcement officer watches from an armored vehicle after a device was fired to disperse a crowd during a protest for <mark>Michael Brown</mark>, in Ferguson, Mo.. Law enforcement officials have lobbied to protect federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces, calling the equipment critical in this era of terror threats and the all-too-frequent mass shootings that demand a swift and effective response. FILE - In this Aug. 17, 2014 file photo, a law enforcement officer watches from an armored vehicle after a device was fired to disperse a crowd during a protest for <mark>Michael Brown</mark>, in Ferguson, Mo.. Law...more Photo: Charlie Riedel, AP Image 2 of 2 FILE - In this Wednesday, Aug. 13, 2014 file photo, protesters raise their hands in front of police atop an armored vehicle in Ferguson, Mo.. The use of such vehicles has raised an essential question: How much is too much for officers to use in policing American streets? Law enforcement officials have lobbied to protect federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces, calling the equipment critical in this era of terror threats and the all-too-frequent mass shootings that demand a swift and effective response. FILE - In this Wednesday, Aug. 13, 2014 file photo, protesters raise their hands in front of police atop an armored vehicle in Ferguson, Mo.. The use of such vehicles has raised an essential question: How much...more Photo: J.B. Forbes, AP For police, shootings reinforce need for military-style gear 1 / 2 Back to Gallery Backlash over the images of protesters in Ferguson, Missouri, clashing with officers in combat gear drove an ongoing national push to scale back the militarization of police--an effort that has mostly steamrolled over concerns among law enforcement that they're losing equipment they need. In the span of six days, police suddenly have a pair of poster cases for the use of military-style equipment: In San Bernardino, California last week, police officers deployed armored vehicles at the scene of a shootout with a married couple who had killed 14 people at a holiday party. Just days before the California attack, officers in Colorado Springs, Colorado, used armored vehicles to rescue people from the area around a Planned Parenthood clinic where a gunman killed three people, including an officer. It's too soon to say whether the California and Colorado cases will be enough to quiet calls for demilitarization, but they have brought back the essential question: How much is too much for officers to use in policing American streets? The scene in San Bernardino, captured live on television, showed officers in tactical gear using two armored trucks and an armored tractor equipped with a shield to box in the SUV carrying Syed Farook and his wife, Tashfeen Malik, after the shootout ended. The couple had fired 76 rounds but were countered by 380 rounds fired by officers, authorities said. \"This type of equipment is critical for us to protect our officers,\" San Bernardino County Sheriff <mark>John McMahon</mark> told The Associated Press. Colorado Springs relied on their armored personnel carrier and a second, bigger one belonging to the El Paso County Sheriff's Office to rescue the wounded and others in the line of fire during the Nov. 27 mass shooting there, Police Chief Pete Carey told council members Monday. The vehicles \"both sustained pretty severe damage as a result of that,\" Carey said. \"They took a lot of rounds.\" Missouri State Sen. Maria Chappelle-Nadal, whose district includes Ferguson, said it's difficult to compare the police tactics she has seen on television after the recent mass shootings with what she witnessed during the 2014 protests over the police killing of unarmed black teen <mark>Michael Brown</mark>. \"They're not the same at all,\" said Chappelle-Nadal, who said she was tear-gassed during the Ferguson riots. \"There's a distinction between national security and social and economic inequality.\" The gear that looked jarringly out of place in Ferguson can be essential tools for properly trained officers who know when they are appropriate to deploy, said Norm Stamper, a retired Seattle police chief who has become a prominent voice for restrained use of such equipment since his department's widely criticized handling of protests at the 1999 World Trade Organization meeting. \"It's also terribly important that the police not overreact to everyday situations by trotting that equipment out,\" he said. Fallout from Ferguson led to some restrictions on federal programs that have funneled billions of dollars in high-powered weapons and other military-style equipment to state and local police forces. In May, President Barack Obama ordered a halt in transferring certain types of surplus military equipment to law enforcement agencies enrolled in a popular Defense Department giveaway known as the 1033 program. More recently, federal officials have ordered departments to surrender some property already in their possession--most notably, vehicles with tracks, such as tanks. The moves have angered police officials, who say they're losing an affordable pipeline to equipment that can save lives. Several Republican congressmen and at least one U.S. senator also denounced the program changes in the wake of San Bernardino. \"As I watched the tragedy in San Bernardino unfold last week, I noticed the equipment that local and other law enforcement agents used to track and ultimately neutralize the murderers,\" U.S. Sen. Richard Shelby, R-Alabama, wrote in a letter to the president Monday. \"Like all Americans, I was glad to see that those local agents relied on ballistic armored vests, helmets, and vehicles to prevent injury and the loss of life to officers and the community they were protecting.\" The armored vehicles used in San Bernardino belong to a regional SWAT team, which was called in to safely remove the slain gunmen from their vehicle. The vehicles were purchased with a mix of Department of Homeland Security grant money and funds from a federal program that allows police to share proceeds from asset seizures, said Rialto Police Capt. Andrew Karol, whose department is part of the team. The same DHS grant program also allowed the El Paso County Sheriff's Office to acquire an armored vehicle used at the Planned Parenthood shooting. As of Tuesday, the Defense Department's Defense Logistics Agency has taken back 52 of 126 tracked armored vehicles, 46 of 138 grenade launchers and 556 of 1,820 bayonets it had ordered returned, according to agency spokeswoman Michelle McCaskill. In Oakland County, Michigan, Sheriff <mark>Michael</mark> Bouchard had to surrender a tracked armored vehicle along with about a dozen bayonets that his department used for funerals and honor guards. Bouchard said he traveled to Washington several times to meet with Obama administration officials when they were reviewing the programs. \"They had a preconceived notion and were going to drive to that destination with or without our consent,\" Bouchard said. \"The whole thing seems to be driven by perception and not reality.\" The California and Colorado shootings haven't softened activist Zaki Baruti's views on the perils of militarized police forces. Baruti said he was stunned to see camouflage-wearing officers atop armored vehicles point rifles at protesters during the marches he helped organize in Ferguson. \"It looked like we were in Iraq,\" he recalled. \"The looks on their faces were saying,\" Do something so we can use this .' \"Stamper, the retired Seattle chief, said the equipment itself isn't the problem.\" It's the misuse of the equipment, \"he said.\" I think, through mission creep, we have allowed almost anything to be identified as high risk. If almost anything looks like a nail, you're going to bring out a hammer. \"___ Kunzelman reported from Baton Rouge, Louisiana. Follow him on Twitter at https: //twitter.com/Kunzelman75. His work can be found at http: //bigstory.ap.org/content/michael-kunzelman. Associated Press writer Sadie Gurman in Denver contributed to this report. Follow her at https: //twitter.com/sgurman. Her work can be found at http: //bigstory.ap.org/journalist/sadie-gurman. View Comments & copy; 2015 Hearst Communications, Inc. ."}, {"articleID": "2017113006_00318280_W", "names": {"Hans Mulder": ["Q15059161", "Q25702"], "John Gregory": ["Q28016802", "Q49783724", "Q55739798", "Q6236260", "Q942124"]}, "date": "2017-11-30", "url": "http://www.goal.com/en-india/news/7083/isl/2017/11/30/40650222/isl-2017-gregory-nelson-chennaiyin-fcs-dutch-wing-wizard-snubbed-", "content": "Indian Super League Goal By Ashwin Muralidharan (Tweets @ AshwinMNair10) 06:07 Share Close Comments Image Courtesy: ISL The former AZ Alkmaar winger has made a bright start to life in the South Indian city and is loving the excitement and colour surrounding the ISL...It is not often that a footballer, especially someone from Europe, decides to snub offers from European teams to go play for an Indian club. Yes, Indian Super League (ISL) outfit Chennaiyin FC's Dutch recruit Gregory Nelson did exactly that and has had absolutely no regrets over his decision. Nelson has had a sparkling start to life at Chennaiyin FC, coming off the bench and helping Chennaiyin FC almost stage a comeback in their opening game against FC Goa before playing a stellar role in their 3-0 hammering of NorthEast United in the second game of the season. In an exclusive chat with Goal, the winger revealed that the lure of coming to India was too tempting to pass up, with the good words put in by former Chenaniyin FC and Delhi Dynamos midfielder <mark>Hans Mulder</mark> also playing a part in convincing him. \"I did have offers from Europe this season but I was close to joining Chennaiyin FC and I really wanted to come to India. So, I decided to take up this offer (instead),\" he said. \"I have some friends who have already played here like <mark>Hans Mulder</mark>. He's a very good friend of mine. They told me only good things about India. So, it was an easy decision,\" he expressed before adding that he was close to playing the ISL in the previous editions as well. \"In the previous two ISL seasons, I was close to coming to India. I spoke to some agents and they tried to bring me to India. I've known about the league also for some time now.\" I didn't expect the league to be so organised when I came in. Everything around the matches are well organised. And the games are like big happenings and I like it very much. \"However, he felt that the country's training facilities had a lot of scope for improvement but expressed confidence that in the coming years, they will improve as well.\" The schedule (of the league) and travelling is very good but the training facilities can be better. The field where we are training is good but in Europe, we have five-to-six very good pitches and you get gyms and other facilities which are not here. But I'm sure in four-to-five years, it will come here as well and the facilities will be better, \"he opined. The winger went on to state that while he would like to continue playing in the ISL in the future, the timing of the league makes it hard for overseas footballers to remain match fit and further their careers. In doing so, he pointed out one drawback of the ISL expanding to a four-month long league from the point of view of overseas players.\" As of now, I really like it here. I want to see how the season plays out. But I don't mind staying longer here. I like it and I want to help the (Indian) players get better. But you never know what will happen, \"he shared before adding,\" It is difficult (to commit for long time), with the ISL being of short duration. \"You are free only in March and in Europe, the next window is open in June I think. So, the other teams will view you as a player who hasn't played for two-to-three months. So, it is a bit scary for the foreign players who come here. Last year, we could have signed in January for some other team and then come back next season.\" The 29-year-old who came through the youth ranks of Eredivisie club AZ Alkmaar might not have had a storied career in football, with him making just the one senior appearance for AZ before meandering off to countries lke Ukraine, Bulgaria, Kazakhstan etc, but holds the distinction of being handed his senior team debut by none other than former Manchester United manager Louis van Gaal. Van Gaal was in charge of AZ from 2005 till 2009 and he picked Nelson for the team's Eredivisie game against Heracles Almelo in September 2007. \"Yes, I was given my debut my Louis van Gaal. He is a very tough coach who backed talent. No matter how young you are, if you were good enough to play, he would pick you,\" recollected Nelson. Interestingly, Chennaiyin FC is Nelson's third club in 2017 with him cutting short his association with Kazakhstan's Kaiser without making an appearance for them due to personal issues before turning out for Bahrain's Al Muharraq club. \"I was supposed to go to Kazakhstan (at the start of the year) and they promised me several things but didn't deliver on them. So I decided to break (the agreement) and I went home.\" (Then) I went to Al Muharraq and our goal was to win the league. But we failed and the coach who brought me there was fired. The new coach brought new players and I decided to leave. \"Before the ISL season started, Chennaiyin coach <mark>John Gregory</mark> described Gregory Nelson as someone who can take on and beat any defender. The Dutchman concurs with the view and gave an insight into how he likes to play.\" I think my strength is a combination of pace and trickery. I'm not the fastest player going around but in a one-on-one, I'm very difficult to defend and I think that is my biggest strength, \"he stated. Article continues below One of Nelson's biggest achievements in his career has been playing in the Europa League with Bulgarian side CSKA Sofia in the 2010-11 season where they played against the likes of FC Porto and Besiktas. Nelson wrapped up the chat by recollecting some of his most memorable moments, including his Europa League bow and the 2012 Ukraine Cup final loss against Shakhtar Donetsk, which had the likes of Henrikh Mkhitaryan, Willian and Fernandinho in the starting XI that day.\" Playing in the Europa League (was certainly one of the best memories). Also, winning the Cup and the Super cup in Bulgaria (with CSKA Sofia). We (Metalurh Donetsk) lost in the Ukraine Cup final agianst Shakhtar Donetsk (2012) who had some really big players. \"Indian Super League Chennaiyin Pune City v Chennaiyin Pune City G. Nelson Comments ()"}]