[{"articleID": "2010080523_00076450_W", "names": {"Mark Taylor": ["Q12121376", "Q1646155", "Q16751422", "Q16937410", "Q18331796", "Q1900451", "Q19578043", "Q2735589", "Q30717031", "Q3294253", "Q3294254", "Q4546520", "Q47770287", "Q56149938", "Q58889496", "Q6766958", "Q6769947", "Q6769949", "Q6769950", "Q6769951", "Q6769953", "Q6769954"]}, "date": "2010-08-05", "url": "http://10tv.com/live/content/onnnews/stories/2010/08/05/story-discover-ohio-wakeboarding.html?sid=102", "content": "at wake nation it's all about water sports, but without the boat. it's a unique way to stay cool and have fun at the same time at the man-made pond in southwest ohio, reported onn's <mark>mark taylor</mark>. \"just bring your bathing suit and you're ready to go,\" said wake nation spokesman bill mefford. mix an innovative overhead cabling system with a 10-acre lake, add a few obstacles and you've got a recipe for a day full of fun. water sport enthusiasts can enjoy floating jumps as they get pulled around the lake. \"wake nation cincinnati, when it opened last year, was only the seventh cable wake park in the country,\" mefford said. \"they're few and far between, and the closest one to us is 800 miles away.\" the park was designed for maximum fun, but without the high cost. \"if you're a wakeboarder, water skiier, or knee boarder, this is the place to come,\" mefford said. \"if you don't have a $60,000 boat to bring with you, we have the cables.\" even though the park is only a year old, it is already adding new attractions. for beginners, wake nation has a practice pond. it's the only one of its kind in the entire country. \"the practice pond was opened for beginners to take sort of a slower step toward wakeboarding,\" mefford said. rookies and the more experienced can both enjoy the wake park. \"(the pros) just rave about this place and believe me they go to all of the cable parks,\" mefford said. a guinness world record was set at wake nation in june for the longest distance traveled on a wakeboard in 24 hours. it took hundreds of laps around the pond. watch onn and refresh onntv.com for the latest information. click here to sign up for e-mails from onn, including breaking news, daily headlines and weather updates .? copyright 2010, wbns-tv, inc. all rights reserved. for more information on this site, please read our"}, {"articleID": "2014100714_00099571_W", "names": {"James Mccarthy": ["Q529013", "Q55643105", "Q6139191", "Q6139195"], "Carlos Queiroz": ["Q313209", "Q9697298"]}, "date": "2014-10-07", "url": "http://www.rte.ie/sport/soccer/international/2014/1007/650668-midfielders-play-down-impact-of-keane-book/", "content": "Roy Keane will give further insight into his book on Thursday Republic of Ireland midfielders Darron Gibson and Jeff Hendrick believes the furore over revelations in Roy Keane's new book will not have an impact on preparations for the upcoming Euro 2016 qualifiers. The release has dominated headlines since details emerged yesterday, including his departure from Manchester United. Gibson refused to be drawn on the dispute between his former manager Alex Ferguson and Keane, saying the squad have joked about the book rather than dwelling on it too much on the subjects. The Everton player said: \"There have been a few comments but nothing serious. The lads just get on with it.\" There have been a few jokes around the table but, like I said, nothing serious. I don't think it will affect the lads. \"Derby County's Jeff Hendrick, who will also be vying for a place in midfield against Gibraltar and Germany with <mark>James McCarthy</mark> ruled out with injury, said that the players only have eyes on the two qualifying matches. Hendrick said:\" I saw that his book was out but I don't really do too much reading. It's not really a distraction for us. The main thing for us is getting in training and getting focused on the game. \"I don't see why we would get uptight about his book to be honest. Our job is to get three points on Saturday and that's all we are focused on.\" Roy Keane says he turned down the chance to replace Neil Lennon as Celtic boss because the Hoops did not try hard enough to land him. Keane details Ferguson spat that prompted Utd exit Roy Keane has revealed he clashed with Alex Ferguson and <mark>Carlos Queiroz</mark> in a training camp prior to his Manchester United exit, telling the manager that he wasn't doing enough to address their problems. RTé is not responsible for the content of external internet sites."}, {"articleID": "2013070516_00040331_W", "names": {"Michael Barnes": ["Q16147689", "Q16164531", "Q16171690", "Q25172118", "Q3355621", "Q56700663", "Q6828429", "Q6828430", "Q6828432", "Q6828433"], "Marcus Wilson": ["Q18619128", "Q6758543"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2013-07-05", "url": "http://au.news.yahoo.com/latest/a/-/article/17876411/rudd-apology-over-insulation-deaths/", "content": "Rudd apology over insulation deaths Prime Minister Kevin Rudd is prepared to meet and apologise to parents of tradesmen killed installing home insulation batts under a federal government scheme. But the opposition says Mr Rudd must go further and release all documents relating to advice to him about problems with the scheme, set up during his first term as prime minister. The issue re-emerged just over a week into Mr Rudd's return to the leadership after Queensland coroner <mark>Michael Barnes</mark> handed down a damning report into the deaths of three men. Mr <mark>Barnes</mark> found the rushed rollout of the scheme was a significant factor in the deaths of installers Matthew Fuller, Rueben <mark>Barnes</mark> and Mitchell Sweeney in Queensland. A fourth man, <mark>Marcus Wilson</mark>, died in November 2009 from hypothermia complications with installing batts in a Sydney house. Mr Rudd, who rolled out the scheme to create jobs during the global financial crisis, issued a public apology to the men's families on Thursday during a trip to Jakarta. On Friday, a spokesman for Mr Rudd said the prime minister would meet with any of the parents who wished to meet him in private. \"These events are tragic - and despite what the opposition might believe, they are not some opportunity for a headline.\" Lawyer Peter Koutsoukis, representing Mr Sweeney's family, told AAP they would appreciate a face-to-face apology, even though \"no amount of apologies can bring Mitchell back\" . Opposition Leader <mark>Tony Abbott</mark> said an apology was an important \"first step\" . But Mr Rudd should also release all 10 warnings he personally received between August 2009 and March 2010 and any others he was aware of relating to the scheme, which also has been linked to 250 fires. Four of the letters were from the then minister in charge of the program, Peter Garrett, who is quitting parliament at the next election. A cabinet committee is known to have discussed the scheme's safety issues in October 2009 and February 2010. \"I think he's got a bit of explaining to do,\" Mr <mark>Abbott</mark> said. Mr Rudd's spokesman said Mr <mark>Abbott</mark> was calling for release of information already made public, except for confidential cabinet documents. The victims' families are considering claims against the state and federal governments. Mr Albanese said the pace at which the program had been rolled out allowed dodgy operators to take advantage. \"What these findings highlight is that because of the pace of the scheme, in some places unscrupulous operators didn't give staff appropriate health and safety training, and that has led to these consequences,\" he said. Attorney-General Mark Dreyfus said the deaths were a tragedy and the government would look closely at the coroner's report. Mr Garrett apologised for the bungled program and defended his own actions in the matter, but accused Mr <mark>Abbott</mark> of playing politics. \"Of course I'm terribly sorry about what happened,\" Mr Garrett told reporters on Friday. The former Midnight Oil frontman said two independent reviews showed he had acted appropriately during the home insulation roll-out. \"At all times I've served the country to the best of my ability,\" Mr Garrett said. \"It's on the public record...you can come to your own conclusions about those matters. British court to hand down Turkcell ownership verdict on July 9"}, {"articleID": "2015020319_00020432_W", "names": {"Robert Kraft": ["Q43159129", "Q591632", "Q706686", "Q7346461"], "Richard Sherman": ["Q16205086", "Q2947411"], "Ray Rice": ["Q1523516", "Q23823439"], "Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"]}, "date": "2015-02-03", "url": "http://businessinsider.com/nfl-commissioner-roger-goodell-robert-kraft-deflategate-2015-2?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Patriots Owner Hijacks Bill Belichick Press Conference, Demands Apology From NFL If His Team Is Found Innocent <mark>Robert Kraft</mark>'s gutsy $175 million investment in the New England Patriots has paid off big time <mark>Richard Sherman</mark> Says The NFL Won't Punish The Patriots Because Their Owner Is Best Friends With Roger Goodell Despite one of the ugliest seasons in NFL history thanks to a number of issues and how the league handled them, commissioner Roger Goodell However, Goodell's biggest supporter, New England Patriots owner <mark>Robert Kraft</mark>, is suddenly singing a different tune and the commissioner's job may no longer be secure. The Season from Hell: Inside Roger Goodell's Ruthless Football Machine, \"Gabriel Sherman outlines just how close Goodell and <mark>Kraft</mark> have been and how it was <mark>Kraft</mark> that backed Goodell during the uproar over how the league handled the <mark>Ray Rice</mark> domestic assault scandal. According to the story, when the <mark>Rice</mark> case began to spin out of control, it was <mark>Kraft</mark> who arranged for Goodell to do his first on-air interview, on CBS with a woman as the interviewer. It was also <mark>Kraft</mark> who lobbied other owners to publicly support Goodell. Goodell and <mark>Kraft</mark> were so close, at least one NFL executive refers to <mark>Kraft</mark> as\" the assistant commissioner. \"<mark>Kraft</mark> was also the owner who\" vigorously defended \"Goodell's $44 million salary. The relationship between <mark>Kraft</mark> and Goodell was further cemented in the public eye when the two were photographed together at a party just days prior to the AFC Championship game. This #WrapPoll: The next dinner party involving Bob <mark>Kraft</mark> & Goodell is gonna be awkward because...But then the league discovered that the Patriots used deflated footballs during the AFC Championship game, There have been several recent incidents, some more telling than others, that when taken on their own can be easily explained away. But when the incidents are viewed as a whole, they suggest that Goodell has lost his most important ally. Here is a rundown <mark>Kraft</mark>'s recent actions: Prior to one of coach Bill Belichick's Super Bowl press conferences, <mark>Kraft</mark> made a surprise appearance and demanded an apology from the NFL if they are unable to prove that the Patriots intentionally deflated the footballs, noting that he is\" disappointed in the way this entire matter has [been] handled. \"<mark>Kraft</mark> was a no-show to Goodell's pre-Super Bowl state-of-the-league address, a move considered unusual for an owner of one of the team's in the Super Bowl, especially one so close to the commissioner (). After being handed the Lombardi Trophy following the Super Bowl, <mark>Kraft</mark> did not acknowledge the commissioner at all, something that raised the eyebrows of many. Mike Reiss, who covers the Patriots for ESPN.com and whom <mark>Peter King</mark> of SI.com calls\" well-plugged-in, \"recently wrote that it appears that the relationship between Goodell and <mark>Kraft</mark>\" is not in a good place \"and the biggest issue is the leaks that came from Goodell's office.\" My sense is that <mark>Kraft</mark> feels stung by Goodell, who he had backed in the wake of the mishandled <mark>Ray Rice</mark> domestic violence case, \"Reiss wrote for ESPN.com.\" The longstanding relationship between the two is not in a good place based on the league's handling of the team's under-inflated footballs and specifically public leaks. For perhaps the first time, I sense <mark>Kraft</mark> is doubting Goodell's leadership, and if Goodell loses one of his top supporters I wonder how much it could threaten his hold on the job. \"NFL commissioner Roger Goodell could be losing his biggest supporter because of\" Deflategate' and his job suddenly looks less secure NFL commissioner Roger Goodell could be losing his biggest supporter because of \"Deflategate' and his job suddenly looks less secure These articles have been shared on your timeline. You can remove them here: These articles have been added to your Google activity log. You can remove them here: THE PAYMENTS ECOSYSTEM: The Players And Trends That Are Reshaping The Industry THE APP-STORE MARKETING REPORT: App-Store Competition At An All-Time High THE NATIVE-ADVERTISING REPORT: Spending Trends, Format Breakdowns, And Audience Attitudes * Copyright © 2015 Business Insider Inc.. All rights reserved."}, {"articleID": "2013121906_00015650_W", "names": {"Michael Byron": ["Q6828996", "Q6828998", "Q6831373"], "Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2013-12-18", "url": "http://www.sys-con.com/node/2903724", "content": "TORONTO, ONTARIO--(Marketwired)--12/18/13--Nighthawk Gold Corp. (\"Nighthawk\" ) (TSX VENTURE: NHK) is pleased to announce it has entered into a binding option agreement, with Geomark Exploration Ltd. (\"Geomark\" ), a wholly owned subsidiary of Pine Cliff Energy Ltd., to acquire 4 contiguous mining leases adjacent to Nighthawk's existing property in the Northwest Territories (\"NWT\" ) (Figure 1). HIGHLIGHTS:--Agreement encompasses the Kim and Cass gold deposits (Figure 2) as well as multiple other prospects within the Indin Lake Greenstone Belt;--Kim and Cass represent the final strategic properties to be incorporated into Nighthawk's Indin Lake Gold Project;--Nighthawk's land package will increase in size by 7,588 acres to 229,791 acres total;--Over 32,000 metres of reported historic drilling completed with much of the core remaining intact. Drilling highlights from the Cass Zone include intercepts of:--81.55 metres of 4.50 grams per tonne (\"g/t\" ) gold from hole C87-35;--52.00 metres of 5.10 g/t gold from hole C95-06;--64.40 metres of 4.08 g/t gold from hole C87-23; and--Prior to the implementation of NI 43-101, previous work conducted on the properties defined historic gold resource estimates of significant grade and continuity that have yet to be fully evaluated. Nighthawk President & CEO, David Wiley, commented, \"In this challenging market environment, we remain committed to adding value for our shareholders. We are fortunate to have a healthy balance sheet, a low cash burn rate and now the final strategic pieces of what we believe is a world class gold camp. These leases contain the Kim and Cass deposits plus numerous drill ready targets where previous owners have already completed a significant amount of work. We believe the historical data may be sufficient to apply towards our next resource estimate update and we will be working with the author of our technical report to incorporate this new information.\" Figure 1. - Location Map of Leases Optioned from Geomark Under the agreement with Geomark, Nighthawk has optioned 4 contiguous mining leases which include the Kim and Cass gold deposits and other gold showings. On signing the agreement, Nighthawk granted Geomark a 2.5% net smelter royalty on the 4 leases (of which 1.5% can be repurchased for $1,500,000) and paid $250,000, one-half of which is to be satisfied through the issuance of 1,768,345 common shares of Nighthawk. Subsequent option payments totalling $1,300,000 are staged in tranches over the next three years as follows:---------------------------------------------------------------------------- Due Date Payment---------------------------------------------------------------------------- on or before December 31, 2014 $300,000---------------------------------------------------------------------------- on or before December 31, 2015 $450,000---------------------------------------------------------------------------- on or before December 31, 2016 $550,000---------------------------------------------------------------------------- Nighthawk has the right to satisfy one-half of each of the option payments in common shares, subject to receipt of requisite approval including the approval of the TSX Venture Exchange should Nighthawk elect to issue common shares. Upon making the final payment, Nighthawk will own 100% of the mining leases. Property Highlights Historical Resource Estimates The Kim Main Zone, hosted by mafic volcanic rocks, and the Cass Zone, hosted by gabbro, represent significant underexplored gold deposits within the Indin Lake Gold Camp. Several historical resource estimates that pre-date the implementation of NI 43-101, were calculated for each of the deposits. The most recent of these was compiled in 1995 by 1Royal Oak Mines Inc. (\"Royal Oak\" ), the previous operator of the Colomac Gold Mine. They reported a possible geological resource based upon relatively shallow drilling (150 metres) for the Cass and Kim Zones presented in Table 1 below. Table 1. Historical Resource Estimate for Cass and Kim Zones Zone Cutoff (g/t) Tonnes Grade (g/t) Ounces Au---------------------------------------------------------------------------- Cass 1.00 1,919,518 2.43 150,228 Kim (Main) 1.50 937,575 3.15 95,082---------------------------------------------------------------------------- Total 2,857,093 2.66 245,311 A qualified person has not done sufficient work to classify any of the historical estimates as current mineral resources or mineral reserves as defined by NI 43-101; consequently, they should not be relied upon. The Company is not treating the historical estimates as current mineral resources or reserves as defined by NI 43-101. Cass Zone The Cass Zone is located approximately 20 kilometres southwest of Colomac, hosted within a northeast trending gabbro sill. Mineralization is characterized by a stockwork of quartz-carbonate veins with minor pyrite, pyrrhotite and arsenopyrite. In excess of 13,500 metres of historic drilling into the zone has defined mineralization over a strike length of 360 metres and to a depth of 210 metres. Royal Oak intended to place the Cass Zone into production and process the ore at the Colomac Mill, but the company closed the Colomac operation before production from the Cass Zone began. Select drill intercepts from the Cass Zone are reported in Table 1 below. These are historical in nature and Nighthawk has not independently verified the results; consequently, these results should not be relied upon. Table 2. Historical Drill Intercepts from the Cass Zone---------------------------------------------------------------------------- Hole ID From (m) To (m) Length (i) (m) Au g/t---------------------------------------------------------------------------- C87-23 112.10 176.50 64.40 4.08---------------------------------------------------------------------------- C87-25 170.60 223.90 53.30 4.17---------------------------------------------------------------------------- C87-35 105.35 186.90 81.55 4.50---------------------------------------------------------------------------- C95-05 122.00 170.00 48.00 4.15---------------------------------------------------------------------------- C95-06 153.00 205.00 52.00 5.10---------------------------------------------------------------------------- C95 .09 82.00 119.00 37.00 4.83---------------------------------------------------------------------------- (i) Lengths are reported as core lengths. True widths are unknown at this time. Kim Main Zone The Kim Main Zone, located approximately 15 kilometres southwest of Nighthawk's past producing Colomac Gold Mine, lies within a sequence of northerly striking, steeply dipping, mafic to intermediate volcanic rocks. Mineralization is hosted by intercalated, massive and pillowed mafic volcanics and has been traced over a strike length of 650 metres and to depths of up to 150 metres vertically. Near surface mineralization is offset by a north-south trending, 45 degree late reverse fault, but historical drilling is reported to have intersected mineralization below the fault and the zone remains open at depth. Over 18,000 metres of historic drilling is documented for the Kim Main Zone. 19th Hole Zone and Albatross Zone Two occurrences, the 19th Hole Zone, located 300 metres to the southwest of the Cass Zone, and the Albatross Zone, located 500 metres further to the southwest, appear to be extensions of the Cass Zone. Both the Albatross Zone and the 19th Hole Zone are defined by an area of extensive quartz-carbonate veining in gabbro with associated pyrite, pyrrhotite and arsenopyrite identical to that of the Cass Zone. 19th Hole Zone Historic surface trench samples collected from the 19th Hole showing assayed 15.9 g/t gold and 11.58 g/t gold over widths greater than 1 metre. Two other samples had values of 5.5 g/t gold over similar widths. Albatross Zone The Albatross occurrence is located entirely within Nighthawk ground and appears to represent a continuance of the Cass Deposit mineralization. Historical channel samples from a trench across the zone returned assay results up to 9.7 g/t gold over 1 metre. 1 Archibald, D.L., and Kulas, J. P., 1995. Geological Resource Estimate, Cass Zone and Main Zone Kim Project, N.T. Internal Royal Oak Mines Inc. report. About Nighthawk Gold Corp.. Nighthawk is a Canadian-based exploration company focused on acquiring and developing gold mineral properties in the Northwest Territories. Its primary land position covers 229,791 acres or 900 square kilometres in the Indin Lake Gold Camp and includes an Inferred Mineral Resource estimate of 39.815 million tonnes with an average grade of 1.64 g/t gold for 2.101 million ounces gold using a cut-off grade of 0.6 g/t gold. The technical aspects of this press release have been reviewed by <mark>Michael Byron</mark>, Ph.D., P. Geo ., Chief Geologist and Director for Nighthawk, who is the \"Qualified Person\" as defined by NI 43-101 for this project. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Statements Certain information set forth in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties, including, but not limited to, the timing of future drilling, the expansion of the mineralization, and the remediation of historic reclamation sites. These forward-looking statements are subject to numerous risks and uncertainties, certain of which are beyond the control of Nighthawk, including, but not limited to, the impact of general economic conditions, industry conditions, volatility of commodity prices, risks associated with the uncertainty of exploration results and estimates, currency fluctuations, dependency upon regulatory approvals, the uncertainty of obtaining additional financing and exploration risk. Readers are cautioned that the assumptions used in the preparation of such information, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, undue reliance should not be placed on forward-looking statements. This press release is not, and is not to be construed in any way as, an offer to buy or sell securities in the United States. David Wiley President and CEO (647)? 260-1247 Published December 18, 2013 Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. More Stories By Marketwired. Copyright? 2009 Marketwired. All rights reserved. All the news releases provided by Marketwired are copyrighted. Any forms of copying other than an individual user's personal reference without express written permission is prohibited. Further distribution of these materials is strictly forbidden, including but not limited to, posting, emailing, faxing, archiving in a public database, redistributing via a computer network or in a printed form. New Release of Quest Toad for Oracle Offers Enhancements to Reduce Risk yourfanat wrote: I am using another tool for Oracle developers - dbForge Studio for Oracle. This IDE has lots of usefull features, among them: oracle designer, code competion and formatter, query builder, debugger, profiler, erxport/import, reports and many others. The latest version supports Oracle 12C. More information Polaris Announces Strategic Partnership with Ariens Company Bluestone Resources Corporate Update Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to New York and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in November at Cloud Expo New York. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Expo on June 10-12, 2014 - is to ensure - through an intensive three-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Javits Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in New York June 10-12, and maximize those benefits already in 2014. See you in New York! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in New York Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2012081315_00078872_W", "names": {"John Duffy": ["Q15126351", "Q16067240", "Q18808574", "Q19560392", "Q21005685", "Q23071144", "Q6230291"], "Miguel Ruiz": ["Q116177", "Q26217931", "Q3857283", "Q51696647", "Q56193433"]}, "date": "2012-08-13", "url": "http://psychcentral.com/lib/2012/therapists-spill-whats-your-motto-on-life/", "content": "have you ever thought about your motto on life? maybe it's a saying that captures your purpose or your mission. or maybe it's a string of words, a collection of passages or even a poem that inspires your actions. we asked several clinicians to describe their mottos. perhaps their tenets will stir you to take the time to think about the words you'd like to live by. urban balance, llc: in life, we are all dealt a different hand of hardships and blessings. we each have a unique life experience that will help us learn, grow and develop emotionally, relationally and spiritually. we must each honor our personal life history to gain awareness of how our earlier experiences have shaped and molded us into who we are today. we have the choice to let go of old belief systems and negative thinking patterns that constrain us and create our own ceilings. we have the power to attract positivity in our lives by silencing our inner critic and practicing gratitude. in my practice and in my own life experiences, i have come to believe that some of the greatest life challenges bring about gifts such as increased consciousness, awareness, depth, perspective, empathy, compassion, resiliency, wisdom, strength, capability, tolerance, and serenity. our life outcome all depends on how we view the hand we are dealt. if we focus on the negative, on our egos, or on the hardships of the past we will not thrive and prosper. if we view our hardships as opportunities for growth and learning and empower ourselves to move forward in life in a way that is compassionate and loving to ourselves and others, we will succeed personally and professionally. <mark>john duffy</mark>, ph.d, a clinical psychologist and author of the book the available parent: radical optimism for raising teens and tweens: for myself, i try to follow a couple of guides. first, i try to follow \"the four agreements\" as delineated by don <mark>miguel ruiz</mark> in his book of the same name. the very basic agreements read: be impeccable with your word. don't make assumptions. don't take anything personally. always do your best. i've distilled these down to two: be impeccable with your word, and always do your best. if i achieve these every day, i believe i've led a good life. i also try to keep the serenity prayer in mind every day: grant me the serenity to accept the things i cannot change, courage to change the things i can, and the wisdom to know the difference. i calm myself with these thoughts whenever i get anxious. deborah serani, psy.d, a clinical psychologist and author of depression: i love using proverbs and quotes to help guide me in life. i weave them into my clinical practice with people i work with too. one of my favorites for when life seems tough is the japanese proverb: \"fall down seven times, get up eight.\" it helps me realize that no matter how many times i fall, i have the power to rise again. so this wonderful, wise proverb helps me summon adhd executive functions workbook: [my motto is] good deeds tend to be rewarded. i don't believe in karma, but i do believe in playing the odds. good deeds build good will, so the more people who have positive thoughts about you, the more likely it is that good opportunities will come your way. being diligent about handling your responsibilities and being generous about helping others out builds fans who are happy to reward good performance and return the favor. i've found that some \"sure bet\" opportunities didn't work out as expected but also that interesting opportunities came out of the blue, so you can't be too mercenary about it or expect a direct reward for every good deed. rather, it's a general mindset that doing enough of the right things will bring enough of what you want. beyond the obvious aspects of you scratch my back, i'll scratch yours, there is also the more subtle aspect that people like to associate with others who they see as capable, generous, and positive. emily campbell, lcpc, ceap, a psychotherapist at urban balance, llc: [my motto is] love god, love people. it comes from jesus' words that the greatest commandments are to \"love the lord your god with all your heart and with all your soul and with all your mind and with all your strength, and to love your neighbor as yourself.\" it means focusing first on loving god, and allowing his love to flow through us to others, treating them as we would wish to be treated. our relationships with god and other people comprise our life; everything else is just the extras. alison thayer, lcpc, ceap, a psychotherapist at urban balance, llc: [my motto is] everything will be ok in the end. if it's not ok, it's not the end. (i believe the author is considered unknown .) i use this motto to highlight the significance of the journey and the lessons we experience in life. so often, we get caught up in not having what we want when we want it. this is particularly valuable to perfectionists, or \"type a\" personalities who are driven and expect to get immediate results. these individuals can really struggle when the results are not exactly as they anticipated, and they may view the alternative result as a failure (also known as all-or-none thinking). margarita tartakovsky, m.s. is an associate editor at psych central and blogs regularly about eating and self-image issues on her own blog, weightless. apa reference tartakovsky, m. (2012). therapists spill: what's your motto on life?. clinicians on the couch: 10 questions with psychologist <mark>john duffy</mark> 3 relationship pitfalls when entering parenthood & pointers to help last reviewed: by <mark>john</mark> m. grohol, psy.d. on 3 aug 2012 abstract thinking as means to boost self-control thinking about giving inspires people to help others body image booster: create a sanctuary presence/engagement versus disengagement sex addiction deniers: what makes them so mad? advertisement most popular news abstract thinking as means to boost self-control thinking about giving inspires people to help others"}, {"articleID": "2019012602_00196556_W", "names": {"Tom Davis": ["Q14371530", "Q19957326", "Q22814855", "Q2366977", "Q7815530", "Q7815532", "Q7815534", "Q7815535", "Q7815536"]}, "date": "2019-01-25", "url": "http://www.kob.com/news/analysis-trumps-shutdown-retreat-reveals-weakness/5223321/?cat=649", "content": "Analysis: Trump's shutdown retreat reveals weakness Donald Trump | Photo: AP By ZEKE MILLER January 25, 2019 07:22 PM WASHINGTON (AP)--President Donald Trump will emerge from the longest government shutdown in U.S. history politically weakened, his reputation questioned and his signature campaign promise still glaringly unfulfilled. Advertisement The 35-day partial shutdown over the president's demand for billions of dollars to build a wall along the U.S.-Mexico border was, in the end, futile. Facing defections within his own party, sagging poll numbers and public criticism for interrupted services, the self-proclaimed master dealmaker accepted an agreement that he had previously spurned and set an ignominious record that will remain part of his legacy. Days after Trump marked the midpoint of his term, the shutdown highlighted the disquieting side effects of his unconventional governing style and the trials that lie ahead for him in dealing with emboldened Democrats. The folly of the effort was readily apparent inside the White House, where aides had warned Trump even before the shutdown began that there was no avenue to success in the showdown with Capitol Hill. Democrats ran for office on preventing Trump from building the wall--and it's hardly a popular idea even among Republican lawmakers. Advisers watched in shock as Trump declared in a December meeting with lawmakers that he would be \"proud\" to shut down the government. And when he ultimately did just that, they feared the messaging war had already been lost. \"He was playing double-A ball against major leaguers,\" said former Republican Rep. <mark>Tom Davis</mark> of Virginia, who once headed the House GOP's campaign arm. By backing himself into the shutdown with no way out, <mark>Davis</mark> said, Trump displayed a lack of discipline from the start. The strategic deficit was only magnified by what allies saw as tactical errors. Trump spent the holidays tweeting from the White House rather than making public appearances to showcase his readiness to negotiate. He didn't deliver a public address or visit the border to make his case until weeks had already gone by. Perhaps most crucially, he underestimated House Speaker Nancy Pelosi and the unity of congressional Democrats, thinking the Californian would be more amenable to a deal on the wall once she won the speakership. Trump's message zigzagged sometimes by the hour. He maintained he was proud of shutting down the government and then tried to pin the blame on Democrats. One moment he signaled he was ready to concede the wall in favor of other barriers on the border, and the next he tweeted he was fighting for the wall as strongly as ever. It was emblematic of the dysfunctional White House culture he has fostered and the challenges that have been manifest on decisions big and small for two years. By the end of the shutdown, West Wing aides and outside allies of the president began to look at the seminal promise of Trump's 2016 campaign as an immense--and unachievable--burden on his presidency. It was complaints that Trump appeared to be passing up his last, best opportunity to make good on his build-the-wall pledge that led Trump into the shutdown to begin with. Conservative commentators and House Freedom Caucus members fired off warnings that Trump's base would sour on him if he didn't use the last days of unified GOP control of Washington last year to try to get money for the barrier. But in his quest to appease his base, the president tarnished his standing with the American public. Overall, 34 percent of Americans approve of Trump's job performance in a survey released this week by The Associated Press-NORC Center for Public Affairs Research. That's down from 42 percent a month earlier and nears the lowest mark of his two-year presidency. \"Hopefully now the president has learned his lesson,\" Senate Democratic leader Chuck Schumer said in a gloating press conference with Pelosi. The impasse was an early test for Pelosi after her return to the speakership, one that she appeared to pass handily. Democrats remained unified against White House efforts to divide the caucus, and they head into the next round of debate over border security funding determined to make good on their own 2018 promises to block Trump's wall. As White House aides suggested that the shutdown had brought Democrats to embrace border \"barriers,\" Pelosi make clear her party remained resolved against the wall. \"Have I not been clear?\" she said. \"No, I have been very clear.\" Trump, characteristically, refused to concede that he'd conceded. Instead, he insisted he hadn't caved to Democrats, and he threatened yet another shutdown even while bemoaning the last one's impact on Americans. \"This was in no way a concession,\" Trump tweeted late Friday. \"It was taking care of millions of people who were getting badly hurt by the Shutdown with the understanding that in 21 days, if no deal is done, it's off to the races!\" ___ Associated Press writer Alan Fram contributed to this report. ___ EDITOR'S NOTE: Zeke Miller has covered the White House and politics in Washington since 2011. Follow him at http: //twitter.com/zekejmiller Credits Updated: January 25, 2019 07:22 PM Created: January 25, 2019 06:56 PM Copyright 2019 The Associated Press. All rights reserved. Advertisement"}, {"articleID": "2018122714_00481500_W", "names": {"Robert Brown": ["Q12053713", "Q16144772", "Q16200950", "Q18027424", "Q18358801", "Q19874190", "Q19959074", "Q21165598", "Q21452914", "Q2156625", "Q21664222", "Q24418955", "Q25189687", "Q28792824", "Q42969277", "Q43911980", "Q47505833", "Q51585297", "Q55937635", "Q56425064", "Q57412643", "Q6106949", "Q7342398", "Q7342400", "Q7342401", "Q7342410", "Q888471"]}, "date": "2018-12-27", "url": "http://www.dailystar.co.uk/news/latest-news/750127/robert-brown-dead-hmp-dovegate-hit-and-run-driver-coventry", "content": "JAILED: <mark>Robert Brown</mark> and Gwendoline Harrison (Pic: WEST MIDLANDS POLICE) TRAGEDY: Photo of Casper and Corey Platt-May among floral tributes (Pic: GETTY) \"He killed my grandsons. He can't hurt anyone else\" Jane Thomas \"He killed my grandsons. He can't hurt anyone else.\" The boys' dad Reece Platt-May committed suicide three months after they were killed. <mark>Brown</mark>, a career criminal, was banned from driving after doing doubled the speed limit when he smashed into the young brothers in Coventry in February. Shamefully, he then ran from the scene and was later found to have cocaine in his system. HORROR SMASH: The car <mark>Brown</mark> was driving (Pic: PA) His girlfriend Gwendoline Harrison also tried to flee and was handed a six-month sentence for assault while resisting arrest. Also commenting about <mark>Brown</mark>'s death on Facebook, Jaydee Nichola wrote: \"I hope it was slow and painful...not that it would ever compare to the pain and suffering of their mum and family.\" Ms Thomas replied simply: \"Let's hope.\" The boys' mum Louise Platt-May, 28, has campaigned for longer sentences for killer drivers. Related Articles CAREER CRIMINAL: <mark>Brown</mark> had 30 previous driving convictions (Pic: PA) <mark>Brown</mark> was driving at 61mph in a 30mph zone when he killed her sons. His sentence was increased from nine years to 10 and a half years by the Court of Appeal. Speaking after the appeal, Louise said: \"What our family has had to go through, and will continue experience for the rest of our lives, highlights the need for the toughest possible sentences to be handed out to drivers who ruin lives.\" <mark>Brown</mark> had 30 previous convictions for driving offences--he had only been released from prison six days before the tragedy. A spokesman for Serco, the private company which runs the prison where <mark>Brown</mark> died, said: \"We can confirm an inmate has died at HMP Dovegate.\" There will be a coroner's inquest in due course. \"Related articles"}, {"articleID": "2012022412_00057915_W", "names": {"Jimmie Johnson": ["Q217238", "Q6199355"]}, "date": "2012-02-24", "url": "http://paddocktalk.com/news/html/modules.php?op=modload&name=News&file=article&sid=183681&newlang=&topic=11&catid=21", "content": "2012 daytona 500: nascar gatorade duel's completed, stage set for daytona 500 2012 daytona 500 (duel 2): nascar sprint cup race results - kenseth, ford win! 2012 daytona 500 (duel one): nascar sprint cup race results - stewart, chevrolet win! 2012 daytona: nascar truck practice one results - peters, toyota on top! kenseth powers roush fenway to first gatorade duel win at daytona kenseth powers roush fenway to first gatorade duel win at daytona \"thankfully our best buy ford fusion was really fast,\" said kenseth after the race. \"doug yates and those guys have given the fords really good engines this weekend. once we got up to the front if i could stay toward the bottom and keep somebody sort of close to my back bumper we had a lot of speed which makes it a lot easier.\" we just had a big run there, \"added kenseth on his last lap pass.\" <mark>jimmie johnson</mark> gave me a huge push there and that really worked nice for me the whole race there. \"moving into its 25th anniversary season, the victory continued an rfr strong-hold at the 2012 daytona speedweeks that has seen the team now sweep the front row on pole day, post the fastest laps in each day's sprint cup practice sessions and lead the most laps in saturday night's budweiser shootout all-star event (with biffle). in addition, biffle led a race-high 39 laps in the second duel session, before finishing fifth in the race. edwards and biffle will start first and second, with kenseth starting on the second row in fourth for the daytona 500 on sunday. ricky stenhouse jr. qualified eighth last sunday, finished 11th in today's duel race and will make his daytona 500 debut on sunday. defending daytona 500 winner trevor bayne, driving the wood brothers' no. 21 ford, will look to repeat his victory from a year ago after qualifying in on speed on pole day and finishing 12th in today's first duel session. edwards was fifth in the day's first duel as well. daytona 500 starting lineups will be finalized later this afternoon. the team's return to action tomorrow, as they continue preparations for the daytona 500. the 500 is set for sunday 1:10 p.m. est and will be televised live on fox. smith comes on strong with runner-up finish in daytona 500 qualifying race blaney and tommy baldwin racing make the daytona 500 with 12th-place finish stewart, kenseth capture gatorade duel 150-mile qualifying races 2012 daytona 500 (duel): marcos ambrose nascar sprint cup race recap mis pick 'em contest allows fans to compete against mis president despite mechanical difficulties, leilani m? nter and tmr spread awareness 2012 daytona 500 (duel 2): dave blaney nascar sprint cup post-race press conference 2012 daytona 500 (duel 2): chevrolet nascar sprint cup race quotes all logos and trademarks in this site are property of their respective owner."}, {"articleID": "2009062704_00057182_W", "names": {"Magic Man": ["Q23928996", "Q2654402"], "Nathan Lane": ["Q2396802", "Q491264"], "Saddam Hussain": ["Q16210000", "Q7397653"]}, "date": "2009-06-27", "url": "http://uncyclopedia.wikia.com/index.php?title=Worst_100_TV_Programs_of_All_Time&diff=3949230&oldid=prev", "content": "from uncyclopedia, the content-free encyclopedia. (difference between revisions) jump to: navigation, search revision as of 19:12, 24 may 2009 (view source) mrcleveland (talk | contribs) (â \u0086' too good to be in the worst 100) â \u0086 \u0090 older edit current revision as of 04:36, 27 june 2009 (view source) madmax (talk | contribs) line 278: line 278: * \"[[the simpsons]]\" * \"[[the simpsons]]\" * \"[[aaaaaaaaa | the screaming variety show]]\" * \"[[aaaaaaaaa | the screaming variety show]]\" + * \"[[franny's feet]]\" [[category: lists]] [[category: lists]] current revision as of 04:36, 27 june 2009 according to god's true word, the following are the worst 100 * tv programs ever made. readers are required to have their sporks to hand. the all-time 100 worst: 100. april fools jokes 99. bands 98. books (general) 97. cars 96. children's books 95. colours 94. computer games 93. cryptic crossword clues 92. direct-to-video movies 91. diseases your ex-wife could have 90. evil plans 89. firefox extensions 88. food 87. football variants 86. government policies 85. hybrid animals 84. inventions 83. lists 82. locations 81. make out songs 80. money making schemes 79. movies 78. nonexistent words 77. numbers 76. nutty conspiracy theories 75. overused star trek episode plots 74. pick-up lines 73. pokemon cash-ins 72. porn movies 71. porn stars 70. quick detections that an uncyclopedia page sucks 69. reasons to become a christian 68. reflections on 2005 67. reflections on 2006 66. reflections on 2007 65. reflections on 2008 64. reflections on 2009 63. rejected harry potter novels 62. remakes 61. restaurants 60. ringtones 59. self help books 58. sequels 57. sexual perversions 56. short poems 55. sitcom catchphrases 54. songs 53. songs about seagulling 52. songs referencing paedophilia 51. songs to have sex to 50. sonic cash-ins and characters 49. spinoffs 48. suicide ideas 47. superheroes 46. things 45. things about the' 00s 44. things to do during christmas 43. things to put in an iv 42. things to say in court 41. things to say in the workplace 40. things to say on a first date 39. things to stick your dick in 38. toys 37. tv programs 36. uncyclopedia in-jokes 35. video game movies 34. video game systems 33. ways of being a dick 32. ways to be circumcized 31. ways to deliver bad news 30. ways to die (best) 29. ways to die (worst) 28. ways to start a novel 27. ways to win an argument 26. wonders of the world 25. top 100 not in the least bit sexual things to do with no pants on 24. ways to be castrated 23. ways to end a novel [v iew • d iscuss • e dit] * god does not care to count this list too closely, and believers are wise not to criticise divine numeration policy. contents 1 too good to be in the worst 100 2 worst 100 starts here 3 from 50 to 31 4 from 30 to 11 5 darkest 10 starts here 6 top 3 7 honorable mention too good to be in the worst 100 115. the pwetwerschmits of rhode island this family guy spin-off was supposed to replace \"sit down and shut up, john\" , but would only run for a minute since it offended rich people. 114. ben franklin and hitler: the odd couple benjamin franklin and adolf hitler live in modern day america. hilarity ensues. 113. where's waldo? made for kids. consists of sitting very close to the tv and staring at static images searching for waldo and his friends. 112. the frankenstones popular scientific tv show in which archeologists try to bring prehistoric human remains back to life. 111. i love the 40's cancelled after it became a cult show amongst neonazis. montezuma's floating circus was party based on aztec manuscripts. shown here is ahuizotl on a boat, together with a rather large foot. 110. keeping up disappearances very cheap remakte of keeping up appearences. the entire series was made without any actors whatsoever. 109. pirate pat postman pat haunts the english countryside in his bright red post van. 108. montezuma's floating circus an absurdist comedy set in aztec mexico. most sketches are in nahuatl. 107. schoolhouse rock set in the austrian alps of the 1930's, the show followed the lives of five thirty-something ss officers who worked undercover at a high school for the performing arts. the very first german television program, animated. 106. children in captivity charity telethon hosted by terry wogan, in which several hundred schoolchildren, (most probably from birmingham, or lampeter), are locked in individual cupboards until viewers pledge totals of upwards of 17,000,000. also, be sure to include large yellow bear. 105. myspace - the tv show a short-lived tv show about internet phenomenon myspace. 4w3som3 haxx0rz lives with his roommate, {~! i am slowly dying! ~). while haxx0rz tries to haxx0rz other people's accounts, slowly dying just sits around and mopes about how much life sucks. the third and final episode featured a cameo by oscar wilde. 104. the girl who wasn't too popular, but was kinda popular disney channel show about semi-attractive 14-year-old jailbait, her two weird friends (a weird girl and a guy who secretly likes her), the one guy who's totally hott that she has a crush on but totally doesn't notice she exists, the cheerleader who hates her, and her crazy teacher (played by oscar wilde). a guaranteed hit until they stop promoting it for the next show with the exact same formula. 103. the real world - harkstede dutch sitcom with three guys, a tv and no girls at all. quite popular in south dakota. mtv, the brain behind the program, plans to send in japan too. 102. dead <mark>man</mark> walking controversial american reality t.v. show - take ten heartless killers off death row and put them in a house with cameras watching their every move. see them come to understand each other as they make friends in the house. but there's one twist they weren't told about - at the end of every week, the public vote one of them to be executed live on t.v. that night! in a chilling turn, the housemates can choose their fallen comrades method of death: will it be hanging, gas chamber, lethal injection, or firing squad - or somthing more exotic, like a lion pit or the iron maiden? at the end of nine weeks, one housemate will walk out into the world a free <mark>man</mark>, with b-list celebritydom guaranteed. 101. css: miami the first of 26 spinoffs of the popular css: las vegas. like the original, the show chronicles the work of a team of high-tech web developers as they struggle to resolve cross-browser incompatibilities and the limitations of the css2 standard. worst 100 starts here 100. the reich stuff us based historical drama detailing the patriotic work done by former nazi war criminals in the race to put an american on the moon. 99. children in need patronising celebraties pimp the nation to pay for new cars and expensive carpets for registered charities. 98. muffin the mule quaint 1950s porn, featuring a youthful camilla parker-bowles. 97. the fall guy lee majors has no sense of balance, and can only run in slow motion. 96. the simpsons talentless sisters jessica and ashlee live with their father o.j. simpson (\"omer jay) and their dead mother. mr. bean is watching you, a bizarre reality show starring the former actor, shows him stalking various women and getting into other disturbing situations. 95. friends camp humour with several 30-something neighbours in same sex relationships. 94. roots black produce engineer kunti kinte discovers his name is toby. 93. saved by the bell end final episode was watched by no fewer than 17 people worldwide, this highschool teen docu-drama destroyed the careers of 82 aspiring actors, especially\" screech! \". thank goodness. 92. queer eye for the straight guy not as amusing as prick up your ears. 91. baywatch strangely hypnotic. 90. tellytubbies four effeminate aliens (stinkywinky, lardarse, dypso and poo) prance around with an animated household appliance. then they come out. 89. gandhi - the animated series featuring the vocal talents of alfred molina and gary oldman. 88. babylon 5 docu-drama detailing the everyday stuggles of five innocent\" freedom fighters \"wrongly imprisoned by oppressive western infidels. starring keira knightley as private lynndie england. voiced by andrew dice clay, the adventures of zoomo: the happy sheep follows the career of zoomo and his profanity laced rantings on the bush administration. 87. dallas sit-com set in the windy city, featuring the carrington clan, the most famous episode is\" who shot on jr? \"86. 3rd rock from the sun a science fiction drama that takes place in the year 2172 set on an asteroid, which is the real third rock from the sun. 85. 24 highly competitive adults fight to take home first place in the simple middle school math skills game. the answer, though, is 42. 84. king of queens reality show where weekly musical numbers are judged by richard simmons and <mark>nathan lane</mark>, the loser is voted off the cabaret. 83. unwrapped documentary from the early 1990's about teens discovering what unprotected sex finally feels like. 82. coronation street long running sit-com based in the grim north of england. available in over 14 languages (excluding french) other than the original native lancashire dialect. 81. retards say the darndest things bill cosby interviews the mentally handicapped with rarely humourous results. the short lived spin off which were in actuality undubbed reruns of the original series. 80. battlestar guadalajara holy guacamole!!!! 79. airing out the cupboards three volunteers visit the elderly and open their kitchen cupboards for an hour. show consists of watching them wait until it is time to close the doors. 78. what not to wear two fat tarts teach other fat tarts how to dress. 77. eastenders cor blimey! a crash course in how not to speak english, with this collection of jovial cockney types, govn\" r. up d' apples and pears...76. dienasty another bloody awful american soap opera complete with wobbly sets. 75. fiends sitcom about 6 fiends who are complete bastards to one another. 74. extreme makeover - funeral home edition expert morticians and taxidermists take horribly disfigured corpses and transform them into \"open casket material\" . 73. alf a documentary series that followed the activities of an alien creature with a remarkable nose. his mission was to test the strength of our global defenses in preparation for the \"first wave'. 72. airport 75 challenge gameshow in which contestants in an air traffic control tower attempt to talk a spouse dressed as a stewardess in the cockpit of a stricken boeing 747 laden with cash and prizes through an emergency landing. 71. we done had a row live call in show in which anne robinson fields inarticulate mobile phone calls from drunken proletarian males who've just held bitter post-pub arguments with their girlfriends. 70. who said that? quickfire game show with four hosts and two schizophrenic contestants. 69. jerkcity a sitcom adaptation of the web comic. numerous complaints to the fcc about its jokes and the fact that the episodes made little sense (although they were often hilariously funny) led to the series cancelation. most noted for introducing\" huglaghalghalghal \"into the english lexicon. although featuring some elements of german expressionism,\" off \"has little else to offer. 68. yamaha tramps organ music performed by vagrants. 67. when animals are goaded with sticks 3 more hilarious camcorder footage of jar-headed american outdoorsmen discovering the ugly side of mother nature first hand. 66. wwf/wwe a bunch of muscular guys in underwear roll around the floor with each other in order to prove their manliness. 65. off the imagination channel's pathetic attempt to save money on production costs. viewer are asked to pretend that their favorite show is playing. 64. ship of fools hilarious documentary series in which a crew of backwards imbeciles is left in charge of a full-size ocean liner set adrift in the mediterranean - with hundreds of hidden cameras on board to capture the action as a real-life comedy of errors is played out. 65. £ 200 for the first person who can eat an entire bath towel live on camera self-explanatory late-night gameshow for the genuinely desperate. 64. centrifuge bay australian soap opera made entirely on a set housed within a gigantic centrifuge and shot with cameras bolted to the rotating floor, thereby creating an eerie effect in which the furniture and cast slowly slide away from the centre of the room and end up hopelessly pinned against the walls at the end of each episode. 63. the real topless quincy documentary following the grisly work of nude la coroner sherri thompson. 62. er er, what? er, we couldn't think of a title? 61. csi birmingham, england dead brummies, featuring ozzy osbourne. 60. the <mark>magic</mark> noose incredibly irresponsible children's drama series about a group of children who take it in turns to climb up on a stool and poke their heads through a special noose which magically transports them to a beautiful forest filled with chocolate and toys. 59. y * m * c * a set during the korean war but intended to make fun of the vietnam war, the village people run a ymca near the front lines. 58. chaotic britney spears and husband kevin federline turn their home movies into episodic television. 57. dr. what? a science fiction serial from england about a time traveller who is hard of hearing. 56. who wants to be a busboy in an american restaurant? a nicaraguan game show where the contestant progressively wins working visas to various countries where they can be paid well working as a busboy. the adventures of\" buckethead \"kelly, an animated mini-series by the creators of south park, mark the first foray into the historical genre in this documentary on the life of australian cyborg ned kelly. 55. bob the british tradesman a claymation children's program about a british tradesman who continually produces below-standard work while charging customers high prices. 54. space 1799 an expansionist american government colonises the moon and ends up in open war with british settlers. the resulting war causes the moon to fly out of orbit and into deep space, where the victorious american armies are forced to deal with all sorts of weird stuff. 53. big brain a highly intellectual bbc comedy series that was received well by viewers with postgraduate degrees. 52. crappy days a comedy about life in 1950s newark 51. old black whistle test an influential british television music show dedicated to gothic music. from 50 to 31 50. monty python's incredibly funny tv series that was never broadcast because some twit at the bbc lost the footage thus bringing into question the actual existance of the show especially since the members of monty python deny that such a show was ever produced but its really paradoxical to contemplate what might have happened had such a show actually been broadcast since it would never have had this title in the first place now would it? an alleged british comedy show created by the monty python troupe that was never broadcast, reportedly because a civil servant at the bbc somehow lost the footage. this has brought the existence of the show into question, especially since all members of the monty python group deny that the show was produced in the first place. moreover, it is obvious that, even if the show had been broadcast, then its self-referential title would have been incorrect, thus creating a paradox. gene shalit preparing for the 8th season of blakie's seven. 49. blakie's seven 70s british scifi drama about an intergalactic travel service's employees, starring gene shalit as blakie. 48. when animals are goaded with sticks hilarious camcorder footage of jar-headed american outdoorsmen discovering the ugly side of mother nature first hand. 47. america's gunniest high schools incredible real-life footage from the bullet-pocked school hallways of the world's most shooty society. 46. shout court genuine legal disputes settled according to which side can bellow their version of events the loudest. 45. horse puppet disco ground-breaking dance music show in which retired racehorses are transformed into dancing marionettes via a system of wires attached to each hoof, controlled by skilled puppeteers operating an immense mechanical rig. 44. before they were demonised angus deayton takes an amusing look back at osama bin laden's early appearances in daytime gameshows and slimfast commercials. 43. full house r-rated documentary depicting the daily life of three teenage poker addicts, their subsequent gambling and bankrupcy, and their final enslavement by three male pimps, one of whom is mr. tanner from\" alf \". 42. come dancing all that rubbing against chiffon no doubt. 41. inside animals pinhead cameras fitted to the tips of drills take you deep inside your favourite animals by boring through their sides. satan and me, an anime documentary, follows the adventures of a teenage <mark>saddam hussain</mark> and his pokemon satan as they travel the world in search of new opponents. 40. goldfish bay soap opera aimed at domestic goldfish with a two second memory span, featuring a comprehensive plot recap every 1.5 seconds. 39. rise up and kill mesmerising audio-visual assault on the senses, featuring re-enactments of medieval executions intercut with hardcore pornography and set to a soundtrack of dark organ music and sinister subliminal whispering specifically designed to compel viewers to perpetrate violent atrocities. 38. fame for a finger carol vorderman offers a member of the public the chance to star alongside a cast of celebrities dramatising their life - providing they slice off one of their own fingers with a bread knife beforehand. 37. that ain't workin' primitive computer-animated sitcom starring the removal men from dire straits' money for nothing video. 36. boom goes lovergirl hilarious hidden camera action as insular nerds spend weeks being led up the garden path by sophisticated androids posing as attractive women, secretly wired to explode the moment the word\" love' is spoken aloud. 35. deathcamp 2000 eastern european competitive gameshow where musclebound costumed contestants wipe out the ethnic minority of their choice. released in the us under the title \"foreign policy\" ....thank god for bimbos. 34. whose fault is it anyway a world wide hit starring celebrities, activists, and world leaders all trying to pin the blame for their own mistakes on somone else. it's a microcosm of everyday life, but with celebrities and world leaders - tv guide 33. dr. mengele a daytime talk show spun off from oprah featuring none other then the angel of death himself, dr. josef mengele. 32. peg-leg beatletart stumpdance heather mills mccartney taps out rhythms to beatles songs on her detached wooden leg whilst viewers call in and guess the tune for cash prizes. 31. world's craziest pc upgrades watch in horror as geek wannabes attempt to view windows xp on ega screens, run a 2 ghz processor with 32mb ram, underclock their 486sx-33s and install multiple maths co-processor cards into networked 286 computers so they can indulge in multiplayer quake. from 30 to 11 30. rich, stupid and drunk a reality-based program which shows rich people destroying or ruining expensive things because they can (and because they're drunk). segments include: a frat boy giving his cartier watch to a homeless <mark>man</mark>, then beating and robbing him that night so he can smash it with a hammer; a <mark>man</mark> who defecates on his picasso then hangs it up again; a woman who announces in a crowd that she is throwing away her $1 million pearl necklace, removes the string holding the pearls together, and then hurls it into the stunned crowd. four guys in a van with construction gear and a fondness for uniforms 29. the gay team delightfully camp 1980s classic tv series \"the gay team\" , thought by many to be the original influence for the latter a team. it has been noted that the names of the main characters do bare a slight resemblance, as well as having the same cast, writers, production team...28. louie anderson's big fat gay greek wedding louie anderson marries a russian transvestite, and manages to get in wacky hijinks, like getting stuck on the toilet every fucking episode. 27. pobol y kumquat welsh language series, shown on s4c, depicting the lives of a small community of fruit importers from the valleys. 26. law and order - delicatessen division crime never sleeps, and those who fight it need doughnuts. this is their story. 25. only fools and horses docu-drama detailing the lives and loves of prince charles and camilla parker-bowles. 24. skippy the bushed kangeroo \"what's that skippy, you're standing in the corner rocking from side to side?\" years of captivity have taken their toll on the old marsupial. 23. peggy pissflaps childrens series featuring ragdoll peggy on trips to the countryside with mr jolly. 22. last of the summer whine geriatric humour set in the alzheimer's capital of yorkshire. 21. barney the carnivorous dinosaur a fun-loving purple dinosaur that devours children and digests their innards. \"hey kids, lets play hidden predator!!!!\" ...20. one foot in the groin sit-com about a family of cantankerous football hooligans. 19. miami vice presidents a one hour crime-fighting show starring al gore and dan quayle fighting evil criminals such as bag ladies, jaywalkers, and street artists. 18. who's the boss a half hour comedy starring tony danza, tom cruise, roseanne, and rosie o'donnell all arguing about who the boss really was, until tony danza, in a brilliant moment of comedic expertise goes \"a-oh, oh-a!\" and wins the argument. 17. touched by a big fat scary black woman a one hour drama starring star jones dressed up as an angel that goes around scaring the shit out of everyone. sadly enough, almost every episode revolves around her eating 50 big macs in one sitting. 16. the richard simmons show need i say more? 15. touch my arse late night uk gameshow, where blindfolded couples have to feel a selection of arses, winning prizes if they find their partner. 14. the late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late, late show so late, its early the next day. the late late late show, despite its lack of content, has remained in sindication since the 1950's. 13. clean up aisle seven party castle japanese gameshow were contestants have to catch facefulls of spooge, in exchange for strange cheap mass-produced prizes. 12. joe camel and friends an early saturday morning cartoon show directed at children. also featured on the show was the marlboro <mark>man</mark>. most of each show was spent talking about how they did not want kids to enjoy the smooth, rich, satisfying flavor of the blend of three turkish tobaccos. 11. trading kidneys while it was a reasonably informative, though extremely dull, medical drama for its first few episodes, the producers' desire to \"sex things up\" by matching kidneys from seemingly opposite personalities, rather than the more medically-sound practice of looking for donor compatibility, resulted in dozens of lawsuits that bankrupted the show's production company. 10. showgirls sg-1 the adventures of four us air force officers who discover an ancient device capable of producing free backstage passes for every strip club in las vegas. starring richard tailhook anderson as lt. col. jack \"officer\" o'yeahbaby. darkest 10 starts here 9. showgirls atlantic city more us air force personnel get in on the act when yet another ancient device is found, this one capable of producing phone numbers for every mob-operated escort service on the jersey shore. 8. riyadh 911! a spin-off of the popular reno 911!, it features incompetent members of the religious police known as the mutaween. unfortunately, due to the repressive nature of the saudi arabian regime, the worst vices we ever see are women who don't cover their head and men who shave their beards. it is not very funny and is really a sad commentary on saudi society. 7. absolutely crapulous a hidden camera follows two female british drug-addicted alcoholics through a harrowing (and at times disgusting) detoxification process, with several appearances by marianne faithfull as herself. 6. my wife and kids damon wayans plays a horribly inept actor portraying a horribly inept father. 5. 8 different colored stripes with a lot of small black and white stripes below that and a white line going left and right in front of the rectangle all the time plus lots of more including sound which is heard when someone uses curse words a lot. was so popular that it begun to air on most of the television channels after the main schedule ended. 4. mrs gray's knitting show learn the most twisting and challenging moves of knitting. not recommended for faint-hearted. top 3 3. comrade rogerov's neighborhood a short lived soviet version of mr. rogers neighborhood. taught kids that we're all equal, and nobody is special. 2. good mahning bahston! while quite popular in massachusetts, all of the shows anchors had wicked hangovers and spoke in an accent that only other bostoners could understand. often, there would be drunken anti-new york yankee rants every fifteen minutes or so. it was taped at fenway park. 1. jim stevens' bavarian beer bonana! a short lived public access show about getting drunk and wearing lederhosen, mr. stevens, of green bay, wisconsin, was neither german nor the most the \"imported beers.\" in fact the furthest away his beer came from was the miller brewery in milwaukee. however, he should be commended for his brave attempt to have a show about beer on saturday mornings. 0. lost a reality show where a film crew follows the child of a rich family and his kidnappers. hilarity ensues when the family refuses to pay the ransom despite the threat of their child's impending murder. honorable mention american idol angel: the series super robot monkey team hyper force go! super confetti <mark>magic man</mark> and his futuristic rocket from space yes, administrator the simpsons the screaming variety show franny's feet retrieved from \"\"category: lists"}]