[{"articleID": "2018012519_00902970_W", "names": {"Jack Campbell": ["Q3029621", "Q3123835", "Q3157139", "Q6111556"]}, "date": "2018-01-25", "url": "https://www.upi.com/Sports_News/College-Football/2018/01/25/Florida-St-QB-Francois-cleared-in-domestic-violence-probe/2671516909448/", "content": "Florida St. QB Francois cleared in domestic violence probe By The Sports Xchange | Jan. 25, 2018 at 2:46 PM Comments | License Photo Florida State quarterback Deondre Francois was cleared by police in an alleged domestic violence incident, multiple media outlets reported Thursday. Francois was involved in a domestic dispute with his pregnant girlfriend late Tuesday afternoon. But Francois and the woman gave very different accounts of what took place in their statements to the Tallahassee Police Department following the incident at Francois' apartment. Another Florida State football player, Zaquandre White, also was present and spoke to police. Police were called to the scene but an investigation Wednesday evening resulted in no arrests and no charges being filed, because of \"conflicting statements and lack of independent witnesses,\" according to the police. State Attorney <mark>Jack Campbell</mark> told the Orlando Sentinel on Wednesday that Francois will not be charged based on the Tallahassee Police Department's investigation. \"Based on the evidence as we understand it and with the conclusions made by the Tallahassee Police Department, I'm in agreement with TPD with insufficient evidence to charge Deondre Francois,\" <mark>Campbell</mark> told the Orlando Sentinel. Francois, who called the police, said the woman began to break items in the house and attempted to rip a television off the wall, according to the police report. She told authorities that he broke down a bedroom door, threw her to the ground and tried to get her to leave the apartment. Francois said he grabbed the women in a hug to prevent her from breaking things, and that a cut she sustained on her arm was the result of a broken vase. The woman told police she is nine weeks pregnant and said she did not want Francois to get in \"trouble, trouble.\" But she did want the police to speak with Francois to \"scare him a little,\" according to the report. The woman asked police if Francois would get in trouble for smoking marijuana at the apartment before the incident. The woman did not want to press charges against Francois, according to the report. Neither the school nor new coach Willie Taggart has commented on the incident. Francois started every game in 2016 as a redshirt freshman, throwing for 3,350 yards and leading the Seminoles to a 10-3 record. With even higher expectations for him and the team going in 2017, he suffered a season-ending knee injury in the opener against Alabama as FSU struggled to a 7-6 mark. Francois is expected to compete with sophomore James Blackman for the starting quarterback spot for the 2018 season. Related UPI Stories"}, {"articleID": "2018052419_00191077_W", "names": {"Edgar Ross": ["Q3047487", "Q5337445"]}, "date": "2018-05-22", "url": "http://reddead.wikia.com/wiki/New_Austin?diff=320754&oldid=319614", "content": "Revision as of 11:33, April 10, 2018 (edit) JamesTheNerdKing (wall | contribs) (Capitalizing Word) ← Older edit Latest revision as of 11:59, May 22, 2018 (edit) (undo) KuroUrufu (wall | contribs) m Line 137: Line 137: [[es: New Austin]] [[es: New Austin]] + [[de: New Austin]] + [[fr: New Austin]] + [[it: New Austin]] [[Category: Redemption Locations]] [[Category: Redemption Locations]] [[Category: New Austin | *]] [[Category: New Austin | *]] Latest revision as of 11:59, May 22, 2018 \"New Austin: the last real outlaw country. Where the old ways still hold true.\" --John Marston New Austin is one of three territories in Red Dead Redemption and is also the largest. It is also known as the Frontier. Click to enlarge Contents [show] Description Edit This territory is characterized as a largely rugged and arid wilderness in the process of colonization. As such, there is an expected presence of wild animals and outlaws. The name of the region and its largest town as well as its border location, prominent fort, mines, and oil derricks all show a strong Texas influence. Geography Edit New Austin lies between Nuevo Paraiso to the south, and West Elizabeth to the northeast. It comprises four regions: Cholla Springs, Gaptooth Ridge, Hennigan's Stead, and Río Bravo. The terrain of New Austin resembles aspects of several real Southwestern U.S. states. Cholla Springs resembles Arizona's desert with its saguaro cactus, desert scrub, and prickly pears. The scrub desert of Rio Bravo is strongly reminiscent of New Mexico. Gaptooth Ridge is more like Southern California, Nevada, and western Arizona with its tan rocks and Joshua trees, and Hennigan's Stead resembles the western parts of Kansas, Oklahoma, central Colorado, and the square part of Texas called the Panhandle Plains, with the Eastern end (Stillwater Creek) resembling the United States The South comprising of Texas North Texas, Texas East Texas, and Louisiana. Locations in New Austin Edit The following is an alphabetical list of the 46 locations found in New Austin: Hennigan's Stead Edit Click to enlarge Brittlebrush Trawl Butter Bridge Dixon Crossing Greenhollow MacFarlane's Ranch Manteca Falls Mason's Bridge Mescalero Montana Ford The Old Bacchus Place Pike's Basin Stillwater Creek Tanner's Span Thieves' Landing Warthington Ranch Cholla Springs Edit Click to enlarge Armadillo Coot's Chapel Critchley's Ranch Hamlin's Passing The Hanging Rock Jorge's Gap Lake Don Julio Mercer Station Odd Fellow's Rest Pleasance House Rattlesnake Hollow Ridgewood Farm Río del Lobo Riley's Charge Twin Rocks Two Crows Venter's Place Gaptooth Ridge Edit Click to enlarge Cueva Seca Gaptooth Breach Rathskeller Fork The Scratching Post Silent Stead Solomon's Folly Tumbleweed Río Bravo Edit Click to enlarge Benedict Pass Benedict Point Del Lobo Rock Fort Mercer Frontera Bridge Plainview Repentance Rock Achievements/Trophies Edit The discovery of locations in New Austin counts towards the following Trophies/Achievements: ON THE TRAIL OF DE VACA 10 gamerscore Bronze bronze Uncover every location on the map in Single Player. AUSTIN OVERPOWERED 25 gamerscore Silver silver Complete Twin Rocks, Pike's Basin, and Gaptooth Breach hideouts in Single Player. INSTINTO ASESINO 25 gamerscore Silver silver Complete Fort Mercer and Nosalida hideouts in singleplayer. EVIL SPIRITS 25 gamerscore Silver silver Complete Tumbleweed and Tesoro Azul hideouts in singleplayer. REDEEMED 100 gamerscore Gold gold Attain 100% List in the singleplayer game completion list. Trivia Edit People in MacFarlane's Ranch and in Armadillo will mention Governor Nate Johns, suggesting that New Austin and West Elizabeth are located in the same territory; this is further evidenced by the lack of any government building in New Austin, but there are a few in West Elizabeth. The railroad tunnel between Hennigan's Stead and Cholla Springs and the snow capped canyon in north Hennigan's Stead are some of the few places in the game where the player is, technically, off the map. MacFarlane's Ranch is the largest settlement in the region, despite its status as a privately owned ranch. The racing track in Gaptooth Ridge is the westernmost point in the game. As with the boundary between New Austin and West Elizabeth, the transition of the music when the player moves between New Austin and Nuevo Paraiso can take some time to register. External Links Edit Map of New Austin at the Official Red Dead Redemption Site Related Content Edit v • d • e Related Content for New Austin Wiki Content Blog posts Forum posts Images External Content Google • Images YouTube videos Rockstar site Wikipedia The links above will perform a search for the content that matches this page's name. v • d • e Locations in Red Dead Redemption New Austin Armadillo • Benedict Pass • Benedict Point • Brittlebrush Trawl • Butter Bridge • Cholla Springs • Coot's Chapel • Critchley's Ranch • Cueva Seca • Del Lobo Rock • Dixon Crossing • Fort Mercer • Frontera Bridge • Gaptooth Breach • Gaptooth Ridge • Greenhollow • Hamlin's Passing • Hanging Rock • Hennigan's Stead • Jorge's Gap • Lake Don Julio • MacFarlane's Ranch • Manteca Falls • Mason's Bridge • Mercer Station • Mescalero • Odd Fellow's Rest • Old Bacchus Place • Pike's Basin • Plainview • Pleasance House • Rathskeller Fork • Rattlesnake Hollow • Repentance Rock (Mystery Site) • Ridgewood Farm • Riley's Charge • Río Bravo • Rio del Lobo • Scratching Post • Silent Stead • Solomon's Folly • Stillwater Creek • Tanner's Span • Thieves' Landing • Tumbleweed • Twin Rocks • Two Crows • Venter's Place • Warthington Ranch Nuevo Paraiso Agave Viejo • Alta Cabeza • Barranca • Campo Mirada • Casa Madrugada • Chuparosa • Crooked Toes • Diez Coronas • El Matadero • El Presidio • Escalera • Hendidura Grande • Laguna Borrego • Las Hermanas • Mesa de la Luna • Mesa del Sol • Nosalida • Ojo del Diablo • Perdido • Plata Grande • Primera Quebrada • Puerto Cuchillo • Punta Orgullo • Ramita de la Baya • Rancho Polvo • Rio del Toro • Roca de Madera • Sepulcro • Sidewinder Gulch • Tesoro Azul • Torquemada West Elizabeth Aurora Basin • Bearclaw Camp • Beecher's Hope • Blackwater • Broken Tree • Cochinay • Great Plains • Manzanita Post • Montana Ford • Nekoti Rock • Pacific Union Railroad Camp • Tall Trees • Tanner's Reach • Wreck of the Serendipity Border regions Butter Bridge • Dixon Crossing • Flat Iron Lake • Frontera Bridge • Manteca Falls • Mason's Bridge • Montana Ford • Redemption Mountains • San Luis River • Sea of Coronado • Tanner's Span Category: Redemption Locations • Category: Locations v • d • e 100% Completion 94 Map Locations Discovered | 57 Main Story Missions Completed 20 Bounty Locations Completed | 18 Stranger Side-missions Completed 13 Safehouses Obtained | 9 Outfits Obtained | 7 Gang Hideouts Cleared | 6 Minigames Won 5 Job Locations Completed | 5 Rare Weapons Obtained | 4 Single Player Ambient Challenges Completed v • d • e Red Dead Redemption Characters John Marston (Quotes) • Jack Marston (Quotes) • Abraham Reyes • <mark>Edgar Ross</mark> • Bill Williamson • Javier Escuella • Dutch van der Linde • Nigel West Dickens • Bonnie MacFarlane • Category Information Storyline Missions • Weapons • Outfits • Transport • Hunting Gameplay Activities • Hunting (Animals) • Horses (Horse Taming, Horse Breeds) • Gang Hideouts • Dead-Eye Targeting • Random Encounters (Strangers) • Fame • Honor Locations New Austin • Cholla Springs • Rio Bravo • Gaptooth Ridge • Hennigan's Stead • Armadillo • Plainview • Thieves' Landing • Rathskeller Fork • Tumbleweed • Ridgewood Farm • MacFarlane's Ranch • Fort Mercer • Tanner's Span • Mason's Bridge • Pacific Union Railroad Camp • Nuevo Paraiso • Punta Orgullo • Perdido • Diez Coronas • Chuparosa • Escalera • El Presidio • Las Hermanas • Agave Viejo • El Matadero • Torquemada • Casa Madrugada • West Elizabeth • Tall Trees • Great Plains • Nekoti Rock • Blackwater • Manzanita Post • Cochinay Challenges Sharpshooter • Survivalist • Master Hunter • Treasure Hunter • Tomahawk Master • Master Exploder Others 100% Completion • Achievements • Cheats • Multiplayer DLC Outlaws to the End • Legends and Killers • Liars and Cheats • Undead Nightmare • Hunting and Trading Outfits • Deadly Assassin Outfit • War Horse • Golden Guns Hunting Armadillo • Beaver • Bighorn Sheep • Boar • Bobcat • Buck • Buffalo • Cattle • Chicken • Coyote • Cougar • Crow • Deer • Dog • Duck • Eagle • Elk • Fox • Goat • Bear • Hawk • Horse • Mule • Owl • Pig • Rabbit • Raccoon • Rattlesnake • Seagull • Songbird • Sheep • Skunk • Vulture • Wolf • Brumas the Bear • Lobo the Wolf • Gordo the Boar • Khan the Jaguar • Wilbur the Boar • Demi the Cougar • Keifer the Wolf • Roberto the Bobcat • Jackalope The Man from Blackwater • Portal • Soundtrack • Infobox • Category: Red Dead Redemption Retrieved from \"http: //reddead.wikia.com/wiki/New_Austin? oldid=320754\" Categories: Redemption Locations New Austin Languages: Deutsch Español Français Italiano"}, {"articleID": "2010080901_00210814_W", "names": {"Monica Mancini": ["Q51630962", "Q6900006"]}, "date": "2010-08-09", "url": "http://autostraddle.com/skins-sunday-funday-55241/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Autostraddle+%28Autostraddle%29", "content": "skins: this week at mtv's tca panel, the cast of skins us was unveiled: mtv has confirmed the mostly newcomer cast of its \"skins\" import, due in 2011: james newman as tony, rachel thevenard as michelle, daniel flaherty as stanley, ron mustafaa as abbud, sofia black d'elia as tea, camille cresencia-mills as daisy, jesse carere as chris, britne oldford as cadie and eleanor zich as eura. i hope she's ready for her curve cover close-up! sofia black d'elia will be playing the role of tea on the us version of skins. as autostraddle reported before anyone else in the entire universe because we are awesome and work really hard, the uk original's gay character, maxxie, is being swapped out in favor of a lesbian. initially they'd been casting for a latino gayboy, \"teo,\" but then decided to take another route and thus, tea was born. sofia's prior acting credits include all my children. eura, btw, is effy, and seems to be a relatively unknown actress. you can see more photos of the cast on ohnotheydidnt. the people in charge also had stuff to say about how the mtv version will differ from the uk original, and why mtv is optimistic about the direction of its programming: \"millennials are all about authenticity,\" said david janollari, head of the network's scripted development. \"we're pursuing a more authentic v? rit? style with our reality shows and with our scripted programs.\" the risqu? teen soap gives an unvarnished look at teen lives in a way that \"gossip girl\" and \"90210\" can't even dare to mimic. it helps that much of the writing on \"skins,\" the british version of which airs stateside on bbc america, is done by young people, said the series' co-creator bryan elsley. and, he added, casting young actors to bring life to those teen stories is also central to its success; five of the central cast members in the mtv series are under 18 - the targeted demographic of the original series. so have they watched? \"i had seen a couple of episode prior to being cast on the show,\" said james newman, who will play tony snyder. \"once i was cast, i stopped watching it? to bring something new to the show and the character that i'm playing.\" the cast at the tca panel (the blonde in the back is effy, the red-headed girl in the front is michelle): for a thorough mindfuck, here's the cast of usa skins with cast members of jersey shore: jane lynch: jane lynch will host an episode of saturday night live in october. (@ movieline) judge walker: the word is out on how judge walker celebrated post-ruling: he went to the the rrazz room, which is apparently a place, and saw concert singer <mark>monica mancini</mark>! how classy! would it be too much to say he's got a little bit of an irish flush going on in that picture? live it up walker, live it up. (@ queerty) queen latifah: so these photos of queen latifah with her girlfriendimeanpersonaltrainer on a boat are being touted as \"proof\" of their hot sexy lesbian relationship, which i guess that would be cool if that were true, but mostly these photos remind me of the way your third grade teacher had to hug you to avoid getting fired for child sexual abuse: am i wrong, or is this the most awkward a-frame hug in history? other scandalous and revealing photos include \"smiling while standing on the same part of the boat\" and \"one watching the other spray sunscreen on herself.\" hot! (@ peacefmonline) the real l word: have you been watching the real l word? me neither, but that didn't make our interview with stamie any less awesome. she talks about tracy ryerson's vagina, so. fake lesbian advice: i can't decide which is funnier, this letter sent in by someone who claims that she and her husband are in a fight over the sexy woman next door that they're both having an affair with, or the fact that the daily star advice columnist appears to believe it's real. \"you and your husband have to sit down and talk this through. ask yourselves what's happening to you. is this really the kind of life you wish to lead?\" (@ dailystar) lady gaga: hey have you read about lady gaga's performance at lollapalooza yet? because just saying, managing editor sarah and intern elizabeth both saw it, and apparently it was pretty f * cking amazing. when you're done reading about it, check out this video of her sweet stage dive! (@ ontd) suck it, nom i don't know if you've been aware that nom has been leading a \"summer of marriage\" tour of speaking events and protests all over the us. i wouldn't be surprised if you haven't, because at nearly every event the nom attendees have been way outnumbered by counterprotestors. sorry maggie! that must be rough for you! \"organizers of the atlanta counter-protest specifically instructed participants to remain quiet during the nom rally so they could not be accused of being disruptive. they mostly followed the recommendation, except when a nom entertainer sang an ode to\" unity \"- during which they held hands, cheered and sang along\" . (@ thegavoice)"}, {"articleID": "2019101514_00135999_W", "names": {"James Garner": ["Q108510", "Q11170644", "Q6134506"]}, "date": "2019-10-15", "url": "https://toronto.citynews.ca/2019/10/15/ap-exclusive-julie-andrews-reflects-on-her-hollywood-years/", "content": "LOS ANGELES--Everyone is on their best behaviour when Julie Andrews is around. It's early June in Los Angeles and Andrews is coming to film segments for a night of guest programming on Turner Classic Movies and speak about her new book, \"Home Work: A Memoir of My Hollywood Years,\" which hits shelves Tuesday. The air is thick with anticipation before her arrival. When her car does appear--as prompt as Mary Poppins--the crew, the producers and even the catering staff all abandon their lunches and stand to attention. When she steps out, some even start to softly clap, as though she is royalty or perhaps even something bigger than that. But Andrews, seemingly knowing the effect she has on people, brings it back down to earth. \"Hi gang!\" she says cheerily, with that voice that for many is as familiar as their own mother's, putting everyone (almost) at ease as she glides through the room. Even TCM host Ben Mankiewicz, who is no stranger to speaking to screen legends, is a little awe struck. \"God, every time you talk I think,\" She sounds just like Julie Andrews!' \"Mankiewicz says to his guest. Andrews just laughs.\" Shut up, shut up, \"she says. For the next few hours, The Associated Press got a front-row seat as Andrews and Mankiewicz turned the little soundstage into a cozy living room for movie lovers as they discussed three films from her career: 1967's\" Thoroughly Modern Millie, \"1982's\" Victor/Victoria \"and 1986's\" That's Life!, \"all of which she touches on in her memoir. Although they may not be as well-known as\" Mary Poppins \"or\" The Sound of Music, \"each provides a revealing glimpse into her work at different stages of her career outside of those beloved nanny roles. In talking about George Roy Hill's adaptation of\" Thoroughly Modern Millie, \"Andrews reflected on her friendship with co-star Mary Tyler Moore.\" She called me Millie and I called her Miss Dorothy for the rest of our lives, \"Andrews, who just turned 84 this month, said.\" I miss her so much. \"All of the films are special to Andrews in some way, but naturally the ones she made with Blake Edwards, her husband of 41 years, are particularly so.\" We made seven pictures together, \"Andrews said.\" The first one \"Darling Lili' was such a huge flop it's amazing we stayed together for 41 years!\" On \"Victor/Victoria,\" she said Edwards advised her to watch her old friend <mark>James Garner</mark> for inspiration, telling her \"not only is he a great actor, but he's a great reactor.\" \"Blake would love to be sitting right here,\" she said wistfully as Mankiewicz praised the film. \"He probably is.\" The third film they discuss, \"That's Life!\" may be the least known of the bunch, but is one that is in some ways the most personal. The dramatic comedy starring Jack Lemmon as man dreading his impending 60th birthday party and Andrews as his wife was a low-budget, non-union family affair that was filmed in her and Edwards' own home using all of their friends and nothing but a 13-page outline to guide the process. \"(Blake) wrote his demons in this film,\" Andrews says. \"It was really a gift to us all to say\" I'm sorry if I've offended'...it's his apology to us but it's on film. \"In\" Home Work, \"Andrews writes frankly about her relationship with Edwards, a man she remains deeply and wholly in love with and in reverence of but who also had his struggles with prescription drugs.\" I wanted to honour him properly. I wanted it to be truthful, but didn't want to hurt anybody, especially my kids, \"Andrews told the AP later that day. Deciding what to leave in and what to take out, she said\" was hard and I'm very nervous about that. \"The films and her conversation with Mankiewicz will air on TCM on Oct. 29 beginning at 8pm Eastern and serve as a companion to the memoir, co-written with her daughter Emma Walton Hamilton, which picks up where her first memoir\" Home: A Memoir of My Early Years, \"left off: Her arrival in Los Angeles to film\" Mary Poppins, \"with then-husband Tony Walton and baby Emma in tow. Aided by the diaries she kept throughout her life, some excerpts of which are included in\" Home Work, \"Andrews gives a thoughtful account of her personal and professional highs, lows and everything in between. She tells amusing anecdotes about Alfred Hitchcock teaching her about lenses on\" Tom Curtain, \"her fear of driving on freeways during\" Mary Poppins \"and how Edwards stood up for her when people at a party were trying to pressure her into doing drugs. And she does not shy away from personal stories either: About financial worries, the breakup of her first marriage, deciding to adopt two daughters from an orphanage in Vietnam and her complex relationship with her parents. The book and the TCM evening concludes with\" That's Life!, \"although of course her Hollywood years continued after 1986. But, she said,\" They only wanted x number of pages and I was cutting like crazy anyway. \"Still, it leaves open the possibility of another installment.\" There is so much more if I do write about it, \"Victor/Victoria' on Broadway and\" Princess Diaries' and other things and getting into the book writing, \"Andrews said.\" There might be (another). But not just yet, I only finished it 10 days ago! \"___ Follow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr Lindsey Bahr, The Associated Press"}, {"articleID": "2018012101_00538930_W", "names": {"Donald Mcintyre": ["Q21454438", "Q23616862", "Q330991"]}, "date": "2018-01-21", "url": "http://www.stuff.co.nz/taranaki-daily-news/news/100709220/Taranakis-dairying-past-recalled-in-Our-Milky-Ways-exhibition", "content": "Taranaki's dairying past recalled in \"Our Milky Ways' exhibition CATHERINE GROENESTEIN Last updated 14:08, January 21 2018 Catherine Groenestein Esther Kahukuranui, 9, and her brothers Noah, 7, Tuck, 10, and cousin Katika, 12, enjoyed getting a closeup look of a vintage tractor, part of the Our Milky Ways exhibition at Aotea Utanganui Museum of South Taranaki. A Jersey cow named Jenny walked 250 kilometres to begin her dairying career in Taranaki. Her story is told in Our Milky Ways, a new exhibition on the history of dairying in Taranaki that opened at Aotea Utanganui Museum of South Taranaki on Friday. District archivist Cameron Curd, who curated the display, hopes to gather more stories from visitors sharing their own memories. Catherine Groenestein Keiran Dwyer and his granddaughter Pippa, 5, take a guess how many milk bottle lollies are in a bottle.\" We are hoping that people will bring in objects, stories and photographs that we can add to the exhibition, \"he said. As well as vintage milking equipment and photos, it features six films documenting farm life and how butter and cheese were made in the little dairy factories scattered around the mountain. READ MORE: * Aotea Utanganui museum is rich in material but poor in memories * German couple find the perfect wedding venue in Patea * Museum has Stars all set up Catherine Groenestein Some items from Our Milky Ways exhibition at Aotea Utanganui Museum of South Taranaki. A scarlet 1947 Farmall tractor sits in the centre of the exhibition and the displays are numbered with yellow ear tags. Taranaki's first Jersey cow ambled in to Taranaki in 1876, after being walked 250km from Marton to Bell Block by her new owner William Hulke. A vintage centrifuge machine (circa 1910) was used to test the fat content of milk and ensure that dodgy farmers didn't water down their milk, and a NZ Department of Health sign from 1946 proclaims the benefits of pasteurisation. During the exhibition a series of talks about the future of dairying were planned with speakers from Dairy NZ, Fonterra, and farmers, as well as people from environmental groups, Curd said. Those who preferred a more hands-on approach to learning could try making butter with a vintage butter churn during a workshop that would include eating it on scones with cream and jam. The exhibition was funded by the Taranaki Regional Council and took about four months to prepare and runs until May, he said. It was opened with a brief ceremony on Friday with speeches by Curd and Taranaki Regional Councillor <mark>Donald McIntyre</mark>. One of those attending was farmer Keiran Dwyer of Patea.\" I think it's pretty good, the industry's got a lot of history. \"He remembered using some of the equipment on display during his farming career.\" But not the horse drawn ones, it was tractors and trucks in my time. \"- Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next News story: Star Gym users in limbo as council scrambles to accommodate rugby players Taranaki Daily News Homepage"}, {"articleID": "2020011917_00119348_W", "names": {"Harry Maguire": ["Q165772", "Q5670856"], "Brandon Williams": ["Q16232032", "Q24007026", "Q2923793", "Q4957141", "Q4957142", "Q4957143", "Q4957144", "Q4957145"]}, "date": "2020-01-19", "url": "https://www.dailystar.co.uk/sport/football/jamie-carragher-aims-sly-dig-21314096", "content": "Sign up to FREE daily email alerts from Daily Star - Football Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing See our privacy notice Invalid Email Jamie Carragher has thrown a sly dig at <mark>Harry Maguire</mark> after Virgil van Dijk put Liverpool 1-0 up. The Dutchman jumped highest to head home from a corner in front of the Anfield Road end. Van Dijk was able to get the run and soared above <mark>Maguire</mark>, who has been blamed in part for the goal. The Manchester United defender usurped Van Dijk as the world's most expensive defender in the summer. Leicester held out for much of the summer before the Red Devils stumped up £ 80m to sign the Englishman. It came 18 months after Liverpool had parted with £ 75m to sign Van Dijk from Southampton - a transfer that has more than paid off for Jurgen Klopp. Read More Related Articles Gary Neville explains why Man Utd changed tactics to five defenders against Liverpool Read More Related Articles Roy Keane questions \"worrying' Luke Shaw selection for Man Utd against Liverpool And Carragher was quick to mock United when he said:\" The £ 75m man out jumps the £ 80m man. \"Gary Neville has also criticised his former team for being\" naive \"as they tried to stop the Reds scoring. <mark>Maguire</mark> was blocked off from getting to Van Dijk meaning the Liverpool colossus had to out jump <mark>Brandon Williams</mark> to score. United's task was already a tough one and it now looks even more challenging with the Reds looking relentless this season. Virgil van Dijk of Liverpool scores (Image: Getty Images) Read More Related Articles Man Utd manager Ole Gunnar Solskjaer provides Marcus Rashford injury update Ole Gunnar Solskjaer's side remain the only team to prevent Liverpool from winning this season when they managed to hold them to a 1-1 draw at Old Trafford. The Norwegian has gone with a back five at Anfield and Neville reckons he is trying to deny the home side space. He said:\" I think the reason that United are playing five at the back is purely to make sure the spaces in between the defenders are small. \"I think with a back five, yes it is a bit more defensive but it does leave the chance to leave [Daniel] James and [Anthony] Martial higher up the pitch.\" "}, {"articleID": "2020030509_00034129_W", "names": {"Melissa Hickey": ["Q22687840", "Q28812989"]}, "date": "2020-03-05", "url": "http://tweeddailynews.com.au/news/cats-captain-waiting-on-four-quarter-performance/3960681/", "content": "<mark>Melissa Hickey</mark> of the Cats attempts to mark the ball during the Round 3 AFLW match between the Geelong Cats and the Adelaide Crows at GMHBA Stadium in Geelong. AFL Cats captain waiting on four-quarter performance callum dick callum dick Full Profile Login to follow 5th Mar 2020 8:00 PM premium_icon Subscriber only 0 GEELONG skipper <mark>Melissa Hickey</mark> is not one for cliches, but she says the team's ability to \"stick to the processes\" is what will give it the best chance of playing finals football this season. After going winless through the first three rounds, the Cats righted the ship with a 22-point win over Conference A rivals Richmond at the weekend. <mark>Hickey</mark> said the big win over the Tigers \"took the pressure off a little bit\" after the Cats previously dropped \"pretty gettable\" games to Fremantle, Brisbane and Adelaide. \"Our leanings from the first season were you can't get too up and down throughout the season. You shouldn't be able to tell week to week whether we've won or lost and I feel like we've been good at doing that,\" the skipper said. \"Our first three games were all pretty gettable--we just haven't been able to put together that four-quarter performance just yet.\" Even against Richmond the Cats held a game-high 41-point lead midway through the third term before allowing the Tigers to kick four straight goals and claw back into the contest. \"If I'm being honest we probably walked off against Adelaide (the week before) feeling more content than we did on the weekend, because we had such a lapse in the third quarter,\" <mark>Hickey</mark> said. Geelong AFLW captain <mark>Melissa Hickey</mark>. Photo: Dylan Burns But the 2017 All-Australian has seen enough from her side in year two to know it has risen \"to the next level\" and a four-quarter showing is not far away. \"People outside the club (are) saying the way we move the ball is some of the best across the league,\" <mark>Hickey</mark> said. \"We've got a really young midfield group that has been able to dominate teams and a backline that has stood up well--and I think we're playing some really good, attacking footy.\" Though the pressure valve was released slightly with the win over Richmond, a loss to the Suns tomorrow night would quickly tighten the screws once again as the season comes to a close. <mark>Hickey</mark> said the Cats were well aware of what was at stake and had primed themselves to put in their best performance of the season against the Suns in Mackay. \"It's crucial I think. (A loss) probably doesn't rule us out, but (a win) obviously helps our chances,\" she said. \"It's a pretty even ladder in our conference I think. From third to us (in sixth) there is only one game difference.\" 0 aflw round 5 Read More Login to follow geelong cats Read More Login to follow gold coast suns Read More Login to follow great barrier reef arena mackay Read More Login to follow <mark>melissa hickey</mark> Read More Login to follow aflw round 5 geelong cats gold coast suns great barrier reef arena mackay <mark>melissa hickey</mark>"}, {"articleID": "2008120216_00018907_W", "names": {"Wei Chen": ["Q30504047", "Q38804143", "Q39067124", "Q40792682", "Q43259898", "Q43261223", "Q45409149", "Q45526799", "Q45539322", "Q45597553", "Q45658030", "Q45827207", "Q48045531", "Q49640111", "Q51061948", "Q51166600", "Q52571098", "Q57014261", "Q57158874", "Q57551152", "Q59554664", "Q6968975", "Q7979734", "Q7979735", "Q7979738"]}, "date": "2008-12-02", "url": "http://newswise.com/articles/view/546995/?sc=rsla", "content": "keywords undergraduate research award professor cur council available for logged-in reporters only at a time when the country is looking for research-based solutions to its most pressing problems-finding renewable energy sources, addressing climate changes and advancing conservation efforts-it must encourage and champion promising practices. involving undergraduate students in research and scholarship fosters an engaged learning practice and provides a vehicle for creating new knowledge. newswise - at a time when the country is looking for research-based solutions to its most pressing problems-finding renewable energy sources, addressing climate changes and advancing conservation efforts-it must encourage and champion promising practices. involving undergraduate students in research and scholarship fosters an engaged learning practice and provides a vehicle for creating new knowledge. four faculty members who share a commitment to such hands-on research for their undergraduate students were recently honored as u.s. professors of the year through a program sponsored by the carnegie foundation for the advancement of teaching. \"we applaud these faculty members on their accolade and for investing their time and effort in undergraduate research,\" said cur executive officer nancy hensel. \"by creating opportunities for their students to pursue undergraduate research, these professors are fostering excellence in learning and contributions to the country's research enterprise.\" the honored professors include <mark>wei chen</mark>, professor of biomedical engineering at the university of central oklahoma in edmond, okla.; jerusha detweiler-bedell, associate professor of psychology at lewis & clark college in portland, ore.; eugenia paulus, professor of chemistry at north hennepin community college in brooklyn park, minn.; and michael wesch, assistant professor of cultural anthropology at kansas state university in manhattan, kan. prof. detweiler-bedell's teaching transcends the classroom, and has developed a cocurricular program that has her undergraduates studying a research topic outside class and over time. she does this to prepare them for graduate studies, and provides them opportunities to design their own studies, write research proposals, collect and analyze unique data, and present their findings at national meetings. emphasizing individualized learning based on the student's knowledge and abilities, prof. <mark>chen</mark> supports his undergraduate students in their design research projects and independent research. he advocates a collaborative approach to research, and his biomedical-engineering students work in the laboratories of neighboring universities, research foundations, and medical companies. prof. <mark>chen</mark> says, \"experiential learning through inquiry-based undergraduate research is essential to give our students the competitive edge in today's global economy.\" in another recent nod to the importance of undergraduate research from a university president, it was reported that amy gutmann, president of the university of pennsylvania, made a $100,000 gift to her university to support undergraduate research. about cur: the council on undergraduate research (www.cur.org) supports faculty development for high-quality undergraduate student-faculty collaborative research and scholarship. nearly 600 institutions and 3000 individuals belong to cur. cur believes that the best way to capture student interest and create enthusiasm for a discipline is through research in close collaboration with faculty members."}, {"articleID": "2019080711_00188205_W", "names": {"Joe Schmidt": ["Q284169", "Q6280152"]}, "date": "2019-08-07", "url": "http://www.dudleynews.co.uk/sport/national/17821482.best-ireland-hungry-world-cup-success-six-nations-blip/", "content": "Best: Ireland hungry for World Cup success after Six Nations blip By Press Association 2019 Rory Best believes Ireland must justify their stellar 2018 at this year's World Cup 0 comment Rory Best has challenged Ireland to justify their 2018 Six Nations Grand Slam at this year's World Cup. The Ireland captain believes <mark>Joe Schmidt</mark>'s men must seize the \"reality check\" of turning last term's Grand Slam into a third-place finish this year. The 36-year-old hooker insisted Ireland are the hungriest he has seen them under head coach <mark>Schmidt</mark>, ahead of Saturday's opening World Cup warm-up match against Italy in Dublin. Rory Best will head into his fourth World Cup with Ireland in Japan in September (Brian Lawless/PA) \"When <mark>Joe</mark> first came in the big question was\" how do we perceive ourselves?', and the big answer was \"inconsistent',\" said Best. \"And what we've worked hard to do is to prepare the same whoever we play and whatever we do.\" That's how it's always been under <mark>Joe</mark> and we certainly won't go away from that now. \"It sometimes takes a reality check, and finishing third was bitterly disappointing. Jacob Stockdale scored the winning try as Ireland beat New Zealand 16-9 in November (Niall Carson/PA)\" So coming in at the start of this pre-season everyone is as hungry as I have ever seen them. \"We've had a group of players that want to prove that the 2019 Six Nations was the blip, not 2018.\" Ireland host Italy at the Aviva Stadium on Saturday to kick-start their build-up to the World Cup in Japan. <mark>Schmidt</mark>'s side will launch their World Cup bid by taking on Scotland on September 22, with confidence still riding high among Irish fans of a best-ever tournament. Head coach <mark>Joe Schmidt</mark> will bid to guide Ireland into uncharted waters at this year's World Cup (David Davies/PA) Best and company will face Wales twice and England in completing their warm-up matches before jetting out to Japan. The long-serving Ulster hooker will be 37 by the time the tournament kicks off but admitted feeling as good as ever amid a gruelling pre-season. <mark>Schmidt</mark>'s men are once again bidding to move beyond the quarter-finals for first time, but the Irish public have high confidence their side could even lift the Webb Ellis Cup. New Zealand are seeking a hat-trick of World Cup titles on the run, with Best admitting the All Blacks are still favourites for yet another crown. Steve Hansen will steer New Zealand into another World Cup as favourites (Brian Lawless/PA) But Best also predicted the most open World Cup yet, with Grand Slam champions Wales and a burgeoning England and South Africa also in contention. Asked if the Irish public confidence adds pressure or belief, Best replied: \"It's probably a bit of extra belief. Our biggest pressure comes internally.\" New Zealand are the best team in the world and they are the favourites. But I also think this will be one of the most open World Cups. Watch. @ LukeMcGrath93 & @ Farrell_C93 on the build up to Ireland v Italy on Saturday. #IREvITA #ShoulderToShoulder #TeamOfUs https: //t.co/O9yiDBLBoi--Irish Rugby (@ IrishRugby) August 6, 2019 \"Anyone will feel they can beat anyone on their day. And it's great that Ireland can be one of those teams.\" But we also know that, look at Wales and England in the Six Nations, we can lose to those teams too. \"Best believes Ireland's maiden two victories over back-to-back world champions New Zealand, in Chicago in 2016 and Dublin in autumn 2018, have offered significant confidence boosts. We've created some new #TeamOfUs GIFs Search #TeamOfUs to find them?? @ IrishRugby pic.twitter.com/hebgkT1KhC--Vodafone Ireland (@ VodafoneIreland) August 6, 2019\" That first victory against New Zealand, in Chicago, it felt like we pushed through a ceiling, \"said Best, speaking as a FloGas ambassador.\" But it was hugely important to get the second one, to prove again that we can do it. \"We want to be a team that can prove we can beat anyone and we've not just shown it once, we've shown it twice now.\" 0 comment"}, {"articleID": "2018110618_00414265_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-11-06", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future."}]