[{"articleID": "2016081708_00066480_W", "names": {"Vladimir Nikitin": ["Q15411436", "Q2522628", "Q4319735", "Q4319736"]}, "date": "2016-08-17", "url": "http://www.philstar.com/sports/2016/08/17/1614432/mayweather-rio-roots-us-olympic-boxing-prospect", "content": "Sportshub (Leaderboard Top), pagematch: 1, sectionmatch: 1 Mayweather in Rio, roots for US Olympic boxing prospect By Dan Gelston (Associated Press) | Updated August 17, 2016 - 2:25 pm Floyd Mayweather Jr., left, poses for picture with Shakur Stevenson after Stevenson won a men's bantamweight 56-kg quarterfinals boxing match against Mongolia's Tsendbaatar Erdenebat at the 2016 Summer Olympics in Rio de Janeiro, Brazil, Tuesday, Aug. 16, 2016. | AP Photo/Dan Gelatin RIO DE JANEIRO--His focus seemingly unflappable, Shakur Stevenson was briefly distracted when he heard a familiar voice as he walked out for his Olympic bout. \"Augie! Augie!\" Floyd Mayweather Jr. was in the house and shouting at US boxing assistant coach Augie Sanchez. Stevenson had been bummed out when he was told Mayweather had left the Rio de Janeiro Games. Turned out, the rumor was false and one of Stevenson's biggest fans had the best seat in the arena to watch the top US prospect continue his medal run. \"I got a little more nervous again,\" Stevenson said. Stevenson, who is from Newark, New Jersey, calmed his nerves and made a lasting impression on Mayweather with a convincing win over Mongolian fighter Tsendbaatar Erdenebat. The retired, undefeated Mayweather went wild for the 19-year-old Stevenson in a unanimous decision victory that guaranteed him a medal. Sportshub (Article MRec), pagematch: 1, sectionmatch: 1 And why not? Mayweather saw Stevenson fight with a style in the ring that reminded him of another great fighter. \"I see the next Floyd Mayweather,\" Mayweather said. \"If anybody can break my records, this young kid right here can do it. I truly believe in him.\" Mayweather believed in Stevenson (24-0 in international competition) so much that he expected more than gold for Stevenson--Money May wanted the prized prospect on his blossoming Mayweather Promotions roster. Of course, he'll have to compete with other promoters to grab the best US amateur. \"When I saw him at my gym, I said,\" Who is this guy?' I want to sign him instantly, \"Mayweather said.\" I thought he was a professional. They said he was an amateur but he's got a professional style. He's the No. 1 guy, of course, that I'm interested in. \"All eyes were on Mayweather more than any fighter in the ring. Mayweather is still the undisputed top attraction at the boxing tournament in what was at least his third visit to the venue. The US bronze medalist at the 1996 Atlanta Games smiled when he was shown and introduced on the big screen to a roaring ovation. Dozens of fans hurried his way for selfies. He never removed the earbuds attached to his mobile phone when he posed for a few fans. They were quickly shooed away and blocked off by members of Mayweather's friends known as TMT: The Money Team. Mayweather invited Popo Freitas, a former Brazilian boxing world champion, down to his seat for a quick chat. Mayweather enjoyed the fights, first from the front row of the corner of the bleacher seats, then he moved to dead center for the two American bouts. The 39-year-old Mayweather retired last year after a 49-0 career. The International Boxing Association (AIBA) changed its rules this year to allow professionals to fight at the Olympics, but Mayweather had no interest. He also ruled out a comeback.\" I'm an old man, \"he said, laughing.\" I'm treating my body good, being smart. I was still able to compete at the top level for 20 years. I've done a lot in boxing. I just want to give back to young champions right here. \"Stevenson (wearing a\" Team Shakur \"shirt) and some friends and family joined Mayweather in the stands and posed for even more pictures. But Mayweather's A-list pull might not be enough to convince Stevenson to join the team. Stevenson is widely expected to sign a professional contract in the fall with Top Rank Boxing. Stevenson's grandfather, Wali Moses, began teaching him how to box when he was 5, and he has barely lost since he won his first fight at 8. Stevenson's mother, Malikah, named him after Tupac Shakur, the rapper and social activist who died nine months before her first son was born. Stevenson mostly avoided trouble on Newark's tough streets, and his grandfather's steady influence kept him devoted to his sport. Stevenson remains the brightest candidate to win the first men's gold medal in 12 years from once-proud USA Boxing. Andre Ward was the last American man to claim the top prize with at the 2004 Athens Games, and the London men's team failed to win any medals. Kansas fighter Nico Hernandez snapped the medal drought last week with a bronze. Stevenson has Russian fighter <mark>Vladimir Nikitin</mark> up next and the winner goes for gold. He was all smiles Tuesday when he had Mayweather by his side as they fought through a mob to escape the arena. It's even better for Mayweather to have his back.\" It's everything, \"Stevenson said.\" That's the greatest of all time. \"Sportshub (Article MRec), pagematch: 1, sectionmatch: 1"}, {"articleID": "2009122117_00218171_W", "names": {"Wayne Rogers": ["Q726033", "Q920964"]}, "date": "2009-12-21", "url": "http://radaronline.com/exclusives/2009/12/exclusive-husband-tiger-woods-mistress-discovered-affair", "content": "the husband of one of tiger woods' mistresses discovered the golfer's affair with his wife, radaronline.com has learned. theresa <mark>rogers</mark>, the woman who had the longest affair with tiger woods, was busted by her husband - and continued the affair, sources told radaronline.com exclusively. theresa was married to clothing designer <mark>wayne rogers</mark> during part of the time she was with tiger woods. according to close friends, <mark>wayne</mark> discovered theresa's relationship with tiger and in a bizarre arrangement allowed her to keep seeing the golfing legend. sources reveal that the marriage between theresa and <mark>wayne</mark> was troubled from the beginning. photos: sexy pics of tiger mistress jaimee grubbs as radaronline.com reported exclusively, theresa tried to get pregnant by tiger, without his knowledge. she now has a baby but tiger is not the father and different friends of theresa have different accounts as to who is the baby daddy. exclusive photos of theresa <mark>rogers</mark> another source, who was married to theresa's best friend at the time, says theresa's husband <mark>wayne</mark> found out about her affair with tiger and was not happy about it. \"one time my wife came home and said that <mark>wayne</mark> and theresa were fighting about tiger,\" the source told radaronline.com exclusively. \"apparantly they fought quite a bit. she screwed around on him constantly and was not ok with her cheating on him with tiger woods.\" video interview: castmate reveals tiger mistress wanted george clooney theresa is the only woman known to have had a sexual affair with tiger that began before he got married and continued after he was wed. at age 49, she is regarded as 33-year-old tiger's cougar and she has hired famed attorney gloria allred regarding her relationship with tiger."}, {"articleID": "2013072219_00057519_W", "names": {"Richard Edwards": ["Q20734271", "Q27055794", "Q42554954", "Q5102905", "Q7325461", "Q7325464"]}, "date": "2013-07-22", "url": "http://uk.reuters.com/article/2013/07/22/europe-markets-stocks-switzerland-idUKL6N0FL0VV20130722?feedType=RSS&feedName=rbssFinancialServicesAndRealEstateNews", "content": "* SMI year-to-date outperformance set to fade * Fund flows show cash left Switzerland in June * Options among most expensive in the region - traders LONDON, July 22 (Reuters) - Signs of an impending retreat from buoyant Swiss stocks may signal the start of a new hunger for risk among investors. Swiss equities have been a perfect middle ground for investors moving out of super-low-yield crisis-era havens such as gold, Swiss franc deposits and U.S. Treasuries, but reluctant to dive back into growth-driven, high-yielding securities. Up 16 percent year to date, Swiss stocks have beaten major European bourses, clocking up gains even while safe-haven gold tumbled 24 percent and the riskier end of equities in emerging markets lost 9 percent. Switzerland's blue-chip SMI index has lagged over the past couple of months, however, eking out just 0.6 percent gains since end-April against 4.3 percent for Germany's DAX and 2.6 percent for Britain's FTSE 100. Higher profits for Swiss banks UBS and Julius Baer helped lift the index on Monday. But banks - which typically outperform a rising market - have a greater weighting in the FTSE, while the DAX has more stocks such as carmakers, which also outperform in a rally. Switzerland's blue-chips are weighted more towards stocks seen as \"defensive\" because of the stable demand for their products, such as pharmaceuticals firms and food groups. The Swiss franc's strength versus other currencies - despite a central bank cap on its exchange rate against the euro - may be helping drive investors towards rival markets such as the FTSE, which has been boosted by a weak pound. \"Switzerland is the most defensive (European) market, which explains its outperformance in volatile low growth times,\" said Old Mutual Global Investors fund manager Kevin Lilley. \"But with the broader economy set to improve, it is difficult to see it sustaining this performance relative to the UK and Germany.\" Factors that attracted investors to Switzerland included cash-rich firms with steady earnings that gave a lot back through dividend payouts, such as food company Nestle, and pharmas Roche and Novartis. While that largesse remains - all three have a forward dividend yield around 3.5 percent - the market's \"hunt for yield\" in the face of low bond market returns has left regional peers looking more attractive on a valuation basis. The FTSE 100 trades on a price to earnings (P/E) ratio of 13.6 while the DAX is on a P/E ratio of 13.5 - both cheaper than the Swiss SMI's P/E of 18.2. A desire to tap into that better growth outlook has already seen money leave Swiss equity funds for 11 straight weeks to the end of June, data from fund flow tracker firm EPFR showed. And while some, such as Morgan Stanley, still favour Switzerland, further outflows are likely to follow. ING Investment Management senior equities strategist Patrick Moonen, said he was considering cutting Swiss equities to \"underweight\" from \"neutral\" , while HED Capital chief <mark>Richard Edwards</mark> has also advised clients to sell any rallies in the SMI. For those who choose to remain invested, the cost of buying protection against future price falls in the options market has increased over the last two months and now ranks among the most expensive in Europe. We welcome comments that advance the story through relevant opinion, anecdotes, links and data. If you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. Views expressed in the comments do not represent those of Reuters. For more information on our comment policy, see http: //blogs.reuters.com/fulldisclosure/2010/09/27/toward-a-more-thoughtful-conversation-on-stories/ Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance Thomson Reuters is the world's largest international multimedia news agency, providing, and interactive television platforms. Thomson Reuters journalists are subject to an"}, {"articleID": "2016120501_00475508_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Jack Dalrymple": ["Q16241268", "Q770393"], "Steven Perry": ["Q28857176", "Q51883997", "Q7615138"]}, "date": "2016-12-05", "url": "http://theworldlink.com/business/the-latest-protesters-cheer-army-corps-decision/article_d2a0ea51-a1eb-555f-9ce7-bd1f3f6be9d1.html", "content": "CANNON BALL, N.D. (AP)--The Latest on the Dakota Access pipeline protest (all times local): 5:35 p.m. Hundreds of demonstrators near the Dakota Access pipeline protest camp broke into cheers and chanted \"water is life\" in the Lakota Sioux language as news spread that the federal government won't grant an easement for the project in southern North Dakota. Some in the crowd banged drums. Miles Allard of the Standing Rock Sioux tribe said he was pleased by the decision but remained cautious, saying opponents of the pipeline \"don't know what <mark>Trump</mark> is going to do.\" Allard says he's been telling his people \"to stand up and not to leave until this is over.\" Carla Youngbear of the Meskwaki Potawatomi tribe traveled from central Kansas to be at the protest site. She says she has grandchildren and is going to have great-grandchildren who will need water and that's why she was there. ___ 4:55 p.m.. The Morton County Sheriff's Office says that it has lifted the blockade on a bridge north of the large Dakota Access oil pipeline protest encampment. In a statement, it said that it won't be near the bridge as long as protesters stick to the conditions outlined on Saturday, including only coming to the bridge for predetermined meetings with law enforcement. The release did not comment on the U.S. Army Corps' decision to not grant an easement for the four-state, $3.8 billion pipeline under Lake Oahe, a Missouri River reservoir from which the Standing Rock Sioux tribe gets its drinking water. The large Oceti Sakowin camp is south of the Backwater Bridge, and several hundred people are camped there. ___ 4:15 p.m. U.S. Attorney General Loretta Lynch says that the Department of Justice will still monitor the protest in North Dakota and is ready to \"provide resources\" for those who \"can play a constructive role in easing tensions.\" The U.S. Army Corps of Engineers said Sunday afternoon that the four-state, $3.8 billion Dakota Access oil pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. North Dakota Gov. <mark>Jack Dalrymple</mark> said in a statement that the Corps' decision \"is a serious mistake,\" \"prolongs the serious problems\" that law enforcement faces and \"prolongs the dangerous situation\" of people camping in cold, snowy conditions. The federal government has ordered the several hundred people at the main encampment, which is on Corps land, by Monday. Lynch said in a statement that the safety of those in the area, including officers, residents and protesters, \"continues to be our foremost concern.\" ___ 4:10 p.m. North Dakota Republican Rep. Kevin Cramer says that the Army Corps' decision not to grant an easement for the Dakota Access oil pipeline is \"a very chilling signal\" for the future of infrastructure in the U.S. Cramer said in a statement that infrastructure will be hard to build \"when criminal behavior is rewarded this way,\" apparently referring to the large protest encampment on federal land and the clashes between demonstrators and law enforcement. The Corps said Sunday afternoon that the pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. Cramer also said that \"law and order\" will be restored when <mark>Donald Trump</mark> takes office and that he feels bad for the Corps having to do \"diligent work...only to have their Commander-in-Chief throw them under the bus.\" ___ 4 p.m.. The Secretary of the Interior says the Army Corps' decision to not grant an easement for the Dakota Access oil pipeline \"ensures there will be an in-depth evaluation of alternative routes.\" Sally Jewell also said in a statement that the decision \"underscores that tribal rights...are essential components of the analysis\" for the environmental impact statement. The Corps said Sunday afternoon that the pipeline cannot be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. The company constructing the pipeline, Dallas-based Energy Transfer Partners, and the Morton County Sheriff's Office didn't have immediate comment. ___ 3:45 p.m. U.S. Army Corps of Engineers says it won't grant an easement for the Dakota Access oil pipeline in southern North Dakota. Corps spokeswoman Moria Kelley said in a news release Sunday that the administration will not allow the four-state, $3.8 billion pipeline to be built under Lake Oahe, a Missouri River reservoir where construction had been on hold. Assistant Secretary for Civil Works Jo-Ellen Darcy said her decision was based on the need to \"explore alternate routes\" for the pipeline's crossing. The route has been the subject of months of protests by the Standing Rock Sioux tribe and others, who have argued the pipeline threatens a water source and cultural sites. The company constructing the pipeline, Dallas-based Energy Transfer Partners, and the Morton County Sheriff's Office didn't have immediate comment. The federal government has ordered people to leave the main encampment, which is on Army Corps of Engineers' land and is close to the construction site, by Monday. Demonstrators say they're prepared to stay, and federal, state and local authorities say they won't forcibly remove the protesters. ___ 2:45 p.m.. A disabled Gulf War veteran from Flint, Michigan, says he sees irony in the parallels between his city's lead-tainted water issue and the four-state Dakota Access pipeline. Art Woodson is a disabled Gulf War veteran who served in the Army and drove to the main protest encampment from North Dakota with two others--a 17-hour nonstop drive. He's here as part of the Veterans Stand for Standing Rock group. The 49-year-old says he is showing is support for \"Native Americans and for water,\" because Flint residents know \"that water is in dire need.\" Woodson also said that \"they're trying to force pipes on people\" but that \"we're trying to get pipes in Flint for safe water.\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the $3.8 billion pipeline, but it wasn't clear how many actually arrived. The government has ordered people to leave the encampment by Monday. Demonstrators say they're prepared to stay. ___ 1:30 p.m. Get news headlines sent daily to your inbox Sign Up! I understand and agree that registration on or use of this site consitutes agreement to its user agreement and privacy policy. A Vietnam veteran who's part of a Michigan tribe says he came to the Dakota Access pipeline protest camp because the issue of water quality is \"an issue for everyone.\" Sixty-six-year-old <mark>Steven Perry</mark> is from Traverse City, Michigan, and a member of the Little Traverse Bay band of Odawa Indians. He came to help at the Oceti Sakowin camp, which is on federal land in southern North Dakota, as part of the Veterans Stand for Standing Rock group. <mark>Perry</mark> says: \"When we fought for this country, we fought for everyone.\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the four-state, $3.8 billion pipeline, but it wasn't clear how many actually arrived. The government has ordered people to leave the main encampment by Monday, but demonstrators say they're prepared to stay. Federal, state and local authorities say they won't forcibly remove the protesters. ___ 1:25 p.m.. An organizer with the Veterans Stand for Standing Rock has told a gathering of veterans near the Dakota Access pipeline protest site that elders have asked they have no confrontations with authorities. Organizer Wes Clark Jr., the son of former Democratic presidential candidate Gen. Wesley Clark, spoke to about 250 veterans Sunday afternoon. State authorities have said they talked with the veterans group and will move away Sunday afternoon from the Blackwater Bridge that's north of the Oceti Sakowin camp on federal land if protesters agree to certain conditions. Wes Clark Jr. spoke of that agreement, saying the National Guard and law enforcement have armored vehicles and are armed. He added: \"If we come forward, they will attack us.\" The group had said about 2,000 veterans were going to the camp, where several hundred people have for months protested the four-state, $3.8 billion pipeline, but it wasn't clear how many actually arrived. Clark asked veterans to help out anyone who needs it at camp. ___ 11:10 a.m.. A Navy veteran and Harvard graduate student says he came to the Dakota Access pipeline protest camp because he thought they could use his help. Twenty-nine-year-old Art Grayson of Cambridge, Massachusetts, said he came to the encampment as part of the Veterans Stand for Standing Rock group. He flew, then met up with other veterans and rode the final leg of the trip from Bismarck in the back of a pickup truck. Hundreds of veterans are expected to come to the camp on federal land, where several hundred people have been in protest of the four-state, $3.8 billion pipeline for months. Grayson said that he \"couldn't stand by and watch people being abused.\" He has finals this week, but told his professors \"I'll see you when I get back.\" The group's GoFundMe.com page had raised more than $1 million of its $1.2 million goal on Sunday, which is to go toward food, transportation and supplies. ___ 7:25 a.m. Authorities in North Dakota say they'll move away from a bridge near the main Dakota Access pipeline protest camp by Sunday afternoon if demonstrators agree to certain conditions. A Morton County Sheriff's Office news release details the conditions as outlined Saturday by Cass County Sheriff Paul Laney, which he said are meant to de-escalate conflict. They include staying in the Oceti Sakowin camp that's south of the Backwater Bridge, coming to it only if there is a prearranged meeting with law enforcement and not removing barriers. Standing Rock Sioux tribal chairman Dave Archambault and Gov. <mark>Jack Dalrymple</mark> have agreed to meet. Archambault told the Bismarck Tribune this weekend that he wanted the blockade on the bridge, damaged in late October during a protest, lifted. Hundreds of veterans are due to gather Sunday on the reservation."}, {"articleID": "2020012611_00093006_W", "names": {"Abdul Jabbar": ["Q21228198", "Q24005531", "Q27983427", "Q38804899", "Q4665421", "Q4665424", "Q4665426", "Q56275483"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2020-01-26", "url": "http://home.nzcity.co.nz/nl.aspx?4430886", "content": "LeBron James surpasses Kobe Bryant in NBA's all-time scoring list 26 Jan From the section Basketball Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/basketball/51254093 Read more about sharing. James is in his second season with the Lakers having previously played for the Cleveland Cavaliers and Miami Heat LeBron James surpassed Kobe Bryant to become the NBA's third-highest scorer of all time in the LA Lakers' 108-91 defeat by the Philadelphia 76ers. James, 35, scored 29 points to move to 33,655 career points, 12 more than former Lakers star Bryant. Kareem <mark>Abdul Jabbar</mark>, the ex-Lakers and Milwaukee Bucks centre, is the NBA's all-time top scorer on 38,387 points. Former Utah Jazz forward Karl Malone, who also briefly played for the Lakers, is second on 36,928. \"I'm happy just to be in any conversation with Kobe Bryant,\" said James. \"One of the all-time greatest basketball players to ever play, one of the all-time greatest Lakers.\" The man's got two jerseys hanging up in Staples Center. It's just crazy. \"James, in his 17th NBA season, received a standing ovation from the Philadelphia crowd after scoring the basket that saw him pass Bryant's total in the third quarter. Bryant tweeted:\" Continuing to move the game forward. Much respect my brother. \"Tobias Harris and Ben Simmons scored 29 and 28 points respectively to lead the Sixers to victory. Top 10 all-time NBA scorers Kareem Abdul-Jabbar - 38,387 Karl Malone - 36,928 LeBron James - 33,655 Kobe Bryant - 33,643 <mark>Michael Jordan</mark> - 32,292 Dirk Nowitzki - 31,560 Wilt Chamberlain - 31,419 Shaquille O'Neal - 28,596 Moses Malone - 27,409 Elvin Hayes - 27,313"}, {"articleID": "2014101317_00087770_W", "names": {"Alan Cross": ["Q27070265", "Q4706448", "Q4706450"]}, "date": "2014-10-13", "url": "http://ajournalofmusicalthings.com/listen-david-bowies-new-song-sue-season-crime/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Published on October 13th, 2014 | by <mark>Alan Cross</mark> Listen to David Bowie's New Song, \"Sue (Or in a Season of Crime)\" A Journal of Musical ThingsWeek 6 in the NFL: Players Still Wearing Beats Headphones Despite League Ban - A Journal of Musical Things Notice Anything Different About Week 5 of the NFL Season? (Hint: Think Headphones) A Journal of Musical ThingsNow We Call It \"EDM.\" That's Just the Latest Label Given to Un-Label-able Music - A Journal of Musical Things"}, {"articleID": "2015030416_00080869_W", "names": {"David Palmer": ["Q1067643", "Q11320286", "Q15919849", "Q16491794", "Q263636", "Q3018577", "Q5238361", "Q5238362", "Q5238363", "Q5238365", "Q56285770", "Q57579829"], "Paul Schneider": ["Q1375823", "Q16216070", "Q2062278", "Q7148975", "Q7153473", "Q7153474", "Q832160"]}, "date": "2015-03-04", "url": "http://theatlantic.com/entertainment/archive/2015/03/what-it-takes-to-be-a-female-president-on-tv/385970", "content": "Unbreakable Kimmy Schmidt and the Sunny Side of Surviving Television Loves Female Presidents, as Long as They're Republican Liberia have done it, too. When it comes to electing a female head of state, America still has a way to go, but almost 10 years ago, the short-lived ABC series Commander in Chief introduced the idea to television audiences via a character played by Geena Davis. Since then, NBC's political thriller State of Affairs has become the sixth show to feature a woman in situ in the Oval Office, while Scandal's latest season has teased the idea of the First Lady running for president. The trope's reappearance feels especially timely: With many expecting Hillary Clinton to announce her candidacy for the 2016 race, the possibility of a female president in the U.S. looms large. While television is leaps ahead of the nation, writers and producers have struggled with the same public ambivalence surrounding the concept of a female president as pollsters and politicians have. Although a 2007 Gallup poll found that 88 percent of Americans said they'd vote for a well-qualified female candidate, a 2015 Pew study found that just four in 10 Americans said they hoped to see a woman president in their lifetime-with the numbers diverging dramatically along gender and party lines. Fictional portrayals of female presidents have therefore been meticulously crafted to avoid alienating audiences. Two trends immediately emerge after judging the small sample size of onscreen female presidents: Not one is an obvious Democrat, despite polls revealing Democrats are most enthusiastic about the idea of a female commander-in-chief. And only one seems to have been elected entirely on her own merits-the others were all either part of political dynasties or were vice presidents who filled vacancies when the need arose. Pop culture has long been pegged for its role in shifting public opinion on social issues, speculated that <mark>David Palmer</mark>, who played a black president on Fox's 24 from 2001 to 2006, warmed voters to the idea of electing Barack Obama a few years later (has also been name-checked). If the race of a president on television could affect how voters feel on the subject, it stands to reason gender could have the same effect. Rod Lurie, the creator of Commander in Chief, has even said he made President Allen a Republican to address critics vote Democrat, why would all of the female TV presidents be Republican or centrist? The short answer is: It's not a conspiracy. Showrunners and writers serve three masters when creating a show, says the producer Tom Nunan. They have to figure out what provides the most conflict in a series, what's the most unpredictable thing a show can do, and what might be predictive about culture. A Republican female president adds an element of unpredictability that wouldn't be achieved by writing a carbon copy of Hillary Clinton or Senator Elizabeth Warren. According to Nunan, the vast majority of writers are left-leaning and usually create characters that represent the opposite of their own political beliefs. Because there have only been so few female presidents on TV, it appears to be merely a coincidence that most of them have been Republican. The nature of the show matters too: Party affiliation is presumably more important for a drama like The West Wing that touches on actual politics, as opposed to the more soap-operaesque plots of Scandal and Commander in Chief. Veep, meanwhile, makes a conscious effort to leave Selina's party deliberately ambiguous. In an interview with Politico, the show's creator Armando Ianucci said \"I don't want to get bogged down in party politics and make it a comedy about being a Democrat or being a Republican.\" Barring the political biases of the creators of The West Wing and 24, showrunners rarely tend to push ulterior motives with partisan projects, since they run the risk of alienating the network or a portion of the audience. \"As a general rule, networks don't like projects with agendas,\" says <mark>Paul Schneider</mark>, chair of the department of film and television at Boston University. There is one character who's somewhat atypical. State of Affairs' Constance Payton served in the Air Force in the first Gulf War and was a California senator before becoming the first African-American female head of state. Her husband (a lawyer) wasn't president before she was, so it's safe to say that she earned her spot in the White House without the help of nepotism or fate. On the other hand, Alfre Woodard, who plays Payton, has said her character is the like Utah Representative Mia Love. This is what makes it noteworthy that most of the female presidents on television got the job with a little help. This doesn't mean these women are portrayed as undeserving or incompetent, though. In 24, Allison Taylor's father was a senator, and she filled his seat before running for president. In Commander in Chief and Scandal, the vice presidents rose to take the seats of their predecessors (Sally Langston did so briefly when when President Grant was in a coma). In Veep, Selina Meyer became president after the sitting POTUS stepped down. And, because there has to be a murder at some point, Vice-President Caroline Reynolds assassinated the president on Prison Break. Certainly, the idea of Hillary as president, last teased in the 2008 Democratic primary, has captured the imagination of television studios. CBS' political drama based on the former secretary of state and the 2012 Benghazi scandal, and in 2012, USA aired the mini-series Conservatives Can't Trust Talk Radio to Cover Foreign Policy Join the Discussion After you comment, click Post. If you're not already logged in you will be asked to log in or register with Disqus. Please note that The Atlantic's account system is separate from our commenting system. To log in or register with The Atlantic, use the Sign In button at the top of every page. 24 Images A Visit to Aoshima, a Japanese \"Cat Island' Ruth Bader Ginsburg Attacks Standing of Anti-Obamacare Plaintiffs The fall of King <mark>David</mark>; Austin wasn't surprised about Tikrit; Dempsey leans forward on Ukraine; No\" stache for Welsh; A reception for Turner; And a bit more."}, {"articleID": "2018112018_00129721_W", "names": {"Sarah Taylor": ["Q21456568", "Q27050698", "Q3527116", "Q44741854", "Q52644620", "Q57414123", "Q7422821", "Q9333844"]}, "date": "2018-11-20", "url": "http://www.croydonguardian.co.uk/sport/national/17236387.jonny-bairstow-still-playing-for-keeps-but-willing-to-do-what-is-asked-of-him/", "content": "Jonny Bairstow is hoping to get back in England's Test team 0 comments Jonny Bairstow is not ready to give up his wicketkeeping aspirations but will throw himself into any role that gets him back in England's Test team. Bairstow arrived in Sri Lanka as undisputed first-choice gloveman only for an untimely ankle injury to open the door for Ben Foakes in Galle. The Surrey man took it in style, scoring a debut century and producing an effortlessly smooth performance behind the stumps which saw Bairstow overlooked for the series-clinching win in Kandy despite being passed fit. Could watch Ben Foakes keep all day! #SLvENG @ SkyCricket--<mark>Sarah Taylor</mark> (@ Sarah_Taylor30) November 15, 2018 Head coach Trevor Bayliss has already suggested Foakes can expect an extended run in the team but Bairstow, having worked tirelessly to improve his keeping in recent years, is not going to meekly stand aside from a role he treasures. \"You don't want to accept that, do you? You don't know what's round the corner, so I'm working on both my primary skills, like I have done over the last three years,\" he said. \"It was only three Tests ago I was in the top 10 batters in the world and then you're not playing. But if we want to push each other, and push other teams around the world, then that competition is really good for us, because we're going to be striving to be better, striving to score more runs, striving to be a better keeper, to take better catches. Jonny Bairstow was not picked in the second Test (Steven Paston/PA)\" Naturally, you're going to be disappointed, but it's about how you manage that disappointment. That's part and parcel of touring, of professional sport. \"You react by going away, working hard, training hard and doing the right things around the guys, because you don't want to be going around sulking, not helping the lads out.\" In the short term, Bairstow's best chance of returning to the team is as a top-order specialist. He already plays a similar role in the one-day side and has played 18 of his 59 Tests as a non-keeping batsman. Boy can bat. #SRIvENG #BenFoakes pic.twitter.com/9VnKuyt1Fo--Gray-Nicolls?? (@ graynics) November 16, 2018 There has been speculation he could find a home in the problem position of number three, which has already been filled by Joe Root, Moeen Ali and Ben Stokes this year. Bairstow does not appear to covet the spot but is a flexible cricketer who has answered several different calls over the years. \"We've got to cross that bridge when we come to it. But in all of the challenges that have been out in front of me, I'd like to think I've recognised them and hopefully combated them in many ways,\" he said. Bairstow has established himself as a big-hitter in one-day cricket (David Davies/PA) \"People said about opening the batting in one-day cricket--can you do it?--let's give it a whirl and see how you go. Can you bat at five? Can you bat at five and keep wicket? Can you bat at seven and keep wicket? It's still going now.\" Whatever the circumstances, it's not something I've done a massive amount of, but coming in against the second new ball, you're doing the same thing there. I might just have to leave a few more balls. \"That he is debating how and where he might slot back into the team on Friday in Colombo is something of a triumph in itself. He is already considerably ahead of schedule in terms of fitness, and admits he briefly feared an even more serious lay-off.\" I thought I'd broken my ankle, \"he admitted.\" I've not told everyone how bad I did it. Everything goes through your mind in those two or three minutes. You don't know the extent of things when you do them straightaway. To be back fit ahead of the second Test, and to be available for that game, was good going. \"0 comments"}, {"articleID": "2011050621_00038448_W", "names": {"Eddie Murphy": ["Q16095779", "Q43874", "Q5336342"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"]}, "date": "2011-05-06", "url": "http://vibe.com/video/v-exclusive-behinds-scenes-ledisi-pieces-me-0", "content": "our west coast editor jamal munnerlyn (@ vibe_jrock) went behind the scenes on the set of ledisi's new video ballers: have a peek inside rihanna's 7 million dollar s & m shack tranny claims to have had sex with ll cool j & <mark>eddie murphy</mark>; ll cool j denies allegations paris hilton fires shots at lindsay lohan: \"i give away jewelry, she steals!\" [video] jay-z could end up in court over \"big pimpin' sample hitmaking producer nottz to create soundtrack for new movie <mark>chris paul</mark> to celebrate successful\" rookie' year of afterschool program in new orleans shane mosley's sugartime (ep. 3): shane on training in big bear jordin sparks premieres new empowerment single' i am woman' jordin sparks releases' i am woman,' reveals deets of her rockin' new bod photos: 40 revealing kim kardashian bikini pics photos: meet sheryl crow's new boyfriend nene leakes attacks radio host [audio] will strong hair hold my hairstyle longer?"}, {"articleID": "2013022818_00036545_W", "names": {"Ricardo Alarcon": ["Q1345182", "Q6107973"]}, "date": "2013-02-28", "url": "http://peoplesworld.org/raul-castro-elected-to-final-term-as-president-of-cuba/", "content": "> raul castro elected to final term as president of cuba raul castro elected to final term as president of cuba raul castro was elected to his second term as cuban president february 24, but he said it would be his last. national assembly voted for the country's leadership for the next five years. he also said that he hopes to establish two-term limits and age caps for political offices including the presidency. as the new first vice-president of the council of state - cuba's cabinet - 52-year-old mr. diaz-canel has risen higher than any other official who didn't directly participate in the 1959 revolution. the president hinted at other changes to the constitution. but he scotched any idea that the country would abandon socialism, saying he had not assumed the presidency in order to destroy cuba's system. \"i was not chosen to be president to restore capitalism to cuba,\" he said. \"i was elected to defend, maintain and continue to perfect socialism, not destroy it.\" cuba is at a moment of \"historic transcendence,\" mr. castro told mps while announcing his new number two, who replaces 81-year-old jose ramon machado ventura, a veteran of the armed struggle against former dictator fulgencio batista. the president praised mr. ventura and another aging revolutionary for offering to leave their positions so that younger leaders could move up. their selflessness is \"a concrete demonstration of their genuine revolutionary fiber...the essence of the founding generation of this revolution.\" mr. castro said that mr. diaz-canel's promotion \"represents a definitive step in the configuration of the future leadership of the nation through the gradual and orderly transfer of key roles to new generations.\" our greatest satisfaction is the tranquility and serene confidence we feel as we deliver to the new generations the responsibility to continue building socialism, \"he added. the 612 mps sworn in named esteban lazo as the first new national assembly chief in 20 years, replacing <mark>ricardo alarcon</mark> who retired to work on the. and mps elected mr. ventura, comptroller general gladys bejerano, second vice-president ramiro valdes, havana communist party secretary lazara mercedes lopez acea and head of cuba's trade union salvador valdes mesa the new vice-presidents of the state council. morning star photo: cuba's new vice-president miguel diaz-canel, right, listens to cuba's president raul castro during the closing session at the national assembly in havana, cuba, feb. 24. ramon espinosa/ap"}]