[{"articleID": "2018060100_00159229_W", "names": {"John Cooke": ["Q15637838", "Q19667214", "Q21460847", "Q22958846", "Q28962198", "Q40476653", "Q58049053", "Q6227025", "Q6227029"]}, "date": "2018-05-31", "url": "http://www.reporterherald.com/news/larimer-county/ci_31915359/gov-hickenlooper-signs-transportation-bill-big-thompson-canyon", "content": "Gov. Hickenlooper signs transportation bill in Big Thompson Canyon Measure will fund $645 million for road projects in 2018-19 By Pamela Johnson Reporter-Herald Staff Writer Posted: 05/31/2018 06:30:28 PM MDT Gov. John Hickelooper is surrounded by legislators as he signs a major transportation funding bill Thursday, during an event to celebrate the reopening of U.S. 34 west of Loveland. (Jenny Sparks / Loveland Reporter-Herald) With the newly completed Big Thompson Canyon roadway in the background, Gov. John Hickenlooper signed into law Thursday a bill to provide millions of dollars in extra funding to transportation statewide. At the site of a new bridge rerouting U.S. 34 away from the river in the canyon, west of Loveland, Hickenlooper and other state lawmakers lauded Senate Bill 1, a measure that will infuse $645 million into Colorado transportation in 2018 and 2019. \"It's not enough for what the state needs, but it certainly is a start,\" said Hickenlooper, adding that the bipartisan bill is one of the largest boosts to transportation in Colorado history. State lawmakers credited cooperation across party lines for accomplishing the bill, which lawmakers from across Colorado said will add $495 million to this year's transportation budget, $150 million to next year's and an additional $50 million in ongoing funding per year for the next of 20 years. The $495 million will be split with $346.5 million going to the Colorado Department of Transportation for projects statewide, while $74.5 million will funnel to projects on the local level statewide and another $74.5 million will be dedicated to multimodal projects on both the state and local levels, according to a summary of the legislation. Advertisement Sen. <mark>John Cooke</mark>, a Weld County Republican, was one of five sponsors of the bipartisan bill, which he called \"government at its best.\" He said the money will help meet the state's infrastructure needs. \"We're going to have a wonderful transportation system eventually,\" said <mark>Cooke</mark>. With many of the bills sponsors and other legislators surrounding him, Hickenlooper signed on the dotted line at exactly 11:52 a.m. May 31, according to those surrounding him; they noted the exact time to mark what they described as a momentous accomplishment. Larimer County Commissioner Tom Donnelly, after the ceremony, said that while other means of funding will be necessary to meet all the state's transportation needs, including widening of Interstate 25 and U.S. 34 around Loveland, the passage of Senate Bill 1 was a step in the right direction. \"Everyone who drives ---all of us as we drive to work, as we drive our kids to school, when we recreate on the weekend--knows we seriously underfund transportation,\" Donnelly said. \"Anything done to fund transportation is important. This is only a first step.\" Pamela Johnson: 970-699-5405, johnsonp @ reporter-herald.com"}, {"articleID": "2011011516_00059278_W", "names": {"Ryan Miller": ["Q1521532", "Q24005534", "Q250011", "Q29998663", "Q3943079", "Q58227811", "Q7384338", "Q7384339"]}, "date": "2011-01-15", "url": "http://bellinghamherald.com/2011/01/15/1817794/buffalo-sabres-19-19-5-at-new.html", "content": "0 comments posted: saturday, jan. 15, 2011 the new york islanders will try to get back on track and avoid a fourth straight loss when they welcome the buffalo sabres for tonight's battle at nassau coliseum. new york, which is seeded 14th out of 15 teams in the eastern conference, had been playing its best hockey of the season just a few weeks back, but the isles have lost three in a row after going 8-2-1 in their previous 11 games. new york had also won three straight on home ice before losing the first two games of its current five-game homestand. the isles are just 7-8-4 as the host club this season. the islanders are 0-2-1 during their current three-game slide, which is the team's worst skid since it dropped six in a row from dec. 2-13. new york's most recent setback came thursday evening against visiting ottawa, which halted a six-game losing streak with a 6-4 victory at the coliseum. robin lehner recorded a win in his first nhl start with 20 saves for the senators. milan jurcina posted a goal and an assist for the islanders. trevor gillies, p.a. parenteau and blake comeau each tallied in the loss. kevin poulin started the game for new york, but after giving up two goals on eight shots, he was pulled in favor for nathan lawson, who then gave up four second period goals. poulin came back in the third where he made 11 saves. \"i don't think they played bad,\" parenteau said of the isles' goalie play. \"there was a few bad bounces in the second period. i don't think we played very well in front them.\" with regular starter rick dipietro hampered by a strained adductor muscle, it is expected that either poulin or fellow rookie lawson will get the start tonight. isles forward frans nielsen is also questionable for tonight after missing the last five games with a strained groin. tonight marks the first of four meetings between the isles and sabres this season. the entire season series will be contested over the span of a month, as the clubs will meet for a home-and-home set on jan. 21 and 23 before capping the series in buffalo on feb. 13. the clubs split four meetings a year ago, but the sabres have taken six of the last 10 encounters overall. buffalo has dropped three straight and five of its last seven tilts on long island. the sabres have won three of their last four games and they have suffered just one regulation loss in seven games (5-1-1). the lone regulation setback over that span came in tuesday's 5-2 loss to philadelphia, but buffalo was able to rebound two nights later with a win against carolina <mark>ryan miller</mark> made 27 saves and thomas vanek set up two goals, helping the sabres skate to the 3-2 win over the visiting hurricanes. nathan gerbe, cody mccormick, and drew stafford also scored for the sabres. \"we were smarter, we were more patient and we gained momentum as we went on,\" sabres head coach lindy ruff said. buffalo is 9-8-4 as the visiting team this year and will shoot for a third straight road victory tonight. what you should know about new story comment system - click here story comments now powered by disqus comments that include profanity or commercial messages / \"spam\" will not be posted until approved by a moderator. multiple posts of the same comment will be deleted. if you find a comment profane, libelous or threatening, we invite you to click \"flag\" on the comment for a moderator to review. comments deemed to be profane, libelous, contain threat of physical violence, plagiarized or in violation of copyright will be deleted."}, {"articleID": "2016022320_00545384_W", "names": {"Milan Nikolić": ["Q3207761", "Q6850641", "Q971923", "Q983518"], "Vladimir Vučković": ["Q25459198", "Q31186711"], "Ken Anderson": ["Q11738690", "Q16165619", "Q19609582", "Q297240", "Q3195010", "Q6387236"], "James Connolly": ["Q16066341", "Q22003703"], "Michael Collins": ["Q104859", "Q11989252", "Q16194009", "Q1927172", "Q1927175", "Q20090483", "Q21458653", "Q23006319", "Q24631029", "Q3308116", "Q3308121", "Q3856136", "Q6829378", "Q6829379", "Q6829380", "Q6829382", "Q6829383", "Q6829384", "Q6829385", "Q6829386", "Q6829387"]}, "date": "2016-02-22", "url": "http://codfanfic.wikia.com/wiki/Bosnia_Nights?diff=66218&oldid=46059", "content": "Changes: Bosnia Nights Edit Back to page Revision as of 00:45, August 15, 2013 (edit) Mob Hitman29 (wall | contribs) ← Older edit Latest revision as of 21:36, February 22, 2016 (edit) (undo) 188.51.153.11 (wall) Line 1: Line 1: − WARNING! Contains strong language, strong violence, mild racism, political nature and rape. Recommended for a mature audience and not for those who are ignorant of the Bosnian war, neo-cons and the politically \"correct\" . + WARNING! Contains strong language, strong violence, mild racism, political na − − This story is dedicated to a country that unfortunately doesn't exist anymore...= = Prologue = = = = Prologue = = − The rockets fired every so often briefly lighting up the sky. We were running through a town trying to take cover. I was a Poručnik in the VRS can't say I was proud to fight under Mladić nor can I say I was proud to have fought in the war. I was called up about a year and a half ago and they gave me the choice to prove myself in an officer school. I graduated after six months. A lifelong friend of mine, Boris Kovač was under my command, the kids back home had nicknamed him Mišo because his mother is a Croat but the joke wasn't well thought of since she's from Istria not Dalmatia. A number of my men were students including our engineer Zupan and our medic Bobienski. We were all conscripted except for a farmer named Vuk Stojanović who volunteered for the sake of killing Muslims and Croats to suit his Chetnik lifestyle and sadly for him I haven't committed such crimes and don't plan either. In the distance we then seen a church and graveyard were we would take cover from the artillery. + The rockets fired every so often briefly lighting up the sky. We were running through a town trying to take cover. I was a Poručnik in the VRS can't say I was proud to fight under Mladić nor can I say I was proud to have fought in the war. I was called up about a year and a half ago and they gave me the choice to prove myself in an officer school. I graduated after six months. A lifelong friend of mine, Boris Kovač was under my command, the kids back home had nicknato suit his Chetnik lifestyle and sadly for him I haven't committed such crimes and don't plan either. In the distance we then seen a church and graveyard were we would take cover from the artillery. Line 32: Line 32: = = Chapter 3 = = = = Chapter 3 = = − We patrolled the empty the town after hearing about Islamist movement nearby. Our home town was called Vodopadi Crkvi, it had been historically a Serb town with a large Croat minority and the first Muslims never came until after the Second World War. The town had two churches, one Serb and one Catholic and a mosque all three of them were beautiful however that didn't stop them being burned out of bigotry. Vodopadi Crkvi was an idol town for Brotherhood and Unity were Serbs, Croats and Muslims lived together, went to the same school and interethnic marriage was also quite common. I walked into the school, it was damaged but no looted like so much more of the town, the large portrait of Tito hung slanted in the entrance corridor next to the resource room. + We patrolled the empty the town after hearing about Islamist movement nearby. Our home town was called Vodopadi Crkvi, it had been historically a Serb town with a large Croat minority anted in the entrance corridor next to the resource room. Line 46: Line 46: = = Chapter 4 = = = = Chapter 4 = = − It was early in the morning just a night after we were in Vodopadi Crkvi we approached a hamlet. Three of our soldiers were about to rape a Bosniak woman but McCourt fired at them wounding them, the woman got up and ran and McCourt went over to one of the soldiers and started pissing on him. I started talking to my squad \"Okay I'm going as in ditching the army and heading to my family in Greece\" and Bobienski responded \"So you're deserting\" and I nodded to confirm this. I then continued \"Is anyone in with me? Boris?\" who nodded and said \"I suppose so\" at the same time McCourt shouted \"Refreshing isn't it?\" and came back over to the squad and asked \"What's going on?\" and I told him about my plans for desertion and he responded with \"Hell yeah man, fucking hell yeah\" . Tito said \"<mark>Milan</mark> no one knows what this war is about, I think we're all in it\" and Babić added \"If I would have known I was going to be drafted I'd have headed to Cuba\" . \"I know many of you have families and I'm not forcing this on any man...\"then Valter interrupted and jokingly said\" <mark>Milan</mark> shut up...\"and he continued in a more serious tone\" ...let those two child fuckers fight their own pointless fight with the Muslims \". Boris got up on the UAZ and shouted\" Hellas here we come! Paddy get the back on the wheel \". We all mounted the jeep and McCourt started playing War by Edwin Star. + It was early in the morning just a night after we were in Vodopadi Crkvi we approached a hamlet. Three of our soldiers were about to rape a Bosniak woman but McCourt fired at them wounding them, the woman got up and ran and McCourt went over to one of the soldiers and started pissing on him. I started talking to my squad\" Okay I'm going as in ditching the army and heading to my family in Greece \"and Bobienski responded\" So you're deserting \"and I nodded to confirm this. I then continued\" Is anyone in with me? Boris? \"who nodded and said\" I suppose so \"at the same time McCourt shouted\" Refreshing isn't it? \"and came back over to the squad and asked\" What's going on? \"and I told him about my plans for desertion and he responded with − − − = = Chapter 5 = = I was riding up front with McCourt a few hours later. We were listing to the radio. We had just heard a speech by Radovan Karadžić and another speech by Slobodan Milošević had just started. I shouted\" Fucking turn it off \"and Paddy did it. He then asked me\" Any requests? \"and I said\" Play the IRA song \"\"Which one? Go on Home British soldiers or an actual Irish one?\" and I told him to play the first one. He put his tape his and he turned the radio up full blast. We started shouting \"P I, P I, PIRA\" before the main part of the song started. The squad in the back heard the song and they started singing as well and we heard Boris say \"Hej now we're the Provos, FUCK THE QUEEN\" McCourt shouted \"Fuck Maggie Thatcher\" and I added \"I hope not literality now Vladan\" which he replied to \"Fuck no, you wouldn't know where to fuck her since she is a cunt\" . I was riding up front with McCourt a few hours later. We were listing to the radio. We had just heard a speech by Radovan Karadžić and another speech by Slobodan Milošević had just started. I shouted \"Fucking turn it off\" and Paddy did it. He then asked me \"Any requests?\" and I said \"Play the IRA song\" \"Which one? Go on Home British soldiers or an actual Irish one?\" and I told him to play the first one. He put his tape his and he turned the radio up full blast. We started shouting \"P I, P I, PIRA\" before the main part of the song started. The squad in the back heard the song and they started singing as well and we heard Boris say \"Hej now we're the Provos, FUCK THE QUEEN\" McCourt shouted \"Fuck Maggie Thatcher\" and I added \"I hope not literality now Vladan\" which he replied to \"Fuck no, you wouldn't know where to fuck her since she is a cunt\" . Latest revision as of 21:36, February 22, 2016 WARNING! Contains strong language, strong violence, mild racism, political na Contents [show] Prologue Edit The rockets fired every so often briefly lighting up the sky. We were running through a town trying to take cover. I was a Poručnik in the VRS can't say I was proud to fight under Mladić nor can I say I was proud to have fought in the war. I was called up about a year and a half ago and they gave me the choice to prove myself in an officer school. I graduated after six months. A lifelong friend of mine, Boris Kovač was under my command, the kids back home had nicknato suit his Chetnik lifestyle and sadly for him I haven't committed such crimes and don't plan either. In the distance we then seen a church and graveyard were we would take cover from the artillery. Chapter 1 Edit We began to rest as we were out of aim of the artillery. \"That's our own damn artillery bombing us\" shouted McCourt as he lay down to take a drink of water. \"What are you reading Jackie?\" Babić asked Zhang who before answering glanced then said \"It's a World War 2 memorial\" . Stojanović then turned to Zhang and said \"Hej Valter what is wrong with your eyes?\" then Zhang answered \"Nothing why?\" and Radić said to Stojanović \"Chinese naturally have eyes like that\" then Babić continued \"Yeah Draza unlike your family the Chinese don't get their eyes through incest like how your cousin got his\" . We all laughed but Vuk got up and was about to hit Babić but I threatened him by telling him he \"would be shot if he didn't calm himself\" . Boris then went over to me and asked \"Hej <mark>Milan</mark> do you remember that summer when we went to the Montenegrin coast?\" and I replied \"Summer of 87 how could either of us forget\" I remembered one particular day as it was yesterday. Me and Boris were walking down a beach trying to pick up girls like any single man would do. We walked into a bar and asked for two cokes despite Boris' best efforts to try and prove/lie we were eighteen. A pretty girl was sitting beside us. \"Hej <mark>Milan</mark>\" said Boris pointing his head towards her and I turned around \"Zdrava\" I said to her and she turned around greeted me. She smiled at me and we started talking a bit. She eventually asked me my name and I told her \"<mark>Milan Nikolić</mark>\" and I told her I was from Bosnia and where about. She never knew as it was only a small town of 4,257 people but she was from a similar sized town in Montenegro. She also told me her name \"Marija Vidić\" and asked me if we could meet later. I did and I went back the next year to find her after a whole six months of slagging from Boris between then. It would later turn out me and Marija would marry after convincing her to move to Bosnia and have two children together, Zlatan and Milena. Now however I wish I had stayed with her in Montenegro. The artillery stopped and we decided to move on towards our objective which was very unclear at this point. Chapter 2 Edit I remember first meeting my squad after leaving officer school. Valter met me as soon as I got out of the jeep. \"Everyone out of the truck\" he shouted. I remember the truck then driving off as the squad assembled and McCourt shouting after leaving his hash on the truck. I gave a sigh of relief when I seen Boris knowing I'd be with him for the war. Fast forward three months and we're all on the back of a UAZ pickup driven by McCourt with Zupan, our mechanic up beside him. Draza and Simo Radić, a school teacher from Sarajevo who strongly embraces Titoism hence his nickname were arguing as usual but Tito was always the winner. McCourt pulled over and got into the back, \"Zhang it's your turn to drive\" he said climbing in. As Zhang got out McCourt started rolling a joint. He wore a Keffiyeh around his neck and owned a Palestinian flag which he fixed onto the UAZ, it made us look more of soldiers of Yasser Arafat than of Ratko Mladić, he also wore his tank top as a bandana and wore an Irish Brigade flag armband. \"Hej Chetnik do you want some?\" he asked Draza who replied \"No I don't want to die commie\" and McCourt responded \"You don't want to smoke weed because you're afraid to die? What's with the bottles of Rakia and all the camel cigarettes?\" Draza then asked McCourt \"Hej Vladan how's your brother, blown up many Brits?\" and Boris added \"Yeah Paddy how is he?\" McCourt's brother was a member of the PIRA. I remember him telling me that his grandfather was one of the Irish Asylum Seekers during the 60's who moved to the continent to escape the conservative Catholic laws that were in place and the stoner in front of me was sure a chip off the old block. The youngest member of our squad was a Kosovo boy named Antonije Dragić but we all called him Tony he was only seventeen during the war. His ambition was to become a runner in the Olympics and I must say he was a very fast runner. His home town was destroyed seven years ago by Albanian Islamists. He had only found out his pregnant sister and her boyfriend were killed by a suicide bombing in Banja Luka. We were driven into Boris and I's home town for a scouting mission and we disembarked the UAZ. Chapter 3 Edit We patrolled the empty the town after hearing about Islamist movement nearby. Our home town was called Vodopadi Crkvi, it had been historically a Serb town with a large Croat minority anted in the entrance corridor next to the resource room. I noticed some of the annual photos were lying on the ground I picked one up, it was from the 1981-82 school year and we had just won the Republic School Cup. I remember standing next to Gospodin Muhammadić the fifth grade teacher with his son Ahmed as he took the photo of the team holding the trophy. I was in sixth grade at the time, just months away from starting gymnasium. Boris was the school's captain and the top scorer that semester. I went back out onto the streets and met Boris and showed him the picture \"They sure were happier times\" he said to me. I then walked into my own house. It wasn't as looted as some other homes however there was graffiti in our sitting room that read \"Srbe na Vrbe\" with an Ustasha U and crucifix above it. I found a note in a drawer in me and Marija's bedroom. It told me what had happened before she and the kids fled to Greece it read \"Dear <mark>Milan</mark>, As you know me and the kids are hopefully in Greece. What happened has been happing here has been terrible, <mark>Vladimir Vučković</mark> was beheaded by Arkan's Tigers, the Islamists killed the Đukićs across the road and Ustashas beat Dr. Izetbegović to a pulp.\" I went back outside and showed Boris what was happing. McCourt then asked me \"You've got kids?\" and I answered him \"Yes two, Zlatan and Milena\" . Boris then asked McCourt how many he had and Valter answered it for him \"He has five don't you Paddy? One with an army nurse, one with an Argentinean peacekeeper, one with an Italian, one with an Irish and one with a Brazilin\" and McCourt then replied \"You forgot about my daughter which I had with my ex back in Bijeljina, she must be nearly six now\" . I then asked Valter how many he had and he answered \"Three, two twin daughters with my ex-wife and a son with my girlfriend\" . Draza walked past and Vladan asked him \"Hej Chetnik how many do you have? Fifteen all of them legally your nephews or nieces as well as your cousins\" Draza replied \"Shut up stoner, how many bastard kids you have with nurses and female peacekeepers?\" After laughing at McCourt and Draza we heard a noise. It was only us ten in Vodopadi Crkvi and we were all together. I seen someone run across the street and I ran over to the damaged Opel sedan to take cover. The figure was a Bosniak rebel and he aimed his rifle but I fired be he could shoot. I then went over to the body and found out the rebel was Ahmed Muhammadić. Chapter 4 Edit It was early in the morning just a night after we were in Vodopadi Crkvi we approached a hamlet. Three of our soldiers were about to rape a Bosniak woman but McCourt fired at them wounding them, the woman got up and ran and McCourt went over to one of the soldiers and started pissing on him. I started talking to my squad \"Okay I'm going as in ditching the army and heading to my family in Greece\" and Bobienski responded \"So you're deserting\" and I nodded to confirm this. I then continued \"Is anyone in with me? Boris?\" who nodded and said \"I suppose so\" at the same time McCourt shouted \"Refreshing isn't it?\" and came back over to the squad and asked \"What's going on?\" and I told him about my plans for desertion and he responded with I was riding up front with McCourt a few hours later. We were listing to the radio. We had just heard a speech by Radovan Karadžić and another speech by Slobodan Milošević had just started. I shouted \"Fucking turn it off\" and Paddy did it. He then asked me \"Any requests?\" and I said \"Play the IRA song\" \"Which one? Go on Home British soldiers or an actual Irish one?\" and I told him to play the first one. He put his tape his and he turned the radio up full blast. We started shouting \"P I, P I, PIRA\" before the main part of the song started. The squad in the back heard the song and they started singing as well and we heard Boris say \"Hej now we're the Provos, FUCK THE QUEEN\" McCourt shouted \"Fuck Maggie Thatcher\" and I added \"I hope not literality now Vladan\" which he replied to \"Fuck no, you wouldn't know where to fuck her since she is a cunt\" . Just as the song ended the UAZ ran out of gas. After McCourt had noticed this he sent Tony and Zupan to get some petrol. \"Paddy the nearest gas station is eight kilometres away\" Babić said and McCourt replied \"Want some?\" handing him a bag of hash and Tito said \"Play us some music Paddy\" and McCourt played his Bob Marley tape. We sat relaxing as Three Little Birds started playing. McCourt lit a joint and Bobienski asked him \"How many of them do you smoke a day?\" and McCourt answered \"I smoke weed two or three times every day\" . \"Hej commie that fucks your brain\" Draza said and McCourt retaliated \"Just for that Chetnik I'm going to play a song on my custom tape just for you\" . He got into the cabin and put in a tape, he started skipping a few songs until he found the Internationale and then started singing \"Arise all victims of oppression, the fascist fears our might...\"and Draza simply got annoyed and asked him if he had any\" good \"(Chetnik) songs. After the Internationale had stopped playing Predaj se srce by Indexi started playing. Boris said with a tear in his eye\" I used to love that song \"and Valter replied\" It's my number one forever \"Draza added\" All though I hate Croats that is a good song \"and I said\" A classic of good old Titoslavia indeed \". Zupan and Tony returned with two full jerry cans of petrol and I helped McCourt fill the tank then we drove off listing to Burning Bridges. Chapter 6 Edit I remember being in Bijeljina back in 1989 with my wife and Zlatan, this was a year before Milena was born. This was the city were McCourt was from however this was before I even met him. Zlatan was about a year old and I was carrying him on my shoulders as we seen the sites. I remember pointing to a statue of Tito and telling Zlatan how he liberated us from the Nazis in the 40's, but I doubt a one year old would have understood a word of that. Flash forward six years and the town is in flames I remember sitting at the same statue I pointed at back in 89. I was taking cover from Bosniak artillery fire while being separated from my squad. I remember two members of Arkan's Tigers come up to me and asked me if I needed a lift. The car stopped and we got out. One of the men gave me a pistol and told me to execute a pregnant woman who had a potato sack over her head. I then shot the two mobsters and helped the woman. Why they wanted me to do it I'll never know however I was out of outside of the artillery fire. I heard Draza shout from a window of an apartment block and I went up. I found the entire squad around that area. Outside the building I heard McCourt singing\" Everyone's gone cleansing, cleansing Bosnia \"and writing graffiti saying\" Tiocfaidh ár lá \"and\" From Makedonia to the world \". Draza was looting and burning with a bunch of soldiers outside our squad. After rounding them all up (most of them were in the lobby) we headed towards our objective, which was an airlift out of town. When we left the building we were attacked by Islamists and we returned fire. After we defeated them McCourt said\" Hej I've got the munchies anyone fancy something, there's an Indian down the road \". Me, Boris, Babić and Bobienski decided to eat anyway.\" Come on Jackie, it's like the stuff your grandparents make, fine it's spicy is that enough? \"and Zhang jumped on the band wagon also. It seemed like a stupid idea as it would have been likely that there would have been no service but we were lucky. We were greeted by the restaurant's owner at the door, he was a short man and looked like an Indian Tom Bosely and from what McCourt said to him at the door he was nicknamed because of that.\" How many today Paddy? \"the owner said and McCourt replied\" Five Howard \"and the owner showed us to our seats.\" Hej <mark>Milan</mark> you never told us what team you support \"I replied to him\" I support FK Sarajevo \"and the squad laughed\" Really you support them? \"Bobienski asked then I told them I support Radnički Niš.\" Radnički? Who are their Greek friends? \"Babić asked which I told him\" I don't follow football that much but I did play it a lot when I was younger \". The owner's daughter who served as a waitress came out and asked us what we wanted. McCourt only had eyes for her and I can say I couldn't blame him.\" I'll have the usual \"McCourt said and the waitress turned to him and said\" Paddy, Ivan said you were killed \"and McCourt replied\" Ivan's a stupid cunt and you know extremely well Kanta \". McCourt got up and they hugged each other. After we ate Kanta came over and sat on Paddy's lap.\" How much will this be? \"Valter asked her and Kanta answered\" Usually around ninety Marks or Dinar but since Paddy is here and it is war my father said you're free of charge \". Babić then said coughing\" Thank god, I didn't want to pay for that Lav \"which Valter asked\" Why Vlado? \"and Babić answered\" Because it burned me you Chinese bastard \"\"You deserved it then\" Valter said back. We heard a noise coming from our radio, it was Major Novak \"Poručnik <mark>Nikolić</mark>, Poručnik <mark>Nikolić</mark>, do you copy <mark>Milan</mark>\" I thought Zupan had the hand radio but I answered \"Da, kopirate\" . The Major was asking where we were and that we should hurry up towards the LZ. I told the boys that we should go. Before we left Paddy gave his helmet to Kanta and told her to take care. We then headed towards landing zone. I then woke up and this being all a flashback. I heard Novak's voice and German being spoken. Chapter 7 Edit \"Kommandant Petridis, come in Petridis\" Novak said into his hand radio and Petridis responded to him \"Da major\" and Novak told him we needed a sitrep east of our current location and Petridis tried to tell him it was behind enemy lines. Paddy was responsible for the German being spoken. There were three German peacekeepers with a jeep near the gostionica we had stopped. \"Wo seid ihr alle aus?\" Paddy asked and two soldiers replied with different answers \"Ich komme aus Köln\" said a short blonde headed man and a man of West African appearance said \"München, Johannes ist auch hier von einer Bayerischer Alpenst\" , Johannes was the taller brown haired man. \"Hey Jean-Luc gehst du mit ihm über die Kneipe zu fragen?\" asked the shorter soldier and the Black soldier asked Paddy \"Haben du etwas dagegen, wenn wir gehen in die Kneipe?\" who's reply was \"Wir waren nur einen Zwischenstopp hier\" . \"Jean-Luc, wo ist deine Familie aus?\" Paddy asked and the soldier answered \"Die Elfenbeinküste, C & ocirc; te d'Ivoire\" which Paddy replied \"Ah C & ocirc; te d'Ivoire, beste Mannschaft in Afrika. Können du sprechen Französisch?\" Jean-Luc kept simply agreeing with Paddy until that last question which he replied with \"Oui et vous?\" and Paddy answered him \"Oui\" . I stepped outside and remembered the events in Bijeljina a couple of months ago. I then remembered opening a video shop with a friend, <mark>Vladimir Vučković</mark> who was supposedly killed a few months ago. It was 1988 I remember standing outside our newly opened shop, and Dance Hall Days was playing on the radio. Boris was taking our photo. \"Hej Mišo bring us back that photo okay\" <mark>Vladimir</mark> said as Boris walked away to get the photo developed. My father who was present said \"How are you going to get business here, pirate?\" and I told him \"You must be forgetting how big this AREA is\" . I was awoken from my flashback by Novak who asked me if we were heading out towards Greece. Chapter 8 Edit I had told Novak about our plan to go AWOL and he agreed saying how pointless this war was. McCourt, the major and Tito were going to scout ahead on the road while the rest of us were going to scout about the fields. During this wandering we had noticed we had walked onto a minefield after one of stepped on a mine. \"Xìngjiāo de duìxiàng\" shouted Valter and Boris replied \"There's no need for fucking profanity Valter, who bought it?\" Tony turned his head back and shouted \"Bobienski\" . I then said to the squad \"You've all seen Kelly's Heroes, you know the one which Paddy seemingly walked out of? Well do what they done when the GIs walked into the minefield\" . Babić added after my command \"<mark>Milan</mark> what about Draza he doesn't know what a TV is\" which everyone except Draza laughed at. We managed to get through the minefield and get to the UAZ which was parked nearby. I asked McCourt if he spotted anything and told me of a Croatian army movement heading our way. \"Petridis, are you there Petridis? Come on you crooked nosed mongrel answer do you copy? Petridis?\" said Novak into his hand radio. \"Halo Četnici\" said a man on the radio \"We killed your Greek fucker, we slit his neck as you called him. Now we're going to do what we should have done back in\" 43 \"another man said and a group of men started singing\" Puška puca a top rice, grmi kao grom, Sad Ustaša bojak bije za Hrvatski dom, sad Ust...\"Novak had turned off the radio\" Ustasha scum \"he then said.\" Are they the same guys behind us? \"Boris asked and Novak said\" You're half-Croat do you think you're all like that? The guys nearby are the Croatian army those knuckle draggers on the radio are just terrorists. Chapter 9 Edit \"Jebi\" shouted McCourt as the jeep stopped. It was out of fuel and we went out to scavenge. We found a house and knocked on the door. A young Croat woman answered and asked who we were. Boris pulled McCourt and Valter out of the way and said to her in an Istrian accent \"We're the Croatian army we would like to know if you have any diesel or know where the nearest petrol station is\" the woman responded \"Hold on we've got some, would you like to come in?\" there was a storm cloud above us and we opened the door. \"Would she be able to tell if we're Chetniks and not Ustashas?\" Babić wondered and Zupan responded \"I don't even know who we're fighting half the time\" . \"Ah boys let me out of the way\" said Draza as he approached the woman and pushed her down. \"Draza you fucking incest bastard get off of her\" shouted McCourt pointing his rifle at him. A young boy then walked into the kitchen and Tito shouted \"Fucking hell Draza what's wrong with you? Get off her\" . Draza ripped off the woman's shirt as the boy called for her \"Fuck it\" shouted McCourt as he drew his pistol and shot Draza twice \"Sorry it had to come to this\" said to him and then shot him in the face. Me, Boris and Valter ran over to girl, she was shaken but unhurt. The woman's name was Vera, she was an accretive woman with long brown hair and worked as a school teacher in a nearby village. She told us her husband was killed when his car was bombed by artillery. She got on well with Paddy, Tito and Novak since she shared their political views but it was Tito whom she got on well the most with due to them being both teachers. \"Wouldn't you get in trouble for having us here?\" I asked her and she replied \"Maybe but no one comes up here that often but I'm leaving in a few days with my brother and his family, you can have this house\" . Novak then told her about Greece which she replied \"Greece? How are you going to get there?\" and she had a point, we were still in north-western Bosnia. I got up from the table to get a glass of Coke. I looked at where Vera was almost violated and I was amazed how we cleaned Draza's blood up so well. After getting my drink I went outside were Boris, Valter, Tony and Vlado were playing football with Vera's son. It had hit me more of what kind of war we were fighting, a Croat woman had let us, Serb soldiers to stay in her house and outside her son plays and talks about sports to four of them. We were leaving after breakfast and Zupan decided to stay with Vera and Darijo. \"Why do you want to stay?\" Novak asked him and he told him \"We're a long way from Greece major and I don't want to fight. I also want to make sure these two make it to Croatia alive\" Novak acknowledged as we walked back to the jeep. We had driven a while longer until the engine blew. Chapter 10 Edit McCourt was looking at the engine. \"I can fix it but our tools were with Zupan\" he told me and Novak. It was too far to go back to him now anyway but to make matters worse a sniper started firing at us. As we ran for cover Tony was hit in the foot so I went back to help him. I carried him to a rock where the rest of us were hiding from the sniper. He was had lost most of his left foot. Our medical equipment was still on Bobienski's corpse but McCourt remembered the first aid kit in the jeep. \"I'll go\" said Vlado getting up and Valter asked why to which he was replied \"Jackie you know I always get through besides I lived a good life, Cuba doesn't matter anymore\" . We then heard machinegun fire and Vlado came quickly running up to us with the first aid kit and unscratched. \"FUCKING RUN\" he shouted and we went to find more cover. We eventually found some trenches that were dug in the beginning of the war. We applied bandages to Tony's foot. \"Now you're going to have to lose that foot son\" Novak said to him and he replied \"It doesn't matter, if I don't I die and that's what's going to happen isn't it?\" Boris then comforted him \"There's a Paralympics you do know that right kid?\" and Tony nodded in acknowledgement. We sat back dazed. Valter then said to Boris \"The kid does have a point, if he doesn't lose that leg he's on the mantel piece or a meter underground. We don't have any medical equipment and even if we did we still wouldn't have anything to sterilise them with. I closed my eyes and drifted off. Chapter 11 Edit\" <mark>Vladimir</mark> it's just a helicopter even Mišo will say it's just one \"I said to <mark>Vladimir</mark> as we walked to Boris' house. It was a warm summer's day back in 1981. We knocked on the door and Dana, Boris' mother answered it.\" Zdravo boys Bor...it's Mišo you call him right? Anyway he's just in the sitting room watching TV. \"Boris <mark>Milan</mark> and <mark>Vladimir</mark> are here!\" she shouted down the hall. She was a very pretty woman and worked in our school. <mark>Vladimir</mark> couldn't help staring at her every time she bent over, he always did this when we were at the Kovač's and I couldn't blame him. \"Boris did you hear me?\" she shouted again and then Boris came up. \"Go on get some fresh air Boris. Zdravo, lunch will be ready at half\" she said as we left the house. \"Hej Mišo we want to show you something\" <mark>Vladimir</mark> said as we walked back to the helicopter. \"Do you not think this is a spaceship him?\" <mark>Vladimir</mark> asked him and Boris replied \"No it's a helicopter, been here since the 60's Mr Ivović said\" . A few months ago I remember standing next to a similar helicopter but this one wasn't covered in moss and mildew but with fire and hadn't crashed about fifteen years ago but fifteen minutes ago. Boris pushed me as a shell landed near us. We then ran into a trench. \"Mati, mati, mati\" a young soldier said to himself clutching his helmet. Tito was firing the machinegun at the Bosniak soldiers and Draza with his shotgun. \"Kapetan Jovanović this is Redov Jakob Dravić of the fifth army, under the request Zastavnik Zhang reinforcements to be sent to...Poručnik <mark>Nikolić</mark>, <mark>Milan</mark> I think...nor sir he's not...\"but before Dravić could finish his sentence his head was blown off by a sniper and our radio was busted. Back in 81 we went back to Boris' house after laughing at him for thinking the helicopter was a spaceship. We sat down at the table as Dana gave us our lunch. Nikola came in and Dana asked him why he was early and he told his wife\" I don't think it's good Danica \". Dana then asked him why and he told her\" I got a message from the hospital, its cancer, cancer of the lung \". Dana started crying and ran into her bedroom. Chapter 12 Edit\" So when is Boris going to be back? \"I asked Dana and she told me\" Tomorrow afternoon \". It was five years and a week after we argued about helicopter and I was lonely but I wasn't enough to be marrying my right hand, Dana had invited me in because she knew <mark>Vladimir</mark> was away to family in Vukovar and Boris gave me the wrong date of his arrival back from Fire Island, no shit he went to that Greek island full of gay British people. Dana asked me a question about music\" Do you like Tears to Fears? \"and I said to her\" It's Tears for Fears Dana and yeah they're alright but I prefer our own stuff like Indexi, Elektricni Orgazam you get it don't you? \"and she smiled and nodded in acknowledgement\" Anyway as long as you like them take this cassette \"I thanked her and she put on Proplakat će Zora. She then sad town and...right before this turns into some erotic literature story I got a shag so I can proudly say I fucked my best friend's mother. The irony is I never once insulted Boris by saying I shagged Dana. I woke up hearing a woman scream. McCourt was trying to calm her down. I looked at her, it was that Danish/Greek journalist we met a while earlier. Going back to when we first met Ms. Irena <mark>Anderson</mark> last month we were walking with Jovanović.\" This is <mark>Milan</mark>'s squad the most mentally challenged, moronic cock suckers in the whole VRS. After General Mladić of course \"Jovanović said laughing as he walked away.\" Sorry you speak Danish? \"Irena asked me and I said to her\" You don't look Danish Fr & oslash; <mark>ken Anderson</mark> \"then she told me\" My mother is from Greece, Crete Herr L & oslash; jtnant \"I responded to her\" Ah Irena as in Irena Papas right \"and she smiled, nodded her head and said to me\" S & aring; taler du Dansk? \"and I shook my head\" I only know very little Greek \"and she then asked me if I knew German or English\" No English I'm quite good at German but \".\" Ich bin Poručnik, dass L & oslash; jtnant <mark>Milan Nikolić</mark> der VRS ist. Ich komme aus einer Stadt im Nordwesten Bosnien, die Heimat von allen drei gro & szlig; en ethnischen Gruppen vor dem Krieg war \"she then asked to interview another soldier and I called Paddy.\" Paddy this is Irena she's a Danish journalist \"I told him and he said\" I don't speak Danish \"I replied\" You speak English but, just tell her about yourself \". Paddy started speaking to her in English\" Hilsner my name is Vladen McCourt better known as Paddy by everyone who isn't a McCourt. If you're wondering about my weird surname it's because my grandfather moved here in the 1950's to escape the evil papist rule of Eamon De Valera and his master the pope. I am a stoner from Bijeljina where I worked as a tow-truck operator. My father worked for the Ministry of the Interior, figures he's Irish and my mother works for a pharmacy. I grew up Serbian Orthodox but I currently practise Buddhism, Rastafarianism, Mormonism and Celtic and Slavic folk religion yes you're aware it's all bullshit \"Irena laughed and McCourt continued\" My heroes are of course <mark>James Connolly</mark> and <mark>Michael Collins</mark> who wanted a free Ireland which De Valera ruined anyway by sucking off the Church of Rome but my other heroes are Bobby Sands aka Jesus, the Dutch guy who legalised weed, Bob Marley, Sergeant Oddball, Bata Živojinović, Arafat and the Fonz but my number one real hero is Nelson Mandela. You know he stood up to the fascist oppression against Black people in South Africa, his people the real people of South Africa were oppressed by Dutch colonists who make up about a 10% of the country and last week he became president of South Africa. One day I'll become president and reunite Yugoslavia just like Comrade Mandela helped the real South Africans gain equality and like how they are bringing down the fascist apartheid regime we will bring down the fascist genocidal regimes of our countries. When I get power capitalists like that old bitch Maggie, fascists like Slobo, Chetniks, conservatives, those pro-incest bead rattlers who cry over abortion and Polish Jew Nazis like the ones who rule Israel will be crushed. You better have this down all down Miss <mark>Anderson</mark> \"Irena said to him\" Sure do, how do you know I'm called <mark>Anderson</mark>? \"and he told her\" You're Danish \"\"You're Danish\" quoted Irena as she lay next do Paddy. \"What brings you back?\" asked Vlado \"I found my way\" she told him. \"Your Serbian is getting better\" I said to her before Novak asked her \"Did you see anything where we could take cover?\" and she told him \"Yes there's a cave up on there. We then ran up there and as soon as we did the Croatians started firing on us. Valter was wounded but we managed to get him there. Chapter 13 Edit When we got to the cave we sat down. Irena took out a video camera.\" What are you doing? \"Novak asked politely but he was willing to take the camera off her and McCourt said to her\" La majoro ŝatus scii kion vi faras? \"\"Du sprichst Esperanto?\" she responded and Paddy replied \"Ja, ja und falls man nicht tun will er das Ziel, Sie nehmen Ihre Kamera kennen\" . Irena then told Novak \"Alles, was ich tun möchte, ist filmt Ihr Männer und fragen sie über ihre Vergangenheit. Es gibt nicht viel über die Armee.\" Novak then turned to McCourt and asked him \"Please translate\" which McCourt did \"She says she only wants to film us and ask us about our lives, she doesn't want to get involved with military matters\" Novak then smiled and said \"Film weg war ich nicht, Sie zu stoppen\" . As the major walked away I asked him why he didn't speak German and he responded \"I used to, forty years in the service you tend to forget things\" . Paddy then asked Irena about her camera which she responded with in broken Serbian \"I get camera because you made speak speech back on frontline, do not worry I got it all down but and it was...made into Danish\" Vlado then added \"What was made into a Danish?\" and Paddy quickly replied \"Éist do bhéal\" . \"Can I interview you Narednik?\" Irena asked and Vlado nodded with a grin. Paddy came over to me and asked me a question \"Hej remember Pól?\" and I answered \"The Irish peacekeeper sure I remember him\" Paddy continued \"Well the stash is on the other side of this cave\" . I waited a few seconds before opening my mouth \"There's another side to this cave?\" I had asked and Paddy replied \"Yeah but keep it quiet let us rest a while\" . Pól was an Irish peacekeeper and Paddy's counterpart. He was married to a Serbian woman from Belgrade and that's how I presume he knew our language. He and Paddy were talking about weed and they thought I wouldn't find out by calling it \"fiaile\" whether that's the Irish for what drives English housewives mad or the thing their sons go to Holland for I don't know but at the end of their conversation I asked McCourt was he talking about cannabis and he replied with \"How did you know?\" Retrieved from \"http: //codfanfic.wikia.com/wiki/Bosnia_Nights? oldid=66218\" "}, {"articleID": "2017122911_00631805_W", "names": {"Colin Stewart": ["Q23020530", "Q43911642", "Q50366019", "Q5145593", "Q5145594"]}, "date": "2017-12-29", "url": "http://www.breakingtravelnews.com/news/article/lata-south-america-poised-for-strong-tourism-growth-in-2018/", "content": "As 2017 draws to a close, LATA members have revealed forward booking statistics for 2018 showing positive growth in travel to Latin America, particularly to Peru, Chile, Argentina, Costa Rica and Colombia. At the same time, the organisation is predicting an increase in demand for less traditional and more off-the-beaten-track destinations, and a surge in luxury bookings. In Argentina, Abercrombie & Kent has seen travellers move away from more traditional tourist destinations towards more undiscovered and wildlife focused areas of the country such as Peninsula Valdes located on the Atlantic coast and the majestic area of the Ibera Wetlands. Jacada Travel has seen a similar trend across Latin America with a sharp rise in holiday bookings to off-the-beaten track destinations such as Nicoya Peninsula in Costa Rica, and Punta Gorda in Belize. At the same time, airlines like Air Europa continue to develop their flight connections in Latin America, bringing lesser-known destinations closer to the UK traveller - such as Recife in Brazil's north-eastern state of Pernambuco. ADVERTISEMENT Both Journey Latin America and Chimu Adventures report strong booking figures for Colombia which over the last two decades has shrugged off its negative image into one of Latin America's brightest stars. With forward booking stats revealing increases of up to 20 per cent (Chimu Adventures), Colombia looks set for strong UK visitor arrivals in 2018. This is in line with recent tourist statistics published by ProColombia which revealed a 5.1 per cent year-on-year increase in UK visitors (between January and October 2017). Although traditionally favoured by the more intrepid client, the growth of luxury infrastructure and services in Latin America has spurred the demand for luxury holidays. Developments such as Awasi Iguazu (scheduled to open in January 2018 in Argentina), Leonardo Di Caprio's \"Blackadore Cay, A Restorative Island\" (to open in 2018 in Belize), and the introduction of new luxury services such as the Belmond Andean Explorer illustrate a strong response to the growing luxury sector - a trend that is set to continue in 2018 and beyond. It is also expected that the launch of Latin America's first budget flight from London Gatwick to Buenos Aires with Norwegian Airlines will open up Latin America to a more diverse market, making the destination more accessible to a wider demographic and stimulating further growth to the region. <mark>Colin Stewart</mark>, chairman of the Latin American Travel Association, said: \"LATA continues to work closely with its members and the UK travel industry to promote sustainable travel to Latin America and to stimulate growth to the region.\" This year was a pivotal year for Latin America with new flight links and the development of new tourism infrastructure opening-up new destinations to visitors and catapulting Latin America to the top of the list of desirable travel destinations. \"We are delighted to see that tourism statistics for 2018 are looking strong and we look forward to continuing our work with the LATA members to help showcase this vibrant and colourful continent.\" Older Civilco joins Banyan Tree Residences project in Dubai Newer Waldhotel Health & Medical Excellence opens in Switzerland"}, {"articleID": "2010041406_00000912_W", "names": {"Jean Campbell": ["Q15964621", "Q29376375", "Q43394465"]}, "date": "2010-04-14", "url": "http://news.stv.tv/scotland/169991-calls-for-msps-to-back-reading-and-writing-projects/", "content": "literacy and numeracy: specialised projects needed for young children pic: © stv specialized projects aimed at improving children's reading and writing must be backed by msps it has been claimed. educational psychologists say support should be extended for schemes in areas including north lanarkshire, west dunbartonshire and edinburgh which identify children who need help at a young age. <mark>jean campbell</mark>, chair of the scottish division of educational psychology (sdep), said the projects have a key role to play in classrooms. she said: \"there is a growing consensus that improving literacy for children in scotland is something we must tackle urgently, particularly for those most vulnerable to failure.\" failure to acquire basic literacy skills can blight a child's life, diminishing their long-term life chances and impacting upon their sense of well-being and achievement in school. \"educational psychologists across scotland have an important role to play in this.\" youngsters are to face new exams specifically on literacy as part of the national english qualification that will replace standard grades, as part of the new curriculum for excellence. opposition parties at holyrood have also called for measures to improve both literacy and numeracy in the classroom. \"there is substantial research evidence nowadays about the kind of teaching and learning approaches that are best for developing the range of skills required for literacy in the broadest sense,\" ms <mark>campbell</mark> said. \"that will equip our children to participate fully and richly as citizens in the 21st century.\" for those with difficulties in building basic reading skills, early identification and intervention are vital. \"tackling these problems early, and providing the right kind of support helps ensure that the barriers to future learning and development are removed and outcomes improved.\" ms <mark>campbell</mark> and fellow sdep members will take their case to msps at a meeting hosted by labour's rhona brankin in holyrood later on wednesday. violent glasgow: west of scotland hit by spate of serious attacks sign up here for your morning fix of the top tv, news and sport stories and videos from stv.tv, direct to your inbox, every weekday. keep up with the ups and downs of the dales. dancing on ice the winter weekend tradition - who will replace ray quinn as the champion? scotland revealed scotland from the air, as you've never seen it before. features, celebrities and the best guest presenters. stv sports centre all the latest scottish sports news. weekdays, 10.35 pm the real mackay catch up with the real mackay video blog."}, {"articleID": "2019120612_00288698_W", "names": {"Peter Smith": ["Q12331731", "Q1344098", "Q16095881", "Q16221181", "Q16744426", "Q17140360", "Q2073575", "Q2078388", "Q21464247", "Q23418812", "Q2426347", "Q30106739", "Q30122591", "Q38053711", "Q42305788", "Q42842578", "Q43200108", "Q50042954", "Q56281118", "Q57984828", "Q7176991", "Q7176994", "Q7176996", "Q7176997", "Q7176998", "Q7176999", "Q7177003", "Q7177004", "Q7177005", "Q7177006"], "Nick Wright": ["Q10399189", "Q10413152", "Q16143219", "Q57018261", "Q7028172"], "David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"], "Kevin De Bruyne": ["Q357984", "Q52835665"], "Harry Maguire": ["Q165772", "Q5670856"], "Oleksandr Zinchenko": ["Q1803666", "Q19636859"]}, "date": "2019-12-02", "url": "http://www.yorkshirecoastradio.com/news/sport/3003117/manchester-derby-combined-xi-do-any-man-utd-players-make-team/", "content": "Manchester derby combined XI: Do any Man Utd players make team? Manchester derby combined XI: Do any Man Utd players make team? Published at 1:06 pm 2nd December 2019. (Updated at 12:35 pm 6th December 2019) Do any United players make the Manchester combined XI? The Sky Sports Football Weekend Preview podcast panel discuss...Sky Sports' features editor <mark>Peter Smith</mark>, features writer <mark>Nick Wright</mark> and senior journalist Gerard Brand came to a consensus on a Manchester XI containing two players from Old Trafford, with Pep Guardiola's champions dominating. Do you agree with the team? Pick your own Manchester combined XI in our team selector below, and listen to the panel discuss their choices in the podcast above...Goalkeeper: <mark>David</mark> <mark>de</mark> Gea This was one of few moot points for the panel, with Manchester United goalkeeper <mark>David</mark> <mark>de</mark> Gea getting the nod over Ederson, the consensus being that the Spaniard is still among the best goalkeepers in the world, and that Ederson's abilities are uniquely suited to Manchester City. Defenders: Kyle Walker, <mark>Harry Maguire</mark>, Aymeric Laporte, Benjamin Mendy The centre-halves were shoe-ins - <mark>Harry Maguire</mark> and Aymeric Laporte - and despite some debate over the full-back areas, the panel settled on Kyle Walker and right-back and Benjamin Mendy on the left, despite calls for Aaron Wan-Bissaka and <mark>Oleksandr Zinchenko</mark>. <mark>Nick</mark>: \"I think Mendy gives you a lot more than <mark>Zinchenko</mark>. Man City haven't lost a single game that Mendy has started since he joined the club; that's 22 games, 18 wins and four draws.\" Gerard: \"I'm not sure Pep Guardiola trusts either Joao Cancelo or Kyle Walker - neither have started three consecutive games this season, and it feels less like rotation and more like a lack of trust. I think <mark>Zinchenko</mark> is Mr Reliable for Guardiola, and do think he comes back into the starting XI when he is fit, but I'm happy to be overruled on Mendy two to one!\" Midfielders: <mark>Kevin De Bruyne</mark> - Fernandinho - <mark>David Silva</mark> Despite the arguments in defence, the midfield was unanimous, even if Fernandinho is now deployed in defence for City. He gets in alongside <mark>Kevin De Bruyne</mark> and <mark>David Silva</mark>, but was anybody else in contention? And how close was PaulPogba to the XI? <mark>Nick</mark>: \"It's interesting that we'd touch on Scott McTominay before Paul Pogba, I think that says a lot about how Pogba is perceived at the moment, and just how good McTominay has been. Pogba is obviously an absolutely brilliant player, but I'm not sure he justifies a place in that midfield. When you look at what these three have achieved in the Premier League, it's no contest really.\" Gerard: \"What's funny is that we've put Fernandinho in midfield, and I think everyone you ask would, but Pep Guardiola places him in defence. Every game he's played this season have been at CB. He doesn't trust Nicolas Otamendi and John Stones together, but you wonder what that takes away from City's midfield from having Fernandinho in defence.\" Forwards: Bernardo Silva - Sergio Aguero - Raheem Sterling Plenty of consideration for Marcus Rashford up front, but the three City men of Bernardo Silva, Sergio Aguero and Raheem Sterling get the nod as the champions register nine players to United's two. <mark>Peter</mark>: \"I really like Marcus Rashford, I thought he was fantastic in midweek, coming off that left side, he is so dangerous with 12 goals in 13 games for club and country, but you've got Raheem Sterling playing in that position, who has been so consistent for a number of years.\" <mark>Nick</mark>: \"I was pretty conflicted with Rashford, he's obviously been fantastic recently, but he doesn't really play off the right. Bernardo has a lot in the bank, he hasn't been as impressive this season, but I had to get him in there.\" Gerard: \"What's funny is that Mahrez could easily start ahead of Bernardo on Saturday. I really like him, whenever I've seen him he has match-winning qualities about him.\" Watch Man City vs Man Utd on Saturday Night Football from 5pm on Sky Sports Premier League and Main Event; Kick-off 5.30 pm"}, {"articleID": "2019071115_00021964_W", "names": {"Jack Sargeant": ["Q47995095", "Q6115005"], "Ann Jones": ["Q21996757", "Q259356", "Q4766478", "Q4766480", "Q56596836", "Q59122411"]}, "date": "2019-07-11", "url": "http://www.gazette-news.co.uk/news/national/17764814.carl-sargeant-s-family-claim-politics-play-inquest/", "content": "Carl Sargeant's family claim \"politics at play' during his inquest By Press Association 2019 Carl Sargeant inquest 0 comment The family of Welsh politician Carl Sargeant has hit out at attempts to\" blacken \"his name as an inquest into his death concluded. Alyn and Deeside AM Mr <mark>Sargeant</mark>, 49, was found hanged at his home in Connah's Quay on November 7 2017, four days after he was sacked from his job as Cabinet Secretary for Communities and Children following\" bombshell \"sex claims he groped and touched women. On Thursday, senior coroner for North Wales (East and Central) John Gittins ruled his death was suicide. Carl Sargeant's son <mark>Jack</mark> and wife Bernadette (Andy Kelvin/PA) He issued a report for the prevention of future deaths to the office of the First Minister after raising concerns about the support available for ministers who lose their posts. Mr Gittins said:\" I'm concerned that not enough has been done by the Welsh Government to ensure that in the future, regardless of who is first minister, consideration is given to providing clear channels of support and help to persons who lose their positions from office and whose removals will attract significant media interest and intrusion into their private lives. \"The hearings at Ruthin County Hall have included former First Minister Carwyn Jones being accused by the family's lawyer of lying over the pastoral care provided to Mr <mark>Sargeant</mark> before his death. Several attempts were made by lawyers for the office of the First Minister to introduce evidence about the allegations against Mr <mark>Sargeant</mark>. Former first minister Carwyn Jones before an earlier hearing at Ruthin County Hall (Andy Kelvin/PA) Speaking outside court following the conclusion, Mr <mark>Sargeant</mark>'s son <mark>Jack</mark> said at times the inquest had felt like a criminal trial. He said:\" All too often politics have been at play with the sole aim of blackening a dead man's name to protect another. Where has been the humanity in that? \"I do feel dad was certainly let down by the former first minister Carwyn Jones.\" Carwyn Jones said on the stand himself he was a friend, my only statement to that is I can't see myself letting down a friend the way he let down his. \"Neil Hudgell, solicitor for the family, said:\" We have seen a puppetmaster that has used the public purse to pursue his own ends without any regard for wider mental health considerations. \"As he began delivering his conclusions, Mr Gittins told the court:\" The twists and turns of the journey, at times along the murkiest paths into the world of politics, has been a challenge. \"He referred to evidence given by Mr <mark>Jones</mark> about pastoral care, which was contradicted by Vale of Clwyd AM <mark>Ann Jones</mark>. Mr Gittins said:\" I accept he had erred in his original evidence to me and that he properly and appropriately corrected his error, albeit only once the true picture came to light by virtue of the information provided by <mark>Ann Jones</mark>. \"He said no official arrangements were put into place to provide support to Mr <mark>Sargeant</mark> after he lost his post, despite the probability Mr <mark>Jones</mark> knew he was vulnerable in relation to his mental health, having previously been diagnosed with depression. He said:\" Regardless of the reason for the loss of his position in Government, the effect of removal from office was that Mr <mark>Sargeant</mark>'s mental health deteriorated significantly. \"Solicitor Neil Hudgell (left) with Bernadette and <mark>Jack Sargeant</mark> (Eleanor Barlow/PA) Giving evidence on Tuesday, Mrs <mark>Sargeant</mark> said her husband had been\" shell-shocked \"by the allegations and said she had believed him\" 100% \"when he denied them. A spokesman for current First Minister Mark Drakeford said:\" I extend my deepest condolences to the <mark>Sargeant</mark> family. I know they continue to grieve for Carl. \"The coroner has made a regulation 28 report to the Welsh Government in relation to the prevention of future deaths and we will consider this carefully and respond in full.\" In a statement posted on Twitter, Mr <mark>Jones</mark> said: \"The nature of these proceedings has meant that there appeared to be two sides in this matter and whilst it is right that arguments are tested, the process has driven an unnatural wedge between people who remain united at the very least in their ongoing shock, trauma and grief.\" Nobody wanted this and nobody could have foreseen it. \"Suicide is a shattering experience and I hope some healing can now begin.\" 0 comment"}, {"articleID": "2009032511_00017786_W", "names": {"Peter Ryan": ["Q21104278", "Q22280197", "Q7176720", "Q7176722", "Q7176723", "Q7176725", "Q7176728"]}, "date": "2009-03-25", "url": "http://news.smh.com.au/breaking-news-national/vic-govt-under-pressure-as-nec-axe-staff-20090325-9agx.html", "content": "electronics firm nec's move to axe 153 australian jobs, including 100 research and development staff in melbourne, is a blow for victorian manufacturing, state nationals leader <mark>peter ryan</mark> says. the workers will be let go from nec's mulgrave plant as part of a restructure announced by the company on wednesday. the research and development operation will be reabsorbed into the japanese parent company's operation. \"unfortunately these employees will take with them an immense amount of intellectual property as they are shown the door,\" mr <mark>ryan</mark> said in a statement. \"these research and development job cuts are another tragic statistic in the decline of manufacturing in victoria, but it is those at the heart of the crisis who suffer the most.\" these employees now face an almost impossible task of trying to find work in this tough economic climate. \"the victorian public deserved to know how the state government planned to assist industry through the economic crisis, mr <mark>ryan</mark> said. latest breaking news national video there are many keyboard short-cuts out there, but what is your mos ..."}, {"articleID": "2013020618_00091946_W", "names": {"Michael Fitzpatrick": ["Q16745415", "Q1927431", "Q6830325", "Q6846842"]}, "date": "2013-02-06", "url": "http://undertheradarmag.com/news/fitz_the_tantrums_announce_sophomore_lp_more_than_just_a_dream/", "content": "fitz & the tantrums have announced that they will release their next album more than just a dream on may 7. originally slated to come out last october, the follow-up to the band's 2010 debut pickin' up the pieces was recorded in hollywood's sound factory studios with producer tony hoffer (beck, phoenix), whittled down to 12 tracks from some 30-plus demos. keeping the band's old-soul sound while expanding into territories of new-wave and hip-hop influences, bandleader <mark>michael fitzpatrick</mark> explained to rolling stone that \"it'd been a long while since we'd made the first record and we'd obviously grown a lot as a band and as people. we wanted to show people that this band was more than a\" retro band .' we'd all gotten a little bit tired of that one moniker that kept getting applied to us. to me, obviously, there was obviously a lot of motown, retro-soul influence to (the first record), but there was just as much eighties influence, indie-rock influence, new-wave and hip-hop all mixed in. that first record was that kind of hybrid, and on this record, we just wanted to push it even more forward and take even more chances, and it just required a lot of experimentation. \"email required, will not be published please enter the word you see in the image below: fitz & the tantrums announce sophomore lp,\" more than just a dream \"watch: ex cops -\" separator \"video (news) - ex cops listen: desaparecidos -\" anonymous \"and\" the left is right \"watch: bat for lashes performs on siriusxmu sessions"}, {"articleID": "2009012712_00035761_W", "names": {"Patrick O'Connell": ["Q2031935", "Q23054718", "Q7147365"]}, "date": "2009-01-27", "url": "http://in.news.yahoo.com/139/20090127/906/ten-sienna-miller-too-toothy-for-vogue-c.html", "content": "sienna miller \"too toothy' for vogue cover london, jan 27 (ani): sienna miller's photo on the cover of vogue, back in 2007, was airbrushed for the actress was\" too toothy \"to grace the cover page. in a behind-the-scenes documentary, the september issue, vogue editor anna wintour has revealed that the 27-year-old actress was too\" toothy \"and staff were worried she has\" too many fillings \"and\" unruly hair \". the documentary shows how the actress was airbrushed for the shoot with famed photographer mario testino back in 2007. they took one photo of her face and super-imposed it on a separate picture of her body. however, the mag bosses are trying to avoid any rift.\" while some retouching is a fact for any cover, no one is more convinced of ms miller's beauty than vogue, \"the mirror quoted head of communications <mark>patrick o'connell</mark> as saying.\" the fact she appeared on the magazine's september cover, our most important issue of the year, is a testimony to this truth, \"he added. but the factory girl's people admit that she's\" always \"digitally manipulated."}]