[{"articleID": "2019082323_00123120_W", "names": {"Susan Walsh": ["Q23139575", "Q47927124", "Q55360631", "Q7648501", "Q7648503"], "Han Guan": ["Q45384234", "Q45522833", "Q45642591"], "David French": ["Q1174460", "Q29517525", "Q42292067", "Q5233858"]}, "date": "2019-08-23", "url": "http://www.voiceofalexandria.com/news/national_business_news/the-latest-tech-group-calls-for-end-to-us-china/article_b2b2858b-c59c-54d4-b022-fa9845a25a85.html", "content": "Facebook Twitter SMS Email FILE - In this June 29, 2019, file photo, President Donald Trump, left, meets with Chinese President Xi Jinping during a meeting on the sidelines of the G-20 summit in Osaka, Japan. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. <mark>Susan Walsh</mark> FILE - In this July 30, 2019, file photo, a traveller pulls a trolley past a U.S. embassy car outside a hotel in Shanghai. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Ng <mark>Han Guan</mark> Shoppers browse goods for sale at a discount retailer in a shopping mall in Beijing, Friday, Aug. 2, 2019. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Mark Schiefelbein FILE - In this May 9, 2019, file photo a General Electric washing machine with a label advertising it was made in America is displayed in retail stores in Cranberry Township, Pa.. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Keith Srakocic FILE _ In this Aug. 6, 2019, file photo, a woman walks by a money exchange shop decorated with different countries currency banknotes at Central, a business district in Hong Kong. China has announced it will raise tariffs on $75 billion of U.S. products in retaliation for President Donald Trump's planned Sept. 1 duty increase in a war over trade and technology policy. Kin Cheung Facebook Twitter SMS Email Print Save WASHINGTON (AP)--The Latest on the escalating trade war between the U.S. and China, the world's two largest economies (all times local): 6:55 p.m.. The Consumer Technology Association, a trade group that runs the annual Consumer Electronics Show, says \"enough is enough\" when it comes to escalating tariffs in the U.S. trade war with China. The CTA said in a statement Friday that President Donald Trump's tariffs are the worst economic mistake since the 1930 Smoot-Hawley Act raised tariffs just as the world was sliding into the Great Depression. The group says it is clear that tariffs are not moving the U.S. toward a deal with China, and that it is time to end the trade war and come to an agreement. The CTA represents more than 2,200 companies in the technology industry .---- 5:05 p.m. President Donald Trump says products coming from China that were slated to be hit with a 10% tariff on Sept. 1 will now face a 15% tariff. Trump also says goods and products currently being taxed at 25% will be taxed at 30% starting Oct. 1. Trump's comments come after China said it would pursue new tariffs of 5% and 10% on $75 billion of U.S. products. The tariffs would take place in two steps, just as the U.S. said it would do earlier this month in imposing 10% tariffs on $300 billion of Chinese goods. The rising tensions between the world's two biggest economies unnerved investors already on edge Friday. The Dow Jones Industrial Average dropped 623 points Friday as companies and business groups urged the two countries to get to the negotiating table .---- 3:45 p.m. Two trade associations representing auto companies say the escalating tariff fight between the Trump administration and China is bad for the industry. Neither the Alliance of Automobile Manufacturers nor the Association of Global automakers, however, addressed President Donald Trump's tweet about finding markets other than China. But the alliance says the tariffs are bad for consumers. It says the auto industry thrives with robust and competitive trading. Association of Global Automakers CEO John Bozella says tit-for-tat tariffs without meaningful negotiations put American jobs at risk. He says when China imposed tariffs last year, U.S. vehicle exports to the country were cut in half. The alliance represents most major automakers, while the global group speaks for manufacturers such as Honda, Toyota, Hyundai, Nissan and Subaru .------2:30 p.m.. The nation's largest retail trade group says that it would be unrealistic for U.S. retailers to exit China. The National Retail Federation made its comment in response to President Donald Trump's call Friday for U.S. businesses with operations in China to look for alternatives, as trade tensions between the world's two largest economies intensified. The NRF noted that its members have long been diversifying their supply chains but finding alternatives to China would be costly and take years. \"It is unrealistic for American retailers to move out of the world's second largest economy,\" said NRF Senior Vice President of Government Relations <mark>David French</mark>. He noted that retailers' presence in China allows them to reach Chinese customers and also develop overseas markets. \"This, in turn, allows us to grow and expand opportunities for American workers, businesses and consumers,\" <mark>French</mark> said in a prepared statement .------1:55 p.m. Small business owners are baffled by President Donald Trump's suggestion that all U.S. businesses with operations in China find an alternative. Trump lashed out at Beijing Friday after it announced retaliatory tariffs on $75 billion in U.S. products. Peter Horwitz, the owner of Tiger Packaging, a paper and plastic products supplier based in Boca Raton, Florida, says there are supplies that he can get only in China, like vinyl gloves. He says we're living in a global economy and it makes bad business sense to cut out the world's second largest economy in China .----------1:35 p.m.. The U.S. Chamber of Commerce is urging the Trump administration and Beijing to return to the negotiating table with trade tensions escalating rapidly. China on Friday said that it was putting into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes. President Donald Trump lashed out at China and on Twitter is urging U.S. companies to consider an alternative to doing business in China. The business group said, \"We do not want to see a further deterioration of US-China relations. We urge the administration and the government of China to return to the negotiating table to complete an agreement that addresses concerns over technology transfer practices, intellectual property enforcement, market access, and the globally damaging impact of Chinese domestic subsidies .\" ----------11:46 a.m. Stocks are falling sharply on Wall Street after President Donald Trump said he would respond to China's latest tariff increase and called on U.S. companies to consider alternatives to doing business in China. Trump on Friday also ordered UPS, Federal Express and Amazon to block any deliveries from China of the powerful opiod drug fentanyl. The Dow Jones Industrial Average sank more than 300 points after the president made the announcements on Twitter. The stocks of all three companies the president mentioned also dropped as traders tried to understand what the implications for them were. Stocks had been wavering between gains and losses earlier after China said it would retaliate against the latest round of tariffs imposed by Washington with duties on $75 billion of U.S. products .----------11:30 a. m President Donald Trump says he wants U.S. companies with operations in China to begin looking for alternatives in response to retaliatory tariffs from Beijing. Trump on Friday said that he will respond in hours to an announcement Friday that China was retaliating to U.S. tariffs with a slate of its own protective measures. Trump is also ordering Fed Ex, Amazon, UPS and the U.S Postal Service to begin searching for fentanyl in all packages from China. Early on Friday, China said it would put into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes .----------10:10 a.m. China is putting into place tariffs on $75 billion in U.S. products in retaliation for the Trump administration's latest planned tariff hikes. China said Friday that it will also increase import duties on U.S.-made autos and auto parts. The retaliation pulled global markets into negative territory Tariffs of 10% and 5% will take effect on two batches of goods on Sept. 1 and Dec. 15. Beijing gave no details of what goods would be affected but the timing matches Trump's planned hikes. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Facebook Twitter SMS Email Print Save Tags Business General News International Trade Economy Trade Barriers Trade Policy Economic Policy Government Business And Finance Government And Politics Government Policy Stock Prices Leading Economic Indicators Synthetic Opioids Synthetic Drugs Opioids Corporate Management Personnel Corporate News New Products And Services Products And Services Retail Industry Retail And Wholesale Consumer Services Consumer Products And Services Automobile Manufacturing Consumer Product Manufacturing Skin Care Personal Care Beauty And Fashion Lifestyle Consumer Electronics Industry Conferences And Trade Shows Consumer Electronics Show Trade Agreements International Agreements International Relations Technology Locations China Greater China East Asia Asia United States North America Beijing"}, {"articleID": "2012092519_00036747_W", "names": {"Julie Brown": ["Q28004983", "Q43184284", "Q454119", "Q524776"]}, "date": "2012-09-25", "url": "http://drugstorenews.com/article/study-most-physicians-support-employer-weight-loss-programs-unhealthy-food-regulations", "content": "e-mail study: most physicians support employer weight-loss programs, unhealthy food regulations adherence among chronic disease patients can lead to big savings new alliance will crack down on adulterated products touting dietary supplement claims walgreens' pegus to discuss impact of diabetes management on healthcare costs rite aid takes a bite out of obesity; relaunches weight-loss program for new year arlington, va. - more than three-quarters of physicians think the federal government should regulate foods with unhealthy ingredients, while 79% say employers should fund weight-loss programs for employees, according to results of a survey presented tuesday at a diabetes conference. the survey, conducted by joslin diabetes center and healthcare research firm worldone, included more than 150 endocrinologists and primary care physicians, and results were presented at joslin's diabetes innovation 2012 conference. \"these results are very important to us and our mission,\" joslin executive director of diabetes innovation and global professional education <mark>julie brown</mark> said. \"with diabetes innovation 2012, it's vital that all stakeholders are aligned, and we understand beliefs and concerns that may derail progress toward a more effective system. if stakeholder groups' concerns are not understood or ignored, we won't realize the true cooperation we need to make any sustained, valuable improvement .\" in addition to the 76% of respondents who supported federal regulations of unhealthy foods, 71% supported new york's ban on sugary soft drinks larger than 16 oz. in public food venues. meanwhile, 97% said individual health counseling has a powerful effect on the health of people with diabetes. eighty-seven percent said more pharmaceutical options for the disease are needed, while 62% said devices like insulin pumps, monitors and implants and drug therapies are most likely to have the greatest near-term benefit to patients. at the same time, there were significant differences between the responses of physicians and delegates to the conference. while 55% of delegates said pharmacists should be able to serve as primary care providers for people with diabetes, 15% of physicians said the same. meanwhile, 70% of physicians said pharmaceutically assisted innovations are necessary for obesity management, compared with 45% of delegates. seventeen percent of physicians said future screening would have a positive effect on clinical outcomes; 9% of delegates said the same."}, {"articleID": "2018062117_00080312_W", "names": {"George Sheldon": ["Q16980854", "Q5544490"]}, "date": "2018-06-21", "url": "http://tampabay.com/florida-politics/buzz/2018/06/21/youth-care-worker-overseeing-kids-seized-at-border-has-pending-felony-drug-charges/", "content": "The Buzz Youth care worker overseeing kids seized at border has pending felony drug charges \"People with open criminal cases should not be watching children that we have in holding facilities in our country,\" said Circuit Judge Jeri B. Cohen. \"I think it's a disgrace .\" The entrance for the Homestead Temporary Shelter for Unaccompanied Children on Monday, June 18, 2018. Ellis Rua | [email protected] By Carol Marbin Miller 24 minutes ago During the day, Franky Santos attends meetings for people trying to get clean, occasionally performs community service, and appears regularly before the Miami judge who oversees the county's Drug Court. At night, he's a caregiver for immigrant children being held at a Homestead shelter. As controversy continues to swirl over the Trump administration's immigration policy--even after it walked back a decision to separate undocumented immigrant children from their parents and house them in shelters--a new question looms: Who's minding the kids? Though children's advocates and human rights groups have criticized the administration's decision to house even small children in shelters--some of which include chain-link fencing likened to cages--Attorney General Jeff Sessions and other administration officials have insisted that the youngsters are well-cared for. In Homestead, it turns out, some of the youngsters are, or were, being cared for by a 38-year-old man who is in Miami-Dade's Drug Court facing pending felony drug possession charges. On Monday, Franky Santos appeared before Circuit Judge Jeri B. Cohen, who is overseeing his case in drug court. Santos told the judge he had just been hired as a \"lead youth care worker\" at the U.S. Department of Health and Human Services' compound in Homestead. \"I watch over the children,\" he said, to \"make sure they don't sneak off or go anywhere where they're not supposed to .\" The judge, who had presided over child welfare cases for more than a decade, appeared to be surprised at Santos' new job. \"People with open criminal cases should not be watching children that we have in holding facilities in our country,\" she said. \"I think it's a disgrace .\" \"I'm just shocked, although I shouldn't be,\" she added. Santos said he works at the Homestead Temporary Shelter for Unaccompanied Children, a 1,000-bed center for children who have entered the U.S. without permission. The shelter was shuttered last year when the number of unaccompanied youths being held there declined. But it was reopened in recent weeks just as the Trump administration announced it would hold children separately from their families if the parents faced criminal prosecution for illegal entry. The administration's decision, reversed Wednesday, to separate children from their parents drew harsh rebukes from civil rights groups and children's advocates, especially after it was revealed that children at a Texas shelter were being housed within chain-link fencing that critics said resembled cages. <mark>George Sheldon</mark>, a former secretary of the Florida Department of Children & Families who now heads Miami's private foster care agency, Our Kids, called the policy \"obscene .\" \"There's no word I can use to describe what I think is an extremely inhumane policy,\" <mark>Sheldon</mark> added. Said U.S. Rep. Charlie Crist: \"This is indefensible. Stunning and disappointing, to say the least .\" \"I know the president signed what appears to be a reversal, but there are a lot of problems still left hanging, sadly,\" the St. Petersburg Democrat said Thursday. \"Where are the 2,300 children that were already removed, and how will they be returned. And, obviously, some of the employees watching them may be questionable. It's one thing after another after another. When you launch a bad policy, it only gets worse. This is a nightmare for our country, but, most importantly, for these children .\" The administration had defended the practice, and leaders at the Justice Department, Homeland Security and elsewhere insisted youngsters were well-cared for. \"It is important to note that these minors are very well taken care of--don't believe the press,\" Homeland Security Secretary Kirstjen Nielsen told the National Sheriff's Association, while addressing reports of substandard treatment of minors. And although the Trump administration says it will no longer separate children from their parents at the border, immigrant advocates insist it will be difficult to reunify the more than 2,000 children who already are held in shelters after being removed from their families. It's impossible to say whether the private company that operates the Homestead shelter was aware of Santos' legal troubles and hired him anyway--as Santos claimed in court--or failed to perform a background check. Comprehensive Health Services Inc., which operates the Homestead shelter under contract with the U.S. Department of Health & Human Services, declined to comment, referring questions to HHS. A spokesman for HHS, which oversees the youth shelters, did not reply to requests from the Miami Herald to discuss the Homestead shelter. <mark>Sheldon</mark> oversaw the development of shelters for immigrant children beginning in 2012, when he was assistant secretary at the U.S. Administration for Children & Families at HHS under the Obama administration. He said the contracts his agency inked required providers to vet the men and woman who were in caregiver roles with children. \"This raises the question of how good their background screening is,\" <mark>Sheldon</mark> said. \"There have got to be federal regulations in that contract .\" Comprehensive Health Services, which is one of the largest providers of workforce medical services, has been criticized in the past for its performance while under contract with U.S. government agencies. Last year, the Justice Department announced CHS had agreed to pay the U.S. government $3.8 million to settle a complaint under the False Claims Act that it had double-billed and mischarged the Internal Revenue Service as part of a contract to provide medical services to IRS criminal investigation agents. The Justice Department said CHS double-billed for vision screenings, electrocardiograms and blood tests between April 2009 and April 2014. \"Businesses that knowingly overcharge the government should be held accountable and penalized,\" then-U.S. Attorney Rod Rosenstein said. The top federal prosecutor in Baltimore at the time, Rosenstein now is deputy attorney general. In 2012, an Arkansas man and woman sued a subsidiary of CHS, claiming they'd been fired by the company after they complained that the subsidiary had provided \"substandard care\" to personnel at Sather Air Force Base, now known as Baghdad Diplomatic Support Hospital, in Iraq as part of a contract with the U.S. State Department. In their lawsuit, the two claimed a man died after a \"critical care practitioner\" botched the insertion of a breathing tube. The lawsuit was later settled. In August of last year, Santos was pulled over for speeding in Key Largo when an officer smelled what he thought was marijuana in Santos' Jeep. An officer found more than 20 grams of the drug in a gym bag in Santos' trunk. Santos agreed to enter drug court, and his case was transferred to Miami-Dade County. Other arrests included a 2008 misdemeanor marijuana charge, for which adjudication was withheld, a 2008 misdemeanor loitering charge, which was dropped, and a 2012 misdemeanor domestic battery charge, which also was dropped. At a hearing Monday, Santos was upbeat when asked how he was doing. \"I'm doing great,\" he said. \"I just recently got a new job for the government .\" Santos said he was overseeing children aged 12-17 who were detained at the U.S. border. \"It's not a public thing,\" he said. \"I'm not even really supposed to talk about it .\" Training for the job consisted of \"an orientation class,\" Santos said. \"It's like a daycare,\" he added. \"They just want you to observe the children, make sure that they're not...acting crazy or just being rude or--they just want to keep control and make sure that they're not doing anything out of the usual .\" Santos said the company was aware he was facing felony drug charges when it hired him. A representative of the county's drug court program said in court that Santos had tested positive for marijuana on Monday--not his first failed test, court records show. . Santos said the test was picking up marijuana he had smoked in mid-April, but Cohen said the substance would not be detected after so many weeks. \"No, that's impossible,\" the judge said. \"Marijuana doesn't stay in the system 60 days .\" \"Can you give me two weeks, and I will come up clean?\" Santos asked. \"I just want you to be honest,\" the judge replied. It's unclear whether Santos still has the job at the Homestead shelter; Cohen said in court he should quit and look for another job that doesn't entail caring for children. Before concluding the hearing, Cohen offered her opinion on the government's system for overseeing kids: \"The United States government should be hanging its head in shame,\" she said. It's \"disgusting that they would hire someone with an open felony to watch children .\" Herald writer Aaron Leibowitz and researcher Monika Z. Leal contributed to this report. Sign up for the Daily Buzz newsletter Get the top five stories from the Tampa Bay Times political team emailed to you Monday-Friday at 3p. m. Enter your email address"}, {"articleID": "2014092014_00028533_W", "names": {"Mike Ashley": ["Q15454805", "Q554077"]}, "date": "2014-09-20", "url": "http://chroniclelive.co.uk/news/north-east-news/newcastle-united-fans-hand-out-7803727", "content": "Manhunt after teenager snatched from bus stop in Wallsend and raped in car Police swoop to clear Newcastle's East End of criminal residents Body found at University of Sunderland student accommodation during Freshers' Week 15-year-old girl raped while she waits at a bus stop in Wallsend Revealed: What Newcastle United boss Alan Pardew told his players about the boo boys Alan Pardew may have to substitute one of his younger players to protect them Newcastle United manager Alan Pardew does not fear his expected reception at St James' Park Newcastle United v Hull City LIVE: Build-up, action and analysis from St James' Park 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park \"data-type =\" fb-share \"data-action =\" article:7803727 \"> 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park\" data-type = \"tw-share\" data-action = \"article:7803727\" > 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park Newcastle United fans will this afternoon attempt to carry banners into St James' Park calling for the sacking of manager Alan Pardew. The SackPardew.com campaign has printed 100 banners and 30,000 leaflets with their message, which on Saturday lunchtime were being distributed through pubs in the city. \"I got up at 4.15 am this morning and drove up from London to support this,\" said one disgruntled Toon fan handing out leaflets outside The Junction pub at Haymarket, who did not wish to be named. \"I was a season ticket holder but after the Sunderland game last season I said never again go to another match while Pardew was in charge, but when I saw this I thought I've got to come up .\" What really got me about it was that all the stuff they are saying on their website is the same as I've been thinking and saying to my friends in London, who think he's doing ok because they only see what is shown and said on Match of the Day and Sky Sports. \"A few people have taken issue with it as I've been stood here, saying you can't change things by sacking the manager, but he's not doing well enough .\" Even when we finished fifth in the league we were getting by on luck and magic from one or two players and we scraped wins. \"None of the people handing out the leaflets and banners that the Chronicle spoke to were willing to give their names, in many cases citing the anonymity of the campaign as one of the reasons they were attracted to it .\" In the past we've had 60th minute walkouts, and 69th minute walkouts and demonstrations outside the ground, but they're all by all different groups and they squabble and can't agree and it all seems to be about the individuals or the groups making a name for themselves, \"said another of the protestors .\" But this isn't. It's one clear message and it doesn't matter who you are, if you want to get behind it you can - and if you don't then that is fine too. \"At Bar Loco, on Leazes Park Road, the mood among those handing out the larger banners was positive, with reports of many supporters stopping to pick up the protest material before trying to take it into the ground for the match against Hull City .\" I think there is a malaise at the club and if we keep Pardew then we will go down, \"said a protestor in his 20s .\" And I think the atmosphere in the ground is also not what it was before - and I believe that is Pardew's fault, not <mark>Mike Ashley</mark>'s. \"We used to play attacking, exciting football but these days there is nothing to be excited about in the club. Newcastle United v Hull City LIVE: Build-up, action and analysis from St James' Park Keep up to date with all the build-up, action and reaction to Newcastle United's Premier League clash with Hull City at St James' Park Alan Pardew unlikely to net compensation bonanza should he be fired after Hull City game Alan Pardew reacts to Chronicle's popularity poll ahead of crunch clash with Hull City Newcastle United manager Alan Pardew feels that the Chronicle's poll was not an accurate measuring stick over his popularity Irate fans tell Alan Pardew it's time to get out of Toon: Poll reveals 86% want NUFC manager sacked See more stories you'll love You've turned off story recommendations. Hunt for missing Alice Gross is biggest police search since 7/7 bombings North East news LIVE: Latest updates from Newcastle and the North East Alzheimer's Society Memory Walk draws crowds to Newcastle and Gateshead quaysides Manhunt after teenager snatched from bus stop in Wallsend and raped in car Police swoop to clear Newcastle's East End of criminal residents Body found at University of Sunderland student accommodation during Freshers' Week 15-year-old girl raped while she waits at a bus stop in Wallsend See more stories you'll love You've turned off story recommendations. Burnley v Sunderland LIVE: Build-up, action and analysis from Turf Moor Alan Pardew unlikely to net compensation bonanza should he be fired after Hull City game Contact us Got a story in your area? Is there something happening in your area you would like us to report on? Competitions and promotions Vikki Hawkins Print The Chronicle is read by more adults than any other regional newspaper on sale in the area. With 170,115 average issue readers, this reach extends to 366,753 weekly readers - that's over 1/4 of adults in the area! The average time spent reading the Chronicle is 31 minutes; which shows the length of time that readers are engaging with the editorial and advertising content. 49,199 * copies of the Chronicle are sold on average each day as it continues to be an integral part of the region. * ABC Newcastle Chronicle 100% paid, Mon - Sat, JICREG, 1/10/2012 Page Views: 10m Audience figures from Omniture, monthly average (Jan - Jun 2014). More than 1 in 3 ChronicleLive users have clicked through to an online advertisement, demonstrating that our users are responsive and receptive to Internet advertising messages. ChronicleLive reaches an internet-savvy audience, with 84% of users having purchased products or services online in the past 12 months. Download our rate cards for all the prices of our print and digital products. Editor, The Chronicle Editor-in-Chief, Trinity Mirror North East Darren was appointed editor of the Chronicle in September 2011, following a six-year spell as editor of the Evening Gazette in Teesside."}, {"articleID": "2018080606_00021207_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"]}, "date": "2018-08-06", "url": "http://sports.espn.go.com/cfl/story/_/id/24296094/terrell-owens-works-cfl-saskatchewan-roughriders", "content": "print A day after hosting an unconventional Pro Football Hall of Fame induction ceremony at the University of Tennessee at Chattanooga, former NFL wide receiver Terrell Owens worked out for the Canadian Football League's Saskatchewan Roughriders in nearby South Pittsburg, Tennessee. The workout, overseen by Roughriders head coach and general manager <mark>Chris Jones</mark>, was held Sunday at South Pittsburg High School and featured a handful of attendees, among them former UCF quarterback Justin Holman and former South Carolina defensive back Rico McWilliams. \"I know I'm truly blessed and I can still play the game,\" Owens, 44, told the Chattanooga Times Free Press after the hour-plus workout. \"What I did out there today is just a small little snippet of what I can do. I just appreciate Coach for the opportunity. I guess he wanted to assess and see where I am physically .\" It's key when you're trying out to put your best foot forward, and I'm very pleased with what they saw and what I did out there. To be inducted into the Hall of Fame and come back and play, why not me? I know I can do it; it's just a matter of someone giving me the opportunity. \"<mark>Jones</mark>, a graduate of the University of Tennessee at Chattanooga, said he wanted to evaluate Owens' route running and test his stamina .\" I have tryouts whenever it's possible so that former college and pro athletes have the chance to prove themselves and see if they can improve our team, \"<mark>Jones</mark> told the Chattanooga Times Free Press .\" But I've never been faced with anything like this. I mean, he's 44 years old but still runs a 4.4-second 40. \"An agent reached out to me to say that T.O. was interested in a tryout. I gave him the dates we would be available, and it just happened to work out that the timing was perfect for him since he was in Chattanooga for his ceremony. I told him it would be better to come here for the tryout because there wouldn't be the media frenzy that would be created if he crossed the border to work out in Canada .\" A third-round draft pick of San Francisco in 1996, Owens played eight seasons with the 49ers, two with the Philadelphia Eagles, three with the Dallas Cowboys and one each with the Buffalo Bills and Cincinnati Bengals. The six-time Pro Bowler compiled 15,934 receiving yards and 153 receiving touchdowns on 1,078 career receptions. He was released by the Seattle Seahawks early in the 2012 preseason and has not played professionally since. On Saturday, Owens delivered an emotional, 40-minute speech at his alma mater, during which he reiterated why he skipped this weekend's Hall of Fame ceremonies and criticized what he called a \"flawed\" voting process. Owens was elected to the Hall of Fame in his third time on the ballot. Information from ESPN's Vaughn McClure was used in this report."}, {"articleID": "2009082122_00031333_W", "names": {"Michael Warren": ["Q1841701", "Q21012712", "Q21547252", "Q3428556", "Q6835221", "Q6835223", "Q6835227"]}, "date": "2009-08-21", "url": "http://chron.com/disp/story.mpl/ap/top/all/6582226.html", "content": "santiago, chile - chile said friday that tests show swine flu has jumped to birds, opening a new chapter in the global epidemic. top flu and animal-health experts with the united nations in rome and the u.s. centers for disease control and prevention in atlanta were monitoring the situation, but said the infected turkeys have suffered only mild effects, easing concern about a potentially dangerous development. chile's turkey meat remains safe to eat, the experts said, and so far there have been no signs of a deadly mutation. none of the birds have died from this flu, according to the farms' owner, sopraval sa. chile's health ministry said it ordered a quarantine friday for two turkey farms outside the port city of valparaiso after genetic tests confirmed sick birds were afflicted with the same virus that has caused a pandemic among humans. the infected birds are contained within closed buildings, preventing any spread to wild birds, the farms' owner said. so far, the virus - a mixture of human, pig and bird genes - has proved to be very contagious but no more deadly than common seasonal flu. however, virus experts fear a more dangerous and easily transmitted strain could emerge if it combines again with avian flu, which is far more deadly but tougher to pass along. sopraval alerted the agriculture ministry after egg production dropped at the farms this month. after initial tests on four samples, further genetic testing confirmed a match with the subtype a/h1n1 2009, the agriculture and health ministries announced. \"what the turkeys have is the human virus - there is no mutation at all,\" deputy health minister jeannette vega told chile's radio cooperativa on friday. the health ministry said it ordered a complete quarantine friday and alerted the u.n.'s world health organization. the u.n.'s food and agriculture organization, meanwhile was working closely with chilean government scientists, said dr. juan lubroth, the head of infectious diseases for fao in rome. chile is sending some samples outside the country for more genetic sequencing to confirm that it matches the pandemic strain, lubroth said. \"as a scientist, i want to touch, smell, feel, taste it\" before agreeing that it's a match, he said. there are some encouraging signs that this particular outbreak remains mild. egg production and water consumption among the birds dropped - prompting the company to take action - but the birds aren't terribly sick, let alone dying in large numbers, lubroth said. \"my understanding is that with the ones that were sick, it was a very mild disease,\" lubroth said. \"it's significant in that we don't need to recommend any drastic measures, as far as culling the population of turkeys. let them go through their illness and recover - seven to 10 days - and if they are sound and healthy, they could enter the food chain .\" sopraval veterinarian andrea campos said that won't happen because the outbreak has been limited to birds raised to lay eggs, not those being fattened for meat. \"in all of the birds raised to be fattened to produce meat, we have not found any illness. this is an illness entirely limited within a reproductive group,\" campos said. lubroth praised the company and the chilean ministries for the actions they've taken. \"if it were highly virulent then we would recommend stronger measures,\" lubroth added. chile, meanwhile, is acting to contain the outbreak by limiting the turkeys' contact with people and wildlife, lubroth said. but given the mildness of this particular outbreak, he said, \"i don't see that there is going to be a large risk from what we know today of this type of transmission occurring .\" u.s. health officials said they remain wary of the possibility that swine flu will mutate by mixing with bird flu or other forms of influenza. but they haven't received any reports of a dangerous mutation yet, and the fact that the virus can spread to turkeys was not all that surprising, said dr. anthony fauci, director of the national institute of allergy and infectious diseases, speaking at a friday news conference in atlanta. the chilean report \"did not raise any great concerns among us,\" fauci said. the u.s. department of agriculture has a longstanding avian influenza surveillance program that it says would detect any h1n1 virus outbreak in u.s. poultry. the usda recently infected ducks, chickens, turkeys and quail in lab experiments, and none became clinically ill. low levels of the virus infected the quail, but the disease did not spread, the agency said this week. in chile, the virus has infected at least 12,000 people and killed 128. throughout the americas, as of aug. 14, 105,882 confirmed cases were reported from all 35 countries, including 1,579 deaths in 22 countries. ___ associated press writers <mark>michael warren</mark> in buenos aires, argentina; mike stobbe in atlanta; and mary clare jalonick in washington contributed to this report. comments readers are solely responsible for the content of the comments they post here. comments are subject to the site 's"}, {"articleID": "2013051623_00008386_W", "names": {"David O'Connor": ["Q28321062", "Q364502", "Q50976251", "Q5238131", "Q5238132", "Q5238134", "Q57902003"], "Phil Smith": ["Q16018910", "Q21598350", "Q7182421"], "Matt Jackson": ["Q21621555", "Q2596323", "Q3299492", "Q41321960", "Q6791039"]}, "date": "2013-05-16", "url": "http://www.express.co.uk/news/uk/400138/Crowds-cheer-Royal-Marines-return-from-Afghanistan-as-Prince-Philip-awards-medals", "content": "UK Crowds cheer Royal Marines return from Afghanistan as Prince Philip awards medals Crowds cheer Royal Marines return from Afghanistan as Prince Philip awards medals About 700 Royal Marines marched through Taunton to the sound of cheering crowds Good riddance Afghanistan. I haven't got much affection for Afghanistan, it was just a job. I'm glad it's over. The homecoming parade marked the end of Somerset-based 40 Commando unit's fourth and final deployment in the region, and it was followed by a medal ceremony attended by Prince Philip. Since the unit's first deployment in 2001, 18 Royal Marines have died in Afghanistan, with Cpl <mark>David O'Connor</mark> the most recent fatality. Sgt Richard Winslade was relieved to be home, and said: \"Good riddance Afghanistan. I haven't got much affection for Afghanistan, it was just a job. I'm glad it's over .\" It's horrendous, especially if you know those who are killed. But it's a matter of cracking on with life and the job. \"You get back from the tour and that's when you reflect on what's happened .\" Prince Philip presented medals to 40 Royal Marines Crowds lining the route waved flags and cheered as the soldiers marched past, before coming to halt outside Castle Bow. The town's mayor, Libby Lisgo, thanked the Royal Marines and led a short reflection remembering Cpl <mark>David O'Connor</mark> who was killed in this last tour of duty. <mark>Phil Smith</mark>, whose son Stuart was on his first tour of duty, travelled from Surrey to watch the parade. He said: \"We were very nervous before the tour so today is the culmination of things and we are very pleased our boy is back safely .\" They have done a fantastic job. \"Also present was Carol Atcheral, who watched her son John march through the town. She said:\" It's wonderful to see him, it's so great but they're all so young and so fit. \"I've got mixed emotions because thinking about the way they were in Afghan - and look at them, so young, so healthy and fit - it's so great to see them back again .\" Rory Eccleson, 6, prepares to cheer on the returning troops Commanding Officer Lt Col <mark>Matt Jackson</mark> said: \"I remember a time when the military were an inconvenience and people only ever saw problems. Since Iraq, people are more grateful to the military and the parade's a way of thanking everybody .\" If you prevent a foreign country from being a haven for terrorists it increases security in the homeland. \"Afghanistan remains a dangerous place but the Afghan security forces are good enough now to take on responsibility for delivering security in their own country .\" He said the first part of their last tour involved fighting insurgents and latterly helping Afghan forces take the lead ahead of the withdrawal of foreign forces. Speaking ahead of the medal ceremony, which would see 40 troops presented with honours, Lt Col <mark>Jackson</mark> said: \"It's a significant moment for us because Prince Philip is the captain general of the Royal Marines so he is the most important person within the Royal Marines .\" \"We have paid a high price in Afghanistan' PM maintains work is\" vital' despite deaths Soaring energy bills scandal: shocking 10 per cent rise in prices to hit millions Northern and Shell Copyright? 2013 Northern and Shell Media Publications."}, {"articleID": "2017080717_00145882_W", "names": {"Daniel Anderson": ["Q114489", "Q3013658", "Q5216411", "Q5216412", "Q58067865"]}, "date": "2017-08-07", "url": "http://www.theepochtimes.com/n3/2277795-2-boy-scouts-electrocuted-to-death-after-boat-his-power-line-in-texas/", "content": "2 Boy Scouts Electrocuted to Death After Boat His Power Line in Texas August 7, 2017 AT 1:00 PM Last Updated: August 7, 2017 1:00 pm (Carl Ballou/Shutterstock) Two boys were killed and one person was injured after a sail boat struck a power line on Saturday in Marion County, Texas, according to officials. The boys, who belonged with the Hallsville Boy Scouts, got electrocuted when their catamaran sail boat was sailing on a lake near Hallsville. The boat caught on fire as a result, and scouts onshore could be heard shouting for help, according to Texas state wildlife officials. \"Preliminary investigations and observations indicates the vessel, a Catamaran sailboat, collided with an overhead transmission power line and those onboard may have been electrocuted as a result,\" a news release says. All of the boys were wearing their life jackets. \"Preliminary investigations and observations indicates the vessel, a Catamaran sailboat, collided with an overhead transmission power line and those onboard may have been electrocuted as a result,\" a news release says. (Screenshot) The three occupants of the boat were aged 11, 16, and 18. \"Wardens discovered an 18-year-old male onboard and a 16-year-old in the water a short distance away. Both victims suffered severe bodily injuries and were deceased,\" officials said in the release. \"It was a tragic scene,\" Texas Game Warden Quint Balkcom told ABC affiliate KLTV 7. Two boys were killed and one person was injured after a sail boat struck a power line on Saturday in Marion County, Texas, according to officials. (Google Maps) \"We have to come together as a scout family and make sure we are supporting those who are carrying quite a weight right now,\" <mark>Daniel Anderson</mark>, chief operating officer for the East Texas Boy Scouts of America, told the Washington Post. \"You're talking about great young men, men of integrity,\" Sherri Morgan, the Hallsville band director, said at a candlelight vigil, according to the News-Journal. \"We're heartbroken, we're devastated .\" \"All is not lost, they leave a legacy,\" she noted. \"So, they are going to live on forever .\". The injured and unresponsive 11-year-old boy scout was found nearby and was given CPR by good Samaritans on the scene. He was then taken to LSU Medical Center-Shreveport in Louisiana. The incident is s being investigated by the Texas Parks and Wildlife Department. Editor's Picks"}, {"articleID": "2015042120_00025113_W", "names": {"Carl Jenkinson": ["Q29497", "Q53755281"], "James Collins": ["Q10490126", "Q158980", "Q18160363", "Q19286436", "Q3806506", "Q3808408", "Q51585390", "Q54863756", "Q6131576", "Q6131582", "Q6131585"], "Kevin Nolan": ["Q148699", "Q6397100"], "David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}, "date": "2015-04-20", "url": "http://www.eatsleepsport.com/west-ham-united/jenkinson-focused-on-hammers-finale-1922851.html", "content": "<mark>Carl Jenkinson</mark> says West Ham are still focused on a good end to the season despite their recent sluggish performances. The Hammers' once promising campaign has tailed off, with a run of just one win in 11 Barclays Premier League games seeing the club slip from Champions League contention to mid-table. Their latest disappointing result came at Manchester City on Sunday as they went down to an insipid 2-0 defeat. With Europe now not realistic and relegation not an issue, the Hammers would now seem to have little to play for but <mark>Jenkinson</mark> insists the remaining five games are not meaningless. The 23-year-old, who has enjoyed a successful season-long loan from Arsenal and could make the switch permanently, said: \"People in our dressing room are fired up. If you came in the changing room after the game you'd see that .\" People aren't resting on their laurels, people ain't happy finishing mid-table. We want to kick on. We have got something to prove now because we have been on a bad run of games and we want to put that right. We owe that to ourselves and the fans. \"West Ham were never in the game at the Etihad Stadium, losing after a bizarre own goal from <mark>James Collins</mark> and a swift counter-attack strike from Sergio Aguero before half-time. Enner Valencia and <mark>Kevin Nolan</mark> did have late chances after City lost momentum following injury to <mark>David Silva</mark> but they were generally lacklustre throughout the contest. <mark>Jenkinson</mark> felt the visitors paid the price for their mistakes but does not feel the team are much doing much differently from the early part of the season. He said:\" I wouldn't want to blame it on luck but a few things haven't gone our way lately and we have conceded some late goals. \"I think this was a different story - we made a couple of mistakes and got punished .\" Of course we have got to work on our performances but if you look at the last 10 games, our performances haven't been bad at all. \"We have had some really good performances but teams have scored late goals against us and we have ended up getting a point instead of three. It has been a bit frustrating .\" I just think early on in the season we were finishing everything. Everything we got was going in the back of net and at important times of the game. \"We have gone ahead in recent games but never killed the games off and have ended up conceding cheaply towards the end of the game. Of course that is a real kick in the teeth .\" It is not nice blaming things on luck - you make your own luck - but that has been the story of our last couple of months. \""}, {"articleID": "2011081507_00041376_W", "names": {"Peter Pang": ["Q24049973", "Q41841008", "Q43225840", "Q9139763"], "Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"]}, "date": "2011-08-15", "url": "http://freemalaysiatoday.com/2011/08/15/ldp-aims-to-wrest-six-sapp-held-seats/", "content": "sabah's oldest bn ally ldp has urged its members not to \"linger in the past'. sandakan: the liberal democratic party (ldp) has laid claim to the six seats left vacant by sabah progressive party (sapp) who left barisan nasional (bn) in september 2008. the six seats comprise two parliamentary seats - tawau and sepangar - and the state constituencies of luyang, likas, elopura, and tanjung papat. ldp president vk liew made the claim for the six while officiating the annual general meeting for its six divisions in sandakan yesterday .\" it goes without saying that ldp will continue to contest in the four seats we contested in 2008, namely (the) sandakan parliamentary (seat) and the three state seats - karamunting, merotai and tanjung kapor. \"these seats are non-negotiable. on the other six seats left vacant by sapp who left bn in september 2008, we will no doubt be the only eligible local based party to lay claim to these six seats,\" he said. noting that the agm was probably the last before the 13th general election, he stressed that it was important for the party to be ready not only in its preparation but also in dealing with the other component parties in bn. \"we must first ensure unity within our party and at the same time ensure unity within bn .\" it is important for us to be united together to fight the opposition? a win for bn is a win for ldp. \"we must therefore ensure bn wins .\" it is important for us to produce quality winnable candidates in all the seats we will be contesting and show their qualities and abilities to serve the people without fear and favor. \"no point to be popular in the party and (be) able to win in party election but get rejected by the people in an election,\" said liew who the sandakan mp and a deputy minister in the pm's department. liew stressed that ldp must not fight yesterday's war as it is already over. \"our battle is tomorrow and to fight it, we must be prepared today. ldp must not linger on in the past .\" while we can use the past as a guide, we must be prepared today using today's strategies for tomorrow's battle. \"the battle field has now changed and the mindset of the people is also changing,\" he said. liew, who is also chairman of elopura ldp division, also took the opportunity to take a swipe at those who had quit the party to join rival bn parties for positions in government. \"many of you have been with ldp for the last 21 years. your loyalty has made me very proud and an envy of many others .\" despite recent attempt by someone, who left the party for his own personal glory just to hold on to his ministerial position, to entice our sandakan members with promises and financial gains, many of you were not moved by such tactics. \"a member even told me that the person even called him to ask him and a group of them to leave with lots of financial promises but instead he together with many others scolded that minister for being a traitor and slammed down the phone .\" this is the spirit of ldp that i together with the entire ldp are very proud of. \"you are the true heroes and heroines of ldp .\" though he did not name the \"minister', it is understood that liew was referring to former ldp member <mark>peter pang</mark>, the state youth and sports minister. please mind your language when making comments. should you post something derogatory, offensive or otherwise break the law, we reserve the right to remove the comment. we also appreciate reports of abuse from our readers. here's a pick of stories enjoyed by fmt readers this week: hindraf's uk lawyer <mark>imran khan</mark> deported ezam wants to burn down online news portals gcm isytihar\" perang' jika isu murtad tidak selesai 50 orang islam dipercayai menyertai majlis dumc jais attracts almost 20,000 \"likes' in facebook\" kami tidak teragak-agak untuk gempur '"}]