[{"articleID": "2014112115_00054412_W", "names": {"Christopher Graham": ["Q21165674", "Q5112420"]}, "date": "2014-11-21", "url": "http://upi.com/Top_News/World-News/2014/11/21/Peeping-Tom-Russian-hackers-streaming-stolen-webcam-scenes/9581416549859/?spt=hts&or=20", "content": "World News \"Peeping Tom' Russian hackers streaming stolen webcam scenes Brazen Russian hackers are hijacking office and home computer webcams in 250 countries and streaming the private scenes live on a website, officials have revealed. Footage from webcams in bedrooms, nurseries and in gyms are being shared with thousands of listed on the site, the website features 4,591 feeds from the U.S., 2,058 from France, 584 from the U.K., as well as 563 from Hong Kong and 182 from China. Officials in several countries are urging webcam owners to change their passwords to block access to the hackers .\" We have got to grow up about this sort of thing, \"said British Information Commissioner <mark>Christopher Graham</mark>.\" These devices are very handy if you want to have remote access to make sure your child is OK, or the shop is all right, but everyone else can access that too unless you set a strong password. \"The website has been operating for about a month, beginning in Hong Kong, then Australia and Canada. Ukrainian political parties sign coalition agreement Brent rises in response to Chinese data D.C. press corps, clean yourself up for the royal visit Scientists sequence brain-dwelling tapeworm Biden to push Ukraine PM to form government ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events."}, {"articleID": "2018100618_00307759_W", "names": {"David Adams": ["Q16091376", "Q24007533", "Q2633956", "Q42713808", "Q47546710", "Q5230604", "Q5230607", "Q5230608", "Q5230609", "Q5230611", "Q56855421", "Q57602629", "Q58218009", "Q586939"]}, "date": "2018-10-06", "url": "http://www.gamereactor.eu/news/?system=wiiu&sid=6ca509377fa8c5ee63bd7cad4c4c481c", "content": "On the 5th of October 2018 Magnus and Dóri take a closer look at what's new in the SteelSeries Rival 710. Diablo III: Eternal Collection - Local multiplayer Gameplay On the 5th of October 2018 Nintendo Switch introduces on Diablo III a local multiplayer mode for up to four people. We play the 20 first minutes of the game with friends. Coca-Cola Zero Sugar and Gamereactor's Weekly Esports Round-up S02E36 On the 5th of October 2018 It's Friday, so that means we have another episode of our Weekly Esports Round-up, including results from two big CS: GO events, an interview with the NBA 2K League's managing director, hardware, and so much more. Quick Look - MSI GeForce RTX 2080 On the 4th of October 2018 Magnus and Dóri take a look at the new MSI GeForce RTX 2080, discussing how this new generation of graphics cards could well be a game-changer for the industry. Battlerite Royale - Livestream Replay On the 4th of October 2018 Dóri knows a thing or two about battle royale games, but what does he make of Battlerite Royale, a game that takes the basic BR formula and puts a MOBA spin on things? Find out as we play the game for a couple of hours in this Livestream Replay. Quick Look - HP OMEN 35 Curved Monitor On the 4th of October 2018 Dóri and Magnus take a look at the impressive UWQHD, G-Sync, ultrawide monitor by HP. Watch them as they talk about its resolution, response time, design, image quality and potential use for gaming. Assassin's Creed Odyssey - A Fully Fledged RPG (Video #2) On the 4th of October 2018 In this second chapter in our massive video series, we take a look at how Ubisoft has turned the series into a fully fledged RPG. League of Legends: The Lure - Dan Abnett Interview On the 4th of October 2018 Dan Abnett wrote the League of Legends comic The Lure, and we talked to him about its creation. League of Legends Esports - NicoThePico Interview On the 4th of October 2018 We talked with League of Legends coach NicoThePico about how he got into the game, his experience, and what he's doing now. Fortnite: Season 6 - Livestream Replay On the 3rd of October 2018 Fortnite Season 6 has just landed to make things extra spooky in the battle royale game, and although we're a bit early for Halloween, we tried the new Season 6 content to see what's up. And no, we're not just talking about the Loot Lake island. Runescape Old School Mobile - John Colgrave Interview On the 3rd of October 2018 We caught up with John Colgrave from Jagex to learn more about their efforts to bring Runescape Old School to mobile devices. Liftoff - Kevin Haelterman Interview On the 3rd of October 2018 We were joined by LuGus Studios' Kevin Haelterman to learn more about the drone racing simulator Liftoff that recently exited Steam Early Access. Spyro Reignited Trilogy - Lou Studdert Interview On the 3rd of October 2018 Spyro is coming back this year with the Reignited Trilogy and producer Lou Studdert is here to tell us all about it. Mutant Year Zero: Road to Eden - Mark Parker Interview On the 3rd of October 2018 We caught up with producer Mark Parker to chat about the enticing combination of real-time stealth, tactical combat, and deep narrative that makes up Mutant Year Zero: Road to Eden. GTFO - Simon Viklund Interview On the 3rd of October 2018 We caught up with 10 Chamber Collective's Simon Viklund to learn more about the \"loveletter to hardcore co-op shooter fans\" that is GTFO. Remnant: From The Ashes - <mark>David Adams</mark> Interview On the 3rd of October 2018 Creative director <mark>David Adams</mark> joined us for a chat about one of the many exciting projects in the works at Gunfire Games, the supernaturally themed co-op shooter Remnant: From the Ashes. Trüberbrook - Darius Cernota Interview On the 3rd of October 2018 Producer Darius Cernota joined us for a chat about the lovely looking adventure game Trüberbrook that's been created using miniatures and is set in a small German town in the 1960s. The Surge: The Good, the Bad, and the Augmented - Livestream Replay On the 2nd of October 2018 Despite a few technical hiccups, we finally got stuck into some futuristic limb removal, this time with a western theme. That's right, we've been playing The Surge: The Good, the Bad, and the Augmented!"}, {"articleID": "2018112222_00392484_W", "names": {"Shane Jones": ["Q3959109", "Q7488117"], "Chris Barton": ["Q5105836", "Q5105837", "Q846359"], "Ashley Thompson": ["Q4805607", "Q9632941"]}, "date": "2018-11-22", "url": "http://learningenglish.voanews.com/a/are-forests-an-answer-to-carbon-pollution-/4662153.html", "content": "Are Forests an Answer to Carbon Pollution? 2 minutes ago The code has been copied to your clipboard. width The URL has been copied to your clipboard No media source currently available 0:00 0:03:03 Experts Turn Old Coal Mines into Carbon-Sucking Forests Share Are Forests an Answer to Carbon Pollution? share The code has been copied to your clipboard. The URL has been copied to your clipboard No media source currently available 0:00 0:06:12 64 kbps | MP3 Pop-out player Burning coal for energy adds planet-warming carbon dioxide, or CO2, to Earth's atmosphere. As the planet heats up, experts warn that simply cutting greenhouse gas emissions will not be enough to avoid possibly disastrous levels of global warming. CO2 must also be removed from the atmosphere, they say. Existing experimental machines that pull CO2 directly from the air are too costly to be widely used. But a new report from the U.S. National Academy of Sciences, Engineering and Medicine says effective carbon-removal technology already exists. It is not costly, or even complex science. It is forests. The report explains that planting trees and overseeing forests are cost-effective ways to clean the air. They also work well across large areas. Forests used to cover large areas of the Appalachian Mountains in the eastern United States. In the state of West Virginia, a kind of mining known as strip mining left the land there bare, without trees. Now experts are working to bring back the forests that once covered much of the state. West Virginia's Monongahela National Forest is home to a rare group of trees. They are called virgin woods; they have never been touched by humans. <mark>Shane Jones</mark> is a biologist with the U.S. Forest Service. \"Living in the East, there's not many places you can go and be untouched by Man .\" <mark>Jones</mark> says the trees there were missed by mistake when the surrounding forest was cut down for wood many years ago. That mistake turned out to be a good thing; red spruce forests such as those in the Monongahela are great at taking CO2 out of the atmosphere and locking it into the soil. <mark>Jones</mark> explains as he runs his hand through the dark black earth beside a tree. \"See all that organic material? It's black because it's incredibly high in carbon .\" Over the years, coal mining and cutting forests took over 90 percent of the red spruce forests from the Appalachian Mountains. Now, as the planet warms, the need for forests to remove coal's CO2 is increasingly urgent. <mark>Chris Barton</mark> works for the University of Kentucky. As he walks along the Appalachian land, he says the needs of warm-weather rainforests get most of the world's attention. \"But here in the temperate region of the world, in Appalachia, four hours away from Washington, D.C., we have billions of trees that potentially we could be planting .\" So, <mark>Barton</mark> started a group called Green Forests Work. Its members aim to put trees back on the roughly 400,000 hectares of land that was cleared away by strip mining. However, <mark>Barton</mark> explains, the land has problems. \"If you went out and planted trees on these sites, they just didn't grow. The ground was way too compacted. Water didn't infiltrate. Roots can't penetrate. Oxygen can't circulate in those environments .\" The solution? Using heavy equipment, workers tear up the ground. The process lets the trees they plant put down roots. <mark>Barton</mark> says not everyone believes the solution is a good idea. \"We've had a lot of people kinda look at us twice. But the really interesting thing about it is, after we do it, there's no question that that was the right thing to do .\" And it has worked. Forests are coming back to the grounds. Scientists say that, in West Virginia alone, restoring red spruce forests to the area could send what is equal to 56 million barrels of oil into the ground. But it will take time. A long time. Around the world, experts say, nature offers powerful tools to fight climate change. But patience is needed, <mark>Jones</mark> says. \"It's really awesome to see a tree planted eight years ago that's now waist high. But at the end of the day, at the end of my day, we're barely getting started. Because our main goal with the restoration work that we do here is to basically take actions to then let nature take over .\" Nature works, but slowly, in its own time. I'm Anne Ball. Steve Baragona reported on this story for VOANews.com. Anne Ball adapted this story for Learning English. <mark>Ashley Thompson</mark> was the editor. We want to hear from you. Write to us in the Comments Section. _______________________________________________________________ Words in This Story greenhouse gas emissions--n. gases that come out of cars and factories, etc. that trap heat in the atmosphere and great a warming of the planet global--adj. of, relating to or involving the entire world temperate--adj. moderate climate that lacks extremes compacted--adj. having a dense structure or parts closely packed together infiltrate--v. to pass through penetrate--v. to gain entrance to, or pass into awesome--adj. causing feeling of fear and wonderful, extremely good"}, {"articleID": "2018101501_00326107_W", "names": {"James Hansen": ["Q21556323", "Q58205689", "Q724095"]}, "date": "2018-10-15", "url": "http://www.northwichguardian.co.uk/news/national/16982730.government-seeks-advice-on-net-zero-emissions-target/", "content": "Scottish Labour set climate change target 0 comments Climate change experts have been asked to advise the Government on setting a target for achieving net zero greenhouse gas emissions from across the economy. The Committee on Climate Change will also advise on whether the UK needs to review its 2050 target of cutting emissions by at least 80% relative to 1990 levels, to meet international commitments set out in the Paris Agreement. Prime Minister Theresa May said: \"On the global stage, the UK is driving forward action on climate change through our work at the UN and with our Commonwealth partners .\" To ensure that we continue to lead from the front, we are asking the experts to advise on targets for net zero emissions. \"Are we on the #RoadtoZero road transport emissions? The 2050 target requires it. DfT's strategy wasn't out in time for our 2018 report--yesterday we wrote to @ transportgovuk & @ beisgovuk Lots to welcome (esp charging infra) but it won't meet cost effective path to the targets. https: //t.co/vK76ppbqcJ--Chris Stark (@ ChiefExecCCC) October 12, 2018 The request to the CCC comes after a major UN report said countries must take\" unprecedented \"action to slash carbon emissions to zero by 2050 and limit global warming to 1.5 C above pre-industrial levels. Limiting warming to 1.5 C is possible but will require fast and far-reaching changes to power generation, industry, transport, buildings and potential shifts in lifestyle such as eating less meat. It will also require action to take excess carbon emissions out of the atmosphere, the Intergovernmental Panel on Climate Change said. The letter to CCC chairman Lord Deben invites his committee to consider what emissions reductions would be needed to make an appropriate contribution to the Paris target of a\" well below 2C \"rise or the 1.5 C limit urged in the new report. Energy and clean growth minister Claire Perry said the CCC would give\" advice on a roadmap to a net zero economy, including how emissions might be reduced and the expected costs and benefits of doing so \". The move comes at the start of the Green GB Week initiative, and the Government claimed that jobs in green industries could reach two million by 2030, generating up to £ 170 billion in exports. Ministers will also set out proposals for new laws for\" smart energy \"appliances like washing machines and electric heating, with the ambition of making all new buildings smart by 2030. Environmental campaigners welcomed the Government's net-zero move, but called for a commitment to the 1.5 C goal. Gareth Redmond-King, head of climate at WWF said:\" Scientists from around the world said we had 12 years to tackle climate change. \"Governments can no longer shirk their responsibilities .\" It's time to act and, crucially, embrace the opportunities a green economy presents. \"Done right, this could be the biggest economic opportunity in history, driving innovation, job creation and better living standards .\" By limiting global temperature rise to 1.5 ° C, we could reduce air pollution and save the lives of 153M children, neighbours, and people around the world. What future will you choose? #ClimateChange?? https: //t.co/yA1FjnpK9u pic.twitter.com/wNpgRHj7Li--The ClimateCoalition (@ TheCCoalition) October 8, 2018 Ed Matthew from The Climate Coalition said: \"It is not just the target that matters, it's how fast we get there .\" The CCC must now ensure that this net-zero pathway is compliant with no more than 1.5 C of warming. \"Shadow business secretary Rebecca Long-Bailey said the announcement came as Government\" slashes support for small scale renewables, scales back support for electric vehicles \"and had been\" slammed \"by leading climate scientist <mark>James Hansen</mark> for its pursuit of fracking .\" This gaping contradiction is no accident--it is hypocrisy of the highest order, and an affront to those communities on which this government has forced the fracking industry, \"she said. Liberal Democrat environment spokesman Tim Farron claimed the Tories had\" lurched drastically away from supporting green technologies \". 0 comments"}, {"articleID": "2018031313_00317663_W", "names": {"Jeff Taylor": ["Q3807796", "Q6175126", "Q6175130", "Q6175132"]}, "date": "2018-03-13", "url": "https://www.massdevice.com/anika-ceo-retires-after-two-decades-president-assumes-corner-office-personnel-moves-march-13-2018/", "content": "Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 - MassDevice MassDevice <script type = \"text/javascript\" language = \"JavaScript\" src = \"https: //designw.nui.media/pipeline/553620/0/vj? z=designw & dim=538595 & kw= & click= & abr= $scriptiniframe\" > </ script> <noscript> <a href = \"https: //designw.nui.media/pipeline/553620/0/cc? z=designw\" > <img src = \"https: //designw.nui.media/pipeline/553620/0/vc? z=designw & dim=538595 & kw= & click= & abr= $imginiframe\" width = \"970\" height = \"250\" alt = \"\"border =\" 0 \"> </ a> </ noscript> Home\" Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 Anika CEO retires after two decades; president assumes corner office | Personnel Moves--March 13, 2018 March 13, 2018 By Sarah Faulkner Leave a Comment Anika Therapeutics (NSDQ: ANIK) announced this month that CEO Charles Sherwood plans to retire after working for Anika for nearly twenty years. Joseph Darling, who has been Anika's president since July 2017, will take his place in the corner office. Darling has previously served in executive leadership roles across an array of medtech companies like Abbott (NYSE: ABT), Baxter (NYSE: BAX) and Smith & Nephew (NYSE: SNN). \"First, I would like to thank Chuck Sherwood for his close to two decades of commitment to Anika and for establishing Anika as a global innovator in joint health and tissue repair,\" chairman Joseph Bower said in prepared remarks. \"Chuck Sherwood built Anika as we know it. As CEO for 15 years, he has delivered outstanding product innovation and development and operational, commercial, and financial achievements .\" 9 wearable medtech companies at the Wearable Technology Show Digital health wearables are increasingly making medtech strides: They can measure heart vitals, temperature and even track when someone falls. The Wearable Technology Show 2018--March 13--14 in London--is highlighting some of the latest wearable devices in the digital health realm. Showcased technologies include sensors to help orthopedic surgery patients, a watch to [...] Drug delivering contact lenses win MIT's top healthcare innovation prize Contact lenses that deliver medications directly to the eye over a period of days or weeks was the recent grand prize winner of Massachusetts Institute of Technology's Sloan Healthcare Innovation Prize. The MIT Sloan Healthcare Innovation Prize competition had 8 finalists who pitched their healthcare innovations to judges from Optum and other local venture firms, [...] 5 trends that could affect medtech in 2018 Antoine Baschiera, Early Metrics The rapid advancement of innovation today is propelling fundamental changes in all industries. Among them, the health and medtech sectors are ones that will be transformed drastically in the coming years. The medical devices and technology market will reach $500 billion in sales by 2021, according to a new analysis from Evaluate. [...] This 3D-printed device analyzes tissue cells from rheumatoid arthritis Researchers in New York have created a 3D-printed, portable and low-cost microfluidic controller that analyzes tissue cells and can recognize fibroblast subtypes in rheumatoid arthritis patients. Single-cell analysis is a way for researchers to study how cells influence disease and their response to treatment, but there is a lack of cost-effective and user-friendly devices to [...] Designing wearables: How to make sense of your material options The medical device industry's knowledge base continually evolves regarding what works--and what doesn't--for wearable applications. Gain insight into some material selection considerations for skin-worn wearable design and development. Deepak Prakash, Vancive Medical Technologies In the dynamic wearables sector, medical device makers are searching for ways to translate their expertise into mobile, [...] Qosina touts ergonomic slide clamps Qosina is touting its slide clamps that have been an important part of the company since its founding in 1980. As one of the first products Qosina sold and one of its top-selling product lines, the company has evolved the original six slide clamps to add new innovative parts and remove old ones. Now, five [...] Raumedic showcasing polymer solutions at Medtec Europe 2018 Raumedic is showcasing some of its polymer solutions at Medtec Europe, set to take place in Stuttgart, Germany April 17-19. The company manufactures medical-grade components made from thermoplastics and silicone using its extrusion and injection-molding processes. All of the components are processed under clean-room conditions and are ISO Class 7 compliant. Raumedic has a variety [...] Covestro releases new polycarbonate with resistance to solvents, cleaning agents Covestro has released Makrolon Rx3440, a material designed to withstand solvents found in oncology treatments--as well as cleaning agents. The medical polycarbonate offers durability and chemical resistance to help prevent cracking so that healthcare professionals can more safely deliver oncology drugs to patients. Cancer treatments are hard on plastics, noted Lauren Zetts, North America [...] Former Starkey president found guilty in multimillion-dollar embezzlement case A federal court jury in Minnesota today found Jerry Ruzicka, former president of hearing aid company Starkey Laboratories, guilty of eight of 25 counts involving more than $15 million worth of embezzlement, according to media reports. W. <mark>Jeff Taylor</mark>, who previously president of Starkey parts supplier Sonion U.S., was also found guilty. The jury acquitted two [...] Rimsys launches software to help medtech companies manage regulatory changes Startup company Rimsys (Pittsburgh) has launched its its first software solution that helps medical device companies effectively manage regulations around the world. Delays or blocks to medical devices entering the market can be caused by things like mismanaged information. Rimsys is trying to alleviate that problem with its software by giving them a platform that [...]"}, {"articleID": "2011042914_00056111_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"]}, "date": "2011-04-29", "url": "http://westernfrontonline.net/sports/13415-taken-eighth-locker-locks-up-nfl-dream-former-ferndale-uw-star-selected-by-titans-in-thursdays-nfl-draft", "content": "the tennessee titans selected former university of washington quarterback and ferndale high school graduate jake locker with the no. 8 selection in the nfl draft on thursday, april 28. locker was the second quarterback taken in the draft after heisman trophy winner <mark>cam newton</mark> of auburn university, who went first overall to the carolina panthers. many draft analysts, such as espn's mel kiper had locker going lower. but patrick wakefield, locker's teammate at ferndale high school, wasn't surprised. locker was so much better than everyone else in high school that it was just embarrassing for the other players, he said. \"in high school jake was like a man among boys,\" wakefield said. \"you would see all these other guys standing around, some skinny and some fat, and then there was this greek statue that was locker .\" wakefield thinks locker will excel at the nfl level if he is put in the right position. the huskies just didn't have the wide receivers that would allow locker to reach his full potential, he said. \"jake has so much physical ability, i just hope he gets some receivers and an offensive line,\" wakefield said. \"if he gets those things, and builds confidence early, then i expect him to be an amazing professional player .\" locker's path from small town ferndale to nfl quarterback has brought him national fame and respect. but for longtime ferndale resident brenda bannerman, he's just the same good boy whose grandparents lived next door. when bannerman and her husband would need the hay crop brought in, they would call up jake and his cousins to do the hard labor, she said. \"jake is like a son to me,\" bannerman said. \"i have pictures of him as a boy watching my pigs. i would describe jake as just a really good christian boy. i highly recommend him .\" at washington, locker was forced into the position of being a great talent on a mediocre team. the huskies were 7-6 last year, as locker completed 184-of-332 passes for 2,265 yards with 17 touchdowns and nine interceptions. he also ran for six touchdowns and 385 yards, earning all pac-10 honorable mention. locker started 40 total games for the huskies and ranks second all-time in school history with 9,578 total yards, behind former quarterback cody pickett. locker's draft stock had fluctuated wildly after he decided to return to play his senior season for the huskies. scouts were especially concerned about his throwing accuracy, a statistic which dipped from 58 percent his junior year to 55 percent last year. locker defended his performance in college and said he was looking forward to challenging himself at the nfl level in an interview with nfl.com posted on the titan's website. \"i'm very proud of what i accomplished while i was at school,\" locker said. \"i don't believe the numbers were indicative of the success that we had and how far we came as a program, along with myself as an individual. i'm excited about the opportunity to play at the next level .\" "}, {"articleID": "2020021417_00238542_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Eugene Robinson": ["Q5407694", "Q5407695"]}, "date": "2020-02-14", "url": "https://www.truthdig.com/articles/panicked-over-sanders-elites-turn-to-bloomberg/", "content": "Feb 14, 2020 Print Bookmark Opinion | TD originals Panicked Over Sanders, Elites Turn to...Bloomberg? comments Share on Facebook Share on Twitter Share on Reddit Email this link Michael Bloomberg, the former mayor of New York and Democratic presidential candidate, is having a moment. After polling at only a few single digits last year, he is now emerging as a top-tier candidate, pushing past former Vice President Joe Biden to claim a spot far closer to the top of the polls. One could attribute this rise to the insane amount of cash he has spent on his campaign--more than $200 million so far--out of his own bottomless pockets to blast commercials on every platform as he sells himself to the public. Now, liberal pundits are contemplating things like, \"It is time to earnestly consider the possibility that Bloomberg will be the Democratic nominee for president .\" But are we honestly considering him a serious candidate? Bloomberg's main stint with politics was as mayor of New York City from 2002 to 2013, during which time he pushed aggressively to criminalize and racially profile people of color under the guise of the \"stop and frisk\" policing model. The idea was simple: Preemptively arrest poor Black and Latino men, and crime rates would magically drop. Thousands of men were ruined in Bloomberg's dragnet, and the policy persisted until legal challenges forced the city to end the program with a judge declaring it unconstitutional. In launching his bid for the White House last year, Bloomberg stood in front of black congregants at a church and said, \"I want you to know that I realize back then I was wrong .\" Perhaps the billionaire candidate simply expected that his money would wash the stench of racism away. But then, this week, the audio of a speech he gave just five years ago at the Aspen Institute defending \"stop-and-frisk\" became public. The recording, posted by independent journalist Benjamin Dixon, reveals Bloomberg saying: Ninety-five percent of your murders--murderers and murder victims--fit one M.O.. You can just take the description, Xerox it and pass it out to all the cops. They are male, minorities, 16 to 25. That's true in New York, that's true in virtually every city. And that's where the real crime is ....You want to spend the money, put a lot of cops in the streets. Put the cops where the crime is, which means minority neighborhoods. And the way you get the guns out of the kids' hands is to throw them up against the wall and frisk them. Bloomberg likely knew soon after he said this that his comments were unconscionable--he asked the Aspen Institute not to distribute the video footage of his speech. The words are on par with the type of racism President <mark>Donald Trump</mark> has spewed and shows a shocking disdain for the Constitution on par with that of a radical right-wing extremist (after all, Bloomberg won his self-funded race for mayor of New York City as a Republican). As part of the damage control over the devastating audio clip, Bloomberg said in a statement, \"I inherited the police practice of stop-and-frisk, and as part of our effort to stop gun violence it was overused. By the time I left office, I cut it back by 95%, but I should've done it faster and sooner .\" But Bloomberg left his mayoral office in 2013. Two years later, he was still defending his racist policy in public. The Intercept's Lee Fang delved into the actual numbers and found that, far from cutting back the program by 95%, Bloomberg actually increased arrests by seven times during his tenure. Bloomberg has been caught in a lie. Aren't we done electing liars? Perhaps Bloomberg hopes white liberals can set aside any misgivings about his racism simply because they are fantasizing about the unlimited access to his campaign cash to defeat <mark>Trump</mark>. Bloomberg is currently the ninth richest person on the entire planet. In a sincere sounding op-ed in the New York Times, he explained how \"the rewards of the economy are far too concentrated at the top,\" and that he is \"making the system fairer and more progressive, including by increasing taxes on wealthy people like me .\" But only three years ago, Bloomberg--in a conversation with the then-head of the International Monetary Fund, Christine La Garde--explained that he was in favor of regressive taxation because it helped socially engineer poor people's habits: Taxes are regressive, yes they are. That's the good thing about them because the problem is in people that don't have a lot of money and so higher taxes should have a bigger impact on their behavior and how they deal with themselves. So I listen to people saying, \"Oh we don't want to tax the poor .' Well, we want the poor to live longer so that they can get an education and enjoy life. And that's why you do want to do exactly what a lot of people say you don't want to do.... If you raise taxes on full sugary drinks, for example, they will drink less and there's no question that full sugared drinks are one of the major factors in obesity and obesity is one of the major factors to heart disease. While this clip has not received as much attention as Bloomberg's defense of\" stop-and-frisk, \"it is just as instructive about his attitude toward low-income people. A multibillionaire's opinion of those on the bottom rung of society is--unsurprisingly--utterly distorted by his obscene wealth. How exactly can a racist, classist billionaire be favored by Democrats? As Vermont Sen. Bernie Sanders continues to build momentum, the liberal establishment is in full panic mode. All of the superficial criticism they have cast at Sanders--that he's an old white man who has been a Democrat for barely a minute--apply just as equally to Bloomberg. But what is most critically important to Bloomberg's backers is that his politics are the polar opposite of Sanders. Just days after the disastrous Iowa caucuses, the Washington Post's <mark>Eugene Robinson</mark> bizarrely declared Bloomberg\" the biggest winner, \"even though he skipped the caucuses. <mark>Robinson</mark>'s reasoning was that\" the chaos in the Democratic Party and <mark>Trump</mark>'s White House are making Bloomberg's argument for him. \"The New York Times' Thomas Friedman this week opined that Bloomberg\" has the best chance to carry the day \"in a match-up against <mark>Trump</mark> and that he is\" a moderate progressive with a heart of gold but the toughness of a rattlesnake. \"The words\" moderate progressive \"are code for\" not a Democratic Socialist like Bernie Sanders. \"Defenders of the establishment are terrified that in a bid to sweep away <mark>Trump</mark> and his policies, too many Americans will want to strip wealthy liberals of their power and money as well. For all the fears that Democrats have about a Sanders' nomination, the worst that <mark>Trump</mark> could accuse Sanders of doing is sticking to a set of economic, racial and gender justice principles for 40 years. He could harp on Sanders' avowed socialism, but polls show Americans are actually quite receptive to socialism. He could lie and call Sanders a communist, but the Senator could retort, as he has already done,\" Obviously I am not a communist, \"even if <mark>Trump</mark>\" maybe doesn't know the difference. \"In demonizing Sanders and all he represents, <mark>Trump</mark> is siding with the likes of former Goldman Sachs CEO Lloyd Blankfein, who is so terrified of Sanders he worried the senator would\" ruin the economy \"as president. By that comment, Blankfein of course means that Sanders plans to upend an economy that is working very well for him and terribly for the rest of us. <mark>Trump</mark>, Wall Street executives and wealthy elites like Blankfein and Bloomberg are all arrayed against threats to the corporate stranglehold on America. They are all part of the same team, and yet establishment Democrats claim there is a difference between <mark>Trump</mark> and Bloomberg. As Biden and Sen. Elizabeth Warren dip in the polls, Bloomberg's numbers are rising. In a head-to-head matchup with <mark>Trump</mark>, one poll showed him beating the president by the widest margin of all Democratic candidates. But Bloomberg has so far benefitted from scant media coverage and as journalists dig deeper, his many skeletons are tumbling out of the closet. He has also not yet faced his challengers on a debate stage. If he does cinch the nomination, picture <mark>Trump</mark> ripping him apart over his comments about crime in minority neighborhoods and his patronizing attitudes toward poor people. Sanders surrogate Nina Turner, in a recent interview on MSNBC, dared to call Bloomberg an\" oligarch \"and raised the ire of liberal pundits. But the word\" oligarch \"is defined as a member of a nation's economic elite unfairly using their status and money to wield power. Former Labor secretary and popular progressive author Robert Reich explained that, yes, at this stage, anyone is better than <mark>Trump</mark> and that\" [o] ligarchy is better than tyranny. \"But, he added,\" neither is as good as democracy. \"Bloomberg's immense wealth allows him to bypass the traditional reins of accountability that the public has over a candidate running for election. Bloomberg doesn't need the public to donate to his campaign, and therefore there is no guarantee that as president he would care about serving the public. Already with <mark>Trump</mark> in the White House, we are suffering the ill effects of an unaccountable wealthy person who cares more about his money than his country. How can anyone who wants to defeat <mark>Trump</mark> want to replace him with someone not unlike him? Sonali Kolhatkar Columnist Sonali Kolhatkar is a columnist for Truthdig. She also is the founder, host and executive producer of\" Rising Up With Sonali, \"a television and radio show that airs on Free Speech TV (Dish Network, DirecTV,...In this article: 2020 aspen institute bernie sanders bloomberg democrat <mark>donald trump</mark> election gop michael bloomberg racism republican stop and frisk taxes thomas friedman comments Share on Facebook Share on Twitter Share on Reddit Email this link"}, {"articleID": "2009122011_00018818_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Mohammad Ali": ["Q17107656", "Q21459588", "Q21471133", "Q25471258", "Q48732199", "Q54268652", "Q56487592", "Q57945156", "Q5990591", "Q9322458"], "Michael Mann": ["Q1425193", "Q1827335", "Q1928511", "Q270097", "Q30276452", "Q633081", "Q6832490"]}, "date": "2009-12-20", "url": "http://uncyclopedia.wikia.com/index.php?title=Will_Smith&diff=4287428&oldid=prev", "content": "from uncyclopedia, the content-free encyclopedia. (difference between revisions) jump to: navigation, search revision as of 17:00, december 14, 2009 (edit) matfen815 (talk | contribs) (â \u0086 \u0090 undid revision 4275448 by 72.237.88.0 (talk)) â \u0086 \u0090 older edit revision as of 11:04, december 20, 2009 (edit) (undo) 84.203.74.27 (talk) newer edit â \u0086' line 1: line 1: __ noeditsection __ __ noeditsection __ [[image: smith4.jpg | thumb | right | 200px | actor <mark>will smith</mark>.]] [[image: smith4.jpg | thumb | right | 200px | actor <mark>will smith</mark>.]] - \"\"<mark>will smith</mark>\" ' - also known by the typecast \"\"disgruntled low-level authority figure with a gun\" ' - is an [[american]] film actor, former television actor, [[hip-hop]] artist, and black man. though his career began rather inauspiciously, <mark>smith</mark>'s titular role in \"the fresh prince of bel-air\" catapulted him into the film industry, of which <mark>smith</mark> is now the metaphorical king. every year, smith-along with other supposedly talented actors like [[tom cruise]], [[keanu reeves]], [[angelina jolie]] and [[shit | shia labeouf]] - makes more money than any three pacific island nations combined, though whether or not he deserves said money is another matter entirely. + \"\"<mark>will smith</mark>\" ' - also known by the typecast \"\"disgruntled low-level authority figure with a gun\" ' - is an [[american]] film actor, former television actor, [[hip-hop]] artist, member of the bel-air royal family, and black man. though his career began rather inauspiciously, <mark>smith</mark>'s titular role in \"the fresh prince of bel-air\" catapulted him into the film industry, of which <mark>smith</mark> is now the metaphorical king. every year, smith-along with other supposedly talented actors like [[tom cruise]], [[keanu reeves]], [[angelina jolie]] and [[shit | shia labeouf]] - makes more money than any three pacific island nations combined, though whether or not he deserves said money is another matter entirely. + + + = = personal life = = + it was in west philadelphia he was born and raised. reports suggest that on the playground was where he spent most of his days. however, one day when <mark>smith</mark> was chillin' out maxin' relaxin' all cool and all shootin' some b-ball outside of the school, a couple of guys - who were up to no good, tried to make trouble in his neighborhood. after one little fight his mom got scared and informed him that he was \"movin' with your auntie and uncle in bel-air!\" + <mark>smith</mark> begged and pleaded with her day after day, but she packed his suit case and sent him on his way. she gave him a kiss and then she gave him his ticket, he then put his walkman on and decided that he \"might as well kick it\". after deciding that first class was \"bad', and drinking some orange juice out of a champagne glass. this left <mark>smith</mark> wondering if this is what the people of bel-air live like, proceeding to ponder that it might be\" aiiight'. + however, <mark>smith</mark> had heard they're prissy, with wine and all that, and wondered if bel-air is the type of place to send a cool cat. he didn't think so, but decided to see when he got there and hoped they were prepared for the prince of bel-air. + <mark>smith</mark> has stated that the plane landed and when he came out, there was a dude who looked like a cop standing there with his name out. he wasn't tryin' to get arrested as he had just got there, so he sprang with the quickness of lightning and disappeared. + he whistled for a cab and when it came near, the license plate said fresh and it had dice in the mirror. although <mark>smith</mark> thought this cab was rare, he forgot and directed the \"homes' to bel-air. + he arrived at the house about 7 or 8 and hollered at the cabbie that he would\" smell him later \". he then looked at his kindom, as he was finally there, to sit on his throne as the prince of bel air. = = early career = = = = early career = = revision as of 11:04, december 20, 2009 actor <mark>will smith</mark>. <mark>will smith</mark> - also known by the typecast disgruntled low-level authority figure with a gun - is an american film actor, former television actor, hip-hop artist, member of the bel-air royal family, and black man. though his career began rather inauspiciously, <mark>smith</mark>'s titular role in the fresh prince of bel-air catapulted him into the film industry, of which <mark>smith</mark> is now the metaphorical king. every year, smith-along with other supposedly talented actors like tom cruise, keanu reeves, angelina jolie and shia labeouf - makes more money than any three pacific island nations combined, though whether or not he deserves said money is another matter entirely. contents 1 personal life 2 early career 2.1 hip-hop 2.2 the fresh prince of bel-air 3 film career 3.1 1995-1997: early years 3.2 1998-2001: the slump 3.3 2002-present: back in form 4 future plans 5 see also personal life it was in west philadelphia he was born and raised. reports suggest that on the playground was where he spent most of his days. however, one day when <mark>smith</mark> was chillin' out maxin' relaxin' all cool and all shootin' some b-ball outside of the school, a couple of guys - who were up to no good, tried to make trouble in his neighborhood. after one little fight his mom got scared and informed him that he was\" movin' with your auntie and uncle in bel-air! \"<mark>smith</mark> begged and pleaded with her day after day, but she packed his suit case and sent him on his way. she gave him a kiss and then she gave him his ticket, he then put his walkman on and decided that he\" might as well kick it \". after deciding that first class was\" bad', and drinking some orange juice out of a champagne glass. this left <mark>smith</mark> wondering if this is what the people of bel-air live like, proceeding to ponder that it might be \"aiiight'. however, <mark>smith</mark> had heard they're prissy, with wine and all that, and wondered if bel-air is the type of place to send a cool cat. he didn't think so, but decided to see when he got there and hoped they were prepared for the prince of bel-air. <mark>smith</mark> has stated that the plane landed and when he came out, there was a dude who looked like a cop standing there with his name out. he wasn't tryin' to get arrested as he had just got there, so he sprang with the quickness of lightning and disappeared. he whistled for a cab and when it came near, the license plate said fresh and it had dice in the mirror. although <mark>smith</mark> thought this cab was rare, he forgot and directed the\" homes' to bel-air. he arrived at the house about 7 or 8 and hollered at the cabbie that he would \"smell him later\". he then looked at his kindom, as he was finally there, to sit on his throne as the prince of bel air. early career yes...he is a legend. hip-hop <mark>smith</mark> began his media career as one third of the hip-hop trio dj jazzy jeff & the fresh prince, along with fellow artists and black men jeffery townes and clarence holmes. the group was fairly successful, and won the first ever grammy by a rap act. <mark>smith</mark>, however, decided to leave the group in the late 1980s in order to move onto bigger and better things. the fresh prince of bel-air after moderate success in music, <mark>smith</mark> moved on to the next logical stage of his career: comedy sitcoms on network television. fortunately for <mark>smith</mark>, nbc was looking for exactly what <mark>smith</mark> offered-a black man with little-to-no acting or comedic experience. history was made. what resulted was the fresh prince of bel-air, arguably the sixth-greatest african-american sitcom of all time. the program aired from 1990 until 1996, and though it is now largely forgotten aside from its theme song, the real importance of fresh prince was its introduction of <mark>will smith</mark> and his acting greatness to the rest of the world. film career 1995-1997: early years <mark>will smith</mark>, seen here in box office hit men in black, with gun. after moderate success in television, <mark>will smith</mark> moved on to the next logical step in his career: playing the lead in hollywood blockbuster action movies. <mark>smith</mark>'s hollywood career began in 1995 when he was approached by sub-par director, cliché enthusiast and noted add sufferer michael bay to play the lead in director's [sic] new film [sic], bad boys. though the movie's gross was only in the low hundreds of millions of dollars, <mark>smith</mark>'s riveting portrayal of disgruntled low-level authority figure with a gun made waves around hollywood: it wouldn't be long before other shitty directors took notice. the following year, <mark>smith</mark> was approached by another industry giant with an affinity for explosions: roland emmerich. emmerich was incredibly impressed with <mark>smith</mark>'s performance in bad boys, and promptly cast the actor in the role of disgruntled low-level authority figure with a fighter jet alongside jeff goldblum and the dad from casper in his own retarded blockbuster: independence day. independence day would prove to be a mega-hit, breaking several box office records, as well as earning the distinction of being the third most-played movie on basic cable, behind only top gun and rocky ii. <mark>smith</mark>'s acting earned similar distinction, being praised as being \"totally derived from earlier works\" by many critics. in 1997, <mark>smith</mark> was cast as disgruntled low-level authority figure with a laser gun (shortened to \"agent j\" during shooting) in men in black. with yet another success under his belt, men in black would prove to be the first high water mark in <mark>smith</mark>'s film career. 1998-2001: the slump <mark>will smith</mark>, seen here in box office flop <mark>ali</mark>, without gun. <mark>will smith</mark> had quickly become one of hollywood's most successful-and most bankable - actors. in 1998, he accepted the role of disgruntled conspiracy theorist with a gun in enemy of the state. the film proved to be a radical departure from <mark>smith</mark>'s prior work, and box office revenues reflected it. <mark>smith</mark> followed this disappointment with arguably his worst career move: the actor opted out of the role of neo in the matrix in favor of doing wild wild west. when later asked about this utterly terrible decision, <mark>will smith</mark> simply replied that the part of neo \"wasn't disgruntled enough .\" after the utter failure of west, <mark>smith</mark> would have a quiet 2000, before almost killing his career for good the following year. in 2001, film auteur <mark>michael mann</mark> approached <mark>smith</mark> with his project <mark>ali</mark>, an ambitious bio-epic about legendary boxer <mark>mohammad ali</mark>. at first, <mark>smith</mark> was reticent about accepting the role, as <mark>ali</mark> was not comically but dramatically disgruntled, and lacked a firearm. however, the actor finally accepted. though the film earned him a surprise oscar nomination for best actor, the film - like almost all good movies - achieved merely an adequate box office performance. <mark>smith</mark>'s agent quickly dropped him, and the actor's career looked like it was finished. <mark>smith</mark> would have to go back to his roots to find success, which, in the realm of hollywood blockbusters, meant doing a sequel. 2002-present: back in form <mark>will smith</mark>, seen here in box office hit i am legend, with gun. following the <mark>ali</mark> debacle, <mark>will smith</mark> did back-to-back sequels to revive his slumping career. in 2002, he reprised his role of disgruntled low-level authority figure with a laser gun in men in black ii, and the following year went back to where it all began with bad boys 2 and another classic portrayal of disgruntled low-level authority figure with a gun. now with two back-to-back hits and $35 million from said hits under his belt, <mark>smith</mark> was free to explore the limits his typecast would allow him to go. in 2004, <mark>smith</mark> played disgruntled low-level authority figure with a gun and a prejudice against robots in i, robot, which proved to be yet another success. <mark>smith</mark> followed up the success of i, robot with his acclaimed portrayal of disgruntled scientist with a gun in i am legend and disgruntled homeless man with super powers in hancock, both being sizeable financial successes. future plans much speculation exists as to what new career <mark>will smith</mark> <mark>will</mark> use his hollywood success to parlay himself into. some believe that <mark>smith</mark> <mark>will</mark> use his notable-though-moderate acting success to inexplicably parlay himself into politics, a la ronald reagan. most hollywood demographers, however, are of the opinion that <mark>will smith</mark>'s charisma and appeal to men and women between the ages of 18 and 40 <mark>will</mark> eventually lead him into running a religious cult. in any event, one thing is certain: <mark>will smith</mark> <mark>will</mark> achieve levels of success and recognition far higher than what his actual level of talent would preclude. see also hollywood angelina jolie keanu reeves michael bay money retrieved from \"\"category: actors"}, {"articleID": "2019032516_00456918_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2019-03-25", "url": "https://ktvq.com/cnn-asia-pacific/2019/03/25/kashmir-fast-facts/", "content": "Kashmir Fast Facts Here's a look at Kashmir, a region in the Himalayan and Karakoram mountain ranges. India, Pakistan and China all claim partial or complete ownership of Kashmir. Facts: Kashmir is an 86,000-square mile region in the northern part of the Indian subcontinent. The separatist violence has killed more than 47,000 people, which does not include people who have disappeared due to the conflict. Some human rights groups and nongovernmental organizations put the death toll at twice that amount. India and Pakistan have been fighting over Kashmir since both countries gained their independence in 1947. The Line of Control separating Indian - and Pakistani-controlled parts of Kashmir is 435 miles (700 km) long. India-controlled: One state, called Jammu and Kashmir, makes up the southern and eastern portions of the region, totaling about 45% of Kashmir. Pakistan-controlled: Three areas called Azad Kashmir, Gilgit and Baltistan make up the northern and western portions of the region, totaling about 35% of Kashmir. China-controlled: One area called Aksai Chin in the northeastern part of the region, equaling 20% of Kashmir. India also alleges Pakistan has ceded 3,220 square miles in Kashmir to China. Srinagar is the summer capital city in Jammu and Kashmir state. Jammu is the winter capital. The capital of Azad Kashmir is Muzaffarabad. Kashmir: India and Pakistan's bitter dispute Timeline: August 15, 1947--India and Pakistan gain independence from Great Britain. Kashmir initially decides to remain independent, choosing not to become a part of either Pakistan or India. October 1947--After armed tribesmen from Pakistan's North-West Frontier Province invade Kashmir, Maharaja Hari Singh, the ruler of Kashmir, signs a letter acceding to India. In exchange for handing key powers to the central government in New Delhi, Kashmir gains India's military protection. Pakistan does not recognize this letter as a legal document. This begins India and Pakistan's first war over Kashmir. January 1, 1949--India and Pakistan agree to withdraw all troops behind a mutually agreed ceasefire line, later known as the Line of Control. August 5, 1965--India and Pakistan go to war again over Kashmir. Pakistan invades Indian-held Kashmir, but the fighting produces little territorial gain for Pakistan. 1971--Fighting erupts again as part of the Indo-Pak war. July 1972--The Simla Agreement ends the fighting and establishes the Line of Control between Indian-controlled Kashmir and Pakistan-controlled Kashmir. The two sides continue to argue over the border. 1989--Islamic militants begin an uprising in Indian-controlled Kashmir. Tens of thousands of people have been killed. 1999--India and Pakistan fight a limited border conflict in Kashmir, after armed invaders cross the Line of Control in the town of Kargil. July 25, 2000--Hizbul Mujahedeen, a pro-Pakistan Kashmiri militant group, declares a unilateral cease fire for three months in Jammu and Kashmir. August 3, 2000--India begins peace talks with Hizbul Mujahedeen, in Srinagar. August 8, 2000--Hizbul Mujahedeen calls off its two-week-old ceasefire and orders its forces to resume fighting against Indian troops. May 23, 2001--India ends a six-month military ceasefire against Islamic guerillas in Kashmir while also inviting Pakistani military ruler, General Pervez Musharraf, to peace talks aimed at ending five decades of hostilities between the two countries. July 14-16, 2001--Pakistani President Pervez Musharraf and Prime Minister Atal Behari Vajpayee meet in Agra, India, for a three-day summit. The talks fail to produce a joint statement on Kashmir. December 20, 2001--The Indian army deploys troops on its border with Pakistan in the northern states of Kashmir and Punjab after an attack by militants (India says they were from across the border) on the Indian Parliament building. Pakistani troops also buildup across the frontier. January 2002--General Musharraf of Pakistan outlaws the three main Pakistani-based Islamic militant groups. October 2002--Four rounds of polls to choose a new state administration conclude in Indian-controlled Kashmir. About 300-500 people are killed during the election campaign. November 2003--India agrees to a Pakistani offer of a ceasefire along their borders in the disputed region of Kashmir. The ceasefire goes into effect November 26 and is the first ceasefire in 14 years. January 4, 2004--India's Prime Minister Atal Bihari Vajpayee meets with Pakistan's President Musharraf in Islamabad for a one-hour meeting. It is their first direct contact in two years. June 2004--India and Pakistan's foreign secretaries meet for talks, the first detailed discussions between the two countries in six years. November 14, 2006--Indian Foreign Secretary Shiv Shanker Menon and his Pakistani counterpart, Riaz Mohammed Khan meet in New Delhi, India for peace talks. The main topic of discussion is finding ways to implement a proposed anti-terror mechanism that both countries have agreed to set up. March 13, 2007--Top Pakistani and Indian diplomats meet in Islamabad. Topics include improving conditions for hundreds of prisoners in each others' jails and relaxing visa restrictions. March 28, 2008--Human rights workers find nearly 1,000 unmarked graves near the Line of Control, the border that divides Pakistani - and Indian-controlled portions of Kashmir. Hundreds of protestors in Indian Kashmir clash with police on April 25, demanding an investigation into the graves. October 21, 2008--India and Pakistan open a trade route for the first time in six decades on the Line of Control in Kashmir. Fruit, clothing and spices are among the items being transported. Summer 2010--Violence erupts in Kashmir and kills more than 100 people, the worst bloodshed in a decade. January 14, 2011--India's home secretary announces that India will cut a fourth of its security forces in Kashmir over the next 12 months. February 10, 2011--Pakistan and India agree to resume peace talks that halted after the Mumbai terror attacks of 2008. July 27, 2011--Pakistani Foreign Minister Hina Rabbani Khar meets with Indian Foreign Minister S.M. Krishna in New Delhi to discuss ways to improve travel and trade across Kashmir. April 8, 2012--Pakistani President Asif Ali Zardari meets with Indian Prime Minister <mark>Manmohan Singh</mark> during a private trip. It is the first trip to India by a Pakistani leader in seven years. November-December 2014--After five rounds of elections, though the regional People's Democratic Party (PDP) wins the most seats, it does not pick up the 44 seats necessary to form a government in Indian-controlled Kashmir. February 2015--The Hindu nationalist Bharatiya Janata Party (BJP) and the People's Democratic Party (PDP), a regional party backed by the Muslim majority, announce the formation of a coalition government in Indian-controlled Kashmir. This follows five rounds of elections in 2014 without a clear winner and is the first time that the Hindu nationalist BJP will be part of the governing coalition in the state assembly. The coalition government is sworn in on March 1, 2015. January 2016--The death of the chief minister of the Indian state of Jammu and Kashmir, Mufti Mohammad Sayeed, creates tumult within the coalition government. The presumptive successor is Mehbooba Mufti, Sayeed's daughter. She declines to take the oath of office, however, as relations fray between the PDP and the BJP. With the power-sharing alliance in crisis, Governor's rule is imposed in accordance with the Constitution of Jammu and Kashmir. April 4, 2016--Mehbooba Mufti is sworn in as the first female chief minister of Indian-administered Jammu and Kashmir. September 18, 2016--In the early morning hours, armed militants enter an Indian army base in the garrison town of Uri--about 63 miles (102 kilometers) from Srinagar, the capital of Indian-administered Jammu and Kashmir--and kill 19 soldiers. Several hours later, four militants are killed in a shootout with the Indian army. It's unclear which militant group is responsible. The attack, which takes place near the de facto border between India and Pakistan in Kashmir, is one of the deadliest on an army base in Kashmir since militant attacks began in 1989. September 29, 2016--Two Pakistani soldiers are killed after clashes with Indian troops on the de facto border in Kashmir. October 2016--India relocates more than 10,000 people from around the disputed border area of Kashmir as tensions continue to escalate with Pakistan. November 14, 2016--Seven Pakistani soldiers are killed in an exchange of fire between Pakistani and Indian forces at the Line of Control. November 15, 2016--Raja Farooq Haider, the prime minister of Azad Jammu and Kashmir, the Pakistani-controlled part of the disputed region, says the government has so far moved 8,000 people to \"safer places\" in the wake of ongoing \"Indian shelling,\" and plans are being made to move even more people. In response, Indian defense spokesman Lt. Col. Manish Mehta tells CNN from the Indian city of Jammu, \"We always respond appropriately and effectively whenever there is a ceasefire violation from the Pakistan side .\" August 1, 2017--Violent protests erupt over the killing of a militant leader. According to Indian officials, Pakistani commander of banned terror group Lashkar-e-Taiba (LeT) Abu Dujana, along with his aide Arif Nabi Dar, were killed after engaging in a lengthy gun battle with government troops in Kashmir's Pulwama district, 35 kilometers south of the capital Srinagar. February 14, 2019--At least 40 are killed when a bomb explodes near a convoy of Indian paramilitary personnel in Indian-administered Kashmir, one of the deadliest attacks in the disputed region in recent years. February 26, 2019--Pakistan has promised retaliation \"at the time and place of its choosing\" after India conducts airstrikes on an alleged terrorist training camp inside Pakistan territory, in a significant escalation of hostilities between the nuclear armed powers, in the first such incursion by Indian air force planes since the India-Pakistan war of 1971."}, {"articleID": "2008110907_00009835_W", "names": {"William Gibson": ["Q14945714", "Q18821929", "Q188987", "Q20807634", "Q980844"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2008-11-09", "url": "http://thenodalpoint.wordpress.com/2007/07/24/hello-world/", "content": "that spooky post-geographic feeling. my two favorite sci fi writers have quit writing about the future. my second favorite's magnum opus is set 300 years ago. spook country, by <mark>william gibson</mark>, is set in the present. or last year, anyway. neal stephenson hasn't published a book set in the future since 1995. it's been since 1999 for <mark>gibson</mark>. the new one, spook country, is one of the most enjoyable new reads i've had in a couple of years. <mark>gibson</mark> only puts out a book once every three or four years, so i've learned to take my time with his stuff. i spent about a week reading it, then immediately listened to the audio book, read by this guy robertson dean, who seems to be the pinnacle of evolution of a breed of human born specifically to read spook country out loud. there's a guy named milgrim who's hooked on prescription tranquilizers and must translate text messages in faux cyrillic for his captor, who may or may not be a federal agent. there's a cuban-chinese keyboard player kid who's been trained in the soviet martial art of systema. there's an ex rock star turned journalist working for a magazine that doesn't exist yet. none of that matters, because it's not the point. it's the world <mark>gibson</mark>'s describing that matters, the world of google and of wikipedia and 9-11 and pop culture, and the way he presents it, in these thoughtful and evocative two or three page chapters that mates art with gps, marketing and electronic espionage, slow motion and the cliffhanger. what does it mean, though? sci fi writers writing about the present and past. does it signify anything to you? to me, it speaks of a certain vision of the future arriving and while being familiar, doesn't resemble the predictions you've been expecting. <mark>gibson</mark>, in the documentary no maps for these territories, talks about those futures that didn't come to be, the \"future with a capital f, that was being planned, that the future was gonna happen because grownups were making decisions .\" that's paraphrased, but you get the point. the other future, is the future of pat frank's alas babylon that of the atomic apocalypse, where the world has come to an end. it seems that the future has arrived and the grown ups in charge aren't making great decisions, and the world hasn't ended in a firestorm yet. indeed, <mark>gibson</mark> says that the future may be unknowable, and perhaps that is the reason he examines our present so well. spook country is about family, outsourced spies, life after fame, and the sprint of technology into niche after niche, and it is fucking masterful. the present has never looked quite so shiny, gritty and cool. so the apocalypse didn't happen and we ain't getting jetpacks or teleporters. the next revolutions are happening so fast it's only barely possible to keep up with them in fiction, much less start making predictions, is that what's going on? <mark>gibson</mark> talks about things that \"up the ante\" for a sci fi writer, like, a \"when it was confirmed that <mark>michael jackson</mark> was gonna marry elvis presley's daughter, that\" truth is stranger than fiction' factor keeps getting jacked up on us on a fairly regular, maybe even exponential basis. and that's something that's peculiar to our time, i don't think our parents had to deal with that. \"it's funny,\" the present \"of <mark>gibson</mark>'s virtual light was almost three years ago and remains relevant, stephenson's cryptonomicon is set in 1999, and still has much to teach us about the need for data havens (can anyone say\" the pirate bay \"?) and crytopgraphy (which you had to use just to read this .). that future and that present are now past, and it seems our present will outpace us and may outpace our children. how you deal with it and your awareness of whatever portion of modernity you're feel like grasping seems to be what matters. we're not going to get to the shiny, polished future we imagined, and i think we all pretty much agreed on that when our petroleum wars began. it'll come at us from the past, which is stephenson's point in much of his latest work, and it'll come at us from like three days ago with some short article or a five second clip they didn't have enough time for on the news because they're busy revising the official story of our recent past."}]