[{"articleID": "2018122604_00687844_W", "names": {"Wu Gan": ["Q24837835", "Q45402317", "Q45402427", "Q45410110", "Q45433905", "Q45678102"], "Liu Xiaobo": ["Q41617", "Q704986"]}, "date": "2018-12-26", "url": "http://kvia.com/news/us-world/beijing-puts-human-rights-lawyer-on-trial-day-after-christmas/951152089", "content": "KVIA Beijing puts human rights lawyer on trial day after Christmas Wang Quanzhang prominent defender of religion By: LILY LEE AND BEN WESTCOTT, CNN Posted: Dec 25, 2018 08:24 PM MST Updated: Dec 25, 2018 09:09 PM MST Hong Kong former lawmaker Emily Lau holds a sign of detained Chinese human rights lawyer Wang Quanzhang in Hong Kong in April 2018. Isaac Lawrence/AFP/Getty Images via CNN Hong Kong former lawmaker Emily Lau holds a sign of detained Chinese human rights lawyer Wang Quanzhang in Hong Kong in April 2018. Related Content Prosecutors weigh sex assault charges against Chinese billionaire (CNN) - A high-profile Chinese human rights lawyer detained more than three years ago is facing trial Wednesday, the latest prominent detainee sent to court by the ruling Communist Party over the Christmas period. Wang Quanzhang was taken into custody in July 2015, one of more than 200 lawyers and activists detained as part of a mass crackdown on human rights defenders across China. Wang, known for his advocacy of practitioners of the banned Falun Gong spiritual movement and Christians, is the last lawyer still behind bars as part of the sweep. China regularly sends high-profile detainees and dissidents to court around the Christmas period, taking advantage of the large absence of the international media and diplomatic community. Human rights activist <mark>Wu Gan</mark> was sentenced to eight years in prison on Christmas Day in 2017, while Nobel Laureate <mark>Liu Xiaobo</mark> was imprisoned on the same day in 2009. Wang's trial began on Wednesday morning local time, and is being held behind closed doors due to the nature of the charges. It isn't clear how long the trial will last or when the final sentence will be handed down. Wang's wife, Li Wenzu, has been campaigning relentlessly for his release ever since her husband's detention. In April she marched from Beijing to Tianjin on foot to \"find her husband.\" She was one of four spouses of high-profile human rights lawyers who protested against their detention in front of the Supreme People's Court on December 17, publicly shaving their heads in protest as the word \"hairlessness\" sounds similar to \"lawlessness\" in Chinese. Due to the tight control of China's authoritarian government and harsh penalties for protesting, public demonstrations in China over politically sensitive topics are rare. After security guards stopped her from presenting a letter petitioning for her husband, Li said judges had behaved in a \"lawless\" manner around Wang's trial. \"It has been almost two years since the case of Wang Quanzhang was filed to the court, but the judges in charge of this case have been avoiding meeting us, and our lawyer is not allowed to see the court paper,\" she said at the protest. \"This case has been endlessly delayed...so I came here today to ask the Supreme Court to fulfill its responsibility of supervising and to correct the subordinate court's unlawful behaviors.\" Li was also visited by German Chancellor Angela Merkel during her last visit to China in May. Copyright 2018 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. no iframe support!"}, {"articleID": "2012102419_00093328_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2012-10-24", "url": "http://essence.com/2012/10/24/stacey-dash-casts-early-vote-mitt-romney", "content": "exclusive: pat houston talks \"houstons' reality show, says bobbi kristina's engagement is off? stacey dash despite going through twitter hell weeks ago for voicing her support for presidential candidate mitt romney, stacey dash pressed forward with voting this week. tweeted photos of herself voting early in california.\" today's the last day to register to vote in ca - go to lavote.net or the registrars recorder office to vote, \"the tweet read. after announcing her support for romney, many of dash's twitter followers exploded in anger. one follower even suggested she kill herself. another tweeted,\" you're an unemployed black woman endorsing mitt romney. you're voting against yourself thrice. you poor beautiful idiot. \"dash has showed no signs of retracting her romney support, despite the hatred.\" i believe him. i watched him, the governor and his wife, on cnn's piers morgan tonight. \"they spoke to me, they seemed authentic and genuine? i chose him not by the color of his skin but the content of his character.\" her hollywood peers aren't taking her romney support so well. vivica a. fox has been the most outspoken one yet, telling the grio, \"she's entitled to her own opinion but it was just surprising that first of all she was a republican, and that she did it the way that she did. most politicians when you support them, you try to support them with class, you don't need to do a swimsuit shoot.\" @ chicagoideas in front of 900 ppl! anyone got a question they want me to ask him? the big announcement! <mark>donald trump</mark> will give chicago charity $5 million if obama releases school records (video) hmmm...<mark>trump</mark>'s big announcement: michelle & barack obama's divorce papers? (details) trump? s $5 million challenge to obama: release college, passport records (video)"}, {"articleID": "2019053020_00383518_W", "names": {"Brian Roberts": ["Q1057730", "Q27978787", "Q4964404", "Q4965138", "Q4965139", "Q4965141", "Q4965143", "Q4965145", "Q913008"]}, "date": "2019-05-30", "url": "http://feeds.marketwatch.com/~r/marketwatch/software/~3/wJTeg3koqSg/story.asp", "content": "Uber Technologies Inc. shares bounced in late trading Thursday, after the ride-hailing company lived up to its expectations in the first earnings report since a gargantuan initial public offering. Uber UBER, -0.35% reported first-quarter losses of $1.01 billion, or $2.26 a share, on revenue of $3.1 billion. Shares gained about 1% in after-hours trading immediately following the report, then fell to a loss of about 1%, then continued to bounce around between slight gains and losses. The stock has yet to touch its IPO price of $45 a share in regular trading since the first trading day on May 10. Uber disclosed ahead of the IPO that it expected to lose at least $1 billion and up to $1.11 billion in the first quarter, on net revenue of $3.04 billion to $3.1 billion. In the year-ago quarter, Uber reported massive earnings of $3.75 billion on revenue of $2.58 billion, though that outsize profit was linked to the sale of some of its international operations, with a stated operational loss of about half a billion dollars in the year-ago quarter. \"Our Q1 2019 results were at or near the high end of the ranges we shared last month in our IPO prospectus,\" Chief Financial Officer Nelson Chai said in a statement. \"Our investments remain focused on global platform expansion and long-term product and technology differentiation, but we will not hesitate to invest to defend our market position globally.\" Not enough analysts projected Uber's first-quarter earnings to form a solid consensus for this report. Analysts for banks that underwrite an initial public offering tend to wait 25 days from the offering before initiating coverage of a stock, and most of Wall Street helped out on Uber's IPO, which listed an astounding 29 banks as underwriters. Expect a wave of Uber initiations next week with analysts' thoughts on this earnings report. Uber reported bookings--which represents the total amount of money spent on the Uber platform, instead of just the part that Uber takes and is counted as revenue--of $14.65 billion, up from $10.9 billion a year ago. Uber said in its pre-IPO disclosure that it expected gross bookings of $14.44 billion to $14.66 billion, with about 78% of that total attributed to its ride-sharing platform and most of the rest coming from the Uber Eats food-delivery business. Uber lived up to its forecast with ride-hailing bookings of $11.45 billion and Uber Eats bookings of $3.07 billion in the first quarter, with the rest credited to the company's \"Other Bets\" ventures. Uber Eats bookings more than doubled from a year ago, increasing 108%, while ride-hailing increased about 22%. Rival Lyft Inc.. LYFT, -2.54% stopped disclosing bookings information in its first earnings report after its earlier IPO, despite providing the information in pre-IPO filings. Chief Financial Officer <mark>Brian Roberts</mark> said at the time that Lyft \"really wanted to try to avoid investor confusion\" in not providing the information. More: Lyft stops providing key data after IPO, then insults investors' intelligence The revenue breakdown was roughly similar to bookings. Uber said that about 76.7% of revenue came from ride-hailing, and 17.3% from Uber Eats, with the rest credited to Other Bets and \"Vehicle Solutions.\" Uber did not provide a forecast for the second quarter in its announcement. A conference call with executives was scheduled for 4:30 p.m. Eastern time. Uber stock closed Thursday with a 0.4% loss at $39.76. Jeremy C. Owens Jeremy Owens is MarketWatch's technology editor and San Francisco bureau chief. You can follow him on Twitter @ jowens510. We Want to Hear from You Join the conversation Comment"}, {"articleID": "2014110204_00005288_W", "names": {"John Young": ["Q107667", "Q11866773", "Q1452172", "Q16187378", "Q16723279", "Q16860770", "Q19325843", "Q21068890", "Q22336939", "Q24207181", "Q28611549", "Q3182207", "Q3182798", "Q37839006", "Q43395334", "Q43396131", "Q46733032", "Q6245076", "Q6265191", "Q6265194", "Q6265198", "Q6265201", "Q6265212", "Q6265220", "Q6265226", "Q937340"]}, "date": "2014-11-02", "url": "http://www.aikenstandard.com/article/20141101/AIK0106/141109937/-1/feed&source=RSS", "content": "Aiken, Midland Valley bands combine on patriotic songs Residents fight flurries for Apple Fest ACC ROUNDUP: Thomas, Days lift Georgia Tech past Virginia Five area teams learn playoff path MYSTERY PLANT: Look of flower is definitive ON THE MONEY: Gifts of appreciated property can save taxes Local man cares for family's truck Author translates Italian diaries in new WWII book Can space industry survive two explosions in four days? AP Photo/Ringo H.W. Chiu National Transportation Safety Board Acting Chairman Christopher A. Hart speaks in a press conference on the crash of SpaceShipTwo on Saturday, Mojave, California. The explosion killed a pilot aboard and seriously injured another while scattering wreckage in Southern California's Mojave Desert, witnesses and officials said. WASHINGTON, D.C. - Fiery failures are no stranger to the space game. It's what happens when you push the boundaries of what technology can do, where people can go. And it happened again to Virgin Galactic's SpaceShipTwo. In the past decade, the space industry has tried to go from risky and government-run to routine private enterprise - so routine that if you have lots of money you can buy a ticket on a private spaceship and become a space tourist. More than 500 people have booked a flight, including Justin Bieber, Ashton Kutcher and little known space scientist Alan Stern. But it all depends on flying becoming safe and routine. This week hasn't helped. Three days after a private unmanned rocket taking cargo up to the International Space Station blew up six seconds into its flight, a test flight of SpaceShipTwo exploded Friday over the Mojave Desert with two people on board. The developments reignited the debate about the role of business in space and whether it is or will ever be safe enough for everyday people looking for an expensive 50-mile-high thrill ride. \"It's a real setback to the idea that lots of people are going to be taking joyrides into the fringes of outer space any time soon,\" said John Logsdon, retired space policy director at George Washington University. \"There were a lot of people who believed that the technology to carry people is safely at hand.\" The question for space tourism might be, \"if it survives,\" Logsdon said. But he thinks its momentum in recent years will keep it alive. Virgin Galactic founder Richard Branson expressed the same view Saturday after arriving in Mojave, California, to meet with the project workforce reeling from the accident. \"We would love to finish what was started some years ago, and I think pretty well all our astronauts would love us to finish it, love to go to space,\" he said. \"Millions of people in the world would love to one day have the chance to go to space.\" Federal estimates of the commercial space industry - only a little of it involving tourism - exceed $200 billion. NASA is counting on private companies such as SpaceX and Orbital Sciences to haul cargo to the space station. They are also spending billions to help SpaceX and Boeing build ships that will eventually take people there, too. Internet pioneers Elon Musk and Jeff Bezos have gotten into the space game. Aviation entrepreneur Branson and others are pushing a billion-dollar space tourism industry. The Virgin Galactic and Orbital accidents have nothing in common except the words private space, Stern said. Still it raises issues about the space industry. Some experts said they worry that private industry may just not be as safe as the government when it comes to going into space. Jerry Linenger, a former astronaut who narrowly survived a 1997 fire on the Russian space station Mir, said private industry lacks the experience and the advocates for safety that NASA had when he was launching into space. He pointed to former moonwalking astronaut <mark>John Young</mark>, who NASA encouraged to raise safety issues and slow things down. Watching the Orbital Sciences accident on Tuesday, Linenger said, \"it was blatantly obvious that it is a dangerous operation that is very nearly on the edge,\" yet private companies talk of doing it better, faster and cheaper. Then they find out that was naive, he said. American University space policy professor Howard McCurdy, who wrote the book \"Space and the American Imagination,\" said NASA in the 1990s and private companies tout lean management to get things done faster, better and cheaper in space. But he said that leaves no margin for error and \"is like flying an airplane without a qualified pilot. You really need to do it right.\" McCurdy pointed to all the Silicon Valley whiz kids in space and worried that they come with the same Microsoft attitude of pushing a product out and fixing it on the fly. \"I'm not sure that works for rocket ships,\" McCurdy said. \"That may work for cellphones, smartphones and computer programs.\" With space, he said, \"you're working much closer to the edge.\" Logsdon said he wouldn't fly on commercial space flights now, but Virgin Galactic customer Alan Stern said he had no qualms about it: \"Let's not be Chicken Littles,\" he said. He recalled the early days of aviation or the early days of jet test piloting in the 1940s, 1950s and 1960s, when people died pushing the boundaries of technology. McCurdy said the private space industry seems to be having the same growing pains and failures that NASA and the military had when the first astronauts watched a rocket blow up in front of them. It seemed that in the first five years of U.S. rockets, one blew up every other week, but it wasn't quite that bad, said Roger Launius, associate director of the National Air and Space Museum. This week seems a lot like those old times, he said. Launius wonders if the public will support private efforts despite the visible failures, and can the for-profit companies tolerate the risk that comes with space and accidents. Orbital's stock price has dropped 13 percent since Tuesday's accident. \"I want to be part of the opening of this future frontier,\" the former associate administrator of NASA said. \"I want to make that better future a reality.\" No frontier has been one without the risk of life and limb, \"he added.\" I stand with the brave pioneers of space who do this for all mankind. \"Seth Borenstein can be followed at http: //twitter.com/borenbears Aiken Standard is pleased to offer readers the enhanced ability to comment on stories. Some of the comments may be reprinted elsewhere in the site or in the newspaper. We ask that you refrain from profanity, hate speech, personal comments and remarks that are off point. We do not edit user submitted statements and we cannot promise that readers will not occasionally find offensive or inaccurate comments posted in the comments area. If you find a comment that is objectionable, please click the X that appears in the upper right corner when you hover over a comment. This will send the comment to Facebook for review. Please be reminded, however, that in accordance with our © 2014, Aiken Standard, an Evening Post Industries company."}, {"articleID": "2020021718_00004490_W", "names": {"Jonathan Holloway": ["Q21662983", "Q6273415"]}, "date": "2020-01-21", "url": "http://news.rutgers.edu/jonathan-holloway-named-21st-president-rutgers-state-university-new-jersey/20200121#.Xid6nUc3mUl", "content": "<mark>Jonathan Holloway</mark> Named 21st President of Rutgers, The State University of New Jersey <mark>Jonathan Holloway</mark> Named 21st President of Rutgers, The State University of New Jersey <mark>Holloway</mark> to begin presidency on July 1 after successful tenures at Northwestern, Yale January 21, 2020 <mark>Jonathan Holloway</mark>, provost of Northwestern University and an eminent historian, has been appointed the university's 21st president. Photo: Courtesy of Northwestern University dory.devlin @ rutgers.edu <mark>Jonathan Holloway</mark>, provost of Northwestern University and an eminent historian, has been appointed the 21st president of Rutgers, The State University. The Rutgers Board of Governors, with the advice and consent of the Rutgers Board of Trustees, today approved <mark>Holloway</mark>'s appointment at a joint meeting of the two boards. The Board of Governors also appointed <mark>Holloway</mark> as a University Professor and Distinguished Professor. <mark>Holloway</mark> will begin serving as president on July 1, 2020, succeeding President Robert Barchi, who began his tenure in September 2012. <mark>Holloway</mark>, 52, has served as Northwestern University provost since 2017. He is Northwestern's chief academic officer, overseeing educational policies and academic priorities, preparation of the annual budget and faculty appointments and promotions at the Big Ten institution which includes a highly ranked medical school and numerous other nationally and internationally recognized educational programs. Before moving to Northwestern, <mark>Holloway</mark> was the dean of Yale College and Edmund S. Morgan Professor of African American Studies, History, and American Studies at Yale University. At Northwestern, he also is a professor of History and African American studies, specializing in post-emancipation social and intellectual United States history. \"<mark>Jonathan Holloway</mark> is an extraordinarily distinguished scholar with an outstanding record as an academic administrator at Northwestern and Yale. He is thoughtful, visionary, inclusive and decisive. He leads with remarkable integrity, and is just the right person to build upon Rutgers' long tradition as an academic and research powerhouse,\" said Rutgers Board of Governors Chair Mark Angelson who also chaired the presidential search committee. \"Selecting our university president is perhaps the Board of Governors' most important responsibility. We are confident that we have chosen the best person to lead Rutgers into the future,\" he said. President-Designate <mark>Jonathan Holloway</mark> gives remarks after his appointment as the 21st president of Rutgers University. Rutgers University/Nick Romanenko <mark>Holloway</mark> received a bachelor's degree with honors in American Studies from Stanford University and a Ph.D. in History from Yale University. He began his academic career at the University of California, San Diego, before joining the faculty at Yale in 1999. \"I was drawn to the opportunity at Rutgers University because of its amazing history, its foundation of excellence in teaching and its ambition to continue conducting life-changing research that improves our communities, our country and our world,\" <mark>Holloway</mark> said. \"Bob Barchi's extraordinary leadership has helped place Rutgers among the preeminent public universities in the world,\" he added. \"I cannot wait to help write the next chapter in the history of this magnificent institution.\" <mark>Holloway</mark> is the author of Confronting the Veil: Abram Harris Jr., E. Franklin Frazier, and Ralph Bunche, 1919-1941 (2002) and Jim Crow Wisdom: Memory and Identity in Black America Since 1940 (2013), both published by the University of North Carolina Press. He edited Ralph Bunche's A Brief and Tentative Analysis of Negro Leadership (NYU Press, 2005) and coedited Black Scholars on the Line: Race, Social Science, and American Thought in the 20th Century (Notre Dame University Press, 2007). He wrote the introduction for the 2015 edition of W.E.B. Du Bois's Souls of Black Folk (Yale University Press), has submitted a survey tentatively titled \"The Cause of Freedom: A Concise History of the African American Past\" for Oxford University Press and is working on a new book, A History of Absence: Race and the Making of the Modern World. He serves on boards of the Chicago Botanic Garden, Illinois Humanities, the National Humanities Alliance, the Society for United States Intellectual History and the Organization of American Historians. <mark>Holloway</mark> is an elected member of the prestigious American Academy of Arts and Sciences and the Society of American Historians. <mark>Holloway</mark> is married to Aisling Colón. They have a daughter, Emerson, and son, Ellison. The 23-member presidential search committee, comprising broad representation from the universitywide community, including students, alumni, faculty, staff and members of university boards, received more than 200 nominations and applications. Vice chairs of the committee, convened in September 2019, are Deborah Gray White, Board of Governors Professor of History and professor of women's and gender studies in the School of Arts and Sciences at Rutgers University-New Brunswick, and William Best, a Board of Governors member, former chair of the Board of Trustees and an emeritus trustee. Watch President-Designate <mark>Jonathan Holloway</mark>'s full remarks to the boards Media Contact"}, {"articleID": "2012041317_00087653_W", "names": {"Kim Jong-Il": ["Q10665", "Q6408943"]}, "date": "2012-04-13", "url": "http://csmonitor.com/World/Asia-Pacific/2012/0413/In-rare-move-North-Korea-admits-to-missile-failure?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:%20feeds/csm%20%28Christian%20Science%20Monitor%20%7C%20All%20Stories%29", "content": "how failed north korea rocket could lead to a fresh nuclear test george zimmerman arrest: proof that the system worked - or failed? mitt romney's mormon dilemma: to reach voters, should he discuss his faith? in rare move, north korea admits to missile failure (+ video) how failed north korea rocket could lead to a fresh nuclear test the north korea missile launch was a dud. it blew up after 81 one seconds of flight. what's next? yellow sea, north korea acknowledged the satellite said to be attached to the missile had \"failed to enter its preset orbit.\" still, analysts questioned whether the missile actually carried a satellite. the clear purpose, they say, was to improve its capability to carry a warhead as far as the us west coast. the nature of the announcement, in the build-up for massive ceremonies marking the centennial sunday of <mark>kim</mark> il-sung's birth, suggests to analysts that north korea's policies remain unchanged - and that more missile tests, as well as another nuclear test, are likely. north korea food and nukes: 5 key questions the fact that north korea acknowledged any level of failure came as a surprise - though the announcement on north korea's state tv network, by a woman wearing traditional korean \"hanbok\" dress, did not reveal that the rocket had plunged into the sea slightly more than a minute after launch. the only detail offered was that assorted \"scientists and engineers\" were looking into the reasons for the \"failure.\" \"the implications are the same,\" says l. gordon flake, director of the mansfield foundation in washington. \"just because the test failed,\" he says, does not enhance \"the credibility of negotiators.\" north korea's carefully phrased admission is likely to have been forced by the presence of foreign journalists, invited to pyongyang to \"witness\" the launch. they first learned about the launch and, minutes later, about the failure, by phone calls to their home offices. after the north korean announcement, journalists were bussed to a ceremony for the unveiling of statues of kimil-sung, the founding \"great leader\" who was born 100 years ago this sunday, and his son, <mark>kim jong-il</mark>, who took over after his father's death in 1994 and died last december. <mark>kim jong-il</mark>'s son and heir, these comments are not screened before publication. constructive debate about the above story is welcome, but personal attacks are not. please do not post comments that are commercial in nature or that violate any copyright [s]. comments that we regard as obscene, defamatory, or intended to incite violence will be removed. if you find a comment offensive, you may flag it. \"caine's arcade': sweet film starring pint-size entrepreneur goes viral (+ video)\" fox mole' ousted: whistle-blowing hero or disloyal self-promoter? a boat builder by trade, jon wilson uses victim offender dialogue to effect healing. jon wilson helps victims talk with perpetrators - and find closure when victims go behind bars to talk with those who did them harm, they receive something the legal system doesn't provide: a chance to find real closure, maybe even forgiveness."}, {"articleID": "2015022014_00042596_W", "names": {"Phil Jones": ["Q14329218", "Q16730412", "Q18632136", "Q206641", "Q20709445", "Q57014836", "Q601435", "Q7182047", "Q7182049", "Q7182050"], "John Terry": ["Q20022506", "Q21463485", "Q381791", "Q83456"], "Brendan Rodgers": ["Q19973684", "Q310623"], "Alberto Moreno": ["Q4712132", "Q4712133", "Q57542702"], "Rene Girard": ["Q129228", "Q2144754"]}, "date": "2015-02-20", "url": "http://www.insidefutbol.com/2015/02/20/its-been-made-into-a-drama-brendan-rodgers-on-mario-balotelli-penalty-controversy/190400/", "content": "Have another go! \"class =\" isBlank, isPassword \"/> Have another go!\" class = \"isBlank, isPassword\" /> Have another go! \"title =\" Login Email \"class =\" isBlank, isEmail \"/> Have another go!\" title = \"Login Email\" class = \"isBlank, isEmail, varifyEmail\" /> Have another go! \"title =\" Username \"class =\" isBlank, isLogin \"/> Penny Now Starting To Drop For Adryan - Leeds United Boss Neil Redfearn <mark>Phil Jones</mark> and Robin van Persie? Yes - Louis van Gaal Provides Injury Update Louis van Gaal: Changing My Formation Mid-Game Is Only Good Thing <mark>John Terry</mark> Is Getting Contract Extension - Chelsea Boss Jose Mourinho Manchester United Are Premier League's Form Team Insists Louis van Gaal Sam Allardyce: Mauricio Pochettino Has Rotated Spurs Team Expertly Liverpool manager <mark>Brendan Rodgers</mark> has attempted to play down the chatter around Mario Balotelli pushing past Jordan Henderson to take a penalty against Besiktas last night. But Balotelli made it clear that he wanted to take the penalty and the Italian took the ball, leaving Henderson and Daniel Sturridge looking displeased and annoyed at the striker overriding the pecking order established before the match. Balotelli scored and secured Liverpool a 1-0 win, leaving <mark>Rodgers</mark> playing down the incident and explaining he was only unhappy at seeing arguing over who would take the penalty.\" There's probably been a lot more of a drama made out of it than there was \"Just Enough - Liverpool Star <mark>Alberto Moreno</mark> Happy With Win Over Besiktas Mario Balotelli Never Looks Like Missing Penalties - Liverpool Legend Backs Striker Signing For Liverpool Has Affected Divock Origi - Lille Coach <mark>Rene Girard</mark> Sean Dyche: Liverpool and Real Sociedad Target Danny Ings Enjoying His Football I'm Clarifying We Won 1-0 - Stern Faced <mark>Brendan Rodgers</mark> Won't Answer On Mario Balotelli Penalty Furore\" We scored the penalty. It is very clear who our penalty takers are. \"With the players that were on the pitch last night, Jordan was our number one penalty taker.\" If Jordan, Mario and Steven [Gerrard] were on the pitch then we would have Steven and Mario as the two penalty takers. \"Jordan showed what a team player he was last night.\" It was maybe more the etiquette that we didn't like last night. \"With Gerrard set to miss Liverpool's clash against Southampton this weekend, all eyes will be on who is the side's penalty taker if the Reds are awarded a spot kick vs the Saints. Like betting on football? Check out our sister site"}, {"articleID": "2013091918_00026254_W", "names": {"Rafael Ramirez": ["Q2127006", "Q5442567", "Q7282286"]}, "date": "2013-09-19", "url": "http://www.oilandgaseurasia.com/en/news/cnpc-help-develop-14bil-junin-10-oil-project-venezuela", "content": "China's CNPC will work with Venezuela's state oil company PDVSA to develop the Junin 10 block in the South American country's Orinoco extra heavy crude belt, the Venezuelan petroleum minister said on Wednesday. The Orinoco region holds one of largest oil reserves in the world, and PDVSA is working on projects there with foreign partners including Italy's ENI, Spain's Repsol and Russia's Rosneft. \"We agreed with CNPC to develop a new project in the Junin 10 block...to produce 220,000 barrels per day with investment of $14 billion,\" <mark>Rafael Ramirez</mark> said on Twitter. The minister, who is in China ahead of an official visit to Beijing by Venezuelan President Nicolas Madurothis weekend, did not immediately give additional details of the CNPC deal. PDVSA began early crude production at Junin 10 last year, operating the project solo after failing to reach an agreement with France's Total and Norway's Statoil. Last week, Malaysia's Petronas said it was quitting a different large project in the Orinoco after what sources close to the venture said were disagreements with PDVSA and the Venezuelan authorities. Apache To Sell Selected Canadian Oil And Gas Assets For $112 Million In Two Transactions July-August 2013 The Great Game Arctic Style - Uncovering Riches Under the Ice Gazprom Takes on South America With New Venture in Bolivia"}, {"articleID": "2017091308_00444806_W", "names": {"Paul Johnson": ["Q15051763", "Q1632997", "Q18607331", "Q19560882", "Q19874724", "Q19874780", "Q2060446", "Q2060449", "Q21497946", "Q2278396", "Q3032232", "Q41805402", "Q42297148", "Q42706993", "Q45997", "Q47091510", "Q47289825", "Q7151597", "Q7151598", "Q7151599", "Q7151600", "Q7151601", "Q7151602", "Q7151604", "Q7151605", "Q7151606", "Q7151607", "Q7151609", "Q7151610", "Q7151611", "Q7151612", "Q7151613"]}, "date": "2017-09-13", "url": "http://columbiamissourian.com/news/nation_world/irma-spawns-unusual-storm-surges-on-both-florida-coasts/article_53c395c7-8487-54ba-8534-a5f2594e836d.html", "content": "Nation & World News Sunny. High 83F. Winds NNW at 5 to 10 mph. . Tonight Clear skies. Low 58F. Winds light and variable. Updated: September 13, 2017 @ 2:54 am Sunny. High 83F. Winds NNW at 5 to 10 mph. . Tonight Clear skies. Low 58F. Winds light and variable. Updated: September 13, 2017 @ 2:54 am Close 1 of 8 <mark>Paul Johnson</mark> points to the flood water line on his truck in the San Marco neighborhood in Jacksonville, Fla., Monday, Sept. 11, 2017. <mark>Johnson</mark> tried to drive his prized posession truck out of the flood but it sputtered and died and still wouldn't turn on hours later. The nature of Irma's eye, its wide girth and especially its path made its storm surge seem somewhat strange with far off Jacksonville getting hit hard while parts of western Florida got off lighter than expected. (AP Photo/Claire Garafolo) Claire Galofaro Amber Narbett checks on flooding in her yard in the San Marco area of Jacksonville, Fla. in the aftermath of Hurricane Irma, Tuesday, Sept. 12, 2017. (AP Photo/John Raoux) John Raoux Larry Dimas walks around his destroyed trailer, which he rents out to others, in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. His tenants evacuated and nobody was inside when it was destroyed. (AP Photo/Gerald Herbert) Gerald Herbert FILE - This Sept. 11, 2017 file photo shows pedestrians walking by on a flooded street as Tropical Storm Irma hits Charleston, S.C.. While preliminary data suggest Irma's eye pushed a surge of more than 10 feet hit onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville, Fla., and Savannah, Ga., according to the National Oceanic and Atmospheric Administration. (AP Photo/Mic Smith, File) Mic Smith/The Associated Press Police officers plow through floodwater on Hendricks Avenue in San Marco as Hurricane Irma passes by Monday, Sept. 11, 2017, in Jacksonville, Fla. (Will Dickey/The Florida Times-Union via AP) Will Dickey FILE - This Sept. 10, 2017, file photo shows people walking on Old Tampa Bay, in Tampa, Fla.. Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. They can explain why the highest water levels observed from Irma were in faraway corners, while places closer to the eye experienced a rare reverse surge. (AP Photo/Chris O'Meara, File) Chris O'Meara Quintana and Liz Perez look out at the flooding outside their home in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. (AP Photo/Gerald Herbert) Gerald Herbert Charlotte Glaze gives Donna Lamb a teary hug as she floats out some of her belongings in floodwaters from the Ortega River in Jacksonville, Fla., Monday, Sept. 11, 2017, after Hurricane Irma passed through the area. \"This neighborhood has not flooded in at least 51 years,\" Lamb said. (Dede Smith/The Florida Times-Union via AP) Dede Smith Irma spawns unusual storm surges on both Florida coasts BY SETH BORENSTEIN and CLAIRE GALOFARO Associated Press 31 min ago (...) <mark>Paul Johnson</mark> points to the flood water line on his truck in the San Marco neighborhood in Jacksonville, Fla., Monday, Sept. 11, 2017. <mark>Johnson</mark> tried to drive his prized posession truck out of the flood but it sputtered and died and still wouldn't turn on hours later. The nature of Irma's eye, its wide girth and especially its path made its storm surge seem somewhat strange with far off Jacksonville getting hit hard while parts of western Florida got off lighter than expected. (AP Photo/Claire Garafolo) Claire Galofaro Amber Narbett checks on flooding in her yard in the San Marco area of Jacksonville, Fla. in the aftermath of Hurricane Irma, Tuesday, Sept. 12, 2017. (AP Photo/John Raoux) John Raoux Larry Dimas walks around his destroyed trailer, which he rents out to others, in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. His tenants evacuated and nobody was inside when it was destroyed. (AP Photo/Gerald Herbert) Gerald Herbert FILE - This Sept. 11, 2017 file photo shows pedestrians walking by on a flooded street as Tropical Storm Irma hits Charleston, S.C.. While preliminary data suggest Irma's eye pushed a surge of more than 10 feet hit onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville, Fla., and Savannah, Ga., according to the National Oceanic and Atmospheric Administration. (AP Photo/Mic Smith, File) Mic Smith/The Associated Press Police officers plow through floodwater on Hendricks Avenue in San Marco as Hurricane Irma passes by Monday, Sept. 11, 2017, in Jacksonville, Fla. (Will Dickey/The Florida Times-Union via AP) Will Dickey FILE - This Sept. 10, 2017, file photo shows people walking on Old Tampa Bay, in Tampa, Fla.. Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. They can explain why the highest water levels observed from Irma were in faraway corners, while places closer to the eye experienced a rare reverse surge. (AP Photo/Chris O'Meara, File) Chris O'Meara Quintana and Liz Perez look out at the flooding outside their home in the aftermath of Hurricane Irma in Immokalee, Fla., Monday, Sept. 11, 2017. (AP Photo/Gerald Herbert) Gerald Herbert Charlotte Glaze gives Donna Lamb a teary hug as she floats out some of her belongings in floodwaters from the Ortega River in Jacksonville, Fla., Monday, Sept. 11, 2017, after Hurricane Irma passed through the area. \"This neighborhood has not flooded in at least 51 years,\" Lamb said. (Dede Smith/The Florida Times-Union via AP) Dede Smith JACKSONVILLE, Fla. (AP)--Hurricane Irma's devastating storm surge came with weird twists that scientists attribute to the storm's girth, path and some geographic quirks. A combination of storm surge, heavy rains and swollen rivers sent some of the worst flooding into Jacksonville, Florida, even though Irma roared into the opposite end of the state, had weakened to a tropical storm and its eye stayed at least 80 miles (130 kilometers) away. Although preliminary data suggest Irma's eye pushed a surge of more than 10 feet (3 meters) onto southwest Florida's Marco Island, the highest water levels were reported hundreds of miles away in Jacksonville and Savannah, Georgia, according to the National Oceanic and Atmospheric Administration. And southwestern Florida, which is prone to surges, saw the opposite at first: a strange-looking negative surge that sucked the water off the sea floor quickly enough to maroon several manatees. After the water pulled away from the beaches and bay, it came back with vengeance, but much of Florida's west coast wasn't swamped as badly as it could have been because Irma's track kept them safe from the storm's stronger eastern side. \"You can call it bizarre; I might call it unusual or unique,\" said Rick Luettich, director of the Institute of Marine Studies at the University of North Carolina. \"What was very unusual about it was, it spanned two coastlines that were in different-facing directions. As a result, you got the opposite behavior on both coastlines.\" Tampa \"dodged a bullet\" on the weaker side of the storm, especially because Irma's southwestern eyewall had been broken up by high winds near Cuba, MIT meteorology professor Kerry Emanuel said. Jacksonville and the rest of the east coast, on the other hand, got the northeast brunt of the storm, where winds, surge and rainfall are at the strongest. And because hurricane winds spin counterclockwise and lined up perfectly perpendicular to Jacksonville's St. John's River, \"it just pushed the water from the Atlantic right into the river,\" National Hurricane Center spokesman and meteorologist Dennis Feltgen said. The city's concave coastline and the shallow water off the beach also made for a bigger storm surge buildup, funneling more water into Jacksonville, said storm surge expert Hal Needham of Galveston, Texas. On top of that, Jacksonville--unlike western Florida--only got one side of Irma, so the wind kept coming from the same direction, pushing the surge even higher, Needham said. That's why <mark>Paul Johnson</mark> was surprised when Monday morning he woke up in Jacksonville, looked out the window and saw boats passing by where cars normally drive. The water was licking at his front door. Before long, the flooding rose nearly to the window of his beloved pickup truck. \"I've lived here most of my life, and I've never seen anything like that,\" he said. It was worse than last year's Category 5 Matthew, which sat just off shore, because Irma grew to an immense 415 miles (670 kilometers) wide, Luettich said. \"The size of the storm made a huge difference,\" Luettich said. People tend to focus on top sustained winds, but that's only part of the equation that goes into storm surges. The storm's size is another major factor, as with Katrina, said Jamie Rhome, who heads the storm surge unit at the National Hurricane Center. \"As bad as it felt on the east coast of Florida, things were significantly worse in the Florida Keys,\" Rhome said, as well as in the lower part of southwest Florida where the storm's eye passed close by, such as Immokalee. Negative storm surge happened where Irma's eye moved over water east of the coastline and winds pushed the water away from the shore. That draining of the bay and coast \"tricks people,\" Rhome said, but Needham said the Tampa region has experienced this type of negative storm surge at least twice before. And because the reverse surge means the coastline must be refilled before water inundates land, the resulting speed and effect of the surge is lessened, Luettich said. <mark>Johnson</mark> said he had joked with his Facebook friends when Irma's track appeared to turn away from Jacksonville that the storm was too afraid to come near. But this storm's punch came from so far away that it never had to. \"She got us back,\" <mark>Johnson</mark> said. \"She showed us, she sure did.\" ---- --"}, {"articleID": "2019052714_00180198_W", "names": {"Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"], "Robin Williams": ["Q16853353", "Q27252", "Q28835708", "Q42954305", "Q7352873", "Q7352874", "Q83338"], "Ian Mcshane": ["Q234141", "Q59149806", "Q5982372"], "Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"], "Bradley Cooper": ["Q205707", "Q4954898"], "Ryan Reynolds": ["Q192682", "Q7384463"], "Justice Smith": ["Q22058479", "Q6186853"], "Elizabeth Banks": ["Q219373", "Q47295776"]}, "date": "2019-05-27", "url": "https://www.philstar.com/entertainment/2019/05/27/1921358/disneys-live-action-aladdin-casts-box-office-spell", "content": "Disney's live-action \"Aladdin' casts a box-office spell (Agence France-Presse) - May 27, 2019 - 7:33 pm HOLLYWOOD--\"Aladdin\" apparently still has the old magic, as the new Disney film took in an estimated $86.1 million in the Friday-to-Sunday period in North America to lead all box-office offerings, industry watcher Exhibitor Relations reported. The film, released on the US's four-day Memorial Day weekend, is expected to earn $105 million when Monday's ticket sales are included, well beyond earlier estimates of around $80 million, according to the Hollywood Reporter. The live-action movie, directed by Guy Ritchie, stars <mark>Will Smith</mark> as the genie and the Egyptian-born Canadian actor Mena Massoud as the wily charmer who pretends to be a prince to catch the attention of the lovely Jasmine (Naomi Scott). The new version is an adaptation of Disney's 1992 \"Aladdin,\" which featured the unforgettable voice of <mark>Robin Williams</mark> as the fast-talking genie (and the less well-known actor Scott Weinger as Aladdin). Last week's box-office leader, Lionsgate's \"John Wick: Chapter 3 - Parabellum,\" slipped to second, taking in $24.4 million for three days ($30.5 million for four). Keanu Reaves again stars as retired hitman John Wick, this time being chased by an army of killers after a contract is put on his head. Also starring are Halle Berry, Laurence Fishburne, <mark>Ian McShane</mark> and Anjelica Huston. In third was Disney blockbuster \"Avengers: Endgame,\" taking in an estimated $16.8 million for three days ($21.9 million for four). \"Avengers,\" with an all-star cast including Robert Downey Jr., Mark Ruffalo, <mark>Chris Evans</mark>, Chris Hemsworth, <mark>Bradley Cooper</mark>, Scarlett Johansson and Josh Brolin, has broken domestic records but, with a worldwide take of $2.68 billion, is still shy of the $2.79 billion earned by all-time leader \"Avatar\" in 2009. Fourth place went to Warner Bros.' \"Pokemon: Detective Pikachu,\" at $13.3 million ($17 million). Its animated title character (voiced by <mark>Ryan Reynolds</mark>) teams up with a young boy (<mark>Justice Smith</mark>, in a live-action role) to seek the boy's missing father. And in fifth was new Sony horror thriller \"Brightburn,\" at $7.5 million ($9 million). <mark>Elizabeth Banks</mark>, David Denman and Jackson A. Dunn star in the story of an alien tot who arrives on Earth and realizes, as he grows up on a Kansas farm, that he has superpowers. Together with The Walt Disney Company Philippines, SM Cinema opened the streets of Agrabah to mall-goers and movie fans alike with The Magic of Aladdin at the SM City North Edsa. Everyone can get a chance to go around the country in their magical exhibit until May 31 at the SM North EDSA The Block Atrium. Step into the streets of Agrabah when you see the grand entrance arch to the marketplace. Enter the mystery-filled Cave of Wonders and try your hand in getting the Magic Lamp to meet the Genie. Next stop, make your musical entrance to the Streets of Agrabah when you ride Aladdin's camel and take in the sights of the country. Get in the shoes of the Sultan when you snap your photos at the Sultan's Palace. Disney's live-action adaptation of \"Aladdin\" tells the story of Aladdin (Mena Massoud), a kindhearted street urchin, and power-hungry Grand VizierJafar (Marwan Kenzari) as they vie for a magic lamp that has the power to make their deepest wishes come true .--Video from Disney"}]