[{"articleID": "2011030722_00087797_W", "names": {"Larry King": ["Q213430", "Q51724798", "Q6490623", "Q6490625"], "Rob Parker": ["Q43170893", "Q59281980", "Q7340450", "Q7340452", "Q7340454"]}, "date": "2011-03-07", "url": "http://bayoubuzz.com/Politics/gates-petraeus-make-libya-joke-politico.html", "content": "the obama administration has been guarded in its public comments about the instability of muammar qadhafi's regime in libya, but two top pentagon officials were caught off guard monday when a microphone picked up their jokes about a possible attack on libya. \"welcome back, sir,\" gen. david petraeus, the top american commander in afghanistan, said to defense secretary robert gates in an exchange arrived in kabul on monday for an unexpected visit to assess ground conditions as the obama administration prepares to pull some troops out of afghanistan this summer. it's his 13th visit since taking leadership of the department in late 2006. \"you returning to normal, you gonna launch some attacks on libya or something?\" cnn: \"snl' skewers char...(18:01:03\" \"saturday night live\" pokes fun at charlie sheen in its \"duh, winning\" sketch. \"\"charlie sheen show' co.. . (18:02:23\" actor charlie sheen streams himself on the web in latest media stunt. for more, click...\"cnn official interview:...(18:02:35\" in 1988 on \"<mark>larry king</mark> live,\" charlie sheen reflected on the \"sudden onslaught\" of fa...\"cuban wooing charlie sh...(18:01:29\" <mark>rob parker</mark> and skip bayless discuss mark cuban recruiting charlie sheen for a show on...\"charlie sheen's video m.. . (18:06:33"}, {"articleID": "2016092900_00321004_W", "names": {"Michael Powell": ["Q11778385", "Q1562548", "Q1928927", "Q47459798", "Q49943329", "Q588371"]}, "date": "2016-09-29", "url": "http://www.cablefax.com/distribution/intx-exit-ncta-shuttering-annual-tradeshow", "content": "By Cablefax Staff | September 29, 2016 | Premium Content Alfred Liggins, Chairman & CEO, TV One, President & CEO, Radio One, opened INTX 2015 Anyone at this year's INTX in Boston had to see the writing on the wall. Speculation over how much longer NCTA could continue its 65-year-old annual trade show was put to rest Wed, with the association announcing it was nixing the event. The change, billed as a decision by the trade association and its board, is immediate, with next year's gathering set for DC in April canceled. That could bode well for NAB' s annual conference, which was going to overlap the event. Already, many of cable's shows regulars had migrated to the revamped NAB conference. \"We are now exploring new and better ways to tell our story, to gather our community, to advance our growth and present our vision of the future,\" NCTA chief wrote in a blog post Wed.. <mark>Michael Powell</mark> Given that these events must be booked more than a year out, NCTA will lose deposits, but <mark>Powell</mark> argues that large trade show floors with exhibit booths and artificial schedules are an \"anachronism .\" Hardly the image the group, which just renamed itself NCTA, The Internet & Television Association, wants to paint. \"Contemporary venues emphasize conversation, dialog, and more intimate opportunities to explore and interact with technology. Ending INTX gives us a clean slate and we are excited to explore presenting our industry in new and different ways,\" <mark>Powell</mark> wrote. He signed off by acknowledging the many years of fond show memories the industry's members have: \"But all good things must come to an end. And endings hold the promise of new beginnings .\" NCTA declined to comment on what the move means for its staffing, saying it does not comment on personnel matters. (We hear Barbara York, svp, industry affairs, isn't going anywhere as a result). NCTA has seen its annual gathering's attendance go from about 30K at its peek to around 8K this year. The association has rebranded the trade show over the years, taking it from The National Show to the Cable Show before rebranding it as INTX: The Internet & Television Expo in 2015. While there's been questions for years over whether NCTA's show was still needed in this day and age, other more niche shows are seeing growth. The announcement came as SCTE/ISBE is in the middle of its annual Cable-Tec Expo in Philly. Attendance figures won't be released until Thurs, but we're told it is up YOY. And the exhibit floor was bustling, at times with booths so full of people it was hard not to bump into people. NCTC and ACA's Independent Show has seen YOY increases in attendees, with the annual gathering of independent operators seeing its exhibit floor grow significantly over the years. Even ACA's much smaller lobbying-focused Summit in DC has attracted several vendors. Then there are the biggies...CES set a new attendance record of more than 177K in January. The NAB Show had more than 103K registered attendees this year, on par with 2015. And the industry also is participating more in consumer-facing shows such as SXSW and Comic-Con. share this article This is a high-impact position where your analysis and interpretation of results informs decisions affecting millions of consumers...The Managing Editor/Digital will work collaboratively with other leaders and teach employees how to create unique, shareable content ..."}, {"articleID": "2009071812_00075034_W", "names": {"Steve Marino": ["Q7613259", "Q7613260"], "Tom Watson": ["Q263802", "Q532111", "Q7002019", "Q7818002"], "Vijay Singh": ["Q16122677", "Q21170857", "Q24005696", "Q331942", "Q3558246", "Q58483984", "Q58484934", "Q7929210"], "Sergio Garcia": ["Q19878179", "Q3479663", "Q7454265", "Q7454266", "Q7454268"], "John Daly": ["Q203831", "Q25190176", "Q382487", "Q389438", "Q50557115", "Q6228468", "Q6228481"]}, "date": "2009-07-18", "url": "http://breitbart.com/article.php?id=D99GS9C80&show_article=1", "content": "tiger woods of the us is seen after playing from a bunker towards the fifth...tiger woods of the us takes a shot from the sixth hole during the second...<mark>steve marino</mark> of the us reacts during a press conference following his second...turnberry, scotland (ap) - <mark>tom watson</mark> danced what he called \"a scottish jig\" on the 18th green after another long putt fell into the cup. play on. about an hour later, tiger woods tapped in for a par that didn't mean a thing. time to call it a day. talk about role reversal. <mark>watson</mark>, the 59-year-old former british open champion, was supposed to be going through the motions, taking his penultimate curtain call at a tournament that holds such a special place in his career. instead, he heads to the weekend with a share of the lead, having put together two magical rounds and needing two more to get his hands on the claret jug for a record-tying sixth time. woods, the world's best player and right in his prime, was supposed to be homing in on a 15th major championship, another step closer to jack nicklaus' record 18. instead, woods missed the cut, hopped his private jet to florida, and gave his personal chef a few unexpected days off. these were two turnberry shockers. \"it's as if the spirits are on my side,\" said <mark>watson</mark>, who made history friday afternoon as the oldest player to lead a major championship, tying open rookie <mark>steve marino</mark> with a 5-under 135. woods must have felt like everything was stacked against him, because he's sure not used to failing. this was only the second time in 49 major championships as a pro that he failed to make it to the weekend. \"kept making mistake after mistake,\" woods said. now comes a weekend alive with possibilities, just none of them involving woods. the early starters saturday played in pleasant, partly cloudy weather, though that persistent breeze along the scottish coast toughened things up. just ask two-time champion padraig harrington, whose hopes of winning a third straight open faded away with a 6-over score through 16 holes. but american bryce moulder showed a low number was possible, posting an early 3-under 67. <mark>watson</mark> will take aim at harry vardon and his six british open titles. one shot behind was 49-year-old mark calcavecchia, who won the open 20 years ago up the coast at royal troon. he, too, survived the stretch of holes along the firth of clyde in a stiff wind that demanded so much of every shot. calcavecchia made a 40-foot birdie putt on the 10th that carried him to a 69. two-time u.s. open champion retief goosen twice saved par from 35 feet and had a 70, putting him in the group at 3-under 137 that included three-time major champion <mark>vijay singh</mark>. thirteen players were within three shots of the lead, while <mark>sergio garcia</mark> (139) and <mark>john daly</mark> (140) were both in striking distance. \"i guess the memories are with me, all the wonderful memories i've had playing links golf,\" <mark>watson</mark> said. \"walking down the fairways, walking up onto the greens, people showing their respect for me, showing my respect for them. and it's been since 1975-34 years i've played links golf. and it's a fabric of my life, i can tell you that .\" woods failed to make the cut for only the sixth time in his career, and the first since the 2006 u.s. open at winged foot, his first tournament after his father died. \"everybody's entitled to a bad day,\" said lee westwood, who played with woods and shot 70 to join the group at 138. \"it was tough conditions out there, and the wind can play havoc with your swing sometimes. and he hit a couple of poor shots at the wrong time .\" <mark>watson</mark> finished with a pair of birdie putts that were nearly as long as his odds of winning another claret jug. there was a 75-footer footer from the back on the 16th green, then a 45-footer at no. 18 to cap an even-par 70 that might have been more impressive than his bogey-free 65 on thursday. this time, he had to bounce back after making five bogeys in six holes, four of them in a row. \"i wouldn't be here if i didn't think i could win,\" <mark>watson</mark> said. woods always thinks he can win, but his performance on the back nine was abysmal. he hit one tee shot that was never found in the high grass along the dunes right of the 10th fairway. he hit into a fairway bunker for the first time all week. it took him two shots to get up a bank and onto the green at the 13th. woods dropped seven shots during a wretched six-hole stretch, and not even two late birdies could spare him the indignation of missing the cut. needing to chip in for birdie on the 18th hole, he came up a few feet short and tapped in for a 74 and 145 total, one shot off the cut. \"i kept compounding my problems out there,\" woods said. <mark>watson</mark> was tied for the lead with <mark>marino</mark>, a 29-year-old american who didn't know until last weekend that he had gotten into the british open as an alternate, and then had to fly his father from virginia to his home in florida to fetch <mark>marino</mark>'s passport. \"i wasn't even expecting to play in this tournament,\" <mark>marino</mark> said. one year after greg norman made a stunning bid to win the british open at 53, the prospects of <mark>watson</mark> winning at 59 are staggering. the oldest major champion was julius boros, who was 48 when he captured the 1968 pga championship. <mark>watson</mark> won his first of his five british opens at carnoustie in 1975, five months before woods was born. now <mark>watson</mark> is trying to win another-and he doesn't have to worry about woods getting in the way. ann coulter on top victim status: \"being black trumps being an insect' to liberals"}, {"articleID": "2015072909_00033156_W", "names": {"Kelly Miller": ["Q1032247", "Q22110876", "Q3194908", "Q3194910", "Q58388238"], "Craig Armstrong": ["Q5180699", "Q674456"]}, "date": "2015-07-29", "url": "http://www.sanfordherald.com/news/x399480147/Creating-stronger-neighborhoods", "content": "Creating stronger neighborhoods Sanford prepares for National Night Out Jul. 29, 2015 @ 05:06 AM Kathryn Trogdon Login Subscribe or link to print subscription More Fewer photos SANFORD--The first of Sanford's 2015 National Night Out events will start at 5 p.m. on Tuesday, but before the night is over, 30 other events--full of food, fun and friendship--will get underway throughout Sanford. During Sanford's 22nd year participating in the nationwide event--now 32 years running--city council members, police officers and firefighters will circulate throughout the different celebrations. \"The purpose of the event is to bring Sanford together to reduce crime in our communities and create stronger neighborhoods,\" <mark>Kelly Miller</mark>, public information officer for Sanford, said. Out of the 31 events held on Tuesday, some of the locations, including St. Thomas Episcopal Church at 312 N. Steele St., will be open to everyone. Sanford resident Joann Thaxton, coordinator for the St. Thomas gathering, has participated in National Night Out for several years. \"I just think we have to keep up with our neighbors,\" she said. \"By doing it every year, at least we remind people that we are still neighborhood people, and that [it] is really nice to know who your neighbors are--even if you don't get to see them all the time .\" The Veterans of Foreign Wars Post 5631 at 1500 Webb St. will host its first National Night Out event, featuring food, a bouncy house, cornhole and water balloons. \"Part of our mission is to help the community, and we can help the community that we're in by providing that event for them,\" VFW Commander <mark>Craig Armstrong</mark> said. \"Hopefully, it will turn out to be a success this year .\" Next week's activities already have been promoted through several \"pre-events,\" including a tour of the Sanford Police Department, a self-defense class in Depot Park, a summer safety day in downtown Sanford and a tour of the Central Fire Station. <mark>Miller</mark> said a movie night also may be included as one of the \"pre-events\" next year. \"[This year's events] were a lot of fun,\" <mark>Miller</mark> said. \"We had a good time with our residents, and we had good cooperation from the police department, fire department, Partnership for Children and Black Belt Leadership Academy .\" Due to National Night Out, the Sanford City Council's regular meeting will be moved up to 1 p.m. Tuesday in the council chambers at the Sanford Municipal Government Center at 225 E. Weatherspoon St. National Night Out locations Woodbridge Forest/Cliffs Pool on Fernridge Drive--5-7 p.m. St. Thomas Episcopal Church at 312 N. Steele St.--5-7:30 p.m. Church of God of Prophecy at 628 Scott Ave.--5:30 -8 p.m. Walter H. McNeil Park on Pineland and Martin streets--5:30 -8:30 p.m. 300 block of Green Street--5:30 -8 p.m. Bridges Pond Subdivision--5:30 -8:30 p.m. Carbonton Heights Community Park on Knollwood Road--6-7:30 p.m. West Landing Pool Parking Lot on Westcott Circle--6-7:30 p.m. Utley Plaza Apartments on Winslow Drive (in the park)--6-8 p.m. Corner of Belford Drive and Mahogany Court--6-8 p.m. 110 12th St.--6-8 p.m. Monarch Lee PSR at 214 McIver St. 6-8 p.m. \"Circle\" at Hudson Avenue--6-8 p.m. VFW at 1500 Webb St.--6-8 p.m. Hawkins Run at the pool--6-8 p.m. Forest Hills at 322 Mayflower Circle--6-8 p.m. First Congregational Christian Church at 328 McIver St.--6-8 p.m. Carr Creek Subdivision at the park--6-8 p.m. 1022 S. Vance St.--6-8:30 p.m. 1101 S. 7th St.--6-8:30 p.m. 801 Stoney Brook Drive--6-8:30 p.m. Fairway Woods Subdivision at 600 Fairway Drive--6-9 p.m. Buffalo Presbyterian Church at 1333 Carthage St.--6-9 p.m. 281 Glendale Circle--6:30 -7:30 p.m. Spring Lane Assembly of God at 1715 Spring Lane--6:30 -8 p.m. Berkley Place Park at 1408 Hooker St.--6:30 -8 p.m. North Pointe Pool on Morningside Drive--6:30 -8 p.m. Eames Drive Apartments across from East Lee Middle--6:30 -8:30 p.m. 1602 Briarcliffe Drive--6:30 -9 p.m. 600 Valley Road--6:30 -9 p.m. 815 W. McIntosh St.--7-9 p.m. For a map of the site locations visit The Sanford Herald Facebook Page or bit. ly/1gkgcc5."}, {"articleID": "2019061500_00187284_W", "names": {"Keith Johnson": ["Q1526015", "Q16104893", "Q24703001", "Q6384563", "Q6384564"]}, "date": "2019-06-14", "url": "http://shadow.foreignpolicy.com/2019/06/14/europes-dream-escaping-the-dictatorship-of-the-dollar/", "content": "Report Europe's Dream: Escaping the Dictatorship of the Dollar Trump's hostile behavior is reinvigorating efforts to turn the euro into an alternative to the world's dominant currency. If only the Europeans could find some way to do it. By <mark>Keith Johnson</mark> | June 14, 2019, 3:20 PM A photo illustration of euro, U.S. dollar, and British pound notes on Oct. 13, 2017. Matt Cardy/Getty Images Europe's quest to find an alternative to U.S. financial dominance and the global rule of the dollar has only intensified since French and German leaders first howled about the need to recover their economic sovereignty last summer. But European governments are finding that coming up with a workable plan is a lot easier said than done--leaving them fuming but still vulnerable to Washington's strong-arm tactics. That doesn't mean, however, the Europeans are going to give up trying--and that poses a long-term danger to U.S. power. Countries such as France and Germany first bristled at the Trump administration's decision to unilaterally pull out of the 2015 Iran nuclear deal and reimpose crippling sanctions on Iran, putting European firms squarely in the crosshairs of U.S. sanctions. America's Iran policy still rankles, and Europe's efforts to create a so-called special purpose vehicle to enable some trade with Iran continue, with meetings taking place this week even with oil tankers ablaze just outside the Persian Gulf. But since the return of the Iran sanctions last year, the Trump administration has dramatically stepped up its use of sanctions and other economic weapons to force friends and foes alike to cow to its foreign-policy wishes. In addition to a tougher line on Iran, there have been increasing, crippling sanctions on Venezuela, including a blanket prohibition on any countries providing help for Venezuela's oil industry; further sanctions on Russian banks and individuals and repeated threats of U.S. sanctions on European firms working on a Russian gas pipeline in Germany; threats of sanctions against Turkey, a NATO ally, for its defense procurement decisions; and even an unprecedented application of 1990s-era Cuba legislation that is a direct threat to companies in Europe and elsewhere. Those sanctions come on top of a slew of heavy-handed trade actions, from huge tariffs on China meant to force Beijing to change its entire economic system to a tariff threat on Mexico designed to strong-arm the country into changing its migration policies--not to mention the Trump administration's campaign to get countries around the world to blacklist China's Huawei, the world's biggest telecoms equipment-maker. All this bullying from Washington is made possible because the U.S. dollar remains the world's reserve currency and the most used in cross-border transactions. Even so, the Trump administration is taking a risk in resorting to this financial weapon with an abandon seldom seen before, said John E. Smith, who stepped down last year as head of the U.S. Treasury Department's sanctions arm. \"It's of deep concern that the more the U.S. pushes Europe away from a common policy, the more they push Europe into finalizing true alternatives to the U.S. financial system,\" which will ultimately weaken the United States' economic power and its ability to effectively wield sanctions, said Smith, now the co-head of the national security group at Morrison & Foerster. So far, adverse reaction to U.S. financial actions is boosting the euro's prospects--a bit. \"[G] rowing concerns about the impact of international trade tensions and challenges to multilateralism, including the imposition of unilateral sanctions, seem to have lent support to the euro's global standing\" over the past year, the European Central Bank (ECB) concluded Thursday in its annual report on the use of the euro. While the euro's share of cross-border transactions stayed about the same--just under one-third of all transactions--the euro's share in global foreign exchange reserves grew over the last year, while the dollar dropped to its lowest level in almost 20 years. The ECB said some central banks are reducing dollar exposure due to the risk of unilateral actions. This week, French Finance Minister Bruno Le Maire rebuffed U.S. pressure to ban Huawei, citing the need to protect French sovereignty. This month, the governor of the Banque de France and a contender to become the next head of the ECB, called for a greater role for the euro to restore Europe's financial sovereignty. Leading French lawmakers, meanwhile, rail against U.S. extraterritorial sanctions and fret for the future of the trans-Atlantic alliance. Even Spain has fought back furiously against the U.S. revival of Cuba sanctions that threaten its leading businesses. While the United States has aggressively used its central position in the global financial system to impose sanctions on rogue actors since the 1990s, what President Donald Trump is doing is a whole new order of magnitude, Smith said. \"The Trump administration is far more willing to confront even allies and seek to force changes to their foreign-policy position using threats of sanctions, as well as trade threats,\" he said. \"We're hearing now from France and Germany what we used to hear from China and Russia .\" The problem for U.S. allies in Europe, Asia, and elsewhere that are seeking a way around U.S. financial muscle is that it is proving extremely tough to unwind more than seven decades of dollar dominance. The U.S. financial system remains the central nervous system for the bulk of financial transactions. That gives U.S. policymakers the ability to squeeze other countries that is simply unmatched anywhere else, despite decades of sporadic efforts by countries like Japan, China, and others to make their currencies and banking systems an alternative. That is especially evident with Europe's effort to sustain trade with Iran through \"INSTEX,\" a special financial vehicle designed to allow limited trade in humanitarian goods and medicine despite U.S. sanctions. After a year of trying, Europe and Iran still don't have the system up and running. More to the point, however much European governments (and Brussels) would like to honor their commitments to Iran under the auspices of the 2015 accord, European businesses have a calculus of their own--and that doesn't include taking on the U.S. Treasury. \"Companies, even Russian and Chinese companies, do what is in their best interest. And even in Russia and China, they don't automatically subordinate that self-interest to the wishes of the government,\" said Barry Eichengreen, a professor of economics and political science at the University of California, Berkeley. \"For the moment, using dollars remains convenient and economical from the company point of view .\" That's one reason why since last year the European Union has been redoubling efforts to carve out a greater international role for the euro, the world's second-most important currency. Last fall, European Commission President Jean-Claude Juncker called for deeper economic and monetary reforms to boost the euro's role in the global economy, which would help shield Europe from \"selfish unilateralism\" by others. \"The euro must become the face and the instrument of a new, more sovereign Europe,\" Juncker said. Late last year, the European Commission rolled out a road map to strengthen the euro's international role, including completing true monetary union 20 years after the launch of the European currency by creating real pan-European banking and capital markets, which remain fragmented along national lines. Another key plank is to use the euro more, and the dollar less, in the energy sector; despite being the biggest energy importer in the world, Europe mostly pays in dollars for oil, coal, and natural gas. This week, the commission reported that consultations with a wide range of industries showed \"broad support for reducing dependence on a single dominant global currency\" and \"recognition that the EU, through the euro, can reinforce its economic sovereignty .\" The euro, the commission found, is the only currency that can realistically compete with the dollar. But Europe is still struggling to make its own money the currency of choice for seemingly logical things, such as the 300 billion euros the continent spends every year importing energy--the overwhelming share of which is actually paid for in dollars, which go through U.S. banks under the eye of U.S. authorities. And European Commission officials stress that a lot more progress must be made on creating the European monetary and banking union, and especially a true pan-European capital market, to better be able to compete with the dollar and U.S. financial might. \"What's holding the euro back? National financial markets in Europe still lack the breadth and liquidity of U.S. financial markets because they're segmented along national lines,\" Eichengreen said. Still, he said, \"Rome wasn't built in a day. These pilot projects augur what is to come. It will just take time to get there .\" The United States and Europe have had plenty of deep-seated economic spats before, from disputes over trade and monetary policy in the 1970s to decades-long fights over agriculture, industrial subsidies, and tariffs. But America's recent insistence on using its financial might to strong-arm even its closest allies into doing its bidding is a whole new ballgame--with potentially lasting consequences, Smith said. \"The United States has pushed Europe on this issue to the breaking point, where capitals across Europe are looking for alternatives, and at some point some of those alternatives will bear fruit .\" View Comments Tags: Economics, European Union, Finance, Trade Trending Now Sponsored Links by Taboola By Taboola More from Foreign Policy By Taboola Read More The Buck Stops Here: Europe Seeks Alternative to U.S.-Dominated Financial System Germany and France complain that the U.S. is abusing sanctions power to bully even its allies. Report | <mark>Keith Johnson</mark> EU Offers Up a Meager Workaround to U.S. Iran Sanctions The new vehicle will do little to ease Iran's economic pain, though it should help humanitarian trade. Report | <mark>Keith Johnson</mark> China and the EU Are Growing Sick of U.S. Financial Power They are trying their best to erode Washington's rules. Shadow Government | Elizabeth Rosenberg, Edoardo Saravalle"}, {"articleID": "2019070214_00188247_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}, "date": "2019-07-02", "url": "http://www.timeslive.co.za/news/world/2019-07-02-china-condemns-hong-kong-protests-as-undisguised-challenge-to-its-rule/", "content": "China condemns Hong Kong protests as \"undisguised challenge' to its rule 02 July 2019 - 16:48 By Anne Marie Roantree Anti-extradition bill protesters wearing helmets gather outside the legislative council building on the anniversary of Hong Kong's handover to China in Hong Kong, China, on July 1 2019. Image: REUTERS/Tyrone Siu China on Tuesday condemned violent protests in Hong Kong as an\" undisguised challenge \"to the formula under which the city is ruled, hours after police fired teargas to disperse hundreds of protesters who stormed and trashed the legislature. A representative of China's Hong Kong affairs office denounced the demonstrators, who are furious about proposed legislation allowing extraditions to China, and said Beijing supports holding criminals responsible, state media said. The former British colony of Hong Kong returned to China in 1997 under a\" one country, two systems \"formula that allows freedoms not enjoyed in mainland China, including freedom to protest and an independent judiciary. Monday was the 22nd anniversary of the handover. Beijing denies interfering, but for many Hong Kong residents, the extradition bill is the latest step in a relentless march towards mainland control .\" Seriously violating the law, the act tramples the rule of law in Hong Kong, undermines social order and the fundamental interests of Hong Kong, and is an undisguised challenge to the bottom line of \"one country, two systems', Xinhua news agency quoted a Hong Kong affairs office spokesperson as saying .\" We strongly condemn this act. \"2 weeks ago Debris including umbrellas, hard hats and water bottles was among the few signs left of the mayhem that had engulfed parts of the city on Monday and overnight after protesters stormed and ransacked the Legislative Council, or mini-parliament. Police cleared roads near the heart of the financial centre, paving the way for business to return to normal. However, government offices, where protesters smashed computers and spray-painted\" anti-extradition \"and slurs against the police and government on chamber walls, were closed. The government's executive council meeting was due to be held in Government House, officials said, while the legislature would remain closed for the next two weeks. Millions of people have taken to the streets in the past few weeks to protest against the now-suspended extradition bill that would allow people to be sent to mainland China to face trial in courts controlled by the Communist Party. Lawyers and rights groups say China's justice system is marked by torture, forced confessions and arbitrary detention. China has been angered by Western criticism of the bill. The bill triggered a backlash against Hong Kong leader <mark>Carrie Lam</mark>, taking in the business, diplomatic and legal communities that fear corrosion of the legal autonomy of Hong Kong and the difficulty of guaranteeing a fair trial in China. 2 weeks ago She has suspended the bill and said it would lapse next year, but protesters want it scrapped altogether and have pressed her to step down. <mark>Lam</mark>, Hong Kong's self-styled Iron Lady, has created a fresh crisis for Chinese President Xi Jinping, who is already grappling with a trade war with Washington, a faltering economy and tension in the South China Sea. Regina Ip, chair of Hong Kong's pro-China New People's Party, said the protests had brought shame on Hong Kong .\" In the long term, (this) will impact Hong Kong's business environment. I believe various negative consequences of damages in our economy and prosperity will soon emerge. \"Starry Lee, chair of the Democratic Alliance for the Betterment and Progress of Hong Kong, also condemned the violence .\" This is an insult to LegCo (Legislative Council), an insult to Hong Kong rule of law, \"she said. Chinese censors have worked hard to erase or block news of the Hong Kong protests, wary that any large public rallies could inspire protests on the mainland. Screens went black on the BBC and CNN when they showed related reports in mainland China, as has happened during previous Hong Kong protests. Foreign news channels are only available in luxury hotels and a handful of high-end apartment complexes in China. 2 weeks ago State news agency Xinhua wrote an upbeat Chinese-language report about a government-arranged concert in Hong Kong to celebrate the handover anniversary, complete with descriptions of the audience singing the national anthem and how the performers showed their\" ardent love of the motherland \". A state newspaper in China called for\" zero tolerance \"after the violence in Hong Kong .\" Out of blind arrogance and rage, protesters showed a complete disregard for law and order, \"the Global Times, published by the Communist Party's People's Daily, said in an editorial. The protests generated lively discussion on Chinese social media .\" Hong Kong shows that China cannot follow a Western political system. It's too easy to be manipulated and to bring chaos, \"wrote one user of the Twitter-like Weibo. Another wrote,\" When the children don't listen, their mothers should give them a smacked bottom. \"Britain warned China that there would be serious consequences if the Sino-British agreement on Hong Kong was not honoured. China has dismissed Britain's concerns, saying Hong Kong was none of its business. The UN human rights office in Geneva called on all sides to avoid violence .\" We ask protesters to demonstrate and express their grievances in a peaceful manner, \"spokesperson Marta Hurtado said in an e-mail .\" We urge HK authorities to immediately open a proper channel for dialogue and for the police and other members of the security forces to manage demonstrations according to international human rights norms and standards. \"Reuters"}, {"articleID": "2018031016_00168206_W", "names": {"Naohiro Masuda": ["Q11406928", "Q17230341"]}, "date": "2018-03-11", "url": "http://asia.nikkei.com/Japan-Update/Fukushima-ice-wall-yields-limited-benefit-for-its-cost", "content": "March 11, 2018 1:16 am JST Fukushima ice wall yields limited benefit for its cost $322m barrier is less effective than lower-tech measures in fighting contamination Nikkei staff writers Tepco has surrounded the reactors at its Fukushima Daiichi plant with a wall of frozen earth. TOKYO--Tokyo Electric Power Co.. Holdings faces the question of whether the so-called frozen soil wall built to contain contamination at its damaged Fukushima Daiichi nuclear power plant justifies its high cost. The 1.5 km barrier of frozen earth, which cost 34.5 billion yen ($322 million) to build using taxpayer money, is supposed to keep groundwater out of the plant's four reactor buildings. Multiple reactors suffered core meltdowns following the earthquake and tsunami in March 2011. Any water that enters must undergo decontamination, though it is not possible to remove all the radioactive material the water takes up. Tepco, as the utility is widely known, said Thursday that the barrier has reduced the amount of new contaminated groundwater by 95 tons a day. This suggests that the wall accounts for just one-quarter of recent reductions: Around 110 tons of groundwater were contaminated daily in the three months through February, compared to roughly 490 tons daily before the frozen barrier was created. Freezing of earth around the buildings began in March 2016, and was nearly complete last November. The utility has said a variety of external factors make those numbers difficult to compare directly, and it plans to release a more detailed analysis as soon as next week. \"The frozen soil wall is working,\" said <mark>Naohiro Masuda</mark>, chief decommissioning officer for the Fukushima plant. Some of the tanks to store contaminated water are rendered unnecessary, and \"this is huge in monetary terms,\" he said. Others beg to differ. \"It is hard to believe\" the barrier is \"contributing as much as it cost to build,\" said Masashi Kamon, professor emeritus at Kyoto University. Japan's Nuclear Regulation Authority has also raised questions about the barrier's effectiveness relative to its cost. Lower-tech measures also in place to prevent contamination, such as wells that pump water out of the ground surrounding the plant, have proven more effective than the frozen barrier. But Tepco plans to keep the wall in place, at an annual cost of more than 1 billion yen, until the groundwater contamination problem is resolved."}, {"articleID": "2016050817_00302633_W", "names": {"James Regan": ["Q16225304", "Q6141937", "Q6141939"]}, "date": "2016-05-08", "url": "http://www.reuters.com/article/us-france-economy-moscovici-idUSKCN0XZ0O6", "content": "Markets | Sun May 8, 2016 12:48 pm EDT EU Commission likely to raise France growth forecast: Moscovici European Commissioner for Economic and Financial Affairs Pierre Moscovici speaks during a news conference with Portugal's Finance minister Mario Centeno (not pictured) in Lisbon, Portugal March 10, 2016. Reuters/Rafael Marchante PARIS The European Commission will probably raise its growth forecast for France from the 1.3 percent it predicted last week, European Economic and Monetary Affairs Commissioner Pierre Moscovici said on Sunday. \"There are improvements in terms of growth, it is slow, we had 1.2 percent in 2015, we have 1.3 percent for 2016, we have 1.7 percent for 2017, and the truth is we will probably adjust 2016 higher because the first quarter was better than the figures we incorporated in our initial forecast,\" he said, speaking on BFM TV. The euro zone as a whole is expected to grow 1.6 percent this year and 1.8 percent next year, after 1.7 percent in 2015, according to the figures published on Tuesday. The French economy grew a faster-than-expected 0.5 percent in the first quarter of the year, according to figures published by the INSEE national statistics agency on April 29. (Reporting by <mark>James Regan</mark> and Chine Labbe; Editing by Angus MacSwan)"}, {"articleID": "2019082006_00187781_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-08-20", "url": "http://news.bbc.co.uk/news/uk-northern-ireland-49400180", "content": "Brexit: Johnson and Varadkar in hour-long call 19 August 2019 These are external links and will open in a new window Close share panel Brexit Image caption Boris Johnson and Leo Varadkar spoke by phone on Monday The prime minister and the taoiseach (Irish prime minister) have \"shared perspectives on the withdrawal agreement\" in a phone conversation. Boris Johnson and Leo Varadkar spoke for almost an hour on Monday evening, the two governments said. Mr Johnson said the agreement in its current form would not get through the House of Commons, while Mr Varadkar reiterated that it cannot be reopened. Both prime ministers condemned Monday's bomb in County Fermanagh. The phone call comes a day after a government dossier warning of the impact of a no-deal Brexit was leaked. The report said leaving the EU without a deal could lead to a hard Irish border after plans to avoid checks fail. Media playback is unsupported on your device Media caption Confused by Brexit jargon? Reality Check unpacks the basics. Mr Johnson maintained that the \"backstop would need to be removed\" , while Mr Varadkar \"emphasised the importance of the legally operable guarantee to ensure no hard border and continued free trade on the island of Ireland\". The backstop, part of the withdrawal agreement negotiated by former prime minster <mark>Theresa May</mark>, is an insurance policy to prevent a hard border returning on the island of Ireland, which if implemented, would see Northern Ireland staying aligned to some rules of the EU single market. It would also involve a temporary single customs territory, effectively keeping the whole of the UK in the EU customs union. These arrangements would apply unless and until both the EU and UK agreed they were no longer necessary. The prime ministers also spoke about the need for the power-sharing executive at Stormont to be reinstated and \"agreed to work closely to this end\". The leaders also agreed to meet face to face in Dublin in early September."}, {"articleID": "2019050116_00294428_W", "names": {"Robert Jenkins": ["Q38800320", "Q7346083"], "Ian Taylor": ["Q11154675", "Q1438500", "Q14943179", "Q20877307", "Q23409808", "Q28094325", "Q57062399", "Q5983044", "Q5983046", "Q5983056"], "Tony Collins": ["Q4772556", "Q51095573", "Q7822088", "Q7822089", "Q7822090"], "Colin Gibson": ["Q1108462", "Q21465575", "Q22075468", "Q5145138"]}, "date": "2019-05-01", "url": "http://www.eveningtimes.co.uk/news/17611457.clutha-fai-engineer-warned-bosses-of-accident-waiting-to-happen-day-before-doomed-glasgow-flight/", "content": "News Clutha FAI: Engineer warned bosses of \"accident waiting to happen' day before doomed Glasgow flight By Catriona Stewart @ LadyCatHT Columnist/reporter File photo dated 30/11/13 of emergency services at the scene of a police helicopter crash at the Clutha Bar in Glasgow. The fatal accident inquiry (FAI) into the crash that claimed 10 lives could hear from up to 85 Crown witnesses. PRESS ASSOCIATION Photo 0 comment THE engineer who worked on the Clutha helicopter the day before its doomed final flight had warned an\" accident is waiting to happen. \"Craig Booth, a licensed engineer at Glasgow Heliport, wrote the words in a handover note at the end of his shift hoping management would take heed, a court heard. Mr Booth told the Clutha Fatal Accident Inquiry (FAI) he was concerned about the workload of engineers at Glasgow Heliport. The inquiry also heard that issues with one of the fuel sensors on helicopter G-SPAO, which crashed in Glasgow on the night of November 29, 2013, were recorded on November 24. However, the observation was made on a sticky note in the base's engineer diary, rather than being formally logged in a deferred defect log. Had it been noted in the log, the fuel sensor would have had to have been replaced within three days. It was not replaced before the Police Scotland helicopter's final flight. The inquiry, at Hampden Park, has previously heard that pilot David Traill would have seen five low fuel warnings in the aircraft before it crashed into the Clutha Vaults Bar at 22.22 pm. Any pilot, the court has heard, should land within 10 minutes of a low fuel warning but the helicopter carried on to other operations following the red warnings. The court was shown Mr Booth's end of shift report, sent to colleagues at 3.53 am on November 28, 2013. In it, he wrote:\" I am extremely concerned at the way we are having to carry out in depth maintenance on our aircraft at Glasgow. \"It is an accident waiting to happen!!\" Mr Booth told the court: \"I didn't think for a moment it would be an air accident. I just wanted my management to know how I felt at the end of a very busy shift .\" Gordon Jackson QC, counsel for the family of victim Gary Arthur, said: \"You put that statement in your report and that report would go to senior management. What response did you get?\" Mr Booth replied: \"None .\" Mr Jackson went on to say: \"It's a pretty strong statement. You might have expected at least someone to discuss it with you .\" And you did expect that, but it never happened. Did you do anything about that? \"Mr Booth replied:\" Circumstances overtook. \"Mr Booth told the court that to keep on top of his workload at Glasgow Heliport he frequently went\" above and beyond, \"working additional hours and was described as\" coming off work absolutely shattered. \"A technical log entry dated July 8, 2013, was shown to the court which detailed an issue with the fuel sensor in the main fuel tank of the Police Scotland helicopter. The helicopter had been re-fueled but the level of fuel shown on a display inside in the cockpit differed from the amount in the tank. Mr Booth's end of shift report of November 28, the court heard, also stated:\" Fuel contents after refuelling drops after a period of time in main tank. \"Main fuel probe in AO bin when if [CORR] we get time to change it .\" The court was shown the technical log from November 24 to November 28 where there was no mention of the fuel sensor problem that had been recorded on the yellow sticky note in the engineer's diary. Donald Findlay, for the family of victim <mark>Robert Jenkins</mark>, questioned whether the engineer taking over on the new shift, in this case <mark>Ian Taylor</mark>, would speak to Mr Booth to go over the details of any outstanding jobs. Mr Findlay suggested Mr Booth's note in the tech log \"didn't carry any urgency\" and was \"almost a suggestion\" that the sensor might need changed. Mr Booth said: \"It's badly written by me .\" Mr Findlay added: \"This is quite important to a number of people .\" Mr Booth replied: \"Yes, I know that .\" In the afternoon the inquiry heard from licensed helicopter engineer Andrew Bochel, now semi-retired but working for Babcock. He was the engineer on duty on the day of the crash at Inverness heliport, where G-SPAO landed twice on the day in question. Pilot David Traill, 51; PC <mark>Tony Collins</mark>, 43; and PC Kirsty Nelis, 36, died along with seven customers who were in the bar, Gary Arthur, 48; Joe Cusker, 59; <mark>Colin Gibson</mark>, 33; <mark>Robert Jenkins</mark>, 61; John McGarrigle, 58; Samuel McGhee, 56; and Mark O'Prey, 44. The inquiry before Principal Sheriff Craig Turnbull continues. 0 comment"}]