[{"articleID": "2019101814_00079461_W", "names": {"Marc Faber": ["Q117011", "Q16439149"], "Peter Schiff": ["Q1560227", "Q512741"]}, "date": "2019-10-18", "url": "https://www.marketwatch.com/story/stock-market-pessimism-is-a-reliable-sign-of-a-pending-rebound-2019-10-18?mod=home-page", "content": "It seems that all investors, from individuals to institutions, have one thing in common: They've been getting out of stocks. Before following the herd, ask yourself: When did the crowd ever correctly foresee a stock market top? There's a reason for this saying: \"No bell rings at the top of the market.\" In fact, the post-2009 bull market has been fueled by hyped-up pessimism. In 2014, when billionaire investors Wilbur Ross and Carl Icahn along with investing icons <mark>Marc Faber</mark>, <mark>Peter Schiff</mark> and David Tepper joined the doomsday crowd, I wrote: \"Here's a message for everyone dying to be the next [Nouriel] Roubini: A watched pot doesn't boil and a watched bubble doesn't burst. There will be a correction, but the bull market won't be over until most bears turn into bulls or the media stops listening to crash prophets.\" Counterpoint: The \"skyscraper indicator' shows we're near a stock market top As the chart below shows, bears remain bears. Last week (denoted by the red line) only 20.3% of retail investors polled by the American Association for Individual Investors (AAII) were bullish, the lowest reading since May 2016. The AAII chart is reminiscent of June 7, 2017, when I published the chart below in this article\" There's still plenty of fuel left to fire up this stock market. \"Managers polled by the National Association of Active Investment Managers (NAAIM), essentially institutions, have had an average equity exposure of 57%. Commercial S & P 500 Index SPX, -0.10% hedgers are net short S & P 500 futures (not to an extreme though). Let's not forget that this is happening while the S & P 500, Dow Jones Industrial Average DJIA, -0.22% and Nasdaq COMP, -0.18% are trading within spitting distance of their all-time highs. Market scapegoats Trade-war tweets, European Union concerns and U.S. recession talk have taken their toll, some claim. But if that's the case, why are stocks near record highs? Case in point. I published the chart of online\" recession \"searches in the Aug. 25 Profit Radar Report and warned that premature bears will likely have to get\" burned \"before the market turns south. How to trade sentiment Long-term sentiment suggests that a major market top has not yet been struck, which means higher prices are still ahead. But long-term sentiment is not an appropriate short-term timing indicator. Here is some short-term help. The S & P 500 seems to be tracing out a triangle (blue lines), which may develop within an even larger triangle (purple line). The S & P 500 could pull back while below blue triangle resistance, but a close above resistance (3,002 points) should unlock higher targets (as high as 3,187). The purple trend line around 3,060 points provides additional resistance. In fact, this trend line is important because it corresponds with similar resistance for the Russell 2000 RUT, -0.14% and Dow Jones Transportation Average DJT, +0.20%. A coordinated breakout of all three indexes has had bullish implications over the past decade. More details about the importance of purple trend line resistance is available here. Simon Maierhofer is the founder of iSPYETF and publisher of the Profit Radar Report. We Want to Hear from You Join the conversation Comment"}, {"articleID": "2011020300_00024115_W", "names": {"Gareth Roberts": ["Q1103587", "Q30604186", "Q3098309", "Q46270269", "Q5522955", "Q5522957", "Q5522961", "Q56709362"], "Charles Palmer": ["Q22907586", "Q28477735", "Q30090138", "Q5081477"]}, "date": "2011-02-03", "url": "http://atomicanxiety.wordpress.com/2011/02/02/doctor-who-the-shakespeare-code-has-the-worlds-cutest-villain/", "content": "\"the shakespeare code\" - series 3, episode 2, story 180 - written by <mark>gareth roberts</mark>; directed by <mark>charles palmer</mark> - martha jones takes her first and allegedly only trip in the tardis as the doctor takes her back to 1599 so she can see a shakespeare play performed at the rose theatre. martha makes herself instantly likable as she asks obvious questions, like, \"am i going to stand out because i'm black?\" and \"if i kill a butterfly will we still get the horrible ashton kutcher movie?\" but the doctor doesn't want to answer her questions because we already know and, as the saying goes, \"the play's the thing,\" not \"the q-and-a session's the thing.\" so martha and the doctor meet shakespeare and some witches that are actually aliens and we get to see a lost shakespeare play, love's labour's won. well, not the whole thing, just the ending. because the ending's the thing, too. the shakespeare code is everything i want in a doctor who serial. wait, did i just use that line last review? yep, i did, and i'll use it again here, because code (you don't think i'm writing shakespeare every time, do you?) is fun, fast, clever, with cool villains, solid character interaction, and nice special effects. code is an historical serial that sees the doctor and martha traveling back to 1599 to see a performance of love's labour's lost. martha asks all those questions that the audience asks, like, how does the tardis work, but the doctor gives her short shrift on the answers. he says things like, \"don't worry about it,\" and \"do you intend to kill your grandfather? no, then don't worry about it.\" i get that they have to play these scenes like this because it would slow the story down, but it's a bit condescending. you let the doctor get away with it because while his answers are condescending, his tone isn't, and martha doesn't seem to mind with all the hurrying around. later, when they plop down to share a bed for the night (fully clothed and above the sheets), the doctor's a bit more of a dick and martha is peeved then. they're all going on about the mystery and you can see that martha is getting a bit starry-eyed at the doctor and he's totally focused on the mystery and says something like, \"if rose were here, she'd say the perfect thing.\" martha scowls and rolls over, blowing out the candle light. there's a couple ways to look at this bit. one is that this is more of the doctor's well-documented naivete when it comes to women and that he just doesn't understand how this is going to be interpreted by martha. another way, of course, is that he's just being a callous dick. or maybe he knows exactly what that big-eyed look martha is giving him means and he's purposely being a dick in order to remind everyone that he's not walking down romance road this time around. i know a lot of people dislike rose (i don't) and i know a lot of people dislike seeing the doctor romantically involved with a companion (i do, though i can understand why he fell for rose, given the context of the time war), but just because we don't like it doesn't mean we can't still see stories generated from the idea of a romantic engagement. or even just a one night stand. companions (at least the human ones) tend to be contemporary with the audience at home, and it's not 1965 anymore. while maybe the doctor hasn't changed his sexual mores, women on television have changed. while seeing martha make a few doe eyes at the doctor isn't the high point of the episode, it's not hard to imagine getting swept up in the romance of the tardis. especially, you know, since the doctor now looks like david tennant and not william hartnell. i'm just saying. after the performance of lll, the doctor and martha stop in to see shakespeare. he wants nothing to do with his fans until he sees martha and decides he wants everything to do with this fan. there's such great chemistry between the doctor and martha that it's a joy just to watch them talk to one another. both of them take easily to the rapid-paced dialogue. (it really does seem like people are talking faster this season, but maybe i'm just saying that because the chemistry is better .) upon meeting shakespeare, martha tries to fit in by saying, \"verily,\" \"forsooth,\" and \"for odin! for asgard!\" and the doctor softly tells her, \"don't do that.\" again, it can be read as a bit condescending, but again, the delivery doesn't match the tone of the words. there's a bunch of racially-tinged dialogue, which the doctor diffuses by telling shakes that martha is from the nation of freedonia. dean lennox kelly is fantastic as shakespeare. god knows how historically accurate his shakes is, but the character presented here works wonderfully. he's loving where his life is at the moment, reveling in the attention his plays bring him, and fascinated by the doctor and martha. when the doctor tries out his psychic paper bit, shakespeare sees it as blank paper, not, \"sir doctor of tardis\" (a reference to tooth and claw). <mark>gareth roberts</mark> makes his first screenplay contribution to the franchise (though certainly not his last) and he's firing on all cylinders. he has a fantastic ability, not unlike aaron sorkin, to run a show on two lines at the same time with the same characters at breakneck speed. there's the overarching plot-driven dialogue but then there's the character-driven ongoing conversation that gets peppered throughout the show. when it works, it's a joy to watch. here, it's the continual fascination of shakes with martha; as the doctor, martha, and shakespeare concentrate on the mystery, shakes is also quizzing/hitting on martha and this strange land of freedonia where women are allowed to do be equal members of society. the mystery at play in this episode involves three witches that are really aliens that want to take over the earth. they use their \"magic\" to attack people and hypnotize shakespeare to write the ending they want for the ending of love's labour's won. it's not that they're critics of his work, but that getting the actors to perform the right series of words will open the gateway to allow the aliens in. the youngest witch (played by christina cole) disguises herself as a young, attractive working class woman who uses her looks to manipulate people and hide in plain sight. because it's never the cute one, right? shakespeare code moves fast and with copious amounts of charm. freema agyeman is so much better at playing off tennant that billie piper that it seems to inject the whole show with a confidence it was lacking during series 2. two episodes into series 3 and it seems apparent this show knows exactly what it is and knows exactly how to deliver it to the audience. good stuff."}, {"articleID": "2015050920_00004547_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2015-05-07", "url": "http://www.pressherald.com/2015/05/07/senate-passes-bipartisan-bill-to-review-iran-nuclear-deal/", "content": "Senate passes bipartisan bill to review Iran nuclear deal WASHINGTON - The Senate muscled its way into President Barack Obama's talks to curb Iran's nuclear program, overwhelmingly backing legislation Thursday that would let Congress review and possibly reject any final deal with Tehran. The vote was 98-1 for the bipartisan bill that would give Congress a say on what could be a historic accord that the United States and five other nations are trying to finalize with Iran, which would get relief from crippling economy penalties. Photo Store → The lone no vote came from freshman Sen. Tom Cotton, R-Ark ., who wants the administration to submit any agreement to the Senate as a treaty. Under the Constitution, that would require approval of two-thirds of the Senate. The House is expected to vote next week on the measure. House Speaker John Boehner, R-Ohio, said in a statement moments after the vote that the \"goal is to stop a bad agreement that could pave the way to a nuclear-armed Iran, set off a regional nuclear arms race, and strengthen and legitimize the government of Iran.\" The U.S. and other nations negotiating with Tehran have long suspected that Iran's nuclear program is secretly aimed at atomic weapons capability. Tehran insists the program is entirely devoted to civilian purposes. The talks resume next week in Vienna, with a target date of June 30 for a final agreement. Senate Majority Leader Mitch McConnell, R-Ky ., said the bill \"offers the best chance for our constituents through the Congress they elect to weigh in on the White House negotiations with Iran.\" Added Sen. Bob Corker, R-Tenn ., chairman of the Foreign Relations Committee: \"No bill. No review.\" The legislation would bar Obama from waiving congressional sanctions for at least 30 days while lawmakers examine any final deal. The bill would stipulate that if senators disapprove of the deal, Obama would lose his current power to waive certain economic penalties Congress has imposed on Iran. The bill would require Congress to pass a resolution of disapproval to reject the deal, an action that Obama almost certainly would veto. Congress then would have to muster votes from two-thirds of each chamber to override the veto. In the House, about 150 Democrats - enough to sustain a veto - wrote the president to express their strong support for the nuclear negotiations with Iran. \"We urge you to stay the course,\" the letter said. \"We must allow our negotiating team the space and time necessary to build on the progress made in the political framework and turn it into a long-term, verifiable agreement.\" The bill took a roller coaster ride to passage. Obama first threatened to veto it. Then he said he would sign it if the measure was free of amendments the White House believed would make continued negotiations with Tehran virtually impossible. It survived a blow from Israeli Prime Minister Benjamin Netanyahu, who stood before Congress in March and warned the U.S. that an emerging nuclear agreement would pave Iran's path to atomic weapons. \"It is a very bad deal. We are better off without it,\" he said in a speech arranged by Republicans. His address aggravated strained relations with Obama and gambled with the long-standing bipartisan congressional support for Israel. A few days later, Cotton and 46 of his GOP colleagues wrote a letter warning Iranian leaders that any deal with Obama could expire when he leaves office in January 2017. Senate Democratic leader <mark>Harry Reid</mark> of Nevada accused the GOP of trying to undermine the commander in chief while empowering the ayatollahs who lead Iran. In April, the Senate Foreign Relations Committee passed a compromise bill on a 19-0 vote. Obama withdrew his veto threat. But Republicans were not done trying to change the bill, drawing up more than 60 amendments. One, from Cotton, would have made any deal contingent on Iran's halting its support of terrorist activities that threaten Americans. Cotton used an unusual Senate procedural move to get his amendment heard. McConnell did not want to see the bill end in tatters, so he acted to end the amendment process and have votes on the legislation. \"It is a virtual certainty that no matter how terrible this deal is, it will go into effect and this legislation is unlikely to stop it,\" said Republican Sen. Ted Cruz of Texas, who is running for president. Another 2016 candidate, Sen. Sen. Marco Rubio, R-Fla ., said the bill puts Congress in a better position than having no say. A campaign pitch for every Republican preference in South Carolina Ferry captain goes all in to save man who fell into Portland Harbor The scoop on Portland's Press Hotel: It's ready to make headlines Two kayakers reported missing near UNE had made it to shore, gone to bed Biddeford council hears calls for accountability on claims of police sex abuse A mother listens to her son's transplanted heart beating in another man Ferry captain goes all in to save man who fell into Portland Harbor The scoop on Portland's Press Hotel: It's ready to make headlines MaineToday Media we value our readers and are committed to growing our community by encouraging you to add to the discussion. To ensure conscientious dialogue we have implemented a strict no-bullying policy. To participate, you must follow our"}, {"articleID": "2016090811_00083275_W", "names": {"Charles Johnson": ["Q11318333", "Q14918507", "Q16222225", "Q18001378", "Q41384499", "Q5079554", "Q5079555", "Q5079557", "Q5079558"]}, "date": "2016-09-08", "url": "http://www.espn.com/blog/nflnation/post/_/id/213422/sam-bradfords-task-with-vikings-is-like-learning-a-new-language", "content": "comment MINNEAPOLIS--Deciding whether Sam Bradford will start at quarterback for the Minnesota Vikings on Sunday appears to depend on how quickly he can run the team's offense at a workable level. There's not much mystery about whether the Vikings want to put Bradford on the field soon. As Tennessee Titans coach Mike Mularkey said Wednesday, like a man calling the bluff of a card player across the table, \"They wouldn't give up a [No .] 1 and a [No .] 4 [draft pick] to have him sit very long.\" But what the Vikings want to do and what they can manage in the days before their season opener at Tennessee are different things. It seems, then, that we should spend a minute or two discussing what NFL teams mean when they talk about the challenge of learning a system. At a base level, there's plenty of shared material in different playbooks; there are only so many routes an NFL team can run. The minutiae behind those routes, though--the language used to call them, the depth at which they're run and the adjustments they take on against different coverages--is the secret sauce that make one team's offensive recipe different from another. And those are the things that take time to learn. Wide receiver <mark>Charles Johnson</mark> said \"how things are called\" is the biggest difference between systems. \"Some people have concept-based systems. We've got numbers, with a little bit of concepts here,\" he said. \"I'm sure Sam has been in both styles of offense. He's picked it up well so far.\" What does <mark>Johnson</mark> mean by numbers versus concepts? It has to do with how routes are communicated in a play call. In the Air Coryell system that Vikings offensive coordinator Norv Turner has used to great effect in his career, routes are assigned a number from 0-9, with larger numbers generally corresponding to routes that break farther down the field. A \"9\" route is a go route. An \"8\" route--as in the famous \"Bang 8\" play from Turner's days as Dallas Cowboys offensive coordinator--refers to a post route. A \"7\" route is a corner route. And so on. The other popular school of thought, usually associated with the West Coast offense, generally requires quarterbacks to call out each route concept by name in a play call, which leads to more terminology and requires more memorization. As <mark>Johnson</mark> said, the Vikings primarily use numbered routes, but they have a few wrinkles that include names of route concepts. Bradford is on his fifth coordinator in his seventh season in the league, and he has played in everything from Air Coryell and West Coast schemes to Chip Kelly's spread offense. On some level, he has a broad enough exposure to different ideas that he won't encounter much that is new to him. The presence of Pat Shurmur--Sam Bradford's offensive coordinator in St. Louis and Philadelphia--on the Vikings' staff has been comforting to the recently arrived QB. AP Photo/Jeff Roberson \"Sam's been in this league a long time,\" <mark>Johnson</mark> said. \"I say it all the time: The NFL is a copycat league. If you've seen somebody run a' 4' route, it's a' 4' route. You know what a curl route looks like. He's been around football long enough. He knows what a curl route looks like. He's just got to get used to how we call the plays, our depths, all that kind of stuff.\" One thing <mark>Johnson</mark> mentioned, though, can only be mastered with repetitions in practice: NFL teams tell receivers to break on their routes at different yardage markers, which means quarterbacks have to develop a feel for the specific timing with each receiver on each route. It's why you often hear QBs talk about the value of offseason work with their receivers, and why Bradford's task this week is as much art as it is science. \"Obviously, it's not ideal,\" Bradford said. \"Normally you have an offseason. You have a summer to at least work on some of that timing, but I just think that means that every rep we get in practice is more important. We've got to be focused. I've got to be focused. We've got to take advantage of every throw in practice, get throws after practice and make sure that we're all on the same page.\" The presence of Vikings tight ends coach Pat Shurmur, who was Bradford's offensive coordinator in both St. Louis and Philadelphia, has helped some, Bradford said. \"He's not the quarterback coach here, so it's a little bit of a different role, but just having that familiar face--someone that, if I do have questions and I need to refer to an old language, I can go up to Shurm and say,\" Hey, can you kind of explain this in terms that we've done in the past?' \"Bradford said.\" In that regard, Shurm's been awesome. \"All of this explains why Bradford's task is so tall this week. In addition to learning the Vikings' playbook and developing timing with his receivers, he has had to get a grasp of protection calls, checks at the line of scrimmage and variations his receivers might run based on the coverage they see. It's not so much akin to quantum physics as it is something more practical, like becoming at least conversational in a foreign language. In a week.\" Normally, when you go into a game week, you already have a pretty good grasp of what you're doing offensively, \"Bradford said.\" You spend a lot of time studying the opponent and what they're doing on defense. It's been a little more difficult than it normally is, because as much as I'm trying to study Tennessee, I'm probably studying even more of our playbook, making sure I'm comfortable with what we're doing offensively. \""}, {"articleID": "2019031818_00825216_W", "names": {"David Brophy": ["Q29376699", "Q5231793"], "Jack Turner": ["Q20131307", "Q3805671", "Q3805672", "Q42887655", "Q6115549", "Q6115550", "Q6115552"]}, "date": "2019-03-18", "url": "https://www.worldboxingnews.net/2019/03/18/kieran-smith-pushing-top-15-world-ranking/", "content": "Kieran Smith pushing for Top 15 World Ranking RINGSIDE 18/03/2019 Kieran Smith has set his sights on breaking into the top 15 world rankings once he's made his return to the ring at the Emirates Arena on Friday. Unbeaten Smith (13-0) is back in action on a packed card in Glasgow as #MTKFightNight return to Scotland live on iFL TV. He already holds the WBC International Silver title, and he would love to add the full version of the belt to his collection to earn himself a top 15 ranking with the WBC. Smith said: \"I want to keep pushing up the WBC rankings and hopefully fight for the WBC International belt next. That will put me in the top 15 of the rankings.\" It's good to be getting back in the ring. Since I signed up with MTK Global and teamed up with Danny Vaughan last year, I was promised to be kept busy and they came through with that. I had three fights in three months which was great. \"I picked up the WBC International Silver belt as well which was the icing on the cake for the end of the year, and it's now setting me up for a good 2019.\" It's a packed card live on iFL TV in Glasgow on Friday, also featuring Iain Butcher challenging Scott Allan for the Celtic bantamweight title. The undercard is full of talented stars too, including <mark>David Brophy</mark>, Michael McGurk, Lewis Benson, Reece McFadden, <mark>Jack Turner</mark> and many more."}, {"articleID": "2010121502_00191924_W", "names": {"Joseph Campbell": ["Q17388234", "Q6281966"]}, "date": "2010-12-15", "url": "http://mimmp.wordpress.com/2010/12/14/truth-chutzpah-and-joseph-campbell/", "content": "pastel by 81-year-old lew silvers. <mark>joseph campbell</mark> were water cooler conversation? it was 1988 and we all wanted to \"follow our bliss'. we wanted to\" make our heart sing'. and it sounded easy enough to do. so? how'd that work out for you? trying to follow our bliss is a little bit like trying to grab smoke. the more we struggle, the more elusive it becomes. twenty-two years later and i'm beginning to realize that while bliss is nice, it shouldn't be the goal. these days, i'm inclined to believe bliss is the reward for a living my truth. these days, it's chutzpah that makes my heart sing. last night i was organizing a few computer files and i stumbled upon a blog post i wrote three years ago. the mimm back than has managed to encourage this mimm. and so i'm posting the essay again. yes, i'm one of them. i'm one of those people who want to write a book. we're a dime a dozen. we fill cyberspace, bookstores, writing clinics, and book clubs. and how many of us will actually make it past verbally expressing our deepest secret: \"i want to write a book.\" i imagine, very few. i'm thinking about this because i'm sitting in a public space. i'm people watching in between paragraphs. a few moments ago one of my yoga students happened by and asked what i was up to. i explained the blog, and the daily entry i promised my life coach and myself. i explained, too, how i hoped to move out of body therapy over the next few years to focus on writing. she then proceeded to tell me the amazing story of her friend who decided that most children's books were rubbish and that she would write her own. rather than stopping there, she actually did it. she wrote the book, she found an illustrator and then she hooked up with an agent! the book hasn't been published, but i don't doubt for a moment that it will be. chutzpah. the woman has chutzpah. and we all know a little chutzpah goes a long way to realizing a dream. when an idea makes our heart sing, why do we try to stop the music? if i invested as much time trying to achieve my goals as i do telling myself why they're impossible, think of how much closer i'd be to having them become living, breathing reality. my yoga student's friend decided to write a book, and from the moment she made that decision, the book existed. i can decide, right now, this moment, to have not just her chutzpah, but her conviction and clarity of vision. so what's stopping me? like be the first to like this post. i love yoga. and i love to write. after that my passion for these disciplines is such that i find it hard to put in words. there are joyous moments in teaching when \"it' happens. a student has a shift in perspective, moves deeper into her body, feels a new flow of energy. there are rare moments in writing when the characters take over and the words flow. i live for those moments. growing up in rural pennsylvania i would have never predicted this life. my friends and i guessed, as young girls in the early' 70? s, that there would be husbands, some kids, split level homes and probably a few shaggy dogs. i watched kim and barbara, becky and patty move into their dream lives. and i tried to move into mine. but after college and a very brief marriage i decided i had some things to get out of my system first. i could settle down later - the type of life my friends settled into so easily would still be waiting for me after i had a little adventure. many years and adventures later - including ten years in donegal, ireland - i have to admit that the choices i made, the path i carved with the tools i was given, has meant the\" happy family' will have to wait until my next life. maybe. 4 days ago sarah palin's latest hollywood feud - yahoo! news 5 days ago file under \"bring your instrument, don't play it\" . there's a new version of john cage's' 4:31' featuring billy bragg. i love billy bragg."}, {"articleID": "2018101307_00163290_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Kim Jong Un": ["Q14045951", "Q56226"], "Brian Fallon": ["Q2503485", "Q27656993", "Q4963711"]}, "date": "2018-10-13", "url": "https://www.krmg.com/news/national-govt--politics/trump-expected-meet-american-pastor-released-turkey/9oSrDohXIlL3WESZC1aCNJ/", "content": "<mark>Trump</mark> expected to meet American pastor released by Turkey Photo Credit: AP Photo/Emre Tazegul Pastor Andrew Brunson, center, and U.S. Charge d'Affaires Jeffrey Hovenier, left, arrive at Adnan Menderes airport for a flight to Germany after his release following his trial in Izmir, Turkey, Friday, Oct. 12, 2018, A Turkish court on Friday convicted an American pastor of terror charges but released him from house arrest and allowed him to leave Turkey, in a move that is likely to ease tensions between Turkey and the United. (AP Photo/Emre Tazegul) <mark>Trump</mark> expected to meet American pastor released by Turkey October 13 2018 1:28 AM Updated: October 13 2018 1:27 AM Photo Credit: AP Photo/Emre Tazegul WASHINGTON - An American pastor freed after nearly two years of detention in Turkey is expected to meet President <mark>Donald Trump</mark> at the White House on Saturday. The release of Andrew Brunson was a diplomatic triumph for <mark>Trump</mark>, who is counting on the support of evangelical Christians for Republican candidates in the November election. Thousands of <mark>Trump</mark>'s supporters cheered Friday night when he informed them that Brunson was once again a free man. \"I'm really proud to report that earlier today we secured the release of pastor Andrew Brunson from Turkey,\" <mark>Trump</mark> said at a campaign rally in Ohio. \"He is now free from jail and he is in the air heading to Germany, where he'll get offered a brief check and I think he's going to be in great shape. And then he's coming to Washington, D.C., tomorrow and we'll say hello to him.\" Brunson, a North Carolina native, was due to arrive at Joint Base Andrews near Washington around noon. \"He went through a lot but he's on his way back,\" added <mark>Trump</mark>, who had pressured the government of Turkey, a U.S. ally, to release Brunson. <mark>Trump</mark> also used the outcome to remind the audience of other detained Americans who regained their freedom under his leadership. They include three Americans released this year by North Korea before <mark>Trump</mark>'s historic meeting with North Korean leader <mark>Kim Jong Un</mark>, and an Egyptian-American charity worker freed by Egypt in 2017. \"We bring a lot of people back and that's good,\" <mark>Trump</mark> said. A Turkish court on Friday convicted Brunson of having links to terrorism and sentenced him to just over three years in prison, but released the 50-year-old evangelical pastor because he had already spent nearly two years in detention. An earlier charge of espionage was dropped. Hours later, Brunson was flown out of Turkey, his home for more than two decades. He was being taken to a U.S. military hospital in Landstuhl, Germany, for a medical check-up before the trip to Washington and Saturday's meeting with <mark>Trump</mark>. \"I love Jesus. I love Turkey,\" an emotional Brunson, who had maintained his innocence, told the court at Friday's hearing. He tearfully hugged his wife, Norine Lyn. Burson's release could benefit Turkey by allowing the government to focus on an escalating diplomatic crisis over Jamal Khashoggi, a Saudi contributor to The Washington Post who has been missing for more than a week and is feared dead after entering the Saudi consulate in Istanbul. Turkish officials suspect Khashoggi, a critic of the Saudi government, was killed in the consulate; Saudi officials deny it. Turkey may also hope the U.S. will now lift tariffs on Turkish steel and aluminum imports, a move that would inject confidence into an economy rattled by high inflation and foreign currency debt. But Brunson's release doesn't resolve disagreements over U.S. support for Kurdish fighters in Syria, as well as a plan by Turkey to buy Russian missiles. Turkey is also frustrated by the refusal of the U.S. to extradite Fethullah Gulen, a Pennsylvania-based Muslim cleric accused by Turkey of engineering a 2016 coup attempt. Brunson was accused of committing crimes on behalf of Gulen and Kurdish militants who have been fighting the Turkish state for decades. He faced up to 35 years in jail if convicted of all the charges against him. The pastor, who is originally from Black Mountain, North Carolina, and led a small congregation in the Izmir Resurrection Church, was imprisoned for nearly two years after being detained in October 2016. He was formally arrested that December and placed under house arrest on July 25 for health reasons. Turkish President Recep Tayyip Erdogan had resisted U.S. demands for Brunson's release, insisting that the courts are independent. But he had suggested a possible swap involving Brunson and Gulen, who has denied organizing the coup attempt. ___ Follow Darlene Supervile on Twitter: http: //www.twitter.com/dsupervilleap Read More VIEW COMMENTS Melania Trump says she ignores rumors of <mark>Trump</mark>'s infidelity Melania Trump says she loves President <mark>Donald Trump</mark> and has \"much more important things to think about\" than allegations he cheated on her. Mrs. <mark>Trump</mark> says she's \"a mother and a first lady\" and media outlets \"speculate\" about her marriage and \"circulate the gossip.\" She says allegations of her husband's infidelities are not a \"concern and focus.\" Porn star Stormy Daniels says she had sex with <mark>Donald Trump</mark> years ago. The president has denied a tryst with Daniels but has acknowledged reimbursing his lawyer for a hush money payment made to her. Mrs. <mark>Trump</mark> has generally stayed quiet on the subject. Asked if she loves her husband, she says, \"Yes, we are fine. Yes.\" Mrs. <mark>Trump</mark> was interviewed on her Africa trip by ABC, which aired portions Friday on \"Good Morning America.\" Hershey's mixes two favorites in new candy bar It is a match made in candy heaven .>> Read more trending news The Hershey Company is debuting a new candy bar that combines the company's signature chocolate bar with Reese's Pieces, and has found the perfect couple to celebrate the union, WHTM reported. Hershey's invited Craig Hirschey and Jenny Ries for a photo shoot at the company's headquarters in Hershey, Pennsylvania, the television station reported. The couple got engaged this year and will be married in February. Undoubtedly, this couple has shared some kisses during their four-year courtship, and Hershey will document that love in its marketing campaign, WHTM reported. The new candy bar will hit stores in November. With deal on judges, Senate goes home for the elections Less than a week after ending a bruising partisan fight over the confirmation of Supreme Court nominee Brett Kavanaugh, the U.S. Senate joined the House in heading home for the November mid-term elections, as Democrats and Republicans agreed to allow approval of a package of GOP nominations, freeing those Senators who are up for re-election to return home to campaign. The House left town two weeks ago; both chambers will return for their next votes on November 13, a week after Election Day. Democrats cut the deal despite a lot of grumbling from their own side, as many more liberal activists wanted the Senate to stay in session, and have Democrats force votes and debates over any judicial nominee by President <mark>Trump</mark>. 15 judges were approved in the deal, which included three nominees to federal appeals courts, and a dozen federal district judges. While Democrats have forced Republicans to use extra debate time repeatedly on nominations, GOP leaders have been relentless in using time on the Senate floor for judicial picks by President <mark>Trump</mark> in 2017 and 2018, confirming 84 judges to all levels of the judiciary. And with the rules changes in the Senate--spearheaded by Democrats back in 2012--which eliminated the use of the 60 vote filibuster against judicial nominees, there isn't much Democrats can do to stop those <mark>Trump</mark> nominations, unless Republicans refuse to support the choices. \"<mark>Trump</mark> and McConnell are confirming conservative judges at a breakneck pace in what's sure to be <mark>Trump</mark>'s most enduring legacy,\" said <mark>Brian Fallon</mark>, who worked for Hillary Clinton and the Obama Justice Department, and has tried to spur Democrats to fight harder to block President <mark>Trump</mark>'s nominees. \"Senate Must Stop Rubberstamping of <mark>Trump</mark>'s Takeover of Federal Courts,\" boomed a press release by the Leadership Conference on Civil and Human Rights, as liberal groups denounced the deal. But without any votes from Republicans--Democrats are powerless to stop the GOP from confirming judges. Their best weapon is to simply win a majority in the Senate in the upcoming election. The Senate has confirmed President <mark>Trump</mark>'s judicial nominees at a historic pace--84 total, including Brett Kavanaugh and Neil Gorsuch to the Supreme Court, 29 circuit judges, and 53 district court judges .--Leader McConnell (@ senatemajldr) October 11, 2018 A number of other nominations by the President were also approved late Thursday, including a series of ambassadors. As GOP Senators crowed about their record number of judicial confirmations, they also took aim at Democrats on the way out of town. \"Senate Democrats must want to get out of Washington to campaign,\" said Sen. John Cornyn (R-TX). One note--while the House and Senate will not conduct any legislative business until after the elections, but Congress is not officially in \"recess'--so, President <mark>Trump</mark> will not be able to make any recess appointments. Driver ed teacher rear-ends car while drunk A Long Island driver education teacher rear-ended a car while drunk, then drove off, without his students, police said. Russell Cohen, 58, was instructing four students from Suffolk Auto Driving School Saturday when they began to suspect he was inebriated .>> Read more trending news Cohen was asked at 11 a.m. to stop at a McDonald's, where the students got out and called 911. Cohen then drove off and hit a car. The victim was treated for non-life-threatening injuries, police said. Cohen was arrested and charged with aggravated driving while intoxicated and endangering the welfare of a child. The Associated Press contributed to this report. Police release photo of suspected serial robber Owasso Deputy Chief of Police Jason Woodruff says the investigation of a robbery at a Check N Go last week led them to two other similar cases. The Check Into Cash in Broken Arrow was robbed October 1st. The Muskogee store was robbed in September. Police are asking anyone with information on any of the cases to come forward. Investigators from all three Green Country cities are now working together to identify the suspect. Police are hoping that someone will recognize him in the surveillance picture and call police. The suspect did have a gun and should be considered armed and dangerous. Anyone with any information is asked to contact the Owasso Police Department at 918-272-COPS. Callers can remain anonymous."}, {"articleID": "2019100412_00231947_W", "names": {"Jill Scott": ["Q10896", "Q232592", "Q23661775"]}, "date": "2019-10-04", "url": "http://www.hartlepoolmail.co.uk/sport/football/middlesbrough-fc/ex-sunderland-star-jill-scott-ready-north-east-homecoming-lionesses-head-middlesbrough-643334", "content": "Sport Football Middlesbrough FC Ex-Sunderland star <mark>Jill Scott</mark> ready for North East homecoming as Lionesses head to Middlesbrough England midfielder <mark>Jill Scott</mark> is itching to welcome Brazil's Latin flair to the north east after returning to the squad following her post-World Cup recovery. By Mail Reporter Friday, 4th October 2019, 13:20 pm Updated Friday, 4th October 2019, 13:20 pm <mark>Jill Scott</mark> The 32-year-old Manchester City star has regained her place in Phil Neville's squad for the upcoming friendlies against Brazil and Portugal having been left out of the last camp. In her absence the Lionesses came away with results of a different ilk to their usual standards. First a two-goal lead slipped away in a 3-3 draw with Belgium before a 2-1 defeat at the hands of Norway--who England beat in the quarter-finals just two months prior. Neville's side will face the Brazilians at the Riverside Stadium on Saturday--just a stone's throw away from where <mark>Scott</mark> grew up in Sunderland--with almost 30,000 fans expected to show their support. Sign up to our daily newsletter The i newsletter cut through the noise Thanks, {{email}} has been added to our newsletter. If this is the first time you have subscribed to emails from JPIMedia Ltd, the publishers of Hartlepool Mail, please check your inbox to verify your email address. Sorry, there seem to be some issues. Please try again later. Submitting...The female canaries will arrive in the north east with Pia Sundhage at the helm having appointed the Swede, who has reached the last three Olympic gold medal matches, after the World Cup. But <mark>Scott</mark> expects to welcome the same Brazil that fans know and love to see. \"Over the years Brazil has just been one of those teams that you can never write off,\" she said. \"They have got some experienced players and some good young players but most importantly they have got players that can create something out of nothing.\" For someone like Marta--she just needs an instant and she can change the game. \"I am sure that whatever coach they have in charge they will try and keep a lot of the ball because that is the Brazilian philosophy.\" Being from the north east myself I can guess that it will probably be a rainy day so maybe that will suit us well but either way we are going to have to be on our game. \"There have been a lot of tickets sold so that is great for us and I know how influential the north-east supporters were during my early years as an England player.\" Their love for the game filtered down to me from a young age and it will be great to go up there and show them what we can do - plus it means more of my family can come too. \"<mark>Scott</mark> is joined in the squad by World Cup stars Alex Greenwood and Fran Kirby, who also missed out on the previous camp. Fellow midfielder Jordan Nobbs is also back in action, making her international return after almost a year away with a knee injury. Competition for places in Neville's midfield has been hotly-contested since the former Manchester United man took charge. That looks set to intensify after Nobbs' return and right-back Lucy Bronze proving she can hold her own further up the field. And <mark>Scott</mark> is confident there is a healthy level of competition running right through the current squad.\" Our midfield has always been a very difficult place to break into because of the quality of the players that we have, \"she added.\" Each player brings something uniquely different to the squad and I am delighted that we have got Jordan [Nobbs] back with us too now. \"A player like her is always going to be missed when she is not in the squad - she has got a bit of everything and can score from 30-yards too - so we will benefit greatly from that.\" But the competition up and down the squad in so fierce at the moment and all the players know how hard they are going to have to work if they want to keep playing for England. \"Tickets for England Women v Germany at Wembley Stadium on Saturday, November 9 (ko 5.30 pm), priced only £ 1 under-16s and £ 15 adults, are on sale now at www.TheFA.com/Tickets Sign up for the newsletter Keep up with the latest news and views from Hartlepool Mail Sign Up Most Popular {{index}}. {{title}} Most Popular {{index}}. {{title}}"}, {"articleID": "2011020104_00008511_W", "names": {"John Barry": ["Q111074", "Q58708390", "Q6220901", "Q6220906", "Q6220908"], "James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"]}, "date": "2011-02-01", "url": "http://abc.net.au/news/stories/2011/02/01/3126975.htm?site=&source=rss", "content": "email funds snub closes mental health \"carers hub' a service for mental health carers in cairns has closed after requests for a new round of funding were rejected. the mental health fellowship of north queensland found out late last week the federal government had cut its carers hub funding. the state member for mulgrave, curtis pitt, says it is disappointing and he will continue to fight for federal funding for the service, which he says is vital.\" but in the meantime i'll be asking the state government to give serious consideration to provide some bridging funding to keep this service going and to build a strong case for ongoing federal funding, \"he said.\" i want to be clear that i think the ongoing funding for this service needs to come from the federal government and it's on that basis i'll be making the pitch to the state government. egypt's army has vowed not to use force against protesters ahead of a mass demonstration in cairo's tahrir square. the afghan government has rejected reports that failed asylum seekers will be deported to afghanistan under a new agreement with australia. a basketball fan has escaped serious injury after accidently launching head-first through the hoop during half-time trampoline dunking. japan's mount shinmoe is spewing rocks and lava kilometres into the sky, forcing more than 600 people to leave their homes. if you or someone you know is thinking about suicide, call lifeline on 13 11 14 an entertainer escapes serious injury after launching himself through a basketball hoop. view north queensland's preparations for cyclone yasi through the eyes of social media. oscar winner <mark>john barry</mark>, famous for his work on the <mark>james bond</mark> films, dies in new york aged 77. this service may include material from agence france-presse (afp), aptn, reuters, aap, cnn and the bbc world service which is copyright and cannot be reproduced."}, {"articleID": "2011060219_00001782_W", "names": {"David Douglas": ["Q18205830", "Q23035477", "Q29178119", "Q40477116", "Q42387616", "Q5233047", "Q5233048", "Q5233049", "Q5233050"]}, "date": "2011-06-02", "url": "http://oregonlive.com/portland/index.ssf/2011/06/harrison_park_school_teacher_c.html", "content": "div> view full size pdx summer school tim schulze works with students last summer in a program that eventually became pdx summer school, a program that offers individualized tutoring to low-income, esl students at harrison park school. for most students, summer is a time of fun and relaxation away from school, but for others, summer can be a time to fall behind. that's especially true for students in low-income, non-english-speaking households, who might not only forget their multiplication tables but also the language that's key to learning everything else. it's a problem that tim schulze, a fifth-grade teacher at harrison park school, hopes to address with his newly formed nonprofit, pdx summer school, a monthlong tutoring program for low-income esl students. at a recent fundraiser, schulze raised more than $1,500 for the program, in addition to a equity foundation grant. \"these kids, because they're learning two languages, have a lot of work to do,\" he said, adding that problems learning english can affect all elements of learning. \"it becomes that they feel that they can't succeed at school.\" the program, which will run alongside the school's summer programs, will provide individualized tutoring to 32 esl students nominated by teachers for extra help over the summer. the students will get a chance to work on learning english along with other basic subjects, with the goal of building their confidence. \"so many of these kids are beaten down, they're told,\" nope,' they don't pass, \"he said.\" we want to give these kids not only an academic boost, but also a self-esteem and confidence boost. \"the program was born out of schulze's experience at mill park elementary school in the <mark>david douglas</mark> school district. as a long-term substitute there, he saw students leave for summer performing at grade level, only to return in the fall far behind their peers. last summer, he tutored three students and said he saw great results. not only were the youngsters staying caught up with their education, he said, but it was also a chance for them to get out and stay excited about learning.\" that's what pdx summer school is about, \"schulze said.\" to give them that confidence boost going into the fall. \"pdx summer school is looking for four teachers to tutor groups of students during the july session. they're also hunting for donations to expand the program to include more children at different schools."}]