[{"articleID": "2011081108_00048285_W", "names": {"Nick Hill": ["Q55052343", "Q7027303", "Q7027305"]}, "date": "2011-08-11", "url": "http://lansingstatejournal.com/article/20110811/GW01/108110320/MSU-football-Running-back-battle-fierce-friendly?odyssey=tab|topnews|text|FRONTPAGE", "content": "msu women's basketball: former spartan dehaan to play volleyball at grand valley state msu football: running back battle fierce, but friendly zoom sophomore le \"veon bell is full strength after enduring late-season injuries in 2010. / lansing state journal file photo the bbc here's a look at the career stats for msu running backs edwin baker, le\" veon bell and larry caper: games att-yds avg. td baker 21 292-1,628 5.6 14 east lansing - sorry, fans, but the next episode of \"spartandawg tv\" likely won't happen until after the 2011 football season. by then, larry caper and le \"veon bell will have decided a fierce battle for carries that accelerates today when michigan state camp goes full pads for the first time. no matter the result, they'll be right next to each other in front of a webcam, talking sports and pet peeves and laughing it up for the youtube\" show \"they devised in may. and they'll still be tight with edwin baker. these are three starting-quality players at what is arguably msu's most stacked position, but that apparently hasn't caused a strain .\" at the end of the day, we all want to win, \"said bell, a sophomore who along with caper is chasing baker, even though coach mark dantonio said he views them as\" three no. 1 running backs. \"\"there can become animosity and that type of thing,\" msu running backs coach brad salem said of situations like this. \"the thing is, they're very good people. and they understand the concept of team .\" hey, they all want 30, 35 carries and they should. they're competitive, they're running backs, they want the ball in their hands when the game's on the line. but that's what's making us better. in game 12 (last season) we had three healthy running backs. in a sense, guys take shots off each other because they don't have to carry it 30 times a game, four games in a row. could they? absolutely. \"some would say baker should get that kind of work, after a breakout sophomore season in 2010 that earned him all-big ten first team honors. he carried 207 times (16 times per game) for 1,201 yards and 13 touchdowns, averaging 5.8 yards a carry .\" when you look at edwin and his ability to explode and all the sudden hit a big home run for you, that's rare in today's college football, to see guys run the length of the field like he's done on a number of occasions, \"msu first-year offensive coordinator dan roushar said of the 5-foot-9, 210-pound baker. but that's not all there is to this. caper (5-11, 223) and bell (6-2, 237) are bigger and better in some areas .\" you have in larry and le \"veon guys that have tremendous ball skills, tremendous football iqs,\" roushar said. \"they can pick up blitzes from the other side. they do some things that, if you're not aware of it, it's happening and as coaches we see it. and it's like,\" wow, this is tremendous .' so they've got great competition. \"one year ago, caper was the no. 1 back after leading msu in rushing as a freshman in 2009. but he broke his hand in camp, missed the first two games, watched as baker and bell started the season on fire, and ended up with just 38 carries for 144 yards .\" you learn from everything, if it's a peak or a valley, \"said caper, who lives with baker .\" i had a valley last year. and i learned from it. as a man i learned from it. as a player i learned from it, and i'm a better individual for it. \"and he's 100 percent healthy. so is bell, after hurting both shoulders during the season and keeping quiet about it until after the season. it certainly affected his play. he had 549 rushing yards and eight touchdowns in the first six games - then just 56 yards with no scores in the final seven games. the seventh game, a win over illinois, saw bell hurt his left shoulder on an awkward fall to the ground. caper and bell look fit and explosive in camp, and talented redshirt freshman <mark>nick hill</mark> is now in the mix as well. but the reality of the situation is that baker is one of the big ten's most proven backs and the opportunities behind him may be limited. msu football: get to know new spartan snapper moore, then forget him candlelight march in memory of lansing teen killed by police planned for this evening lansing man says he's being targeted for protesting police shooting of teen subjects flee traffic stop, cause crash & highway closure candlelight march in memory of lansing teen killed by police planned for this evening lansing man says he's being targeted for protesting police shooting of teen"}, {"articleID": "2019051619_00241200_W", "names": {"Ben Clark": ["Q48837098", "Q4885430", "Q4885431", "Q4885432", "Q5725428", "Q57443767"]}, "date": "2019-05-16", "url": "https://vtdigger.org/2019/05/16/manufacturers-new-china-tariffs-cost-paid-state/", "content": "Share Tweet Share Email 0 Shares The St. Albans headquarters of customs broker A.N. Deringer. Supplied photo A s the U.S. trade dispute with China intensifies, A.N. Deringer in St. Albans, a customs broker, is working closely with its customers on strategies for adapting and surviving. \"We spend a lot of time talking with clients about how they can change their valuation, or in some cases manufacture their product differently, because there's a long list of goods that are subject to the tariffs,\" said CEO Jake Holzscheiter, who estimated existing and expected tariffs will cost the company's clients $500,000 in the coming year. Get all of VTDigger's daily news. You'll never miss a story with our daily headlines in your inbox. Daily Sundays only (Weekly Wrap) Email me stories on these subjects...Business News Courts & Corrections News Education News Energy News Environment News Health Care News People & Places News Politics News Special Topics Final Reading (Evenings) Sanders 2020 News Podcasts & Media \"Some have moved their manufacturing to a country like Vietnam that we're not having a trade war with,\" he said. \"But not everyone has that luxury. If it's a raw material it's easier to change suppliers .\" Businesses of all types have been drawn into the trade battle between the world's two largest economies. The Trump administration has announced plans to put a tax on almost everything that is imported to the U.S. from China. Manufacturing makes up about 9 percent of Vermont's economy, so tariffs on goods have a direct impact on many Vermont employers. One is Ann <mark>Clark</mark> cookie cutters, which employs 50 people in Rutland. President <mark>Ben Clark</mark> said he expects higher steel prices to cost the company about $32,000 over the next year. Chroma Technology, a Bellows Falls company that makes microscope filters, is helping its Chinese customers pay the extra costs of importing Chroma filters. About 15 percent of Chroma's business is in China, said CEO Paul Millman, who on Tuesday relayed an email from Chroma's general manager in China. \"She says,\" Unfortunately this morning Mr. Trump published a note on his Twitter to increase 25 percent on China goods, which increased panic among our customers, \"' said Millman, who was on a sales trip to Israel at the time .\" We're trying to help them so they don't leave us and go to filter companies that are in countries that don't impose tariffs and aren't engaged in a trade war, \"said Millman. VTDigger's business coverage is underwritten by:\" I don't know that this guy has any understanding of the effect of what he is doing, \"he said of Trump. Some of the company owners and managers who are struggling to cope with the tariffs said they see themselves in unaccustomed agreement with President Trump on the need for taking a hard line with China. But they don't see tariffs as a way to improve the relationship .\" I'm not a fan of Trump at all; I dislike this administration like most people in Vermont do, \"said Wolfgang Hokenmaier, who started Green Mountain Semiconductor in 2014 with two partners. The Burlington company now employs 25 people and has important customers in China. Wolfgang Hokenmaier of Green Mountain Semiconductor. Supplied photo\" But it's a double-edged sword, \"Hokenmaeir said .\" I also do see how the Chinese government is actively trying to secure intellectual property from the U.S. \"This is not something that tariffs will help,\" added Hokenmaeir. \"I think the U.S. government should look more into how does China procure our intellectual property and then eventually become a dominant force in technology .\" With some of the politicians who usually oppose Trump showing support for the tariffs, Trump might feel emboldened to keep them in place for a long time, said Holzscheiter. \"I felt a few weeks ago that this was really going to start to go away, and was going to improve, and I feel like it's escalating now,\" he said. \"We are seeing some of the leaders of the Democratic Party are also supporting Trump in this. The more he feels that support from the other side of the aisle, the stronger he's going to be on this .\" China is an important trading partner for the U.S. and for Vermont. The Office of the U.S. Trade Representative said Vermont exported $1.3 billion in goods to Canada, its largest trading partner, in 2018--about 43 percent of its total goods exports. Canada was followed by Hong Kong, with $262 million in exports; Taiwan, with $195 million; South Korea, with $186 million; and China, with $168 million, the office said. A group called the U.S. China Business Council said Vermont's largest areas of export were semiconductors and components; navigational and measuring instruments; dairy products; sawmill and wood products; and manufactured commodities. China was Vermont's third-largest export market for manufactured goods in 2017, after Canada and Hong Kong, according to the Center for Manufacturing Research. Forbes reported that Vermont is the only state where total trade with China has fallen, due to a 4.5% drop in imports in August. Nonetheless, state officials don't seem alarmed by the idea of a prolonged trade impasse. Tim Tierney, director of recruitment and international trade at the Vermont Agency of Commerce and Community Development, said he hadn't heard much discussion about trade restrictions. \"A lot of these have not taken effect and so the impact right now hasn't been felt,\" he said. The issue also affects Vermont's growing cannabis industry, where new laboratories are gearing up to process hemp into CBD. \"We've already spoken to instrumentation companies\" about the tariffs, said Carl Christianson, who recently started Northeast Processors in Brattleboro. Christianson said the company has eight employees and expects to process 400,000 pounds of dried hemp in the coming year. Noah Quist (left) and Carl Christianson (right) prepare CBD products for a photo shoot in their Brattleboro offices at Northeast Processing. Photo by Anne Wallace Allen/VTDigger \"We have had people say,\" order now or it's going to go up by 25% in the next couple of weeks,' \"said Christianson .\" We're talking about instruments that cost hundreds of thousands of dollars, so 25% is pretty substantial. \"It's not even that the new company is buying its instruments from China, Christianson added .\" They're manufactured in America, but the global economy is so intimately tied together that source material comes from all over the world and there are these unintended consequences that affect small business owners, \"he said. Share Tweet Share Email 0 Shares Want to stay on top of the latest business news? Sign up here to get a weekly email on all of VTDigger's reporting on local companies and economic trends. And check out our new Business section here. Daily Sundays only (Weekly Wrap) Email me stories on these subjects...Business News Criminal Justice Education News Environment News Health Care News Politics News Special Topics Final Reading (Evenings) Sanders 2020 News Podcasts & Media Filed under: Business & Economy Tags: A.N. Deringer, <mark>Ben Clark</mark>, Carl Christianson, Chroma Technology, Green Mountain Semiconductor, hemp, Jake Holzscheiter, Northeast Processors, Paul Tillman, Tim Tierney, Vermont Agency of Commerce and Community Development, Wolfgang Hokenmaier"}, {"articleID": "2012121916_00047088_W", "names": {"Mike Mitchell": ["Q12036879", "Q16186790", "Q2507259", "Q2731961", "Q27824373", "Q29788035", "Q3313462", "Q3857426", "Q6848052", "Q6848057", "Q6848058"]}, "date": "2012-12-19", "url": "http://pymnts.com/news/businesswire-feed/2012/december/19/bottomline-technologies-named-a-lsquo-best-company-to-work-for-rsquo--20121219006054", "content": "wall street webcasting presents wells fargo securities: the 2012 asset performance scorecard a.m. best assigns ratings to mapfre global risks, compania internacional de seguros y reaseguros s.a. <mark>mike mitchell</mark> joins profitect as director of global professional services share bottomline technologies (nasdaq: epay) today announced that it has been recognized for the fifth year in a row as a \"best company to work for\". this annual competition sponsored by business nh magazine recognizes companies that demonstrate a commitment to their employees' professional growth and personal well-being through innovative workplace programs, company culture and benefits. in this year's competition, bottomline was recognized as one of the three best large company employers. \"we congratulate bottomline as one of the top employers once again this year. the company consistently demonstrates excellence it is workplace practices. a key element in the success of its business is its motivated and talented team,\" said matthew mowry, editor of business nh magazine. a company culture focused on achieving customer success through collaboration, communication and dedication to the company's guiding principle of working \"with and for each other\" set bottomline apart during the judging process. bottomline's innovative employee recognition programs and commitment to local communities were also factors in its selection. \"we are honored to be recognized again this year as a\" best company to work for,' \"said rob eberle, president and ceo of bottomline technologies .\" this award is a recognition of our outstanding team of employees. our people are the reason bottomline is such an extraordinary place to work and the driving force behind our business success. \"bottomline, which has offices around the world, has also received similar accolades for its international locations, including its selection as a 2012 national business awards employer of the year finalist and as a 2012\" best company to work for \"by the united kingdom's thames valley business magazine. for more information on career opportunities with bottomline, please visit bottomline technologies (nasdaq: epay) provides collaborative payment, invoice and document automation solutions to corporations, financial institutions and banks around the world. the company's solutions are used to streamline, automate and manage processes involving payments, invoicing, global cash management, supply chain finance and transactional documents. organizations trust these solutions to meet their needs for cost reduction, competitive differentiation and optimization of working capital. headquartered in the united states, bottomline also maintains offices in europe and asia-pacific. for more information, visit www.bottomline.com. bottomline technologies and the bottomline technologies logo are trademarks of bottomline technologies (de), inc. which may be registered in certain jurisdictions. all other brand/product names may be trademarks of their respective owners. this press release may contain\" forward-looking statements \"within the meaning of the private securities litigation reform act of 1995. online vs. in-store shopping trends: what drives consumer choice"}, {"articleID": "2013051017_00033202_W", "names": {"Rick Harrison": ["Q27994413", "Q7331444"]}, "date": "2013-05-10", "url": "http://readingeagle.com/article.aspx?id=476318", "content": "After watching his ace hit three batters in one inning, Nick Evangelista quickly trotted out to the mound. Hamburg's coach had no interest in removing Joey Cominsky. It was just time for a talk. \"I told him he needed to stay even-keeled and keep his composure,\" Evangelista said. \"He was in control of the game at that point. He needed to finish strong .\" Cominsky responded by fighting through two tough jams and helping sixth-seeded Hamburg edge No. 3 Conrad Weiser 4-3 in the Berks Baseball League quarterfinals at George Field Thursday. Hamburg (16-5) advanced to face Oley Valley (17-3) in Monday's semis. Second-seeded Oley defeated No. 7 Twin Valley 1-0 in the other quarterfinal here. Cominsky held a 4-1 lead in the fifth inning when he mysteriously lost his control. The right-hander drilled John Helwig, Connor Tom and Zach Reis to load the bases for Conrad Weiser (13-7). Once Cole Weinhold's seeing-eye single scored two runs to cut the deficit to 4-3, Cominsky was in trouble. \"I just battled through it,\" he said. \"That's what I've been taught to do since I was young. Don't give up. That's pretty much it .\" Cominsky escaped the fifth without further damage and maneuvered through a two-on, two-out jam in the sixth to preserve the victory. Cominsky homered and Trevor Roberts and Ryan Atkinson hit RBI doubles to lead Hamburg's offense. It was the first game for Conrad Weiser since athletic director Russ Kline suffered a heart attack following Monday's regular season finale. Players planned to pay tribute to Kline, who is recovering in Reading Hospital, by wearing his initials on their caps. Oley Valley coach <mark>Rick Harrison</mark> didn't have the luxury of relying on one pitcher Thursday. Lynx ace Nick Distasio struggled with his control while dealing with cramps in his forearm. That forced <mark>Harrison</mark> to turn starter Garrett Pelko into a closer for a day. Distasio went 42/3 innings and Pelko handled the final 21/3 for Oley. The duo combined for a two-hit shutout and 12 strikeouts. Distasio walked six and was removed with a runner on first in the fifth inning. Pelko retired six of the eight batters he faced, five via strikeouts. The lefty kept getting Twin Valley to chase high fastballs, including a strikeout of Jon Abbadusky with runners on first and second to end it. \"A lot of their bigger hitters are more eager,\" Pelko said. \"I was trying to use that to my advantage. I wanted to work with my breaking stuff low and heat them up top. That was my game plan .\" Oley scored the lone run on a throwing error in the second. Craig Eidle advanced from second to third on a groundout to shortstop. First baseman Cooper Jones tried to get Eidle but the throw skipped past third baseman Alex Alexy. Twin Valley (11-10) couldn't turn the walks into a run. The Raiders had three baserunners caught stealing. \"Those are good pitchers,\" Twin Valley coach Matt Royer said of Distasio and Pelko. \"That's why we ran and were going to keep on running if we got the right guys on. We knew we weren't going to string four hits in a row .\" Oley advanced despite its pitchers issuing seven walks and its offense producing three hits. It was by no means a pretty performance. \"Sometimes,\" <mark>Harrison</mark> said, \"this time of year you have to learn how to win games like that .\" ? 2013 Reading Eagle Company, All Rights Reserved - Serving the Berks County community and surrounding areas for over 140 years! These links are not endorsements of any products or services in such sites, ites,"}, {"articleID": "2009121808_00095922_W", "names": {"Carlos Rivera": ["Q11295213", "Q18157684", "Q26258779", "Q47495345", "Q5042558", "Q5042560", "Q940356"]}, "date": "2009-12-18", "url": "http://herald-zeitung.com/wire.lasso?report=/dynamic/stories/U/US_FARM_SCENE_VETERAN_FARMERS&-session=HeraldZeitung:AE25CD551dbd1057E7KQI13709EA", "content": "valley center, calif. (ap)--when <mark>carlos rivera</mark> returned from fighting in iraq and found work as an electrician, he felt co-workers who knew about his military experience were gawking at him. he went home angry each day. that's not a problem at his current job working alongside other combat veterans picking avocados, mixing organic fertilizers and gathering basil amid northern san diego county's undulating ochre hills. \"i'm outdoors, not stuck inside somewhere feeling suffocated,\" said <mark>rivera</mark>, 25, who returned from iraq in 2007 after four years as a marine. \"there's always someone to talk to, someone there to understand .\" <mark>rivera</mark> works at archi's acres, a 3-acre high-tech organic farm owned by colin archipley, who served three tours in iraq and is trying to help other combat vets shake the trauma of war by turning swords to plowshares. working the earth has long been recognized as good therapy for war veterans. about 20 u.s. department of veterans affairs centers have gardening programs, said anthony campinell, the va's national director for work therapy programs. he said archi's acres is the only fully commercial enterprise of which he was aware. veterans have grown fruits, vegetables and flowers on a 12-acre parcel at the va hospital in west los angeles since 1986. they sold their produce at farmers markets until april, when administrators had them take a break while they work out a deal for a nonprofit group to take over the commercial parts of that program. patients at the veteran affairs medical center near newark, n.j., meanwhile, work in a 2-year-old garden harvesting corn, rhubarb and collard greens, some of which are served at the hospital's cafe. \"how much better can one feel about themselves than if you can make a meal out of things that you grew?\" said ucla psychiatry professor c. scott saunders, who specializes in treating post-traumatic stress disorder among combat veterans. archipley, 28, whose unit took part in the initial invasion of iraq and the later decisive battles in fallujah and haditha, returned from battle in 2006 too agitated to pursue plans to sell houses. instead, he decided to try his hand at farming, despite having no background in agriculture. he and his wife karen started with the 200 avocado trees left on the property they bought while he was still a marine sergeant. realizing the trees were not enough to sustain a business, the archipleys added herbs and leafy greens grown using hydroponics, a method of cultivating plants without soil that requires less water and land than traditional farming. the balmy air in archipley's sunlit greenhouse is thick with the aroma of basil, bunches of which poke through holes in long plastic tubes arranged in vertical rows. thin streams of water enriched with a potent \"compost tea\" run silently along the bottoms of the tubes. wrinkled leaves of chard and deep-green lettuces sprout outside the greenhouse. archipley said he knew other vets would be solid employees and they would benefit from the distraction provided by steady, regimented labor, just as he had. \"when our hands stop working and our minds start running, that's when bad things start to happen. so we keep the work load heavy. we stay busy,\" he said. \"for me, if i slow down, if i stop doing what i'm focussed on, that's when i can get myself in trouble .\" archipley said he thinks his workers are soothed by the farm's rural atmosphere, since the noise and pace of city life might remind them of the urban battle zones where many fought. jeffery scanlon, who places veterans at archi's acres as manager of the va's work therapy programs in san diego, said working with plants appears to help war-rattled vets regain their self-confidence. \"the plants aren't talking back to them,\" he said. \"you feel more in touch with something that doesn't give you what we would consider negative feedback .\" archipley pays a fee to the va to cover salaries and placement program expenses. the va takes care of the workers' insurance, health care and other costs. archipley's staff has grown from two to eight since he began hiring the veterans, and he recently bought an adjacent three-acre parcel where he plans more greenhouses and outdoor growing facilities. the farm's growth is being sustained by demand for its products, which are sold at area whole foods outlets, other grocery stores and farmers' markets. scanlon said he has spoken with va administrators about replicating the collaboration with the farm in other parts of the country. the emphasis on greenhouse cultivation makes it a model for areas too cold for year-round field farming, he said. campinell said he's open to that idea, but his department would need to find other hydroponic farms that want to hire veterans, since the va doesn't set up new businesses. the veterans at archipley's operation, meanwhile, appear grateful for the opportunity to put down their own roots in civilian life. \"this type of work, gardening, getting your hands in the mix, it all helps,\" said anthony licon, whose 21 years in army and marines special operations forces took him to trouble spots in the middle east, central america and other locations. <mark>rivera</mark> said talking with customers at farmers markets has helped him the most. \"i'm dealing with people and looking them in the eye and learning how to be happy around people,\" he said. \"the other jobs i had, i used to just go home and be angry,\" he continued. \"now i actually look forward to work .\" "}, {"articleID": "2017062905_00083005_W", "names": {"John Edwards": ["Q1499392", "Q16192689", "Q1699944", "Q1699946", "Q19873112", "Q20733395", "Q21461221", "Q21461226", "Q217314", "Q27915201", "Q3809239", "Q52834658", "Q54556677", "Q56597692", "Q56706105", "Q57617438", "Q6231383", "Q6231395"], "Paul Keating": ["Q15452628", "Q242654"], "Chris Richardson": ["Q5107865", "Q5107867"]}, "date": "2017-06-29", "url": "http://www.news.com.au/national/breaking-news/no-case-for-significant-rate-rise-anz/news-story/cf2565a03f4f854b7e8dfe8949d02be6", "content": "Borrowers get worrying warning on rates June 29, 2017 2:29 pm Colin Brinsden, AAP Economics Correspondent Australian Associated Press Share Email a friend The views of a former Reserve Bank board member on the interest rate outlook might have been dismissed as \"extreme\" and \"nonsense\" , but they sent a shiver down the spine of borrowers. Economist <mark>John Edwards</mark>, who ended his five-year term as a board member last year, believes official interest rates could rise eight times over the next two years, based on the central bank's present economic forecasts. That would add hundreds of dollars to monthly mortgage payments. But the boss of one of the big four banks disagrees with the <mark>Edwards</mark> assessement. ANZ chief executive Shayne Elliott said it was difficult to see interest rate increases anytime soon when Australia was struggling with below-trend economic growth and wage growth that was almost non-existent. \"I think it is hard to lay a case that says\" gee we are going to see significant interests rate rises', \"he told ABC radio on Thursday. Many households wouldn't be able to afford such increases .\" I think we need to be very careful. \"<mark>John</mark> Kolenda, managing director of mortgage broker 1300HomeLoan, said a rapid rise in interest rates would be disastrous to already fragile consumer confidence .\" The impact of a number of rate rises by the RBA will just terrify consumers and prompt them to tighten their belts dramatically, \"he said. It is a point made by the global central banking authority, the Bank for International Settlements, in a report this week, which cited Australia among a handful of other countries where household debt is on the rise .\" Increases in interest rates beyond what is currently priced in markets could weaken consumption considerably, \"the central bank to central banks said. If Dr <mark>Edwards</mark>, a former adviser to <mark>Paul Keating</mark>, is correct it would take the Reserve Bank's cash rate to 3.5 per cent from a record low 1.5 per cent, where it has stood since August last year. But financial markets are predicting just a single quarter of a percentage point increase by the end of 2018. Deloitte Access Economics economist <mark>Chris Richardson</mark> also expects higher interest rates, but not to the same extent as Dr <mark>Edwards</mark>.\" We wouldn't see interest rates in Australia rise at all until sometime in 2018, probably a year from now, and by the end of 2018 you might have seen two interest rate rises, \"he told ABC radio. The Reserve Bank will hold its monthly board meeting on Tuesday next week."}, {"articleID": "2011102711_00105203_W", "names": {"William Cooper": ["Q16864835", "Q19325787", "Q21464510", "Q22907485", "Q43914985"], "Charles Jordan": ["Q16730426", "Q3666422", "Q5079592", "Q5079596"], "Ron Smith": ["Q15429434", "Q16151519", "Q16214918", "Q20640642", "Q20732311", "Q21598352", "Q28455021", "Q30069157", "Q3441453", "Q7364400", "Q7364401", "Q7364402", "Q7364403", "Q7364404", "Q7364405", "Q7364406", "Q7364407", "Q7364409"]}, "date": "2011-10-27", "url": "http://dailypress.com/news/breaking/dp-nws-rudy-folo-20111027,0,6531777.story?track=rss", "content": "lawyers criticize hampton police over rudy langford's arrest hampton - when local civil rights activist rudy langford was charged in early october with entering the home of a man killed during a police raid at his home in june, police announced the news the next day. rudy langford, 78 - the president of the coalition for justice for civil rights and a frequent critic of hampton police over the years - was charged on oct. 8 with entering <mark>william cooper</mark>'s home without permission on june 30. he faces a misdemeanor count of unlawful entry. but two other men were arrested in early august, without fanfare, in a separate case involving <mark>cooper</mark>'s home. they're each charged with breaking and entering and grand larceny, both felonies. daily press introduces daily savvy deals. sign up now to receive offers that are 50% off or more! the arrests of joseph e. woodward, 30, and david k. ezzell, 35, both of hampton, came after the woman serving as the executor of <mark>cooper</mark>'s estate said she arrived at the home on aug. 9 and caught them stealing <mark>cooper</mark>'s riding lawn mower, and trying to take a tv and a suitcase full of items from his house. but unlike with langford - whose arrest led to a rare police press release announcing a misdemeanor arrest - police didn't tout the news when woodward and ezzell were arrested on the felony counts. part of the reason for the difference, police say, is that langford is a \"public figure .\" \"rudy langford is a public figure who publicly interjected himself into the circumstances that surrounded clifton street,\" said police spokeswoman cpl. allison quinones. \"that is why a release was done on his arrest .\" clifton street was where <mark>cooper</mark> lived. <mark>cooper</mark>, 69, was shot dead just after 10 a.m. on june 18 when police - investigating <mark>cooper</mark> for alleged sales of prescription painkillers - burst into his home under a search warrant. <mark>cooper</mark> opened fire on the incoming officers, with officers shooting back. after the shooting, langford has championed <mark>cooper</mark>'s cause, holding several rallies outside <mark>cooper</mark>'s home and marching a group into police headquarters attempting to speak with police chief <mark>charles jordan</mark>, who has backed the officers. langford has called the police action \"a rush to kill\" and called for federal and state reviews of the case. quinones said a press release wasn't issued after the arrest of woodward and ezzell in august for two reasons. first, because police rarely issue press releases for breaking and entering cases. and second, she contended that publicizing their arrests could have compromised the still-pending investigation into the june burglary case. but <mark>ron smith</mark>, a hampton attorney representing langford, asserts that langford's arrest - as well as his questioning by police for several hours, and the press release issued afterward - was retribution for langford's outspoken criticism over the years. \"there's only one explanation,\" <mark>smith</mark> said. \"you do a press release with implications for a misdemeanor, and you don't do a press release for people arrested for a felony? you don't have to be rocket scientist to see that they're trying to shut up their biggest critic. that's not the right way to do things .\" attorney kevin shea, who is representing the executor of <mark>cooper</mark>'s estate and is planning a wrongful death suit against the city, also weighed in. \"it's remarkable,\" he said. \"i can't put myself in their minds, but i would think they're trying to discredit langford because he's an activist .\" crystal keithley, of hampton, the executor of <mark>cooper</mark>'s estate, said she agreed with shea. \"that's just a given that people would think that,\" she said, adding that it's probably true. hampton mayor molly ward was asked whether she agreed with the attorneys that the different treatment between the two cases points to an effort by police to retaliate on langford. \"it is not appropriate for me to comment on an ongoing criminal investigation,\" she said in a text message from wednesday's hampton city council meeting. city manager mary bunting did not immediately return a phone call seeking comment wednesday. the evidence police used to charge langford hasn't yet been revealed. he has said publicly several times in recent months that he went into the <mark>cooper</mark>'s home to better understand the site of the police-involved shooting. since his arrest, however, langford has said he's innocent of the charges and did not actually go into <mark>cooper</mark>'s home. he has not publicly explained his prior statements. aside from the difference between the two cases, <mark>smith</mark> also asserts that the press release police put out in the langford case was intentionally misleading. \"hampton police arrested a suspect in connection with a burglary that occurred in the 100 block of clifton street,\" the oct. 9 release started out. the statement went on to say that an unknown suspect stole an undisclosed amount of currency from <mark>cooper</mark>'s home, that langford was charged with one count of unlawful entry, and that the burglary investigation is ongoing. <mark>smith</mark> said the wording of the press release \"makes it seem like (langford) had something to do with the stolen currency .\" \"if you don't know the true facts, it leads you to believe that he either did the breaking and entering or was involved,\" <mark>smith</mark> said. \"that's ludicrous .\" in response, quinones, who wrote the release, said the statement's language says clearly that langford was charged with unlawful entry - and not burglary - and called the lawyer's assertions ludicrous. \"the release is self-explanatory,\" quinones said. \"nowhere do i indicate that he stole the money. nowhere in there do i link him to the stolen currency .\" she also stood by her statement that langford was arrested \"in connection\" with the burglary - because, she said, it was while investigating the burglary that police learned that langford had been inside the home. \"that's in connection with the burglary,\" she said. keithley, the executor of <mark>cooper</mark>'s estate - and the aunt of the 15-year-old boy to whom <mark>cooper</mark> left nearly his entire estate in his will - called police on june 30 after noticing that someone had been inside <mark>cooper</mark>'s house. a garbage can had been turned over, its contents sifted through, she said. two bags of coins were missing from a bedroom dresser, and a souvenir budweiser box was gone. at the time, she told police she \"wanted to press charges\" against the intruder. the only mention she made to police of langford was that shea told her he got a call from <mark>cooper</mark>'s son, who relayed that langford had called to say a window to the house was open. keithley said she has never met langford. she said she appreciates him working on the case, and said she doesn't believe he went into the home to try to steal anything. instead, she said, she thinks he went into the home to \"look over what happened\" during the shooting. but keithley said that, if asked by police, she would testify for them that she never gave langford permission to go into the home. hampton university click here for news about hampton university. hrtownsquare.com share your photos, thoughts and more with others from in and around hampton. viewing this on your phone? go to mobile.dailypress.com for a compact version of our site. teel time: notre dame considering full conference membership, says former irish ad, acc commissioner corrigan"}, {"articleID": "2019081002_00010535_W", "names": {"Emma Thompson": ["Q168724", "Q29054751", "Q53109451"]}, "date": "2019-08-11", "url": "http://www.frasercoastchronicle.com.au/news/art-imitates-life-in-mindy-kalings-latest-project/3798703/", "content": "John Early and Mindy Kaling in a scene from the movie Late Night. Supplied Movies Art imitates life in Mindy Kaling's latest project by Seanna Cronin Seanna Cronin APN Entertainment Editor A US ex-pat, Seanna has been writing about the Australian entertainment industries for the past six years and is also a documentary producer, photographer and scuba diver. Full Profile Login to follow 10th Aug 2019 12:00 PM premium_icon Subscriber only 0 Ironically, Nisha Ganatra worked with a largely white, male cast in her comedy film about diversity in the TV writer's room. The Canadian-born, California-raised director - best known for her Emmy-nominated work on the TV series Transparent and her acclaimed debut feature film Chutney Popcorn, teams up with The Office's Mindy Kaling on Late Night. The new comedy drama follows Molly Patel (Kaling), a quality control expert at a chemical plant and amateur stand-up comic who lands a writing job on a late-night talk show. She finds she is the only woman or person of colour in the writing room. RELATED: Double act hits stride with show of diversity Location overpowers drama on insular peninsula \"I always want to work with a diverse cast, but that is not the reality in the world we are portraying,\" Ganatra says. \"The whole point is the lack of diversity, so necessarily the cast is not going to be that diverse. That was a tough thing to get my mind around. But unfortunately, it's accurate. I often find I'm the only woman of colour on a set .\" Mindy Kaling wrote and stars in the movie Late Night. Supplied Ganatra and Kaling make up for that lack of diversity behind the camera. The director and writer bonded over their experiences as Indian-American women rising through the ranks of the TV industry. \"It made sense for us to collaborate,\" she says. \"We didn't have to explain anything to each other .\" I said' I get this. I'm Molly' and she said \"Me too' and then we went running forward making a film together .\" This is a deep, soulful performance in places. We talked a lot about her life before she \"made it', before she wrote her books, before she was Mindy from The Mindy Project. She was just a young woman struggling and wanting so badly to be a part of the world of comedy and not seeing any way in .\" Kaling stars opposite <mark>Emma Thompson</mark>, who plays talk show host Katherine Newbury. Not only has Katherine grown complacent, her years in the competitive industry have turned her into a tyrant of a boss who assigns her writers numbers rather than ever learning their names. <mark>Emma Thompson</mark> in a scene from Late Night. Supplied But faced with falling ratings and the risk of being replaced with a younger comedian, she takes a punt on Molly who eventually manages to break through her icy exterior. \"I can't imagine anybody but <mark>Emma</mark> playing that part,\" Ganatra says. \"<mark>Emma</mark> takes her from the brink of making you hate her to making your heart break for her, and then she makes you laugh .\" Whether it's her completely unexpected, brilliant improvs or just the look on her face, she inherently knows what's funny. <mark>Emma</mark> brings everything you could ever wish for as a director, and when you meet her you think, \"How can I be like her when I grow up?'\" Mindy Kaling and <mark>Emma Thompson</mark> in a scene from Late Night. Supplied Ganatra hopes she and Kaling will inspire the next generation to break down the remaining barriers in the TV industry. \"Mindy and I have connected on so many things, but one thing that I've been a little more vocal and extreme about is politics, and this is an amazing chance to talk about the political things and issues I care about, and to do it in a fun way,\" she says. \"Right now in America the late night hosts are the only ones saying what a lot of us are thinking .\" They don't shy away from those painful topics. That voice is so important...they're constantly reminding us of where we want to be and where we are now. \"I hope this movie inspires a generation of young women to go into comedy writing and late night shows .\" Late Night is in cinemas now. STARS: <mark>Emma Thompson</mark>, Mindy Kaling, John Lithgow, Ike Barinholtz. DIRECTOR: Nisha Ganatra RATING: M 0 editors picks Read More Login to follow late night Read More Login to follow mindy kaling Read More Login to follow movie review Read More Login to follow nisha ganatra Read More Login to follow seanna cronin Read More Login to follow editors picks late night mindy kaling movie review nisha ganatra seanna cronin"}, {"articleID": "2014080712_00025791_W", "names": {"Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"], "Larry Taylor": ["Q2075846", "Q3218109", "Q52863279", "Q6491197", "Q726296"], "George Allen": ["Q22276776", "Q527553", "Q5536192", "Q5536193"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2014-08-07", "url": "http://www.huffingtonpost.com/2014/08/06/russia-racist-laser-obama_n_5656732.html?utm_hp_ref=world&ir=WorldPost", "content": "CNN Correspondent Who Allegedly Bit Paramedics Apologizes For Her Behavior Emma Watson Laughs Off Turkish Politician's Sexism With Cheeky Photo How My Father's Gay Marriage Trial Re-Ignited My Calling to the Ministry Iraq's Christians Threatened With Death But \"Vicar Of Baghdad' Stands Strong President Barack Obama received birthday greetings from around the world when he turned 53 years old on Monday, but some of those wishes weren't exactly well. In Russia, protesters used lasers to beam a crude, racist image of Obama onto the U.S. Embassy in Moscow. The image showed the president in a birthday hat with a banana going in and out of his mouth followed by projections of the words\" Obama \"and\" happy birthday \"in English. Racially-charged messages aimed at Obama have been cropping up with alarming regularity in Russia. Also on the president's birthday, a banner depicting Obama as the\" Three Wise Monkeys \"--see no evil, hear no evil and speak no evil--Across from the US embassy in Moscow today, Russians hung this racist banner addressing Obama on his 53rd birthday. a series of racially-charged posters were displayed around the city of Perm, with one showing the president with a banana, The Moscow Times reported. The late Sen. <mark>Robert Byrd</mark> (D-W. Va.) loosely said the\" N-word \"on\" Fox News Sunday \"in 2001, while discussing the state of race relations in the United States. In a WPIX interview in 2012, East Haven, Conn.. Mayor Joe Maturo (R) was asked what he would do for the Latino community. Maturo replied,\" I might have tacos when I go home. I'm not quite sure yet. \"In 2011, Texas state Sen. <mark>Larry Taylor</mark> (R) made a culturally insensitive remark while speaking at a hearing regarding an insurance company paying policy holders in a timely manner .\" Don't nitpick, don't try to Jew them down, \"<mark>Taylor</mark> said. Recordings from Richard Nixon's presidency recovered in 2009 revealed that Nixon thought abortion was necessary\" when you have a black and a white...or a rape. \"In 2010, South Carolina state Sen. Jake Knotts (R) referred to President Barack Obama and South Carolina Gov. Nikki Haley (R) as\" ragheads. \"BuzzFeed released footage of the incident in 2012. In 2006, former Florida state Rep. Ralph Arza (R) was accused by Bruno Barreiro of calling a school superintendent a\" negro mierda, \"meaning\" black piece of sh--\"in English. Arza resigned and faced criminal charges after spouting threats and racial slurs such as\" n--er \"in a drunken voicemail to Barreiro. While campaigning in 2006, former Sen. <mark>George Allen</mark> (R-Va .) referred to an Indian-American as\" macaca, \"a slur typically directed to Africans. While speaking to reporters on a campaign bus in 2000, Sen. John McCain (R-Ariz .) used the slur\" gooks \"while condemning the Vietnamese prison guards who tortured him .\" I hate the gooks, \"McCain said .\" I will hate them as long as I live. \"While serving as a Missouri senator, Truman referred to waiters who served at the White House as an\" army of coons \"in a letter addressed to his daughter. In a letter to his wife in 1939, Truman used the phrase\" n--er picnic day. \"The book\" Game Change \"by reporters John Heilemann and Mark Halperin, published in 2010, revealed that Senate Majority Leader <mark>Harry Reid</mark> (D-Nev .) made some racial remarks in reference to Obama during his 2008 campaign. The passage in the book reads:\" [<mark>Reid</mark>] was wowed by Obama's oratorical gifts and believed that the country was ready to embrace a black presidential candidate, especially one such as Obama--a \"light-skinned' African American\" with no Negro dialect, unless he wanted to have one,' as he later put it privately. \"<mark>Reid</mark> apologized for the comments in a statement released in January 2010 .\" I sincerely apologize for offending any and all Americans, especially African-Americans, for my improper comments, \"<mark>Reid</mark> said. Some Russians project laser image of Obama eating a banana on the...Nigerian Nurse Who Treated Ebola Patient Dies Of The Disease Rare Footage Appears To Capture Gaza Rocket Site Why Christ, Mao And The Buddha Are Making A Comeback In China MIKHAIL KLIMENTYEV via Getty Images\" The Huffington Post \"is a registered trademark of TheHuffingtonPost.com, Inc.. All rights reserved. Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg"}, {"articleID": "2017042013_01046460_W", "names": {"John Glenn": ["Q16230701", "Q182642", "Q6235502"]}, "date": "2017-04-20", "url": "http://www.popularmechanics.com/technology/a26100/women-in-technology/", "content": "Author Copy Created with Sketch. By Jacqueline Detwiler, Lara Sorokanich and Katie Macdonald Apr 20, 2017 These women fell in love with pursuits in the male-dominated technology industry, but that didn't stop them. They are natural-born creators, innovators, and--yes, because of their gender--pioneers. And they've helped pave the way for a generation of others. Sara del Valle Molly Matalon Advertisement - Continue Reading Below Advertisement - Continue Reading Below Computational Epidemiologist at Los Alamos National Laboratory A program she learned to get there: C, C + +, Math Lab, Mathematica There are two pieces to my job. First, we use mathematical equations to describe how diseases spread. Then we use computer science to create simulations like what you see in computer and video games. We can ask, \"What happens if there's a virus in an airport? Or in a school?\" then simulate how the virus spreads. Usually we rely on code from existing packages, but sometimes we write our own from scratch. Even though I'm a mathematician, I lead a team of computer scientists, software developers, and statisticians. The software developers build the simulations and add new capabilities to the code. Once it's built, I run the code and analyze the results. It's a continuous back and forth. But the math itself is important, too: There are mathematical models that helped the nurse or physician come up with the vaccine you get or to determine when to administer shots. Mathematicians impact our daily life. Related Story An Open Letter From Facebook About Women in Tech Danielle Feinberg Molly Matalon Director of Photography at Pixar A program she learned to get there: Maya Toy Story didn't come out until my senior year of college, but as a junior, one day my computer graphics professor showed a Pixar short film. I knew then that was exactly what I wanted to do. In a regular live-action movie the director of photography does camera and lighting. In animation, I'm in charge of adding the lighting to the three-dimensional worlds we build movies in. It's the last creative step: The world is built, the characters are animated, and I add lights. I can make a scene look indoors or outdoors, overcast or sunny, fluorescent or candlelit. One important program we use at Pixar is called Maya. It helps our technical artists build models and do special effects and hair and cloth. It's great as a learning device because you can get a free student version that has essentially all the same tools we use as professionals. It's a highly capable piece of software. Advertisement - Continue Reading Below Sarah Parcak Molly Matalon Space Archeologist at the University of Alabama at Birmingham A program she learned to get there: ER Mapper, ESRI, ENVI Space archaeologists don't actually work in space. We use images from satellites four hundred miles above Earth to look for changes in vegetation and soil. We classify pixels from the satellite images into groups--such as plants, soil, and buildings. The naked eye can identify things like compounds and pyramids, so we know where to send teams of archaeologists. It saves a lot of time and money over traditional digging. Eventually, I wanted to create a platform where anyone could discover ancient sites with satellite images. I created GlobalXplorer, which turns space archaeology into a game. Citizen explorers view a tile of land, then work to identify classifications. It connects people to places that are disappearing around the world. Leslie Ikemoto Molly Matalon Head of Machine Learning for Google Photos A program she learned to get there: C + +, Java To explain what I do in an example: We noticed that a lot of people accidentally take sideways photos, so we took a whole bunch of photos that we knew were right-side-up, and rotated them sideways or upside down. Then we showed millions of those examples to a machine-learning algorithm. Because we'd labeled all the data, the algorithm learned how to recognize a photo that was uploaded the wrong way and tell the user how to fix it. So my job, really, is knowing what algorithms are out there, and how to use them to solve problems. There's a diagram at the Computer History Museum near Google that shows the family tree of programming languages. There are so many, but if I were learning computer science today, the language that would be first on my list besides C + + and Java would be Swift. It's a new language that is very elegant. I think it will be the language of the future. You're gonna see it all over the place. Advertisement - Continue Reading Below Crystal Windham Molly Matalon Director of Interior Design for Cadillac at General Motors A program she learned to get there: Alias, Z-Red I've been at General Motors for twenty-three years and my art background gave me a solid foundation for using tools as they evolved. That foundation still matters, regardless of what technologies you use: Every car starts with a sketch on paper. From there a \"sculptor\" evolves it into math, and then into 3D. Designers coming out of school today can start with a sketch and render it in programs such as Alias, which can create a quick model, and Z-Red, which can apply textures, grains, and colors. We're also excited lately about virtual reality. It allows us to sit inside the environment of a car that doesn't exist yet. We can sit in the front seats, the rear seats. We can look up and see the headliner or out the windows to the road. We can simulate driving to assess visibility. If you're interested in VR, in sketching things, in gaming or animation, there's a place for you here. Erin Barra Molly Matalon Associate Professor of Songwriting at Berklee College of Music A program she learned to get there: ProTools, Ableton, Logic Technology has changed everything about the music industry. Until ten or fifteen years ago, the technology that was required to record and distribute music was expensive, and only a few select people had it. These days, everybody can be a producer. I was a musician for years, but I often felt like I didn't have the resources to make the music I wanted to make. I realized the barrier was that I didn't have control over the technology. So I decided that I was going to learn. The main tools I teach are ProTools, Ableton, and Logic, and they're all very specific for the type of music you want to create. If you're a singer-songwriter, I recommend Logic because it sort of holds your hand through the process and will make you sound good without too much effort. For people who want to make electronic music, I recommend Ableton. It's more an instrument than a piece of software. And then if somebody wants to work in a studio, I suggest ProTools, because that's what they use in professional environments. Advertisement - Continue Reading Below Paula Fairfield Molly Matalon The Emmy-Award-Winning Sound Designer for Game of Thrones A program she learned to get there: ProTools, Electrical Engineering My dad was an electrical engineer who specialized in radio frequency and microwaves, so I have always been a techno nerd. I've always built and wired my own studios, and I started working with ProTools before it was ProTools. There are lots of ways you can get it free. I always encourage people to start with an online tutorial. Sound is fully immersive, but most people don't notice it. If you are watching a movie and a car rolls by, you'll hear the hum of the engine, the rolling of the wheels, and the grit on the ground and that's about it. Now imagine another similar car rolling by, but this one has a pebble in the wheel well. Even if you're not paying attention to the sound of it, you'll wonder to yourself for a split second, how'd that get in there? You can make all sorts of sonic analogies that support a story twist that way. Why We Should Be Excited About the Future An inspiring afternoon spent watching the girls of Girls Who Code. The Poly Prep Country Day School chapter of Girls Who Code meets on Wednesdays in Brooklyn in New York. As the sound of the bell fills a technology lab in the middle of campus, girls bob in in twos and threes. The lab looks much like a modernized woodshop, with blue rubber flooring, wheeled work tables, metal rolling stools, and a tool wall. Laurel Golio There are eleven girls today. Most are high school underclassmen, though the youngest is a seventh grader and the oldest is a senior. Some have been part of GWC all year; others just began last week, at the beginning of the spring semester. The girls gather around tables and pull out their laptops, many of them decorated with stickers. Girls Who Code is a national nonprofit with forty thousand participants throughout the United States. Each chapter follows an official curriculum: For example, each meeting begins with a lesson about a famous female scientist. This week, computer science teacher Jean Belford, the club's advisor, shows a trailer for Hidden Figures, the Oscar-nominated movie about black women who helped NASA launch <mark>John Glenn</mark> into orbit but got little credit for their work. \"Are women in science still overlooked today?\" she asks. \"That's why this club exists,\" says Rema Hort, a sophomore. For their yearlong project--each GWC club picks one at the beginning of the academic year and works on it together--the Poly Prep girls are building both a video game and a website for another club Poly Prep students are involved in called Focus. They are most excited about the game: They want it to be like Pac-Man--only instead of running from ghosts in a maze, the protagonist will chase and catch counselors. \"That's going to be hard,\" Belford says. \"But you can do it .\" Kristen Palmer (pictured above, center), a fifteen-year-old sophomore who's done more hackathons than she can remember, works on the game with freshmen Jessie Rose and Michelle Kwan. They use Scratch, a visual-programming language designed for students. As they organize purple, blue, and orange blocks of code in a column, Scratch, the orange mascot for the programming language (and a stand-in protagonist), begins to move over a photo of their school. Success! Throughout the two-hour session, girls call out to Sam Steinberg, a seventeen-year-old senior, for guidance. Steinberg enthusiastically advocated for the club at Poly Prep last year. She was the only girl in computer science class her freshman year, and boys would pick on her for answering questions correctly. She didn't like that, so she helped create a place where she (and other girls) wouldn't have to deal with it. Steinberg hops up to help seventh-grader Jasmine Kaur, who's spent the two-hour session coding an online application form for the Focus club. Steinberg scans over the lines, then launches a new window to test the code out. \"I'm so nervous, I hope it works,\" Steinberg says as they stare at the screen. \"Don't get your hopes up,\" Kaur says, laughing. A minute later, the application form is live. It works perfectly. This story appears in the May 2017 Popular Mechanics. More from Popular Mechanics:"}]