[{"articleID": "2015062506_00003575_W", "names": {"Thomas D'Souza": ["Q2423560", "Q30232517"], "William Joseph": ["Q12898320", "Q28914201", "Q8013761", "Q8013762", "Q8013764"]}, "date": "2015-06-25", "url": "http://www.daijiworld.com/news/news_disp.asp?n_id=329810", "content": "Tuesday, June 23, 2015 10:36:47 AM (IST) Sr Nirmala Joshi, successor of Mother Teresa passes away Kolkata, Jun 23 (IANS): Sister Nirmala, who succeeded Mother Teresa as superior general of the Missionaries of Charity, died here on Tuesday. She was 81. Prime Minister Narendra Modi said her life was devoted to \"caring for the poor and underprivileged\" . Nirmala became the second head of the Missionaries of Charity after its founder Mother Teresa stepped down from the post in March 1997. The Nobel laureate died on September 5 the same year. Nirmala held the post till March 24, 2009, when she was succeeded by Sister Mary Prema. Archbishop of Kolkata <mark>Thomas D'Souza</mark> told IANS that the funeral mass will be held at the Mother House on Wednesday at 4 p.m. Sister Nirmala will be laid to rest at the St. John's cemetery. Born Nirmala Joshi in Ranchi to a Brahmin family from Nepal in 1934, she joined the MoC after converting from Hinduism in het youth. An MA in political science and a trained lawyer, Sister Nirmala started the MoC's contemplative branch in 1976 and headed it till 1997 when she was elected to succeed Mother Teresa as the order's Superior General. She was elected for a second term in 2003. Sister Nirmala was re-elected for a third term on March 13, 2009, but the MoC held a second election days later after she wanted to be relieved of the responsibility owing to ill-health and also expressed a desire to return to the contemplative life she led before heading the order. Sister Nirmala was honoured with India's second highest civilian order Padma Vibhushan in 2009 for her services to the nation. West Bengal Chief Minister Mamata Banerjee condoled Sister Nirmala's death and tweeted: \"Saddened at the passing of Sister Nirmala who headed Missionaries of Charity after Mother Teresa. Kolkata and the world will miss her.\" Banerjee paid her last respects to Sister Nirmala at St John's Church here. Describing it as a personal loss, she said the state government will extend all help and cooperation for the last rites. International Society for Krishna Consciousness (ISKCON) also extended its condolences. \"Her life of dedication and service especially to the poor is a great inspiration and it is to be pondered upon and to be followed,\" ISKCON's spokesperson Radharaman Das said. Stay updated wherever you go with Daijiworld.com and Daijiworld 24X7 tv channel mobile apps. My association with Sr.. Nirmala was in 1957 when she was a Hindu. Her name then was Kusum Joshi. She was doing her post graduation and we six of us Mangalorean teachers, working at Patna Womens College. She stayed with us along with her two sisters, Rabha and Bindu. She was also N.C.C. captain. A very jovial, smart and active person. Though she was a Hindu, she attended daily mass regularly. She was an inspiration to us catholics. After many years I met her in Mangalore as Sr.. Nirmala. I was extremely excited to see her. She told me then, that her sister Radha expired some years back and Bindu ian A.C. nun in one of the convents in the north. <mark>William Joseph</mark> & Milliana Concessao, Mangalore, Muscat. Wednesday, June 24, 2015 Olivia Moras, Mangalore/Toronto Canada Stanley Menezes, Modankap/Jeddah KSA EVANS N MARIA ALEX, FALNIR MANGALORE Augustine Daniel <mark>D'Souza</mark>, Udupi - Mumbai - VASAI - STATE OF KUWAIT One of the noble soul passed through this earth! As she continued the legacy of Mother Teresa, hope somebody will take over the legacy from Sr.. Nirmala. Santan Mascarenhas, Kinnigoli/Mumbai RIP Sister Nirmala. Big thanks to you for the dedication of your entire life for the poor, sick, lepers, destitute and dying. Govt of India gave you Padma Vibushan for your dedicated service. Her father, who was an Army Officer in British Army till 1947, came to her convent with a gun to take back her. But, after sensing her determination and meeting Mother Theresa, we went back. I think her younger sister is also a sister in M.C. Tuesday, June 23, 2015 A very big thank you from the bottom of our hearts for dedicating your life to God in the service of the \"poorest of the poor' and the down trodden in the footsteps of our most Blessed Mother Teresa - a Saint to us. Your Comment [Please limit your comments within 2000 characters] Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Published by Daijiworld Media Pvt Ltd Mangalore Editor-in-chief: Walter Nandalike Corporate Office: Daijiworld Residency, Airport Road, Bondel Post, Mangalore - 575 008 Karnataka India City Office: First Floor, Divya Deepa Arcade, About Us Copyright © 2001 - 2015. All rights reserved. Kishoo Enterprises, Maithri Complex, 3rd Floor, Udupi Service Bus Stand, Udupi, Karnataka. Pin 576101 Telephone: 0091-820-4295571 Daijiworld Middle East FZE P.O. Box: 84772, Dubai, UAE Tel: 971-50-6597629 Fax: 971-4-2639207"}, {"articleID": "2013041106_00033591_W", "names": {"Jimmy Carter": ["Q23685", "Q6199776"]}, "date": "2013-04-11", "url": "http://jewishpress.com/news/breaking-news/mezuzah-arsonist-busted/2013/04/11/?utm_source=rss&utm_medium=rss&utm_campaign=mezuzah-arsonist-busted", "content": "tell a friend a suspect in an anti-semitic arson attack was taken into custody yesterday and questioned about the burning of 12 mezuzahs at two brooklyn apartment buildings this week - but cops haven't charged him yet because he claims to have an alibi, the ny post reported. police interrogated ruben ublies, 35, who has at least 40 priors, for the burning of the mezuzahs. most of the burnings coincided with holocaust memorial day. \"he's given no denials, but he's given some alibis and the detectives are looking into his alibis,\" a law-enforcement source told the post. tell a friend about the author: jewishpress.com brings you the latest in jewish news from around the world. stay up to date by following up on four women of the wall and haredi man and woman detained palmer on personal connection to rock throwing in israel geller's talk cancelled, l.i. shul, sun. school kids threatened israeli arab citizen charged with joining syrian jihadists 4 major american jewish orgs rebuke cardozo over <mark>carter</mark> award jews still planning to sue <mark>jimmy carter</mark> over anti-israel book mezuzah arsonist strikes again, evoking familiar jewish fears looking for family of soldier killed in fall of gush etzion, 1948 jewishpress: rt @ jewishpress: new article: portugal to award citizenship to descendants of expelled jews - jewishpress: rt @ jewishpress: new article: five women of the wall and haredi man detained - jewishpress: rt @ jewishpress: new article: gordon, schulman appointed to u.s. holocaust memorial council - jewishpress: @ jewishpress https: //t.co/kaijl5cnnr https: //t.co/b1i2d59ljl https: //t.co/a8b8k9xrfc https: //t.co/w1qjzfmhkb https: //t.co/x7qkhvdv2w rt @ jewishpress: new article: 80 new olim celebrate joining the idf - jewishpress: rt @ jewishpress: new article: sounds israeli: lina makhoul sings \"hallelujah' - jewishpress: rt @ jewishpress: new article: sounds israeli: lina makhoul sings\" hallelujah' - jewishpress: rt @ jewishpress: new article: looking for family of soldier killed in fall of gush etzion, 1948 - jewishpress: @ jewishpress thanks for posting! \"the mystical meanings of the anonymous hacking attacks\" jewishpress: rt @ yishaifleisher: #dershowitz is right to challenge prez. #carter at #cardozo law @ aaronkleinshow @ jewishpress 20 hours ago jewishpress: rt @ yishaifleisher: #dershowitz is right to challenge prez. #carter at #cardozo law @ aaronkleinshow @ jewishpress 20 hours ago jewishpress: 50% off a #subscription to @ jewishpress jewishpress: dear @ jewishpress, sad to see you featuring someone the @ adl_national considers a hate monger on your website: toda (thanks) & brachot (blessings) to our sponsors @ janglo @ unitewithisrael @ nachumsegalnet @ jewishpress please follow them the jewish press. all rights reserved. no portion of this website may be copied without the express written permission of jewishpress.com."}, {"articleID": "2011120616_00012756_W", "names": {"David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"]}, "date": "2011-12-06", "url": "http://content.usatoday.com/communities/theoval/post/2011/12/lady-gaga-to-meet-with-obama-aides-on-anyi-bullying/1?csp=34news", "content": "<mark>david jackson</mark>, usa today updated president obama is flying to and from kansas today, but the white house won't be lacking for star power in his absence. lady gaga will be in the house. \"the pop singer is meeting with obama administration staffers tuesday to discuss her work on bullying prevention,\" reports the associated press. \"the white house held an anti-bullying conference earlier this year, and the administration estimates that bullying affects 13 million students, or about a third of those attending school,\" noted the ap. lady gaga brought up the issue with obama himself during a fundraiser in california back in september. abc news reported: according to a source present in the tent fundraiser, gaga asked a question during the q & a. she first thanked the president for what he's accomplished, then read from what she said was a letter from a fan about the suicide of another fan who had been subjected to bullying. she thanked obama for hosting his anti-bullying conference with michelle obama, and then made a general plea to everyone in the room, including the president, to do what they can to prevent bullying."}, {"articleID": "2009032317_00005051_W", "names": {"John Hoffman": ["Q16106293", "Q16196063", "Q59247363"]}, "date": "2009-03-23", "url": "http://nbc4i.com/cmh/news/local/article/students_get_lesson_in_personal_finance/14103/", "content": "students get a lesson in keeping good credit. donna willis web content coordinator published: march 23, 2009 groveport, ohio - tough economic times have many people wishing they were more financially savvy. students at one central ohio high school got a lesson on how to keep themselves from ending up with bad credit or even a bankruptcy. nbc 4's tom brockman reported with the fast facts. good personal-finance management is the foundation that will keep a person out of bankruptcy. bankruptcy attorneys and judges were in a groveport madison high school classroom instead of a courtroom monday. it was a part of credit abuse resistance education or the care program. the class discussed everything from budgets to filing bankruptcy to the dangers of falling behind on credit cards. imagine this scenario, students: you're 50 years old and you're paying for nachos and wings that you had on spring break when you were 22. federal bankruptcy judge <mark>john hoffman</mark> said there were some 53,000 bankruptcies filed in ohio last year and there never has been a better time to teach young adults about finances. \"you learn social studies. you learn science. you learn math. some of the basic things you need to learn to live in a 21st century society-you don't learn those skills,\" <mark>hoffman</mark> said. attorney nannette dean did a mock budget with the students. \"the budget we did today was key because they got to the end of the month and they had $45 dollars left. they said,\" but that doesn't cover everything,' and that's exactly right, \"dean said.\" my colleagues and i kind of looked at the way the economy is today. our job is to prepare them academically, but we also need to give them the tools to survive financially, \"gmhs teacher greg torr said. schools that are interested in participating in this free care program should call 614-464-2235. for additional information, stay with nbc 4 free registration) please avoid offensive, vulgar, or hateful language. health issues affect every single one of us and our families. nbc 4's amy basista puts you in touch with local resources. nbc 4's jerod smalley and his wife blog on their family's fight against autism. nbc 4's managing editor talks about building a better newsroom & connecting with the people of central ohio. jerod smalley and omar ruiz share their thoughts on local sports. nbc 4's gail hogan gets the scoop on what you want to know about ohio's largest city. nbc 4's ellie merritt blogs on the joys of motherhood. i admit it. i am, by nature, an optimist. i try to see the glass half full. news, notes and observations from the world of politics--locally and elsewhere."}, {"articleID": "2020011318_00027156_W", "names": {"Stephen Thompson": ["Q11253984", "Q18588210", "Q57878587", "Q59587831", "Q7610676", "Q7610677", "Q7610681", "Q782348"]}, "date": "2020-01-13", "url": "https://www.wwno.org/post/mark-it-down-ashley-mcbryde-massive-year", "content": "Mark It Down: Ashley McBryde Is In For A Massive Year By <mark>Stephen Thompson</mark> • 5 minutes ago Share Tweet Email Originally published on January 13, 2020 9:52 am YouTube Every sign points to Ashley McBryde having a huge, huge year in 2020: The country singer experienced a major breakthrough in 2018 with the Grammy-nominated Girl Going Nowhere (one of that year's best albums) and an attention-grabbing single in 2019 with \"One Night Standards\" (one of that year's best songs). Now that it's 2020, McBryde has another auspicious milestone in mind, with what's sure to be one of the year's grabbiest videos. But let's start with \"Martha Divine\" the song: The Arkansas-born singer's rowdiest jam to date, the track weaves its revenge narrative into a family's complicated history. The cheater in question is the singer's dad, but the target of McBryde's ire is his paramour, the titular Martha, who's in for a world of hurt. What \"Martha Divine\" lacks in healthy boundaries, appropriately placed anger or clarity about the proper legal definition of \"murder,\" however, it more than makes up for in raucous, hooky, fist-pumping catharsis. When she plays it live, this thing will shake ceilings--and that's saying nothing of McBryde's profoundly awesome delivery of \"idn't.\" (You'll know it when you hear it .) Then there's the video, which--like the subtler short film accompanying \"One Night Standards\" --uses a seedy motel as the backdrop for scenes ripped from a gritty crime drama. What the song implies, the video shouts: Martha Divine is sorry she ever saw the likes of Ashley McBryde, to say nothing of that shovel. \"\"Martha Divine' was so much fun to write because [the song's co-writer] Jeremy Spillman wasn't afraid to get weird with me,\" McBryde writes via email. \"I told him I wanted to write something dark, and we created this story that surrounds the most delightful trollop of a human being and gets down underneath the fingernails of the uncomfortable truth about family dynamics. I was certain no one would let me shoot a video that actually reflected the lyrics, but Reid Long helped me bring it to life in a way that only he could.\" Ashley McBryde's as-yet-announced second album is coming soon via Warner Music Nashville. Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread."}, {"articleID": "2017032911_00444656_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2017-03-29", "url": "http://origin.thehollywoodgossip.com/2017/03/the-real-housewives-of-beverly-hills-season-7-episode-17-recap-w/", "content": "Did Dorit take cocaine with her gal pals at Lisa Rinna's party? That was one of the more pressing questions on The Real Housewives of <mark>Beverly Hills</mark> Season 7 Episode 17 as the bickering between the ladies hit crazy new heights. Watch The Real Housewives of <mark>Beverly Hills</mark> Season 7 Episode 17 Online When the episode got underway, the ladies were still going at it, with Dorit turning on the water works to claim she was not the type of person Rinna tried to imply. \"Rinna just gets so upset that you just don't know what she's going to pull out of that bag of hers, but it's going to be one sharp dagger,\" Kyle Richards said to the camera. \"I saw what I saw, and that behavior speaks pretty loudly,\" Rinna said to the camera. The next day, Lisa Vanderpump decided to play peacemaker and visited Rinna to say she felt she was horrible to Dorit. Vanderpump invited Rinna to a wine tasting at her house to see if she and Dorit could make things right with each other. \"Maybe she could apologize to Dorit because she's really been kind of a bitch to her, to be honest,\" Vanderpump said to the camera. While Rinna escaped to Philadephia for a work commitment, the other ladies embarked on a shopping trip, but Eden's strange behavior continued. Eden decided to latch on to Erika and tried to buy her a friendship ring. \"I don't understand why you're buying me this ring,\" Erika said, confused. \"Because I love you!\" Eden screamed back. \"Just say thank you, and' I love you, too .'\" Yeah, there's something odd about the way Eden tries to make nice with the ladies. The 9 Richest Real Housewives in Bravo History Start Gallery Some time later, Erika, Eileen, and Kyle met for lunch. Erika wanted to apologize for the way she behaved towards Eileen. \"I'm sorry that I had a meltdown on you at the table. I apologize. It has nothing to do with you. I was stressed out, and those words are very sensitive to me, so I had a meltdown,\" she said. \"I was tired, and I was exhausted from that fight [with Dorit] and from trying to take the high road--and then I took the low road,\" Erika giggled. \"I'm not sure that Dorit is sincere,\" Erika said. \"I'm not sure that either she or PK understand what they've done.\" Meanwhile, Dorit met with PK and told him about the cocaine claims. He called her \"schizophrenic\" before taking aim at Erika. \"I'm not calling her husband!\" he said. \"She should call her husband because she doesn't see him very often. Check in.\" How you doing, Tom?' It's been six months. \"Is it just us, or does PK seem like someone who is stuck in high school? Grow the eff up. Real Housewives All Stars: Who Should Be Cast? Start Gallery Lisa Vanderpump's lavish party finally arrived, and the ladies struggled to stick to the dress code. Apparently, red, pink and diamonds were part of the dress code. That's a typical LVP party right there. Vanderpump noticed Dorit was acting strangely. Dorit revealed the tension amongst the group of ladies was getting to her. Surprisingly, there was no cliffhanger. Everything seemed to go well, but there's still one more episode left this season for all the drama to go down. What do you think will happen? 19 Real Housewives Who Only Lasted One Season Start Gallery Edit Delete Share Tweet Email"}, {"articleID": "2014052605_00009230_W", "names": {"Joe Oliver": ["Q16107458", "Q6211624", "Q6211627"], "John Baird": ["Q16154590", "Q19043052", "Q27831227", "Q365736", "Q43911239", "Q6220326", "Q6220331", "Q6220342"]}, "date": "2014-05-25", "url": "http://www.torontosun.com/2014/05/23/travelling-the-world-on-high-flying-egos", "content": "Anyone feel like gallivanting off to Paris for a day? Eh? Too much jet lag to be useful the first day? And too expensive? Well, you'd make a lousy politician. Consider a recent Ottawa Citizen story about federal cabinet ministers zooming about in VIP Challenger jets, operated by the RCAF at a bargain-basement $3,300 per hour. Including then-natural resources minister <mark>Joe Oliver</mark>, with a mere three aides, going from Ottawa to Paris and back on Oct. 19 and 20, 2011. Supposedly he promoted our international energy interests not only in Paris meetings but in a side-trip to London for a speech to the LSE and a meeting with British government people. He must be superhuman...or self-deluding. So is <mark>Oliver</mark>, now finance minister, also a high-living jet-setter? Not by the standard of finance ministers. Jim Flaherty once zoomed down to Mexico City with six aides for a December 2011 overnighter to discuss G20 priorities with Mexico's president and assorted hangers-on. Not to seem cheap but what benefits did they derive from meeting face-to-face, rather than via Skype or conference call, to offset the $33,179 price tag? For that matter, why not just exchange a few e-mails full of nebulous generalities then decide the technical people will sort it all out and give you something to sign in front of the cameras wearing colourful local garb? After all, Flaherty spent another 30 grand flying back to Mexico City for a brief G20 finance minister's meeting two months later. If you ask me, G20 financial matters are too complex for 20 giant egos and umpteen aides to settle quickly face-to-face in some posh resort. Which might be why they don't ask me. Don't even mention Peter MacKay's August 2011, $17,411 overnighter the manifest listed as \"Ottawa, Ottawa, Ottawa.\" I'm already clutching my head going \"Ottawa, Ottawa, Ottawa.\" You see, the issue is ego inside the bubble. These people start to get the idea, fed by an atmosphere of constant crisis, obsequious aides and a panting press, that they really are special. Take <mark>John Baird</mark>, who flew commercial to Africa in December 2012 for a Friends of the Syrian People meeting in Marrakech then hopped the Challenger for a same-day \"G8 Broader Middle East and North Africa\" meeting in Tunis. The official explanation was there was no other way to attend both meetings. The problem is, there was no reason to. Nothing actually gets done in these gatherings that's worth a dime. Would the Syrian People, or their Friends, be one whit worse off if <mark>Baird</mark> had just sent a nice note, on engraved stationary, saying we feel your pain and Obama should send troops? Last Wednesday the \"Office of the Minister of State (Foreign Affairs and Consular),\" which shouldn't even exist, teamed up with the \"Media Relations Office, Foreign Affairs, Trade and Development Canada\" to assure me \"The Honourable Lynne Yelich, Minister of State (Foreign Affairs and Consular), today wrapped up a successful visit to the Kyrgyz Republic, where she advanced Canada's social, political and economic interests, as well as religious freedom, in the region.\" Phooey. Her visit did nothing for Canada, Kyrgyz religious minorities or Orozbek Moldaliev personally (the press release boasts that she met with him). And every such press release calls every such visit successful because they are vacuously smug. Indeed, the real reason they keep flying around is they think they're so special their mere presence, even jet-lagged, harried and extravagant, has a transformative effect on problems they couldn't solve through hard work in a decade. And while the cost is a drop in the bucket of federal spending, it's still a high price to pay for them to stagger around foreign countries, pontificating on autopilot, bleary with fatigue, inflating their egos. Anyone feel like gallivanting off to Paris for a day? Eh? Too much jet lag to be useful the first day? And too expensive? Well, you'd make a lousy politician. Consider a recent Ottawa Citizen story about federal cabinet ministers zooming about in VIP Challenger jets, operated by the RCAF at a bargain-basement $3,300 per hour. Including then-natural resources minister <mark>Joe Oliver</mark>, with a mere three aides, going from Ottawa to Paris and back on Oct. 19 and 20, 2011. Supposedly he promoted our international energy interests not only in Paris meetings but in a side-trip to London for a speech to the LSE and a meeting with British government people. He must be superhuman...or self-deluding. Where have all Ontario's ridings gone? They seem as disposable as our sense of community."}, {"articleID": "2013111923_00051232_W", "names": {"Tom Hicks": ["Q16233855", "Q553219", "Q7816190", "Q7816193"], "Doug Armstrong": ["Q19347163", "Q19864682", "Q5300254"]}, "date": "2013-11-19", "url": "http://www.defendingbigd.com/2013/11/19/5046040/patience-key", "content": "Get the latest Dallas Stars news with Defending Big D Patience. It's become akin to a four letter word for the Dallas Stars fanbase. The use of \"patience\" with die-hard fans generally elicits a very emotional and fervent response: \"I've been patient for five playoff-less years, I've run out of patience!\" Yes, the Stars haven't made the playoffs in five seasons straight. But what caused that streak is being turned around over the course of the last few seasons. However, the kind of damage done up until Tom Gaglardi took over isn't going to be undone overnight. During those five years, the Stars were run by <mark>Tom Hicks</mark> and then a group of banks as the team lingered through bankruptcy. As <mark>Hicks</mark> started to have finances go into decline, the amount of money spent on the roster was really reduced. Where Dallas had been a team that was in the top part of the league in spending to the cap, they all of a sudden found themselves near the bottom of the league. They were finally sold to Tom Gaglardi about two years ago. One of the first things Gaglardi did was to rebuild the front office--both on the sales/admin side as well as hockey operations. The Stars worked to get a good staff in sales and customer service in place. Gaglardi then worked to keep all of those employees through the prolonged lockout, even as other teams laid off employees and reduced hours and salaries. He invested in the people. The next focus was in making sure that the right people were hired to run the show. Jim Lites was brought in as the president (again .) He went out and hired Jim Nill, something many in the media felt was one of the biggest coups in hockey operations. They brought in a winning experienced coach in Lindy Ruff to coach the team and, along with Nill, to bring a winning pedigree to Dallas. He's come in and rebuilt the team from the top down, establishing a firm foundation for the team to build from. Then it came time to focus on the on-ice product. In Gaglardi, the Stars got a committed and passionate owner that isn't afraid to spend money on the team when it is warranted. They went out and offered contracts to free agents--something they hadn't been able to do for a time. Trades were made to take on salary, which allowed the team to try to improve in the short term while not rushing the prospects and remain competitive in the NHL. The farm system has been replenished. It had basically been depleted after <mark>Doug Armstrong</mark> had spent the previous seasons packaging up draft picks in trades. Coupled with not picking very high for seasons straight, the farm system was lacking the depth necessary to build a true consistent contender. They had to rely on free agency to plug holes in the roster. Through some shrewd trades, Joe Nieuwendyk did what he could for the team while he was general manager when he couldn't spend to the cap--he amassed draft picks and prospects in deals. The fruits of all of this ground work are starting to show. Young guys like Alex Chiasson are now contributing at the NHL level while guys like Brett Ritchie are developing well down in Austin. The Stars now have a team where prospect depth is a position of strength that they can use to better their roster, by allowing for pieces to be traded without being detrimental to the organization. They've made key trades and free agency signings to help the team be right in the mix this season. But they're still not there--yet. There are obvious holes in the roster: the defensive depth, while it is there, seems to hold a lot of redundancies in players that fit a certain mold. Goaltending depth has been tested at the lower levels due to injury already this season. Scoring wingers are needed for depth. One thing the Stars have now, however, is a man with a plan. Nill has come from an organization where patience with prospect development and roster construction reign supreme. He's bringing that calming, patient presence to a team that has lacked it in seasons past. Yes, the Stars haven't made the playoffs for five seasons straight. But I must say, the idea that this team is going to be built right excites me. I have more faith that Nill's plan will pay off in the long-term. Imagine a team that is a contender consistently instead of a flash-in-the-pan every few years. That dream is what keeps me patient, even when the Stars can be exasperating on some nights. They're going through some growing pains but I have every confidence that they'll get there at some point."}, {"articleID": "2008101613_00031424_W", "names": {"Tom Herman": ["Q25997639", "Q48850168", "Q7816168"]}, "date": "2008-10-16", "url": "http://ncpa.org/sub/dpd/index.php?page=article&Article_ID=17141", "content": "dallas, tx 75251-1339 phone: (972) 386-6272 fax: (972) 386-0924 nw, suite 900 south building washington, dc 20004 on death and taxes because of tax-law changes in recent years, the federal estate tax now hits fewer estates than ever. the internal revenue service received a total of only 23,000 taxable estate-tax returns in 2006; down from 52,000 in 2001. even so, the estate tax is still a hot political issue. here is an update on the current law, where the candidates stand, and what their areas of agreement could mean for many families and their heirs. regarding exemption and rates: currently, the basic federal estate-tax exemption is $2 million per person and the top estate-tax rate is 45 percent; next year, the exemption is scheduled to jump to $3.5 million, the largest one-year increase in history. in 2010, the estate tax is supposed to disappear completely, and in 2011, the tax will return with an exemption of only $1 million and a top tax rate on the largest estates of 55 percent. mccain proposes raising the exemption as soon as possible to $5 million and cutting the top tax rate to only 15 percent. obama wants to keep the exemption at $3.5 million and the top rate at 45 percent. both candidates agree that the exemption amount should be easily portable: obama want to eliminate the estate tax for 99.7 percent of families. mccain opposes situations where taxpayers may have unfavorable tax consequences simply because they couldn't afford--or didn't know--to seek sophisticated tax planning advice. even though both candidates agree, nobody knows how quickly such a change might happen, what the effective date might be and how the fine print of legislative language would read. moreover, they agree on the idea of keeping today's system for valuing inherited property, including stocks and mutual-fund shares. source: <mark>tom herman</mark>, \"on death and taxes...and the candidates,\" wall street journal, october 15, 2008. we depend on the financial support of individuals. we need your help to continue our work."}, {"articleID": "2009072501_00011088_W", "names": {"Robert Heller": ["Q16018783", "Q22611916"]}, "date": "2009-07-25", "url": "http://jrdeputyaccountant.com/2009/07/looking-for-evidence-of-market.html", "content": "obviously australia holds their reserve bank in higher regard than we do here in the good ole us of a a blast from the past and a ppt primer, or, alternatively, \"the fed's greatest hits (or misses)\" from safe haven in case you missed it the first time around. amazing what you can discover when you only pay attention, eh? a tio is an abbreviation for term investment option, and is a way for the treasury to make extra income. from the treasury site here, the \"treasury will periodically auction excess operating funds to participants for a fixed term at a rate determined through a competitive bidding process.\" another view of tios from the st. louis fed is here. now for some interesting quotes, with our comments and simplications [sic?], from a few federal reserve members over the last 17 years: \"the stock market is certainly not too big for the fed to handle. the foreign exchange and government securities markets are vastly larger. daily trading volume in the new york foreign exchange market is $130 billion. the daily volume for treasury securities is about $110 billion. the combined value of daily equity trading on the new york exchange, the american stock exchange and the nasdaq over-the-counter market ranges between $7 billion and $10 billion.\" --former federal reserve governor, <mark>robert heller</mark> in the wall street journal on october 27, 1989 1. governor <mark>heller</mark> actually admits that the fed can \"handle\" the stock market, way back in 1989. 2. the fed already participates in the $110 billion daily treasury securities market. all activity of all the stock markets is less than 10% of the size of the treasury market. \"an appropriate institution should be charged with the job of preventing chaos in the market: the federal reserve...the fed already buys and sells foreign exchange to prevent disorderly conditions in foreign exchange markets. the fed has assumed a similar responsibility in the market for government securities. the stock market is the only major market without a marketmaker of unchallenged liquidity or a buyer of last resort.\" ...\"the fed could support the stock market directly by buying market averages in the futures market, thus stabilizing the market as a whole.\" --former federal reserve governor, <mark>robert heller</mark> in the wall street journal on october 27, 1989 1. another admission by governor <mark>heller</mark> that the fed, way back in 1989, assumed responsibility for preventing \"disorderly conditions\" in the market for treasury bonds and bills. 2. he also observes the lack of a \"buyer of last resort\" , even though the executive order establishing the \"working group on financial markets\" (also sometimes called the plunge protection team, or ppt) was issued earlier in 1988. the avowed purpose of the ppt is to prevent or control a large stock market crash like what occurred in october 1987. \"executive order 12631 - working group on financial markets - mar. 18, 1988; 53 fr 9421, 3 cfr, 1988 comp., p. 559: by virtue of the authority vested in me as president by the constitution and laws of the united states of america, and in order to establish a working group on financial markets, it is hereby ordered as follows: the secretary of the treasury, or his designee; the chairman of the board of governors of the federal reserve system, or his designee; the chairman of the securities and exchange commission, or his designee; and the chairman of the commodity futures trading commission, or her designee.\" 3. a method of \"supporting\" the stock market via buying futures was named. \"the last duty of a central banker is to tell the public the truth.\" --alan blinder, vice chairman of the federal reserve, on pbs's nightly business report in 1994 1. oh...2. our favorite quote from a member of the federal reserve. [mine too, except for bernanke's \"i don't know, i'll have to get back to you on that.\" ] \"governments supplement private (counterparty) surveillance when they judge that market imperfections could lead to sub-optimal economic performance.\" --alan greenspan, during a sept. 2002 speech in london entitled \"regulation, innovation, and wealth creation\" 1. \"private counterparty surveillance\" ? is this \"fed-speak\" for the ppt since the fed is actually a private organization, or perhaps for the crmpg? even without the benefit of a tinfoil hat, the concept of private and controlling surveillance of the market is quite disturbing. 2. an admission that governments interfere (\"supplement\" ) during periods of \"sub-optimal\" performance, from the maestro. we wonder who defines what is sub-optimal, at the very least, and also note that september 2002 was also the approximate bottom in the u.s. stock markets. 3. the first public tio transaction from the u.s. treasury was in april 2002 ....so what does it mean when the fed hands over billions in sloshy loot to play with? i'm asking \"for a friend\" ..."}]