[{"articleID": "2011030519_00061283_W", "names": {"John Locke": ["Q21198546", "Q6245090"]}, "date": "2011-03-05", "url": "http://lostpedia.wikia.com/index.php?title=Official_Lost_Podcast_transcript/February_12th,_2009&diff=1025942&oldid=prev", "content": "\"\"carlton cuse\" ': that's true. we have a lot of stress. we're trying to get the finale written right know. but we are taking a little brief interlude to have this podcast. so, let's get ride to little recap here damon. so, this was the big rousseau story that we were promising the viewers about, was it not? \"\"carlton cuse\" ': that's true. we have a lot of stress. we're trying to get the finale written right know. but we are taking a little brief interlude to have this podcast. so, let's get ride to little recap here damon. so, this was the big rousseau story that we were promising the viewers about, was it not? \"\"damon lindelof\" ': yes, well we said we'd be seen rousseau again and we sure did? and as opposed to doing it? cause? since? rousseau was shot last year by keamy and his pals. the only way to do it was time travel. so, that when we're sitting around going \"well, the fans really want more rousseau, let's introduce time travel into the show, that's probably the best way to do it\". so, we hope you're happy. \"\"damon lindelof\" ': yes, well we said we'd be seen rousseau again and we sure did? and as opposed to doing it? cause? since? rousseau was shot last year by keamy and his pals. the only way to do it was time travel. so, that when we're sitting around going \"well, the fans really want more rousseau, let's introduce time travel into the show, that's probably the best way to do it\". so, we hope you're happy. \"\"carlton cuse\" ': and you saw brennan and robert and lacombe? a transcript is a retrospective written record of dialogue, and like a script (a prospective record) may include other scene information such as props or actions. in the case of a transcript of a film or television episode, ideally it is a verbatim record. because closed-captioning is usually written separately, its text may have errors and does not necessarily reflect the true canonical transcript. transcripts for spooky with aid of dvr, and at times, closed captions for clarification. she and lost-tv have generously granted us permission to share/host these transcripts at lostpedia. later transcripts were created by the lostpedia community, unless stated otherwise below. disclaimer: this transcript is intended for educational and promotional purposes only, and may not be reproduced commercially without permission from old_starman is the author of this transcript. old_starman is responsible for this transcript. it is one in the series of the official lost podcasts. the author is apologizing for the mistakes in names. kris white: what's going on with <mark>locke</mark>'s body? will we see theresa again? and which lost actor does damon most want to see on \"dancing with the stars\" ? we will answer to those questions and more in today's official lost audio podcast. lost start theme. (kris white's introducing part which is not very useful) damon lindelof: wow! a foreign tongue this morning! hello, carlton! carlton cuse: oui. what's going on, damon? damon lindelof: we're doing a podcast apparently sitting on the couch. carlton cuse: sitting on the couch. we got our wonderful producer kris white here today with this hi-tech car board box with microphones on it and? damon lindelof: we spare no expense for you guys. carlton cuse: this is a very classy podcast. we're gonna rehash the most reason episode of lost \"this place is death\" damon lindelof: really a nice? just i fill good theme. carlton cuse: i think as the season goes on if you as welcome to see there were dead or death appears in many of the titles this year. damon lindelof: right. ironically, we were just talking about the writers offices that day and decided to title the episode \"this place is death\" and gave this line to charlotte to justify it. carlton cuse: it's actually more fun than death to be in the writer's offices. they're really? damon lindelof:? slightly. i mean i've never been dead, so, i don't know? <mark>locke</mark>? looks like he is having a good time. looks like he is relaxing. carlton cuse: yes. there is not a lot of stress for him at the moment. damon lindelof: which is more than i can say for us. carlton cuse: that's true. we have a lot of stress. we're trying to get the finale written right know. but we are taking a little brief interlude to have this podcast. so, let's get ride to little recap here damon. so, this was the big rousseau story that we were promising the viewers about, was it not? damon lindelof: yes, well we said we'd be seen rousseau again and we sure did? and as opposed to doing it? cause? since? rousseau was shot last year by keamy and his pals. the only way to do it was time travel. so, that when we're sitting around going \"well, the fans really want more rousseau, let's introduce time travel into the show, that's probably the best way to do it\". so, we hope you're happy. carlton cuse: and you saw brennan and robert and lacombe? damon lindelof: and of course, montand (carlton and damon are pronouncing \"montand\" together). so, the big mystery of montand's arm is finally been revealed. carlton cuse: the truth for us was that we really didn't give much of a damn about telling rousseau's back story, but were incredibly determined to explain to the audience how montand lost his arm. damon lindelof: and we're gonna go a lot further with it but if you look very carefully - there is a violin case that montand is carrying around. so the whole idea that montand was an aspiring concert violinist once he finished this research trip. the fact that he lost his arm is all the more tragic. carlton cuse: yeah. well, apparently, the arm was the least of his problems ultimately, wasn't it? damon lindelof: that is true. carlton cuse: he got sucked down there by smokey into? would you say that's smokey's main house or his summer palace? damon lindelof: i would say it's his camp david. when he is not where he lives, that's just where he hangs out. we referred it internally as the declivity. carlton cuse: the declivity in the temple wall. damon lindelof: yes, exactly. well that isn't necessarily saying that that is the temple. but that is perhaps the outer wall of the temple. carlton cuse: yes. the temple would be just on the other side, you might have to hike a little bit. damon lindelof: will we be returning to this location again, carlton? carlton cuse: damn straight we will, damon. damon lindelof: and are we supposed to infer that as a result of descending into the declivity when robert and the rest of the team went down there that they came back a little different? carlton cuse: they came back a little wacky and rousseau was very concerned about their behavior. whatever happened to them down there the encounter with smokey did alter them and not for the better. damon lindelof: they didn't seem wacky to me, they seem perfectly rational, except robert tries to shoot rousseau of course. carlton cuse: yeah. that wasn't good. but then of course rousseau had popped? i assume that was brennan and lacombe. damon lindelof: yes. so, it's which, who went wacky first, the chicken-and-the-egg. carlton cuse: we also saw a very sane rousseau at least at the beginning of this. very kind of a wonderful actress. rousseau was kind of a nice girl until everything went wrong for her, wasn't she? damon lindelof: yeah. well, you know, the island will do it to you. especially when people are flashing into out of existence and disappear and? oh, it's just a wild and wildly place, isn't it? carlton cuse: that is a very wild and wildly place. so, i don't think we can really say too much about episode 507 other than it's called \"316\" which is confusing enough in itself. damon lindelof: speaking of confusing. when carlton says \"episode 507\" which is the next episode you seen? we actually wrote 506 and 507 fairly simultaneously. carlton and i wrote both those scripts. you know, one of them is called \"the life and death of jeremy bentham\" , the other is \"316\" , and for reasons that will become apparent you once you've seen both episodes - they can sort of be watched in either order. but we actually felt like the order that made more sense, i mean was cooler, was to show \"507\" first. this is only happened once before in the history of the show for those of you die-hard fans, we challenge you to figure out when that was. carlton cuse: that was way back. damon lindelof: way back in season 1. carlton cuse: in season 1. so, anyway, \"316\" felt like it was better to see in front of the \"the life and death of jeremy bentham\". and that episode as the title may infer, you know, has to do with <mark>locke</mark>. but i, there is probably some good information to get in \"316\" before we get to explaining how was that <mark>locke</mark>? well i guess if it's called \"the life and death?\" i would assume that we're gonna find out? damon lindelof: how <mark>locke</mark> ended up in that coffin. carlton cuse: that's right. damon lindelof: it's exciting. carlton cuse: that's good. damon lindelof: well, i can't wait. carlton cuse: we're blasting long here today folks and not gonna take a lot of your precious time. and we're gonna go right to? damon lindelof: i wouldn't really use the word \"blasting\". carlton cuse: questions! damon lindelof: all right, carlton, you're wannago first, you obvious are very excited. carlton cuse: i am very excited! damon lindelof: ok, go for it. who is this from? carlton cuse: ok. there is a sort of a theme to my questions today and this is from mostly from canadians and this is from red deer in alberta, canada. \"which cast member of lost would you like to see become a successful cast member of the show\" dancing with the stars \"?\" damon lindelof: wow! hmm! wow! that is an question! i think the obvious answer here is hurley. carlton cuse: did you see the steve wozniak is gonna be on \"dancing with the stars\" this season? damon lindelof: no i didn't see that. what did they pay you? what did they pay you to plug \"dancing with the stars\" ? carlton cuse: nothing! damon lindelof: i did not see that but i will be tuning in because? carlton cuse: lawrence taylor and woz going head to head? come on. damon lindelof: that's unbelievable. you're not really interested in how i would answer this question. you just were like \"oh, here is my opportunity to make?\" carlton cuse: no, no, no! hurley, please! please, tell me why hurley? damon lindelof: i would like to see jorge because i believe he could win \"dancing with the stars\". and i've seen jorge's moves and they are impressive to say the least. and that would be my guess. well, i can't wait to see what the emergent theme of your questions, carlton. i have some suspicions they're all involve you getting paid by abc for plugging their shows. my question is from todd b. in ann arbor, michigan. carlton cuse: uhhh! home of the dharma initiative? damon lindelof: that is my understanding. \"in the episode\" jughead \"when desmond finds theresa after talking to janitor in oxford. is theresa in the same kind of time trance as eloise the rat or george minkowski from the freighter?\" this is a serious question, carlton, because we often? carlton cuse: i would say that's a very perceptive observation, i mean, clearly, we kind of have some information from \"the constant\". there was some research going on with faraday that involved other subjects and it's entirely plausible that his friend theresa might have been someone who he tried to do little consciousness travelling with. and things didn't work out too well. damon lindelof: i really hope we'll see theresa again because i'd like to know the answer to this question. carlton cuse: well, i think you might! that's exciting. damon lindelof: you heard it here first folks. carlton cuse: right, damon, here we go. damon lindelof: all right, you ask your silly questions and i'll ask the questions people want answered. carlton cuse: \"hi damon and carlton\" , this is good. you answer canadian questions, right? \"the\" oceanic 6 \"needs to take <mark>john locke</mark>'s body back with them to the island. oceanic 815 also had a body on board christian shephard. so, my question is\" what's christian shephard's body in any way a factor in the 815 making it to the island? and if <mark>locke</mark> might not be gone for good, as ben suggested, is resurrection of a sort possible for christian? \"i know you guys said definitively that he was dead, but is he more than just an image that island is using to communicate?\" damon lindelof: well, i'm afraid we don't answer canadian questions. (carlton and kris are laughing) but that was really well thought out to? just nothing against canada, there are many wonderful people there, but we don't answer. well, in all seriousness, i think that this is an excellent question and in next episode \"316\" you might find someone is talking about <mark>john locke</mark>'s body in relation to christian shephard's body and the word \"proxy\" might be mentioned. that's your word for the day - \"proxy\". (carlton and damon are pronouncing word \"proxy\" simultaneously) carlton cuse: awesome. ok. damon lindelof: all right, carlton. i said only straight serious questions. this is one that i'd never been ask before and i think jae dally from chicago, illinois wants to know and this is one that i know you can answer. \"what happened to bpo bpo, sun's dog? was the dog put in a kennel before sun and jin got on flight 815? if so, did sun pick up bpo bpo after getting back from the island?\" carlton cuse: good god? bpo bpo is with libby and kate's plane and they're having their own spin off series. damon lindelof: well, there you go. coming soon on abc? carlton cuse: bpo bpo? i am just gonna say right now bpo bpo might be one of those mysteries that just doesn't get answered by the end of year 6. damon lindelof: bpo bpo is right there at the top of mysteries that we don't think are mysteries. of which there will be many hounding us at the end of the show. carlton cuse: oh! hounding us? damon lindelof: oh, good god! next question. final question, carlton. you have a final one then i have a final. carlton cuse: all right. this is sticking with my theme, this is from jessy in toronto, ontario. \"hey, guys!\" one of your loyal canadian fans here, damon. \"just had a question from season 4 episode\" the other woman'. during that therapy session with juliet and harper harper mentions that juliet looks like her. i was wondering if this was a reference to either ben's mother or ben's childhood friend annie both of whom share resemblance with juliet. thanks. \"damon lindelof: that's a very insightful question and i think hopefully you'll be getting the answer before the series is over but you're asking exactly the right question. my therapy says that basically your mother is the only one who counts in so you keep sort of trying to replicate that through your life. carlton cuse: ok. damon lindelof:\" dear sneaky executive producers! you are so busted! \"says stacey je from raleigh, north carolina .\" i'm not sure where all that zombie talk originated but you guys have known all along that season 5 would in fact be the zombie season. jin and danielle raised from the dead, jin's lips even look to little zombiesh when they pull him to shore, could have been the sun and salt water, but my money is on zombie. and i have no doubt that once <mark>locke</mark> is brought back to the island he will also take zombie form and live again. what's next? nikki and paulo up from their graves? that's it - no question. just wanted you to know that the jig was up, or is it gig? ok, that's my question - is it jig or gig? \"carlton cuse: (laughing) i think it's jig, i think a gig? i think it's jig. the jig is up like? i keep thinking of like some sort of you know old like warner brothers crime drama -\" the jig is up, damon \". damon lindelof: if you think about the origin of it\" the jig is up \". is this some sort of a dance thing just to go back to your? it's like basically everybody is kind of a dancing around and the guy says\" all right everybody, the jig is up! \"carlton cuse: the jig is up. it's for addition. hide the bottles. here we come with the tommy guns. damon lindelof: right. so i'm wannago with jig. carlton cuse: and i'm wannasay\" stacey, we're busted \". that's it. you have done it. people ask us all the time how the fan ever figure out the show, the answer is\" yes, stacey, you have \". season 5 is zombie season. damon lindelof: season 5 is in fact zombie season. carlton cuse: subversively hidden under the guise of time travel. damon lindelof: all righty, well, why even continue? great podcast. by great i mean mediocre. carlton cuse: i'm sorry we couldn't get to this question which is, you know\" damon and carlton, if you wrote star wars episodes 1 through 3 what major changes would you have made? \"damon lindelof: i'm glad that you didn't get to that question here day. carlton cuse: that's for another time. damon lindelof: yeah, let's start with the jar jar? star wars has own nikki and paulo. carlton cuse: all right, guys, well, thanks for checking us out this week. we will back to you very soon with another lost podcast and hope you enjoy the show this week and thanks as always for paying attention. carlton cuse: bye! lost final theme. concluding part as always) retrieved from\" "}, {"articleID": "2017050913_00215079_W", "names": {"Claire Jones": ["Q16728064", "Q5125234", "Q58023339"], "Harry Hughes": ["Q10413311", "Q5669862", "Q880642"], "Michael Warner": ["Q1929737", "Q56554754", "Q6835220"]}, "date": "2017-05-09", "url": "http://www.newhamrecorder.co.uk/athletics-newham-essex-beagles-team-manager-rowan-griffiths-says-title-challenge-is-plausible-after-second-place-in-opening-match-1-5009552", "content": "Athletics: Newham & Essex Beagles team manager Rowan Griffiths says title challenge is plausible after second place in opening match PUBLISHED: 14:00 09 May 2017 Ned Keating Newham & Essex Beagles team manager Rowan Griffiths (left) (pic: <mark>Claire Jones</mark>) © <mark>Claire Jones</mark> Beagles only finished behind Birchfield Harriers in Sheffield on Saturday Share Comment Email this article to a friend To send a link to this page you must be logged in. Team manager Rowan Griffiths believes Newham & Essex Beagles can mount a challenge for the British League Premier Division title this term after finishing second in the opening match. Beagles were only beaten by Birchfield Harriers in Sheffield, taking seven victories on the day. It was a positive start to the campaign for Beagles, and Griffiths knows it means the club can aim high this season. \"It's been a number of years since we've been able to talk about a serious title challenge, but the start to this year has put us in a good position,\" he said. \"In previous years, we've had a lot of athletes away in warm weather training camps, so it's often hard in the first match, but we've started well .\" We had the smallest squad of the eight on the day and were only beaten by Birchfield, who had the biggest, so it's a great achievement. \"Two of those six wins for Beagles came in the javelin, with <mark>Harry Hughes</mark> (72.03 m) claiming the\" A' string and Chris Hughff (62.93) the victor in the \"B' event. And Griffiths was understandably delighted with the clean sweep for Beagles in the javelin events in Sheffield .\" <mark>Harry</mark> is only 19 and still a young lad, so to throw over 72 metres in windy conditions was good, \"he added .\" Chris is 35, so the two boys are at either ends of their careers, but they egg each other on in training, but maybe it's time for <mark>Harry</mark> to shine now. \"Other wins went the way of Alex Al-Ameen in the\" A' 110m hurdles and Hassan Abdel Gawad in the \"A' hammer event. Both Nigerian Al-Ameen and Gawad of Egypt have represented their countries internationally, and Griffiths believes both will prove to be key members of the squad .\" Hassan was great on his British League debut for us and so was Alex, both are world class athletes so hopefully there is more to come from them, \"he said. There was a popular winner in the\" B' 3000m as Frank Baddick came home in eight minutes 31 seconds to claim victory, much to Griffiths' delight. \"Frank has probably scored more points for us in the British League than anyone else and he always gives it a real good go,\" said the Beagles team manager. The other winners for Beagles in Sheffield were Matthew Roberts in the \"A' high jump, and the 4x100m relay quartet of Aidan Steers, Emmanuel Stephens, <mark>Michael Warner</mark> and Lennox Thompson. Related articles Athletics: Newham & Essex Beagles team manager Tim Mundle praises team's commitment after UK Athletics League opener in Wigan"}, {"articleID": "2018121917_00369868_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-12-19", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future."}, {"articleID": "2009101703_00047790_W", "names": {"John Kinsella": ["Q1101300", "Q11866752", "Q16145390", "Q290642", "Q6243170", "Q6243174"], "Tony Hunt": ["Q19958133", "Q21461768", "Q630854", "Q7822609"], "James Rankin": ["Q43068547", "Q56290814"], "Simon Scott": ["Q18358907", "Q18688616", "Q7519748"]}, "date": "2009-10-17", "url": "http://irishexaminer.com/ireland/kfaumhojmhoj/rss2/", "content": "share + wire-tap was knockout blow for <mark>kinsella</mark> defence by cormac o'keeffe saturday, october 17, 2009 <mark>john kinsella</mark>'s case is unique in many ways. he was convicted in relation to a drugs haul in belgium, even though he was in ireland when they were seized. in addition to that, the main evidence against him were foreign wire-taps of phone conversations of him obtained by dutch police. conspiracy to import drug charges are very rare in irish courts. the case had thrown up substantial difficulties in terms of admissibility of evidence and <mark>kinsella</mark>'s right to privacy. the trial was set to be, in the words of judge <mark>tony hunt</mark>, a \"complicated, lengthy and expensive\" , involving large a number of witnesses from abroad and \"substantial\" issues of law. but, at the eleventh hour, on the day before the trial was due to begin at the dublin circuit court, <mark>kinsella</mark> changed his plea to guilty. yesterday, he received a 12-year prison sentence, with two years suspended, backdated to his detention on september 26, 2006. <mark>kinsella</mark> had little reason leading up to that date to believe that he was being monitored. as with most garda drug investigations, it began when the garda national drug unit (gndu) received information that a group of irish criminals, along with other criminals, based in spain and possibly holland, were going to be involved in bringing in a substantial amount of heroin into the country. \"officers from the gndu approached those countries,\" said a garda source. \"one of the main suspects mentioned was <mark>james rankin</mark>, who was well known to us as a criminal .\" <mark>rankin</mark> was arrested by the dutch police after the drugs were seized and was subsequently sentenced to eight years by a belgian court. after being approached by the gndu, dutch police placed an intercept on <mark>rankin</mark>'s mobile phone. \"it became apparent that <mark>rankin</mark> was in the immediate process of sending in a substantial quantity of drugs,\" said the garda source. \"he made contact with a number of irish numbers, including a number that was identified as being used by <mark>john kinsella</mark>. he was known to us. it became apparent his involvement was on the irish end .\" we're quite happy he's not the main person and that there was a mr big controlling things. \"he said the night before the seizure in belgium on september 26, <mark>rankin</mark> picked up a man, <mark>simon scott</mark> whittard, at schipol airport .\" they travelled to belgium and were under observation by the dutch. it became apparent that whittard was going to be the courier. we picked that up from conversations between <mark>rankin</mark> and <mark>kinsella</mark>. <mark>kinsella</mark> said to make sure whittard was \"suited and booted'. whittard suffered from drink problems, so that was to make sure he had a suit and a laptop .\" the source said <mark>rankin</mark> and <mark>kinsella</mark> did not mention the word drugs in their conversation, but discussed exact quantities - the same as those seized. they also discussed a \"bird in the sky\" , referring to a plane. the gndu were able to establish there was an irish plane landing at the same time whittard was due to land. he said the plane <mark>kinsella</mark> had hired from businessman jim mansfield - along with two pilots - was at wevelgem airport in belgium to transport whittard and packages back to weston aerodrome. when belgium police established the plane was due to land at weston, they arrested whittard and seized the drugs. back in ireland, the gndu arrested <mark>kinsella</mark>. \"he denied any involvement, right up to the trial and changed his plea on october 5,\" said the garda. he also said that on a practical level there was \"exceptional\" cooperation between the gndu and spanish, dutch and belgian police authorities. but he said the problems came at the judicial end. he said this had been the third attempt at a trial. initially the belgian authorities tried to extradite him, but <mark>kinsella</mark> fought that. he later changed his legal team, further delaying matters. the garda said the case was \"the most contested pre-trial case\" the gndu had ever been involved in. \"there were so many difficulties regarding evidence. the other countries have different procedures to here. we never had so many meetings with the state .\" he said the police in holland and belgium are not typically questioned in court, and some have never been in court. he said a major obstacle was the admissibility of wire-tap evidence from a foreign country. \"the issue is there is no legal constraint to using wire tap evidence from abroad here, but the law doesn't say it can be used either. the defence said it was unconstitutional until the last day .\" he said they had 35-40 dutch prosecution people, including magistrates and police, to give evidence. the prosecution also had on hand a voice expert. judge <mark>hunt</mark> referred to the legal points yesterday, much of it around the wire-tap evidence. he said the right to privacy - as had been argued by the defence - did give way to other rights, including the right of public interest in investigating serious wrongdoing. he said the \"democratically expressed policy\" in ireland now was that wire-tap evidence was accepted. gardaí do not believe this was <mark>kinsella</mark>'s first operation, due to the massive size of the haul and the sophistication of the operation. the situation could get worse for <mark>kinsella</mark>. at the end of yesterday's sentencing, the court set a date for a confiscation order hearing. under the criminal justice act 1994, a court can, in a case where a person is convicted of a drug trafficking offence, make a confiscation order requiring the person to pay an amount equal to what he accrued from drug trafficking. <mark>kinsella</mark> has a property in thailand, a number of bank accounts and the plush family home in navan, once valued at more than € 1 million. this story appeared in the printed version of the irish examiner saturday, october 17, 2009 seems that you don't have adobe flash installed."}, {"articleID": "2011082307_00078863_W", "names": {"Ryan Lucas": ["Q19594165", "Q7384266"]}, "date": "2011-08-23", "url": "http://iol.co.za/concerns-over-libyan-rebel-unity-1.1123137", "content": "august 23 2011 at 09:23 am by <mark>ryan lucas</mark> libya's rebels began as a disparate group of former government insiders, western-leaning intellectuals, businessmen and even a smattering of ex-islamist militants. but they were united by one goal: to unseat muammar gaddafi. they won international recognition by forging a leadership council that espoused democracy. with gaddafi's regime on its last legs, the question now is whether the opposition can take over the plundered country and lead it effectively. the task of putting libya back together after six months of civil war and 42 years of gaddafi rule is all the more difficult because the nation has no experience at the ballot box or with democratic institutions. gaddafi ran the country according to his whims and idiosyncratic political philosophy. and he brooked no dissent. \"the rebels want a libya reconciled with itself, that is democratic, whatever that may mean,\" said george joffe, a libya expert at cambridge university. \"but the way in which they're going to do that isn't clear ....there are absolutely no basic structures they can use .\" without any practical experience to fall back on, the council has done an imperfect job of managing the territory under rebel control since the uprising began feb. 15, when youth activists started protesting in benghazi. as the demonstrations spread and the revolt gained steam, more experienced hands rushed to join the movement and fill the leadership void. eventually, the rebellion formed the national transitional council. members are representatives from each rebel-held city, and are selected by similar local councils. heading the ntc is mustafa abdul-jalil, a pious former justice minister who joined the rebels in the uprising's first high-level defection. despite past links with the gaddafi regime, he enjoys the respect of broad swaths of the rebel public for his criticism while minister of the tight control of security forces. but he is not considered a strong leader or a dominating personality. abdul-jalil is one of several former regime members who make up a powerful bloc on the council. the group includes the head of the rebels' acting cabinet, mahmoud jibril, as well as the rebels' chief diplomat, ali al-essawi. jibril, educated at the university of pittsburgh, helped draw up ambitious visions for the future. one of them, titled \"libya 2025: a look ahead,\" called for a restricted role for the state, free expression and the opening of the free market. past efforts inside gaddafi's government have earned former regime members respect in rebel-ruled eastern libya. they say they strive to create a democratic state, but they are not natural politicians, and the long periods many spent abroad make them distant figures. the movement also has sought help from libyans who have returned from exile eager to play a role in the nation's rebirth. chief among them is ali tarhouni, a straight-talking economics professor who left his teaching job at the university of washington to become finance minister in the rebel cabinet. the rebellion has also found space for islamists, including former members of the libyan islamic fighting group, a radical islamist organization that staunchly opposed gaddafi. some high-ranking officials in the rebel security apparatus and military have backgrounds in the group. some divisions have already emerged in the rebel camp, which could expand if gaddafi falls. joffe said the national council's relationship with libya's berber minority in the western nafusa mountains is unclear. the berbers have spearheaded the offensive on tripoli, as well as the uprising in the western port city of misrata that played a central role in the war. \"we don't know whether they'll be prepared to accept leadership of the council\" down the road, he said. \"there are tensions between the islamists on the one hand and the exiles on the other, and there are even divisions among the exiles themselves. there is no obvious leader yet, and that alone is a problem .\" the ntc was on the brink of collapse as recently as late july, with the killing of military chief abdel-fattah younis. younis was a highly divisive figure who served as gaddafi's interior minister until he defected to the rebellion early in the uprising, bringing his forces into the opposition ranks. his move raised hopes among rebels and western allies that the uprising could succeed. but some rebels remained deeply suspicious that he retained some loyalties to the dictator. his body was found dumped outside benghazi, along with two of his aides. the rebel leadership has insisted the assassination was the work of the gaddafi regime, but several witnesses say younis was killed by fellow rebels. the slaying has fueled concerns about unity within the rebel movement, as well as the ntc's ability to impose discipline on the units nominally under its control. it sacked the cabinet in the wake of the killing, and has failed to name a new one. regardless of its failings, the ntc is the only political organization in the rebel camp that has the potential to step in after gaddafi, and the west has pledged to unfreeze billions of dollars in frozen libyan assets to help the council put libya on a new path. for now, gaddafi's regime remains, albeit weakened, and fighting continued monday in tripoli and on other fronts. the rebels on the battlefield remain focused on finishing the job, but also say they are keeping their eyes on the future .? copyright 1999 - 2011 independent online, a division of independent newspapers (pty) limited. the copyright in the literary and artistic works contained in this online news publication and its other related and connected websites, as well as in the published editions of group newspapers, their supplements and any other content or material, belongs exclusively to independent newspapers (pty) limited unless otherwise stated."}, {"articleID": "2015102009_00003400_W", "names": {"Eric Sanders": ["Q3731522", "Q5387430", "Q5387431"]}, "date": "2015-10-20", "url": "http://www.huffingtonpost.com/2015/10/19/driver-swerves-hits-motorcyclist_n_8335616.html", "content": "Texas Driver Slams Into Motorcyclist, Then Says' I Don't Care' Motorist now facing charges of aggravated assault. Ed MazzaOvernight Editor, The Huffington PostPosted: 10/20/2015 03:56 AM EDT A driver was caught on video swerving into a motorcyclist, hitting the bike and knocking both the biker and his passenger onto the ground at high speeds in Texas on Saturday. Motorcyclist <mark>Eric Sanders</mark> suffered a cut on his arm and road burn in the crash. \"I've got a gouge in my elbow that is bone-deep,\" <mark>Sanders</mark> told WFAA, the ABC station in Dallas. His passenger, Debra Simpson, had to be airlifted to a hospital, where she was initially placed in intensive care. She suffered a broken wrist with deep arm lacerations, according to CBS DFW, but was transferred to a regular room on Monday. She is now in stable condition. When confronted about the incident, the motorist who hit them had just three words to say, all of which were caught on the video: \"I don't care .\" \"That's the worst thing, when I saw that dude saying,' I don't care, I don't care .' He says it four to five times,\" <mark>Sanders</mark> told WFAA. \"I've never seen this guy in my life. And he ran me over .\" Driver William Crum, 68, was charged on Monday with two counts of aggravated assault with a deadly weapon, according to The Associated Press. Each count has a maximum penalty of up to 20 years in prison if convicted. Footage recorded by another rider shows <mark>Sanders</mark> crossing the double-yellow line to pass Crum on a two-lane road in Granbury, about 70 miles from Dallas. Crum then swerves, hitting <mark>Sanders</mark>: After saying \"I don't care\" several times, Crum claims that he was stung by a wasp. He later told CBS DFW that he was bitten by a spider. \"It bit me right in the tendon, so right now I have a tendon that's hurting if I stand. If I walk off I'll limp,\" Crum said. Crum told WFAA he wished he could \"go back in time,\" but also indicated that while he'd apologize to the passenger, he had no apologies for <mark>Sanders</mark> \"because he was doing something illegal\" in trying to pass him. WFAA reports that <mark>Sanders</mark> was also cited for passing in a no-passing zone and driving with an invalid license. However, <mark>Sanders</mark> wrote on Facebook that he tried to pass despite the double yellow line because Crum had slowed to about 40 mph on a road where the speed limit was either 60 or 65 mph. While he's been getting plenty of messages of support, <mark>Sanders</mark> has also heard from some who blame him for the incident. \"I'm glad your woman lived,\" someone wrote to him in a post shared on Facebook. \"It's too bad you did .\" <mark>Sanders</mark> has set up a GoFundMe page, saying he and his girlfriend will be out of work for several weeks as a result of the accident."}, {"articleID": "2011062107_00044578_W", "names": {"John Morris": ["Q19276793", "Q19325579", "Q203188", "Q21501583", "Q24844367", "Q3048680", "Q48744064", "Q53774610", "Q54635355", "Q56036931", "Q6249470", "Q6249477", "Q6249486", "Q6249491", "Q6249494", "Q6249495", "Q6249496", "Q6249497", "Q931890", "Q958669"]}, "date": "2011-06-21", "url": "http://medicalnewstoday.com/articles/229073.php", "content": "5 (3 votes) quadriplegic passenger, <mark>john morris</mark>, 24, was taken off a frontier airlines jet after a pilot refused to allow him to fly because of safety concerns. the pilot said the seat belt extension was not adequate enough to hold <mark>morris</mark> still. <mark>morris</mark> became paralyzed after a snowboarding accident five years ago. the airline has apologized for the incident. in a statement, frontier airlines said: \"we're sorry for the incident and are investigating its handling. in this situation we had a well-intentioned pilot who was seeking to do the right thing to ensure the safety and compliance of all involved .\" <mark>morris</mark>'s mother, kathleen, who was with him on the plane, told abc-tv, a denver station that the pilot made his assessment without coming to have a look. she said that the pilot was not willing to come back and talk to <mark>morris</mark>, who said he felt humiliated. apparently, one of the flight attendants saw <mark>morris</mark> when he was strapped in and said they would have to clear it with the captain. <mark>morris</mark> has limited upper body control. kathleen <mark>morris</mark> could not understand how the airline refused the return flight when they had flown him from denver to dallas to attend a family wedding two days earlier - it did not make any sense. eventually the airline called airport police and three officers boarded the plane. according to kathleen <mark>morris</mark>, the officers told the pilot that <mark>morris</mark> looked safely restrained and not a problem for the plane or other passengers, therefore it was not a law enforcement matter. apparently, the pilot still refused to take off with <mark>morris</mark> on the plane. kathleen <mark>morris</mark> claims the officers were sympathetic and told her \"this is wrong .\" <mark>morris</mark> had flown with frontier airlines before. each time he would use the seat-belt extension to secure his chest and legs. <mark>morris</mark> managed to get on a later flight to colorado on the same airline. frontier airlines added: \"we will be taking the steps necessary to ensure clarity on the policies so that the situation is not repeated. once the investigation is concluded, we will be sharing the outcome with the family involved .\" quadriplegia refers to the paralysis of all four limbs - the adjective is quadriplegic. quadriplegia is usually caused by a high spinal cord accident or stroke. paraplegia refers to paralysis of the lower part of the body including the legs - the adjective is paraplegic. approximately 250,000 people in the usa have a spinal cord injury. 52% of them are considered paraplegic and 47% quadriplegic. according to the nih there are about 11,000 new spinal cord injuries each year. 82% of spinal cord injuries occur in males. over half of all injuries affect individuals aged between 16 and 30 years. the main causes of spinal cord injuries are: automobile accidents - 37% violence - 37% falling accidents - 21% sporting incidents - 6% other causes - 8% written by christian nordqvist copyright: medical news today not to be reproduced without permission of medical news today add your opinion please note that we publish your name, but we do not publish your email address. it is only used to let you know when your message is published. we do not use it for any other purpose. please see our privacy policy for more information. if you write about specific medications or operations, please this is to help prevent spam submissions. please enter the words exactly as they appear, including capital letters and punctuation. * * fields marked with a * need to be filled in before you hit the submit button. for any corrections of factual information, or to contact the editors please use our these are the most read articles from this news category for the last 6 months: 20 dec 2010 carcinogenic hexavalent chromium, the \"erin brockovich chemical\" was found in the tap water of 31 cities out of a total of 35 tested by the environmental working group. the scientists estimate that at least 74 million people...do all women \"experiment\" with lesbianism in college? not even close"}, {"articleID": "2014040602_00029744_W", "names": {"Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2014-04-05", "url": "http://ktvz.com/news/Pendleton-church-sacrifices-annual-mission-trip/25339300", "content": "PENDLETON, Ore. (AP) - The annual mission trip is a big deal for the youth at Pendleton's First Assembly of God. The destination remains a mystery until the unveiling, which their leader does with flair during a youth group meeting. By the end of his verbal intro, the name of the country is projected onto a screen. This year, the students got a shock. When the moment came, the words \"Sacrifice Trip\" glowed bright. Dead silence. The teens worked out what the words meant. Pastor Kyle Chalko explained that the trip was actually a non-trip. The kids would raise money to support an existing missionary in <mark>Jordan</mark> by buying her a car and other tools she needs in her ministry. The youth had met the missionary, a woman who works with Syrian refugees, and liked her. But, still, they couldn't help but feel momentarily let down. \"I was disappointed at first,\" said Joyce Chen, 15, who had traveled to Haiti and Nicaragua on past trips. \"I love missions. When I found out we weren't going anywhere this year, it was hard for me .\" Her friends Tiffany Armstrong and Paisley Schulze echoed her sentiments. But these are kids who often approach life by getting on their knees and praying for guidance. They said they quickly came to embrace the idea of giving instead of going. Daniel Van Cleave, 18, donates money he gets from mowing lawns and simply not buying things. Armstrong, 15, gave the money she had saved for a car. Everyone figured out some way to contribute. They will continue to earn, resist buying stuff and give. \"It's a really good opportunity for all the kids at this youth group to have a big impact in a very visible way in the country of <mark>Jordan</mark>,\" Van Cleave said. \"Supplying someone with a car, it's a tangible thing. Our missionary will be able to drive where she needs to go .\" Chalko said he didn't make his decision lightly. \"I'm a huge believer in missions,\" Chalko said. \"They can see with their own eyes a tent city in Haiti or the slums in Nicaragua. It opens their eyes .\" Chalko himself had gone to Peru at age 15. The poverty he saw there stunned him and sparked a lifelong desire to do mission work. Though he loves missions, something weighed heavy on him - the cost. He wondered if the orphanages and other places they help could do more with cash than a temporary teenage workforce. \"We spend a lot of money on missions,\" he wondered. \"Is it worth it?\" Two years previous, it had cost $44,000 to transport 22 students to Haiti to help with a post-earthquake feeding program. Last year, he took 32 students to Nicaragua at a cost of $70,000. Chalko had asked the hosting pastor if he would rather have 32 kids or the money. He pondered the question. That's tough, he admitted. While he knew the transformation being done in the teens' hearts and minds, the $70,000 would allow completion of an orphanage. The pastor's comment echoed those of others who Chalko had questioned in previous years. He pulled the trigger on the sacrifice trip for just this one year. Next year, the group will likely travel again. Some of the adult church members have gotten on board. One sold an extra car that wasn't driven much. Another donated a baseball signed by <mark>Michael Jordan</mark>. The money raised will go to the <mark>Jordan</mark> missionary through the Speed the Light organization. The group uses money raised by youth ministries to buy transportation for missionaries that includes cars, donkeys and boats. The woman in <mark>Jordan</mark>, where it is illegal to be a missionary, is in the process of starting a women's - only coffee shop where she will be able to interact with Jordanian women. ___ Information from: East Oregonian, http: //www.eastoregonian.info Copyright 2014 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Comments The views expressed are not those of this company or its affiliated companies. Please note by clicking on \"Post\" you acknowledge that you have read the Terms of Service and the comment you are posting is in compliance with such terms."}, {"articleID": "2018040916_00114821_W", "names": {"Brian Morrison": ["Q20737985", "Q3644491", "Q39074057", "Q4964815", "Q57439709"]}, "date": "2018-04-09", "url": "http://livingstondaily.com/story/sports/high-school/baseball/2018/04/09/2018-livingston-county-high-school-baseball-preview/471190002/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Email Twitter Google + LinkedIn Pinterest A look at Livingston County's 2018 high school baseball teams Baseball is traditionally a strong sport in Livingston County. The 2018 season should be no exception. Post to Facebook A look at Livingston County's 2018 high school baseball teams Baseball is traditionally a strong sport in Livingston County. The 2018 season should be no exception. Check out this story on livingstondaily.com: https: //ldpaa.com/2qgvi8Q Cancel Send Sent! A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE BRIGHTON ► Last season: 28-7 overall, 14-2 KLAA West; KLAA West, Lakes Conference champion ► Top returners: Cameron Tullar, P-OF, Sr.; Rudy Ramirez, P-OF, Sr.; Kyle Hook, SS, Sr.; Andrew Gilpin, 1B-P, Sr.; Jack Brenner, 3B-P, Sr.; Jack Krause, OF, Jr.; Camden Benedict, 2B-P, Jr. ► Outlook: Winners of a seventh KLAA West championship in the past nine years, Brighton is back with another loaded lineup looking to make a run at a state title. Led by a large returning cast and the 1-2 punch of Cameron Tullar and Rudy Ramirez on the mound, the Bulldogs might just have the ability to do it. Tullar and Ramirez were two of the best pitchers in the state last season, who also provided at the plate. Brighton's success will start with those two. ► Coach Charlie Christner: \"We are returning a very good core of players who have a lot of varsity experience. We are also adding in some new players who we feel will be able to contribute to this year's success. For me, it always comes down to pitching and defense, and these are the areas we feel really good about going into the season. Our schedule is going to be very challenging .\" SPRING SPORTS PREVIEWS ► Livingston County's 2018 preseason top 5 baseball players ► Livingston County's top 5 boys track and field athletes ► A look at Livingston County's boys track and field teams ► Livingston County's top 5 girls track and field athletes ► A look at Livingston County's girls track and field teams ► Top 5 boys lacrosse players in Livingston County ► A look at the Livingston County's 2018 boys lacrosse teams Junior JT Maybee is one of the top returning players from a Fowlerville baseball team that won a league and district title last season. (Photo: Kevin W. Fowler / for the Lansing State Journal) FOWLERVILLE ► Last season: 27-9-2 overall, 10-0 CAAC White; district champion ► Top returners: Trevor Miller, 3B-1B-P, Sr.; Nathan Southgate, 1B-P, Sr.; JT Maybee, OF-IF-P, Jr.; Sam Browne, C-P, Jr.; Wyatt Daniel, SS, Jr. ► Outlook: League and district champions last season, Fowlerville lost quite a bit of talent in the offseason, including its top three pitchers in Eric Fritz, Wyatt Thomas and Nate Leonard, who were all also top-of-the-order hitters. That group will be difficult to replace, but the Gladiators feel they do have the pieces with Miller, Southgate, Maybee and Browne back to contribute on the mound as well as help inflict damage in the lineup. ► Coach Matt Hunt: \"Our guys have been working extremely hard. The coaching staff has been stressing confidence and maximum effort in everything we do around the program. That includes in practice, the classroom, the weight room and nutrition. It has been a real culture change around the program. We are excited to see our results and what our young guys can do .\" Hartland's Max Hendricks was 11-1 last season. (Photo: Timothy Arrick/For the Livingston Daily) HARTLAND ► Last season: 33-7, district champion ► Top returners: Max Hendricks, P, Sr.; Ian Kenrick, OF, Sr.; Tommy Lappin, C, Sr.; Jake Moyer, CF, Sr.; Logan Tobel, 1B, Soph. ► Outlook: Hartland has a certified staff ace in Hendricks, who was 11-1 with a 1.22 ERA last year. Hendricks is the last holdover from Hartland's 2015 Division 1 championship team, going 3-for-5 in the state final. Finding a No. 2 pitcher to close out doubleheaders will be a key for the Eagles. Lappin will be a full-time catcher after also playing outfield last season. This is an athletic team with two college recruits in baseball (Hendricks, Moyer) and two in football (Lappin, Kenrick). Tobel is a future star who was a rare freshman last year who could start at one of the county's big three programs. ► Coach <mark>Brian Morrison</mark>: \"We are athletic. I would expect us to be really good on defense. I expect us to be able to run a little bit. We've just got a couple guys who have to step up at the plate and on the mound and be better than expected. It's pretty much the same every year .\" Howell's Johnny Shields slides home against Brighton on April 21, 2017. (Photo: Jim Jagdfeld/For the Livingston Daily) HOWELL ► Last season: 29-10-1 overall, 12-4 KLAA West; district champion ► Top returners: Ty Weatherly, P-IF, Sr.; Jake Falzone, P-OF, Sr.; Blake Arnold, P, Sr.; Brandon Maki, 1B, Sr.; Johnny Shields, SS-P, Sr.; Jack Rossbach, IF-P, Sr. ► Outlook: The Highlanders no longer have 2017 Mr. Baseball Sam Weatherly on the mound, but they have several capable arms in their rotation. Ty Weatherly, Sam's brother, is a Ball State University recruit who was 5-0 with a 1.89 ERA last season. Howell graduated eight players who are competing in college baseball. The Highlanders have lost plenty of good players over the years, but keep producing more, which is how they've put together a string of six straight district championships. ► Co-coach Mike Weatherly: \"We have a good blend of experienced returners and newcomers. We have depth in our pitching rotation, returning experience defensively, and good speed and power offensively. Extremely coachable group that is eager to get going with the 2018 season .\" PINCKNEY ► Last season: 11-19 ► Top returners: Al Thorington, P-OF, Jr.; Drew Cortez, OF-SS-P, Sr.; Jack Wurzer, P-SS, Sr.; Dalton Knightley, 3B-1B-P, Jr. ► Outlook: It's an exciting time for Pinckney baseball, which should be on a bit more even ground after leaving the KLAA and joining the SEC. While the Pirates had trouble contending in the KLAA, they do have some key players back from a team that split a doubleheader with West Division champion Brighton last season. Thorington, one of the county's top players, drove in both runs in a 2-0 victory over Brighton. ► Coach Ryan Rogowski: \"The Pinckney Pirates have a lot of starters returning, but also add a lot of young talent to the roster this year. We have three freshmen and four sophomores that will all see significant playing time (and) help this team compete for their first SEC title .\" CONNECT TWEET LINKEDIN COMMENT EMAIL MORE"}, {"articleID": "2015012712_00019849_W", "names": {"Michael Owen": ["Q1061908", "Q128829", "Q17198421", "Q6833276"], "Tom Craig": ["Q16214797", "Q21934234", "Q30678500"]}, "date": "2015-01-27", "url": "http://edinburghnews.scotsman.com/sport/golf/sgu-chairman-we-must-end-gender-divide-1-3671052", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Student dies in window fall horror after party Carer \"tied toddler to chair and threatened him' Boy, 11, fights for life after being hit by car Hearts trio set for Tynecastle exit Double death tragedy for girlfriend of fall student Tram fall cyclists to sue\" negligent' council Hibs hope to be debt free in ten years Jason Cummings just like <mark>Michael Owen</mark> Lothian Buses row: Huge salaries to be axed Another step towards Scottish golf becoming a gender united body will take place in Edinburgh next weekend. A fresh proposal to amalgamate the Scottish Golf Union and Scottish Ladies Golfing Association will be put to a vote at the latter's annual general meeting in the Capital on Saturday week. If successful - and the SLGA membership agreed to it last time around - then the spotlight will be back on the men. In 2012, the SGU failed to gain sufficient support for the proposal and since then a lot of work has gone in to try and rebuild bridges. As the attempt to make it second-time lucky gathers pace, Capital clubs are being urged to have their say though voting in an independent poll. Now open and running until February 27, it is being conducted after agreement between the SGU Board and Area Associations, of which the Lothians is the largest. \"We encourage and advise all affiliated SGU clubs to vote in the independent poll,\" said SGU chairman <mark>Tom Craig</mark>. \"Currently, this is the most significant issue facing Scottish Golf. Amalgamation is fundamentally important to building a modern, democratic, inclusive governing body for Scottish amateur golf .\" It is vital we pass on a fit for purpose organisation for the next generation to take the game forward. \"It creates the opportunity to build an effective partnership among golfers, Clubs, Areas, Counties, Board and staff for the greater good of Scottish Golf .\" A single body will help attract more women into golf and remove some of the stigma of a male-dominated game. \"Meanwhile, world No. 2 Henrik Stenson has still to decide if he'll play in this summer's Aberdeen Asset Management Scottish Open at Gullane. The Swede used the event two years ago as the springboard to his rise back up the world rankings, finishing second to Phil Mickelson in The Open at Muirfield the following week before going on to top the money-list on both sides of the Atlantic. But Stenson didn't play in last year's Scottish Open at Royal Aberdeen and has yet to make up his mind about heading to East Lothian in July. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. Edinburgh Evening News provides news, events and sport features from the Edinburgh area. For the best up to date information relating to Edinburgh and the surrounding areas visit us at Edinburgh Evening News regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Digital Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}]