[{"articleID": "2014010906_00061906_W", "names": {"Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Stephen Jones": ["Q11836360", "Q1380938", "Q17476791", "Q2374211", "Q25345871", "Q2670107", "Q4160428", "Q43565191", "Q47119713", "Q56598186", "Q7609616", "Q7609617", "Q7609618", "Q7609619", "Q7609620", "Q7609622", "Q7609623", "Q7612967"], "Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"]}, "date": "2014-01-08", "url": "http://www.bloggingtheboys.com/2014/1/8/5289326/first-coaching-change-dallas-cowboys-chris-boniol-rich-bisaccia", "content": "Dallas' Mr. Reliable is losing his coach. - Matthew Emmons-USA TODAY Sports Dallas Cowboys kicking coach Chris Boniol is leaving the team. \"<mark>Jerry Jones</mark>, <mark>Stephen Jones</mark> and Jason Garrett all made great cases on behalf of me staying, and they've all been tremendous to work with,\" Boniol says. \"But we've mutually agreed to move on, with me having some of the best memories and best accomplishments of my life being part of the Cowboys.\" If there was one coach that no one had any complaints about this year, it is the guy who oversaw punter <mark>Chris Jones</mark> and the extremely reliable placekicker Dan Bailey, or, as KD Drummond prefers to refer to him, \"Split 'em\" . No matter how you look at it, his contributions to the team were tremendously successful. The article does not really give any reasons for the departure, but you have to suspect that Boniol wants to test the market for his services elsewhere, perhaps as a special teams coordinator. Fisher goes on to say that this is an indication that special teams coordinator Rich Bisaccia, another coach who is almost universally seen as having been very successful in 2013, is not likely to be leaving. Bisaccia has a couple of interviews for head coaching positions set up, and his loss would almost certainly have been a negative for Dallas. It looks like Fisher is reading between the lines that the Cowboys would not need to keep Boniol as a possible replacement. He also may have some other information he is not putting in his article. you can check it here, and catch Dawn Macelli's report on the other players already signed .) The players are: Chris DeGeare, guard. 2010 fifth round draft choice from Wake Forest. Played with Minnesota Vikings, spent time on practice squads there and with the Tristan Okpalaugo, defensive end. 2013 UDFA from Fresno State. Signed with Miami Dolphins and spent a week with Minnesota's practice squad, on the street since September. Quinton Spears, linebacker. 2011 UDFA from Prairie View A & M. Signed with Miami, then played most of the season with the Cleveland Browns. Out of the league in 2012, and then was signed by the Jabara Williams, linebacker. 2011 seventh round pick from <mark>Stephen</mark> F. Austin by the St. Louis Rams. Played two games with them, then was released and played a few games with the Chicago Bears. Spent 2012 on the Rams practice squad, and was out of the league last season. Dallas Cowboys News & Notes: For Cowboys, The Sun Always Shines On TV Would Another Dallas-San Francisco Trade Work? about 8 hours ago / 334 comments / 3 recs"}, {"articleID": "2017091500_00227343_W", "names": {"James Woods": ["Q193105", "Q2333487", "Q6145792"]}, "date": "2017-09-14", "url": "https://www.click2houston.com/entertainment/fergie-and-josh-duhamel-announce-separation", "content": "Fergie and Josh Duhamel announce separation Married in 2009, couple split earlier this year By MEGAN THOMAS, CNN Posted: 2:47 PM, September 14, 2017Updated: 3:21 PM, September 14, 2017 Dimitrios Kambouris/Getty Images Josh Duhamel met Fergie when The Black Eyed Peas filmed a cameo on his show \"Las Vegas\" in 2004. They became engaged in 2007 and were married in 2009. More Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat (CNN) - Pop star Fergie and actor Josh Duhamel have announced they are separating after eight years of marriage. \"With absolute love and respect we decided to separate as a couple earlier this year,\" the couple said in a joint statement to CNN. \"To give our family the best opportunity to adjust, we wanted to keep this a private matter before sharing it with the public. We are and will always be united in our support of each other and our family.\" More Entertainment Headlines Amber Tamblyn, <mark>James Woods</mark> continue Twitter spat The two married in 2009 and are parents to 4-year-old son, Axl. The couple frequently posted photos of their time together on social media and spoke affectionately about each other throughout their marriage. In a 2012 interview with Oprah Winfrey, Duhamel said there was \"no question\" his wife was the best thing that ever happened to him. Fergie called Duhamel her \"partner in crime\" and \"soul mate.\" In the same interview, they addressed facing difficulty at times in their marriage and credited each other for becoming better people. Copyright 2017 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2019040423_00097816_W", "names": {"John Mcdermott": ["Q1101311", "Q18433720", "Q4275622", "Q5371876", "Q6247615", "Q6247619"]}, "date": "2019-04-04", "url": "http://www.bendigoadvertiser.com.au/story/5999664/project-horse-breaks-through-for-marshall/?cs=81", "content": "Junortoun trainer Dylan Marshall gets maiden win with \"project' pacer Barbie Mattgregor Tayla Fellows with Barbie Mattgregor on the morning after her maiden win at Maryborough on Thursday. BARBIE Mattgregor has always been a work in progress for Junortoun trainer Dylan Marshall. But the 31-year-old hopes he has gone some way to unlocking the secret to the four-year-old mare, after her win at Maryborough on Thursday. Barbie Mattgregor, who is raced by Steve Clements, from the Brisbane Pastoral Company, has done the bulk of her racing - 35 starts in total - in Queensland and New South Wales - under three individual trainers. Her last six runs have been in Victoria under the stewardship of Marshall, who is the only trainer to get a win with the mare. The hobby trainer, who works full-time as a diesel mechanic, took some encouragement from Barbie Mattgregor's maiden win.\" She has been a bit of a project horse...she had 30-odd starts before yesterday (Thursday) and has been one of those horses who has taken a lot of working out, \"he said.\" They didn't go any spectacular time, but she got the job done. \"With a bit of luck and a sharp breeze, hopefully we have worked her out a bit.\" Being a day meeting, Marshall unfortunately missed the win, with his partner Tayla Fellows taking on the handling duties. The couple operate only a small team of horses from their base, opposite Lord's Raceway, but clearly relish the involvement after more than 10 years in the industry. \"There has been bits and pieces (of success) along the way; we have only ever had a small team, no more than five or six,\" Marshall said. He said Barbie Mattgregor, who was driven for the first time by Michael Bellman on Thursday, would next run at Ballarat on April 16. \"We are trying to keep her to a mile, she doesn't really get the longer trip,\" Marshall said. \"We will certainly have a bit more confidence in her than we did beforehand.\" Also among the winners on Thursday was Longlea trainer <mark>John McDermott</mark>, who scored with Whata Challenge. The five-year-old gelding now has wins in two of his past four starts for McGregor, who has raced the horse since January last year, after formerly being trained by Matt Craven. Have you signed up to the Bendigo Advertiser's daily newsletter and breaking news emails? You can register below and make sure you are up to date with everything that's happening in central Victoria."}, {"articleID": "2013061322_00003906_W", "names": {"Liam Gallagher": ["Q216708", "Q30084404"], "Olivier Martinez": ["Q3351197", "Q504886"]}, "date": "2013-06-13", "url": "http://www.independent.ie/lifestyle/motoring/new-sporty-kia-pro-ceed-is-a-real-hot-hatch-contender-29342928.html", "content": "Government publishes abortion legislation 25-year-old woman arrested in connection with attempted bomb attack on policeman French air controller strike sparks chaos here Fears G8 militants are already in country Quinns claim finance chiefs knew of unlawful Anglo loans Cycleway generates? 1.1 m for community McIlroy to march into eye of storm with Tiger Simon Zebo to start for Lions against Waratahs Double injury blow for Barry-Murphy Nani eyes move to Juventus or Monaco after failing to agree new contract \"Rough Rider' Kimmage is subject of new doc Royal Ascot back on agenda for Dawn Approach EU court rules against Ryanair in airline battle FitzPatrick\" anxious to help' PAC with glass-bottle site probe NAMA boss brands UK rumours of Ulster Bank shares swap as \"kite-flying' DCC succeeds in FTSE 250 listing after quitting Irish exchange Good news for construction sector as output rises Niall Horan gets mobbed after day spent on lavish yacht Jason Segel\" attached at the hip' to new girlfriend Pregnant model Caprice to have two babies in four weeks <mark>Liam Gallagher</mark> to realise his dream and appear on The Voice RTE axes its Premier League show to save station? 1.3 m a year Kim Cattrall sizzles in new stage role Mumford and Sons bassist in hospital with blood clot \"I prefer The Fall to X Files,\" says star Gillian Anderson A favourite child is the final taboo So what's next for Jacko's daughter? Ian Mallon - 13 June 2013 THE year is 1971 and a group of councillors are sitting around discussing the mad idea of putting a \"dual carriageway' (the word motorway was too British at the time) around Dublin. New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Mercedes hoping young owners will opt for\" baby' coupe Look, no hands! My car is driving itself Everybody is falling about at the mad notion of such a thing. One councillor looks set to explode in tears and snot as he can no longer contain his laughter, while another is almost sick with giddy hilarity. The man who brought up the idea lights a cigarette and sits back down, his humiliation complete. The answer to his earlier private consultation about whether he should bring such a notion to the table now very much apparent. And so began the longest running comedy in transport, which was back with a brand new series last week thanks to more cack-handed suggestions from the brains trust which now run such matters. CONTROVERSY And so more than 40 years after the very idea of the M50 was first mooted, it is still causing much controversy, if not as much hilarity. This time around the suggestion is to penalise anybody who uses the entire M50 every day to the tune of? 6.50 - more than three times its current rate. The very idea of putting in five different tolling areas on the M50 goes against everything that we stand for here at Herald Motoring. And the fact that the matter is even on the table without consideration for those who will be out of pocket to the tune of? 32.50 a week for using a road designed to get you around Dublin, is perverse. Leo Varadkar will say such a thing won't happen on his watch - sure isn't the M50 a big part of his constituency. But it looks like the M50 will be getting more and more toll spots in the future, and if there are no provisions in place for the many people who use the entire road every day, well that would be a travesty. Just off the M50 at Ballymount sits the HQ of Kia Ireland, a place that is getting more and more exciting with each visit. This time around I took possession of the Kia pro_cee'd, a lovely looking medium sized car - a heady mix of hot hatch meets cool coupe. The pro_cee'd comes in 1.4 and 1.6 litre diesel engines and comes in at just under? 23,000. The car has been transformed into an extremely sporty and pacy looking machine, thanks to a roofline which has been lowered substantially. When I read about lower rooflines I always fear for my medium sized head, every time I get into any newly height-challenged models. But this is not an issue with the newly-sized c \"eed, which from the inside feels roomy and almost vast for what you are getting. Apart from having a name that looks like it was created in Silicon Valley, the pro_ceed is a car for the modern ages. It is sporty, comfortable and performs majestically, giving a greater impression than all of its considerable sum parts. The people in Kia say it as\" a more sophisticated car \"and I tend to agree. The new range of Kia cars completely reinforce the stats that Kia is one of only three car brands in the world selling more cars than ever before. This mix of modernity and class make for some exciting times ahead for Kia and its increasing stable of thoroughbreds. Comments that are judged to be defamatory, abusive or in bad taste are not acceptable and contributors who consistently fall below certain criteria will be permanently blacklisted. Comments must be concise and to the point. The moderator will not enter into debate with individual contributors and the moderator's decision is final. The comment facility is removed after 48 hours. blog comments powered by Disqus New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Credit where credit's due. Toyota were the first out of the blocks with the compact/crossover SUV - they just didn't know it. This flashy Clio showed some nifty needlework Here's a car people I know have really liked in previous incarnations Jam, Glam and Slam - you've got to see it to Adam and Eve it Boy, does it counterbalance\" boring' New Mazda6 sets down benchmark for large family saloon and estates In the space race, this little star proves big's not always best! Car makers accused of overhyping fuel efficiency by up to 30pc Face-lifted 5-series is leaner, meaner and even greener New 5-door Focus ST makes no apologies for being fantastically fun to drive 12:42 New deal for Villa youngster Johnson 12:42 Van Wolfswinkel eyes \"next level' 11:42 Watchdog boss defends his conduct 11:42 Watchdog boss defends his conduct 04:52 Tests due on boat tragedy brothers 11:32 General strike in Greece in TV row 11:12 Prism leaker\" still in Hong Kong' 11:07 Woman dies in vintage rally crash 10:53 Thousands flee Colorado wildfires 12:42 New deal for Villa youngster Johnson New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Credit where credit's due. Toyota were the first out of the blocks with the compact/crossover SUV - they just didn't know it. This flashy Clio showed some nifty needlework Here's a car people I know have really liked in previous incarnations Jam, Glam and Slam - you've got to see it to Adam and Eve it Boy, does it counterbalance \"boring'\" Unfortunately it's not a nightmare \"- family of three tragic drowned brothers Three brothers dead after fishing punt capsizes in Tramore Bay RTE axes its Premier League show to save station? 1.3 m a year Russell Brand reveals he had nine orgasms in one evening in Dublin Robert Pattinson stares directly at the camera and sports a beard in a new role - the face of Dior Homme fragrance. Alan Partridge is\" chatting for his life \"in a siege on his local radio station in the latest trailer released for his new film Alpha Papa. Kanye West's reps have denied claims he cheated on Kim Kardashian. <mark>Olivier Martinez</mark> has revealed he and Halle Berry are expecting a son, and he will be born in America. Paul Hollywood's estranged wife has opened up on Twitter about coping without the TV star. Caprice is expecting two babies within a month of each other as she discovered she was pregnant just after hiring a surrogate. Miami Nice - Niall Horan gets mobbed after day spent on lavish yacht One Direction boys came up with a novel way of escaping fans - sailing away on a luxury boat in Florida. Superman braved the rain at Man of Steel's European premiere. Pregnant model Caprice to have two babies in four weeks The 41-year-old model who is due a baby in September, has revealed a surrogate will give birth the month before. Hair today, gone tomorrow - Wayne Rooney gets second hair transplant HE'S recently become a dad for the second time, and although they say stress can cause hair loss, it may not be the case for Manchester United star Wayne Rooney. By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2009122415_00170989_W", "names": {"Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"], "Dean Smith": ["Q1181130", "Q1181132", "Q18171697", "Q202584", "Q5246469", "Q5246470", "Q5246471", "Q5246472", "Q5246473", "Q5246474"]}, "date": "2009-12-24", "url": "http://northcarolina.scout.com/2/931907.html", "content": "by the end of 2009, it is estimated that nearly 47,000 households in north carolina and over 2 million nationally will lose their homes due to foreclosure. that's a staggering level of human pain to contemplate. and it's pain that <mark>roy williams</mark> can identify with. at one point during his elementary school years, <mark>williams</mark>, his mother, and his sister were forced out of their house in asheville after his often-absent and eventually separated father failed to keep up with the mortgage payments. to this day, <mark>williams</mark> says he dreads people in dark sportcoats like the kind the men who informed his family they would have to leave within three days. much media attention to <mark>roy williams</mark>' autobiography, hard work, has focused on relatively current events - the period since about 1998 - and the specifics of what <mark>roy</mark> has to say about various people and events during that time period. fans who have not read the book may assume this is just another self-serving memoir by a coach who wants a neat recruiting tool, or that <mark>williams</mark> is setting himself up as a paragon of virtue. all biographies are representations of the self, all books by coaches are recruiting tools, and any book called \"hard work\" makes the implicit claim that the author is a good exemplar of that virtue. but the essential purpose of the book, as <mark>williams</mark> says in his preface, is to help readers understand him a little better. in that task, the book succeeds spectacularly - not because of what <mark>williams</mark> has to say about his success and tenure as a big-time basketball coach, but because of the remarkable opening 50 pages where he describes his childhood, teen years, and early adulthood. getting kicked out of his house as a kid was just one of the stresses <mark>williams</mark> faced. his father was an alcoholic who was often absent, and when present and drunk, often unpleasant. his mother struggled to get by with less than a high school education, supporting the family through factory work supplemented by rare child support payments. <mark>roy</mark>'s older sister started work at an early age too, meaning that by age 11 or 12 <mark>williams</mark> often was an unsupervised child. how did an 11-year-old boy from a broken, poor family who had never even heard of the idea of college until high school grow up to become the outstanding college basketball coach in america? five factors explaining that remarkable arc emerge from <mark>williams</mark>' narrative, each building upon one another. the first is <mark>williams</mark>' love of basketball, the activity that freed his mind from other worries and provided a badly needed outlet and a way to spend the time alone. the second was unquestionably his mother along with his sister. <mark>williams</mark> was fully indulged in his love for the game by his mother, who never complained about his bouncing the ball at home and later recorded <mark>roy</mark>'s scoring statistics during all his high school games. and, famously, she always left a dime for young <mark>roy</mark> to get a coke after his daily pickup basketball games. third, and perhaps least well known by tar heel fans, is the role of the local asheville community, particularly high school coach buddy baldwin. <mark>williams</mark> gives many large and small examples of the way people in the community looked after him, but baldwin played the key role, starting with words of encouragement he offered to <mark>roy</mark> after his 9th grade season on the junior varsity, suggesting he could be a varsity player. that inspired <mark>williams</mark> to bust his butt all summer so he could make that team (and indeed be a starter). more importantly, it inspired <mark>williams</mark> to want to be a coach. it felt good to be appreciated as a player and to be motivated to succeed by the words from baldwin. <mark>williams</mark> recognized (unusually early in life) how great it must feel to be able to make that kind of difference in someone else's life. fourth, there is the university of north carolina and everything that comes with it. <mark>williams</mark> turned down basketball scholarships and numerous small schools to come to chapel hill, knowing he would only ever be a junior varsity player for carolina - if he made that team. but, encouraged by baldwin, he reasoned that his best chance of becoming a basketball coach was to hook on to the carolina program and learn from <mark>dean smith</mark>. through a series of events whose common thread is <mark>williams</mark>' own persistence and passion for the game, he did get that opportunity in chapel hill despite never being a varsity player. but it was the existence of a large scale public university committed to providing opportunities to talented students from all over the state that made <mark>williams</mark>' career trajectory possible. this brings us to the fifth factor explaining how <mark>williams</mark> eventually become a magnificently successful head coach at kansas and north carolina: <mark>williams</mark> himself. <mark>williams</mark> does not blow his horn too much in this department, but one thing that comes through in the book is what a good student he was in high school - he was even offered an academic scholarship to georgia tech. the second obvious thing that comes out is just how driven <mark>williams</mark> was from a very early age, and his capacity for, yes, \"hard work,\" a drive that is inseparable from his love of competition. intelligence, passion and work ethic are generally a powerful combination. but they are more powerful still when connected to particular sense about what one wants to do with one's life. <mark>roy williams</mark> recognized that it was basketball and a basketball coach that kept his difficult and stressful childhood from translating into an aimless life marked by no goals and no serious aspirations. <mark>williams</mark> coaches now to win games and satisfy his own competitive drive, no doubt. but he also recognizes that the fundamental purpose of coaching is to inspire others, and that what is most important about basketball and sports in general is its capacity to shape young people's lives. <mark>williams</mark> quotes an inscription given to him by a former unc jv player stating, \"the true measure of a man's greatness is not in the number of his accomplishments, but in the number of people's lives he inspired while achieving those accomplishments.\" corny as all get out? maybe, but that doesn't make it wrong. that phrase sums up as well as any how <mark>williams</mark> sees his vocation. what the first fifty pages of this book does is show exactly how and why <mark>williams</mark> thought pursuing that vocation was the most valuable thing he could do with his life. *** i was surprised at how moved i was by this book. as someone who's followed <mark>williams</mark>' career every step of the way from his initial hire by <mark>smith</mark> in 1978 - my brother attended one of the unc faculty/staff kids clinics <mark>williams</mark> recalls in the book - and as someone who even had <mark>williams</mark> as a coach for one memorable week of carolina basketball school, i assumed i knew pretty well what <mark>williams</mark> is about. but this book rounds out and adds to the picture in important and at times surprising ways. yes, you will understand <mark>roy williams</mark> \"a little better\" by reading this book. i'll go further and say that the time was right for a book like this. at a similar point in <mark>dean smith</mark>'s career, the journalist thad mumau wrote an informative biography of <mark>smith</mark> called \"more than a coach\" that recounted his kansas childhood, drawing on interviews with <mark>smith</mark>'s family members, including his parents. the book had a lot of insight into <mark>smith</mark> and where he got his values and aspirations from. <mark>williams</mark> had a very different childhood than <mark>smith</mark> and in some respects is a very different person as well. one measure of that difference is the fact that only <mark>williams</mark> could have told his own story: he dedicates the book to his mother, father, and sister, saying he wish they could read his words. even if a journalist had had access to his family members before they passed away, they wouldn't have been able to convey what exactly it feels like to be an 11-year-old from a family having a difficult time, dribbling a basketball for hours and hours on a muddy court - an essential part of this story. another measure of that difference is that one senses that, at some level, <mark>williams</mark> needed to tell some of these stories - some quite painful, others simply poignant. these aren't the kind of stories you casually mention in an interview. the autobiography format gives him an opportunity to share parts of his life and indeed parts of his soul that otherwise might never have found public expression. economic stress and borderline poverty are still difficult topics for many americans to face or talk about. <mark>williams</mark>' childhood was difficult in many ways, but in other ways he was quite blessed - in particular, blessed to be part of a community that cared about him and encouraged him to develop himself, and not allow himself to be constrained by his circumstances. it is not a cliché but simply truth that millions of kids in america today, december 2009, face economic and family circumstances as tough or tougher than those young <mark>roy williams</mark> faced. some of those kids, thousands and thousands, are probably still finding a measure of solace and comfort from shooting baskets, for hours and hours. i hope those kids are also lucky enough to get the kind of support and inspiration <mark>roy williams</mark> got from his family, his coaches, his teachers, his friends' parents, and the community at large. and i hope that readers of <mark>williams</mark>' book will take to heart the deepest underlying message of the book - <mark>williams</mark>' gratitude and appreciation towards those who gave him the love, guidance and encouragement required to make great things possible. <mark>williams</mark>' book recollects a community that didn't let him fall through the cracks. as those cracks get wider with every passing month, <mark>roy williams</mark>' life story serves as a quiet but moving reminder of the need to restore those kinds of communities again, in north carolina and everywhere else."}, {"articleID": "2019122503_00028272_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"]}, "date": "2019-12-25", "url": "http://www.echonews.com.au/news/simple-rule-behind-aussies-30m-empire/3909373/", "content": "Business Simple rule behind Aussie's $30m empire by Alexis Carey 25th Dec 2019 1:58 PM 0 When Aussie man Sabri Suby was young, he watched his single mum juggle three exhausting jobs to support her kids. She would then return to the family's Byron Bay home only to start cooking healthy, homemade meals for him and his sister, and it taught him one crucial, lifelong lesson - something he dubs the \"single mum work ethic\" . It had a \"profound impact\" , and as soon as he could, Mr Suby began taking on after-school jobs to help out, including his first role grinding peanut butter at a health food store for just $2.50 an hour. \"I also started busking at markets with my harmonica on the weekends trying to earn $80 to $100 to help with electricity bills or groceries - I gave all my money to my mum,\" he told news.com. au. Sabri Suby worked multiple jobs as a teen to help his single mum but now runs a $30 million company. \"Watching her work so hard had a profound effect on me and it has served me in life.\" You might have more connections or have grown up in a better area or with two parents, but one thing you can't take away from me is my work ethic. \"Mr Suby got an after-school sales job at 16 and discovered a natural knack for it. After finishing high school, he made a conscious decision not to go straight to uni, so he packed his bags and moved to London for two years, working in sales\" door to door, face-to-face and over the phone \". Again, it was an industry he thrived in, and he decided to move back to Australia and study business marketing at RMIT. He worked full time for a company selling Google AdWords and specialising in online marketing and search engine optimisation to support himself as he studied, making a near-minimum wage base salary and earning sales commissions on top. However, he was\" not living a lavish lifestyle by any means \"and the wage was\" just enough to survive \"- so at 21, he started his own business after realising he could do things better. It made more than a million dollars in revenue, and Mr Suby went on to launch a string of other businesses. <mark>King Kong</mark> now employs 34 people in its Melbourne office.\" Some failed, some did OK and some I sold, \"he explained. Then, five years ago, he launched digital marketing company <mark>King Kong</mark>. At the time he had just a\" couple of hundred dollars in the bank \"after experiencing years of business ups and downs and having just gotten married.\" I was at ground zero but I had made a commitment to this girl, so it was time to pony up and forge a real business career, \"he said.\" It was the moment I drew a line in the sand - I was literally wondering how I was going to pay rent, so I decided to go back to my roots, making 150 cold calls a day. \"I had no rich uncle, no venture capital or loans or savings, so I had to go out there and make it myself.\" In the beginning, Mr Suby was working 18-hour days doing everything himself from running errands to cleaning the office and bookkeeping. But then he stumbled upon a simple rule that changed everything. It was the \"80-20 rule\" - also known as the Pareto principle. The 34-year-old is now a married father of one. \"The principle is that 20 per cent of the input of anything will give you 80 per cent of the output - so 20 per cent of customers will give 80 per cent of profits, or 20 per cent of the roads in a city will carry 80 per cent of the traffic,\" he said. \"It wasn't until I sat down and had a real audit of my time that I realised what I was doing wasn't sustainable - so I asked myself,\" what are the things I'm doing that are actually moving the money needle and driving the business forward or making more revenue?' So I started to automate or delegate and take the grunt work out of the business. \"That's when things truly\" exploded \".\" It was like a switch - once I made the conscious decision to spend all my time selling, within a couple of days, instead of getting one or two clients a week we were getting four to five. It doubled sales almost overnight, \"he said. Today <mark>King Kong</mark> is valued at $30 million with a three-year growth rate of 314 per cent, has 65 staff members in its shiny new Melbourne office and attracts thousands of new clients each month. Mr Suby, now a 34-year-old father of one, said it was a\" humbling experience \"to have gone from such a modest upbringing to become a multimillion-dollar success story. Sabri Suby says the key to success is to work hard--and work smart.\" The opportunities we have in Australia are incredible - you can come from an unfortunate upbringing with just one parent working three jobs with no money, no private school and no cheque written for uni...and turn yourself into a multimillion-dollar success, \"he said.\" You can go out there with no resources from an unfortunate situation...but when people roll up their sleeves and get the job done it doesn't matter the colour of your skin, where you come from or who your parents are, it evens the playing field. \"Don't wait for somebody to tell you you're worthy of success, just get out there.\" Mr Suby, whose first book, Sell Like Crazy, became a bestseller this year, said the secret to success came down to \"working tirelessly\" - but also working smart. \"Isolate the things you have to do to drive the business forward, and work like a dog on those things. Find the small hinges that swing the big doors,\" he said. Mr Suby's book was released earlier this year. \"One thing that is constant is that the hardest worker in the room will be a success, and my advice is you want to exercise your work ethic like a muscle - you won't make money without hard work.\" More Stories From $7 Pizza Hut wage to $250m empire premium_icon Burger chain's rapid expansion to 50 outlets More Stories From $7 Pizza Hut wage to $250m empire premium_icon Burger chain's rapid expansion to 50 outlets Show More 0 80-20 rule Read More Login to follow australian entrepreneur Read More Login to follow editorship Read More Login to follow entrepreneur Read More Login to follow millionaire Read More Login to follow 80-20 rule australian entrepreneur editorship entrepreneur millionaire"}, {"articleID": "2012072510_00012931_W", "names": {"Mike Holloway": ["Q16226113", "Q20090931"], "Christian Taylor": ["Q1751", "Q5110185", "Q5110187"]}, "date": "2012-07-25", "url": "http://gatorsports.com/article/20120725/articles/120729806", "content": "it's been quite a year for uf track and field coach <mark>mike holloway</mark>. after guiding the gators to their third straight men's ncaa indoor title and first ncaa outdoor crown in 2012, <mark>holloway</mark> is heading across the big pond to london as an assistant coach for the u.s. men's olympic team. \"i've been to the olympics before as a personal coach, but i know this will be different,\" <mark>holloway</mark> said. \"i'm actually a member of the staff, and i'm going to be walking around with\" usa' across my chest every day helping other people try and do their best. \"in addition to being the assistant in charge of sprints and hurdles for the u.s. men, <mark>holloway</mark> is personally coaching a pair of his former uf standouts in tony mcquay (400 meters) and kerron clement (400-meter hurdles).\" i think the thing that happens sometimes is people forget who they are and how they got there, \"<mark>holloway</mark> said.\" as far as tony and kerron go, we're just going to go over there and do what we've been doing all year long. we're going to compete hard, get our rest and just be who we are. \"clement won a silver medal in the 400 hurdles in beijing in 2008.\" i just need to stay focused and keep my eyes on the prize, \"he said.\" i fell a little short in the last olympics and got a silver medal. i'm just hungry to get that gold. \"two more ex-gators, <mark>christian taylor</mark> (triple jump) and will claye (long jump, triple jump), are strong medal contenders for the u.s., with <mark>taylor</mark> the reigning world champ in his specialty.\" they're both \"gamers' as i like to call them,\" <mark>holloway</mark> said. \"when the bright lights come on, those two guys shine their brightest, so i'm not too concerned about those two cats at all.\" a late addition to the u.s. 4x100-meter relay pool, florida sprinter jeff demps received an invitation to london on tuesday when it was announced that mike rodgers would miss the games with a stress fracture in his left foot. former uf olympian tom pukstys (javelin), who is coaching the throws for the u.s. men, joins <mark>holloway</mark> as an assistant, while five other former gators - kemal mesic (bosnia), moise joseph (haiti), genevieve lacaze (australia), shara proctor (great britain) and novlene williams-mills (jamaica) - will compete for their respective countries. \"it really hasn't sunk in yet,\" <mark>holloway</mark> said. \"walking in the stadium for the first race and hearing the starting gun go off, i think that is when it will really hit home.\" again, at the end of the day, and i know it's kind of cliche, but it's just another track meet and i've got to go do my job. that's what it comes down to. \"in addition to the 23 swimmers and ten track and field athletes with uf ties, ex-gators abby wambach and heather mitts (u.s., soccer), lisa raymond (u.s., tennis) and azania stewart (great britain, basketball) will be competing in london. a fifth, melanie booth (canada, soccer), was chosen as an alternate."}, {"articleID": "2017091610_00092224_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Andrew Bolton": ["Q20829853", "Q9151099"]}, "date": "2017-09-16", "url": "http://kfgo.com/news/articles/2017/sep/16/california-lawmakers-take-anti-trump-stance-as-session-ends/", "content": "California lawmakers take anti-Trump stance as session ends Saturday, September 16, 2017 5:42 a.m. CDT U.S. President Donald Trump waves as he arrives at Morristown municipal airport for a weekend at the Trump National Golf Club in Bedminster By Sharon Bernstein SACRAMENTO, Calif. (Reuters) - California lawmakers voted to become a sanctuary state, tussled over hot-button environmental issues and urged other states to refuse to cooperate with President Donald Trump's Election Integrity Commission as their legislative year ended early on Saturday. The majority Democratic lawmakers headed back to their districts having positioned the state in opposition to conservative policies proposed by the Republican-dominated U.S. Congress and President Donald Trump on immigration, the environment and other issues. \"It's a purposeful positioning,\" said political analyst Sherry Bebitch Jeffe, a senior fellow at the University of Southern California. \"We have a different political path and a different ideological path than the Republican-controlled Congress and White House have.\" This year, California lawmakers have strengthened protections for undocumented immigrants, increased the gasoline tax and extended a program aimed at compelling businesses to reduce air pollution, all in opposition to federal policies. Early on Saturday, lawmakers gave last-minute support to a bill barring local governments from forcing undocumented immigrants to spend extra time in jail just to allow enforcement officers to take them into their custody. The bill, a compromise from a version that sought to severely restrict interactions between law enforcement and immigration officials, does allow communities to notify the federal government if they have arrested an undocumented immigrant with a felony record. It also allows enforcement agents access to local jails. It came a day after a federal judge barred the U.S. Justice Department from denying public-safety grants to so-called sanctuary cities in retaliation for limiting cooperation with the Trump administration's crackdown on illegal immigration. The bill goes now to Democratic Governor <mark>Jerry Brown</mark> for his signature. Trump issued an executive order in January targeting funding for cities that offer illegal immigrants safe harbor by declining to use municipal resources to enforce federal immigration laws. A San Francisco judge blocked the order. Illinois' Republican Governor signed a bill last month protecting people from being detained because they are the subject of an immigration-related warrant. FOSSIL FUELS Although California lawmakers have enacted several environmental protections this year, a measure aimed at weaning the state's power grid entirely off fossil fuels by 2045 died for the year after lawmakers adjourned without voting on it. California's three investor-owned utilities, Pacific Gas & Electric, Southern California Edison and San Diego Gas & Electric [SDGE. UL], said the bill does not protect customers from the cost of switching from fossil fuels. Assemblyman Chris Holden, who held the measure in his Utilities and Energy Committee, said he would consider it again when the legislature returns in January for the second half of their two-year session. The legislature also passed a package of bills aimed at increasing the availability of affordable housing in the notoriously expensive state, and approved a plan for spending $1.5 billion in income from the state's cap-and-trade air quality program, which raises money by selling businesses limited rights to emit pollutants. They passed a resolution condemning the election integrity commission, calling it an effort to suppress the voting rights of minorities and others, and voted to move up the state's presidential primary from June to March. (Reporting by Sharon Bernstein in Sacramento, Nichola Groom in Los Angeles and <mark>Brendan O'Brien</mark> in Milwaukee; Editing by <mark>Andrew Bolton</mark>) More From World EU-U.S. data pact faces first major test of credibility British police arrest 18-year-old in hunt for London train bomber Trump move to block chipmaker deal bad for America - Xinhua Toys \"R' Us mulls bankruptcy filing: Wall Street Journal Houston residents, officials stew over Harvey storm-trash removal Mexico-U.S. trade would survive any NAFTA rupture: Mexico foreign minister Comments"}, {"articleID": "2015102115_00076180_W", "names": {"Peter Muller": ["Q1213408", "Q39071383", "Q7175983"]}, "date": "2015-10-21", "url": "http://www.prnewswire.com/news-releases/schlafender-hase-inc-expands-its-presence-in-the-americas-300163292.html", "content": "Schlafender Hase Inc. expands its presence in the Americas The global leader in computer-drive proofreading Facebook Twitter Pinterest & times; The global leader in computer-drive proofreading Schlafender Hase GmbH, the maker of the Text Verification Tool & reg; (TVT) and the global leader in text verification for regulated environments, are expanding their presence in the Americas by offering more local services such as software installation, validation, training & support by adding new leadership & talent to their growing team. CAMBRIDGE, Mass., Oct. 21, 2015 / PRNewswire /--Schlafender Hase GmbH, the maker of the Text Verification Tool & reg; (TVT) and the global leader in text verification for regulated environments opened Schlafender Hase Inc. in North America just over a year ago. \"We have been very successful over the last year, and due to customer demand we've decided to offer more local services in the Americas,\" said Frank Hessler, CEO and President of Schlafender Hase. Additional local services now include software installation, validation, on-site training and support. Schlafender Hase Inc. has expanded its team to assist with this expansion. Heading up the Americas team as Managing Director, is <mark>Peter Muller</mark>. <mark>Peter</mark> is an industry veteran who is an expert on Proofreading technologies and how to apply software tools to solve Regulatory Affairs and Packaging challenges. \"TVT is the de facto global standard for text verification. Not only is it used by every major pharmaceutical and medical device company, it is used by Regulatory Authorities such as the EMA, BfArM and MHRA to ensure the accuracy and compliance of product packaging submissions,\" said <mark>Peter Muller</mark>. \"I am thrilled to be working with Schlafender Hase. We know we have the best product on the market but our challenge is to inform clients that they have a choice of local suppliers in the Americas.\" Schlafender Hase Inc. will be exhibiting at this year's RAPS Regulatory Convergence in Baltimore on October 24 th--28 th. The new team will be present and looking forward to meeting with customers. To learn more go to https: //www.schlafenderhase.com or contact the North American office at +1 617 607-4900 About Schlafender Hase: Schlafender Hase is the global leader in computer-driven proofreading. Our Text Verification Tool & reg; (TVT) is the international benchmark for accurate and user friendly text and graphic verification. TVT is currently used by the world's leading pharmaceutical and medical device companies as well as numerous regulatory bodies to ensure compliant, error-free and consistent packaging. TVT allows users to compare text and graphics with one solution. It is ISO 9001:2008 certified, 21 CFR Part 11 and Annex 11 compliant. Contact: Kindrie Eaton, 617-607-4900, marketing @ sh-p.com Logo - http: //photos.prnewswire.com/prnh/20151020/278782LOGO SOURCE Schlafender Hase RELATED LINKS http: //www.schlafenderhase.com My News Release contains wide tables. View fullscreen. See more news releases in Computer Electronics Computer Software Biotechnology Health Care & Hospitals Medical Equipment Medical Pharmaceuticals Corporate Expansion Personnel Announcements Trade Show News Journalists and Bloggers Visit PR Newswire for Journalists, our free resources for releases, photos and customized feeds. You can also send a free ProfNet request for experts. Custom Packages Browse our custom packages or build your own to meet your unique communications needs. Start today. PR Newswire Membership Fill out a PR Newswire membership form or contact us at (888) 776-0942. Learn about PR Newswire services Request more information about PR Newswire products and services or call us at (888) 776-0942. Site Preview Close Site Preview View Fullscreen"}, {"articleID": "2010102021_00321828_W", "names": {"Jim Wolf": ["Q19958282", "Q6199020"], "Robert Butler": ["Q15966812", "Q2156687", "Q42407836", "Q51590211", "Q53798403", "Q56733845"], "Susan Collins": ["Q22279", "Q7647692"]}, "date": "2010-10-20", "url": "http://sg.finance.yahoo.com/news/Pentagon-seeks-tight-ties-rsg-2896505917.html?x=0", "content": "thu, 21 oct 2010, 05:49 sgt - singapore markets open in 3 hrs 11 mins {\"s\" : \"ba, lmt, noc, rtn\" , \"k\" : \"a00, a50, b00, b60, c10, g00, h00, l10, p20, t10, v00\" , \"o\" : \"\",\" j \":\" \"} on thursday 21 october 2010, 5:12 by <mark>jim wolf</mark> washington (reuters) - the u.s. defense department aims to tighten ties with its cybersecurity contractors in an effort to better protect sensitive computer networks against growing cyber threats. the department's use of top-level system integrators and entrepreneurs will continue to grow, along with the need for so-called\" active \"defenses that scan incoming code to shield network perimeters, <mark>robert butler</mark>, the pentagon's top official for cyber policy, said on wednesday.\" and as we thread those together, what we want to do is a very very tight partnership with industry, \"<mark>butler</mark>, the deputy assistant secretary of defense for cyber policy, told reporters at a breakfast session. one key goal, <mark>butler</mark> said, was to cut the lag between development of new protective technology and its deployment. he said the department also wants to promote supplier diversity, partly to guard its information technology supply chain against compromise. the pentagon's biggest suppliers--including lockheed martin corp, boeing co, northrop grumman corp, bae systems plc and raytheon co--all have big and growing cyber-related product and service lines for a market that has been estimated at $80 billion to $140 billion a year worldwide, depending on how broadly it is defined. <mark>butler</mark> declined to comment directly on newly expressed concerns by u.s. lawmakers about buying telecommunications hardware from companies such as huawei technologies co, a china-based network equipment maker founded by a retired chinese military officer.\" supply chain is a big issue that we are tracking, \"he said. part of the approach involves screening to verify components and sub-components, he said. the department is also seeking to understand how manufacturing processes are taking place and to manage risks, <mark>butler</mark> said. a group of lawmakers including senator joseph lieberman, chairman of the senate homeland security committee, asked the federal communications commission on tuesday to detail any security risks from network equipment made by huawei and zte corp, both based in shenzhen, china. the two\" are aggressively seeking to supply sensitive equipment for u.s. telecommunications infrastructure and/or serve as operator and administrator of u.s. networks, and increase their role in the u.s. telecommunications sector through acquisition and merger, \"lieberman said in a letter also signed by senators jon kyl and <mark>susan collins</mark> and representative sue myrick. a report commissioned by the congressionally chartered u.s.-china economic and security review commission said last year that beijing, at odds with washington over taiwan arms sales among other things, appeared to be conducting\" a long-term, sophisticated, computer network exploitation campaign \"against the u.s. government and u.s. defense industries. china has denied the charge, made in a survey carried out for the commission by northrop grumman, the pentagon's third-biggest supplier by sales. deputy defense secretary william lynn, who is leading the overall effort to protect the military's 15,000-plus computer networks, has said more than 100 foreign intelligence outfits are attempting to break in, and some\" already have the capacity to disrupt \"u.s. information infrastructure. <mark>butler</mark> cited what he called a growing threat from malicious software and\" botnets, \"or code that can drive automated tasks over the internet without computers' owners knowing. walling off power grids, the\" defense industrial base \"and other critical industries from the rest of the internet is\" one idea of a series of operating concepts that we are working through, \"he said.\" over the course of the next several months, i think we'll sort through a lot of this. \"u.s. senator sheldon whitehouse, who led a task force on the cyber threat for the senate select committee on intelligence, said the private sector is an essential partner in federal efforts to boost cybersecurity, with as much as 90 percent of internet infrastructure in private hands. quotes delayed, except where indicated otherwise. delay times are 15 mins for nasdaq, nyse and amex. see also delay times for other exchanges. quotes and other information supplied by independent providers identified on the yahoo! singapore finance partner page. quotes are delayed at least 15 minutes. all information provided\" as is \"for informational purposes only, not intended for trading purposes or advice. neither yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. by accessing the yahoo! site, you agree not to redistribute the information found therein. capital iq. historical chart data and daily updates provided by commodity systems, inc. (csi). international historical chart data, daily updates, fund analyst estimates data provided by"}]