[{"articleID": "2014052723_00083330_W", "names": {"Steve Perry": ["Q1368134", "Q175857", "Q21401092", "Q7613592"], "Adam Vaughan": ["Q4679921", "Q58065366"]}, "date": "2014-05-27", "url": "http://www.huffingtonpost.ca/nathan-dautovich/buying-a-house-in-toronto_b_5397648.html", "content": "Canada Has No Interest In Annexing This Paradise Tories Omit Survey Questions That Often Lead To Negative Answers Official: Nigeria's Military Knows Where Kidnapped Girls Are Being Held Ukraine Launches Air Strikes Against Pro-Russia Rebels SURPRISE! <mark>Steve Perry</mark>'s First Live Stage Performance In Nearly 20 Years Saw-Wielding Man Reportedly Slashes 2 Members Of Japanese Pop Group Striking Photos Of Mexico City's Retired Sex Workers Photographer Who Helped Launch Bettie Page's Career Dies Striking Photos Of Muay Thai Boxers Capture The Softer Side Of Masculinity 13 Music Festivals You Should Actually Attend This Summer Nathan Dautovich PropertyGuys.com Franchise Owner With prices of single family homes already up over 13 per cent year over year, the dream of owning a home in a desirable neighbourhood is quickly fading for many would-be Toronto home owners. In popular areas along the Yonge subway line, even semi-detached homes are now selling for over $1 million, which is out of reach for most buyers. The reason that prices have risen so fast is that more and more people want to stay in Toronto to raise their families instead of moving to the suburbs. Toronto has become a world class city with great restaurants, unique cultural events, and neighbourhood festivals all over the city. Also, with commute times at a record high, many people who work in the city would rather live close to their work so they don't have to spend hours every day in a car or on a train. So what options are there for people with a budget under $1 million who still want a home in a desirable neighbourhood? I posed this question to former city councillor <mark>Adam Vaughan</mark>, who has long believed that an important part of Toronto's growth as a city includes families living near the downtown core. <mark>Vaughan</mark> cites a regulation for new condos mandating that at least 10 per cent of all units in new buildings have three bedrooms or more. \"10 years ago, people were calling me crazy for pushing this regulation, saying that families would never want to live downtown,\" says <mark>Vaughan</mark>. \"In hindsight, I think we will probably look back and think that the 10 per cent requirement was too low .\" The facts seem to back up <mark>Vaughan</mark>'s statement, as three bedroom condos and townhouses close to the downtown core are now selling faster than ever before. There are schools and daycares opening up in the bottom of large condo buildings, and lots of new parks and playgrounds are being built. Another option that many home owners are not aware of that many newer condo buildings have knockdown walls between units. This means that two or more suites could easily be combined into a larger suite by removing a non-structural mutual wall built in a way that makes it easy to remove. While this is a rare occurrence right now, it is a fascinating example of a policy that allows the market to dictate what type of properties exist in Toronto's downtown core. If families continue to choose to live in the city, then there will be more demand for larger units, and savvy investors will combine two smaller suites into a larger suite to meet demand. It could also be a great investment for buyers to purchase two units side by side and rent one out for several years until their lifestyle requires a larger property. Then they can combine the units together and have a space just as large as a single family home. These options may seem unconventional right now, but if house prices continue to grow anywhere near the current rate, we could see the location of knockdown walls become essential information in every property listing. All of this is good news for home buyers. As the popularity of these larger suites closer to downtown increases, it could make detached homes more affordable, creating more of a balanced market. These changes could be years away, but Toronto is well positioned to offer a variety of options for families wanting to live close to the downtown core. Leaside/Thorncliffe Park - up 23% Median house price 2012: $1,213,000 Median house price 2014: $1,486,000 Prices for stand-alone houses, excluding condos/townhomes. * Note: Statistics for neighbourhoods are based on relatively small total sales figures, and thus can change rapidly. Source: Toronto Real Estate Board data via BuzzBuzzHome Lawrence Park/Forest Hill North - up 24% Median house price 2012: $993,000 Median house price 2014: $1,235,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Oakridge/Birchmount/Kennedy Park - up 28% Median house price 2012: $396,000 Median house price 2014: $505,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Riverdale - up 33% Median house price 2012: $568,000 Median house price 2014: $756,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Danforth/East York - up 34% Median house price 2012: $485,000 Median house price 2014: $650,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Church-Yonge Corridor/Cabbagetown - up 38% Median house price 2012: $1,300,000 Median house price 2014: $1,800,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome York Heights/Jane Heights/Black Creek - up 40% Median house price 2012: $475,000 Median house price 2014: $666,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rockcliffe-Smythe/Keelesdale-Eglinton West - up 41% Median house price 2012: $343,000 Median house price 2014: $483,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Junction/High Park North - up 52% Median house price 2012: $534,000 Median house price 2014: $810,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Trinity-Bellwoods/Little Italy - up 54% Median house price 2012: $635,000 Median house price 2014: $978,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Annex/Yonge-St. Clair - up 71% Median house price 2012: $782,500 Median house price 2014: $1,340,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rosedale/Moore Park - up 116% Median house price 2012: $1,175,000 Median house price 2014: $2,533,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome ALSO ON HUFFPOST: COOLEST HOUSES FOR SALE IN CANADA Calgary - $4 million This newly-built home just northwest of downtown Calgary not only looks cool and has excellent views of the city, it features some pretty slick amenities, such as built-in kitchen appliances, a 1,500-bottle wine cellar and five bedrooms across 5,300 square feet of living space. Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Montreal - $3.25 million This house in Montreal's old-money Westmount area was built in 1857 and, with its awesome wrap-around porch, may be the coolest heritage residential building for sale in Canada right now. It's actually three units--a main house, a townhouse in the back and what's referred to as the \"well house .\" Three bedrooms and two baths in the main house. Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million West Vancouver - $7 million Can you say house with a view? This four-bedroom property features not only one of the best views out of anyone's living room window in the country, it also has an outdoor pool, sunk slightly below house level, with views all its own. Four bedrooms and an elevator in this house the realtor describes as an \"amazing entertainment home .\" West Vancouver - $7 million West Vancouver - $7 million"}, {"articleID": "2018111916_00273944_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"]}, "date": "2018-11-19", "url": "https://www.knoe.com/content/news/Estimate-Nearly-50-of-cellphone-calls-in-2019-will-be-robocalls-500837212.html", "content": "(CBS NEWS) - It is estimated that by early next year, nearly 50 percent of all the calls you get on your cellphone will be robocalls. Last month alone, more than five billion robocalls were made. Lawmakers last week proposed bipartisan legislation to fine scam robocallers up to $10,000 per call; and the FCC is demanding telecommunications companies lay out their plans to meet new standards, so that scam calls can be identified and stopped. CBS News asked major companies what they're doing to stop illegal robocallers and one, T-Mobile, offered to show us. As FCC demands telecom companies to meet new standards, T-Mobile introduces new technologies to screen and block robocalls. CBS NEWS T-Mobile's programs to stop robocalls begin in a lab packed with computer servers. \"This is where we test everything that we put into our network,\" said company vice president Grant Castle. From that noisy room came T-Mobile's Scam ID program. It alerts customers to problem calls they won't want to pick up. \"Although the caller is going to use a phone number close to mine, I'm still going to know it's a scam,\" Castle told correspondent Anna Werner. \"I knew the phone number, I could see it was a scam, so I can send it away .\" Castle believes T-Mobile is ahead of its competitors, and the robocallers. \"Every time we make an improvement, the scammers make a change. So, it's an arms race to see who can trick who,\" he said. And the arms race is escalating: \"The scammers are trying new technologies, new ways to scam people. So, we're upping our technology to keep up with them .\" Customers can use the Scam ID feature to screen unfamiliar calls, or block them completely. And this week, T-Mobile is launching a new app, Name ID, that will allow users to choose the type of call they want to block--everything from nuisance calls, to political or charity calls, even prison calls. \"With this new app, customers have better control over what they would like to see, and what they don't want to see,\" said Castle. But the FCC is also pushing companies to meet new standards known by the acronym SHAKEN/STIR. (SHAKEN = Signature-based Handling of Asserted information using toKENs. STIR = Secure Telephone Identity Revisited .) They would allow carriers to verify calls with a digital fingerprint, to show that the person making the call and the person receiving the call are who they say they are, not a scammer trying to \"spoof\" or imitate a phone number. Castle said, \"The standard is essentially, two operators have certificates or tokens that they exchange with each other in each call, and more or less it just says I am who I am .\" T-Mobile says it's ready, and other major carriers say they're working on it. But others apparently are not: in letters the FCC asked them why not, and gave all 14 companies until today to detail their plans to the agency. As FCC chairman <mark>Ajit Pai</mark> told \"CBS This Morning\" in March, \"For those things that are within our authority, we're pursuing them very aggressively .\" But in order for that plan to work, all carriers have to get on board. And industry expert Aaron Foss said, even if that happens, \"scammers are going to go where they can find victims .\" Foss founded Nomorobo, a robocall-blocking app for phones. He says those new SHAKEN/STIR standards are good, up to a point. \"But what it doesn't do is, it doesn't say if that call is legal,\" said Foss. \"It doesn't say anything about the content. It just says that that number is allowed to be called. So, it will stop what is called\" neighbor spoofing,' but it's absolutely not going to solve the whole robocall problem. \"Which is why Foss says Nomorobo takes an\" editorial \"approach to robocalls--blocking them entirely .\" A lot of the other competitors are labeling it or saying things like \"spam likely,'\" scam likely,' \"telemarketer .' We know that consumers just don't want the phone to even ring, and that's what we're doing,\" said Foss. Nomorobo and T-Mobile's Name ID app both have a small monthly fee. CBS News reached out to all 14 phone carriers that received a letter from the FCC. The majority responded and said they will tell the FCC today what they are preparing to do to adopt the new call authentication system in 2019. Whether the carriers will all be able to deploy the system in 2019 remains to be seen. © 2018 CBS Interactive Inc.. All Rights Reserved."}, {"articleID": "2010032414_00128005_W", "names": {"Anirban Basu": ["Q30505551", "Q45729426", "Q47545731"]}, "date": "2010-03-24", "url": "http://earthtimes.org/articles/show/construction-backlog-indicator-cbi-down-9-percent-in-january,1219419.shtml", "content": "construction backlog indicator (cbi) down 9 percent in january posted: wed, 24 mar 2010 14:26:53 gmt author: associated builders and contractors (abc) category: press release news alerts by email (click here) news | home washington, march 24 / prnewswire-usnewswire /--associated builders and contractors (abc) today reports that its construction backlog indicator (cbi) sharply declined by 9 percent between november 2009 and january 2010. cbi has slipped 16.3 percent during the last year and currently stands at 5.5 months, the lowest point reported in the 15 months abc has gathered data. cbi is a forward-looking indicator that measures the amount of construction work under contract to be completed in the future. \"the fact that the cbi is now at its lowest point since abc began measuring the statistic in november 2008 indicates that the nation's nonresidential construction industry remains mired in its own recession,\" said abc chief economist <mark>anirban basu</mark>. \"nonresidential construction tends to lag the overall economy by 12 to 24 months. with the broader economy having been in a slow recovery for roughly three quarters, and with the stimulus package still having an impact, the hope had been that some signs of backlog stability would be apparent by now. however, all indications continue to point toward an ongoing decline in the commercial and industrial construction industry .\" regional highlights between january 2009 and january 2010, average backlog was down in each of the geographic regions, except for the middle states. particularly sharp declines occurred in the northeast and the south, which have both experienced declines of roughly half a month of backlog during the past two months. the sharpest regional decline occurred in the south, falling from 8.12 months in january 2009 to 6.03 months in january 2010. analysis \"while most regions experienced a decline in average backlog during the latest two-month period, with the exception of the middle states, the pace of decline was quite modest. overall, the data are consistent with the notion that while the pace of decline continues to slow, the downward trend is evident in virtually every region of the nation .\" industry highlights the average backlog fell in all three industry segments? commercial, industrial and infrastructure? between january 2009 and january 2010. between november 2009 and january 2010, average backlog in the infrastructure category fell by precisely two months. at 5.3 months, backlog in the commercial and institutional category now stands at its lowest level in the survey's history. analysis \"the data indicate that infrastructure-related work, attributable to the stimulus package passed in february 2009, is no longer generating substantial new backlog now that the funds have largely been obligated to current projects under way. the elevated backlog readings of previous months are associated with substantial levels of ongoing construction, but the decline in backlog signals an eventual downturn in infrastructure-related construction spending .\" highlights by company size with the exception of firms in the $30 million to $50 million category, average backlog declined for every size category. no firm in the $75 million to $100 million category reported an average backlog of more than five months, and many reported backlog between three and four months. firms with annual revenues in excess of $100 million reported the lengthiest backlog, although backlog for this group has been declining overall in recent months. analysis \"average backlog is now at its lowest level in both the $50 million to $75 million and the $75 million to $100 million categories. many of these firms appear to be general contractors that continue to be underbid by larger firms with greater resources and greater capacity to undertake projects with little or no profit margin built into their bids. larger firms also may be more likely to maintain productive banking relationships, allowing them to more nimbly access available contractual opportunities .\" to read more about the latest cbi, click here. associated builders and contractors (abc) is a national association with 77 chapters representing 25,000 merit shop construction and construction-related firms with two million employees. visit us at www.abc.org. contact: gerry fritz, (703) 812-2062 julian teixeira, (202) 965-7808 source associated builders and contractors (abc)"}, {"articleID": "2012092118_00004527_W", "names": {"Gary Davis": ["Q18022470", "Q3098532"]}, "date": "2012-09-21", "url": "http://bloomberg.com/news/2012-09-21/facebook-agrees-to-delete-eu-facial-recogniation-data.html", "content": "romneys paid 14.1% in taxes on income of $13.7 m in 2011 facebook inc. (fb) agreed to delete data collected from users within the european union for its facial - recognition feature by oct. 15, the irish privacy regulator said. the owner of the biggest social-networking site has faced several european reviews over concerns a facial-recognition program that automatically suggests people's names to tag in pictures breaches privacy rights. facebook ireland \"agreed to delete collected templates for eu users by oct. 15\" and to seek regulator consent \"if it chooses to provide the feature to eu users again,\" the irish office of the data protection commissioner said in the conclusions to a review today. data-protection regulators from the 27-nation eu have been looking into facebook's facial-recognition feature. norway's data-protection regulator said in august it was reviewing how the feature worked and what information facebook was storing. earlier this year, a group of regulators known as the eu's said people must consent to the use of their images. the irish audit \"is part of an ongoing process of oversight, and we are pleased that, as the data-protection commissioner said, the latest announcement is confirmation that we are not only compliant with european data-protection law, but we have gone beyond some of their initial recommendations,\" facebook said in an e-mailed statement. hamburg order the commissioner for data protection in hamburg, germany, today issued an \"administrative order\" that facebook can only create and store biometric profiles with the consent of users, including existing ones, for its facial recognition feature. the continued retention of user biometrics \"is now fully dealt with as facebook is agreeing to delete all such data\" by oct. 15, <mark>gary davis</mark>, ireland's deputy data-protection commissioner, said today. \"from that date, there will be no data processed in the eu in relation to this feature .\" data protection is currently policed by separate regulators across the eu. the bloc's executive body wants to simplify the system so companies deal with only one data-protection regulator in the region. the company's progress on \"a wide range of best-practice improvements\" was reviewed as part of on-site audits by the irish regulator in may and july. an agency report in december urged facebook to increase transparency and controls on using personal data for advertising and to delete user data sooner. the irish agency today said facebook had demonstrated \"a constructive approach\" in responding to its recommendations. reviewing compliance facebook ireland provides service to the palo alto, california-based company's users outside the u.s. and canada, according to the agency, which in 2011 began reviewing facebook's compliance with irish and eu data-protection rules. resumed a separate probe into the social network's facial-recognition features after suspending it two months earlier pending the irish audit. johannes caspar, the hamburg regulator, said in a phone interview today that facebook must comply with german law, regardless of any agreement with the irish regulator. he added that his office hadn't been told of the agreement with the irish agency and that if facebook's concessions to the irish are enough to fulfill the hamburg order, \"then all is fine .\" the irish data regulator's capabilities were put to the test last year when an austrian law student made 22 complaints about facebook's compliance with eu privacy rules, such as the company keeping photos on its servers after they'd been deleted. the irish agency conducted the investigation because facebook's european headquarters are located in dublin. the agency said today's report \"does not involve formal decisions by the office on the complaints it has received in relation to\" facebook ireland. \"the audit has taken account of the substantive issues raised in these complaints and it can be expected that at least some of these issues will have been dealt with to the satisfaction of the complainants .\" to contact the reporter on this story: stephanie bodoni in luxembourg at"}, {"articleID": "2016120100_00404837_W", "names": {"Ray Martin": ["Q7297787", "Q7297788", "Q7297789", "Q7297790", "Q7297791"], "David Oldfield": ["Q5238210", "Q5238211"]}, "date": "2016-11-30", "url": "http://watoday.com.au/comment/first-contact-the-message-all-australians-should-take-from-indigenous-culture-20161130-gt0nn7.html", "content": "COMMENT December 1 2016 - 7:52 AM Save Print License article First Contact: The message all Australians should take from Indigenous culture Ian \"Dicko' Dickson 17 reading now Show comments facebook SHARE twitter TWEET email google-plus linkedin reddit More The offer to appear on First Contact was met with the quickest\" Yes' I've ever given to any TV show since I've been in the business. I realised immediately that this was a golden opportunity to broaden what was a pretty narrow mind when it came to Indigenous people. It's such a hot potato for most suburban Australians--an awkward conversation that most would rather not have. Most of my own perception of black Australia was borne out of my own ignorance and a certain nagging white guilt. This, I felt was wholly inadequate. Play Video Replay Video Play Video Don't Play Up Next Trailer: Mad Sheila Virgin Road Play Video Don't Play Video duration 00:54 More Trailers Videos Previous slide Next slide Video duration 01:38 Trailer: First Contact season 2 Trailer: First Contact season 2 Hosted by <mark>Ray Martin</mark>, First Contact is the journey of six European Australians who are challenged about their perceptions of Indigenous Australians. Up Next Trailer: Mad Sheila Virgin Road Play Video Don't Play Video duration 00:54 Video duration 00:54 Trailer: Mad Sheila Virgin Road Trailer: Mad Sheila Virgin Road Bounty hunter Xi Liya rescues a group of virgins from a band of steam-punk desert warlords. Up Next Trailer: Midnight Sun Play Video Don't Play Video duration 00:59 Video duration 00:59 Trailer: Midnight Sun Trailer: Midnight Sun A brutal murder leads French homicide investigator to Kiruna, Sweden, where her investigation soon takes on staggering proportions. Up Next Trailer: Coral: Rekindling Venus Play Video Don't Play Video duration 01:42 Video duration 01:42 Trailer: Coral: Rekindling Venus Trailer: Coral: Rekindling Venus An extraordinary journey into a mysterious realm of fluorescent coral reefs, bioluminescent sea creatures and rare marine life, revealing a complex community living in the oceans most threatened by climate change. Up Next Trailer: Beaches Play Video Don't Play Video duration 01:00 Video duration 01:00 Trailer: Beaches Trailer: Beaches The story of two friends from different backgrounds whose friendship spans more than 30 years through childhood, love, and tragedy. Up Next Trailer #2: Assassin's Creed Play Video Don't Play Video duration 02:25 Video duration 02:25 Trailer #2: Assassin's Creed Trailer #2: Assassin's Creed When Callum Lynch explores the memories of his ancestor Aguilar and gains the skills of a Master Assassin, he discovers he is a descendant of the secret Assassins society. Up Next Trailer: Bon Appetit Play Video Don't Play Video duration 00:57 Video duration 00:57 Trailer: Bon Appetit Trailer: Bon Appetit Gérard Depardieu travels through different European regions looking for their famous local specialities, identity and history. Up Next Trailer: The Grand Tour Play Video Don't Play Video duration 01:34 Video duration 01:34 Trailer: The Grand Tour Trailer: The Grand Tour Jeremy, Richard, and James embark on an adventure across the globe, driving new and exciting automobiles from manufacturers all over the world. More videos Trailer: First Contact season 2 Hosted by <mark>Ray Martin</mark>, First Contact is the journey of six European Australians who are challenged about their perceptions of Indigenous Australians. The trip was an enormously empowering experience. I have far fewer answers than when I set off but at least now I get the feeling I am equipped to ask better questions. The complexity of the situation we encountered was enormous; sometimes confronting and distressing, at other times uplifting and inspiring yet always somehow confusing and confounding to my white sensibilities. SHARE Share on Facebook SHARE Share on Twitter TWEET Pin to Pinterest PIN Link Ian \"Dicko' Dickson with Timmy\" Djawa' Burarrwanga in East Arnhem Land Photo: <mark>David</mark> Dare Parker We met a huge number of impressive people dedicating their whole lives to advance their communities, but there was often a subtext of hopelessness beneath their efforts. It was as though they were swimming against a tide of self-destruction. Often these incredible individuals admitted they were merely laying down and smoothing a pillow for a dying generation of broken people. Elsewhere, we visited what most people would have to admit were very efficient, very impressive black communities whose self-governance I would describe as ultra-conservative and zero tolerance. This was hard to take for a bleeding heart leftie like me. These were the sort of no-nonsense, three-strikes-and-you're - out policies that would have most white urban lefties crying \"Fascists!\" if it was implemented by the federal government; yet this was a work of steely self-determination by blackfellas, and it was working just fine. Shit! Maybe I'm not a lefty after all! Advertisement I had believed that under the skin, all humans are alike. I now believe this to be a misconception that sells our wonderful diversity short. I met a man in Arnhem Land who told me that blackfellas and whitefellas are different. Initially I felt uncomfortable with what he was telling me, regarding it as divisive, maybe even racist. He told me that blackfellas and whitefellas see the world differently. That whitefellas generally think in straight lines while blackfellas think in circles. He also said that whitefellas are driven by time while blackfellas are more attached to place. SHARE Share on Facebook SHARE Share on Twitter TWEET Pin to Pinterest PIN Link <mark>David Oldfield</mark>, Natalie Imbruglia, Ian \"Dicko' Dickson, Renae Ayris, Tom Ballard, Nicki Wendt and host <mark>Ray Martin</mark> at Derby Airport. Photo: <mark>David</mark> Dare Parker I didn't quite get the time and place distinction until it was beautifully Illustrated to me in northern Western Australia. A young Indigenous girl who was working with us told us she was heading to the coast to see her mob .\" How long are you going to be in Wyndham? \"one of us asked her .\" Aw...'til I get back! \", came her thoughtful reply. Pure poetry! We are different. Wonderfully, magically different. I had several confrontations with <mark>David Oldfield</mark>. He was convinced that as a nation, Australia could derive nothing from embracing, supporting or saving Aboriginal culture. He scoffed at programs to save local languages, stating that no young blackfella was going to increase his chances of landing a job because he spoke his own traditional language. Unfortunately, we hear this a lot; there now appears to be only an economy where once there was a society too. Unfortunately, an economy is a cruel task master with a brutal logic and little time for concepts such as, tradition or culture or beauty. <mark>Oldfield</mark> was also often keen to point out that Aboriginal culture was\" stone age \". He used it as a pejorative term, proof that our first nation Australians have little to offer beyond throwing in the towel and assimilating into our technologically advanced, turbocharged, white utopia. I intend to lend <mark>Oldfield</mark> a brilliant book by Bill Gammage entitled The Biggest Estate on Earth. It details how for tens of thousands of years before white settlement, blackfellas conducted incredibly sophisticated land management practices to ensure plentiful wildlife and plant foods. Gammage also contends that without this skilful management, Australia has become vulnerable to the devastating bushfires that we encounter on a regular basis. Australia is selling itself short by marginalising its Indigenous people. We can learn so much from our ancient cultures. So following my time on First Contact, the question I am left with is this: Why do most Australians do not share a pride in our nation's ancient heritage? Surely a deep and respectful knowledge of one's country can only enrich our sense of national identity? I imagined telling the people of my birth place, a nation of proud post-Brexit Britons that we would be wiping all British history pre 1788: No Henry VIII beheading his wives, No Queen Elizabeth I or the Spanish Armada, No 1066 and the Norman invasion. No Romans, no Hadrian's Wall and no Stonehenge! I promise you if this happened there would be blood on the streets Yet this is exactly what we have been asking Australians, both black and white, to accept. I really don't know how we go about closing the shocking gap in equality that I saw between black and white Australia. I fear it may take generations of hard work, belief and understanding before we see real equality. What I do believe is that real healing begins with a desire to see things from the other fella's point of view; a desire for understanding, a need for respect. If we can find a way of developing a deep pride in our shared history, an ancient history, a remarkable story, then this I think will allow us to take the first few steps to really complete us as a nation. Perhaps we white Australians could resist the urge to talk about blackfellas as a costly, and dysfunctional\" them \", and instead start perceiving our first nation Australians as an incredibly proud and integral part of\" us \". We are so keen to pat ourselves on the back for Australia's successful multiculturalism, but Aboriginal history is the fascinating story of multiculturalism writ large. Before 1788 this continent played host to, according to some research, about 450 separate nations all with distinct identities, language, culture and traditions. This is a fabulous story. This is the story of Australia, our country. Black, white, Asian, Pom, it doesn't matter. We should all share a pride in the ancient stories found in the red dust beneath our feet. Only then can we truly call ourselves Australians. Ian\" Dicko' Dickson is a TV and radio presenter. First Contact continues Thursday at 8.30 pm on SBS and NITV. Advertisement 0 comments Log in to comment New User? Sign up You are logged in as unknown Logout 300 words Close comment form Write your comment here Screen name (required) Location (optional) I understand that submission of this content is covered by the Conditions of Use by which I am bound and Commenting Guidelines are available for my reference. Close Thank you Your comment has been submitted for approval. Please note that comments are moderated and are generally published if they are on-topic and not abusive. Sort comments by Oldest Newest"}, {"articleID": "2012081916_00026214_W", "names": {"Angela Johnson": ["Q17159696", "Q3616763", "Q4762469", "Q4762470"]}, "date": "2012-08-19", "url": "http://clickliverpool.com/culture/reviews/1217001-review-yes-prime-minister-play-at-trafalgar-studios,-whitehall,-london.html", "content": "review: yes prime minister play at trafalgar studios, whitehall, london by <mark>angela johnson</mark>. published sun 19 aug 2012 15:52 fittingly performed in the political heart of london satirical play??? yes, prime minister??? brings us some tongue-in-cheek antics to smile about at whitehall. michael simkins (foyle's war) and robert daws (the royal) step smoothly into the weighty roles of sir humphrey appleby and prime minister jim hacker, immortalised by well loved actors nigel hawthorne and paul eddington in the celebrated 80s sitcom. original writers antony jay and jonathan lynn have lost nothing of their beloved characters' wit on the current state of government with observations such as \"hanging's too good for them\" in reference to the hung parliament and sir humphrey's cunningly verbose speeches met with uproarious laughter. leading a coalition government prime minister hacker yearns for positive headlines but between the desperate state of the economy, the threat of global warming, the bbc, daily mail and the european union breathing down his neck, the situation seems hopeless. that is until a potentially debt-solving investment in the shape of an oil pipeline through europe is offered by fictional country kumranistan (located \"somewhere over there ...'). what could go wrong? unprecedented demands from the visiting kumranistan foreign minister provide a tricky moral dilemma for hapless jim hacker and, as ever, it falls to his trusty aide sir humphrey, bumbling private secretary bernard woolley (clive hayward) and special advisor claire sutton (emily bruni) to solve the mess. the farcical plot develops slowly but stick with it as the dialogue and pace build to a deeply satisfying crescendo. top class west end entertainment. a must for fans of the original sitcom and anyone who might delight in the lighthearted observation that the government always will always make for the perfect joke. 8/10 booking information yes, prime minister written by antony jay and jonathan lynn trafalgar studios one whitehall city of westminster, sw1a 2dy box office 0844 871 7627 comments about review: yes prime minister play at trafalgar studios, whitehall, london"}, {"articleID": "2019060507_00249094_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-06-05", "url": "http://express.co.uk/comment/expresscomment/1136487/donald-trump-Left-protests-US-President-silent-China", "content": "True allies--President <mark>Donald Trump</mark> and Her Majesty the Queen (Image: Press Association) At his happiest among banner-waving demonstrators, he demeans his position as Leader of the Opposition by refusing to attend a state banquet and yet flocks to a crowd of EU fanatics, eco-warriors and pro-Palestinian Leftists to beat the drum of anti-Americanism. That's just his mark--the eternal student protester--still holding the same views he held half a century ago. Then, Left-wingers would throng outside the US embassy complaining of US imperialism. Strangely, though, they'd be very quiet about atrocities against citizens in the Soviet Union or communist China. A lot of noise about Vietnam but nothing about the Cultural Revolution in which millions of Chinese were persecuted and thousands executed. <mark>Donald Trump</mark> Piers Morgan interview video: WATCH IN FULL <mark>Donald Trump</mark>'s SHOCK reply when asked about Labour's Jeremy Corbyn The Left-wing intellectuals and student activists were wrong then and are wrong now. Hilariously, shadow foreign secretary Emily Thornberry declared yesterday: \"If Mr <mark>Trump</mark> wants to see us, we're more than happy to see him. But we don't think that it's appropriate for him to have a state visit .\" Apparently, Mr <mark>Trump</mark> did decline such an invitation from what he called \"a negative force\" but it makes you wonder at her judgment when senior Labour members were more than happy to line up to welcome Chinese leader Xi Jinping on his state visit in 2015. Was it possibly because Xi heads a communist state and no matter what crimes a Left-wing tyranny perpetuates, they can never be as bad as the capitalist USA? Chillingly, Chinese state media has censored all references to the student protests in Beijing 30 years ago this week which left hundreds, possibly thousands dead. Just one Chinese media outlet referred to it as a necessary \"immunisation\" against political turmoil. Now that really is something worth protesting about, but we have more fury on the streets of London from fuzzy-headed Lefties against US chlorinated chicken then against human rights violations in China now. Chinese students protest in Tiananmen Square, Peking (Image: Peter Turnley/Corbis/Getty) The full craziness of the Labour view of the world was expressed by London Mayor Sadiq Khan when he insulted the US President by saying: \"He is just one of the most egregious examples of a growing global threat .\" Really? That's more of a danger than a totalitarian nuclear power run by a president for life who is busy interning whole swathes of his population, militarising the South China Sea, rigging world trade and stealing our intellectual property? In contrast, Mr <mark>Trump</mark> is offering us a continued strong alliance and our most important post-Brexit trade deal. I know which I prefer, but maybe Corbyn, Thornberry and Khan know better than me? The visuals say it all. While Leftists rejoiced in floating a baby blimp of <mark>Trump</mark> over London yesterday, in Portsmouth today the US President and Her Majesty the Queen stand side by side to commemorate the launch of the greatest armada for freedom. On that occasion, US and British servicemen sacrificed their lives to defeat a real fascist regime, not the fake \"global far-Right movement\" , supposedly headed by <mark>Trump</mark>, as described by the London Mayor. The ridiculous Emily Thornberry, Lady Nugee (Image: Ian Forsyth/Getty) President <mark>Trump</mark> is simply standing up for sovereign nation states against genuine global threats against our liberty. He is right to stand tall against China's dubious trade practices. He is right to cast suspicion on giving Huawei access to sensitive parts of our communications system. All firms in China come under the shadow of the police state. Fearlessly he stands up against a European Union that bullies its poorer members and does not make a fair contribution to its own defences through Nato. The USA accounts for nearly 70 percent of all Nato expenditure and is entitled to wonder why a rich nation such as Germany doesn't pay more. President <mark>Trump</mark> backs Brexit to the hilt and wishes us well. He has his doubts about entrusting Jeremy Corbyn with joint defence intelligence. It's not surprising when you see Corbyn virtue signalling in Trafalgar Square about diversity, attacking the democratically elected <mark>Trump</mark>, yet being so quiet about human rights abuses in a range of socialist dictatorships from China to Venezuela. I'd rather listen to President <mark>Trump</mark> who said in his speech at the state banquet, recalling the Second World War: \"In that dark hour, the people of this nation showed the world what it means to be British,\" and made certain this country's destiny remained \"in your own hands\". Thank you, Mr President, and with your continued support, we will ensure it remains that way."}, {"articleID": "2014122805_00021617_W", "names": {"John Harwood": ["Q21165869", "Q6238161", "Q6238165"]}, "date": "2014-12-28", "url": "http://buffalonews.com/opinion/viewpoints/polarized-politics-our-unrealistic-hopes-for-presidents-20141228", "content": "Proposal to dissolve Village of Medina brews dissension Local investment advisers predict a strong year for stocks Welcome federal storm reimbursement will require an accurate accounting New ice rink is turning Canalside into a true year-round destination Another Voice: Old clothing should be donated, not thrown away New ice rink is turning Canalside into a true year-round destination \"Dancing With the Stars\" show is entertaining, but light on substance Mary Anne Buddenhagen, longtime Buffalo News correspondent [BN] the know Subscribe for just $1.99 / wk Polarized politics: Our unrealistic hopes for presidents When will we give up on the idea of a leader who will magically bring consensus and unity to our politics? At election time, candidates seduce us with promises to bring America together, but inevitably fall short and end up leaving office with the country more polarized than when they arrived. After blaming them for their failure to unite us, we turn to the next crop of presidential aspirants and the cycle of hope and disappointment begins all over again. The latest example of this pattern, of course, is President Obama. His 2008 campaign was premised on his ability to forge new coalitions in Washington, which Hillary Rodham Clinton mocked at the time as \"Let's get everybody together, let's get unified, the sky will open, the light will come down, celestial choirs will be singing .\" In office, though, he has never succeeded in overcoming Republican resistance to his agenda, forcing him to pass his most significant legislative accomplishments with few or no GOP votes. After his party's decisive defeat in last month's midterm elections, the administration has now largely given up on the pursuit of bipartisan dealmaking and is pursuing its policy goals on issues like immigration and the environment through executive action. The debate over why Obama failed to achieve some larger consensus has already begun. Some have suggested that if only he had not pursued health care reform or had a less detached and analytical personal style he might have won over the public and his opponents in Congress. It may be true that Obama has made mistakes, but our disappointment with him ultimately reflects the mismatch between our expectations for presidents and the partisan realities of the contemporary era. The public and the news media still want someone who meets the mid-20th-century ideal for a modern president: a uniting figure who works across the aisle to build support for his agenda and commands public opinion from the bully pulpit. While this image was always mostly a myth - presidents typically struggle to move polls or legislators' votes - the political realities of the time did allow presidents to build more diffuse coalitions in Congress and attract broad public support when the circumstances were favorable. However, the political system that helped enable this approach is disappearing. The mid-20th century was a historical anomaly - a low point in polarization that was made possible by the ugly history of race in this country, which enabled the rise of a group of conservative Southern Democrats who functioned almost as a third party. After the civil rights movement, the parties realigned on the issue of race, setting in motion a return to the historic norm of polarization that prevailed in the late 19th and early 20th century. This process, which is transforming all of our nation's political institutions, has been supercharged by the way the parties have become more closely aligned with ideological movements than ever before. A result is what the political scientist Richard Skinner calls the partisan presidency. In this era, presidents are dividers, not uniters (to reverse Bush's famous phrase); their public appeal is deeply polarized along party lines and they depend overwhelmingly on the support of co-partisans in Congress to enact legislation. They are particularly vulnerable to obstruction from the opposition party, which can withhold support as congressional Republicans have done, denying the president the imprimatur of bipartisanship and producing legislative gridlock for which the president is often blamed. That's why it's a mistake to personalize Obama's failures so much, as his critics often do. Critics suggest that Obama is too aloof and hasn't done enough to solicit Republican support or build relationships with legislators. Both may be true, but as <mark>John Harwood</mark> recently noted in the New York Times, Bill Clinton's more successful outreach to his opponents didn't keep him from getting impeached. Likewise, Bush was more gregarious than Obama, but it didn't make him any more popular among Democrats once the post-9 / 11 glow had worn off. It's a common mistake to attribute other people's behavior to their inherent characteristics in this way. We seem especially prone to this pattern, which is known as fundamental attribution error, with presidents. But as recent history shows, our current political system tends to produce division and conflict no matter the circumstances. Comedian Chris Rock is ahead of most political analysts in recognizing this new reality. In a recent interview, he described how Bush adapted to this new political environment, saying Bush \"only served the people who voted for him .\" \"He literally operated like a cable network,\" he added, while Obama is \"a network guy .\" He explained: \"He's trying to get everybody. And I think he's figured out, and maybe a little late, that there's some people he's never going to get .\" As we approach the next presidential campaign, we need to stop asking who can achieve the unity that has eluded Obama. For better or worse, the partisan presidency is here to stay. There are some people the next president will never get, as Rock puts it. The question we should ask instead is whether the candidate we choose will - or can - govern well without their support. Alerts Text message notifications of news happening now. U.S. should examine how torture occurred to ensure that it never happens again 287 Letter: It's likely that mankind created the notion of God Copyright 1999 - 2014 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later."}, {"articleID": "2016090119_00369066_W", "names": {"Eric Gordon": ["Q360993", "Q4696499", "Q5386598", "Q57957977"], "Tim Barnes": ["Q7803126", "Q7803127"]}, "date": "2016-09-01", "url": "http://pantagraph.com/looking-for-something-to-do-this-weekend/article_7d6bb22a-0642-50fc-8679-cb2426889273.html", "content": "For The Pantagraph Buddy Guy Special events Bloomington-Normal Festival ISU; 10 a.m.-3 p.m. Sept. 1, ISU quad; information on 300 student organizations, food, entertainment, more; free; 309-438-8814. Light the Night; 4-8 p.m. Sept. 1, uptown Normal; bike safety event with free LED lights for cyclists, bike repair stations and information, contests, prizes, live music; free; 309-454-9557. Terrorism on Screen; 7 p.m. Sept. 1-4, ISU Capen Auditorium; terrorism-themed film fest with post-film discussions; free. Schedule: \"Battle of Algiers\" (1966), Sept. 1; \"The Terrorist\" (1998), Sept. 2; \"Paradise Now\" (2005), Sept. 3; \"Bear Story\" (2014) and \"I Wonder What You Will Remember of September\" (2004), Sept. 4. Children's Art Show Installation; 6 p.m. Sept. 2, Grey Dove Gallery & Wings Studio, 105A-B W. Monroe St., Bloomington; installation of gallery's annual kids' art show with surprise theme; free; 309-830-3481. +3 CARLOS T. MIRANDA, Pantagraph file photo First Friday; 5-8 p.m. Sept. 2, various downtown Bloomington restaurants, shops and galleries; extended hours, live entertainment, gallery events and more; www.downtownbloomington.org. Route 66 Haunted Bloomington-Normal Ghost Walk; 7 p.m. Sept. 2, downtown Bloomington; $15, with reservations at www.spiritsofbloomington.com. Downtown Bloomington Farmers Market; 7:30 a.m.-noon Sept. 3, downtown Bloomington square; fresh produce, meats, cheeses, baked goods, art, live music, more; free admission; 309-829-9599. Bloomington-Normal Labor Day Parade; 10 a.m. Sept. 5, Front and Center streets in downtown Bloomington to Miller Park; floats, marching bands, more; free; 309-828-8813. +3 LORI ANN COOK-NEISLER, Pantagraph file photo Central Illinois Gail's Pumpkin Patch; noon-5:30 p.m. Sun.-Fri ., 10 a.m.-5:30 p.m. Sat ., Sept. 1-Oct. 31, 1709 2000 Ave., Beason; pumpkin patch, baked goods, crafts, toddler maze, displays, special weekend events, more; 217 - 447-3409. Delavan Fall Festival; 6-10 p.m. Sept. 2, 8 a.m.-10 p.m. Sept. 3, 10:45 a.m.-10 p.m. Sept. 4, 6:30 a.m.-5:30 p.m. Sept. 5, downtown Delavan; parade (10:30 a.m. Mon.), carnival, entertainment, food, games, more; free; www.delavanfallfestival.com. Roamer Cruise Night & Car Show; 10 a.m.-10 p.m. Sept. 3, downtown Streator; 1917 Roamer car displays, food, music and more; free. Twin City Amateur Astronomers Public Viewing Sessions; 8-10 p.m. Sept. 3, Sugar Grove Nature Center at Funks Grove; open telescope viewing on topic of \"The Heart of the Milky Way Galaxy\" ; free; 309-830-4085. DuQuoin State Fair; 8 a.m.-midnight Sept. 3-5; harness racing, nightly grandstand shows and more; 618-542-1515. +3 LORI ANN COOK-NEISLER, Pantagraph file photo Grape Stomp & Harvest Festival; noon-6 p.m. Sept. 4, Mackinaw Valley Vineyard, Mackinaw; live entertainment, harvest activities, grape stomp, \"Lucy' look-alike contest, kids' activities, more; $5, under 13 free; 309-359-9463. Jewelweed & Winged Jewels; noon-4 p.m. Sept. 4, Chautauqua Picnic Area at Weldon Springs State Park, Clinton; hummingbird viewings and program; free; 217-935-0373. Peoria Labor Day Parade; 10 a.m. Sept. 5, downtown Peoria; free; 309-681-0696. Streator Labor Day Parade; noon Sept. 5, downtown Streator; floats, bands, more; free; 815-672-2921. National Stearman Fly-In; 10 a.m.-6 p.m. Sept. 5-11, Galesburg Municipal Airport, Galesburg; World War II-era Stearman biplane fest, with displays, shows, more; $1; www.stearmanflyin.com. Downs Village Market; 4-6 p.m. Sept. 7, southwest edge of Downs, off I-74; fresh local produce, baked goods, plants and flowers, crafts, more; free admission; 309-378-4396. Music Bloomington-Normal The Junior Varsity, Alex and the XO's, Mammoth Cannon and Movies About Animals; 7:30 p.m. Sept. 1, Castle Theatre, 209 E. Washington St., Bloomington; rock groups; $15; 309-820-0352. Loungeabout the Roundabout: Unemployed Architects; 6:30 p.m. Sept. 1, Uptown Circle, Normal; rock group; free; 309-454-9557. Sweetwater; 5:30 p.m. Sept. 1, Connie Link Amphitheater, Normal; pop-rock group; free; 309-454-9540. Mark Babbitt; 8 p.m. Sept. 2, ISU Kemp Recital Hall; ISU faculty trombonist, with guest pianist John Orfe; free. Whiskey Myers and Bogart Jones Band; 7:30 p.m. Sept. 2, Castle Theatre, 209 E. Washington St., Bloomington; rock-blues groups; $12 - $15; 309-820-0352. Central Illinois Bement Country Opry; 7 p.m. Sept. 2, Monticello Community Ballroom, 201 State St., Monticello; country music shows with Bement Country Opry band and guest <mark>Eric Gordon</mark>; $10; 217-377-0550. Heyworth Country Opry; 6 p.m. Sept. 3, Heyworth VFW, 203 E. Main St., Heyworth; country music shows with Steve Hargis & Friends; $10, under 10 free; 217-949-5311. Kentuckiana Opry; 8 p.m. Sept. 3-4, Kentuckiana Kampground, Hopedale; country music shows with Kentuckiana Opry Band and guest Ken Honecker (Sat .) and Rock 'n' Roll Show (Sun .); adults $8, children $2; 309-449-3274. Peoria Blues & Heritage Music Festival (formerly Budweiser Illinois Blues Festival); 6 p.m.-midnight Sept. 2, noon-midnight Sept. 3, Riverfront Festival Park, downtown Peoria; blues fest with two performance stages, headliners (Buddy Guy, O.A.R., Mavis Staples, Coco Montoya, Here Come the Mummies, more), food and beer, workshops, vendors, more; $25 Fri., $30 Sat ., $45 weekend pass; 800-514-ETIX. Rachel Barton Pine; 7 p.m. Sept. 7, Eureka College Becker Auditorium, Eureka; classical violinist; general $20, students $5; tickets at the door. Theater Bloomington-Normal Boeing Boeing; pay-what-you-can preview, 7:30 p.m. Sept. 1; regularly ticketed, 7:30 p.m. Sept. 2-3 and Sept. 9-10, and 2:30 p.m. Sept. 4 and 11, Community Players Theatre, 201 Robinhood Lane, Bloomington; comedy; $7 - $15; 309-663-2121. Central Illinois Memphis; 7:30 p.m. Sept. 1-3, Corn Stock Theater, Upper Bradley Park, Peoria; musical; $12 - $20; 309-676-2196. Nightlife Bloomington-Normal Noah's Back Alley Blues Band; 8 p.m. Sept. 1, Jazz UpFront; blues; no cover. Karaoke; 8:30 p.m. Sept. 1, 4 and 7, Shooters Lounge; no cover. Ezra Casey & Friends; 8 p.m. Sept. 2, Jazz UpFront; jazz; $5. Mark & Melisa; 7 p.m. Sept. 2, Bloomington Eagles; country-rock; $5. Patrick Campbell; 6 p.m. Sept. 2, Hyatt Place patio; solo piano; no cover. Tom Ricker; 6 p.m. Sept. 2, Maguire's; acoustic variety; no cover. J.B. and <mark>Tim Barnes</mark>; 5:30 p.m. Sept. 2, 8:30 p.m. Sept. 3 and 6 (<mark>Barnes</mark> only), Shooters Lounge; DJs; no cover. Back @ Cha; 6:30 p.m. Sept. 3, Baxter's American Grille; rock; no cover. Heroso; 9 p.m. Sept. 3, Winners; rock-pop; $3. Jim Vasilou & Trefan Owen; 7 p.m. Sept. 3, Dr. McKay's; acoustic rock; no cover. Joe Metzka and Rusty Hall; 8 p.m. Sept. 3, Jazz UpFront; jazz; $5. Kevin Stearns; 7 p.m. Sept. 3, Schooners; acoustic pop; no cover. Mongolian Death Wyrm; 8:30 p.m. Sept. 3, The Bistro; progressive boogie; no cover. Who Cares; 6 p.m. Sept. 3, Copper Top Lounge parking lot; classic rock; no cover. Candy Foster & The Shades of Blue; 8 p.m. Sept. 4, Jazz UpFront; blues; $5. Comedy Showcase; 8 p.m. Sept. 7, Jazz UpFront; comedy; no cover. Central Illinois Silver Foxes; 6:30 p.m. Sept. 1, American Legion, Heyworth; country; no cover. Miles Nielsen & The Rusted Hearts; 9 p.m. Sept. 2, Kemp's Upper Tap, Lexington; rock; no cover. Jammsammich; 7 p.m. Sept. 3, Mackinaw Valley Vineyard, Mackinaw; jam rock; $5. Jury's Out, Andy Morrelion and Jack Dupp; 5 p.m. Sept. 3, Lake Road Inn parking lot, Hudson; rock-variety; $5 (kids free). Rockin' Johnny Burgin and Tom Irwin; 3 p.m. Sept. 5, TailGaters Pub, LeRoy; blues; no cover. Stewart's Goose; 1:30 p.m. Sept. 5, Mackinaw Valley Vineyard, Mackinaw; acoustic; no cover. For kids Bloomington-Normal Children's Discovery Museum; 9 a.m.-5 p.m. Tue.-Wed. and Fri.-Sat ., 9 a.m.-8 p.m. Thu., 1-5 p.m. Sun .; 101 E. Beaufort St., Normal; exhibit gallery, paint wall, two-story climber, AgMazing exhibit, educational programs, more; $7, under 2 free; 309-433-3444. Astronomy: 3,000 Years of Stargazing; 7:30 p.m. Sept. 2-3, 2:30 p.m. Sept. 3, ISU Planetarium; planetarium show on major astronomical milestones of last 3,000 years; $2 - $4; 309 - 438-5007. Follow Dan Craft on Twitter: @ pg_dcraft Tags Sweeps Bloomington Blues Rock Live Music Exhibit Normal Country Music More from pantagraph.com & times; Post a comment Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment & times; Report Cancel Report Abuse & times; Watch this discussion. Stop watching this discussion. Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching"}, {"articleID": "2010100704_00022009_W", "names": {"George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"]}, "date": "2010-10-07", "url": "http://liverpoolecho.co.uk/liverpool-news/uk-world-news/2010/10/07/unions-concern-for-pensions-report-100252-27420322/", "content": "unions' concern for pensions report oct 7 2010 the government is to face a wave of anger when it publishes a report expected to pave the way for millions of public sector workers to pay more into their pension and retire later. ministers will be on a collision course with the country's most powerful trade unions, who have warned that slashing pensions will add to the \"volatile cocktail\" of job and pay cuts already facing health, education, council and other employees. an interim report by former labour minister lord hutton is expected to highlight an \"affordability issue\" with public sector pensions, adding that they cannot be sustained at their current level. there was speculation that the report will not recommend a specific retirement date for workers or suggest how much more they should pay into their scheme, despite suggestions that their contributions could more than double in some cases, while the age at which people qualify for a full pension could increase to 65. sources said the report will instead highlight the fact that people are living longer, so it would be logical for the public sector retirement age to be increased, but unions are braced for the review to say that higher contributions and a raised retirement age are the only way to tackle the growing cost of the schemes. the amount workers, such as teachers, nhs staff, local government employees and civil servants, have to pay into the schemes could be increased as early as april. lord hutton was commissioned to carry out the review by chancellor <mark>george osborne</mark>, who warned the \"unsustainable\" rise in the annual bill for public sector schemes must be tackled. tuc general secretary brendan barber said: \"public servants are already facing job cuts, a pay freeze and intensified workloads as staff are not replaced. cuts in their pension provision and increased contributions that lead to a cut in take home pay, at a time when inflation is biting, will add to the volatile cocktail of issues they face .\" unite warned that reducing the quality of public sector pensions will increase inequality, hitting women the hardest. the liverpool echo, the best source for liverpool fc, everton fc and liverpool news. your liverpool echo, great local images, videos and your local stories."}]