[{"articleID": "2019100304_00129233_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-10-03", "url": "http://wicz.com/story/41133543/kamala-harris-poll-numbers-tumble-in-her-home-state-of-california", "content": "Updated: By Maeve Reston, CNN In yet another sign of trouble for Sen. Kamala Harris in the 2020 presidential race, the California Democrat has slid from an enviable front-runner position in her home state into the single digits in a new poll of likely voters in the Golden State. As the state's March 5 primary draws closer, Sen. Elizabeth Warren of Massachusetts (23%), former Vice President Joe Biden (22%) and Sen. Bernie Sanders of Vermont (21%) are now tied as the leaders in the field among likely voters who are either registered as Democrats or identify as Democratic-leaning independents in the new Public Policy Institute of California poll, which was conducted in mid - to late September after Harris' uneven performance in the last debate. Harris tumbled from 19% in July to 8% in the new poll by the institute, failing to sustain the momentum she sparked with her first debate performance in June. She lost significant ground over the summer, while her chief rivals all solidified their standing among California voters. In the July poll, Warren was at 15%, Sanders was at 12% and Biden was at 11%--all trailing Harris, who got both a fundraising and a polling bounce after she delivered a fiery performance in the first debate in Miami by questioning the former vice president's past opposition to busing for the purpose of desegregating schools. While it is often said that California tends to reflect the national state of play of the presidential race--because it is so expensive to wage an intensive campaign in this vast and diverse state--the new Public Policy Institute of California poll underscores that Harris does not seem to be drawing any advantage from the fact that she served as the state's attorney general and continues to serve constituents as the state's junior US senator. \"These numbers reflect what's going on in the national scene, but they also reflect that there is not a home state advantage (for Harris). There's not an advantage from the fact that she's run in statewide races here in 2010, 2014 and 2016,\" said Mark Baldassare, who directs the survey and is the institute's president and CEO. Harris' supporters and advisers had hoped she would be able to rack up a considerable number of delegates in California when the state holds its Super Tuesday contest, building momentum that would carry her into the spring primaries. \"Sen. Harris has to prove to (California) voters just like any other Democratic presidential candidate--\"What are you going to do for me?' and\" Where do you stand on the issues?' and \"Are you the person who is most likely to defeat <mark>Donald Trump</mark>?\" Baldassare said. \"The name identification associated with being the state's senator and somebody who's been on the ballot--it's not an advantage right now.\" The new California poll numbers come as Harris' campaign is restructuring its leadership and attempting to streamline its decision-making. After stumbling through a fog of confusion about her position on the single-payer \"Medicare for All\" proposal and amid falling poll numbers over the past three months--including in South Carolina, where a recent survey showed her at 3%--Harris is moving her Senate chief of staff, Rohini Kosoglu, and senior adviser Laphonza Butler into top leadership positions within the campaign. Harris--who has notched a series of firsts in her career, including becoming California's first female attorney general of color--has acknowledged at campaign events that she faces some unique hurdles; namely, as she likes to point out, that Americans have never elected a president who looks her. But she has vowed to soldier on. During a recent fundraiser in Los Angeles, she laughed when retelling the story of how a reporter recently overheard her telling fellow Sen. Mazie Hirono of Hawaii, \"I'm f ***** g moving to Iowa,\" which will hold its first-in-the-nation caucuses on February 3. That comment was heard far and wide, and Harris noted to laughter that the famed Des Moines T-shirt company RAYGUN is printing her remark on one of its shirts. As they strategize for the Golden State primary, Harris and all of the other Democratic candidates will have to contend with a darkening mood among California voters they see signs of weakness in the US economy and grapple with a homelessness crisis statewide. Homelessness ranked as the most important issue facing the state for the first time in the Public Policy Institute of California survey's 20-year history, according to Baldassare. That was followed by voters' concerns about jobs and the economy, as well as rising housing costs--which have contributed to increasing numbers of Californians living on the streets. Baldassare noted that homelessness moving to the top of the list of concerns was an astonishing finding. \"It's just incredible,\" Baldassare said. \"It's visible, and it's a growing issue ....It's a very tough issue. It's disturbing for people to see the suffering that's occurring--it's something that doesn't fit with their image of what should be going on in their community. And they're frustrated that the government seems incapable of getting its hands around it. It's not just a San Francisco or an LA issue anymore. It's everywhere.\" Signs of economic uncertainty are also weighing on California voters. A year ago, 53% of Californians said they expected to see good economic times over the following 12 months. Now only 41% of the state's residents said they expected good times over the next year, while 50% said they expect bad times financially. \"More people are getting nervous about the direction of the economy,\" Baldassare said. \"That's a big change. That speaks to some combination of political and economic uncertainty really surfacing--and that has impacts on what choices people make when they go to the ballot. They tend to feel more negative about incumbents and officeholders, because they feel like,\" Why aren't they doing something about this?' They're going to be looking for some message of hope or a plan for what they're going to do if things get worse. \"The Public Policy Institute of California survey was conducted via telephone from September 16 to 25 with 1,705 California adult residents. The results have a + / - 3.2 percentage point sampling margin of error for all adults, a + / -3.7 percentage point sampling margin of error for 1,344 registered voters and a + / - 4.2 percentage point sampling margin of error for 1,031 likely voters. Can't Find Something?"}, {"articleID": "2018121713_00436442_W", "names": {"Julie Green": ["Q22278018", "Q56251731", "Q57417848"]}, "date": "2018-12-17", "url": "http://wdiy.org/post/art-series-captures-taste-and-color-prisoners-first-meal-after-exoneration", "content": "Art Series Captures Taste And Color Of Prisoners' First Meal After Exoneration By Kristen Hartke • 23 minutes ago Tweet Share Google + Email View Slideshow 1 of 3 Exonerated after 16 years in prison, Kristine Bunch ate a celebratory meal of scallops, cheese grits, a platter of hummus and vegetables, and champagne. It was a meal that became the first image by artist <mark>Julie Green</mark> in her series \"First Meal,\" a project supported by the Oregon State University Center for the Humanities. (Paintings are 4 feet by 3 feet, acrylic on Tyvek .) <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery View Slideshow 2 of 3 One exoneree, after spending 15 years in prison for murder, was given an orange by a waitress and just held it, basking in its color and scent. \"How do you illustrate holding an orange for 40 minutes before savoring every bite?\" asks <mark>Green</mark>. <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery View Slideshow 3 of 3 In a scene recreated by <mark>Green</mark>, someone brought blueberries--the exoneree's favorite fruit--to her first meal, a potluck, and hand-fed them to her in a moment of tenderness. <mark>Julie Green</mark> / Courtesy of <mark>Julie Green</mark> and Upfor Gallery A cookie may have led to Kristine Bunch's release from prison--and sparked a series of paintings inspired by wrongful convictions. In 1996, Bunch was found guilty in Indiana for the arson-murder of her 3-year old son. She proclaimed her innocence for the next 16 years behind bars, until she was finally exonerated in 2012. She was 22 years old and six months pregnant with her second son when she first entered prison. Several years later, Bunch saved cookies for a pregnant fellow inmate, a small kindness that unexpectedly helped her find a lawyer to take her case. \"I knew what it was like to be pregnant in prison,\" recalls Bunch, \"so I would bring this girl cookies from the kitchen. One day, she asked me about my case, and then she wrote to her lawyer about me.\" Bunch's case was eventually taken up by the Center on Wrongful Convictions at Northwestern University's Pritzker School of Law, which obtained previously withheld documents from the Bureau of Alcohol, Tobacco, Firearms and Explosives, along with her son's autopsy report, which directly contradicted the initial arson investigation and showed that the trailer house fire was accidental. Tasting freedom for the first time since she was arrested at age 21, Bunch went to a restaurant near the courthouse in Columbus, Ind., and ate a celebratory lunch: scallops, cheese grits, a platter of hummus and vegetables, and champagne. It was a meal that ended up becoming the first image in a series titled \"First Meal\" by <mark>Julie Green</mark>, a visual artist and professor of art at Oregon State University. <mark>Green</mark>, who is known for another project called \"The Last Supper,\" an ongoing series depicting the final meals of death row prisoners, is now documenting first meals eaten by exonerated prisoners. <mark>Green</mark> met Bunch in 2015, when her work was being exhibited at Northwestern University's Block Museum. The concept for the new series was already incubating in <mark>Green</mark>'s mind, however, from a conversation she'd had back in 2000 with Oklahoma State University art department chair Jim Folts. \"Jim said,\" When you end the [Last Supper] series, you could paint a final plate: a first meal of an exoneree,' \"says <mark>Green</mark>, who has a goal of immortalizing 50 death row meals each year until capital punishment is abolished--and has completed 800 so far.\" Eighteen years later, I am doing just that, painting First Meal. I couldn't wait any longer. \"<mark>Green</mark> views this series, and her other work, in the same way, saying,\" I hope the viewer will consider the margin for error in the judicial process. \"First Meal' may bring about conversation that could lead to positive change. Art can do that.\" Bunch wasn't intending on becoming the subject of a painting when she met <mark>Green</mark>, but wanted to find out if <mark>Green</mark> had yet documented the final meal--which included enchiladas and pie--of Cameron Todd Willingham, who was convicted of the arson-murder of his three young children in 1992 and executed in Texas in 2004. The forensic evidence in Willingham's case, eerily similar to that which convicted Bunch, has been questioned in the years since his death. \"<mark>Julie</mark> told me she hadn't had time to create his plate yet,\" says Bunch, \"but then she contacted me later and sent me a reproduction of what his plate would look like. It touched me so much that she did that, so when I heard about the new project, I was absolutely on board with participating.\" Sara Sommervold, a fellow and attorney at the Center on Wrongful Convictions, sees the \"First Meal\" project as one that, like \"The Last Supper\" series, helps to humanize convicted prisoners. \"That first meal is a very profound event in an exoneree's life,\" says Sommervold. \"The inability to choose food in prison, the absence of color and flavor, these are all fundamental parts of the experience. It's no accident that so many exonerees choose colorful plates of food when they are released.\" One exoneree, who spent 15 years in prison for murder, spoke in his interview with the Center on Wrongful Convictions about being given an orange by a waitress during his first meal, and how he simply held it for more than half an hour, glorying in its color and scent, saying, \"The little things in life mean so much when you're deprived of them, but out in the world we take them for granted.\" With a goal of amassing 20 menus, Sommervold helps collect interviews with clients who have been exonerated, which <mark>Green</mark> then crafts into a visual representation--but the process is about more than paint. \"Naively, I thought\" First Meal' would be more uplifting to paint than \"The Last Supper,'\" says <mark>Green</mark>. \"Of course the meal is celebratory, but it is nothing compared to all those lost years. And how do you depict absence, not having an orange for seven years? How do you illustrate holding an orange for 40 minutes before savoring every bite?\" <mark>Green</mark>'s approach is inspired by her love for flow blue, a type of ceramic dishware--also called transferware--that originated in Staffordshire, England, in the early 19th century and is distinguished by its soft, or flowing, blue glaze. The decorative images on the pottery often depict scenes of pastoral countryside or happy celebrations, which <mark>Green</mark> felt could offer an interesting counterpoint to the underlying subject. She also often incorporates other symbolic imagery, like the state bird where the conviction took place or thumbprints representing DNA analysis. For the image of Bunch's first meal, <mark>Green</mark> says, \"I chose a transferware of an idyllic gathering to show the passage of time, and how surreal it must be to leave prison and be with your family and friends eating hummus and scallops.\" As the project continues to take shape, <mark>Green</mark> has begun incorporating text from the actual interviews into the images to help provide necessary context, such as an exoneree who described having a potluck-style first meal at a friend's home. Someone brought blueberries--the exoneree's favorite fruit--and hand-fed them to her in a moment of tenderness, a scene recreated by <mark>Green</mark> in the final piece. The subtlety of the imagery can be surprising when juxtaposed against the human tragedies that are at the root of the artwork. \"She's not your standard commercial gallery artist,\" says Theo Downes-LeGuin, who represents <mark>Green</mark> at Upfor Gallery in Portland, Ore. \"The power of art, and of this type of project, is that it gives people enough controversy to have that conversation, but also a safe place in which to discuss it.\" Kristen Hartke is a food writer based in Washington, D.C. Copyright 2018 NPR. To see more, visit https: //www.npr.org. Tweet Share Google + Email View the discussion thread."}, {"articleID": "2019061004_00018326_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"], "James Gunn": ["Q1152925", "Q715505", "Q717015"]}, "date": "2019-06-10", "url": "http://daijiworld.com/news/newsDisplay.aspx?newsID=595430", "content": "<mark>Chris Pratt</mark>, Katherine Schwarzenegger get married <mark>Chris Pratt</mark>, Katherine Schwarzenegger get married Mon, Jun 10 2019 09:19:02 AM Los Angeles, Jun 10 (IANS): Hollywood star <mark>Chris Pratt</mark> has followed up the mega success of \"Avengers: Endgame\" by taking the next big step in his personal life. He married actor Arnold Schwarzenegger's daughter Katherine at a ceremony in the presence of close friends and family members, the US media reported. According to multiple media reports and photographs that emerged online, the couple exchanged wedding vows at a luxury resort in Montecito, California. It is the first marriage for Katherine, the eldest child of Schwarzenegger and Maria Shriver, and the second for <mark>Pratt</mark>, who had earlier wed Anna Faris and has a six-year-old son named Jack with her. Jack too was present at his father's wedding, which also saw \"Guardians of the Galaxy\" director <mark>James Gunn</mark> and Schwarzeneggers' family friend Rob Lowe, apart from Katherine's siblings Patrick, Christopher and Christina in attendance, reports said. <mark>Pratt</mark>, 39, and Katherine, 29, were first linked together last June. They continued to be seen on dates, but they made their relationship official on social media when <mark>Pratt</mark> shared a collage last December. In January, <mark>Pratt</mark> shared the news of their engagement in an Instagram post. \"Sweet Katherine, so happy you said\" yes'! I'm thrilled to be marrying you. Proud to live boldly in faith with you. Here we go, \"he had captioned an Instagram photo of himself cuddling up to Katherine. Top Stories You have 2000 characters left. Disclaimer: Please write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article. Please note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request. Hence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible. Security Validation"}, {"articleID": "2019041313_00056385_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}, "date": "2019-04-13", "url": "http://economictimes.indiatimes.com/news/elections/lok-sabha/india/lok-sabha-polls-is-a-fight-between-anil-ambani-ordinary-people-thieves-honest-people-rahul-gandhi/articleshow/68864936.cms", "content": "Lok Sabha polls is a fight between Anil Ambani & ordinary people, thieves & honest people: Rahul Gandhi Rahul said the election was also a fight between ideologies, where there is hatred, anger and divisive politics on the one hand and love, affection and brotherhood on the other. PTI | Apr 13, 2019, 05.43 PM IST 0 Comments Reuters Mocking the \"Chowkidar' (watchman) term coined by the Prime Minister for himself, Gandhi sought to know whom did the watchman guard. Congress president Rahul Gandhi Saturday said the 2019 Lok Sabha election is a fight between Anil Ambani and ordinary people, thieves and honest people and false promises and the truth.\" This election is between Anil Ambani and the common citizens, five years of \"Anyay' (injustice) and NYAY (justice/minimum income scheme), thieves and honest people and false promises and truth,\" said Gandhi at a public rally here. The Congress president said the 2019 election was also a fight between ideologies, where there is hatred, anger and divisive politics on the one hand and love, affection and brotherhood on the other. He added that the fight is also about the \"lie\" of Prime Minister Narendra Modi of depositing Rs 15 lakh into everyone's account and Rs 3.6 lakh into the accounts of women living below the poverty line as promised by the Congress. Mocking the \"Chowkidar' (watchman) term coined by the Prime Minister for himself, Gandhi sought to know whom did the watchman guard.\" Have you ever seen a Chowkidar outside the house of a farmer, labourer and unemployed? Chowkidar is found outside the house of Anil Ambani. This Chowkidar guarded 15 to 20 rich people, \"he said.\" The prime minister had promised to give Rs 15 lakh into everyone's account but the murder accused <mark>Amit Shah</mark> called it a Jumla, which he said was spelt just like that, \"said Gandhi. The Congress president said he would not like to be the Chowkidar, but the voice of the people. He accused the prime minister of jailing the farmers and not Anil Ambani for allegedly defaulting on loans. Gandhi said once his government comes to power in 2019, the NYAY scheme (minimum income guarantee scheme) would be implemented and added that women of economically weaker sections would get Rs 72,000 deposited in their accounts, benefiting five crore families. 0 Comments"}, {"articleID": "2012050216_00101510_W", "names": {"Stephen Hendry": ["Q295201", "Q7609461"]}, "date": "2012-05-02", "url": "http://.skysports.com/news/12040/7724020/", "content": "school of hard knocks sign-in to watch the final episode of sohk british gp giveaway we have 500 tickets to the british gp to give to sky tv customers with sky sports or the hd pack...the f1 dictionary our a-z guide to all things formula 1, from the technical to the geekery to the downright misleading...paper talk check out the latest from the written press with all the gossip and speculation from today's newspapers. caution costs man united's reluctance to go toe-to-toe with their neighbours ultimately gave city the impetus. lyric of light: no jockey confirmed for guineas but she's on target for the race sky bet are offering all new customers a? 10 completely free bet godolphin are leaving it late to reveal riding arrangements for their two runners in the qipco 1000 guineas at newmarket on sunday. first jockey frankie dettori and young french protege mickael barzalona will be the two taking the mounts on discourse and lyric of light, who are both leading fancies. however it has yet to be confirmed who will be aboard which of the two mahmood al zarooni-trained runners. \"both fillies are in very good form,\" said godolphin racing manager simon crisford. \"frankie (dettori) will ride one of them, mickael barzalona will ride the other. we haven't confirmed which yet. silvestre de sousa will be in hong kong to ride african story in the bmw champions mile.\" both fillies went through their two-year-old careers unbeaten, with lyric of light posting a group one success in the shadwell fillies' mile among her three wins. <mark>hendry</mark> factfile with <mark>stephen hendry</mark>'s retirement we look back at the career of one of the best snooker player ever. roy faces the media after roy hodgson's bow, adam bate assesses what we - including the man himself - can learn from it. golf live competition win a fantastic weekend to golf live with sky rewards win a holiday! escape to cancun for a mexican vacation! sky sports pub finder sky has launched a pub finder for eager fans wanting to find a venue to watch sky sports. sky sports living for sport get a sports star to visit your old secondary school as part of our free schools initiative."}, {"articleID": "2015061301_00006563_W", "names": {"David Higgins": ["Q1174729", "Q2595776", "Q26329081", "Q41048497", "Q47467677", "Q5234981", "Q5234982"], "Richard Mclean": ["Q1524417", "Q7327751"]}, "date": "2015-06-13", "url": "http://thespec.com/news-story/5671948-hhs-and-joseph-brant-spend-big-on-administration", "content": "Low morale, disrespect dominates workplace culture: public works survey Airbnb capitalizes on island traditions for brisk growth in Cuba listings Airbnb has grown rapidly in Cuba because it took advantage of two...How big does the lottery jackpot need to be to let you quit your job? President of Kylemore Communities/Angus Glen Development among runners June...June 12 editorial cartoon Editorial cartoon for Friday, June 12, 2015 by Graeme MacKay, The Hamilton...Increased risk of schizophrenia if you had a cat as a kid: study Academics say your feline friend could put you at higher risk of mental...HHS and Joseph Brant spend big on administration Hamilton Health Sciences and Burlington's Joseph Brant Hospital spend more than average on administration compared to other Canadian hospitals. Just over six per cent of the $1.2 billion budget at HHS goes to administration, finance, human resources and communications, according to a national report released Wednesday. To compare, the national average is 4.5 per cent. Hamilton seniors declining faster than average in long-term care homes Joseph Brant was nearly double that at almost 8.5 per cent of its $150-million budget in the fiscal year starting April 1, 2013 and ending March 31, 2014. That is down from a high of 10.5 per cent the year before and nine per cent in 2011/2012. St. Joseph's Healthcare is below the national average at four per cent of its $600-million budget. The provincial average is just under six per cent, found the Canadian Institute for Health Information in its annual report on hospital performance, long-term care and the health of area residents. \"It's important to devote as many resources as we can to patient care,\" said Dr. <mark>David Higgins</mark>, president of St. Joseph's, which dropped its average by a percentage point in one year. \"It's a balancing act,\" said <mark>Higgins</mark>, noting organizations have to be careful not to spend too little on administration. \"We strive so that it is as low as we can reasonably achieve.\" HHS spent nearly $1.1 million on CEO salaries in 2014. New hire Rob MacIsaac was the second-highest paid hospital CEO in Ontario, making $757,583 in salary and taxable benefits. At the same time, HHS paid $312,618 to former CEO Murray Martin, revealed public salary disclosure released by the province in March. Both HHS and Joseph Brant say their higher than average administration costs are the result of one-time expenses. A $7-million pay equity payment caused HHS administration costs to rise to 6.2 per cent from just over 5.6 per cent the year before, says Dr. <mark>Richard McLean</mark>, executive vice-president of interprofessional practice and chief medical executive. \"It's not a reflection of the fact we have too many administrators. That's not what's going on.\" Joseph Brant claims its administration costs temporarily went up because of an internal operational review and a reorganization of the administration. \"It is something we monitor,\" said Susan Wannamaker, senior vice-president at Joseph Brant. The interactive report, which is available at www.cihi.ca, also found HHS and Joseph Brant do more caesarean sections for high-risk births than average. HHS has been around 16 per cent for four years while Joseph Brant has been at about 18 per cent for three years. The national average is 14 per cent and St. Joseph's is around 13 per cent. \"We're working on it,\" said <mark>McLean</mark>. \"C-section rates are creeping up everywhere. We are paying an increasing amount of attention to it.\" For St. Joseph's, the report flagged an issue with patients returning to hospital after discharge. The rates were higher than average for medical and surgical patients, as well for all hospital patients as a whole. Return rates were also slightly higher than average for surgical patients at HHS. \"We're focused very much on this,\" said <mark>Higgins</mark>. \"It's distressing for patients to come back to the hospital again. We want to do better.\" The biggest outlier was backlogs in the emergency department at Joseph Brant. The report found it takes more than 60 hours for nine out of 10 patients in the emergency department to get a bed in the Burlington hospital. That is more than double the provincial and national average. \"We know our numbers aren't where they need to be,\" said Wannamaker. \"We have a number of initiatives across the organization focused on patient flow.\" She stresses the numbers in the report are a \"point in time.\" \"It provides us with a goalpost,\" she said. \"But there are a lot of things that change.\" Innovative robotic hair restoration a cut about traditional transplants Robotic hair transplants have made finding a permanent solution to hair loss less invasive, leaving...Low morale, disrespect dominates workplace culture: public works survey Dying man bled profusely onto street as students left school, trial hears"}, {"articleID": "2009112003_00085959_W", "names": {"Mary George": ["Q22662678", "Q5363617"]}, "date": "2009-11-20", "url": "http://cnews.canoe.ca/CNEWS/WeirdNews/2009/11/19/11816941-ap.html?cid=rssnewsweird+news", "content": "british supermodel kate moss poses in an undated photo taken by british film director mike figgis, as part of a new publicity campaign for underwear retailer agent provocateur. reuters/mike figgis london (ap) - eating disorder experts criticized kate moss on thursday after the supermodel cited as her motto a phrase used on web sites that encourage girls to avoid eating. in an interview with the fashion web site wwd, moss said one of her mottos was \"nothing tastes as good as skinny feels.\" the same slogan is posted on web sites encouraging girls not to eat. <mark>mary george</mark> of british eating-disorder charity beat called moss's words \"very unfortunate.\" \"comments like this make it even more difficult\" for young people struggling with an eating disorder, \"she said. model katie green, who is campaigning to stop the use of ultra-thin\" size zero \"models, told the sun newspaper the comments were\" shocking and irresponsible. \"moss, 35, is famous for her waif-like look, which helped spur a trend for super-thin models in the 1990s. moss's modeling agency, storm, said her words had been misinterpreted.\" this was part of a longer answer kate gave during a wider-ranging interview, which has unfortunately been taken out of context and completely misrepresented, \"the agency said in a statement.\" for the record, kate does not support this as a lifestyle choice. \""}, {"articleID": "2013020205_00060402_W", "names": {"John Harmon": ["Q15454857", "Q6237856"]}, "date": "2013-02-02", "url": "http://newstimes.com/news/article/Business-calendar-4244770.php", "content": "wednesday stamford business group will hold a free networking meeting at 7:29 a.m. wednesday in the cafeteria at 9 west broad street. prospective members are invited. eli sandler, of first allied securities, will discuss \"retirement plans for self employed & small business owners.\" for information, call ronny kaplan at 203-329-2421, email ronny @ computertrainingsolutions.biz or visit www.stamfordbusiness.com. thursday stratford chamber of commerce, will hold a ribbon cutting to open the windmill tavern at 5 p.m. on thursday, at 400 hollister street. mayor <mark>john</mark> harkins will attend. for information, contact mary dean, executive director of the stratford chamber, at 203-335-3800 or dean @ brbc.org. score will hold a free workshop, \"managing people as a strategic asset,\" from 6 to 8 p.m. thursday at the university of connecticut stamford, one university place. check-in is 5:30 p.m. presenter <mark>john harmon</mark>, a score counselor and managing director of adulant consulting services, advises small and medium size businesses on business and strategic plan development, strategic forecasting, marketing plan development and execution and operational efficiency improvement. for information and to register, visit www.scorenorwalk.org or call 203 831 0065."}, {"articleID": "2012091614_00037993_W", "names": {"Chris Davis": ["Q1046188", "Q16233084", "Q27832670", "Q3675473", "Q42029773", "Q50658732", "Q5106363", "Q5106364", "Q5106366", "Q5106367", "Q5106368", "Q55127593"]}, "date": "2012-09-16", "url": "http://memphisflyer.com/TheDailyBuzz/archives/2012/09/16/tigers-lose-to-middle-tennessee-48-30", "content": "/ * foundation convenience styles * / / * for programmatic usage only! * /. clear {clear: both}. hidden {display: none}. lower {text-transform: lowercase}. upper {text-transform: uppercase} / * foundation conditional display classes * /. briefonly {} / * override in components.css * /. longonly {} / * override in components.css * / more from frank murtaugh at tiger blue. \"/> tigers lose to middle tennessee, 48-30 | the daily buzz home \u0095 about us \u0095 advertise with us \u0095 the blogs \u0095 contact \u0095 submit an event \u0095 best of memphis sign up for flyer e-mail subscribe to rss username / view profile / edit profile / log out log in / create account memphis flyer news politics opinion we recommend music film art theater food & drink books sports real estate classifieds shop browse news the daily buzz the fly-by cover story news media environment flyer news blog health travel flyer flashback memphis gaydar calling the bluff browse music music features record reviews musician's exchange sing all kinds music listings browse film film features film reviews sing all kinds film times browse art art features exhibit m art listings browse food & drink hungry memphis food & wine restaurant listings food & wine events browse politics political beat political beat blog browse opinion city beat city beat blog editorial you don't know jack viewpoint the rant letters to the editor letter from the editor the bruce v blog the wheelhouse browse classifieds classifieds home page automotive buy sell trade musician's exchange rentals real estate for sale jobs services place an ad browse real estate hot properties living spaces browse for rent browse for sale real estate classifieds browse we recommend we recommend sing all kinds style sessions music listings bars & clubs full event listings browse theater theater features intermission impossible theater listings browse sports sports features beyond the arc tiger blue from my seat a fan's notes browse books book reviews & tcetera book listings the daily buzz archives | rss\" now showing at mca div.jp-audio, div.jp-video {/ * edit the font-size to counteract inherited font sizing. * eg. 1.25 em = 1 / 0.8 em * / font-size:1.25 em;} div.postbody div.inlineaudio, div #audioplayer div.inlineaudio {width: 400px; margin: auto;} sunday, september 16, 2012 tigers lose to middle tennessee, 48-30 posted sun, sep 16, 2012 at 8:30 am saturday night at the liberty bowl, the memphis tigers fumbled and bumbled their way to an 18-point loss at the hands of the middle tennessee blue raiders. more from frank murtaugh at tiger blue. tweet facebook email add to favorites saving...add to custom list loading...div.commentsheader form {float: right;} div.commentscomponent. memberthumb {margin-bottom:7 px; margin-left:0;} div.commentscomponent. commentpubliccontrols {float: left;} div.commentscomponent. commentpubliccontrols a {text-decoration: none;} div.comment {position: relative; float: none! important; width: auto! important; clear: both; margin-top: 16px; padding: 0;}. profilecomments div #browsecomments {background-color: transparent;} div.commenttext {padding-bottom: 0px; border-radius: 4px; - moz-box-shadow: 0px 0px 2px #ccc; - webkit-box-shadow: 0px 0px 2px #ccc; box-shadow: 0px 0px 2px #ccc; border: 1px solid #ccc; overflow: visible; font-size: 12px; padding: 10px 10px 0px! important; float: none! important; width: auto! important; margin: 0! important;} div.commenttext. commenttoolbar {position: relative; height:18 px; text-align: right; clear: both; border-top:1 px solid #eee; margin-top:4 px; padding-top:1 px;} div.commenttext p {margin-bottom:5 px; padding:0;} div.commenttext img.memberthumb {clear: left; display: block; float: left; margin: 2px 8px 2px 2px; overflow: hidden; width: 50px; padding:0;} div.commentauthor {background-image: none! important; padding-left: 10px! important; padding-top: 3px! important; float: none! important;} #showmorecomments, #showallcomments {color: #335770; padding:4 px 0; width:160 px; text-decoration: none; margin: 4px; font-family: verdana; font-size:12 px; border-radius: 3px; border-right: 1px solid #f 3f3f3; background-color: #fff; border: 1px solid #ddd; box-shadow: 0 0 4px #ccc; display: inline-block;} div.pagination div.commentspinner {background-image: url (\"/ foundation/images/loaders / comment_spinner. gif\" ); background-repeat: no-repeat; background-position: 50% 50%; height:30 px; width:100%; position: absolute;} div.pagination {height:30 px; padding: 0; position: relative; margin:20 px 16px 8px; text-align: left; font-size: 11px; text-align: center;} #showmorecomments: hover, #showallcomments: hover {background-color: #eeeedd; color: #cc 0000; box-shadow: 0 0 2px #ccc;}. currentlikepositive,. currentlikenegative {font-family: arial; font-size: 13px; font-weight: bold; color: #999;}. likelink {border-radius: 3px; padding: 0 3px; font-family: verdana, arial; position: relative; padding-left:20 px; display: inline-block; / * for ie8 and opacity * / font-weight: normal; text-decoration: none! important;}. likelink img {position: absolute; left:0 px; bottom: -2 px;}. likelink.like {text-decoration: none; color: #66bb66! important;}. likelink.like: hover {background-color: #66bb66; color: #fff! important;}. likelink.dislike {text-decoration: none; color: #bb 6666! important;}. likelink.dislike: hover {background-color: #bb 6666; color: #fff! important;}. likelink.like.dimmed,. likelink.dislike.dimmed {background-color: #fff; text-decoration: none; color: #666;}. likelink.like.dimmed: hover,. likelink.dislike.dimmed: hover {background-color: #fff; color: #666! important;}. likeerror {color: #aa 9;}. commentcurrentrating {font-family: arial; color: #aa 9; font-size:11 px;}. likeloader {margin-right:8 px;}. reportcommentcontainer {position: absolute; background-color: #ccccbb; border: 1px solid #c 9c9b9; border-radius: 3px; bottom: 0px; left: 0; width:250 px; opacity:0.95; - moz-box-shadow: 0 0 10px #aaa; - webkit-box-shadow: 0 0 10px #aaa; box-shadow: 0 0 10px #aaa; text-align: left; font-family: arial; z-index: 10;}. reportcommentcontainer a {text-decoration: none! important;}. reportcontainer a {font-weight: normal;}. reportcommentcontainer. reportheader {font-family: arial; font-size:14 px; text-align: left; margin:2 px 8px; border-bottom:1 px solid #aaaa 99; padding-bottom:2 px; font-weight: bold; position: relative;}. reportcommentcontainer. reportheader a.reportclose {position: absolute; right:0;}. reportcommentcontainer dl.formelements {float: left; margin:6 px 0 0;}. reportcommentcontainer dl.formelements dt {width: auto; min-height: 0; float: none; font-family: arial; font-weight: bold; font-size: 12px; color: #444;}. reportcommentcontainer dl.formelements dd {width: auto! important; float: none; min-height:0; margin-bottom:8 px; margin-left:0! important;}. reportcommentcontainer form {margin: 0 8px 0! important;}. reportcommentcontainer. formsubmit {clear: both; text-align: right; padding: 0 8px;}. reportcommentcontainer. formsubmit a {position: relative; border-radius: 3px; padding-left: 20px;}. reportcommentcontainer. formsubmit a img {position: absolute; left: 0; bottom: -1 px;}. reportcommentcontainer. forminput {border:1 px; background-color: #ffe; border:1 px solid #bba; padding:2 px; width:228 px; border-radius: 3px;}. reportcommentcontainer textarea {border:1 px; background-color: #ffe; border:1 px solid #bba; padding:2 px; width:228 px! important; height:60 px! important; border-radius: 3px; resize: none;}. reportcommentcontainer. errordisplay {background-color: transparent; color: #933; font-weight: bold; padding: 10px 10px 4px;}. reportcommentcontainer. reportsuccess {text-align: center; color: #fff; font-family: arial; font-weight: bold; padding: 30px 15px 40px;}. reportcommentlink {border-radius: 3px; font-family: verdana, arial; / * padding: 0 3px 0 23px; * / padding:0 3px; position: relative; color: #aaaa 99! important; font-weight: normal; text-decoration: none! important;}. reportcommentlink img {position: absolute; left: 3px; bottom: 1px;}. reportcommentlink: hover {background-color: #ccccbb; color: #fff! important;} #commentform textarea {border: 1px solid #ccc; - moz-box-shadow: 0 0 2px #cccccc; - webkit-box-shadow: 0 0 2px #cccccc; box-shadow: 0 0 2px #cccccc; border-radius: 4px;} #commentform dl.formelements dt {min-height: 0;} div.commentformrating {background-color: #fff; border:1 px solid #ffcc 1c; float: left; padding: 5px 8px; - moz-box-shadow: 0 0 2px #cccccc; - webkit-box-shadow: 0 0 2px #cccccc; box-shadow: 0 0 2px #cccccc; width: auto;} div.commentscomponent p.showing, div #browsecomments p.showing {float: left; width: auto; margin: 0 0 10px 15px; font-style: normal;}. commentstopbar {position: relative;} div.bottomoptionbar {padding: 0; position: relative; margin:20 px 16px 8px; text-align: left; font-family: verdana, arial, helvetica, sans-serif; font-size: 12px; border: 1px solid #d 0d0d0; background-color: #e 0e0e0; box-shadow: 0 0 5px #ccc inset; border-radius:2 px;} div.bottomoptionbar div.showing {margin-bottom:6 px; / * font-style: italic; * / float: right; padding:4 px 6px 4px; font-size:12 px; font-family: verdana, arial, helvetica, sans-serif; / * border-right: 1px solid #f 3f3f3; * / margin: 4px 0; color: #333;}. bottomoptionbar. togglepanel {position: absolute; left: -40 px; top:35 px; background-color: #ddc; white-space: nowrap; border-width: 1px 0; border-radius: 2px; color: #666; opacity: 0.95; padding: 16px; border: 1px solid #ccb; - moz-box-shadow: 0 0 5px #ccc; - webkit-box-shadow: 0 0 5px #ccc; box-shadow: 0 0 5px #ccc; z-index:1;}. bottomoptionbar. togglepanel a {color: #335770;}. bottomoptionbar. togglepanel a: hover {color: #cc 0000;}. bottomoptionbar. togglepanel. togglearrow {content: \"\"; position: absolute; border-width:7 px; border-color: transparent transparent #ddc transparent; display: block; width:0; top: -14 px; left:78 px; border-style: solid;}. bottomoptionbar. togglepanel. togglearrowborder {content:\" \"; position: absolute; border-width:8 px; border-color: transparent transparent #ccb transparent; display: block; width:0; top: -17 px; left:77 px; border-style: solid; opacity: 0.95;}. bottomoptionbar. togglepanel div {/ * float: left; * / text-align: center;}. bottomoptionbar. loading,. bottomoptionbar. toolsinner {background-color: transparent; white-space: nowrap; padding: 0; border: none;}. bottomoptionbar. togglepanelclose {float: right; position: absolute; font-size:14 px; right:0; top: -1 px; padding: 4px; margin-left:10 px; text-decoration: none;}. bottomoptionbar. commentrsslink,. bottomoptionbar. commentsubscribelink {margin:4 px 0; padding:4 px 2px 4px; float: left;}. bottomoptionbar. loading,. bottomoptionbar. ajaxupdater {width:140 px; text-align: center;}. bottomoptionbar. togglepanel a.feedlink,. bottomoptionbar. togglepanel div.commentsubscribelink a,. bottomoptionbar a.feedlink,. bottomoptionbar div.commentsubscribelink a {background-position: 4px center; padding: 3px 4px 3px 20px; border-radius: 3px; margin:2 px; background-repeat: no-repeat; font-size:12 px; text-decoration: none;}. bottomoptionbar. togglepanel a.feedlink: hover,. bottomoptionbar. togglepanel div.commentsubscribelink a: hover,. bottomoptionbar a.feedlink: hover,. bottomoptionbar div.commentsubscribelink a: hover {background-color: #eeeedd;}. bottomoptionbar a.feedlink {background-image: url (/ images/rss-small. gif);}. bottomoptionbar div.commentsubscribelink a {background-image: url (/ images/icons/article _ tools/email. gif); padding-left:26 px;} comments (0) subscribe to this thread: by email subscribing...with rss comments are closed. advertisement advertisement latest stories middle tennessee 48, tigers 30 | tiger blue | 09/15/2012 10:48 pm with icing on top: red velvet cupcakes | hungry memphis | 09/14/2012 3:15 pm the dark side of\" an old forest fairy tale \": the never before seen postcard threatening activist sunshine snyder | intermission impossible | 09/14/2012 11:29 am nondiscrimination ordinance rally | memphis gaydar | 09/14/2012 11:26 am sound advice: austin lucas at otherlands | sing all kinds | 09/14/2012 11:17 am sound advice: di anne price & her boyfriends at levitt shell | sing all kinds | 09/14/2012 8:53 am norma lester named to state oversight agency | politics beat blog | 09/13/2012 10:13 pm vote for grow memphis to win $50,000 for community project | hungry memphis | 09/13/2012 4:00 pm constanza's\" light i \"and the art of the press release | exhibit m | 09/13/2012 1:22 pm backstage pass: don trip | sing all kinds | 09/13/2012 1:08 pm top commenters bernard onyejide adda bright advertisement #bpinclude {width:160 px; overflow: hidden; margin:4 px 0; padding:0 px; background-color: #e 4e8ef; border: 0px solid 000; font-family: verdana, arial, helvetica, sans-serif; font-size:10 px;}. bpheaderimage {margin:0; width:160 px; height:38 px; background-color: #fff; background-image: url (' '); background-position: center center; background-repeat: no-repeat;} #bpinclude {color: #222; text-decoration: none;} #bpinclude a {color: #516ea4; text-decoration: none;} #bpinclude a: hover {text-decoration: underline;}. bpwrap {margin:6 px 0; padding-left: 6px; padding-right: 6px;}. bptitle {font-weight: bold;}. bpad {font-size:10 px;}. bpmore {margin:6 px 6px; font-weight: bold;}. bpfooterimage {margin:0; width:160 px; height:10 px; background-color: #fff; background-image: url (' '); background-position: center center; background-repeat: no-repeat;} this week's issue cover story: into the woods by <mark>chris davis</mark> download this issue archives contact us about us ad info & rates special issues 20 click here to see more\" flyer box art contest click here to see more \"best of memphis 2011 click here to see more\" hotties 2012 click here to see more \"home | news | politics | opinion | we recommend | music | film | art | theater | food | books | sports | real estate | classifieds | flyer shop | privacy | info | local advertising | submit an event | contact us | national advertising © 1996-2012 contemporary media 460 tennessee street, 2nd floor | memphis, tn 38103 visit our other sites: memphis magazine | memphis parent | memphis business quarterly powered by foundation"}, {"articleID": "2013110416_00022903_W", "names": {"Krishna Prasad": ["Q6437473", "Q6437474"]}, "date": "2013-11-04", "url": "http://www.business-standard.com/article/companies/granules-india-acquires-auctus-pharma-113110400432_1.html", "content": "We encourage visitors to register on Business Standard. Registering on the site is absolutely Free and offers you the following benefits. Free Daily E-newsletter Breaking News Alerts in your Inbox Post Comments and Share your Feedback Free Portfolio of Stocks, Equity and Commodities Derivatives Receive Selective Offers from our Third Party Premium Advertisers Granules India Limited has acquired the entire stake of unlisted Auctus Pharma, a manufacturer of active pharmaceutical ingredients (API), for an undisclosed amount. The acquisition process is expected to be completed in the next three to six months. Auctus has an API facility at the Pharmacity in Vishakhapatnam and an intermediate facility in Hyderabad. The API facility has approvals from leading regulatory agencies including the US Food and Drug Administration, European Directorate for the Quality of Medicines & Healthcare (EDQM), Health Canada, Korea Food and Drug Administration and WHO-Good Manufacturing Practices. . \"The acquisition of Auctus fits into our strategy of being a fully integrated manufacturer while diversifying our product portfolio by adding high-value products with significant market demand. We will be a market leader by implementing our operational excellence philosophy while leveraging Auctus regulatory approvals,\" Granules India managing director, <mark>Krishna Prasad</mark>, stated in a press release. \"We want to unlock our investment value and subsequently set up a greenfield pharmaceutical unit\" , a co-promoter of the 10-year old Auctus Pharma, Shivaram <mark>Prasad</mark> Aluru, told Business Standard while explaining the reasons for the sale of the company. Auctus' product portfolio includes twelve APIs including APIs in several therapeutic categories such as antihistaminic, antihypertensive, antithrombotic and anticonvulsant as well as other therapeutic categories. It currently sells its APIs and intermediates to customers in 50 countries. The team and assets from the acquisition will initially operate as a separate division with Granules. Granules also announced the opening of a 10,000 square foot research and development (R & D) facility in Hyderabad. The new R & D will focus on full scale generic API development and will supplement the company's existing R & D facility in Pune, which currently focuses on sustainable technology development. Only a strong bank can be a good partner. Click here to know more"}]