[{"articleID": "2017122212_00499138_W", "names": {"Jessica Shaw": ["Q28957221", "Q39061600"]}, "date": "2017-12-22", "url": "http://ew.com/tv/2017/12/22/bingeworthy-best-tv-revivals-2017/", "content": "Will & Grace hailed as one of 2017's best TV revivals Derek Lawrence December 22, 2017 AT 07:30 AM EST Catch the full episode of Bingeworthy here and on PeopleTV. Go to PEO PLE.com / PeopleTV, or download the free app on your smart TV, mobile, and web devices. 2017 might be the year of the television revival, but only a few of the many returns can be labeled the best. On the latest edition of Bingeworthy, hosts <mark>Jessica Shaw</mark> and Lola Ogunnaike shared their picks for the year's top revival, with <mark>Shaw</mark> choosing Netflix's One Day at a Time and Ogunnaike selecting Will & Grace. \"It did not disappoint,\" Ogunnaike said of the NBC sitcom's long-awaited ninth season. \"The opening episode came out on fire...And it's been a laugh parade ever since.\" Watch the full clip above. You May Like Comments Read More Get your EW TV news Subscribe to EW TV for the latest TV news. Signup Now EDIT POST"}, {"articleID": "2019012506_00171453_W", "names": {"Stephen Park": ["Q7610192", "Q7613550"], "David Williams": ["Q1177200", "Q1177203", "Q1177205", "Q1177206", "Q1177211", "Q15993658", "Q18285462", "Q18921621", "Q19668225", "Q19979283", "Q21067351", "Q21191045", "Q27909752", "Q27909753", "Q28935607", "Q29643799", "Q3018997", "Q3703373", "Q39070773", "Q471380", "Q5241129", "Q5241130", "Q5241132", "Q5241135", "Q5241140", "Q5241142", "Q5241145", "Q5241146", "Q5241148", "Q5241151", "Q5241153", "Q5241155", "Q5241156", "Q5241379", "Q53147193", "Q55090089", "Q56596997", "Q56604607", "Q56650695", "Q56650757", "Q56660359", "Q56928356", "Q57161824", "Q57430588", "Q58186825"]}, "date": "2019-01-25", "url": "https://www.miragenews.com/farm-labour-arrangements-what-you-should-know/", "content": "Farm labour arrangements: what you should know Farm labour arrangements: what you should know Comments Off on Farm labour arrangements: what you should know GRDC Farm Business Updates are designed to enhance grower and adviser knowledge of farm business issues, to help with effective planning and management. Photo by GRDC. A series of farm business events in Western Australia in February will include a pragmatic focus on the area of farm labour arrangements--including compliance, risks and recommended actions. Pacer Legal director <mark>Stephen Park</mark> will be one of the presenters at Grains Research and Development Corporation (GRDC) Farm Business Updates in Tambellup on February 12, Lake Grace on February 13 and Moora on February 14. These events are designed to enhance grower and adviser knowledge of farm business issues, to help with effective planning and management. Mr <mark>Park</mark> will address the topic of \"Employing farm labour--practices, compliance and minimising risks' at each of the three Updates, where he will stress the need for proper planning and documentation by employers, as well as knowing your obligations and complying with them. He says farm business employers are expected to maintain and manage employment relationships in accordance with their statutory obligations.\" In this regard, they can be expected to be held to a high standard as they are expected to have the resources, as a reasonably sized enterprise, to ensure compliancy with statutory obligations. Ignorance will not be excused, \"he said. Read more: Six Australian projects selected to screen at Berlinale\" Employment issues tend to surface in periods of high stress, such as seeding or harvest time, and this is when policies and procedures are especially important to avoid disruptions to farm operations. \"Mr <mark>Park</mark> says the engagement of farm employees is undertaken primarily to drive farm profits and to relieve the workload on owners of farm businesses, and their family members.\" However, I often hear business owners say: \"given the hassles of compliancy obligations, I wish I had not taken on so many staff',\" he said. \"Yet the sourcing of labour from outside the family group is now often unavoidable given the scale of operations, and it is obviously advisable to minimise the instances of disruption caused by disaffected employees and the consequences that can arise from an unfair dismissal claim.\" Pacer Legal director <mark>Stephen Park</mark> will be one of the presenters at Grains Research and Development Corporation (GRDC) Farm Business Updates being held in WA in early February. To minimise these risks, Mr <mark>Park</mark> encourages farm business employers to: Know and comply with their employment obligations Have a concise set of employment practices and procedures Maintain a comprehensive set of employment records for seven years. He will delve deeper into the topic, including a \"drill down' session using a grower case study example, at the Update events. Areas covered will include how to identify the jurisdiction under which to engage employees, and unfair dismissal claims. Read more: Canada supports W̱SÁNEĆ Nation efforts to rebuild their nation Other speakers at the 2019 WA GRDC Farm Business Update events include: Saul Eslake, economist: Trade wars, Trump politics and Banking Royal Commissions--what's the fall-out for agriculture? The economist's view Cam Nicholson, Nicon Rural: Decisions, decisions: stress testing your farm decision thinking by building your own practical decision matrix RSM Australia personnel Jo Gilbert (Tambellup event); Cameron Taylor (Lake Grace event) and Keiran Sullivan (Moora event): Tax Tips--essential tax management strategies for grain growers Advisers Rod Grieve, agricultural consultant (Tambellup event); Steve Curtin, ConsultAg, (Lake Grace event); and <mark>David Williams</mark>, BJW Agribusiness, (Moora event): Farming to Profit--focusing on the drivers and breaking down the barriers to profit Susan Brumby, National Centre for Farmer Health: Sustaining farm family businesses--your health is critical. Each of the GRDC Farm Business Updates in WA will be held from 9.25 am to 4.25 pm. To register or f / Public Release. View in full here. Tags: Australia, Australian Government, business, Donal Trump, Grains Research and Development Corporation, GRDC, Lake Grace, Moora, Nicholson, Tambellup, Western Australia, <mark>Williams</mark> Do you want to support us? Why? Well, unlike many news organisations, we have no sponsors, no corporate or ideological interests. We don't put up a paywall--we want to keep our citizen journalism as open as we can. Although underresourced & primarily volunteer-based, we do our best to provide the community with access to quality and true unfiltered news. Our goal and mission is to provide free and alternative access to impartial information, fighting media monopolization and adhering to honesty, neutrality, fairness, transparency and independence in collection and dissemination of information. It is a bumpy road with all sorties of difficulties. (Media ownership in Australia is one of the most concentrated in the world. Since the trend of consolidation is and has historically been upward, fewer and fewer individuals or organizations control increasing shares of the mass media in our country. According to independent assessment, about 98% of the media sector is held by three conglomerates. This tendency is not only totally unacceptable, but also to a degree frightening) We can only achieve this goal together. Our website is open to any citizen journalists who want to contribute, publish high-quality articles or insights to improve public access to impartial information. You and we have the right to know, learn, read, hear what and how we deem appropriate. If you like what we do & would like to buy us a coffee (or lots of coffees), well thank you! All donations are kept completely private and confidential. Thank you very much in advance!"}, {"articleID": "2015030505_00042039_W", "names": {"Andrew Chan": ["Q28614487", "Q4756586", "Q57096553", "Q58881964", "Q59488434", "Q7198195"], "Michael Chan": ["Q6829202", "Q6829206"], "Adam Taylor": ["Q4679884", "Q47127244"]}, "date": "2015-03-05", "url": "http://www.cairnspost.com.au/news/bali-nine-executions-andrew-chan-myuran-sukumaran-transferred-to-death-island/story-fnjpvlcp-1227249680705?from=public_rss", "content": "Bali Nine executions: <mark>Andrew Chan</mark>, Myuran Sukumaran transferred to death island EVEN during the major operation to shift <mark>Andrew Chan</mark> and Myuran Sukumaran from Bali to Java, Indonesian officers on the flight treated the condemned men like tourists attractions. In a callous disregard for the gravity of the matter, at least one officer took a photo of himself smiling with <mark>Chan</mark>, who was clearly distressed. Clearly, <mark>Chan</mark> had no choice but to comply with the pitiless and unthinking officer. Though the Indonesian police and military did their best to prevent the media getting images during the transfer, they had their own phones out in force, snapping pictures of the tragic pair. The photo of the officer on the plane on yesterday morning's flight, which was published on Kompas.com, is a new low in what was a farcical event. Final humiliation...An Indonesian official poses for a photo with Bali Nine ringleader <mark>Andrew Chan</mark> on the flight from Bali to Cilacap. Source: Supplied Hundreds of police and military, along with armoured personnel carriers and jets, were deployed to shift two men who offered no threat of escape and had become pawns in a game of international brinkmanship. Horror journey...Helen and <mark>Michael Chan</mark> arrive at Jogjakarta Airport. Source: Supplied Families travel for last goodbye THE families of <mark>Andrew Chan</mark> and Myuran Sukumaran have begun the long journey to Central Java to spend what could be the last days with the two young Australians. Sukumaran's parents, Sam and Raji and siblings Chinthu and Brintha along with <mark>Chan</mark>'s mother Helen and brother <mark>Michael</mark>, all flew this morning from Bali to Jogjakarta. They were accompanied by Australian Consul to Bali, Majel Hind and consulate staff and family friends of the Chans. Nightmare...Sam Sukumaran (right) lands in Jogjakarta. Picture: <mark>Adam Taylor</mark> Source: News Corp Australia The group will now make the arduous drive from Jogjakarta to Cilacap, the port town on the south coast of Java closest to Nusa Kambangan Island where <mark>Chan</mark> and Sukumaran were yesterday moved in high security show of force from Indonesia's police and military. They hope to be able to spend time with <mark>Chan</mark> and Sukumaran however access from now on is expected to be much more limited than it has been for the past month at Kerobokan jail, where they have visited every day, often for the whole day. Long road ahead...Raji Sukumaran, her family members and the family of <mark>Andrew Chan</mark> now make the five-hour drive to Cilacap. Picture: <mark>Adam Taylor</mark> Source: News Corp Australia But it is unknown whether family and supporters of the condemned men will be allowed on to the island when they get there. A short time ago at the port in Cilacap, close by the prison island of Nusakambangan, a pastor from the local charismatic Bethel Church who wanted to hold a service for the Christian death-row inmates was denied entry. He was told the prisoners were already in isolation. \"I wanted to give a spiritual service for the Christians,\" said pastor Samuel Sudiharjo, who has counselled death-row prisoners in the past. \"It was not permitted. They are already in sterile conditions in isolation. I cannot give the service.\" A Christian boy band that knew <mark>Chan</mark> from visits to Jerobokan were also turned back, but the cousin of death-row Brazilian, Rodrigo Gularte, and an embassy official were permitted entry. Family and supporters...Sukumaran's bother Chintu accompanied by Australian Consul Majell Hind arrive at Jogjakarta Airport on their way to Cilacap. Picture: Lukman S. Bintoro Source: Supplied Executions not this week: President Indonesian President Joko Widodo said the Bali nine ringleaders won't be executed this week, but it would happen soon. The pair was moved yesterday to Nusakambangan Island jail, where they will eventually be killed by firing squad. Mr Widodo gave an interview to Al-Jazeera last night, but made the comments off-camera, according to Jakarta-based reporter Step Vaessen. The report has not been confirmed. President Jokowi told me no executions this week at sidelines of interview i had with him this afternoon. For mote watch Aljazeera - step vaessen (@ stepvaessen) March 4, 2015 The condemned pair will be given 72 hours' notice prior to the execution, in which they can meet with consular officials, loved ones and spiritual advisers. Yesterday afternoon there was a meeting of officials in Cilacap to confirm the execution date, which will come shortly after midnight and be conducted in a purpose-built killing field on Nusakambangan. Indonesia's Attorney - General, HM Prasetyo, said authorities were still deciding how many people would be executed. \"We are still evaluating. It does not mean that we are doubtful or scared. But this is related with life,\" Mr Prasetyo said. \"All are drug cases. We want to show, send a message to others, the world, that Indonesia is currently working hard to combat drugs.\" Final journey...<mark>Andrew Chan</mark> and Myuran Sukumaran chat to the head of the corrections department at Kerobokan before their transfer to Nusakambangan Island. Source: Supplied Bishop's prisoner swap plea The news comes as Foreign Minister Julie Bishop last night proposed an 11th-hour prisoner swap deal to Jakarta. In a tense 30-minute phone call, Ms Bishop reportedly offered to expatriate three convicted drug criminals to spare the lives of Sukumaran and <mark>Chan</mark>. It is believed the deal was not accepted. Ms Bishop joined other politicians in a candle light vigil for the doomed Australian men, hosted by the Australian Parliamentarians Against the Death Penalty group Vigil...Ms Bishop and her Opposition counterpart Tanya Plibersek light candles for the condemned Bali Nine ringleaders. Source: News Corp Australia First night on execution island <mark>Chan</mark> and Sukumaran have spent their first night on Indonesia's execution island as they await their executions. Their families are expected to arrive in Cilacap, the nearest town to the island alter today, flying from Sydney and Bali. They will be allowed to visit the men, Indonesia's Attorney-General HM Prasetyo says, but he is yet to announce a date for the executions, saying only it will be as soon as possible. The prisoners will get 72 hours' notice of the executions. Reality sets in...<mark>Andrew Chan</mark> on the plane to Nusakambangan. Picture: Supplied Source: Supplied In a brutal show of force, <mark>Chan</mark> and Sukumaran were treated like vicious international terrorists during their transfer to Nusakambangan prison island for their execution. The rehabilitated drug criminals were handcuffed and chained at the feet as members of the special Gegana anti-terror unit, hiding behind balaclavas, led the men on to a flight in Bali early on Wednesday morning. Excessive force...Bali Nine ringleader Myuran Sukumaran pictured on the tarmac at Cilacap airport - on his way to Nusakambangan Island. Source: Supplied The use of hundreds of police, armoured personnel carriers and fighter jets that screamed alongside as the Australians were flown from Bali to Java was excessive and macabre, as Indonesia went all out to expose the men to a final humiliation. <mark>Chan</mark> and Sukumaran were brave but looked scared as they were led up the steps of the plane for the one hour and 45 minute flight west, accompanied by 35 armed guards and a handful of prosecutors. LIVES IN LIMBO: Australia waits on Bali Nine duo's fate ABBOTT \"REVOLTED': Last-ditch bid to save Bali Nine ringleaders Final leg...a ferry transfers Indonesian police vehicles carrying <mark>Chan</mark> and Sukumaran to Nusakambangan island. Source: AP Upon arrival in Cilacap on south Java, they were shuffled into Barracuda armoured personnel carriers followed by mini-vans loaded to the gunnels with paramilitary officers brandishing assault rifles. The final journey of <mark>Andrew Chan</mark> and Myuran Sukumaran 1:28 Play video A flyover of the final journey for <mark>Andrew Chan</mark> and Myuran Sukumaran from Bali to Nusa Kambangan prison where they'll be housed before their execution. news.com. au 05 Mar 2015 News Four fighter jets armed with what appeared to be sidewinder missiles shot over the Cilacap airport after the charter plane delivered the men, then circled back over the airfield flying low and titling their wings to signify victory. Armed guards...Myuran Sukumaran sits on the plane to the prison island of Nusakambangan. Picture: Supplied Source: Supplied The extraordinarily disproportionate show of muscle was final confirmation that Indonesia will not retreat from its plans to execute the Australians and up to eight others. Correctional head Nyoman Putra Surya said <mark>Chan</mark> and Sukumaran had been given ample opportunity to meet their families over the past six weeks.\" They have been promised that the mothers and the brothers will see them in Cilacap, \"he said. Indonesia's Attorney General HM Prasetyo, speaking in Jakarta, did not apologise for the farcical show of force used during the transfer.\" Of course there were teams that guard them, \"he said.\" This is a long journey. They are not a tourist. \"By comparison to the hysteria surrounding the transfer of <mark>Chan</mark> and Sukumaran, Nigerian death-row prisoner Raheem Agbaje Salami arrived on Wednesday from a prison in Madiun, in East Java, in a solitary van. It leaves little doubt the performance was entirely for Australia's benefit. Death march...Myuran Sukumaran is escorted by armed guards at Cilacap airport ., Source: Supplied Originally published as How could they be so heartless?"}, {"articleID": "2020022802_00090731_W", "names": {"John Gordon": ["Q1473021", "Q15435114", "Q1700239", "Q1700241", "Q19325356", "Q27827642", "Q28016800", "Q43393024", "Q43394029", "Q43910950", "Q55724969", "Q57899079", "Q6235757", "Q6235763"], "David Davies": ["Q16539083", "Q21387484", "Q2487274", "Q2673903", "Q296797", "Q364890", "Q5230426", "Q5232847", "Q5232852", "Q5232855", "Q5232856", "Q5232859", "Q5237175", "Q56596932", "Q56596943", "Q56604597"]}, "date": "2020-02-28", "url": "http://macleayargus.com.au/story/6654252/kids-haunted-by-nsw-bookies-brutal-death/?cs=7", "content": "Kids haunted by NSW bookie's brutal death National Wealthy bookmaker Charles Skarratt was murdered in his Sydney home in 1989. Their father was bound, beaten and stabbed to death in his Sydney home during a robbery gone wrong. More than 30 years later, a \"never-ending nightmare\" of thoughts about Charles Skarratt's killing continues to haunt the bookmaker's children. Terry <mark>John Gordon</mark> Hickson, 60, was in December found guilty of the brutal murder of the wealthy bookie after a day at the Dapto greyhound races in 1989. Peter Skarratt and Victoria Frerer choked up as they told the NSW Supreme Court about the impact of their father's death. \"Like a never-ending nightmare, thoughts of how he died will never go away,\" Peter Skarratt said at Hickson's sentencing hearing on Friday. He said his father's ordeal \"over a few dollars\" was beyond his comprehension. \"What is truly horrifying are the thoughts I have of what it must have been like for dad being left to die without the ability to move, care for himself or seek help,\" he said. \"I do not know a life without these...thoughts.\" Mr Skarratt's wife found his body surrounded by blood on the garage floor of his Woolwich home in December 1989. Her victim impact statement was handed to the judge but not read to the court. Ms Frerer told the court she remembered her father as a shy, intelligent and proud man. \"The violent way his life ended - tortured, taped, gagged, stabbed and alone - just breaks my heart,\" she said. \"I have never felt anger, however there is a sadness that visits me every day.\" Hickson's defence barrister argued the judge should sentence his client on the basis Mr Skarratt died during the course of the armed robbery, not because Hickson intended to kill him. Philip Young SC rejected the Crown's claim Mr Skarratt was tortured, saying he was seriously injured in a violent scuffle with Hickson and then bound and gagged. But crown prosecutor Craig Everson argued multiple stab wounds - one ferocious enough to fracture the victim's ribs - showed Hickson intended to do more than stop Mr Skarratt's resistance. \"If his intention was not to kill, it is just outrageous that he didn't do anything to summon some assistance,\" he told the court. Justice <mark>David Davies</mark> was also asked to consider Hickson's extensive criminal history and ill health in his sentencing. Australian Associated Press"}, {"articleID": "2020041213_00043422_W", "names": {"Andrea Ricci": ["Q3615985", "Q55266416"]}, "date": "2020-04-12", "url": "http://kelo.com/news/articles/2020/apr/12/seen-everywhere-in-last-us-crisis-moral-hazard-is-nowhere-in-this-one/1005795/", "content": "Seen everywhere in last U.S. crisis, moral hazard is nowhere in this one Sunday, April 12, 2020 7:15 a.m. CDT by Thomson Reuters FILE PHOTO: People walk wearing masks outside The Federal Reserve Bank of New York in New York City, U.S., March 18, 2020. REUTERS/Lucas Jac By Ann Saphir and Lindsay Dunsmuir SAN FRANCISCO/WASHINGTON (Reuters) - As the U.S. Federal Reserve rolls out trillions of dollars to blunt the economic fallout of the coronavirus pandemic, there's a notable difference to the last financial crisis: close to zero concern over \"moral hazard\" - the sticky business of bailing out those whose dilemma is of their own making. That's freed up the U.S. central bank to do more, and faster, than it dared to do a decade ago, when it was last called on to launch emergency moves to help protect the economy. Back in 2007-2009, policymakers voiced repeated concern that bailing out banks and financial markets more generally would reward them for having taken imprudent risks. The Fed also faced a political backlash from its congressional overseers for what some saw as extending its reach into the fiscal sphere and, in effect, picking and choosing winners and losers. How the Fed acted then stuck in the craw of many conservatives, in particular, for years after the crisis ended. In 2011, the governor of Texas, Rick Perry - who was also running for the Republican presidential nomination - called the Fed's aggressive bond buying \"almost...treasonous\" and even suggested then-Chair Ben Bernanke might get roughed up if he ever ventured to the Lone Star State. This time around? Crickets. In an appearance on Thursday, Fed Chair Jerome Powell made clear that he faces no groundswell of criticism this time around, either among the central bank's policymakers or the wider corridors of power. The priority, he said, remains on helping people who through no fault of their own have lost their livelihoods, at least temporarily, due to \"stay at home\" orders across the country. \"People are undertaking sacrifices for the common good. We need to make them whole. To the extent we have the ability to make them whole we should be doing that as a society,\" Powell said. \"They didn't cause this. Their business isn't closed because of anything they did wrong. They didn't lose their job because of anything they did wrong.\" And while he emphasized the Fed's role is to lend, not spend, staging an effective rescue means close coordination with Treasury and elected politicians, he said. \"Financial stability is really something where we both have a stake and both have authorities...we do work closely with them on these facilities and I'll say that's been a very productive relationship,\" he said. In the space of roughly a month the Fed has launched nine crisis-fighting programs - some old and some brand new - designed to keep credit flowing to businesses and households by shoring up liquidity in financial markets. The Fed's programs may end up helping some businesses whose trouble is at least partly of their own making - having loaded up on debt before the crisis, for instance. But for the moment, neither Fed policymakers nor politicians seem too concerned with separating the deserving from the less so. Economists at Citigroup Global Markets in a note last week said minutes of the Fed's emergency meetings \"predictably reflected a unified cohort of policymakers willing to use all available tools to support the economy, with little regard to second-order effects or moral hazard.\" And even as the size of the Fed's balance sheet sets new records weekly, Powell indicated there is little pushback should the Fed find other new, untested ways to help the economy. \"As we identify other areas, we won't hesitate to move into those areas,\" he said. BACK THEN, CONFUSED AND MUDDLED Back in 2008, objections were frequent and forceful. As the financial crisis gained steam, Fed officials were very concerned that their lending programs could reward or could be perceived as rewarding bad behavior. Indeed that was one reason Fed policymakers cited for allowing Lehman Brothers to fail rather than ride to its rescue. Raising the alarm weren't just inflation hawks like Kansas City Fed President Thomas Hoenig and Philadelphia Fed President Charles Plosser, but centrist Atlanta Fed President Dennis Lockhart as well. Even Bernanke, speaking to colleagues in September 2008 just after the Lehman collapse, said he was \"decidedly confused and very muddled\" by the tension between the fiscal and moral hazard costs of the rescue on the one hand and the potential for \"severe consequences for the financial system and, therefore, for the economy of not taking action.\" In Congress, criticism of the Fed's bailout of banks was front and center. \"You are the definition of moral hazard,\" Senate Banking Committee member Jim Bunning, a Republican, told Bernanke at his confirmation hearing in late 2009. That tension is all but gone in 2020. \"We don't make decisions about individual firms,\" Powell said on Thursday. \"Any borrower that meets the eligibility requirements for one of these facilities can take part in the facility, we are not going to be picking this firm but not that firm.\" Fed policymakers are agreed on going full steam ahead, Powell said, in part because they learned from the last crisis that worries an increase in the money supply will cause runaway inflation are unfounded. With muted inflation in the decade since, the central bank chief was curt on Thursday. \"I worry that in hindsight, you will see that we could have done things differently, but one thing I don't worry about is inflation right now,\" Powell said. Graphic: Fed balance sheet tops $6 trillion - https: //fingfx.thomsonreuters.com/gfx/mkt/oakvexyyprd/Pasted% 20image% 201586466357344.png (Reporting by Lindsay Dunsmuir and Ann Saphir; Editing by <mark>Andrea Ricci</mark>)"}, {"articleID": "2009032721_00024507_W", "names": {"David Reeves": ["Q16106420", "Q42842617", "Q5242189"]}, "date": "2009-03-27", "url": "http://psu.com/forums/showthread.php?t=198567", "content": "sony to match dev budgets in return for exclusivity sony has kicked off a scheme today which will see it match the development budget of self-published games in return for playstation exclusivity. the first game to take advantage of this deal is doublesix's burn zombie burn, which goes live via the playstation network today, with sony indicating it's \"looking for a great many more titles\" to take advantage of the fund. \"it's all very well for us as platform holders to say\" put all your money into playstation network, it's a fantastic idea', but are we prepared to put or money where our mouth is? the answer is yes, \"chris eden, sony's development relations manager, told an audience at the game developers conference today.\" we're looking for a number of great games, and in return for exclusivity we'll match your development budget with guaranteed royalties, \"he said. the scheme, called the pub fund, is a realisation of comments made to gamesindustry.biz last year by sony's <mark>david reeves</mark>, who said that while exclusive deals with publishers is probably a thing of the past, there's scope for such a relationship with the development community. eden added that sony is not buying titles directly from developers, and ip rights and control of any games will remain in the hands of the teams that create them.\" a really important thing to point out is that this is not first-party publishing, this is not sony buying your product, \"he said.\" you'll be the publisher, you'll own the ip and you'll control your product. this is assisting you to make your next step from developer to publisher. \"\"and so it begins __________________ playstation 1-3 - launch 60gb and 40gb gunmetal | psp-3000 coming soon | bravia 37\" and bravia 52 \"| linux | sony ericsson c905 | mgs4/vsxiii | macbook pro | sony a350 14.2 megapixel camera | sony 8.1 megapixel camera | 2000 acura 3.5 rl...still doubting the ps3 in 09? click here to view links or images in signatures your post count must be 10 or greater. you currently have 0 posts. finally! before they just sat around expecting games to fall into their lap. now they're making an effort! i think this is for psn games only. hopefully this brings more interesting content to psn. vbulletin, copyright © 2000 - 2009, jelsoft enterprises ltd. playstation universe copyright 2006-2009 gameburst media ltd. all rights reserved. reproduction in whole or in part in any form or medium without express written permission of gameburst media ltd. is prohibited."}, {"articleID": "2019122808_00116518_W", "names": {"Matt Wallace": ["Q26858662", "Q30122765", "Q513309"]}, "date": "2019-12-28", "url": "https://www.newindianexpress.com/world/2019/dec/28/mars-2020-rover-to-seek-ancient-life-prepare-human-missions-2082001.html", "content": "Home World Mars 2020 rover to seek ancient life, prepare human missions The Mars 2020 mission also carries hopes for an even more ambitious target--a human mission to Mars. Share Via Email Published: 28th December 2019 12:37 PM | Last Updated: 28th December 2019 12:37 PM | A + A A - NASA (File Photo | AP) By PTI PASADENA: The Mars 2020 rover, which sets off for the Red Planet next year, will not only search for traces of ancient life, but pave the way for future human missions, NASA scientists said Friday as they unveiled the vehicle. The rover has been constructed in a large, sterile room at the Jet Propulsion Laboratory in Pasadena, near Los Angeles, where its driving equipment was given its first successful test last week. Shown to invited journalists on Friday, it is scheduled to leave Earth in July 2020 from Florida's Cape Canaveral, becoming the fifth US rover to land on Mars seven months later in February. \"It's designed to seek the signs of life, so we're carrying a number of different instruments that will help us understand the geological and chemical context on the surface of Mars,\" deputy mission leader <mark>Matt Wallace</mark> told AFP. Among the devices onboard the rover are 23 cameras, two \"ears\" that will allow it to listen to Martian winds, and lasers used for chemical analysis. Approximately the size of a car, the rover is equipped with six wheels like its predecessor Curiosity, allowing it to traverse rocky terrain. Speed is not a priority for the vehicle, which only has to cover around 200 yards per Martian day--approximately the same as a day on Earth. Fuelled by a miniature nuclear reactor, Mars 2020 has seven-foot-long articulated arms and a drill to crack open rock samples in locations scientists identify as potentially suitable for life. \"What we're looking for is ancient microbial life--we're talking about billions of years ago on Mars when the planet was much more Earth-like,\" said <mark>Wallace</mark>. Back then, the Red Planet had warm surface water, a thicker atmosphere and a magnetic force around it, he explained. \"And so it was much more conducive to the types of simple single-cell life that evolved here on Earth at that time,\" <mark>Wallace</mark> said. Once collected, the samples will be hermetically sealed in tubes by the rover. The tubes will then be discarded on the planet's surface, where they will lie until a future mission can transport them back to Earth. \"We are hoping to move fairly quickly. We'd like to see the next mission launched in 2026, which will get to Mars and pick up the samples, put them into a rocket and propel that sample into orbit around Mars,\" said <mark>Wallace</mark>. \"The sample would then rendezvous with an orbiter and the orbiter would bring the sample back to the Earth.\" Samples should reach Earth \"in the course of a decade or so,\" he added. To maximize its chance of unearthing traces of ancient life, Mars 2020 will land in a long dried-up delta called Jezero. The site, selected after years of scientific debate, is a crater that was once a 500-yard-deep lake. It was formerly connected to a network of rivers that flowed some 3.5 to 3.9 billion years ago. The crater measures just under 30 miles across, and experts hope it may have preserved ancient organic molecules. The Mars 2020 mission also carries hopes for an even more ambitious target--a human mission to Mars. \"I think of it, really, as the first human precursor mission to Mars,\" said <mark>Wallace</mark>. Equipment on board \"will allow us to make oxygen\" that could one day be used both for humans to breathe, and to fuel the departure from Mars \"for the return trip.\" The ambitions come as a new space race hots up, with Beijing increasingly vying to threaten US dominance. China on Friday launched one of the world's most powerful rockets in a major step forward for its own planned mission to Mars next year. NASA's Mars 2020 will remain active for at least one Martian year, which is around two years on Earth. But Martian rovers have frequently exceeded their intended lifespans--its predecessor Curiosity landed on Mars in 2012 and is still trundling around the planet's Mount Sharp region. Stay up to date on all the latest World news with The New Indian Express App. Download now (Get the news that matters from New Indian Express on WhatsApp. Click this link and hit \"Click to Subscribe'. Follow the instructions after that .) TAGS Mars 2020 rover NASA"}, {"articleID": "2011101416_00012480_W", "names": {"Eddie Huang": ["Q5336136", "Q9025392"]}, "date": "2011-10-14", "url": "http://washingtoncitypaper.com/articles/41623/", "content": "post on expired tag arrests: \"police have better things to do\" at dance place, identity crises under a magnifiying glass it's d.c. wine week! here's video of the promoters getting a little slaphappy over a glass or two <mark>eddie huang</mark> does carryout, mtv filming ramen-bao event at toki underground tonight virginia is for lovers (of beer): the old dominion state is oktoberfest central at dance place, identity crises under a magnifiying glass reviewed: keith lane at hillyer art space monday, october 31 6:30 pm 9:30 club washington, d.c. multiple entries by the same person will count as one entry. this contest is open to residents of d.c., virginia, and maryland. no purchase necessary. employees of city paper are not eligible."}, {"articleID": "2015100908_00017626_W", "names": {"Bruce Smith": ["Q18128176", "Q18379173", "Q20196149", "Q20985780", "Q4978299", "Q4978300", "Q4978301", "Q59223435", "Q952956"], "Walter Scott": ["Q19788938", "Q21003959", "Q24007630", "Q27981542", "Q33692775", "Q43913865", "Q48814644", "Q7966090", "Q7966092", "Q7966094", "Q7966095"], "Chris Stewart": ["Q1077782", "Q22254232", "Q30084424", "Q4068880", "Q5108164", "Q713526", "Q902651"]}, "date": "2015-10-09", "url": "http://www.goupstate.com/article/20151008/wire/151009743", "content": "N. Charleston to pay $6.5 M settlement to family of man shot by cop <mark>BRUCE SMITH</mark> Published: Thursday, October 8, 2015 at 8:00 p.m.. Last Modified: Thursday, October 8, 2015 at 8:47 p.m. NORTH CHARLESTON--City officials in South Carolina approved a $6.5 million settlement Thursday with the family of an unarmed black man fatally shot by a white police officer who was captured on cellphone video firing at the man's back as he ran away. The North Charleston City Council approved the settlement by a 10-0 vote, and members of <mark>Walter Scott</mark>'s family were on hand when it was announced. Scott, 50, was shot April 4 by North Charleston officer Michael Slager while trying to run from a traffic stop. A bystander recorded the shooting in dramatic cellphone video. Slager was indicted on a murder charge in June and a judge refused to set bond last month, saying his release would \"constitute an unreasonable danger to the community.\" \"While nothing can replace having <mark>Walter</mark> in our lives, the City of North Charleston's historic action ensures that he did not die in vain,\" Scott's brother Anthony said, noting the settlement will provide for Scott's children. \"It was a bittersweet victory,\" he added. \"The family still wants justice for my brother and this was a step in the right direction.\" Anthony Scott said the family plans to donate some of the money from the settlement to disaster relief for victims of the recent floods in South Carolina. Mayor Keith Summey said he was pleased with the settlement. \"The family took steps to keep the community calm, and for that the city is thankful,\" he said. \"This is a very difficult period for the Scott family. I know they are glad to have this part behind them so their healing process can continue.\" The bystander's cellphone video showed Slager firing eight times as Scott ran. The shooting inflamed the national debate about how blacks are treated by law enforcement officers. After the video went public, the family called for peace and calm in the community. At least in part, the family's actions are believed to have prevented the kind of violence that erupted elsewhere in the nation following the deaths of black men following encounters with law enforcement. The mayor said that since the shooting, North Charleston police have been outfitted with body cameras. Slager was not wearing one. Summey also noted the police department will be working with a division of the Department of Justice that helps local communities resolve issues involving race, color, national origin or gender. City Attorney Brady Hair said Summey met with the family and their attorney several days after the shooting. Hair said both sides felt that it was in everyone's best interest to reach a resolution and avoid a lawsuit. While attorneys for the family said at the time they might sue, they never did. A mediator helped negotiate the settlement, which Hair said will be paid by the city's insurance carrier and from the city's reserve fund. He said how much would come from each has not been worked out. Attorney <mark>Chris Stewart</mark>, who represents the Scott family, said a number of issues had to be considered in reaching the $6.5 million figure. Noting that North Charleston is no New York, he remarked, \"There is no way this city could pay $50 million.\" He said attorneys also had to consider the damage a drawn-out legal battle might do to the city and its residents. Hair said the $6.5 million represents the largest settlement for such a case in the state's history. Slager was fired following his arrest on the murder charges and has been detained in solitary confinement. Before the video was brought to the attention of authorities, Slager had told investigators that Scott tried to grab his gun and Taser. But prosecutor Scarlett Wilson said Scott was running away and the only time Slager could be seen running was to go back, pick up the Taser and then drop it by Scott's body. Slager faces from 30 years to life in prison without parole if he is convicted of murder. There were no aggravating circumstances such as robbery or kidnapping, so the death penalty doesn't apply in the case, the prosecutor has said. Reader comments posted to this article may be published in our print edition. All rights reserved. This copyrighted material may not be re-published without permission. Links are encouraged."}, {"articleID": "2017080702_00188911_W", "names": {"Kevin Nicholson": ["Q17306336", "Q6397095", "Q6397096"]}, "date": "2017-08-07", "url": "http://noosanews.com.au/news/qld-woman-admits-murdering-grandfather-during-robb/3209560/", "content": "Bernadette Burns has appeared in the Supreme Court for her part in the death of Adelaide grandfather Robert Whitwell. Popular Stories Bubbly Sharon \"was truly an angel' Tributes flow for Garth\" Mr Noosa' Prowd Proving the grieving wife was actually calculating murderer Local Real Estate Cars For Sale A WOMAN has admitted to murdering Adelaide grandfather Robert Whitwell during a violent robbery that she carried out with her friend - who was the granddaughter of the victim and has already pleaded guilty to murder. On Monday, Bernadette Burns, 22, of Redbank Plains, 33km southwest of Brisbane, pleaded guilty to murder before Supreme Court Justice Trish Kelly. She was set to face trial for murder but has instead pleaded guilty to the crime - under a unique section of the Criminal Law Consolidation Act. Burns has admitted to committing an intentional act of violence while undertaking the robbery, which resulted in the death of Mr Whitwell. The offence - which is similar to the controversial US offence of \"felony murder\" - still carries the maximum penalty of life imprisonment. Justice Kelly transferred the case to her colleague Justice <mark>Kevin Nicholson</mark>, who is hearing the matter of her co-accused Brittney Jade Dwyer, the granddaughter of Mr Whitwell. The pair will be back in court later this month. Shelby Lee Angie Holmes (left) and accused killer Brittney Jade Dwyer (right). Source: Facebook Last week, Dwyer, 20, faced sentencing submissions for her role in the killing of Mr Whitwell, 81, in his Craigmore unit in August last year. Dwyer, also of Redbank Plains, fabricated an eleventh-hour lie to tarnish the name of her victim and excuse her crime, the court was told. Supreme Court Justice <mark>Kevin Nicholson</mark> heard Dwyer told a psychiatrist that her grandfather may have sexually molested her as a child - but she wasn't sure if it was real or not. \"It is a most unpleasant assertion. It's unfounded in any other material,\" prosecutor Jim Pearce told the court. He said \"at one minute to midnight\" Dwyer was having flashbacks about something her victim may or may not have done, despite never having raised this as a motive at any other point in the investigation. \"In my submission, the court would be entitled to infer, with the absence of evidence from Ms Dwyer about this, that it is just simply an invention designed to give her an explanation for why she acted as she did,\" he said. \"Because the only other explanation is a premeditated, pre-planned, almost sociopathic killing.\" It's insidious to a man who was murdered in that way. \"He asked Justice <mark>Nicholson</mark> to place no weight on that part of the psychiatric report. Murder victim Robert Whitwell, who was found dead in his Craigmore unit on August 8, 2016. Dwyer's lawyer, Craig Caldicott, said his client wasn't sure whether\" her flashbacks \"were real or not and it would not be presented as a motive in the killing. He said the motivation was to steal money from her grandfather. Her case was then adjourned until after Burns' case had been finalised. Another friend, Shelby Lee Angie Holmes, 19, was sentenced last week for trespassing on Mr Whitwell's property in the months leading up to the murder. Holmes was jailed for 17 months with a non-parole period of nine months, suspended on the condition she be of good behaviour for three years. The court was told Dwyer and Holmes drove from Queensland to Adelaide to rob Mr Whitwell of\" thousands of dollars \"of the\" hundreds of thousands \"which they believed was kept in his shed. But the girls were frightened off by a sensor light, barking dogs and a nearby neighbour. Last month, Mr Whitwell's brothers told how they embraced his crying granddaughter in the days after his death - only to discover they had been comforting his killer. Dwyer had to listen as her family outlined their devastation and despair in victim impact statements read out in the Supreme Court by prosecutor Jim Pearce. In his statement, Mr Whitwell's brother Geoffrey Whitwell said he was devastated by his brother's murder and missed him dearly.\" Bob and I were very close, \"he wrote.\" We always came together for Christmas and Bob's birthday was special because it was on the same day as my wife's (birthday). \"He wrote that he would speak with his older brother on the phone frequently.\" But I'll never hear the phone ring with my brother on the other end, \"he said in his statement. Mr Whitwell said Dwyer, her mother Tonya Dwyer and brother all flew to Adelaide from Queensland after the murder.\" We welcomed you into our home, embraced you and comforted you, all the while you wept with your fake tears and made comments like \"my poor poppa',\" he said. \"I now know that I had been embracing and comforting my brother's killer. You are a master of deception, I will give you that.\" I will never forgive you. You're a cruel, deceitful person with no regard for human life - I believe you are dangerous and evil and deserve the highest penalty. \"Mr Whitwell's other brother, Peter Whitwell, also spoke of inviting Dwyer into the family home and comforting her in the days after his death.\" We were just coming to terms with his death when we found out it was his own granddaughter who was responsible, \"he said in his statement. Tonya Dwyer - whose daughter killed her father - also provided a statement to the court, saying she had been a happy wife, mother and daughter until everything changed on May 2 last year.\" (Now) I feel like I'm drowning in life, \"she said. Dwyer's father, Garry Dwyer, described his former father-in-law as a\" great man, who loved his family \". He asked the court to impose an\" appropriate \"jail term on his daughter. Dwyer pleaded guilty to the murder and in February and admitted to a further charge of aggravated serious criminal trespass between April 30 last year and May 2. crime Read More Login to follow murder Read More Login to follow national Read More Login to follow Topics: crime murder national 0 Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}]