[{"articleID": "2010073119_00291506_W", "names": {"Jack Doyle": ["Q16233105", "Q39089724"]}, "date": "2010-07-31", "url": "http://digitaljournal.com/article/295360", "content": "the national wildlife federation released a ten-year examination of the safety record of the oil and gas industry, finding accidents are common. when considering whether to believe oil industry executives when they say their operations are safe, the national wildlife federation (nwf) says the track record for the industry belies the claims of safety. the chances are good that another oil spill alike the deepwater will happen again. there have already been three other spills, according to a report released on july 28. press release issued by nfw said \"...today's oil and gas industry threatens americans in countless ways. this industry continues to knowingly endanger its own workers, the environment, wildlife, and our communities in states across the nation.\" that blunt assessment is not just rhetoric. the nwf said \"...major oil spills are really only a small part of the real story. from 2000 to 2010, the oil and gas industry accounted for hundreds of deaths, explosions, fires, seeps, and spills as well as habitat and wildlife destruction in the united states. these disasters demonstrate a pattern of feeding the addiction to oil leaving in their wake sacrifice zones that affect communities, local economies, and our landscapes.\" in a press conference held wednesday, tim warman, executive director of the global warming solutions program for nwf said \"our nation has been witness to the worst environmental catastrosphe in our history. every day for over 100 days now we've been seeing images of disaster and despair in the gulf of mexico. but you know, in the wake of the bp gulf disaster, what we keep hearing from the petroleum industry is that this is a unique incident. what we have found, the facts are laid out in our report titled, assault on america: a decade of petroleum company disasters, pollution and profit is a very different story. the facts paint a picture of an industry where accidents, spills, leaks, explosions, fires and catastrophic carelessness in search of profit put american people, property and nature in harm's way--every day. these disasters make it clear that the bp disaster isn't a rare accident. it's an example of a reckless industry that cuts corners and puts profits ahead of people.\" the organization contracted <mark>jack doyle</mark> to research and write the report. describing the report, warman said \"...no state is untouched, and the bp disaster in the gulf is just one of many spills, leaks and other disasters in the gulf of mexico over the last decade.\" the organization advocates ending reliance on fossil fuels, and wants to see oil companies held to account. warman said new policies are needed to protect the public and wildlife; to make oil companies more responsible, and to ensure existing laws apply equally to the industry. warman pointed at canada's oil sands, saying the trend of developing dangerous sources of petroleum needs to stop. the national wildlife federation supports the development of alternative energy sources and modes of transportation. warman said it was important to collect the information and share it, because most incidents are localized, and the stories don't often get shared nationally. he added \"the petroleum industry has a vast war chest running a very effective campaign to cover up these stories. the top ten petroleum companies made 150 billion dollars in profit in 2009. they have effectively spent this money to cover up the story through litigation, through marketing and pr campaigns and through lobbying to avoid being held accountable.\" according to the report, 19 people have died in separate incidents in 2010 alone, and, counting the deepwater horizon, there have been three oil spills in 2010. here, highlights incidents that have occurred since 2000. one of the more horrific accidents was one that occurred in 2000. three families had gone camping beside the pecos river in new mexico, camping over top of a pipeline that ruptured and exploded. seven adults, 3 children and two babies were camped over top of the pipe, miraculously, six people initially survived the blast, which created a fireball so large and ferocious, the fire department couldn't get within a half mile of the fire. only when things seemed to be under control were the survivors found. they later died of their burns, which were so bad, the survivors were said to resemble mummies. the rupture and explosion were found to have been caused by corrosion, which weakened the pipeline. offshore drilling is no stranger to accidents. the u.s. mineral management service, recently renamed as the bureau of ocean energy management, regulation, and enforcement said there have been nearly 1,500 incidents over a 6 year period. \"...of these incidents, 41 fatalities, 302 injuries, 476 fires, and 356 pollution events were reported.\" the advertiser reported that \"...independent oil and gas companies currently account for about half of the nearly 400,000 jobs, $70 billion in economic values and $20 billion in federal, state and local revenue generated by the industry in 2009.\" the us consumes around 20 million barrels of petroleum per day, the paper said. the united states has proposed legislation to create a stronger safety standard for offshore drilling, the associated press reported, but that legislation needs to be passed by senate, and has been stalled. if the legislation passes, there will be no cap on liability for offshore spills. the legislation also proposes that companies with a poor track record of employee safety and environmental protection should not be approved for offshore drilling permits."}, {"articleID": "2018020217_01239233_W", "names": {"Ronald Wright": ["Q1348862", "Q6111695"]}, "date": "2018-02-02", "url": "http://www.kltv.com/story/37414403/officials-owner-of-houston-company-illegally-dumped-waste", "content": "Officials: Owner of Houston company illegally dumped waste - KLTV.com - Tyler, Longview, Jacksonville | ETX News Officials: Owner of Houston company illegally dumped waste - KLTV.com - Tyler, Longview, Jacksonville | ETX News Member Center: Officials: Owner of Houston company illegally dumped waste 2018-02-02T17:10:16 Z2018-02-02T17:10:16 Z HOUSTON (AP) - Prosecutors say the majority owner of a Houston company illegally dumped chemicals into the city's storm-drain system that were so toxic they \"would burn the skin off your bones.\" The Harris County district attorney's office said in a statement Friday that 50-year-old <mark>Ronald Wright</mark> was indicted a day earlier on charges that include improper disposal and storage of hazardous materials. Officials say the dumping occurred as recently as last month. The general manager of <mark>Wright</mark> Containers also was indicted. Companies in the oil and gas industry would ship waste to <mark>Wright</mark> for disposal but prosecutors say the waste was repeatedly dumped into the drainage system. Benzene was among the toxic material that was dumped. A message left for <mark>Wright</mark> at his company was not immediately returned. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Can't Find Something?"}, {"articleID": "2014080707_00045775_W", "names": {"Kelly Johnson": ["Q3194896", "Q35655353", "Q6386108"], "John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"]}, "date": "2014-08-07", "url": "http://providencejournal.com/sports/red-sox/content/20140806-kelly-johnson-to-be-activated-mookie-betts-might-be-odd-man-out.ece", "content": "ST. LOUIS - Utility man <mark>Kelly Johnson</mark>, acquired from the Yankees in exchange for Stephen Drew at the trade deadline, is scheduled to be activated off the disabled list and join the Red Sox on Thursday in St. Louis. <mark>Johnson</mark> has been out since July 22 with a strained left groin. With <mark>Johnson</mark> coming back, it might be time for Mookie Betts to be sent back down to Pawtucket. Betts was in the starting lineup on Wednesday for the second time since being recalled Aug. 1. He's started 11 of the 19 games he's been active for Boston. The 21-year-old could probably use more regular playing time than that, especially with Brock Holt already spelling Jackie Bradley Jr. on occasion in center. \"You strive to find ways to make sure that his time here isn't just spent on the bench because he's got ability, he's got talent,\" manager <mark>John Farrell</mark> said. \"It's important for us to get a minimum number of games played per week.\" \"It's a little bit of a balance,\" said general manager Ben Cherington. \"We think he is a major-league player for us and will be a good one for a long time. At some point, he has to get more and more exposure to that to make that transition. On the other hand, he's got to play.\" <mark>Farrell</mark> has stated on multiple occasions that he would like to keep Holt in the lineup at the leadoff spot as much as possible, while also finding regular time for Bradley, Xander Bogaerts and Will Middlebrooks. \"<mark>John</mark> is doing the best he can to get guys in the lineup as much as possible,\" Cherington said. \"If it becomes a situation where we can't find enough playing time for a guy that we are trying to find something out about or that needs to play more for development, then we may have to make a decision on that.\" It's really more of a question of allocating playing time the right way. If that becomes too much of a challenge, then we'll find a way to ease that up and allow <mark>John</mark> to have an easier mix. We certainly don't want to get to the end of the year and look back and think, \"Boy, I wish we had gotten 60 more at-bats for this guy .' That would be inconsistent with what we need to do.\" Twitter: @ TimBritton"}, {"articleID": "2017122811_00485359_W", "names": {"Mazhar Hussain": ["Q44478908", "Q59490386", "Q6798493", "Q6798495"]}, "date": "2017-12-28", "url": "https://propakistani.pk/2017/12/28/ptcl-wins-fight-land-grabbers-karachi/", "content": "PTCL Wins Fight Against Land Grabbers in Karachi Raja Kamran 14 mins ago Pakistan Telecommunications Company Limited (PTCL) has said that its properties located at Malir Halt in Karachi, just off Shahrah-e-Faisal and near Karachi Airport are under threat from the land grabbers who are using different tactics to deprive the company of its rightful ownership. This was disclosed by PTCL's Director of Human Resources and Legal Affairs, Syed <mark>Mazhar Hussain</mark>, in a media brief at a local hotel Karachi. PTCL's legal and media team were also present at the briefing. Syed <mark>Mazhar Hussain</mark> informed the media that on December 16 2017, a group of civil armed personnel with a contingent of Sindh Anti Encroachment Police and heavy machinery started bulldozing PTCL's duct factory that was owned by PTCL since 1960, located near the airport at Shahrah-e-Faisal. \"A person name Murtaz Khooso gave an application paper to the police, saying that this land was owned by him and PTCL encroached on it. Police and Local Administration came to aid him in grabbing PTCL's property.\" Syed <mark>Mazhar</mark> told media. Syed <mark>Mazhar</mark> said that this was the 2 nd attempt by Murtaz Khooso to grab this land. Earlier In 2013, a similar attempt was made with local administration and police when PTCL, with the help of higher officials, regained the ownership of its land successfully. PTCL filed a case against the land grabbers and took a stay order. \"This time PTCL's management contacted the Chief Secretary and IG police, and showed the stay order and other legal documents to the High Court. On the basis of these documents, the higher management of Sindh Administration backed PTCL in regaining control of the factory.\" Syed <mark>Mazhar</mark> said PTCL is a government owned company and with 62 percent of its shares still owned by the Federal Government. It's ironic how the local administration and state organs assisted the land mafia in their activities. This time land grabbers and police targeted PTCL's abandoned duct factory. This factory currently is not in operation but is used as a storage facility. During the land grabbing operation, PTCL's precious equipment, copper wire and other material worth millions of Rupees was also stolen. \"PTCL is taking every action against the miscreants and has filed a contempt of court case against them. PTCL has also registered a FIR under trespassing property, theft and others charges.\" Syed <mark>Mazhar</mark> added. He also confessed that another property owned by PTCL is threatened by land grabbers, who are engaged in China cutting of the land. P & T colony is one of the examples, however, this is a more complicated matter."}, {"articleID": "2019031123_00406416_W", "names": {"Andrew John": ["Q12301620", "Q4757506"]}, "date": "2019-03-11", "url": "http://www.wftv.com/news/trending-now/genealogy-dna-solve-case-of-newborn-left-to-freeze-to-death-in-ditch-38-years-ago/929482557?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago By: Crystal Bonvillian, Cox Media Group National Content Desk Updated: Mar 11, 2019 - 6:54 PM Loading...of Genealogy, DNA solve case of newborn left to freeze to death in ditch 38 years ago SIOUX FALLS, S.D. - His community named him <mark>Andrew John</mark> Doe. The residents of Sioux Falls, South Dakota, took the newborn into their hearts, with about 50 strangers attending a burial that included a tiny white casket, flowers, stuffed animals and a pin on his pajamas that stated, \"You are loved.\" Now, just over 38 years after the baby boy was found dead in a ditch, his umbilical cord and placenta still attached and tears frozen on his cheeks, police officials say they have identified his mother and charged her in his death. Sioux Falls Police Chief Matt Burns on Friday announced the arrest of Theresa Josten Bentaas, 57, of Sioux Falls. Bentaas, who was identified as <mark>Andrew</mark>'s mother through genetic genealogy, is charged with first-degree murder, along with the lesser included offenses of second-degree murder and manslaughter. Bentaas remained in the Minnehaha County Jail Monday in lieu of $250,000 bond. Burns began a news conference Friday with a synopsis of <mark>Andrew</mark>'s short life, which an autopsy showed lasted about two hours on Feb. 27, 1981, as he \"slowly succumbed to exposure.\" \"He had been loosely wrapped in a blood-stained blanket and left all alone in the cold,\" Burns said .--Vanessa Gomez (@ VanessagKSFY) March 8, 2019 Detective Michael Webb, who has worked on the cold case since 2009, said a passerby test-driving a vehicle with friends the next day made the gruesome discovery of the body, which was wrapped in the blanket, a sheet and a shirt and left in a ditch alongside a cornfield. A pair of women's underwear was also found next to the body, according to an arrest affidavit in the case. Lee Litz, the man who spotted the red wine-colored blanket and found the baby's body, told the Argus Leader in Sioux Falls in 2016 that the memory remains fresh in his mind. A soon-to-be father in 1981, he said he often wonders what would have become of the child if he'd found him sooner. \"I sure would have adopted him rather than see him die like that,\" Litz told the newspaper. According to the Argus Leader's archives, the forensic pathologist who examined the baby's body believed he had been in the ditch for about 24 hours before he was found. Blood loss from the still-attached umbilical cord likely contributed to his death. See 1981 coverage of <mark>Andrew John</mark> Doe's wake and burial below, courtesy of KELO. Litz attended <mark>Andrew</mark>'s funeral and still visits his grave. He is sometimes accompanied by his daughter, who thinks of <mark>Andrew</mark> as an older brother. \"To see a child thrown away like that. How could someone do that?\" Litz said in 2016. \"Someone got away with murder.\" Upon learning of Bentaas' arrest, Litz said he was \"elated\" to hear the news. \"I'm feeling very happy that she was found, (but) very sad that he's laying in the ground yet,\" Litz told KSFY in Sioux Falls. \"He needed somebody, and she just left him like a piece of garbage.\" \"We don't forget about these cases' The crime shocked the Sioux Falls community, where the baby's death became, over the years, one of just a handful of unsolved cases. It wasn't for a lack of effort, said Webb, who pointed out that aside from the items found in the ditch with the baby, all investigators had to go on was a blood type.\" The investigators worked very diligently during that time, however, they did not have anything that we have today as far as DNA technology and the advances that we have today, \"Webb said. The detective said investigators received tips in the case early on, but whenever they would go to a home hoping to find the dead infant's mother, they would either find a woman still pregnant or one holding her own newborn in her arms. Leads in the case quickly dried up and years passed by. <mark>Andrew John</mark> Doe's story remained a popular one in Sioux Falls, with plenty of media attention over the years, but the leads just weren't there.\" The case never gets closed, \"Webb said.\" These don't go closed, however, it does go cold. \"Sioux Falls PD Webb said cold cases are never far from homicide detectives' minds.\" We don't forget about these cases. We never do, \"Webb said.\" And about 10 years ago, we started taking a different look on this to see what we could do, given the advancements in technology and DNA, to solve this case. \"The major turning point in the case came in the spring of 2009, when Webb decided to have the baby's body exhumed. According to the arrest affidavit, the remains were sent to the University of North Texas' Health Science Center, where lab workers were able to extract a DNA profile from the bones. <mark>Andrew</mark>, who was exhumed that September, was returned to his grave in Sioux Falls' St. Michael's Cemetery the following June. Investigators plugged the baby's DNA profile into South Dakota's criminal databases at least once a year over the subsequent decade, but never found a match, Webb said. When public genealogy databases became a popular new law enforcement tool last year, detectives had renewed hope. Webb said at Friday's news conference that investigators spent the past several months working with Parabon Nanolabs Inc., a private company renowned for its work helping to solve cold cases. Parabon used DNA left over from <mark>Andrew</mark>'s exhumation and found two potential family trees among the genetic profiles in its database.\" Of interest was that a lot of these family trees came back to Sioux Falls and the surrounding areas, \"Webb said.\" This was the first tip in 38 years that got us anywhere close to the baby's identity. \"Watch Friday's news conference in its entirety below, courtesy of the Argus Leader. From there, investigators used a combination of the internet and old birth and marriage announcements to narrow down their suspect pool. Webb said detectives had always believed the person who abandoned the child was a young person. The woman who connected the family trees had children who were teenagers in 1981. Bentaas, whose maiden name was Josten, was 19 when <mark>Andrew</mark> was born. Detectives got DNA samples from beer cans, water bottles and cigarette butts in the trash outside the home of Bentaas and her husband, Dirk Bentaas, and on Feb. 15, the South Dakota state crime lab matched the couple's DNA to that of <mark>Andrew John</mark> Doe. They were the mother and father of the child, Webb said. The DNA of the baby's brother, one of the Bentaases' two living adult children, was also found on a beer bottle, the affidavit said. A search warrant was obtained for DNA from both parents to confirm the match.\" A bump and then no bump' The couple, who married in August 1987, were interviewed by investigators Feb. 27--38 years to the day that the baby was placed in the ditch. Webb said the interviews were set for that date on purpose. Detectives waited to file charges against Theresa Bentaas after confirmation of the DNA match came from the state crime lab last week, Webb said. No charges were filed against Dirk Bentaas because he never knew about his son's birth or death, Webb said .>> Read more trending news According to the arrest affidavit, Theresa Bentaas admitted to hiding her pregnancy in late 1980 and early 1981 and giving birth alone at her apartment. She told detectives she was \"young and stupid.\" She then drove to the ditch, which was in proximity to her home, and left the baby there, the document said. A witness in 1981 reported seeing a light-colored Datsun type vehicle parked in that area, with a \"woman's legs hanging out and some blankets on the ground at the time,\" the affidavit said. \"When asked what she was thinking when she drove away from that ditch, (Bentaas) stated she was sad, scared and she ran from it and it was not smart,\" the affidavit said. \"She was asked if she saw this on the news after the baby was discovered and she said she did and that she was in denial that she was the one responsible for that.\" Records from the infant's burial showed that she was not among the mourners who attended, Webb said. When asked if she ever thought about what she had done when driving in the now-residential area where she'd left her son, Bentaas responded, \"Of course,\" the affidavit said. Read the entire arrest affidavit below. Theresa Bentaas Arrest Affidavit by c_bonvillian on Scribd Dirk Bentaas, who was also a teenager when <mark>Andrew</mark> was born, told investigators his then-girlfriend \"had a bump and then no bump\" around the time the abandoned newborn was discovered, the Argus Leader reported. \"(Dirk) Bentaas admitted to hearing about (<mark>Andrew John</mark> Doe) being found but did not believe the defendant was capable of doing such an act,\" according to the newspaper. Webb told reporters it felt good to solve the notorious crime after nearly four decades. He said what kept him and other investigators going over the past decade was the knowledge that new technology is always around the next corner. \"I know it sounds cliché, but we don't quit on these,\" Webb said. \"And I'll be the first to admit, you work pretty hard when it's a child case.\" You go through a lot of frustrations and you get knocked down a lot, but you keep getting back up and you don't quit. And that's what we did. \"© 2019 Cox Media Group."}, {"articleID": "2014080802_00071089_W", "names": {"Jennifer Smith": ["Q10306654", "Q14322421", "Q3177108", "Q3177109"]}, "date": "2014-08-07", "url": "http://www.jdjournal.com/2014/08/07/famu-law-school-sued-by-professor/?hvid=4N8j2k", "content": "1,000,000 + Attorneys and Legal Staff Case Western Reserve Announces Interim Law Deans to Remain in Posts ABA Bestowing Honor on Tulane Law School Geoffrey Shields, Former VLS Dean, Dies at 68 <mark>Jennifer Smith</mark>, a law professor at the Florida A & M University Law School, has filed a lawsuit against the institution, according to The Tampa Tribune. She claims salary inequities, retaliation and discrimination in her lawsuit, which was filed in Leon County circuit court last week. <mark>Smith</mark> was hired in 2004 as an associate professor. The complaint states that it was filed in Tallahassee because that is where the school is headquartered. Eight violations of federal and state law for equal pay and gender discrimination are mentioned in the suit against the school. She is asking for a promotion to full professor, unspecified damages, attorney fees and other relief. The complaint said that <mark>Smith</mark> was granted tenure in 2010, but has been rejected for promotion to full professor since then. According to the complaint, an administrator \"sabotaged' her promotion by putting negative recommendations in her personnel files in place of positive ones. The administrator called other officials at the school to prevent promotions. <mark>Smith</mark> claims that the treatment was done in retaliation for her request to public records about professor-pay information. <mark>Smith</mark> said she filed a workplace-violence complaint against the same administrator. She said the administrator\" made some threatening comments about her. \"The complaint quotes a report from the ABA in September of 2012 about the law school that cites concerns from faculty about an\" inhospitable environment for women, lesbians and gay faculty members. \"Law School News. You can follow any responses to this entry through the Philly Woman with Permit to Carry Charged in New Jersey with Unlawful Possession of a Weapon Attorney Career Resources: In-House Corporate Attorney Jobs Grow As Business Burgeons In Birmingham"}, {"articleID": "2017113001_00217101_W", "names": {"Susan Smith": ["Q21459106", "Q2449527", "Q27927258", "Q34992921", "Q37377726", "Q42664397", "Q47467430", "Q7648396"]}, "date": "2017-11-30", "url": "http://www.washingtontimes.com/news/2017/nov/29/james-clyburn-charges-john-conyers-might-be-false-/?utm_source=RSS_Feed&utm_medium=RSS", "content": "-- Robert Draper (@ DraperRobert) November 29, 2017 He said the report, which Mr. Clyburn and the Congressional Black Caucus quickly disputed, was \"according to 2 sources. One told me Clyburn has used the <mark>Susan Smith</mark> parallel more than once, to members & staffers.\" Both Mr. Clyburn and Mr. Conyers are members of the CBC; <mark>Smith</mark>'s claim that a black man had kidnapped her children quickly fell apart and she was later convicted in a South Carolina court of murdering the kids by drowning them in the family car. Yes, according to 2 sources. One told me Clyburn has used the <mark>Susan Smith</mark> parallel more than once, to members & staffers. https: //t.co/3SjKCzjBh8--Robert Draper (@ DraperRobert) November 29, 2017 The CBC quickly said on its Twitter account that the reporter's claims are \"not accurate.\" Mr. Clyburn \"used the <mark>Smith</mark> example to illustrate the dangers of convicting people before getting all the facts. Although <mark>Smith</mark> killed her kids, she blamed an innocent person & a lot of people believed that innocent person was guilty.\" The CBC went on to say that Mr. Draper's sources were doing \"nothing more than members changing the story because they want his leadership position.\" . @ RepRichmond: \"If the police hadn't investigated, the wrong person would have gone to jail. This mischaracterization of what @ clyburn said is nothing more than members changing the story because they want his leadership position.\" 2/2--Black Caucus (@ OfficialCBC) November 30, 2017 Mr. Clyburn himself also took to Twitter to say that Mr. Draper \"is inaccurate in many regards. That discussion had nothing to with Conyers,\" a claim the reporter quickly rebutted. This is inaccurate in many regards. That discussion had nothing to with Conyers. https: //t.co/EWeokwGn50--James E. Clyburn (@ Clyburn) November 29, 2017 \"That discussion was specifically & exclusively about Conyers, according to 2 attendees. Who else could you have been referring to when bringing up <mark>Susan Smith</mark>?\" Mr. Draper asked rhetorically. That discussion was specifically & exclusively about Conyers, according to 2 attendees. Who else could you have been referring to when bringing up <mark>Susan Smith</mark>? https: //t.co/MtbIdDbxT7--Robert Draper (@ DraperRobert) November 29, 2017"}, {"articleID": "2019050201_00236116_W", "names": {"Doug Jones": ["Q1251779", "Q16142774", "Q30122825", "Q461309", "Q5300612", "Q5300613"]}, "date": "2019-05-02", "url": "https://www.sgvtribune.com/2019/05/01/long-beach-opera-offers-an-original-take-on-philip-glass-in-the-penal-colony/", "content": "Ensemble members from CalRep at CSULB in Long Beach Opera's \"In the Penal Colony\" (Photo by Keith Ian Polakoff) By Jim Farber | PUBLISHED: May 1, 2019 at 6:37 pm | UPDATED: May 1, 2019 at 6:37 pm The harrowing scenes that transpire in the current production of Philip Glass' opera, \"In the Penal Colony,\" based on Franz Kafka's gruesome 1919 short story, represent a first collaboration between Long Beach Opera and the Cal Rep theater company of Cal State Long Beach. The production, which continues this weekend at the campus' Studio Theater, also interpolates additional text drawn from interviews compiled by members of the university's program for formerly incarcerated students, Rising Scholars. The result is an unquestionably powerful piece of agitprop theater. But it's an awkward fit with Kafka's metaphorical nightmare of a dystopian state gone mad. As stated in the program by Jeff Janisheski (the production's director and the artistic director of Cal Rep), \"This production is set in the here and now: In a country (America) that has the highest prison population in the entire world...where prison labor is a modern form of slavery and prison culture represents and perpetuates an endless cycle of racism and violence.\" Those are serious allegations, worthy of exploration on \"60 Minutes\" or \"Frontline.\" But it's not what Kafka had in mind. In fact, the author stated that to view his story as a statement against capital punishment, was to miss the point and the bigger picture. A more cogent equivalent at this moment would have been to depict the lives of the immigrant children on the border who have been separated from the parents, placed in cages and held in indefinite detention by an all-powerful government with little or no comprehension of the \"crime\" that have committed. That's Kafka! In the story, the penal colony is set on a desolate sun-parched island. Long Beach Opera's setting by Danila Korogodsky is a sterile glass box populated by baton-wielding guards and a Greek chorus of eight inmates who declaim the dehumanizing effect of their prison environment. As in the short story, a Visitor (sung by tenor <mark>Doug Jones</mark>) arrives. He is there (against his will and with little appreciation of his task) to observe an execution and make comments. He is met by the Officer (baritone Zeffin Quinn Hollis). To the familiar arpeggiated patterning of Glass' score (for string quartet and bass) The Officer describes the wonders of the penal colony's tool of execution. It is a demonic creation that slowly carves the prisoners crime into his flesh until he dies--the details of which Kafka recounts with masochistic delight. Zeffin Quinn Hollis (Officer) and <mark>Doug Jones</mark> (Visitor) in Long Beach Opera's \"In the Penal Colony\" (Photo by Keith Ian Polakoff) \"In the Penal Colony\" is not one of Glass' great creations. Its melodic structural template has the feel of being ready made and suitable for almost any occasion, while the vocal lines of Wurlitzer's English libretto do not come trippingly off the tongue. <mark>Jones</mark> offers a convincing, if not terribly nuanced interpretation of the Visitor--a clockwork bureaucrat anxious to complete his task and go home. He is not prepared for the level of fetishistic pride the Officer takes in the infernal machine, of which he is in charge. It soon becomes clear that the future of the colony and its death machine rests with the report to be filed by the visitor. Hollis offers a strong performance with a convincing dramatic arch as he tries to cover up the fact that the system (and the machine) are falling apart. In his most effective aria, he longs for the golden era of the colony and its crowd-pleasing executions when budgets were flush and his mentor, the Old Commandant, ruled the island with an iron fist. Ultimately he will try to bribe the Visitor. And when that fails prefer to die. As a substitute for the infernal machine, Janisheski choreographs his prisoners as a living mechanism as projections (by Lily Bartenstein) depict a series of abstract schematics. All the while the musicians placed above the set (who were clearly not yet totally comfortable with the score) were conduced by Andreas Mitisek. Before the performance began, Mitisek asked for a show of hands. \"How many of you here tonight have never seen an opera?\" Quite a few hands went up--nearly all young people, presumably students. I would imagine they were quite impressed. Jim Farber is a Los Angeles-based freelance writer. \"In the Penal Colony' Rating: 3 stars Where: CSULB Studio Theater, 1250 N. Bellflower Blvd., Long Beach When: 7:30 p.m. May 2-4, 2:30 p.m. May 5 Tickets: $45 - $150 (sold out) Running time: 90 minutes, no intermission Suitability: Not for younger audiences Information: 562-470-7464, www.longbeachopera.org Related Articles 10 theater productions to see in Southern California this week, April 26-May 2 Theater review: In La Mirada,\" Singin' in the Rain' makes a few splashes \"Tiny Beautiful Things' at the Pasadena Playhouse is a beautiful thing Theater review: At the Geffen,\" The Niceties' is a debate without drama Theater review: \"Fiddler on the Roof' stays grounded, looks backward and forward Get the latest news delivered daily! Subscribe Follow Us Facebook Twitter RSS"}, {"articleID": "2014102708_00054671_W", "names": {"Steve Harper": ["Q312117", "Q7612771"]}, "date": "2014-10-27", "url": "http://www.eatsleepsport.com/hull-city/bruce-hails-jakupovic-1830241.html", "content": "Hull boss Steve Bruce has hailed the performance of Eldin Jakupovic after the goalkeeper put in a fine display at Liverpool. Hull have been hit hard by injuries, not least in goal with Allan McGregor and <mark>Steve Harper</mark> out, providing the opportunity for the Swiss Jakupovic to come in. The keeper grabbed his chance with both hands, pulling off a number of fine saves to help the Tigers earn a point in a 0-0 draw at Anfield. He also denied Mario Balotelli right at the death to leave Bruce singing his praises. \"I would expect him to make those saves but, to be fair to the kid, he has waited a long time,\" Bruce said. \"It is not easy being the third-choice goalkeeper.\" The corners were raining in from Steven Gerrard and he stood up to the task of it. Maybe 18 months ago he found that a struggle. He will remember that, he has kept a clean sheet at Anfield. \"Meanwhile, Bruce was also pleased to have collected another good point after last week's draw against Arsenal.\" When you come to Liverpool, like the Emirates last week, you have to make sure you play well, \"he added.\" If you play well and take something it is excellent for a club like ours, and where we have been, and what is expected. So we are very pleased with it. \""}, {"articleID": "2011041723_00044994_W", "names": {"Susan Shaw": ["Q42322487", "Q7647731"], "Cheung Ka-Fai": ["Q5094249", "Q701930"], "Zhao Nan": ["Q45471780", "Q45541578", "Q45578974", "Q45592425"]}, "date": "2011-04-17", "url": "http://feeds.cbsnews.com/%7Er/CBSNewsTravelGuru/%7E3/aPCQPfdYi68/main20054748.shtml", "content": "april 17, 2011 winners at the 30th hong kong film awards (ap) winners at the 30th hong kong film awards, announced late sunday: best film: \"gallants\" best director: tsui hark, \"detective dee and the mystery of the phantom flame\" best screenplay: pang ho-cheung and heiward mak, \"love in a puff\" best actor: nicholas tse, \"the stool pigeon\" best actress: carina lau, \"detective dee and the mystery of the phantom flame\" best supporting actor: teddy robin, \"gallants\" best supporting actress: <mark>susan shaw</mark>, \"gallants\" best new performer: hanjin tan, \"bruce lee, my brother\" best cinematography: peter pau, \"confucius\" best film editing: <mark>cheung ka-fai</mark>, \"ip man 2\" best art direction: james choo, \"detective dee and the mystery of the phantom flame\" best costume and make-up design: bruce yu, \"detective dee and the mystery of the phantom flame\" best action choreography: sammo hung, \"ip man 2\" best original film score: teddy robin and tommy wai, \"gallants\" best original film song: \"here to stay,\" music, lyrics and performed by jun kung best sound design: wang danrong and <mark>zhao nan</mark>, \"detective dee and the mystery of the phantom flame\" best visual effects: lee yong-gi and nam sang-woo, \"detective dee and the mystery of the phantom flame\" best new director: felix chong, \"once a gangster\" best asian film: \"confessions\" (japan) professional achievement: willie chan the posting of advertisements, profanity, or personal attacks is prohibited. by using this web site you agree to accept our report offensive content: if you believe this comment is offensive or violates the cbsnews.com terms of use, you can report it below (this will not automatically remove the comment). once reported, our staff will be notified and the comment will be reviewed. offensive: sexually explicit or offensive language advertisements, commercial links, or repetitive posts disruptive posting: flaming or offending other users illegal activities: promote cracked software, or other illegal content e-mail this comment to a friend. e-mail this to: send me a copy of this message note: your e-mail address is used only to let the recipient know who sent the e-mail and in case of transmission error. neither your address nor the recipients's address will be used for any other purpose. a glimpse at the days news as seen through a camera's lens deadly skin cancer takes on many forms. if anything here looks familiar, get help indio, calif., gets ready for the annual coachella valley music & arts festival, one of the biggest music events of the year 60 minutes ipad app watch segments on demand, browse archives, & get the story behind the story."}]