[{"articleID": "2010022613_00111423_W", "names": {"Rob Smith": ["Q16847100", "Q16931899", "Q17198726", "Q21151369", "Q28868156", "Q3434235", "Q5206244", "Q7340559", "Q7340561", "Q7340562", "Q7340564"]}, "date": "2010-02-26", "url": "http://hertsad.co.uk/content/herts/news/story.aspx?brand=HADOnline&category=News&tBrand=HertsCambsOnline&tCategory=newslatestHAD&itemid=WEED26%20Feb%202010%2011%3A44%3A59%3A010", "content": "search through cars, vans or motorcycles for sale at drive24 earn cashback as you shop online at top retailers. start being paid to shop! browse family notices, leave messages and light candles st albans mp quizzes rail chiegs over rail freight depot plans network rail representatives were floored when st albans mp anne main pressed them on the potential impact of the park street rail freight depot scheme in the house of commons. at a meeting of the all-party parliamentary thameslink group on tuesday, she quizzed a team from network rail on their lack of consideration of the potential impact of the proposed rail freight depot on passenger services. during a lengthy presentation on the future of thameslink, network rail spokesmen graham goodwin and <mark>rob smith</mark> failed to make any reference to the potential impact of complex rail pathings and rail possessions which are expected to result from the park street proposal if it is approved. after the meeting mrs main said: \"i had real concerns that this presentation on the future of thameslink seemed to fall down when it came to questioning. there was a degree of embarrassment when i sought assurances about the potential impact of the park street rail freight proposal on the thameslink programme.\" she pointed out that all the network rail representatives could say was that they needed to talk to their route director and she felt they should have already done so if they were to talk with authority on the delivery of thameslink. seen your photo in the paper or on this website? now you can order your own copy via our new photo ordering site, myphotos24. you can order your photo as a digital image, as a reprint or on a variety of novelty gifts such as mugs, t-shirts, mousemats and jigsaw puzzles. to find your image in myphotos24 just take note of the reference number listed with your photo and type that into the search box. alternatively you can browse through all the photos from a specific week to find extra photos from a story or event. st albans mp quizzes rail chiegs over rail freight depot plans \""}, {"articleID": "2012091900_00035022_W", "names": {"Katie Holmes": ["Q174346", "Q6377464"], "Amy Adams": ["Q4451142", "Q4749062", "Q481832"]}, "date": "2012-09-18", "url": "http://uinterview.com/news/church-of-scientology-responds-to-vanity-fair-accuses-them-of-shoddy-journalism-5453", "content": "tom cruise, <mark>katie holmes</mark> boycotting oscars over anne hathaway's \"snl' skit? <mark>katie holmes</mark> and tom cruise agree on settlement of divorce issues the church of scientology is fighting mad, and they want vanity fair and everyone associated with them to know it. the church has sent an eight-page letter to vanity fair, penned by lawyer jeffrey k. riffer of the law firm elkins kalt weintraud reuben gartside llp, responding to the magazine's october 2012 issue report that scientology leaders david miscavige and his wife shelly miscavige presided over meetings and interviews to find a wife for actor and scientology bigwig tom cruise prior to his marriage to <mark>katie holmes</mark> and following his divorce from nicole kidman. the church of scientology fervidly denies the claims in the article, calling out vanity fair's editor, graydon carter, and the writer of the article, maureen orth.\" we are writing regarding your, your editor's and reporter's shoddy journalism, religious bigotry and potential legal liability arising out of vanity fair's upcoming story about the tom cruise divorce, \"the letter read, according to the hollywood reporter. the letter denied claims made in the article that women were auditioned for the real-life part of cruise's wife and that how i met your mother and iron man actress nazanin boniadi, 32, was chosen for the part, ordered to split from her boyfriend at the time, and groomed for several months before being determined unfit because she reportedly offended the miscaviges.\" significantly, \"went the letter,\" while maureen orth was preparing her story, vanity fair ignored its staff and contributors who have firsthand knowledge of mr. cruise and of mr. miscavige and who would burden her story with the truth. \"the letter went on to accuse everyone associated with the article of\" bigotry and ignorance, \"defending scientology as a new religion that should be extended the courtesy of religious tolerance even more so than beliefs\" of more ancient history. \"in addition, orth's integrity as a journalist was targeted, her article called\" defamatory \"and her\" implications...demonstrably false, \"especially when it came to her portrayal of mr. miscavige. and if you were wondering when the church would get down to the inevitable legal threats, here you have it:\" if vanity fair goes forward with publication of such defamatory allegations, now that it is on notice that the story is false, the stain on its reputation will last long after any reader even remembers the article. the sting of the jury verdict will last longer still; far longer than any pleasure from racing to publish a poorly researched and sourced story. \"vanity fair has since released a statement to cnn saying,\" we absolutely stand by maureen orth's story. paul thomas anderson reveals mysterious trailer for scientology-based \"the master' sneak peek: new joaquin phoenix movie,\" the master,' about scientology? watch: phillip seymour hoffman, joaquin phoenix, <mark>amy adams</mark> in \"the master' trailer bill hader does\" yo gabba gabba' dance for david letterman (video) \"end of watch' premiere: jake gyllenhaal, michael pena hit the red carpet (photos)"}, {"articleID": "2009022519_00055923_W", "names": {"John Lennon": ["Q11979004", "Q6244563"], "Yoko Ono": ["Q11464149", "Q117012", "Q16264827"], "Sian Phillips": ["Q23696704", "Q237778"]}, "date": "2009-02-25", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=17225427&blogId=313631913", "content": "gender: female status: single sign: capricorn city: new york that's wonderful news for those of us who couldn't attend any of the shows. christmas will come early this year! looking forward december 4! rufus is comfortable in his own skin, he glows and he is a perfect role model for any gay artists that need to come out of the closet. be who you are and play what you want to play. i will definately purchase this cd. he was great in santa fe this past summer, just like the other 2 times i saw him perform. right on rufus, love from albuquerque, wish i could go to amsterdam with you and timothy!!! this is very exciting news!!! i was not able to see rufus perform judy, but i look forward to hearing and seeing it now!!!!! i must have it now! 3 copies. 1 for home, 1 for work, 1 for my car. now! now! now! yippee! it was so funny rufus when you played at masonic hall in san francisco. all these old queens were calling out for more judy garland and you said something like \"i'm not doing any more of her songs, she never did mine.\" you looked great on stage and i was in the balcony straight up from your grand. although i love to see you stand at the mic just sining or singing with guitar, when you sit down to the piano that's when i feel the full power of your music. as a straight man who loves gay men, ok i'm bi, i can't tell you how many times you have entered my fantasies. i've been to both concerts. can't wait to get my grubby paws on them. but why wasn't the carnegie gig released on dvd too? i saw sam mendes running up and down the aisles filming the show, and i was hoping that it was this one that was to be released...and it was the whole point of the show to recreate judy's carnegie album...still, both shows were brilliant so it'll all be fantastic as per rufus' usual...to non uk/irish fans...the palladium show was shown on channel 4 recently...i missed it though as i was on holiday...doh! roll on 10th october when i get to see mr w up close again in dublin...faaaaantaaaaastic! if the clip of \"san fransisco\" on youtube is any indication it was a fabulous show and will be equally wonderful on dvd! i can't wait for 1st feb next year for rufus' show in melbourne, but this will help satisfy me for a while! will these be released in australia? or at least will the dvd be multi-region/regionless? i was wondering when something of that sort would come out i can't wait! i almost cried in milwaukee when he did get happy! i said at that moment i was the happiest girl in the world...i love judy garland. i love rufus wainwright. my soul may explode from the beauty of it all! hurray!!! i'm so thrilled! guess what i'm getting as an early christmas present? i'm going to go preorder it right now! i have totally enjoyed his want dvd so am really looking forward to this one! great news - you can see the blog i posted after seeing you in london last month below - unfortunately the photos i took can't be copied here due to html code being disabled. the gay messiah question, - what is the difference between a good and a great concert? for me, a good concert is hearing one of your favourite artistes singing their songs, a great concert is feeling that you've spent 2.5 hours in their company and got to know a bit more about that artist and how they tick, or what their sense of humour is like. rufus wainwright is like a male version of cyndi lauper, in so much as he doesn't shut up when you see him live, he talks between almost every song and he oozes star quality and he is damn funny too. from the moment he bounces on stage and announces in his strong american accent that its \"good to be home\" the audience is in the palm of his hand. he obviously loves london, he tells us how he wants to move here but its too expensive, and he'd need to be a really, really big star and sell thousands and thousands of records to buy a house here, but us coming to see him in concert is one small step in helping him to achieve that goal. he's been touring around the uk for the last month and he says, as good as the audiences have been, he has felt like a big fish in a little town and most people were only there because there wasn't anything else on in town that night to see, in london there's so much happening that he's touched we've come to see him. (these are his words before i get angry comments from the midlands, bronte country or the moors) the show is in two halves, in the first half (stars & stripes outfit - i have pics i'll be adding later) he does nearly all the songs from his latest album, release the stars including tulsa, & sanssouci - plus the art teacher & the song that got me interested in him in the first place cigarettes & chocolate milk (its about the best things being bad for us) this was rufus' introduction to sanssouci, it is a palace in germany built for crown prince frederick, look him up on wikipedia, he ain't pretty - frederick had two rules for sanssouci, it was to be a men only palace and none of the doors were to have locks on them, so that the prince could walk in on his guests as he pleased and order them to do...well, the possibilities are endless really. he introduced tiergarten a beautiful song he'd written about his german boyfriend thus - german rolling stone magazine had an article about musicians and their muses and number one was <mark>john lennon</mark> & <mark>yoko ono</mark>, two was mick jagger & marianne faithful, then at number nine, rufus wainwright and my german boyfriend - the lucky bastard. germany so hard to love, and we hate to love it, its true. on the record between my legs has guest spoken vocals from <mark>sian phillips</mark>, on the tour fans have been asked to submit clips of themselves doing the spoken section to you tube (or was it x tube?) and the best one from each town gets to perform the song on stage with rufus, or as more often is the case, the only entrant from each town. part two of the show had more german references with rufus kitted out in lederhosen (think they're actually from austria) but its very sound of music, part two culminates with ginger dave's fave rufus song 14th street (did think of you dave when it played). rufus then came back in a white toweling dressing gown for an encore of poses before removing the gown to reveal fishnet tights, he proceeded to put on some lippy and high heels for a fabulous and totally camp rendition of judy garland's get happy complete with male dancers [this song alone made it worthwhile for grumpy to have travelled down from birmingham just for the night] before the last song the gay messiah which has one of the best opening lines ever in my opinion, \"he will be re-born, from 1970's porn\" he is a master showman and doesn't just sing his songs, he performs them. he's at hammersmith again tonight and said tomorrow's show will be even better, tonight has been great but the second show is always better - i'm very tempted to find out if that is true. currently listening: want by rufus wainwright waiting for december 4!! also waiting for the sam mendes flick...what's up wuth that one? just going to sit back and let the music make me smile...you're the best, rufus! good luck with the rest of your tour...please come to florida! okay i love rufus and all but i'm starting to wonder if i'll ever be able to relate to his music the way i did with his first couple of albums. as far as this release, i'm not over 60 and i'm not a gay man so i don't appreciate judy the way so many others apparently do. ya she was into gay men - we get it. so now she's an icon/cliche and celebrate the fact she was a negligent mother and serious drug abuser (even if it was pushed on her at first). i still think rufus is a genius but i wish, just once, he would do something a little more mainstream. he's the kind of musician who can do mainstream his own unique way without selling out and fans, both old and new would reward him unlike never before. so even though i love rufus i'm not going to purchase something i know i won't be in to. best of luck with the sales though...i saw you perform this live, you are fabu the show was a riot, you make my heart sing! i'm going to buy it today!!!!!!"}, {"articleID": "2014042305_00054389_W", "names": {"Robin Harris": ["Q21454128", "Q7352456"], "Peter Schmidt": ["Q12331719", "Q1293254", "Q13381961", "Q1665907", "Q2078137", "Q2078139", "Q2078141", "Q2078142", "Q2078146", "Q2078148", "Q27531670", "Q2913063", "Q30066237", "Q47452555", "Q52829079", "Q55741220", "Q57631064", "Q87690"]}, "date": "2014-04-22", "url": "http://www.tuscaloosanews.com/article/20140422/news/140429924", "content": "SEC Commissioner Mike Slive: Leagues, union advocates have common ground Supreme Court upholds Michigan ban on using race as factor in college admissions Indiana Gov. Mike Pence to rally Alabama Republicans at June convention Borrowers told they must immediately repay student loans in full if relative who co-signed dies Supreme Court hears streaming TV case; decision could affect broadcast industry, cloud computing Auburn opts not to appeal Bruce Pearl's show-cause order VIDEO & PHOTOS: Tour new environmental services building West Alabama Food and Wine Festival returns for a second tasting Food and Wine Festival Patrick Sizemore, of Grassroots Wine, pours a sample for <mark>Robin Harris</mark> during the first annual West Alabama Food and Wine Festival hosted at Hotel Capstone Saturday, Mar. 30, 2013. All proceeds from the event go to the West Alabama chapter of the Red Cross. About 10 local restaurants and three different wineries were at the event which was open to the public. (Michelle Lepianka Carter / Tuscaloosa News) Published: Tuesday, April 22, 2014 at 5:00 p.m.. Last Modified: Tuesday, April 22, 2014 at 5:15 p.m.. The event, in its second year, showcases a variety of wines to complement samplings from local restaurants. All proceeds will benefit the American Red Cross West Alabama Chapter's disaster relief services. \"We are excited to bring back the festival for a second year,\" said <mark>Peter Schmidt</mark>, Hotel Capstone director of food and beverage, who spearheaded the development of the festival. \"We got great feedback about last year's event and will have even more restaurants for guests to try.\" Where else in Tuscaloosa can you sample specialties from multiple area restaurants, taste local beer, and try new wines all in one evening? \"Last year's festival attracted about 300 patrons. Tickets are $55 each or $100 per couple and must be purchased in advance. Admission includes a 2014 souvenir wine glass. A limited number of tickets are now available from the American Red Cross West Alabama Chapter, 1622 Lurleen Wallace Blvd., Hudson-Poole Fine Jewelers, 1111 Greensboro Ave., and Spirits Wine Cellar, 4851 Rice Mine Road NE No. 110 at the Shops of Lake Tuscaloosa. online by clicking here. Guests will be able to taste food from Cypress Inn, DePalma's Italian Caf?, Jim 'N Nick's, Epiphany, Evangeline's, Hotel Capstone, Kozy's Restaurant, La Casa Crimson, Mary's Cakes and Pastries, Taziki's Mediterranean Caf?, Tin Top Restaurant and Oyster Bar, Walnut Hill Designs and Wintzell's Oyster House. Spirits Wine Cellar will provide wine pairings from Alabama Crown, Grassroots Wines, International Wines, MBC United/Johnson Brothers and Pinnacle Imports. Druid City Brewery will offer beer. Festival sponsors include BF Goodrich Tires, Townsend Automotive Group and The Tuscaloosa News, Cypress Inn Pavilion, Hudson-Poole Fine Jewelers, Sanford Restaurant Equipment, Special Events: A Game Day Tents Co. and Spirits Wine Cellar. Entomologist Dr. E.O. Wilson donates awards to University of Alabama Future of Alabama-Tennessee game and other rivalries up for vote Navy OKs sleep schedule changes for sailors serving on submarines Entomologist Dr. E.O. Wilson donates awards to University of Alabama Supreme Court hears streaming TV case; decision could affect broadcast industry, cloud computing Borrowers told they must immediately repay student loans in full if relative who co-signed dies Indiana Gov. Mike Pence to rally Alabama Republicans at June convention"}, {"articleID": "2017081720_00160770_W", "names": {"Chris Canty": ["Q3675459", "Q5106084"], "Bill Snyder": ["Q17388778", "Q4910936"], "Patrick Mahomes": ["Q11329045", "Q19667998"], "Tom Hayes": ["Q19668361", "Q21597864", "Q22087172", "Q22945088", "Q3777584", "Q7816126", "Q7816129", "Q7816130", "Q7816131"], "Bruce Weber": ["Q4135170", "Q991871"]}, "date": "2017-08-17", "url": "http://ksn.com/2017/08/17/k-state-hopes-returning-secondary-can-hold-up-in-big-12/", "content": "MANHATTAN, Kan. (AP)--The school that once produced <mark>Chris Canty</mark> and Thorpe Award winner Terence Newman has struggled to defend in recent years in the pass-happy Big 12. It still draws Kansas State coach <mark>Bill Snyder</mark>'s ire. The hard-to-please Hall of Fame coach was often quick to bemoan a bunch that allowed 272.7 yards per game through the air last season, better only than the sieve known as Texas Tech. Their shortcomings were only made worse when they were forced to stand beside by the Wildcats' staunch rush defense, which was by far the best in the Big 12. But the Wildcats harbor hope for success this season. They return D.J. Reed, the league's defensive newcomer of the year, and running mate Duke Shelley at cornerback. Two-year starter Kendall Adams is back to anchor the safety corps, while a host of experience headlined by Cre Moore, Sean Newlan and Denzel Goolsby provide plenty of depth. Throw into the mix Elijah Walker, the third-ranked junior college safety last season, and some think Kansas State could have the best secondary in the Big 12--perhaps even the nation. \"I've seen it all happen, the good and the bad,\" said Shelley, who burned his redshirt as a freshman in 2015 when injuries forced him onto the field. \"Really for us as a unit as well, we went from nobody respecting us to,\" Wow, our unit is getting some love and respect we deserve .' We knew we deserved it. \"Now it's time to keep it. Things started promisingly enough for Kansas State last season, holding Stanford in check in the opener on the road and shutting down Florida Atlantic and Missouri State. But concerns arose when Skylar Howard threw for 298 yards in West Virginia's comeback victory, and they had a full-scale problem the following two games against Texas Tech and Oklahoma. First-round draft pick <mark>Patrick Mahomes</mark> II torched the Wildcats for 504 yards and two touchdowns, while the Sooners' Baker Mayfield had 346 yards and four TDs passing in a 38-17 rout. The key is to prevent a similar downturn this season.\" When you have a decent number of returning starters and returning players, the general public will probably say if you have a lot of people coming back then you will have an even better football team, \"<mark>Snyder</mark> said.\" We were pretty decent at the end of the season last year, so there is great expectation. \"There is nothing wrong with that. That is great,\" he continued. \"The key element is you have to do something about it. You just can't be a returning starter or guy that played an awful lot and the same coaches coming back, etcetera. You have heard me say so many times, every season presents new dynamics.\" One of those dynamics is the schedule. Kansas State opens Sept. 2 against Central Arkansas, then plays Charlotte the following week. It gives the secondary ample opportunity to come together before a trip to Vanderbilt. But the Commodores are no real threat through the air, ranking 100th out of 128 teams in passing offense a year ago. Throw in a week off after the nonconference schedule and the Wildcats should have hit their stride before the Big 12 slate opens with games against Baylor, Texas and TCU. High-powered Oklahoma looms Oct. 21 in a game that could help decide the conference race. \"As long as they keep working, having daily improvement, stay together, play together, we will find replacements for those five or six guys we lost,\" Kansas State defensive coordinator <mark>Tom Hayes</mark> said not only of his secondary but the entire unit. \"It's our job as coaches to identify them and certainly the players' job to go earn them.\" ___ More AP college football: http: //collegefootball.ap.org and https: //twitter.com/AP_Top25 Like this: Like Loading...Related Related Posts Kansas State and Kansas football both land players on preseason watch lists Jesse Ertz receives two more honors heading into 2017 <mark>Bruce Weber</mark> and Kansas State agree on two-year contract extension <mark>Snyder</mark>, Ertz could give K-State another winning combo Advertisement"}, {"articleID": "2018062020_00164441_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-06-20", "url": "https://www.timesofisrael.com/jews-separated-from-families-during-holocaust-condemn-us-border-policy/", "content": "home page JTA--A group representing children hidden during the Holocaust slammed the US border policy of separating families seeking asylum. \"Separation of the family for us is probably the worst thing that ever happened to us,\" said Rachelle Goldstein, who was separated from her parents in Belgium when she wasn't even 3 years old. Goldstein, the co-director of the Hidden Child Foundation, and her husband, Jack, who also was separated from his parents as a child, appear in a video released Tuesday by the Anti-Defamation League. Get The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up The <mark>Trump</mark> administration's policy of separating migrant children from their parents at the southern US border has drawn criticism this week from across the political spectrum. More than 2,300 children have been separated from their parents, according to The New York Times. \"When you take a child away from the parents, from the home, from everything that they know, they are never the same,\" Goldstein said in the video, adding that many children separated from their parents during the Holocaust had still not overcome the trauma. \"Most hidden children are now in their late 70s, 80s, some are even 90, and they still think about it, and it still hurts, it still aches,\" she said. A boy from Honduras is shown being taken into custody by US Border Patrol agents near the US-Mexico Border near Mission, Texas, on June 12, 2018. (John Moore/Getty Images via JTA) The new policy dictates that every migrant who crosses the United States border illegally will be prosecuted and detained. Since children cannot be prosecuted with adults, they are reclassified as unaccompanied minors and taken away. <mark>Trump</mark> administration officials, including Attorney General Jeff Sessions, say it's a necessary measure to enforce border security. Since many of the migrants have ended up in detention centers and temporary shelters, some have compared the policy to Nazi-era actions. Sessions on Tuesday called those comparisons exaggerated. A broad spectrum of Jewish groups have spoken out against the policy, along with many other religious organizations. \"It's wrong, it's wrong,\" Goldstein said. \"How can this happen in the 21st century?\" read more: Jewish Times ADL Anti-Defamation League Holocaust immigration policy Holocaust survivors <mark>Donald Trump</mark> asylum seekers United States Facebook Twitter email Print 0 shares comments"}, {"articleID": "2008121221_00016128_W", "names": {"James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"]}, "date": "2008-12-12", "url": "http://blog.myspace.com/index.cfm?fuseaction=blog.view&friendID=61060408&blogID=455893960", "content": "animated 1. bo makes lists...i wannamake one too 2. i hate self centered people 3. \"yeah she's a hardcore bitch with bad shoes\" 4. \"what the hell is post harcore metal?\" 5. why does she talk so much? 6. asshole father 7. friends mia 8. breakfast at night...in the monring...2. am 9. i need a hug. 10. i need a life. 11. comp paper...complete. 12. finals are a joke...heritage is passing everyone this year. 13. dropouts are lame. 14. it's only ghetto if the trailer floods. 15. sometimes ignorance really is bliss. 16. 15 is a lie...i hate people who don't get it. 17. \"truth be told i miss you, truth be told i'm lying\" 18. i actually really do like my job. 19. college scares me. 20. you should change your name to fake instead of...21. rude people should die. 22. my coffee is cold...ewe. 23. i wish people wouldn't write me off as a bitch before they know me. 24. i wish more people would talk to me. 25. i miss bo. 26. i miss brianna. 27. i miss sarah. 28. i miss mary. 29. i miss kelsey and josh. 30. i miss last year. 31. summer can't come quick enough. 32. krispy kreme has better coffee than starbucks...but krispy kreme doesn't have lattes...aint that a bitch. 33. i just microwaved my coffee 34. this is kind of pointless. 35. too bad i'm too bored to care. 36. if coffee is an addiction i'm not sure i would go to rehab. 37. i love christmas. 38. i love cold weather more than i love warm weather. 39. my feet are cold. 40. high school relationships are stupid. 41. you can't always get what you want...is playing 42. my favorite twilight character besides the obvious is jasper. mostly because he has a cool name...and while playing disney trivia with amanda the answer is always jasper...or 42. 43. the irony of the above statement since it was not planned. 44. i still hate a certain someone...because i fell so hard...and you didn't care. 45. i think a certain level of maturity should be tested before people can graduate high school. 46. there is a difference between cute immaturity and falt out annoying immaturity. 47. i wish i had the patience people seem to think i have. 48. i kind of wish i had diana's confrontational side. there are some bitches i'd love to call out. 49. i miss diana and lindsay. 50. i need a new car. 51. maybe tina will give me more hours so i can get a new car. 52. maybe an suv will fall from the sky with a note that says merry christmas hayley! 53. my imagination gets out of hand sometimes. 54. next semesters gonna be a breeze. 55. i secretly want to be the first one to take off at the red light. 56. i deny it every time though. 57. if i ever direct a movie...johnny depp will be my leading man...even if he's 80 in a wheelchair and balding. 58. mafia...wtf...59. add. most definately. 60. my spelling abilities suck just about as much as......'s personality. (censored for my good nature...and fear for my life .) 61. crazy bitch. 62. hate is a strong word but i really really really really really don't like you. 63. i was late to french class yesterday...mrs. caux is such a push over...i didn't even get in trouble. poor mrs. caux. 64. my mom just called me. 65. the background pic on my phones cracks me up every time. 66. i'm really really lame. 67. but i'd like to think its a cool lame. 68. this is still pointless...but i can't control the urge to keep going. 69. if i could be any animal in the world i would be a zorse...because how many of those are really running around? exactly. 70. and still kickin' 71. if i could be any album i would be from under the cork tree. 72. fall out boy use to be my favorite band...now i don't care. 73. avenged sevenfold may have bad morals but sometimes they get it right which is all that really matters. 74. if my chemical romance didn't exsist...i wouldn't have a theme song. 75. i wannawrite gossipe magazines. 76. i don't think anyone would read them. 77. shhh. be quiet you might piss somebody off. 78. i could shake the shit out of you to make you see the truth but it wouldn't do any good, you'd twist it and make it as ugly as you really are. beauty is only skin deep...and your's doesn't even go that far now. 79. i feel vicious today. 80. i'm a pansy. 81. it's just a shout away. 82. if i had a dollar for everytime you talk about him i'd be driving a bentley and wearing diamonds from my head to my toes. 83. changing yourself for someone else just shows your true character...or lack there of. 84. if i'm talking shit then what the hell are you talking? 85. actually talking shit would mean lying. i don't lie...i can't lie when everyone knows the truth. 86. two blogs in one day. that's got to mean something. like lack of a real life. 87. i wish someone would teach me how to play my guitar. 88. actually i wish someone would care. i wish someone would listen. 89. i'd like to write the definition of trust on your forehead and make sure you always had a mirror in front of you. 90. i'd like to write the definition of fake on your forehead and make sure you always had a mirror in front of you. you'd probably be too busy starring at yourself to remember how to read though. 91. this whole deca reapplying thing is probably going to come back and slap me in the face. 92. rob zombie...hell yeah. 93. amazing because it is 94. censorship was created by desperate housewives who never want their children to leave them. 95. what if i'm not the hero...what if i'm the bad guy. 96. \"hey <mark>james bond</mark>... in american we drive on the right side of the road. that means get the hell over!\" i have serious road rage issues. 97. some days i feel like a little kid. other days i feel 17 going on 30."}, {"articleID": "2017072023_00004708_W", "names": {"Sean Sullivan": ["Q224496", "Q28871822", "Q3476780", "Q55361114", "Q7441461", "Q7441462", "Q7441463"]}, "date": "2017-07-20", "url": "http://local15tv.com/news/local/president-slams-attorney-general-jeff-sessions", "content": "President slams Attorney General Jeff Sessions by Andrea Ramey Sessions was the first U.S. Senator to support Trump during the campaign and remained loyal throughout. (WPMI) A A MOBILE, Ala. (WPMI)--President Trump was highly critical of Attorney General Jeff Sessions in a New York Times interview Wednesday, saying he would not have picked Sessions as his Attorney General. \"Sessions never should've recused himself. He should've told me before he took the job, and I would've picked somebody else.\" Trump said it was \"unfair\" for Sessions to rescue himself from the Russia investigation, which led to special counsel being appointed. In a news conference this morning, Sessions said he's staying put. . \"I have the honor of serving as Attorney General. We love this job. We love this department, and I plan to continue to do so as long as that is appropriate,\" said Sessions. \"For Trump to turn around and stab Sessions in the back like this unconscionable,\" said conservative columnist Quin Hillyer. Sessions was the first U.S. Senator to support Trump during the campaign and remained loyal throughout. The President's remarks rebuked by conservatives in Sessions home state, where he remains a popular figure. \"If Trump fires Jeff Sessions, then that means the only person left who Trump will not show loyalty to is Vladimir Putin,\" said Hillyer. The phone lines also lighting up on local conservative talk radio. \"Trump shouldn't have thrown him under the bus.\" said a caller on FM Talk 106.5 Midday Mobile. \"You're telling me the recusal, which was the right thing to do, brought the problem? Come on, give me a break!\" said host <mark>Sean Sullivan</mark>. In the special election to fill Sessions seat, Republicans have aligned themselves with Trump, some attacking each other for not being loyal enough. Rep. Mo Brooks, who has been on the receiving end of those attack ads said today, he understands President Trump's position but says Sessions \"did the right thing\" and is \"a person of the highest caliber.\" close"}, {"articleID": "2017111614_00955849_W", "names": {"John Gruden": ["Q365882", "Q6379151"], "Scott Frost": ["Q2018023", "Q7436370"], "Aaron Hayden": ["Q20807778", "Q4662083"], "John Currie": ["Q16241256", "Q43910622", "Q6227942", "Q6227944"]}, "date": "2017-11-16", "url": "http://www.knoxnews.com/story/sports/college/university-of-tennessee/football/2017/11/16/grumor-mill-full-swing-jon-gruden-ut-vols-coaching-search-unfolds/868121001/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest Grumor mill in full swing about Jon Gruden as UT Vols' coaching search unfolds Tennessee finds itself in a football coaching search for the fourth time in the past 10 years, which means the Grumor mill is in full swing. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CLOSE Former Tampa Bay Buccaneers head coach Jon Gruden told ESPN's Mike and Mike that he would never rule out a return to coaching but has not engaged in any talks with teams. Time CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Tennessee finds itself in a football coaching search for the fourth time in the past 10 years, which means the Grumor mill is in full swing. Former NFL coach Jon Gruden has been atop the wish list of some Vol fans for many years, so much so that rumors associated with <mark>Gruden</mark> and Tennessee have received their own moniker: Grumors. Former UT players caused a stir on Wednesday with possibly some subtle hints on Twitter. More: UPDATE: UT Vols coaching search: Here's what we know, including Grumors More: Butch Jones' replacement as Tennessee football coach: 15 names from <mark>Gruden</mark> to Gundy More: Why not Jon Gruden? Or Dan Mullen? Or <mark>Scott Frost</mark>? Here is a sample. UT's Hire is better than the Florida Haters! Just watch??!--<mark>Aaron Hayden</mark> (@ Ran4UT) November 16, 2017 <mark>Gruden</mark> update: their is actually strong interest in being our next head coach (confirmed source) and there is a number out there that is around $10 million a year (unconfirmed). JG YOU CAN MAKE TENNESSEE GREAT AGAIN!!! I'm behind you 1,000,000% #VFL--Albert Haynesworth (@ haynesworthiii) November 15, 2017 Thinking about coming out of retirement!???? ‍ ♂ ️???? ‍ ♂ ️???? ‍ ♂ ️ pic.twitter.com/kdGs56vIg3--JJ McCleskey (@ JJMcCleskey) November 15, 2017 Do the Vols have a chance of landing their white whale this year? It's certainly a topic of conversation. <mark>Gruden</mark>, when asked about the Tennessee opening on ESPN's \"Mike & Mike\" on Wednesday morning, said \"You never say never to nothing.\" We couldn't have one last visit with Jon Gruden without addressing the latest \"returning to coaching rumors.\" #Vols pic.twitter.com/arlp9Its7a--Mike & Mike (@ MikeAndMike) November 15, 2017 The Chattanooga Times Free Press, citing sources, reported on Wednesday that <mark>Gruden</mark> has contacted some college assistants to gauge their interest in possibly joining him on a coaching staff. Blackburn says <mark>Gruden</mark> still a viable option to coach Vols, says <mark>Gruden</mark> would listen to offer https: //t.co/xEbEzrQIuT via @ timesfreepress--Stephen Hargis (@ StephenHargis) November 15, 2017 Paul Finebaum, of the SEC Network and ESPN, said on his radio show Tuesday that one source close to <mark>Gruden</mark> told him that <mark>Gruden</mark> is not coming to Tennessee. Are the #Grumors real? @ StephenHargis has a fascinating report that gives <mark>John Gruden</mark> a 50/50 shot of ending up in Knoxville. Listen to the full interview: https: //t.co/odhmlzOIEB https: //t.co/CIWPp5vpVk--Paul Finebaum (@ finebaum) November 16, 2017 Footballscoop.com, which monitors coaching moves, addressed the Grumors on Tuesday with a report that stated \"<mark>Gruden</mark> has no interest in being the next coach at Tennessee.\" Vols athletic director <mark>John Currie</mark> was asked specifically about <mark>Gruden</mark> on Sunday. <mark>Currie</mark> is spearheading the search for Butch Jones' replacement. \"One of the things that's most important for me to do is not add to misinformation, so I will not be making any comments or responses to specific candidates or specific rumors,\" <mark>Currie</mark> said. <mark>Gruden</mark>, who coached in the NFL at Oakland and Tampa Bay, is an ESPN analyst. <mark>Gruden</mark> last coached in 2008. He's been the color analyst for \"Monday Night Football\" since 2009. <mark>Gruden</mark>'s coaching career started as a graduate assistant at Tennessee in the 1980s. <mark>Gruden</mark>'s wife, Cindy, is a native of East Tennessee and a Tennessee alumna. She was a cheerleader at UT. Their son is a current Tennessee student. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE"}, {"articleID": "2014051509_00012859_W", "names": {"Gary Green": ["Q1348874", "Q42422013", "Q5525162", "Q5525163", "Q5525164", "Q5525165", "Q5525167", "Q58756268"], "Jose Fernandez": ["Q2052820", "Q21006773", "Q57192176", "Q6292174", "Q705656"], "Matt Harvey": ["Q3299470", "Q6788770"]}, "date": "2014-05-15", "url": "http://www.newsday.com/sports/baseball/high-incidence-of-pitchers-having-tommy-john-surgery-concerns-mlb-1.8025893", "content": "15 m ago In Nassau road construction. right lane closed on Meadowbrook Pkwy SB between The Northern State Pkwy and Old Country Rd/M1 In Nassau road construction. right lane closed on Meadowbrook Pkwy SB between The Northern State Pkwy and Old Country Rd/M1 16 m ago Closed due to road construction on Seaford-Oyster Bay Expwy/Rt -135 SB between Powell Ave/X8 and Merrick Rd/X1 in Nassau Pin It High incidence of pitchers having Tommy John surgery concerns MLB Published: May 14, 2014 8:04 PM By Major League Baseball has been discussing the high incidence of pitchers undergoing Tommy John surgery, a person familiar with the issue said Wednesday, and it has become Topic A for Dr. <mark>Gary Green</mark>, baseball's medical director. Miami Marlins ace <mark>Jose Fernandez</mark> could become the 18th player this season--17 are pitchers--requiring reconstruction of his elbow because of a tear in the ulnar collateral ligament. The Yankees' Ivan Nova recently had the procedure and Mets righthander <mark>Matt Harvey</mark> is recovering from the surgery performed last November. \"It's certainly something that is happening with increasing frequency and [has] much more focus on it by clubs, media, fans,\" said a participant at the quarterly meetings at MLB headquarters in Manhattan. \"How this impacts drafts, signings, use of pitchers in player development and major leagues are issues every club now looks at differently than in the past.\" <mark>Green</mark>, an internist at Ronald Reagan UCLA Medical Center, said, \"This has been a research priority for us. We certainly recognize that something is happening to a quarter of our pitchers. It's something that we've had our attention on for several years. And we're actively researching this and we're going to continue doing that regardless of whether or not this is a spike this year.\" It's clearly a problem. This is a research priority and the commissioner has talked to me and conveyed his concern. And they said whatever resources you need to bring for people to bring in to look at this, you have whatever you need. \"There is a theory that the damage is the result of over-usage and that it largely affects hard throwers.\" It's a little premature, but overall I would probably agree with that, \"<mark>Green</mark> said.\" That's why we are researching this because we don't have a good answer. The thing that I would caution against is that while everybody maybe has a torn ligament, how they get there may differ. We may be saying the ulnar collateral tear is [the] end point--it could be from multiple problems. \"Joe Torre, MLB's executive vice president of baseball operations, believes the problem lies beyond merely saying it is endemic to power pitchers.\" Tommy John didn't throw hard, \"he said of the first pitcher to have the surgery in 1974. <mark>Green</mark> said,\" Even though we know that there are now more pitchers throwing at a higher velocity that they used to, that could be an association, not a causation. That's why we're doing research to find the causation rather than just things that could be associated with it. Everyone can speculate. Until we get some better answers, everybody has different opinions. \"<mark>Green</mark> could not put a time frame on finding a solution, saying,\" I've been asked that a lot. That's not how research works. You can have a breakthrough and then you find something and sometimes that raises three more questions. I really couldn't put a timetable on it. I would love to be able to, but you have complex problems that have complex answers. \""}]