[{"articleID": "2017120117_00733484_W", "names": {"Carlos Queiroz": ["Q313209", "Q9697298"]}, "date": "2017-12-01", "url": "http://alpha.supersport.com/football/fifa-world-cup-2018/news/171201/Portugal_clash_concerns_Spain_boss", "content": "Portugal clash concerns Spain boss 01 December 2017, 19:44 Tweet Spain coach Julen Lopetegui believes an enticing clash with European champions Portugal, led by World Player of the Year Cristiano Ronaldo, to start their World Cup campaign leaves the 2010 champions with little room for error in Russia. The Iberian neighbours will be favourites to progress from Group B after also being paired with Morocco and Iran in Friday's draw in Moscow, but they face each other first up in Sochi on June 15. Real Madrid's Ronaldo is just one of a number of Portugal's top players who ply their trade in Spain, but Lopetegui was keener to point to the overall qualities Portugal showed in claiming their first major trophy at Euro 2016 just 18 months ago. \"Straight away it isn't the time to talk about individuals,\" Lopetegui told Spanish TV station Cuatro. \"Portugal have won an important title and, moreover, very recently. They are the champions of Europe, they have fantastic players and we are talking about the highest level.\" Indeed, Portugal survived without an injured Ronaldo for the vast majority of the Euro 2016 final to shock hosts France thanks to an extra-time goal from Eder. However, Portugal have failed to beat Spain in seven previous meetings at major tournaments, including as the Spanish went on to lift their only World Cup in South Africa in 2010. \"What matters to us is to play a great game when the time comes and to be capable of beating them,\" added Lopetegui. \"The rest is history.\" Lopetegui was at least happy with Spain's draw in terms of logistics with their expected base in Krasnodar just a half an hour flight away from Sochi before facing Iran in Kazan and Morocco in Kaliningrad. \"Until it is official I can't say anything, but it is more than probable the base will be (Krasnodar),\" he added. \"Knowing the distances there could be in Russia, it is quite balanced.\" Iran's Portuguese coach <mark>Carlos Queiroz</mark>, who also had a brief spell in charge at Real Madrid, was more enthusiastic as he claimed he couldn't have wished for a better draw. \"Personally I am very happy because it is a group with two teams from two very special places for me,\" said <mark>Queiroz</mark>. \"It will be a very tough competition for us, it would have been no matter what group we were in, but when you are with Spain, a World Cup winner, and Portugal, European champions, it couldn't be better for me.\" © AFP"}, {"articleID": "2019101700_00069224_W", "names": {"Pat Day": ["Q6813952", "Q7143355"], "Joe Higgins": ["Q1389005", "Q6210320"], "Frank Bruno": ["Q530220", "Q5485522"], "Sergio Mora": ["Q2036108", "Q25238177", "Q7454332"]}, "date": "2019-10-16", "url": "https://www.northernstar.com.au/news/boxer-dead-at-27-after-horror-punch/3856318/", "content": "Boxing Boxer dead at 27 after horror punch 17th Oct 2019 10:05 AM 0 Young boxing star Patrick <mark>Day</mark> has died from the injuries he suffered in a welterweight bout in Chicago last weekend. He was 27. <mark>Day</mark> was knocked out by a left hook against Charles Conwell and was motionless in the ring when the fight was stopped. He had to be taken out of the ring on a stretcher and was immediately transported to hospital where he was placed in a coma. \"Patrick <mark>Day</mark> passed away today, October 16, 2019, succumbing to the traumatic brain injury he suffered in his fight this past Saturday, October 12, at the Wintrust Arena in Chicago, IL,\" promoter Lou DiBella announced in a statement. \"He was surrounded by his family, close friends and members of his boxing team, including his mentor, friend and trainer <mark>Joe Higgins</mark>. On behalf of Patrick's family, team, and those closest to him, we are grateful for the prayers, expressions of support and outpouring of love for <mark>Pat</mark> that have been so obvious since his injury.\" <mark>Day</mark> (17-4-1) was a highly-decorated amateur who turned professional in 2013 and was a fixture in the boxing community in New York City. \"Patrick <mark>Day</mark> didn't need to box,\" DiBella said. \"He came from a good family, he was smart, educated, had good values and had other avenues available to him to earn a living. He chose to box, knowing the inherent risks that every fighter faces when he or she walks into a boxing ring. Boxing is what <mark>Pat</mark> loved to do. It's how he inspired people and it was something that made him feel alive.\" It becomes very difficult to explain away or justify the dangers of boxing at a time like this. This is not a time where edicts or pronouncements are appropriate, or the answers are readily available. \"It is, however, a time for a call to action. While we don't have the answers, we certainly know many of the questions, have the means to answer them, and have the opportunity to respond responsibly and accordingly and make boxing safer for all who participate. This is a way we can honor the legacy of <mark>Pat Day</mark>.\" Many people live much longer than Patrick's 27 years, wondering if they made a difference or positively affected their world. This was not the case for Patrick <mark>Day</mark> when he left us. Rest in peace and power, <mark>Pat</mark>, with the angels. \"Charles Conwell (right) lands a punch on Patrick <mark>Day</mark>. (Photo by Dylan Buell/Getty Images) Conwell wrote a heartbreaking letter to his opponent this week.\" Dear Patrick <mark>Day</mark>, \"Conwell started the letter, which he shared on Twitter.\" I never meant for this to happen to you. All I wanted to do was win. If I could take it all back, I would. \"No one deserves this to happen to them. I replay the fight over and over in my head thinking what if this never happened and why did it happen to you.\" \"I can't stop thinking about it myself. I prayed for you so many times and shed so many tears because I couldn't even imagine how my family and friends would feel.\" I see you everywhere you go and all I hear is wonderful things about you. I thought about quitting boxing, but I know that's not what you would want. \"I know that you were a fighter at heart so I decided not to, and to fight and win a world title because that's what you wanted and that's what I want so I will use you as motivation every <mark>day</mark> and make sure I leave it all in the ring every time. With compassion, Charles Conwell.\" <mark>Day</mark>'s coach, Joseph <mark>Higgins</mark>, replied to Conwell's message to declare there were no hard feelings about <mark>Day</mark>'s injuries. \"I just wanted you to know that we do understand what you must be going thru as well,\" <mark>Higgins</mark> said. \"As devastated as we are, we realise you are equally devastated. We know if it was the other way around, we would be just as distraught.\" Thank you for your kind words. Patrick was born across the street from me, so our relationship is special. He would have wanted you to continue. \"I'm rooting for you to reach your dream, the same one he had. God Bless your Team and we will keep you in our prayers as well. I too am distraught because I feel responsible but do realise there is no fault. Stay strong and please don't think we blame you.\" There's been an outpouring of emotion from the boxing community. This is very sobering. Sadly, Patrick <mark>Day</mark> has lost his toughest fight. Like every man who climbs through the ropes chasing the glory, he risked it all. My thoughts & condolences are with his friends and family at this very tough time. May he rest in eternal peace .--<mark>Frank Bruno</mark> MBE???? (@ frankbrunoboxer) October 16, 2019 Devastated to hear the news of the passing of Patrick <mark>Day</mark>. I met him for the first time last Thursday, what a charming young man with a dream and a smile that lit up the room. Our deepest prayers are with his family, his trainer <mark>Joe Higgins</mark>, Charles Conwell and promoter Lou DiBella??--Eddie Hearn (@ EddieHearn) October 16, 2019 Gutted to hear about Patrick <mark>Day</mark>! Another young man loses his life in a boxing ring. Thought & Prayers with his family at this tragic time. RIP Patrick ❤ ️--matthew macklin (@ mattmacklin) October 16, 2019 Terrible to hear about the passing of Patrick <mark>Day</mark>. Rest In Peace .????--<mark>Sergio Mora</mark> (@ TheLatinSnake_) October 16, 2019 More Stories premium_icon Pill testing will save lives. It must start now premium_icon Aussie to pay \"blood money' to victim's family More Stories premium_icon Pill testing will save lives. It must start now premium_icon Aussie to pay\" blood money' to victim's family 0 boxing Read More Login to follow editors picks Read More Login to follow fatal punch Read More Login to follow patrick <mark>day</mark> Read More Login to follow boxing editors picks fatal punch patrick <mark>day</mark>"}, {"articleID": "2017050606_00261055_W", "names": {"Tony Clark": ["Q11321326", "Q20630841", "Q21280433", "Q7822067", "Q7822069", "Q7822070"]}, "date": "2017-05-06", "url": "http://www.hudsonhubtimes.com/entertainment/2017/05/04/cedar-point-adds-metal-detectors", "content": "Search Cedar Point adds metal detectors Officials say amusement park goers can expect a slightly longer wait time to pass through the new Published: May 4, 2017 3:00 AM 1 of 1 Photos | View More Photos SANDUSKY (AP)--Amusement park visitors to the \"Roller Coaster Capital of the World\" can expect slightly longer wait times to pass through new metal detectors. The parent firm of Cedar Point added another level of security to all of its parks. Cedar Point spokesman <mark>Tony Clark</mark> said the process for passing through metal detectors should go quickly. Cedar Point will open Saturday with a newly expanded water park called Cedar Point Shores. It has the second most roller coasters in the world behind Six Flags Magic Mountain in Clarita, California. Cedar Fair L.P. operates 11 amusement parks in the U.S., including Knott's Berry Farm in California and Dorney Park & Wildwater Kingdom in Pennsylvania. Rate this article"}, {"articleID": "2014082612_00000533_W", "names": {"James Foley": ["Q1680393", "Q17562199", "Q721389"]}, "date": "2014-08-26", "url": "http://kfbb.com/story/26367375/ap-sources-us-surveillance-planes-fly-over-syria", "content": "AP sources: US surveillance planes fly over Syria By JULIE PACE AP White House Correspondent WASHINGTON (AP) - The U.S. has begun surveillance flights over Syria after President Barack Obama gave the OK, a move that could pave the way for airstrikes against Islamic State militant targets there, U.S. officials said. While the White House says Obama has not approved military action inside Syria, additional intelligence on the militants would likely be necessary before he could take that step. Pentagon officials have been drafting potential options for the president, including airstrikes. One official said the administration has a need for reliable intelligence from Syria and called the surveillance flights an important avenue for obtaining data. Two U.S. officials said Monday that Obama had approved the flights, while another U.S. official said early Tuesday that they had begun. The officials were not authorized to discuss the matter by name, and spoke only on condition of anonymity. The U.S. began launching strikes against the Islamic State inside Iraq earlier this month, with Obama citing the threat to American personnel in the country and a humanitarian crisis in the north as his rationale. Top Pentagon officials have said the only way the threat from the militants can be fully eliminated is to go after the group inside neighboring Syria as well. Obama has long resisted taking military action in Syria, a step that would plunge the U.S. into a country ravaged by an intractable civil war. However, the president's calculus appears to have shifted since the Islamic State announced last week that it had murdered American journalist <mark>James Foley</mark>, who was held hostage in Syria. The group is also threatening to kill other U.S. citizens being held by the extremists in Syria. White House spokesman Josh Earnest said Monday that Obama has demonstrated his willingness to order military action when necessary to protect American citizens. \"That is true without regard to international boundaries,\" he said. The White House would not comment on Obama's decision to authorize surveillance flights over Syria. \"We're not going to comment on intelligence or operational issues, but as we've been saying, we'll use all the tools at our disposal,\" said Caitlin Hayden, spokeswoman for the White House National Security Council. The U.S. had already stepped up its air surveillance of the Islamic State inside Iraq earlier this year as Obama began considering the prospect of airstrikes there. And the administration has run some surveillance missions over Syria, including ahead of an attempted mission to rescue <mark>Foley</mark> and other U.S. hostages earlier this summer. The U.S. special forces who were sent into Syria to carry out the rescue mission did not find the hostages at the location where the military thought they were being held. Officials who confirmed the failed rescue last week said the U.S. was continuing to seek out intelligence on the other hostages' whereabouts. Administration officials have said a concern for Obama in seeking to take out the Islamic State inside Syria is the prospect that such a move could unintentionally help embattled Syrian President Bashar Assad. A top Syrian official said Monday any U.S. airstrikes without consent from Syria would be considered an aggression. The Islamic State is among the groups seeking Assad's ouster, along with rebel forces aided by the U.S.. The White House on Monday tried to tamp down the notion that action against the Islamic State could bolster Assad, with Earnest saying, \"We're not interested in trying to help the Assad regime.\" However, he acknowledged that \"there are a lot of cross pressures here.\" ___ Associated Press writer Lolita C. Baldor in Kabul, Afghanistan, contributed to this report."}, {"articleID": "2014061923_00002848_W", "names": {"Thomas Walther": ["Q17127701", "Q30123161", "Q54900694", "Q55382753", "Q7794873"]}, "date": "2014-06-19", "url": "http://foxnews.com/us/2014/06/19/pennsylvania-man-8-arrested-on-charges-nazi-atrocities/?intcmp=latestnews", "content": "This undated photo shows Johann \"Hans\" Breyer, arrested Tuesday on charges of aided and abetting Nazi crimes against humanity (MyFoxPhilly.com) An 89-year-old Philadelphia man has been ordered held without bail after his arrest on charges of aiding and abetting the deaths of 216,000 Jewish men, women, and children during his time as a guard at the notorious Nazi death camp Auschwitz. Johann \"Hans\" Breyer, a retired toolmaker, was arrested Tuesday outside his home in Northeast Philadelphia. He spent the night in custody and appeared frail during a detention hearing in federal court, wearing an olive green prison jumpsuit and carrying a cane. ADVERTISEMENT Legal filings unsealed Wednesday in the U.S. indicate the district court in Weiden, Germany, issued a warrant for Breyer's arrest the day before, charging him with 158 counts of complicity in the commission of murder. Each count represents a trainload of Nazi prisoners from Hungary, Germany and Czechoslovakia who were killed at Auschwitz-Birkenau between May 1944 and October 1944, the documents said. \"There was a heightened execution of Jewish deportees brought to the camp,\" Assistant U.S. Attorney Andrea Foulkes told WTXF. \"Most of them were women, children and people with illness.\" Prosecutors say that Breyer, 18 at the time, served in the so-called Death's Head Guard Battalion at the camp. Attorney Dennis Boyle argued his client is too infirm to be detained pending a hearing on his possible extradition to Germany. Breyer has mild dementia and heart issues and has previously suffered strokes, Boyle said. \"Mr. Breyer is not a threat to anyone,\" said Boyle. \"He's not a flight risk.\" But Magistrate Judge Timothy Rice ruled the detention center was equipped to care for Breyer, who appeared to comprehend questions about the nature of the hearing. Breyer has admitted he was a guard at Auschwitz in occupied Poland during World War II, but has told The Associated Press he was stationed outside of the Auschwitz-Birkenau death camp part of the complex and had nothing to do with the wholesale slaughter of about 1.5 million Jews and others behind the gates. <mark>Thomas Walther</mark>, a former federal prosecutor with the special office that investigates Nazi war crimes in Germany, now represents family members of some of Breyer's alleged victims as co-plaintiffs in the case. He called for a speedy extradition. \"The German court has to find late justice for the crimes of Breyer and for the victims and their sons and daughters as co-plaintiffs,\" <mark>Walther</mark> wrote in an email to the AP. \"It is late, but not too late.\" Prosecutors in Weiden could not be reached for comment Wednesday. Their investigation comes after years of failed U.S. efforts to have Breyer stripped of his American citizenship and deported. A court ruling in 2003 allowed him to stay in the United States, mainly on the grounds that he had joined the SS as a minor and could therefore not be held legally responsible for participation in it. His American citizenship stems from the fact his mother was born in the U.S.; she later moved to Europe, where Breyer was born. During Breyer's arrest Tuesday, he asked the marshals to retrieve papers in his home that document his right to stay in the U.S., Donnelly testified. Breyer's wife and two grandsons attended the hour-long hearing in Philadelphia on Wednesday. His extradition hearing was scheduled for Aug. 21. Efraim Zuroff, the head Nazi hunter at the Simon Wiesenthal Center in Jerusalem, said he hoped there would be no obstacles to Breyer's extradition and trial overseas. \"Germany deserves credit for doing this - for extending and expanding their efforts and, in a sense, making a final attempt to maximize the prosecution of Holocaust perpetrators,\" he said in a telephone interview from Jerusalem. 1 89-year-old man arrested on charges of aiding Nazi atrocities 2 Remains of 17 service members recovered from decades-old Alaska Globemaster crash 3 Sex offender apprehended with girl, 16, after high-speed chase 4 Oregon cat braves coyote country to make way to old home Should I Put My Vacation on a Credit Card? Refinance Into a 15-year Mortgage and Save"}, {"articleID": "2016081402_00697440_W", "names": {"Jeff Locke": ["Q12118813", "Q3176534"], "Josh Fields": ["Q3185962", "Q6288855"], "Eric Fryer": ["Q3056272", "Q5386537"], "Adam Berry": ["Q23542551", "Q348765", "Q39073627"]}, "date": "2016-08-13", "url": "http://mlb.mlb.com/news/article/pit/pirates-miss-out-on-several-offensive-chances?ymd=20160813&content_id=195434476&vkey=news_pit", "content": "Full Game Coverage \"They were out there. We couldn't get them in,\" manager Clint Hurdle said. \"I don't think we were trying to do anything but fight, scratch, claw our way back into the game.\" Gerrit Cole allowed a career-high 12 hits, the defense committed three errors--two of them by Jung Ho Kang on one play--and their pitching staff didn't put a zero on the scoreboard until <mark>Jeff Locke</mark>'s scoreless seventh. Still, the Pirates had plenty of chances to win and solidify their standing in the National League Wild Card race. They totaled 10 hits and 11 walks. They batted with the bases loaded six times, five of them in the first two innings and three of them against a starter, Brandon McCarthy, with wayward command. John Jaso walked with the bases loaded in the first, and Gregory Polanco did so to drive in another run in the second. But they could have used a hit or two in the middle of one of those rallies. Marte scores in the 1st PIT @ LAD: Marte opens the scoring on Jaso's walk Starling Marte crosses home for the first run of the game on John Jaso's walk, giving the Pirates an early 1-0 lead in the 1st \"A ball in the gap would have been nice. We didn't get it,\" Hurdle said. \"We got a couple walks, plated a couple runs, kept stretching things out. We just weren't able to score.\" The Pirates stranded 18 runners for just the third in a nine-inning game. The others were not exactly recent history: June 5, 1951, against the Boston Braves; and Sept. 8, 1905, against the Reds. Kang recorded their lone hit with men in scoring position, a second-inning RBI single off reliever <mark>Josh Fields</mark>. The Pirates didn't score again until the eighth, when Kang went deep for the first time since June 24, ending the longest homerless drought of his two-year career. \"He wasn't chasing. He stayed stubborn with his approach,\" Hurdle said of Kang, who reached base a season-high four times. \"That can be the start of something good, something real good.\" Kang's solo tater PIT @ LAD: Kang connects for a solo homer to left Jung Ho Kang narrows the Pirates' deficit to 8-4 in the 8th, as he clubs his 12th long ball of the season to left field The Pirates became the fourth team this season to rack up double-digit hits and walks and lose. Still, they had a chance in the ninth. Josh Harrison walked with one out, and <mark>Eric Fryer</mark> drew a two-out walk. The save situation led the Dodgers to call on closer Kenley Jansen, who struck out Polanco to strand runners Nos. 17 and 18. \"I spent eight years [coaching and managing] at Coors Field, so this really doesn't wrinkle me too much. We saw a lot of games at Coors Field. There's a lot of baserunners,\" Hurdle said. \"But this is somewhat of an outlier here, there's no doubt. It's a park that's seen a lot of good pitching, a lot of low-scoring games. There was a lot of traffic out there.\" <mark>Adam Berry</mark> has covered the Pirates for MLB.com since 2015. Follow him on Twitter at. This story was not subject to the approval of Major League Baseball or its clubs. @ adamdberry Share This"}, {"articleID": "2016082222_00306208_W", "names": {"King Khan": ["Q6411794", "Q9535"], "Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"]}, "date": "2016-08-23", "url": "http://www.indiaglitz.com/srk-shares-on-location-pic-from-dear-zindagi-hindi-news-165605.html", "content": "Jacqueline Fernandez keen to work with SRK, Aamir Khan Shah Rukh <mark>Khan</mark> recently shared an on-location pic from his much talked film by <mark>Imtiaz Ali</mark>, \"Dear Zindagi'. The <mark>King Khan</mark> is seen with a red flag against the backdrop of a beautiful tower, apparently a bridge. Sharing the pic on Instagram, SRK wrote,\" <mark>Imtiaz</mark> said I could post this picture from the sets...& promised there will be some close ups of me in the film too! \""}, {"articleID": "2010012206_00104826_W", "names": {"John Paul": ["Q1701359", "Q6252169"]}, "date": "2010-01-22", "url": "http://kansas.com/news/story/1147542.html", "content": "gift of 21 new pianos to wsu benefits music majors the wichita eagle this is not the age of pianos. this is the age of the economic meltdown, recession, shrinking retirement savings, catastrophic budget cuts and government bailouts, followed by public outrage at bailouts. pianos? no. but at the music department at wichita state university on thursday, the piano fleet arrived. ten new yamaha p22s. music students and teachers stared at them happily. sterling gray, a guitarist and a teacher, caressed the keys. \"this is so great,\" he said. at a time when education budgets are being gutted, a time when pianos look like quaint luxuries, a group of small-gift donors banded together in the past three years. they bought or pledged to buy 21 new yamaha pianos to replace 26 exhausted, half-century-old pianos in the music department at wsu that have been played morning, noon and night since the 1950s. they hope to replace the other five played-out pianos soon. how they did it and why is a story that ought to have a soundtrack put to it. about three years ago, wsu music alums including denny senseney - a tuba player who had to play those old pianos in duerksen fine arts center to get his music degree back in the 1960s - found out that the 26 pianos were wearing out; it was embarrassing how sour they sounded. there are 350 music students there now; semester after semester every student had to play to pass. even if they played tuba, they had to take piano classes to get their music degrees. they played beethoven and gershwin to pass, played beatles for pleasure; they played all day and night, hundreds of students every semester going into soundproof rooms and stroking keys. one keyboard was missing six keys. the pianos all sounded tinny; most of them couldn't be tuned anymore. senseney and other friends of wsu got their heads together. kelly callen, a co-owner of edmiston oil co., wasn't a music major. \"i was more fine arts; but i had volunteered at the zoo where we'd done some good by asking donors to adopt an animal,\" she said. \"so i said why not try to get people to adopt a piano, and see whether we could get 26 pianos.\" they've almost done it; <mark>john paul</mark> johnson, the director of the music department, put 10 new yamahas on display in the hallway at duerksen fine arts center on thursday. they already had received a shipment of five; pledges will bring the total of new pianos to 21. \"i almost can't believe this is happening,\" he said, as gray played a few quiet notes beside him. senseney, who is retired from senseney music, said callen's idea worked well. most of the donors, he said, are patrons of the arts in wichita, some of them graduates of wsu's school of music. one pair of names on one of the adopted pianos on display thursday: wsu president don beggs and his wife, shirley, a voice major in her college days. other donors include a family who donated to honor their mother and another family who donated to honor a family member and wsu music major killed in vietnam. senseney, callen, johnson and others arranged a price for the pianos that they hoped would help attract donors; yamaha, the manufacturer, and senseney music agreed to sell the pianos for half of their usual $10,000 price. what this means, johnson said, is that the music department that has given the world thousands of music teachers and musicians and music lovers is going to continue to do so, while sounding a lot sweeter in those soundproof rooms. receptionist mid america orthopedics us-ks-wichita therapy aide kansas orthopaedic ctr us-ks-wichita accountant the mccall pattern company us-ks-wichita"}, {"articleID": "2018061806_00033939_W", "names": {"Imran Khan": ["Q155164", "Q15987686", "Q1660487", "Q17306146", "Q18351186", "Q18619306", "Q18637473", "Q18637525", "Q18637527", "Q18649030", "Q18687912", "Q18687913", "Q18687915", "Q18687916", "Q21061850", "Q27951129", "Q312781", "Q42560214", "Q43384689", "Q50064378", "Q51161844", "Q57064458", "Q59198528", "Q6008185", "Q6008187"]}, "date": "2018-06-18", "url": "https://en.dailypakistan.com.pk/pakistan/nadra-rejects-ptis-allegation-of-sharing-sensitive-data-with-pml-n/", "content": "ISLAMABAD--The National Database and Registration Authority (Nadra) has dismissed the allegation of providing sensitive information to the Pakistan Muslim League-Nawaz (PML-N) ahead of general elections. The denial from the authority came on Sunday after the Pakistan Tehreek-e-Insaf hurled accusations at NADRA chief, Yousaf Mubeen. A spokesperson for Nadra, in a statement issued on Sunday, said the allegations of corruption are fabricated and baseless, adding that the authority had a limited role in conducting elections, Radio Pakistan reported. \"The organisation is only providing technical assistance to the Election Commission of Pakistan (ECP) in accordance to the law and the Constitution,\" said the Nadra spokesperson. \"Nadra has not given data to any political party, whatsoever,\" he added PTI Chairman <mark>Imran Khan</mark> on Sunday directed his party leaders to file a petition against NADRA Chairman Usman Yousaf Mubeen before the Election Commission of Pakistan. PTI claims the NADRA chairman provided important data to the PML-N to grab victory in the upcoming general elections, and to that end, has decided to file a petition against him. A petition, prepared by the PTI, states the NADRA chief was appointed by the former government and hence, as long as he is there, free and fair elections will not be possible. Mobeen was reappointed as NADRA chairman for a period of three years in February this year after his earlier tenure ended. Facebook Twitter Reddit Follow Daily Pakistan"}, {"articleID": "2015020423_00042892_W", "names": {"Hugh Campbell": ["Q14950666", "Q20676192", "Q21165079", "Q23583443", "Q43913059"]}, "date": "2015-02-04", "url": "http://mtairynews.com/news/home_top-news/151673635/City-may-take-over-tourism-funds", "content": "Those funds, which come from a 6 percent occupancy tax on rentals at local lodging establishments, represent a growing pot of money some city officials believe there should be greater municipal control over, based on discussion at a planning retreat last week. As it now stands, all that money - including $360,000 budgeted for this fiscal year - is collected by the city government but paid quarterly to a group known as the Mount Airy Tourism Development Authority (TDA). The TDA governing board then spends at least two-thirds of the funds on advertising and marketing of the area, with about one-third available for infrastructure projects such as a recent effort to convert the Earle Theatre to a digital facility. The TDA uses all the money as it sees fit, but in accordance with state legislation enacted years ago specifically permitting the collection of the occupancy tax here. Shirley Brinkley, a member of the Mount Airy Board of Commissioners - and also the TDA board - believes the city government itself should start getting some of the occupancy tax revenues. She mentioned other towns where occupancy taxes are levied, which collect all the proceeds then delegate money for tourism-related expenditures. \"We give 100 percent, which not a lot of cities do,\" the commissioner said of delegating the money to another entity. A different arrangement should be considered in Mount Airy, according to Brinkley, whose sentiments were echoed by Commissioner Jon Cawley. \"I think it made sense when it was $100,000 (per year), but it has grown,\" Cawley said of the present system that now involves significantly more money. Although the city budget reflects occupancy tax revenues of $360,000 for the 2014-2015 fiscal year, the final figure probably will be higher, city Finance Director Pam Stone said. She said it could total $400,000 - \"which is a good indicator that people are traveling.\" For the first five months of the fiscal year, through November, the revenues were up 10 percent over the same period in 2013. Cawley said he believes local citizens should be benefiting more from those funds. Changing Mount Airy's procedure of occupancy tax collection and dispensing would require special action by the N.C. General Assembly, according to City Attorney <mark>Hugh Campbell</mark>. That's because occupancy tax legislation is specific to each locality, he explained, including how the money is to be distributed and who can remit those funds and how. There was support at the retreat for seeking the required legislative change in Raleigh and Brinkley reiterated that Wednesday. \"Absolutely,\" she said. Brinkley emphasized during the retreat discussion that her desire to change the occupancy tax set-up does not signal any dissatisfaction with those who now administer the proceeds. \"This is not 'cause you're mad at anybody, or trying to create a mess,\" she said. It is simply a matter of the city needing to tap into additional revenue sources to meet several pressing needs, Brinkley said. Also discussed at the retreat was the possibility of an event fee that would be charged when organizations hold fund-raising walks or similar activities that require police and other services. Such a fee was first discussed a couple of years ago, but never materialized. Along with balancing the regular city budget, Mount Airy officials have been asked to fund a new fire truck, add parking at Reeves Community Center, develop a shell building to better attract industry and other projects in the next fiscal year. One target of TDA funding could be the redevelopment of the former Spencer's industrial site in downtown Mount Airy, Brinkley said. This might include funding a conference center that local tourism representatives have said would boost visitation here. Brinkley indicated that her position on the occupancy tax is bound to ruffle feathers - even with the group of which she is a member. \"I'm on the TDA board now,\" she said. \"But I may get kicked off after this.\" "}]