[{"articleID": "2018041518_00063848_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-04-15", "url": "http://abc11.com/news/comey-says-his-assumption-clinton-would-win-was-a-factor-in-the-email-investigation/3345493/", "content": "LIVE VIDEO Wheelmobile at Streets at Southpoint in Durham Watch Now share tweet share email Comey says his assumption Clinton would win was' a factor' in the email investigation SHARE: share tweet share email SHARE share tweet share email ABCNews LAUREN EFFRON Sunday, April 15, 2018 02:04 PM James Comey said his decision to announce that the FBI was going to look back into the Hillary Clinton email investigation just days before the election was influenced by his belief that she would beat <mark>Donald Trump</mark> and his desire to make sure that the election results were viewed as legitimate. \"I don't remember consciously thinking about that, but it must have been because I was operating in a world where Hillary Clinton was going to beat <mark>Donald Trump</mark>, and so I'm sure that it was a factor,\" Comey told ABC News' chief anchor George Stephanopoulos in an exclusive interview ahead of the April 17 release of his book, \"A Higher Loyalty: Truth, Lies, and Leadership .\" \"I don't remember spelling it out, but it had to have been, that she's going to be elected president and if I hide this from the American people, she'll be illegitimate the moment she's elected, the moment this comes out,\" he added. This comment goes further than what Comey wrote in his book, in which he says, \"Like many others, I was surprised when <mark>Donald Trump</mark> was elected president. I had assumed from media polling that Hillary Clinton was going to win. I have asked myself many times since if I was influenced by that assumption. I don't know. Certainly not consciously, but I would be a fool to say it couldn't have had an impact on me .\" Clinton previously has said that she thinks the letter Comey sent to Congress on Oct. 28, 2016, announcing that the FBI would be looking back at the email investigation, just 11 days before the election, killed her chances of winning. When asked about if the letter had done so, Comey said \"I hope not. I don't know. I honestly don't know. I sure hope not .\" Comey said that part of the reason he chose to write a book about his experiences was to share his perspective, and he hopes readers \"try to realize that I'm not trying to help a candidate or hurt a candidate; I'm trying to do the right thing .\" When asked if he would still release the letter if he knew that doing so would help elect <mark>Donald Trump</mark>, Comey said, \"I would. I would .\" He said that on the morning that they were going to release the letter, a colleague asked him if he should consider how the letter could help <mark>Trump</mark>. \"I paused, and then I said,\" Thank you for asking that question. That's a great question. But the answer is not for a moment because down that path lies the death of the FBI as an independent force in American life. If I ever start considering whose political fortunes will be affected by a decision, we're done,' \"Comey said. Stephanopoulos pressed Comey on the decision, saying,\" there's no precedent for putting out information like this at the end of a campaign. \"\"I think I did it the way that it should have been done,\" Comey said. \"I'm not certain of that. Other people might have had a different view. I pray to God no future FBI director ever has to find out .\" Watch the exclusive interview in a special edition of \"20/20\" on Sunday, April 15 at 10 p.m. ET on ABC. Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories Severe storms looking more likely this evening Raleigh man dies in stabbing Wheelmobile is in Durham today! Hundreds attend 2nd Amendment rally in Raleigh Starbucks CEO apologizes after video of Phila. arrests goes viral Suspect wanted in shooting Harnett County sheriff's deputy caught Check your eggs! 200 million eggs recalled over salmonella fears Starbucks responds after video of arrest in Philly store goes viral Show More Tree falls on wagon carrying 50 people at NC zoo park Fayetteville man missing in Bladen County state park found dead PHOTOS: Wheelmobile visits Raleigh, Durham Fourth suspect arrested in Sanford car wash murder Man dies after being found shot in road in Lumberton More News"}, {"articleID": "2018032820_00048522_W", "names": {"Robert Smith": ["Q16292920", "Q1632228", "Q19664222", "Q2158832", "Q23883691", "Q24006774", "Q25189961", "Q25189963", "Q27835064", "Q28803422", "Q29643608", "Q33996143", "Q3938426", "Q47127399", "Q491252", "Q54321482", "Q56528034", "Q59196504", "Q7348241", "Q7349869", "Q7349871", "Q7349872", "Q7349876", "Q7349878", "Q7349879", "Q7349881", "Q7349884", "Q7349886", "Q7349887", "Q7349888", "Q7349890"], "Jonathan Edwards": ["Q16213939", "Q18719387", "Q19957695", "Q20656891", "Q22018231", "Q221648", "Q302892", "Q6273021", "Q629737"]}, "date": "2018-03-28", "url": "http://pilotonline.com/news/local/crime/article_52dbe316-3298-11e8-95a6-b789bcac84fe.html", "content": "Argument over breakup leads to Norfolk man's death, witness says Courtesy of the Norfolk Police Department Aaron Charles Save NORFOLK Nathaniel Lamarr Williams held his hands up in the air as he faced Aaron Reynolds Charles on a Young Terrace street one night last summer, a witness testified Wednesday. \"I don't want any trouble,\" Elaina Johnson remembered Williams telling him. Then Williams pulled a gun from his waistband and shot Charles in the chest, she said. Officers found Charles, 25, lying in the street outside his home on the 700 Block of Lincoln Street in the early hours of Aug. 28. He died at the scene. Williams, 40, who lives in an apartment in the 9500 block of 19th Bay Street, is charged with second degree murder and a related gun count. Based on Johnson's testimony, District Judge Clark Daugherty determined there was enough evidence to send the case to a grand jury and on a track toward trial. Williams is the father of Johnson's child, and he'd come to her place earlier that night to visit them, she told Daugherty. While he was over there, Johnson's new boyfriend--who was not Charles--stopped by. Johnson asked her boyfriend to get his stuff and leave, telling him their relationship was over. He left but refused to take his things with him. Later, Williams confronted Johnson's boyfriend on the street about not getting his stuff. Charles came down from his front lawn to tell them to take their argument elsewhere, Johnson said. Williams put his hands in the air. He backed up a few steps and Charles advanced. Then Williams pulled his gun and shot Charles, who fell to the ground, Johnson said. Williams then pistol-whipped Charles in the face. Johnson, who said she was standing next to Williams when he shot Charles, intervened to prevent him from shooting her boyfriend, who ran away. \"Get...off me!\" Williams told her before fleeing, Johnson said. Johnson said Williams didn't know any of the men who were out there, including Charles. Charles died from the gunshot, which hit him in the center chest, medical examiner Wendy Gunther said in her autopsy report. The bullet hit him in the heart, right lung and spine before coming out of his back. The blow above his left eyebrow broke his eye socket and cut a 1-inch gash in his head that went to the bone, Gunther said. Defense attorney <mark>Robert Smith</mark> III asked Johnson if Charles, her boyfriend or their friends jumped at or in any way hit Williams. \"They didn't put a hand on him,\" she said. <mark>Jonathan Edwards</mark>, 757-598-3453, jonathan.edwards @ pilotonline.com"}, {"articleID": "2011012203_00211234_W", "names": {"Edwin Edwards": ["Q18160058", "Q737491"]}, "date": "2011-01-22", "url": "http://bayoubuzz.com/sports-nba/154867-nets-match-win-total-from-last-season-(ap).html", "content": "(notes) scored all of the points during a key second-half run in his first game since mid-december to lead the detroit pistons on friday night. the victory was the nets' 12th, tying the total they had last season (12-70) when they were the nba's worst team. (notes) added 12 and nine assists, and (notes) had 16 points for detroit, which was limited to 14 points in the final quarter. morrow, who had been sidelined since pulling a hamstring against philadelphia on dec. 14, outscored detroit 10-2 in <mark>edwin edwards</mark>, the silv...(18:04:01 \"the rise and last hurrah of louisiana governor <mark>edwin</mark> w. edwards, the best bayou state...\"former governor <mark>edwin</mark> e.. . (18:02:05\" former governor <mark>edwin edwards</mark> granted 5 day furlough = = = = wesawthat.blogspot.com = = = =...\"<mark>edwin edwards</mark> top ten f.. . (18:03:04\" louisiana's legendary governor <mark>edwin edwards</mark> was a guest on my lsu-tv movie review pr...\""}, {"articleID": "2009111301_00166933_W", "names": {"Ben Rhodes": ["Q4886343", "Q4886346", "Q4886347", "Q4886348"]}, "date": "2009-11-13", "url": "http://stuff.co.nz/world/asia/3061051/Obama-heads-to-Asia", "content": "us president barack obama has left for asia, with the us economy, jobs and a yawning trade deficit with china looming large on his agenda. global climate change, the north korean and iranian nuclear disputes and obama's review of his afghanistan strategy are also major topics for his talks with the chinese and other officials on the first trip to asia of his presidency. \"i will be meeting with leaders abroad to discuss a strategy for growth that is both balanced and broadly shared,\" obama said at the white house before departing for japan, underlining the economic focus of his week-long trip. \"it is a strategy in which asia and pacific markets are open to our exports and one in which prosperity around the world is no longer as dependent on american consumption and borrowing but rather on american innovation and products .\" in an interview with reuters this week, obama described china as a \"vital partner, as well as a competitor .\" but he warned of \"enormous strains\" in relations between the world's two most powerful nations if economic imbalances between them were not corrected. those imbalances - america's excessive consumption and borrowing, facilitated by china's aggressive export strategy and purchases of us debt - are seen by many as a major cause of the boom and subsequent bust in the global economy. obama's nine-day tour includes a stop in singapore for the asia-pacific economic cooperation summit, followed by visits to shanghai, beijing and seoul. obama said he would talk to the chinese about revaluing their currency, the yuan, as well as encouraging chinese consumers to spend more and opening chinese markets further to us goods. with the u.s. unemployment rate now at 10.2 percent, the obama administration hopes an emphasis on building export opportunities will play well at home. giving obama a possible boost ahead of the trip, china signalled on wednesday it might allow appreciation of the yuan, saying it would consider major currencies - not just the dollar - in guiding the exchange rate. soaring us budget deficits have weakened the dollar because of us borrowing to meet the day-to-day spending needs of the united states. the dollar has declined against a basket of major currencies since mid-february. us manufacturers have long complained that beijing artificially holds down the yuan's value to make chinese exports cheaper and us goods more costly for china. but obama may face some pushback from china and other countries who worry that washington's drive for economic cooperation with asia may be too one-sided. ad feedback beijing is upset over us moves to slap tariffs on chinese tires and steel pipes, while south korea and other countries harbour doubts over whether obama, elected with strong labour union support, is committed enough to a free-trade agenda. the asia tour also comes as obama juggles many pressing domestic issues, including his drive to pass healthcare reform and climate change legislation, and nears the final stages of a decision on whether to send more us troops in afghanistan. seeking deeper ties one of obama's main messages will be a promise to put a high priority on engagement with the dynamic asia-pacific region, an area of the world where he has personal connections, having grown up in hawaii and indonesia. \"the president is the first president of the united states really with an asia-pacific orientation,\" said <mark>ben rhodes</mark>, deputy national security adviser for strategic communications. \"he understands that the future of our prosperity and our security is very much tied to this part of the world .\" forging an effective working relationship with beijing will be crucial to any effort to deepen us engagement in asia. \"i certainly think this administration differs from its predecessors in its apparent recognition of the ascendancy of china and the ascendancy of asia,\" said david rothkopf, a business consultant and former us official. the obama administration's approach towards china, known as \"strategic reassurance,\" builds on a bush administration effort to ease mistrust between washington and beijing and encourage china to become a responsible stakeholder in global affairs. obama has been accused by some critics of giving short shrift to human rights issues but he said he would bring up the subject in his meetings in china. underscoring the importance placed on the three-day china visit, obama's itinerary includes a formal state dinner, a series of meetings with president hu jintao and premier wen jiabao and a dialogue in shanghai with chinese youth. japan will be another crucial leg of obama's trip. some in tokyo and in washington worry about a drift in relations between the two staunch allies. prime minister yukio hatoyama campaigned on a pledge to set a more independent course from washington and frictions have arisen over plans to relocate the us military base on japan's okinawa island. many japanese also wonder whether historic rival china's growing economic and military clout will affect relations between washington and tokyo, which mark the 50th anniversary of their security alliance next year."}, {"articleID": "2018050209_00035076_W", "names": {"Frank Warren": ["Q1444412", "Q23657144", "Q5490233"], "Magic Man": ["Q23928996", "Q2654402"]}, "date": "2018-05-02", "url": "https://www.boxingscene.com/warren-wilder-joshua-beat-tyson-fury-true-champ--127759", "content": "Read More By: Boxing Clever <mark>Warren</mark>: Wilder, Joshua Must Beat Tyson Fury To Be \"True Champ' The efforts of Anthony Joshua (21-0, 20 KOs) and Deontay Wilder (40-0, 39 KOs) to unify the heavyweight division are in vain until they defeat lineal champion Tyson Fury, according to promoter <mark>Frank Warren</mark>. Joshua and Wilder are in talks for a mammoth bout to unify their five main belts, with the former holding the IBF, IBO, WBA and WBO straps previously owned by Fury. However, as Joshua did not beat Fury to take those titles, <mark>Warren</mark> has questioned his position as the\" true \"heavyweight champion before he has fought the returning 29-year-old. Fury is viewed as the <mark>man</mark> who beat the <mark>man</mark>, because he handed Wladimir Klitschko his first defeat in a decade back in November of 2015 .\" Tyson is the best heavyweight out there, \"<mark>Warren</mark> told talkSPORT .\" He's the lineal champion, he never lost his titles in the ring, he gave them up, and now he's back to get those belts back where they should be. \"No one can consider themselves the true heavyweight champion of the world unless they beat the lineal champion, the guy who never lost the titles in the ring - and that's Tyson Fury .\" Fury will make his comeback in June against an as yet unnamed opponent, though he intends to take \"baby steps\" as he plots a path to the top of the division. \"I'm not in any rush,\" he said in an interview with talkSPORT. \"I'm in a fantastic place at the minute and I hope to stay there .\" I'm 29 years old, I've got a wealth of experience behind me, I've got the <mark>magic man</mark> <mark>Frank Warren</mark> in my corner and we're just going to take baby steps. \"The ultimate goal is to unify the titles again and be the undisputed champion .\" The short-term goal is to get back in the ring, dance beneath the stars and have fun, enjoy it, give the fans something to talk about and give the fans value for money. \""}, {"articleID": "2019080816_00336681_W", "names": {"Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"]}, "date": "2019-08-08", "url": "http://www.lancashiretelegraph.co.uk/sport/national/17825490.surprise-manchester-city-switch-scott-carson/", "content": "Surprise Manchester City switch for Scott Carson By Press Association 2019 Scott Carson has completed a surprise loan switch to Manchester City (Chris Radburn/PA) 0 comment Former England goalkeeper Scott Carson has completed a surprise deadline-day switch from Derby to Manchester City on a year-long loan deal. The 33-year-old, who played 30 times in the Championship for the Rams last season before losing his place to Kelle Roos in mid-March, will act as back-up to Ederson and <mark>Claudio Bravo</mark>. Carson, formerly of Leeds, Liverpool, West Brom, Wigan and Turkish outfit Bursaspor, said on City's official website: \"It's something I didn't expect but an opportunity I simply could not turn down .\" To be part of this squad--the champions of England--is a dream come true. \"I can't wait to see Pep's work on the training field up close. What he has achieved in his management career has been amazing, and it's every player's dream to play under him .\" Hopefully, my experience will prove useful as we try and make it three Premier League titles in a row. \"Carson, who earned the last of his four England caps in 2011, has made more than 150 appearances in his four seasons at Derby, helping them into the play-offs on three occasions. Director of football Txiki Begiristain added:\" We're delighted to be able to recruit Scott into the squad for the coming season. \"We have strength in depth in the goalkeeping department, and the wealth of experience Scott will bring to the squad will be important as we once again look to compete on all fronts .\" 0 comment"}, {"articleID": "2019111523_00075575_W", "names": {"Andrew Benson": ["Q4756330", "Q57016943"], "Max Verstappen": ["Q2239218", "Q2744186"], "Lewis Hamilton": ["Q6536656", "Q9673"], "Carlos Sainz": ["Q211204", "Q544856"]}, "date": "2019-11-15", "url": "http://brazilbusiness.einnews.com/article/502299546/eOf4Lu2o4XzJfrbt", "content": "Brazilian GP: Sebastian Vettel top as Kubica crashes in Brazil practice By <mark>Andrew Benson</mark> Chief F1 writer at Interlagos 15 Nov From the section Formula 1 Share this page Share this with Digg Facebook Google LinkedIn Reddit StumbleUpon Twitter Copy this link http: //www.bbc.co.uk/sport/formula1/50438953 Read more about sharing. Listen to qualifying on 5 Live Sports Extra and the BBC Sport website from 18:15 GMT on Saturday Sebastian Vettel led Charles Leclerc to a Ferrari one-two in an incident-packed second practice session at the Brazilian Grand Prix. The German was 0.021 seconds ahead of Leclerc with Red Bull's <mark>Max Verstappen</mark> third, ahead of Mercedes drivers Valtteri Bottas and <mark>Lewis Hamilton</mark>. Williams driver Robert Kubica began the session with a heavy crash at Turn Three from which he emerged unscathed. Both Toro Rossos suffered reliability problems, stopping on track. The session ran in cloudy but grey conditions after the wet weather for the morning session, but Kubica appeared to be caught out by dampness on a painted white line when he spun at the fast Turn Three on his first flying lap of the day. Brazilian Grand Prix first and second practice results <mark>Hamilton</mark> to negotiate new F1 contract Albon named Red Bull second driver for 2020 View more on twitter The Pole, whose Williams had been used by reserve driver Nicholas Latifi in the first session, lost the rear, over-corrected and spun into the wall, badly damaging three corners of the car. It was another blow for Williams, who have been struggling for pace all year and in recent races have been suffering from a shortage of spare parts. At the front, the true competitive order is hard to read, as both Ferrari drivers and <mark>Hamilton</mark> had messy runs. Vettel and <mark>Hamilton</mark> were both blocked by Bottas on their fastest laps, the world champion on the exit of Mergulho, the penultimate corner, and Vettel shortly afterwards on the exit of Juncao, just a few metres further on. And Leclerc did not improve in the final sector of his fastest lap, which suggests he, too, had more time in him. <mark>Verstappen</mark> impressed to be just 0.134 secs off the pace as Red Bull's revival in the last few races continues, and Bottas was 0.156 secs behind Vettel. The compromised <mark>Hamilton</mark> - whose time, like Vettel's, was set on his second lap on his tyres - was 0.067 secs behind his team-mate. Media playback is not supported on this device Jack Nicholls: \"Why <mark>Hamilton</mark> is better than Senna & Schumacher' Ferrari may well see the results of the session as vindication after what they consider to be unfounded allegations about their engine in the wake of two rule clarifications from governing body the FIA. Ferrari insist neither ruling - one governing the operation of the hybrid system and fuel-flow meter, and the other the addition of oil into the combustion chamber - have any effect on the running of their engine. They said they would be back to their normal form in Brazil after a disappointing race in the US last time out, and at least on Friday they look to be favourites for pole position on Saturday. Best of the rest was Kevin Magnussen's Haas, for once not struggling with tyre temperature in a disappointing season for the American team, followed by the Renault of Daniel Ricciardo and Alfa Romeo's Kimi Raikkonen. The second Red Bull driver Alexander Albon, confirmed with the team for 2020 earlier this week, was struggling after a crash at the end of the first session and down in ninth place, 0.9 secs off team-mate <mark>Verstappen</mark>. At Toro Rosso, Pierre Gasly's engine failed mid-way through the session forcing the Frenchman to park up at Turn Three, while Daniil Kvyat went off at Juncao, the final corner, with five minutes to go, after his car switched off, causing him to spin lightly into the barrier, bringing out the red flag and the session to a premature end. The team said they did not yet know the cause of the problem. McLaren's Lando Norris was down in 18th place, eight places behind team-mate <mark>Carlos Sainz</mark>, but the 20-year-old Briton said he made a series of mistakes .\" I'm confident if I put the lap together and don't make the mistakes I did today, it will look a bit better, \"Norris said .\" It was actually a relatively good day, \"said <mark>Hamilton</mark>.\" The second session was good, nice and smooth. The Ferraris are quite quick today and they were generally beating us just all on the straights. \"<mark>Hamilton</mark> has an Ayrton Senna inspired helmet for this weekend's grand prix Leclerc was 0.021 behind team-mate Vettel"}, {"articleID": "2009100517_00060133_W", "names": {"Simon Dyson": ["Q1360704", "Q7518662", "Q7518673"], "Darren Clarke": ["Q4222965", "Q5224842", "Q5224843", "Q531845"], "Luke Donald": ["Q6701919", "Q712150"], "Paul Casey": ["Q10557500", "Q683113", "Q7149753", "Q7149754"]}, "date": "2009-10-05", "url": "http://pga.com/2009/news/europeantour/10/05/dunhill/index.html", "content": "england's <mark>dyson</mark> grabs dunhill links by three over wilson and mcilroy st. andrews, scotland (pa)--<mark>simon dyson</mark> finally leapt into the big time on the european tour on monday--and did it with the round of his life. harrington hits st. andrew eyeing top spot on europe's money list after success as captain, mcginley still firmly focused on playing looking ahead, mcilroy envisions success in world cup and olympics full of jealousy when his great friend nick dougherty took the same title two years ago, <mark>dyson</mark> won by three strokes over rory mcilroy and oliver wilson in the big european tour event that is similar to the at & t pebble beach national on the pga tour. it takes the englishman, who magically birdied six of the first seven holes, to the top of europe's ryder cup points table, into the top 10 on this season's money list and into the world's top 50 for the first time. he began the week 92nd. in august his second dutch win came with a course-record closing 63 but, after taking charge with his blistering start and then carefully avoiding disaster, <mark>dyson</mark> revised his opinion about the best round of his career. \"there's no way this can't be it,\" he said. \"this is like our fifth major, a massive tournament at the home of golf, and i've shot 66 to win it .\" i'm absolutely buzzing. <mark>darren clarke</mark> has just said to me, \"take your time and enjoy it; it does not get any better than winning at st. andrews',\" he added. \"my parents always come up (to the tournament) but couldn't make it this year. they're never coming back!\" for wilson, it was an eighth runner-up finish on the circuit with not one victory to his name as yet, but he could not feel disappointed about this one as he shot 65 after starting the day 14th. mcilroy, only one behind <mark>luke donald</mark> overnight, had dearly wanted to win playing alongside his father on his 50th birthday in the celebrity pro-am but he managed \"only\" a 69. that was still good enough to take the 20-year-old above the injured martin kaymer and <mark>paul casey</mark> into the top spot on the money list, but he knew the day belonged to <mark>dyson</mark>. the former walker cup player--he was a teammate of <mark>casey</mark> and <mark>donald</mark> at nairn in 1999--admits he is a lot more dedicated to his golf than once was the case--not that he regrets enjoying himself on tour as much as he did in his younger days. \"i might have done better but i don't regret one thing that i've done,\" <mark>dyson</mark> continued. \"you're travelling the world and you've got to enjoy yourself .\" i've still got a lot of time left in my career hopefully; touch wood. i've settled down a lot, i'm the happiest away from the course that i've ever been, and what more do you want? \"<mark>dyson</mark> knew it could be a special day from his second shot--a pitch to three feet that brought him level with <mark>donald</mark>, who with a 73 fell all the way back to seventh and has not won for 3 1/2 years. by the eighth tee, <mark>dyson</mark> was already four clear--and though mcilroy did cut it back to two by turning in 32 to the winner's 30, that was as close as it got. <mark>dyson</mark> added another birdie on the 12th and could afford to bogey the road hole 17th. mcilroy ruined his chances of winning by bogeying the 12th, 16th and 17th. but his birdie on the last was huge for the money list battle. wilson was cursing not finishing one ahead of him, though, after missing a three-foot birdie putt on the last when he was distracted by someone assembling the presentation area behind the green .\" i heard him shaking a can before i went to hit it, but then on my backstroke he shook it as loud as he could, \"he said .\" i'm not very happy at the moment. i'd not missed one that short all week, but i guess it's another lesson. \"i played with <mark>simon</mark> last week (at the vivendi trophy) and this week (for three rounds), and he has not really missed a shot,\" he added. \"he's a great lad, upbeat all the time, and has the perfect attitude for golf .\" he's also great in the team room, and i'd love to partner him in the ryder cup. i think he'll be great there. \"there is a long way to go before that happens--for both of them--but <mark>dyson</mark> has taken a mighty leap towards a debut against the americans. scotland's richie ramsay, meanwhile, would have finished tied for second except for three-putting from the valley of sin on the last. his tie for fourth, however, secured his tour card for next season--and he would certainly have taken that 10 days ago, having not been in the event until <mark>casey</mark> pulled out. wie charges, but ochoa wins navistar classic for second straight year prattville, ala. (ap)--lorena ochoa fashioned a few more nice memorie palm beach, fla. (ap)--just 15 months after they were married, golf s ochoa surges ahead at navistar classic as teen thompson drops back © 2003-2009 pga / turner sports interactive. all rights reserved."}, {"articleID": "2020033008_00043770_W", "names": {"Brian Wong": ["Q4965675", "Q56248560", "Q8968957"]}, "date": "2020-03-30", "url": "http://asiaone.com/asia/hong-kong-jails-men-who-flouted-coronavirus-quarantine-rules", "content": "#Hong Kong #coronavirus #Jail term Hong Kong jails men who flouted coronavirus quarantine rules March 30, 2020 By <mark>Brian Wong</mark> South China Morning Post The convicted man passed through Shenzhen Bay port on March 8, a month after quarantine rules came in for people arriving from north of the border. South China Morning Post Three Hong Kong men who flouted isolation rules brought in to fight the spread of the deadly coronavirus were jailed for up to three months on Monday, in the city's first such convictions. The longest term was handed to a homeless man, after he admitted evading mandatory quarantine by falsifying a home address. Two other men were jailed for 10 days and six weeks respectively, for trying to leave Hong Kong for mainland China while they were subject to 14-day home quarantine. Magistrates said imprisonment was the only appropriate sentence, criticising the men's actions as selfish and irresponsible, and adding that they could have undermined the government's anti-contagion efforts and endangered the community. As of Monday morning, Hong Kong had recorded 641 confirmed Covid-19 cases, with four related deaths. All arrivals to the city have been required to undergo compulsory quarantine for 14 days, following government measures introduced on February 8. It is a criminal offence to contravene the order and offenders are subject to a maximum fine of HK $25,000 (S $4,600) and six months' imprisonment. Fanling Court heard delivery man Sing Kin Kung-kai was required to enter a 14-day quarantine upon his return from mainland China on March 8. But when the 31-year-old local resident passed through Shenzhen Bay port that night, he lied to a health officer that he was living at a youth hostel in Yuen Long, to avoid being sent to a quarantine centre. He was intercepted at the same border control point two days later, when he tried to leave for the mainland to visit relatives. He was subsequently sent to quarantine at Tso Kung Tam Outdoor Recreation Centre in Tsuen Wan, and was charged two weeks later. He pleaded not guilty to giving false information to an authorised officer when he first appeared at West Kowloon Court on March 23, but opted to plead guilty to the charge on Monday. [[nid:481121]] The defendant told acting principal magistrate Don So Man-lung he had been without a fixed place of residence since December 2018. He pleaded for leniency on the grounds that he had tested negative for the coronavirus, and had been asymptomatic before and after the offence. But So considered immediate imprisonment the only appropriate sentence, blasting the defendant for his \"selfish\" act. \"Although the defendant might not be a carrier of the virus, its ability to incubate means that nobody can assume they are off the hook,\" the magistrate said. \"The defendant put the society in danger and had all along no intention to co-operate with the quarantine requirement. His selfish act might have dealt a blow to the government's anti-contagion efforts and put them to complete waste .\" Meanwhile at West Kowloon Court, Xie Xong-yue and <mark>Wong</mark> Yee-keung each pleaded guilty to one summons over contravention to restrictions during quarantine, for leaving their isolation site without reasonable excuse or permission. The court heard Xie, 37, was issued a 14-day quarantine order following his entry at Shenzhen Bay Control Point on February 8, running to February 21. He was required to stay at his reported address in Tsuen Wan and banned from leaving Hong Kong. [[nid:481993]] But immigration officers found him at the same port just four days later on February 12 and intercepted him. \"I wanted to see my sick mother,\" he told Principal Magistrate Peter Law Tak-chuen. <mark>Wong</mark> was similarly accused of breaching his quarantine order, effective from February 10 to 23, after he was intercepted at the Hong Kong-Zhuhai-Macau Bridge on February 13. Upon arrest, <mark>Wong</mark> told police officers that he wanted to visit the mainland for fun because he was bored at home. Both men, of prior clear records, were subsequently sent to quarantine camps to complete their isolation periods. Law said health workers were working very hard to contain the outbreak and keep everyone healthy, but the public's co-operation is needed to fight the outbreak. \"This is very irresponsible behaviour,\" he said of the offence. The magistrate also described <mark>Wong</mark>'s conduct as \"selfish to the extreme\". Xie and <mark>Wong</mark> were respectively jailed for 15 days and nine weeks as starting point of sentence, before they were given a one-third discount to credit their guilty pleas. For the latest updates on the coronavirus, visit here. This article was first published in South China Morning Post. #Hong Kong #coronavirus #Jail term SUBSCRIBE TO OUR NEWSLETTER Your daily good stuff - AsiaOne stories delivered straight to your inbox SUBSCRIBE"}, {"articleID": "2011021808_00046034_W", "names": {"Gary Thompson": ["Q5526059", "Q5526060", "Q5526211"], "Tony Scott": ["Q18353288", "Q193648", "Q2550621", "Q27831098", "Q32937", "Q57306593", "Q7823372", "Q7823373"]}, "date": "2011-02-18", "url": "http://philly.com/r?19=961&43=167701&44=116440879&32=3796&7=195382&40=http%3A%2F%2Fwww.philly.com%2Fdailynews%2Ffeatures%2F20110218_Gary_Thompson___Unstoppable__rides_to_the_top_of_his_favorites_list.html", "content": "artist orna willis a captive of color in her northern liberties loft <mark>gary thompson</mark>: \"unstoppable' rides to the top of his favorites list by <mark>gary thompson</mark> philadelphia daily news i can't say for sure, but there's a good chance i was the only critic in the world to put\" unstoppable \"on his top-10 of 2010 movies. probably would have made my top five, so profound is my affection for this movie, with its entrancingly simple hook (runaway train!) and its visual love letter to the sturdy steel relics and industrial byways of pennsylvania. it's also a testament to the folks who work there - a full-on, big-budget <mark>tony scott</mark> action movie about two regular guys (denzel washington, chris pine) just doing their jobs. the marriage of <mark>scott</mark>'s slick action mania with this blue-collar focus works unexpectedly well, with much thanks to washington, with his unrivaled movie-star gravity and versatility. it probably plays better on the big screen, but the dvd has about half a dozen behind-the-scenes features for a little value-added. also this week:\" waiting for \"superman',\" the moving and thought-provoking david guggenheim documentary about failing city schools. the movie is in part a profile of d.c. schools administrator/reformer michelle rhee, and praise for the movie outlasted rhee's tenure. like rhee, the pro-charter school \"\"superman'\" got a lot of push-back from anti-charter forces, and the movie certainly wears its bias on its sleeve. beyond that, though, it offers insight into reformist ideas and methods that need at least to be considered. and it's hard not to be moved by the empathy \"\"superman'\" feels for its true subjects, students and children. because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to banner: eagles, because of cap room, are in position to add top players fbi search warrant reveals how it seeks to build corruption case involving phila. police, l & i it will last through the weekend and into the next cold snap."}]