[{"articleID": "2010030501_00127967_W", "names": {"Richard Neal": ["Q1464697", "Q7328011"]}, "date": "2010-03-05", "url": "http://ktnv.com/global/story.asp?s=12083002", "content": "gunman wounds 2 officers at pentagon metro station paterson's stature erodes even in stomping grounds sex offender in teen's killing eluded suspicion ex-mayor of wis. city gets 3 years for sex sting racine, wis., ex-mayor gets 3 years for trying to set up tryst with agent posing as girl, 14 no is no: more men file sexual harassment claims male-on-male sexual harassment claims increase, victims often perceived as \"not manly' enough passenger on cruise ship: wave ordeal\" terrifying' san diego county prosecutors charge sex offender with murder in chelsea king case faa suspends pair after kids radio pilots at jfk rangel stepping aside from ways and means chairmanship for now; prospects dim for regaining it audio indicates kid directed planes at ny airport faa puts controller, boss on leave after audio indicates kid radioed pilots at kennedy airport us veterans return to iwo jima for 65th reunion us veterans return to iwo jima for 65th anniversary of iconic wwii battle ny gov. paterson digs into work as scandal unfolds ap source: woods back from family counseling, getting back in competition routine associated press writers washington (ap) - rep. sander levin of michigan took over thursday as chairman of the powerful tax-writing house ways and means committee thursday after democrats decided they wanted a consensus builder rather than a firebrand going into the midterm elections. levin, a liberal, replaces rep. charles rangel, d-n.y., who stepped aside wednesday while the house ethics committee continues to investigate his fundraising and finances after concluding last week that he violated house rules forbidding lawmakers from taking trips paid by corporate sponsors. rep. fortney \"pete\" stark, d-calif., was next in line for the post and held it a day, until democrats decided they didn't want one of their most confrontational members - stark once accused republicans of wanting to send troops to iraq \"to get their heads blown off for the amusement of the president\" - in such a high-profile job when their party already is under assault from voters. the ways and means committee is arguably the most powerful and influential in congress. it originates all tax laws and has jurisdiction over trade, social security and benefit programs that pay about half the cost of americans' health care. in choosing levin, democrats went with a soft-spoken leader whom democrats hope will help move them past rangel's ethics problems and provide a steady hand as congress tries to pass a health care bill this month. once health care is addressed, levin will have to turn his attention to billions of dollars in tax cuts set to expire at the end of the year - a thorny issue that will only get more complicated and politically charged as congressional elections approach in november. levin, 78, represents an auto industry district outside detroit and is the democrats' foremost expert on trade, an issue that has been on the back burner since president barack obama took office. he gives up his chairmanship of the ways and means subcommittee on trade to head the full committee. his younger brother by three years, sen. carl levin, also a michigan democrat, is chairman of the senate armed services committee. \"every human being is different,\" levin said of his management style. \"i think what i will try to combine is organization, collegiality and making tough decisions.\" levin said he hopes to work on health care, economic development and job creation. on the latter, obama has wanted more focus on giving businesses tax incentives to increase their payrolls, an approach rejected by many democrats in the house. in his new role, levin could help bridge that gap. but the biggest issue that he and perhaps the entire congress face once health care is out of the way will be the billions in tax cuts initiated by former president george w. bush in 2001 and 2003 that expire at the end of this year. if congress doesn't act, taxes at every income level would increase, with the top income tax rate rising from 35 percent to 39.6 percent. the top capital gains tax rate would rise from 15 percent to 20 percent and the top tax rate on dividends would increase from 15 percent to 39.6 percent. the $1,000 child tax credit would be reduced to $500. \"clearly they have to be addressed, as does the estate tax,\" levin said. \"i think we will continue the middle-class income tax cuts.\" obamahas said he wants to extend most of the tax cuts, allowing taxes to increase only on individuals making more than $200,000 a year and couples making more than $250,000. republicans argue that increasing taxes on high earners would hurt small businesses. democrats on the committee were still trying to get used to levin as chairman on thursday, saying the future was uncertain for big issues like trade and tax reform. \"what we need to do is to take the temperature of what's happened in the committee and at least proceed with some discussions and give the interim chairman some room to make some suggestions,\" said rep. <mark>richard neal</mark> of massachusetts, a senior democrat on the committee. levin, first elected in 1982, is in his 14th term. he will serve as the committee's acting chairman until rangel's ethics case is resolved or a new congress convenes next year. the ethics committee admonished rangel last week for breaking house rules by accepting corporate-financed travel. he has called his exile temporary, but he still faces inquiries over late payment of income taxes on a rental villa he owns in the dominican republic, his use of house stationery to solicit corporate donations to an educational institution that bears his name and belated disclosure of hundreds of thousands of dollars in previously unlisted wealth. rangel, who has said he didn't want his ethics case to damage fellow democrats, said of levin, \"it's the best thing for the country, the congress and the committee under the circumstances. i love him. he's good. he's thorough. he's got a reputation, and he'll do us well.\" levin told reporters: \"i think you know my close relationship with charlie. at this point, i'm acting chairman.\" stark stepped aside thursday, saying he wanted to keep his chairmanship of the ways and means subcommittee on health, a position he would have had to give up if he had taken over the full committee. the chairmanship then fell to levin who is the next most senior democrat. ___ associated press writer ken thomas contributed to this report. north korean who shopped for dictators goes public mexican official fired for painting teen's bottom"}, {"articleID": "2008112103_00006067_W", "names": {"James Richardson": ["Q16226010", "Q18637809", "Q43912606", "Q4394973", "Q6142072", "Q6142076", "Q6142078"], "Brad Friedman": ["Q48226968", "Q4953937"]}, "date": "2008-11-21", "url": "http://bradblog.com/?p=6686", "content": "franken gains on coleman again on day 2 of u.s. senate race hand count in mn official gop website continues baseless claims of \"stolen' election...with just over 40% of the ballots in minnesota's u.s. senate race between incumbent republican sen. norm coleman and democrat al franken, the gap has now shrunk to just 129 votes at the end of the second day of counting. mn secretary of state's\" recount \"webpage, coleman has so far lost a total of 212 votes and franken has lost 126 during the counting. the net gain is 86 votes for franken out of the original 215 vote advantage certified by the state for coleman before counting began yesterday. the original numbers were based on the tabulations reported by the state's faulty es & s and diebold optical-scanners. but today's numbers may be equally misleading, for the moment, as there are some 360 ballots so far challenged by coleman, and 374 by franken, which will be judged later by the canvassing board. those numbers are not included in today's totals. last night, after the first day's counting with just over 15 percent of the ballots manually inspected across the state, franken had a net gain of 43 votes. today, with slightly over 40 percent counted, franken's net gain has exactly doubled that to 86 votes...screenshot from tonight's mn sos\" recount \"page: coleman lost 70 franken lost 27 net gain: +43 for franken gap (as based on original, machine-tallied results): 172 for coleman as of day 2 coleman lost 212 franken lost 126 net gain: +86 franken gap (as based on original, machine-tallied results): 129 for coleman county-by-county & precinct-by-precinct results are available here. gop shame...incredibly, the republican national senatorial committee is still updating their shameful set up a week or so ago, that franken and the democrats are\" stealing \"the election. that, even though they offer no evidence for such claims, or evidence that embarrassingly turns out to be plain wrong (but brings no subsequent retraction or correction). remember, this is an official republican party website making these claims! by way of a few of the latest examples, they post an item from someplace called the skepticians by <mark>james richardson</mark> which argues (without evidence): [franken's] campaign is determined to win steal minnesota's senate seat by any means necessary and this from the pathetic and shameless--and also evidence-free--tin-foil hatter, the real problem in our elections, of course, is not the tiny handful of ballots that might be rejected incorrectly, it is the much larger number that are cast illegally. this year, around 25 percent of all the ballots cast in hennepin county, where minneapolis is located, were by voters who registered at the polls. no one will ever know how many of those votes were illegally cast by illegal aliens, felons, non-minnesota residents, or people who also voted in other precincts or other states-both of which are absurdly easy to do. no doubt, al franken benefited from thousands of illegally cast votes. but there is no way to connect a particular ballot with a specific illegal voter, so it is hard to see how these illegalities can ever be remedied. many people fear that al franken will steal the election in the recount process, but i think it's much more likely that he stole it on november 4. and it again bears repeating: this is an official blog site of the republican national party! has covered your electoral system 2008, fiercely and independently, like no other media outlet in the nation. please support our work with\" napalitono's move to the obama administration would be a nightmare come true for az voters \"leave a comment on\" franken gains on coleman again on day 2 of u.s. senate race hand count in mn \"e-mail (required, though will not be published) you must read and type the 5 chars within digits 0. .9 and letters a.. f, and submit the form. the letter o is not used!\" napalitono's move to the obama administration would be a nightmare come true for az voters \"the awful sos brewer would ascend to governor if napolitano takes job in obama admin gop suddenly concerned about\" computerized voter fraud'? by john gideon for those of you who are closely watching the minnesota senatorial recount there is a live blog that is dedicated to reports from the ground in the state. you can go groomsmen gifts - pub signs can be personalized for a unique gift for your wedding party. franken gains on coleman again on day 2 of u.s. senate race hand count in mn debunked: republican's '32 franken ballots in a car' story is complete nonsense, never happened breaking: begich takes 3 814 vote lead over stevens in alaska's u.s. senate race! clint curtis/tom feeney \"vote-rigging' film named\" best documentary' by nj film festival! national republican party creates conspiracy site, claims \"stolen election' in mn's u.s. senate race or by snail mail make check out to...<mark>brad friedman</mark> 7095 hollywood blvd., #594 los angeles, ca 90028"}, {"articleID": "2017062120_00549618_W", "names": {"Jeff Hardy": ["Q44137", "Q6174013", "Q6174015"]}, "date": "2017-06-21", "url": "http://sportskeeda.com/wwe/wwe-news-matt-hardy-says-broken-persona-will-be-the-most-exciting-thing-in-the-wwe", "content": "WWE News: Matt Hardy says \"Broken\" persona will be the most exciting thing in the WWE Matt Hardy seems optimistic about bringing his broken brilliance to the WWE. News 21 Jun 2017, 18:47 IST Could the gimmicks be WWE-bound? What's the story? WWE Superstars Matt and <mark>Jeff Hardy</mark> were recently interviewed by WWE RAW commentator Corey Graves for a WWE NetworkSpecial titled \"Reborn by Fate: The <mark>Hardy</mark> Boyz Interview\" . During the interview, The <mark>Hardy</mark> Boyz talked about their surprise return, their stints outside the WWE as well as the Broken gimmicks. Matt Hardy stated that whenever the Broken gimmick comes to the WWE, it would be \"the most exciting thing to hit the WWE programming for a long, long time.\" In case you didn't know...Matt and <mark>Jeff Hardy</mark>, collectively known as \"The <mark>Hardy</mark> Boyz\" are a WWE tag team on the RAW brand. Prior to them returning to the WWE at WrestleMania 33, Matt and <mark>Jeff Hardy</mark> had gained popularity on the independent circuit with their \"Broken\" gimmicks. The eccentric, bizarre gimmicks were used by the <mark>Hardy</mark> brothers on Impact Wrestling as well as several other independent wrestling promotions. However, ever since the <mark>Hardy</mark> Boyz left Impact Wrestling, Anthem Sports and Entertainment disallowed the usage of the broken characters and claimed ownership of the same. The Hardyz have since been embroiled in a legal controversy with Anthem over the rights to the gimmick. The heart of the matter During the interview, Corey Graves asked Matt Hardy whether it was odd for him to go back to his WWE gimmick of \"Version 1\" Matt Hardy after having been \"Broken\" Matt for such a long time. <mark>Hardy</mark> responded by saying that he felt like a broken man going back to \"plain old\" Matt Hardy, but that he will unleash his \"broken brilliance\" on the WWE Universe eventually when the time seems right. Also read: What are the \"Delete\" chants and broken gimmick of The <mark>Hardy</mark> Boyz all about? Matt Hardy then added that he was optimistic about bringing the Broken characters to the WWE, despite their legal struggles over the gimmick. <mark>Hardy</mark> said that he found the response to the characters humbling and urged the WWE Universe to continue their support for the broken gimmicks. He was quoted as saying: \"I find it very flattering and humbling that every time we come wrestle in front of the WWE Universe, they chant and they address it and they acknowledge it. Please, keep doing that. I mean, we love it when they do that. And hopefully sooner than later we'll be able to go into more detail about everything. When it happens, I'm not even going to say\" if', when it happens, it's going to be the most exciting thing to hit WWE programming in a long, long time. \"What's next? The <mark>Hardy</mark> Boyz are currently feuding with Sheamus and Cesaro over the WWE RAW Tag Team Championships. Their feud is likely to carry over to the Great Balls of Fire pay-per-view, where, barring any unforeseen circumstances, the two teams will battle it out with the titles on the line. Although their match hasn't been officially announced for the pay-per-view yet, several reports and rumours have pointed towards it happening. The full interview with Matt and <mark>Jeff Hardy</mark> taken by Corey Graves can be seen on the WWE Network. Author's take The Broken Hardys were some of the most original, innovative and brilliantly written characters to have come out of the wrestling scene outside of the WWE in quite some time. It is a pity that the characters cannot be debuted on WWE TV yet despite the Hardys being on WWE already. However, it is a question of\" when \"and not\" if \"the characters will finally come to the WWE and I am no exception to the WWE Universe in my eager anticipation of that day, whenever it comes. Send us news tips at fightclub @ sportskeeda.com Fetching more content ..."}, {"articleID": "2014112400_00034080_W", "names": {"David James": ["Q10598", "Q12889410", "Q16197001", "Q16730163", "Q2139406", "Q24181959", "Q24818335", "Q25189319", "Q286937", "Q3018148", "Q5235554", "Q5235558", "Q5235563", "Q56596956"]}, "date": "2014-11-24", "url": "http://londonderrysentinel.co.uk/news/local-news/lawyer-asks-court-to-jail-client-for-his-own-good-1-2090941", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Derry City: Duffy to have trial at Celtic' I was hooded and tortured by the British army' Linfield tracking Institute striker O'Flynn Ex-Institute boss helps Manchester United legend A DEFENCE lawyer urged Limavady's Resident Magistrate to save his client's life by sending him to prison on Wednesday. Colm Curran, aged 34, of Main Street, Ballykelly, had admitted stealing a tray of meat worth 7.48 from the village's Centra store on February 2. According to his solicitor, Peter Jack, he had committed that offence while on bail for stealing tinned goods worth 1.60 from a Spar supermarket on November 6 last year. According to Mr Jack, the pattern remained the same: Curran spent all his money on drink, leaving nothing for food and heat, then went to shops where he was well known and easily recognised and stole food in full view of staff. \"He's drinking himself into an early grave,\" the solicitor said. Mr Jack told RM Eamon King that Curran was already subject to up to five suspended prison sentences for similar offences and said: \"It may well be that a prison sentence now may be the best thing for him.\" And he told the court that there were no internal doors at Curran's house - they'd all been used as firewood. Asking Mr King to impose all the sentences concurrently, Mr Jack added that he hoped Curran would go to Magilligan Prison, making it easier for his family to visit. Jailing Curran for a total of six months, the magistrate said: \"The only issue is what effort Colm will make. Maybe he hasn't gone that far down.\" A TEENAGE couple embarked on a three-month-long series of car offences during which they were repeatedly caught by police, Limavady Magistrates Court heard on Wednesday. Danielle Gibbons, aged 18, and 19-year-old Nicholas Huston, both formerly of Main Street, Ballykelly, but now said to be living in Limavady, pleaded guilty to a series of charges involving numerous counts of driving without insurance, R-plates or an MoT certificate and failing to produce documents when required by police. PSNI Inspector Barry Collins said the first incident had been at 1.05 pm on August 31 last year when Mr Huston was stopped driving a Renault Clio through Ballykelly. Miss Gibbons was in the passenger seat and confirmed ownership of the vehicle but neither could produce their insurance or driving licence at the time. Then, at 11.30 pm on September 15, the couple were found with the car parked in Alexander Road, Limavady, after it had been seen driving along Edenmore Road earlier that evening. On this occasion, they admitted that the car was not covered by insurance or an MoT certificate. The following night, the Clio was stopped in Main Street, Ballykelly, with Miss Gibbons driving. She again confirmed ownership and admitted to not having insurance or being able to produce a driving licence. Inspector Collins said the teenager made a similar admission when stopped in Catherine Street, Limavady on September 30, telling police at the time: \"There's not much I can say.\" Mr Huston was driving along Glenhead Road, Ballykelly, with Miss Gibbons in the front passenger seat, when the Clio was stopped at 5.10 pm on October 2 - again for no insurance. Just five days later, his girlfriend was at the wheel of the Clio as it drove along Main Street, Ballykelly, turning into Plantation Road. This time, she admitted still not having insurance and once again failed to produce her driving documents. But the next day she was caught driving along Limavady's Main Street, at 12.30 am. When stopped, she admitted not having insurance, R-plates and failed to produce a driving licence. Officers next saw her driving the Clio along Greystone Road, Limavady, on October 28. However, she turned off onto Scroggy Road and accelerated away from the scene. According to the inspector, more than a month went by before Miss Gibbons was seen driving the Clio again - along Ballykelly's Main Street, turning onto Glenhead Road, at noon on November 30. Police interviewed her on December 6, when she admitted driving without insurance or R-plates. Defending, Johnny Sandhu said: \"The car has now been sold.\" The solicitor added that both his clients were in receipt of 44.50 a week through the New Deal work experience scheme and neither had considered the incidents to be of a serious nature. However, Resident Magistrate Eamon King told the couple: \"The record does either of you no credit at all.\" Disqualifiying both from driving for a total of two years over the insurance offences, he conditionally discharged them for two years on the other matters. The magistrate added that if either of them were caught behind the wheel of a car during that time they would be arrested and could expect to receive custodial sentences. Alcoholic A MAN with a history of alcohol-related offences threatened to kill himself after being arrested, Limavady Magistrates Court heard on Wednesday. Glenn Connor 25, of Caman Park, Ballykelly, had admitted stealing six air fresheners, to a total value of 8.34, from the Centra store in Main Street, Ballykelly, on January 2. PSNI Inspector Barry Collins said Connor was spotted walking out of the supermarket and, when apprehended for the offence and cautioned, said that he was going to kill himself. Defending, Johnny Sandhu said Connor had spent time in custody during 2005 and 2006 and had also been a patient at Gransha, He told Resident Magistrate Eamon King: \"He is a man with difficulties, who abuses alcohol.\" Imposing a three-month prison sentence, which he suspended for one year, the RM told Connor: \"If you have problems, it's up to you to seek help and get them sorted out.\" Abusive A MAN turned on police after challenging pub doormen to a fight, Limavady Magistrates Court heard on Wednesday. <mark>David James</mark> McFaul, aged 25, of Rose Park, Limavady, admitted disorderly behaviour outside the Corner Bar in Limavady town centre shortly after midnight on December 3. PSNI Inspector Barry Collins said McFaul and another man had been verbally abusing the door staff and challenged them to a fight. When police arrived the pair moved off but McFaul then started abusing police and shouted an obscenity in one officer's face. According to defence solicitor Johnny Sandhu, McFaul became aggressive when the other man - his brother - was arrested for assault on police. \"It was a short incident, with the drink in,\" he said. Resident Magistrate Eamon King replied: \"Short incident, short response - 150, with eight weeks to pay.\" Dog A PENSIONER has promised to keep his dog on a lead after it attacked a member of the public, Limavady Magistrates Court heard on Wednesday. <mark>James</mark> O'Kane, of Grange Park, Limavady, had admitted not having the pet under control when he walked it near his home, along the Blackburn Path, on August 17 last year. Joanne Carmichael, prosecuting on behalf of Limavady Borough Council, said the pensioner had admitted he was in charge of the dog but allowed it to run free along the path. Mr O'Kane said he heard a scream but did not see the dog bite anyone and promised Resident Magistrate Eamon King that it would be kept on a lead in future. The RM imposed a 12-month conditional discharge and ordered the pensioner to pay a total of 94 in costs. Overtaking A DRIVER did not notice his speed when he overtook a slow-moving vehicle in Glenshane, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said Andrew McKnight, aged 42, of Durham Park, Londonderry, was doing 90.55 mph when he went through a radar trap near the Ponderosa pub at 9.30 pm on November 12 last year. Defending, Johnny Sandhu said his client admitted exceeding the 60mph limit in the overtaking lane but had been aware how fast he was going. He added that Mr McKnight needed to drive for his 50,000 per annum job that involved him driving approximately 35,000 miles each year. Resident Magistrate Eamon King imposed a 150 fine and three penalty points. Bricklayer A BRICKLAYER started to dismantle a wall outside the Gorteen House Hotel after being ejected from its nightclub, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said 19-year-old William Christopher Moore, of Rosseden Park, Limavady, was caught by police while removing two coping stones at 1.45 am on May 28. Defending, Johnny Sandhu said the apprentice admitted criminal damage but was taking out his frustrations after being assaulted in the club, Jensen's, and then thrown out by bouncers. Resident Magistrate Eamon King ordered Moore to pay 150 in restitution and imposed a 100 fine. He told the teenager: \"I don't think either of the two coping stones jumped out and hit you that night .! Taxi A MAN had to be hauled out of a taxi by police after being involved in a fight, Limavady magistrates Court heard on Friday. PSNI Inspector Barry Collins said the initial incident had taken place at Catherine Street shortly after midnight on June 12. One of the people involved, 21-year-old William O' Connor, of Drumachose Park, Limavady, was stopped in a taxi at Irish Green Street and became aggressive towards police when they ordered him to get out. O'Connor - currently serving a four-year prison sentence for another offence - had to handcuffed after resisting arrest and lashing out at the officers. Defence solicitor Johnny Sandhu said his client had been in an aggressive mood after the earlier fight. RM Eamon King imposed 150 on each of the two charges, with an immediate prison sentence of one week in default of payment. Probation A MAN with a history of substance abuse was given a chance to sort his life out when he appeared at Limavady Magistrates Court on Wednesday. Simon Fleming, aged 32, of Somerset Drive, Coleraine, had admitted obstructing police in Alexander Road, Limavady. PSNI Inspector Barry Collins said two men had been seen by police after an alleged assault in the street at 11.20 pm on October 26. Fleming, who was heavily intoxicated, had tackled police in an attempt to help the other man to escape. RM Eamon King said Fleming, who had a lengthy history of offences committed through substance abuse, lost his brother last year and was still coming to terms with the tragedy. Placing him on probation for a year, the magistrate made it a condition that he liaise with the addiction team and take up any treatment as directed by his probation officer. Excess WHEN police stopped a VW Golf after it veered across the road several times they noticed that the driver's breath smelled of drink, Limavady Magistrates Court heard on Wednesday. PSNI Inspector Barry Collins said the man was arrested in Irish Green Street, Limavady, at 12.01 pm on December 26. Test showed that Gerald Kennedy, aged 53, of Benevenagh Drive, Limavady, had 113microgrammes of alcohol in 100 millilitres of breath - three times the legal limit. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Unit 4 5 Spencer House Spencer Road Waterside clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. Londonderry Sentinel provides news, events and sport features from the Londonderry area. For the best up to date information relating to Londonderry and the surrounding areas visit us at Londonderry Sentinel regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2017052521_00368537_W", "names": {"Peter Beck": ["Q1698582", "Q18421811", "Q51021169", "Q7172742", "Q7172744"]}, "date": "2017-05-26", "url": "http://home.nzcity.co.nz/news/article.aspx?id=248675&fm=psp,tsf", "content": "Home> News> Living & Travel NZ rocket catches world's attention New Zealand's successful entry into the space age has caught the world's attention, the Kiwi businessman behind the venture says. 26 May 2017 New Zealand's successful entry into the space age has caught the world's attention, the Kiwi businessman behind the venture says. On Thursday, US-New Zealand aerospace company Rocket Lab successfully sent its Electron rocket into space from the remote Mahia Peninsula, between Napier and Gisborne. The rocket reached space and, although it did not quite make it into orbit, that puts New Zealand in the company of an elite group of countries, Rocket Lab chief executive and founder <mark>Peter Beck</mark> told Newshub. \"It's not every day that a country goes to space, I think New Zealand is the 11th nation now to do that, and, if you look at the other nations, they are generally super powers,\" he said on Friday. \"It's a great milestone for the country.\" The rocket reached space but it did not reach orbit, which requires significantly more energy as the launch vehicle must accelerate to about 27 times the speed of sound. \"All the really critical and key stages to go to orbit we achieved,\" Mr <mark>Beck</mark> said. \"We didn't quite get there but we'll find out exactly why but if you've seen any of the footage, New Zealand looks great from space.\" He said the launch also achieved a number of world firsts. \"It was the first all 3D printed rocket engine, first all carbon composite launch vehicle, first electric turbo pump - there was a lot of boxes ticked yesterday.\" Rocket Lab could now confidently push ahead with its next test flights and into commercial operations, Mr <mark>Beck</mark> said. He said the company aimed to send small satellites into orbit because satellites, like other forms of technology, were becoming smaller and did not require large expensive rockets to launch them. \"[There is an] absolute dire need for a small launch vehicle to get small satellites on orbit,\" Mr <mark>Beck</mark> said. NZN"}, {"articleID": "2011020612_00165669_W", "names": {"Alan Bates": ["Q4706144", "Q4706145"]}, "date": "2011-02-06", "url": "http://bendbulletin.com/apps/pbcs.dll/article?AID=/20110206/NEWS0107/102060367/1001/NEWS01", "content": "cynthia kapple, with her daughter, victoria kapple, 10, at their albany farm. kapple is supporting a bill in the legislature that would expand a dairy's ability to sell raw cow's milk. kapple sells raw cow's milk from her farm. advocates seek to put cap on raw milk out to pasture published: february 06. 2011 4:00 am pst albany - cynthia kapple has been drinking raw milk since she was a child, and she's been selling it now for 10 years. the milk tastes better than pasteurized milk and is better for you, she said. one of her customers, vickie tucker, also swears by raw milk. \"my daughters won't drink store-bought milk anymore,\" tucker said. \"they don't like it.\" kapple and tucker believe oregon's law that caps a farm's raw cow's milk production is just plain wrong. \"it's a raw food,\" kapple said. \"this isn't something with chemicals added to it that might be carcinogenic. (the law) blows me away.\" the two albany-area residents are among thousands of oregonians aligning behind legislation that will expand a dairy's ability to supply raw cow's milk. house bill 2222 is sponsored by a diverse group of lawmakers, including a physician, sen. <mark>alan bates</mark>, d-ashland, and several conservative republicans. the mainstream oregon dairy industry opposes hb2222. \"the main issue is there is no way you can guarantee the safety of consumers from raw milk,\" said roger beyer, a lobbyist for the oregon dairy farmers association. \"and what happens is if anyone gets sick from a milk product, consumers don't look at it as raw versus pasteurized. it's milk. and there would be impact to the whole industry from that.\" in addition to concerns over human safety, dairy farmers wonder who is going to pay the costs of licensing raw milk dairies. the oregon department of agriculture estimates the annual cost of licensing raw milk producers at $10,000 per dairy. \"that's if you don't have any screened positives, and life is beautiful,\" said jim postlewait, food program manager with the department. testing for pathogens in raw milk is far more expensive than standard dairy tests, which look for drugs and somatic cell counts. oregon dairies currently pay between $135 and $812 a year for state inspections, with larger dairies paying more. \"we want to know who will pay for that (additional) cost,\" beyer said. while raw milk has advocates, it also has detractors. oregon senior epidemiologist bill keene said disease outbreaks from consumers drinking raw milk \"are a staple\" in epidemiology circles. \"people who drink raw milk are at very high risk for getting infections, relative to people who drink pasteurized milk,\" he said. \"if more people drink raw milk, more people will get sick from raw milk. that's a truism.\" when asked if he would drink raw milk, he said: \"not knowingly.\" when asked if he would recommend his family drink raw milk, he said: \"i would be horrified to hear about it.\" it is such an unnecessary risk when pasteurization is cheap and a highly effective public health intervention, \"keene said. to date, 13 states, including washington and idaho, allow raw cow's milk sales in stores and 29 allow raw cow's milk sales of some sort. oregon started restricting raw cow's milk sales in 1999. kapple sells the 6 to 9 gallons of milk that her cow produces each day to 15 customers, who drive to the midway farms produce stand and pick up the pre-ordered milk. other residents have asked if they could buy the milk, but kapple is unable to supply them."}, {"articleID": "2013042915_00019592_W", "names": {"Sanjay Gupta": ["Q17484165", "Q28419671", "Q510034", "Q644401", "Q7418430"]}, "date": "2013-04-29", "url": "http://business-standard.com/article/pti-stories/siddhanth-kapoor-fancies-negative-roles-just-like-father-113042900712_1.html", "content": "we encourage visitors to register on business standard. registering on the site is absolutely free and offers you the following benefits. free daily e-newsletter breaking news alerts in your inbox post comments and share your feedback free portfolio of stocks, equity and commodities derivatives receive selective offers from our third party premium advertisers april 29, 2013 last updated at 20:27 ist newcomer siddhanth kapoor, son of actor shakti kapoor, says that he is fascinated towards negative characters. \"i am fascinated towards grey and negative characters. i like bad guys. i feel they are more challenging. these characters do get highlighted and catches one's attention,\" siddhanth told pti here. siddhanth had earlier hit the headlines in 2008, though for the wrong reasons, as he was held at a rave party in mumbai. now, he is back in news for his debut release, \"shootout at wadala'.\" i don't care if the role is negative or positive. today there is nothing like hero, heroine and villain...rather it is all about character actors. i am happy to be part of this film as i really liked the character a lot, \"he said. t was the first instalment,\" shootout at lokhandwala' that captivated siddhant so much that he was keen on doing the prequel \"shootout at wadala'.\" i was fascinated by characters played by vivek oberoi, tusshar kapoor and others in \"shootout at wadala' so much that i wanted to be part of\" shootout at lokhandwala', \"siddhant said. he told director <mark>sanjay gupta</mark> about it.\" i told him i would love to do this film if he has any role for me in it. i wanted to be part of this huge film as i liked the concept, \"he says.\" i don't shy away from meeting filmmakers for work. i don't mind asking for work and showing my interest to work with the filmmakers. i don't have an ego problem, \"he added. sony music to distribute the music of\" raanjhanaa' sony music has joined hands with eros international media limited to distribute the music of upcoming sonam kapoor-dhanush starrer love story ..."}, {"articleID": "2016121319_00612530_W", "names": {"Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"], "Felicity Jones": ["Q16232172", "Q21402730", "Q234447"], "Diego Luna": ["Q30122923", "Q313044"], "Wen Jiang": ["Q40090181", "Q42565956", "Q42773688", "Q45500933", "Q716069"]}, "date": "2016-12-13", "url": "http://www.theprovince.com/entertainment/review", "content": "This image released by Lucasfilm Ltd. shows Riz Ahmed as Bodhi Rook in a scene from, \"Rogue One: A Star Wars Story.\" (Jonathan Olley/Lucasfilm Ltd. via AP) Photo by \"Rogue One: A Star Wars Story\" seemed suspicious on paper, like any film saddled with the dreaded \"spinoff\" label. For a while all the odds looked stacked against it too--reshoots, script changes and a director in <mark>Gareth Edwards</mark> whose last blockbuster \"Godzilla\" had visual flair but no humanity, not to mention the fact that the film would be asking us to learn a dozen new characters with strange names, none of which were Skywalker or Solo. And of course as with any franchise there's that ever-present knowledge that, in some ways, this is another line-item on a corporate profit sheet. As it turns out, those should-be liabilities were only assets in the end. \"Rogue One\" is a bold and stirring adventure film that will have both fans and casual observers spellbound. It is easily the most exciting blockbuster in recent memory this side of \"Mad Max: Fury Road,\" and that includes \"The Force Awakens,\" which now looks lazy and bloated with sentimentality and fan service in comparison to the subversive ingenuity of \"Rogue One.\" How refreshing it is to have a truly contained film that doesn't have any objective beyond the story at hand. There is nothing to advance, nothing to tease, no \"maybe we'll find answers in the next movie in 2 years\" here. It is just allowed to be what it is, which is an intense and visually engrossing powder keg of a film. It's a simple idea, really: Who are the rebels who stole the plans for the Death Star? That pivotal action kicked off the original \"Star Wars\" and it's pretty inherently dramatic. Loosely, \"Rogue One\" is rooted around the plight of Jyn Erso, whose father Galen Erso (Mads Mikkelsen) is a scientist who once worked for the Empire. He gets drawn back in by the ambitious Orson Krennic (Ben Mendelsohn) to help finish the Death Star, leaving Jyn, played by Beau and Dolly Gadsdon as a young girl, and <mark>Felicity Jones</mark> as an adult, to survive on her own. Jyn is sort of raised by a rebel extremist in Saw Gerrera (an over-the-top Forest Whitaker), but much of this is left both unseen and unexplained. What we know is she's a child of war, and an almost apathetic one at that, until she's rescued from imprisonment by a group of rebels hoping her familial connections might help with their efforts against the Empire. There she's put together with a deadpan droid K-2S0 (Alan Tudyk) and a spy, Cassian (<mark>Diego Luna</mark>), who's given a secret mission within the mission. Eventually they meet the blind Jedi Chirrut (Donnie Yen), his decidedly more practical companion Baze Malbus (<mark>Wen Jiang</mark>) and the conflicted pilot (Riz Ahmed), forming a motley crew of unlikely heroes. The real feat of \"Rogue One\" is that <mark>Edwards</mark> and screenwriters Chris Weitz and Tony Gilroy create a world with actual stakes, making the audience feel for and worry about characters we've just met. It doesn't rely on decades old nostalgia, although there is a bit of that too in mostly unobtrusive ways. There's also some CGI that veers pretty dramatically into the uncanny valley. But like the somewhat slow and disjointed beginning, eventually it all just washes over you, especially as the riveting action kicks in, taking you from the trenches to space and back again. The only downside of the thrilling battles in the third act is that it means less time with the leads--especially <mark>Jones</mark>, <mark>Luna</mark> and Mendelsohn, whose performances make up for the script's occasional deficiencies. \"Rogue One: A Star Wars Story\" is one of the best Star Wars films ever made. Only time will tell if it will surpass \"The Empire Strikes Back\" as the franchise standard bearer. There's a compelling case to be made. \"Rogue One: A Star Wars Story,\" a Walt Disney Studios release, is rated PG-13 by the Motion Picture Association of America for \"extended sequences of sci-fi violence and action.\" Running time: 133 minutes. Three and a half stars out of four. ___ MPAA Definition of PG-13: Parents strongly cautioned. Some material may be inappropriate for children under 13. ___ Follow AP Film Writer on Twitter: www.twitter.com/ldbahr Comments Share your thoughts"}, {"articleID": "2019022218_00501355_W", "names": {"John Anderson": ["Q13461960", "Q15994265", "Q16146059", "Q16146064", "Q1699148", "Q18576365", "Q18580618", "Q21460175", "Q22003139", "Q2399086", "Q25352589", "Q28232869", "Q3180912", "Q369857", "Q42431836", "Q43126740", "Q43394002", "Q43911342", "Q56650048", "Q56726476", "Q6218937", "Q6218947", "Q6218954", "Q6218975", "Q6218977", "Q6218982", "Q6218984", "Q6219000", "Q6219005", "Q93374", "Q936548"]}, "date": "2019-02-22", "url": "https://www.breitbart.com/news/judge-orders-feds-to-list-private-groups-receiving-watchlist/", "content": "ALEXANDRIA, Va. (AP)--A federal magistrate on Friday ordered the government to disclose to him and to plaintiffs' attorneys a list of private organizations that receive access to the government's list of known or suspected terrorists. Judge <mark>John Anderson</mark> issued the ruling at the conclusion of a hearing in U.S. District Court in Alexandria which he angrily questioned government lawyers about their failure to previously disclose that hundreds of private entities like universities and hospitals receive access to the list. The government admitted earlier this month in a court filing that private groups like universities and hospitals receive access to the list, after denying in previous court hearings and depositions that they do. A government lawyer said the oversight was a mistake and there was no intention to deceive. \"We didn't catch that one,\" government lawyer Antonia Konkoly said of the misstatements about the list, noting that the watchlist administration is \"a very broad operation.\" The Council on American-Islamic Relations is challenging the watchlist's constitutionality. It says innocent Muslims are placed on the list by mistake and suffer numerous consequences as a result. The government also revised its estimate of how many private groups get access to the list, from more than 1,400 to fewer than 700. Konkoly, the government's lawyer, said the initial estimate given earlier this month of 1,441 contained numerous duplicates. She said it's hard to determine an exact number because many of the private entities have similar names, and some of the recordkeeping goes back to \"before the age of modern computing.\" CAIR's lawyers have long suspected that the list is disseminated much more widely than the government has acknowledged. The broad terror watchlist contains hundreds of thousands of names; the much smaller no-fly list is culled from the watchlist. CAIR's lawsuit is filed on behalf of Muslim clients who say they have not only suffered travel consequences as a result of placement on the list but also difficulty in processing financial transactions and interactions with law enforcement. At Friday's hearing, Konkoly said the private groups receiving the list are \"law-enforcement adjacent\" entities like police forces for private universities and railroads. \"There's nothing shocking about any of the entities on the list,\" Konkoly said. \"What may not be shocking to you may be shocking to me or shocking to the plaintiffs,\" <mark>Anderson</mark> responded. As a result, <mark>Anderson</mark> ordered the government to provide him a list of the private agencies. He also ordered, over the government's objection, that the CAIR attorneys be permitted review the list at a secure government location. But the attorneys will not be allowed to keep a copy of the list and are barred from disseminating it publicly. Lena Masri, a CAIR attorney, called <mark>Anderson</mark>'s ruling \"a huge step forward to help us understand the breadth of the dissemination.\" That breadth of dissemination is a key aspect of the CAIR's lawsuit, because the plaintiffs allege that the list is shared so broadly that people suffer consequences in all aspects of life. <mark>Anderson</mark> said he was frustrated that the government did not provide accurate information about the list's private dissemination until roughly two years after the lawsuit was filed, despite specific orders from a judge to come clean on this very topic. He also expressed frustration that the FBI's Terrorist Screening Center, which manages the list, had insufficient answers about how other government agencies share the list. The fewer-than-700 entities referenced in the lawsuit refers only to those private entities that get the data directly from the Terrorist Screening Center. It does not count what other government agencies, like Customs and Border Protection and the Transportation Security Administration, do with the list. The TSA shares its data with airlines, but <mark>Anderson</mark> questioned Konkoly about who else might receive the list. Konkoly provided assurances that private corporations like banks and car dealerships don't get the list, but <mark>Anderson</mark> questioned how she could state that confidently without knowing more about the workings of the other government agencies. \"You don't know what (the department of Homeland Security) does with the information,\" <mark>Anderson</mark> said. CAIR lawyer Gadeir Abbas said it's become clear over the course of the lawsuit that so many government entities are intertwined with the collection and dissemination of the watchlist that nobody truly knows its scope. \"Each agency claims they don't know what the other agency is doing,\" he said."}, {"articleID": "2012062212_00008822_W", "names": {"Tim Lee": ["Q51262592", "Q57090550", "Q7803820", "Q7803821"]}, "date": "2012-06-22", "url": "http://us.rd.yahoo.com/finance/external/bloomberg/rss/SIG=13963cev0/*http://www.bloomberg.com/news/2012-06-22/gm-ceo-says-russia-growth-helps-make-up-for-europe-losses.html?cmpid=yhoo", "content": "general motors co. (gm), facing continued losses in western europe, is more than doubling capacity at a factory in st. petersburg that will make the new opel astra sedan as the russian auto market rebounds, the company said. \"we've got to bring our best game, our best products to this market,\" chief executive officer dan akerson said in a telephone interview yesterday from st. petersburg, russia. gm is introducing 12 new vehicles in russia this year after increasing combined chevrolet, opel and cadillac sales in the country by 53 percent last year to 244,000. gm is making the effort as competitors also stake out claims to the fast-growing market as western europe struggles with a fifth-straight year of declining vehicle sales. akerson is trying to fix opel, which will add five models in russia, while expanding gm's chevrolet and cadillac brands globally. akerson spoke prior to today's planned ceremony in russia for the groundbreaking of gm's factory expansion in st. petersburg. the addition, part of a planned $1 billion investment over the next five years in the country, will more than double the facility's annual capacity to 230,000 vehicles by 2015 and increase gm's russian capacity to 350,000. gm, which didn't specify its investment at the st. petersburg plant, will expand employment there by 60 percent to 4,000, gm said in a statement today. the factory also makes chevrolet models. the russian auto market reached 2.9 million vehicles in 2008 before falling to 1.5 million in 2009, according to pricewaterhousecoopers llp. vehicle sales in the country, which gained 39 percent to 2.65 million last year, will probably increase to more than 3 million this year or next, akerson said. $16.4 billion \"we're going to push north of 10 percent share this year,\" <mark>tim lee</mark>, president of gm's international operations, which includes russia, said during an interview in april, referring to the company's market share targets in russia. \"we're selling 300,000 units\" this year. gm held 9 percent of the market in 2011, according to a filing. increasing opel sales in russia will be a short-term help for gm while it works to implement a long-term fix for its western european operations, akerson said. \"anything we can produce and ship here is going to be an offset,\" he said of opel. \"we're making money here with opel.\" gm announced last week that it wants to close its bochum, germany, assembly plant and to delay pay raises to workers as part of efforts to stem european losses, which have totaled $16.4 billion since 1999. the company is in talks with labor unions about the proposed closure. opel's \"trajectory'\" we hope we can exit this uncertainty and negative bias in western europe over the next couple of years and have a real good european business, \"akerson said. part of the strategy calls for opel's\" rapid market share growth \"in russia and increasing annual sales of the brand in china to 20,000 from 5,000. gm sold about 67,600 opel vehicles in russia last year, down from 98,800 in 2008. that 32 percent decline was less than the market's 48 percent plunge. opel is\" on that kind of trajectory right now \"to return to 2008 sales levels in russia, <mark>lee</mark> said yesterday in a telephone interview.\" we should be where we were with opel volumes. \"while gm doesn't have\" near term \"plans to build cadillac vehicles in russia, akerson said the automaker wants to expand the brand in the country as part of his goal to increase sales globally. growing chevrolet in russia is gm's primary push, he said. more competition\" it's clear that foreign brands are our primary competitors, \"he said. gm should be able to capture 10 percent to 15 percent of the russian market in upcoming years, warren browne, the former managing head of the company's russian operations, said in a telephone interview.\" it will be one of the highlights of growth for them over the next two or three years, \"browne, now a vice president for consultancy automotivecompass llc, said of russia.\" it will probably end up being the shining star of profitability for the region. \"gm faces increasing competition in russia from other automakers. while chevrolet was the best-selling foreign brand in russia last year with sales gaining 49 percent to 173,484, sales have fallen behind renault this year through may in what's turning out to be a close race between the u.s. and french brands. the two were separated by 932 deliveries, according the association of european business. nissan motor co. (7201) announced plans in may to take majority control of russia's largest automaker, ford motor co. (f) announced deals last year to increase production in russia to take advantage of tax incentives for attracting foreign investment. automakers may import components with zero or 3 percent duties in return for investment agreements to build at least 300,000 cars locally a year. pricewaterhousecoopers estimates the russian auto market, driven by improving economic conditions fueled by the oil and gas industries, will grow 7 percent this year and reach 3 million units in the near future, rick hanna, global auto leader, said in a telephone interview.\" it's now the second-largest market in europe behind germany, \"he said. gm's investments in russia have helped mend hard feelings following the u.s. automaker's decision in 2009 to kill a deal to sell a majority stake of opel to oao sberbank (sber), russia's biggest lender. akerson, then a new board member after gm's u.s. government-backed bankruptcy reorganization, joined with other directors in opposing the opel sale. no\" pushback' \"there was a lot of turmoil post-bankruptcy,\" akerson said. \"the decision was made prior to the reconstitution of the board and we changed directions. everything i've seen and heard so far, was,\" ok, that's past. past is not prologue .' they see us investing in plant and equipment and jobs here in russia. i haven't gotten any pushback. \"the russian government has set clear tax and regulatory policies, the ceo said.\" i was at a breakfast this morning with basically their cabinet and was impressed with the public expression of civility, continuity and constancy, \"said akerson, who participated in the st. petersburg international economic forum.\" they talk about taxes. taxes will be what the taxes are. you don't have this uncertainty that you see even in the united states. \"to contact the reporter on this story: tim higgins in southfield, michigan, at\" we've got to bring our best game, our best products to this market, \"chief executive officer dan akerson said in a telephone interview yesterday from st. petersburg, russia."}]