[{"articleID": "2012121422_00009103_W", "names": {"David Carter": ["Q1173943", "Q20193403", "Q23304159", "Q28454933", "Q5232204", "Q5232205", "Q5232207", "Q5232208", "Q5232209", "Q5232211", "Q5232212", "Q5232213", "Q58062269", "Q6128819"], "Jim Lampley": ["Q10917065", "Q6196281"]}, "date": "2012-12-14", "url": "http://msnbc.msn.com/id/50203918/ns/local_news-orange_county_ca/", "content": "by michael lev orange county register the orange county register updated 18 minutes ago 2012-12-14t21:48:06 print font: + - how is it that the dodgers and angels can spend money like kardashians on a shopping spree? the answer is hanging on your living-room wall, above the fireplace, staring back at you in hd. \"the gravy train that is local broadcast rights is reshaping our landscape,\" said <mark>david carter</mark>, a professor in usc's marshall school of business and an expert in sports-media matters. the angels already got paid, and the dodgers are about to. their new ownership group is in negotiations with fox sports and time warner cable, and the figures are staggering: a reported $6 billion over 25 years. a source close to the talks described the deal as \"very complicated\" for a number of reasons, including the ever-evolving state of media consumption, the terms of the dodgers' bankruptcy settlement with major league baseball and how that will affect revenue sharing. i won't bore you with all that minutiae. instead, here are the basics you need to know about the dodgers' tv negotiations: the source predicted a deal would get done by the end of this year. the dodgers' current agreement with fox expires after next season. the thought is that that the team won't want to enter 2013 with that sense of uncertainty and a payroll in excess of $200 million. fox will pay the dodgers $39 million in the final year of the current contract. advertise | adchoices advertise | adchoices advertise | adchoices although fox's exclusive negotiating window with the dodgers ended last month, that isn't necessarily a sign the two are set to part ways. it's simply good business for the dodgers to maximize their leverage by creating competition for the team's broadcast rights. it has been reported that the dodgers also are considering launching their own network, but <mark>carter</mark> considers that the least likely option. \"you've got time warner and fox bidding against each other,\" he said. \"who do the dodgers have to leverage against? you can always threaten to go it alone to extract more dollars, but the bigger upside is to have those behemoths negotiate against each other .\" no matter when the deal is finalized, or with whom, the revenue from the tv contract is expected to cover most of the dodgers' ever-expanding payroll. if it is $6 billion over 25 years, that's an average of $240 million per season. \"there's such an utter sense of inevitability that the dollars are going to be massive,\" <mark>carter</mark> said. \"it's pretty clear they're going to have the financial running room to improve the game-day experience, put a competitive team on the field and really resurrect the franchise .\" officials from the dodgers, fox sports and time warner cable declined to comment. lakers down, ratings up executives at time warner cable sportsnet are pleased with the new network's ratings and ad sales thus far. despite the lakers' poor start, or perhaps because of it, ratings for the team's games have grown. between nov. 15, when twc sportsnet became available on directv, and thursday, ratings were up 7 percent compared with lakers games that aired on cable last season. the lakers are in the first year of a 20-year deal with twc after severing ties with fox. execs are especially pleased with the ratings for twc sportsnet's pre - and postgame shows, which are beating last year's by 135 percent. ratings for twc deportes aren't nearly as robust but are showing growth. twc did not expect the spanish-language sister channel to be a huge hit right off the bat. twc sportsnet has surpassed its fourth-quarter ad-sale goals with two-plus weeks to go, network spokesperson amy summers said. remote patrol cbs sports network will broadcast more than 50 hours of original, super bowl-related programming from new orleans before and after cbs' coverage of super bowl xlvii on feb. 3. having major sporting events such as the super bowl, the ncaa tournament and the masters on cbs is a tremendous asset as the network tries to grow its 24-hour sports channel ....\"you don't know bo,\" the latest \"30 for 30\" film on espn, earned a 2.3 rating saturday to become the network's highest-rated documentary. numerous re-airings of the film about two-sport star bo jackson are in the works, mainly on espn classic ....twc has added bein sport to its lineup. the hd version of the new network devoted to international soccer and other sports can be found on channel 378 in the los angeles market. the standard-def version is on channel 278 ....espn revealed its ranking of the top 100 baseball players of all-time this week. the \"hall of 100\" can be found on espn.com's mlb page ....hbo sports will televise a replay of the juan manuel marquez-manny pacquiao fight at 9:30 p.m. pst saturday. additional bouts follow. the night wraps up with a new episode of \"the fight game with <mark>jim lampley</mark>.\" ...espn will discontinue its \"bracketbusters\" college basketball series after this season, the network announced. this season's \"bracketbusters\" will be held feb. 22-23. contact the writer: mlev @ ocregister.com hamilton's highlights: new angel's career chronology hamilton's strikeout rate, plate discipline were problems in 2012 whicker: angels deal rangers a power outage bryant plays through back spasms in loss to knicks"}, {"articleID": "2011081323_00060459_W", "names": {"Matt Smith": ["Q1882744", "Q20713866", "Q24809160", "Q27074050", "Q30123100", "Q312385", "Q3299556", "Q3852033", "Q40281443", "Q43091034", "Q54152850", "Q6789356", "Q6789357", "Q6789358", "Q6789359", "Q6789360", "Q6789363", "Q6789364", "Q6789365", "Q6789366", "Q6789367", "Q6789368", "Q6791245"], "Crystal Harris": ["Q13643654", "Q454813"]}, "date": "2011-08-13", "url": "http://mirror.co.uk/celebs/news/2011/08/14/daisy-lowe-poses-in-sexy-undies-for-playboy-magazine-115875-23342696/", "content": "daisy lowe (pic: playboy enterprises inc) lowe and behold, here's daisy giving us a saucy? reminder of her name...as if anyone could forget .> and daisy lowe does looks blooming lovely as she poses in sexy undies for a playboy magazine shoot. the 22-year-old model, who is dating doctor who star <mark>matt smith</mark>, stripped off completely in other pictures for the magazine. she describes nude modelling as \"freeing\" - and loved every minute of the shoot. \"i'm really proud of being the poster girl for curves,\" she says. \"i'm proud of my shape. we need to have real? characters that women can relate to and look up to .\" yet daisy says her life is pretty boring despite her rock 'n' roll heritage - her mum is notorious rock chick pearl lowe, who was a heroin addict for years and is married to supergrass's danny goffey. while her dad is bush frontman gavin rossdale,? now married to gwen? stefani. daisy says she's a real homebody who's in bed by? midnight and that hasn't changed since she moved in with 29-year-old <mark>matt</mark>. \"i guess you can't deny my rock 'n' roll heritage,\" she says. \"both my parents - or all four of them - have done well in the music scene .\" but when it comes to drugs i just think, \"cool, thanks for learning that lesson for me, mum, because i don't want to learn that stuff myself .'\" people think rock chick is code for \"parties hard' - but i don't .\" looking at these pictures we reckon <mark>matt</mark> is hardly complaining about all those early nights...doctor who star <mark>matt smith</mark> gets girlfriend daisy lowe to move in <mark>crystal harris</mark> says sex with playboy mogul hugh hefner \"lasted two seconds\" it's sex o'clock and please don't be angry, but...we heart a ginge! boring glee girl attempts to become less boring by dying hair pink sexy freida pinto on slumdog, dev patel and monkeying around in the rise of the planet of the apes eastenders star sid owen and on-off fianc? e polly parsons on holiday in mallorca it's a little bit soon, perhaps, but glee have done an amy winehouse tribute a video of kanye west to make you lol rather than grrr, for once it's sex o'clock and please don't be angry, but...we heart a ginge! boring glee girl attempts to become less boring by dying hair pink"}, {"articleID": "2017062811_00346398_W", "names": {"John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"], "Mike Tyson": ["Q30122587", "Q6849116", "Q79031"], "Eric Holder": ["Q312644", "Q3591180"], "Katie Holmes": ["Q174346", "Q6377464"]}, "date": "2017-06-28", "url": "http://qctimes.com/now/today/history/today-in-history-june-affordable-care-act/collection_09b6804a-034f-548f-b74e-0540a3587906.html", "content": "Today is Wednesday, June 28. Today's Highlights in History: 1 of 19 1 2012: Affordable Care Act AP Updated 22 hrs ago Five years ago: The Affordable Care Act narrowly survived, 5-4, an election-year battle at the U.S. Supreme Court with the improbable help of conservative Chief Justice <mark>John Roberts</mark>. 2 1836: James Madison AP Updated 22 hrs ago In 1836, the fourth president of the United States, James Madison, died in Montpelier, Virginia. 3 1914: Archduke Franz Ferdinand AP Updated 22 hrs ago On June 28, 1914, Archduke Franz Ferdinand of Austria and his wife, Sophie, were shot to death in Sarajevo (sah-ruh-YAY' - voh) by Serb nationalist Gavrilo Princip (gavh-REE' - loh PREEN' - seep)--an act which sparked World War I. 4 1919: Treaty of Versailles AP Updated 22 hrs ago In 1919, the Treaty of Versailles (vehr-SY') was signed in France, ending the First World War. In Independence, Missouri, future president Harry S. Truman married Elizabeth Virginia Wallace. 5 1939: Pan American Airways AP Updated 22 hrs ago In 1939, Pan American Airways began regular trans-Atlantic air service with a flight that departed New York for Marseilles, France. 6 1944: Thomas E. Dewey AP Updated 22 hrs ago In 1944, the Republican national convention in Chicago nominated New York Gov. Thomas E. Dewey for president and Ohio Gov. <mark>John</mark> W. Bricker for vice president. 7 1950: Seoul, South Korea AP Updated 22 hrs ago In 1950, North Korean forces captured Seoul (sohl), the capital of South Korea. 8 1964: Malcolm X AP Updated 22 hrs ago In 1964, civil rights activist Malcolm X declared, \"We want equality by any means necessary\" during the Founding Rally of the Organization of Afro-American Unity in New York. 9 1978: Supreme Court AP Updated 22 hrs ago In 1978, the Supreme Court ordered the University of California-Davis Medical School to admit Allan Bakke (BAHK' - ee), a white man who argued he'd been a victim of reverse racial discrimination. 10 1989: Battle of Kosovo AP Updated 22 hrs ago In 1989, about 1 million Serbs gathered to mark the 600th anniversary of the Battle of Kosovo in 1389. 11 1997: Evander Holyfield & <mark>Mike Tyson</mark> AP Updated 22 hrs ago In 1997, in a wild rematch, Evander Holyfield retained the WBA heavyweight boxing championship after his opponent, <mark>Mike Tyson</mark>, was disqualified for biting Holyfield's ear during the third round of their fight in Las Vegas. 12 2007: \"Burn Notice\" AP Updated 22 hrs ago Ten years ago: The TV series \"Burn Notice,\" starring Jeffrey Donovan as a spy left out in the cold, premiered on USA Network. 13 2007: George W. Bush AP Updated 22 hrs ago Ten years ago: President George W. Bush's immigration plan to legalize as many as 12 million immigrants while fortifying the border collapsed in the Senate. 14 2007: Supreme Court AP Updated 22 hrs ago Ten years ago: The U.S. Supreme Court voted 5-4 to strike down school integration plans in Louisville, Kentucky, and Seattle, a decision that was denounced hours later by Democratic presidential candidates in their third primary debate. 15 2012: <mark>Eric Holder</mark> AP Updated 22 hrs ago Five years ago: Attorney General <mark>Eric Holder</mark> became the first sitting Cabinet member held in contempt of Congress, a rebuke pushed by Republicans seeking to unearth the facts behind a bungled gun-tracking operation known as Fast and Furious. (The vote was 255-67, with more than 100 Democrats boycotting .) 16 2012: <mark>Katie Holmes</mark> & Tom Cruise AP Updated 22 hrs ago Five years ago: <mark>Katie Holmes</mark> filed for divorce from Tom Cruise after 5 years of marriage. 17 2012: Wimbledon Tennis AP Updated 22 hrs ago Five years ago: At Wimbledon, 2-time champion Rafael Nadal was overpowered in the second round by Lukas Rosol, a Czech ranked No. 100, 6-7 (9), 6-4, 6-4, 2-6, 6-4. 18 2016: Ataturk Airport AP Updated 22 hrs ago One year ago: Three suicide bombers armed with assault rifles stormed Istanbul's Ataturk airport, killing 44 victims and wounding nearly 150; no one claimed responsibility, but Turkish official said they suspected the Islamic State group. 19 2016: House Benghazi Report AP Updated 22 hrs ago One year ago: House Republicans concluded their $7 million, two-year investigation into the deadly attacks in Benghazi, Libya, with fresh accusations of lethal mistakes by the Obama administration but no \"smoking gun\" pointing to wrongdoing by Hillary Clinton, who said the report \"found nothing, nothing to contradict\" the findings of earlier investigations. More like this...Close 1 of 19 AP Five years ago: The Affordable Care Act narrowly survived, 5-4, an election-year battle at the U.S. Supreme Court with the improbable help of conservative Chief Justice <mark>John Roberts</mark>. AP In 1836, the fourth president of the United States, James Madison, died in Montpelier, Virginia. AP On June 28, 1914, Archduke Franz Ferdinand of Austria and his wife, Sophie, were shot to death in Sarajevo (sah-ruh-YAY' - voh) by Serb nationalist Gavrilo Princip (gavh-REE' - loh PREEN' - seep)--an act which sparked World War I. AP In 1919, the Treaty of Versailles (vehr-SY') was signed in France, ending the First World War. In Independence, Missouri, future president Harry S. Truman married Elizabeth Virginia Wallace. AP In 1939, Pan American Airways began regular trans-Atlantic air service with a flight that departed New York for Marseilles, France. AP In 1944, the Republican national convention in Chicago nominated New York Gov. Thomas E. Dewey for president and Ohio Gov. <mark>John</mark> W. Bricker for vice president. AP In 1950, North Korean forces captured Seoul (sohl), the capital of South Korea. AP In 1964, civil rights activist Malcolm X declared, \"We want equality by any means necessary\" during the Founding Rally of the Organization of Afro-American Unity in New York. AP In 1978, the Supreme Court ordered the University of California-Davis Medical School to admit Allan Bakke (BAHK' - ee), a white man who argued he'd been a victim of reverse racial discrimination. AP In 1989, about 1 million Serbs gathered to mark the 600th anniversary of the Battle of Kosovo in 1389. AP In 1997, in a wild rematch, Evander Holyfield retained the WBA heavyweight boxing championship after his opponent, <mark>Mike Tyson</mark>, was disqualified for biting Holyfield's ear during the third round of their fight in Las Vegas. AP Ten years ago: The TV series \"Burn Notice,\" starring Jeffrey Donovan as a spy left out in the cold, premiered on USA Network. AP Ten years ago: President George W. Bush's immigration plan to legalize as many as 12 million immigrants while fortifying the border collapsed in the Senate. AP Ten years ago: The U.S. Supreme Court voted 5-4 to strike down school integration plans in Louisville, Kentucky, and Seattle, a decision that was denounced hours later by Democratic presidential candidates in their third primary debate. AP Five years ago: Attorney General <mark>Eric Holder</mark> became the first sitting Cabinet member held in contempt of Congress, a rebuke pushed by Republicans seeking to unearth the facts behind a bungled gun-tracking operation known as Fast and Furious. (The vote was 255-67, with more than 100 Democrats boycotting .) AP Five years ago: <mark>Katie Holmes</mark> filed for divorce from Tom Cruise after 5 years of marriage. AP Five years ago: At Wimbledon, 2-time champion Rafael Nadal was overpowered in the second round by Lukas Rosol, a Czech ranked No. 100, 6-7 (9), 6-4, 6-4, 2-6, 6-4. AP One year ago: Three suicide bombers armed with assault rifles stormed Istanbul's Ataturk airport, killing 44 victims and wounding nearly 150; no one claimed responsibility, but Turkish official said they suspected the Islamic State group. AP One year ago: House Republicans concluded their $7 million, two-year investigation into the deadly attacks in Benghazi, Libya, with fresh accusations of lethal mistakes by the Obama administration but no \"smoking gun\" pointing to wrongdoing by Hillary Clinton, who said the report \"found nothing, nothing to contradict\" the findings of earlier investigations. More like this...Tags Sweeps Wire A Twitter List by qctimes"}, {"articleID": "2009082401_00055404_W", "names": {"Thomas Howard": ["Q3525214", "Q53627021", "Q7790845", "Q7790848"], "Michael Robinson": ["Q1929070", "Q27922521", "Q28659824", "Q3856249", "Q6833916", "Q6833917", "Q6833918"], "Greg Ellis": ["Q1332872", "Q18164749", "Q5605529", "Q940850"], "Kirk Morrison": ["Q3197382", "Q6415497"], "Ricky Brown": ["Q30612335", "Q3935045", "Q7332046"]}, "date": "2009-08-24", "url": "http://examiner.com/a-2182705~Leaky_run_defense_once_again_problem_for_Raiders.html", "content": "leaky run defense once again problem for raiders glen coffee burst up the middle for 18 yards to end the first quarter. he sprinted around right end for 18 more to start the second quarter. he went 35 yards to the left side on his next carry in a stretch that he said reminded him of high school. oakland raiders, which still had most of its starters in the game at the time. after spending much of the offseason trying to improve a leaky run defense, oakland was exposed by the san francisco 49ers on saturday. now the raiders have three weeks to get things right before san diego chargers arrive for opening night. \"i don't know if you are going to sell the farm and move, but there is definitely concern, definitely things we have to clean up,\" linebacker <mark>thomas howard</mark> said. \"i was disappointed with the run. things need to change. things must be cleaned up, definitely .\" since going to the super bowl following the 2002 season, oakland has had the worst run defense in the nfl, allowing 141.7 yards per game on the ground and 122 touchdowns rushing. the raiders have allowed a 100-yard rusher in more than half of their games the past three years, with journeymen backs such as kolby smith reaching the mark. after watching a third-round rookie, coffee, gash them for 129 yards on 16 carries, and a sometime fullback in <mark>michael robinson</mark> add 97 more on 14 carries, it's back to work for the raiders. oakland gave up 275 yards on 47 carries, with star frank gore providing only 7 on his two carries. \"i thought we had some guys not play very well,\" coach tom cable said sunday. \"we have to do a better job adjusting to it as coaches, and then, two, i think you have to at some point set your jaw and decide you're not going to get your rear end kicked like that .\" what was particularly galling for oakland was the niners kept hitting them with the same play, pulling offensive linemen around the end to create big holes. the raiders were unable to make the needed adjustments during the game to solve those issues. \"we are just going to look at it, and i'm pretty sure the coach is going to come up with a solution to make sure that doesn't happen again,\" defensive end <mark>greg ellis</mark> said. \"it wasn't like they were able to run any play and get yards on us; that one play we just didn't handle well. then they did what anybody should do, they kept repeating it, one side to another, and they kept having success with it .\" the raiders will have to shore up their run defense without their leading tackler from the past three seasons for about two weeks. linebacker <mark>kirk morrison</mark> dislocated his left elbow in the first quarter and will miss two weeks. <mark>morrison</mark> could play in the final exhibition game at seattle on sept. 3, or more likely wait until the season opener. <mark>morrison</mark> was already in danger of losing his starting job to <mark>ricky brown</mark>, who had seven tackles and an interception saturday. cable said <mark>morrison</mark> was in the lead at the time of the injury. \"we have a few things to shore up, but we have a good system in place,\" <mark>brown</mark> said. \"once everybody buys into it, the sky's the limit for us, you'll see .\" jon alston for the starting strongside spot, or be a valuable reserve at both places. <mark>brown</mark> and alston split time last season. copyright 2009 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2011070923_00076666_W", "names": {"John Daly": ["Q203831", "Q25190176", "Q382487", "Q389438", "Q50557115", "Q6228468", "Q6228481"], "Steve Marino": ["Q7613259", "Q7613260"], "Mark Wilson": ["Q1388440", "Q15990366", "Q16196771", "Q1922662", "Q19661240", "Q1993337", "Q20022466", "Q28059691", "Q3849582", "Q42717787", "Q44270625", "Q47542215", "Q50294072", "Q55704489", "Q6770379", "Q6770380", "Q6770381", "Q6770382", "Q6770383", "Q6770384", "Q6770385"], "Kyle Stanley": ["Q2314127", "Q6451459"], "Amy Anderson": ["Q18637100", "Q4749070"]}, "date": "2011-07-10", "url": "http://scotsman.com/sport/Chez-Reavie-races-to-remarkable.6798933.jp", "content": "american chez reavie, red-hot with his putter, flirted with a magical 59 before bogeying his final hole to claim a two-shot lead in the second round of the <mark>john</mark> deere classic in silvis, illinois. displaying scintillating form on the greens on another surprisingly calm day at the tpc deere run, reavie fired a sparkling nine-under-par 62 to post a 14-under total of 128. world number five steve stricker, in pursuit of a third consecutive vic advertisement tory at deere run, also made the most of the ideal scoring conditions, a sizzling 64 lifting him into second place with compatriot <mark>steve marino</mark> (66). venezuela's jhonattan vegas (64) was a further two strokes back at ten under, level with americans <mark>mark wilson</mark> (67) and <mark>kyle stanley</mark> (67), and zimbabwe's brendon de jonge (66). reavie, who had raced to the turn in a sizzling five-under 31, then bogeyed his final hole of the day after his approach at the par-four ninth ended up in a greenside bunker. \"i pitched it out to about six feet and hit a good putt,\" he said of his finish. \"i just didn't play enough break .\" the cut fell at four-under 138 with british open champion louis oosthuizen of south africa and double major winner <mark>john daly</mark> among those failing to advance.n south korea's kim in-kyung took control of the thunderstorm-delayed us women's open by moving two strokes clear after 14 holes before darkness halted play in the second round. kim, 23, and bidding for her first major title, was at four under par overall, having opened with a one-under 70 on the east course at the broadmoor. tied for second place at were americans wendy ward, after 15 holes, first-round leader stacy lewis, after 16, and unheralded amateur <mark>amy anderson</mark>, who was yet to tee off in the second round. only 33 players managed to complete the 36 holes, including clubhouse leaders angela stanford (70) and fellow american lizette salas (73) who both finished at even-par 142. paula creamer, the defending champion, kept herself in the mix after opening with a 72 and was one under for the tournament after 16 holes. however, taiwan's world no. 1 yani tseng seemed somewhat out of sorts, particularly with her putting. having opened with a 73, tseng was seven shots off the pace after 16 holes. hawaiian michelle wie, who has not finished in the top 10 of a major since 2006, was in serious danger of missing the cut after battling to a 78."}, {"articleID": "2020033123_00029844_W", "names": {"Joseph Cohen": ["Q19629750", "Q28703566"]}, "date": "2020-03-31", "url": "http://ctpost.com/news/education/article/Marshall-held-boot-camp-for-faculty-for-online-15167961.php", "content": "https: //www.ctpost.com/news/education/article/Marshall-held-boot-camp-for-faculty-for-online-15167961.php Justice admits travel order may be unconstitutional Anthony Izaguirre, Associated Press Updated 6:57 pm EDT, Tuesday, March 31, 2020 West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as West Virginia remains the last state in the U.S. without a confirmed case. (F. Brian Ferguson/Charleston Gazette-Mail via AP) less West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as...more Photo: F. BRIAN FERGUSON, AP Photo: F. BRIAN FERGUSON, AP Image 1 of / 7 Caption Close Image 1 of 7 West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as West Virginia remains the last state in the U.S. without a confirmed case. (F. Brian Ferguson/Charleston Gazette-Mail via AP) less West Virginia Gov. Jim Justice speaks during a news conference at the State Capitol in Charleston, W. Va., Monday March 16, 2020. Justice declared a state of emergency in response to the new coronavirus, even as...more Photo: F. BRIAN FERGUSON, AP Justice admits travel order may be unconstitutional 1 / 7 Back to Gallery CHARLESTON, W. Va. (AP)--West Virginia Gov. Jim Justice on Tuesday acknowledged that his directive to have police monitor roads and check in on travelers from coronavirus hotspots might be unconstitutional but he said it will continue for safety reasons. Justice has issued an executive order mandating that people entering the state from places hard-hit by the virus must quarantine for two weeks or face an obstruction charge, saying authorities will watch roads and conduct home checks to make sure people comply. \"If they don't quarantine themselves for 14 days, you know, I'm going to take a big time issue with it, and I may lose at the end of the day but I'm going to try to protect our people,\" Justice, a Republican, said in response to a question about the legality of the directives. The instruction triggered constitutional concerns almost immediately, with the leader of the American Civil Liberties Union of West Virginia saying the order was overly broad and could violate constitutional rights on unreasonable searches and seizures. \"From a real practical standpoint it's hard to imagine how they would enforce this order without violating the Fourth Amendment,\" <mark>Joseph Cohen</mark>, executive director of the ACLU chapter, said in an interview. The order, which went into effect Tuesday, follows similar moves by governors in Rhode Island, Texas, Florida, Maryland and South Carolina, at least one of which triggered constitutional concerns over whether it is legal to pull someone over on the basis of the origin state of his or her license plate. Justice said it's important for people entering the state from New York, New Jersey, Louisiana, Connecticut, Italy or China to self-isolate and that he \"wants to be really respectful of constitutional rights but people are dying all over this country right and left .\" Clay Marsh, a high-ranking West Virginia University health official tapped to lead the state's coronavirus response, said the self-quarantine directive is in line with federal guidance but did not mention the order's criminal and policing components. The directive allows for people who are under the ordered quarantine to leave to get food or medical attention. It doesn't apply to people traveling into West Virginia for work, health, emergency or essential business purposes. At least 162 people in West Virginia have the virus, with a total of 4,143 residents have tested, state health officials said Tuesday. The state reported its first virus fatality on Sunday, with the death of an 88-year-old Marion County woman. West Virginia was the last U.S. state to report a confirmed case, though Justice attributed that to a lack of testing. Testing remains limited, meaning most people now spreading the highly contagious virus may not know they have been infected, and state health officials have admitted their count lags behind the actual total as results pour in from counties around the state. A statewide stay-home order that directed all nonessential businesses to close went into effect last week, intensifying previous moves by Justice, who has ordered the closure of bars, restaurants, casinos, gyms, health clubs, recreation centers, barbershops, nail salons and hair salons. Schools statewide are closed until at least April 20. Justice on Tuesday also announced he was banning elective surgeries and closing private campgrounds to new arrivals from people who aren't from West Virginia, which he said was intended to further deter visitors. In addition, the governor quietly signed an executive order eliminating a rule requiring that medical professionals conduct an in-person screening before refilling an opioid prescription. Justice did not mention the order at his news conference. It says that the state boards of nursing and medicine identified the rule as burdensome during the ongoing state of emergency. For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks, and the overwhelming majority of people recover. But severe cases can need respirators to survive, and with infections spreading exponentially, hospitals across the country are either bracing for a coming wave of patients, or already struggling to keep up. ___ Follow AP coverage of the virus outbreak at https: //apnews.com/VirusOutbreak and https: //apnews.com/UnderstandingtheOutbreak. Most Popular 1 CT grocery chains to limit number of shoppers in stores 2 CT National Guard starts new coronavirus \"missions' 3 Town-by-town breakdown: Coronavirus cases in CT 4 Coronavirus in Connecticut: Live updates, hour-by-hour 5 CT cases reach 2,571; New Haven, Mohegan Sun eyed for overflow 6 How many get infected: The coronavirus infection rate in CT 7 CTbanks agree to delays for mortgage payments, foreclosures Connecticut Post View Comments © 2020 Hearst Communications, Inc. ."}, {"articleID": "2017101614_00384035_W", "names": {"Rhys Webb": ["Q1118053", "Q7321844"], "Simon Thomas": ["Q14475873", "Q3405148", "Q46586417", "Q58327033", "Q59554832", "Q7519887", "Q7519889"], "Paul Williams": ["Q11339500", "Q1375801", "Q14948624", "Q15441162", "Q15452843", "Q15990362", "Q18746544", "Q1933480", "Q19517939", "Q30165049", "Q3898170", "Q43082028", "Q50365751", "Q52645093", "Q542332", "Q55294657", "Q59094558", "Q7154382", "Q7154384", "Q7154386", "Q7154387", "Q7154392", "Q7154396", "Q7154397", "Q7154398", "Q7154399", "Q7154401", "Q7154402", "Q7154407", "Q927415"]}, "date": "2017-10-16", "url": "http://www.theweek.co.uk/rugby-union/89036/gatland-s-law-scrapped-rhys-webb-told-he-won-t-play-for-wales", "content": "Oct 16, 2017 The WRU has changed its player selection policy for Test matches whatsapp facebook twitter google + linkedin email Stu Forster/Getty Images <mark>Rhys Webb</mark> in action for Wales against Scotland in the RBS Six Nations The Welsh Rugby Union (WRU) has scrapped the so-called \"Gatland's Law'--and this is bad news for star scrum-half <mark>Rhys Webb</mark>. See related Rugby in crisis: potential strike amid injury and mental health fears Gatland's Law--or as WalesOnline puts it, the WRU Senior Players Selection Policy--was introduced by head coach Warren Gatland to keep Test stars playing in Wales and bar them from international Test matches if they played outside Wales. WalesOnline says the law states that\" only players who play in Wales will be eligible for selection to the national squad \". These rules changed today. Under the new system, stars playing outside Wales will only be available for international selection if they have won 60 caps or more. The rule change does not apply to players with less than 60 caps if they are already playing outside Wales. One player who will be hit by the rule change is British & Irish Lions star <mark>Webb</mark>, who will join French side Toulon next season. Because he has won only 28 caps he will now miss out on Wales selection. Big breaking news as Gatland's Law is scrapped and a 60-cap rule introduced. <mark>Rhys Webb</mark> the big casualty. https: //t.co/njTEbhC1Aq--<mark>Simon Thomas</mark> (@ simonrug) October 16, 2017 Fly-half Dan Biggar is another player who could soon be out of the Wales set-up. He's currently on 56 appearances, but with a move to Northampton lined up next season he would need another four caps to remain in contention. When asked about the change, WRU chief executive Martyn Phillips told ITV Sport:\" Whatever contract that a player is in today, that contract is protected. When that contract expires and if the player has less than 60 caps, they would not be eligible for selection. \"If they have 60 or more caps and they are outside Wales they would be .\" He says the existing policy didn't work well enough and was \"quite complicated\". The aim, he says, is to make it simpler. \"We have tried to step back and say:\" let's try to simplify this' make it understandable for players, for supporters and try and give each of the five entities [four regions and Wales] access to the players they need. \"Wales head coach Gatland said:\" For me as a national coach, if I was being perfectly selfish, would I have a policy? No I wouldn't. It is not about me or the national team, it is about what is the best thing for Welsh rugby? He says the best thing is to try and keep the best players in Wales for \"as long as we possibly can\". While being aware of pressure from market forces, he says the new policy is \"pretty much black and white\". On social media some Wales supporters are furious about a rule change that will see their \"best player\" <mark>Webb</mark> miss out on selection. Sandra Loy called it a \"big decision\" by the WRU. Wow. Big decision, that #GatlandsLaw https: //t.co/QAKUT3BAiF--Sandra Loy (@ SandraLoy1) October 16, 2017 <mark>Webb</mark> has been thrown \"under the bus\" by the WRU, said one fan. Nice of the WRU to throw <mark>Rhys Webb</mark> under a bus. What a charming way to treat a fine player and British Lion. Says much of the organisation--PhilBB (@ rugbyPhilBB) October 16, 2017 Rugby World magazine writer <mark>Paul Williams</mark> feels for <mark>Webb</mark>. I genuinely feel for <mark>Rhys Webb</mark> 10 years service in Wales 145 caps for the Ospreys Yet apparently not even told about the '60 cap change'--<mark>Paul Williams</mark> (@ thepaulwilliams) October 16, 2017 These fans were more sarcastic in their reply to the news ...% u201CHey Warren, how good is <mark>Rhys Webb</mark>?% u201D% u201CWell, he% u2019s our best player, why?% u201D% u201CHow about, we make a rule that means you cant select him anymore?% u201D--Tom Albrighton (@ tmalbrghtn) October 16, 2017 <mark>Rhys Webb</mark>: * plays well enough to get recruited by one of Europe's top teams * WRU: on yer bike Top player development, that--Gareth (@ garethleaman) October 16, 2017 But Rugby Studio claims <mark>Webb</mark> knew that the rule would be changed. <mark>Rhys Webb</mark> was supposedly aware of the rule coming into place and still chose to move overseas--RugbyStudio (@ RugbyStudioblog) October 16, 2017 Advertisement Sign up for our daily newsletter Newsletter Close Sign me up Read more: Rugby Warren Gatland Sport You are here: Home rugby union \"Gatland's Law' scrapped: <mark>Rhys Webb</mark> told he won't play for Wales Advertisement Related Articles rugby union\" Gatland's Law' scrapped: <mark>Webb</mark> told he won't play for Wales rugby union Rugby in crisis: potential strike over extended season rugby union World Rugby hits back at \"alarmist' school rugby study rugby union Experts call for tackling and scrum ban in school rugby rugby union Billy Vunipola ruled out for four months Lions tour 2017 Lions officials angered by Sean O’Brien's criticism rugby union Billy Vunipola warns rugby players could go on strike rugby union England target the All Blacks and their No. 1 spot Advertisement"}, {"articleID": "2018101104_00024471_W", "names": {"Norman Wong": ["Q58337123", "Q7052960"], "Dave Robinson": ["Q1173329", "Q15043151", "Q5229706"]}, "date": "2018-10-11", "url": "http://www.undertheradarmag.com/interviews/fucked_up_vs_devo/", "content": "The Full Transcript of a Conversation Between Damian Abraham and Mark Mothersbaugh Jul 28, 2010 Web Exclusive By Matt Fink Photography by <mark>Norman Wong</mark> Damian Abraham (aka Pink Eyes) doesn't figure to be the type of person who gets starstruck easily, having earned his reputation with fearless and frenzied performances as the burly frontman of Toronto's Fucked Up. But when speaking with Devo vocalist and multi-instrumentalist Mark Mothersbaugh, Abraham is all nervous energy, unleashing a cascade of words that tangle and circle back on themselves, and winding through explanations of his introduction to Devo through his dad's record collection to the origins of the Pink Eyes moniker and the evolution of his prodigious beard. Eventually, he settles and gets around to actually asking Mothersbaugh some questions, revealing himself to be a pop music scholar with an encyclopedic knowledge of rock history and Devo's place in it. With Devo's Something for Everybody--their first new record in 20 years--taking them everywhere from The Colbert Report to Live with Regis and Kelly, Abraham offers a refresher course on why Devo still matters in this uncut transcription of their interview (a shorter version of which appears in our Summer 2010 issue). Damian Abraham: Well, I'm a big fan, so I'll get started. Mark Mothersbaugh: I'm honored, sir. Damian: Believe me, the honor is all mine. I was talking about the fact that my son is really into the music, but you're still singing about very dark subject matter, and there's a lyrical depth that was lost on me growing up. And it wasn't until listening to Devo after I'd been to school and done some reading and seen the world a little bit that I realized how deep the lyrics were. Was it the music or the lyrics that drove Devo's focus in the beginning? Mark: Well, I think what you're referring to in the lyrics is just talking about de-evolution and the human condition as we feel like we see it. Our vision of that was shaped largely by our time in school. We're older than your parents probably, because Gerry [Casale] and I went to Kent State in the ’70s. In 1970, we were there for the shootings at Kent State, and on that day we really realized that even in a democracy you really don't have freedom of choice. And we came to the decision that rebellion was obsolete, that you could always get beaten down by Big Brother, but if you really wanted to affect change in our culture, you had to employ techniques of subversion. So we talked about serious things, but we talked about them with a sense of humor and made it so that it was hard to attack on some levels, and it was not always evident. Innocent little kids like yourself could take on a song like \"Freedom of Choice,\" and it might not be until years later that you realize that the end is \"freedom of choice is what you got/but freedom from choice is what you want .\" Damian: It's interesting to hear you say this, because this week in Toronto--I don't know how much it was covered in the States--but the G20 was happening. And once again it was the typical refrain where people have peaceful protests--and there were agitators there, as well--but the people having the peaceful protests wound up thrown in jail. There's a shocking, really telling video on YouTube right now of a group of protesters very peacefully singing \"O Canada,\" and as soon as they sit down the police phalanx charges them, pushing them down, busting heads. So it's amazing how here we are 30, 40 years on from Kent State, and it still resonates in a very real way. Mark: Isn't it true? For us, we looked around and we were saying, \"Who really does affect change in our culture? Who is really successful at it?\" And we looked at Madison Avenue and we looked at TV commercials, and we said, \"Those people really change the way people think without them even knowing it .\" And usually it was for bad things. Madison Avenue sells a lot of shit to people every day. But [those were] the techniques that we were interested in and what we wanted to employ. So it was with great happiness when back in 1976 we had made this film called The Truth About De-evolution, and there was nowhere to show it because there was no such thing as MTV, so we talked the Akron Art Institute into letting us show this seven-and-a-half minute film. And I remember afterwards this woman who came up to me and she was really livid. She goes, \"I saw what you're doing! I know what you're doing with that film!\" And we're like, \"Huh?\" And we think she's upset because Gerry and I have on rubber monkey masks and we're paddling a woman...and she's going to say, \"Oh, you're misogynists,\" or something like that. And she goes, \"I saw exactly what you're doing. I saw subliminal words flash by the screen: submit and obey .\" And we're both like, \"What a great idea!\" It made us feel like we were onto something at that point. So we've always played around with that. As soon as we got a record deal, we incorporated. We became \"Devo Incorporated .\" We tried to blur the line between pop art and commercial art on purpose. Damian: I think the thing about Devo that has always been so interesting is that from the very beginning--and obviously I wasn't around to witness that, but subsequently I've been reading on it--the process is so involved. There actually is a process. With a lot of bands, the music just comes to be, almost by some weird accident. But with Devo, it always seems to be operating on two or three different levels. Mark: We were shitty musicians, so that was part of it. But we talked about things, too. A lot of bands, they're even distrustful of that, and they feel like the only way for what they really feel to come out is to be nonverbal about it, and I respect that. I love The Ramones. They were one of the best bands ever in the world, and I know that they would definitely back down from any kind of claims of any intellectual overtones to what they were doing. Yet they were one of the smartest bands ever. With Devo, we did talk about things, and we did talk about what was going on. We were trying to figure out what we thought was going on. We were in this cultural wasteland in the Midwest, where it was a factory town. Akron, Ohio, they made rubber tires. We could see everything that was going on in the world. We knew there was a Haight-Ashbury and a Carnaby Street and a Sunset Boulevard and a Village in Manhattan. We knew there was a Velvet Underground and Iggy Pop and people around the world doing interesting things. But you never saw them in Akron. You just heard about them. So we spent a lot of time there just talking. We did a lot of talking and trying to figure out what we were seeing long distance. Damian: It's funny you mention The Ramones, because I think a lot of people--myself included--thought about The Ramones being year zero for new rock and roll. But you guys actually predate The Ramones. The Ramones didn't really play their first shows until ’75 or start rehearsing until' 74, and you guys had already started recording and playing shows in' 74. But it's almost like that was Ohio at that time...Mark: Yeah, in Ohio, you could have lived and died there and no one would know it, and it really wasn't until ’77 that we actually drove to New York and play Max's [Kansas City] and CBGB's, and that kind of changed things for us. Damian: How close were you to the stuff that was going on in Cleveland at the time? The Rocket from the Tombs and The Electric Eels and all that stuff that was happening almost simultaneously? Mark: Yeah, we were friends with The Dead Boys and Pere Ubu and Peter Laughner. As a matter of fact, there were only two clubs in Ohio that you could play original music at, and one was Pirate's Cove up in Cleveland, and one was The Crypt in Akron. And those guys would come down to The Crypt and play, and we'd go up to Pirate's Cove and play, and that was all you could do or you had to leave the state. Otherwise, you had to lie and say you were a Top 40 band, and somewhere about song seven, we'd be going, \"Hi. We'd like to do another by Foghat. This one is called\" Mongoloid. \"' And then right about then, there'd be some Vietnam vet who was unemployed and bummed out, and he'd say,\" OK, that's it! \"And he'd slam his beer on the table and he'd come up and start fist fighting with us, and the club owner would say,\" OK, you guys can leave now. \"And I'd go,\" No! We got another set to go! \"And he'd say,\" No, no. . That's OK. You don't have to play the next set. Just please go before my place gets torn apart. \"Damian: It seems like at that time a lot of those bands--having read about Electric Eels performances and stuff--there was almost a deliberate agitation of the crowd. And with the Devo records, it never seemed like what the audience wanted was what you wanted to give them. But with the new record, you opened it up for the fans to help you make the record. Was there an epiphany moment when you decided to democratize or did you think that audiences are a little more worldly than they were back then? Mark: Well, also, it's like the world caught up and passed us. We're no longer ahead of our time. There's crazier music. I don't know if there's anything shocking happening right now, except maybe guys that go out on tour and come home and kill themselves because they did their tour and they're done. It's almost like you have to do that. You have to blow yourself up to be shocking at this point. When nothing is shocking, it's easier to be a little less insular about what you're doing. We have a historical side to us, so people know who Devo was. Not everybody, but there are people that do, and they say,\" Oh yeah. I've listened to that music. \"There are people like you who say,\" Yeah, I heard my dad's records, and it got me into it. \"They have that their own version of that story. It's not like in the old days when we'd hire a producer like Brian Eno or Roy Thomas Baker--not so much with Brian, he was pretty great--but Roy would try to make us sound like another record that he had done, and we'd end up spending the whole time fighting him, trying to make his recording sound like the way we did our demos of the same song. And it was self-defeating for us [laughs]. Damian: Not to beat up on The Ramones, because don't get me wrong, I love The Ramones, or The Dead Boys for that matter, but with those bands you can hear a lineage. And even bands like The Sex Pistols or The Clash, you can hear Dr. Feelgood and how that begat what they were doing. But with what you guys did, you were really without peers. I could never think of what begat Devo. Mark: We spent a lot of time festering on a cultural wasteland island by ourselves. In Manhattan, or probably the same thing in Toronto when you were starting your band, when you're in a big city like that, people are watching you from the beginning. They remember Fucked Up when you guys were only kind of Fucked Up. Damian: [Laughing] We're less fucked up now than we were then! Mark: Ok. Maybe more fucked up. But they remember before you had a beard and all these things, so they totally understand Fucked Up. And Devo, we were just back in our log cabin in Ohio, just kind of entertaining ourselves, so by the time we got to New York, we had these outfits and we had enough songs for three albums, and we had our own slang language that we were using and our own dialog. And we were making these big posters. I figured out a way to use blueprint machines to make four-by-six foot posters for 50 cents apiece, so we'd print up big posters and just change the date on them. People would look at them and\" Wow. My band is doing 8 1/2 by 11 flyers at Kinkos. How are they doing it? They must be ad executives. \"There were all these strange ideas that people would have about it. But when we finally did come out from underneath our rock, which was appropriately titled\" Akron, \"it was surprising to people in a way. That worked to our advantage. Damian: It's also funny because with Akron, there was the Clone Records scene and a lot of bands without peers. It was like an entirely approach to music, so I guess it must have been like you guys were all alone together. Mark: Yeah, there wasn't as much unity as you would think, and I'll tell you why I think that happened. We put out records on Boogie Boy Records, and that was just somebody's living room. And we had no idea what a record company was or how it worked. We had no idea of what a recording studio would be really like to be in one. It all seemed so fantastic and confusing and beyond our reach for sure. So we made stuff on a four-track deck and we went to Cincinnati, Ohio, and printed a thousand records at 35 cents apiece, and we printed up these covers ourselves and made up the artwork and folded them up and put them in it. And I'd get in a car and I'd drive from Akron to Cleveland, which is about a 40-minute drive, and I'd go in a record store and say,\" Hey! Need any Devo records? \"And the guy would go,\" Let me see, \"and he'd go down to the last bin in the row and it would say\" Other stuff \"on it, and he'd pull out this one Devo record and say,\" Nope. Still got the one you brought in last week. \"And I'd say,\" Ok. See you next week, \"and I'd keep making my drive. Then <mark>Dave Robinson</mark> from Stiff Records found one of our records at Bleeker Bob's in New York and he called us up and said,\" Hey, let me put this out in England and Europe, and I think I could sell them. \"And he actually did. He put out three singles--\"Mongoloid/Jocko Homo,\" the \"Satisfaction\" single, and a song called \"Be Stiff .\" So he put out those three singles in Europe, and, fuck, they all charted. That was crazy. \"Mondo\" was number one in France, and we didn't even have a record deal. \"Satisfaction\" was number one in Yugoslavia and charted in England. And \"Jocko Homo\" charted in Scotland. But we had no record deal; we had nothing. We still didn't know what a recording studio was. Why am I telling you that? It just sounds like I'm bragging for no good reason.... It was about something, but now, fuck, if I can remember...Damian: Well, that's something we can never go back to, and it goes back to how you what you were talking about the time you spent fermenting somewhere. Not to beat up on Akron, but no matter where you are...Mark: Yeah, there are creative people being ignored. This is why I said that. We did English press, and they said, \"What is Akron?\" And we said, \"Well, it's a lot like Liverpool. It's a factory town. It's gray and overcast 350 days of the year, and nobody is ever happy there. It's exactly like Liverpool .\" And in Melody Maker the next week, it said: \"Akron: The New Liverpool .\" And it really made record company people come over and start combing around Akron, and believe me, those unemployed musicians in Akron aren't stupid. They put bands together overnight. Rachel Sweet was never in a band before she got asked to audition for Stiff Records, and she got a record deal out of it. Good for her. Damian: But now, no matter what you're doing, because of the Internet, you can get someone to watch. Mark: The Internet has changed everything. The way artists make music, the way they present their art, what the art is, the way an audience consumes it--it's totally different. It's so amazing now. If you're getting into music because you want to be a rock star and live in Malibu, you're about 20 years too late. But if you're making music because you love it or because you absolutely have to make it, then you're at a really great time, because now you can find tape recorders at RadioShack that anyone can afford and are more powerful than the ones The Beatles used when they made their first albums. And you can start your own website on the same day you write your first song, and you can put your music out there for people to hear. And someone who is really creative or Internet savvy or has an interesting viewpoint, they are the ones who are going to be really successful. Damian: But because you guys had that time of being ignored, you developed your own world. It's almost like that can never happen again...Mark: If you want it, you can let it happen on purpose. You decide when you put things out. I just love the Internet because sometimes I'll go and type \"Chinese computer rock and roll banjo,\" and you put those four phrases in and something comes up! There's some band somewhere that fits that. \"Clog dancing reindeer death metal .\" You say those things, and some band will come up and those terms will all be used in the description of the band. It's such a great time to be an artist. I would love to be 20 and just starting right now. Damian: You're right. It's a game changer. Nothing will ever be what it was, and I'm sure for some people, that's a bad thing...Mark: Well, yeah. For people who had their hand on the faucet and got to say, \"Here's what you get to listen to and how you get to listen to it. You get to my vinyl,\" and then it was \"my audio cassette,\" and then you have to throw that way, and it's \"my CDs .\" And then the Internet came along and it cut their legs out from underneath them. I feel sorry for them, kind of, but not too much, because they had an easy ride. It wasn't like that before. Popular music was never passed on through recordings until about a hundred years ago. It's a fairly new phenomena. Before that, you went to some place, either a beer hall or an opera house or the king's castle, and you heard a piece of music that inspired you, and you played that same piece of music. That's how somebody else heard it, because you played that song that you heard at the local beer tavern. You copied it and played it again, and then people kept doing that, and it was a whole different methodology of music traveling around the world. So the record thing had a long run. But it's over now. Damian: Well, it's not like recordings are over. It's like the physical medium is done, but the recording itself is having a life of its own. Mark: Oh yeah. Now it's something totally different, because everyone can do it. Damian: And you don't have to go to a symphony and hire the symphony for a day. You can make a reasonable facsimile of a symphony. Mark: You can do it at home! You don't even have to have a band. You can be totally asocial. You can be poor as shit. You don't have to have a rich dad or a rich uncle or somebody that is going to loan you the money or a record company that says, \"I think you deserve to get to make a record .\" Now it's like anybody can say, \"You know what? I deserve to make a record, and I'm going to do it .\" Damian: There's that quote from [Jean] Cocteau where he says that \"films will not be an art form until cameras and film become as cheap as pencils .\" It's almost like the same can be said about popular music. Popular music is now truly becoming an art form because anyone can do it. Mark: I like that! Damian: And I'm not saying everyone. There are obviously people who took the means of production for themselves, like you guys running your own label and making your own records, but now it's like the means of distribution and production are all in the hands of the artist. Now we're going to see where pop music can go. Mark: [Sings] \"Hooray for 2010! Hooray for 2010! We're all here, whoopee! We've got the Internet! We've got digital computers! Hooray for 2010!\" So now as long as the Chinese don't take their missiles and knock out every satellite in space...Damian: Right! We can enjoy it. We're going to make some amazing pop songs as long as we don't blow ourselves up. Mark: Unfortunately, the math of human population isn't looking good right now. It's looking like there has to be a readjustment through some sort of chimpanzee flu. Damian: There will be a paradigm that supersedes the paradigm shift of music production. I don't know how much you can talk about this...but Devo has permeated mass culture. Because you guys have made your own toys, and different artists have done their interpretations, and there are bands that are literally Devo tribute bands and bands that are ostensibly also Devo tribute bands with the way that they approach music and the way they try and create the same sound that you guys created. But also the fact that McDonalds made a toy with a guy that had a Devo hat on. It's so bizarre that your critique of pop culture has almost been absorbed within pop culture. Mark: Yeah, it's kind of ironic that that was one of the few things that we were able to trademark. Early on, [Virgin Records founder] Richard Branson, because we loved the fact that he signed The Sex Pistols, I was stupid enough to trust him. So he had my publishing [rights] for a long time. I probably paid for a couple ashtrays on one of his spaceships. I do remember at one point that he got me stoned. He asked me to meet him in Jamaica and Bob 2 [Bob Casale] and I went down there, and we sat around and got stoned with him. And we were talking about The Sex Pistols because they had just broke up, and I said, \"Yeah, I met them last week because we were staying at the office where they print Search and Destroy [magazine], and they came over and hung out with us. It's too bad they broke up. We really love that band .\" And in the meantime Richard Branson and his South African buddies that he started Virgin with were rolling these gigantic joints. I'd never seen marijuana that looked like cigars before, but it was Jamaica. Damian: It wasn't Akron, Ohio, weed. Mark: Yeah, that wasn't even real weed. It was probably oregano that had rat poison in it. But anyway, he was saying, \"What do you think of Johnny Rotten?\" And we go, \"Oh, he's great! The Sex Pistols were the best band ever and we're so sorry they broke up\" and blah blah blah. And he said, \"Well, I'll tell you why you're here. Johnny Rotten wants to join Devo, and if you say yes, we're going to go down to the beach right now, and I've got reporters from Melody Maker, New Music Express, and Sounds, and we'll announce it to everybody that Johnny Rotten is joining Devo .\" And I remember at that moment thinking, wait a minute, they're not smoking the pot. They've only been giving it to Bob and me. And look at his teeth! I realized his teeth protruded like a brain-eating ape. I remember thinking that all in five seconds. I don't know how you were brought up, but my parents had serious religion issues, so I had to go to church as a kid. And I remember one time sitting in church and all of a sudden everything seemed so ridiculous to me that I started laughing in the middle of a very quiet prayer. And the more I tried to stifle it, the more I started laughing, because everything seemed so absurd. And that's what happened. I said, \"Richard, I'm not laughing at you, man. It's kind of an interesting idea, but I'm not really sure what Johnny Rotten would do in Devo. We'll help him put a band together. He should start a corporation. Johnny Rotten should incorporate. But I'm not laughing at you .\" I remember looking at his mouth and thinking he looked like a cannibal. I should have known right then that I shouldn't have signed with him. Damian: I'm sure if you asked John Lydon now if he should have signed with Virgin, he would say no. . It was one of those things where in hindsight you see that even the cool hippies were kind of evil in their own way. Mark: Oh yeah. They became the hip capitalists. Damian: They had better marketing. Mark: They knew how to get you when you had turned the other way to defend yourself from the evil you knew. They were just a different kind of filth that was able to totally take you, even when you thought you were totally cognizant and able to protect yourself. Damian: Well...Devo as a way of infiltrating culture and creating culture, Devo has been exorbitantly successful. You must be so proud that this thing that you created as a way of thinking about the world has become something so massive unto itself. Mark: Well, I got to tell you, for a long time we thought as the end of the ’80s became the ’90s, OK, we've had our moment, and that was great. But that was it. It felt like there was no legacy, and I think the Internet helped change that. It gave kids a chance to go investigate things that were going on before they were around, and I think that brought a renewed interest in Devo. And that's kind of a nice thing to have happen. Damian: Bear in mind that I play in a band called Fucked Up, so our ability to permeate the mainstream is somewhat limited. But [Devo's] music will be there long after you're gone. The fact that you've changed popular culture in such a way, that's going to be there forever. Well, as long as popular culture is here...Mark: Which could be until the end of the year! Damian: Exactly, but you've created something that only a handful of bands have done. There are a lot of bands that--Mark: Okay, now you're going overboard, sir [laughing]. Damian: Well, but I really believe this, and believe me, I have these conversations with myself. It's not just because I'm on the phone with you. But at the end of the day, there are a lot of bands that are classic bands, and there are a lot of bands that have important records, but there are very few bands that have created a world unto themselves. And that, to me, is the most impressive thing a band can do. Mark: Well, damn, Pink Eye, you can call me \"Booji Boy .\" Damian: Well thank you very much. Mark: I think we should get our own talk show. Damian: I would love that. I like to draw, too, so maybe we can have our own drawing talk show. That would be an awesome show. Mark: That sounds perfect. Damian: I would watch it. Now all I need is to find a million other people who think just like me, and we'll have a hit show. Mark: I think it could even go a lot further than Fucked Up. Damian: I think anything could go a lot further than Fucked Up. I think this conversation will go a lot further than Fucked Up. Mark: You guys are pretty good. Damian: Thank you very much. Mark: Thanks to the Internet, I'm now Fucked Up literate. Damian: But for us, the way you guys approached things--the way that it wasn't 100% about writing a catchy riff--it's about writing a song but also the work that goes into that song and the creation of the song and making that part of the experience is something that has had a really profound effect on us. So, for that, I definitely have to thank you, because we stole that from you wholeheartedly. Mark: Well, man, I'm sure I stole that from somebody. Damian: Well, that's the thing with Devo, and not to keep harping on this, but it's hard to think who you stole anything from. I'm a huge nerd when it comes to music, and I'm a big music collector and a big nerd when it comes to music. And I like to think of myself as reasonably well-versed in music, but I can't for the life of me put my finger [on it]. Obviously, there's German stuff that was coming out at that time, and you can hear shades of that in the keyboard work. But Devo was without peers...Mark: I know where we got our stuff. To me, if there was one guy that influenced me and was the most inspirational to me for keyboard, it would be Brian Eno, and it was because of one song. It was his solo on \"Additions of You\" on Roxy Music. People like Rick Wakeman [from Yes] always kind of creeped me out because their synthesizer sounds always sounded like a calliope or something. They were always silly. And Brian Eno did this solo where it went [makes flailing synthesizer sounds with his mouth]. And I was like, \"Oh my God! He can't be using a keyboard. He's using joysticks or something like that .\" And that changed a lot of things for me. So we would have to admit that there are people who really influenced us a lot, and as much as it wouldn't seem that he was the guy, he was. And that's why we asked him to produce our first record, because of that. Damian: Also, with your new record, a lot of bands that you hear, you're like, \"Oh, they've got a new record coming out .\" And then you hear it, and you're like \"Aw, they're pissing on their legacy .\" But I honestly think the new record is amazing. And it's not because it's a rehash of the old, it's because it does fall perfectly in...Mark: Oh, man. Thank you. We haven't been able to put as much time in a record since our first album. This is the one that we've been able to put the most time into, and I think that's what you're hearing. Damian: Well, if something is worth hearing, it's worth doing right."}, {"articleID": "2014071606_00017317_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}, "date": "2014-07-15", "url": "http://www.defense.gov/news/newsarticle.aspx?id=122678", "content": "DoD News, Defense Media Activity WASHINGTON, July 15, 2014 - Defense Secretary Chuck Hagel discussed the situation in Iraq by phone today with French Defense Minister Jean-Yves Le Drian. Pentagon Press Secretary Rear Adm. <mark>John Kirby</mark> issued a statement after the call saying Hagel \"provided an update on the situation in Iraq, to include the political dynamics in Baghdad and a general sense of the security environment .\" "}, {"articleID": "2019022020_00708800_W", "names": {"Kevin Love": ["Q297221", "Q6396801"]}, "date": "2019-02-20", "url": "http://www.startribune.com/love-healthy-optimistic-as-cavs-fight-to-season-s-finish/506114192/", "content": "<mark>Love</mark> healthy, optimistic as Cavs fight to season's finish By TOM WITHERS Associated Press February 20, 2019--2:40 pm Purchase: Order Reprint INDEPENDENCE, Ohio--<mark>Kevin Love</mark> relaxed on the beach under the warm Caribbean sun during the All-Star break. He hopes it finally shines on him and the Cavaliers in the second half of a depressing, gloomy season. Offering optimism about his future and Cleveland's, <mark>Love</mark> returned to the practice floor with his teammates on Wednesday following the league's annual midseason celebratory interruption. The five-time All-Star recently came back after missing more than 50 games following foot surgery. He was rested for the Cavs' final game against Brooklyn--part of his recovery plan--before the break, but <mark>Love</mark> said he plans to play Thursday against Phoenix and intends to build up his minutes over the next few weeks. Cleveland has 24 games left. \"I think you'll see me more on a steady basis and not miss games after the break, I'm hoping,\" said <mark>Love</mark>, who has played in just two games since November. \"So just continue to improve the minutes and make sure that I'm feeling good and go from there .\" With Cleveland's training staff keeping a diligent eye on him, <mark>Love</mark> took part in the 5-on-5 scrimmage without any problems and said the only issue now is improving his conditioning. Overall, he's pleased with his progress and believes the Cavs are close to turning a corner. The team has been besieged by injuries, but with <mark>Love</mark> back and forward Tristan Thompson close after missing 13 games with foot soreness, the Cavs are as healthy as they've been in months. There won't be any playoffs this season, but <mark>Love</mark> is excited about what the Cavs can accomplish down the stretch. \"Hopefully we'll have everybody back,\" said <mark>Love</mark>, his arms showing some residual redness from his vacation. \"You just have to continue to find motivation and know that there's a bigger picture involved. And you know, for me, it is tough. It's the longest I've missed consecutively in my whole career but I just gotta find opportunity, find ways to get better and in a lot of ways my body feels really fresh. I guess that's the good thing in this and just continue to get better in my game .\" This has been an exceptionally challenging season for the 30-year-old <mark>Love</mark>, who signed a four-year, $120 million contract extension in July. But despite personal setbacks and the Cavs' stunning descent from NBA powerhouse to lottery participant, <mark>Love</mark> has remained engaged and committed. Coach Larry Drew has admired the way he's handled adversity. \"He has done a magnificent job in the way he has conducted himself and he has stayed the course with his rehab through his injury,\" Drew said. \"I know how bad he wants to be out there, but things happen and you have to push through them, which he has done. Now he's able to play. He's gradually getting his legs under him and gradually getting to the point where he can play extended minutes .\" I'm certain that once he is able to get out there and really play extended minutes he's going to make the most of it. \"With less than two months left in the season, the Cavs (12-46) have the league's third-worst record. But there have been some encouraging signs, including the development of rookie guard Collin Sexton. And, although there have been some lopsided losses along the way, the Cavs have played much better over the past few weeks. Although <mark>Love</mark> was sitting, the Cavs took the Nets to three overtimes before losing last week. There's no quit in this group .\" We have guys that fight, \"<mark>Love</mark> said .\" We have guys who play really, really hard, some veterans with five or six years in the league that have put in their time and have been around playoff basketball. Any team when you have bad luck like that you're going to lose a lot of basketball games. The record indicates that obviously we are at the bottom, but we feel like we have a team that can really compete with anybody on any given night. That's the beauty of this game. \"\"We have a good group of guys that want to be better and guys that haven't given in to losing. That can be easy when so many games come at you so fast, but we've had a mentality that any given night we can win a basketball game. We're going to continue to be like that .\" "}]