[{"articleID": "2019062106_00161209_W", "names": {"John Neal": ["Q1315962", "Q6250190", "Q6250195"], "Dan Glaser": ["Q5213567", "Q57848049"], "Andrew Horton": ["Q4757340", "Q55991762"], "Sheila Cameron": ["Q22277247", "Q7493021"]}, "date": "2019-06-21", "url": "https://www.insurancebusinessmag.com/au/news/breaking-news/major-names-converge-to-form-lloyds-of-london-advisory-committees-170567.aspx", "content": "Major names converge to form Lloyd's of London advisory committees by Terry Gangcuangco 21 Jun 2019 SHARE PERILS issues third loss estimate for Sydney hailstorms Major names converge to form Lloyd's of London advisory committees | Insurance Business Scandal-hit Lloyd's of London has assembled what looks like \"The Avengers' of insurance to serve as members of its new advisory committees. Created to support the (re) insurance market's transformative strategy, the global and London advisory committees are made up of the likes of Association of British Insurers chair Amanda Blanc, Willis Towers Watson chief executive <mark>John</mark> Haley, and Marsh & McLennan Companies (MMC) president and CEO <mark>Dan Glaser</mark>. Also part of the mix are top names such as Chartered Insurance Institute chief executive Sian Fisher, Aon CEO Greg Case, and Chubb chair and chief executive Evan Greenberg. The committees will be in charge of aiding the creation of\" The Future at Lloyd's, \"whose focus centres on simplifying market access, reducing the cost of doing business, building an inclusive and innovative culture, and offering better value for customers .\" Ensuring that Lloyd's is best placed to meet future challenges and opportunities is vital so that the UK remains a world-leading insurance market, \"commented Blanc, who is also chief executive of EMEA (Europe, the Middle East, and Africa) and global bank distribution at Zurich Insurance .\" I look forward to working with colleagues in the insurance industry in developing a strategy that helps Lloyd's to deliver best value for customers through cutting edge technology, with an inclusive culture that attracts the best talents. \"For London & International Insurance Brokers' Association (LIIBA) CEO Christopher Croft, the move\" further fulfils Lloyd's commitment to a collaborative, cross-market approach. \"Croft noted that he and LIIBA chairman Roy White--who also serves as chair of UK specialty for Marsh--are happy to be part of what he described as important work for the industry's future. Meanwhile London Market Group chair and Beazley chief executive <mark>Andrew Horton</mark> expressed strong support for the ideas set out in the Lloyd's prospectus. <mark>Horton</mark> said he is\" keen to continue working with colleagues across the market to help take these forward. \"Also looking forward to working in partnership with Lloyd's and on behalf of Lloyd's Market Association members is the trade body's CEO <mark>Sheila Cameron</mark>, who believes this will ensure that the work undertaken now will define the future success of the market. <mark>Cameron</mark> also pointed to the goal of delivering\" truly outstanding outcomes \"for the market's clientele .\" The Future at Lloyd's is a unique opportunity to transform the marketplace and cater to the growing and diverse needs of its customers, \"concurred MMC's <mark>Glaser</mark>.\" Lloyd's is an important partner for Marsh & McLennan and our clients, and I'm thrilled to help position it for the future. \"Case, meanwhile, cited Aon's commitment to anticipating client needs and collaborating with leading organisations to innovate on customers' behalf .\" With this new strategy, Lloyd's is accelerating its own evolution and charting a path forward for London to continue playing a significant role in the global insurance market, \"asserted the Aon boss .\" We're pleased to contribute to this important discussion. \"Lloyd's chief executive <mark>John Neal</mark> couldn't be more excited .\" This is an exciting time for us all as we drive forward the next stage in Lloyd's evolution, and I am delighted that we have the support of a number of global industry leaders, as well as the market associations representing some of our key stakeholders, \"he declared .\" Together with the feedback and insights we are gathering from our wide-ranging consultation, the advisory committees will play a critical role in providing guidance and advice as we develop and implement a blueprint for the future at Lloyd's. \""}, {"articleID": "2014101318_00005100_W", "names": {"Steve Nash": ["Q16137022", "Q192955", "Q42316961"], "Kevin Love": ["Q297221", "Q6396801"], "Ray Allen": ["Q208623", "Q2438891"], "Ryan Kelly": ["Q13605944", "Q20641855", "Q20713861", "Q22005766", "Q33744353", "Q7384209", "Q7384212"], "Ed Davis": ["Q1282320", "Q26858558", "Q5334728"], "Nick Young": ["Q14949301", "Q28531164", "Q7028182", "Q703908"]}, "date": "2014-10-13", "url": "http://www.theepochtimes.com/n3/1015660-lakers-news-rumors-2014-kobe-bryant-jeremy-lin-steve-nash-klay-thompson/", "content": "NBA Lakers News, Rumors 2014: Kobe Bryant, Jeremy Lin, <mark>Steve Nash</mark>, Klay Thompson Los Angeles Lakers guard Kobe Bryant, right, drives against Golden State Warriors forward Draymond Green (23) during the first half of a preseason NBA basketball game, Sunday, Oct. 12, 2014, in Ontario, Calif. (AP Photo/Alex Gallardo) Cleveland Cavaliers News, Rumors: Latest on <mark>Kevin Love</mark>, Dion Waiters, LeBron James, <mark>Ray Allen</mark>, Cavs NBA News, Rumors 2014: Thunder, Bulls, Celtics, Mavs, Warriors, Nets, Kings Updates Watch: Lebron James Plays Former Team Miami Heat Full Highlights The Los Angeles Lakers are coming off a horrible loss and a new wave of rumors and news have emerged. Check out the latest buzz below. Kobe Says Lakers Still Getting in Shape Kobe Bryant said after the rough 116-75 loss to the Golden State Warriors on Sunday that the Lakers have been working hard and may have been worn down. \"Kobe says everyone has pretty heavy legs right now, says they've been practicing really hard,\" reported Lakers Nation Serena Winters. \"We practice really, really hard .\" But Kobe believes that the team will be fine once the regular season starts. \"We haven't started tapering down yet,\" he said, reported Lakers reporter Mike Trudell. \"T hinks guys will be more fresh ahead of the regular season. Focus now has been work,\" Trudell said, paraphrasing Bryant. Bryant also praised the Warriors, who he said are an excellent team. They got some phenomenal players over there-that's a problem for some of the top defensive teams in the league to deal with, \"he said. Golden State Warriors guard Klay Thompson makes a gesture after making a three-point shot against the Los Angeles Lakers during the first half of a preseason NBA basketball game, Sunday, Oct. 12, 2014, in Ontario, Calif. (AP Photo/Alex Gallardo) The Warriors have until October 31 to extend Klay Thompson. If not, he becomes a restricted free agent next summer. fan website claims that the Lakers will target Thompson if the contract talks don't work out. The Lakers have expressed interest in Thompson before. The shooting guard had Kobe raving after the first preseason game between the two, saying\" He has the whole package. \"And the Lakers tried to pull off a trade for Thompson earlier this year before the NBA draft. Los Angeles Times said that the Lakers wanted to deal the seventh pick in the draft, which became Julius Randle, for Thompson as part of a three-way trade that would have also involved the Minnesota Timberwolves and <mark>Kevin Love</mark>. The T'Wolves later traded <mark>Love</mark> to the Cleveland Cavaliers for multiple players. <mark>Nash</mark> Injured? <mark>Steve Nash</mark>, the oldest player in the NBA, informed coach Byron Scott that he didn't feel good on Sunday night. <mark>Nash</mark>, 40, asked Scott to take him out of the game .\" Byron Scott said <mark>Steve Nash</mark> told him he was done for the night, said he just didn't feel right, \"Winters said. <mark>Nash</mark>, like Bryant, has dealt with injuries over the last couple seasons. But both have been practicing hard and appeared to be ready for the season. The Lakers are getting thin at point guard, with Jordan Clarkson straining his calf and Jeremy Lin spraining his ankle recently. Both sat out the game against the Warriors, along with Xavier Henry, <mark>Ryan Kelly</mark>, <mark>Ed Davis</mark>, and <mark>Nick Young</mark>. Ronnie Price and Keith Appling are the other point guards currently on the roster. Clarkson will be out until Friday, at least. Jeremy Lin #17 of the Los Angeles Lakers drives down the court against the Golden State Warriors at Staples Center on October 9, 2014 in Los Angeles, California. (Jeff Gross/Getty Images) Lin sprained an ankle at practice on Saturday, and will be evaluated again soon .\" He got up and kind of walked out on his own, but he was in a little pain, \"Scott said, reported the Los Angeles Times. Lin had replaced <mark>Nash</mark> in Thursday's loss to the Warriors, scoring 14 points and adding four assists in 21 minutes. Some believe that Lin should be starting over <mark>Nash</mark>, but it may come to whichever guard is in better condition to start the season .\" In early exhibition you want to see as many guys as you can, \"Scott said .\" Unfortunately for Jeremy, and obviously for <mark>Nick</mark>, it gives other guys an opportunity. \"Scott said that Lin should be ready to play on Thursday against the Utah Jazz. reported ESPN .\" But today he was walking a little gingerly and did some more treatment today. \"Prediction Has Lakers Missing Playoffs A number of season predictions have been coming out and the latest has the Lakers missing the playoffs .\" If everything were to go perfectly for the Lakers this season, it would still be tough to envision a win total of more than 45 games - and even then, that probably wouldn't be enough to reach the postseason in a traditionally loaded Western Conference, \"reported NBC .\" What's far more likely is that Bryant and <mark>Nash</mark> miss time at some point due to injury (whether major or minor), and that the roster simply doesn't have enough from a talent perspective to be able to compete on a nightly basis. A total of 35 wins and another trip to the Draft Lottery feels about right. \"The Lakers have high hopes after acquiring a number of new players, including Lin, Carlos Boozer, and Julius Randle, but will have trouble making it to the playoffs."}, {"articleID": "2019061315_00273145_W", "names": {"Theresa May": ["Q264766", "Q30161835"]}, "date": "2019-06-13", "url": "http://www.surreycomet.co.uk/news/national/17704953.uk-ready-to-assist-over-suspected-attacks-on-tankers-in-gulf-of-oman/", "content": "UK ready to assist over suspected attacks on tankers in Gulf of Oman By Press Association 2019 Iran Persian Gulf Tensions 0 comment The UK is prepared to assist in any rescue effort or investigation over the \"completely unacceptable\" suspected attacks on two oil tankers in the Gulf of Oman, Downing Street has said. The two civilian ships were damaged off the coast of Iran on Thursday amid heightening tensions between the US and Tehran, but many details remain unclear. An oil tanker is on fire in the sea of Oman (AP Photo/ISNA) An alert urging \"extreme caution\" was issued by the Navy-run United Kingdom Maritime Trade Operations following reports of explosions. Sailors were forced to evacuate when one of the tankers was left ablaze and the other adrift. <mark>Theresa May</mark>'s official spokesman told a Westminster briefing: \"Attacks on civilian vessels like these are completely unacceptable .\" We are in contact with international partners and are ready to assist in any rescue effort or investigation. \"0 comment"}, {"articleID": "2014120621_00010724_W", "names": {"Philip Hammond": ["Q18388174", "Q332987"]}, "date": "2014-12-06", "url": "http://upi.com/Top_News/World-News/2014/12/06/Britain-to-set-up-permanent-naval-base-in-Bahrain/3631417892889/?spt=hts&or=2", "content": "World News Britain to set up permanent naval base in Bahrain Britain is establishing a permanent military facility in the Middle East for the first time since removing its last permanent base over four decades ago. At a security conference in Manama, Bahrain, U.K. Foreign Secretary <mark>Philip Hammond</mark> signed the deal, which would expand the Mina Salman Port in Bahrain, adding aircraft carriers and destroyers to four British minesweepers already located at the facility. \"This new base is a permanent expansion of the Royal Navy's footprint and will enable Britain to send more and larger ships to reinforce stability in the Gulf,\" U.K. Defense Secretary Michael Fallon said. Since September Britain has conducted airstrikes against Islamic State targets in Iraq as part of a U.S.-led coalition that includes Australia, Belgium, Canada, Denmark, France and Netherlands. The new base would support such operations as well as those against piracy in the region. It will also be the first permanent British military facility to be located in the Middle East since a 1968 decision to close all U.K. bases east of the Suez Canal by 1971. The expansion of facilities at the Mina Salman Port is slated to cost $23 million, most of which will be paid by Bahrain, with Britain shouldering ongoing costs. Bahrain already hosts the U.S. Navy's Fifth Fleet at a larger, adjacent facility. abuses by the Sunni government,, the threat of Islamic State forces in Iraq and Syria have made Gulf monarchies more open to such deals with Western governments. \"We must never allow the isolationists to convince our people of the superficially attractive proposition that distance, or oceans can insulate,\" Bahrain holds first elections since Arab Spring, Shias boycott Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners 24 minutes ago MONTEVIDEO, Uruguay, Dec. 6 (UPI)--Uruguayan President Jose Mujica confirmed Friday his country will take Guantanamo prisoners who have not been charged with any crimes. Vietnamese writer Nguyen Quang Lap arrested over his blog 1 hour ago HO CHI MINH CITY, Vietnam, Dec. 6 (UPI)--Nguyen Quang Lap was arrested Saturday for publishing articles critical of the Vietnamese government. Swiss photographer wields machete in daring escape from captors 3 hours ago ZAMBOANGA CITY, Philippines, Dec. 6 (UPI)--A Swiss photographer kidnapped by a militant group in the Philippines in 2012 killed a captor with a machete and raced to safety under a hail of gunfire. Hagel says more U.S. troops than planned to stay in Afghanistan in 2015 5 hours ago KABUL, Afghanistan, Dec. 6 (UPI)--During a visit to Kabul, U.S. Defense Secretary Chuck Hagel said 1,000 more troops than first planned will stay in Afghanistan for the early part of next year. Al-Qaida commander behind NY and London terror plots killed, Pakistan military says 7 hours ago WASHINGTON, Dec. 6 (UPI)--Adnan el-Shukrijumah, one of al-Qaida's senior leaders, was killed during a raid in Pakistan. He was indicted for his role in planned terror attacks. 500,000 flee as Typhoon Hagupit roars to Philippines 11 hours ago MANILA, Dec. 6 (UPI)--A half a million Filipinos have fled their homes as pelting rains hit the Philippines ahead of roaring Typhoon Hagupit just 150 miles off the eastern shore. U.S. journalist killed during failed rescue raid 11 hours ago SANA'A, Yemen, Dec. 6 (UPI)--A U.S. photojournalist who was being held hostage has been killed in Yemen during a failed rescue raid. New York trip not \"appropriate' for Prince George 14 hours ago LONDON, Dec. 6 (UPI)--The Duke and Duchess of Cambridge are ready to hit the States on Sunday, but Americans won't get a glimpse of bonnie Prince George. Mexico City police chief resigns over student death protests 17 hours ago MEXICO CITY, Dec. 5 (UPI)--Mexico City's chief of police resigned Friday amid criticism about how the department handled protests over the deaths of 43 students in September. Punjab government cracks down on health camps after botched procedures 21 hours ago CHANDIGARH, India, Dec. 5 (UPI)--The government of the Punjab state in India on Friday restricted health camps after at least 18 people lost their vision in botched cataract surgeries. Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners New York trip not\" appropriate' for Prince George FBI: Navy engineer tried to sell secrets to Egypt Second mountain lion spotted in heart of Los Angeles U.S. journalist killed during failed rescue raid Uruguayan President Jose Mujica confirms he will take Guantanamo prisoners Vietnamese writer Nguyen Quang Lap arrested over his blog Worldwide protests continue against U.S. police violence Swiss photographer wields machete in daring escape from captors More Sears and Kmart closings than first announced Judge: Beastie Boys $1.7 M copyright-infringement verdict stands Hagel says more U.S. troops than planned to stay in Afghanistan in 2015 World's oldest two-faced cat dies Hero bus driver saves nearly 40 students from flames ABOUT UPI Since 1907, United Press International (UPI) has been a leading provider of critical information to media outlets, businesses, governments and researchers worldwide. UPI is a global operation with offices in Beirut, Hong Kong, London, Santiago, Seoul and Tokyo. Our headquarters is located in downtown Washington, DC, surrounded by major international policy-making governmental and non-governmental organizations. UPI licenses content directly to print outlets, online media and institutions of all types. In addition, UPI's distribution partners provide our content to thousands of businesses, policy groups and academic institutions worldwide. Our audience consists of millions of decision-makers who depend on UPI's insightful and analytical stories to make better business or policy decisions. In the year of our 107th anniversary, our company strives to continue being a leading and trusted source for news, analysis and insight for readers around the world. Privacy Policy © 2014 United Press International, Inc.. All Rights Reserved. UPI.com is your trusted source for world news, top news, science news, health news and current events."}, {"articleID": "2010032017_00106712_W", "names": {"Jessica Smith": ["Q1356999", "Q14976630", "Q22957962", "Q56550826", "Q57054801"]}, "date": "2010-03-20", "url": "http://pnj.com/article/20100319/SPORTS/3190336/1002/RSS02", "content": "your browser's security settings are preventing some features from appearing. after winning their seventh district game in a row, the west florida high softball players couldn't help but celebrate on thursday. after all, the team is having its best season in school history. the jaguars locked up the district 1-4a regular season championship and the top spot in next month's district tournament with a 9-6 defeat of choctawhatchee. the win makes the jaguars 13-4 overall. afterward, the players huddled together to sing queen's \"we are the champions .\" \"it's pretty amazing,\" said west florida shortstop kiana rosario, who was honored before the game during the senior night celebration. \"i didn't really expect us to have this good of a season, but it feels really good .\" the jaguars play again when they host district opponent gulf breeze at 7 p.m. tuesday. rosario is the jaguars' lone senior and helped lift the team from the plate, going 2 for 3 with two rbi, two runs and a triple. lauren noski also did well at bat with two hits, a triple, an rbi and three runs scored. \"the girls at the plate were definitely key for us tonight,\" said first-year west florida coach sophie gill. \"we had some good at-bats tonight. we didn't chase them. we stayed in the zone, and we got it in there and ripped it .\" with the game tied 1-1 after two innings, west florida scored four runs in the third to take its second lead. noski and kaitlyn kenfield each ripped singles to get on base. freshman pitcher <mark>jessica</mark> briggs then hit a double that brought in noski. kiana rosario then came through with an rbi single that scored kenfield and briggs. with two outs, sophomore kayla rosario hit a double that scored her older sister. the next big inning for the jaguars came in the sixth. noski got things started with a triple to right-center field that brought in brittany atkinson. kiana rosario then added another triple to bring in noski. kiana rosario scored her second run of the game when kailina kenfield lined a single to right field. \"this is the best record they've ever had ever,\" jaguars assistant coach <mark>jessica smith</mark> said. \"i am just so proud of these girls .\" briggs threw all seven innings, gave up just one walk and struck out six indians. choctawhatchee pitcher michelle eubanks threw six innings with no strikeouts and three walks. the indians tried to put together a rally in the seventh after kierstyn denny hit a two-out, three-rbi double to give the game its final score. at west florida: west florida 9, choctawhatchee 6 choctawhatchee 010 200 3-6 7 1 west florida (13-4) 104 103 x-9 11 3 wp-jessica briggs 7 ip, 6 r, 7 h, 2 er, 6 k, bb, hb. choctawhatchee hitters: kierstyn denny 2-4, 2 r; jennifer vachon 1-4, 2 r."}, {"articleID": "2011032616_00014988_W", "names": {"Sean Hughes": ["Q56462167", "Q7441089", "Q7441090", "Q7441091"]}, "date": "2011-03-26", "url": "http://stuff.co.nz/sunday-star-times/news/4814016/Financial-cop-can-turn-back-clock", "content": "financial cop can turn back clock mum and dad investors are being given new hope that they may yet receive some compensation for the billions lost by failed finance companies. kiwi investors have been screwed for more than $3.5 billion in company collapses and failed finances - but the man who is set next month to step into the job as the country's top financial cop says he will have the power to turn back time and chase compensation from firms that have gone under. <mark>sean hughes</mark> is chief executive-designate of the financial markets authority - the super regulator that will be given unparalleled powers to fight finance and commercial fraud. \"we have got civil cases that we are going to have an ability to pursue compensation for investors,\" <mark>hughes</mark> told the sunday star-times. \"we have got a new power to pursue compensation on behalf of investors and that power usefully applies to things that have already happened, so we can look back into the past and start actions on behalf of investors even though any [fraudulent] behaviour occurred before we existed .\" it will allow the financial watchdog to seek compensation for investors ripped off in the space of the last seven years. \"you would want to look at every case on its merits,\" <mark>hughes</mark> said. \"the usefulness of this new power is that it doesn't artificially restrict us, it doesn't mean for instance that we can only start to pursue cases in about 12 months time .\" the news will be welcome relief to long-suffering investors in the wake of a less than stunning performance by the current financial watchdogs. despite 17,383 hours of investigation time and $1,175,982 in costs, the serious fraud office has secured just three convictions in a string of high-profile finance and business collapses. the sfo boss, adam feeley, says he is frustrated and admits the financial watchdog \"can do better\". feeley's frank admission follows the release under the official information act of the cost of eight of the sfo's high-profile cases over the past year. the figures - spanning the period of july 2010 through to this march - show the eight investigations cost $1,175,982 and have utilised 17,383 hours of investigators' time. the most expensive investigation was that into the failed finance company, bridgecorp limited, costing $356,666 and taking 6175 hours during the nine-month period. bridgecorp was placed in receivership in july 2007, owing 14,500 debenture holders about $459 million. former bridgecorp directors rodney petricevic and rob roest will make another court appearance on tuesday in relation to charges laid by the sfo. ad feedback the eight cases that the sfo has provided financial and logistical costs about are: bridgecorp limited, national finance 2000 limited, five star group, capital + merchant finance, kidicorp limited, lane walker rudkin, south canterbury finance and hanover finance. the investigation into kidicorp group ltd was terminated on wednesday. feeley said the probe - which totalled 909 hours and cost $50,496 - had determined \"there is no criminal offending here, or at least there is insufficient evidence of criminal offending\". the figures released by the sfo show the ongoing inquiry into the mark hotchin-headed hanover finance has, to date, cost $95,871. as of march 8, investigators had devoted a total of 1214 hours to the inquiry. the cost of the investigation is set to skyrocket, with feeley saying it was a long way from being completed. \"it is the case receiving the greatest level of resource within sfo. it is obviously a major case and there is a lot of public interest around it,\" feeley said. \"we are moving with some speed with hanover. but what people think of as speed in the context of fraud investigations, it is months not days .\" feeley said the sfo was now preparing for a full review of itself, saying there were things it could do better and also more cost-effectively. \"i would be the last person to say we couldn't do better. and certainly part of our review of processes is to try to look at cost-efficiency,\" feeley told the sunday star-times. \"i am sure we can do better. the sfo operates on an annual budget of $7.47 million. it employs 32 staff members and works on about 30 cases a year, with an average cost of $249,000. a key change feeley is contemplating is culling the number of charges they try to pin on people .\" do we look at 100 different offences in a major corporate collapse? or do we pick out two or three significant offences that fairly represent what has gone on there and concentrate on those? \"he said .\" historically, people said we should investigate every crime. but i guess from a cost-effectiveness point of view, if we end up convicting someone and they end up going to jail for seven years, does it matter whether you convict them of five offences or 500 offences...the outcome is effectively the same. \"he also wants to share more resources with the plethora of other government agencies potentially involved in charging commercial crooks. <mark>hughes</mark>, who has already had preliminary talks with feeley, told the sunday star-times:\" i am fully supportive of that. i don't think the new zealand taxpayer would be too impressed if we were seen to be duplicating assets and wasting public money. \"my desire is that we, wherever possible, streamline and work co-operatively .\" the fma will formally come into force once legislation is passed through parliament. it has made it through select committee phase and is now just awaiting official sign-off from parliament, with <mark>hughes</mark> saying it was his understanding \"we would expect to get sufficient house time to get through by mid-april\". that might be delayed slightly if more urgent legislation was required to be passed following the christchurch earthquake. high price of fraud convictions money allegedly ripped off kiwi investors: $3.5 billion money spent on eight high-profile investigations: $1.17 million convictions gained: three payback to mum and dad investors: nil - sunday star times"}, {"articleID": "2017080102_00445917_W", "names": {"Matt Wilson": ["Q1284392", "Q17040675", "Q18011187", "Q21710837", "Q6789535"]}, "date": "2017-08-01", "url": "https://foodmag.com.au/western-australian-grain-growers-break-into-asian-beer-market/", "content": "Latest News Newcomer surprises at the CBIA Craft Beer Awards 2017 Detmold acquires Heshan Innopak business in China Drone and sensor technology coming to Australian farming Companies granted Bulk Wheat Port Code exemptions The CBH Group today joins Interflour Group in celebrating the opening of the US $70 million Intermalt facility in Vietnam providing Western Australian grain growers with direct access to the Asian beer market. CBH Chairman Wally Newman and Chief Executive Officer Andy Crane attended the ceremony together with directors and senior leaders including Interflour Group Managing Director and Chief Executive Officer Greg Harvey, Intermalt General Manager James Kirton and representatives from the Vietnamese government. Mr Newman said CBH's involvement in downstream grain processing, through its 50 per cent shareholding of Interflour, had diversified the co-operative's income stream and resulted in increased market opportunities for Australian grain. \"CBH's investment in Interflour 12 years ago was ground breaking and today's opening of the Intermalt facility in Vietnam marks a new phase of growth for the business as it moves into barley processing and expands across South East Asia,\" said Newman. \"It will be a new chapter for Western Australian barley growers who now have direct access to Vietnam's burgeoning beer market--the fastest growing beer market in Asia .\" Mr Newman said over the past harvest growers delivered 1.5 million tonnes of malt barley into the CBH receival network and the facility provides a new market for growers. As part of the final commissioning phase, Intermalt has already purchased 42,000 tonnes of malt barley, with 32,000 tonnes coming from the Kwinana and Albany port zones of the Western Australian grain belt. Intermalt is located in Cai Mep, Vietnam, and will be the largest malting plant in South East Asia. It will have the capacity to produce 110,000 tonnes of malt a year and will service major brewers in the region including Heineken Vietnam. \"Not only is the Intermalt infrastructure impressive, but so too is the growth and opportunity it affords our growers, our businesses and the Asia Pacific region as a whole,\" Mr Newman said. \"Our current and future growers can look forward to benefiting from Interflour's expansion and this new venture generating value that we can then return to them a number of ways including through our investment rebate .\" Heineken Vietnam Corporate Affairs Director <mark>Matt Wilson</mark> said, \"Heineken Vietnam always seeks to use local suppliers where possible in order to drive jobs and wealth in Vietnam\". \"Our preference for local sourcing has seen us contribute around 0.75 per cent of Vietnam's total GDP and support nearly 200,000 jobs in Vietnam,\" he said. \"Because of this, we are very happy to see Intermalt entering the local market with the potential to supply us with locally produced malt in the future and increase our contribution to the Vietnamese economy .\" "}, {"articleID": "2018102720_00078791_W", "names": {"Jason Wilson": ["Q16225684", "Q26611719", "Q39074930", "Q6163780", "Q6163781", "Q6163783"]}, "date": "2018-10-27", "url": "http://www.gamereactor.eu/news/703643/The", "content": "Not long ago, we reported that new information on Medievil Remastered was set to be revealed soon. In line with this, Jay Gunn, also called <mark>Jason Wilson</mark>, is not only the co-creator of the MediEvil series, but he also voiced Sir Daniel, the main character of these adventures. Recently, <mark>Wilson</mark> who is a comic book author these days posted tweet a strange photo with him reading with a bucket on his head accompanied by this sentence: \"The things that I do to prepare for some jobs .\" The reference is actually very subtle because it refers to an interview given in October 2006 at The Dan-Fanclub in which he said: \"I wrote a script for what Dan [Sir Daniel] actually says and then just read the lines through gritted teeth with a bucket over my head!\" We can, therefore, assume that <mark>Jason Wilson</mark> will return to re-record the lines for the remaster? Comments This is an ad:"}, {"articleID": "2009052310_00025756_W", "names": {"Karen Clark": ["Q1965186", "Q2592977", "Q3193100"], "John Cherry": ["Q46748821", "Q5607525", "Q6225870"]}, "date": "2009-05-23", "url": "http://macombdaily.com/articles/2009/05/23/news/srv0000005406403.txt", "content": "macomb daily staff photo by david n. posavetz members of the roseville junior high school marching band practice in preparation for monday's memorial day parade's performance. ryan hansen, a seventh-grade teacher at the school and the vfw state teacher of the year, will serve as grand marshal. macomb county residents will kick off the informal start of summer this memorial day weekend with near-perfect weather and holiday parades in six local communities. temperatures were in the 80s on thursday, but more normal late may weather is expected for the weekend with the thermometer hitting the mid - to upper-70 degree range today through monday, according to the national weather service. \"it looks like we're in store for a very pleasant weekend weather-wise with the only chance for precipitation coming on saturday,\" said meteorologist <mark>karen clark</mark>. the good weather is good news for area boaters - at least those who can still afford to put their vessels in the water - as the boating season starts. the macomb county sheriff's marine patrol and u.s. coast guard are ready to monitor the waterways. \"this is the kickoff weekend for many boaters and with the nice weekend coming up, i'm sure there's going to be quite a few people out on lake st. clair,\" said macomb county sheriff mark hackel. thousands of local residents are expected to turn out for the six local memorial day parades and activities lined up to salute the sacrifice of military veterans who died or were injured while protecting the interests of the united states. the cousino high school marching band in warren will perform at the memorial day parade in washington, d.c., on the national mall. band director jeff cutter said 53 students and 10 adults will spend the weekend touring the sites in the u.s. capitol. \"everyone is excited to go,\" cutter said. \"it's a huge honor for us. we have quite a busy schedule of things to do, but the parade will be the last thing on the list on monday before we leave for home .\" in eastpointe, michigan lt. gov. <mark>john cherry</mark> will join congressman sander levin and local elected officials beginning at 11 a.m. monday along the parade route down gratiot to stephens and ending with a program at kennedy park, where newly elected 38th district court judge carl gerds will be the guest speaker. other parades are scheduled for new baltimore, romeo, roseville and sterling heights, all starting at 10 a.m. in st. clair shores - which bills its memorial day parade as the largest in the midwest - the annual celebration begins at 1 p.m. sunday. this year, the parade route is jefferson from nine mile to 11 mile roads. st. clair shores councilman matt ahearn, who also serves as parade president, said the grand marshal this year is randy milbocker, district manager for blossom heath inn banquet center. ahearn also said regardless of the economy, it's important to take time out to salute area veterans. \"we have to do this even though it's a tough year for businesses,\" ahearn said. \"this day is for our veterans who have sacrificed so much for us. it's a must .\" motorists will have a break for the weekend on area roads and highways as the michigan department of transportation will suspend work and open as many restricted lanes as possible, said mdot spokesman rob morosi. \"whatever we can open, we are, but some things such as the mound bridge over i-696 is out, so those won't be open,\" morosi said. the mound road interchange exits will remain closed, but closed lanes on i-696 between hayes and i-94 will be open. some lane restrictions will continue on the gratiot road project between 14 mile and remick, and again between 21 mile and 23 mile roads. the following are comments from the readers. in no way do they represent the view of macombdaily.com. we encourage your feedback and dialog and ask you to follow a few simple guidelines when commenting on stories on macombdaily.com. 1) please post responsibly. 2) be polite. 3) don't hate. 4) if you object to someone's post, use the \"report abuse\" button and we'll review it. red wings live blog - join the action tonight bruce macleod took over red wings beat full-time in the fall of 2005 and covers the red wings for the macomb daily."}, {"articleID": "2017051518_00898734_W", "names": {"John Williams": ["Q11310708", "Q12633687", "Q131285", "Q1367551", "Q14950380", "Q15429336", "Q15821602", "Q1606354", "Q16105524", "Q16224055", "Q1702438", "Q18385583", "Q19325807", "Q20821181", "Q20821436", "Q21176199", "Q21481534", "Q22019624", "Q2333172", "Q24249667", "Q25190475", "Q2567288", "Q2688830", "Q28434529", "Q29643791", "Q30122882", "Q30612128", "Q370293", "Q3809678", "Q46993819", "Q49546744", "Q51585685", "Q54932733", "Q56187903", "Q56597939", "Q56604636", "Q6264302", "Q6264304", "Q6264308", "Q6264311", "Q6264317", "Q6264319", "Q6264346", "Q6264352", "Q6264355", "Q6264357", "Q6264363", "Q6264366", "Q6264372", "Q6264380", "Q6264382"]}, "date": "2017-05-15", "url": "http://www.nbcconnecticut.com/entertainment/the-scene/Third-Show-Added-for-Harry-Potter-Concert-in-Hartford-422357974.html", "content": "Third Show Added for Harry Potter Concert in Hartford By Amanda Lundergan NEWSLETTERS Receive the latest the-scene updates in your inbox Email Privacy policy | More Newsletters Warner Bros.. Entertainment Inc.. Music from one of the most popular film series in history will be coming to Hartford in November and ticket sales have been so popular that a third show was added. The Hartford Symphony Orchestra will perform the score from Harry Potter and the Sorcerer's Stone at the Bushnell Center for the Performing Arts. Sneak Peek Inside \"Wizarding World' 2016 Universal Studios The original performance was scheduled for 7 p.m., Saturday, Nov. 4 After the show was announced, a second performance was added at 1 p.m. due to popular demand and a third show has been added for 3 p.m. on Sunday, Nov. 3 at 3 p.m.. The Harry Potter Film Concert Series was created by CineConcerts and Warner Bros.. Consumer Products. Performances kicked off last June and are scheduled for more than 35 countries around the world through 2018. US Accuses Syria of Mass Executions, Burning the Bodies\" Audiences will be able to relive the magic of the film in high-definition on a 40-foot screen while hearing the orchestra perform <mark>John Williams</mark>' unforgettable score, \"Amanda Savio, of the Hartford Symphony, said in a news release. The concert will feature the symphony orchestra performing, to picture, every note from the film. One of the most sought-after conductors of film music, CineConcert President Justin Freer, will conduct the show in Hartford .\" The Harry Potter film series is a once-in-a-lifetime cultural phenomenon that continues to delight millions of fans around the world, \"Freer said .\" It is with great pleasure that we introduce for the first time ever an opportunity to experience the award-winning music scores played live by a symphony orchestra, all while the beloved film is simultaneously projected onto the big screen. It will be an unforgettable event. \"Woman Charged With Murder After Chicago Teen Rammed Into Tree Tickets went on sale this morning at hartfordsymphony.org, in person at the Bushnell Box Office, and by phone at 860-897-5900. For more information about the Harry Potter Film Concert Series, visit harrypotterinconcert.com .\" WannaCry' Cyberattack Ebbs, But Experts See Risk of More Published 1 minute ago Get the latest from NBC Connecticut anywhere, anytime Download the App Available for IOS and Android Follow NBC Connecticut"}]