[{"articleID": "2012010318_00056621_W", "names": {"Derek Dooley": ["Q5261924", "Q5261925"]}, "date": "2012-01-03", "url": "http://wtvq.com/sports/story/Vols-WR-Arnett-granted-release/kXkA7vAeZkSyIE4AqdXr7g.cspx", "content": "tennessee wide receiver deanthony arnett has been granted his release from the football program, head coach <mark>derek dooley</mark> said tuesday. the saginaw news reported over the weekend that arnett, a michigan native, requested the release because his father recently underwent two surgeries, including a procedure on his heart. the report said tennessee denied arnett's request to play at michigan or michigan state because of school policy, and cleared him only to play at a mid-american conference school in michigan. but <mark>dooley</mark> said tuesday that he was \"very comfortable carving out an exception for [arnett]\" to get back to his father. he said he got a few messages from arnett's brother over the holidays and eventually had some 1-on-1 conversations with the receiver. \"the most important concern for me is the welfare of our student-athletes,\" <mark>dooley</mark> said. arnett made 24 catches for 242 yards and two touchdowns this past season, when he was a true freshman. you can send a story to multiple email addresses by separating the email addresses with a semicolon (;) nfl - week 16 33 photos - updated 12/27/2011 1:09 am"}, {"articleID": "2015042400_00026815_W", "names": {"Andrew Steele": ["Q2846739", "Q38639841"]}, "date": "2015-04-21", "url": "http://www.channel3000.com/news/state-rests-case-steele-defense-to-present-rebuttal-witnesses-wednesday/32493702", "content": "State rests case; <mark>Steele</mark> defense to present rebuttal witnesses Wednesday Jury hears 911 call, testimony from family during 3rd day of <mark>Steele</mark> trial <mark>Andrew Steele</mark> pleaded not guilty by mental disease or defect in the killings of his wife, Ashlee <mark>Steele</mark>, and sister-in-law, Kacee Tollefsbol, last August in Fitchburg. The prosecution called a psychologist to the stand Tuesday. Dr. Deborah Collins talked with <mark>Andrew Steele</mark> twice in the days after the double-homicide. She testified that <mark>Steele</mark>'s actions on the day of the murders were purposeful and were not random. She talked about the zip tie found around Ashlee <mark>Steele</mark>'s neck when she was killed. \"The way in which it was practiced in this instance was at least careless,\" Collins said. \"And for someone who cared for his wife as much as Mr. <mark>Steele</mark> said he did, it doesn't make sense .\" The defense is arguing <mark>Steele</mark>'s ALS affected his mental state at the time of the killings. The defense will have an opportunity to call witnesses for rebuttal Wednesday. The judge told <mark>Steele</mark> to talk with his lawyer about whether or not he wants to testify. It's possible the case could be turned over to the jury as early as Wednesday. Channel 3000. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Confirm Unsubscribe Are you sure you would like to unsubscribe from all current subscriptions? Please set an email address for your profile. To complete your registration on this site, please supply an address."}, {"articleID": "2011110921_00103090_W", "names": {"Bob Watson": ["Q18601630", "Q4934325", "Q4934326"]}, "date": "2011-11-09", "url": "http://businesswire.com/news/home/20111109006878/en/Abraxas-Reports-Quarter-2011-Results", "content": "business wire)--abraxas petroleum corporation (nasdaq: axas) today reported financial and operating results for the three and nine months ended september 30, 2011 and provided an operational update. \"adjusted net income (loss), excluding certain non-cash items\" including abraxas' equity interest in blue eagle's production, the three months ended september 30, 2011 resulted in: production of 373.1 mboe (4,055 boepd), a 5% increase over q2 2011, of which 47% was oil or natural gas liquids. the three months ended september 30, 2011 resulted in: production of 343.1 mboe (3,729 boepd), excluding abraxas' equity interest in blue eagle's production, a 10% increase over q2 2011; of $8.1 million; net income of $20.1 million, or $0.22 per share; and (a) see reconciliation of non-gaap financial measures below. net income for the quarter ended september 30, 2011 was $20.1 million, or $0.22 per share, compared to net loss of $856,000, or $0.01 per share, for the same period in 2010. adjusted net income, excluding unrealized gains on derivative contracts, for the quarter ended september 30, 2011 was $3.6 million, or $0.04 per share, compared to adjusted net loss, excluding unrealized gains on derivative contracts, of $1.2 million, or $0.02 per share, for the same period in 2010. unrealized gains or losses on derivative contracts are based on mark-to-market valuations which are non-cash in nature and may fluctuate drastically period to period. as commodity prices fluctuate, these derivative contracts are valued against current market prices at the end of each reporting period in accordance with accounting standards codification 815, \"derivatives and hedging,\" as amended and interpreted, and require abraxas to either record an unrealized gain or loss based on the calculated value difference from the previous period-end valuation. for example, oil prices on september 30, 2011 were $79.20 per barrel compared to oil prices on june 30, 2011 of $95.42 per barrel; therefore, the mark-to-market valuation changed considerably period to period which resulted in an unrealized gain. since september 30, 2011, oil prices have increased significantly and are currently trading above $90 per barrel. rocky mountain - north dakota / montana in various counties in north dakota and montana, during the third quarter five gross (0.21 net) non-operated horizontal wells, targeting the bakken or three forks formation, came on-line. an additional two gross (0.05 net) non-operated horizontal wells are either waiting on a drilling rig or being completed. since january 2010, abraxas has elected to participate in 19 gross (1.00 net) non-operated wells in the bakken / three forks play. in mckenzie county, north dakota, two gross (0.11 net) non-operated horizontal wells targeting the mission canyon have been drilled, completed and production facilities should be completed within the next few weeks. early production testing of each of these wells yielded flow rates in excess of 1,000 barrels of oil per day. in williams county, north dakota, one gross (0.02 net) non-operated well targeting the lodgepole recently came on-line. the drilling rig that was purchased in july continues to undergo refurbishment and it is currently anticipated that it will begin drilling on the first multi-well pad site in mckenzie county, north dakota in the fourth quarter. in niobrara county, wyoming, the prairie falcon 3h was drilled to a total measured depth of 12,120 feet, including a 4,185 foot lateral, and is currently being completed with a 15-stage fracture stimulation. in campbell county, wyoming, a horizontal well targeting the turner formation is planned to be drilled in the fourth quarter of 2011 or first quarter of 2012, subject to timing of rig availability. abraxas owns a 100% working interest in each of these wells. at september 30, 2011, abraxas owned a 41% equity interest in blue eagle, a joint venture between abraxas and rock oil company, llc. in atascosa county, texas, the grass farms 1h was drilled to a total measured depth of 13,150 feet, including a 5,400 foot lateral. the well was recently completed with an 18-stage fracture stimulation and is currently recovering frac fluid as the oil cut continues to increase. the well is being produced on a restricted choke to avoid formation damage and to minimize gas production. blue eagle owns a 100% working interest in this well. blue eagle anticipates drilling one horizontal well on its recently acquired leasehold (2,487 net acres) in northern mcmullen county in the fourth quarter. in nolan county, texas, the spires 126 3h was recently drilled to a total measured depth of 9,300 feet, including a 2,000 foot lateral, and completed open hole and un-stimulated. the well recently came on-line and has produced an average of 180 barrels of oil equivalent (80% oil or liquids) during its first 10 days on production. abraxas owns a 100% working interest in this well. in coke county, texas, the sadie a #2 was recently drilled to a total vertical depth of 6,425 feet and is currently being completed. this well targeted the canyon sands and abraxas owns a 100% working interest in this well. in alberta, canada, the twining 6-11 and the twining 6-12 were recently completed and placed on production. a third well, the twining 15-18, is currently drilling below 7,500 feet towards a total measured depth of 9,800 feet, including a 3,600 foot lateral. canadian abraxas owns a 100% working interest in each of these wells which have targeted the pekisko formation. comments \"during the 3rd quarter, we increased production 5% over the 2nd quarter, including our equity interest in blue eagle, and 10%, excluding it. we also increased revenue 29% year over year in the 3 rd quarter as oil prices increased as well as our percentage of oil and natural gas liquids. we are quite pleased with the production growth and we anticipate similar growth for the foreseeable future. our pad development drilling in the williston basin should be underway shortly and we look forward to all of the positives that will come from that program,\" commented <mark>bob watson</mark>, abraxas' president and ceo. conference call abraxas invites you to participate in a conference call on thursday, november 10, 2011, at 10:00 a.m. ct (11:00 a.m. et) to discuss the contents of this release and respond to questions. please dial 1.888.680.0865, passcode 28715362, 10 minutes before the scheduled start time, if you would like to participate in the call. the conference call will also be webcast live on the internet and can be accessed directly on the company's website at www.abraxaspetroleum.com under investor relations. in addition to the audio webcast replay, a transcript of the conference call will be posted on the investor relations section of the company's website approximately 24 hours after the conclusion of the call and will be accessible for at least 60 days. abraxas petroleum corporation is a san antonio based oil and gas exploration and production company with operations across the rocky mountain, mid-continent, permian basin and onshore gulf coast regions of the united states and in the province of alberta, canada. (a) see reconciliation of non-gaap financial measures below. reconciliation of non-gaap financial measures to fully assess abraxas' operating results, management believes that, although not prescribed under generally accepted accounting principles (\"gaap\" ), discretionary cash flow and ebitda are appropriate measures of abraxas' ability to satisfy capital expenditure obligations and working capital requirements. discretionary cash flow and ebitda are non-gaap financial measures as defined under sec rules. abraxas' discretionary cash flow and ebitda should not be considered in isolation or as a substitute for other financial measurements prepared in accordance with gaap or as a measure of the company's profitability or liquidity. as discretionary cash flow and ebitda exclude some, but not all items that affect net income and may vary among companies, the discretionary cash flow and ebitda presented below may not be comparable to similarly titled measures of other companies. management believes that operating income calculated in accordance with gaap is the most directly comparable measure to discretionary cash flow and ebitda; therefore, operating income is utilized as the starting point for these reconciliations. discretionary cash flow is defined as operating income plus depreciation, depletion and amortization expenses, non-cash expenses and impairments, cash portion of other income (expense) less cash interest. the following table provides a reconciliation of discretionary cash flow to operating income for the periods presented. ebitda is defined as net income (loss) plus interest expense, depreciation, depletion and amortization expenses, deferred income taxes and other non-cash items. the following table provides a reconciliation of ebitda to operating income for the periods presented - see consolidated statements of operations for a reconciliation of net income (loss) to operating income. (a) excludes realized gain (loss) associated with interest rate derivative contract. this release also includes a discussion of \"adjusted net income (loss), excluding certain non-cash items,\" which is a non-gaap financial measure as defined under sec rules. the following table provides a reconciliation of adjusted net income (loss), excluding change in unrealized derivative contracts, to net income (loss) for the periods presented. management believes that net income (loss) calculated in accordance with gaap is the most directly comparable measure to adjusted net income (loss), excluding certain non-cash items. barbara m. stuckey, 210-490-4788 vice president - chief financial officer recent stories from abraxas petroleum corporation abraxas schedules third quarter 2011 financial and operating results conference call san antonio--(business wire)--abraxas petroleum corporation (nasdaq: axas) will announce their third quarter 2011 financial and operating results on wednesday, november 9, 2011, after the u.s. finan...abraxas to present at the canaccord genuity global energy conference"}, {"articleID": "2016091412_00537469_W", "names": {"Colin Powell": ["Q150851", "Q5145485"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-14", "url": "http://wjtv.com/ap/leaked-colin-powell-emails-show-loathing-for-trump/", "content": "Leaked <mark>Colin Powell</mark> emails show loathing for <mark>Trump</mark> JEFF HORWITZ, The Associated Press Published: September 14, 2016, 7:30 am WASHINGTON (AP)--Former Secretary of State <mark>Colin Powell</mark>--in newly leaked emails--calls <mark>Donald Trump</mark> \"a national disgrace,\" and <mark>Powell</mark> laments Hillary Clinton's attempt to equate her email practices with his. The emails were first reported by Buzzfeed News. <mark>Powell</mark> is a respected retired general who served under Republican presidential administrations. He tells BuzzFeed that he doesn't deny the emails' authenticity. And in a later statement to NBC News, <mark>Powell</mark> says \"the hackers have a lot more\" of his emails. Related Advertisement & laquo; Previous Story Please enable JavaScript to view the comments powered by Disqus. Leave a Reply Cancel reply Enter your comment here...Fill in your details below or click an icon to log in: Email (required) (Address never made public) Name (required) Website You are commenting using your WordPress.com account. (Log Out / Change) You are commenting using your Twitter account. (Log Out / Change) You are commenting using your Facebook account. (Log Out / Change) You are commenting using your Google + account. (Log Out / Change) Cancel Connecting to% s Notify me of new comments via email. Notify me of new posts via email. Advertisement Weather Conditions change location Vicksburg 72 & deg; F 0 N Wind 70 & deg; Dewpoint 94% Humidity 30.07 \"Barometer 6:47 am Sunrise 7:09 pm Sunset change location Jackson, Miss.. 72 & deg; F 4 NE Wind 69 & deg; Dewpoint 91% Humidity 30.09\" Barometer 6:44 am Sunrise 7:06 pm Sunset Sponsored By: Cannon Nissan change location Brookhaven n/a F 0 N Wind n/a Dewpoint n/a Humidity 30.09 \"Barometer 6:45 am Sunrise 7:07 pm Sunset Vicksburg 72 & deg; Jackson, Miss.. 72 & deg; Brookhaven n/a More Stories Gov. Bryant comments on NCAA decision on removal of games AKA unveils new community garden Egg Bowl will be played on Thanksgiving in 2017 Advertisement Advertisement Advertisement"}, {"articleID": "2016021802_00460868_W", "names": {"Jennifer Lopez": ["Q40715", "Q6178557"]}, "date": "2016-02-17", "url": "http://www.gossipcop.com/dalton-rapattoni-rebel-yell-american-idol-video-top-24-performance-watch-youtube/", "content": "VIDEO (Fox) Dalton Rapattoni gave a \"tremendous\" performance of \"Rebel Yell\" during Wednesday's \"American Idol .\" Watch below! As Gossip Cop reported, Rapattoni was welcomed into the season 15 Top 24 earlier this month, with the judges praising the unconventional twists he puts on songs. Now with hopes of making it into the Top 14, he continued to show his punk side with Billy Idol's \"Rebel Yell .\" The 20-year-old vocal coach had <mark>Jennifer Lopez</mark> bouncing in her seat, Keith Urban singing along with a smile, and Harry Connick, Jr., well, staring intently. <mark>Lopez</mark> couldn't stop screaming afterward at first, and the exclaimed, \"Dalton! You know, I don't care about anything except that made me feel something. First of all, you're pretty as can be. I can't with him .\" She added more seriously, \"Beyond that, it was a great performance...I loved it .\" Connick told Rapattoni, \"It was absolutely a phenomenal performance. It was a great interpretation of that song. You sang the lyrics. It was powerful. I thought it was absolutely tremendous .\" And Urban said to the aspiring star, \"You never disappoint. That's what I love about you. I know you're gonna do something with a song that we know, but you're gonna make it--you're gonna Dalton-ize it...I love that you got your own genre. It's very cool .\" It will be revealed on Thursday's results show who from Rapattoni's group of 12 will join last week's safe contestants to make up the Top 14. With five at risk of elimination, he'll have to be among the seven who make the cut. Gossip Cop will have full video of his performance shortly, but check out the clip below in the meantime! Enter your email address here to receive daily news updates from us. Use the LIKE button below to see GossipCop notifications in your Facebook news feed! Got Tips"}, {"articleID": "2016092412_00143320_W", "names": {"Shamsher Singh": ["Q24175058", "Q48869003"]}, "date": "2016-09-24", "url": "http://tribune.com.pk/story/1187590/kumar-sanus-concert-cancelled-lahore-retaliation-threats-pakistani-actors/", "content": "The Express Tribune Share Tweet Email Forthcoming visit of Indian folk singer <mark>Shamsher Singh</mark> Mahdi to Lahore has also been postponed. PHOTO: Reuters LAHORE: Indian singer Kumar Sanu's concert scheduled to be held in Lahore on Monday has been cancelled in retaliation to threats issued by an Indian nationalist party to Pakistani actors. The concert organised to pay tribute to Abdul Sattar Edhi was scheduled to be held at Lahore's Royal Palm Country Club on September 26. Tickets for the event have already been sold and sources claim the organisers had raised Rs4 million from the sales. Indian nationalist party gives Pakistani actors 48-hour ultimatum to leave country The event has been cancelled following threats from Indian nationalist party Maharashtra Navnirman Sena (MNS). The film workers' association of MNS on Friday \"ordered' all Pakistani actors working in India to leave the country in 48 hours .\" We gave a 48-hour deadline to Pakistani actors and artists to leave India or the MNS will push them out, \"The Indian Express quoted Amey Khopkar of the MNS Chitrapat Sena as saying. Khopkar also threatened to assault Pakistani artists and those who cast them."}, {"articleID": "2014013103_00013458_W", "names": {"Neil Armstrong": ["Q1615", "Q594654"]}, "date": "2014-01-30", "url": "http://www.sltrib.com/sltrib/news/57462135-78/stem-utah-science-businesses.html.csp", "content": "Utah businesses working to make science, math sexy Science \"With $2 million campaign, businesses want to help raise awareness of jobs in science and technology fields. First Published 3 minutes ago? Updated 3 minutes ago Utah businesses will kick in $2 million to promote the state's science, technology, engineering and math (STEM) initiative, the Utah governor and business leaders announced Thursday. It was launched in an event at <mark>Neil Armstrong</mark> Academy, a STEM-centered elementary in West Valley City .\" Imagine what students could achieve if they caught the vision of their own capability to be successful with STEM topics, \"said Jeffery R. Nelson, president and chief executive of Nelson Labs. Nelson is chairman of the STEM Action Center board. The board oversees the 2013 Legislature created as part of the Governor's Office of Economic Development. Its purpose is to help Utah's students become better prepared for jobs in technology and science .\" STEM jobs are the jobs of Utah's future, \"Gov. Gary Herbert said in a news release. Herbert had challenged the business community to support STEM education. Besides raising awareness of science and technology jobs among students and their parents, the campaign is designed to get the word out among businesses that schools and the STEM initiative need their help. Many already are helping. IM Flash, a flash memory maker, donated 70 refurbished computers to a lab at Tooele Junior High last fall."}, {"articleID": "2011112913_00010024_W", "names": {"John Hamer": ["Q16106649", "Q2300893"]}, "date": "2011-11-29", "url": "http://istockanalyst.com/article/viewarticle/articleid/5567994", "content": "u.s. market trade in green as european debt crisis gets new hopes; hot stocks of the day: sne, wilc, axp, goog robust black friday sales stimulate hopes of stronger holiday season sales former danisco evp to lead cobalt toward commercialization mountain view, calif., nov. 29, 2011 / prnewswire /--today, cobalt technologies, a leading developer of next generation bio n-butanol, appointed bob mayer as chairman of its board of directors and chief executive officer (ceo). with over 30 years of experience in the chemicals and biotech sectors, mayer joins cobalt to lead the company as it focuses on developing commercial facilities globally. as chairman and ceo, mayer will be responsible for setting strategic direction, cultivating partnerships and driving the company to profitability. cobalt's bio n-butanol technology converts biomass and non-food waste sugars into bio n-butanol at a cost that is 40-60% lower than current petrochemical technology. n-butanol is currently sold into a multi-billion dollar market and cobalt's low-cost process enables the use of n-butanol as a chemical feedstock for conversion into a wide variety of chemicals and fuels, greatly expanding the addressable market. \"i am eager to join the cobalt team, which is in an exciting stage as it forges new business relationships and begins building large-scale facilities,\" said mayer. \"cobalt is in a prime position for explosive growth and i look forward to leveraging my experience to continue its rise in the biofuels, chemicals and jet fuels markets .\" mayer, who has extensive experience growing businesses within the biotech sector as the former executive vice president of danisco, will also lead the development of strategic business relationships and fundraising for the company. \"we are pleased bob has joined the cobalt team as chief executive officer and we look forward to working under his leadership to continue advancing the company,\" said <mark>john hamer</mark> of burrill and company, the outgoing chairman. \"bob's wealth of experience in the mature biotech and chemicals markets is invaluable for cobalt, which has moved out of pilot testing and into larger-scale projects on the road to commercialization .\" post comment--login is required to post message perma-fix announces its eleventh annual mixed & low level waste management forum zacks investment research, and commentary, news and press releases provided by yellowbrix and quotemedia. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. istockanalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. the blog articles are opinions by respective blogger. by using this site you are agreeing to terms and conditions posted on respective bloggers' website. the postings/comments on the site may or may not be from reliable sources. neither istockanalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. you are solely responsible for the investment decisions made by you and the consequences resulting therefrom. by accessing the istockanalyst.com site, you agree not to redistribute the information found therein. we prefer not to publish articles related to otcbb or pink sheet securities. we do not accept articles containing offesive language, racial remarks, sex / pornography beyond the requirement of the story."}, {"articleID": "2017051604_00612021_W", "names": {"Wendy Miller": ["Q56099345", "Q57952091", "Q7982727"]}, "date": "2017-05-16", "url": "http://reneweconomy.com.au/how-cheap-is-solar-cheap-enough-to-cool-the-air-outside-85335/", "content": "How cheap is solar? Cheap enough to cool the air outside By Giles Parkinson on 16 May 2017 How cheap is solar? Cheap enough, says the head of the Australian Renewable Energy Agency, to drive the transformation of our grid to zero emissions. Cheap enough, he says, to inspire some people to install air conditioners on their verandah to cool the air outside the house, as well as inside. Source: <mark>Wendy Miller</mark>, Senior Research Fellow, Queensland University of Technology (via The Conversation) The latter, quite bizarre example was given by ARENA CEO Ivor Frischknecht at the recent Emissions Reduction conference in Melbourne to illustrate just how cheap solar has become. He came across a home owner in Townsville, north-eastern Queensland, who had installed a very large rooftop solar system, and planned to use it to power an air conditioning unit on the verandah. \"He likes to have cool air on his face while he is sitting outside outside,\" Frischknecht said. \"And this is fine, because if you are only running it in middle of day, and using the solar, the energy is free .\" Indeed, noted Frischknecht, solar was becoming so cheap, and will become so abundant, that we will reach the situation where the kilowatt hours of use (i.e. the production) are effectively free. The cost will come in managing the variability, and integrating it into the grid. But even here, contrary to much that is written, Frischknecht says the technologies to do that are available now, in the form of battery storage, demand response, pumped hydro and a \"whole bunch of solutions that can ensure that the lights stay on .\" The challenge comes down to rewriting the market rules and regulations, and reframing business models, so that these technologies are rewarded for their services, and not punished. He cited the use of battery storage. \"If you have a battery today and charge it up--you have to pay transmission costs and distribution costs and a share of RET, and when you discharge it again and sell the output, you pay all those costs again,\" Frischknecht said. \"You are adding 50 per cent to the cost of energy getting stored. That's a pretty big barrier to put in place of a mechanism we need .\" Frischknecht says it is not hard to look forward and imagine a world where many things would be quite different, and when a lot of centralised fossil fuel generation is made redundant by the falling costs of renewables. \"The cost of solar PV will be so cheap it will literally cover every surface--packaging, buildings, cars, roads. Energy will be cheap, but we will still got this variable output issue. We are going to have to figure out different ways of pricing and dealing with variable output .\" RenewEconomy Free Daily Newsletter"}, {"articleID": "2010100221_00142757_W", "names": {"Nick Price": ["Q1503206", "Q612279"], "Peter Senior": ["Q1917500", "Q43166732"], "Jay Haas": ["Q20676868", "Q769098"]}, "date": "2010-10-02", "url": "http://nbcsports.msnbc.com/id/39476543/ns/sports-golf/", "content": "conover, n.c. - fred couples shot a 6-under 66 saturday to take a one-stroke lead over bernhard langer into the final round of the ensure classic. couples was at 12-under 132 after the second round of the champions tour event at the rock barn golf and spa. \"i played pretty well...and i would never turn back shooting 6-under and 6-under,\" couples said. \"i hit a lot of very good shots and one bad one. i made a lot of birdies, which i'm going to have to do (sunday).\" i can't see bernhard or <mark>nick price</mark> making too many bogeys, but if i can make seven or eight birdies, i'll be pretty tough tomorrow. \"langer, who had a 67, is pursuing his sixth win this season on the 50-and-over circuit and leads couples by 672 points in the charles schwab cup standings. the german got off to a rough start saturday, bogeying no. 1. but he fought back with seven birdies and only one bogey the rest of the way to remain in the lead group for sunday's final round .\" i had those two bogeys, which was the only thing i didn't like, \"langer said .\" i had a really bad break to start, but i got it right back ....it was a fairly solid round. i'm trying to stay in contention and win tournaments. obviously, i can't control what the others do, but i can play the best i can. \"morris hatalsky (65) and <mark>nick price</mark> (67) were another stroke back at 134 .\" i've really hit a lot of greens the last two days, \"said <mark>price</mark>, who matched his first-round score with five birdies saturday .\" the conditions made it a little easier for us. \"a day after winds gusted to 25 mph and fairways were showing the affects of five days of rain, saturday's round was played in light winds, with the course firming up after two days of sunshine .\" it was a day for scoring, \"said hatalsky, who had the day's lowest round in a bid to win his first champions tour event in more than 4? years, a span of 109 tournaments .\" it was nice to put together a full round of golf. my short game has been very disappointing this year, but not this week. \"tommy armour iii (67) and dan forsman (68) were tied for fifth at 135, with 16 other golfers within six strokes of couples heading into sunday's final round. among them was first-round leader <mark>peter senior</mark>, who faltered from his 65 friday to shoot an even-par 72. he was at 138 with eight other players. two-time and defending tournament champion <mark>jay haas</mark> also struggled, finishing with a 73 after shooting a 68 friday. he was at 141 with four other players. copyright 2010 the associated press. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. terrelle pryor returned after an injury briefly knocked him from the game, then led no. 2 ohio state to a 24-13 victory over illinois on saturday. tiger woods and steve stricker help the u.s. to a 6-4 lead, but europe has plenty of momentum heading into the final day."}]