[{"articleID": "2011032301_00043737_W", "names": {"Ian Smith": ["Q19879108", "Q2066705", "Q20706233", "Q21165143", "Q21455125", "Q27915041", "Q29877016", "Q3147321", "Q3147322", "Q3348235", "Q43137658", "Q57247212", "Q57904183", "Q59452659", "Q5980715", "Q5982927", "Q5982930", "Q5982932", "Q5982934", "Q5982935", "Q5982945"]}, "date": "2011-03-23", "url": "http://scoop.co.nz/stories/BU1103/S00707/unisys-signs-it-support-services-agreement-with-alphawest.htm", "content": "unisys signs it support services agreement with alphawest unisys signs it support services agreement with alphawest unisys to support alphawest's growing business by extending it service management offering to alphawest clients>>> under the private label services agreement, unisys will provide a range of it infrastructure support services from its smart on-site services portfolio as required, to extend the reach and breadth of services and support for alphawest customers nationally. services include remote and on-site it support, installations, moves and changes \"unisys provides smart on-site services under private label arrangements in australia to emc and other hardware providers as part of global, regional and local relationships. we are excited at the opportunity to use the same rigorous standards and processes to benefit alphawest's clients in this new engagement,\" said scott whyman, vice president and general manager, global outsourcing and infrastructure services, unisys asia pacific. \"as the alphawest business continues to grow, we require a services partner aligned with industry best practice methodologies and processes to support the increasing complexity of our customers' ict infrastructure. we selected unisys as they complement our skill-set and have adopted industry-leading standards to ensure our clients receive the consistently high level of support and service they have come to expect from alphawest,\" said mr <mark>ian smith</mark>, acting ceo, alphawest. unisys smart on-site services are based on the information technology infrastructure library (itil) set of practices and policies for it service management, and are designed to improve both service delivery efficiency and quality. \"because unisys services are based on the itil framework and are iso-certified, we can assist organisations like alphawest to offer consistently reliable service and support to their clients even as they continue to expand,\" mr whyman added. scoop business: telecom gets no reprieve on uba regulation scoop business: quake-hit businesses target of $6.85 m fund scoop business: qantas agrees to $6.5 m fine in cartel case, air nz fights on re-bundling? structural separation \"must be controlled by government\" scoop business: power unveils final leg of nz securities law reform john key should play the one card he has up his sleeve?? minister of innovation ..."}, {"articleID": "2020030520_00068674_W", "names": {"Bruce Mann": ["Q18379159", "Q4977945", "Q4977948"]}, "date": "2020-03-05", "url": "http://wftv.com/news/politics/latest-sanders/GH5SZURDZQ2ZL4SNOB72J2WPNI/", "content": "The Latest: Klobuchar going to Michigan to stump for Biden Share Share Share Updated: March 5, 2020 - 2:47 PM WASHINGTON--(AP)--The Latest on the 2020 presidential election (all times local): 2:45 p.m. Amy Klobuchar is going to Michigan to campaign for her former Democratic presidential rival Joe Biden. Content Continues Below The Minnesota senator dropped out of the 2020 race on the eve of Super Tuesday and endorsed Biden. Fellow former candidates Pete Buttigieg, Beto O'Rourke and Mike Bloomberg soon followed. Klobuchar will visit with union members in Detroit on Friday before hosting a Women for Biden event in Southfield, Michigan. On Saturday, Klobuchar will speak at a get-out-the-vote event in Grand Rapids. Biden won 10 of 14 states on Super Tuesday, including delegate-rich Texas. Vermont Sen. Bernie Sanders captured four states, including the biggest prize of all, California. ___ 12:50 p.m. Elizabeth Warren says she will not be running for president in 2020 but guarantees that she will stay in the fight. Speaking to reporters Thursday outside her home in Cambridge, Massachusetts, Warren said she'd likely endorse one of the two major candidates left in the race, Joe Biden or Bernie Sanders, but \"not today.\" \"I need some space and I need a little time right now,\" she said, standing next to her husband, <mark>Bruce Mann</mark>, and golden retriever, Bailey. Warren's voice cracked when she talked about meeting so many little girls while campaigning around the country for the past year and knowing they \"are going to have to wait four more years,\" at least, to see a woman in the White House. The Massachusetts senator was the Democratic presidential primary's last top female candidate. She suspended her campaign Thursday, two days after a disappointing Super Tuesday that included a third-place finish in her home state. Warren added: \"I have no regrets at all. This has been the honor of a lifetime.\" ___ 10:50 a.m. Elizabeth Warren has ended her Democratic presidential bid after a disappointing finish in Super Tuesday states. That's according to a person familiar with her plans who wasn't authorized to speak about Warren's intentions and talked to The Associated Press on Wednesday on the condition of anonymity. The Massachusetts senator's campaign had the markers of success: robust poll numbers, impressive fundraising, a national organization. But she was squeezed out by Bernie Sanders, who had an immovable base of voters she needed to advance. In the end, she didn't even win her home state--she finished third behind Joe Biden, who won it, and Sanders. Her exit from the race on Thursday came days after Amy Klobuchar dropped out. It leaves the Democratic field with just one remaining female candidate: Hawaii congresswoman Tulsi Gabbard .--AP writer Will Weissert FILE - In this Feb. 27, 2020 file photo, Democratic presidential candidate Sen. Elizabeth Warren, D-Mass ., addresses supporters during a town hall in San Antonio. (AP Photo/Eric Gay) (Eric Gay) Sen. Amy Klobuchar, D-Minn ., endorses Democratic presidential candidate former Vice President Joe Biden at a campaign rally Monday, March 2, 2020 in Dallas. (AP Photo/Eric Gay) (Eric Gay) © 2020 Copyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."}, {"articleID": "2015022610_00035234_W", "names": {"Jeff Anderson": ["Q1140895", "Q26899394", "Q29167254", "Q50239827", "Q6173216", "Q6173217"], "Jeff Clark": ["Q1686278", "Q27057573", "Q6173576"], "Scott Carlson": ["Q3952821", "Q50278901"]}, "date": "2015-02-25", "url": "http://www.yakimaherald.com/news/latestnews/2940457-14/slow-go-without-snow-for-some-valley-businesses", "content": "By Kate Prengaman / Yakima Herald-Republic Although a few inches of snow are expected in the mountains tonight and Thursday, it's likely too little, too late for some Central Washington businesses that depend on winter recreation for customers. \"People are over it. They've already put their snowmobiles away for the season,\" said <mark>Jeff Anderson</mark>, owner of Sportland Yamaha in Cle Elum, which sells and repairs snowmobiles and off-road vehicles. \"It's not generating a lot of business.\" It's been a slow winter for everyone whose sales are tied to snowfall, which is only about a third of normal across the south-central Cascades, and has been limited to high elevations. While some business owners are holding out hope for late-season snowstorms, others are already switching to spring inventory. At Mountain High Sports in Ellensburg, owner Tami Walton said sales of winter clothing and gear were fine in December and January but slowed in February as the snow melted. She said some winter gear is now headed to the sale racks to make room for the spring sporting goods customers already are seeking. \"This year, it seems to be a different season every day, so we have about a 50-50 mix on the floor right now,\" Walton said. \"We did, however, leave the flip-flops in the boxes, but they are tagged and ready to go in case it is 80 degrees tomorrow.\" In Yakima, Sporthaus owner Sig Fossum said he's not planning to discount ski and snowboard gear yet, but he jokes that he does have snow on order. Dedicated skiers are making the best of the springlike conditions on the slopes while rooting for more snow, Fossum said. While the base of White Pass Ski Area looks grim from U.S. Highway 12, skiers report that the less-visible upper slopes have good snow and offer plenty of opportunities. Fossum said he's gotten in some good skiing at White Pass, but the warm weather in the Valley is pushing some of his customers to other sports. \"Business is slow, and we're having more interest in tennis a little bit earlier than usual,\" he said. \"It's quieter this year than last year because our weather down here is even nicer.\" Like other passionate skiers, Fossum is optimistic about the forecast of snow showers in the Cascades over the next few days, as temperatures are expected to range from the high - to low-30s, according to the National Weather Service. In Yakima, highs near 50 and lows in the 30s are expected, with chances of rain Thursday and Friday. Sunshine is expected to return Saturday. For the nonsnow sports enthusiasts, the warmer-than-usual weather has been good news. \"Our spring rush is about a month to six weeks early with this great weather,\" said <mark>Jeff Clark</mark>, co-owner of Revolution Cycles in Yakima. \"What I'm hearing is that people are tired of waiting for snow, so they are getting their bikes out. It's great for us.\" And the recent sunshine has inspired some gardeners to get an early start, said Lisa Lacour at Ace Hardware in Yakima. But she's been reminding people it's still February, too soon to plant much beyond the most cold-tolerant species. The springlike weather also allowed <mark>Anderson</mark>, the Cle Elum store owner, to sell a couple off-road vehicles last weekend, which he called highly unusual for February. But the sales this season didn't balance out the lack of interest in snowmobile gear and repairs caused by so few people riding. \"It's not what I like, but we're on to another season here pretty soon,\" <mark>Anderson</mark> said. His business has endured ups and downs with the weather before, he added. The lack of snow to entice snowmobilers also is affecting the bottom line at Whistlin' Jack Lodge, a popular home base for people who enjoy winter weekends in the Chinook Pass area, according to employee <mark>Scott Carlson</mark>. \"It's definitely hurting business,\" <mark>Carlson</mark> said. \"We are getting more hikers already, and people are already coming over and asking about fishing. But it's definitely not making up the difference.\" <mark>Carlson</mark> said that beyond the lost winter tourism, as a volunteer firefighter, he's also worried about the increased risk of wildfires this spring. \"We're already getting stuff prepared for the fire season,\" he said. \"It's going to be a bad fire season after having no snow like this.\" The long-term forecast calls for warm and dry conditions to continue for the next few months. Although, there's still a chance for a few more snowstorms, too. If serious snow arrives, local businesses will be ready to outfit customers."}, {"articleID": "2009022500_00010027_W", "names": {"Michael W. Smith": ["Q18325556", "Q357515"], "Hans Zimmer": ["Q1344628", "Q76364"]}, "date": "2009-02-25", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=13055104&blogId=123746634", "content": "gender: male status: in a relationship ** author \"s note: i officially despise my internet...i\" ve tried to write this twice before. first time, i was just about to press, \"post blog\" and my internet \"redirected,\" me and when i hit back, the blog was gone...the second time, the same happened, but id only gotten about a third of the way through...so if i seem a bit annoyed, thats why...so yeah...* last week in us history, we watched batman begins (i love this time of the school year) and two scenes in particular caught my eye for, umm...we \"ll call it god content. they\" re about 2 minutes apart, and...let me give you background for the first one...sergeant gordon is on the island (the narrows) and the league of shadows has begun to spread crane \"s drugs, which causes panic through hallucinations, thus inducing violence. good so far? ok. he\" s one of two people that have been innoculated against the gas, so he \"s trapped on an island with hallucinating, violent people, and a whole bunch of serial killers and such that were released from an insane asylum. the bridges are raised, so he cant get off. he radios his police chief on the mainland of gotham. gordon:\" hello? this is gordon! we need backup over here; swat, horsemen, something! \"chief:\" woah, waoh, gordon, all the reinforcment we have are the island with you. theres noone left to send in. \"gordon is stuck. he has basically no chance. the narrows is normally a dangerous place anyways, and cops only go there in force, and hes just one cop in an urban island full of panicking violent people and killers. just then, the batmobile crashes down behind him, and batman steps out. right at the moment when hope is lost, when theres nowhere left to turn, the one with power to defeat the darkness and rescue him from a hopeless situation. the other scene is a couple minues later. rachel, who is the other person innoculated, has found a kid of maybe 8 or 9, who doesnt seem to be hallucinating too badly, and shes trying to protect him. then a band of escaped inmates comes out of the smoke, brandishing weapons, and slowly advances on her. she picks up a cops gun, and starts to back against a wall, holding the child close. rachel:\" oh, god...* pulls hammer of gun back * dont peek. \"kid:\" dont worry; batman will save us. he \"ll come.\" she gets ready to pull the trigger, as the inmates get closer, and just as she prepares to fire her first shot, who appears out of the smoke? right. batman flies in, beats the crud out of all 12 or 13 of them, and then flies off to find raaz al \"ghul. the kid looks up at rachel. kid (matter-of-factly):\" see? i told you he \"d come.\" jesus once said something along the lines of (sorry, my bible \"s in my car)\" unless you have the faith of a little child, you cannot enter the kingdom of heaven. \"why? because they have no problem believing the improbable. life has taught adults and teenagers even to be pessimistic, and to not set ourselves up to be let down. kids trust completely in something they believe in. this little kid puts me to shame...i\" ve seen god swoop in at the last second and rescue me time and time again. heck, i \"ve had experiences that others can only dream (or have nightmares, more like) about, and yet i dont believe he\" ll do some things even still...oh, that i had the faith of the kid...not even the slightest surprise at batmans appearance...so...anyways, just some thoughs i thought i \"d share...god bless and goodnight, ps...so heres some bands and their cd\" s that if you havent heard, you should...1. anything switchfoot or relient k 2. dawn escapes, by falling up (very good!) 3. songs, by rich mullins 4. bad hair day by weird al 5. x 2006 by various artists 6. acceptance...any cd 7. any of tfk \"s cds; set it off, art of breaking, and of course, phenomenon 8. fallen, by evanessence 9. five, by dont look down 10. freedom, and live the life, by <mark>michael w. smith</mark> 11. anything newsboys 12. human clay, by creed 13. megamix, by <mark>hans zimmer</mark> 14.\" freebird \", by leonard skynard...15. where do we go from here?, by pillar...soo yeah...oh, heres some lyrics from a song on that x: 2006 cd...\"cause honestly, i\" m not that strong.i \"m not alright, i\" m broken inside, broken inside! and all i go through, it leads me to you, leads me to you!...i \"m not alright, and thats why i need you!\" - sanctus real...\"and from dawn escapes,\" drink from the water, that swept me away; so say your goodbyes now, this we \"ll say.\" ...\"this is the way, this is the motion; let go now! this is the way, this is the ocean, let go now!\" ...\"if you close your eyes; if you took a breath, when the knife is on the ground. if you feel a race, when he\" s in this place, then your life, it will be found. motion \"s on it, breathe and want it; if you close your eyes...\"- falling up\" this place i pass, is in my eyes the words you spoke, they blow me away like leaves in time your clarity, it starts to need and i am left with words im leaving underneath this is oceans end races start again cause you want everything i see beneath, i hear the breath i feel the deep and shallow dreams that try to pass but in this place, where echoes stay is just the place where i will start to find escape your world is crashing to the ground youre alone \"- falling up\" we cannot separate; you \"re part of me. and though you\" re invisible, i \"ll trust the unseen. i cried out with no reply, and i cant feel you by my side,"}, {"articleID": "2009072709_00054698_W", "names": {"Simon Jones": ["Q10548323", "Q181664", "Q325070", "Q42926431", "Q47435289", "Q54483127", "Q57263285", "Q7519069", "Q9337052"], "Steve Rhodes": ["Q25352324", "Q7478675", "Q7613734", "Q7613736"]}, "date": "2009-07-27", "url": "http://ecb.co.uk/news/domestic/counties/worcestershire/more-pain-for-sidelined-kabir,306829,EN.html", "content": "kabir ali bowls david balcombe at the rose bowl, but appearances have been few and far between since buy this photo worcestershire paceman kabir ali is to have a second scan to determine the extent of his back problem in the latest setback of an injury-hit season. but the england bowler, who has already missed two months of the campaign with a hamstring problem, is optimistic of a return to action sooner rather than later. kabir picked up 59 first-class wickets last season and played a major part in worcestershire gaining promotion from division two of the lv = county championship. but worcestershire have sorely missed him and knee injury victim <mark>simon jones</mark> during the current campaign and are still searching for their first win in the championship this season. kabir said: \"it has been a frustrating season. i had a bad hamstring injury, got back into rhythm after a couple of months out, but then the back felt a bit sore.\" the first scan didn't show a lot and that is why i am going for a second scan this week. \"the doctor said there was nothing to worry about, that nothing major has come out of the scan, but we just want to get a second opinion.\" kabir added: \"it is the first time i've missed such a large chunk of the season. my normal goal is to get through a season injury-free and that hasn't happened this time.\" but there is still quite a lot of cricket left so i am hoping to come back pretty soon. \"worcestershire director of cricket <mark>steve rhodes</mark> was more cautious:\" kabir had a first scan and we are still unsure what the problem is."}, {"articleID": "2011052914_00056934_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2011-05-29", "url": "http://theolympian.com/2011/05/29/1668549/mcconnell-ryan-medicare-plan-on.html", "content": "washington - the top republican in the senate said sunday that a controversial house medicare plan is \"on the table\" as president barack obama and his gop rivals wrestle over budget cuts to enact this summer. senate minority leader mitch mcconnell, r-ky., said on nbc's \"meet the press\" that he supports the controversial plan by house budget committee chairman <mark>paul ryan</mark>, r-wis., to transform medicare into a voucher-like system in which future beneficiaries - those 54 and younger - would get subsidies to buy health insurance rather than have the government directly pay their doctor and hospital bills. the house plan has come under a sustained assault from democrats, who charge it would \"end medicare as we know it.\" democrats successfully used the charge is winning a house special in a strongly republican district in upstate new york last week. asked whether he would concede that the <mark>ryan</mark> medicare plan won't be part of any budget deal this year, mcconnell said: \"no. it's on the table.\" mcconnell was referring to budget talks led by vice president joe biden and senior lawmakers in both parties over what spending cuts to add to must-pass legislation to allow the government to continue to borrow to fund federal programs and prevent a market-rattling, first-ever default on u.s. bonds but mcconnell seemed to acknowledge that with a democrat in the white house, the <mark>ryan</mark> plan is effectively dead for now. the measure by the wisconsin gop congressman also fell well short in a senate vote last week. \"i'm personally very comfortable with the way <mark>paul ryan</mark> would structure it,\" mcconnell said. \"but we have a democratic president. we're going to have to negotiate with him on the terms of changing medicare so we can save medicare.\" appearing on the same program, sen. chuck schumer, d-n.y., called on republicans to abandon the house medicare plan, noting an analysis by the nonpartisan congressional budget office that says it would require seniors to shoulder an increasingly large share of their health care costs. mcconnell: gop, dems should seek medicare savings \"tooltipid =\" mi_tt1 \"> mcconnell: gop, dems should seek medicare savings the senate's top republican said friday that lawmakers should not fear voter backlash for trying to squeeze savings from medicare to reduce federal debt, because it will take a bipartisan deal to tackle the popular program. democratic-led senate rejects house gop budget, medicare plan\" tooltipid = \"mi_tt2\" > democratic-led senate rejects house gop budget, medicare plan democratic-led senate rejects house gop budget, medicare plan the senate on wednesday rejected the house of representatives' controversial republican budget plan by 57-40, one that would dramatically revamp medicare while cutting spending by $4.4 trillion over 10 years to reduce future federal budget deficits. gop asks: where is democrats' plan to cut deficits? \"tooltipid =\" mi_tt3 \"> gop asks: where is democrats' plan to cut deficits? members of congress headed home for a holiday recess without any democratic plan for reducing trillions of dollars in federal budget deficits over the next decade, and republicans won't let them forget it. gop lawmakers think they have a terrific issue to take to the voters. obama's deficit plan begins tug-of-war with republicans\" tooltipid = \"mi_tt4\" > obama's deficit plan begins tug-of-war with republicans obama's deficit plan begins tug-of-war with republicans offering up his own $4 trillion roadmap to tame america's deficit and an admission that he doesn't expect congress to embrace it as-is, president barack obama on wednesday began a concerted effort to pull together a bipartisan deal this year. the president called on congress to agree to some variation of his plan by the end of june. budget watchdogs to obama, congress: be bolder \"tooltipid =\" mi_tt5 \"> budget watchdogs to obama, congress: be bolder"}, {"articleID": "2013020500_00076092_W", "names": {"Ian Gordon": ["Q15434992", "Q1655519", "Q27518361", "Q47468857", "Q5981674", "Q5981676"], "Richard Curtis": ["Q355300", "Q56512425", "Q7325009", "Q7325010"]}, "date": "2013-02-04", "url": "http://independent.co.uk/news/business/sharewatch/investment-view-libor-woes-for-banks-could-end-up-as-a-car-crash-8480831.html", "content": "investment view: libor woes for banks could end up as a car crash it's likely that royal bank of scotland will this week become the third bank to pay a substantial fine to settle charges that its traders tried to manipulate libor interest rates. more will follow. the problem for the banks and for their investors is that dealing with the regulators is only the start of it. libor is used to price all sorts of financial contracts, from interest rate swaps to some mortgages. anyone with a libor-related contract, or one linked to one or more of its sisters, could have grounds to seek compensation if they can prove they were disadvantaged by the traders' shenanigans. those people range from small borrowers, fighting on a no-win no-fee basis, to big hedge funds able to afford skilled and very expensive legal help. it's a potential car crash, and has even been described as the banks' \"tobacco moment\" . that's a reference to the string of lawsuits tobacco companies fought successfully, until the dam burst. what should investors do? i talked to all four banks, as well as analysts, and lawyers. let's start with the banks. none has yet made any provisions against the potential cost of libor-related lawsuits. this is the response i got from lloyds: \"we have not taken any provision as it's just not possible at the moment to predict the scope and outcome of the various regulatory investigations or private lawsuits that are out there. that's both in terms of timing or scale.\" rbs, barclays, and hsbc are taking a broadly similar stance. lloyds and hsbc may not be in it quite as deeply as rbs and barclays. how about the legal angle? rich eldridge, a finance partner at manches, was kind enough to help. here's what he had to say: \"to be successful borrowers will have to show the basis on which they were led to believe libor would be calculated was false and this was material. no one knows how likely the claims are to succeed, but judges will know successful claims could potentially bankrupt state-owned banks and hit pension funds.\" so when it comes to provisions: \"i doubt anyone knows the cost to the banks if the courts decide to award compensation for libor fixing. firstly, banks will need to repay customers who were overcharged. secondly, judges may cancel interest rate swap contracts based on libor and banks may be forced to compensate hedge funds who bought a bank's side of swap transactions. investors in bank shares will no doubt be wary with no published figure of the potential exposure. a concern for a lot of people is bank shares can form a sizeable proportion of investments by pension funds.\" in other words: this potential car crash could actually close off half the motorway. how does the market feel about this? <mark>ian gordon</mark> is one of the more independent minded and thoughtful analysts. he says almost no one has this issue \"front of mind\" . \"two reasons for that. one, the market has increasingly convinced itself that the burden of proof is very high. so other than the potential for a\" grand settlement \"the potential for an individual bank suffering a multi-billion hit feels much lower now than it did perhaps in early july.\" and, two, my guess is that any such settlement won't hit until 2016/17 which removes any spectre of an unmanageable hit to capital. just a potential hit to a (hopefully) more healthy income statement. \"so not the end of the world. who's likely to get hit? the received wisdom is barclays and rbs, as a result of the attempts at manipulation by their traders (worth pointing out that it's yet to be proved how successful they were). but mr <mark>gordon</mark> has an interesting theory:\" i can't help thinking that it was allegedly the [libor] submissions of lloyds [through hbos] and rbs which were persistently low-balled over an extended period and by a material amount. \"so his theory is the potential\" tail risks may be longest for lloyds and rbs? just a theory \". of course, the role of the bank of england in the\" low ball \"submissions of lloyds and rbs is somewhat murky. the central bank was desperately worried about the impact of a collapse in confidence in these two banks. but even if it was proved to have subtly endorsed the tactic you can't sue a central bank. if you want to grade the worries, rbs probably comes top followed by barclays and lloyds. hsbc shareholders may be able to breathe easier. its sins were largely committed elsewhere. as for valuations, they are still discounting difficulties for the banks. even though barclays shares have doubled since the summer it trades on only 0.6 times the book value of its businesses and a shade over 8.6 times earnings. as for lloyds, it is on 0.8 times book, 12.7 times earnings, while rbs is on a remarkably similar valuation (0.8 times, 13.3 times). hsbc, by contrast, sits on 1.3 times book, and 11.5 times this year's earnings. bound, beaten and robbed: backpackers attacked by whip-brandishing peruvian villagers in\" savage' two day ordeal missing irish tycoon found barefoot and starving with insult carved on forehead text messages between chris huhne and son reveal family split behind the speeding points scandal <mark>richard</mark> iii - the final act: archaeologists release image of skull that might be that of a king the bedroom tax is just the latest assault on our poorest citizens \"offensive (and not funny)' after years of insults, bbc finally censures jeremy clarkson stuck for a romantic idea? go for all-out luxury with a meal for two or something a little more high tech two hot new regimes have caught on since new year. can either make the pounds melt away? the last englishman to score the winner against brazil on what it takes to defeat them she said goodbye to her most famous role, but olivia poulet is busier than ever, at the national and writing the uk's answer to girls when callum hall stepped on a sea urchin he thought little of it. but his life was about to change for ever archaeologists release image of skull that might be that of a king angular, oversized and bright glasses make a bold statement this season british museum to live-stream pompeii show in cinemas andria vidler is the only woman in charge of a major label face facts: it's time to hydrate with one of these hard-working products <mark>richard curtis</mark>: twenty-five years of laughing in the face of tragedy the creator of comic relief hopes that in another quarter of a century it may not be necessary. until then, it's red noses all round he's the ideal husband for the millions of women who go to see his films, and to many of his leading ladies veteran campaigners will gather today to tell how the act of protest transformed their lives when queen beatrix revealed last week that she is to stand down, all eyes were on buckingham palace. but giving up is not the british way earl of cardigan:\" seeing police beat a pregnant woman does poison your view '"}, {"articleID": "2011032022_00077391_W", "names": {"George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"]}, "date": "2011-03-20", "url": "http://uk.mobile.reuters.com/article/topNews/idUKTRE72J4I520110320?feedType=RSS&feedName=topNews", "content": "government to axe inflation-linked flight tax rise - source london (reuters) - britain will scrap a planned inflation-linked increase on air passenger duty this year, a government source said sunday. the flight tax had been due to rise in line with retail price inflation in november. the decision not to implement the hike will cost the government coffers about 150 million pounds, saving a family of four about 16 pounds on a trip to south africa or 12 pounds on a journey to the united states. \"the government wants to give extra help to hard-pressed families,\" the source said. chancellor <mark>george osborne</mark> has little room for sweeteners in his budget wednesday, but the government is expected to exempt more workers from paying income tax, fund training for the young unemployed and help motorists cope with high petrol prices. <mark>osborne</mark> will stick to his austerity plans aimed at slaying the bulk of a record budget deficit--running at about 10 percent of national output--by the next election in 2015."}, {"articleID": "2018091110_00044095_W", "names": {"Laszlo Nemes": ["Q1216411", "Q1216413", "Q1216415", "Q6495014"], "Istvan Szabo": ["Q1253970", "Q1293571", "Q1293574", "Q1293579", "Q246617", "Q25465430", "Q30331879", "Q3803926", "Q58821223", "Q6089363"]}, "date": "2018-09-11", "url": "https://www.hollywoodreporter.com/news/oscars-hungary-selects-sunset-foreign-language-category-1142032", "content": "Oscars: Hungary Selects \"Sunset' for Foreign-Language Category 2:30 AM PDT 9/11/2018 by Nick Holdsworth FACEBOOK TWITTER EMAIL ME COMMENTS Courtesy of Venice International Film Festival\" Sunset' The sophomore film by <mark>Laszlo Nemes</mark>, who won an Oscar in 2016 for his debut \"Son of Saul', premiered last week at the Venice Film Festival. Hungary has selected Academy Award winning director <mark>Laszlo Nemes</mark>' sophomore feature Sunset as its submission in the best foreign-language film for the Oscars. In 2016 <mark>Nemes</mark> won an Oscar for his feature debut, Son of Saul - a stunning portrayal of a Jewish man's desperate attempt to give a dead boy he believes is his son a proper burial in the midst of the brutality of Nazi concentration camp. His new film, which premiered in competition at the Venice film festival last week, is set some 30 years before Son of Saul at another major historical juncture in the lives of Hungarians: the eve of the First World War.\" Sunset is about a civilisation at its crossroads, \"<mark>Nemes</mark> said in a statement issued Tuesday by the Hungarian National Film Fund.\" In the heart of Europe at the height of progress and technology, without being written in history, the personal story of a young woman becomes the reflection of the birth of the 20th century. \"Starring Juli Jakab as Irisz, a young woman who comes to live and work in Budapest in 1913 on a mission to find a brother she had never known of, the film dives into a world of violence and intrigue. With visual references to Stanley Kubrick's seminal 1957 anti-war film Paths of Glory and a nod to the masked sex party scene from his 1999 film Eyes Wide Shut, the film runs to nearly two and half hours in length. The Hollywood Reporter critic Deborah noted:\" The [film's] heavy symbolism and penchant for creating unresolved mysteries drives it far from the poignancy of Son of Saul. \"Produced by Laokoon Filmgroup, (Hungary) and Playtime (France) with the support of the Hungarian National Film Fund, Sunset was made on a budget of $10.4 million. Sony Pictures Classics has picked up the film for North America and Australia. World sales are being handled by Playtime. Hungary has a long history of submitting films to the Oscars, starting in 1965 with Zoltan Fabri's Twenty Hours. Nominated ten times (including last year for Ildiko Enyedi's On Body and Soul), it has won the coveted golden statuette twice - in 1981 for <mark>Istvan Szabo</mark>'s Mephist o and in 2016 for Son of Saul. FACEBOOK TWITTER EMAIL ME COMMENTS Nick Holdsworth THRnews @ thr.com @ thr Comments comments powered by Disqus"}, {"articleID": "2013122322_00094983_W", "names": {"Peter Jackson": ["Q25521960", "Q3376667", "Q39073400", "Q4160117", "Q4465", "Q52743056", "Q54556363", "Q7174914", "Q7174916", "Q7174918", "Q7174919", "Q7174920", "Q7174922", "Q7174923"]}, "date": "2013-12-23", "url": "http://hollywoodreporter.com/news/rds-renews-canadiens-regional-rights-667468", "content": "After Rogers' NHL deal, Bell Media keeps hockey on its French language cable sports channel as it now bids for Ottawa Senators rights. Bell Media's RDS cable sports channel has renewed a regional TV rights deal for Montreal Canadiens games for another 12 years. Terms of the deal were not disclosed. But the agreement is key for Bell Media as it has French language subscribers still viewing Canadiens games going forward after the broadcaster was recently outbid by rival Rogers Communications for the national NHL TV rights as part of a US $4.9 billion, 12-year deal. The latest RDS-Canadiens deal includes continuing naming rights to Montreal's Bell Center for Bell Canada, and covers broadcast rights for 60 regular season games, and additional pre-season games each season. Bell Media and Rogers are also bidding for separate regional TV rights to Ottawa Senators games as broadcasters look to airing live NHL games to discourage cable and satellite TV subscribers from cutting or shaving the cord in the digital age. Rogers' Sportsnet cable channel currently has the regional TV rights to Senators games, and so is expected to pay dearly to retain the games in the face of competition from a hockey-hungry Bell Media. \"Duck Dynasty': Petition to Reinstate Star Passes 100,000 Signatures The latest installment in <mark>Peter Jackson</mark>'s trilogy focuses on the dwarves of Erebor's attempt to reclaim the Lonely Mountain. Tom Hanks and Barkhad Abdi reveal secrets of filming their drama\" Captain Phillips. \"The film centers on a 2009 hijacking by Somali pirates.\" It's not very glamorous, but was old school show business. That's how it worked for me, \"Hanks says.\" The Grandmaster' Trailer 2 Wong Kar Wai's biopic of Bruce Lee's kung fu teacher, Ip Man. The martial arts action movie from The Weinstein Co. is set to be released on Aug. 23. George Clooney's \"The Monuments Men' Unveils New Campaign To Find Lost Art Justin Bieber's\" Backpack' Drops With Lil Wayne Off Of \"Journals '"}]