[{"articleID": "2009080500_00069142_W", "names": {"Kevin Williams": ["Q14951176", "Q1716970", "Q1740285", "Q27919947", "Q3195825", "Q50224863", "Q6397765", "Q6397766", "Q6397767", "Q965005"], "Pat Williams": ["Q1659586", "Q7144117"], "Adrian Peterson": ["Q1398352", "Q373983"], "Ray Edwards": ["Q16191583", "Q504307", "Q59197388", "Q7297437"], "Jared Allen": ["Q6159892", "Q82492"], "Fred Evans": ["Q16058462", "Q5495081", "Q5495086", "Q934488"], "Jimmy Kennedy": ["Q22095715", "Q6200541"]}, "date": "2009-08-05", "url": "http://tulsaworld.com/site/articlepath.aspx?articleid=20090804_92_0_Ifthew460881&rss_lnk=2", "content": "osu's hunter, ou's murray and brown on doak walker award watch list ossaa rules jenks athlete ineligible; football program could forfeit games if the waiting is the hardest part, <mark>kevin williams</mark> and <mark>pat williams</mark> haven't shown it. the minnesota vikings and their stalwart defensive tackles are still seeking resolution to their fight against the nfl's attempt to issue them a four-game suspension for use of the now-infamous weight-loss supplement starcaps. more than eight months after news of their positive tests first broke, the williamses find themselves in continued limbo. \"i just keep on praying on it. that's all i'm going to do. whatever happens happens,\" <mark>pat williams</mark> said after tuesday's training camp practice, teasing <mark>adrian peterson</mark> on his way off the field about all the kids screaming for the running back's autograph. \"hopefully it will be over soon, and we can move on,\" said former oklahoma state <mark>kevin williams</mark>. \"i'm not going to even worry about it .\" the state judge involved in the case has said he'll decide this week whether to put the players' lawsuit on hold at the league's request, while a federal appeals court considers other issues including input from other major sports. the nfl wants the suspensions, originally handed out last season, to start with minnesota's opener on sept. 13, but the league would rather the federal appeals be resolved first before further proceedings at the state level to avoid conflicting rulings. the players' attorney is pushing for a trial before the regular season begins on sept. 13; if that's not possible, they want it delayed again until the season is over. the williamses have acknowledged taking starcaps, which contained an unlisted but illegal ingredient called bumetanide that can mask the presence of steroids; they're not accused of taking steroids, however. their original lawsuit was dismissed in federal court, but their claims that the suspensions would violate minnesota employment laws were sent back to state court. the nfl didn't tell players that starcaps contained the banned substance, but it claims that players are responsible for what they take and that the collective bargaining agreement that is in place should dictate the punishment. whew. no wonder their focus is on football: this is almost too complicated to think about anyway. \"we don't worry about that,\" teammate <mark>ray edwards</mark> said. \"it's just no issue for us. we know who they are, and that's what matters the most. they come out here and play every day. that's the <mark>pat</mark> and <mark>kevin</mark> i've been seeing for the last three years .\" fellow defensive end <mark>jared allen</mark> refuses to dwell on the what-if possibility, either. \"we're professionals. you're not supposed to get distracted. things are going to happen. this is the nfl. people are going to get replaced year in and year out. it's just part of the job,\" <mark>allen</mark> said. for as much attention brett favre's will-he-or-won \"t-he saga received over the last three months as the still-retired quarterback mulled the opportunity to come to minnesota, the uncertainty of the williamses' status has dragged on much longer. it's an equally important issue, too, central to the success of this year's team .\" we would like for it to come to an end and put it behind us, \"defensive coordinator leslie frazier said .\" i know for their sake they would like to put it behind them and not miss any time. hopefully it will come to a resolution pretty soon here. hopefully we aren't going into september not knowing if these guys will be suspended. \"if so, letroy guion, <mark>fred evans</mark> and <mark>jimmy kennedy</mark> would be next in line to fill the spots. frazier said he's confident in their abilities .\" it will be a bit of a drop off, \"frazier said .\" it will be hard to replace <mark>pat</mark> and <mark>kevin</mark>, because those are hall of fame defensive tackles. we feel confident we will still be able to play good defense with those other guys in the game. \"vikings coach brad childress was asked if he's ever seen the williamses' performance suffer from the uncertainty. 0 comments have been made for this team so far. tell us what you think below!"}, {"articleID": "2014052501_00016036_W", "names": {"Robert Johnson": ["Q16215328", "Q18630840", "Q18672192", "Q21665589", "Q23795774", "Q25522930", "Q30678501", "Q47546079", "Q4932943", "Q57208493", "Q5889205", "Q7346149", "Q7346150", "Q7346152", "Q7346153"], "Bill Brown": ["Q16188871", "Q2667644", "Q27147689", "Q4908278", "Q4908280", "Q4908282", "Q4908284", "Q4908288", "Q4908289", "Q4908293", "Q861987"]}, "date": "2014-05-24", "url": "http://kionrightnow.com/news/Gunman-among-7-dead-in-Calif-rampage/26153616", "content": "Gunman among 7 dead in Calif. rampage Deputies believes shootings were \"premeditated mass murder' The gunman also died from a gunshot wound after his car crashed Friday night, police said. It was unclear if the fatal head wound was self-inflicted or the result of a firefight with police. Seven people also were being treated in a hospital for gunshot wounds or traumatic injuries, including at least one who was in surgery, said sheriff's office spokeswoman Kelly Hoover .\" The sheriff's office has obtained and is currently analyzing written and video evidence that suggests this was a premeditated mass murder, \"Hoover said. Hoover apparently was referring to a YouTube video titled\" Retribution \"posted by a young man. In the nearly seven-minute video, the young man rants about women who ignored or rejected him over the past eight years and warns that he will\" punish you all for it. \"\"Tomorrow is the day of retribution, the day in which I will have my revenge,\" the man says on the video. The shootings occurred in Isla Vista near the University of California, Santa Barbara, in a crowded area bustling with activity on Memorial Day weekend. \"I don't recall hearing any screaming,\" witness <mark>Robert Johnson</mark> told CNN, describing the moment the gunman opened fire on people outside a deli. \"It was at that point where I turned and ran in the opposite direction ....There's a lot of confusion. Even shortly after this whole ordeal had ended, I think a lot of people didn't realize the magnitude of the situation .\" The violence began and ended within minutes, from 9:27 p.m. when shots were reported to around 10 minutes later when police discovered the body of the suspected gunman, CNN affiliate KEYT-TV said. Authorities said there were nine separate crime scenes. \"Sheriff's deputies responded and found several victims suffering from gunshot wounds. As sheriff's deputies were attending to the victims and performing first aid, they were also receiving suspect information. Only minutes later, there were additional reports of shots fired in several other areas of Isla Vista,\" Hoover said. U.S. law enforcement officials said the Bureau of Alcohol, Tobacco, Firearms and Explosives and FBI were assisting local police in the investigation, including trying to trace the handgun used and where the possible suspect obtained it. <mark>Johnson</mark> told CNN he was standing on a corner when he heard what he thought were fireworks. Then a black BMW with tinted windows drove by and either slowed down or stopped outside a deli where as many as eight people were eating outside. Someone in the car opened fire. \"It all happened very quickly, but I think this happened to be the largest group on the street,\" he said. \"It think it was just targeted because it was the largest group in the area .\" People jumped up and ran, <mark>Johnson</mark> recalled. KEYT reporter John Palminteri told CNN that some witnesses reported hearing the gunman talk to some of his victims as he fired. Outside a 7-Eleven convenience store, he said, workers came out amid the gunfire to pull to safety a girl who had been shot in the leg. Another victim, a bicyclist, apparently sustained massive head injuries after being struck by the gunman's car. One woman told the station that a driver of a car flashed a gun at her and asked, \"Hey, what's up?\" before opening fire. She escaped unharmed. \"I heard some pops, but I just assumed they were fireworks,\" said Daniel Slovinsky, who was eating at a restaurant. \"Contrary to what you might expect, there wasn't a whole lot of chaos immediately. I didn't hear any screaming. A few people were running ....It wasn't really until police started yelling at people to get inside that we realized something big went down. But even then people didn't know what .\" KEYT reported that \"witnesses described seeing a black BMW speeding through the streets, spraying bullets at people and various targets .\" Six minutes after the first emergency call, the suspected gunman traded fire with sheriff's deputies, and the vehicle plowed into a parked vehicle, said Hoover, the sheriff's office spokeswoman. In a statement on its website Saturday, UC Santa Barbara said several students were taken to local hospitals after the shooting. \"Our hearts and prayers go out to the family and friends of those affected,\" the statement said. The suspected gunman was found dead from an apparent gunshot wound, she said. A semiautomatic handgun was recovered. It appears the suspect acted alone, Hoover said. Santa Barbara Sheriff <mark>Bill Brown</mark> called the suspect \"severely mentally disturbed,\" according to KEYT. Authorities searching for a motive were looking into a video posted on social media that contains a man's tirade against women who supposedly rebuffed him, <mark>Brown</mark> told the station. Hoover said the suspect has been preliminarily identified but his name won't be released until \"a positive identification is made .\" The views expressed are not those of this company or its affiliated companies. Please note by clicking on \"Post\" you acknowledge that you have read the Terms Of Service and the comment you are posting is in compliance with such terms. There are currently no severe weather alerts."}, {"articleID": "2015120822_00550063_W", "names": {"Lisa Jackson": ["Q16218554", "Q27469861", "Q445734", "Q476660", "Q6557964", "Q8927305"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2015-12-08", "url": "https://www.trunews.com/activists-try-to-silence-global-warming-skeptics-at-un-summit/", "content": "Activists Try To Silence Global Warming \"Skeptics' At UN Summit Home> Earth Changes> Activists Try To Silence Global Warming\" Skeptics' At UN Summit Activists Try To Silence Global Warming \"Skeptics' At UN Summit By Reuters on December 8, 2015 Pin It Environmentalists are trying to marginalize and intimidate skeptics attending the United Nations global warming summit in Paris. Competitive Enterprise Institute senior fellow Chris Horner was strolling the streets of Paris around the U.N. conference when he saw a wanted poster with his headshot on it. The poster, from the environmental group Avaaz, labels Horner a\" Climate Criminal \"who is a lobbyist for the\" carbon industry \"who's a\" climate skeptic. \"\"Having bragged about the honor on my first book's cover nearly nine years ago, I'd say it's getting a little long in the tooth,\" Horner tells The Daily Caller News Foundation. \"If memory serves they first broke out the wanted-poster motif at the Montreal COP; <mark>Lisa Jackson</mark> /' Richard Windsor' somewhat hysterically decried my FOIA efforts as\" criminal. \"'\" Left unmentioned is the FOIA work is mere flattery of Greenpeace's, following in its footsteps from the University of Virginia to the Smithsonian and elsewhere, \"Horner says. Horner's unfazed by the poster, but it's just another example of how environmental activists are trying to silence skeptics attending the U.N. summit--a summit being hailed as the\" last chance \"to save the planet from environmental catastrophe. Environmentalists recently called for the U.N. to eject all skeptics from the Paris talks. Activists were furious that the Heartland Institute, an American conservative group, showed a new documentary called\" Climate Hustle \"that debunks claims made by environmentalists sounding the alarm on global warming .\" One notorious oil industry-funded climate denier is debuting a documentary film full of lies and misinformation, \"the activist group SumOfUs says in a fundraising letter .\" Some of the \"world's most notorious climate deniers' had crashed the French proceedings\" in a last-minute & shy; attempt to derail the whole thing'. \"While it's not true that\" Climate Hustle \"is funded by the oil industry--it's funded by 1,500 citizen supporters--it shows just how far environmentalists are willing to go to trash global warming skeptics .\" We are even hearing that James Inhofe--the US senator who wrote a book calling global warming the \"greatest hoax ever perpetrated'--is on his way,\" SumOfUS says. Left-wing politicians and their environmentalist allies are desperate to get countries to agree to a successor to the Kyoto Protocol in Paris. Expectations are high for a global agreement to cut carbon dioxide emissions, but even if such a deal is struck it's unclear if it will be enforceable. The U.S. and Europe called for conflicting visions of what a U.N. climate deal will look like. Europeans want a legally binding treaty on CO2 emissions, but U.S. leaders have sent conflicting messages on what they want from a treaty. Secretary of State <mark>John Kerry</mark> says a U.N. treaty will not be legally binding so it won't have to go before a Republican-controlled Senate where it will certainly be voted down. <mark>Kerry</mark> did walk back his comments a bit, and President Barack Obama has called for a treaty to be legally binding. Read more: http: //dailycaller.com/2015/12/07/activists-make-wanted-posters-of-skeptics-paris-climate-summit/ #ixzz3tlpK1m3a global warming slider ticker UN About Reuters Thomson Reuters is the world's leading source of intelligent information for businesses and professionals and is affiliated with TruNews. We combine industry expertise with innovative technology to deliver critical information to leading decision makers in the financial and risk, legal, tax and accounting, intellectual property and science and media markets, powered by the world's most trusted news organization. Thomson Reuters shares are listed on the Toronto and New York Stock Exchanges (symbol: TRI)."}, {"articleID": "2012103005_00006460_W", "names": {"Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"]}, "date": "2012-10-30", "url": "http://music-news.com/ShowNews.asp?nItemID=58776", "content": "news <mark>robbie williams</mark>: i'd take mila kunis to a hotel printable version <mark>robbie williams</mark> says he would take mila kunis to \"the nearest hotel' if he was single and had the opportunity. the take that singer and his wife ayda field welcomed daughter theodora into the world on september 18. but when <mark>robbie</mark> was asked if he would be up for\" privately entertaining the star' by uk newspaper the sun he gave the idea some thought. \"i'm married and i respect and love my wife too much,' <mark>robbie</mark> proclaimed .\" but, that being said, if mila could meet me at the nearest hotel, the travelodge .' the crass singer seemed to be familiar with the budget establishment. \"it's only? 27.99 for the afternoon, mila, i'll see you there,' he said. <mark>robbie</mark> made no mention of the black swan star's boyfriend, ashton kutcher. earlier this month he insisted he's been focused on fatherhood, and spoiling his little girl. the star spoke about splashing out on shoes for theodora .\" [i'm going to buy her] the best trainer collection in the world, \"he said in an interview with style magazine."}, {"articleID": "2010032921_00159023_W", "names": {"Jim Gray": ["Q16185364", "Q6195313"]}, "date": "2010-03-29", "url": "http://boxingnews24.com/2010/03/abraham-shows-little-class-in-dirrell-bout/", "content": "by william mackay: up until saturday night, arthur abraham (31-1, 25 ko's) has always seemed like a nice guy with a gentile disposition. however, last saturday night, boxing fans got to see another side of abraham when he hit american andre dirrell (19-1, 13 kos) with a tremendous right hand while dirrell was down on the canvas after slipping. dirrell was badly hurt after getting hammered by abraham and needed to be taken to the hospital after the incident, which briefly had dirrell flat on his back, both eyes closed and legs going throw spasms. abraham was disqualified for the punch by referee lawrence cole. but instead of admitting wrong doing for punching dirrell while he was down on the canvas, an angry looking abraham said to showtime interviewer <mark>jim gray</mark>, \"he's [dirrell] a good actor .\" abraham seemed unwilling to admit what he did was wrong. it seemed shocking to see a fighter who could show no remorse after having clearly done an illegal act by hitting dirrell while he was down. later, abraham's promoter wilified sauerland said that dirrell \"deserved an oscar .\" what seems really alarming is that abraham couldn't admit wrong in what he did. never mind if he thinks that dirrell was acting, he still should have at least admitted what he did was wrong in hitting dirrell while he was helpless on the canvas. instead of blaming dirrell for what he saw as an acting job, abraham should have been gracious enough to say what he did was wrong. by not doing that and coming across an unremorseful while being interviewed after the fight, it made abraham look as if he didn't see what he did was wrong. dirrell was taken to a nearby hospital after the fight and had a brain scan conducted to see if there was any sign of a brain bleed. thankfully for dirrell, nothing serious was found during the tests. the question now is whether dirrell will feel the lingering effects from this knockout in his next super six fight against andre ward later on in 2010. ward isn't a huge puncher like abraham, but he does hit hard enough to potentially create problems for dirrell, especially if he's still feeling the effects from his knockout to abraham. abraham's promotional team sauerland plan on protesting the outcome and will be looking for an immediate rematch. the only thing they have is the believe that they think dirrell was acting when he was apparently knocked out. however, it's going to be tough to get anyone to side with their opinion because there's really no way of proving that dirrell was acting short of him coming out and making a confession. that won't happen and it appears that sauerland will be wasting their time with this appeal. march 29, 2010 at 3:17 pm aa is deservadly coming out of this badly. he wasnt really shining in any way during the fight, his low blow took a little to long to be passed of as in the heat of the moment and some of the things he said after the fight left alot to be desired, even if he believed what he was saying. however i do feel a little sorry for him, dirrell frustrated him all night, the ref frustrated him, he was out of his comfort zone fighting away from home and after the dq he was frustrated at what he deemed to be acting by dirrell so the words blurted out. and all the time he knew his 0 record was slipping away from him. not condoning what he did but i think hes getting torn into a little too hard, ive seen things like this happen many time without half the fuss. march 29, 2010 at 3:15 pm @ richard ive watched the slow mo about 100 times. you are special my friend. it was a glancing blow that crazed ad before we slipped, and as he was sitting down, aa took a shot at him, and entirely separate punch. - green thinks also that dirrell was acting - maske also thinks that dirrell was acting for me 2 things stick out: - aa hit ad before ad goes down (watch it in the slow motion) march 29, 2010 at 2:36 pm great article. however, \"little\" is an overstatement. there was such a lack of class in that move, he doesn't even deserve the word. roach thinks mayweather-pacquiao will happen - but doesn't say anything about random blood tests roach thinks mayweather-pacquiao will happen - but doesn't say anything about random blood tests"}, {"articleID": "2013060213_00021099_W", "names": {"Matthew Stewart": ["Q43911030", "Q6791273"], "David Stewart": ["Q1176741", "Q43393739", "Q43912947", "Q5240083", "Q5240087", "Q5240088", "Q5240089", "Q723284"]}, "date": "2013-06-02", "url": "http://www.standard.net/stories/2013/06/01/local-police-gear-never-say-door-kicks-few-far-between", "content": "OGDEN - The suspect is dead and the prosecution may be closed, but the <mark>Matthew</mark> <mark>David Stewart</mark> case will stay with us, flying in two directions. <mark>Stewart</mark> was facing the death penalty for a Jan. 4, 2012, shootout with police that left him and six officers wounded, one fatally. On May 24, <mark>Stewart</mark> was found dead of an apparent suicide in his jail cell. The state Department of Public Safety is investigating. Formal charges against <mark>Stewart</mark> are scheduled to be dismissed Tuesday in 2nd District Court. <mark>Stewart</mark> faced execution in the killing of officer Jared Francom, whose name is now on the Ogden Public Safety Building. On the one hand, the many websites and pages put up by <mark>Stewart</mark>'s family and supporters talk about getting money together for a memorial. They see him as the victim of the heavy-handed, jack-booted power of the state, even calling him a political prisoner in the war on drugs. On the other hand, police here are armoring up like never before. The gun battle at <mark>Stewart</mark>'s home a year and a half ago erupted as the Weber-Morgan Narcotics Strike Force broke down <mark>Stewart</mark>'s door, serving a \"knock and announce\" search warrant for his pot plants. Last August, four Weber police agencies formed the Tactical Operations Group, or TOG, essentially in response to the lessons of the <mark>Stewart</mark> raid. \"TOG was in the planning stages before <mark>Stewart</mark>,\" Sheriff Terry Thompson said, \"but that incident added to the urgency of getting it up and running .\" His agency, along with the police departments of Ogden, Roy and North Ogden, supply officers to the 40-member TOG, officers with extra training and gear in forcibly serving search warrants. \"<mark>Stewart</mark> is the new standard,\" said Lt. Troy Burnett, who administers the TOG. Meaning, he said, TOG squads will serve all warrants with full body armor and helmets as strict policy, regardless of whether the warrant is judged low or medium risk or is for a minor or major offense. The <mark>Stewart</mark> warrant was considered low risk, officers nonetheless entering the home with guns drawn but wearing Kevlar vests, no helmets. \"It's about what the next <mark>Stewart</mark> decides to do,\" Thompson said. \"This wasn't about marijuana. It was a violation of the law. They want to make it about marijuana, but we served a legal search warrant and got the shit shot out of us .\" The TOG is available to any police agency. Those forces are typically expected to adopt the TOG full-armor policy when supporting a TOG unit. Thompson said his agency is considering adopting that Tactical Operations Group policy as its own. <mark>Stewart</mark> supporters rallying online include marijuana decriminalization groups, as well as Second Amendment fans, but for the family, the issue isn't marijuana. It's not pot Erna <mark>Stewart</mark>, a sister-in-law who has emerged as the family spokesperson, says it's the proliferation of what they call \"home invasion raids .\" She said blame is easily assigned, \"but everyone had their faults that night,\" referring to Jan. 4, 2012. \"I just want people to admit that so we can heal. Our community has been ripped in two, and that's very hard. My faith in the system has been ruined. I don't like that either...\"I would like to have some peace officers come sit down and talk to me so I can have some hope .\" She said her brother-in-law's death in the jail still leaves her in tears every day. They buried <mark>Stewart</mark> in a private ceremony Tuesday, unannounced even to the web groups. The \"Supporters of <mark>Matthew Stewart</mark>\" Facebook page, for one example, counted 885 members as of Friday. Erna <mark>Stewart</mark> said the online pages will continue to raise awareness of the dangers of increasing numbers of the search warrant \"door kicks\" and other aggressive tactics. Concerns nationally The American Civil Liberties Union in April announced a nationwide study on the \"militarization\" of police. Law enforcement scholars point to a near doubling of \"SWAT-style\" raids nationally to near 80,000 a year since 2001 with the proliferation of armament grants to local police from the Department of Homeland Security. \"We're not going away,\" Erna <mark>Stewart</mark> said. \"There's no way I can stop now. People need to know what we know .\" As to the monument, honestly, we're so exhausted right now. We're still grieving. But we could do it, find a place, on private property. It would be amazing. \"The first mention of a possible <mark>Matthew Stewart</mark> memorial was made the day after <mark>Stewart</mark>'s death. A day later, seven people had pledged money for a memorial\" to mark this gross violation of human rights. \"They included Salt Lake lawyer Andrew McCullough, former Libertarian Party candidate for Utah attorney general. Todd Blair video Some on the <mark>Stewart</mark> sites enjoy savaging Burnett, the Tactical Operations Group administrator. Burnett is memorialized on YouTube in the September 2010\" no-knock \"raid by the strike force at the home of Todd Blair in Roy. In helmet-cam video later released to the media, Blair is seen being fatally shot three times as Burnett enters the front room some five seconds into the raid. Blair had a golf club raised over his head; Burnett said he thought Blair was brandishing a sword. Web comments attached to news stories over the years on the <mark>Stewart</mark> case inevitably included a link to the shooting on YouTube. Burnett's TOG has been called a death squad. Erna <mark>Stewart</mark> calmly said the TOG is a step in the wrong direction .\" We want to avoid being a negative site altogether if we are really going to make a positive change happen. \"She said she would like to hear from police opposed to strong-arm enforcement of the law. Bernie Allen, one of <mark>Stewart</mark>'s defense lawyers, said they're out there but are a minority .\" I get emails all the time from law enforcement officers who are very concerned about it, since this case and Blair's, \"Allen said .\" It's a handful, but there is concern, and prosecutors outside Weber County have expressed concerns. I hope that means something. \"The whole war on drugs is a horrendous way to look at this...why crash his house?\" he said of the <mark>Stewart</mark> case. \"Was he going to flush his 4-foot pot plants down the toilet?\" ' A minority view' A veteran former prosecutor is also concerned. \"I'm not taking sides on the <mark>Stewart</mark> case,\" said Camille Neider, former deputy Weber County attorney, now a defense attorney. \"I see good arguments and reasoning on both sides. But you have to ask, was that type of force necessary, legal or not, for someone growing pot in their basement?\" You have to balance on a scale. Like a child abduction, or a kidnapping, obviously you have to move quickly. But I don't think we need the TOG, another squad to kick in doors. \"But Thompson and other officials said they are not aware of any agencies that are considering cutting back, as a matter of policy or practice, on\" dynamic entries, \"as the door kicks are sometimes called. That includes the Ogden Police Department, said Lt. Chad Ledford. After the strike force's roughly 100-plus search warrants served a year, Ogden's force is typically next in volume with well under 100. TOG, Ledford said, fills a need for the warrant servicing that doesn't reach the danger level of needing a full SWAT callout .\" There's always the philosophical argument of \"Is it worth it?' But the Legislature makes the laws, and we have to enforce them .\" Ledford added that people are imagining \"we're booting doors in every day. That's not happening .\" \"A good portion of people answer the door. Only a small percentage require a breach .\" As to officers individually or personally rethinking door kicks for minor offenses such as pot plants, Ledford said, \"It's not the topic of conversation every day. But there are those who are wondering about it, if you look hard enough .\" Weber County Attorney Dee Smith, an ardent defender of the breaches as necessity, is not wondering. He even trained with the TOG, brandishing a firearm with \"sim rounds,\" plastic simulated bullets, and shouting \"Police - search warrant\" during door-kick drills. \"I wanted to understand the process they go through, what they face,\" Smith said. TOG squads are available for all agencies, all types of investigators, for serving warrants, \"even property crime detectives .\" He discounted the <mark>Stewart</mark> supporters: \"I don't see that as any kind of movement, just people with an agenda who are grabbing ahold of the <mark>Stewart</mark> case. But it's a minority view .\" Thompson concluded he's confident if there were problems or abuses with forceful serving of search warrants, the judiciary would remedy them. \"I know good people who are concerned about the breaches, and I still love 'em, they're still my friends .\" "}, {"articleID": "2015122800_00290815_W", "names": {"James Bond": ["Q18377890", "Q24247087", "Q56707370", "Q6129965"], "James Blake": ["Q350362", "Q53333"]}, "date": "2015-12-27", "url": "http://www.mtv.com/news/2718017/artists-left-us-hanging-2015/", "content": "by Madeline Roth 59m ago Every year, music lovers dive into a barrage of year-end lists recapping the songs we couldn't stop singing, the artists who demanded our attention and the albums that merited heavy rotation. 2015 surely gave us so much to be excited about, but (sorry to be a Debbie Downer), it also left us in a funk over what could've been. Because for every Dr. Dre and Justin Bieber who graced us with long-awaited new releases, there was a Rihanna and Frank Ocean who left us hanging. Assuming none of these 10 artists pull a Beyoncé and go for a buzzer-beater album drop before the calendar flips this week, consider them the year's biggest teasers and heartbreakers. Hopefully it'll all be worth the wait in 2016. And if not, well, at least Adele came through with an album for us to sob to. Rihanna Getty Images Remember on Jan. 24, when Rihanna released \"FourFiveSeconds,\" the twang-tinged supposed \"first single\" for her next album? LOLOLOLOL, what fools we were to think she'd be so predictable with LP No. 8. She followed up with a pair of new tracks (\"Bitch Better Have My Money\" in March and \"American Oxygen\" in April), an album title and cover art announcement, AND a lineup of world tour dates--basically, everything except the actual album. So while the wait for ANTI ticks on, we're left trying in vein to decipher clues from that hella mysterious Samsung campaign. But at least we can do so in some dope socks and Pumas. Kanye West Getty Images The-album-that-may-or-may-not-be-called - Swish is Kanye's seventh full-length LP and the one that's most ruffling fans' feathers. Yo \"Ye, how ya gonna tease us with the rowdy\" All Day, \"the Paul McCartney-assisted lullaby\" Only One, \"and that Sia and Vic Mensa collab\" Wolves, \"and then leave us empty-handed for this week's calendar flip?! DO IT FOR THE KIDS, BRO. On the one hand, Kanye's had a busy year, between his new dad duties, presidential announcements and fashion empire-building. On the other hand, we're just selfish and we want this album more than sneakerheads want custom Yeezy Boosts. Luckily,\" Ye seems to be in full-on creative mode now--he took to Twitter earlier this month to effectively tell the world to leave him alone until the album's finished. Thank Yeezus for that .?? Macklemore Getty Images Jan. 1, 2015: The date was ripe with declarations of self-improvement and promises for the year ahead. So on that New Years Day, Ben Haggerty, a.k.a. Macklemore, optimistically tweeted a response to a fan who asked when he can hear the follow-up to 2012's The Heist. \"You will this year. Believe that,\" the MC wrote, delivering six little words and one big lie. OK, OK, so it's not like Haggerty and partner-in-rhyme Ryan Lewis have been twiddling their thumbs all year. In August, they debuted \"Growing Up (Sloane's Song),\" a sunny, Ed Sheeran-assisted tune dedicated to Macklemore's baby daughter. Then the duo livened up the VMAS later that month with their performance of \"Downtown,\" the most soulful foot-stomper since \"Uptown Funk .\" Clearly, 2016's shaping up to be a huge year for hip-hop, and Macklemore will hopefully contribute their own LP to the lot. Radiohead Getty Images Radiohead's really been dragging their canvas-sneakered feet on their ninth album, the follow-up to 2011's The King of Limbs. Producer Nigel Goodrich stirred up hopefulness in December 2014 when he tweeted a pic of singer Thom Yorke and guitarist Jonny Greenwood in the studio. And a new Radiohead LP appeared on many of the \"most anticipated albums of 2015\" lists at the top of the year. But we have yet to hear a projected release date, though Greenwood said in October that \"lots has been recorded .\" Even though we're now stuck in the longest-ever stretch of time between Radiohead records, the band did gift fans a surprise stocking stuffer earlier this week by releasing \"Spectre,\" their unused theme song for the latest <mark>James Bond</mark> film. And 007's reject is a Radiohead fan's ear candy. Gwen Stefani Getty Images Way back in October 2014, Gwen Stefani said during a Twitter Q & A that her third studio album would be arriving in December. But that December came and went. And now this December's basically come and gone. So what gives? Turns out, the delay may actually prove to be a great thing. In August, Stefani and Gavin Rossdale, her husband of 13 years, announced their divorce. And as painful as breakups are, they can also do amazing things for an artist's creativity. Indeed, Stefani told Entertainment Weekly in October that she'd scrapped an entire album's worth of material and was instead using her shattered relationship as inspiration for her new music. She released a new track, \"Used To Love You,\" shortly after, giving us a good idea of what may be in store for her first solo album in a decade, which will likely (hopefully) release next year. Frank Ocean Getty Images Do you ever just wake up in a cold sweat and wonder if Frank Ocean was ever real or just a figment of your imagination? Same. In 2012, he came to us in a hazy dream, dropped channel ORANGE, and then practically disappeared until one fateful day in April 2015, when he announced he'd release a new album in July. A rep for Ocean confirmed to Billboard that a joint album/magazine project were due for July, and the wait was on...and it still is. His last-minute cancellation at FYF Fest in Los Angeles over the summer didn't ease fans' frustration, and we've gotten exactly zero progress reports since then. I mean...he said July, but he didn't say what year...<mark>James Blake</mark> Getty Images There's been an unsettling shadow surrounding the English producer and singer-songwriter's next album--which is only fitting for a project reportedly titled Radio Silence. After revealing in June 2014 that his next album was halfway done, <mark>Blake</mark>'s next progress report came that November, when he said it would arrive in \"about five months .\" Which would mean April 2015. Which was eight whole months ago. Still, the follow-up to 2013's Overgrown is rumored to feature collaborations from Kanye West and Bon Iver's Justin Vernon, so it's bound to be worth the wait. (Repeat that as many times as necessary .) Young Thug Getty Images Young Thug's one of the most exciting new MCs today, but DAMN, it's been a long wait for HiTunes (stylized as Hy! & pound; UN35). Originally slated for release on Aug. 28, Thugger's debut LP was pushed back to Sept. 24, then pushed back AGAIN after he postponed several dates on his headlining tour. Nevertheless, Thug managed to have an impressive year by releasing not one, not two, but three mixtapes: Barter 6, Slime Season and Slime Season 2, all of which are only heightening the hype for HiTunes. Get on it, 300 Entertainment. HAIM Getty Images There aren't enough Este bassface GIFs in the world to cheer up HAIM fans who were hoping for a new album this year. In June 2014, the sister trio told BBC 6 Music that their Days Are Gone follow-up is \"coming very soon .\" Eighteen months later, though, we haven't heard so much as a new single, though HAIM told Zane Lowe in October that they're working on the LP \"every day .\" Plus, they scored their own Beats 1 show this year, so technically you can hear them on the radio. Grasp those straws. Grasp them tight. Drake Getty Images To say that Drake left us hanging in 2015 is both justifiable and laughable at the same time. Between his stellar mixtapes, his brutal, Grammy-nominated beatdown of Meek Mill and his ability to single-handedly make a turtleneck look cool again, the dude essentially had this year in a chokehold. AND YET, Views From the 6--the album he's been teasing for more than a year--is nowhere in sight. Rumors about a Sept. 24 release date proved fallacious, but the current theory is that it'll drop in January (that's taken from a casual line in his \"30 for 30\" freestyle: \"But just know it will be January in no time\" ). Whatever the case may be, his February mixtape If You're Reading This It's Too Late arrived without warning or promotion and managed to break records and spawn his biggest hit to date--so it's exciting to imagine the possibilities behind a proper album release. The 6ix Gawd is watching, and we're watching too. Madeline Roth @ madfitzroth"}, {"articleID": "2010101704_00128045_W", "names": {"Allen West": ["Q2095615", "Q3277451"]}, "date": "2010-10-17", "url": "http://talkingpointsmemo.com/archives/2010/10/loving_this_response.php", "content": "noted the nbc news report that south florida tea party fav (fl-22) <mark>allen west</mark> has been chumming up to \"the outlaws\" , a motorcycle gang tied to murder, arson, drug running and various other pastimes. responds that the whole thing is a nonstarter because if lisa myers had done \"her research, she'd know that the outlaws do not accept blacks, jews or gays .\" watch as christine o'donnell frustrates stars of the 90s (video) outside groups have a leg up on rnc in \"ballot security' efforts watch as christine o'donnell frustrates stars of the 90s (video) florida tea party favorite spoke to, defended criminal biker gang (video) lawyers group with close ties to rnc features parade of vote fraud fearmongers"}, {"articleID": "2020031215_00037863_W", "names": {"Rita Wilson": ["Q234144", "Q58147291"], "Tom Parker": ["Q12059142", "Q16734160", "Q25564284", "Q2949822", "Q7817157", "Q7817158", "Q7817159"]}, "date": "2020-03-12", "url": "https://lethbridgeherald.com/entertainment/entertainment-news/2020/03/12/tom-hanks-rita-wilson-in-australian-hospital-with-new-virus/", "content": "Tom Hanks, <mark>Rita Wilson</mark> in Australian hospital with new virus Poll Will you be changing your vacation or other travel plans because of coronavirus concerns? Yes Follow @ Leth_Herald on twitter By Moussa Moussa, The Associated Press on March 12, 2020. FILE - In this Feb. 9, 2020 file photo, Tom Hanks, left, and <mark>Rita Wilson</mark> arrive at the Oscars at the Dolby Theatre in Los Angeles. The couple have tested positive for the coronavirus, the actor said in a statement Wednesday, March 11. The 63-year-old actor said they will be \"tested, observed and isolated for as long as public health and safety requires .\" (Photo by Jordan Strauss/Invision/AP, File) SYDNEY, Australia--Tom Hanks and his wife <mark>Rita Wilson</mark> are isolated in stable condition in an Australian hospital Thursday after contracting the new coronavirus, the actor and Australian officials said. The two-time Oscar winner is easily the most famous person yet to disclose they have COVID-19, which the World Health Organization has declared a pandemic. Hanks said he and <mark>Wilson</mark> had felt tired, with colds, aches and slight fevers. \"To play things right, as is needed in the world right now, we were tested for the coronavirus and were found to be positive,\" he said, adding they'll be \"isolated for as long as public health and safety requires .\" \u009d Australian officials said the couple were being treated at a Queensland hospital. \"We wish them a very speedy recovery,\" state Premier Annastacia Palaszczuk told reporters. Hanks had been in Australia shooting an untitled Elvis Presley biopic directed by Baz Luhrmann. Hanks plays Presley's manager, Colonel <mark>Tom Parker</mark>. The film, slated for release in October 2021, has suspended production, Warner Bros. said. Hanks, after accepting the Cecil B. DeMille Award at the Golden Globes this year, spoke backstage about taking on the <mark>Parker</mark> role. \"I will then finally have an answer to all these stupid questions about why I never played a bad guy,\" \u009d he said as the room burst into laughter. Hanks and <mark>Wilson</mark>, both 63, were married in 1988. In 2013, Hanks disclosed he has Type 2 diabetes. Chet Hanks later posted on social media that his parents were doing fine and thanked fans for their concern. <mark>Wilson</mark> had performed at the Sydney Opera House on Saturday night and earlier last week in Brisbane. Queensland health authorities would not give specifics on their health due to privacy issues. But the state's update on its coronavirus infections describe a U.S. couple of their age both in stable condition. Palaszczuk said people who had been in close contact with Hanks and <mark>Wilson</mark> will have to self-quarantine but she cautioned that people who had taken selfies with Hanks recently should not panic about contracting the virus. She said she had spoken to Luhrmann and conveyed his reassurances that he would comply with the government's health restrictions. Australia has confirmed more than 120 cases of infection with the new coronavirus, with three deaths from COVID-19. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. The vast majority of people recover from the new virus. People with mild illness recover in about two weeks, while those with more severe illness may take three to six weeks to recover, WHO says. ___ AP Film Writer Jake Coyle in New York contributed to this report. ___ The Associated Press receives support for health and science coverage from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content. Share this story:"}, {"articleID": "2011111410_00098465_W", "names": {"Louis Walsh": ["Q16228796", "Q658547"]}, "date": "2011-11-14", "url": "http://westsussextoday.co.uk/news/national/kitty_goes_gaga_after_x_factor_flop_1_3245219", "content": "published on mon nov 14 10:28:29 gmt 2011 kitty brucknell has become the latest hopeful to be kicked off the x factor - but was comforted by one of her inspirations, lady gaga. her exit followed more chaos on the show at the weekend when saturday's live programme was delayed by 16 minutes due to a power failure. and a website blunder gave rise to claims that the return of previously axed contestant amelia lily was a fix. brucknell was put into the sing-off against misha b, but three of the four judges decided on sunday night she should go. she was given an emotional embrace by gaga - a guest on the show, performing her song marry the night with a bizarre routine in which she appeared to have been beheaded - and the chart star announced she was taking the disappointed wannabe for a drink. brucknell sang over the rainbow, while misha tried to win the judges over with jessie j's who you are. <mark>louis walsh</mark> opted for his act brucknell, while fellow tulisa contostavlos, kelly rowland and gary barlow opted for misha. after a week of high drama which saw frankie cocozza kicked out of the contest for his drug boasts, the show had further woes on saturday when it went off air because of a technical fault. millions of viewers tuned in expecting to see the sixth live studio round but found a selection of highlights instead. bt later said there had been an \"unusual power spike\" which disrupted services transmitted by bt tower. it is still looking into the cause. there was further upset for fans when it was claimed the vote was a fix, after a tv channel's website appeared to declare lily, 17, the winner - before voting had even closed. the channel, stv, put the blunder down to a \"technical hitch\" , and said pre-written pieces about all four contestants had gone live on the website. the company said in a statement: \"the stv web team prepared stories regarding each contestant in anticipation of the result and due to a technical hitch, all four stories went live on our website. we would stress that this was purely a technical hitch and for this we apologise .\" temperature: 8 c to 13 c wind speed: 15 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 7 c to 12 c wind speed: 16 mph temperature: 10 c to 13 c wind speed: 15 mph temperature: 12 c to 14 c wind speed: 17 mph temperature: 10 c to 14 c wind speed: 16 mph"}]