[{"articleID": "2018090402_00128299_W", "names": {"Jody Williams": ["Q211239", "Q27949760", "Q3179955", "Q36337023", "Q6208173", "Q6208175"]}, "date": "2018-09-03", "url": "http://kstp.com/politics/group-us-russia-block-consensus-at-killer-robots-meeting-/5056597/?cat=12510", "content": "Group: US, Russia Block Consensus at \"Killer Robots' Meeting Photo: AP Photo/Jamey Keaten, file In this Monday, Aug. 27, 2018 file photo, Peter Asaro, left, of the International Committee for Robot Arms Control, and <mark>Jody Williams</mark> of the Nobel Women's Initiative speak to reporters at a news conference in Geneva, Switzerland. September 03, 2018 09:22 PM A key opponent of high-tech, automated weapons known as\" killer robots \"is blaming countries like the U.S. and Russia for blocking consensus at a U.N.-backed conference, where most countries wanted to ensure that humans stay at the controls of lethal machines. Advertisement Coordinator Mary Wareham of the Campaign to Stop Killer Robots spoke Monday after experts from dozens of countries agreed before dawn Saturday at the U.N. in Geneva on 10\" possible guiding principles \"about such\" Lethal Automated Weapons Systems. \"Point 2 said:\" Human responsibility for decisions on the use of weapons systems must be retained since accountability cannot be transferred to machines. \"Related Stories Tesla CEO Elon Musk Tells Newspaper He is Cracking Under Stress Wareham said such language wasn't binding, adding that\" it's time to start laying down some rules now. \"U.N. Secretary-General Antonio Guterres welcomed the principles and expressed hopes the countries who signed on\" can build upon this achievement, \"according to a statement from his spokesman. Wareham said delegates had just\" kicked the can down the road \"until the next meeting on LAWS in November. The\" usual suspects \"including the United States, Russia, Israel and South Korea--joined unexpectedly by Australia, she said--were behind an effort to keep the text from being more binding .\" The fact is that it's the majority that wants it, but you know, it's the Convention on Conventional Weapons--and this is where it's about consensus and...a small minority of states--or even a single one can hold back the desires of the majority, \"Wareham said. Amandeep Gill, an Indian diplomat who chaired last week's meeting of experts, expressed satisfaction about the outcome, while cautioning that such systems should not be\" anthropomorphized, \"or attributed with human qualities. He insisted that they were not like\" Iron Man and Terminator. \"Credits Created: September 03, 2018 09:22 PM (Copyright 2018 by The Associated Press. All Rights Reserved .) Advertisement"}, {"articleID": "2019062221_00061928_W", "names": {"Paul Davies": ["Q16669255", "Q21131684", "Q535733", "Q7150145", "Q7150146", "Q7150147", "Q7150148", "Q7150149", "Q7150150", "Q976254"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-22", "url": "http://www.gamereactor.eu/destiny/?sid=092f643ece4a1fafb8c2a6c6113af65d", "content": "DESTINY REVIEW. Written by <mark>Paul Davies</mark> on the 26th of September 2016 at 10 \"It feels like the end of the road for Destiny before the true sequel. Having said that, it remains a road well worth travelling .\" 0 REVIEW. Written by <mark>Mike Holmes</mark> on the 21st of September 2015 at 14 \"It builds on the base game and improves it in almost every way, and while it might be pricey, it's an essential expansion for fans .\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of August 2017 at 15:09 DeeJ cleared the whole thing up for us. 0 NEWS. Written by Ford James on the 23rd of June 2017 at 17:08 But not if you plan to play on PC. 2 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2017 at 12:34 \"Our sole focus at this time is Destiny 2 .\" 1 NEWS. Written by <mark>Sam Bishop</mark> on the 29th of March 2017 at 13:28 Reddit users spotted it."}, {"articleID": "2014011406_00023134_W", "names": {"Henry Green": ["Q3784935", "Q54556249"]}, "date": "2014-01-13", "url": "http://www.miamiherald.com/2014/01/13/3868861/no-idle-hands-among-miami-springs.html", "content": "When I was growing up, my mom was never short on chores for me to do when I was out of school. And when I'd protest at the seemingly never ending list of things to do - clean the house, mop and wax the floors, wash and iron the clothes - she would tell me, \"Idle hands are the Devil's workshop .\" In my young mind, I couldn't understand how my hands had anything to do with the Devil's workshop. I didn't even know him. Anyway, my mom could never sell that story to the ladies at Grace Lutheran Church and their friends from other churches in the area. They wouldn't buy it. That's because they never have \"idle hands .\" They keep busy sewing quilts that are used to bless people throughout the United States and even in other countries. On Jan. 26 at 10 a.m., the quilts, made by loving hands and put together from donated materials, will be dedicated during the service. In the past, quilts from Grace have been given to people and families in areas of disaster and trouble. For example, the quilts have blessed in places like Haiti and Peru and send a message of love and support to all who receive them. The blessing of the quilts is also a way of saying thanks to the dedicated women who made them. Grace Lutheran is at 254 Curtiss Parkway in Miami Springs. Organ recital Joanne Schulte is considered one of the finest organists in the world. So, when she tells you that someone is \"perhaps the finest young organist in America today,\" well, you believe her. Schulte is referring to Nathan Laube, who will appear in a recital at 4 p.m. Sunday in Florida International University's Herbert and Nicole Wertheim Performing Arts Center-Concert Hall at 10910 SW 17th St. Laube will perform on the Wertheim concert hall organ, which is according to Schulte, is the only concert hall organ in South Florida. The event is presented by the Miami Chapter of the American Guild of Organists, of which Schulte is sub dean. She also is director of organ studies at FIU. The recital is free and open to the community. A reception will follow the recital. Jewish history A program on the \"Forgotten Jews from Arab Lands\" will be at 2 p.m. Jan. 26 at the Jewish Museum of Florida-FIU, 3012 Washington St. in Miami Beach. According to a press release, little is still known about the nearly one million Jews of North African, Middle Eastern and Iranian decent, also known as Sephardic Jews, who were expelled or forced to flee their homes in the 1940s. <mark>Henry Green</mark>, a University of Miami religion studies professor, is spearheading a project to draw attention to Sephardic Jews, who became refugees after they were uprooted from their communities, lost their citizenship and within a half century, had all but disappeared from their ancestral homes. <mark>Green</mark> calls his audiovisual history project, which he started in 2009, \"Sephardi Voices .\" To date, some 250 testimonies have been collected by research teams in Miami, New York, Los Angeles, London, Paris and Jerusalem. His goal is to collect 5,000 testimonies over the next five years. However, he must work fast, as his subjects are elderly and their memories are fading, while others are passing on each day, he said in a press release. \"This project offers the last chance to save and document this irretrievable period of Jewish history that stretches back to the prophet Jeremiah, the writings of the Talmud and Maimonides,\" he said. The program is free and open to the public. For more information, call the museum at 786-972-3175 or email: info @ jewishmuseum.com. Free lectures Temple Judea at 550 Granada Blvd. in Coral Gables will present Rabbi Lawrence A. Hoffman, Ph.D. in two free lectures. Hoffman, who served for more than three decades as professor of liturgy at Hebrew Union College-Jewish Institute of Religion in New York, will lecture at the Barocas Lecture on \"Judaism for the Next Generation\" at 10 a.m. Jan. 26. The lecture will explore Judaism's response to the frantic search for human meaning against the backdrop of science, art, the challenge to tradition and the \"re-religionization\" of America. At 7 p.m. Jan. 27, Hoffman will speak at the Eric B. Meyers Lecture on \"What's So Critical About Ritual?\" In his lecture Hoffman will explore what Jews get from engaging in ritual and how ritual can lead to a theology. He will also address how Jews respond to traditional critique of ritual from the great thinkers of psychology, sociology and economic theory. Both free lectures are open to the entire community. To RSVP, call or email Janice Garcia at: j.garcia @ judeagables.org or call her at 305-667-5657, ext. 110. Cantorial concert A cantorial concert featuring 14 cantors who represent the Southeast Region of the Cantors Assembly of America, will be at 3 p.m. Jan. 26, at the Sunrise Jewish Center, 4099 N. Pine Island Rd.. In addition to cantorial music, cantors from throughout South Florida will sing selections from Broadway shows, pop songs, and opera. Tickets are patrons $25; sponsors $18, and general admission $10 For more information, call Steven or Florence at 954-741-0295."}, {"articleID": "2011111621_00056673_W", "names": {"Bobby Ferguson": ["Q289930", "Q4934994"], "Bradley Cooper": ["Q205707", "Q4954898"]}, "date": "2011-11-16", "url": "http://freep.com/article/20111116/SPORTS02/111116047/1048/sports", "content": "new indictment alleges kilpatrick pocketed $10,000 kickback in restroom <mark>bobby ferguson</mark>, a close friend of former detroit mayor kwame kilpatrick, was charged today with...federal grand jury probes 5 years of wayne county dealings, subpoenas show the subpoenas, obtained by the free press, show for the first time that a grand jury has already...bing expected to privatize detroit bus management, lighting system with video: detroit mayor dave bing is expected to announce today an effort to privatize management...christian prayer rally the call draws 27k to ford field; protestors claim hate was preached the detroit lions announced today they've sold out sunday's game against the carolina panthers,...kirk gibson wins nl manager of the year; leyland finishes second in al tigers manager jim leyland finished second in the al voting, losing out to joe maddon of the tampa...mike camerella of novi won the top prize ($200) for heaviest buck with a 6-pointer topping the...chrysler to invest $1.7 billion to build next-generation jeep suv at toledo assembly plant chrysler and fiat ceo sergio marchionne said today that chrysler plans to invest $1. the new escape compact crossover is ford's latest vehicle to shed a boxy fa? ade for more finessed...financial football kicked off tuesday in michigan classrooms with an assist from detroit lions...new york--cbs has ranked no. - 1:38 am handsome hollywood \"hangover\" star <mark>bradley cooper</mark> said his mother's going to \"be so happy\" now that...casey anthony story set for tv looks as if the behind-the-scenes legal maneuvering that led to the acquittal of casey anthony in...bright ideas for gifted kids karen holloman was raising three boys, and her youngest, rob, was different. the new black: strike shopping gold on cyber, green and brown mondays for shoppers who decide to forgo the black friday madness, there are still holiday deals to be had. dear leanna: our school teaches about cyberbullying, but apparently not about digital manners. detroit's homicide rate is on the rise. where's the outrage? how would you caption this photo of republican presidential candidates newt gingrich, left, and...amid the horrific details of the penn state scandal and the economic woes many in metro detroit are...houston - major league baseball told houston businessman jim crane it would not approve his purchase of the astros unless he agreed to move the team to the american league, the associated press has learned. crane was forced to agree to move the sale along, a person familiar with the negotiations said today, on condition of anonymity because no official announcement has been made by mlb nor the astros. approval of the sale could be announced as early as thursday, at a meeting of baseball executives in milwaukee. crane reportedly agreed to the move in exchange for a drop in the sales price valued earlier this year at $680 million. the person who spoke to the ap could not confirm the sales price. the mlb players association believes two 15-team leagues would create a more proportionate schedule and has urged baseball to make the switch. with schedules for next season already completed, the earliest such a move could take place is 2013. time is running out for approval of the deal: crane has said that his offer, which was announced on may 16 expires nov. 30. an mlb spokesman did not immediately return messages seeking comment, though commissioner bud selig addressed an astros move during a twitter chat monday. \"for 15/15 realignment, houston would be the team moving to al west. would create more fairness in baseball,\" selig tweeted via the colorado rockies' twitter feed. he also added that \"15 teams in each league would necessitate interleague play every day but it will be better schedule overall .\" the astros currently play in the six-team nl central. the al west is the only league in the majors with four teams (rangers, angels, athletics and mariners). the astros would be in a division with in-state rival texas. but fans are unhappy that the other three teams are all on the west coast, meaning many road games would routinely end past midnight central time. drayton mclane (michigan state) bought the team in november 1992 for about $117 million and put the franchise up for sale in november. he turned down an offer from crane to buy the team in 2008. the $680-million sale price is the second-highest in major league history, trailing the $845-million purchase of the chicago cubs by the ricketts family two years ago. the $660-million sale of the boston red sox in 2002 currently is second. like the astros deal, the cubs and red sox transactions included related entities. a major selling point in houston was the astros' share in a new deal with the nba's houston rockets to create a regional sports network that will begin airing rockets games in 2012 and the astros in 2013. crane has said the team's 30-year lease at minute maid park, which is owned by the harris county houston sports authority, will remain intact under his ownership. crane, who founded a houston-based logistics company in 2008, is also the chairman and chief executive of crane capital, a private equity fund company. in 2009, he was in the running to buy the cubs and last summer teamed with dallas mavericks owner mark cuban in an unsuccessful bid to buy the texas rangers. kirk gibson wins nl manager of the year; leyland finishes second in al justin verlander captures third tiger cy young in unanimous fashion reactions to justin verlander winning the american league cy young no such thing as free lunch? there is for state lawmakers in lansing nfl analysts see matthew stafford's finger injury as an issue for lions report: mlb forcing astros to move to american league the mlb players association believes two 15-team leagues would create a more proportionate schedule and has urged baseball to make the switch. with schedules for next season already completed, the no such thing as free lunch? there is for state lawmakers in lansing nfl analysts see matthew stafford's finger injury as an issue for lions mayor bing expected to unveil plan to privatize detroit bus, lighting systems no such thing as free lunch? there is for state lawmakers in lansing nfl analysts see matthew stafford's finger injury as an issue for lions mayor bing expected to unveil plan to privatize detroit bus, lighting systems new indictment alleges kilpatrick pocketed $10,000 kickback in restroom"}, {"articleID": "2015121408_00185101_W", "names": {"Jennifer Wilson": ["Q3177119", "Q6178946"]}, "date": "2015-12-14", "url": "http://wjcl.com/news/national-international/sleeping-polar-bear-cub-captures-hearts/110369445/story", "content": "Published 12/14/2015 02:53 AM EST Updated 12/14/2015 02:53 AM EST (CNN) A sleepy polar bear cub and her stuffed moose pal are making observers at Columbus Zoo and Aquarium in Ohio say \"Awww .\" The zoo posted a video update Friday to its Facebook page featuring the 5-week-old cub, who can't completely open her eyes yet but has hearts aflutter with her sleepy purring and lolling tongue. \"The care staff says the sound that she makes in the video is of contentment,\" the zoo's Facebook post says. The video is providing viewers several moments of contentment too, as they take in the mega-cuteness of the cub cuddling with a stuffed animal and snoozing. The cub, which weighs 4 pounds and is 16 inches long, is doing well, zoo officials say. \"Her motor skills are improving each day and she has started trying to stand up on all fours, especially when she's ready for her next meal!\" The cub was born to Aurora, one of three adult polar bears living at the zoo, on November 6. A second cub delivered by Aurora did not survive. The surviving cub was pulled from her mother's den a week after birth because Aurora began only sporadically caring for the newborn. Zoo staff have been monitoring the cub's progress around the clock, as polar bear cubs are delicate and many don't survive the first few weeks. \"Polar bears, much like giant pandas, are highly specialized animals that give birth to very small babies which makes them fragile during their first year of life,\" <mark>Jennifer Wilson</mark>, the zoo's director of communications, said in a press release. \"Survival rates in human care are around 50 percent which is similar to that of wild bears .\" Copyright 2015 Cable News Network/Turner Broadcasting System, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2010040304_00051117_W", "names": {"Paddy Kelly": ["Q2045848", "Q41256180", "Q7123505", "Q7123506", "Q7123507", "Q7123508"], "Brian Kelly": ["Q16186315", "Q16730700", "Q18098352", "Q194016", "Q21259238", "Q22920229", "Q28873135", "Q48773396", "Q4964312", "Q4964313", "Q4964314", "Q4964315", "Q4964316", "Q4964318", "Q4964319", "Q4964321", "Q4964322", "Q57431309", "Q58039928"]}, "date": "2010-04-03", "url": "http://salemnews.com/pusports/local_story_092230154.html?keyword=secondarystory", "content": "driscoll thriving in new lacrosse role for camels peabody's sean driscoll is a tri-captain of the connecticut college lacrosse team, a squad that is off to a great start. in a big nescac rivalry game last weekend, the camels beat the nation's fifth-ranked team in division 3, middlebury, 8-7, scoring the game-winning goal with under three minutes to play. when the latest united states intercollegiate lacrosse association poll was released this past monday, the camels were ranked no. 10 nationally. last tuesday they pulled off their second straight one-goal victory, 12-11, over keene state in the rain. the 6-foot, 180-pound driscoll has a new position this year at defensive midifielder. he has scooped up 24 ground balls in the team's first seven games, all wins (including 3-0 in league play). after being an offensive threat his entire career, driscoll has made the switch to defensive responsibilities with ease. the success this year has been largely due to unselfish play, and driscoll, a two-time captain who starred at peabody high before transferring to pomfret, is a perfect example. \"sean has been a selfless leader for our team this year,\" said head coach dave cornell, a two-time all-american at gettysburg college. \"he was our leading scorer his freshman year and missed sophomore season due to a leg injury. following a tough year (as a junior), we asked him to take a look at the short stick d-mid position .\" cornell recalled driscoll never hesitating before telling him this was his senior year; he'd do whatever cornell thought would help the team. cornell said that willingness to switch positions says it all about driscoll, who is a great competitor and always puts the team first. conn college has posted wins over farmingdale state, amherst, clarkson, plymouth state, and trinity. the 10-8 win over amherst was the first victory over the lord jeffs since 2001. driscoll and freshman defenseman brogan o'connor of st. john's prep are the two local players on the squad. the camels know every team will be looking to end the unbeaten streak. they take on nescac rival bowdoin in a key game on the road this afternoon. driscoll was also just named to the nescac's winter all-academic team. students must be a varsity letterwinner and have a cumulative average of 3.35 or better. driscoll was a two-year hockey captain for the camels. ¬ ¢ ¬ ¢ ¬ ¢ the second annual charity flag football game at manning field in lynn last weekend was a huge success. the biggest winner was the make-a-wish foundation, which received $3,392 from the family-friendly event. police and fire departments from peabody, lynn, salem and beverly competed in the exciting games. the money raised came from ticket sales at the gate and at each department participating, donations from local businesses, raffle tickets and from the north shore flag football league. donations from local businesses paid for the t-shirts worn by the teams. roland james, a former new england patriot, handled the coin toss for the peabody vs. lynn fire department game, and stayed around to sign autographs for the kids. the boston militia women's pro football team was also on hand to raffle off team apparel and held a 50/50 raffle that raised over $200 for make-a-wish. pop warner ran a concession stand to raise money for the league. the make a wish foundation sent four volunteers to help out at the gate, and the flag football league donated the flags for the games. \"the weather was great, the games were great and everything ran smoothly,\" said nsffl founder austin bradshaw, who organized the event. \"this event will only get bigger and better every year .\" i have already been contacted by the departments to discus what we can work on for next year. the two new teams, salem and beverly, told me they are in for next year's event. we may move it to peabody or beverly and possibly have it before the football season opens in august, because the weather is so unpredictable this time of year. \"local businesses that helped sponsor the departments included murphy's restaurant and bar, engine house pizza, pickled onion, fibber mcgee's, <mark>paddy kelly</mark>'s, champions pub, lynn fire union and the police athletic club. ¬ ¢ ¬ ¢ ¬ ¢ new notre dame football coach <mark>brian kelly</mark>, the former st. john's prep football player, has been busy lately. he was the first speaker at the 14th annual key bank gridiron legends luncheon series at the college hall of fame in irving, texas. the series, which runs from march through june, is open to the general public, and <mark>kelly</mark> spoke to a sold out crowd last month. <mark>kelly</mark> will also receive the 2010 lee tressel ohio college coach of the year award later this month. he is being honored for his work as the highly successful head coach at the university of cincinnati prior to being hired at notre dame. ¬ ¢ ¬ ¢ ¬ ¢ after 41 years at the ipswich high helm, ken spellman has stepped down as the tigers' head spring track coach and indoor coach pat rich has taken over. the tigers also have a new girls coach in marty binette. he replaces micki mcvann, who had coached the team for six years .\" ken is the best assistant coach anybody could have, \"said rich .\" just because he's no longer the head coach doesn't mean he's not around; he's there every single day and is a tremendous help. i'm delighted he is so involved because he has so much knowledge to share. \"jean deplacido is a part-time writer and columnist for the salem news. contact her at jmdeplacido @ aol.com. careers the salem news, 32 dunham road, beverly, ma 01915 - 978-922-1234 © copyright eagle tribune publishing company. all rights reserved."}, {"articleID": "2011080321_00054992_W", "names": {"Brent Jones": ["Q18208348", "Q19895523", "Q3373154"]}, "date": "2011-08-03", "url": "http://rssfeeds.usatoday.com/%7Er/usatoday-LifeTopStories/%7E3/8szEqCHDIiY/1", "content": "ann oldenburg, usa today updated it will be the first broadway production of funny girl since the show originally opened in 1964. and taking the starring fanny brice role - which made barbra streisand a star at age 21 - will be six feet under actress lauren ambrose. glee's lea michele had been rumored to be up for the job. the show will play at center theatre group/ahmanson theatre in los angeles from jan. 15 through feb. 26, 2012, prior to opening in spring 2012 on broadway. \"let's face it, there is obviously more than a lot to live up to playing fanny brice, but i am humbled and thrilled by the opportunity to be a part of this revival,\" said ambrose in the announcement. \"the character is complex, the music beautiful and challenging. i can't wait to get into that rehearsal room with the team bart is assembling - wish we could start tomorrow!\" to report corrections and clarifications, contact standards editor <mark>brent jones</mark>. for publication consideration in the newspaper, send comments to"}, {"articleID": "2013082222_00001951_W", "names": {"Mark Webber": ["Q1378842", "Q6770266", "Q82667"], "Steve Robertson": ["Q56854966", "Q718672"], "Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"], "Andrew Davies": ["Q1151757", "Q27838011", "Q36137018", "Q46996221", "Q4756768", "Q4756770", "Q4756771", "Q4756772", "Q4758350", "Q504430", "Q58192763"]}, "date": "2013-08-22", "url": "http://www.planetf1.com/driver/3213/8883099/Seb-Never-say-never-to-Kimi-partnership", "content": "Seb: Never say never to Kimi partnership Sebastian Vettel would have enjoyed partnering Kimi Raikkonen at Red Bull but concedes it was not his decision. When <mark>Mark Webber</mark> announced that he would retire at the end of this season, Red Bull immediately set their sights on Raikkonen, revealing that the 2007 World Champion and Daniel Ricciardo were their main targets. Earlier this week, though, it emerged that talks between the Finn and Red Bull had fallen through. \"The negotiations with Red Bull were not successful and ended some time ago,\" his manager <mark>Steve Robertson</mark> told Turun Sanomat. And although Vettel would have liked teaming up with his friend, he says it could still happen in the future. \"I didn't know how realistic it was or not,\" he said when asked about the Raikkonen reports. \"I have learned, similar to most of us from the press, that as it looks like, it is not the case. For sure, I have talked with the team - but it is not my decision .\" I think Kimi would have been nice in many ways, but now it is not happening, so it doesn't make much sense to talk about it. \"But who knows? He is still young. I am still young, and a lot of things can still happen, so never, say never .\" As for rumours that Raikkonen could now be on his way back to Ferrari, Vettel doesn't believe that's at all realistic. \"I get along quite well with Kimi so I would be in a way happy if he finds a spot where he's happy. I think he has a good seat at the moment with Lotus, but if he can improve then I would be happy for him .\" I think Kimi is very straightforward, you don't get any bullshit with him and politics so in that regard I don't know how realistic it is for him to return to Ferrari. Adrian's Diary: Love Of Luigi Adrian reveals that <mark>Fernando Alonso</mark> couldn't possibly join Red Bull due to the Christian and Luigi love-in...<mark>Fernando</mark>, Red Bull Fighter Double World Champion <mark>Fernando Alonso</mark> could line up next year as a Red Bull driver - <mark>Andrew Davies</mark> assesses his chances...From Australia to Brazil, from Sebastian Vettel to Max Chilton, find out all the results of the 2013 F1 World Championship ..."}, {"articleID": "2017042002_00639466_W", "names": {"Lisa Coleman": ["Q456306", "Q6557883"]}, "date": "2017-04-20", "url": "http://www.kpvi.com/news/year-after-prince-s-death-another-turn-for-the-revolution/article_99b83345-1090-51b9-bab9-ccddba0bdd83.html", "content": "1 year after Prince's death, another turn for The Revolution By JEFF BAENEN Associated Press 24 min ago 0 MINNEAPOLIS (AP)--For members of Prince's 1980s backing band The Revolution, reuniting and hitting the road for a spring U.S. tour is how they are coping with the \"Purple Rain\" pop superstar's unexpected death a year ago. \"We're taking it to the people who are grieving like we are, and letting them have a little bit of relief,\" guitarist Wendy Melvoin, sitting on a couch with other members of the band during a break at their Minneapolis rehearsal space, said Wednesday. When Prince died of an accidental painkiller overdose, members of The Revolution were mourning at a Minneapolis hotel and made an impromptu video, promising to reunite for shows honoring their one-time flamboyant front man. After three sold-out shows at the fabled First Avenue nightclub (the setting of Prince's hit 1984 movie \"Purple Rain\" ) in September, The Revolution is back, preparing to kick off a tour Friday at Paisley Park in the Minneapolis suburb of Chanhassen on the anniversary of Prince's death. The tour includes stops in Chicago, Washington, D.C., New York, Cleveland, Detroit, Los Angeles and San Francisco before ending in Seattle on July 15. Melvoin is joined by bassist BrownMark, keyboardists Matt Fink and <mark>Lisa Coleman</mark>, and drummer Bobby Z. The reunited Revolution plans to play Prince's synthesizer-heavy 1980s music through his lauded 1987 double album \"Sign o' the Times .\" \"We have the ability now to give people a glimpse of what we experienced with him,\" BrownMark said. \"And I think that's a powerful thing. I know it helped me heal .\" While Prince had a reputation as a perfectionist, members of The Revolution remember the good times goofing in the studio. \"We had fun. We had a lot of fun. Sometimes we would be rehearsing and we'd crack up, we'd just laugh for an hour, cracking jokes,\" BrownMark recalls. \"We'd go play softball,\" keyboardist Fink said. \"\"OK, we're not going to rehearse today, let's go play softball .'\" After years of recording and touring with The Revolution, Prince \"did what any boss would do and just put it (the band) to bed,\" Bobby Z. said. \"That intense run we had, all those years, it was starting to come apart at the seams, with personalities and under that kind of pressure, just like human beings do, and he just kind of made a decision,\" the drummer said. \"And he wanted to move on as basically a solo artist with a backing band, no disrespect. But this was a band he was a very critical member of .\" Whether The Revolution will continue beyond this tour is an open question. \"We'd love to be able to see if there are some legs with this,\" Melvoin said. ___ Follow Jeff Baenen on Twitter at https: //twitter.com/jeffbaenen. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Angry 0"}, {"articleID": "2019011917_00092936_W", "names": {"Scott Williams": ["Q16228906", "Q2331415", "Q3399819", "Q59392591", "Q7437512", "Q7437514", "Q7437515", "Q7437517", "Q7437518"]}, "date": "2019-01-19", "url": "http://kesq.com/lifestyle/missing-link-in-human-history-confirmed-after-long-debate/981903935", "content": "\"Missing link' in human history confirmed after long debate Finding detailed in journal\" Paleoanthropology' By: Posted: Jan 19, 2019 08:24 AM PST Updated: Jan 19, 2019 09:08 AM PST The remains were first unveiled in 2010, and have sparked debate among scientists ever since. Alexander Joe/Getty Images The remains were first unveiled in 2010, and have sparked debate among scientists ever since. Related Content Saturn's rings haven't always been there (CNN) - Early humans were still swinging from trees two million years ago, scientists have said, after confirming a set of contentious fossils represents a \"missing link\" in humanity's family tree. The fossils of Australopithecus sediba have fueled scientific debate since they were found at the Malapa Fossil Site in South Africa 10 years ago. And now researchers have established that they are closely linked to the Homo genus, representing a bridging species between early humans and their predecessors, proving that early humans were still swinging from trees 2 million years ago. The Malapa site, South Africa's \"Cradle of Humankind,\" was famously discovered by accident by nine-year-old Matthew Berger as he chased after his dog. That stroke of luck eventually led to this week's finding, detailed in the journal \"Paleoanthropology .\" The findings help fill a gap in humankind's history, sliding in between the famous 3-million-year-old skeleton of \"Lucy\" and the \"handy man\" Homo habilis, which was found to be using tools between 1.5 and 2.1 million years ago. They show that early humans of the period \"spent significant time climbing in trees, perhaps for foraging and protection from predators,\" according to the study in the journal \"Paleoanthropology .\" \"This larger picture sheds light on the lifeways of A. sediba and also on a major transition in hominin evolution,\" said lead researcher <mark>Scott Williams</mark> of New York University. \"Still so much to discover' Two partial australopith skeletons--a male and a female - were found in 2008 at a collapsed cave in Malapa, in South Africa's\" Cradle of Humankind. \"\"Australopithecus\" means \"southern ape,\" a genus of hominins which lived between around 4 and 2 million years ago. Their discovery set off years of debate in the scientific community, with some rejecting the idea that they were from a previously undiscovered species with close links to the homo genus and others floating the idea that they were from two different species altogether. But the new research has laid those suggestions to rest, and outlined \"numerous features\" the skeletons share with fossils from the homo genus. Australopithecus sediba's hands and feet, for instance, show it was spending a good amount of time climbing in trees. The hands have grasping capabilities, which are more advanced than those of Homo habilis, suggesting it, too, was an early tool-user. The researchers of the paper to highlight the remarkable story of how the fossils were found, pointing out that other dramatic clues to humanity's history are still waiting to see the light of day. \"The first fossil of Au. Sediba was discovered by Matthew Berger, then a nine-year-old, who happened to stop and examine the rock he tripped over while following his dog Tau away from the Malapa pit,\" they wrote. \"Imagine for a moment that Matthew stumbled over the rock and continued following his dog without noticing the fossil,\" they added. \"If those events had occurred instead, our science would not know about Au. sediba, but those fossils would still be there, still encased in calcified clastic sediments, still waiting to be discovered .\" \"The fortuitous discovery of the Malapa fossils and other similarly fortuitous recent finds should be reminders to us all that there is still so much to discover about our evolutionary past,\" the authors concluded. Copyright 2019 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Download the KESQ News Channel app on iTunes or Google Play for up-to-the-minute breaking news alerts & more"}]