[{"articleID": "2020040620_00057894_W", "names": {"Shane Lowry": ["Q2067337", "Q2736966"]}, "date": "2020-04-06", "url": "https://www.krwg.org/post/golf-reshuffles-its-schedule-all-4-majors-canceled-or-postponed", "content": "Golf Reshuffles Its Schedule: All 4 Majors Canceled Or Postponed By Brakkton Booker • 2 hours ago Share Tweet Email The British Open, which is golf's oldest tournament, has been canceled this year because of the coronavirus. Last year, <mark>Shane Lowry</mark> (right) celebrated winning that championship. Andrew Redington / Getty Images Originally published on April 6, 2020 1:44 pm Golf tournament organizers announced a series of major schedule changes Monday due to the spread of the coronavirus, including canceling the British Open and rescheduling the Masters, the U.S. Open and the PGA Championship. \"It is with a heavy heart that we have to cancel The Open for the first time since WWII,\" the official Twitter account for the British Open, golf's oldest tournament, said on Monday. \"We appreciate that this will be disappointing for a great many people but we have to act responsibly during this pandemic and it is the right thing to do,\" the tweet continued. It is with a heavy heart that we have to cancel The Open for the first time since WWII. We appreciate that this will be disappointing for a great many people but we have to act responsibly during this pandemic and it is the right thing to do. Statement: https: //t.co/brJfuOZSFP pic.twitter.com/iizOupOk4m--The Open (@ TheOpen) April 6, 2020 The Open is the first major for men's golf to be canceled. It was one of a series of changes in golf's calendar announced Monday. The sport's most iconic U.S. tournament, the Masters, said it was postponing the Augusta, Ga., -based competition from April to November. \"We have identified Nov 9-15 as the intended dates to host the 2020 Masters. We hope the anticipation of staging the Tournament brings a moment of joy to the Augusta community and those who love the game,\" Augusta National Golf Club Chairman Fred Ridley said in a statement on Twitter. Statement from Chairman Ridley: \"We have identified Nov 9-15 as the intended dates to host the 2020 Masters. We hope the anticipation of staging the Tournament brings a moment of joy to the Augusta community and those who love the game.\" Full details at https: //t.co/rSr9YUhCX2 pic.twitter.com/1lVmbq8jzJ--The Masters (@ TheMasters) April 6, 2020 The U.S. Open, which had been scheduled in June at Mamaroneck, N.Y., has been rescheduled to Sept. 17 to 20. The PGA of America announced that the PGA Championship, originally scheduled for May, is now set to be played August 3 to 9. The biennial men's golf tournament the Ryder Cup, which features a U.S. team competing against a European team, remains unchanged, and is still scheduled for September 22 to 27. We have new dates for the 2020 PGA Championship, provided we have clearance from public health authorities. #PGAChamp pic.twitter.com/Erkhm7GA5j--PGA of America (@ PGA) April 6, 2020 The 149th British Open was scheduled to be played July 12 to 19 at Sandwich, Kent, England. The tournament, one of men's golf's four major champions, will now be played July 11 to 19 in 2021, according to a statement by the R & A, the governing body of the sport outside the U.S. \"I can assure everyone that we have explored every option for playing The Open this year but it is not going to be possible,\" said Martin Slumbers, the chief executive of the R & A. The 150 th Open will also be pushed back a year and is now scheduled to be played at St. Andrews in Fife, Scotland from July 10 to 17 in 2022. Golf is far from the only sporting competition that's been forced to cancel or postpone events because of the coronavirus pandemic. Last week, the organizers of Wimbledon canceled the London-based tennis tournament because of concerns over COVID-19. The MLB, NBA, NFL, NHL and the Olympics have also canceled or postponed games or other league events because of the spread of the virus. The last golf tournament to be played in the U.S., the Players Championship in Ponte Verda Beach, Fla., was canceled after playing just one round last month. Copyright 2020 NPR. To see more, visit https: //www.npr.org. Share Tweet Email View the discussion thread."}, {"articleID": "2014032508_00060075_W", "names": {"Luke Kennard": ["Q28935925", "Q6702089"]}, "date": "2014-03-25", "url": "http://www.witn.com/sports/headlines/Mr-Basketball-Luke-Kennard-Says-Hell-Attend-Duke-252083621.html", "content": "COLUMBUS, Ohio (AP) - <mark>Luke Kennard</mark>, the 27th annual winner of Ohio's AP Mr. Basketball award, has announced he'll play college ball at Duke. The 6-foot-6 junior averaged 41 points, 10.4 rebounds, 4.0 assists and 2 steals per game in the regular season for Franklin High School. His final five college choices - he said at the time \"in no particular order\" - were Duke, Ohio State, Kentucky, North Carolina and Michigan. <mark>Kennard</mark>, also an all-state quarterback in football, said last week that he was looking forward to announcing his choice so he could \"enjoy my next year and kind of get the pressure off.\" He is also has a grade-point average of 4.3 and is among the top students in his school. Copyright 2014 by The Associated Press. All Rights Reserved. Williams' Tar Heels Close Turmoil-Filled Season WITN 275 E. Arlington Blvd.. Greenville, NC 27858 252-439-7777"}, {"articleID": "2012082413_00095267_W", "names": {"David Grey": ["Q27981180", "Q352613"]}, "date": "2012-08-23", "url": "http://chroniclelive.co.uk/north-east-news/evening-chronicle-news/2012/08/24/gang-leader-dean-elliott-is-banned-from-howdon-72703-31689109/", "content": "dean elliott is facing a ban from entering parts of tyneside on his release from prison a gang leader has been banned from a tyneside estate for helping to organise a violent street fight. dean elliott was jailed for 32 months for his part in the brawl in churchill street, howdon, in april last year. the incident involved two rival groups attacking each other with weapons including swords, machetes and knives. one man was stabbed in the chest and needed hospital treatment. elliott, 22, who grew up in north shields and cullercoats, was described as the main instigator of the clash. his gang had a long-standing rivalry with another group, led by dale fuller. both sides had been provoking each other on facebook in the run-up to the fight. fuller, 25, of coldstream gardens, howdon, has already been barred from entering major parts of the town. now elliott, who is due to be released from prison today, has received the same ban after north tyneside council obtained an anti-social behaviour injunction at north shields county court. prosecutor peter rowbottom said: \"mr elliott is number 11 out of 16 people who were arrested and imprisoned after a serious incident of public disorder in howdon. ten others have been made subject to similar injunctions and there have been no breaches so far.\" this is being done to help rid this area of gang culture which resulted in violence. \"elliott, of blackpool, was not in court and district judge <mark>david grey</mark> granted the injunction in his absence. he said he was satisfied the defendant had been informed about the case and had the chance to instruct lawyers if he wished to. the order will run until august 2014. the exclusion zone covers the howdon, willington and holy cross areas of wallsend. after the hearing, colin boxshall, the council's safer estates manager, said:\" this injunction reaffirms our commitment to protecting communities from anti-social behaviour. \"we put victims first and take decisive action against perpetrators. others involved in the disorder will face similar injunctions upon their release from prison. chroniclelive, the evening chronicle newspaper online. latest newcastle news, north east news, newcastle united news, sunderland afc news, videos and chronicle photos."}, {"articleID": "2018062515_00150541_W", "names": {"Sean Davis": ["Q19867419", "Q24005664", "Q3476712", "Q37390205", "Q58148906", "Q74305"], "James Washington": ["Q27915139", "Q4111278", "Q48841117"]}, "date": "2018-06-24", "url": "https://steelerswire.usatoday.com/2018/06/24/mike-tomlin-continues-to-praise-rookie-conditioning-in-minicamp/?src=rss", "content": "Mike Tomlin continues to praise rookie conditioning at minicamp Mike Tomlin continues to praise rookie conditioning at minicamp By: Curt Popejoy | 22 hours ago Last season, there were some significant keys to why the 2017 rookie class saw the field as quickly as they did for the Pittsburgh Steelers. Head coach Mike Tomlin praised players like safety <mark>Sean Davis</mark> and wide receiver JuJu Smith-Schuster for the level of conditioning they showed up with and pointed to that as the reason he and the Steeler's coaches were able to integrate them into the team as quickly as they did. And this season another rookie is drawing that rare praise from Tomlin for his conditioning. Wide receiver <mark>James Washington</mark> has always had the reputation of being a workhorse and maintaining a high level of conditioning. Tomlin spoke on Steelers Nation Unite and talked about why <mark>Washington</mark> is getting plenty of reps in minicamp. \"He's absorbing a lot of reps during our work right now, and he's getting those reps because he's in good shape,\" Tomlin said. \"If he wasn't in as good as condition, he wouldn't be able to get those things. There's consequences of not being in condition.\" The Steelers are counting on <mark>Washington</mark> to fill the void created by the trade of Martavis Bryant. If he cannot, Pittsburgh should strongly consider signing Eli Rogers back, assuming he's healthy. Slot receiver is vital to the success of this offense. If <mark>Washington</mark> can win the No. 3 spot it gives the Steelers the freedom to rotate three guys into it, which creates natural mismatches."}, {"articleID": "2013101102_00025254_W", "names": {"Kevin Walker": ["Q16234305", "Q1628988", "Q1740276", "Q6397705", "Q6397706", "Q6397707"], "David Todd": ["Q16205178", "Q43264256", "Q45836567", "Q5240448"]}, "date": "2013-10-10", "url": "http://www.businesswire.com/news/home/20131010006455/en/Invizeon-Corporation-Hires-Chief-Operating-Officer-Rapidly", "content": "www.invizeon.com) today announced <mark>Kevin Walker</mark> as the Chief Operating Officer for two of its rapidly growing subsidiaries, Seafaring Security Services, LLC and Slipstream Resources, LLC. Mr. <mark>Walker</mark> was previously Vice President and General Manager of ACADEMI, a security, training, and logistics services provider to the U.S. Government, international and domestic military & law enforcement agencies, and numerous commercial customers. While at ACADEMI he successfully led the company's flagship Training Services business unit. Prior to ACADEMI, Mr. <mark>Walker</mark> spent more than 15 years in the semiconductor and telecom industries driving operations, manufacturing, R & D, logistics and supply chain. Most notably with Ericsson of Stockholm, Sweden and Standard Microsystems Corporation (SMSC) on Long Island, New York. \"The Seafaring and Slipstream businesses, are world-class in their respective disciplines and passionate about innovation that works in the real world and delivering superior results to our clients,\" said <mark>David Todd</mark>, President and CEO of Invizeon. \"At the end of the day, our success in delivering exceptional value to our customers is achieved by the synergy of character and talents within a group of individuals who share a passion and a vision. Having <mark>Kevin</mark> join our team exemplifies these attributes and Invizeon's commitment to disciplined growth and innovation leadership. Mr. <mark>Walker</mark> brings to Invizeon a rich history in hi-tech operations and significant experience working with the USG/DOD/DOS, international, and commercial customers, and a proven ability to drive operational excellence & customer satisfaction.\" www.seafaringllc.com) is an internationally recognized leader in maritime safety, security and surveillance, offering a unique blend of innovative technologies, skills and abilities, and unparalleled maritime technology expertise. Seafaring's consultations and solutions are utilized by the who's who of the cruise line, shipping, and oil and gas industries. www.slipstream.us) is quickly emerging as a leader in the high end of the Cyber Security Systems industry. Slipstream draws on the depth of its unique experience and insight in the security industry, to bring technologies and innovative approaches that provide highly effective and specialized solutions to the emerging global cyber security threats on behalf of its tier-one government clients. Matt Winans, VP of Invizeon and President of Seafaring and Slipstream said, \"<mark>Kevin</mark> brings to our organization a new dimension which will greatly assist in the future growth of the company.\" Following Mr. Winans, <mark>Kevin Walker</mark> had this to say, \"I am excited about the incredible opportunities for innovation and growth here at Invizeon. The management team and employees are some of the most talented people I have had the opportunity to work with. Their pioneering spirit and passion are contagious. I look forward to working closely with them to provide our customers the right solutions for their needs.\" www.invizeon.com) owns and develops a growing number of strategic businesses and software platforms operating at the intersection of mission-critical security and socio-economic innovation. Invizeon is headquartered in Washington DC, with offices in Virginia, Florida, Montana, Arizona and Africa."}, {"articleID": "2019102519_00121183_W", "names": {"Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"], "Édgar Ramírez": ["Q20030432", "Q273788"]}, "date": "2019-10-25", "url": "https://sciencefiction.com/2019/10/25/producer-trinh-tran-gives-the-lowdown-on-disneys-hawkeye/", "content": "Avengers Disney Disney + Marvel Movies Streaming Service TV/Streaming Media Producer Trinh Tran Gives The Lowdown On Disney +'s \"Hawkeye' Leave a comment Posted October 25th, 2019 by Jax Motes Marvel Studios/Disney After popping up here and there in the Marvel Cinematic Universe, Jeremy Renner\" s Hawkeye is finally getting his turn in the spotlight as the star of his own Disney + series called--what else?--\"Hawkeye'.\" Avengers: Endgame' producer Trinh Tran is now spearheading that series, after developing a particular interest in the character from the movies. Marvel Studios/Disney As we saw in \"Endgame', Hawkeye/Clint Barton has really been through the wringer over the past few years. He was already a S.H.I.E.L.D. agent with a sketchy past, but he was grounded by his family--his loving wife Laura (Linda Cardellini), and his kids. But when they all vanished after The Snap, he went off the deep end, becoming Ronin and embarking on a mission to slay criminals all over the world. And while he was reunited with his family at the end of the movie, he'd suffered another debilitating loss, after his longtime partner Black Widow/Natasha Romanoff (Scarlett Johansson) sacrificed her life to bring back all the victims of The Snap. In reality, it was simply time for many of the major stars of the Marvel Cinematic Universe to leave the nest. After a decade, Johnasson, Robert Downey Jr., and <mark>Chris Evans</mark> were ready to move on. But Renner hasn't had the chance to shine like they have. Hopefully, that will change with the new show, but as we already know, this series will introduce Kate Bishop, the young woman who essentially replaced Barton in the comics. Tran discussed what to expect from\" Hawkeye': \"I think with Endgame, it's always going to impact all of the characters that we are introducing in our Disney + streaming shows as well as the future of features, right, for the characters that are still existing. So you're just going to have to find...I can't say much about that!\" Regarding Kate's introduction, Tran said: Marvel Comics \"Well, they're both Hawkeyes in a way, right? So you want to make sure...I'm always interested in introducing new characters. And now we have a fascinating young female who is very interested in this role. So you're going to see a balance of both.\" We're treating our shows as if we're making our features. I mean, the feel and the quality of those TV shows are going to be like the Marvel movies that you've seen. So that's always been [Marvel Studios president Kevin Feige]'s mindset of let's make sure that when people are going to be watching these episodes, it's going to feel like it's just one long movie except rather than two-and-a-half hours, it's going to be much longer. And the idea behind certain characters getting their shows is because we'll have a lot more time to be able to develop these characters rather than the shorter. \"It isn't yet known when the\" Hawkeye' series will arrive on Disney +, but it probably won't be until 2021. Renner is returning, and reportedly Hailee Steinfeld is in talks to portray Kate Bishop. Are you looking forward to the new Marvel shows on Disney +? Source: ComicBook.com Tags: Avengers Avengers: Endgame Black Widow Clint Barton Disney Hailee Steinfeld Hawkeye Jeremy Renner Kate Bishop Marvel Comics Marvel Studios Scarlett Johansson Trinh Tran Jax Motes Jax's earliest memory is of watching \"Batman,' followed shortly by a memory of playing Batman & Robin with a friend, which entailed running outside in just their underwear and towels as capes. When adults told them they couldn't run around outside in their underwear, both boys promptly whipped theirs off and ran around in just capes. Things Are Heating Up As Neill Blomkamp Taps Taylor Kitsch To Star In\" Inferno' <mark>Édgar Ramírez</mark> Has Been Talking To The Director Of \"Doctor Strange' Leave a comment June 25, 2014 James Mangold Suspects A Bleak Future For Mutants If The Disney And Fox Deal Goes Through 2 Comments December 12, 2017 Nick Blood Is Returning As Lance Hunter To Marvel's\" Agents Of S.H.I.E.L.D.'! Leave a comment September 10, 2017 Real Life Flying DeLorean Spotted In San Francisco Leave a comment January 20, 2013"}, {"articleID": "2019101101_00071471_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Dowd": ["Q21173981", "Q6229967", "Q6229968", "Q6245783"], "Kevin Brady": ["Q472241", "Q6395881"], "Carlos Curbelo": ["Q18631533", "Q459498"], "Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"]}, "date": "2019-10-10", "url": "https://ottawacitizen.com/news/world/two-businessmen-linked-to-trump-ukraine-scandal-arrested-on-u-s-charges/wcm/8342db75-0b94-4d31-8ba9-e7ce79ce21fb", "content": "Two Rudy Giuliani associates charged with illegally funneling cash to pro-Trump group Reuters Updated: October 10, 2019 President <mark>Trump</mark>'s personal lawyer, Rudy Giuliani, has coffee with Ukrainian-American businessman Lev Parnas at the <mark>Trump</mark> International Hotel in Washington, September 20, 2019. (REUTERS/Aram Roston/File Photo) Share Adjust Comment Print WASHINGTON/NEW YORK--Two foreign-born Florida businessmen who have helped President <mark>Donald Trump</mark>'s personal lawyer Rudy Giuliani investigate political rival Joe Biden were arrested in a scheme to illegally funnel money to a pro-Trump election committee and other U.S. political candidates, prosecutors said on Thursday. The arrest of Ukraine-born Lev Parnas and Belarus-born Igor Fruman at an airport outside Washington carrying one-way tickets to Vienna was the latest dramatic development in a political saga that threatens <mark>Trump</mark>'s presidency. Prosecutors said Parnas and Fruman conspired to contribute foreign money including at least $1 million from an unidentified Russian businessman to candidates for federal and state offices to buy influence. Prosecutors separately say they donated $325,000 to a pro-Trump political action committee called America First Action in May 2018, and the money was falsely reported as coming from a purported natural gas company set up to conceal its true source, according to the indictment. A fast-moving Democratic-led House of Representatives impeachment inquiry is centered on the Republican president's request in a July phone call for Ukrainian President Volodymyr Zelenskiy to investigate Biden, the former vice president and a top contender for the 2020 Democratic presidential nomination. Democrats have accused <mark>Trump</mark> of pressuring a vulnerable foreign ally to dig up dirt on a domestic political opponent for his own political benefit. Giuliani has said Parnas and Fruman helped his efforts in Ukraine to investigate Biden and Biden's son Hunter. The younger Biden had served as a director of a Ukrainian energy company. The two men were each charged by federal prosecutors in New York with two counts of conspiracy, one count of false statements and one of falsification of business records. U.S. law prohibits foreign donations in American elections. Parnas and Fruman were trying to buy political influence to help them set up recreational marijuana businesses, prosecutors said. They also said Parnas played a role in a successful effort to have <mark>Trump</mark> remove the U.S. ambassador to Ukraine. \"Protecting the integrity of our elections, and protecting our elections from unlawful foreign influence, are core functions of our campaign finance laws,\" U.S. Attorney Geoffrey Berman told reporters in New York. \"And as this office has made clear, we will not hesitate to investigate and prosecute those who engage in criminal conduct that draws into question the integrity of our political process\" Berman served on <mark>Trump</mark>'s transition team after <mark>Trump</mark> was elected president to prepare for taking office in January 2017. The indictment said Parnas and Fruman falsely claimed the company, called Global Energy Producers or GEP, which was making the political donations, was \"a real business enterprise\" and that \"its major purpose is energy trading, not political activity.\" In fact, the company had no real business, the indictment added. The two were arrested at Dulles airport in Virginia on Wednesday night, prosecutors said. <mark>John Dowd</mark>, the lawyer for Parnas and Fruman, declined to comment on the charges. <mark>Dowd</mark> previously represented <mark>Trump</mark> in former Special Counsel Robert Mueller's investigation that detailed Russian interference in the 2016 U.S. presidential campaign to boost <mark>Trump</mark>'s candidacy. Parnas and Fruman made their initial court appearance in Alexandria, Virginia, with another court date set for next Thursday. They were being represented in the court appearance by lawyers for <mark>Trump</mark>'s former campaign chairman Paul Manafort, who is serving prison time after being convicted last year in Mueller's investigation. Federal Magistrate Judge Michael Nachmanoff imposed a lengthy, strict set of conditions that Parnas and Fruman must meet to be released including each posting $1 million bond and being placed on GPS monitoring in home detention. The prosecution called the men a flight risk. Giuliani did not immediately return a request for comment. Last week, he told Reuters: \"Parnas and Igor helped me on certain things. They helped me with logistics. They know the Ukraine, they speak Russian. They helped me locate people in a few cases.\" Jay Sekulow, a lawyer for the president, told Reuters that \"neither the president nor the campaign was aware of their scheme,\" referring to the defendants. <mark>Trump</mark> has denied wrongdoing and has described the impeachment probe as a partisan smear. Both men were expected to figure in the House impeachment drive and had been asked to produce documents and give testimony. Parnas had been scheduled to take part in a deposition with House lawmakers on Thursday, with Fruman scheduled on Friday. <mark>Dowd</mark> had called the lawmakers' demands \"unreasonable.\" House Democrats on Thursday issued subpoenas for the men to hand over the documents and testify at a later date. According to the indictment, Parnas also sought the help of a U.S. congressman--identified by a person familiar with the matter as Republican Pete Sessions--to get <mark>Trump</mark> to remove U.S. ambassador to Ukraine Marie Yovanovitch. <mark>Trump</mark> eventually did remove Yovanovitch and called her \"bad news\" in his July 25 call with Zelenskiy. Giuliani told Reuters last week he had provided information to both <mark>Trump</mark> and the State Department about Yovanovitch, who he suggested was biased against <mark>Trump</mark>. Yovanovitch is scheduled to give testimony in the House impeachment inquiry on Friday. Sessions lost his House seat from Texas last year to a Democrat. He did not immediately respond to a request for comment. In another development, House Democrats issued a subpoena for a member of <mark>Trump</mark>'s Cabinet, U.S. Energy Secretary Rick Perry, for documents over any role he may have played in <mark>Trump</mark>'s effort to get Ukraine to investigate Biden. Prosecutors said Parnas, Fruman and others also conspired to funnel donations to candidates in Nevada, New York and other states to benefit a planned marijuana business funded by an unnamed Russian businessman. Two other people were charged in the indictment: David Correia, a U.S. businessman, and Andrey Kukushkin, a Ukrainian-born U.S. businessman who was a vice president of a Russian hedge fund before becoming involved in several marijuana-related businesses in California. Photos from Parnas' social media accounts show him meeting on various occasions with <mark>Trump</mark>, his son <mark>Donald Trump</mark> Jr., Sessions, Republican congressman <mark>Kevin Brady</mark> and former congressman <mark>Carlos Curbelo</mark>. In an interview last month, Parnas told Reuters that the FBI was investigating him but that he did not know why, and that he did nothing wrong. \"I don't know what the FBI wants. I'm not going to comment, what they are doing. What they did.\" \"I don't think we know too much\" about the investigation, Parnas said, but added that it had to be political. \"When you have the heads of the Democratic Party not liking you, it's very easy to get the FBI involved.\" Parnas said any violations of U.S. Federal Election Commission rules were unwitting and a \"clerical thing\" because he was not an experienced political donor. Parnas said he was not trying to hide the source of the $325,000 donation. Kelly Sadler, a spokeswoman for America First Action Political Action Committee, confirmed the pro-Trump group received the $325,000 contribution mentioned in the indictment. Sadler said the organization \"placed that contribution in a segregated bank account,\" and it has not been used \"for any purpose.\" Federal records show Parnas has donated $25,200 to Republican candidates and political groups since the 2016 election, including $2,700 to Sessions and $2,700 to House Republican Leader <mark>Kevin McCarthy</mark>. Fruman has donated $44,201 over that period to Republicans, including Sessions, the Republican National Committee and <mark>Trump</mark>'s presidential campaign. The top Senate Democrat, Chuck Schumer, called the developments regarding Giuliani's associates \"very troubling.\" \"Giuliani's been involved up to his neck in this entire mess. He has an obligation to testify under oath so he can be asked questions and so this can come to light,\" Schumer told reporters."}, {"articleID": "2015102909_00132696_W", "names": {"Paul Brown": ["Q16197784", "Q16212754", "Q18205667", "Q18921483", "Q19396015", "Q21462455", "Q22235645", "Q24033408", "Q29034170", "Q54727692", "Q55079049", "Q5587853", "Q7149543", "Q7149544", "Q7149545", "Q7149546", "Q7149547", "Q7149549"], "Michael Johnson": ["Q16195604", "Q16238908", "Q190924", "Q1928051", "Q20667583", "Q21458865", "Q21484117", "Q29456", "Q29964620", "Q3856198", "Q4896337", "Q496521", "Q54667230", "Q55313528", "Q56853023", "Q57056207", "Q57427460", "Q5889087", "Q6831672", "Q6831675", "Q6831677", "Q6831678", "Q6831679", "Q6831680", "Q6831682", "Q6831683", "Q6831685", "Q6831687", "Q6831690", "Q6831692", "Q898451"], "Andy Dalton": ["Q129605", "Q2849092"]}, "date": "2015-10-29", "url": "http://dispatch.com/content/stories/sports/2015/10/29/dunlaps-maturation-helps-him-become-more-complete-player.html", "content": "CINCINNATI--The location of Carlos Dunlap's locker, next to a door leading to a hallway and nearby exit at <mark>Paul Brown</mark> Stadium, always has allowed the Bengals defensive end to be a wisp of smoke. Dunlap, a personable giant of a man at 6 feet 6 and 280 pounds, usually offers a few soft-spoken words to reporters gathered around him and then suddenly, poof, he's gone. So it seemed odd when Dunlap stood with media members for 20 minutes on Wednesday and discussed how his 6.5 sacks--tied for the NFL lead--have contributed to Cincinnati's first 6-0 start since the 1988 Super Bowl season. Dunlap said his improved production in his sixth season is a byproduct of the entire defense's play, but a veteran teammate noted a personal change--evident by ease with the media--as being at the root of success. \"Carlos is older,\" said defensive end <mark>Michael Johnson</mark>, who returned to Cincinnati as a free agent this season after one year in Tampa Bay. \"With age, you think differently. You understand yourself better, and understand everything that is going on better.\" Bengals quarterback <mark>Andy Dalton</mark>, the NFL's leading passer with a 116.1 rating, is receiving much of the attention as Cincinnati heads into a game at Pittsburgh on Sunday with a chance for the franchise to be 7-0 for the first time. Dunlap, however, is the defensive player at age 26 who exemplifies how the Bengals have grown into a veteran team primed for a franchise-record fifth consecutive playoff spot with a 21/2-game lead over the Steelers (4-3) in the AFC North. \"He does what we want to see much more often,\" Cincinnati coach Marvin Lewis said of Dunlap. \"He's matured as a man and a player. He tries to do things the right way. That's been the key for him.\" The Bengals knew they were acquiring freakish size and athleticism when they drafted Dunlap in the second round in 2010 out of Florida, where he helped the Gators win a second national title under Urban Meyer. Dunlap, who has a 7-foot wingspan and a vertical leap of 35 inches, flashed his raw ability as a rookie with 9.5 sacks. Still, it wasn't until Dunlap matured on and off the field that the Bengals were convinced to give him a five-year contract extension before the 2014 season, worth nearly $40 million with $11.7 million guaranteed. Now, financially secure with five seasons under his belt, Dunlap was able to look back at 2014 and decide that his eight sacks and career-high 66 tackles weren't enough. \"I trimmed down 10 pounds because I wanted to be quicker,\" Dunlap said. \"I felt like last year I was getting a lot of hits and hurries (on quarterbacks), but a lot of my hits and hurries were half a second late. I needed to figure out how to get there half a second quicker.\" Besides changing his diet, Dunlap said he's taking better care of his body with a weekly routine of massages, stretching, chiropractor treatments and weightlifting. \"I do a whole bunch of different things, and I feel it pays off. I feel like that's huge,\" Dunlap said. So, too, has been the return of <mark>Johnson</mark> and defensive tackle Geno Atkins regaining his All-Pro form that he played at before suffering a major knee injury in 2013. \"Having Geno back to playing at the elite level makes it easier on the edge rushers,\" Dunlap said. And Dunlap has helped himself with accrued wisdom. \"When you're a rookie or a young guy, you just study what you're doing so you don't have those mess-ups or mistakes,\" Dunlap said. \"Once you're a veteran, you understand what you're doing and you're able to look and see what (offenses) are trying to do to you. The extension of that is probably one of the bigger things contributing to my success.\" tjones @ dispatch.com @ Todd_Jones NEXT GAME Opponent: at Pittsburgh Steelers When: 1 p.m. Sunday TV: CBS (Ch. 10) Radio: WXZX-FM (105.7)"}, {"articleID": "2011072401_00044618_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2011-07-24", "url": "http://cbs8.com/story/15136164/debt-crisis-deal-sought-to-head-off-stock-plunge", "content": "debt crisis: deal sought to head off stock plunge senate minority leader mitch mcconnell, r-ky., senate majority leader <mark>harry reid</mark>, d-nev., house speaker john boehner, r-ohio, and house democratic leader nancy pelosi, d-calif. are seen at a photo opportunity in the house speaker's office before a meeting washington (ap) - precariously short of time, congressional leaders struggled in urgent, weekend-long talks to avert an unprecedented government default, desperate to show enough progress to head off a plunge in stock prices when asian markets open ahead of the u.s. workweek. with the white house consigned to the periphery of negotiations, republicans sought as much as $4 trillion in deficit cuts over a decade as a condition for raising the nation's debt limit. but after hours of staff negotiations followed by a meeting of congress' top four leaders, senate majority leader <mark>harry reid</mark> accused gop leaders of intransigence, adding he would not accept anything less than a deal that raised the debt limit through 2012. \"their unwillingness to compromise is pushing us to the brink of a default on the full faith and credit of the united states. we have run out of time for politics. now is the time for cooperation,\" he said in a sharply worded statement. there was no immediate response from either house speaker john boehner, r-ohio, or senate gop leader mitch mcconnell of kentucky. obama met earlier in the day with the republican and democratic leaders - but only briefly - the day after boehner abruptly broke off his own once-promising compromise talks with the white house. in talks through the afternoon in the capitol, congressional aides were looking at an immediate debt limit increase of about $1 trillion, officials said, with slightly higher spending cuts to be locked into place simultaneously. another $1.4 trillion in additional borrowing authority would be needed to satisfy obama's demand that any deal extend into 2013, and based on <mark>reid</mark>'s accusation, it was clear the two sides had not yet been able to bridge their differences. on one point, there was no disagreement - time is running out. congressional aides labored to produce a tentative agreement by monday, congressional officials said. even that would allow scarcely enough time for the house and senate to clear legislation in time for obama's signature by the aug. 2 deadline, a week from tuesday. more urgently, boehner told rank-and-file republicans in a conference call he hoped to be able to announce a \"viable framework for progress\" by 4 p.m. edt on sunday, before the stock markets open in japan and elsewhere in asia, according to two participants. lawmakers fear a big drop in investor confidence in stocks and bonds could start in asia and sweep toward europe and the americas, causing u.s. stock values to plunge on monday. barring action by aug. 2, the treasury will run out of the money needed to pay all its bills, triggering a possible default that could seriously damage the domestic economy and send damaging waves across the globe. obama has warned repeatedly of the possibility of a spike in interest rates that could affect americans' mortgages, credit cards and other forms of personal debt. \"the bipartisan leadership in congress is committed to working on new legislation that will prevent default while substantially reducing washington spending,\" mcconnell said in a written statement not long after he, boehner and democratic leaders met with obama at the white house. obama appeared grim-faced as he convened the meeting around the big table in the white house cabinet room. he was flanked by boehner, r-ohio, and <mark>reid</mark>, d-nev. vice president joe biden, mcconnell and pelosi also attended. the only aides attending the white house meeting were budget director jack lew and treasury secretary tim geithner, who emphasized the concern about asia. afterward, white house press secretary jay carney issued a stern statement: \"congress should refrain from playing reckless political games with our economy. instead, it should be responsible and do its job, avoiding default and cutting the deficit.\" sixteen blocks away at the capitol, congressional aides said the white house would not have a presence at the bargaining table with house and senate leaders. under normal procedures, boehner would need to have legislation on the house floor by wednesday to allow enough time for a measure to reach obama's desk in time to meet the debt-limit deadline. negotiators were working against two avowedly non-negotiable demands - obama's insistence on a plan that assures no rerun of the current crisis until 2013 at the earliest, and boehner's requirement that spending cuts over 10 years must exceed the size of any increase in borrowing authority - without any rise in taxes. to comply with both edicts, under most estimates, legislation would have to cut more than $2.4 trillion across the next decade, since that is the amount of additional borrowing authority the treasury is expected to require to pay the nation's bills. also complicating the talks were divisions within each party. liberal democrats are generally opposed to cuts in medicare and social security, while obama hopes to use the negotiations to appeal to voters who want big cuts in federal deficits. tea party-backed republicans, dozens of whom are in the house, adamantly oppose any higher taxes, while obama has made more revenue the price of admission to the talks. it was unclear how much <mark>reid</mark>, pelosi, boehner and mcconnell would rely on the results of earlier talks, those that biden held with lawmakers for several weeks in the capitol and negotiations obama had with leaders in a group and with boehner. judging from accounts provided by officials in both parties, obama had previously agreed to significant changes in benefit programs, including raising the raise of eligibility for medicare from 65 to 67 for future recipients, and also slowing the projected rise in social security cost of living benefits. his concessions triggered a revolt earlier in the week by senate democrats, who feared he was giving away too much without getting enough additional government revenue in return. for his part, boehner had been ready to agree to an overhaul of the tax code that would result in a net increase of revenue to the government of $800 billion over a decade. there also had been a general agreement to cut $1 trillion or more from hundreds of government programs ranging from the park service to foreign aid and agriculture, and to chalk up another $1 trillion in savings by assuming the end of the wars in iraq and afghanistan. there was another possible element of a deal on the shelf - legislation that mcconnell and <mark>reid</mark> have developed that would let obama raise the debt limit by $2.4 trillion in three installments over the next year or so without prior approval by congress. instead, he would be required to recommend spending cuts assured of coming to a vote in congress. additionally, that proposal envisions establishment of a special congressional committee to recommend cuts in benefit programs such as medicare and social security and possibly draft a tax reform bill as well. it was boehner's decision friday night to break off his talks with the white house that triggered an extraordinary evening in which divided government briefly appeared to be irretrievably gridlocked. the speaker said obama wanted higher taxes and not enough spending cuts, adding, \"it's the president who walked away from his agreement.\" but speaking to reporters at the white house, obama said he had offered an \"extraordinarily fair deal\" that totaled $2.6 trillion in spending cuts and $1.2 trillion in additional revenue. \"i've been left at the altar now a couple of times,\" he said wryly, adding that boehner had declined to return his phone calls. police search for man accused of robbing midway ralphs updated: a man robbed a midway grocery store pharmacy counter saturday and police continued to search for the suspect. crews battle brush fire on side of i-5 in encinitas updated: a brush fire on the side of interstate 5 in encinitas saturday prompted the brief closure of two northbound lanes of the freeway while firefighters worked to extinguish the blaze, the chp said. crews battle \"eagle's nest\" brush fire near warner springs updated: a brush fire that scorched some 4,000 acres on the los coyotes indian reservation was about 30 percent contained saturday, according to cal fire. escondido police arrest man accused of taking pictures up women's skirts updated: a 41-year-old man was jailed saturday for allegedly using a camera in his cell phone to take images from under the skirts of women at a escondido store, police said. biker rally in jamul is peaceful, authorities still in area updated: the san diego sheriff's department says that a biker rally in the east county is a peaceful one. escondido curfew sweep ends with 16 juveniles arrested updated: escondido police arrested 16 juveniles for curfew violations, including two 15-year-old girls who found in the company of a register sex offender, a lieutenant said saturday. woman robs el cajon bank, said she had gun updated: police and the fbi sought the public's help today in catching a woman who robbed a bank in el cajon. man dead after motorcycle drifts off sr 94 and strikes power pole updated: an autopsy was pending saturday on a 43-year-old san diego man killed when the motorcycle he was riding drifted off state route 94 and struck a power pole, the california highway patrol said saturday. 1 found with large amount of drugs during imperial beach warrant sweep updated: sheriff's deputies in imperial beach arrested 15 people in a warrant sweep, including a 50-year-old man found with about $35,000 worth of pot growing at his home, sheriff's deputies said saturday. stars come out to celebrate third day of comic-con"}, {"articleID": "2019082212_00284456_W", "names": {"Danny Rose": ["Q5220782", "Q5220783", "Q5220785", "Q83498"]}, "date": "2019-08-22", "url": "http://www.gazetteandherald.co.uk/sport/national/17854456.nkoudou-leaves-spurs-besiktas/", "content": "Nkoudou leaves Spurs for Besiktas By Press Association 2019 Georges-Kevin Nkoudou has left Spurs 0 comment Georges-Kevin Nkoudou has left Tottenham to join Turkish club Besiktas for an undisclosed fee. The 24-year-old has endured a difficult time at Spurs since joining from Marseille in 2016 and his exit has been a long time coming. He played just 27 matches and never made a Premier League start for Spurs, spending time on loan with Burnley and Monaco. We have reached agreement with Turkish Super Lig side @ Besiktas for the transfer of @ gknkoudou. All the best for the future, GK!?? #THFC ⚪ ️ #COYS pic.twitter.com/nc2ndgNofO--Tottenham Hotspur (@ SpursOfficial) August 22, 2019 He posted on Twitter: \"It's now time for me to leave this great club that is Tottenham.\" Even though our story wasn't the one I hoped for when I arrived here, I still feel like I learned a lot, as a player and as a man. \"I've always tried to give my all for this team and this club, and wish all my team-mates and the staff the very best for this season and the followings.\" Also a big thanks to the fans who had my back and supported me through the times. \"Dear Spurs fans, It's now time for me to leave this great club that is Tottenham. . pic.twitter.com/RD9Zl0AWF9--GK NKoudou (@ gknkoudou) August 22, 2019 Spurs spent £ 11million bringing him to the club three years ago, but it was a move that never worked out and they have spent the past three transfer windows trying to get him off the wage bill.\" We have reached agreement with Turkish Super Lig side Besiktas for the transfer of Georges-Kevin Nkoudou, \"Spurs said in a statement.\" We wish \"GK' all the best for the future.\" His move to Besiktas is not expected to be the only exit before the end of the European transfer window. Midfielder Victor Wanyama is reportedly close to joining Belgian side Club Brugge, having fallen down the pecking order at Spurs. Victor Wanyama could be on his way out of Spurs (John Walton/PA) While boss Mauricio Pochettino will sanction those two exits, he will be holding his breath over other members of his squad before the September 2 deadline. The likes of Christian Eriksen, Toby Alderweireld, Jan Vertonghen and <mark>Danny Rose</mark> could all attract interest before the end of the window, a situation Pochettino has said could cause \"many problems\" for his squad. 0 comment"}]