[{"articleID": "2010071507_00161713_W", "names": {"Neil Patel": ["Q6989128", "Q6989132"]}, "date": "2010-07-14", "url": "http://dailycaller.com/2010/07/14/the-daily-caller-acquires-keitholbermann-com-2/", "content": "send a tip:::: width: 400, height: 330' class = \"lightview' style =\" width:70 px;'> the daily caller acquires keitholbermann.com olbermann displays his degree from the very prestigious cornell ag school. (msnbc) keith olbermann, host of the msnbc show, \"countdown with keith olbermann,\" talks about his show at the summer television critics association press tour, saturday, july 22, 2006, in pasadena, calif. (ap photo/reed saxon) the daily caller, one of the fastest-growing online media properties, announced today its acquisition of keitholbermann.com, expanding the company's global reach into a new segment of the online political market. for more than six months the daily caller has been a recognized market leader in we watch, because we're paid to, \"appears on the daily caller's website each friday .\" we plan to make the daily caller the one-stop online shop for keith olbermann commentary, \"said editor-in-chief tucker carlson .\" we will be the keith olbermann superstore. \"\"this is part of our long-term growth strategy,\" added publisher and ceo <mark>neil patel</mark>. \"our future acquisition targets include several other annoying cable news commentators .\" olbermann, the host of a low-rated nightly show on msnbc, attacked the daily caller last week on twitter. \"daily caller has never known what daily caller is talking about,\" he wrote. the former espn sportscaster is no stranger to controversy. right-wing personality and cornell alumnus ann coulter accused olbermann, who also claims to be a cornell graduate, of never having graduated from the ivy league institution. \"he always forgets to mention that he went to the school that offers classes in milking and bovine management,\" wrote coulter in a 2009 column."}, {"articleID": "2013022022_00036337_W", "names": {"Jack Cooley": ["Q21546487", "Q6111803"], "Tom Knight": ["Q7816491", "Q7816493", "Q7816496"], "James Robinson": ["Q1635374", "Q16875103", "Q19325049", "Q21176869", "Q25415496", "Q28528705", "Q358970", "Q42290790", "Q6142281", "Q6142283", "Q6142285", "Q6142289", "Q6142294", "Q6142298"]}, "date": "2013-02-20", "url": "http://NotreDame.rivals.com/content.asp?CID=1474818", "content": "the pittsburgh students line one end zone, the entire length of the court on one side, and most of the other end zone. the band is loud, the crowd is enthusiastic, and, perhaps more than anything, the panthers are accustomed to winning there. in the previous 199 games at the petersen events center, the pittsburgh had won 178 and lost 21. although their home invincibility had wavered since last season, a game against the irish in the petersen events center looked to be just what the panthers needed. pittsburgh was returning home from a double-digit loss at marquette saturday. the panthers were looking forward to some home cooking against an irish team that was blown out by 17 points at providence. two years ago, notre dame came into petersen events center and recorded a 56-51 victory. monday night, for the first 14 minutes of the game, it looked as if the irish wouldn't reach double figures by halftime. then, over the final 27:08, the irish out-scored pittsburgh, 48-23, and out-rebounded the panthers, 40-25, for the game. \"we are a mature team,\" said jerian grant, who missed all seven field-goal attempts in the first half, but converted 4-of-8 in the second half - including three three-pointers - in notre dame's 51-42 victory. \"we moved on from the providence game. in the big east, once you take a loss, you have to bounce back. i think we did that pretty well tonight .\" notre dame missed its first 12 shots and 17 of its first 18 to fall behind 19-3 with 7:08 left in the first half after tray woodall converted two free throws as a result of a mike brey technical. brey was willing to try anything, including irrationality, during the second-to-last tv timeout of the first half. \"i didn't talk to (the team) much because i was a raving lunatic through most of the timeout after the technical,\" brey said. but the impact of brey's emotion was not lost on the players. \"we just knew coach had our back,\" grant said. \"we always knew that he knew we had a chance. down 19-3, we still could play defense and get back in the game .\" the panthers would score just three more points the rest of the half, and then a mere 20 in the second half, which was just one more point than notre dame scored during it's star-crossed first half. \"the one thing i kept telling them was,\" look, we are defending pretty well. just hang in there. we're only giving them one shot. we're going to get a spurt here,' \"brey said. the irish needed a jump-start offensively, and pat connaughton provided it. back-to-back threes within 31 seconds of one another suddenly made it a 19-9 game .\" once pat knocked in those two threes, we knew we were going to be able to get back in this game, \"said <mark>jack cooley</mark>, who finished with 13 points and nine rebounds .\" it was late in the half and they only had 19. we were 1-for-18 and that's just dismal shooting. we weren't going to keep shooting that poorly. we knew we had a run in us. \"the atmosphere in the petersen events center began to shift. with each panther miss - they were just 8-of-23 (.348) from the field in the first half themselves - the angst in the home crowd's moans became evident .\" i was just trying to keep our guys fired up because that felt like we tied it quite frankly, \"said brey of his emotion following connaughton's rapid-fire three-pointers to pull the irish to within 10 .\" the climate changed in the building. the vibe changed. our body language changed, and we were able to get a few things offensively that kind of set a tone for us in the second half to have some offensive confidence. \"the irish would take the lead at the 14:41 mark of the second half when a three-point attempt by grant from the left of the circle hit the front of the rim and then slid through the rim for a 29-28 notre dame lead. pittsburgh would regain the lead moments later. but when eric atkins scored on a drive to the bucket with 10:53 left, the irish had the lead for good .\" you just keep playing, \"said atkins of notre dame's 1-of-18 shooting start .\" we were getting some good looks. we missed some easy lay-ups. we just kept saying that we've got to keep guarding them. we just really started to buckle down. i think our defense gave us confidence. \"the more the irish struggled offensively in the first half, the better their defense on the panthers .? pittsburgh's shooting in the second half didn't improve. in fact, they duplicated their 8-of-23 shooting in the second half while the irish shot a sizzling 12-of-20 (.600), including 4-of-6 from three-point range. three were by grant .\" once i hit that three, my confidence was back and the team was really hyped because we finally got a lead, \"grant said .? atkins' driving lay-up put the irish up, 33-32. <mark>tom knight</mark> hit a 17-foot jumper from the corner. after <mark>james robinson</mark> connected on a jump shot, the irish would score the next eight points on a three-pointer by grant, a <mark>cooley</mark> basket with an assist from grant, and another three-pointer by grant at the 4:46 mark that suddenly gave the irish a nine-point bulge .\" we got some stuff in transition, \"brey said .\" once we got a couple in transition, you got a deep breath. and then jerian was really able to get off ball screens and do stuff. \"jerian and eric, after the first 10 minutes, were fabulous. in the second half, they controlled the tempo. then in the last seven minutes we were burning and getting great stuff at the end of the clock .\" the fact that the panthers missed all eight of their three-point attempts was no coincidence. beyond woodall and lamar patterson, the panthers don't have consistent outside firepower, and woodall missed all four of his attempts and patterson didn't attempt one. \"we did a good job scouting them, knowing who we could help off of,\" atkins said. \"i always had the guy that wasn't the best three-point shooter, so i could dig around a little bit. i stayed in the lane when woodall would get in there. we never left woodall or patterson, but everybody else (we could), and we could really pack the lane in and make it tough for their bigs to get an easy look .\" it was really hard for them to score after they got to 19, and that really gave us confidence to get on a run. \"<mark>cooley</mark> said the irish wiped the slate clean after the loss to providence .\" once you lose the first one, there's nothing you can do but turn to the second one, \"<mark>cooley</mark> philosophized .\" to handle it the way we did and with that much adversity is huge. \"one shot at a time, one possession at a time, one victory snatched from the jaws of defeat."}, {"articleID": "2016092517_00968798_W", "names": {"Chris Pratt": ["Q503706", "Q5107796"], "Clint Eastwood": ["Q2979323", "Q43203"]}, "date": "2016-09-25", "url": "http://www.kutv.com:80/news/entertainment/the-magnificent-seven-rides-again-storks-struggles-to-get-off-the-ground", "content": "\"The Magnificent Seven' rides again,\" Storks' struggles to get off the ground by Ryan Painter Denzel Washington stars in Metro-Goldwyn-Mayer Pictures and Columbia Pictures' THE MAGNIFICENT SEVEN. AA Weekend Box Office September 25, 2016 () \"' s\" reign atop the box office came to a close as Antoine Fuqua's reimagining of 1960's \"\"rose to the top with an opening weekend of $35 million. Some projections had the film coming in at over $40 million. Considering the film's $90 million budget, there is still a great distance for these cowboys to cover before the film will turn a profit. It will be interesting to see how the film does overseas where the star power of the cast, which features Denzel Washington, <mark>Chris Pratt</mark>, Peter Sarsgaard and Lee Byung-hun, is likely to have a slightly stronger impact. It might not be a massive hit, but\" The Magnificent Seven \"will likely turn a profit and that's not something that many contemporary westerns can claim. KUTV Sully The Magnificent Seven In second place is\" , \"the new animated adventure from Warner Bros., with $21.8 million. That's decidedly less than the $30 million that the film was expected to bring in. Still, the film looks strong internationally where it has already earned $18 million. I expect\" Storks \"to have legs, particularly because next week's\" Miss Peregrine's Home for Peculiar Children \"appears to be targeting an older audience. Storks In its third weekend\" Sully \"added $13.8 million. Tom Hanks and <mark>Clint Eastwood</mark>'s film has now earned $92 million domestically. Add in early international numbers and the film has already earned more than $125 million. Hank's\" Bridge of Spies \"only managed $72 million domestically with a worldwide total of just $165 million after 21 weeks of release .\" Sully \"will likely blow past those numbers .\" \"fell 47% for $4.5 million in its second weekend. Domestic totals now sit at a disappointing $16.4 million. However, the international numbers are extremely robust and push the worldwide total above $80 million. Considering the film cost only $35 million, there's a good chance that the film has already turned a modest profit. Suddenly a fourth film seems incredibly likely. Bridget Jones's Baby Oliver Stone's\" \"brought in $4.1 million. That pushes the biopic's earnings to just over $15 million. I've yet to see any international numbers, but if this film is going to break even its going to need to perform well overseas. Snowden\" \"brought in an additional $3.9 million for a domestic total of $16 million. That's a disappointing total for the filmmakers, but the film will still make money. Just not the kind of money that Lionsgate was banking on. Blair Witch close"}, {"articleID": "2009102916_00104574_W", "names": {"Julian Mcmahon": ["Q19667062", "Q4223"], "Beverly Hills": ["Q4899544", "Q923258"], "Robbie Williams": ["Q2156159", "Q2156168", "Q47875", "Q7341022", "Q7341023", "Q7341027"], "Louise Pedersen": ["Q6688901", "Q6688903"], "Randy Jackson": ["Q337521", "Q349461", "Q7292252", "Q7292253", "Q7292255", "Q7292256"], "Rajendra Prasad": ["Q30077615", "Q5516315"], "Michelle Williams": ["Q156796", "Q229153", "Q23893381"], "Joe Francis": ["Q1059796", "Q30731361", "Q6209899", "Q6209901"], "Cindy Crawford": ["Q199801", "Q262856"], "Brad Pitt": ["Q35332", "Q373912"], "Bradley Cooper": ["Q205707", "Q4954898"], "Kate Hudson": ["Q169946", "Q6375550"]}, "date": "2009-10-29", "url": "http://blog.taragana.com/e/2009/10/29/i-stripped-to-pay-off-debts-danii-minogue-54591/", "content": "london - australian singer dannii minogue, who is judge on the reality show \"x factor\" , says her inability to pay off her debts forced her to pose naked for adult magazine playboy. the singer, who is the sibling of kylie minogue, apparently owed over $240,000 and couldn't even afford her rent after she split from husband <mark>julian mcmahon</mark> in 1995. so, she decided to go against her parents' wish and bared all for the australian edition of the men's magazine, reports thesun.co.uk. \"my parents didn't want me to do it. my dad was saying,\" doing this is forever - you can never, ever change it'. kylie knew why i was doing it. i could have asked her for the money, but it wasn't in my nature. i never wanted to admit the trouble i was in. i should have been looking at my finances, \"danii was quoted as saying. the 38-year-old says she doesn't regret having done the photoshoot. october 21st, 2009 london - aussie singer dannii minogue has revealed that she and x factor co-judge cheryl cole do not share a close relationship. minogue, 38, revealed to ok! magazine that she and 26-year-old cole never discuss personal issues. october 13th, 2009 london - australian pop princess kylie minogue has revealed she loves living in america because no one recognises her. the 41-year-old who has had a globally successful career spanning over two decades claims she can walk around incognito in the us and not get hassled by fans, reports thelist.co.uk. october 13th, 2009 london - australian pop star kylie minogue says her us tour has been an\" enjoyable \"experience as she has been able to go out publicly without attracting too much attention .\" i can keep a much lower profile, which is enjoyable, \"the daily express quoted the 41-year-old star as saying.and then if someone's looking at me, i'm like:\" why are they staring at me? what's wrong? have i got something on my face?' \"and minouge has certainly been a crowd puller with a lot of fans and even kids coming to her gigs dressed up like her. more images kylie minogue leaves mr chow restaurant in <mark>beverly hills</mark> los angeles.more imagesmore images more images more images more images more images more images october 5th, 2009 london - aussie singer dannii minogue has revealed that for the first time in her life, she feels like she is going to explode with love, all because of former british rugby league star-turned-model, kris smith. minogue, 37, who has been more relaxed, giggly, and confident on the x factor, revealed to fabulous in her hotel room in the centre of sydney, she's literally bursting with excitement. october 3rd, 2009 london - aussie pop star kylie minogue is on a week-long meditation retreat with her boyfriend andres velencoso to get ready for her upcoming us tour. minogue will start the tour with a show in san francisco. september 2nd, 2009 london - x-factor judge dannii minogue has invited sexy vampire robert pattinson onto the show. pattinson is said to be a huge fan of the show, and after hearing this, minogue offered him an access-all-areas pass to the first round of the live auditions. august 23rd, 2009 london - aussie singer dannii minogue has asked <mark>robbie williams</mark> to get in shape before he sings on\" the x factor'. minogue, who's a judge on the show, insists she's a big fan of \"take that' band member but is looking a bit too tubby to be at his best. august 11th, 2009 london - x factor judge dannii minogue will not be using botox anymore, for she prefers facial expression on the show now.he\" what do you love now? \"singer had been using botox for some time and was famous for her pumped-up face. the sun quoted dannii as confessing to grazia magazine:\" while i have been open about doing it before - i'm not doing it now. \"she mistakenly revealed that she saw that people called her\" plastic \"and\" all botox \". kylie minogue fumes after toyboy lover takes her pictures amid argument london - kylie minogue was reportedly left fuming after her toyboy lover kept taking her pictures, while the two argued outside a new york nightclub. the singer was said to have a huge fight with spanish lover model andres velencoso that allegedly resulted in the 41-year-old star slapping her 31-year-old beau. july 17th, 2009 london - aussie pop princess kylie minogue is said to have had a huge fight with her spanish lover model andres velencoso. minogue, 41, is said to have also shocked an onlooker at new york's trendy b bar with her public outburst. june 4th, 2009 london - aussie singer kylie minogue says that no-one is to blame for britain's got talent star susan boyle's breakdown. speaking at the glamour magazine women of the year awards in london, the pop princess said she was suspicious of press reports on the singer's condition. june 1st, 2009 london - aussie pop princess kylie minogue and her model boyfriend andres velencoso are set to sign a contract on a beachside villa in spain, it has emerged. minogue, 41, and velencoso are said to be in final negotiations for a property in the medieval village on the costa brava, where the model had grown up. may 26th, 2009 london - australian pop singer kylie minogue has revealed that she is planning to marry boyfriend model andres velencoso who reportedly proposed to her secretly. the couple has been inseparable since meeting at a party in paris, france last year. fashion duccnguyen before print | <mark>louise pedersen</mark>: joanna for fashion gone rogue, 2009. | permalink | comment. . mockshop armani opens new store. versace sheds 350 jobs. welcome to the diverse world of designer fashion. flyyankee live for your passion and one day it will become the fashion .\" the passion zone \"(firefox) heatherlikesyou naomi campbell searches for next top model and fashion photographer: naomi campbell is following tyra bank'. . imtheq this week's five finds in eco fashion--pass it on! bwhite325 christian fashion wear catches attention of major news station. take a look! luhcoelho quanta gente fashion no twitter. quante gente brega no twitter. quante gente sem noo no twitter. jeszielozada where to go tomorrow? ascend fashion show? or dolce halloween ball? stylishfish our fav look from ruby rouge fashion showcase last thursday night! more pics on our...jewelryshoppers * endless shoes and handbags * save up to $150 plus free overnight shipping at #womens #shoes #handbags #style #fashion jennymoose bored in fashion: / excited for this weekend: d 2ndlifefanatic roxy naimarc's second life: 50% off sale!!!!: a hunger for second life's variety of fashion, skins, & am. . niaomi24 local talent in focus at chicago's fashion week movies org_kay_g and #truthis people in society is brain wash with too much shit dey see on t.vee. real life shit leave that for the niggas n the movies! yourwownews movies n hacks - full fast free downloads: warcraft iii reign of...:\" it's very exciting to re. . yasukosono loved the movie called imaginarium of dr parnassus! i love imaginary movies. they're so adorable. goodnight xx nerdbastards what are the best movies to watch while high? yuliarifanda like this!! star movies kan syg??? hehe. . rt @ athillaherald: sweet home alabama tetap jd film teromantis sejauh aku hidup: d aaronlafferty 7 \"new moon\" midnight shows already sold out at celebration! mt. pleasant fans can also see \"twilight\" before #movies mcrozy d @ whitestonemp patience is a virtue. all prayers are in the works. prayers are like movies they take time to materialize. bubblepoppa just finished watching \"law-abiding citizen\" (dir. bi f. gary gray) and i want 2 go c it again! make sure u go 2 the movies c this #film sportsfreak0320 still watching movies even though its late ha peachbuzz i saw the latest movie \"final destination\" in 3d and it was awesome and i also bought the latest movie of \"grudge\" pretty good movies ay mrgriffin_711 not a scary movie lol rt @ niecec_baby: #truthis i have nightmares wen i watch scary movies.i didnt sleep 4 a wk wen i watchd knowing lol jamesforney it never fails movies make me tired...as i yawn movies sohear rt @ tceurope voddler, the spotify-for-movies, partners with paramount and disney> by me (yay!) meettheboss streaming hd movies - good or bad #movies meettheboss streaming hd movies - good or bad #movies perfectdisk could jacksons this is it win an oscar scottneumyer scorsese picks the 11 scariest horror movies of all time! goblog suborhan-multimedia blog | movie review | popular starts news empoprises fundraiser to benefit movies at the fox alexiswalker watching \"paranormal activity\" with <mark>randy jackson</mark> alexiswalker bizarrely funny videos: omg we got a view! alexiswalker paul greengrass' green zone looks absolutely mindblowing executivehm streaming hd movies - good or bad #movies vimoh kerala cafe is a worthwhile experiment vimoh ranbir to katrina's rescue in ajab prem...cbryanjones the top 10 greatest villain costumes in sci-fi movies alltheinfo where should i go to watch free full length movies online - watch full length movies online alltheinfo where should i go to watch free full length movies online alltheinfo alltheinfo where should i go to watch free full length movies online intellibitz appula appa rao: title: appula apparaostarring: <mark>rajendra prasad</mark> & shobanacategory. . #telugu #movies intellibitz priyamaina anjali wallpapers: #telugu #movie wallpapers - download latest #tollywood. . showbiz note4567 friendfeed/myseo: david beckham's super beard - china daily myseo david beckham's super beard - china daily mattporterwd #ukceleb destiny's child star in car accident: destiny's child singer <mark>michelle williams</mark> says that she. . mattporterwd #ukceleb <mark>joe francis</mark> escapes assault charges: adult filmmaker <mark>joe francis</mark> escapes charges relating to. . mattporterwd #ukceleb <mark>crawford</mark>:' i look too healthy to model': <mark>cindy crawford</mark> says that she never would have made. . modelvita angelina jolie soll vor <mark>brad pitt</mark> offensiv lesbe angebaggert haben - europolitan #model #news urwebinfonews jay-z's video game rage twit4luv \"once' again: the swell season sings of love, loss petrbuben\" once' again: the swell season sings of love, loss - cnn nivedhaak perpignan silence showbiz stade: docmagi news update: <mark>bradley cooper</mark> on \"crazy' diet - showbiz spy musicrockstars mariah carey \\'s hubby to dress as ike turner for halloween - showbiz spy interesting choice! olovia567 <mark>kate hudson</mark>'s sex talk - china daily dietdiarytwt <mark>bradley cooper</mark> on\" crazy' diet - showbiz spy ipt \"once' again: the swell season sings of love, loss happyweaver2009 top earning dead celebrities list revealed | sky showbiz news ..."}, {"articleID": "2016080918_00234376_W", "names": {"Sean Lowe": ["Q17523875", "Q7441167"], "Chad Johnson": ["Q39072651", "Q471833", "Q5066274", "Q5066276"], "Michelle Collins": ["Q457012", "Q57439506", "Q6836971", "Q6836972"]}, "date": "2016-08-09", "url": "http://cartermatt.com/216689/bachelor-paradise-3-spoilers-one-potential-nick-viall-amanda-stanton-josh-murray-tease/", "content": "\"Bachelor in Paradise 3' spoilers: One potential Nick Viall--Amanda Stanton--Josh Murray tease August 9, 2016 by Leave a Comment The third season of\" Bachelor in Paradise \"is off to a chaotic start, and it could open become even more so as it gets further and further into this season. For more of episode 2, we saw the main point of contention be the arrival of Josh Murray, where he in turn ended up taking Amanda Stanton on a date. This upset Nick Viall greatly, given that he was already starting up a relationship with her. He now feels like he's lost her, and he has to figure out what happened. What could he do to ensure that he figures all of this out? The synopsis below offers up a few clues--it's not confirmed that it is about Nick, but at the same time there aren't many other candidates at present it could be in reference to unless someone starts to date Carly Waddell in the near future after she spent time with Evan Bass:\" When one bachelor knows he is going home since he was recently dumped, he plants a fake date card addressed to him so he can tell his original love interest how he feels. The only glitch is the beauty is very much taken and is making out with her hunky guy when the desperate guy approaches. What will the notorious bachelor do when his woman is stolen from him mid-makeout? Will the underdog prevail? \"Ultimately, we think the words\" notorious bachelor \"are the biggest clue that this is Josh. What else makes sense? If you want to get some other news when it comes to\" Bachelor in Paradise, \"or in particular its\" After Paradise \"show following it up? Then be sure to head over to the link here! Also, sign up over here to secure some other TV news on all we cover, sent right over to you via our official CarterMatt Newsletter. (Photo: ABC .) Filed Under: Reality TV Tagged With: Bachelor in Paradise Related Post\" After Paradise' spoilers: <mark>Sean Lowe</mark>, <mark>Chad Johnson</mark>, <mark>Michelle Collins</mark>, more appear in premiere Follow Us Follow @ MattCarterMedia Follow @ DangerGirl101"}, {"articleID": "2020011712_00047684_W", "names": {"Peter Evans": ["Q17523824", "Q2074761", "Q2534758", "Q39089656", "Q52888475", "Q57986136", "Q7173890"]}, "date": "2020-01-17", "url": "https://www.energylivenews.com/2020/01/17/hinkley-point-b-hits-300twh-milestone/", "content": "Infrastructure Hinkley Point B hits 300TWh milestone This means the facility, which originally came online in 1976, now holds the UK record for generating more electricity than any other nuclear power station in the country Friday 17 January 2020 Image: jgolby / Shutterstock EDF's Hinkley Point B nuclear power station in Somerset has this week hit the milestone of generating 300TWh of low carbon electricity in its lifetime. This means the facility, which originally came online in 1976, now holds the UK record for generating more electricity than any other nuclear power station in the country. Its owner notes 300TWh of electricity is enough to power every home in the county for almost three years whilst avoiding the production of 105 million tonnes of greenhouse gases--this is equivalent to removing all cars from the UK's roads for one and a half years. The facility was the UK's twelfth operational commercial nuclear power station and currently employs more than 700 staff. <mark>Peter Evans</mark>, Hinkley Point B's Station Director, said: \"Achieving the 300TWh milestone is a fantastic achievement and really signifies the huge contribution Hinkley Point B power station has made to low carbon generation in the UK over the years .\" "}, {"articleID": "2012020820_00018789_W", "names": {"Bob Parker": ["Q20054077", "Q4933591", "Q4933593", "Q4933595"]}, "date": "2012-02-08", "url": "http://odt.co.nz/news/politics/197160/brownlee-sorry-bob-parker-clown-remark", "content": "gerry brownlee canterbury earthquake recovery minister gerry brownlee has apologised for an astounding shot at christchurch mayor <mark>bob parker</mark>, after calling him a \"clown\". his comments, reported in yesterday's christchurch mail, were a reaction to the mayor's statement last week that cera could force the city to increase rates or sell assets to pay for the earthquake recovery. mr brownlee told the mail he was furious at the mayor's comments and was a \"clown\" for making the remark. he dismissed mr <mark>parker</mark>'s assertion, saying the cera act specifically forbids such a move. section 48, clause 3 of the act states the minister \"must not direct any council to (a) set a rate under section 23 of the local government (rating) act 2003\". mr brownlee described mr <mark>parker</mark>'s comments as an \"outrageous abdication\" of his responsibilities and he was sick and tired of the scrapping between city councillors. he was not surprised ratepayers were fed up with the way christchurch was being run. mr brownlee told the press last night the \"clown\" remark was \"probably over the top\" , but said he was frustrated with mr <mark>parker</mark> and the council's problems. the mayor is in china and has not responded. this morning he told radio new zealand the \"clown\" comment was taken out of context. \"in the context that i made that comment, i was making another comment about the general performance of the council over the most difficult period that they had a couple of weeks ago .\" i think that they are under considerable pressure to deliver all sorts of services, but it is plain and obvious that it is going to be difficult for them to do so. they do have to work with us. that doesn't mean that they just stump up and put a bill in front of us - they have to work with us. \"mr brownlee revealed the council asked him to exempt the council-owned orion from monopoly controls, so power bills could be increased under earthquake emergency laws. he said he has never said rates must be increased or assets sold to meet council costs .\" the government is spending a lot of money we've been trying our best to move things on, it's undeniable we've had a christchurch city council that has not performed as well as it could - so my comments came at the time we were into reasonably significant negotiations with them over how we were going to help with the huge call that they are going to have on their resources going forward. \"mr brownlee later apologised for the\" clown \"comment on newstalk zb. - paul harper and newstalk zb"}, {"articleID": "2017060517_00206227_W", "names": {"Chris Weller": ["Q5108443", "Q54932125"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-06-05", "url": "http://www.businessinsider.in/Year-round-school-is-booming-but-its-benefits-are-over-hyped/articleshow/59005566.cms#commentHash", "content": "Year-round school is booming - but its benefits are over-hyped <mark>Chris Weller</mark> Jun 5, 2017, 10.26 PM Facebook Linkedin WhatsApp Twitter Google + Reddit Continue reading Anyone who's spent at least two years in school knows how quickly the mental cobwebs can pile up over the summer. In June you're a test-ready warrior. By September, you might feel like a foggy-headed dunce. Sociologists refer to this decline as the summer setback, and it's widely cited as one of the most corrosive factors in the achievement gap between low - and high-income students. While low-income kids play games and watch cartoons in the summer, high-income kids go to camp, visit museums, and continue learning. Over time, those incremental advantages can spell the difference between who gets placed into elite colleges and high-paying jobs and who drops out. Some parents and schools have tried to help kids overcome the summer setback with enrichment classes. But others have taken a more radical approach, calling instead for a complete overhaul of the school calendar so that kids attend school year-round. Between 1985 and 2011, the number of US schools with year-round learning increased ninefold, bringing the current total to just shy of 4,000. According to recent research, however, the trend might be misguided. Year-round school doesn't help with the effects of inequality or erase the summer setback all kids tend to experience. In the worst cases, it actually hurts kids' education. What people get wrong about year-round school The biggest misconception with year-round school is that kids spend more time in the classroom. Parents hear \"no summer break\" and immediately think kids are getting an extra three months of school. That's not necessarily true. In most cases, kids who attend year-round schools learn for six weeks at a time before taking three-week breaks. Their \"summer break\" lasts only a month. They still learn for 180 days, just like traditional schools. Paul von Hippel, an expert on educational inequality at the University of Texas at Austin, argues that kids in schools using either calendar models - whether they're from low-income, middle-income, or high-income families - end up performing roughly the same on standardized tests. There's no added drawback to summer vacation that year-round school protects kids from, he tells Business Insider. A three-week break might be shorter than a three-month break, but compared to how long kids are in school before the break, the setbacks add up equally. \"It is a bit like the race between tortoise and hare,\" von Hippel wrote in a recent review of the research on year-round school, \"except that, in this case, the race ends in a tie .\" Still, people like to blame summer vacation because they see kids spending a huge chunk of time away from a classroom and think that's doing the most damage. Often, the real culprit is economic in nature. \"The differences you see between upper-middle class families and poor families aren't differences that go away if you rearrange the school calendar,\" von Hippel says. \"The summer provides a window into what those differences are like, but those differences exist every weekend. Whenever children are out of school, their environments are less equal .\" Richard Kahlenberg, senior fellow at The Century Foundation, agrees that rearranging the time isn't nearly as important as making smarter use of it. \"It doesn't get at that issue of making sure that low-income students, when they're not in school, have lots of opportunities for enrichment,\" he tells Business Insider. Too many kids, too little time Perceived increases in achievement aren't the only reason a school district might push to switch. One of the few benefits of a year-round system is that it relieves the burdens of overcrowding. In Wake County, North Carolina, for example, attendance rose by nearly two-thirds between 1995 and 2007. As a result, 37 of the county's 177 schools now rely on a \"multi-track\" model in which students are split into four groups. Each group is staggered so while one group is on break, the others are in session, and the building doesn't sit empty for three months. \"It really is true that the traditional calendar is somewhat inefficient,\" von Hippel says. Multi-track schools might have to pay more during the summer to keep the lights and A/C on, but that's much cheaper than building a brand-new school. In any case, the benefit that gets passed on to students is still marginal. The lessons from Wake County don't translate to schools where overcrowding isn't an issue. And research shows the switch can frustrate parents who have kids in schools using both schedules. Year-round school can even cause property values to decline if families and teachers relocate to keep their summers. As von Hippel writes, \"Although surveys can be informative, behaviors show teachers and parents voting with their feet. Actions speak louder than words .\" How to solve the right problems If there's any hope for year-round school it's that multiple three-week breaks might give teachers an easier time to teach additional classes than a full summer, when kids have fully checked out. Neither Kahlenberg nor von Hippel could say for sure, however, because there isn't any research on it. What the research does suggest is schools should do whatever they can to close the gaps created by poverty. They can hold field trips to museums, aquariums, and national parks during the summer so kids don't equate enrichment with summer school. And during the year they can focus more on personalized learning, which some schools have used to great success. If governments want to stop the achievement gap from widening (or close it altogether), they can offer greater access to pre-K. Or, if they want to go by the latest research, they could just give poor families more money, which may raise achievement even more than early education. Whatever the solution, implying that the three-month period between June and September is what leads some to Harvard and others to hard times ignores a much bigger problem. Schools need level playing fields, not cleverly designed calendars. Please enable Javascript to watch this video Facebook Linkedin WhatsApp Twitter Google + Reddit Follow Business Insider on facebook Like twitter Follow gplus Follow Next Story LIVE: Apple's biggest conference of the year is here - get ready for new products More from this author Hong Kong's 20-square-foot \"coffin homes' reveal t.. . IBM launched a high school to churn out workers fo...Japan's demographic time bomb is a bad omen for th...Japanese family life is falling apart - and the re...Mark Zuckerberg says basic income is worth explori...Related Stories Shree Sai Spaces Creations and Wasankar Wealth man...Four points about higher education in India Here's where <mark>Donald Trump</mark> stands on education 4 ways Finland beats America on education Online Education: Young Guns Will Propel Market Ex...\"src =\" http: //www.businessinsider.in/photo/17981456.cms \"> Beginning of a revolution in Education through Cou...How to create world-class higher education centres...Here are the options for bettering higher educatio...More: SAI Education Promoted Stories A Solution That Puts Snoring to Bed My Snoring Solution Cable Companies Furious Over This New Device (Selling Out. . TV Frog End Your Nightly Snoring Nightmare With This Simple Solution My Snoring Solution Now You Can Track Your Car Using Your Smartphone Smart Device Trends If you own a computer you must try this game! Throne: Free Online Game The Ultimate Way to Get Cheap Hotel Rooms tripsinsider.com"}, {"articleID": "2018102717_00249692_W", "names": {"Peter Casey": ["Q15040081", "Q16188918", "Q41787474"]}, "date": "2018-10-27", "url": "http://www.thenorthernecho.co.uk/news/national/17085646.casey-kidding-himself-over-election-votes-says-traveller/", "content": "<mark>Peter Casey</mark> 0 comments A Traveller woman has said that <mark>Peter Casey</mark> is \"kidding himself\" after he rejected claims his support was bolstered by populist views. Mr <mark>Casey</mark>, who was projected to come runner-up in the Irish presidential race after Michael D Higgins, claimed on Saturday morning that people voted for him because he spoke for \"middle Ireland\" who were working and \"paying the bills\". Mr <mark>Casey</mark> previously made comments that Travellers should not be recognised as an ethnic minority, because they are \"basically people camping in someone else's land\" , and the group are \"not paying their fair share of taxes in society\". He had come under increased scrutiny in presidential debates and had some of his comments labelled \"populist\" and \"racist\" by other candidates. He was also compared to former Ukip leader Nigel Farage. Kathleen Lawrence, who works at Traveller outreach programme Pavee Point, said that Mr <mark>Casey</mark> had used an already disenfranchised community to bolster his lead in the polls. \"The fact that he garnered 20% of votes is disappointing but it's not surprising given his comments,\" she said. \"I think now we need to look at the fact that 20% bought into his message .\" I think we need to target those people to help them and change the way politics is being done. \"People are drained, working full time and barely scraping by and that's awful, but the fact <mark>Peter Casey</mark> used an ethnic minority to make up the blame, that is disturbing .\" I think what needs to happen is we need to tap into why people voted for him, we can't let this pass by. \"We need to put protocols in place that would prevent people like <mark>Peter Casey</mark> and any other potential candidate at all levels, we need anti-racism protocols in place that they have to sign up to, to make sure that they don't use minorities to further their own political agenda .\" Ms Lawrence said the feeling in her family was one of fear after Mr <mark>Casey</mark> said he had received thousands of letters of support after making his views on Travellers known. \"I can't speak for all Travellers, but amongst my own family there was a lot of fear around what would happen if he got in,\" she said. \"We're already marginalised, we're already facing extreme discrimination and extensive cuts, people were feeling like,\" Well, what more can we handle?' \"I don't know what he stood for, all we know is he spoke about Travellers and people on welfare for the last three weeks .\" A good portion of his votes came from his Traveller comments. \"I know he's trying to convince people that isn't the case, but he's really trying to kid himself .\" The reason he continued in the race was because he received emails of support after the comments, he said that himself. \"On Saturday, Archbishop of Cashel and Emly Kieran O’Reilly expressed concern over hurt caused by the public discussion during the election campaign .\" In recent weeks I was alarmed by some of the inflammatory language used during the public discourse which formed part of this election campaign, \"he said .\" Feedback that I have received from members of the Travelling community, and from those dependent on financial assistance from the state in order to survive, has confirmed my concerns. \"Ill-informed and inflammatory language has caused real hurt, humiliation and heartache. This offensive commentary was particularly virulent on social media. It has been particularly damaging to the Traveller community which has been endeavouring to grow and preserve its ethnic identity as part of our society .\" He asked that those who engage in projects around Traveller health and well-being redouble their efforts. 0 comments"}, {"articleID": "2016070705_00083543_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-07-07", "url": "http://vindy.com/news/2016/jul/07/gingrich-joins-trump-for-rally-near-cinc/", "content": "Gingrich joins <mark>Trump</mark> for rally near Cincinnati news @ vindy.com SHARONVILLE Presumptive Republican presidential nominee <mark>Donald Trump</mark> used a stop in southwestern Ohio Wednesday night to call Democrat Hillary Clinton \"crooked .\" But <mark>Trump</mark> had nice things to say about his grandchildren, Republican U.S. Sen. Rob Portman and golf legend [and Ohio native] Jack Nicklaus. He touted his policy proposals to boost U.S. trade, bolster the military and set the stage for job creation. And he reiterated his plans to clamp down on immigration, particularly from countries that harbor terrorists, and to build a wall along the U.S. border with Mexico. \"And every time they fight us on that wall, it gets 10 feet higher,\" the billionaire businessman said to cheers from the hundreds of supporters who packed a suburban Cincinnati convention center. He added later, \"I'm going to keep our country safe .\" <mark>Trump</mark> didn't break much new ground. His comments were similar to speeches he's offered elsewhere in Ohio--\"We have a rigged system,\" he said. \"We have a crooked system ....The politicians aren't listening .\" A group of protesters and Hillary Clinton supporters also held signs and spoke to reporters across the street of the venue before the doors opened, calling <mark>Trump</mark> a \"Job Creator in Mexico, China, India [and] Singapore .\" <mark>Trump</mark>'s visit came about a week after Clinton and Massachusetts Sen. Elizabeth Warren, a potential running mate, spoke in Cincinnati. <mark>Trump</mark> arrived in southwestern Ohio Wednesday with former U.S. House Speaker Newt Gingrich, whose name has been mentioned as a possible vice president on the Republican ticket. \"Newt has been my friend for a long time,\" <mark>Trump</mark> said. \"And I'm not saying anything...but I can tell you, in one form or another, Newt Gingrich is going to be involved with our government .\" And both slammed Clinton, a day after the head of the FBI recommended no criminal charges against the former secretary of state for her use of a separate server to send governmental emails, some of which were confidential. \"Say lie, lie, lie, lie, lie--dirty rotten liar,\" <mark>Trump</mark> said, recounting comments Clinton made in the past compared with the FBI's findings. \"When you look at her decisions, when you look at the fact that she has gotten such bad decision-making ability ....She has got bad judgment .\" Other stories of interest"}]