[{"articleID": "2014092502_00046218_W", "names": {"Frank Jackson": ["Q21621551", "Q5487508"]}, "date": "2014-09-25", "url": "http://newsnet5.com/news/local-news/oh-cuyahoga/spirit-airlines-to-begin-offering-service-at-cleveland-hopkins", "content": "Spirit Airlines announced Wednesday the discount carrier is coming to Cleveland. Spirit Airlines to begin offering service at Cleveland Hopkins CLEVELAND, Ohio - Spirit Airlines announced on Wednesday the discount carrier is coming to Cleveland Hopkins International Airport. \"That's right we're taking our talents to Cleveland,\" jokingly said Spirit Vice President of Network Planning Mark Kopczak. Kopczak says United Airline's decision to scale back operations at Hopkins opened the door for Spirit to come to the city offering travelers a no frills, low cost options to select cities. \"We're here not just because the Cleveland area is a great place to live and travel to and from, but also because air travel choices have dwindled here and fares have gone up,\" Kopczak told those on hand for the announcement. \"We're here to try and reverse that trend .\" The city of Cleveland is on board with the airline's arrival as well. Mayor <mark>Frank Jackson</mark> says the move will potentially bring in new traffic to the city from places like Dallas, Las Vegas and a handful of spots in Florida including Spirit's hub in Fort Lauderdale. \"Anytime you can make it inexpensive or cheaper for people to travel to some places and they make choices, maybe they'll pick Cleveland,\" <mark>Jackson</mark> said. Doug and Trudy Foster say they travel in and out of Hopkins International about four to five times a year and soon they'll have a few more choices when it comes time to buy those tickets. \"Competition,\" said Doug. \"That's what you're looking for is some competition too .\" Trudy Foster says she is anxious for a new player to join the field. \"We do love this airport. It's convenient for us and we do like, like you said having options. It's great,\" Trudy said. Spirit will launch service at Hopkins on Jan. 15 with daily nonstop flights to Tampa Bay, Orlando and Fort Myers. Dallas, Las Vegas, Fort Lauderdale, Los Angeles and Myrtle Beach will be added in the following months. The airline says tickets will go on sale on its website beginning Sept. 24."}, {"articleID": "2011113015_00076442_W", "names": {"Giovanni Petrucci": ["Q1110125", "Q3767927"]}, "date": "2011-11-30", "url": "http://reuters.com/article/2011/11/30/us-olympics-italy-rome-idUSTRE7AT1KG20111130?feedType=RSS&feedName=sportsNews", "content": "rome (reuters) - rome will press on with its bid to stage the 2020 olympic games despite italy's economic and political troubles, the country's olympic committee (coni) said on wednesday. \"rome's candidacy for 2020 is going ahead. the bid chairman mario pescante is doing an excellent job and we have faith in rome's prospects, although we are realistic,\" said coni president <mark>giovanni petrucci</mark> following a meeting. \"the plan of economic compatibility was presented yesterday to the government; we hope that the current economic climate will not have consequences for our candidacy .\" i anticipate that the olympic games will represent a chance for growth and development and therefore could represent an important instrument for overcoming the difficulties which the country is going through. \"doha, madrid, istanbul and tokyo have also said they will bid for the games. we welcome comments that advance the story through relevant opinion, anecdotes, links and data. if you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. views expressed in the comments do not represent those of reuters. for more information on our comment policy, see our flagship financial information platform incorporating reuters insider an ultra-low latency infrastructure for electronic trading and data distribution a connected approach to governance, risk and compliance, and interactive television platforms. thomson reuters journalists are subject to an"}, {"articleID": "2015081705_00001421_W", "names": {"Sanjeev Gupta": ["Q23883128", "Q46585791"]}, "date": "2015-08-17", "url": "http://timesofindia.indiatimes.com/business/international-business/Oil-prices-slide-further-in-Asia/articleshow/48508618.cms", "content": "The Times of India You are here: Home & raquo; Business & raquo; International Business Breaking News: More from The Times of India Recommended By Colombia Oil prices slide further in Asia The author has posted comments on this articleAFP | Aug 17, 2015, 09.59 AM IST ApnaCircle Oil prices resumed their decline in Asia on Monday as a global glut of crude supplies showed no signs of abating in the face of sluggish demand, analysts said. SINGAPORE: Oil prices resumed their decline in Asia on Monday as a global glut of crude supplies showed no signs of abating in the face of sluggish demand, analysts said. US benchmark West Texas Intermediate (WTI) for September delivery fell 63 cents to $41.87 a barrel in late-morning trade, the lowest since March 2009. Brent crude for October, a new contract, was down 65 cents to $48.54. WTI and Brent's September contract rose in New York on Friday after closing at their lowest level in six and a half years in the prior session. But oil came under renewed pressure in Asia after the latest data showing the number of rigs drilling for US oil increased last week, the sixth rise in seven weeks, analysts said. The news added to fears of a prolonged global surplus as output from the Organization of the Petroleum Exporting Countries and the US remains robust despite the tumbling prices. \"The combination of elevated stockpiles in the US and increasing production from OPEC, sluggish demand growth, and a stronger US (dollar) would continue to pressure oil prices,\" said Bernard Aw, market strategist at IG Markets in Singapore. The dollar strengthened in Asia on Monday after solid data boosted expectations of an imminent US rate rise, after China's shock devaluation of the yuan last week hurt Asia-Pacific currencies. As oil is traded in the US currency, a strong dollar makes it more expensive for international investors, dampening demand. \"The devaluation of the yuan by China led to the weakening of other emerging market currencies,\" said <mark>Sanjeev Gupta</mark>, who heads the Asia-Pacific oil and gas practice at professional services firm EY. Stay updated on the go with Times of India News App. Click here to download it for your device. From around the web"}, {"articleID": "2019081307_00155995_W", "names": {"Adrian Collins": ["Q15627018", "Q58146088"], "Chris Waller": ["Q16123033", "Q16911294"]}, "date": "2019-08-13", "url": "http://www.examiner.com.au/story/6325673/winners-are-grinners/?cs=96", "content": "Local Sport sport, local-sport, Carrick reinsman <mark>Adrian Collins</mark> is one of the real characters of Tasmanian harness racing. So it was no surprise when he had an exaggerated look to his left as he was cruising to victory on Courageous Katee at Mowbray on Sunday night. The focus of his attention was his mate Todd Rattray who, up until <mark>Collins</mark> appeared on the scene, had been leading the race on favourite Zhukov Leis. \"Todd and I played football together this year so I just gave him a cheeky smile as I went on by,\" <mark>Collins</mark> explained. <mark>Collins</mark> had driven a copybook race on Courageous Katee, prompting racecalled Matty Robertson to say \"someone buy him a beer\" as he crossed the line. \"Like a lot of things in harness racing, I'm still waiting for that to happen,\" the driver said. Courageous Katee has now won 10 races since her Victorian owners sent her to Karoola trainer Dick Eaves in March 2017. <mark>Collins</mark> has driven her to six of those victories. \"She's a very good horse - definitely the best I've sat behind for a long time,\" he said. \"I don't get many opportunities to drive really nice horses these days so I'm grateful to Dick for sticking by me .\" I know it's a cliche but all credit to him. \"He's a genius with mares .\" Eaves was also full of praise for <mark>Collins</mark> as he explained Courageous Katee could get too keen in her races and was not easy to drive. \"He is a strong boy, <mark>Adrian</mark>, and you need to be with her,\" the trainer said. \"If somebody drives her that has a bit of trouble holding her, they tend to go before acceptances .\" <mark>Adrian</mark> seems to sit there that bit longer. \"<mark>Collins</mark> said that he would take being called a\" boy \"as a compliment .\" I might pass if I keep my hat on, \"he laughed .\" But I've actually hit 42 now. \"IN OTHER NEWS <mark>Collins</mark> is confident that connections can keep raising the bar with Courageous Katee who will be the Launceston Pacing Club's mare of the year for this season .\" She loves Mowbray and she showed on Sunday, and also when she won in the fog three starts ago, that she has an amazing turn of foot \"he said .\" She has proven now that she can do a bit of work in her races and also win driven with a sit. \"Whitemore trainer Nigel Schuuring is lamenting another poor barrier draw for Willby Rules at Sandown on Wednesday but still expects the horse to run well. Willby Rules will start from the outside gate in the Benchmark 70 Handicap (1500m) where he has 62kg before the claim for apprentice Chelsea MacFarlane .\" He also drew badly last start at Moonee Valley when he got caught wide and ran out of steam the last bit, \"Schuuring said .\" But we were happy with the run. \"Hopefully, they will string out a bit more on the bigger track and he'll be able to get in .\" Schuuring left Willby Rules at the stables of Flemington trainer Saab Hasan after his last run. \"They've done an excellent job looking after him - he looks bright and happy,\" the trainer said. \"We'll see what happens (on Wednesday) before deciding how long he stays (in Victoria).\" There haven't been any races for him over suitable distances at Devonport but there is one in a fortnight which is an option. \"Willby Rules has won eight races and they've all been on the Spreyton synthetic surface. Scott Brunton is casting his net far and wide in search of suitable races for his horses while his home track at Elwick is closed. Brunton has had winners at Sandown, Flemington and Spreyton in the past 10 days and also had a runner at Wagga. This Saturday he has horses entered for Caulfield, Spreyton, Wangaratta and Narrandera (in southern NSW). His lone Caulfield entry is last-start Sandown winner Shot Of Irish who will step up in class to tackle the $125,000 Benchmark 84 Handicap (1400m). Shot Or Irish's rivals may include promising Tasmanian-bred four-year-old Kemalpasa who has won four of his past six starts in Adelaide for Richard Jolly. Mystic Journey is odds-on with all the major corporate bookmakers for Saturday's P B Lawrence Stakes at Caulfield. Ladbrokes, Sportsbet and tab.com. au are all quoting the mare at $1.80 in their all-in markets prior to Wednesday's acceptances. Meanwhile <mark>Chris Waller</mark> has named the Metropolitan Handicap as the first spring target for Eastender. In his weekly column for the Racenet web site, <mark>Waller</mark> says: The Tasmanian horse has a cult following down there from winning some big races. (He was only) narrowly beaten in the Andrew Ramsden and can certainly stay so he is on a path to The Metropolitan. The group 1 $750,000 Metropolitan will be run over 2400m at Randwick on October 5. Eastender is at $34 in Ladbrokes' early market which has his stablemate Verry Ellleegant as $8 favourite. He also gets a mention in Melbourne Cup markets at $81 but managing owner Denise Martin has suggested the 2020 Sydney Cup may be his best chance of winning a big race on the mainland. Do you know a junior sports star who calls Northern Tasmania home? Nominate them today. https: //nnimgt-a.akamaihd.net/transform/v1/crop/frm/nq3JkD2JZTWMXDuN44nfBn/17acac93-13b2-44f2-9304-1680d4c80b57.jpg/r900_757_5098_3129_w1200_h678_fmax.jpg"}, {"articleID": "2009042603_00033925_W", "names": {"Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2009-04-26", "url": "http://emeshuris.wordpress.com/2009/04/16/dang-talk-about-memory/", "content": "jill price keeps a detailed diary of her activities, including the time she spent with the author. it's a monday afternoon in november, and i'm driving down ventura boulevard with jill price, the woman who can't forget. price, who is 43, has spent most of her life here in los angeles, and she remembers everything. in the space of two minutes, she tells me about the former motel lodge with a bear in front, the courtyard hotel that used to be a hilton, and a bowling alley-since replaced by a marshalls-where a nicolas cage film was shot. all this comes pouring out so fast, i wonder aloud whether price has had too much coffee. she laughs, says no, pulls slightly at her blond hair, and starts up again. right over there, she says, is a car wash: \"i was talking to the guy there last summer, and i was telling him about the first time i ever went to the car wash-on august 30, 1978. and he was freaking out .\" soon, price, generally a gentle soul, has moved on to a rant about a tv program she just saw: \"it was about an event that happened in 2002. so they kept going back to saturday, june 19, 2002. well, june 19, 2002, was not a saturday! it was a wednesday. it was pissing me off .\" a youtube clip of her on 20/20. diane sawyer asks price, an avid television viewer, to identify certain significant dates in broadcast history. when did cbs air the \"who shot jr?\" episode of dallas? when was all in the family's baby episode shown? and so on. price nails every question. she not only gives the date for the final episode of mash but describes the weather that day. the most remarkable moment comes when sawyer asks price when princess grace died. she immediately answers, \"september 14, 1982-that was the first day i started 12th grade .\" for once, it seems that the memory lady has blown it. sawyer laughs nervously and tries gently to right her guest: \"september 10, 1982 .\" price misunderstands, thinking she's being prompted to identify another event-the possibility that she's being corrected apparently doesn't occur to her. no, sawyer says, she has made a mistake; according to the book that 20/20's producers were using as a source, princess grace died on september 10. price stands her ground, and not 60 seconds later, a producer breaks in: \"the book is wrong .\" price is right after all! until recently, no one had ever heard of jill price. her friends and family knew her memory was remarkable, but nobody in the scientific community did. her road to stardom started in june 2000 (monday, june 5, to be exact), when she stumbled upon a web page for james mcgaugh, a uc irvine neuroscientist who specializes in learning and memory, and decided to send him an email describing her unusual ability to recall the past. mcgaugh wrote back 90 minutes later. he tells me he was skeptical at first, but it didn't take long for him to become convinced that price was something special; he soon introduced her to two of his collaborators, larry cahill and elizabeth parker. the three researchers interviewed price many times over the next five years, but they kept the story to themselves. finally, mcgaugh and company were ready to share what they had found. in february 2006, their article, \"a case of unusual autobiographical remembering,\" appeared in the journal neurocase. shortly thereafter, the uc irvine press office peddled the story to the orange county register - and price's world was turned upside down. the newspaper article, which identified her only as \"aj,\" appeared on march 13, 2006. within hours, uc irvine was besieged with inquiries. four weeks later, the story went national: price was interviewed on npr's morning edition (still under the aj pseudonym). an editor at free press eventually tracked her down, and a book deal followed; price would tell her own story, this time under her own name. the media played along, withholding further news on the woman who couldn't forget until the book's release. since then, price has been on a nonstop media junket. diane sawyer actually had her on twice in one day (on good morning america and 20/20). by the time i met price, she had been interviewed by oprah and had been featured in every major newspaper from the wall street journal. often the pieces focused on the pain she felt because of her inability to forget difficult moments. as i followed price's story, i was fascinated but doubtful. i am a cognitive psychologist, and to me something didn't smell right. everyone seems to have an uncle or cousin with \"photographic\" memory, but damned if they can actually give you a phone number to reach that person. the only serious scientific paper documenting photographic memory was published nearly 40 years ago, and that study has never been replicated. price, however, is eminently real. i spent the better part of two days with her, meeting her friends and family and watching her at the office. at the end, i can honestly say that in my decade as a professor of psychology, i've never encountered anyone remotely like jill price. ordinary human memory is a mess. most of us can recall the major events in our lives, but the memory of homo sapiens pales when compared with your average laptop. it takes us far longer to store data (you might have to hear a phone number five to 10 times before you can repeat it); it's easy for us to forget things we've learned (try reciting anything from your sophomore history class); and it's sometimes hard to dislodge outdated information (st. petersburg will always remain leningrad to me). worse, our memories are vulnerable to contamination and distortion. lawyers can readily fool us with suggestive questions; false memories can easily be implanted. the fundamental problem is the seemingly haphazard fashion in which our memories are organized. on a computer, every single bit of information is stored at a specific location, from which it can always be retrieved. human recall is hit or miss. neuroscientific research tells us that our brains don't use a fixed-address system, and memories tend to overlap, combine, and disappear for reasons no one yet understands. the one thing we do know is rather vague: memories live in the hippocampus and the prefrontal cortex. after that, the entire question of how memory works is up for grabs. for example, where precisely in the hippocampus (or prefrontal cortex) is my memory of reading kurt vonnegut for the first time? if i try to summon that experience, i am likely to wind up with a blur-a half dozen indistinct recollections. and no brain-scan technology will help me bring it into better focus. so when i hear about price's feats, my mind boggles. from the perspective of evolution, finding a human being with memory that works with the precision of a computer would be like finding someone with bones made of steel. the type of memory system we have-in technical terms, context-dependent rather than location-addressable-has been around for several hundred million years. the existence of a human brain that works completely differently is astronomically unlikely. yet here i am, and here is price. the three uc irvine scientists who studied her decided that her case deserved its own name - hyperthymestic syndrome, academic greek for \"exceptional memory\" - and it's not hard to see why. i come prepared with a stack of questionnaires, and when we return to her house, price is kind enough to let me administer my tests, easily blowing through the first few. i ask, for example, if she can tell me some dates of famous accidents and airline crashes; she's all but unstoppable. she instantly retrieves from memory the exact dates of the explosions of space shuttle challenger and pan am flight 103 over lockerbie, scotland. she remembers not just that september 25, 1978, was when a psa flight crashed in san diego but also that the jet collided with a cessna. she can go in either direction, disaster to date or date to disaster. when i say \"january 13, 1982,\" price has no trouble recalling the air florida flight that according to mcgaugh's neurocase article, price is even more astounding on the events of her own life. at the scientists' behest, for example, she recalled-without warning and in just 10 minutes-what she'd done on every easter since 1980. \"april 6, 1980: 9th grade, easter vacation ends. april 19, 1981: 10th grade, new boyfriend, h. april 11, 1982: 11th grade, grandparents visiting for passover...\"soon, though, the limitations of her memory begin to show. my next questionnaire is on the just-concluded 2008 presidential election, and here things go less well. she is off by a few days on hillary clinton's withdrawal from the race and clueless on the iowa caucuses. price nails both the republican convention and the st. louis vice presidential debate (she was at a regular thursday dinner that night) but can't say the precise date when obama clinched the nomination. when it comes to the 2004 election, she opts out entirely. i soon find that except for her own personal history and certain categories like television and airplane crashes, price's memory isn't much better than anyone else's. she struggled in school, is no good at history before 1965, and seems genuinely miffed that she was once asked when the magna carta was signed (\"do i look like i'm 500 years old?\" ). for a scientist like me, the real test is to see how well price can remember something new. i am especially interested in memory distortions. if you read an average person a list of words like cloth, and knitting, and then ask them to repeat the words, they'll likely imagine they've heard needle even though it's not on the list. can price sail past the trap of memory distortion? no, she can't. i read her five lists of words drawn from a psychological test known as the drm, and not only does she miss a number of words, she also recalls hearing three i didn't say. her performance may be a little above average, but no more than that. if price's memory of her own history is so precise, why is it so average for everything else? or, more to the point, if her memory for everything else is so ordinary, why is her memory of her own history so extraordinary? the answer has nothing to do with memory and everything to do with personality. price remembers so much about herself because she thinks about herself-and her past-almost constantly. she still has every stuffed animal she's ever gotten, enough (as she showed me in a photograph) to completely cover the surface of her childhood bed. she has 2,000 videotapes and countless audiotapes, not to mention more than 50,000 pages of diary entries in idiosyncratic handwriting-so dense that it's almost unreadable. until recently she owned a copy of every tv guide since summer 1989. i'm not sure price wants to catalog her life like this, but she can't help herself. when she tells me that one of her biggest regrets in life is that no one followed her around with a microphone during her childhood, i'm not the least bit surprised. in her own words, she lives as if there's a split screen running in her mind-one half on the present, the other on the past. the onset of price's exceptional recall seems to be closely tied to a painful event: her family's move from south orange, new jersey, to los angeles on june 29, 1974. for price, life can be neatly divided into periods before and after that childhood trauma, and her detailed memories begin just after the move. even as an adult, price continues to be haunted by separation anxiety. she has lived with her parents her entire life, and her anxiety about moving recurred in 2003, at age 37, when her parents decided to take a smaller house. just as price hadn't wanted to leave south orange as a child, she dreaded leaving the only home she'd known since she was 8. packing her memorabilia for storage took more than a month. perhaps the hardest part was the thought that she'd have to leave behind a piece of wallpaper on which she'd recorded minor personal details for nearly 30 years. in the end, and much to the consternation of the family's realtor, price took a razor blade to the wall and peeled off one more cherished souvenir. in the time i spend with her, i notice that the not-particularly-foulmouthed price is very fond of the expression that so-and-so \"shits and farts just like the rest of us\" - as in \"joe movie star might make a lot of money, but he still shits and farts like anyone else .\" by the third time i hear her utter this phrase, i can't help but notice its relevance to her own life: price may display unusually complete recall of her own past, but her memory is the same blurry patchwork as everyone else's. the difference is that she scans her past relentlessly. every time we think about something, and especially how it connects to something else, we get better at remembering it-a phenomenon that psychologists call elaborative encoding. price has spent her whole life ruminating on the past, constructing timelines and lists, and contemplating the connections between one february 19 and the next. dates and memories are her constant companions, and as a result she's really good at remembering her past. end of story. why were price's abilities blown so far out of proportion? i wouldn't blame price; she's as happy to tell what she doesn't remember as what she does. but her story has taken on a life of its own. it started with that 2006 journal article: although the scientists knew about price's diaries and compulsions, little in the paper speaks to the question of whether it might be personality, not memory, that makes her extraordinary. then there was the editor at free press who gave price's book the manifestly false title the extraordinary story of living with the most remarkable memory known to science. and don't forget the credulous media that ate up the story-without, apparently, ever seeking a second opinion from scientists not involved in the case. lost in all the hype is an inconvenient fact: price's brain was scanned more than two years ago, and the results-not yet published-apparently don't support the notion that she's some kind of memory goddess. her hippocampus and prefrontal cortex are reportedly normal. the one significant aberration, according to price-who was told about the scans by doctors who won't discuss them publicly-is that her brain resembles those of people with obsessive-compulsive disorder. the true nature of price's memory becomes clear to me by the end of our first day of interviews, but i don't know whether to tell her. i try to keep my thoughts to myself when i meet her on day two in her office, where she works as a hyperkinetic, hyperorganized school administrator. but she wants to know what i'm going to write. i panic-worrying that her feelings will be hurt-and wonder how i'm going to explain. while i'm stalling, she tells me about an article on memory published that morning in the wall street journal; she's mentioned and wants to know what i think. she prints it out for me, and i skim through it. mcgaugh, the lead author of the original neurocase article, is quoted-talking, of all things, about elaborative encoding. i start slowly-griping about the newspaper article, which i find to be a bit sloppy scientifically; i scarcely mention price or what the author has to say about her. but eventually i come to the main point and read aloud from the critical paragraph: \"what if you want to remember more about each passing day? one simple method is to keep a journal. writing down a few thoughts and events every day not only makes a tangible record, it also requires you to reflect .\" isn't that price to a t? doesn't it explain why her forte is autobiographical memory rather than, say, recalling dates in ancient history? i think the answers are obviously yes, and i tell her so. \"but i didn't search this out,\" she protests, denying that her obsessions have anything to do with her memory. no, but that doesn't matter, i say. i explain how her rumination on the past isn't something she does voluntarily, but whenever she does it, the connections between her memories are strengthened. price is quiet for a moment, thinking about what i've said. \"this is ocd,\" she says softly. \"i have ocd of my memories .\" three similar hyperthymestics have come forward since the 2006 journal article, each with spectacular autobiographical memory, and all three have similar ocd-like habits. they all collect things and are obsessed with dates and events. (one went so far as to write an unpublished work titled the book of bob .) the truth is, most people could remember their lives in considerable detail if they contemplated them with the same manic intensity. when i bring my theory about price to mcgaugh, he concedes that i could be right. \"we remain puzzled and open to alternative interpretations,\" he says. but even if price's memory is just the byproduct of obsession, she's still amazing. i've come to think of her as the <mark>michael jordan</mark> of autobiography. <mark>jordan</mark> wasn't born the greatest basketball player of all time; he became the greatest, combining considerable but not unique innate talent with an incredible amount of hard work shooting free throws and practicing jumpers long after most of his peers were out carousing. whether intentionally or not, price has shown the same sort of daily dedication to chronicling her own life. for her, it's been a mixed blessing. price doesn't just remember the past, she feels it-vividly-and bad personal experiences linger. but she can't really imagine being like the rest of us, either. for two days, she's been asking what it's like to be me. do i remember what happened on november 10, 2003? or november 10, 1998? nope, nada. i haven't a clue. when i jokingly ask, \"so, you think the rest of us are retarded?\" she just giggles. she doesn't, she says, but she also wouldn't give up her memory for anything."}, {"articleID": "2011041203_00038446_W", "names": {"Andy Smith": ["Q16201307", "Q34175039", "Q3616564", "Q38361975", "Q44740815", "Q4761329", "Q4761330", "Q4761331", "Q4761333", "Q527693"]}, "date": "2011-04-12", "url": "http://wgnradio.com/news/sns-rt-life-us-technology-tre73a1op-20110411,0,2054627.story", "content": "sns-rt-life-us-technology-tre73a1op-20110411 new york (reuters life!) - worried about how many calories you are going to consume in that slice of pizza, chocolate cake or bag of fries? a new iphone application may help. after taking a picture of the meal with the phone, the app gives a calorie read-out almost instantly. the app, called mealsnap, was developed by dailyburn, a fitness social network that has created several other fitness and diet-related iphone applications. within minutes of taking a picture of a meal and matching it to a database of some 500,000 food items, the app sends users an alert with a range of calories for the meal that was photographed. \"the database can quickly help identity the food, how many calories there are, proteins, fat, carbs, vitamins, whatever you may want to know,\" said dailyburn ceo <mark>andy smith</mark>. \"users can then choose to share what they've eaten on twitter or foursquare, leading to social accountability .\" <mark>smith</mark> added that calorie counting can be a very time consuming process. but the app makes it easier to track the calories in food. \"the pure act of tracking something can cause a psychological change that can help people on their health and fitness journey,\" he explained. \"just the simple fact of logging it makes me more aware of what i'm eating .\" additionally, mealsnap can serve as a food diary, allowing users to keep a visual log of the meals they have eaten. \"it's like a food journal, but easier. all you do is take the picture,\" <mark>smith</mark> said. mealsnap is available on the itunes store for $2.99. (reporting by bernd debusmann jr., editing by patricia reaney) over strong objections from the hospital industry, the government has published data about things that can go wrong in hospitals -...a 9-year-old girl who had gone missing from the west englewood neighborhood on the south side was found this morning, police said."}, {"articleID": "2010111818_00209952_W", "names": {"Jeff Schultz": ["Q1420243", "Q6174921"]}, "date": "2010-11-18", "url": "http://ajc.com/news/north-fulton/man-shot-killed-after-745489.html?cxtype=rss_north-fulton", "content": "kristi e. swartz the atlanta journal-constitution russell sneiderman, 36, was shot multiple times by another man in the parking lot outside the school, on chamblee dunwoody road, police said. according to police, sneiderman took his child to the school, at 5493 chamblee dunwoody road, and as he was getting into his car, another man with a gun approached him and started firing. \"\"all we know is that he pulled up about 9:10 in the morning, and the witnesses, they saw another white male walk up to him and start firing,\" carlson told the ajc. carlson said investigators do not know if either the shooter or the victim had ties to the preschool. \"we're looking at all possibilities,\" carlson said. the shooter was spotted leaving the dunwoody prep preschool in a silver dodge minivan, carlson said. shortly before noon, a silver infiniti was towed from the school parking lot. the school's staff and children did not witness the incident but parents' nerves were frazzled nonetheless. \"i just dropped him off and within two minutes heard four gunshots but then thought to myself that couldn't certainly be gunshots,\" said natalia kelly, mother 2-and-a-half-year-old lands. \"we're at school, we're in dunwoody, what's going on here .\" kelly said she was near by at the bb & t, so she decided to go back to the school to pick up her son. \"my biggest thing was to make sure the kids were happy, they were calm and that no one was afraid,\" she told the ajc. kelly said she will bring lands back to the school friday. \"te school is extremely safe, they have security, they have cameras,\" she told the ajc. \"i would have left him here if i hadn't just been so close to the situation...the teachers would do anything to protect these children, it's the fact that i'm here, and i want to be with him .\" carlson said police told the school's staff so parents could be notified as well. \"we wanted to make sure that they (the parents) were ok and if they wanted to come up and pick up their child that they could do so,\" he said. \"and, we want to clarify that this was out in the parking lot .\" the shooter, wearing a hoodie, stands between 5 feet, 10 inches and 5 feet, 11 inches, carlson said. he was last seen traveling west on mount vernon road. \"it's very disturbing that this was so close to a school,\" carlson said. \"we definitely want to find this individual .\" trucker ensures his hometown of dahlonega gets to honor the capitol christmas tree on its way to d.c. george clooney's father was on hand as he was honored at the ripple of hope awards. <mark>jeff schultz</mark>'s weekend predictions give you insight into his choices. beat him and win great prizes. what's altered in the two photos? see how you score when you play the find 5 challenge! editorial cartoonist mike luckovich gives his take on local news, politics, sports and celebrities. metallic rib cage under texas interstate bridge evokes the flintstones man who raped student, bragged to her friends and family gets 60 + years dancer who was mother of six dead after overnight shooting at club"}, {"articleID": "2016071501_00391780_W", "names": {"Lisa White": ["Q27655897", "Q30121983"], "Josh Hamilton": ["Q641352", "Q716346"], "Derek Holland": ["Q1047687", "Q21453740", "Q5262047", "Q5262049"]}, "date": "2016-07-14", "url": "http://corsicanadailysun.com/sports/mlb-even-after-reeling-rangers-exit-break-as-al-s/article_7912dd8a-4a1b-11e6-843d-e726c43ce5f6.html", "content": "MLB: Even after reeling, Rangers exit break as AL's best, Yu back The Texas Rangers went into the All-Star break reeling, with nine losses their last 12 games and three-fifths of their starting rotation still on the disabled list. But they still had the best record in the American League. More Headlines Scott and <mark>Lisa White</mark> of Corsicana are excited to announce the engagement and upcoming wedding of their daughter, Stephanie Marie <mark>White</mark> to Jacob Hunter Brock, son of David and Sharon Brock of Beach City. More Headlines Guest Commentary I read with interest the article in today's Daily Sun about housing remaining a hot topic in Corsicana. Since I moved here almost 18 years ago, the problem has remained and has gotten worse--limited, old housing stock in poor condition and overpriced. It was identified as a serious problem in United Way's community needs assessment in 2007. Both commercial and residential properties in our city generally suffer from a lack of pride of ownership and insufficient city resources to enforce codes. A study by Kelly Cofer with the Retail Coach a number of years ago gave our city a \"D\" in appearance and cited it as a major deterrent to new business. More Headlines MLB: Even after reeling, Rangers exit break as AL's best, Yu back By STEPHEN HAWKINS AP Sports Writer 2 hrs ago ARLINGTON--The Texas Rangers went into the All-Star break reeling, with nine losses their last 12 games and three-fifths of their starting rotation still on the disabled list. Their last game was a 10-run loss at home to the team with the American League's worst record. \"We went through a stretch where we didn't play good as a team,\" third baseman Adrian Beltre said. \"We understand we're going to go through highs and lows and I assume this is our low .\" As bad as that stretch was--that 15-5 loss to Minnesota was the fifth time in nine games they allowed at least 10 runs--the Rangers go into Wrigley Field this weekend still with the AL's best record (54-36) and a 5 1/2 - game division lead over the Houston Astros. That is the largest AL West lead Texas has ever had coming out of the midsummer break, but it had been as big as 10 games in late June. \"We have the right team to get in the postseason, and after getting in the postseason, we have enough talent and experience to keep moving on,\" shortstop Elvis Andrus said. Right-hander Yu Darvish is scheduled to return from the disabled list and rejoin the rotation Saturday for the second of three games against the Chicago Cubs. With All-Star lefty Cole Hamels set for the series finale, it will be only the fourth time this season Texas' top aces pitch in back-to-back games. Here are some things that went right before the break and others second-year manager Jeff Banister and the Rangers have to watch over the final 72 games when trying to win another AL West title: SURPRISE ALL-STAR: Ian Desmond was a career shortstop his seven seasons with Washington, but turned down a deal to stay with the Nationals. He was unsigned until after the start of spring training, when he went to Texas and switched to left field to replace injured slugger <mark>Josh Hamilton</mark>. By mid-May, Desmond was the everyday center fielder and this week was the only Texas position player at the All-Star game. \"No doubt, he's been our best player,\" Beltre said. \"We found a center fielder...one of the premier center fielders in the American League as far as you put the whole package together,\" Banister said. \"He was a National League shortstop last year. That in itself is just phenomenal .\" Desmond is hitting .322 with 15 home runs and 55 RBIs. HURTING HURLERS: Darvish last pitched for the Rangers on June 8, only his third start for them since missing 2015 because of Tommy John surgery. He then went back on the DL with shoulder discomfort. Colby Lewis (strained lat muscle) and <mark>Derek Holland</mark> (shoulder inflammation) both headed to the DL on the same day in late June. Lewis (6-1, 3.21 ERA) is on the 60-day DL and can't return until at least late August, having made only one shortened start since his near perfect game June 16 at Oakland. <mark>Holland</mark> (5-5, 5.20) started playing catch again in the last week. ON THE ROAD AGAIN: The Rangers are in a span of playing 19 of 23 games on the road, making them the first MLB team since the 2004 Tampa Bay Rays with four home games or fewer in a span of 28 games or more in the regular season. Texas plays its next nine games on the road. Before four home games against Minnesota going into the All-Star break, the Rangers had played 10 in a row away from Arlington. CLOSING IT DOWN: Sam Dyson has 16 saves in two months since taking over as the Rangers' closer, including an MLB-best 10 saves in June. The right-hander got some needed rest, with only three appearances in 11 days before the break. Shawn Tolleson had 35 saves in 2015, and 11 more this season, when he his four blown chances included consecutive appearances in mid-May. ONE GOAL: Beltre's sole goal in his 19th major league season is to finally win the World Series. \"I don't have a lot of time to basically be comfortable with just getting to the playoffs,\" said Beltre, the 37-year-old third baseman signed through 2018. \"That's not enough for me. I'm here to push this thing to win the World Series .\" Sign Up / Sign In"}, {"articleID": "2009011301_00002264_W", "names": {"Steve Pearce": ["Q902082", "Q947168"]}, "date": "2009-01-13", "url": "http://ekklesia.co.uk/node/8325", "content": "for theological education that fits around your working life visit ekklesia partner workshop, run by anvil trust british methodists provide assistance for north korea while north korea and the generally unknown christians there remain isolated on the world stage, british methodists are among those who have been developing relations and providing assistance. at the beginning of the new year, the church's fund for world mission will grant £ 5,000 to help the church in north korea run a food production company to help people there. the methodist church in britain will also be joining in the global day of repentance and prayer for north korea on 14 january 2009, highlighting concerns for the country in it prayer handbook, which is used by a large number of individuals and congregations. <mark>steve pearce</mark>, partnership coordinator for asia and the pacific, explained: \"times are particularly hard for all the people of north korea at the present time. the north korean population is cut off and isolated from the rest of the world and dependent on the regime for their needs. food is scarce for many - there are problems in the supply of humanitarian aid .\" <mark>pearce</mark> continued: \"christianity is treated as' a bad element' in this hardline socialist country. christians have been beaten, arrested, tortured, or killed because of their religious beliefs but local sources estimates the number of underground christians to be at least 200,000, maybe many more, and many of them are imprisoned for their faith .\" he added: \"raids are made regularly, both in north korea and china, to arrest refugees and those helping them .\" creative commons attribution-noncommercial-noderivs 2.0 england & wales license. although the views expressed in this article do not necessarily represent the views of ekklesia, the article may reflect ekklesia's values."}, {"articleID": "2016090907_00383560_W", "names": {"Senthil Kumar": ["Q14931905", "Q6323469"]}, "date": "2016-09-09", "url": "http://silverscreen.in/tamil/tamil/vaaimai-review-beyond-jurisdiction-rhyme-reason/", "content": "Vaaimai Review: Beyond The Jurisdiction Of Rhyme Or Reason Distraction Free Reading Advertisement A Tamil film inspired by the Hollywood classic 12 Angry Men, is a big stretch for the imagination. The first fail is the whole premise of the film--there is no jury system in Indian courts. Not since the Nanavati case. And no amount of adaptation would get us past this stumbling block. ***** Vaaimaai, written and directed by <mark>Senthil Kumar</mark>, that had been lying around in the cans for quite a few years is finally out. Once open, the contents of this Pandora's Box cannot be unseen. Its \"star cast' boasts an array of retired actors: Thiagarajan, Giundamani, Ramki, Manoj Bharathi, Poornima Bhagyaraj (and Shanthanu Bhagayaraj, another important member of the cast, not belonging to this category is unfortunate). Prithvi Pandiarajan plays Velan, a daily-wage worker who is sentenced to death for killing a politician. His mother, played by Poornima Bhagyaraj, is also arrested for allegedly assisting him in the murder. And since she doesn't have an alibi, the\" nation feels' that she must be hanged too. There are people chanting \"Eye for Eye, Die for Die\" --taking poetic license with grammar, the legal discourse, justice, and what should or shouldn't be their business, to name a few things--outside the court. Then, the judge orders a jury to take a decision on the issue. This metamorphosis of the Indian legal system, however, isn't exactly poetic. ***** Then come the mindboggling members of the jury, introduced by Vijay Sethupathi's voice: Thiagarajan as Gen. Dheenadhayalan, under whose leadership India won the Kargil War (but that matters least compared to his other attribute as the voice insists, \"he has a good dressing sense\" ); Manoj Barathiraja, who is a great actor and writer; Goundamani as a neurologist named Benny Quick (or Penniquick--we have stopped caring). ***** The jury confronts evidence that is elementary even for a 10-year-old, but not so for the judge. And as the jury is in conference, the judge sits on the roof of the court reading the newspaper (because current affairs cannot wait?). The music seems to have been provided by the Demo function on Casio keyboards for kids. The music director has also randomly pushed the \"special' keys for noises of airplanes, exploding bombs etc. (because it is there?). ***** The only redeeming quality about the film is that it is 95 minutes long--it could have been 96! ***** The Vaaimai Review is a Silverscreen original article. It was not paid for or commissioned by anyone associated with the movie. Silverscreen. in and its writers do not have an advertising relationship with movies that are reviewed on the site."}]