[{"articleID": "2016092817_00882588_W", "names": {"Tim Evans": ["Q7803475", "Q7803476"]}, "date": "2016-09-28", "url": "http://www.bloomberg.com/news/articles/2016-09-28/gold-holds-losses-as-u-s-consumer-confidence-boosts-dollar", "content": "Share on Facebook Share on Twitter Share on LinkedIn Share on Reddit Share on Google + E-mail Share on Twitter Share on WhatsApp Silver is looking shinier than ever, at least in the eyes of the exchange-traded fund investors. Holdings in ETFs backed by silver climbed to the highest since they were created about a decade ago, according to data compiled by Bloomberg. This quarter, investors poured $625.5 million into iShares Silver Trust,, the most since 2010, data show. iShares owns more than half of total silver holdings in ETFs. Silver has rallied 39 percent this year, helped by a tailwind from gains in gold, as the Federal Reserve kept U.S. interest rates steady and other central banks increased stimulus to support growth. An improving outlook for the U.S. economy and Chinese manufacturing has also benefited silver, with industrial use accounting for more than half of the metal's demand. \"Some of the data that we've seen from an industrial standpoint has been relatively decent,\" <mark>Tim Evans</mark>, the chief market strategist at Long Leaf Trading Group Inc. in Chicago, said in a telephone interview. \"Silver having that industrial component, tends to respond more favorably to those kinds of news development than gold does .\" Consumer confidence rose in September to the highest since before the last recession on optimism about the labor market, according to a report from the New York-based Conference Board on Tuesday. The same day, a government report showed profits of China's industrial corporations jumped the most in three years, a report Tuesday showed, adding to evidence of continued stabilization in manufacturing. Silver futures for December delivery slipped 0.2 percent to $19.13 an ounce at 12:19 p.m. on the Comex in New York, paring this quarter's gains for the most-active contract to 2.7 percent. Gold futures for December delivery declined 0.4 percent to $1,324.50 an ounce. In other precious metals and mining news: A gauge of 14 senior global gold producers tracked by Bloomberg Intelligence fell 1.2 percent, with shares of Newcrest Mining Ltd. and Kinross Gold Corp. among the biggest decliners. On the New York Mercantile Exchange, palladium futures gained, while platinum futures fell. Before it's here, it's on the Bloomberg Terminal. LEARN MORE"}, {"articleID": "2018120712_00034946_W", "names": {"Mark Evans": ["Q12795898", "Q14946841", "Q16194528", "Q16210885", "Q20090670", "Q358208", "Q43006927", "Q46585872", "Q57561127", "Q59219170", "Q6767546", "Q6767547", "Q6767549", "Q6767552"]}, "date": "2018-12-07", "url": "http://www.thisislancashire.co.uk/news/17283490.o2-compensation-how-to-claim-money-back-after-network-outage/", "content": "News O2 compensation: How to claim money back after network outage O2 says its services have been restored after a technical fault left millions of customers unable to get online Photo: Nick Ansell/PA Wire 0 comment O2 customers affected after a technical fault left millions unable to get online could be in line for compensation. The mobile network suffered disruption from 5am on Thursday, with full service not returning until early today. Guidance from regulator Ofcom said that, depending on circumstances, it \"may be appropriate\" for mobile networks to offer some form of compensation for loss of service. O2 said it would update customers later on Friday on how \"we will make yesterday's data service issue up to them\". Customers wishing to complain should follow a company's formal complaints procedure - usually completing an online form or phoning the company directly. If customers are not happy with how a complaint has been responded to, or it takes more than eight weeks to be resolved, a further complaint can be submitted to an independent Alternative Dispute Resolution (ADR) scheme. In the case of O2, this is Ofcom-approved Ombudsman Services: Communications, which reviews a case and comes to an independent decision on it, usually within six weeks. Sky Mobile, one of the operators affected by the outage as it uses O2 network, has already confirmed it will compensate customers with a day of free unlimited data. The network said: \"We're really sorry for the issues you experienced on Sky Mobile yesterday .\" We're giving you a day of free unlimited UK data this Saturday 8 Dec, so you can catch up on all the things you've missed. You don't need to do a thing. \"Meanwhile, O2 promised to carry out a review to understand what went wrong. British customers reported not being able to use mobile data to access the internet and the operator's network on Thursday after disruption began at about 5am. On Thursday evening, O2 said 3G data service had started returning and was expected to be fully restored by 9.30 pm, while the company reported at 3.30 am on Friday that the 4G network had been restored .\" Our technical teams will continue to monitor service performance closely over the next few days to ensure we remain stable, \"a spokesman said .\" A review will be carried out with Ericsson to understand fully what happened. \"We'd like to thank our customers for their patience during the loss of service on Thursday 6 December and we're sorry for any impact the issue may have caused .\" The company had earlier issued a joint apology with telecoms company Ericsson. O2 UK chief executive <mark>Mark Evans</mark> said: \"I want to let our customers know how sorry I am for the impact our network data issue has had on them .\" We fully appreciate it's been a poor experience and we are really sorry. \"O2, which has more than 25 million UK customers, saw disruption to its network last for most of the day on Thursday. Other mobile networks, including Sky, Tesco and Giffgaff, were also affected by the problem because their networks use O2 services. Marielle Lindgren, chief executive of Ericsson UK and Ireland, said:\" The faulty software that has caused these issues is being decommissioned. \"She added:\" Ericsson sincerely apologises to customers for the inconvenience caused. \"0 comment"}, {"articleID": "2015020319_00065237_W", "names": {"Bob Smith": ["Q1173492", "Q19577917", "Q20710739", "Q20710756", "Q28803422", "Q2907827", "Q4934018", "Q4934021", "Q4934022", "Q4934024", "Q4934025", "Q4934026", "Q51644740", "Q888261"]}, "date": "2015-01-26", "url": "http://embedded-computing.com/news/updated-brochure-product-catalog-available-dataforth/", "content": "Dataforth has just published two revised and updated MAQ20 Industrial Data Acquisition & Control documents: a 4-page brochure and the 32-page 2015 Product Catalog. The Brochure presents an overview of the MAQ20 system, which consists of high performance, DIN rail mounted, programmable, multi-channel, and industrially rugged signal conditioning input and output modules and communications modules. www.dataforth.com/catalog/pdf/MAQ20_brochure.pd [...] The Product Catalog provides detailed descriptions, block diagrams, specifications, and ordering information for each of the module types, as well as a system overview. \"The MAQ20 system is so flexible and powerful,\" says <mark>Bob Smith</mark>, VP of Sales and Marketing. \"We will be introducing new modules in coming months and will continue to enhance and grow the system for years to come .\" www.dataforth.com/catalog/pdf/MAQ20_Catalog.pdf The high performance MAQ20 offers the industry's lowest cost per channel, integral PID loop control, and ± 0.035% system accuracy (module dependent). It is ideal for test and measurement, factory and process automation, machine automation, military and aerospace, power and energy, environmental monitoring, and oil and gas applications. One MAQ20 communications module can interface to up to 24 I/O modules to construct a system with a maximum of 384 channels that fits within a standard 19 \"instrumentation rack. Modules mount on the industry standard 35x7 .5 mm gull-wing DIN rail; a backbone mounts within the rail to provide power and communication interconnections between the communications modules and each I/O module. • Communications Modules, which are offered in Ethernet, RS-232, RS-485, and USB with host application software interfacing to the system using Modbus TCP or Modbus RTU protocol • Analog Input Modules, which interface to a wide range of standard industrial sensors and equipment and offer up to 16 channels of input, each of which can be independently configured; signal ranges are user selectable and offered in differential and single-ended configurations - RTD and Potentiometer input modules • Analog Output Modules, which drive valves, perform other crucial process operations, and provide up to eight channels of output that can be independently configured • Discrete Input/Output Modules, which provide multiple channels of input and output per module and offer advanced special functions as well as alarm capability • System Backbone, which resides within the DIN rail used for module mounting and provides power to and interface between the communications module and the I/O modules Two dedicated software packages are offered for the system: the easy-to-use ReDAQ Shape for MAQ20, which is ideal for data acquisition, monitoring and control applications, and the advanced, intuitive IPEmotion, which was designed specifically for industrial and R & D applications and represents the next step in test & measurement. Both softwares provide the MAQ20 with leading-edge PID loop control. Additional advanced features include alarms, counters, timers, and PWMs. Like all Dataforth products, the MAQ20 system ensures exceptional isolation, protection, accuracy, and reliability. MAQ20 modules provide 1500Vrms channel-to-bus isolation, up to 240Vrms continuous field I/O protection, and ANSI/IEEE C37 .90.1 transient protection. They are meant for installation in Class I, Division 2 hazardous locations and have a high level of immunity to environmental noise commonly found in heavy industrial environments. All MAQ20 modules are Heavy Industrial CE Compliant. Dataforth was established in 1984 and is the world leader in data acquisition and control, signal conditioning, and data communication products for industrial applications. Worldwide, our products provide rugged signal and data integrity and wide spectrum accuracy. All Dataforth products are manufactured in the USA and have been RoHS Compliant since 2006. The Dataforth Quality Management System is ISO9001:2008 registered."}, {"articleID": "2011102514_00051893_W", "names": {"Jiang Yu": ["Q45360976", "Q45360981", "Q45386178", "Q45431139", "Q45432281", "Q45440218", "Q45459675", "Q45463686", "Q45481558", "Q45481706", "Q45493408", "Q45501145", "Q45501270", "Q45503207", "Q45515834", "Q45522306", "Q45553135", "Q45553706", "Q45564998", "Q45565061", "Q45566335", "Q45568793", "Q45590347", "Q45594590", "Q45635865", "Q45683810", "Q45690999", "Q45695547", "Q703060"]}, "date": "2011-10-25", "url": "http://todayonline.com/World/EDC111025-0000559/China-to-send-envoy-to-Syria,-urges-reforms", "content": "beijing - china today pressed syria to heed the \"reasonable\" demands of its people and live up to promises of reform, ahead of a visit to damascus by beijing's special envoy to the middle east. china has played a low-key role in the turmoil that has swept the middle east and north africa, but it has also moved swiftly to normalise ties with governments which have been overthrown by popular revolts, such as in libya. \"we hope that all sides in syria can put the interests of the country and people first, discard violence, avoid bloodshed and clashes, and resolve differences via dialogue in a peaceful way,\" said foreign ministry spokeswoman <mark>jiang yu</mark>. \"we believe that syria's government should proactively fulfil its promises of reform, and answer the people's reasonable demands,\" she told a regular news briefing. chinese envoy wu sike would visit syria, along with egypt, from oct 26-30, ms <mark>jiang</mark> added, without providing details. china, along with russia, recently resisted a western push for a united nations security council resolution condemning the syrian government's crackdown on pro-reform protests that began over half a year ago. the us said yesterday that it had pulled its ambassador out of syria because of threats to his safety, prompting syria to follow suit in a deterioration of ties already battered over president bashar al-assad's crackdown against protesters. irrelevant or inappropriate comments might be edited or removed. your comment may take a few minutes to appear on the site."}, {"articleID": "2012070523_00050071_W", "names": {"Cristina Fernandez": ["Q40649", "Q5791451"]}, "date": "2012-07-05", "url": "http://uk.reuters.com/article/2012/07/05/uk-argentina-rights-idUKBRE8641AE20120705?feedType=RSS&feedName=worldNews", "content": "buenos aires (reuters) - three key figures from argentina's \"dirty war\" got hefty jail terms for the systematic theft of babies from political prisoners during the 1976-1983 dictatorship, an argentine court ruled on thursday. the missing children - stolen from their parents and illegally adopted, often by military families - are one of the most painful legacies of the crackdown on leftist dissent in which rights groups say up to 30,000 people were killed. just over 100 of the children have discovered their true identities, but many families are still searching more than three decades later. activists say there could be several hundred more individuals who do not know they were taken as babies from their parents. \"this is what we were seeking. we never wanted revenge, we were never hateful, we didn't ask for anything more than justice and justice has been done,\" an elderly man who identified himself as francisco madariaga's grandfather told local television. the sentences in the case known as \"the systematic plan\" investigated the theft and illegal adoption of 34 of the stolen infants. the 11 defendants included former junta leaders jorge rafael videla, 86, and reynaldo bignone, 84, and ex-navy officer jorge acosta - known as the tiger. they are already serving life sentences for previous human rights convictions. videla was sentenced to 50 years in prison as the architect of the plan, while acosta got 30 years and bignone 15. the other defendants were also ordered to serve sentences of various lengths. videla, who is unrepentant about rights abuses committed by the state, described himself as a \"political prisoner\" during the trial and said any abductions that did take place were not part of a systematic plan. \"the women giving birth, who i respect as mothers, were militants who were active in the machine of terror,\" the former dictator said in his closing remarks. \"many used their unborn children as human shields .\" some of the stolen babies were born to women held at clandestine torture centres. nurses have told how some babies were breast-fed by their mothers for several days, while others were taken away immediately. there were no birth certificates, making the task of identifying them and reuniting them with their parents' relatives painstaking and lengthy. most of the 34 children in the case have been identified. they include pro-government city legislator juan cabandie, now 34, who was born at the infamous esma naval mechanics school when his 16-year-old mother alicia was held there. he was adopted by a policeman and given a new name. another is leftist lawmaker victoria donda, whose parents were also kidnapped and held at the esma before disappearing without trace. others, like clara anahi mariani, are still missing. as a three-month-old infant, she was kidnapped when state security services raided her home in 1976, killing her mother and fellow leftist activists in the central city of la plata. her grandmother, maria isabel chorobik de mariani, has been searching for clara anahi ever since. \"a lot of girls come here to see if they are clara anahi,\" said chorobik, who was knitting a sweater for her granddaughter when the raid took place at her son's house on a november night 36 years ago. \"at first, it was awful to find out that a girl who had the same birthday, the same name and a bunch of other things that made us think it was her didn't match up in the (dna) test,\" she told reuters television. \"my soul's become hardened .\" chorobik founded human rights group the grandmothers of the plaza de mayo to search for the stolen babies of the \"disappeared\" children. so far 102 have been identified, but campaigners say there could be several hundred more who are yet to discover their true identities. when the dictatorship fell in 1983, courts convicted former members of the military junta of human rights crimes. they were later released under an amnesty. in 2005, argentina's supreme court struck down the amnesty at the urging of then-president nestor kirchner, late husband of current president <mark>cristina fernandez</mark>. the kirchners met as student activists in the 1970s, and several of their friends were kidnapped and killed for political activities. since then, courts have convicted and sentenced a series of former military and police officers on human rights charges. the convictions have brought some comfort to rights activists including chorobik. but she says the nightmare of the stolen babies will haunt the victims and their families for years to come. \"sometimes when newspapers report that a missing child has been found and they've met their family, people think it's a fairy tale,\" she said. \"but behind all this, there's a heavy burden on these kids. i'm sure clara anahi has buried in her memory the noise of that attack, the yelling and the gunshots and being separated from her mother .\" we welcome comments that advance the story through relevant opinion, anecdotes, links and data. if you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. views expressed in the comments do not represent those of reuters. for more information on our comment policy, see our flagship financial information platform incorporating reuters insider an ultra-low latency infrastructure for electronic trading and data distribution a connected approach to governance, risk and compliance thomson reuters is the world's largest international multimedia news agency, providing, and interactive television platforms. thomson reuters journalists are subject to an"}, {"articleID": "2019032108_00364697_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2019-03-21", "url": "http://wboc.com/story/40170539/report-myanmar-china-failing-to-stop-bride-trafficking", "content": "Report: Myanmar, China failing to stop \"bride' trafficking - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Report: Myanmar, China failing to stop\" bride' trafficking - WBOC-TV 16, Delmarvas News Leader, FOX 21 - Member Center: Report: Myanmar, China failing to stop \"bride' trafficking Posted: Thursday, March 21 2019 12:21 AM EDT 2019-03-21 04:21:31 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:41 GMT (AP Photo/Ted S. Warren, File). In this Monday, March 11, 2019 file photo, a Boeing 737 MAX 8 airplane being built for TUI Group sits parked in the background at right at Boeing Co.'s Renton Assembly Plant in Renton, Wash.. The Transportation Department...(AP Photo/Ted S. Warren, File). In this Monday, March 11, 2019 file photo, a Boeing 737 MAX 8 airplane being built for TUI Group sits parked in the background at right at Boeing Co.'s Renton Assembly Plant in Renton, Wash.. The Transportation Department...The decision by Europe and Canada to break with U.S. air-safety regulators over the safety of the Boeing 737 Max is likely to delay the resumption of flights after two deadly crashes. More The decision by Europe and Canada to break with U.S. air-safety regulators over the safety of the Boeing 737 Max is likely to delay the resumption of flights after two deadly crashes. More Thursday, March 21 2019 1:41 AM EDT 2019-03-21 05:41:40 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:31 GMT (Roberto E. Rosales/The Albuquerque Journal via AP, Pool, File). FILE - This Aug. 13, 2018 pool file photo shows defendants, from left, Jany Leveille, Lucas Morton, Siraj Ibn Wahhaj and Subbannah Wahhaj entering district court in Taos, N.M., for a dete...(Roberto E. Rosales/The Albuquerque Journal via AP, Pool, File). FILE - This Aug. 13, 2018 pool file photo shows defendants, from left, Jany Leveille, Lucas Morton, Siraj Ibn Wahhaj and Subbannah Wahhaj entering district court in Taos, N.M., for a dete...Five former residents of a New Mexico compound are scheduled to appear in federal court on terrorism-related charges that include conspiring to attack U.S. law enforcement and military members. More Five former residents of a New Mexico compound are scheduled to appear in federal court on terrorism-related charges that include conspiring to attack U.S. law enforcement and military members. More Thursday, March 21 2019 1:21 AM EDT 2019-03-21 05:21:33 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:19 GMT (AP Photo). This combination photo shows actress Lori Loughlin at the Women's Cancer Research Fund's An Unforgettable Evening event in <mark>Beverly Hills</mark>, Calif., on Feb. 27, 2018, left, and actress Felicity Huffman at the 70th Primetime Emmy Awards in Los...(AP Photo). This combination photo shows actress Lori Loughlin at the Women's Cancer Research Fund's An Unforgettable Evening event in <mark>Beverly Hills</mark>, Calif., on Feb. 27, 2018, left, and actress Felicity Huffman at the 70th Primetime Emmy Awards in Los...Will\" Aunt Becky' and other parents charged with college scam see prison time? Experts differ on the probability. More Will \"Aunt Becky' and other parents charged with college scam see prison time? Experts differ on the probability. More Thursday, March 21 2019 1:11 AM EDT 2019-03-21 05:11:32 GMT Updated: Thursday, March 21 2019 4:21 AM EDT 2019-03-21 08:21:18 GMT (AP Photo/Rogelio V. Solis). This March 11, 2019 photo shows a makeshift levee built by a resident in Rolling Fork, Miss., to protect his home from flood waters. In March 2019, scientists are warning that historic flooding could soon deluge parts of se...(AP Photo/Rogelio V. Solis). This March 11, 2019 photo shows a makeshift levee built by a resident in Rolling Fork, Miss., to protect his home from flood waters. In March 2019, scientists are warning that historic flooding could soon deluge parts of se...Scientists are warning that historic flooding could soon deluge parts of several southern states along the lower Mississippi River, where flood waters could persist for several weeks. More Scientists are warning that historic flooding could soon deluge parts of several southern states along the lower Mississippi River, where flood waters could persist for several weeks. More By ELAINE KURTENBACHAssociated Press BANGKOK (AP) - Authorities in China and Myanmar are failing to stop the brutal trafficking of young women, often teenagers, from the conflict-ridden Kachin region for sexual slavery, according to a report by Human Rights Watch. The report released Thursday says women are often tricked into traveling to China in search of work or kidnapped and held against their will to be sold as\" brides \"for Chinese men. Most of those taken hostage by Chinese families are locked up and raped, it says. Those who do escape are often obliged to leave children fathered by Chinese men behind. The report urges authorities to do more to raise awareness about the risks of trafficking, provide more support for victims who return home, and to prosecute those guilty of crimes against them. The 226 known cases of such trafficking in 2017 were only a fraction of the total number, since many victims are afraid or ashamed to come forward, especially given the lack of support from law enforcement or welfare services, the report says .\" Human Rights Watch's research suggests the number of women and girls being trafficked is substantial and possibly growing, \"it said. The group interviewed 37 survivors of such crimes for the report. It said the women were sold to Chinese families for the equivalent of $3,000 - $13,000 each. Twelve of those interviewed were under 18 when they were trafficked. The youngest was 14. It said 22 of them were held for a year or longer. Often, the women are drugged and taken captive, left at the mercy of families with whom they can barely communicate .\" Most were locked in a room and raped repeatedly as the families that bought them wanted them to become pregnant, \"said Heather Barr, author of the report and a co-director for women's rights at Human Rights Watch. The traffickers are able to lure women with false promises of jobs because of the lack of good options for making a living in camps for displaced people in northern Myanmar's Kachin state. As of September, there were about 100,000 people displaced inside Kachin, where the Kachin Independence Army, like other ethnic minority armed groups, has been fighting for greater autonomy for decades. Thousands of women and children have also fled their homes in neighboring Shan state, some across the border into China. The porous border between southern China's Yunnan province and northern Kachin facilitates such trafficking, and the relative shortage of marriageable women, thanks to Chinese traditions favoring male heirs over girls has left many families in China desperate for brides. Although Chinese authorities have been battling trafficking inside China as well, the families who buy the women are almost never prosecuted, the report says. Some foreign brides from neighboring countries go voluntarily. But for many, the experience is harrowing. One interviewee, Ja Htoi Tsawm, was kidnapped while doing farm work in China to support her family and held captive for two years. While she was away her in-laws sold her house and put one of her children in an orphanage. Another of her four children died. The report said that Myanmar police and other authorities refused interviews by Human Rights Watch although the Ministry of Social Welfare did provide some data. Myanmar anti-trafficking police said they handled 130 cases of trafficking, 96 of which involved women, in January-July 2018, the report said. Of 820 successful prosecutions for trafficking in 2008-2013, 534 cases involved forced marriages and an even larger share were with China. The trafficking networks span China Chinese authorities did not respond to requests for comment, it said. The persisting conflict in areas of Myanmar has left millions of women and children vulnerable to great risk. U.N. investigators reported last fall on a fact-finding mission that found violence by the Myanmar military in Kachin, Shan and the western state of Rakhine. It cited allegations of crimes by the military and other security forces including murder, torture, pillaging, execution without due process, rape, sexual slavery and hostage taking. Members of the Kachin Women's Association, a group affiliated with the Kachin Independence Organization that helps victims, were quoted as saying that at times they lack the money to help provide and top up SIM cards needed to keep in contact with the women still stuck in China. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2010022115_00043446_W", "names": {"Rajiv Sharma": ["Q16223440", "Q47532510", "Q57286957"]}, "date": "2010-02-21", "url": "http://prmac.com/release-id-10946.htm", "content": "iright release ruraltunes on the bandkit framework for iphone iphone [prmac.com] edinburgh, uk - iright has released ruraltunes 1.0 for the iphone and ipod touch. ruraltunes is a new application for the experimental musician on the rural electrification administration (rea). ruraltunes is powered by bandkit an innovative new iphone framework that allows artists and musicians to connect to their audiences. ruraltunes is a unique application that gives fans access to 5 exclusive new tracks, an in depth biography, 12 new photographs and up to date information via the rea twitter feed and myspace page. bandkit is a powerful new promotional tool designed to connect artists and musicians to their audiences. feature highlights: * streamed or in-application music accessible in an instantly familiar ipod application like interface * a photo thumbnail gallery providing access to a collection of artist images, interacting via familiar pinch, swipe and multi-touch gestures * biographies providing fans with in-depth information about the artist * direct access to artist web pages, twitter and rss feeds allows artist to push out fresh information on their feeds \"we are passionate about music at iright and wanted to create an immersive media centric application framework that allowed us to create tailored applications for bands and artists\" said <mark>rajiv sharma</mark>, co-founder of iright. \"artists can send us music, images, web links and the like and we can quickly craft individual feature rich applications that allow them to connect with their audiences in exciting, familiar and useable ways. our goal at iright is to create beautiful and naturally intuitive applications for our customers and users .\" device requirements: * iphone and ipod touch * requires iphone os 3.0 or later * 33 mb screenshot located in edinburgh, united kingdom, iright is a small privately held company founded in 2009 by <mark>rajiv sharma</mark> and one other co-founder. with more than 20 years combined experience of enterprise application design and user interface experience they founded iright to specialise in the creation of software for iphone, ipod touch and now ipad platforms. copyright (c) 2009 - 2010 iright. all rights reserved. apple, the apple logo, iphone, ipod touch, itunes, app store and ipad are registered trademarks of apple computer inc. in the u.s. and/or other countries."}, {"articleID": "2010111123_00316936_W", "names": {"James White": ["Q15451493", "Q16018627", "Q16105007", "Q17141088", "Q19578234", "Q23760213", "Q2540459", "Q27831214", "Q38804225", "Q43915057", "Q50652502", "Q57572486", "Q6145405", "Q6145421", "Q6145425", "Q6145429", "Q6145434", "Q926014"]}, "date": "2010-11-11", "url": "http://121youth.wordpress.com/2010/11/11/talk-about-god-or-talk-to-god/", "content": "\"watch your life and doctrine closely. persevere in them, because if you do, you will save both yourself and your hearers .\" (1 timothy 4:16) \"are you a calvinist? well, i'm more of an augustinian .\" i had to chuckle when i overheard this conversation at a debate i attended on january of last year. but at the same time, i was concerned that many of us christians are more concerned with labels and theological terminology rather than the object of our terminology. in other words, do we talk more about god rather than talking to god? does our theological rhetoric have any impact in our daily walk with our saviour? i purposely used the pronoun \"our\" because i have to honestly confess that i am guilty of this as well. \"theology matters!\" , as <mark>james white</mark> so eloquently puts it. every christian is a theologian in some sense. we are always learning more about the lover of our soul everyday as we fellowship with him. our theology will inevitably determine how we view god, ourselves, worship, his word, the world around us, etc. so if you don't have a sound, biblical theology and doctrine, then you will miss out on the joy of knowing jesus christ more intimately. moreover, you may end up loving someone else other than the triune god of the scriptures. i am okay with calling myself a 5 point calvinist, reformed baptist, dichotomist, etc. but these titles are meaningless if they bear no weight upon my soul. many have asked me, \"does it really matter if you are a calvinist or not?\" i would say it most certainly does! albert n. martin wrote a compelling booklet called, \"the practical implications of calvinism\" , which you can find and purchase on my recommended books page. he addresses how the doctrines of grace should have a direct affect on a christian's every day life. here is an excerpt, \"what is the personal practical effect of the confession of calvinism in the life of a man? if he sees god, it will break him, and if he understands that god saves sinners, it will make him a trustful, prayerful, watchful person pursuing practical godliness. is that what these doctrines are for you right where you sit this morning?\" (pg .23) pastor loves tattoos, but? tattoos & body piercings the ot: the old testament law commanded the israelites, \"do not cut your bodies for the dead or put tattoo marks on yourselves. i am the lord\" (leviticus 19:28). so, even though believers today are not under the old testament law (romans 10:4; galatians 3:23 -25; ephesians 2:15), the fact that there [...] \"why i hate religion!\" i can't stand religion, one look at my \"about me\" and you notice i make it known in the very first sentence that i am not a \"religious person .\" i know it might sound like an oxymoron, \"how does the christian kid not like religion?\". well i saw this video about a year ago for [...]"}, {"articleID": "2019080222_00025646_W", "names": {"Kevin Mcaleenan": ["Q21467160", "Q30122656"], "Karen Bass": ["Q23662231", "Q23830953", "Q461739"], "Steve Cohen": ["Q21451639", "Q22662502", "Q41787447", "Q512330", "Q7612227", "Q7612228"], "Dwight Evans": ["Q5318148", "Q5318152"], "Ruben Gallego": ["Q16218474", "Q516843"], "Jim Mcgovern": ["Q1337459", "Q57913018", "Q584351", "Q6196820"], "Donald Payne": ["Q39075328", "Q5294987"], "Bobby Rush": ["Q888599", "Q888655"], "Juan Vargas": ["Q20899722", "Q3791701"]}, "date": "2019-08-01", "url": "http://commondreams.org/news/2019/08/01/33-house-democrats-demand-resignation-us-border-patrol-chief-over-secret-facebook", "content": "Common Dreams 33 House Democrats Demand Resignation of U.S. Border Patrol Chief Over Secret Facebook Group The lawmakers wrote in a new letter that Carla Provost \"was a willing participant\" in the group, where agency staff shared \"atrocious commentary that stokes racist and xenophobic tropes .\" by 0 Comments U.S. Border Patrol Chief Carla Provost testified before the Judiciary Committee hearing on the subject \"The MS-13 Problem: Investigating Gang Membership, its Nexus to Illegal Immigration, and Federal Efforts to End the Threat\" at the Dirksen Senate Office Building on June 21, 2017. (Photo: Donna Burton/CBP/cc) In a letter Thursday to Acting Homeland Security Secretary <mark>Kevin McAleenan</mark>, 33 House Democrats demanded that U.S. Border Patrol Chief Carla Provost resign over her participation in a secret Facebook group in which members of the federal agency shared racist, sexist, and violent comments about migrants and members of Congress. Early last month, ProPublica reported on a Facebook group called \"I'm 10-15,\" which references the Border Patrol code for \"aliens in custody .\" Created in August of 2016, the group had nearly 10,000 members who were currently or formerly employed by the Department of Homeland Security. Just days after the initial report, The Intercept's Ryan Devereaux revealed that Provost was a member of the group. The nearly three dozen lawmakers, including Democratic Reps. Ayanna Pressley (Mass.) and Susan Wild (Penn.), charged in their letter (pdf) to <mark>McAleenan</mark> that Provost \"has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice .\" They wrote in part: Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share [contemptible] and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. While Provost initially publicly expressed surprise about the group, promised that employees who participated would be held accountable, and said the DHS Inspector General's Office would be investigating the matter, the letter pointed out that \"conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months .\" \"It is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office,\" the lawmakers declared, calling on <mark>McAleenan</mark> \"to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation .\" In a tweet announcing the letter, Pressley called Provost's participation in the group \"deeply disturbing and absolutely unacceptable .\" She wrote that if <mark>McAleenan</mark> \"has one ounce of dignity left, he'll demand her resignation immediately .\" The @ CBP Chief's participation in a group filled with racist & misogynistic attacks on Members of Congress & migrant families in her care is deeply disturbing & absolutely unacceptable. If @ DHSMcAleenan has one ounce of dignity left, he'll demand her resignation immediately. pic.twitter.com/PHrYythp4p--Congresswoman Ayanna Pressley (@ RepPressley) August 1, 2019 The lawmakers, in the letter, also highlighted the humanitarian crisis at the U.S. Southern border--from the forcible separation of children from their parents to the inhumane conditions in which migrants have been detained. According to the letter Thursday, \"the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch .\" SCROLL TO CONTINUE WITH CONTENT Get our best delivered to your inbox. \"The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership,\" the letter continued. \"These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders .\" In addition to Pressley and Wild, the letter was also signed by Democratic Reps. <mark>Karen Bass</mark> (Calif.), <mark>Steve Cohen</mark> (Tenn.), Madeleine Dean (Penn.), Rosa DeLauro (Conn.), Nanette Diaz Barragan (Calif.), Madeleine Dean (Penn.), Adriano Espaillat (N.Y.), <mark>Dwight Evans</mark> (Penn.), <mark>Ruben Gallego</mark> (Ariz.), Sylvia Garcia (Texas), Raul Grijalva (Ariz.), Deb Haaland (N.M.), Pramila Jayapal (Wash.), Barbara Lee (Calif.), Andy Levin (Mich.), Alan Lowenthal (Calif.), Ben Ray Lujan (N.M.), Tom Malinowski (N.J.), <mark>Jim McGovern</mark> (Mass.), Gregory Meeks (N.Y.), Frank Pallone (N.J.), <mark>Donald Payne</mark> Jr. (N.J.), Mark Pocan (Wis.), <mark>Bobby Rush</mark> (Ill.), Jan Schakowsky (Ill.), Darren Soto (Fla.), Rashida Tlaib (Mich.), <mark>Juan Vargas</mark> (Calif.), Marc Veasey (Texas), Nydia Velazquez (N.Y.), and Bonnie Watson Coleman (N.J.). Read the full letter below: Dear Acting Secretary <mark>McAleenan</mark>: We, the undersigned Members of Congress, request that you immediately request the resignation of Carla Provost, Chief of the U.S. Border Patrol, who has lost the public's confidence that she can faithfully execute the responsibilities of her position without bias or prejudice. Ms. Provost was a willing participant in a secret Facebook group used by employees of her agency to share contemptable and atrocious commentary that stokes racist and xenophobic tropes that have no place in private, much less in public service. The Facebook group, originally known as \"I'm 10-15,\" generated content that joked about migrant deaths and throwing burritos at Members of Congress, and even went so far as to make sexually violent and threatening statements about female members of Congress who came to the border to inspect the conditions at detention centers. We worry this content impugns the character of the U.S. Border Patrol as a whole. Earlier this month, Ms. Provost expressed surprise about the Facebook group at issue and publicly stated, \"[t] hese posts are completely inappropriate and contrary to the honor and integrity I see--and expect--from our agents day in and day out .\" She also promised that \"[a] ny employees found to have violated our standards of conduct will be held accountable .\" At that same time, she stated that she had alerted the DHS Inspector General's Office and an investigation would be launched. Conspicuously absent from her statement was an admission that she had been a member of the Facebook group for months--as evidenced by her comments on a particular post questioning her ascent to Chief--or an explanation as to why she hadn't already alerted DHS of the Facebook group. As Chief of U.S. Border Patrol it is Ms. Provost's responsibility to discipline employees who fall under her agency's auspices, not participate in conduct unbecoming of her office. It appears that to date CBP employees have only received cease and desist letters or been placed on administrative duties pending investigation--and only after the Facebook group came to light through news reports. For the avoidance of any doubt, the callousness displayed in the Facebook group is matched only by the callous treatment of children detainees under Ms. Provost's watch. The conditions at these detention centers--which include limited access to basic hygienic needs like showers, toothpaste, and clean clothes--are not just failures of sufficient funding, they are failures of leadership. These Facebook posts suggest that the culprit is not just lack of resources but a level of malice that has no place in the policing of our borders. As Members of Congress, we are committed to ensuring that those who occupy top positions in federal government are held to the highest standards. This is especially true of the Chief of U.S. Border Patrol, at a time when conditions at our southern border have reached a crisis point. As such, we urge you to follow Ms. Provost's own promise of accountability, by immediately seeking her resignation. Our work is licensed under a Creative Commons Attribution-Share Alike 3.0 License. Feel free to republish and share widely. This is the world we live in. This is the world we cover. Because of people like you, another world is possible. There are many battles to be won, but we will battle them together--all of us. Common Dreams is not your normal news site. We don't survive on clicks. We don't want advertising dollars. We want the world to be a better place. But we can't do it alone. It doesn't work that way. We need you. If you can help today--because every gift of every size matters--please do. Without Your Support We Won't Exist. Please select a donation method: Share This Article"}, {"articleID": "2010021622_00050565_W", "names": {"Ali Ahmed": ["Q44749742", "Q4724574", "Q55483636"]}, "date": "2010-02-16", "url": "http://redorbit.com/news/health/1823907/heart_failure_worse_when_right_ventricle_goes_bad/index.html?source=r_health", "content": "heart failure worse when right ventricle goes bad posted on: tuesday, 16 february 2010, 14:36 cst new research from the university of alabama at birmingham (uab) suggests that the ability of right side of the heart to pump blood may be an indication of the risk of death to heart-failure patients whose condition is caused by low function by the left side of their heart. the ability of the two chambers of the heart, the left and right ventricles, to pump blood is described as ejection fraction. healthy individuals typically have ejection fractions between 50 and 65 percent in both chambers. in findings reported in january in circulation, a journal of the american heart association, researchers at uab say that low right-ventricular ejection fraction (rvef) increased the risk of death in patients with systolic heart failure - heart failure associated with low left-ventricular ejection fraction. \"the role of the right ventricle in chronic systolic heart failure has been overlooked for many years, in part because it was considered to be merely a passive chamber,\" said <mark>ali ahmed</mark>, m.d, mph., associate professor of medicine in the division of cardiovascular disease and the senior author of the study. \"studies of the effect of rvef on outcomes in heart failure have been limited by small sample size and short follow-up .\" using data from 2,008 patients with advanced chronic systolic heart failure in the beta-blocker evaluation of survival trial sponsored by the national heart, lung and blood institute, one of the national institutes of health, the uab team discovered that death rates went up as rvef went down. patients with a rvef of greater than 40 percent had a death rate of 27 percent during the two-year study. but when the rvef dropped to less than 20 percent, the death rate increased to nearly half, or 47 percent, of the patients. \"our study suggest that rvef is a marker of poor prognosis in patients with heart failure and should be routinely measured to better identify these at-risk patients and provide appropriate therapy for them,\" said <mark>ahmed</mark>. \"future studies need to determine the risk factors for rvef impairment and to develop and test interventions that may improve outcomes in heart failure patients with low rvef .\" popular diabetes drugs linked to increased risk of heart failure and death kidney function decline increases risk of heart failure, premature death certain combined medications following heart attack could increase risk of death berlin heart enrolls first patient in us multi-center excor (r) pediatric vad ide study quality data release shows n.j. hospitals among nation's best in caring for heart attack, pneumonia patients lipitor more effective than simvastatin in cutting risk of additional heart attacks in patients who had a recent heart attack, new data suggests nocturnal dialysis improves heart disease in patients with end-stage kidney failure mri is better than spect in assessing heart damage in patients with hypertrophic cardiomyopathy"}]