[{"articleID": "2016080123_00359263_W", "names": {"Thomas Falk": ["Q7789507", "Q7791054"]}, "date": "2016-08-01", "url": "http://www.fool.com/investing/2016/08/01/forex-dents-kimberly-clark-corp-earnings.aspx?source=iedfolrf0000001", "content": "Data source: Kimberly-Clark Q2 2016 Earnings Press Release. What happened with Kimberly-Clark this quarter? Organic sales grew 3%, driven by a 4% increase in volume. However, net sales decreased 1.2% to $4.6 billion, as these gains were more than offset by a 4% negative impact from foreign exchange. Adjusted operating profit--which excludes restructuring costs, pension settlement charges, and other nonrecurring items--rose 5% to $828 million, as cost savings related to Kimberly-Clark's FORCE (Focused on Reducing Costs Everywhere) program and lower raw-material costs boosted results. All told, adjusted net income, which benefited from a lower effective tax rate, increased 7.8% to $556 million. And adjusted earnings per share, aided by share buybacks, rose 8.5% to $1.53. What management had to say \"We delivered a good quarter of results in a challenging environment while we continue to execute our long-term Global Business Plan strategies,\" said chairman and CEO <mark>Thomas Falk</mark> in a press release. \"In the second quarter, we achieved a 4 percent increase in sales volumes, with benefits from targeted growth initiatives and product innovations. We also delivered $110 million of cost savings, which helped improve our profitability and increase our adjusted earnings per share.\" Cash flow and capital returns Second-quarter operating cash flow rose 11% to $860 million, due to Kimberly-Clark's higher cash earnings and improved working capital, and free cash flow jumped 29% to $683 million. Management remains committed to passing on this cash flow to Kimberly-Clark's investors via dividends and stock buybacks, with the company repurchasing 1.1 million shares at a cost of $150 million in the second quarter. The quarterly dividend is $0.92 per share. Looking forward Kimberly-Clark reiterated its full-year adjusted EPS forecast of $5.95 to $6.15. However, the company now expects its organic sales growth to be at the low end of its prior guidance of 3% to 5%, which is likely to be offset by a 4% to 5% negative impact from foreign exchange. \"Cash flow was strong in the quarter and we continued to allocate capital in shareholder-friendly ways,\" added <mark>Falk</mark>. \"Half way through the year, we are broadly on track with our plans and are confirming our bottom-line earnings guidance for 2016.\" Joe Tenebruso has no position in any stocks mentioned. The Motley Fool recommends Kimberly-Clark. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy. Author"}, {"articleID": "2015091422_00002541_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2015-09-14", "url": "http://dailykos.com/story/2015/09/14/1421210/-Donald-Trump-is-hoping-for-political-attacks-Everybody-who-attacks-me-is-doomed?detail=hide", "content": "<mark>Donald Trump</mark> is hoping for political attacks. \"Everybody who attacks me is doomed .' 23 Comments Republican presidential front-runner <mark>Donald Trump</mark> only has one formal position paper, on immigration. He has little in the way of campaign staff, and still less in the way of campaign staff with campaign experience or high-level policy advisers formally associated with the campaign.\" A lot of what I'm doing is by instinct, \"Mr. <mark>Trump</mark> said in one of several interviews.\" I assimilate a lot of information...and I believe in being strategic. \"Instead of surrounding himself with what he called\" political hacks, \"Mr. <mark>Trump</mark> said,\" I don't need an inner circle. \"His rationale: In an\" age of specialization, I am tapping phenomenal people in every field. \"Phenomenal people like Jack Jacobs, the retired Army colonel <mark>Trump</mark> cited as one of his go-to military advisers, only to have Jacobs say he was not advising <mark>Trump</mark> and in fact had never talked about policy with him? But don't worry, <mark>Trump</mark> will totally come up with a tax plan at some point, and possibly other positions outlined in more detail than whatever he blurts out on the stump. And in the mean time, he has nothing to worry about attacks from his political opponents anyway, saying\" I hope they attack me, because everybody who attacks me is doomed. \"If that's true, why even bother doing anything other than inviting people to attack him? Originally posted to Laura Clawson on Mon Sep 14, 2015 at 11:12 AM PDT. Also republished by Daily Kos. Tags"}, {"articleID": "2017062612_00859273_W", "names": {"Terence Lewis": ["Q7701942", "Q7701944"]}, "date": "2017-06-26", "url": "http://www.newsx.com/entertainment/67376-fans-made-our-dream-come-true-divyanka-tripathi-vivek-dahiya-on-nach-baliye-win?pfrom=home", "content": "ALSO READ: Nach Baliye 8 Finale: Divyanka Tripathi and Vivek Dahiya clinch the trophy, defeat Sanaya-Mohit, Abigail-Sanam Vivek, who married the \"Ye Hai Mohabbatein' fame actress in January 2016, said:\" We have just got married and there was so much to discover about each other. \"Both of us wanted to spend more time with each other, understand each other better and get to know each other even more and we feel that this freshness and this willingness to discover each other more was the\" X-Factor' which we had, which the audience was able to genuinely see and connect with. \"The couple feel\" Nach Baliye' has helped them understand each other better. \"\"Nach Baliye' has promoted our relationship by three years as we have got to know each other so much better in these last three months,\" Divyanka said. \"I have learnt that Vivek is such a positive person and he feels nothing is impossible. No matter how difficult the choreography was, he would say\" It's easy and we can do this', \"she added. Vivek said:\" I have learnt that Divyanka is extremely strong and won't let anything deter her. In this case, even though she had her ailments (ligament tear and back problem), she continued and kept saying, \"We can do it'.\" \"Nach Baliye 8', aired on Star Plus, featured actress Sonakshi Sinha, filmmaker Mohit Suri and ace choreographer <mark>Terence Lewis</mark> as judges. First Published | 26 June 2017 5:44 PM Read News On:"}, {"articleID": "2018092917_00052881_W", "names": {"Amit Sood": ["Q16885800", "Q23784357"]}, "date": "2018-09-29", "url": "https://www.thehindu.com/news/national/now-undertake-a-virtual-journey-on-the-railways-with-google/article25084177.ece", "content": "Now, undertake a virtual journey on the Railways with Google September 29, 2018 22:24 IST Updated: September 29, 2018 22:25 IST Share Article September 29, 2018 22:24 IST Updated: September 29, 2018 22:25 IST more-in Users can explore more than 150 different places Railway enthusiasts worldwide can now undertake a virtual journey with the Indian Railways, one of the largest and the busiest rail networks, on Google's Arts and Culture platform. The Ministry of Railways, on Friday, partnered with the U.S.-based technology company for an online showcase of its history, museums as well as some of the network's more scenic routes. The virtual tour will enable users to explore more than 150 different places associated with the Indian Railways. \"Anyone can now explore India's railways in detail with over 100 exhibitions that bring together more than 3,000 images, 150 videos and 150 iconic locations across India,\" Google said in a statement. Vintage maps Users can also get a glimpse at the vintage maps of the East Indian Railways that the British had used during the colonial era to connect Calcutta (modern day Kolkata) with the North-Western Provinces or the oldest functioning steam engines in the world--the Fairy Queen--or take a behind the scenes peek at the Darjeeling loco shed or discover scenic routes such as the Kalka-Shimla railway and the Nilgiri Mountain Railway. \"Over 1,51,000 kilometres of track, 7,000 stations, 1.3 million employees and 160 years of history...Indian Railways is one of the most celebrated railway networks in the world,\" Google said. \"We're bringing Indian Railways' heritage and sights to the entire world.\" Inspiring others <mark>Amit Sood</mark>, Director, Google Cultural Institute, told The Hindu: \"I think there is no other country on our platform with whom we have done a project on what most people consider a public utility service like the railways. But converting that to what it means for the lifeline of the country...there is no narrative like that in any of the markets as of yet.\" He added that the project might inspire other countries to do something similar. \"What we are seeing is that India is moving on our platform from being part of the global project to being\" the' project starting from India, expanding to the world. \"The project:\" The Railways--Lifeline of a Nation', will also bring out the stories of trackmen, station incharge officials and workshop engineers. \"We operate in 70 countries. What we have learnt is that you have to bring to the forefront local narratives,\" Mr. <mark>Sood</mark> said."}, {"articleID": "2017041220_00862572_W", "names": {"Stephanie Davis": ["Q6134141", "Q7608260"]}, "date": "2017-04-12", "url": "http://www.dailystar.co.uk/showbiz/605125/Jess-Impiazzi-bum-Ex-on-the-beach-Jog-on-to-cancer", "content": "WENN TV BABE: Jess found fame on Ex On The Beach The Ex on The Beach babe is known for her toned frame, regularly stripping off via both social media and magazine deals. But on Wednesday night the star managed to leave us lost for words again. Not only did she looked flawless as she arrived at James Ingham's Jog On To Cancer event in central London, but she also added a cheeky slice of sass to her outfit. WENN CHEEKY: Jess exposed her bum in the dress Celebrities in see through dresses Tuesday, 4th April 2017 These celebrities just love the \"naked' dress look. From net dresses, to completely see through, here are some of our favourite naked looks. 1 / 170 Getty Images Savannah Chrisley underwear in see-through gown FAMEFLYNET SNAP: Lizzie arrived in a similar dress Mirroring former WAG Lizzie Cundy by rocking a sheer dress, the MTV star left ditched both her bra and underwear for maximum effect. Jess completed the look by wearing her hair tied up in a high ponytail. Proudly posing up a storm, Rogan O'Connor's ex turned up the heat by turning her back on the eager cameras to reveal her perky rump. And we don't just mean she was teasing it. INSTAGRAM TEASE: Jess sexes up a storm on her social media Jess Impiazzi strips off Monday, 17th October 2016 Reality TV babe Jess Impiazzi flaunts her incredible figure 1 / 112 No, the leotard section of Jess's dress rode up so high it had about as much--or little--material as a thong. But don't get any ideas lads. The model is happily engaged to rugby ace Denny Solomona. INSTAGRAM GOING STRONG: Jess and Denny are still together The couple are thought to be stronger than ever after initially splitting in the first half of 2016, only to get back together a few months later. Talking about the split, Jess told The Daily Star:\" Denny and I broke up at the beginning of the year, which has been quite hard because we bought a place together. \"We were only dating for about six months.\" I've not really met anyone since and that's really had an effect on my heart. \"Related articles\" Drinking Jack til I fell asleep' <mark>Stephanie Davis</mark> drops surprise song Casey Batchelor shows off her ever growing assets in plunging display Lizzie Cundy forgets her knickers in boob and bum exposé"}, {"articleID": "2015121322_00324636_W", "names": {"John Harbaugh": ["Q2412102", "Q29344932"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"]}, "date": "2015-12-13", "url": "http://www.csnmidatlantic.com/football-baltimore-ravens/talk/harbaugh-worst-game-weve-played-all-year", "content": "<mark>Harbaugh</mark>: \"Worst game we've played all year' Submitted by Anonymous (not verified) on Sun, 2015-12-13 17:18 Your browser does not support iframes. <mark>Harbaugh</mark>:\" Worst game we've played all year' December 13, 2015, 4:45 pm Share This Post Comments BY ERIC GARLAND, CSNmidatlantic.com Ravens head coach <mark>John Harbaugh</mark> didn't mince words during his postgame press conference, calling his team's blowout loss to the Seahawks \"the worst game we've played all year.\" \"We had assignment issues, we had technique issues, we didn't match up correctly, it was bad,\" he said of the team's 35-6 loss to Seattle. Seahawks quarterback <mark>Russell Wilson</mark> crushed the Ravens secondary, throwing for 292 yards and five touchdowns, but <mark>Harbaugh</mark> wouldn't call out any specific player despite the poor outing. \"It's no individual guy's fault, it's just not as good as it needs to be,\" <mark>Harbaugh</mark> said. \"I'll take responsibility for that. We've got to play way, way better pass defense.\" The offensive side of the ball wasn't much kinder to the Ravens, with fill-in quarterback Jimmy Clausen throwing a pick and having no touchdown passes. The Ravens also only gained 17 yards on the ground as a team. \"We just have to find a way to play better as a football team,\" <mark>Harbaugh</mark> said. Watch <mark>Harbaugh</mark>'s full press conference in the video above."}, {"articleID": "2012121905_00020203_W", "names": {"Tim Dunn": ["Q48817975", "Q7803453"]}, "date": "2012-12-19", "url": "http://fayobserver.com/articles/2012/12/19/1225098", "content": "who would you like us to say this is from? what email address would you like us to send it to? published: 12:00 am, wed dec 19, 2012 harold medlock and malik aziz each offered compelling arguments for why they should be this city's top cop. \"we don't tolerate crime,\" said aziz, 44, a deputy chief of the dallas - yes, that would be texas - police department. and where you find \"guns, gangs and drugs,\" he said, you'll find malik aziz. medlock said as much, and echoed the recent refrain of city manager ted voorhees. \"we're not going to tolerate crime,\" said medlock, 55, who is a deputy chief with the charlotte-mecklenburg police department. \"one crime is one crime too many, and one victim is one victim too many. and not acceptable.\" aziz and medlock are finalists from a field of 131 applicants, according to voorhees, who introduced both tuesday at the kiwanis recreation center and later at the westover recreation center. \"the next thing i plan to do is take them to a bank robbery,\" voorhees, 48, humorously told the noon audience, \"and see how they handle it.\" voorhees later said he will decide before year's end, if not sooner, who will replace tom bergamine, the 58-year-old chief who closed out a nearly four-decade career amid a community-polarizing racial-profiling controversy that led to an equally controversial city council-imposed moratorium on police consent searches. the finalists were peppered with inquiries on everything from drinking while driving, property crimes and community interaction, particularly involving youth, and our political landscape. \"how are you going to cut through\" the politics, <mark>tim dunn</mark>, a lawyer, wanted to know, and do the job you will be hired to do? \"i'm a cop,\" medlock said. \"i'm like harold,\" aziz said. both said the issue of racial profiling is best dealt with through transparency and documentation. sizing 'em up medlock is personable and engaging, with something of a sense of humor and some apparent local knowledge. \"i know the fayetteville police department,\" he said, \"and i know the city of fayetteville. and i will be accountable to you.\" medlock has been married \"to the same woman for 31 years,\" and he grew up the son of a baptist minister. he has spent the past two years as a security planner in his department in preparation for the recent democratic national convention in charlotte. aziz appears somewhat reserved and grew up the son of a truck-driver father and schoolteacher mother, and he is the father of two, including a 15-year-old daughter with her eye on attending the university of north carolina at chapel hill. \"it's a great opportunity,\" aziz said about potentially becoming our next police chief. \"it's a perfect fit ....your community will be my community.\" fayobserver.com is using facebook comments. you must have a facebook account and be logged in to facebook to post your comment below. your comment is subject to view previous polls most popular on fayobserver.com 1 killed in small plane crash near robeson-cumberland county line decorated army doctor killed in robeson county plane crash; was fayetteville va's acting chief of surgery"}, {"articleID": "2013052316_00054649_W", "names": {"Roberto Mancini": ["Q23289352", "Q48330", "Q55466310"], "Mick Taylor": ["Q312696", "Q6834811"], "Heather Graham": ["Q224026", "Q28592327", "Q427886"], "James Milner": ["Q191136", "Q57324227"], "Kate Middleton": ["Q10479", "Q17506155"], "Sergio Garcia": ["Q19878179", "Q3479663", "Q7454265", "Q7454266", "Q7454268"]}, "date": "2013-05-23", "url": "http://www.belfasttelegraph.co.uk/sport/football/premier-league/manchester-city-face-long-haul-to-win-over-new-york-citizens-29290722.html", "content": "Gunmen have kidnapped the father of Afghanistan's national cricket team captain, the sport's chiefs said. Groups of youths have burnt down a restaurant, torched more than 30 cars and injured three police officers in a fourth night of riots in suburbs of the Swedish capital. Manchester City face long haul to win over New York citizens There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Manchester United command and the Abu Dhabi-owned side do not. The marketing materials for the new club are identikit Manchester City. There was sky blue everywhere at the official launch of the club in east Harlem. Manuel Pellegrini faces call on Carlos Tevez contract as Manchester City name starting date Manuel Pellegrini is expected to meet his new Manchester City players a week on Monday, seven days after the club's anticipated confirmation that he is to succeed <mark>Roberto Mancini</mark> and become first-team coach. The Rolling Stones' return to Hyde Park will see them team up with former guitarist <mark>Mick Taylor</mark>, but there will be no reappearance of the white dress Mick Jagger wore at the original 1969 gig because he has lost it. The Hangover III star <mark>Heather Graham</mark> says she will miss playing sexy stripper Jade because the excitement makes up for her \"boring\" real life. Khlo? Kardashian believes girls can never wear too many \"sparkles, glitz and bling\" . Alexa Chung: Heartache inspires trends Alexa Chung has joked that in times of turmoil you can get away with more risky fashion choices than usual. Artificial light from gadgets \"disrupting sleep' Electric lights, including those illuminating laptop computers, smartphones and tablets, often play a key role in causing people to sleep badly, a leading expert has said. Microsoft finally unveils its Xbox ONE console Don Mattrick, the software giant's president of Interactive Entertainment, has told an audience of gaming journalists at Microsoft HQ in Redmond, Washington, that the new Xbox ONE console is not simply a games console, but\" The ultimate all-in-one home entertainment system \". Plenty of Fish dating site pulls\" Intimate Encounters' option to ward off sleazy men New York Giants quarterback Eli Manning looks downfield for <mark>James Milner</mark> By Ian Herbert - 23 May 2013 There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Whelan hopeful Martinez will stay Yankees was dominated by the story of what the paper described as \"inserting a soccer stadium into the green lungs of Queens County\" . Its headline - \"A Team Is Born, but Not All Cheer\" - captured the mood. City's chief executive Ferran Soriano insisted the club were not mindless colonisers. \"In England we run a football club which takes its place in the community very seriously. It embraces its community, listens to its community and that will be exactly the same approach we would aim to take over here. We will listen to people. This is not a marketing trick, this is about soccer. It begins and ends with playing good soccer and we will do our best to be the best.\" Woolwich: Two arrested after separate attacks on mosques as English Defence League supporters clash with police Awesome Cannes: Russian model Irina Shayk and Alessandra Ambrosio dazzle at \"All is Lost' premiere Woolwich: Police shoot two men after soldier is beheaded in London street <mark>Kate Middleton</mark>: nice-but-dull Duchess cuts an annoying baby bump pose You will never be safe: chilling words of man filmed wielding a meat cleaver after soldier is hacked to death in the streets of London FHM's sexiest women poll sees Mila Kunis knock Tulisa off her perch Power NI faces customer exodus over an 18% jump in charges Cannes glamour - stars doll up for red carpet stroll Left Midfield - Ralph Milne The man Ferguson himself labels as his worst ever signing despite only setting him back? 170,000 is almost totally unheard of, largely because he failed to impress at United, contributing almost nothing on the pitch. In some ways he was the second coming of George Best unfortunately this was restricted to his activities off the pitch and Milne recently admitted he squandered most of his money on alcohol, women, and gambling. United was to be his last professional club in England.\" > Sir Alex Ferguson's worst ever starting XI at United FHM's sexiest women - Kunis knocks Tulisa off her perch <mark>Sergio</mark> Garcia/Tiger Woods row: is golf racist? The joke wasn't funny any more. It never was, of course, and the sense of revulsion felt by all in golf weighed heavily on <mark>Sergio Garcia</mark>. Manchester City face long haul to win over New York citizens There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Manchester United command and the Abu Dhabi-owned side do not. The marketing materials for the new club are identikit Manchester City. There was sky blue everywhere at the official launch of the club in east Harlem. Manuel Pellegrini faces call on Carlos Tevez contract as Manchester City name starting date Manuel Pellegrini is expected to meet his new Manchester City players a week on Monday, seven days after the club's anticipated confirmation that he is to succeed <mark>Roberto Mancini</mark> and become first-team coach. <mark>Sergio Garcia</mark> fights for reputation as Tiger Woods slams \"hurtful' joke By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2011021704_00070379_W", "names": {"David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"]}, "date": "2011-02-16", "url": "http://business.scoop.co.nz/2011/02/17/nz-refining-profit-drops-shares-fall-on-spending-plans/", "content": "article - businessdesk feb. 17 (businessdesk) - investors reacted poorly to expansion plans and a return to dividends by new zealand refining ltd., the nation's only oil refinery, despite a 145% increase in net profit in 2010. nz refining shares lead nzx 50 lower on $500m expansion plan by pattrick smellie feb. 17 (businessdesk) - investors reacted poorly to expansion plans and a return to dividends by new zealand refining ltd., the nation's only oil refinery, despite a 145% increase in net profit in 2010. the company said net income rose to $57.7 million, from $23.6 million in 2009. it will pay 10 cents per share final dividend, bringing dividends for the year to 12 cents. the company paid no dividends after a disastrous result 2009, when refining margins fell to as low as us $1 a barrel, compared with a relatively healthy us $6 to $us7 a barrel achieved in 2010. dividends in the previous year, 2008, totalled 45 cents per share. the share price fell 2% to $5 per share today, making it the largest loser in nzx trading. the company announced the board was examining plans to spend a further $400 million to $500 million to increase its new zealand market share to between 75% and 80%, following a return to profit in the year to dec. 31 after a disastrous 2009. the project would be the largest since the $1.8 billion expansion during the think big era of the early 1980's, and follows the $190 million point forward upgrade completed in the last year, and the $180 million future fuels project, finished in 2005. \"a feasibility study has been discussed with the board and our customers' technical experts,\" said chairman <mark>david jackson</mark>. \"directors have today agreed to provide funding of $23 million fo4r the develop of a front end engineering design (feed) report.\" this was due in feb. 2012, and would dictate decisions on whether to proceed. in the 12 months to last december, refinery margins had rebounded \"and remained in a healthy range throughout the year,\" chairman <mark>david jackson</mark> said in a statement to the nzx. \"this trend has continued in 2011, with margins currently tracking the us $6 to us $7 range per barrel range.\" "}, {"articleID": "2010040815_00077123_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2010-04-08", "url": "http://in.news.yahoo.com/137/20100408/760/twl-hamas-move-on-gaza-banks-fuels-banke.html", "content": "hamas's seizure of funds from a gaza strip bank has drawn warnings from bankers that institutions could pull out of the territory, citing a risk to their reputation that would harm their business elsewhere. in a challenge to the west bank-based palestine monetary authority (pma), hamas last month seized around $400,000 from a gaza bank branch whose management had frozen the funds to comply with global anti-money laundering regulations. it was the first time hamas, which has run gaza since 2007, had challenged the authority of the ramallah-based pma--a body that regulates banks operating in the west bank and the gaza strip. hamas said the funds were seized from a local bank in line with a court order challenging the ramallah-based authorities' decision to freeze assets belonging to a medical association. the pma had frozen the funds after the board of the patient's friend association had come under hamas control. analysts said it was only a matter of time before the pma's efforts to comply with international regulations on dealing with groups such as hamas, listed as a terrorist organisation by the united states, brought it into confrontation with the movement. \"all of us are concerned. the banks are concerned and we are equally concerned,\" pma head jihad al-wazir told reuters. bank executives raised their concerns a day after the seizure in a meeting with the pma in ramallah. taher al-nono, spokesman for the hamas government in gaza, said the banks' concerns were unfounded. \"we respect the banking system in palestine,\" nono said. of the 19 banks in the palestinian territories, 12 have branches in the gaza strip. they hold deposits valued at some $900 million. total deposits held by palestinian banks are valued at $7 billion. only local and arab banks operate in gaza but international bank hsbc has a branch in the west bank. the gaza banks have continued to operate since hamas seized control of the territory in 2007 after defeating forces loyal to president <mark>mahmoud abbas</mark>. the prospect of hamas imposing its will on the institutions again could force many to shut down, senior bankers said, citing a risk stemming from global anti-money laundering regulations. their ability to do business elsewhere would be damaged if they were seen to be cooperating with the group, they said. \"banks may take protective measures such as low-profiling or even closing their gaza branches to protect their existence elsewhere,\" said a senior bank official. another banker said: \"if one bank shuts down, other banks will follow.\" the bankers also expressed concern at hamas's plan to levy taxes on businesses in the gaza strip. in a feb. 7 letter sent to banks and other businesses, the hamas-run finance ministry in gaza asked for the payment of taxes it said had not been paid since 2007. a copy of the letter was seen by reuters. a pma official said: \"we told banks to put it in the shredder.\" israeli banks severed ties with banks in the gaza strip in 2007 after the jewish state declared it an \"enemy entity\" . \"gaza branches face either lowering their profiles or shutting down,\" said <mark>mahmoud</mark> al-ram \"a, the general manager of palestine islamic bank."}]