[{"articleID": "2009022708_00005691_W", "names": {"Adam Mckay": ["Q350405", "Q41538972"]}, "date": "2009-02-27", "url": "http://ksl.com/?nid=156&sid=5703692", "content": "on the net: sites aim to be tv guide for the web by jake coyle ap entertainment writer (ap) - you've seen will ferrell's \"landlady.\" you know what hulu is. but that much hyped 21st century invention called the web series remains largely unknown to you. fear not. a host of web sites can direct you to the best series online, including tilzy.tv and tubefilter.tv _ both good blogs that feature knowledgeable seekers of worthy web series. it's a thriving business. the broader online video guide ovguide.com, founded in 2006, earlier this month announced it had received $5 million from venture capital firm baroda ventures after the site's first month of profitability in january. the site eguiders.com began last week, touting itself as the \"tv guide of the web.\" the way it distinguishes itself is primarily through its hollywood guest editors. among them: damon lindelof, co-creator of \"lost\" ; jerry stiller and anne meara; actor willie garson (\"sex and the city\" ); and shawn ryan, the executive producer of \"the shield.\" it's a similar approach of recommendations from well-known personalities like you see on will ferrell and <mark>adam mckay</mark>'s funnyordie.com _ albeit with a wider purview. the site was founded by marc ostrick, who has done web series for tv shows such as fox's \"24\" and hbo's \"john from cincinnati,\" and his partner evangeline morphos, a theater professor at columbia university. after ostrick mentioned the difficulty he had both distributing video content and finding it online, morphos noted that tv had had a similar period of programming confusion before the birth of tv guide in 1953 _ which pooled the resources of several earlier regional guides. \"the greatest problem with content on the internet is people have a hard time knowing where to go to find it,\" says ostrick. \"there's just so much stuff out there.\" david milch, the creator of \"nypd blue\" and \"deadwood,\" is a principal adviser to eguiders. ostrick and milch collaborated on a web component for milch's \"john from cincinnati,\" the confusing drama that was canceled after one season. ostrick says _ and this may further confuse fans _ that the show was ultimately about the internet and whether it might be possible to humanize the internet. milch has said eguiders is \"a good start\" toward this goal. part of the idea is to appeal to older users who might not know their way around the internet well. the 81-year-old stiller is very much in that category. \"i'm also involved with the facespace now. i've picked up a couple of people,\" says stiller, accidentally fusing facebook with myspace. \"facespace? it's facebook,\" corrects meara, his longtime comedy partner and (far more computer literate) wife. (\"seinfeld\" fans, though, might recall the brief computer scheme hatched by stiller's character, frank costanza, after he saw sandra bullock in \"a provocative movie on cable tv; it was called\" the net' with the girl from \"the bus .'\" ) \"i'm on the computer more than jerry and i get a kick out of stuff i see on youtube and hulu,\" says meara, whose responsible for most of the picks by the couple, including \"faux baby\" and the excellent \"jeannie tate show.\" there is some bias, though. stiller also picked a video created by son ben for the film \"tropic thunder.\" he calls it \"impromptu comedic mayhem\" on the site, but explains himself: \"i'm speaking as the dad here, papa jerry.\" \"i guess it's bringing me closer to cyberspace in some way,\" says stiller. \"i can't wait to turn up an old girlfriend on the face -...what is it?\" ___ editor's note _ what's your favorite way to keep abreast of web series? e-mail ap entertainment writer jake coyle at jcoyle (at) ap.org ksl television & radio, salt lake city ut a division of bonneville international m4"}, {"articleID": "2017042203_00422299_W", "names": {"Dinesh Kumar": ["Q1226319", "Q22103957", "Q38589284", "Q43174024", "Q47120567", "Q47946536", "Q5278086", "Q57320749", "Q58794970"]}, "date": "2017-04-22", "url": "http://wap.business-standard.com/article/current-affairs/railway-station-where-pm-narendra-modi-sold-tea-gets-rs-8-cr-for-facelift-117042101437_1.html", "content": "Railway station where PM Narendra Modi sold tea gets Rs 8 cr for facelift Modi used to sell tea during his childhood at the Vadnagar railway station along with his father April 22, 2017 Last Updated at 09:04 IST email this article Type address separated by commas Your Email: Enter the characters shown in the image. Send me a copy: http: //mybs.in/2UV1Yob ALSO READ One lakh blocks to be digitalised soon: Manoj Sinha Meet Manoj Sinha, MoS telecom: The front-runner for Uttar Pradesh CM UP Election Results 2017: Caste could see Manoj Sinha ascend as BJP's CM Notice issued to six telcos for recovery of Rs 12k cr: Manoj Sinha The Vadnagar railway station in Gujarat where Prime Minister Narendra Modi used to sell tea during his childhood, is to get a facelift worth Rs 8 crore, Union minister Manoj Sinha said here today. \"(A sum of) Rs 8 crore has been sanctioned for the development of Vadnagar railway station in Mehsana district,\" the minister of state for railways told reporters. Sinha was in Sachana village today to inaugurate the Inland Container Depot (ICD), built by the Continental Warehousing Corporation (Nhava Seva) Ltd.. Ahead of the 2014 Lok Sabha elections, Modi had often mentioned that he used to sell tea during his childhood at the Vadnagar railway station along with his father. Vadnagar town is also the birthplace of Modi. Giving further details about the project, Divisional Railway Manager (DRM) of Ahmedabad division, <mark>Dinesh Kumar</mark> said the entire project of developing Vadnagar and adjoining places in Mehsana district would cost over Rs 100 crore. \"The development of Vadnagar railway station is one of the components of the Rs 100 crore project to develop Vadnagar, Modhera and Patan as tourist destinations. As of now, the Ministry of Tourism has given Rs 8 crore to the state Tourism Department to develop the railway station,\" <mark>Kumar</mark> said. He said railways has already undertaken a project for converting the meter gauge line on the Vadnagar-Mehasana route into the broad gauge line. Meanwhile, Sinha said his ministry is considering to implement a time table for all the goods trains in line with the passenger trains. \"At present, goods trains do not run as per any time table. Thus, we have initiated a pilot project wherein three to four such trains are plying as per their time table. After analysing the outcome of the project, we are considering to implement this system for all the goods trains,\" the minister said. Railway station where PM Narendra Modi sold tea gets Rs 8 cr for facelift Modi used to sell tea during his childhood at the Vadnagar railway station along with his father Modi used to sell tea during his childhood at the Vadnagar railway station along with his father The Vadnagar railway station in Gujarat where Prime Minister Narendra Modi used to sell tea during his childhood, is to get a facelift worth Rs 8 crore, Union minister Manoj Sinha said here today. \"(A sum of) Rs 8 crore has been sanctioned for the development of Vadnagar railway station in Mehsana district,\" the minister of state for railways told reporters. Sinha was in Sachana village today to inaugurate the Inland Container Depot (ICD), built by the Continental Warehousing Corporation (Nhava Seva) Ltd.. Ahead of the 2014 Lok Sabha elections, Modi had often mentioned that he used to sell tea during his childhood at the Vadnagar railway station along with his father. Vadnagar town is also the birthplace of Modi. Giving further details about the project, Divisional Railway Manager (DRM) of Ahmedabad division, <mark>Dinesh Kumar</mark> said the entire project of developing Vadnagar and adjoining places in Mehsana district would cost over Rs 100 crore. \"The development of Vadnagar railway station is one of the components of the Rs 100 crore project to develop Vadnagar, Modhera and Patan as tourist destinations. As of now, the Ministry of Tourism has given Rs 8 crore to the state Tourism Department to develop the railway station,\" <mark>Kumar</mark> said. He said railways has already undertaken a project for converting the meter gauge line on the Vadnagar-Mehasana route into the broad gauge line. Meanwhile, Sinha said his ministry is considering to implement a time table for all the goods trains in line with the passenger trains. \"At present, goods trains do not run as per any time table. Thus, we have initiated a pilot project wherein three to four such trains are plying as per their time table. After analysing the outcome of the project, we are considering to implement this system for all the goods trains,\" the minister said. Press Trust of India"}, {"articleID": "2014090606_00036175_W", "names": {"Paul Moran": ["Q10346294", "Q3371859", "Q43466628", "Q48700342", "Q59515425", "Q7152589", "Q7152591"], "Andrew Wylie": ["Q4468413", "Q508842"], "Henry James": ["Q2074142", "Q3784955", "Q39884025"]}, "date": "2014-09-06", "url": "http://bostonglobe.com/opinion/2014/09/06/john-updike-trash-everyone-treasure/pXAbC1acuL0grVpK7CrRZI/story.html", "content": "What words are gubernatorial candidates using most? The Democrats can't neglect reform We just can't judge Patriots until January A shark upturn in waters off Mass.. Got a tiny kitchen? Try strong colors. Coakley hedging her bets on casinos Honorary diplomas and a $1.34 check for a \"Simpsons\" voice-over were in Updike's trash. introduced us to <mark>Paul Moran</mark>, a onetime Salem resident who spent three years rooting through John Updike's trash. It is an unseemly pursuit, if not technically illegal; the Supreme Court ruled in 1988 that trash does not enjoy the privacy protections of the Fourth Amendment. <mark>Moran</mark> wasn't out to make money - he and his wife now run a shave ice stand, Maui Wowee, in Austin - but scooping up John Updike's trash was a habit he just couldn't quit. On his first plunge into the late novelist's waste stream, <mark>Moran</mark> unearthed honorary diplomas from Dartmouth, Bates College, Emerson, and Salem State that were bound for the dump. Eventually, <mark>Moran</mark> plucked so many interesting items from the refuse that he created an online collection of found Updike-ana, called The Other John Updike Archive. The trash - from the man Ian McEwan called \"the greatest novelist writing in English at the time of his death\" in 2009 - proves to be full of unexpected treasures. <mark>Moran</mark> salvaged boxfuls of canceled checks, a Screen Actors Guild payment ($1.34) for a \"Simpsons\" voice-over, as well as Christmas cards from Presidents Bushes and Clinton, and from John Lithgow and Elliot Richardson. <mark>Moran</mark> rescued a lot more than ephemera. He has posted at least one explicit letter from a lover, and now owns an Updike address book, a trove of floppy disks (Wang!), and notes for a contemplated novel about Saint <mark>Paul</mark>, which may someday see the light of day. \"I don't think Updike would be embarrassed\" by the decades-old love letter, <mark>Moran</mark> told me. \"His own writing was pretty explicit.\" Right-thinking people everywhere have decried <mark>Moran</mark>'s pilfering. In her Atlantic article, Adrienne LaFrance quotes Updike's authorized biographer Adam Begley; Leslie Morris, the curator of Harvard's Updike collection; and the Updike estate's agent <mark>Andrew Wylie</mark>, dialing up the obloquy (\"dumpster digger\" - <mark>Wylie</mark>; \"outrageous invasion of privacy\" - Begley) at <mark>Moran</mark>'s shenanigans. In contrast, Updike's son David, who is also a writer, described <mark>Moran</mark>'s haul to me as \"fair game. I'm also glad that Mr. <mark>Moran</mark> has saved some of these objects, as I'm interested in seeing some of them. If he's trying to sell them and make a killing, I'd be less sympathetic.\" After speaking with <mark>Moran</mark>, I had the impression that he would like to sell his collection to a library or museum, but so far he has no takers. Morris, who works at Harvard's Houghton rare books library, told LaFrance that \"people always make choices about what's going to be important and what should be thrown away and what should be kept...Anyone would like to think that their decision - that it's not worth keeping - is the right one and should be respected.\" Except that authors make gigantic blunders when it comes to posterity. A kooky, Christianized Nikolai Gogol burned half of \"Dead Souls,\" his great, irreverent masterpiece about 19th-century Russia. Vladimir Nabokov tried to burn \"Lolita\" several times. Novelist <mark>Henry James</mark> boasted of the \"gigantic bonfire\" he made of his personal papers - records that fans and scholars would like to have seen. In the name of deceased authors, well-meaning executors have committed equally egregious crimes. A coterie of Lord Byron's friends decided to burn his (presumably scandalous) diary shortly after the great poet's death. Byron wanted the diary published. The loss to literary history is incalculable. My point? Thank you, <mark>Paul Moran</mark>. I'm glad you didn't shut down your website last December, as you said you would. I'm a big Updike fan, and I found your archive to be endlessly fascinating. I disagree with your assertion that Updike's tossed-out family and travel snapshots are copyright-protected. I wish you would post more of them, although I know you are alert to privacy considerations as well. I know you feel the scorn of your detractors. \"I get it,\" is what you told me when I mentioned your critics. \"I've felt bad about this.\" Don't. To quote Updike, you are \"giving the mundane its beautiful due.\" To quote him again, from his famous poem, \"My Children at the Dump\" : \"The waste seems wonderful.\" You have created a \"wonderland of discard\" for us all to enjoy. Work here © 2014 Boston Globe Media Partners, LLC You have read 5 of 10 free articles in a month. You have read 7 of 10 free articles in a month. This is your last free article in a month. Continue reading with unlimited access for just 99 ¢ Don't miss any of your favorite stories again. Read the stories that matter to you as much as you want, whenever you want when you subscribe to BostonGlobe.com. The login information you entered does not match an account in our records. To activate FREE access as a home delivery subscriber Forgot your password? Home delivery subscribers get free access. Link Account Customer Service Number: 1.888. MY. GLOBE E-mail address not found, please try again or contact customer service at 1-888-MYGLOBE Please check your e-mail for a message from BostonGlobe.com with the subject line \"BostonGlobe.com password request.\" Click the link in the e-mail to choose a new password for BostonGlobe.com, and note that your new password will also be used for your Boston.com membership. You have reached the limit of 10 free articles in a month Continue reading by subscribing to BostonGlobe.com for just 99 ¢. Continue reading by subscribing to BostonGlobe.com for Stay informed with unlimited access to Boston's trusted news source. High-quality journalism from the region's largest newsroom Convenient access across all of your devices Today's Headlines daily newsletter"}, {"articleID": "2017100616_00420201_W", "names": {"Terry Mcauliffe": ["Q3518911", "Q49001865"], "Jerry Brown": ["Q152451", "Q717620"], "Gerry Anderson": ["Q5552638", "Q596137"]}, "date": "2017-10-06", "url": "http://blogs.edf.org/energyexchange/2017/10/06/climate-and-clean-energy-progress-continues-in-spite-of-clean-power-plan-repeal-rumors/", "content": "By Charlie Jiang According to news reports, Environmental Protection Agency (EPA) Administrator Scott Pruitt is planning to start the process of repealing the Clean Power Plan very soon. This seriously flawed and misguided effort would be a dangerous step backwards for public health and climate protections. However, as the Trump Administration continues to unravel these protections, the transition to a clean energy future is accelerating. States, cities, and power companies are responding to the ongoing attacks by forging ahead with ambitious actions to slash carbon pollution in order to respond to the threat of climate change and accelerate the clean energy revolution. Clean Power Plan repeal? The Clean Power Plan is a common-sense rule to safeguard public health by reducing carbon pollution from power plants to 32 percent below 2005 levels by 2030. The Clean Power Plan would prevent: 3,600 premature deaths each year 1,700 heart attacks each year 90,000 asthma attacks each year Administrator Pruitt reportedly intends to propose repealing the Clean Power Plan in the coming days. If so, EPA will likely issue an \"Advance Notice of Proposed Rulemaking\" (ANPR) to solicit public input on a replacement rule--a protracted process that is likely to lead to a far weaker standard. The ANPR process could lead to years of harmful and unjustified delay in implementing urgently needed limits on carbon pollution from fossil fuel power plants. Climate and clean energy progress continues in spite of Clean Power Plan repeal rumors Click To Tweet Powered By CoSchedule Forging ahead to a clean energy future The U.S. power sector has already made enormous strides in deploying clean energy resources and slashing greenhouse gas emissions. Wind and solar comprised more than 60 percent (roughly 16.5 gigawatts) of new utility-scale generating capacity added in 2016. In March of this year, wind and solar exceeded ten percent of the nation's electricity generation for the first time in history--even as coal's share of the energy mix has declined to historic lows. The clean energy sector now employs more than three million Americans, and continues to grow rapidly: American Wind Energy Association Solar Jobs Census 2016--The Solar Foundation, interactive map Globally, the International Energy Agency (IEA) reported yesterday that renewables accounted for almost two-thirds of new capacity installed. Solar additions worldwide grew faster than any other fuel last year, including coal and natural gas. Over the next five years, the IEA projects renewable capacity to grow by over 920 gigawatts--a 43 percent increase by 2022. Meanwhile, by the end of 2016, carbon pollution from U.S. power plants had already declined to 25 percent below 2005 levels--meaning the power sector is already almost 80 percent of the way to achieving the Clean Power Plan's 2030 targets. A new report by the Institute for Policy Integrity highlights the falling costs of complying with the Clean Power Plan. The report points to several market and policy developments including low natural prices, declining renewable energy costs, the 2015 renewable energy tax credit extensions, and state programs supporting the adoption of clean energy technologies. By the end of 2016, carbon pollution from U.S. power plants had declined to 25 percent below 2005 levels. The Clean Power Plan targets have become a floor for forward-looking states and companies that acknowledge the Clean Power Plan was a first step towards realizing the promise of a low-carbon power sector. Yet this shift towards clean energy--driven by market forces and accelerating subnational action--is no substitute for decisive federal action that will ensure continued and accelerated progress in achieving the emissions reductions required to stem the tide of climate change. The U.S. Energy Information Administration projects that without the Clean Power Plan, carbon emissions from the power sector will increase by 2030--reversing the current downward trajectory in the United States and leaving the country behind as the global clean energy revolution continues. States and cities step up To keep us moving forward, state and local officials are stepping up their game by cutting carbon pollution and switching to clean energy in spite of--and in direct response to--President Trump's rollbacks. Fourteen states and Puerto Rico, accounting for more than 10 percent of U.S. carbon emissions from the power sector, pledged as part of the new U.S. Climate Alliance to reduce their greenhouse gas emissions consistent with the goals of the Paris Agreement, as well as meet or exceed their Clean Power Plan targets. 381 mayors (and counting) representing more than 67 million Americans also pledged to honor the Paris Agreement goals and work to meet the 1.5 ° Celsius global temperature target. Dozens of cities have committed to move to 100 percent clean energy. Colorado Governor John Hickenlooper signed an executive order in July 2017 committing the state to slash greenhouse gas emissions to 26 percent below 2005 levels by 2026, consistent with U.S. goals under the Paris Agreement. \"The vast majority of our residents, and indeed the country, expect us to help lead the way toward a clean and affordable energy future,\" Governor Hickenlooper said in a press release. Nine states comprising the Regional Greenhouse Gas Initiative (RGGI) in August announced a proposal to cut carbon pollution from the power sector an additional 30 percent between 2020 and 2030--a 65 percent reduction below the original 2009 pollution cap. The proposal demonstrates bipartisan commitment to combat climate change, with five Republican and four Democratic governors helming the RGGI states (Connecticut, Delaware, Maine, Maryland, Massachusetts, New Hampshire, New York, Rhode Island, and Vermont). Meanwhile, both New Jersey gubernatorial frontrunners have pledged to rejoin RGGI after this year's election. Virginia regulators are working to establish a \"trading-ready\" program to slash power plant carbon emissions in response to an executive order Governor <mark>Terry McAuliffe</mark> signed in May 2017. \"Today, I am proud to take executive action to cut greenhouse gases and make Virginia a leader in the global clean energy economy,\" Governor <mark>McAuliffe</mark> said when he signed the order. California affirmed its position as a global leader on climate progress with a bevy of actions in the past year. In September 2016, legislators passed SB 32, which requires the state to slash greenhouse gas emissions to 40 percent below 1990 levels by 2030. In July 2017, the state secured a 10-year extension to its landmark cap-and-trade program and strengthened tools to improve local air quality in a bipartisan effort. \"All over the world, momentum is building to deal seriously with climate change,\" Governor <mark>Jerry Brown</mark> said in July. \"Despite rejection in Washington, California is all in.\" At least 20 states and the District of Columbia have adopted ambitious greenhouse gas reduction targets, with most aiming for an 80 percent reduction by 2050 below baselines ranging from 1990 to 2006. Twenty-nine states and D.C. have binding renewable portfolio standards in place, while eight more have set renewable portfolio goals. Twenty states have set mandatory energy efficiency targets, while eight more have set energy efficiency goals. Company pledges The nation's largest power companies are similarly pledging to slash carbon pollution and deploy renewable energy resources as they embrace the rapid transition to a clean energy economy. The CEO of American Electric Power (AEP), the country's largest generator of electricity from coal, had this to say in response to President Trump's decision to withdraw the U.S. from the Paris Agreement: \"I think it's really important for us to stay engaged from an international community standpoint, particularly addressing large issues. And not withstanding that, we're continuing on our path of moving to a clean energy economy.\" AEP has cut carbon pollution by 44 percent since 2005, and has plans to add more than eight gigawatts of wind and solar in the coming years. Duke Energy, the nation's largest power producer, this year announced plans to reduce carbon emissions to 40 percent below 2005 levels by 2030. \"Our next major investment platform focuses on generating cleaner energy,\" said CEO Lynn Good. \"Our retirement of more than 40 older, less efficient coal units, coupled with the addition of clean natural gas plants and renewables, is driving our emissions reduction.\" DTE Energy Co. announced plans in May 2017 to curb its carbon emissions more than 80 percent by 2050 by closing coal-fired power plants and adding new gas-fired generation and renewables. \"Not only is the 80 percent reduction goal achievable--it is achievable in a way that keeps Michigan's power affordable and reliable,\" DTE Chairman and CEO <mark>Gerry Anderson</mark> said. \"There doesn't have to be a choice between the health of our environment or the health of our economy; we can achieve both.\" Xcel Energy committed in June 2017 to achieving a 60 percent reduction in carbon emissions by 2030, relative to 2005 levels. In August, the company announced plans to retire two coal-fired units in Colorado, continuing its progress towards a cleaner generating portfolio. In addition, Xcel's massive new investments in renewable energy--including a proposal to add 3,380 megawatts of wind generation across seven states--will help the company generate 40 percent of its energy from renewables by 2021. Berkshire Hathaway Energy subsidiary MidAmerican Energy has announced a goal to provide 100 percent renewable energy, including a $3.6 billion project to add 2,000 megawatts of wind, which will expand wind energy to 85 percent of the company's sales. Said CEO Bill Fehrman: \"Our customers want more renewable energy, and we couldn't agree more.\" Minnesota Power, a division of ALLETE, plans to provide 44 percent of its electricity from renewable resources by 2025. Said one executive, \"We look forward to working with our customers and regulators to continue down the path toward a safe, reliable, cleaner and affordable energy future.\" The imperative of addressing climate change, overwhelming public support for climate action, and clear market trends towards lower-carbon energy resources are driving states, cities, and power companies to lead the way to a low-carbon future. If governors, mayors, and power sector CEOs continue to take steps to reduce carbon pollution, they will realize the tremendous benefits of a clean energy economy--thousands of new jobs, critical public health protections, and increasingly resilient communities and infrastructure. The Trump Administration's effort to repeal the common-sense Clean Power Plan--its latest attack on life-saving safeguards for our children's health--will not change the reality of climate change or the accelerating transition to an economy powered by low-carbon energy. However, without a quick return to meaningful federal progress, the U.S. will fall further behind in the global clean energy revolution--one that could lead to shared prosperity and enormous opportunities for millions of Americans. This post originally appeared on our Climate 411 blog. Related Posts 3 Ways the Clean Power Plan Will Strengthen Our Economy What Do the 2016 Elections Mean for the Clean Power Plan? The Clean Power Plan: Driving Down Electricity Bills for Families"}, {"articleID": "2011011121_00173399_W", "names": {"Rich Rodriguez": ["Q7323433", "Q7323434"]}, "date": "2011-01-11", "url": "http://ca.rd.yahoo.com/sports/rss/top/SIG=12fgsood9/*http%3A//ca.sports.yahoo.com/top/news?slug=capress-fbc_michigan_coach-5623381", "content": "ann arbor, mich. - michigan picked san diego state's brady hoke as its new football coach on tuesday, hours after lsu said les miles would be staying in the bayou. hoke is not a michigan man - he's a ball state alumnus - but he is a former wolverines assistant and athletic director dave brandon praised him highly in announcing the decision. \"we are pleased to announce the hiring of brady,\" brandon said. \"he is a terrific coach and will be a great ambassador and leader for our football program. we look forward to having him build a championship program on the field and in the classroom.\" hoke, who will be introduced at a news conference in ann arbor on wednesday, spent eight seasons as a head coach at ball state (2003-08) before leading the aztecs (2009-10). a defensive line coach at michigan, hoke helped the defense lead the nation in rushing defense and was on the staff during the 1997 national championship run. during his tenure, michigan went 5-3 against rivals michigan state and ohio state and in bowl games. he replaces <mark>rich rodriguez</mark>, who was fired after going 15-22 in three disappointing seasons with the wolverines. that includes an 0-6 mark against the buckeyes and spartans. <mark>rodriguez</mark> was fired after going 15-22 in three seasons with college football's winningest program and he also embarrassed alumni and others by getting hit with ncaa violations tied to practice time. he replaced retired coach lloyd carr in a marriage that seemed doomed from the start. brandon bought out the last three seasons of <mark>rodriguez</mark>'s contract for us $2.5 million on the first anniversary of taking the job. his latest decision was a big one, too. brandon needed to find a new coach who would fit in on the field and campus along with exciting a fan base and donors who fill the big house and still new luxury suites. whether hoke can do those things is an open question and the last week was full of speculation that miles would be the best choice brandon could make. the lsu coach was a popular choice among fans when carr announced he was retiring after the 2007 season, but he stayed in baton rouge then and did again this time around."}, {"articleID": "2011073014_00013801_W", "names": {"Matt Thornton": ["Q2747889", "Q6789432"], "Ken Williams": ["Q12109559", "Q19271599", "Q20047071", "Q20651303", "Q42321996", "Q6388697", "Q6391254", "Q956112"]}, "date": "2011-07-30", "url": "http://chicagotribune.com/sports/baseball/whitesox/ct-spt-0730-white-sox-redsox-chicago-20110730,0,4612441.story?track=rss", "content": "bears training camp in bourbonnais the longest work stoppage in nfl history is over. now it's time for the chicago bears to return to their pre-season home, bourbonnais, ill., where they will go through a slightly abbreviated training camp at olivet nazarene university. here are images from the bears preseason training camp in bourbonnais. white sox trade front friday and it's likely to stay that way through sunday's deadline if they keep on their slow but steady climb. the names most mentioned in the rumor mills played key roles in the 3-1 victory over the red sox, one which moved the white sox within a half game of the carlos quentin scored the winning run with a seventh-inning walk in front of <mark>matt thornton</mark> pitched a scoreless eighth inning in relief of winner gavin floyd. suddenly everything looks brighter than it did a week ago, as the sox reached .500 for the first time since early july in winning their eighth game in the last 12 before a crowd of 27,513 at u.s. cellular field. and they did it by picking on their new personal patsy, albeit an unlikely one in the red sox, which has the best record in the al. friday's victory was their seventh straight and 14th in the last 16 games against them. ozzie guillen said when asked about the dominance. neither did he have an answer about possible trades, although he said general manager <mark>ken williams</mark> hadn't given him any hints like he did before the blue jays. \"i don't talk about it, players don't talk about it,\" guillen said. \"we bring somebody, we bring somebody. that's (media's) job to talk about trades. fans want to know. all the people think they are going to trade people.\" but right now, the white sox finally are playing like the experts thought they would, thanks in no small part to floyd, who is 6-0 in his career against the red sox, which played without baseball's best hitter adrian gonzalez (stiff neck). floyd pitched his third straight gem in a \"must-win\" game against a contender, going seven innings and allowing only three hits, one of them floyd beat central foes detroit and cleveland in his two previous games while allowing only one earned run in 15 1/3 innings. \"he has been really good,\" pierzynski said. \"he has been throwing strikes and being really aggressive.\" the white sox didn't score against veteran knuckleballer omar vizquel sacrificed him to second. he went to third on a wild pitch ahead of paul konerko's sacrifice fly. and then came the seventh inning with quentin's leadoff walk and pierzynski's homer off wakefield. \"that was the best knuckleball i've seen him throw and i've seen him a lot,\" pierzynski said. \"people see 65 (mph) and they don't realize how hard it is to hit. i just swung and it went out.\" well, i am still not convinced this sox team will win the division, but i will give their credit when the play well. i am not ready to drink the \"all in\" koolaid or be hood winked into claiming they have put it together. run off some wins and not lose to inferior teams, like kansas city and i may believe again. this homestand they should have won all the games. the one loss to detroit just happened. i'll reserve my judgement. last year they were 4 games ahead in august and how did that season end? huh? richardgasiorowski at 4:39 am july 30, 2011 whoa .500 for a 120m team - money well spent johnoo at 1:17 am july 30, 2011 yes, but watch out, the cubs are going on their run!"}, {"articleID": "2018101022_00357525_W", "names": {"Aaron Boone": ["Q4661862", "Q4661865"]}, "date": "2018-10-10", "url": "http://wtnh.com/sports/what-now-for-the-yankees-/1514090439", "content": "What now for the Yankees? By: Posted: Oct 10, 2018 06:31 PM EDT Updated: Oct 10, 2018 06:31 PM EDT What now for the Yankees? Video Saints' Brees becomes NFL's all-time yards passing leader WTNH - So what now for the Yankees? They won 100 games this season, hit the most home runs in major league history--but come up short of the ultimate goal--a World Series Championship. Rookie Manager <mark>Aaron Boone</mark> with some growing pains during the playoffs and obviously last night was a tough pill to swallow \"Well we want to continue to get better, we're chasing the perfect offense, so, as a major league athlete we're chasing to be the best we can be. Offensively, pitching, defense your always chasing utopia. We're chasing that.\" Look for the Yankees to try to add some big free agent pieces this winter."}, {"articleID": "2019072903_00070813_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-07-29", "url": "http://www.gamereactor.eu/userreviews/173/?sid=72de133d030514963352bb57f414c341", "content": "Written by: Paul Voulgaris 2018-10-25 Hello my name is Paul iam big fun on cartoons But: First of all i bought on Xbox one i pre ordered on digital this game because i was so excited to play with my friends but this game need to connect Internet to play offline either solo or Co op 2-4 players second they didnt make an option that you can choose to play online or offline for players who want experience on local counch most of them didnt have Internet to download and to play on Internet its waste of money. The characters has no voice only on signle player drop a balon chat that get hurt from another character no good voice on cars and why says the title racer and you put to fly or boat this game isnt good make only road and put more characters and Dlc maps and char to reveals if you make this game with updates you can sell more than you expect pleaz make update for voices fix only road race with weapons and guys make option for offline for people that they dont have Internet i put this score because i am fun on it not that i like if you fix this guy i put more score on this game. Online by Zalim Chhori on the 26th of July 2019 at 21:40 <mark>Donald Trump</mark> stood support on the South Lawn of the White number House on June 11, waving a folded AOL MAIL DESKTOP GOLD piece of paper in front of the cameras AOL MAIL DESKTOP GOLD that he said was AOL MAIL DESKTOP GOLD an agreement with Mexico AOL MAIL DESKTOP GOLD to address technical the migrant crisis support at the border. \"That's the agreement that customer everybody contact says I don't have,\" he proclaimed. \"I'm going to AOL MAIL DESKTOP GOLD let Mexico do the announcement care at the right number time EUROPE'S LARGEST VIDEO GAME MAGAZINE"}, {"articleID": "2017092803_00356571_W", "names": {"Jose Ramirez": ["Q1101675", "Q2029119", "Q21755529", "Q3186538", "Q51754004", "Q6293802"], "Eduardo Escobar": ["Q3048331", "Q5548489"], "Carlos Santana": ["Q2367902", "Q5042623", "Q819016"], "Paul Molitor": ["Q1972377", "Q93152"], "Kyle Gibson": ["Q14878777", "Q24283915", "Q6451161"]}, "date": "2017-09-28", "url": "http://www.twincities.com/2017/09/27/adalberto-mejia-disappoints-in-chance-to-pitch-twins-into-postseason/", "content": "Minnesota Twins' Jorge Polanco forces out Cleveland Indians' Austin Jackson at second base and throws out <mark>Jose Ramirez</mark> at first base to complete the double play during the third inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' <mark>Jose Ramirez</mark> rounds third base on the way to scoring on a single by Edwin Encarnacion during the first inning in a baseball game against the Minnesota Twins, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins starting pitcher Adalberto Mejia delivers against the Cleveland Indians during the first inning of a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians starting pitcher Danny Salazar delivers against the Minnesota Twins during the first inning of a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes reacts after being hit by a pitch from Minnesota Twins starter Adalberto Mejia with the bases loaded during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins starting pitcher Adalberto Mejia walks off the field after being pulled after hitting Cleveland Indians' Yan Gomes with a pitch with the bases loaded during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' Max Kepler makes a catch to get out Cleveland Indians' Jay Bruce during the fourth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians starting pitcher Mike Clevinger delivers against the Minnesota Twins during the fifth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' <mark>Jose Ramirez</mark> throws out Minnesota Twins' Jorge Polanco at first base during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes watches a solo home run off Minnesota Twins relief pitcher Michael Tonkin during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' <mark>Eduardo Escobar</mark> throws to first base and is charged with an error on a ball hit by Cleveland Indians' Jay Bruce, which allowed Austin Jackson to score during the fifth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes steps on home plate after hitting a solo home run off Minnesota Twins relief pitcher Michael Tonkin during the sixth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Minnesota Twins' Jorge Polanco rounds the bases after hitting a two-run home run off Cleveland Indians relief pitcher Cody Allen during the ninth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. The Indians won 4-2. (AP Photo/Ron Schwane) Cleveland Indians' Austin Jackson makes a leaping catch to get out Minnesota Twins' Joe Mauer during the ninth inning in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. The Indians won 4-2. (AP Photo/Ron Schwane) Cleveland Indians' Yan Gomes, left, and <mark>Carlos Santana</mark> celebrate a 4-2 victory over the Minnesota Twins in a baseball game, Wednesday, Sept. 27, 2017, in Cleveland. (AP Photo/Ron Schwane) Show Caption of Expand By Mike Berardino | mberardino @ pioneerpress.com | Pioneer Press PUBLISHED: September 27, 2017 at 9:21 pm | UPDATED: September 27, 2017 at 10:29 pm Sign up for newsletters and alerts CLEVELAND--If this was Adalberto Mejia's chance to secure a starting slot in a potential Twins postseason rotation, it didn't go very well. The burly 24-year-old left-hander failed to last four innings for the sixth time this season as the Twins fell 4-2 to the Cleveland Indians on Wednesday night at Progressive Field. \"Today was one of those days it didn't happen,\" Mejia said through a translator. \"There were good moments, I thought, and there were bad moments, but I tried.\" With their magic number down to one to end a seven-year postseason drought, the Twins would have to rely on the Chicago White Sox to eliminate their only remaining wild-card competitor, the Los Angeles Angels. The Indians still haven't lost consecutive games since Aug. 22-23, just before they embarked upon a 22-game winning streak. Even without any help, the Twins would still have four games left to become the first team in history to go from 98 or more losses to the postseason the following year. After dropping a Twins franchise-worst 103 games in 2016, the Twins have already improved by 24 wins, biggest year-over-year jump in Minnesota big-league history. Related Articles Key stretch of I-35W will close this weekend--despite major sports events <mark>Paul Molitor</mark> explains pitching change that wasn't in Tuesday's win Twins' Miguel Sano takes 60 swings after seeing two more specialists Late Brian Dozier homer lifts Twins to 8-6 win over Cleveland Indians Max Kepler returns to lineup, plays through bruised lower back Jorge Polanco kept the Twins from just their third shutout loss all year with a two-run homer off Cody Allen in the ninth. Through the first eight innings, Danny Salazar (nine strikeouts) and the vaunted Indians bullpen held the Twins to two hits: two-out doubles by Max Kepler in the second and Chris Gimenez in the fifth. Mejia started his night by walking Francisco Lindor after falling behind 3-0, and things only got marginally better from there. Edwin Encarnacion ripped a changeup for a two-out single to put the Indians ahead and give him 18 of his 104 runs batted in against the Twins, nearly twice his top total against any other opponent this season. \"I would think there would be some (nerves), given what's at stake,\" Twins manager <mark>Paul Molitor</mark> said before the game. \"I've been impressed by this kid all year long. His first one back, I thought he was over-amped and tried to overthrow. His second one was much more calm, under control and he pitched better.\" Mejia hasn't completed six innings in the majors since July 8. \"He's got the stuff to get any lineup out,\" <mark>Molitor</mark> said, \"if he's mixing it up and getting it over the plate.\" The Indians improved to 7-1 against the Twins when scoring first. It was just the second Twins road loss against the Indians in eight tries this season. Mejia then ran three-ball counts on four of seven batters as he pitched his way into trouble in the fourth. His night ended at 69 pitches with a bases-loaded plunking of Yan Gomes on the left calf to force in the second run. \"It seems like there's a lot of misfires that get his pitch counts up, but a lot of good pitches too,\" <mark>Molitor</mark> said. \"There's a fine line. I think he's got fairly good composure overall.\" Gomes added a solo homer off Michael Tonkin in the sixth. <mark>Eduardo Escobar</mark>'s throwing error with two down in the fifth let in the other Indians run. It was just the sixth error for <mark>Escobar</mark> in 76 games at third base but his third in the past three weeks. For Mejia, who missed five-plus weeks with upper arm soreness before returning in mid-September, this marked the 10th time he's failed to complete five innings. Just four times in 21 starts as a rookie has he gone six innings or longer. Mejia entered 1-1 with a 1.86 earned run average in two previous starts against the Indians, but he has now averaged just 4.4 innings against the American League Central champions. Should the Twins qualify for the postseason and knock off the New York Yankees in the Bronx behind staff leader Ervin Santana on Oct. 3, they figure to start the AL division series here against the Indians two days later. Whoever starts Game 1, whether it's <mark>Kyle Gibson</mark> or young <mark>Jose</mark> Berrios, could seem a better bet than Mejia to start a potential Game 4 (if necessary) in a best-of-five series. That would require either one to start on short rest, but Mejia's lack of efficiency has held him back for much of his rookie season. \"Obviously I couldn't get it done to help the team get into the postseason,\" Mejia said, \"but if the time comes and I get the opportunity to throw in a postseason game, I'll be ready. Mentally, physically, I'll be ready.\" "}, {"articleID": "2009052121_00033934_W", "names": {"Alan Kennedy": ["Q4707038", "Q4707040", "Q958330"]}, "date": "2009-05-21", "url": "http://efpnreporter.wordpress.com/2009/05/21/california-poised-to-lead-the-halt-of-financial-elder-abuse-and-other-abuse/", "content": "california poised to lead the halt of financial elder abuse and other abuse san francisco - california is a prime target for financial abuse as the nation's highest retirement destination with an estimated 4.9 million people over 65-years of age living in the golden state in 2003. that same population is expected to jump to more than 9 million by 2020. financial-related abuse of seniors is exploding. reports of financial exploitation of the elderly has increased 150 percent within the past 10 years with monetary losses estimated to be several billion dollars annually, according to jenefer duane, founder and ceo of the elder financial protection network. an estimated $4.8 billion dollars of california's seniors' assets are at risk, according to duane, one of the senior advocates at the gene friend recreation center may 7 who came out in support of ab 768, an anti-elder abuse bill that will amend california's penal code establishing emotional, physical, and financial abuse committed against a senior or dependent adult as a crime throughout the state. ab 768 will strengthen california's penal code making it easier to investigate and prosecute crimes against seniors by eliminating the required proof of knowledge of someone's age or dependency status or the definition of caretaker; allows evidence of abuse as sufficient proof; and it establishes strict penalties in order to be charged with elder abuse. within the first few months of this year the san francisco police department has received more than 100 cases involving financial abuse of seniors, san francisco chief of police heather fong said. in 2008, the police department received more than 400 cases of financial-related abuse involving seniors. additionally, the police department has received more than 40 cases of reported elder abuse this year. in 2008, there were more than 240 reported cases of elder abuse, fong said. it is important for seniors and those who care about our elderly population to report elder abuse, especially suspected financially-related abuse, as it is underreported, especially financial elder abuse, according to a. <mark>alan kennedy</mark>, assistant district attorney and manager of the elder abuse unit of the san francisco district attorney's office. duane, assemblywoman norma torres (d-pomona), who authored ab 768, san francisco district attorney kamala harris, and senior advocates are calling californians to action to protect the state's elderly-especially when so many of our elders are unwilling to report crimes against them. \"elder abuse is a crime. make no mistake. it must be reported and it must be stopped...we owe it to you to do everything we can to protect you,\" duane told seniors gathered at the center. she urged them to tell their friends about the bill and to report suspected incidents of abuse. seniors who are victims of financially-related abuse are more likely to be institutionalized and the mortality rate of seniors who are abused is three times higher than that of seniors who do not experience abuse, according duane. it's important for seniors and those who care about our elders-a treasured asset of our families and communities-to support the passage of ab 768, that will amend california's penal code establishing emotional, physical, and financial abuse committed against a senior or dependent adult as a crime throughout the state. this bill is unique in that it recognizes acts of fraud, theft, embezzlement, forgery and other financially-related crimes as a form of abuse that can leave seniors in financial ruin at a stage in their lives when they should be enjoying the fruits of their labors. \"an elder who has lost their life's savings cannot go back to work and regain what they made their entire life. this affects an elder's ability to remain independent in their home and can result in early and unnecessary institutionalization placement in a nursing home,\" said duane. the community is joining together to be a \"loud voice in support of our seniors,\" harris said. \"the current elder abuse statutes are as about solid as swiss cheese,\" harris continued. \"[we want to] make sure that we have the teeth in this statute to take a bite out of those crimes and send those offenders where they belong.\" torres added, the law will \"make it easier to protect seniors as we protect our children,\" who need to be respected, should be taken care of, and should be protected from abuse, she said. this entry was posted on thursday, may 21st, 2009 at 12:31 pm and is filed under uncategorized. you can follow any responses to this entry through the subscribing is like having a secure spam-free inbox that webpages are delivered to. you will need an rss reader. we recommend bloglines or google reader. to receive email updates, we recommend using feedblitz. it's easy! go to feedblitz, enter and click subscribe. enter your email, and the safety letters. questions? call 415.956.5556. efpn's new address is: 550 montgomery street, suite 485 san francisco, ca 94111 phone: 415.956.5556 california poised to lead the halt of financial elder abuse and other abuse"}]