[{"articleID": "2018041601_00232875_W", "names": {"Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"], "Kyle Murphy": ["Q20826698", "Q24005654", "Q24549968"]}, "date": "2018-04-16", "url": "http://ktbs.com/sports/national/winter-storm-delays-start-of-green-bay-packers-offseason-program/article_1827fdae-8ce9-56c9-adf1-552e92f4ef9d.html", "content": "Winter storm delays start of Green Bay Packers' offseason program JASON WILDE For the State Journal 8 min ago Save GREEN BAY--Justin McCray would have been one of the lucky ones. Already in town working out for most of past week, the Green Bay Packers second-year offensive lineman would've avoided the travel issues many of his teammates encountered because of the second-worst snow storm in Green Bay history. Except McCray left late in the week for Atlanta, where he was standing up in his cousin's wedding on Saturday night. As a result, while he was able to celebrate with the newly minted Mr. and Mrs. Earnest and Annette Gaines, he wasn't able to make it back in time for what was supposed to be the kickoff of the team's official offseason program on Monday. \"I'm giving (the groom) a hard time about it,\" McCray said from his hotel room near the Hartsfield International Airport, where he spent Sunday night hoping to make it to snowy Green Bay sometime Monday. \"But it's all jokes.\" The storm, however, was no joke. Because of the travel challenges it created for his players, Packers coach <mark>Mike McCarthy</mark> pushed the start of the offseason workouts back a day to Tuesday--weather permitting, of course. Among the players who weren't able to get into town as planned was quarterback Aaron Rodgers, who was slated to fly in but said in a text message his flight wouldn't be able to get in on Sunday night as scheduled. But he was hardly alone. The workouts are technically voluntary, although the Packers have historically had extremely high attendance for the offseason program, in part due to the money they invest in workout bonuses to incentivize the sessions for players. Those players already in town can work out on their own at the team facility on Monday, per NFL rules, but Tuesday will now be the first day of official workouts. The bizarre April storm won't cost the Packers any sessions, a club spokesperson said, as they weren't required to begin on Monday. According to the National Weather Service's Green Bay office, the storm had dumped 23.2 inches in Green Bay at of 4 p.m. Sunday--making it the area's largest snow storm in 130 years, or dating back to before the Packers came into existence in 1919. The only time more snow fell on Green Bay during a single storm was on March 1-2, 1888, when the area received 29 inches. (The biggest April snow storm recorded in Green Bay before this was in 1977, when 11 inches fell .) While McCray was spending an unexpected extra night in Atlanta, he got off easy compared to fellow offensive linemen Lucas Patrick and <mark>Kyle Murphy</mark>, who got stuck at the Minneapolis-St. Paul airport on Friday night and had quite the odyssey from there. Patrick, who was connecting from Portland, Oregon, and <mark>Murphy</mark>, who was coming back from California, were in the Delta Airlines airport lounge at 2 a.m. Saturday morning and caught a few hours of sleep there. After getting rebooked on a Sunday flight into Appleton, they headed to the nearby Mall of America later Saturday morning where Patrick realized--about the same time that the mall was closing due to the weather in the Twin Cities--that he had a bit of a wardrobe emergency. \"I was out of clean undergarments,\" Patrick recounted. \"So we kind of ran around the mall to find only Sears was open--so (at least) I could get some fresh socks and underwear.\" The pair stayed at an airport hotel Saturday night and then endured a bumpy ride into Appleton on Sunday morning--\"It was rough, and we almost had to turn around in mid-air (before) we were cleared to land,\" Patrick said--and another one once we got on the ground. After landing in Appleton, Patrick, <mark>Murphy</mark> and practice-squad wide receiver DeAngelo Yancey, who was also on their flight, rented a minivan to drive up Interstate 41 to Green Bay. The ice-covered highway was bad enough--<mark>Murphy</mark> said the fastest he was able to drive was 35 miles per hour--but when Patrick went to drop <mark>Murphy</mark> off first, the minivan got stuck in the snow and the threesome had to push the vehicle out. The drive to Yancey's hotel and his own apartment were no picnic either, Patrick said. \"Worst weather I've ever driven in, and the first time I was actually scared of the weather,\" Patrick said. So was it worth it? \"It's always worth it,\" Patrick replied. \"You never know where life can take you--especially in the job I'm in. So it's fun to do these things. Plus, being miserable with another person makes everything better--(even) with all the crazy travel.\" This article originally ran on host.madison.com. Love 7 min ago (...) Get caught up on who's in, who's out and who's TBD as the Packers make roster changes ahead of the 2018 NFL season."}, {"articleID": "2013060211_00003638_W", "names": {"David Thompson": ["Q1176843", "Q14950372", "Q15378706", "Q16499854", "Q16830995", "Q18924157", "Q20710001", "Q28434580", "Q310082", "Q5236246", "Q5240375", "Q5240378", "Q5240379", "Q5240380", "Q5240381", "Q5240382", "Q5240383", "Q56192238", "Q58065993", "Q718669"]}, "date": "2013-06-02", "url": "http://www.nationnews.com/articles/view/just-wait-people/", "content": "By Peter Wickham | Sun, June 02, 2013 - 12:01 AM \"But they that wait upon the Lord shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; and they shall walk, and not faint.\" - Isaiah 40:31 It is entirely understandable that across Barbados people are becoming uneasy regarding our economic situation, as the global environment that feeds our economy is growing worse. Against this background, the recent speech of Minister of Finance Christopher Sinckler was timely. It is difficult to summarize his presentation in a few lines, however, the gist of his position appears to be that \"his\" Government understands the problem, knows what it needs to do and will (in due course) take the necessary action to remedy any economic shortcomings. In addition, we can also take some comfort in the fact that the minister has also (to some extent) taken ownership of this crisis, which was perhaps unwise since the Democratic Labour Party (DLP) Government has hitherto resisted taking ownership. Critics of the DLP administration have understandably not been satisfied with the Minister's response. Leader of the Opposition Mia Mottley's \"cotton candy\" analogy could be considered a kind assessment of a statement that admitted too much that was wrong but said little about how it would be fixed. As amusing as her analogy is, it speaks volumes about the peculiarity of this political scenario and the implications of the DLP's victory in the last election. The minister appears to think that his critics want him to \"fight an election\" all over again. However, to my mind, the clear message in the public's criticism is the concern that this Government needs to \"get cracking\" . As he correctly said, and certainly as I have said repeatedly, the election is over, the battle has been won - the people have spoken and reposed confidence in the DLP...Matter closed! There is, however, a fundamental difference between the election battle and the matter of governance and it is at this point that one needs to seriously reflect on the applicability of the \"cotton candy\" reference. Cotton candy is known for being very sweet but not particularity substantive, and for this reason it is popular at events where the sweet taste is applicable, although one would never consider it for a meal. The Leader of the Opposition, therefore, seems to be saying the party is over and now it is time for the \"main course\" , which is a position few can find issue with. If, therefore, we agree that it is time for the main course to begin, the next logical question relates to the ingredients or shape Government's action will take, and this too, is an issue about which there can be much speculation. Certainly, the DLP administration has circumscribed its likely action by making it \"pellucid\" that it will not be sending home public servants now, or in the future. This is a policy position articulated by late Prime Minister <mark>David Thompson</mark> and reiterated by Prime Minister Freundel Stuart and reinforced by the minister, even in the face of recent suggestions by one trade unionist that Government was preparing the \"turf\" for a wave of dismissals. There will be presumably equal comfort in the presumption that the DLP Government's solution to this economic crisis will not include any significant component of privatization, since that too, was soundly rejected by the party in the last election campaign. The fact that the Dems won the election, therefore, means this position has been endorsed and we can rest easily in the knowledge that the \"demon\" of privatization has been set aside for the time being. The admission that our deficit is a problem is not particularly helpful without an indication of the manner in which this problem will be approached, especially as the two logical facilities to address it have been effectively \"ruled out\" . I am also inclined to think that problems such as these are easier to tackle when one is proactive, hence, it would make sense to take action sooner rather than later. I am, however, aware that this is not about what I think or feel, but about the confidence the people of this country have placed in the DLP and its leadership. This vote of confidence means that we all have to sit quietly and wait until the time when this administration considers it appropriate to act. Services For information about this website or content published please contact the Online Editor respectively. Regarding press releases please contact Janice Griffith. Subscribe Subscribe to NationNews with our Twitter. Legal Copyright? 1997 - 2012, Nation Publishing Co.. Limited? P.O. Box 1203, Fontabelle, St. Michael, BB11000, Barbados, West Indies? All Rights Reserved"}, {"articleID": "2019011106_00145223_W", "names": {"Jim Young": ["Q55436204", "Q6199064", "Q6199066", "Q6199069"], "Nick Buchanan": ["Q28043413", "Q7026824"]}, "date": "2019-01-11", "url": "http://www.advertiser-tribune.com/news/local-news/2019/01/landfill-stink-residents-voice-odor-concerns/", "content": "Landfill stink: Residents voice odor concerns Staff Writer vjohnson @ advertiser-tribune.com PHOTO BY VICKI JOHNSON Workers in trucks and heavy equipment work on a hill at the landfill. Odor emanating from Sunny Farms Landfill is causing a stink. Area residents are concerned about the smell and the effect hydrogen sulfide gas may be having on their health, and the company that owns the landfill has begun putting together new measures to control the gas. Hydrogen sulfide is the byproduct of the decomposition of construction materials, which is the main waste product that goes into the landfill. Specifically, the company said the gypsum in wall board gives off the gas as it decomposes, which is similar to the smell of rotten eggs. Because of the ongoing issue, a group of residents--the Greater Fostoria Environmental Coalition--is making its concerns known to public officials. At its December meeting, the Seneca County General Health District health board was to vote on renewing the operating license of Sunny Farms Landfill, a Tunnel Hill Partner, 12500 W. CR 18, Fostoria. However, at least 80 residents crowded the meeting room, spilling into the hallway, to voice their opposition to renewing the license, said Tim Wasserman, director of Ottawa Sandusky Seneca Joint Solid Waste District. Wasserman said he attended the meeting because the OSS district works with the health department, providing funds for landfill inspections. He said OSS has no regulatory authority, but receives funding based on the waste that goes into the landfill. Wasserman said <mark>Jim Young</mark>, the health board chairman, tried to give everybody an opportunity to speak about their concerns. \"They were even in the hallway,\" Wasserman said. \"He just realized this wasn't the best way to accomplish what they wanted to do.\" The vote was postponed. The health department has scheduled a public meeting for 6 p.m. Jan. 30 at Fostoria High School to collect input from the public and other agencies. \"The odor has been significantly worse the last few months,\" Wasserman said. \"We have gotten calls. I think the people are frustrated that they're not getting answers and that they haven't been heard.\" He said the OSS office refers calls to the Ohio Environmental Protection Agency's odor hotline. \"We have no regulatory authority,\" Wasserman said. \"We provide funding to the Seneca County Health Department for inspection of the facility as part of the allowable use of our money.\" He said funding me meant to provide inspection and enforcement to ensure the facility is following the rules. The health department and Ohio EPA work together to provide inspections. \"Basically, our only role is a good part of our funding comes from the tipping fees that are paid by the facility,\" he said. However, Wasserman said there's an ongoing issue between OSS and the company regarding classification of materials going into the landfill. \"There have been issues since 2004 or 2005 and a consent order in 2008,\" he said. The company is required to take photos of each load of material that arrives to determine if it's solid waste or construction materials. Wasserman said the two classifications have different requirements. \"We've lost a significant amount of revenue because of it to the point where it's having a significant effect on our budget,\" Wasserman said. He said the matter has not been finalized by Ohio EPA. \"In the meantime, we disagree with how they're classifying, but EPA has never finalized the dispute resolution process,\" he said. Wasserman said there is new management at the landfill, and he hopes the issue will be resolved. Back to the odor issue, Wasserman said he gives the health department credit for putting together the meeting. \"The meeting will be a good opportunity to provide everyone with the facts so there isn't this doubt about what's going on,\" he said. \"If everybody's there, they can get answers to their questions.\" The residents' perspective The six members of the Greater Fostoria Environmental Coalition have taken on the task of getting answers for everyone who suffers from the hydrogen sulfide smell, said Nate Heiser, one of the members. He said the other members are Doug Lear, Myra Spires, Lori Wolph, <mark>Nick</mark> VanGiesen and <mark>Nick Buchanan</mark>. Heiser said the group discovered the health board was going to vote on license renewal and decided to attend the meeting. \"We didn't want a renewal without knowing things were going to be corrected,\" Lear said. \"You can smell the issue,\" Heiser said. \"We needed to make sure our voices were being heard.\" \"What it came down to is a lot of us knew there were certain corrections that were supposed to be made in the past,\" Lear said. \"We want our questions answered from Seneca County Health Department, Ohio EPA and so on, and that it's been extremely hard to get these questions answered.\" It's not only the odor that is causing concern, Heiser said. \"Two or three years ago it was a nuisance once in a while,\" he said. \"Now it's affecting our quality of life.\" Heiser and Lear said the problem has gotten worse during the past year. They have suffered headaches, burning eyes and sore throats when the odor is at its worst, and they have received reports from many other people who say they have been physically affected in similar ways. They said it's not only Fostoria that's affected. People in Arcadia, Bascom and many other areas have been commenting on the group's Facebook page--Sunny Farms Landfill Complaint Group. Because of past violations by the landfill company, Lear said the group is concerned about the environmental impact the landfill is having on soil and water as well as air quality. \"We want multiple testing done,\" Lear said. \"Water, soil and sediment, air, not just wells as it's been in the past. He said toxins already could be in topsoil and surface water and it could take many years to get into the ground water. At the Jan. 30 meeting, Heiser said the group wants to\" do a question and answer session \"with landfill representatives, Ohio EPA, the health department, Seneca County commissioners and Fostoria administrators.\" We're going to ask the tough questions, \"he said.\" Enough is enough. \"In the interim, the coalition is attending public meetings such as the county commissioners, Fostoria city council and township trustees.\" We had a meeting with (Rep.) Bill Reineke (Wednesday), \"Heiser said.\" He said he's going to make this his No. 1 issue. \"The company's perspective\" We are working to address concerns about odors at Sunny Farms, \"said Matt Neeley, vice president of operations for Tunnel Hill. He said he's been working for Tunnel Hill since February 2018, and has worked in the waste industry for 35 years.\" We recognized several months ago that we needed to improve our gas collection and treatment system, \"Neeley said.\" We started a process where we went out and took a look at what technologies were available. \"Neeley said gases are formed by decomposing waste material, and the gypsum in wallboard breaks down into hydrogen sulfide.\" It's detectable in really minute quantities, \"he said. A lot of factors affect hydrogen sulfide odor, he said, such as wind direction, temperature, atmospheric conditions.\" We actually ordered the system back in October, \"he said.\" It's being installed onsite currently. We turned on the first phase of it the first week in January, and we are going to expand that system. \"Neeley said it's too soon to tell if the system is working better.\" It's been a week, \"he said.\" It's hard to tell. \"Ben Nutter, regional sales manager, said he has worked for the company since 2013. He said past gas control was a system that burned off gas with flares.\" As the company created a new cell, they were producing a lot more gas and started putting a plan in place, \"he said.\" We wanted to make sure we got the right system. The pieces are coming together. \"In the new system, Neeley said the company drills wells into the landfill and draws gases into vertical and horizontal collectors.\" And then we have a network of pipes that are connected to the extraction devices, \"he said.\" So we are able to suck the gases out of the landfill and create negative pressure. \"In addition to the new, more sophisticated, system which pipes gas to the flares, Neeley said the company is placing a geomembrane cover over 20 acres of the facility this spring or summer. He said the company plans to present the plan to Ohio EPA next week, and he's confident it will be approved. Later this year, he said more well and collectors are to be added to more areas of the landfill.\" That work is also going to be started in the first quarter and we'll be doing that continuously through fall, \"he said.\" The long-term fix is that we are improving our gas collection system, adding in a hydrogen sulfide treatment system, and we think the addition of these systems will result in improved control of natural gasses at the site, \"Neeley said.\" We're not oblivious, \"Nutter said.\" We not only monitor our gas, but we have monitoring wells for ground water. \"He said monitored information is provided to the health department and EPA.\" We are working hard to address the community concerns about odors at Sunny Farms and we regularly check the odors in the landfill and outside of the landfill every day, \"Neeley said.\" When we receive a complaint, we go out and investigate to find out where the odor is and if it's coming from the landfill. If we find the source, we'll maximize our gas collection system and provide additional cover or take whatever measure we can at the site. \"\"We're investing a lot of resources to make sure that happens,\" Nutter said. \"In the years since I've worked here, this new management team is the most aggressive we've had. They're not going to stop, and will continue to put resources toward this issue.\" "}, {"articleID": "2017101315_00240864_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Stephen Paddock": ["Q41529365", "Q41711871"]}, "date": "2017-10-13", "url": "http://www.foxnews.com/politics/2017/10/13/newsweek-labels-value-voter-summit-as-hate-group-ahead-trump-appearance.html", "content": "Newsweek has labeled the Family Research Council's Value Voter Summit a \"hate group\" in a headline published in advance of President <mark>Trump</mark>'s speech there. The online story that appeared Thursday was headlined, \"<mark>Donald Trump</mark> to speak at hate group's annual event, a first for a president.\" It doesn't explain who actually labeled it as a hate group until the third paragraph. Newsweek cites the Southern Poverty Law Center as the organization that deemed the Family Research Council a \"hate group,\" but the SPLC doesn't exactly have the best reputation itself. The group claims to fight \"hate and bigotry\" and seeks \"justice for the most vulnerable members of society.\" However, many critics say the group's methodology for labeling a group or person as \"extremist\" in unclear and the Pentagon recently severed all ties to the group, according to the Daily Caller. \"This vile group claims to be expert on hate, but that's only because it promotes hatred of conservatives and Christian groups.\" - Media Research Center Vice President Dan Gainor \"There's absolutely nothing legitimate about the Southern Poverty Law Center's so-called hate list. This vile group claims to be expert on hate, but that's only because it promotes hatred of conservatives and Christian groups,\" Media Research Center Vice President Dan Gainor told Fox News. Earlier this month, the Daily Caller obtained emails that show the Department of Defense Office of Diversity Management and Equal Opportunity \"removed any and all references\" to the SPLC from its training materials. The SPLC has also been under fire from conservative organizations, and a Christian ministry group based in Florida sued the SPLC last Summer after it labeled the ministry as a hate group. The Patriot Post calls the SPLC \"the anti-hate group that is a hate group\" and labeled it as \"un-American\" in a story that specifically questions why the media continues to quote them--which is exactly what Newsweek did with its headline. \"The next time you see the Southern Poverty Law Center quoted in the news, just remember: the masterminds behind the SPLC aren't eliminating hate. They are fueling it,\" the Patriot Post wrote on Friday. This undated photo provided by the Las Vegas Metropolitan Police Department shows Marilou Danley. Danley is being sought by the LVMPD for questioning in connection with the investigation into the active shooter incident on Sunday, Oct. 1, 2017. (Las Vegas Metropolitan Police Department via AP) (Las Vegas Metropolitan Police Department) It's been a rough time for Newsweek and the magazine has issued at least 20 corrections in 2017, including at least one per month, and even has a page on its website dedicated to its mistakes. The magazine admitted to over 50 mistakes in 2016 and recently issued an embarrassing retraction about a story that falsely detailed the life of the Las Vegas shooter's girlfriend with salacious information that turned out to be fake news. Citing public records, the original story claimed <mark>Stephen Paddock</mark>'s girlfriend, Marilou Danley, had used two social security accounts and had two husbands at the same time. The now-retracted story said that Danley is the \"one person who holds the key to solving the mystery\" of the deadliest mass shooting in American history. Newsweek painted her as \"a shadowy figure with a convoluted life of her own,\" who lived \"an unconventional life.\" Unfortunately for Newsweek, the initial report was based on the marriage record of Danley, who was known under a different name when she married Geary Danley in Clark County, Nevada, according to the magazine. Gainor mocked Newsweek for promoting SPLC's \"garbage\" and brought up the 2010 sale of the magazine when Dr. Sidney Harman only had to spend $1 to acquire it because the publication came with so many financial liabilities. \"It's hard to imagine a publication that sold for $1 going down in value, but it has,\" Gainor said. Brian Flood covers the media for Fox News. Follow him on Twitter at @ briansflood."}, {"articleID": "2019100412_00044030_W", "names": {"Carrie Lam": ["Q19217", "Q5046264"]}, "date": "2019-10-04", "url": "http://www.thisisthewestcountry.co.uk/news/national/17947545.thousands-protest-mask-ban-hong-kong-leader-toughens-stance/", "content": "Thousands protest against mask ban after Hong Kong leader toughens stance By Press Association 2019 Hong Kong Protests 0 comment Masked protesters have streamed into central Hong Kong after the city's embattled leader invoked rarely used emergency powers to ban masks at rallies in a hardening of the government's stance after four months of demonstrations. Immediately defying the ban set to take effect on Saturday, thousands of protesters crammed streets in the central business district shouting \"Hong Kong, resist\" . City chief executive <mark>Carrie Lam</mark> said at a news conference that the mask ban, imposed under a colonial-era emergency ordinance that was last used over half a decade ago, targets violent protesters and rioters and \"will be an effective deterrent to radical behaviour\" . The ban applies to all public gatherings, both unauthorised and those approved by police. Masks will be permitted for \"legitimate need\" when wearers can prove they need them for work, health or religious reasons. Ms <mark>Lam</mark> stressed it does not mean the semi-autonomous Chinese territory is in a state of emergency. She said she would go to the legislature later to get legal backing for the rule. \"People are asking can Hong Kong go back to normal? Is Hong Kong still a place where we can have our sweet home?\" she said as she announced the ban. \"We must stop the violence. Now, it's all over Hong Kong.\" <mark>Carrie Lam</mark> (Vincent Thian/AP) Even as she wrapped up her announcement, protesters in masks and concealing themselves under umbrellas were gathering. The ban makes the wearing of full or partial face coverings, including face paint, at public gatherings punishable by a year in jail. A six-month jail term could be imposed on people who refuse a police officer's order to remove a face covering for identification. Ms <mark>Lam</mark> would not rule out a further toughening of measures if violence continues. She said she would not resign because \"stepping down is not something that will help the situation\" when Hong Kong is facing \"a very critical state of public danger\" . \"We must save Hong Kong, the present Hong Kong and the future Hong Kong,\" she said. \"We can't just leave the situation to get worse and worse.\" Thousands of masked protesters marched in the city's business district (Vincent Yu/AP) Thousands of masked protesters marched in the city's business district before she spoke. They chanted \"I want to wear face masks\" and \"Wearing a mask is not a crime\" . \"Will they arrest 100,000 people on the street? The government is trying to intimidate us but at this moment, I don't think the people will be scared,\" one protester told an online live broadcast. At the nearby Causeway Bay shopping area, a huge crowd occupied streets to protest against the mask ban, and smaller rallies were held in several other areas. The protests have lasted months (Vincent Thian/AP) Face masks have become a hallmark of protesters in Hong Kong, even at peaceful marches. As the use of police tear gas has become widespread, many young protesters have worn heavy duty gear including full gas masks and goggles. Even peaceful masked marchers cite fears they could lose jobs and be denied access to schooling, public housing and other government-funded services if identified as having taken part in demonstrations. Many also are concerned their identities could be shared with the massive state-security apparatus that helps keep the Communist Party in power across the border in mainland China, where hi-tech surveillance including facial recognition technology is ubiquitous. 0 comment"}, {"articleID": "2018091312_00338371_W", "names": {"Kurt Busch": ["Q201820", "Q42507470"], "Erik Jones": ["Q16239574", "Q57422872"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"], "Matt Mccall": ["Q20744528", "Q21872602", "Q6789029"], "Mike Wheeler": ["Q20687571", "Q24703080"]}, "date": "2018-09-13", "url": "https://nascar.nbcsports.com/2018/09/13/nascar-america-chase-elliott-erik-jones-highlight-playoff-underdogs/", "content": "Click to share on LinkedIn (Opens in new window) Whether it's the Big 3 of Kyle Busch, Kevin Harvick and Martin Truex Jr. or the Dynamic Duo of <mark>Busch</mark> and Harvick who are expected to dominate the playoffs, the remainder of the field has been relegated to the status of underdog before this week's race at Las Vegas Motor Speedway (3 p.m. ET on NBCSN). Throughout the season, the quest has been underway to determine who will be the driver most likely to join the Big 3 at Homestead with a shot at winning the Cup. Brad Keselowski has \"won two races; he's still not my guy,\" Kyle Petty said on Wednesday's edition of NASCAR America. \"Even Brad said it a Darlington. Darlington and Bristol are anomalies. You can win there and not have the fastest car ....You just have to make things work. When we went to Indy, he didn't have the fastest car. He just won on strategy. He's not going to...use\" strategery' for the last 10 races of the year. \"With Keselowski out of the final four picture for Petty, attention turns to Chase Elliott.\" Chase Elliott's my guy ....Here's the way I look at it, \"Petty said.\" There's the Big 3--and Martin is just teetering right now--and then there's another seven, eight cars that are all the same to me. Nobody jumps out ....But if I take that middle group, Chase Elliott's my guy. \"\"I look at Chase Elliott and I see a guy who--the last two years, Alan Gustafson has figured out...as soon as we hit the track at Vegas, we're going to be on another gear,\" Nate Ryan said. Elliott has run so well, however, that Ryan does not consider him an underdog. He's a favorite to make the final four. Instead, Ryan is going with a driver in his first Cup contention. \"If I'm looking for an underdog, I think <mark>Erik Jones</mark>,\" Ryan said. For more, watch the video above. Since he began driving in Cup for Roush in 2015, Bayne has zero wins, four top fives and 11 top-10 finishes in 124 starts. Here's a look at where Silly Season stands at this point: ANNOUNCED CUP RIDES FOR 2019--Bubba Wallace will remain with Richard Petty Motorsports through the 2020 season (announcement made July 28) CUP RIDES NOT YET ANNOUNCED FOR 2019 No. 1: The Associated Press reported Sept. 10 that car owner Chip Ganassi had offered Jamie McMurray a contract to drive in the 2019 Daytona 500 only and then move into a management position. Ganassi was awaiting McMurray's decision. The move means the No. 1 will be open for 2019. No. 6: Car owner Jack Roush said Sept. 12 on SiriusXM NASCAR Radio that Trevor Bayne would not be back with Roush Fenway Racing after this season. Bayne, who has shared the No. 6 ride this season with Matt Kenseth, has driven in Cup for Roush since 2015. No. 23: Front Row Motorsports purchased the BK Racing team in bankruptcy court. Front Row needs the team to run the rest of the season to maintain the charter. After this season, Front Row could run a third car, lease this charter or sell this charter. No. 32: Go Fas Racing is looking for a driver after Matt DiBenedetto's announcement Sept. 7 that he won't return to the team after this season. No. 41: <mark>Kurt Busch</mark> signed a one-year deal last December to remain at Stewart-Haas Racing. He said Aug. 31 at Darlington that he has two contract offers for 2019 but did not reveal what teams they were from. <mark>Busch</mark> said Sept. 7 he had no updates on his status. No. 95: Kasey Kahne announced Aug. 16 that he would not return for another full-time season. Also, this team has told Richard Childress Racing it won't be a part of its technical alliance next year. Car owner Bob Leavine said Aug. 5 that \"in our talking to the manufacturers this year, Toyota has been head-and-shoulders above the rest so far.\" DRIVERS WITHOUT ANNOUNCED PLANS FOR 2019 Trevor Bayne: 2011 Daytona 500 winner is looking for a ride after the Sept. 12 announcement he won't return to Roush Fenway Racing in 2019. <mark>Kurt Busch</mark>: 2004 champion's contract expires after this season with Stewart-Haas Racing. Matt DiBenedetto: Said he was betting on himself by leaving Go Fas Racing and looking to race elsewhere. While he would like a full-time ride, he would entertain a part-time ride in the Xfinity Series with a winning team, following what Ryan Preece has done. Daniel Hemric: The Xfinity driver for Richard Childress Racing was asked Aug. 17 at Bristol about his future and he described it as: \"Cloudy, very cloudy.\" He said then he has not signed anything for the 2019 season, adding: \"I'm trying to do everything I can on the race track to prove to somebody that would be willing to put me in a car and give me a shot.\" Jamie McMurray: Although he has not revealed his plans, car owner Chip Ganassi told the AP that he had offered McMurray a contract for only the 2019 Daytona 500 before McMurray would move into a management role. Ryan Preece: Modified ace who has run a limited schedule in the Xfinity Series with <mark>Joe Gibbs</mark> Racing and had great success has not announced his 2019 plans. Martin Truex Jr.: Reigning series champion has not announced a ride for 2019 with the Sept. 4 news that Furniture Row Racing is shutting down after this season. XFINITY SERIES OPEN RIDES FOR 2019 Click to share on LinkedIn (Opens in new window) With three tracks in the playoffs that never hosted playoff races before and conversation surrounding a dramatically new aero package for next year, it seems that change is in the air for NASCAR. On Wednesday's edition of NASCAR America, fans used the hashtag #WednesDale on social media to see just how far those changes could go. Their questions began a conversation between Dale Earnhardt Jr., Kyle Petty and Nate Ryan about how NASCAR could alter their summertime calendar to consolidate the schedule without lessening the number of races run. The panelists were uniform in their desire to see most tracks host only one NASCAR Cup race per year. \"I hate to say this Jason, but...I wouldn't want any of the tracks to get a second date,\" Nate Ryan said. \"I don't really want to run anywhere twice,\" Dale Earnhardt Jr. joined in. \"I like Daytona a couple of times, but I'd like to see everyone go to one...and let's consolidate and make it special,\" Petty said. Taking away the second dates would create opportunities for new tracks to join the senior series--opening up new markets in the process. But there is also an opportunity to make the schedule more compact. The answer for Earnhardt, Petty and Ryan is mid-week races. \"We don't have to shorten the amount of races; let's shorten the time of the season,\" Earnhardt said. \"Run on some Wednesdays. Do even some doubleheaders and stuff like that ....But I think they should go to all the racetracks once and then add Iowa, Nashville Fairgrounds--places like that.\" \"Brad Keselowski has talked about this,\" Ryan said. \"That dead of summer period, June, July when NASCAR could really own some Wednesdays.\" For more, watch the video above. Click to share on LinkedIn (Opens in new window) Jack Roush confirmed on SiriusXM NASCAR Radio on Thursday night that Trevor Bayne will not return to the No. 6 in 2019. In April it was announced that Matt Kenseth would replace Bayne behind the wheel of the No. 6 for select races in 2018. Kenseth's first race was at Kansas on May 12. Since then, Bayne has piloted the car six times with a best finish of 11th at Bristol. He is scheduled to run this week at Las Vegas. \"We're...in negotiations with drivers right now that would drive the 6 car next year,\" Roush told Claire B Lang. \"I think the decision has been made--and I don't want to be breaking the story here, but...it's been announced that Trevor's not going to be in the car next year.\" Roush did not provide further details about the driver search, saying: \"Who it is we're talking to and how close we are in those negotiations, I'm not...inclined to say, based on the fact that we are negotiating.\" While he would not reveal who is being evaluated for the ride, he has a type of driver in mind. \"I want a driver that can be fast,\" Roush said. AUDIO: @ roushfenway Jack Roush confirms to @ ClaireBLang that Trevor Bayne WILL NOT return to @ Roush6Team in 2019. Who do you think gets that ride? pic.twitter.com/K1hkmhUdYe Click to share on LinkedIn (Opens in new window) The regular-season finale at Indianapolis Motor Speedway set the stage for raw emotion that bubbled over on the radio and into the pits. Jamie McMurray and William Byron knew their only hope to make the playoffs was in winning one of the biggest races of the NASCAR season, but they were not the only drivers crushed when Brad Keselowski pulled into victory lane instead. Here are some of this week's highlights: \"All right driver. You know what we got to do today. Make it happen.\" --<mark>Matt McCall</mark>, Jamie McMurray's crew chief \"Boys remember, a win gets us in,\" Darian Grubb, William Byron's crew chief \"It was really fast man; sorry about the brakes.\" Cole Pearn, Martin Truex Jr.'s crew chief \"I let him go every time he's been even close to me all year. Lead lap or not. If he don't want to do the same, then the next time racing, good luck getting around me.\" --Matt Kenseth on Joey Logano. \"The 6 wasn't too appreciative of the blocking.\" --Logano's spotter \"Yeah, well I'm not too appreciative of a lot of things from that guy--so: so what.\" --Logano \"He just frickin' dive-bombed the hell out of me.\" --Landon Cassill after contact with Jeffrey Earnhardt \"Cautions didn't fall our way. Make sure to keep your heads up; no dejection here.\" --<mark>Mike Wheeler</mark>, Denny Hamlin's crew chief after they lost the race. \"Not have meaningless guys in the back wreck. I mean, I don't know what they're doing crashing with a couple of laps to go--multiple laps down.\" --Hamlin For more, watch the video above."}, {"articleID": "2019091016_00187656_W", "names": {"George Glass": ["Q23197970", "Q56477004"]}, "date": "2019-09-10", "url": "https://www.gwhatchet.com/2019/09/10/justin-diamond-announces-intention-to-resign-in-first-sa-senate-meeting-of-semester/", "content": "Media Credit: Arielle Bader | Assistant Photo Editor Student Association Sen. Justin Diamond, ESIA-U, announced plans to resign from his post Monday. Newsroom Blog By Lizzie Mintz Sep 10, 2019 12:22 PM Three Student Association senators announced plans to resign from the SA Senate during the first meeting of the semester. SA Sen. Justin Diamond, ESIA-U, said during the meeting Monday that he will resign from his post \"effective immediately.\" Diamond launched a last-minute bid for SA president in the spring on a platform to abolish the organization, but he lost in a run-off election against SA President SJ Matthews and garnered enough write-in votes to win a seat representing the Elliott School of International Affairs. Diamond said his time in the SA only reinforced his belief that the organization is an ineffective body and has taken a \"toll\" on him because he has struggled to gain respect from other SA members. After notching a senate seat last spring, Diamond vowed to \"destroy the SA from within.\" \"Following the campaign, I wanted something to spring off of, have somewhere to go, have some sort of direction, maybe make some sort of change in the SA,\" Diamond said. \"But fundamentally, the institution itself can't be changed really from within by me because I don't really have allies there--it was kind of stupid to think that would even be possible.\" SA Sen. <mark>George Glass</mark>, CCAS-U and the chair of the finance committee, said SA Sen. Arman Hussain, SMHS-G, and Robert Yassky, SOB-G--who were both absent from the meeting--would resign. Diamond, Hussain and Yassky all served on the finance committee, <mark>Glass</mark> said. <mark>Glass</mark> said Yassky and Hussein told him they intended to resign because of the SA's required time commitment to the finance committee and biweekly senate meetings. \"Finance out of all of the committees in the SA is the most strenuous,\" he said. \"We meet every single week for a reason because student orgs need money.\" SA Executive Vice President Amy Martin she said would rather have senators immediately resign when they realize they cannot commit to the time or job rather than stay in the senate and do \"little to no work.\" \"I think what we're seeing is just that the senators who are here and who are present are very active and they're very engaged and they're wanting to do the work and wanting to have the discussions,\" she said. \"So if that means I lose two or three senators who have just realized that they can't give that commitment, I think that that's fair play.\" Shannon Mallard and Kate McCarthy contributed reporting."}, {"articleID": "2017123114_00123081_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"], "Theresa May": ["Q264766", "Q30161835"], "Sean Williams": ["Q3531227", "Q41674016", "Q552911", "Q6379568", "Q7441537", "Q973049"]}, "date": "2017-12-31", "url": "https://sg.finance.yahoo.com/news/18-predictions-2018-130400153.html", "content": "2017 turned out to be a pretty banner year for investors and America as a whole. The U.S. stock market indexes all hit dozens of new all-time highs, with the Dow Jones Industrial Average (DJINDICES: ^ DJI) setting a record for the most record closes hit in a single year. It's safe the say the memories of the Great Recession have been put to bed for good. The U.S. economy hummed along, despite the Federal Reserve increasing interest rates on three separate occasions. GDP growth in the third quarter came in at a very healthy 3.2% ahead of the holiday season, and the U.S. unemployment rate of 4.1% as of Nov. 2017 is the lowest it's been since December of 2000. View photos A man in a suit with his hands around a crystal ball. More Image source: Getty Images. 18 predictions for 2018 But as we prepare to dive headfirst into 2018, there are plenty of questions on everyone's mind. Most of these revolve around what we as investors should expect next. While I don't have a crystal ball (I'd be retired by now if I had a functional one), and am not in any way guaranteeing that the following will come true, here are 18 predictions that I suspect have a decent chance of coming true for the upcoming year. 1. Bitcoin will lose at least half of its value, twice Following a blistering run higher, bitcoin's volatility only seems to be growing, not slowing, despite the addition of bitcoin futures trading in December 2017 and the expectation of bitcoin ETFs becoming available in 2018. Since April 2013, bitcoin has plunged by 22% on 20 separate occasions, with three of those instances matching or topping a 50% decline. Given how retail investors (and their emotions) are still in control of bitcoin, wild volatility should be expected. Don't be surprised if bitcoin plunges by 50% or more twice next year. 2. Russia will ban bitcoin Vladimir Putin seems to be all but a lock to win a 2018 presidential election in Russia. But this isn't the biggest story you can expect from Russia in the upcoming year. My belief is that Putin will put his foot down on bitcoin and ban the popular cryptocurrency. In October, Putin was quoted as saying bitcoin creates \"opportunities to launder funds acquired through criminal activities, tax evasion, even terrorism financing, as well as the spread of fraud schemes.\" Russia's central bank concurred, too. The list of countries where bitcoin is banned should grow in 2018. View photos A physical gold bitcoin on a table. More Story Continues Image source: Getty Images. 3. Bitcoin will (briefly) lose its spot at the head of the cryptocurrency table Until recently, bitcoin made up between 60% and 80% of the aggregate market cap of all cryptocurrencies combined. But the fourth quarter saw other virtual coins rally in a big way and handily outperform bitcoin. It's my suspicion that while bitcoin will begin and end the year as the world's largest cryptocurrency by market cap, it'll lose that title, at least briefly, in 2018. To what cryptocurrency, you ask? My guess would be either Ripple, which has been snagging blockchain partnerships with big financial institutions, or Ethereum, which has 200 organizations around the world testing a version of its blockchain. 4. Sears Holdings won't make it through the year without a bankruptcy filing Troubled retailer Sears Holdings (NASDAQ: SHLD) has reached into its bag of tricks one too many times and has prevented the inevitable---- bankruptcy--for far too long. It's taken loans from its CEO, Eddie Lampert, sold off its well-known Craftsman brand to Stanley Black & Decker, and closed countless Sears and Kmart locations. It's just not working, with organic sales continuing to decline at a rapid pace. 2018 will be the year that Sears seeks the safety of bankruptcy protection. 5. Apple will fail to reach the $1 trillion mark Apple (NASDAQ: AAPL) recently became the first publicly traded company ever to cross the $900 billion market cap mark. But I don't believe it'll be the first to hit $1 trillion, despite being so close. Much of the hoopla surrounding the iPhone 8 and X has already been priced into Apple's stock, which has proven to be historically cyclical based on its development cycle. This doesn't mean we'll necessarily witness a rush to the exit, but Apple will be far from a growth story, in my view, in 2018. View photos A stock chart plunging into the red. More Image source: Getty Images. 6. The U.S. stock market will experience its first correction in over two years Can you believe it's essentially been two years since the stock market moved lower by at least 10%? My suspicion is that'll change in 2018. Since 1950, the S & P 500 (SNPINDEX: ^ GSPC) has had 35 corrections that, when rounded to the nearest whole number, were 10% or greater, according to Yardeni Research. Though the stock market doesn't care about probability, history says we're due. 7. The U.S. stock markets' annual winning streak will come to a modest end The stock market has been on a relative tear now for nine consecutive years. This writer doesn't believe it'll extend to a 10th year. Long-term buy-and-hold mogul Warren Buffett often suggests that investors \"be fearful when others are greedy, and greedy when others are fearful.\" Right now, things look a little too perfect, and there's very little pessimism to be found on Wall Street. That looks to be the perfect recipe for a disappointing year for the broader market, if Buffett's analysis is correct. 8. Utilities will outperform the S & P 500 On the other hand, a flat to modestly down year in stocks often means investors returning to the safety of basic-needs industries. After eating dust for years, my belief is that 2018 will represent a strong year for utility stocks. Their steady cash flow, higher-than-average dividend yields, and share-price stability could be exactly what investors flock to if the stock market or cryptocurrencies undergo a major correction. View photos A chart of rising interest rates, with U.S. dollars being used as the rising line. More Image source: Getty Images. 9. The Fed will hike rates three times, despite minimal inflation The big debate is whether the Federal Reserve will increase its federal funds target rate, which influences interest rates, two or three times in 2018. My guess would be three hikes, albeit I still don't see inflation picking up much despite strong Q3 GDP growth figures and the recently passed GOP tax reforms. The Fed is going to continue walking on eggshells and pussyfooting its way to higher interest rates, one quarter-point rate hike at a time. 10. Gold prices will buck higher interest rates and end the year higher Higher interest rates are usually bad news for gold investors since the lustrous yellow metal has no yield. However, it should buck the trend in 2018. Corrections in the cryptocurrency market should send some investors back to gold, while continued pressure on the U.S. dollar tends to be a positive for the gold market. Let's also not forget that gold producers haven't exactly ramped up exploration spending as they did in the early part of the decade. With demand likely to continue outpacing production growth, the fundamentals are in place for a strong year in gold and gold stocks. 11. The GOP will lose control of the Senate, but maintain control of the House Politics is about as easy to predict as the next number on a roulette wheel. Then again, it's not hard to ignore the disapproval ratings with the GOP's handling of healthcare reform and tax reform from the American public. With just a one-seat majority in the Senate and midterm elections looming in November 2018, it's looking more likely than not that the GOP-controlled Congress will soon become a split Congress. View photos A doctor shrugging his shoulders and hands. More Image source: Getty Images. 12. Healthcare reform will again fail to pass muster in Congress Given the prediction that the GOP will lose seats in the Senate, the chances of healthcare reform passing in the upcoming year is very slim. Republicans couldn't repeal Obamacare and implement a new healthcare plan when they had a two-seat advantage, so it seems even less likely it'll happen with a one-seat advantage for only a portion of the year. Plus, with an infrastructure plan on the horizon, healthcare reform could again take a backseat. In short, Obamacare, or at least its shell now that the individual mandate has been repealed, will live on. 13. At least three new states will legalize recreational marijuana Since 1996, 29 states have legalized medical cannabis, with residents in eight states OK \"ing the legalization of recreational pot sales. In 2018, I'd look for at least three, and up to six, states to legalize recreational marijuana. Arizona and Michigan are likely to see voters approve an adult-use weed measure, while New Jersey's Gov.-elect <mark>Phil Murphy</mark> (D-NJ) has already stated that he'd sign a recreational pot bill put on his desk. 14. Canadian marijuana stocks will double...again Sure, cryptocurrencies are all the rage, but among traditional equities, marijuana stocks have been on fire! In particular, Canadian pot stocks can't be stopped of late, primarily based on the expectation that Canada will become the first developed country in the world to legalize adult-use weed by July 2018. With medical cannabis sales steadily increasing and pushing some growers into the black and adult-use demand capable of adding $3.7 billion to $5 billion in annual sales, Canadian marijuana stocks have a real shot to skyrocket even further in 2018. View photos A man wearing Britain's flag colors for a shirt, with parliament in the background. More Image source: Getty Images. 15. Brexit goes nowhere Looking overseas for a moment, I'd venture a guess that virtually nothing gets resolved in Britain's attempt to break away from the European Union. Though the clock is ticking and the March 2019 date is approaching, the U.K.'s <mark>Theresa May</mark> and European leaders are nowhere near reaching a consensus on how much Britain should pay to leave the EU, or what the nature of future trade deals with the U.K. will look like. This lack of progress could set the U.K. up for a disappointing year. 16. Oil will touch $75 per barrel for the first time since 2014 Following a number of really bad years for oil drillers, 2018 is really looking up. West Texas Intermediate recently hit $60 per barrel for the first time since mid-2015, and my suspicion is it'll move as high as $75 per barrel in 2018. Both OPEC and non-OPEC countries have thus far stuck with production cuts, resulting in less oversupply and a higher crude price. Furthermore, the chance of conflict in the Middle East appears to be rising. Any disruption in Middle East oil production would be viewed as a positive for oil prices. 17. The federal minimum wage will increase for the first time since 2009 It's been nine years since the federal minimum wage has been increased by Congress. I believe that'll change in 2018, and $7.25 an hour will be a thing of the past. To begin with, not adjusting the minimum wage higher in nine years has allowed minimum wage workers to be crushed by the impacts of inflation. With the U.S. economy clicking and unemployment exceptionally low, there are ample reasons to support an increased federal minimum wage. Additionally, if Democrats gain hold of one or both houses of Congress, I suspect they'll make a federal minimum wage increase a priority. View photos A person holding a Social Security card in their hand. More Image source: Getty Images. 18. Social Security's COLA comes in below 2% for 2019 Last, but not least, I'd expect Social Security's cost-of-living adjustment, or COLA, to disappoint once again. The only reason beneficiaries received a 2% raise in 2018--the highest raise in six years--was a result of gasoline-price inflation tied to hurricanes Harvey and Irma. While representing a nice upward tick in benefits, it's also going to create some tough year-over-year comparisons for Social Security's inflationary tether, the Consumer Price Index for Urban Wage Earners and Clerical Workers. Unless the U.S. is hit by another devastating hurricane in the third quarter of 2018 or inflation dramatically picks up, COLA is likely to come in below 2% for 2019. More From The Motley Fool 3 Growth Stocks at Deep-Value Prices 5 Expected Social Security Changes in 2018 6 Years Later, 6 Charts That Show How Far Apple, Inc.. Has Come Since Steve Jobs' Passing 10 Best Stocks to Buy Today The $16,122 Social Security Bonus You Cannot Afford to Miss Bitcoin's Biggest Competitor Isn't Ethereum--It's This <mark>Sean Williams</mark> has no position in any of the stocks mentioned. The Motley Fool owns shares of and recommends Apple. The Motley Fool has the following options: long January 2020 $150 calls on Apple and short January 2020 $155 calls on Apple. The Motley Fool has a disclosure policy."}, {"articleID": "2012110804_00012684_W", "names": {"Allen West": ["Q2095615", "Q3277451"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Patrick Murphy": ["Q17418821", "Q21170773", "Q2224935", "Q23418906", "Q3182011", "Q3299047", "Q55360928", "Q58096471", "Q58544103", "Q5997832", "Q7147290", "Q7147291"], "Joe Walsh": ["Q16235144", "Q1691639", "Q1691642", "Q354033", "Q6212865"], "Tony Scott": ["Q18353288", "Q193648", "Q2550621", "Q27831098", "Q32937", "Q57306593", "Q7823372", "Q7823373"]}, "date": "2012-11-08", "url": "http://examiner.com/article/dc-reaction-to-election-2012", "content": "related topics dc government election 2012 dc council mitt romney barack obama <mark>allen west</mark> advertisement many americans felt president barack obama (d) was guaranteed to win re-election on november 6 the minute republican mitt romney won his party's nomination, while a few other thought obama's road to winning would be hampered by high unemployment and an economy that simply wasn't growing fast enough. throughout it all president obama held fast and continued to tout that it would take more than four years to fix the mess president george w. bush handed him. obama strongly felt this, and it appears that over 60.6 million americans agreed with his vision. \"we had our butts handed to us,\" said dc resident and gop supporter agnes fitzgerald. \"hopefully, we can use this as a real learning experience and get someone elected to the white house that accurately sees the world from the same lens as the majority of america.\" \"romney's mormonism might have been an issue in 2008, but we didn't care about that this go\" round, \"mentioned chris nixon.\" us senator <mark>harry reid</mark>'s a mormon and no one seems to care. \"nixon may be right, but <mark>reid</mark> serves in nevada (a state that borders pro-mormon utah) where mormonism is less of an issue than in mississippi or alabama. nixon went on to say it was romney's flip-flopping that turned off so many independents. although the economy is growing at a snail's pace, over 60 percent of the voters said the economy was rated their top issue according to the washington post. they reported, about 4 in 10 said the economy is on the mend...the survey was conducted for the associated press and a group of television networks. with wins in ohio, iowa, new hampshire and colorado, four of the nine battleground states, it became evident that obama would stay in the white house, he tweeted:\" this happened because of you. thank you, \"as his message to the american people. and with that message, the nearly $1 billion election 2012 campaign was over. the gop mood went from high anticipation to mixture of frustration and acceptance of the inevitable as the tallying came in. neither romney or his vice-presidential choice, us congressman <mark>paul ryan</mark>, won in any of the states they call home: wisconsin for <mark>ryan</mark>, and michigan, new hampshire, and massasuchettes for romney. but <mark>ryan</mark> did manage to be re-elected in his wisconsin us house seat. dc resident colby jackson said,\" come on now - even <mark>ryan</mark> knew he was on a sinking ship by staying in the house race. i find that to be laughable. \"some washington, dc democrats are pleased, but not ecstatic. columbia heights neighborhood resident marvin simpson is one of them.\" i was happy to see the leader of my political party win, but a little part of me wonders how much longer can i go on living hand-to-mouth. i'm not blaming obama for that, but i am looking to my president and city leaders for help, \"he said via email. felicia darby, a southeast dc resident who is enrolled in nursing school, is concerned about how much progress the second administration may deliver.\" the republicans are still going to run the house - with pretty much the same people, \"she said.\" we still have the white house and the senate, so i guess the question might be who's going to flinch first. \"on speaking about the unchanging congress and the president, tucker keene, a junior at southern methodist university (smu) majoring in political science, economics and public policy posted, this should be comforting to republicans as well - particularly those who are scared that president obama will pass all the left wing legislation that he was hoping to pass in his first term. the political reality is no better for him than it was these last few years, and so the gridlock should remain. and, republicans need not despair, and democrats need not gloat. not much seems likely to change these next few years. the status quo is likely to remain. election 2012 did have a couple of bright spots: obama, the first african-american president won re-election, romney became the first mormon on a gop presidential ticket, tammy baldwin won her campaign as the first openly gay female in congress, <mark>patrick murphy</mark> (d) defeated incumbent <mark>allen west</mark> (r), tammy duckworth (d) defeated incumbent <mark>joe walsh</mark> (r), and <mark>tony scott</mark> (r) became the first african-american to head to the us congress from south carolina. . the two biggest bright spots are: americans have time to see if obama reasoning will work and the gop can't go anywhere but up (besides, they have an impressive crew for 2016). keene advises conservatives to keep their eyes on sen. marco rubio (fl), gov. chris christie (nj), gov. susana martinez, but for now its time for america to regroup, rebuild, and resume."}, {"articleID": "2015082817_00154353_W", "names": {"Dan Martin": ["Q27989223", "Q5213940", "Q5213941", "Q5213943", "Q523444"]}, "date": "2015-08-28", "url": "http://velonews.competitor.com/2015/08/news/dan-martin-to-join-etixx-quick-step-in-2016_383049?utm_medium=whats-hot", "content": "<mark>Dan Martin</mark> will hop over to the Etixx-Quick-Step squad for next season. Photo: Tim De Waele | TDWsport.com <mark>Dan Martin</mark> has signed a two-year contract with Etixx-Quick-Step that will begin next season, it was announced Friday. <mark>Martin</mark>, who has ridden professionally for the Slipstream franchise since he began his career in 2008, specializes in both one-day and stage races. The 29-year-old's <mark>Martin</mark>'s best grand tour result is a seventh place in the 2014 Vuelta a Espana. As of Friday morning, <mark>Martin</mark> was third in the current Vuelta. \"The arrival of <mark>Dan Martin</mark> is an important moment for the team,\" Etixx-Quick-Step CEO Patrick Lefevere said. \"He's a guy who was able in the past to win one-day races, but also stage races. He has also been a GC contender at grand tours during his career. He is now 29 years old, so he is at the peak of his career. He had an unlucky 2015 early season, but it is clear in his most recent performances, even at La Vuelta, that he has a lot of spirit.\" For the team this is also a key addition because <mark>Martin</mark> can be a presence in the Ardennes Classics, alongside young French rider Julian Alaphilippe. His contributions can be two-fold for Julian. Julian can learn a lot from a seasoned veteran like him. At the same time, <mark>Martin</mark> is a guy who has proven he can win at the Ardennes. So the peloton respects his presence as a contender, and this alleviates some pressure for Julian. This can be a bit of an Ardennes \"dynamic duo .' <mark>Martin</mark> is a complete rider who is able to perform well in stage races, one-day-races, and grand tours, and we are excited to see what he can do with an Etixx--Quick-Step jersey on his back for the next two years.\" <mark>Martin</mark>, who won the 2013 Liège - Bastogne-Li ège and the 2014 Giro di Lombardia, said he'd like to take his career to the \"next step.\" \"I'm really excited to join the team, which has been a point of reference in cycling for years,\" <mark>Martin</mark> said. \"I hope to be able to take the next step in my career with Etixx-Quick-Step. I would like to improve even more and establish consistency with my performances. I think I am entering an important moment of my career at my age. I feel I am stronger than ever, mentally and physically. Of course my season will be built around the Ardennes Classics, where I can join forces with Alaphilippe. I hope to teach him some things and help him to evolve as a rider, while playing protagonist when I have the opportunity.\" I also would like to do well in the stage races, and maybe try again once in a grand tour for a good classification. I think I have potential to be a factor in the grand tours, whether it be stage hunting or in the overall classification. I am motivated to add to my top career performances, while proudly wearing the team colors of Etixx-Quick-Step for the next two years. \"FILED UNDER: News / Road TAGS: <mark>Dan Martin</mark>"}]