[{"articleID": "2017112109_00079532_W", "names": {"Allison Brown": ["Q17600859", "Q4732734"], "Alison Smith": ["Q20714093", "Q21455677", "Q23979128", "Q28530963", "Q4727188"], "Susan Stewart": ["Q3978233", "Q58005118", "Q58006168", "Q729225", "Q7648427"]}, "date": "2017-11-21", "url": "https://www.newkerala.com/news/fullnews-266365.html", "content": "3 months ago | 25-08-2017 | PRN Nashville Business Journal Names Kelsea Ballerini Artist of the Year, Announces 2017 Women in Music City Honorees NASHVILLE, Tenn., Aug. 25, 2017: The Nashville usiness Journal has named Kelsea Ballerini Artist of the Year for its fourth-annual Women in Music City Awards. The platinum-selling country star will be honored at the red-carpet awards dinner on October 17 at Music City Center. This event will bring together both the business and music industries, combining two major driving forces behind the success of Music City. Kelsea Ballerini released her first album, \"The First Time,\" in 2015, which reached gold status. That same year, Ballerini received Billboard's Women in Music Rising Star award. In 2016, she was named New Female Vocalist of the Year at the ACM Awards. Ballerini has also been named one of CMT's \"Next Women of Country\" and the \"Nashville It Girl\" by Rolling Stone. Earlier this year, the ACM awarded Ballerini with the Gene Weed Milestone Award for her accomplishments in country music. Ballerini's sophomore album, \"Unapologetically,\" is set to drop Nov. 3, 2017. \"When you read the list of winners this year, you get a true sense of the impact that women are making in the Nashville music business - what a group, including the Artist of the Year, Kelsea Ballerini! Not only will we be showcasing what women are currently contributing, but also highlighting women from the past (and future) showing the longevity and importance of females in the business.\" - NBJ President and Publisher Kate Herman. The Nashville Business Journal is also pleased to name the program's first Lifetime Achievement winner: Jo Walker-Meador. Walker-Meador was born Edith Josephine Denning in Orlinda, Tenn.. She led the Country Music Association as executive director from 1962 until 1991, playing an integral part in the growth of the country music industry during that time. Under her leadership, the association grew from about 200 members to more than 7,000. She was elected to the Country Music Hall of Fame in 1995. Walker-Meador died this year on Aug. 16 after suffering a stroke. CMA CEO Sarah Trahern will be presenting the award at the event. Also new this year, the NBJ and Ryman are excited to present the first Lula Naff Ryman Trailblazer Award awarding an outstanding woman in music business history. In its inaugural year to kick off the award, the honor goes to Lula Naff, formerly with Ryman Auditorium. Naff took a job with a Johnson City talent agency after finishing business school. When the company moved to Nashville in 1904, Naff followed, soon thereafter she was put in charge of booking speaking engagements, concerts and other events for the newly renamed Ryman Auditorium. After years of commitment to the group, booking everyone from Katherine Hepburn to Harry Houdini, Naff retired in 1955 and was named Manager Emeritus. She passed away in 1960 at the age of 85. In addition to the presentation of the awards, The Harpeth Hall School Chamber Choir will perform a Kelsea Ballerini song as part of the awards dinner. Said Head of School Dr. Stephanie Balmer, \"It is an honor for Harpeth Hall's Chamber Choir to perform in a program that celebrates women in Nashville's music industry. The honorees are role models, and their paths exhibit the variety of ways our young women can make an impact. At Harpeth Hall School, we believe brave girls and purposeful women can change the world.\" To determine our list of Women in Music City winners, nominations were taken from the public, and the final of selection of honorees was judged by an independent panel of judges made up of the following: Lori Feldman (Warner Bros.. Records); Camille Hackney (Atlantic Records); Cara Lewis (Cara Lewis Group); Natalia Nastaskin (United Talent Agency); and Jacqueline Saturn (Harvest Records). This year's winners are (listed alphabetically): Tatum Allsep (Music Health Alliance), Julie Boos (Flood, Bumstead, McCready & McCarthy), Debbie Carroll (MusiCares), Erin Crawford (Nielsen Music), Virginia Davis (G Major Management/Home Team Publishing), Beville Dunkerley (Pandora), Kerri Edwards (KP Entertainment), Leslie Fram (CMT), Becky Gardenhire (WME), Tracy Gershon (Red Light Management), Lisa Harless (Regions), Ali Harnell (AEG Live), Mary Hilliard Harringon (Red Light Management), Rebecca \"Becky\" Harris (Huskins-Harris Business Management), Caryl Healey (Sony Music Nashville), Autumn House-Tallant (Red Light Management), <mark>Allison Brown</mark> Jones (Big Machine Label Group), Beverly Keel (Middle Tennessee State University), Chandra LaPlume (Taillight TV), Ebie McFarland (Essential Broadcast Media), Haley McLemore (Red Light Management), LeAnn Phelan (Sea Gayle Management), Lisa Purcell (Country Music Hall of Fame and Museum), Kelly Rich (Amazon Music, Nashville), Risha Rodgers (WME), Sally Seitz (iTunes), <mark>Alison Smith</mark> (BMI), Jennie Smythe (Girlilla Marketing), Denise Stevens (Loeb & Loeb LLP), <mark>Susan Stewart</mark> (The Recording Academy), Lou Taylor (Tri Star Sports and Entertainment), Sarah Trahern (CMA), Marcie Allen Van Mol (MAC Presents), Christy Walker-Watkins (The AristoMedia Group), Carla Wallace (Big Yellow Dog Music), Sally Williams (Opry Entertainment Group) and Stephanie Wright (UMG Nashville). Nashville-based design build firm Van Mol Restoration and Ryman Hospitality Properties are Gold Sponsors of this year's Event. Change the Conversation is an Association Sponsor. KGV Studio is the Video Sponsor. All winners will be highlighted in both a printed Nashville Business Journal special publication and online at NashvilleBusinessJournal.com."}, {"articleID": "2012011018_00091043_W", "names": {"Jillian Michaels": ["Q2971799", "Q6193168"]}, "date": "2012-01-10", "url": "http://blisstree.com/move/6-quick-at-home-workouts-on-youtube-218/", "content": "in a perfect world, where there were 36 hours in a day and you always had plenty of time to do everything you wanted, you'd be? diligently? dedicated to your fitness regimen. unfortunately, the world is far from perfect, and you frequently have to skip your workout for one reason or another, which isn't a great feeling .? but days like those don't have to be entirely sedentary-if you can carve out a little bit of time at lunch or after work, there's a whole world of personal trainers and yogis, just waiting for you? on youtube. sure, youtube is most frequently accessed to watch videos of \"sh * t girls say to other girls\" and cats doing unnatural things, but it's also got a lot of potentially helpful stuff, too-like workout videos. some are more helpful than others (think tara stiles vs. someone's mom who just realized that the family's old imac has a camera on it), but if you take the time to really dig, you can find some pretty great workouts that are quick, effective, and enough to help you feel like less of a slouch on your too-busy days. here are 6 great boot camp, pilates, yoga, and cardio workouts, ranging from 5 minutes to 25 minutes and featuring instructors like <mark>jillian michaels</mark>, to get you started. some ask for weights or other tools, but you definitely skip the additional gear and just do the moves. click through to watch the videos, and bookmark this page if you'd like to come back for the rest. first, let's get started with two short, sweet instructional workouts-one from shape, and the other from celebrity fitness trainer gunnar peterson. 1 2 3 4 next morning links: quick and easy meals post-workout afternoon links: 3 quick exercise moves to work you from head to toe hey, schools: cutting p.e. won't make kids smarter, but exercise will bad idea: labels explaining how much exercise burns off calories in soda exercise primes your brain to avoid unhealthy eating"}, {"articleID": "2018021911_00205916_W", "names": {"Jane Harris": ["Q21458202", "Q21458207", "Q6152356", "Q6152357"], "Mike Young": ["Q17144212", "Q19664774", "Q3308595", "Q6849349", "Q6849350", "Q6849351", "Q6849355"], "Paul Robinson": ["Q16751562", "Q17525451", "Q18217918", "Q215824", "Q21932167", "Q3372113", "Q3372118", "Q674763", "Q7153277", "Q7153282", "Q7153284", "Q7153285", "Q7153286", "Q725397"], "Ryan Thomas": ["Q22248616", "Q3943100", "Q49338010", "Q7384580", "Q7384583", "Q7384584"]}, "date": "2018-02-19", "url": "http://www.huffingtonpost.co.uk/entry/neighbours-spoilers-plain-jane-superbrain-return-annie-jones_uk_5a8aa1cee4b05c2bcaccdca3", "content": "Back when \"Neighbours' regularly pulled in UK audiences of up to 20 million during the 1980s,\" Plain <mark>Jane</mark> Superbrain' was one of the best-loved characters. Well, now nearly 30 years on from her departure, she's set to make a dramatic return to the Australian soap. <mark>Jane Harris</mark> - played by Annie Jones - was remembered by fans for being the nerdy best friend of Kylie Minogue's character Charlene Mitchell. FremantleMedia Ltd/REX/Shutterstock Plain <mark>Jane</mark> Superbrain was Charlene Mitchell's best friend Her bookishness earned her the nickname \"Plain <mark>Jane</mark> Superbrain', but she underwent a glamorous makeover to win the heart of <mark>Mike Young</mark> (Guy Pearce). Bosses have now revealed she will be returning to Ramsay Street to tie up some unfinished business, as part of an upcoming guest stint. However, it remains unclear what will bring her back, as the only current cast member she has connections to are <mark>Paul Robinson</mark> (Stefan Dennis). Speaking about her comeback, Annie said:\" I was absolutely thrilled to be asked to return to \"Neighbours'. As an actor, the best thing you can be is a working actor.\" I've done a lot of guest roles but usually very short-lived, so this has been lovely to come back for an extended period and really get my teeth into a part. \"FremantleMedia Ltd/REX/Shutterstock Annie originally played <mark>Jane</mark> from 1986 to 1989 Stefan added:\" This is going to sound terribly gushy, Annie is just the same as she was on the show 30 years ago--kind, funny and just a beautiful person to be around. I've loved having her back on set. \"Annie is the latest in a long line of former stars to return to the soap in recent months, with Natalie Bassingthwaite recently reprising her role as the iconic Izzy Hoyland. Annie will be back on screen from April.\" Neighbours' airs weekdays at 1.45 pm and 5.30 pm on Channel 5. READ MORE: Ex - \"Neighbours' Star Craig McLachlan Denies Sexual Misconduct Allegations Former\" Coronation Street' Star <mark>Ryan Thomas</mark> \"Lands Impressive New Soap Role' Adele Is Not Impressed Over\" Neighbours' UK Axe Reports Suggest a correction Ash Percival Entertainment Editor, HuffPost UK MORE: uktv uk soaps nostalgia neighbours"}, {"articleID": "2010102116_00017565_W", "names": {"Walter Williams": ["Q15896691", "Q16019605", "Q18129269", "Q18603382", "Q7964738", "Q7966428"], "Michael Steele": ["Q331838", "Q443813", "Q51709680"], "Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2010-10-21", "url": "http://buzz.yahoo.com/article/1:npr708:0b976ad7d61e5cd1d788d5a00a5dc918/NPR-Ends-Williams-Contract-After-Muslim-Remarks", "content": "\"<mark>williams</mark> also warned o'reilly against blaming all muslims for\" extremists, \"saying christians shouldn't be blamed for oklahoma city bomber timothy mcveigh.\" mcveigh wasn't a christian--he was brought up catholic but was an avowed agnostic: julian borger, \"mcveigh faces day of reckoning: special report: timothy mcveigh,\" , the guardian online, june 11, 2001. \"his remarks on the o'reilly factor this past monday were inconsistent w/our editorial standards + practices\" . really, npr? so your standards do not let people speak the truth? the standard liberal/regressive philosophy mirrors the obama doctrine: i have to support juan on this. i fly a lot. i get nervous as well when i see muslims dressed as juan says. he speaks the truth on this. typical progressive tactic, tow our line or you're done, there is no room for people that do not think exactly as we do. so much for free speech. while i very seldom agree with what mr. <mark>williams</mark> has to say, he certainly has the right to say it and this sort of treatment by a \"media\" outlet is ridiculous. there were no disparaging remarks made, mr. <mark>williams</mark> simply spoke the truth without any politically correct spin, and stated how he felt on the subject. is it possible that we're witnessing yet another \"transformation\" of a liberal into a conservative? if so, then juan williams will be greatly welcomed into the black conservative community that already counts <mark>michael steele</mark>, dr. <mark>walter williams</mark>, larry elder, justice clarence thomas, et.al. among its many members. there's 30 black republicans running for congress. you don't hear about them from the liberal media; you just hear about the naacp accusing the tea party of \"racism\" . npr is one of the biggest supporters of \"all things obama\" . npr cannot allow juan williams to remain on staff and although i disagree with npr on almost every subject they discuss on their network, including what they term \"entertainment\" - they couldn't lean any further to the left or they would topple as they are now exposed for their progressive philosophy. npr told its employees to not attend the <mark>jon stewart</mark> rally. how could you possibly dislike npr? npr is not liberal, they are you. <mark>williams</mark> responded: \"look, bill, i'm not a bigot. you know the kind of books i've written about the civil rights movement in this country. but when i get on the plane, i got to tell you, if i see people who are in muslim garb and i think, you know, they are identifying themselves first and foremost as muslims, i get worried. i get nervous.\" what is yahoo buzz? it's the place where you can talk about and shape the best stories people are reading right now. sign in to view buzz updates from your connections! new user? | duke of earl left a comment - 8 min ago yahoo! news \"what is really happening here, is the republicans are trying to keep our country a free country,?\" pt barnum left a comment - 9 min ago obama: wrong, not evil--that s why he s so dangerous (larry elder) yahoo! news \"i hope this guy goes away soon and takes letterman and leno with him.\" cougar left a comment - 16 min ago obama: wrong, not evil--that s why he s so dangerous (larry elder) washington post \"what to h. ...! what else can they do to make this world alot more crazy. nothing shocks me any more\" "}, {"articleID": "2013090722_00077385_W", "names": {"Matthew Smith": ["Q1909445", "Q21166693", "Q21166696", "Q27074050", "Q3852276", "Q43091034", "Q43370922", "Q47993229", "Q54152850", "Q54596883", "Q55421655", "Q57016178", "Q6791244", "Q6791245", "Q6791246"], "Jamie Oliver": ["Q1405258", "Q190051"], "Rachel Johnson": ["Q21066020", "Q7279284"]}, "date": "2013-09-07", "url": "http://www.sanluisobispo.com/2013/09/07/2670946/former-greenbrier-chef-now-stars.html#storylink=rss", "content": "This Aug. 18, 2013 photo provided by Trium Entertainment shows Lewisburg, W. Va. resident Rich Rosendale, left, with the host of \"Recipe Rehab,\" Evette Rios, at the studios in Calabasas, Calif.. Rosendale, one of TV's newest celebrity chefs, says his greatest challenges come on the set of \"Recipe Rehab,\" a Saturday morning show that will begin airing Sept. 28 on CBS. MORGANTOWN, W. Va. - He's competed in the culinary Olympics, led a team at a global cooking competition in France and produced countless photo-worthy dishes for guests at southern West Virginia's world-class resort, The Greenbrier. But Richard Rosendale, one of TV's newest celebrity chefs, says his greatest challenges come on the set of \"Recipe Rehab,\" a Saturday morning show that begins airing Sept. 28 on CBS. On the show, families submit a favorite high-calorie recipe. Two chefs then compete to crank out healthier, lower-calorie versions - and make them easy for amateurs to duplicate. \"Some of the recipes taste really good, but they're laden with fat and sugar and sodium and calories,\" Rosendale said. \"Every recipe that was on the show, it was like,\" Yikes! This is going to be interesting .' \"Rosendale, U.S. captain for the international competition Bocuse d'Or in France earlier this year, faces off against California chef Vikki Krinsky throughout 11 episodes.\" Though I have a lot of competition experience, she's an expert in nutrition. And here I am cooking with butter, \"Rosendale said.\" But it was an even playing field. \"They shot four episodes a day, a pace requiring snap decisions on how to rehabilitate a meal. The importance of his work was never lost on Rosendale, a native of Uniontown, Pa., who worked in Pittsburgh before opening a restaurant in Columbus, Ohio. In 2009, the now-38-year-old father of two boys moved to Lewisburg in southern West Virginia - a state struggling with an obesity epidemic. In the 2011-12 school year, nearly 28 percent of fifth-graders screened by West Virginia University were considered obese. So are nearly one-third of West Virginia adults, according to the Centers for Disease Control and Prevention.\" There are a lot of great cooking shows out there that are entertaining, \"Rosendale said.\" But if I can do something that's also going to serve a purpose, I want to do that. \"Nationwide, more than 23 million children and teenagers are considered overweight or obese, and Illinois-based Action for Healthy Kids says the numbers are\" trending in a scary direction. \"If childhood obesity isn't curbed, said spokesman <mark>Matthew Smith</mark>, 39 states can expect that more than 50 percent of their adult population will be obese by 2030. And studies show that children are more sedentary than ever, spending hours a day on TV, computers, tablets and phones.\" But TV can still pay a role and does play a role in education, \"<mark>Smith</mark> said.\" Any way we can get a message out that talks about healthy eating, about balanced eating, about active lifestyles...is a positive. \"Rosendale pointed out that many cooking shows focus on dishes beyond either the imagination or skill set of a typical TV viewer,\" So rather than come up with dishes that people probably aren't going to eat, \"he said,\" why not recreate what people are already eating? \"They can still enjoy spaghetti, for example. But\" Recipe Rehab \"explores how store-bought sauces are loaded with salt and how easy it is to make a fresher, better-tasting alternative. At the end of each episode, the chefs illustrate their techniques and offer tips. Rosendale resigned as The Greenbrier's executive chef and director of food and beverage in June to pursue other, unspecified opportunities. Now he acknowledges it was to do the show, which he hopes will continue after this season. Before he left the White Sulphur Springs resort, he launched the 44-acre Greenbrier Farm to produce vegetables for his kitchen. The certified master chef also oversaw the opening of five new restaurants and The Greenbrier Casino Club.\" Recipe Rehab \"- which used to air on ABC - is part of a new\" Dream Team \"programming block that CBS and Litton Entertainment announced last month. It also features\" <mark>Jamie Oliver</mark>'s 15-Minute Meals. \"<mark>Oliver</mark>, too, has a West Virginia connection: In 2010, he produced\" <mark>Jamie Oliver</mark>'s Food Revolution \"in Huntington after a report declared it America's fattest city. He created Huntington's Kitchen, leading classes that teach parents and children about unhealthy foods and healthy cooking. Today, the program is run by Cabell Huntington Hospital. Dr. <mark>Rachel Johnson</mark>, nutrition professor at the University of Vermont and spokeswoman for the American Heart Association, said TV is helpful in conveying a message and teaching skills, but what really counts is the example families set. Healthy food should be readily accessible, attractive and a normal part of the daily diet. Put baby carrots and apples right in front in the refrigerator, <mark>Johnson</mark> said, and a bowl of grapes on the counter. And keep at it. Research shows a child may reject a new food as many as 12 or 15 times. But <mark>Johnson</mark> said that if parents keep offering it, the child will eventually prefer it, whether it's skim milk or bananas.\" Don't give up. Don't force them, but have a rule: You have to taste it, \"she said.\" It is hard not to revert to the chicken nuggets, to the frozen pizza. I know. I'm a mom ....But over time, they will develop a preference for it. \"--Online: Recipe Rehab: http: //reciperehab.com/> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2010092523_00095125_W", "names": {"Charlie Brown": ["Q1066832", "Q16205577", "Q2960832", "Q5084600", "Q5084601", "Q5084602", "Q5084603", "Q5084605", "Q5084607", "Q5084609"], "Peter Barker": ["Q19871103", "Q21004971", "Q980633"], "Stan Lee": ["Q16194157", "Q181900", "Q7597756"]}, "date": "2010-09-25", "url": "http://muppet.wikia.com/index.php?title=Episode_606:_Comic_Capers&diff=544788&oldid=prev", "content": "the babies are disappointed when they finish reading the comics, but piggy says that they don't have to wait until next week for more--they can draw their own comics. she leads the babies in a song, \"[[the sunday funnies]]\" , as they gather their material and start to draw. they imagine lots of comic strips, including scooter as \"[[dick tracy]]\" . the babies are disappointed when they finish reading the comics, but piggy says that they don't have to wait until next week for more--they can draw their own comics. she leads the babies in a song, \"[[the sunday funnies]]\" , as they gather their material and start to draw. they imagine lots of comic strips, including scooter as \"[[dick tracy]]\" . scooter tries drawing \"[[blondie]]\" on his computer, but can't get the mailman to look right. [[baby fozzie]] helps out, putting scooter into the picture. but fozzie doesn't know what he's doing, and turns scooter into <mark>charlie brown</mark>, then [[popeye]], [[little orphan annie]], and finally [[prince valiant]] fighting a dragon. scooter tries drawing \"[[blondie]]\" on his computer, but can't get the mailman to look right. [[baby fozzie]] helps out, putting scooter into the picture. but fozzie doesn't know what he's doing, and turns scooter into <mark>charlie brown</mark>, then [[popeye]], [[little orphan annie]], and finally [[prince valiant]] fighting a dragon. kermit is drawing his favorite comic, \"peanuts\" . he imagines himself as <mark>charlie brown</mark>, with rowlf playing piano as schroeder. \"boy,\" rowlf sighs, \"somebody sure drew this piano out of tune.\" in the next panel, \"butterscotch skeeter\" (skeeter dressed as peppermint patty) throws a fly ball at <mark>charlie brown</mark>, but he misses it. \"you know what your problem is, kermit?\" asks piggy, who's sitting at lucy's psychiatrist booth. kermit sits down: \"i think i have a deep-seated need for approval, aggravated by the fact that i'm kind of short and green.\" piggy/lucy tells him that he just can't draw. kermit is drawing his favorite comic, \"peanuts\" . he imagines himself as <mark>charlie brown</mark>, with rowlf playing piano as schroeder. \"boy,\" rowlf sighs, \"somebody sure drew this piano out of tune.\" in the next panel, \"butterscotch skeeter\" (skeeter dressed as peppermint patty) throws a fly ball at <mark>charlie brown</mark>, but he misses it. \"you know what your problem is, kermit?\" asks piggy, who's sitting at lucy's psychiatrist booth. kermit sits down: \"i think i have a deep-seated need for approval, aggravated by the fact that i'm kind of short and green.\" piggy/lucy tells him that he just can't draw. then they notice what [[baby animal | baby animal's]] been doing--he's ripped panels out of the strips and pasted them together. the babies imagine themselves walking through animal's mixed-up comic, wandering through \"blondie\" , \"[[crock]]\" , \"[[h? gar the horrible]]\" and \"[[alley oop (comic) | alley oop]]\" , where they're menaced by a dinosaur. space cadet gonzo arrives in a spaceship to rescue them, but brings along one of his scary aliens. fleeing from the monster, the babies fall through \"spider-man\" to apartment 3-b, where the alien is wating for them. then they notice what [[baby animal | baby animal's]] been doing--he's ripped panels out of the strips and pasted them together. the babies imagine themselves walking through animal's mixed-up comic, wandering through \"blondie\" , \"[[crock]]\" , \"[[h? gar the horrible]]\" and \"[[alley oop (comic) | alley oop]]\" , where they're menaced by a dinosaur. space cadet gonzo arrives in a spaceship to rescue them, but brings along one of his scary aliens. fleeing from the monster, the babies fall through \"spider-man\" to apartment 3-b, where the alien is wating for them. space cadet gonzo is about to save the day--but then nanny comes home. she wants to see the babies' comic strip, but first, they have to clean up the mess in the hallway. the babies are mad at gonzo for not cleaning it up. space cadet gonzo hides in the closet, \"not sure if he'll ever see the nursery again...\"*\" [comic capers] \"at [the big cartoon database] {{ep-nav | prev = [[episode 605: not necessarily the babies | not necessarily the babies]] | next = [[episode 607: faster than a speeding weirdo | faster than a speeding weirdo]]}} {{ep-nav | prev = [[episode 605: not necessarily the babies | not necessarily the babies]] | next = [[episode 607: faster than a speeding weirdo | faster than a speeding weirdo]]}} baby gonzo makes a mess of the paper in the hallway, looking for the funnies. he finds them, but the other babies make him clean up the hall before baby kermit to try to make up a story to go with the pictures. he has a hard time deciphering <mark>charlie brown</mark>'s dialogue in peanuts, and the other babies pester him so much that he screams\" aaugh! \"the babies laugh, and kermit shrugs,\" good grief. \"mary worth). she explains,\" apartment 3-b is all about nosy people sticking their nose into other people's business--and the nosiest of all is piggy worthalot. \"piggy eavesdrops on an argument between her next door neighbors, skeeter, and offers them some\" words of wisdom \". she's interrupted by gonzo, who arrives quoting shakespearean gibberish--he thought this was apartment 2-b.\" 2-b or not 2-b! \"he declaims. gonzo's skipped out on cleaning the hallway, and the other babies send him back to work. gonzo imagines himself as space cadet gonzo, trapped on an alien planet ., imagining himself as\" spider-dog \". he's <mark>peter barker</mark>,\" ace news picture taker \", reporting for work at the daily flugelhorn. the incredible hulk gets into the elevator with rowlf, who realizes that he's in the wrong strip. rowlf hears that there's a warehouse robbery in progress, and hurries to the scene dressed as spider-dog. he swings on his web to the edge of the newspaper, but the real spider-man appears to guide him down to the next row. reaching the warehouse, he finds skeeter dressed as spider-girl, and they argue over which of them is the real spider-hero. they bicker while the crooks carry boxes out of the warehouse, unimpeded. the real spider-man decides to take over the adventure as rowlf and skeeter shoot webs at each other. the web sprays out of the comic--and onto the hand of <mark>stan lee</mark>, the creator of spider-man, who yells at the babies:\" hey, you kids! don't you know there's only one spider-man? \"rowlf apologizes, but skeeter accidentally sprays webbing into <mark>stan</mark>'s face.\" oh, boy, \"he groans. the babies are disappointed when they finish reading the comics, but piggy says that they don't have to wait until next week for more--they can draw their own comics. she leads the babies in a song,\" the sunday funnies \", as they gather their material and start to draw. they imagine lots of comic strips, including scooter as blondie on his computer, but can't get the mailman to look right. prince valiant fighting a dragon. kermit is drawing his favorite comic, peanuts. he imagines himself as <mark>charlie brown</mark>, with rowlf playing piano as schroeder.\" boy, \"rowlf sighs,\" somebody sure drew this piano out of tune. \"in the next panel,\" butterscotch skeeter \"(skeeter dressed as peppermint patty) throws a fly ball at <mark>charlie brown</mark>, but he misses it.\" you know what your problem is, kermit? \"asks piggy, who's sitting at lucy's psychiatrist booth. kermit sits down:\" i think i have a deep-seated need for approval, aggravated by the fact that i'm kind of short and green. \"piggy/lucy tells him that he just can't draw. baby animal's been doing--he's ripped panels out of the strips and pasted them together. the babies imagine themselves walking through animal's mixed-up comic, wandering through alley oop, where they're menaced by a dinosaur. space cadet gonzo arrives in a spaceship to rescue them, but brings along one of his scary aliens. fleeing from the monster, the babies fall through spider-man to apartment 3-b, where the alien is wating for them. space cadet gonzo is about to save the day--but then nanny comes home. she wants to see the babies' comic strip, but first, they have to clean up the mess in the hallway. the babies are mad at gonzo for not cleaning it up. space cadet gonzo hides in the closet,\" not sure if he'll ever see the nursery again...\""}, {"articleID": "2014071619_00054012_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2014-07-16", "url": "http://www.newschannel9.com/news/top-stories/stories/cdc-mishaps-could-have-been-deadly-11604.shtml", "content": "Updated: Wednesday, July 16 2014, 08:08 AM EDT The government agency tasked with protecting the public from dangerous diseases has some explaining to do after an anthrax scare, a bird flu mix-up and an unprecedented smallpox discovery. The U.S. Centers for Disease Control and Prevention has shuttered two of its labs as officials step back to investigate recent incidents and review overall safety procedure for handling dangerous pathogens. None of the mistakes caused any illnesses or deaths, thankfully. But experts say the lapses could have been deadly - even if the viruses didn't fall into the wrong hands. Smallpox What happened: Earlier this month, researchers were surprised to discover six vials of variola--the virus that causes smallpox--when cleaning out a cold storage room at NIH headquarters in Bethesda, Maryland. Since smallpox is considered a bioterrorism threat, only two labs in the world have stockpiles: One at the CDC's Atlanta headquarters and another at the VECTOR Institute in Russia. In other words, the virus should not have turned up in an old box in Bethesda. No one at the facility knew the smallpox vials were there, and the building was not equipped to handle viruses that require the most stringent safety and security measures like smallpox, anthrax and Ebola. Officials have since learned that two of the six vials still contained samples of live, infectious virus, which may date back to the 1950s. No one was infected, but officials are investigating the matter. What could have happened: Since the virus was alive in two of the vials, there was a chance it could have spread, experts say. \"The smallpox vials caused no harm sitting in a box,\" said ABC News' chief health and medical editor Dr. Richard Besser. \"Had the box been crushed and the virus escaped, people in the immediate vicinity could have been infected.\" And since these people wouldn't have known that they were exposed to the virus, they might have spread it to others, said Dr. William Schaffner, chair of preventive medicine at Vanderbilt University Medical Center in Nashville, Tennessee, and past president of the National Foundation for Infectious Diseases. \"It would not have immediately been diagnosed,\" said Schaffner, explaining that most doctors have never seen smallpox, which was eradicated in 1979. \"So there would have been some opportunity for perhaps some limited spread around these people.\" People are no longer vaccinated for it and therefore don't have immunity, Besser said. Once health officials realized smallpox was at fault for the illnesses, however, they would begin vaccinating people who had been in contact with those who were infected. Another consequence of the lab blunder? Public panic. \"We would have immediately been worried about a bioterrorism event,\" said Schaffner. \"Given that this was in Washington, there would have been hullabaloo, eight-point headlines in The New York Times, The Washington Post.\" Anthrax What happened: At least 84 lab workers at the CDC headquarters in Atlanta were exposed to live anthrax spores in June, according to the CDC. The employees were not using proper safety guidelines for dealing with the lethal bacteria because the anthrax was supposed to have been \"inactivated\" and therefore not infectious, the agency said. It wasn't until the samples were gathered to be destroyed in an incinerator that researchers discovered the live bacteria. Since anthrax symptoms can take two months to appear, the exposed workers are being monitored and have been offered vaccines and antibiotics. The CDC is investigating the matter and the lab and hallways of the facility have been decontaminated. According to a congressional memo released last week, the anthrax was stored in an unlocked refrigerator in an unrestricted hallway. The memo also stated that disinfectants were expired, \"germ materials\" were transported between labs in Ziplock bags, and workers exposed to anthrax didn't get medical examinations until five days after knowledge of the exposure. What could have happened: The exposed workers could have inhaled the bacterium and become infected, Besser said. \"As many as 45 percent would have died, even if their illness had been recognized promptly and treated with the right antibiotics,\" he said. \"Untreated anthrax pneumonia is fatal in 85 percent of infected people.\" Since anthrax is not spread from person-to-person, it would not have caused a widespread outbreak. But the incident would have spread fear, according to Schaffner. Bird flu What happened: A CDC flu sample was accidentally contaminated with a deadly strain of bird flu and sent to a lab run by the U.S. Department of Agriculture. The USDA discovered the contamination in May, but it wasn't reported to top management until last week, according to the Associated Press. What could have happened: Avian flu doesn't spread as easily as other strains of the virus, but close contacts of exposed workers would have been at risk, according to Schaffner, who added that the infection can be fatal. Besser was also concerned about the bird population. \"The strain of bird flu mistakenly sent to the USDA is highly lethal in birds,\" he said. \"Release of this strain into American poultry flocks could have been devastating to that industry.\" Had that happened, people who had close contact with sick birds could also have become infected flu strain, Besser said. The Good Life Celebrating the events, adventures and activities that represent \"The Good Life\" in the NewsChannel 9 viewing area. Come Road Trippin' with us and see all the great sites in your area! These are the latest School and Business Closings reported to NewsChannel 9. If you see errors or need to add a school or business, call 423-757-7320. US retail sales tick up just 0.2 percent in June WASHINGTON (AP)--U.S. retail sales increased slightly in June, a sign that consumers remain cautious despite steady job gains this year. WEST PALM BEACH, FL--(Marketwired)--03/21/14--Companies that pride themselves on being eco-friendly may have conflicted ideas between marketing with ad specialties and maintaining their green LOS ANGELES (AP)--Sometimes people don't take stalking of Hollywood stars or musicians seriously--but the case in which a man got into Sandra Bullock's house indicates just how scary such incidents can be. HILLARY RODHAM CLINTON-JON <mark>STEWART</mark> NEW YORK (AP)--<mark>Jon Stewart</mark> jokes no one cares about Hillary Rodham Clinton's book, they just want to know if she's running for president. IN THE NEWS: HOUSE MOVES TO MAINTAIN BAN ON TAXING INTERNET ACCESS 7:30 Jeopardy 8:00 The Middle 8:30 The Goldbergs"}, {"articleID": "2019062312_00296259_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"]}, "date": "2019-06-23", "url": "http://www.readingeagle.com/ap/article/the-latest-iran-says-us-is-fueling-tensions-in-a-tense-gulf", "content": "Share Adjust font size: A A A Sunday June 23, 2019 06:17 AM The Latest: <mark>Bolton</mark> says US \"prudence' on Iran isn't weakness U.S. National Security Adviser <mark>John Bolton</mark> says Iran should not\" mistake U.S. prudence and discretion for weakness. \"Written by The Associated Press TEHRAN, Iran (AP)--The Latest on tensions between the U.S. and Iran and in the Persian Gulf (all times local): 1:30 p.m. U.S. National Security Adviser <mark>John Bolton</mark> says Iran should not\" mistake U.S. prudence and discretion for weakness. \"Speaking alongside Israeli Prime Minister Benjamin Netanyahu in Jerusalem Sunday, <mark>Bolton</mark> says no one has granted Iran a\" hunting license in the Middle East. \"The comments come days after President Donald Trump announced he called off military strikes on Iran after learning approximately 150 Iranians would be killed, saying it would've been out of proportion to the shooting down of an unmanned American surveillance drone by Iran. <mark>Bolton</mark>, a longtime Iran hawk, says sanctions will continue against Tehran and that the U.S. reserves the right to attack it at a later point. He emphasized that Trump had only\" stopped the strike from going forward at this time .' \"___ 12:20 p.m.. An Iranian military commander warned on Sunday that any conflict with Iran would have uncontrollable consequences across the region and endanger the lives of U.S. forces, as tensions between Washington and Tehran flare after the downing of an American surveillance drone. The semi-official Fars news agency on Sunday quoted Gen. Gholamali Rashid as saying the Trump administration\" should behave in a responsible way to protect the lives of American forces. \"Gen. Rashid said if war happens, its scope and duration could not be controlled, and blamed any escalation on\" U.S. interventionist policy. \"The general oversees and coordinates joint military operations in the Iranian Armed Forces. Iran said it shot down the U.S. drone on Thursday but elected not to fire on a manned U.S. military aircraft flying in the area at the same time. U.S. military cyber forces launched a strike against Iranian military computer systems on Thursday as President Donald Trump backed away from plans for a more conventional military strike after learning approximately 150 Iranians would be killed. ___ 11:30 a.m. Saudi Arabia's state airline Saudia says it is rerouting flight paths to some Asian destinations in order to avoid Iranian airspace amid heightened tensions in the Persian Gulf. The statement Saturday evening follows the U.S. Federal Aviation Administration's decision to bar U.S.-registered aircraft from operating over parts of the Persian Gulf and the Gulf of Oman, after Iran shot down a U.S. military drone on Thursday. The airline says it's a precautionary measure for aviation safety, and Saudi-owned Al Arabiya news channel says the airline's decision affects flight routes over the Gulf of Oman and the Strait of Hormuz. Other regional carriers like Etihad and Emirates on Friday announced they too have changed their flight paths in the Persian Gulf region. Share this article Trending Stories Trapped by the flood ID released of tot found unresponsive in Tilden pond Wanted in Berks: June 23 Fitzler leads after first day of Pagoda Hillclimb (PHOTO GALLERY) All about Dogs showcases breeds What's got you wondering\" what's that about? \"in the Berks County area? Ask us your burning questions and we'll investigate. Please note that questions may be edited for clarity or brevity. More AP Stories Thailand's Wild Boars mark year since going missing in cave <mark>Bolton</mark> warns Iran not to mistake US\" prudence' for weakness Marlins-Phillies Runs Owners hope to demolish nearly vacant mall, redevelop site Phillies look to break 6-game skid against Marlins"}, {"articleID": "2019100122_00215819_W", "names": {"Steve Burton": ["Q7612111", "Q7612112", "Q7612113", "Q7612114"]}, "date": "2019-10-01", "url": "https://boston.cbslocal.com/2019/10/01/new-england-patriots-build-playground-foxboro-regional-charter-school/", "content": "Filed Under: Foxboro News, Foxboro regional charter school, New England Patriots, <mark>Steve Burton</mark> FOXBORO (CBS)--All it takes are willing hands, as hundreds of volunteers build a playground at a Foxboro school in a matter of hours, with some help from the New England Patriots. And for the first time, elementary school kids have a place to play. It's part of a project to help young people stay fit. They mixed cement, dug a mountain of mulch and did some heavy lifting all for a good cause, giving kids a safe place to play and a way to stay active, and they're doing it all in just a day. \"We started at 7 in the morning and we're here until probably 4 o’clock in the afternoon,\" said Jose Aquino, a volunteer from United Healthcare. Some Patriots players volunteered to help build a playground at a Foxboro School (WBZ-TV) The \"instant\" playground is a joint project between United Healthcare, a non-profit called Kaboom! and the New England Patriots at the Foxborough Regional Charter School. Pat Patriot chipped in, so did the cheerleaders and a handful of very burly players. But it was about 200 volunteers that really got it done. \"As part of a health care company we're helping people live healthier lives, and this is a chance to do that in a different way than we normally do,\" said Shane, one of the volunteers. \"Awesome to have a team willing to take the day off to move some mulch, lots of mulch!\" added Haya Alzaid. And now the elementary school here will have a playground. \"This is a big deal for us. We've been waiting for a couple of years to get a playground down here at our new elementary school building,\" said Christiana Benson, the school's principal. \"I think play is important for the kids, and this is a good volunteer opportunity and a good use of my time,\" said parent Rick Prescott. Some Patriots players volunteered to help build a playground at a Foxboro School (WBZ-TV) At the end of the day, the entire community was richer for the good work done here. \"It's my first time volunteering, and it's the best thing I've done all year,\" said Salome Thuo, a parent of two children at the school. This is the 10th year in a row the Patriots have joined the playground building effort which is part of United Healthcare's \"Do Good. Live Well\" campaign. <mark>Steve Burton</mark> <mark>Steve Burton</mark> is a sports anchor and reporter for WBZ-TV News on WBZ-TV and on sister station TV38. More from <mark>Steve Burton</mark>"}, {"articleID": "2015072721_00100776_W", "names": {"Eric Schmidt": ["Q30111617", "Q51888946", "Q92747"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2015-07-27", "url": "http://channelnewsasia.com/news/business/us-private-sector-vows-to/2011830.html", "content": "US private sector vows to ante up on climate finance - Channel NewsAsia US private sector vows to ante up on climate finance POSTED: 28 Jul 2015 05:35 Email A WASHINGTON: Some of the biggest U.S. corporate names on Monday offered their support: and billions of dollars in green financing pledges: to buttress the Obama administration's quest for a global agreement on combating climate change. Google, Apple, Goldman Sachs and 10 other well-known companies joined the White House in launching the American Business Act on Climate Pledge, a campaign that the White House said would inject US $140 billion in low-carbon investments into the global economy. Massive private sector commitments are seen by participants as essential to getting a global agreement on climate change in Paris in December. Emerging nations have demanded that any agreement include tens of billions of dollars in financing from developed nations to help their economies adapt to a low-carbon future. Although not all the corporate pledges represented new commitments, Monday's announcement showed the administration's ability to get private sector buy-in for international climate change financing. Mindy Lubber, president of environmental investor group Ceres, applauded the announcements but said the White House cannot rely solely on these pledges. \"Voluntary commitments alone will not get us the meaningful reductions we need,\" she said. \"Strong carbon-reducing policies are hugely important.\" None of the companies involved in Monday's announcement were from the fossil fuel sector of the economy, though the White House said there could be a second round of pledges in the fall ahead of the Paris conference. Other companies included General Motors, Bank of America, Microsoft and Coca Cola, many of which also announced measures to reduce their own greenhouse gas emissions and deploy more clean energy. The White House said the companies' promises would lead to at least 1,600 megawatts of new renewable energy being brought on line. Water-use intensity would be reduced by 15 percent and the companies would target zero net deforestation in their supply chains. Google, which claims to be the biggest corporate purchaser of renewable power globally, pledged to triple those purchases over the next decade. In a blog post on Google's website, CEO <mark>Eric Schmidt</mark> said while the private sector can play a leadership role on climate change, it needs political certainty to encourage companies to scale up their investments. \"We need the world's political leaders to confirm that investments in clean energy are sound, and that the laws and policies meant to enable such investment will be designed for the long term,\" <mark>Schmidt</mark> wrote. Among other elements of the plan, Apple, one of the 13 companies, pledged to bring nearly 300 MW of renewable energy online in five states and the Sichuan province in China. Berkshire Hathaway said it will retire 75 percent of its coal-fueled generating capacity in Nevada by 2019. Soft-drink manufacturers Coca Cola and Pepsi Co. vowed to reduce the carbon footprint of their businesses: Pepsi pledging to expand its sustainable farming initiative for its supply chain, and Coca Cola saying it would reduce the carbon footprint of the \"drink in your hand\" by 25 percent by 2020. Obama needs voluntary private sector participation because the Republican-controlled Congress, which has power over public financing, appears reluctant to authorize extensive spending on renewable energy investments. Secretary of State <mark>John Kerry</mark> is scheduled to host an event at the State Department on October 20-21 to \"highlight American leadership in climate investment and innovative solutions to our toughest climate finance challenges.\" (Reporting By Valerie Volcovici; Editing by Bruce Wallace) - Reuters"}]