[{"articleID": "2017022022_00369412_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-02-09", "url": "http://rare.us/rare-politics/issues/foreign-policy/rand-paul-it-would-be-a-really-rotten-no-good-bad-idea-to-have-ground-troops-in-syria/", "content": "In 2015, I asked, \"Why is Rand Paul the only Republican who knows our foreign policy is crazy?\" Among the crazy characteristics is the U.S.' s constant habit of intervening militarily in other nation' s civil wars. Watch the video It was precisely this sort of suggestion during a Senate Foreign Relations Committee meeting on Tuesday featuring former Defense Department and CIA Chief of Staff Jeremy Bash and national security adviser and U.S. Ambassador James Jeffrey, that seemed to incense committee member Sen. Paul. RELATED: Why is Rand Paul the only Republican who knows our foreign policy is crazy? The senator vehemently rejected sending American troops to Syria, \"I' d like to go on record as saying that it would be a really rotten, no good, bad idea to have ground troops in Syria, and very naive to think you' re going to put 1000 troops in there, and everybody' s going to welcome us .\" Paul continued, \"It' s very presumptuous to think that we' re going to decide who takes Raqqa and who occupies Raqqa. Don' t you think the people there would be aghast, to think we' re 3000 miles away, to decide who' s going to take over Raqqa and who' s going to occupy it?\" \"We can win any battle,\" Paul said. \"But when we big we usually go big, and sort of, there have been many people--the Powell Doctrine--go big or don' t go. 1000 soldiers?\" Paul inquired, appearing to note that this number would not be enough should the U.S. decide to escalate our military efforts in Syria. A year ago during the campaign, <mark>Donald Trump</mark> said he would consider sending up to 30,000 U.S. troops to Syria. Yet <mark>Trump</mark> also has stressed that the U.S. should get out of the business of nation building. Those two foreign policy views don' t typically jibe. Paul addressed to the committee how sending troops abroad inevitably leads to nation building. \"And then the other problem [...] The mantra is always\" Stay, stay, we must stay forever,' and if we leave, that' s our fault for leaving, \"Paul said .\" There' s no exit from a situation like this \"the senator said .\" Let' s say we were to go in and defeat those who were there, to defeat ISIS--do you think that' s the end? No, when a big force comes, they' re going to shrink away, and they will fight' til the end of time. \"\"And they will fight against an American target if Americans are the target,\" Paul said. Watching the 2016 presidential primaries where most Republican candidates seemed eager to commit American troops abroad, with the exception of Paul and in some ways <mark>Trump</mark>, I wrote, \"Our foreign policy is run by crazy people. I don't mean legitimately insane, but politicians who insist America must do things around the world that have been empirically proven not to work--for decades--at great cost to our country's finances, military, prestige and actual security .\" It remains true: We go out of our way to make other nation' s wars our own, usually to our own detriment. Paul said Tuesday, \"This is a war within Islam, and I think we should be supportive and try to amplify those who are trying to defeat this aberration .\" \"But let' s don' t make it our war,\" he said. The Republican senator from Kentucky then ran down all of the other forces that could be part of anti-ISIS efforts in the region instead of the U.S. always having to take the lead. \"Look, there are 200,000 Peshmerga. There are 200,000 Iraq soldiers. There' s a hundred and some odd thousand in the Syrian army. There are 600,000 in the Turks',\" Paul said, \"and there are 15,000 ISIS, and we have to go over there to defeat them?\" RELATED: No, <mark>Donald Trump</mark>, torture doesn't work, and we're not going down that road again <mark>Donald Trump</mark> won the election saying sane things about the futility of the Iraq war and the folly of nation building, combined with some less sane and belligerent things. But at a Senate Foreign Relations Committee hearing this week, we were reminded that among the nation' s entrenched foreign policy elite, nothing has really changed. They still possess the same interventionist mentality. The only person on that committee who seemed to outraged over the idea of sending 1000 Americans men and women to Syria--particularly based on everything we have learned about ill-advised interventions from the Iraq war forward--was Sen. Paul. \"I think we ought to think this thing through and think that this won' t be the end, this will be the beginning,\" Paul said. \"And I guarantee you the voices are loud and strong. Everybody says we should have stayed in Iraq. Everybody is still saying we should stay in Afghanistan .\" \"Are we going to stay everywhere? Forever?\" Sen. Paul asked. Disclosure: I co-authored Senator Rand Paul's 2011 book \"The Tea Party Goes to Washington .\" "}, {"articleID": "2014121901_00029944_W", "names": {"Anthony Johnson": ["Q24005923", "Q24702926", "Q2556925", "Q4772838", "Q4772840", "Q4772841", "Q573440", "Q576548"]}, "date": "2014-12-19", "url": "http://forums.sherdog.com/forums/f2/rogan-classics-youre-dealing-whole-new-species-human-2891063/", "content": "Rogan Classics: \"You're dealing with a whole new species of human .\" @ 1:15, he's talking about Royce Gracie, essentially he's saying if Royce had to face a modern UFC fighter such as Rumble <mark>Johnson</mark> (who has strong TDD and can KO people) it would be like facing \"a whole new species of human\" i. e, a super human. Another day, another Rogan classic! Well, he is kinda right but not because of human evolution. More like sport evolution, training and weight cutting. Royce could have been a lw, easily. Imagine him training lots of stand up and wresslin at aka, att or jacksons...he would have been way better as well. __________________ Always remembering Evan Tanner and Jeremy Lusk Location: Moscow Posts: 5,638 vCash: 500 LOL He's been hanging around Goldie too much I think! Location: We are all one Posts: 1,475 Join Date: Mar 2011 Posts: 7,540 vCash: 50 Location: Montevideo, Uruguay Posts: 6,574 C'mon it's not like he isn't like this all the time, he wants to put emphasis on being a combination of scientific and mystic to kind of make it fantastic. Also <mark>Anthony Johnson</mark> got beat by Vitor, who's been fighting since UFC 12. __________________ Jose Aldo #1P4P Finishtime Pettis LOLer 1,4,5 Ronda Rousey Clithanger Jojo Wallace, Polish Jedi The Incredulous Cormier C'mon it's not like he isn't like this all the time, he wants to put emphasis on being a combination of scientific and mystic to kind of make it fantastic. Also <mark>Anthony Johnson</mark> got beat by Vitor, who's been fighting since UFC 12. Location: Sydney Posts: 1,865 vCash: 500 You may not post new threads You may not post replies You may not"}, {"articleID": "2013112214_00005901_W", "names": {"Blake Davis": ["Q2905829", "Q4924361"]}, "date": "2013-11-22", "url": "http://www.miamiherald.com/2013/11/22/3770961/utah-defeats-grand-canyon-79-54.html", "content": "SALT LAKE CITY--Defense proved to be the perfect antidote to anything Grand Canyon could throw at Utah. The Utes controlled the glass. They forced turnovers, swiping the ball frequently to set up easy transition baskets for 40 minutes. Utah's 79-54 victory on Thursday night offered the Antelopes a glimpse at what life will be like as a Division I newcomer. Delon Wright scored 17 points on 8-of-8 shooting while Jordan Loveridge added 15 points and 15 rebounds to lead the Utes (3-0) as they opened the Global Sports Hoops Showcase. Utah used its speed and size to take control of the game from the opening tip. How dominant were the Utes? Utah owned Grand Canyon around the basket. The Utes had a 49-33 edge on rebounds and a 42-28 advantage in points in the paint. When the Antelopes made any mistakes, Utah made them pay quickly. The Utes produced 20 points off 12 Grand Canyon turnovers. Utah also outscored the Antelopes 17-2 in fastbreak points. \"I want our identity built off of our defense - getting stops and knowing the game becomes easier heading the other direction if we can do that,\" Utah coach Larry Krystkowiak said. \"Our guys have been really locked in to guard. We can't be the type of team that has to see the ball go in to the basket in order to get energized .\" Demetrius Walker had 16 points and Jerome Garrison added 12 to lead the Antelopes, who are still searching for their first win over a Division I opponent. Grand Canyon (1-3) joined the WAC this season after competing in the Pac West - an NCAA Division II conference - last season. After 40 minutes against Utah, there are plenty of miles yet to travel on the road to fully making the transition to Division I. \"This is a level that we aren't at yet,\" Grand Canyon coach Dan Majerle said. \"It's where we strive to be. Going from Division II to Division I we knew was going to be a challenge. Our guys played a little scared and they have to get over that. We have to learn from that and move on .\" Points for Grand Canyon occurred as often as a desert rainstorm in the first half. The Antelopes missed seven straight shots to open the game and did not get their first basket until five minutes into the game. They shot only 28 percent from the field and 10 percent from 3-point range before halftime. Utah wasted no time taking advantage. The Utes opened the game on an 11-0 run - capped by a three-point play from Jordan Loveridge - and hit 5 of 7 baskets during the same stretch where Grand Canyon could not score at all. \"It started on the defensive end,\" Loveridge said. \"We got some stops and then it just made our offense easier. That's how we got up. We were just outplaying them on the defensive end and it made our offense that much easier .\" Grand Canyon whittled the lead down to six when Jeremy Adams scored a layup to cut Utah's lead to 15-9. But that brief comeback simply set the stage for another 11-0 spurt for the Ute offense. A layup from Wright gave Utah a double-digit lead again. Dakari Tucker finished off the run with back-to-back 3-pointers, giving the Utes a 30-12 lead with 5:43 remaining before halftime. The Antelopes managed to trim the lead a little bit before halftime and continued to cut into it coming out of the locker room. Grand Canyon rallied within 12 points, making it 40-28 on a layup from Killian Larson. \"They did a good job of guarding us,\" Krystkowiak said. \"Put some heat on us that we've haven't felt in weeks in terms of trying to take us out of things .\" Utah did not let the Antelopes get any closer. Jeremy Olsen scored layups on back-to-back possessions to spark a 13-2 run. Wright finished off the run with a three-point play, giving Utah a 53-30 lead with 12:00 minutes left in the game. Grand Canyon had one final run left. The Antelopes went on a 10-2 spurt, cutting it to 55-40 on a <mark>Blake Davis</mark> 3-pointer. Utah ended slammed the door shut on any comeback by answering with an 8-0 run. Van Dyke drained a pair of free throws to cap the spurt and give the Utes a 63-40 lead with 7:15 remaining. The Global Sports Hoops Showcase continues Friday with Grand Canyon facing Savannah State and Utah hosting Lamar."}, {"articleID": "2014101716_00039570_W", "names": {"Santosh Anand": ["Q15696890", "Q56994518"]}, "date": "2014-10-17", "url": "http://zeenews.india.com/news/sci-tech/3-wild-bears-found-dead-in-odisha_1486268.html", "content": "Berhampur: Three wild bears were today found dead at Somanathapalli village in Ganjam district, about 90-km from here. Forest officials recovered the carcass of an adult female bear of about 20-year-old and its two male cubs, around two-and-half-year of age on the outskirts of the village located in the vicinity of a reserve forest. \"The animal bodies are decomposed. We suspected they died on Wednesday. The death of the animals, however, came to our notice today,\" said forest ranger Sarat Chandra Mishra. Though the exact reason of the death of the wild bears was not known, the forest officials suspected that the animals might have died either due to the electrocution or poisoning, he said. Local veterinary doctors conducted the post-mortem. Since the death of the bears was surrounded in mystery, the veterinary doctors also taken the viscera of animal for laboratory test, he said. NSG officials seize large stockpile of explosives, hand grenades Exit polls project BJP as single largest party in Maharashtra, Haryana Exit Poll: BJP emerges as the largest party in Maharashtra, Haryana - Part II Lyricist <mark>Santosh Anand</mark>'s son Sankalp <mark>Anand</mark> commits suicide along with wife Companies given 6 months to wind up can't be stopped from mining coal: SC Exit polls project BJP as largest party in Maharashtra, Haryana-Part 2 Assembly Election: Heavy voting in Maharashtra and Haryana - Part II With 25 sixes, 35 fours, James Tull slams 341 runs in limited-overs cricket! Pakistan is capable of inciting violence in Kashmir, says Musharraf Opinion divided in Maharashtra; clear edge to BJP in Haryana: Exit Polls India successfully launches IRNSS-1C navigation satellite on board PLSV C-26 SC grants bail to Jayalalithaa; AIADMK activists break out in celebrations Hong Kong's CY Leung defends police even as brutality video goes viral Sourav Ganguly confident of India defending Cricket World Cup title Al Qaeda-ISIS may launch joint terror attack on India: NSG chief India vs West Indies - Live Score: Virat Kohli hits ton as India post 330; tourists struggling on 223/7 Assembly polls: Record 73% voting in Haryana, Maharashtra sees over 64% turnout Maintain peace, law and order, don't criticise judgement: Jaya to cadres Burdwan blast case: We have no problem with NIA probe, says Mamata Banerjee"}, {"articleID": "2015012615_00025245_W", "names": {"John Willis": ["Q25189216", "Q42313318", "Q48700479", "Q48808723", "Q6264417"], "Ian Khan": ["Q23664007", "Q5981972"], "Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"], "Rodney Rogers": ["Q3909415", "Q634812"], "Jason Anderson": ["Q30123038", "Q3162882", "Q55369961", "Q6161926", "Q6161927", "Q6161930"], "Sean Michael": ["Q2262098", "Q7441255"], "Robert Brown": ["Q12053713", "Q16144772", "Q16200950", "Q18027424", "Q18358801", "Q19874190", "Q19959074", "Q21165598", "Q21452914", "Q2156625", "Q21664222", "Q24418955", "Q25189687", "Q28792824", "Q42969277", "Q43911980", "Q47505833", "Q51585297", "Q55937635", "Q56425064", "Q57412643", "Q6106949", "Q7342398", "Q7342400", "Q7342401", "Q7342410", "Q888471"]}, "date": "2015-01-26", "url": "http://www.sys-con.com/node/3285442", "content": "News Feed Item WealthEngine Changes Landscape of Data-Driven Marketing with New Prospecting Product BETHESDA, Md., Jan. 26, 2015 / PRNewswire /--WealthEngine, the leading provider of wealth intelligence, prospect research and marketing services for nonprofits, healthcare, education, luxury goods and financial services, announces the release of its new prospecting solution, WE Prospect. Marketers, agencies and fundraisers can now easily identify ideal targets with WE Prospect by creating ultra-segmented audiences using wealth, demographic, lifestyle and personal attributes across a database of more than 300 million people in the U.S., delivered with the speed and accuracy of an Internet search engine. In the era of big data, WealthEngine has shifted the paradigm for prospecting for both marketers and fundraisers. Rather than starting with a list of names that marketers must cull for the perfect customer, WE Prospect allows marketers to begin with their model of an ideal customer, then find the consumers that fit those attributes. This approach empowers WealthEngine customers to take a more accurate and focused methodology to prospecting, while consumers will now experience more personalized, meaningful communication from the brands that matter most to them at the right moment in time. The result is a win-win for marketers and consumers, and helps marketers achieve a higher ROI while delivering higher satisfaction to end customers. \"The adoption of data-driven marketing is widespread. And WE Prospect is what differentiates WealthEngine from the rest of the market,\" said WealthEngine chief marketing officer Mike Lees. \"WE Prospect uncovers who has the wealth and affinity to buy or donate and determines if now is the right time to engage. No other company can deliver these capabilities with the clarity and precision that WE Prospect achieves .\" WE Prospect provides sales professionals, marketers and fundraisers with highly relevant, actionable and cost-effective options for their prospecting needs, including: Salesforce users can leverage an easy way to find, understand and contact affluent prospects - directly within their existing Salesforce database. WE Prospect for FindWealth8: WealthEngine subscribers can access real-time list curation and development as well as engage across channels with actionable contact info and optional online profile mapping - all within WealthEngine's online platform. WE Prospect Standalone: Customers can collaborate with WealthEngine to develop custom, highly-segmented audiences of high-potential prospects. \"As an industry leader in audience and wealth intelligence, WealthEngine is truly driving prospecting out of the Dark Ages,\" said <mark>John</mark> Funge, senior vice president of product management at WealthEngine. \"Through its modern, intuitive interface, WE Prospect provides users with a simple way to access unparalleled predictive insights into a prospect's financial status and persona. Now marketers and fundraisers know more before they engage, thus driving efficiency, effectiveness and actionability .\" For more information on WE Prospect, join us for our upcoming webinar, \"Introducing WE Prospect - Perfect Prospecting Made Simple\" on February 3, 2015. See how it works, learn its capabilities, and join an exclusive Q & A with <mark>John</mark> Funge. By attending the webinar, you will also have an exclusive opportunity to register for a free trial--allowing you to personally test drive WE Prospect & see how easy it is to target your best prospects. About WealthEngine WealthEngine ™, Inc. is a leading provider of audience intelligence solutions to customers targeting HNW clients in the healthcare, education, financial services and luxury markets. The company's unique data-driven approach to analytics, prospecting, and marketing has transformed the sales, marketing and fundraising processes of more than four thousand clients. Headquartered in [email protected] To view the original version on PR Newswire, visit: http: //www.prnewswire.com/news-releases/wealthengine-changes-landscape-of-data-driven-marketing-with-new-prospecting-product-300025006.html Published January 26, 2015 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. \"For over 25 years we have been working with a lot of enterprise customers and we have seen how companies create applications. And now that we have moved to cloud computing, mobile, social and the Internet of Things, we see that the market needs a new way of creating applications,\" stated Jesse Shiah, CEO, President and Co-Founder of AgilePoint Inc., in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. You use an agile process; your goal is to make your organization more agile. But what about your data infrastructure? The truth is, today's databases are anything but agile - they are effectively static repositories that are cumbersome to work with, difficult to change, and cannot keep pace with application demands. Performance suffers as a result, and it takes far longer than it should to deliver new features and capabilities needed to make your organization competitive. As your application an...\"We are strong believers in the DevOps movement and our staff has been doing DevOps for large enterprise environments for a number of years. The solution that we build is intended to allow DevOps teams to do security at the speed of DevOps,\" explained Justin Lundy, Founder & CTO of Evident. io, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. It's time to face reality: \"Americans are from Mars, Europeans are from Venus,\" and in today's increasingly connected world, understanding \"inter-planetary\" alignments and deviations is mission-critical for cloud. In her session at 15th Cloud Expo, Evelyn de Souza, Data Privacy and Compliance Strategy Leader at Cisco Systems, discussed cultural expectations of privacy based on new research across these elements The consumption economy is here and so are cloud applications and solutions that offer more than subscription and flat fee models and at the same time are available on a pure consumption model, which not only reduces IT spend but also lowers infrastructure costs, and offers ease of use and availability. In their session at 15th Cloud Expo, Ermanno Bonifazi, CEO & Founder of Solgenia, and <mark>Ian Khan</mark>, Global Strategic Positioning & Brand Manager at Solgenia, discussed this shifting dynamic with an...More and more file-based and machine generated data is being created every day causing exponential data and content growth, and creating a management nightmare for IT managers. What data centers really need to cope with this growth is a purpose-built tiered archive appliance that enables users to establish a single storage target for all of their applications - an appliance that will intelligently place and move data to and between storage tiers based on user-defined policies. In her session a.. . Recurring revenue models are great for driving new business in every market sector, but they are complex and need to be effectively managed to maximize profits. How you handle the range of options for pricing, co-terming and proration will ultimately determine the fate of your bottom line. In his session at 15th Cloud Expo, <mark>Brendan O'Brien</mark>, Co-founder at Aria Systems, session examined: How time impacts recurring revenue How to effectively handle customer plan changes The range of pricing a.. . Mobile, the cloud and data have upended traditional ways of doing business. Agile, continuous delivery and DevOps have stepped in to hasten product development, but one crucial process still hasn't caught up. Continuous content delivery is the missing limb of the success ecosystem. Currently workers spend countless, non-value add hours working in independent silos, hunting for versions, manually pushing documents between platforms, all while trying to manage the continuous update and flow of mul...Over the last few years the healthcare ecosystem has revolved around innovations in Electronic Health Record (HER) based systems. This evolution has helped us achieve much desired interoperability. Now the focus is shifting to other equally important aspects - scalability and performance. While applying cloud computing environments to the EHR systems, a special consideration needs to be given to the cloud enablement of Veterans Health Information Systems and Technology Architecture (VistA), i.e....\"At Harbinger we do products as well as services. Our services are with helping companies move their products to the cloud operating systems. Some of the challenges we have seen as far as cloud adoption goes are in the cloud security space,\" noted Shrikant Pattathil, Executive Vice President at Harbinger Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. After a couple of false starts, cloud-based desktop solutions are picking up steam, driven by trends such as BYOD and pervasive high-speed connectivity. In his session at 15th Cloud Expo, Seth Bostock, CEO of IndependenceIT, cut through the hype and the acronyms, and discussed the emergence of full-featured cloud workspaces that do for the desktop what cloud infrastructure did for the server. He also discussed VDI vs DaaS, implementation strategies and evaluation criteria. Things are being built upon cloud foundations to transform organizations. This CEO Power Panel at 15th Cloud Expo, moderated by Roger Strukhoff, Cloud Expo and @ ThingsExpo conference chair, addressed the big issues involving these technologies and, more important, the results they will achieve. <mark>Rodney Rogers</mark>, chairman and CEO of Virtustream; <mark>Brendan O'Brien</mark>, co-founder of Aria Systems, Bart Copeland, president and CEO of ActiveState Software; Jim Cowie, chief scientist at Dyn; Dave Wagstaff, VP...\"The year of the cloud - we have no idea when it's really happening but we think it's happening now. For those technology providers like Zentera that are helping enterprises move to the cloud - it's been fun to watch,\" noted Mike Loftus, VP Product Management and Marketing at Zentera Systems, in this SYS-CON. tv interview at Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Bring the world's best IaaS to the world's best PaaS. In their session at 15th Cloud Expo, Animesh Singh, a Senior Cloud Architect and Strategist for IBM Cloud Labs, and <mark>Jason Anderson</mark>, a Cloud Architect for IBM Cloud Labs, shared their experiences running Cloud Foundry on OpenStack. They focused on how Cloud Foundry and OpenStack complement each other, how they technically integrate using cloud provider interface (CPI), how we could automate an OpenStack setup for Cloud Foundry deployments, an...\"Application monitoring and intelligence can smooth the path in a DevOps environment. In a DevOps environment you see constant change. If you are trying to monitor things in a constantly changing environment, you're going to spend a lot of your job fixing your monitoring,\" explained Todd Rader, Solutions Architect at AppDynamics, in this SYS-CON. tv interview at DevOps Summit, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) adMarketplace captures and analyzes massive data to allow for efficient real-time bidding for traffic sources for online advertising and delivers rapid cost-per-click insights to advertisers. The next BriefingsDirect bid data trailblazer interview examines how New York-based adMarketplace, a search syndication advertising network, has met its daunting data-warehouse requirements. Learn here how...Jan. 26, 2015 09:45 AM EST Reads: 314 Gordon Haff wrote an insightful column today about \"skeuomorphic virtualizaton,\" in other words the notion of thinking of virtual servers as having the same look and feel of the physical machines lying underneath. The upshot is that virtualization ends up just being a form of partioning; users view virtualized instances as no different from a single physical server. Gordon urges the end of ske...Jan. 26, 2015 09:00 AM EST Reads: 974 Application Economy and Cloud Meet IoT, Big Data As we enter 2015, it is time to dust off the crystal ball once again for our annual predictions forecast. The parade of new technology innovations and breakthroughs is unfolding across many fronts. In some cases the convergence of technologies themselves provides the breakthrough. The cloud, Internet of Things, mobile platforms, social media, Big Data and analytics, vertical-specific marketplaces...Jan. 26, 2015 09:00 AM EST Reads: 1,495 Network Security Trends to Be Aware of for 2015 With every New Year it is time to look back at the industry events of the past 12 months, and use our expertise to predict what lies ahead, in order to be more prepared. With regards to DDoS attacks, here is a short list of what to expect in 2015. We expect to see an increase in DDoS attacks size in terms of bandwidth, but likely there will be an emphasis on packets per second metric. Bandwidth...Jan. 26, 2015 09:00 AM EST Reads: 1,030 Production-Ready Clouds with Jeff Tegethoff \"Appcore has been around since January 2008. We exclusively built clouds for service providers. We've been working with CloudStack since about that same time and our software sits on top of CloudStack,\" stated Jeff Tegethoff, CEO of Appcore, in this SYS-CON. tv interview at 15th Cloud Expo, held Nov 4-6, 2014, at the Santa Clara Convention Center in Santa Clara, CA. Jan. 26, 2015 09:00 AM EST Reads: 2,211 Some of the network gear vendors cast a wary look at network management vendors, particularly those who do continual, automatic discovery of the network inventory and connectivity. Why? We know what's actually out there, and what's actually being used. We had one customer in the insurance industry who was due to renew their maintenance agreement with a large, well-known network gear vendor ....Jan. 26, 2015 09:00 AM EST Reads: 840 Networking in 2015 - SDN and IPv6 After reading <mark>Sean Michael</mark> Kerner's article in Enterprise Networking Planet earlier this month, I thought I'd add a few thoughts of my own to what he wrote. He discusses SDN and IPv6. Here's my take on Software Defined Networking (SDN) in 2015: Given the ongoing hype and the range of benefits its proponents extol, I expect to see a continued increase in interest and evaluation of SDN. Howev...Jan. 26, 2015 08:16 AM EST Reads: 147 The Non-Tangibles Become Tangible We recently changed over the entire phone system in our London office. After four years, the equipment failed, and it was time to update. As we did so, we also changed vendors. Why? It occurred to us that, for four years, we had put up with horrible support - we were the victims of fraud at one point, and the vendor did nothing to support us with the main telecom provider. The phone system co.. . Jan. 26, 2015 08:10 AM EST Reads: 103 Enterprise Mobile App Development Enterprises are adopting mobile technologies at an unprecedented rate. As Business News Daily recently reported, 1.3 billion workers will go mobile by 2015, and with that massive number, the need for enterprise mobile apps can only skyrocket. With that increase, many mobile app developers will be called upon to create internal mobile enterprise apps. These apps have many requirements and consider...Jan. 26, 2015 08:00 AM EST Reads: 1,069 <mark>Jason</mark> Bloomberg Blog Over Million Views <mark>Jason</mark> Bloomberg, president of agile digital transformation analyst firm Intellyx, has surpassed one million page views on the SYS-CON family of online magazines, which includes Cloud Computing Journal, Internet of Things Journal, Big Data Journal, SOA World Magazine, and several others. His home page at SYS-CON can be found at JasonBloomberg.SYS-CON. com. Bloomberg is also a regular contributor...Jan. 26, 2015 08:00 AM EST Reads: 789 Gather Process Metrics on the Windows Agent Log data provides the most granular view into what is happening across your systems, applications, and end users. Logs can show you where the issues are in real-time, and provide a historical trending view over time. Logs give you the whole picture. As we continue to expand Logentries' powerful search and metric capabilities, we are also looking for new ways to allow our Users to send us critica...Jan. 26, 2015 04:30 AM EST Reads: 1,147 When a CIO or a CTO thinks of the applications they support it is almost always in terms of a \"portfolio\" When a research company named Gleanster poll executives about agile data management they discovered an interesting trend. Companies are reporting an increase in portfolio sizes with just over 36% of all respondents from large companies listing 75 or more applications in their portfolio. Jan. 26, 2015 04:00 AM EST Reads: 1,002 Release Managers at a DevOps Divide An operations group tasked with accepting and supporting a software release. This group wants a predictable process, they view releases as incidents to be managed, and they answer to a business that wants predictability and accountability. One or more development groups tasked with creating software to be released. These groups tend to be more diverse. You might have one development group that...Jan. 26, 2015 02:00 AM EST Reads: 982 Avoid Application Outages and Stalls Last week I was able to catch up with Chris Tranter, Technical Lead at Hallmark UK. Hallmark's engineering team runs on tight deadlines, and like all popular websites, places a huge importance on customer experience. As you can imagine, their site has abnormal and inconsistent load times, especially through the holiday season. Ensuring a smooth, seamless experience without stalls, outages, or cra...Jan. 26, 2015 02:00 AM EST Reads: 1,201 Slides: <mark>Robert</mark> H. <mark>Brown</mark> \"Possibilities of IoT' Code Halos - aka\" digital fingerprints \"- are the key organizing principle to understand a) how dumb things become smart and b) how to monetize this dynamic. In his session at @ ThingsExpo, <mark>Robert Brown</mark>, AVP, Center for the Future of Work at Cognizant Technology Solutions, outlined research, analysis and recommendations from his recently published book on this phenomena on the way leading edge org...Jan. 26, 2015 02:00 AM EST Reads: 2,755 Parsing and Centralizing Elasticsearch Logs No, it's not an endless loop waiting to happen, the plan here is to use Logstash to parse Elasticsearch logs and send them to another Elasticsearch cluster or to a log analytics service like Logsene (which conveniently exposes the Elasticsearch API, so you can use it without having to run and manage your own Elasticsearch cluster). If you're looking for some ELK stack intro and you think you're i.. . Jan. 25, 2015 11:45 PM EST Reads: 1,458 Seven Ways To Build Robust Production Testing Here's a short anecdote: a QA team maintained a test environment separate from their production environment, but they had gone through great lengths to ensure it matched what was in production in every respect. It was filled with the same hardware, and all the software was identical down to the patch level. They had a strong process to ensure that any change made to one environment was mirrored in...Jan. 25, 2015 11:45 PM EST Reads: 1,436 Enterprise Initiatives Episode: Our guest on the podcast this week is <mark>John Willis</mark>, Founder and VP of Customer Enablement at SocketPlane. We discuss the effort needed to implement a grassroots DevOps initiative. Listen in to find out how to gain the essential support of leaders for your project. (Make sure you have both headphones in to hear the full audio of this episode .) Jan. 25, 2015 11:00 PM EST Reads: 1,366 IoT and Enterprise End-User Support On January 21, 2015, Microsoft unveiled the next major beta of Windows 10, the Consumer Preview, with an event at the company's home in Redmond, Washington. As it is a major release for Microsoft we expected to see several new features toward Microsoft's vision on\" Mobile First' & \"Cloud First' and toward a Universal Application Platform across all of desktop, laptop, mobile devices, gaming device...Jan. 25, 2015 11:00 PM EST Reads: 1,262 The Bill and Melinda Gates Foundation recently identified four keys areas in which to focus for the next 15 years: Health, Farming, Banking, and Education. Bill himself holds forth on a regular basis about the challenges facing many billions of people in the world, particularly in Africa, as well as the opportunities to save lives and change lives. He does not seem naïve about the enormity of t.. . Release Managers at a DevOps Divide By @ Plutora | @ DevOpsSummit [#DevOps] Process Metrics on the Windows Agent By @ TrevParsons | @ DevOpsSummit [#DevOps] Enterprise @ Splunk\" Best \"DevOps Collaboration | @ DevOpsSummit [#DevOps] Industrial\" Internet of Things' By @ EnterpriseWeb | @ ThingsExpo [#IoT] New @ Cisco Ad Campaign Focuses on Application Economy | @ CloudExpo [#Cloud] Scaling Global Databases By @ Basho CTO @ McCrory | @ CloudExpo [#BigData] GE's Industrial Internet of Things as a Service | @ ThingsExpo [#IoT] Avoid Application Outages and Stalls By @ HannahHaleyC | @ DevOpsSummit [#DevOps] \"Internet of Things Moves into the Mainstream' By @ Autodesk | @ ThingsExpo [#IoT] Announcing @ CodeFutures Named\" Sponsor \"of @ CloudExpo New York [#Cloud] Mike Kavis\" DevOps Journal' Blog Exceeds 40,000 Reads @ MadGreek65 | @ DevOpsSummit [#DevOps] Accelerate \"Real-World' Internet of Things By @ AgilePoint | @ ThingsExpo [#IoT] Top @ AWSCloud Consulting Partner Award Goes to @ CloudTP | @ CloudExpo [#Cloud #DevOps] Podcast: DevOps Gaining Support with <mark>John Willis</mark> By @ MadGreek65 | @ DevOpsSummit [#DevOps] Enterprise DevOps Governance Gates By @ Plutora | @ DevOpsSummit [#DevOps] JavaScript for Java and C + + Developers By @ YFain | @ ThingsExpo [#IoT] The State of the\" Internet of Things' By @ MadGreek65 | @ ThingsExpo [#IoT] The World of Hadoop and Beyond By @ JnanDash | @ CloudExpo [#BigData] Apache Drill's Self-Service Capabilities By @ MapR | @ CloudExpo [#BigData] Application Intelligence From @ AppDynamics | @ DevOpsSummit [#DevOps] Timely, Optimal and Efficient with @ Creative_Busine | @ CloudExpo [#Cloud] Internet of Things Connectivity By @ Kaazing | @ ThingsExpo [#IoT] Easy Internet of Things Integration By @ AgilePoint | @ ThingsExpo [#IoT] Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] Do You Need PaaS for Cloud Microservices? By @ IoT2040 | @ DevOpsSummit [#DevOps] PagerDuty + Desk.com App Hub By @ PagerDuty | @ DevOpsSummit [#DevOps] DevOps Summit Accepting Keynote Proposals | @ DevOpsSummit [#DevOps] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Transitioning to a DevOps Model By @ DShack | @ DevOpsSummit [#DevOps] How to Ditch Scheduled Maintenance By @ PagerDuty | @ DevOpsSummit [#DevOps] Internet of Things New York Keynote Proposals | @ ThingsExpo [#IoT #M 2M] \"Docker Is Not Enough' By @ ActiveState | @ DevOpsSummit [#DevOps] ChatOps: Let's Talk Plugins By @ PagerDuty | @ DevOpsSummit [#DevOps] Software-Defined Storage & Hybrid Cloud By @ CloudianStorage | @ CloudExpo [#Cloud] SDN and Gartner's Hype Cycle By @ MartenT1999 | @ CloudExpo [#SDN] Internet of Things\" High Tech to \"I\" Tech \"By @ AndrewBolwell | @ ThingsExpo [#IoT] Is a\" Federated' European Cloud More Democratic? By @ ABridgwater | @ CloudExpo [#Cloud] Cloud Is All About Workload By @ ABridgwater | @ CloudExpo [#Cloud] TV Ad To Feature \"Internet of Things' and @ ThingsExpo [#IoT #CloudExpo] @ ThingsExpo | #WebRTC, Internet of Things and #API Gateways (#IoT)\" Decisions on Streaming Data' By @ Databricks | @ CloudExpo [#BigData] Gathering Process Metrics on the Windows Agent By @ Logentries | @ DevOpsSummit [#DevOps] The Management Gap with Business Cloud Apps By @ Exoprise | @ CloudExpo [#Cloud] The Technology Content of the SOTU By @ BobGourley | @ CloudExpo [#Cloud] Announcing @ Gridstore to Exhibit at @ CloudExpo New York [#Cloud] Telecom, WebRTC and the \"Internet of Things' By @ RingPlusMobile | @ ThingsExpo [#IoT #WebRTC]\" Internet of Things' and WebRTC with @ MatrixDotOrg | @ ThingExpo [#IoT #WebRTC] What Manufacturing Teaches Us About #DevOps By @ GHaff | @ DevOpsSummit Announcing @ PagerDuty Session at @ DevOpsSummit Silicon Valley [#DevOps] DevOps Is Even More Important Than You Think | @ DevOpsSummit [#DevOps] Beacon, Oh Beacon, Wherefore Art Thou Beacon? By @ ScottJenson | @ ThingsExpo [#IoT] Cloud Computing Security Issues and Challenges By @ GiladPN | @ CloudExpo [#Cloud] Cloud Computing - Big Data - Internet of Things SDDC - WebRTC - DevOps Cloud computing is become a norm within enterprise IT. The competition among public cloud providers is red hot, private cloud continues to grab increasing shares of IT budgets, and hybrid cloud strategies are beginning to conquer the enterprise IT world. Big Data is driving dramatic leaps in resource requirements and capabilities, and now the Internet of Things promises an exponential leap in the size of the Internet and Worldwide Web. The world of SDX now encompasses Software-Defined Data Centers (SDDCs) as the technology world prepares for the Zettabyte Age. DevOps into the mix, and you have three days of pure cloud computing that you simply cannot miss. Cloud Expo - the world's most established event - offers a vast selection of 130 + technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features two Demo Theaters that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $900 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires January 31, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in New York [June 9-11, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2012031912_00089029_W", "names": {"Ruth Thomas": ["Q7383240", "Q7383241"], "Anne Miller": ["Q19281589", "Q49303719"]}, "date": "2012-03-19", "url": "http://bernews.com/2012/03/bermudians-with-the-write-stuff/", "content": "bermudians who competed in the 1984 olympics in los angeles, usa bermudians who competed in the 1956 olympics in melbourne, australia leave a comment a growing number of bermudians have what might be called \"the write stuff\" and are no longer allowing the island's inherent conservatism to mute their voices. \"numero cinq\" magazine, saskatchawan-based bermudian writer kim aubrey discusses the flowering of bermudian literary talent in recent decades. \"whether from within the closeness of the island community or from the distance of exile, bermudian writers have begun to embrace their role as artists -\" to reveal a society to itself' and to \"reply? honestly:\" this is what i think of this'. ., \"said ms aubrey. ms aubrey profiles a wide array of contemporary bermuda writers and poets including ronald lightbourne, chris astwood, jane downing, <mark>ruth thomas</mark>, alan c. smith, wendy fulton steginsky, nancy <mark>anne miller</mark>, paul maddern, laurel monkman, llewella rewan-dowling, saskia wolsak, tiffany paynter and the late jeremy frith .\" when i was growing up on the island in the sixties and seventies, i didn't know of any bermudian writers, \"she said .\" the poems, novels and plays we read in school had all been written by dead white british men, and in my final year of high school, one or two living americans, like ken kesey. \"no one told us about kesey's bermudian contemporary, brian burland, who was writing and publishing gritty, honest novels about bermuda from a self-imposed exile in england and then the us, before returning home in the nineties. the conservatism of the small island would have made it impossible for him to write as freely if he'd stayed there .\" bermudian spoken word poet tiffany paynter ms aubrey cites from bermuda folklife officer dr. dismont robinson's introduction to the bermuda anthology of poetry in which she gives an explanation for bermudians' difficulty in writing poetry and fiction about their lives and their homeland: \"like many other small islands dependent upon tourism and international business, bermuda has often viewed itself from the outside-in .\" ever dependent upon the whims of a foreign market, bermudians have been conditioned to examine our environment in a manner that takes the form of an external measurement. we are far more likely to ask \"what might an other think of this?' than to ask\" what do i think of this?' \"such a fundamental point of perspective greatly affects how we view the world as well as how, when, and if we choose to express ourselves. our conservatism has its roots in this behaviour, and might explain why as a nation our authors are far more likely to try their hand at writing historical narrative rather than poetry or prose fiction .\" bermudian poet ron lightbourne reading his work at chewstick kim aubrey grew up in bermuda but now lives in saskatoon, saskatchewan. she is a writer, editor, and artist with an mfa in writing from vermont college of fine arts. her watercolours have been exhibited in galleries, and her writing has appeared in such publications as \"best canadian stories\" , \"the new quarterly\" and \"event\". she recently completed a memoir, \"the girl in the blue leotard\" and leads an annual retreat to bermuda for writers and artists."}, {"articleID": "2009120411_00182751_W", "names": {"Ramon Martinez": ["Q3418689", "Q3418690", "Q7289851"], "Jimmy Rollins": ["Q15059522", "Q601982"], "Juan Castro": ["Q387429", "Q56248188"]}, "date": "2009-12-04", "url": "http://gloucestertimes.com/pusports/local_story_337224142.html", "content": "polanco, phillies agree to $18m, 3-year contract philadelphia - placido polanco is putting aside his gold glove and switching positions to have a chance at winning a championship. polanco returned to the philadelphia phillies yesterday, agreeing to an $18 million, three-year contract. the 34-year-old free agent won gold gloves at second base for the detroit tigers in 2007 and this year, but will shift to third base, which hasn't been his primary position since 2002. he replaces pedro feliz, who became a free agent after the phillies declined his $5.5 million option. \"i always wanted to be here, i never wanted to leave,\" polanco said. \"one of the reasons i wanted to come back is because it's pretty obvious the team is committed to winning. and i want to win. that's it. they asked me if i was willing to play another position and i was like,\" sure .' i can play third base. i played in college, in st. louis and i also played some third here. i feel pretty confident about it. \"polanco first joined the phillies in the trade that sent scott rolen to st. louis in july 2002. he hit .297 with 38 homers and 160 rbis in parts of four seasons in philadelphia. once chase utley became the regular second baseman, polanco's role was reduced. he was traded to detroit in june 2005 for reliever ugueth urbina and infielder <mark>ramon martinez</mark>. polanco batted .285 for the tigers last season with 31 doubles, 10 homers and 72 rbis. he hit .341 and made the all-star team in 2007 .\" for him to come back to philadelphia to change positions, it's just one of the things he's about, \"phillies general manager ruben amaro jr. said .\" he's not only a tremendous professional and a championship-type player, but he's a championship-type person, and that's what we're trying to do here, bring championship-type people, both talent-wise and personnel-wise. \"polanco gets a $500,00 signing bonus, $5 million next season, $5.25 million in 2011 and $6.25 million in 2012. the deal includes a $5.5 million mutual option for 2013 with a $1 million buyout .\" the phillies were always my first choice, \"he said .\" i played here, i know most of the guys here, i know the city. and they have a pretty good team that's committed to win. i thank all of the other teams that expressed interest in me, but the phillies were always my first choice. \"polanco is a .303 hitter with 90 homers, 579 rbis and 71 stolen bases in 12 seasons. he joins a potent lineup that features five all-stars - utley, shane victorino, ryan howard, jayson werth and raul ibanez - and former mvp <mark>jimmy rollins</mark>. he's an ideal no. 2 hitter, but that's been victorino's spot in the order .\" i want to win and you look around and we have a lot of great players, \"polanco said .\" it seems like you could flip this lineup around and it would still be good, you know? whatever charlie wants me to do, i'd be more than happy to do it. i just know everyone here plays to win. chase, victorino, <mark>rollins</mark>, howard, everybody. \"the nl champions also agreed to a $750,000, one-year contract with infielder <mark>juan castro</mark>, who hit .277 with one home run and nine rbis in 57 games for the los angeles dodgers last season. the 37-year-old <mark>castro</mark> replaces utilityman eric bruntlett, who became a free agent. <mark>castro</mark> made 19 starts at shortstop, eight at second base and two at third base, while also appearing in left field for two games. <mark>castro</mark>'s contract includes a $700,000 salary next year, and the deal has a $750,000 club option for 2011 with a $50,000 buyout .\" in <mark>juan castro</mark>, we have a versatile guy who can play multiple positions and is coming off a year in which he swung the bat fairly well, \"amaro said .\" we're very happy to add him to our club, as he will give charlie options. \"please note changes in policy: commenters are required to have a username with a valid and verified email address. gloucestertimes.com reserves the right to ban the ip address of any commenter (person) found using multiple aliases under multiple e-mail addresses in a deceptive manner. posts that do not meet site standards, which can be found careers gloucester daily times, 36 whittemore street, gloucester, ma 01930 - 978-283-7000 © copyright eagle tribune publishing company. all rights reserved."}, {"articleID": "2018112601_00024703_W", "names": {"Peter Griffiths": ["Q337895", "Q47832786", "Q7174388"]}, "date": "2018-11-25", "url": "http://business.scoop.co.nz/2018/11/26/metro-performance-glass-lowers-fy-guidance/", "content": "Metro Performance Glass lowers FY guidance November 26, 2018 Article Article--BusinessDesk Nov. 26 (BusinessDesk)--Metro Performance Glass reported a 22 percent drop in half-year net profit, lowered its full-year guidance and said it won't be paying any dividends as it struggles to turn around its Australian business. Metro Performance Glass lowers FY guidance, suspends dividends to bring down debt By Rebecca Howard Nov. 26 (BusinessDesk)--Metro Performance Glass reported a 22 percent drop in half-year net profit, lowered its full-year guidance and said it won't be paying any dividends as it struggles to turn around its Australian business. The company provided no further details of a new competitor looking to build a new glass processing plant near Hamilton that it alerted the market of earlier this month. New Zealand's biggest glass processor said its half-year net profit in the six months to Sept. 30 was $9.1 million versus $11.8 million a year earlier. Revenue was down 1 percent at $140.5 million while earnings before interest and taxation were down 18 percent at $15.5 million. The result was impacted by poor trading results in Australia, it said. Metro Glass said its New Zealand business--with the exception of Canterbury--remains supported by elevated levels of residential and non-residential construction and revenue was 1 percent higher at $113 million. The Australian business, Australian Glass Group, remains challenging, it said. Revenue was down 7.1 percent and ebit was a loss of $1.3 million versus earnings of $2.6 million a year earlier. \"The market is supportive and the recent capital investment programme is showing promise on lifting production capacity and improving manufacturing efficiency. However, it is taking longer than originally planned to reset AGG's operations, people and culture. This has impacted its year-to-date financial performance and highlighted further capability gaps we are working to address,\" said chairman <mark>Peter Griffiths</mark>. \"We are focused on stabilising AGG's performance in the second half of the year and returning the business to profitable growth in FY20,\" said <mark>Griffiths</mark>. Given the challenges in Australia, it now expects group ebit of around $28 million, down from the guidance it gave at its annual general meeting when it said ebit would be at the lower end of its target range of $30million - $33 million. The board has also reviewed the group's leverage and dividend policy against its current operating performance, its longterm strategy, the uncertain future competitive landscape, and expectations of how the Australasian building cycles could evolve in the coming years, said <mark>Griffiths</mark>. \"As a result, it will declare no further dividends until the group's leverage ratio, as measured by net debt to rolling 12month ebitda, is reduced to approximately 1.5 times. At 30 September 2018, this ratio was 2.3 times,\" it said. Net debt stood at $95.2 million. The stock last traded at 53 cents and is down 44 percent over the past 12 months. The shares plunged 24 percent earlier this month after it reported on its expected new rival's plans to have its new Hamilton plant coming on stream in mid-2020. (BusinessDesk)"}, {"articleID": "2010022312_00183696_W", "names": {"Haiyan Wang": ["Q48183967", "Q58381093"]}, "date": "2010-02-23", "url": "http://strategy-business.com/article/10104?rssid=global_perspective&gko=95ee3", "content": "the china challenge for global companies, ignoring china is not an option. but they must adapt their strategies to the country's changing markets, increased competition, and shifting government priorities. by edward tse in 2006, the ibm corporation uprooted the main offices for its global procurement services. it transferred them from somers, n.y., 20 miles north of corporate headquarters at armonk, to shenzhen in south china's pearl river delta, just across from hong kong. it was a notable moment: the first time one of ibm's most critical departments had moved its center from the united states. and it marked a significant milestone along the road toward making ibm a \"globally integrated enterprise\" running \"truly global systems of production,\" as its ceo, sam palmisano, had written in chongqing, in southwestern china, is a rapidly growing megacity with a population of more than 30 million. photograph © qing shan/color china photo/sipa ibm's executives knew, from many years of firsthand experience, that this region in southern china had become home to one of the biggest pools of procurement talent in the world. the company had arrived in 1993, manufacturing personal computers - a business it eventually sold in 2005, to lenovo, a chinese company. over the years ibm had produced servers, retail store systems, storage devices, and printers in shenzhen: first for overseas markets, and later, increasingly for the chinese market. it had seen massive supply networks develop in the pearl river delta. some suppliers made parts for toys, sports shoes, and other low-end products; others made components for sophisticated computing and telecommunications equipment. still others provided logistics and supporting technology. ibm had also seen the chinese government invest in business-friendly infrastructure: economic zones, industrial parks, highways and container ports, universities and training colleges. by locating its global procurement headquarters in shenzhen, ibm was not only strengthening its own supply base, but better positioning one of its core businesses: helping clients strengthen their supply chains. the company has also invested in r & d in china. its china research laboratory, one of eight flagship ibm labs around the world, is located in zhongguancun software park, next to beijing's main university district. most of its more than 150 researchers hold doctorates or master's degrees from beijing, tsinghua, or other leading chinese universities. the lab specializes in speech and language technologies, cross-border e-business solutions, and pervasive computing, which is the embedding of microprocessors in everyday objects. ibm opened another lab in shanghai in 2008. in consulting, despite the global economic slowdown, ibm has been on a growth trajectory, doubling its business in 2009 because of chinese demand. it plans to open four new offices in china, taking its total presence from six to 10. moreover, ibm runs all its global growth businesses from shanghai. this includes its businesses in asia, latin america, russia, eastern europe, the middle east, and africa. in short, ibm's presence in china is very different from what might have been envisioned a few years ago. it is defined not by an expanding consumer population or by low-wage labor, but by the integration of chinese activity with its worldwide enterprise. like a growing number of other companies - coca-cola, honeywell, kfc, and goodyear among the most prominent - ibm has a \"one world\" - oriented strategy for its operations in china. in addition to sourcing products in china and seeking out chinese markets, it is investing dramatically in operations there and integrating them with the rest of ibm's global enterprise. the benefits of a one-world strategy in china have become obvious, and a growing number of multinational companies - or \"foreign\" companies, as the chinese think of them - are ready to increase their presence. they may already market to some chinese consumers, or draw from the country's labor pool, or outsource manufacturing there, but now they want more. china's rapid recovery from the global recession, bolstered by its reorganized banking sector and its emerging middle class, has attracted many companies to the chinese economy. as resources american chamber of commerce in shanghai and booz & company, \"china manufacturing competitiveness 2008-2009,\" 2009: research on the evolving capabilities and interests of manufacturers in china. andrew cainey, suvojoy sengupta, and steven veldhoen, \"capturing the asian opportunity,\" s + b, winter 2009: why economic recovery in china, india, and elsewhere in the region could be the strongest source of sustained global growth for years to come. patrick chovanec, \"the nine nations of china,\" the atlantic, november 2009: the further differentiation of china, its culture, and its prospects for development and change. anil k. gupta and <mark>haiyan wang</mark>, getting china and india right: strategies for leveraging the world's fastest-growing economies for global advantage (jossey-bass, 2009): how to go beyond simplistic, premium-based marketing in both global economies. warren liu, kfc in china: secret recipe for success (wiley, 2008): the inside story of the success in china of kfc and its subsidiary yum brands. sam palmisano, \"the globally integrated enterprise,\" foreign affairs, may/june 2006: the chairman and ceo of ibm explains how the corporation is evolving from \"multinational\" to \"global\" enterprise. edward tse, the china strategy: harnessing the power of the world's fastest-growing economy (basic books, 2010): an overall, in-depth guide to the vision, versatility, and vigilance demonstrated by successful companies in china today. china's five surprises, \"s + b, winter 2005: this article explained china's entrepreneurial intensity, fearless experimentation,\" brain gain, \"transition away from patronage, and overseas ambition. context and complexity,\" s + b, autumn 2007: more examples of the flexible approach needed for china's increasingly diverse market. shan zhai companies, once associated with pirated goods, have become competitive players, even in mature industries. for more thought leadership on this topic, see the"}, {"articleID": "2019072620_00003928_W", "names": {"Stephen Fowler": ["Q39415168", "Q7609726"]}, "date": "2019-07-26", "url": "http://www.gattonstar.com.au/news/teen-fugitives-leave-police-in-dust/3790482/", "content": "The tiny and remote town of Gillam has been taken over by an army of police hunting for murder spree suspects Bryer Schmegelsky and Kam McLeod. Picture: Twitter News Teen fugitives leave police in dust by Marnie O’Neill 27th Jul 2019 5:17 AM 0 They've managed to dodge a military scale manhunt involving scores of officers, sniffer dogs, helicopters, drones, thermal imaging, armoured trucks and next-level tracking and surveillance equipment. Now fears are growing that Canadian highway murder spree suspects Bryer Schmegelsky, 18, and Kam McLeod, 19, may no longer be hiding in dense bushland surrounding the tiny and remote community of Gillam, in northern Manitoba, where authorities have been searching for two days. Bryer Schmegelsky and Kam McLeod are suspects in the murders of Lucas <mark>Fowler</mark> and Chynna Deese The pair have been charged with the murder of a 64-year-old Canadian botanist and are suspects in the double homicide of Australian policeman's son Lucas <mark>Fowler</mark>, 23 and his American girlfriend Chynna Deese, 24. An army of Royal Canadian Mounted Police (RCMP), along with reinforcements from as far afield as Alberta and Ontario, descended on the one-road town of just 1,200 people after the teens torched their last known getaway car at a nearby First Nations reserve on Monday. An Emergency Response Team, Crisis Negotiation Team, the RCMP Major Crime Unit and additional district resources have been deployed to the district, police said. They have received more than 80 tips and asked the public to stay away from the pair if spotted. It comes as heavy rain hampers the search for the suspected killers. Lucas <mark>Fowler</mark>'s father, NSW Police Inspector <mark>Stephen Fowler</mark> visited the ranch were his son had been living and working to collect his belongings. Christophe Weder told The Daily Telegraph: \"Lucas' father came today. It was very emotional and he felt some comfort in knowing that Lucas spent the last months of his life in such a special place .\" Heavily armed SWAT team officers search the boggy, sandfly and mosquito-infested bushland around the remote northern Manitoba town of Gillam. Picture: Vancouver News video grab Police are checking every single vehicle coming in and out of Gillam, which has only one road connecting it to the rest of Manitoba. Picture: Vancouver News video grab On Thursday, police said they believe the suspects are still hiding in the dense bushland, saying there had been two confirmed sightings. Locals are said to be \"freaking out\" in the normally quiet town where people don't lock their doors. But despite authorities' claims McLeod and Schmegelsky had effectively trapped themselves in the vast swathe of heavily forested, bear and insect-infested swampland that encircles Gillam, there are other ways out besides the single, 300km stretch of road that connects it to the rest of Manitoba. \"There's a CN (Canadian National Railway) line that passes through Gillam and right past where the burnt Rav4 was found,\" Canadian archaeologist Tyler Cantwell told news.com. au in a message. \"My pure speculation - but it's what I would do - is that they hopped on the back of a train and headed back West .\" Others say the Schmegelsky and McLeod could have jumped on a train to Churchill - a port on Hudson Bay known as the Polar Bear Capital of the World and, to a lesser extent, the Beluga Whale Capital of the World. The port is around 270km from Gillam and popular with tourists, who flock to the pristine harbour to join whale and bear spotting boat and air tours. If the suspects make it that far, they could easily steal a boat or another car. The ever present threat of polar bears means that locals never lock their vehicles. Authorities advise anyone under attack to jump into the nearest car and shut themselves inside. CCTV vision of Kam McLeod, 19, and Bryer Schmegelsky, 18, in Saskatchewan. Picture: Darryl Dyck/The Canadian Press via AP Only one road connects Gillam to the rest of Manitoba. However, a rail line runs right past the spot where the fugitives dumped their last known getaway car. Picture: Supplied DID THE TEENS PULL OFF ANOTHER CARJACKING? The murderous trail of destruction has played out in terrain so isolated there is often no internet or phone coverage, with some areas in northern Manitoba unable to even access 911. As a result, sightings of the pair have been 24 to 48 hours old by the time they are communicated, allowing the suspects to stay several steps ahead of authorities. There are also unconfirmed reports the teens are travelling in a car with Manitoba number plates stolen from a Gillam man and speculation they may have even been involved in a suspected abduction and carjacking in Regina, Saskatchewan on Tuesday. The carjacking took place 15 hours after the Rav4 was found ditched at Gillam - which is a 13 1/2 hour drive from Regina. \"Officers were sent to a parking lot in the 400 block of Albert Street where a person had been abducted at gunpoint just after noon,\" Regina Police said in a statement. \"A vehicle pulled into the parking lot followed by a small black car. A person got out of the black car with what appeared to be a gun and pointed it at the driver of the first car .\" The driver was forced into the black car with the suspect. Both cars then drove away. No shots were fired. A black car or smaller SUV with four doors and a roof rack was involved in this incident. \"Only one of the teens, McLeod, can reportedly drive but a scenario involving Schmegelsky forcing a motorist to drive at gunpoint with McLeod at the wheel of a second car is not beyond the realms of possibility. An appeal has been made to the public for information regarding the vehicle, its owner or occupants and CCTV footage released .\" Police believe there are at least two suspects involved in this incident, which does not appear to be a random act \"at this time' .\" A local newspaper reported the RCMP did not believe the incident was linked to McLeod and Schmegelsky's alleged murder spree but observers have pointed out the RCMP initially failed to link the teens to the two crime scenes or the crime scenes to each other. Others have speculated police are withholding information from the public to prevent tipping the suspects off. On Friday, police said they had confirmed two sightings of the teens in the area since Monday but said no reports of stolen cars were linked to them. This happened tues morning about 15 hrs after they torched the car in Gillam, enough time to get there. They were announced as suspects tuesday morning as well. The one teens mother also lives in Regina. https: //t.co/ZL0pXSPngy--Louis (@ Louis52068605) July 25, 2019 RCMP Corporal Julie Courchaine told reporters in Winnipeg on Thursday locals could expect a \"heavier police presence\" in the Gillam area while the manhunt continues. A fleet of armoured SWAT team trucks set off for Gillam on Thursday afternoon to join the search. Hundreds of officers, equipped with police dogs, drones and other high tech surveillance equipment, have been combing the hostile scrub for clues to the teens' whereabouts. The father of Schmegelsky, Alan, said the pair had been \"training in war\" in the woods and were masters of camouflage. But even as the reinforcements were being called in, there was an unconfirmed sighting of McLeod and Schmegelsky at Split Lake, some 85km north of the current search area. Petrol station worker Michelle Keeper told CBC News she believes she served the pair on Monday at about 4pm. It was not clear what vehicle they were travelling in at the time or whether the encounter happened before or after SUV was found dumped at Gillam. Ms Keeper said McLeod paid for $20 worth of fuel and Schmegelsky asked if they could consume alcohol in the First Nations community, which is dry. \"The guy who paid for the gas - he was quiet, he didn't say anything, he was just looking down,\" she told CBC. \"They seemed like, I don't know, normal. I'm just so nervous right now thinking about it .\" Ms Keeper said she didn't realise she had served the fugitives until she saw the RCMP's updated suspect photographs the following day. She said McLeod was still sporting a short beard and Schmegelsky was wearing the same camouflaged shirt seen in the police alert. The Alaska Highway in British Columbia where Aussie Lucas <mark>Fowler</mark> and girlfriend Chynna Deese were found dead next to their campervan on July 15. Picture: Supplied Lucas <mark>Fowler</mark> and Chynna Deese were very much in love. Picture: The Charlotte Observer/via Deese family The teens have been charged with one count of second degree murder in the death of University of British Columbia lecturer Leonard Dyck and are suspects in the murders of Mr <mark>Fowler</mark> and Ms Deese. The couple were found dead alongside their campervan on the Alaska Highway in British Columbia on July 15. They had been travelling through northern British Columbia en route to Alaska on what was meant to be a dream roadtrip. On July 19, the body of Mr Dyck, a botanist, was discovered almost 500km away on Highway 37 - two km from the abandoned and burning wreckage of McLeod and Schmegelsky's Dodge pick-up truck. Authorities initially failed to link the three incidents, classifying the teens as missing persons up until Tuesday, when they were officially named suspects in the three murders. The teens, who have been inseparable since primary school, have eluded capture ever since, leading police on a 3000-plus km chase across three provinces and up into the wilderness of northern Manitoba. CCTV footage of the suspected abduction/carjacking incident on Tuesday. Picture: Regina Police More Stories SWAT teams descend on tiny Canadian town in manhunt Canadian highway murder suspects named More Stories SWAT teams descend on tiny Canadian town in manhunt Canadian highway murder suspects named 0 canada Read More Login to follow editors picks Read More Login to follow manhunt Read More Login to follow murders Read More Login to follow canada editors picks manhunt murders"}]