[{"articleID": "2014012309_00024593_W", "names": {"Paul Lee": ["Q16210380", "Q20740130", "Q27924830", "Q27924831", "Q50129828", "Q57422067", "Q7151993", "Q7151994", "Q7151996", "Q7151997", "Q9196154"]}, "date": "2014-01-23", "url": "http://www.sanluisobispo.com/2014/01/22/2888500/alabama-house-approves-tax-credit.html#storylink=rss", "content": "Los Osos man linked to burglaries from Paso Robles to L.A., police say MONTGOMERY, Ala. - The Alabama House has passed a bill to give adoptive parents a $1,000 tax credit to make it financially feasible for more people to pursue adoptions. The House voted 72-23 in favor of the bill Wednesday and sent it to the Senate for consideration. The bill's sponsor, Republican Rep. <mark>Paul Lee</mark> of Dothan, told the House about adopting a daughter and the expense involved. He said the income-tax credit would apply to a private intrastate adoption and the adoption of an Alabama foster child where both the birth mother and the adoptive parents are from Alabama. He said 523 foster children were adopted in Alabama last year, and his goal is to increase that number. \"The hope is to get children in a stable home,\" he said. <mark>Lee</mark> said the bill would also save the state about $5,400 a year for each foster child adopted. Two adoptive parents, Dennis and Cindy Weaver of Danville, visited the Legislature on Tuesday to encourage support for the bill. They said it won't help them because it is not retroactive, but they hope it will encourage others to adopt. The Weavers were foster parents for two brothers for about five years before adopting them in February. They said they decided to become adoptive parents after raising four biological children, who are now grown. \"It's the toughest job you'll ever love. But it's very rewarding,\" Cindy Weaver said while accompanied by 7-year-old Juan and 9-year-old Luis. Legislative fiscal experts estimate the bill will apply to 2,500 adoptions per year and cost the state $2.5 million in tax credits. Democratic Rep. Pebblin Warren of Tuskegee said the state needs to do something to help people who raise, but don't officially adopt, the children of relatives due to a death or addiction. \"The job is half done,\" said Warren, who helped raise her husband's siblings .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer"}, {"articleID": "2008121405_00000488_W", "names": {"Barry Harris": ["Q16205023", "Q809046"], "Michael Hastings": ["Q21166753", "Q44706", "Q56087978", "Q6830997", "Q6830998"]}, "date": "2008-12-14", "url": "http://.journalnow.com/content/2008/dec/14/hot-sellers-at-capitals-gift-shops-an-obama-gold-m/", "content": "hot sellers: at capital's gift shops, an obama gold mine washington at the gift shops in union station, shelves once stocked with ubiquitous fbi t-shirts and mugs now display all things barack obama--apparel, action figures and a jack-in-the-box with the president-elect popping out with a big smile. even a cigar shop at the busy train station has gotten into the high-demand business with an obama stogie. \"everybody's just obama crazy. it's madness right now,\" said johndell mclean, 30, who works at life on capitol hill, a store now full of obama products, including hot sauce, mints and an obama bobble-head doll. a t-shirt features a u.s. map stamped with the words, \"under new management .\" even more popular is anything with obama's face on it. \"whatever it is that has obama on it, they like it,\" mclean said. \"everything is selling .\" well, almost everything. a sign on one small shelf at the store reads, \"all mccain/palin tee-shirts now $3.75, while they last!\" mugs from the republican campaign go for less than $2. nearby, obama mugs and t-shirts are selling for more than twice those amounts. obama is clearly a big sales opportunity for the multitude of small vendors and gift-shop retailers in the nation's capital and elsewhere. but it's almost impossible to calculate the revenue being generated, partly because street vendors sell many trinkets on the black market in washington, new york and other places. the fact that obama will be the country's first black president is driving sales to \"a whole different tier than clinton or bush or anybody,\" said martin brochstein, a senior vice president at the international licensing industry merchandisers' association. and there is more money to be made. \"it's almost like the opening of a big movie in that everything builds toward that opening day,\" brochstein said. \"opening day here is called inauguration day,\" and that is jan. 20. <mark>barry harris</mark>, 27, a student at howard university, recently bought nearly $300 worth of obama merchandise at union station for his family in california. he grabbed t-shirts, including one showing obama and martin luther king jr. with the message \"a dream come true,\" along with an obama mug and candy bar. the items will be stocking stuffers and christmas gifts. take a look at the multitude of journalnow blogs, including reports from nascar reporter mike mulhern, parenting advice from paul garber, and cooking tips from food editor <mark>michael hastings</mark> and restaurant critic laura giovanelli. it can all be found at oops! your email could not be sent because of the following errors: hot sellers: at capital's gift shops, an obama gold mine"}, {"articleID": "2013041117_00090995_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2013-04-11", "url": "http://newkerala.com/news/story/6627/manmohan-singh-accorded-ceremonial-reception-in-berlin.html", "content": "<mark>manmohan singh</mark> accorded ceremonial reception in berlin berlin, apr 11: prime minister dr. <mark>manmohan singh</mark>, who is on a three-day state visit to germany, was given a ceremonial reception at the federal chancellery here on thursday. he also inspected a guard of honour along with german chancellor angela merkel. meanwhile, the second inter-governmental consultations (igc) between india and germany is beginning shortly in berlin. the indian side at the meeting is being led by dr. <mark>singh</mark> and the german side by chancellor merkel. external affairs minister salman khurshid had earlier said that united nations security council reforms could be high on the agenda for discussions during the bilateral summit. he said both countries will make efforts to achieve the goal within the group of four framework. india and germany are also likely to discuss the status of the european union comprehensive free trade agreement (fta) and hold talks on afghanistan. during the visit, india will seek technology and expertise from germany in the field of renewable energy. berlin is also likely to extend a line of credit worth over a billion euro in this regard. germany is keen about making investments and providing expertise on the delhi-mumbai freight corridor. the first round of indo-german inter-governmental consultations took place in new delhi on may 31, 2011. in asia, the inter-governmental consultation format is used with only two other countries--israel and china. germany also has such meetings with its european partners. prior to his departure, dr. <mark>singh</mark> had said in new delhi that germany is a key partner for india in areas like infrastructure, manufacturing, science and technology, higher education, vocational training and clean and renewable energy. \"we expect to sign a number of agreements and memorandums of understanding in these areas,\" he said, adding, \"i intend to seek greater trade and investment ties with germany\". dr. <mark>singh</mark> is making his second visit to germany in three years at the invitation of chancellor merkel. he visited germany last in december 2010."}, {"articleID": "2013110715_00007263_W", "names": {"Ray Kelly": ["Q16509084", "Q3420958", "Q7297693"], "Peter Weber": ["Q104841", "Q125546", "Q2078898", "Q2078900", "Q2078902", "Q21012488", "Q21921734", "Q2491705", "Q27230537"]}, "date": "2013-11-07", "url": "http://news.collegemedianetwork.com/2013/11/07/u-to-create-committee-in-wake-of-kelly-protest/", "content": "You are now leaving College Media Network to visit http: //feeds.browndailyherald.com/~r/BrownDailyHerald/~3/fH3SbwVr2n4/ (If your pop-up blocker is activated, please click on the link above .) President Christina Paxson will form a committee to review actions surrounding the cancellation of New York City Police Commissioner <mark>Ray Kelly</mark>'s Oct. 29 lecture after protestors halted his speech, Paxson wrote in a community-wide email Wednesday. The Committee on the Events of October 29th will also address how to effectively maintain a \"deep commitment to the free exchange of ideas,\" Paxson wrote. After an initial review of the event, the committee will determine whether students who protested will face disciplinary action, as protests that \"infringe upon\" the free exchange of ideas are banned in the Code of Student Conduct. \"Halting a lecture, debate or any public forum is an unacceptable form of protest,\" the Code of Student Conduct states. Paxson, the Faculty Executive Committee and \"relevant student groups\" will help appoint members to the committee, which will include five faculty members, two undergraduate students and one graduate student. The University will likely announce committee members within the next week, wrote Marisa Quinn, vice president for public affairs and University relations, in an email to The Herald. Graduate Student Council President Keila Davis GS and Dean of the Graduate School <mark>Peter Weber</mark> will each nominate two graduate students for the committee, Davis said at Wednesday night's GSC meeting. Provost Mark Schlissel P '15 will have the final say on which graduate student serves. Undergraduate Council of Students President Todd Harris' 14.5 said he has communicated with administrators about how to determine which undergraduates should serve on the committee, though he did not have information on how those students would be picked. At the GSC meeting, Vice President for Campus Life and Student Services Margaret Klawunn said it remains to be seen whether students who protested <mark>Kelly</mark>'s lecture will be allowed to serve on the committee. The committee's composition \"will be very telling of what this committee aims to do,\" said Marguerite Joutz' 15, a leader of Brown Conversation, which hosted an event Saturday night about both the protests and the role free discourse plays at Brown. Incorporating input from faculty members, staffers, undergraduates and graduate students is important, said Iris Bahar, chair of the FEC and a professor of engineering. \"This should really be a process that involves several constituents .\" The committee will seek advice and may host a forum soliciting community input, she added. Some students at the GSC meeting voiced concerns over a lack of representation because only one graduate student will be on the committee. Once committee members are chosen, they will begin the first of two phases of recommendations. In the first phase, the committee will \"review the activities and circumstances related to\" <mark>Kelly</mark>'s lecture and \"identify issues that may have contributed to the disruption,\" Paxson wrote. The second phase will allow the committee to discuss the role of free expression and dialogue on campus, Paxson added. The University hopes to complete this phase relatively quickly while still allowing time for sufficient discussion, Quinn wrote. \"The decision to form the task force is about taking into consideration the fact that there's a broad context for understanding everything that happened,\" Klawunn said. The committee must review everything, ranging from how the event was organized to its title, she added. \"There are some things that are unclear and not everyone knows all of the circumstances,\" Bahar said. In the days following the event, there was \"a lot of discussion with students of color who felt not totally integrated into the community,\" said Rebecca Millstein' 16. She added that she thinks trying to fix this by formulating a committee is a \"really great idea .\" Other students were critical of the decision. \"How many committees is Paxson going to create? There are so many,\" said Ayane Ezaki' 13.5. \"Is that the way she's going to run the University? Relegate every sensitive topic to a committee?\" Though a majority of students supported protesters' actions outside <mark>Kelly</mark>'s lecture or petitioning to have the event canceled, about 73 percent indicated they did not approve of protests causing the event to be shut down, according to a poll The Herald conducted Monday. About 71 percent of students supported petitioning, and about 80 percent of students favored outside protests. Paxson sent out two letters on Wednesday - one to undergraduates and another to the entire campus community. In the first email, Paxson said she wanted to write to undergraduates separately and shared with them what her next letter, to the entire campus community, would entail. Paxson \"felt strongly about writing directly to undergraduates\" after spending a \"great deal of time this last week\" speaking with undergraduates in forums and smaller gatherings, Quinn wrote. Paxson's emails argued for the importance of free expression and protest, as long as they occur under \"acceptable means .\" But, Paxson wrote, the means by which protesters stopped <mark>Kelly</mark>'s lecture were unacceptable and a violation of the code of conduct students agree to before arriving on campus. Joutz said she hasn't read through the entire Code of Student Conduct and thinks most students have not read it either. \"I don't think administrators can disregard policy, though,\" she added. Disciplining protestors would be \"unfair,\" said Johanna Thompson-Westra' 14. After completing the initial review of events, the committee will see \"if any further follow-up is appropriate\" for those individuals who participated in the protest, Klawunn said. \"That decision will be made out of an examination of all of the circumstances,\" she said. There is no \"predetermined outcome\" for code violation, she added. If the University chooses to take disciplinary action, it \"shouldn't be super harsh,\" said Nicola Malakooti' 16. Diego Arene-Morley '16 said that while meeting <mark>Kelly</mark> with such force was not effective, neither is meeting students with force. \"I don't think that punishment is going to make us feel any better about the problems,\" he added. Brown International Socialist Organization: Power to the students!"}, {"articleID": "2011042822_00024284_W", "names": {"Gary Reynolds": ["Q5525821", "Q59563938"]}, "date": "2011-04-28", "url": "http://lineout.thestranger.com/lineout/archives/2011/04/28/suck-at-production-this-event-is-for-you-knucklehead", "content": "music listings in the film section: line out music & the city at night suck at production? this event is for you, knucklehead jason baxter on thu, apr 28, 2011 next saturday, may 7th, the recording academy and producers & engineers wing are hosting a \"studio summit\" at the emp. the day-long seminar includes panels (with guests like pete droge, matt bayles, jack endino, geoff ott, johnny sangster, <mark>gary reynolds</mark>, and vitamin d) and a \"demo review\" session featuring local audio wizards (who will probably find the kindest way possible to eviscerate your band's recording techniques and production aesthetic). the main course, if you will, is a keynote address by legendary producer ed cherney: \"ed is known for his work with a wide array of artists, among them iggy pop, bob seger, bette midler, bonnie raitt, wynonna, eric clapton, jann arden, jackson browne, keb' mo, bob dylan, and the rolling stones, to name just a few. a founding member of the music producers guild of america, cherney has also served as governor of the l.a. chapter of the recording academy, and was honored with the mix foundation tec award as engineer of the year .\" kenneth on april 28, 2011 at 1:15 pm to be specific: the \"demo review\" session. i would like to know the answer to my question, \"why would anyone care about the production of their demos from commercial music industry dudes .\" \"1:45 - 3:30 p.m. grammy u demo review session (learning labs) bring your track to this group of esteemed producers and artists including martin feveyear (jupiter studio), jonathan plum (london bridge), jeffrey mcnulty (vera) and artist ryan leyva (blake lewis) as they offer expert advice about how take your music production to the next level .\" what the hell is the \"next level\" ? is that a different way to say, \"make you're music commercially viable but still it's likely no one will care because it sounds boring and overdone anyway\" ? make your own aesthetic! who cares about that 100% panel of dudes!"}, {"articleID": "2010121520_00049798_W", "names": {"Dan Williams": ["Q16196768", "Q20643078", "Q25927228", "Q3013248", "Q42152193", "Q5214596", "Q5214598"], "Michael Riley": ["Q1616959", "Q6833864", "Q6833865"], "James Robbins": ["Q14945457", "Q3805136"], "John Rich": ["Q16225998", "Q3182358", "Q3456867", "Q6254722"]}, "date": "2010-12-15", "url": "http://citybeat.com/cincinnati/article-22315-art-damage-going-dark.html", "content": "wednesday, december 15,2010 art damage going dark in april of 1985, i got a phone call from <mark>dan williams</mark>, my collaborator in the group 11,000 switches. he said, \"man, turn the radio to waif, i'm doing a show .\" i found my radio speaking with a new voice. at its most challenging, it had previously palpitated with the soothing strains of o.t., wguc's echt-serious music of our time, new wave with <mark>michael riley</mark>, t-bone, greg doll, craig kelley and others on waif and free jazz on miles ingram's no more white gloves. but here was something that incorporated all of that yet added silly novelty numbers, progressive rock, zappa, homemade electronic music, no wave and industrial. soon i joined <mark>dan</mark> as his radio collaborator; greg fernandez also contributed through the summer until the fall when he moved to columbus and created on ohio state university's wosr. after <mark>dan</mark> left in 1987, i continued as sole host through 1990 when i was able to bring in chris lockhart, mark milano and iovae to provide relief in the long, late-night time slot. i have no idea how we were able to build a following at such an hour, but art damage thrived. the homemade tape cutup aspect of the show garnered a lot of interest; we began to receive pieces from listeners ranging from <mark>james robbins</mark> (now an editor at the washington times) to caf gallahad, then a college freshman whom today, as nebulagirl, serves as the queen bee around which much experimental media activity in cincinnati continues to buzz. as far as i know, it was the only radio show where you could hear president reagan talking about poisoned meat, elvis presley's \"jailhouse rock\" played backwards, ricardo montalban warning against marijuana use, cabaret voltaire and bob braun in the same 10-minute brace. i left art damage in 1991 and it continued on, ultimately adding and subtracting a long list of hosts including android and justin (the current hosts of waif's another music from a different kitchen), robert inhuman of realicide, chris roesing, scott hisey (of gordy horn), c. spencer yeh, keith larsen, jack ison, nebulagirl, steven french, miranda of liquid death/hello pussy records and gabe molnar, a leibniz scholar who now teaches in montreal. some tended to specialize and this meant that the glorious crash collision of conflicting genres that characterized earlier art damage shows was softened, but everyone involved had their particular spin, adding something positive to the dialogue. the art damage foundation, which supports and promotes live, local performances of experimental music, came into existence when waif suddenly cancelled art damage in the middle of its 19th year. (the show returned to waif in 2008. it airs midnight-2 a.m. monday nights .) \"part of the complaint was that art damage was not generating enough money during pledge drives,\" chris roesing recalls. \"so in january 2005 we organized a live benefit at the mockbee gallery that lasted three days. we offered the money to waif, but at the time they weren't interested. so we thought,\" what are we going to do with this money?' i was just finishing my mba at ccm in arts administration, so we incorporated the art damage foundation as a 501 (c) 3 non-profit. \"the art damage lodge was established in the fall of 2007 and has since provided a stable venue for the foundation's activities. but this friday and saturday's shows will be the last ones at the lodge, which is operated by wasteland jazz unit members jon lorenz and <mark>john rich</mark>.\" a new owner bought the building, \"<mark>rich</mark> says of the northside space .\" she wants to continue it as a concert venue and we don't really fit into those plans. \"the art damage foundation has largely built a reputation for featuring industrial noise music and they have forged relationships with established noisemeisters like michigan's wolf eyes. however, <mark>rich</mark> feels that this reputation limits perception of their efforts .\" jon and i have really grown to hate the \"noise' tag that has been applied to us,\" <mark>rich</mark> says. \"we have a lot of different offerings that don't fall into the noise mode .\" indeed, at the lodge i once saw conservatory trained cellist audrey chen play a set with her group kamama and discovered the awesome talent of eddy kwon, a ccm student who combines traditional chinese violin styles with a raga-like type of improvisation - experimental, but not \"noise .\" there are some things no one will miss about the lodge, mainly the four flights of stairs that lead up to the third floor and make the simple act of carrying an amplifier into the venue a major source of discomfort. the foundation will continue, but a new venue is still being sought. \"jon and i think it's important to stay in northside,\" says <mark>rich</mark>, \"as it is central to the arts in this town, but right now we're just running out of time .\" when i asked robert inhuman what his take on the art damage experience was, he replied, \"art damage radio really was my first exposure to experimental music on a local level. later, the art damage foundation further aided in establishing my own subcultural identity within punk media that desired to go against stereotypes and expectations in cincinnati .\" in some ways, art damage was what initially armed me and my friends for everything that would transpire in the following years with realicide, \"inhuman says .\" it has been very nice to see the lodge lasting over three years at a good location and i wish them the best in whatever comes next. \"art damage presents the last shows at northside's art damage lodge ("}, {"articleID": "2014040716_00066638_W", "names": {"David Mckay": ["Q1175601", "Q15500677", "Q46515282", "Q47541485", "Q5237382", "Q5237386", "Q55942880"]}, "date": "2014-04-07", "url": "http://www.fin24.com/Economy/Vavi-vows-to-unify-Cosatu-after-his-return-20140407", "content": "Not just in Earth Hour We should reduce artificial light throughout the year, says Mandi Smallhorne. We are not there yet Outdated technologies abound even as we are on the cusp of change, says Daniel Silke. We're currently experiencing serious technical problems on the site, and as a result are unable to update the news - even though our market data is running as per normal. We sincerely apologise for any inconvenience caused and hope to be up and running again this evening. Thank you for your patience in this regard. - <mark>David McKay</mark> (editor) & team Johannesburg - His eight months on suspension were wasted time, Cosatu general secretary Zwelinzima Vavi said on Monday. \"I've never been on leave for such a long period in my life,\" he told union members gathered outside Cosatu House in Johannesburg. \"It has been [a] long eight months of wasted time .\" Vavi returned to work at the Congress of SA Trade Unions' (Cosatu) headquarters on Monday morning. Food and Allied Workers' Union (Fawu) members surrounded Vavi, singing as he stepped out of his car outside the building. On Friday, the High Court in Johannesburg set aside Vavi's suspension. Judge Phineas Mojapelo ruled that it was invalid and that the Cosatu constitution had been breached because the decisions to suspend Vavi and investigate his conduct were not put to the vote at the central executive committee (CEC) meeting where they were made. \"A vote is prescribed as the manner in which decisions are to be taken...therefore no valid decisions were taken,\" Mojapelo found. Vavi was placed on special leave in August, pending the outcome of a disciplinary hearing relating to his affair with a junior employee. In July, the employee accused him of rape. He said they had an affair. The woman later withdrew a sexual harassment complaint against him. Decision challenged Following Vavi's suspension, the National Union of Metalworkers of SA (Numsa), an ally of his, lodged an application in the High Court in Johannesburg challenging the decision. Vavi then lodged papers to be added as an applicant in Numsa's challenge. Cosatu will discuss the judgment and the way forward at a special CEC meeting on Tuesday. Numsa's position in Cosatu is also expected to be on the agenda. Last week, Numsa wrote to Cosatu demanding that it convene a special national congress, and threatened to take the matter to court if it did not. On Monday, Vavi thanked union members for their warm welcome. \"Last week Friday was about defining the basic...rule of law...we [are] thankful we came out triumphant .\" Your power has brought me back to where you have elected me to be. \"Vavi said it was a difficult day because his daughter was being operated on after an accident last week in the Eastern Cape, but he was excited to be back at work. Wanting to unify Cosatu He said he was returning to Cosatu not with vengeance in mind, but to unify the trade union federation .\" I'm acutely aware of my responsibility to build the unity of the federation, \"Vavi said .\" I recognise an un-unified Cosatu is not in the best interest [of workers]. Our challenge here is to unify the federation, to unify progressive forces. \"He called on people to forget what he called the\" political shenanigans \"of the past .\" Forgive them, because they don't know what they do, \"Vavi said. Fawu members followed Vavi into the building and up to the ninth floor, which is the secretariat office. Vavi stood singing with union members in the foyer outside his office. 24. com publishes all comments posted on articles provided that they adhere to our AnswerIt Get your financial questions answered. RSS Feeds News delivered really simply. Calculators Easy-to-use personal finance tools. Newsletters You choose what you want. Blogs Your opinion on you, me and everyone. Data Products Get us in your home, on your television."}, {"articleID": "2017080813_00593504_W", "names": {"John Brown": ["Q10496369", "Q10558835", "Q1468968", "Q15407696", "Q16209507", "Q16841668", "Q19325232", "Q21077784", "Q21166054", "Q21460583", "Q25184207", "Q27831180", "Q28972089", "Q29464116", "Q3809112", "Q43393199", "Q43393927", "Q43911145", "Q46580905", "Q51879869", "Q53952917", "Q57779023", "Q57987458", "Q6223435", "Q6223436", "Q6223461", "Q6223482", "Q6223509", "Q6223512"]}, "date": "2017-08-08", "url": "http://www.afr.com/lifestyle/arts-and-entertainment/books/henry-david-thoreau-and-the-natural-rhythms-of-nature-20170717-gxcpph", "content": "Henry David Thoreau and the natural rhythms of nature Share Henry David Thoreau inspired Gandhi and Martin Luther King Jr in their own nonviolent activism. Supplied by Michael Sims is the masterpiece that the gadfly of youthful America deserves. I have been reading Henry David Thoreau and reading about him for 40 years; I've written a book about him myself. Yet often I responded to Laura Dassow Walls' compelling narrative with mutterings such as \"I never knew that\" and \"I hadn't thought of it that way\". I found myself caught up in these New England lives all over again. On a foundation of rigorous scholarship, Walls, a professor of English at Notre Dame, resurrects Thoreau's life with a novelist's sympathy and pacing. Most of her previous books are about either the American Transcendentalists or the explorer and naturalist Alexander von Humboldt, and her broad grasp of the era's scientific issues integrates Thoreau's dawning ecological conscience into a better-understood context than most writers on the topic can provide. Every biographer faces the challenge of portraying and deciphering a subject's parents--their history, their mythic resonance throughout the subject's life. Walls does both with aplomb. \"<mark>John</mark> Thoreau would be remembered as a quiet man,\" she writes of Henry's father, \"unambitious and too decent to press the hard bargains needed for success in the cash-poor early republic. But time and again, he met defeat by taking a forward leap, such as opening his own store, and when it failed, trying again in Maine .\" Walls builds up <mark>John</mark>'s character scene by scene, and when he dies, I felt deeply sad despite knowing this story well. Henry's mother, a huge influence on her son and a woman whom many friends and neighbours memorialised, comes alive in this biography. \"If few noticed <mark>John</mark>,\" Walls writes, \"everyone noticed the indomitable Cynthia, who stood a head taller than her husband and was one of the most famous talkers of the day, full of wit and anecdote spiced with sarcasm, and blessed with that brisk efficiency that New Englanders call\" faculty'. \"She remains a strong and witty presence throughout. This new biography Walden is a seminal work by Thoreau and a book that still impresses youthful America. Supplied View all announcements Both of Henry's smart and resourceful sisters, Helen and Sophia, influenced him--not least as informed and passionate abolitionists, encouraging his activism. But no person in his life affected him more than his handsome older brother, <mark>John</mark> Jr, whom he adored. Henry imitated him in hobbies, romance and even--after <mark>John</mark> died of tetanus in Henry's arms--in medical symptoms. <mark>John</mark>'s death resulted in Henry's breakdown, out of which he climbed with difficulty. Thoreau's era is fascinating for many reasons, including the Transcendentalist reassessments of religion and society during the 1840s, the bloody results of the Fugitive Slave Act of 1850, the war with Mexico between 1846 and 1848, and the start of the Civil War, which was still raging when Thoreau died in 1862. Far from hiding out in the woods, Thoreau was passionately involved in these issues. His now-famous night in jail was an orchestrated public protest; he supported the violent abolitionist <mark>John Brown</mark>. Decades later, both Gandhi and Martin Luther King Jr credited Thoreau's essay with helping inspire their own nonviolent activism. Civil Disobedience Walls is too well versed in Thoreau's life to accept his own often contradictory pronouncements or his semi-fictional first-person narrator as necessarily factual. She teases out nuances and implications, but without unfounded speculation. And often she sums up a trait with a sly image, such as the final clause of this sentence:\" Moving to Walden Pond thus had a double purpose: it offered a writer's retreat, where Thoreau could follow his calling as spiritual seeker, philosopher, and poet; and it offered a public stage on which he could dramatise his one-person revolution in consciousness, making his protest a form of performance art. \"Thoreau was preoccupied with natural rhythms: day and night, summer and winter, seed and harvest. He celebrated their parade and exploited their symbolism. In Walls' later pages, as Thoreau battles tuberculosis and slips toward death at the age of 44, she aptly employs his own imagery:\" As the days shortened and the leaves fell, a new Thoreau emerged: pensive and sadder, slower, deeper. \"As he fought to regain strength, fighting the grave, he turned to the most common activities and the most mundane needs with intentionality and deliberation. Walden had been his book of spring and summer. Now, willing his recovery, he was learning a mind of autumn. In these darkening and haunted pages of his Journal, Thoreau began to trace the outlines of Walden's sequel: he would call it Wild Fruits, and it would be his final harvest .\" Washington Post Henry David Thoreau: A Life, by Laura Dassow Walls, published by University of Chicago Press. Michael Sims' recent books include Arthur and Sherlock and The Adventures of Henry Thoreau. Washington Post Book World"}, {"articleID": "2012111501_00072203_W", "names": {"John Allen": ["Q1254163", "Q16020150", "Q16146490", "Q16197280", "Q16902080", "Q1699130", "Q18626469", "Q20086555", "Q28747989", "Q51585343", "Q5546881", "Q5546939", "Q55941536", "Q55949585", "Q615356", "Q6218727", "Q6218730", "Q6218735", "Q6218737", "Q6218744", "Q6218747", "Q6218751", "Q6251486", "Q6253741"], "John Baker": ["Q12633672", "Q15109473", "Q18379494", "Q26220645", "Q26220647", "Q28946020", "Q3180978", "Q42871706", "Q51585141", "Q55990560", "Q59155019", "Q59201610", "Q6007104", "Q6111119", "Q6220376", "Q6220386", "Q6220388", "Q6220400", "Q6220402"]}, "date": "2012-11-15", "url": "http://.tbo.com/news/breaking-news/2012/nov/14/3/obama-no-evidence-of-security-breach-in-petraeus-s-ar-564544/", "content": "responding warily to his administration's sudden sex scandal, president barack obama said wednesday he's seen no evidence that national security was damaged by the revelations that ended his cia director's career and imperil that of his afghan war commander. but the president said he is reserving judgment about how the fbi has handled the investigation that began in the summer but didn't reach his desk until after last week's election. \"i have a lot of confidence, generally, in the fbi,\" obama said, qualifying his words of support for the agency and its actions in the case. as obama spoke about the scandal from the white house, legislators on capitol hill were grilling fbi and cia officials privately about the same issues: whether national security was jeopardized by the case and why they didn't know about the investigation sooner. \"i have no evidence at this point, from what i've seen, that classified information was disclosed that in any way would have had a negative impact on our national security,\" obama said at his first postelection news conference. as for the fbi's handling of the matter, obama said: \"my expectation is that they follow the protocols that they've already established. one of the challenges here is that we're not supposed to meddle in criminal investigations, and that's been our practice .\" federal law enforcement officials have said the fbi didn't inform the white house and congress sooner about the original investigation because of rules set up after the watergate scandal to prevent interference in criminal investigations and that lawmakers weren't given notice of potential national security problems because the bureau had quickly resolved them. cia director david petraeus resigned friday, two days after the white house was notified that he'd acknowledged having an affair with his biographer, paula broadwell. the fbi's investigation of the matter began last summer when tampa, fla., socialite jill kelley turned over anonymous emails that had been sent to her and gen. <mark>john allen</mark>, the top u.s. commander in afghanistan. the first anonymous email was sent to <mark>allen</mark> in may, under the pseudonym \"kelleypatrol,\" and he forwarded it to kelley. that email warned <mark>allen</mark> to stay away from kelley, according to a person close to kelley who spoke on condition of anonymity because the investigation into the emails is ongoing. that same email - later traced to broadwell - said the writer knew about a future meeting <mark>allen</mark> and kelley had scheduled. <mark>allen</mark> thought the email was a joke or that it was possibly from kelley because he didn't know how anyone else would know about their planned meeting, the person close to kelley said. kelley was a friend of <mark>allen</mark> and petraeus, both of whom she had met in tampa when the men served there. one of the federal law enforcement officials confirmed wednesday that fbi agents were concerned that somebody was tracking the movements of <mark>allen</mark> and petraeus, raising the possibility of a national security breach. kelley's complaints about the threatening emails triggered the fbi investigation that led to the resignation of petraeus and the inquiry into her communications with <mark>allen</mark>. officials said broadwell apparently saw kelley as a rival for petraeus' affections. the official also said wednesday that broadwell sent emails to a couple of other senior military officials besides petraeus and <mark>allen</mark>. the official characterized the emails as an attempt to undermine kelley's reputation. the fbi found a substantial number of classified documents on broadwell's computer, and she has told agents that took classified documents out of secure government buildings, according to the official. on monday, the fbi also found classified documents in the search of broadwell's house in charlotte, n.c., the official said. broadwell had agreed to the search and had told agents in advance that there would be more of them there. a lawyer for <mark>allen</mark> released a statement promising the general would cooperate fully with the defense department inspector general's investigation. \"to the extent that there are questions about certain communications by general <mark>allen</mark>, he shares in the desire to resolve those questions as completely and quickly as possible,\" said col. <mark>john baker</mark>, chief defense counsel of the marine corps. <mark>allen</mark> has denied any wrongdoing. in early june, kelley herself received the first of as many as five emails sent from different anonymous accounts alleging that she was up to no good, the person close to kelley said. one of those mentioned petraeus by name. by the end of june or early july, kelley contacted an fbi agent in tampa she had met at least a year earlier, which began the agency's investigation of the matter. the new york times identified the agent as frederick w. humphries, 47, a veteran counterterrorism investigator in the tampa office. kelley met humphries when she attended the bureau's citizens' academy, an fbi program aimed at showing members of the public at least some of what the fbi does and how it works, the person close to kelley said. officials who have seen the communications between <mark>allen</mark> and kelley on wednesday described some of the emails as \"suggestive,\" and said their release would be embarrassing for the general. the officials spoke on condition of anonymity because they were not authorized to discuss the situation publicly. with broadwell and kelley suddenly in the center of the storm, small details suddenly became topics for discussion. word surfaced wednesday that kelley's pass to enter macdill air force base in florida had been indefinitely suspended, a decision made at the base level. pentagon spokesman lt. col. steven warren said kelley still can enter the base but must report to the visitor center and sign in like others without a pass. separately, a u.s. official said the army has suspended broadwell's security clearance. as a former army intelligence officer, she held a high security clearance. the official spoke on condition of anonymity because the source was not authorized to discuss the matter publicly. broadwell, who lives in charlotte, n.c., was spotted in washington at her brother's home late tuesday. her listing in her high school yearbook in bismarck, n.d., as \"most likely to be remembered\" took on new meaning. fbi director robert mueller and deputy director sean joyce met privately with legislators on both sides of the capitol on wednesday to explain how the investigation unfolded. they met first with senate intelligence committee chairwoman dianne feinstein, d-calif., and ranking republican saxby chambliss of georgia, then crossed the capitol to meet with the house intelligence committee. acting cia director michael morell went before the house panel next, after meeting a day earlier with top senate intelligence officials to explain the cia's take on events that led to petraeus' resignation. the questioning on capitol hill will continue on thursday. rep. dutch ruppersberger, the top democrat on the house intelligence committee, said a hearing scheduled for thursday to explore the government's handling of the attacks on the u.s. consulate in benghazi, libya, also would touch on the petraeus affair, covering how and why the fbi investigation was started. he said mueller, joyce and morell only began to answer those questions wednesday. \"how did you get the information, what's the basis for the investigation, who did you talk to, were you working with prosecutors, all those issues have to be looked at,\" including why the intelligence committees weren't told of the investigation until just before petraeus' resignation, he said. petraeus will testify friday before the house intelligence committee about libya, panel spokeswoman susan phalen said. lawmakers are also concerned over reports that broadwell had classified information on her laptop, though fbi investigators say they concluded there was no security breach. fbi agents who contacted petraeus told him that sensitive, possibly classified documents related to afghanistan were found on her computer, the general's associates said. he assured investigators they did not come from him, and he mused to his associates that they were probably given to her on her reporting trips to afghanistan by commanders she visited in the field there. one associate also said petraeus believes the documents described past operations and had already been declassified, although they might have still been marked \"secret .\" feinstein, asked by reporters if there was a national security breach with the petraeus affair, said she had \"no evidence that there was at this time .\" feinstein said that petraeus himself would testify before congress - but not about the affair. she said he had agreed to appear to talk about the libya attack on sept. 11 that killed the u.s. ambassador and three other americans, but she said no date had been set. <mark>allen</mark> has been allowed to stay in his job as commander of the afghan war, providing a leading voice in white house discussions on how many troops will remain in afghanistan - and for what purposes - after the u.s.-led combat operation ends in 2014. but obama has put on hold <mark>allen</mark>'s nomination to become the next commander of u.s. european command as well as the nato supreme allied commander in europe until pentagon investigators are able to sift through the 20,000-plus pages of documents and emails that involve <mark>allen</mark> and kelley. defense secretary leon panetta, at a news conference in perth, australia, said, \"no one should leap to any conclusions\" about <mark>allen</mark>, and said he is fully confident in <mark>allen</mark>'s ability to continue to lead in afghanistan. he added that putting a hold on <mark>allen</mark>'s european command nomination was the \"prudent\" thing to do."}, {"articleID": "2018070122_00193224_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Stephen Miller": ["Q11894443", "Q15707390", "Q27996060", "Q42884001", "Q7609994"]}, "date": "2018-07-01", "url": "https://www.elitedaily.com/p/selena-gomezs-comments-about-trumps-family-separation-policy-are-so-emotional-9644691", "content": "Matt Winkelmeyer/Getty Images Entertainment/Getty Images Selena Gomez's Comments About <mark>Trump</mark>'s Family Separation Policy Are So Emotional By Shelby Black 3 min ago On June 30, Selena Gomez attended the Hotel Transylvania 3: Summer Vacation premiere in Los Angeles, CA to promote her upcoming film. However, the night wasn't all fun and games for the movie star, because Selena Gomez's comments about <mark>Trump</mark>'s family separation policy proves that she hasn't forgotten about today's political issues. You go, Selena. During the movie premiere, Gomez revealed that <mark>Trump</mark>'s family separation policy has \"affected\" many people around her. \"It's extremely disheartening,\" Gomez said. \"There's a lot of confusion and anger. It's definitely been affecting so many people who are close to me .\" The recent crisis of separating immigrant children from their families at the border has resulted in the public organizing protests to fight against the <mark>Trump</mark> administration's \"zero tolerance\" immigration policy. Since these protests broke out, a number of celebrities, Gomez included, have spoken in favor of the fight to end this separation. On June 29, Gomez tweeted in support of the Keep Families Together Marches that took place on June 30. She wrote, Families seeking safety in our country need protection, understanding and opportunity, not detention. This is a moral choice, not a political one. I don't know about y' all, but there's seriously nothing I love more than celebrities speaking out on the issues. Following the complete backlash in response to <mark>Trump</mark>'s family separation policy, <mark>Donald Trump</mark> signed an executive order on June 20 that would stop this crisis. However, there's still a number of problems that need to be addressed even with the new order. On June 29, Attorney General Jeff Sessions announced that they plan to detain families together and hold them in detention centers indefinitely, or up until their immigration cases. To protest <mark>Trump</mark>'s family policy, individuals all over the nation gathered together on June 30 in honor of the Families Belong Together march. The Families Belong Together (FBT) Coalition, one of the key nonprofits who spearheaded this march, discussed on their website how this crisis is still not over even with the executive order signing. The coalition said, We're rallying in Washington, D.C., and around the country to tell <mark>Donald Trump</mark> and his administration to permanently end the separation of kids from their parents. End family internment camps. End the \"zero-humanity\" policy that created this crisis. And reunify the children with their parents. From Washington D.C. to Los Angeles, CA, people from all over the nation marched together to fight against <mark>Donald Trump</mark>'s separation policy. Even though this activism is coming from unfortunate circumstances, it's still so inspiring to see the passion these concerned individuals have for the injustices immigrant families are currently facing. Joe Raedle/Getty Images News/Getty Images Despite <mark>Trump</mark>'s claim that the executive order will \"keep families together,\" NBC News reported on June 27 that the Department of Homeland Security (DHS) is reportedly asking for more military space to house detainees. According to NBC News, DHS asked the the Department of Defense (DOD) for space that would care for a \"family population of up to 12,000 people .\" Also, nearly 2,000 of those families would require housing within 45 days. Elite Daily reached out to DHS for comment at the time, but did not hear back. Clearly this border crisis isn't going anywhere, but rest assured that activists and other concerned individuals will be fighting against the <mark>Trump</mark> administration in any way they can. Not everyone can take part in weekend marches to protest witnessed injustices, but that won't stop people from calling out <mark>Trump</mark> staffers wherever they can. On June 22, White House press secretary Sarah Huckabee Sanders was eating at Red Hen restaurant in Lexington, VA, but was asked by the owner, Stephanie Wilkinson, to leave the establishment. In fact, Sanders is just one of a few White House staffers that has been openly heckled while eating out in public, such as Department of Homeland Security Secretary Kirstjen Nielsen and <mark>Trump</mark> senior adviser <mark>Stephen Miller</mark>. I might not have been able to see this public outcry go down, but this is kind of what I imagine it to resemble. Giphy Whether it's during a protest march or at a movie premiere, it's so inspiring to see so many people standing up for these families. I hope the fight never stops."}]