[{"articleID": "2017062217_00363232_W", "names": {"Bill Walsh": ["Q15993626", "Q2903384", "Q4911274", "Q4911275", "Q4911277"]}, "date": "2017-06-22", "url": "http://m.nzherald.co.nz/fisher-funds/news/article.cfm?c_id=1503733&objectid=11880516", "content": "NZ Herald Share on Reddit reddit × I received an email from a colleague at 4.43 am last Friday and another in the early hours of Saturday morning. I used to respond to such emails telling him to get back to bed - albeit many hours later, so they weren't that effective. I am now less shocked at the time stamp on his correspondence as I know he's an insomniac and, despite adapting his lifestyle and at times willing himself to sleep, he invariably finds himself awake at horrible hours. The only upside? He gets a crazy amount of work completed while the rest of us are sleeping. Advertisement Advertise with NZME. We all know colleagues who work long hours - the guys and girls who are always at their computers so you never know if they've actually gone home. Are long hours a prerequisite for success? My insomniac friend is hugely productive and a standout performer but I'm not sure I can say that of all those in our industry who habitually work late into the night. Some work late because it's an industry norm and nobody wants to be the first to leave the office. The work-life balance debate recently featured in a Twitter exchange between technology investor Blake Robbins, who has worked for companies like Google and SpaceX, and venture capitalist Keith Rabois, a long-time investor and employee at successful start-ups PayPal and LinkedIn. Robbins tweeted: \"When I first got into tech, I thought it was\" cool' to work on the weekends or holidays. I quickly realised that's a recipe for disaster. Not hanging with friends and family because you're working isn't cool. Burning out isn't cool. \"I promise you...your competition isn't beating you because they are working more hours than you. It's because they're working smarter .\" Rabois quickly responded: \"Totally false. Read a bio of Elon Musk. Or about Amazon. Or about the first four years of Facebook or PayPal. It is pure arrogance to believe you can outsmart other talented people .\" Rabois is at the extreme end of the \"hard work camp'. In a Stanford University class on start-up companies, he posted a slide quoting NFL coach <mark>Bill Walsh</mark>:\" How to tell if you're doing the job: If you're up at 3am every night, have a knot in your stomach, a rash on your skin and you're losing touch with your wife and kids. \"Rabois concluded:\" If this doesn't sound appetising, you probably shouldn't start a company. \"At the other end of the debate are psychologists who point to the\" labour illusion'; it says people routinely confuse effort with results - to the point where effort is over-appreciated relative to the actual outcome. Psychology writer Oliver Burkeman says, contrary to the thinking that a jammed schedule equates to high productivity, it has been very well demonstrated that in certain fields - particularly those requiring creativity - less \"work\" can actually lead to more value. There is, I think, a middle ground. Work hard - harder than your competitors - but don't go crazy. Mathematician Richard Hamming once lectured on how people can do great work, \"Nobel-Prize type of work\". \"Given two people of approximately the same ability and one person who works 10 per cent more than the other, the latter will more than twice out-produce the former. The more you know, the more you learn; the more you learn, the more you can do; the more you can do, the more the opportunity .\" The logic applies to most aspects of our life."}, {"articleID": "2018012421_00577410_W", "names": {"Jim Hackett": ["Q13129314", "Q30030987"], "Mark Field": ["Q304450", "Q6767598"]}, "date": "2018-01-24", "url": "https://www.bloomberg.com/news/articles/2018-01-24/ford-stresses-fitness-after-failing-to-seize-on-strong-revenue", "content": "Ford Stresses \"Fitness' After Failing to Seize on Strong Revenue - Bloomberg Bloomberg the Company & Its Products Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. For Customers Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 MENU Ford Stresses\" Fitness' After Failing to Seize on Strong Revenue By Earnings underwhelm despite better-than-expected sales Overseas profits plunge on weak China demand, Brexit impact Ford Motor Co.. reemphasized the need to trim costs under its new CEO as rising revenue failed to translate into profit growth to help its sinking stock. Automotive revenue surged to $38.5 billion in the last three months of last year, about $1.8 billion better than analysts projected. But strong sales only managed to boost earnings to a level that disappointed investors when Ford reported preliminary results last week. The automaker has telegraphed trouble for this year, issuing a warning that profit will slip and prompting a sharp selloff that's cost Ford about $4.2 billion in market value. Chief Executive Officer <mark>Jim Hackett</mark> has earmarked $14 billion in cost cuts over five years and has said the company will drop some car models from its lineup to focus on more lucrative sport utility vehicles and pickups. \"We are intensely focused on improving the operational fitness of our business to deliver strong results while continuing to build toward our vision of the future,\" <mark>Hackett</mark> said Wednesday in a statement. This year, Ford has said it will face a $1.6 billion headwind from rising prices of steel, aluminum and other raw materials, as well as adverse exchange rates. On the strength of rising F-Series truck sales, Ford boosted quarterly revenue and market share in North America, yet pretax profit fell to $1.6 billion. Rising raw material and warranty costs dragged on earnings in the region--the company warned in October that an F-Series recall would cost about Overseas, Ford lost money in South America, while profit declined in Europe. The company barely broke even in Asia as both sales and prices fell in China. Wall Street Wary Wall Street has been wary of Ford. Its profit forecast for this year reneges on former CEO <mark>Mark Field</mark>'s promise that earnings would rebound after 2017. Instead, the automaker said the rising cost of raw materials and the expense of developing autonomous and electric cars will weigh on 2018 profits. \"It was a very challenging year,\" Bob Shanks, chief financial officer, told reporters Wednesday at Ford's headquarters in Dearborn, Michigan. \"It's very, very clear that we have to improve the fitness of the company .\" <mark>Hackett</mark>, who is preparing the company for an ambitious plan to roll out robot taxis and driverless delivery vehicles by 2021, warned last week that this will be a \"bad year .\" Ford shares have fallen about 8 percent since the company issued its profit warning on Jan. 16. Last year, the stock rose just 3 percent, while General Motors Co. jumped 18 percent and Tesla Inc. soared 46 percent. Fiat Chrysler Automobiles NV's U.S.-listed shares outperformed them all, nearly doubling during 2017. \"There's a lot of frustration,\" David Whiston, a Chicago-based auto analyst with Morningstar, said before Ford released earnings. \"People feel like it's not going to get better any time soon .\" Before it's here, it's on the Bloomberg Terminal."}, {"articleID": "2016082314_00204977_W", "names": {"Abhishek Gupta": ["Q27951640", "Q42287900", "Q53294409"]}, "date": "2016-08-23", "url": "http://www.businessinsider.in/Idea-rebuff-mergertalks-with-Vodafone/articleshow/53829543.cms#commentHash", "content": "Idea rebuff merger talks with Vodafone Reuters Aug 23, 2016, 07.25 PM Facebook Linkedin Twitter Google + Reddit Continue reading India's No. 3 mobile phone carrier, Idea Cellular, strongly denied a news report on Tuesday that it was in exploratory talks about a merger with larger rival Vodafone India. A spokeswoman for Idea's parent, conglomerate Aditya Birla, called the CNBC TV18 report of talks between Idea and Vodafone \"baseless and absolutely false\". \"This is absolutely untrue and preposterous,\" she said in an email. \"There is no such intent .\" Shares in Idea closed 6.9 percent higher on Tuesday after the TV channel said the two sides were in talks, citing unnamed sources. A spokesman for Vodafone India, India's No. 2 operator by market share and the local arm of Britain's Vodafone Group Plc, declined to comment on the report. India is the world's second-biggest mobile phone market by subscriptions, behind China, but high competition in the crowded market has kept profits under pressure. Adding to the competition, Reliance Jio - a telecom venture backed by India's richest man Mukesh Ambani - is set to launch commercial operations in the coming months. \"Both of them are struggling with their data revenue market share and ahead of a big competitive change in the industry they might want to get bigger,\" IDFC securities analyst <mark>Abhishek Gupta</mark> said of Idea and Vodafone India. Any such deal would also face tough regulatory scrutiny and analysts say approvals would be unlikely, as the companies would breach the 50 percent revenue market share limit in many regions of the country if they did try to merge. \"It's very unlikely,\" PhillipCapital (India) analyst Naveen Kulkarni said, citing the regulatory hurdles. \"I'm doubtful whether this can go through but there could be some other form of merger, such as spectrum-sharing deals,\" he added. Follow Business Insider on facebook Like twitter Follow gplus Follow More from this author Say hello to Uber's self-driving car Venezuela just crushed 2,000 guns in public, but t.. . Cisco plans to announce its biggest layoff in hist...Lowe's sinks after sales miss expectations China wants everyone to chill out about its worryi...Related Stories Aditya Birla Group is reaching new heights. Here i.. . Now Aditya Birla Group joins the Defence equipment...Reliance Jio Infocomm Signs Telecom Tower Sharing...Reliance Jio Signs Tower-sharing Deal With BSNL Reliance Jio Raises $1.5 Billion To Refinance Loans Amitabh Jaipuria quits Reliance Jio right before 4...Reliance Jio wants legal action against top telcos Now, Aditya Birla Group joins the bad world of e-c...More: Vodafone Group Plc Reliance Jio Naveen Kulkarni Idea Cellular Aditya Birla"}, {"articleID": "2017032115_00577726_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"], "Anthony Romero": ["Q1568107", "Q43151542"]}, "date": "2017-03-21", "url": "http://www.koaa.com/story/34963174/hanks-baldwin-headline-facebook-live-aclu-fundraiser", "content": "Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Hanks, Baldwin headline Facebook Live ACLU fundraiser - KOAA.com | Continuous News | Colorado Springs and Pueblo Member Center: Hanks, Baldwin headline Facebook Live ACLU fundraiser Posted: Updated: (Photo by Jordan Strauss/Invision/AP, File). FILE - In this Oct. 25, 2016, file photo, Tom Hanks arrives at a special screening of \"Inferno\" at the Directors Guild of America Theatre in Los Angeles. Hanks is among the celebrities set to appear during a.. . NEW YORK (AP) - Tom Hanks, Alec Baldwin and Tina Fey are among the stars set to appear on Facebook Live as part of a fundraiser for the American Civil Liberties Union. Jon Hamm, Amy Poehler, <mark>Tracy Morgan</mark> and others will also take part in \"Stand for Rights: A Benefit for the ACLU,\" which will stream on Facebook on March 31. The event will be broadcast from New York and hosted on the Facebook pages of Stand for Rights, Funny or Die and The Huffington Post. The ACLU has been active in the legal fight against President Donald Trump's travel bans. ACLU executive director <mark>Anthony Romero</mark> says the telethon will allow the group to \"fight even harder to defend the rights guaranteed by our Constitution .\" Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Search Local Businesses"}, {"articleID": "2012070914_00012358_W", "names": {"Keith Allan": ["Q18683957", "Q56855250", "Q6383969"], "Alan Ball": ["Q1752144", "Q21453405", "Q2830466"]}, "date": "2012-07-09", "url": "http://fangoria.com/index.php/home/all-news/1-latest-news/7373-toronto-come-see-the-million-dollar-monster-show", "content": "noted toronto artist, gallery curator and professional eccentric christian aldo will be unleashing his most extravagant exhibit/party ever with \"the million dollar monster show\" , an exhibition of modern art inspired by monsters of every persuasion! \"expect the unexpected,\" says aldo. \"imagine, the glorification of\" monster fabulous'. i want this show to immortalize and celebrate the beauty of monsters. \"over 35 celebrated, and up and coming toronto artists will be exhibiting their work-painting and sculpture-at the show in a space 3500 sq. ft with ceilings reaching over 30ft. monsters! pop art! counter culture! rock and roll! don't miss it?. fangoria is a proud sponsor of the million dollar monster show. the party and reception happens on saturday, july 28th from 8pm-2am at 99 sudbury street, toronto, on at aldo's latest gallery/project the super wonder gallery. other highlights to come at the facility this year, according to aldo, will include\" a string of sensationally themed group shows with wild subjects, ranging from science fiction to erotica to trailer trash culture \". 11/11/11, director <mark>keith allan</mark>'s newest film which opens nationally on november 1, makes its world debut a month early at the 2011 big bear horro-fi film festival? in big bear lake, california. 11/11/11 screens at the festival's opening night...\"> it's been reported that clayne crawford has landed a major role in <mark>alan ball</mark>'s all signs of death, the hbo drama pilot based on charlie (sleepless) huston's best-selling crime novel. the truth is out there, and i want to believe it: 30 days of night and the x-files are colliding in a new wildstorm comic .\" > far from home and away from the safety of their military base, a platoon of american soldiers will encounter a brutal story of violence and horror. hidden in the shadows, the dead have come back to life and they have a twisted appetite for flesh. so...\"> having just completed mother's day, word is starting to come in on what may be up next for repo! director darren lynn bousman, and if it's the absolutely ridiculous sounding 90, let's hope it happens soon. read on for more!\" > \"90\" kills in 90 minutes?! story details on bousman's next! julian gilbey's a lonely place to die is apparently all sorts of excellent and now, with nonstop love coming in, word has broke on his next film, offworld. them \"indoors\" , davis and shearsmith on agoraphobic serial killer short"}, {"articleID": "2011030401_00037197_W", "names": {"David Rosen": ["Q3018726", "Q3266354", "Q5239212", "Q5239213", "Q5239214"]}, "date": "2011-03-04", "url": "http://time.com/time/world/article/0,8599,2057120,00.html?xid=rss-world", "content": "tweet when pope benedict xvi writes that the jews are not responsible for the death of jesus, what's important is less the passage itself than the man who put it down on paper. by tackling the subject in a book to be published march 10, benedict, whose has struggled in his relations with the jewish community, doesn't so much state something new - the affirmation that the jewish people as a whole were not responsible for the crucifixion is an old one, uncontroversial in the modern catholic church - as lend the idea the ecclesiastical equivalent of a celebrity endorsement. \"the significance is in the author,\" says joseph sievers, professor of jewish history at the pontifical biblical institute in rome. \"he brings together an awareness of the issues in the text themselves with the history of how these texts have been interpreted through the last 2,000 years .\" indeed, the catholic church has considered the jewish people free from blame since at least 1965, when the second vatican council wrote that while \"the jewish authorities and those who followed their lead pressed for the death of christ; still, what happened in his passion cannot be charged against all the jews, without distinction, then alive, nor against the jews of today .\" the difference this time is that rather than being buried deep in a document of dense text, where it can easily be overlooked or ignored, the argument is being laid out by a man whose every word is pored over as an indication of church doctrine. \"most catholics don't read the church's documents,\" says rabbi <mark>david rosen</mark>, director of interreligious affairs at the new york-based american jewish committee. \"the book will certainly be far more widely read .\" benedict's last book, jesus of nazareth, was a best seller when it was published in 2007. the passage about the crucifixion will appear in its sequel, jesus of nazareth: holy week: from the entrance into jerusalem to the resurrection (see \"the trial of pope benedict xvi .\" ) in excerpts provided to the press this week, the pope walks the reader through the gospels to explore who jesus' accusers really were. noting that the gospel of john describes them as \"the jews,\" benedict explains that there's no way the writer meant the entire population of israel. after all, he notes, john himself was a jew, as was jesus and the rest of his followers. \"this expression has a precise and rigorously limited meaning,\" benedict concludes: \"the temple aristocracy .\" the gospel of mark expands the circle of accusers to \"the masses,\" which benedict explains were supporters of barabbas, the brigand chosen by the crowd to be released instead of jesus. \"in [the second vatican council's text], this was all said in one sentence, but here it's spelled out and worked out in great detail,\" says sievers. the pope pays special attention to a passage in the gospel of matthew which is often used to stir up anti-semitism. in that passage, pontius pilate, the roman prefect overseeing the crucifixion, washes his hands and declares himself to be innocent of the death of jesus: \"then the people as a whole answered,\" his blood be on us and on our children!' \"benedict argues that the phrase\" the people as a whole \"is ahistorical .\" how would it have been possible for the entire population to have been present at that moment to ask for the death of jesus? \"he writes. the blood of jesus, he adds, should not be seen as a call for revenge, but spilled in the name of reconciliation:\" not a curse, but redemption, salvation. \"should celebrities donate money they made off the gaddafi family? abdul hafif goga, a spokesman for rebels fighting libya's muammar gaddafi, on reports that the embattled leader has accepted a venezuelan plan to end the country's ongoing conflict"}, {"articleID": "2011080219_00028427_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Robert Greenblatt": ["Q28228969", "Q3491930"], "Ken Burns": ["Q1106967", "Q616886"], "Jackie Robinson": ["Q1631748", "Q3805723", "Q731871"]}, "date": "2011-08-02", "url": "http://mercurynews.com/entertainment/ci_18601706?source=rss", "content": "<mark>beverly hills</mark>--the stars and producers of \"the playboy club,\" a period drama coming to nbc this fall, spent much of their time at television's summer press tour trying to shoot down what they say are false assumptions about the show. no, it's not a \"mad men\" clone, even if it does have a dapper don draper look-alike (eddie cibrian) at the center of its cast. also, it's not too raunchy for prime time, even though a conservative watchdog group has unleashed its wrath upon it. and, no, a show full of scantily clad \"bunnies\" being ogled by wolfish men is not demeaning to women. in fact, it's empowering. at least that's what they say. really. \"the show is all about empowerment and who these women can be, and how they can use the club to be anyone they want,\" producer chad hodge told critics. cast member naturi naughton echoed that sentiment. \"(the female characters) are smart, they're going to school, they're buying property--things they couldn't do at the time. they're using their resources,\" she said. as for racy material, producer ian biederman says the show is \"mild compared to a lot of things that are on television .\" those comments aren't likely to assuage the parents television council, which insists the show \"glorifies and glamorizes (an) insidious industry .\" nor will they change minds at nbc's salt lake city affiliate, which has chosen not to air it. chicago, follows a high-powered lawyer (cibrian) who frequents hugh hefner's glitzy club and becomes involved with a new playboy bunny (amber heard). in addition to all the cotton tails and cleavage, they've tossed in an outlandish crime plot to spice things up. based on an early look at the pilot, \"the playboy club\" isn't excessively edgy. and it's not nearly as compelling as abc's \"pan am,\" the season's other retro drama. still, it's clearly the kind of show ghat gets people talking--the kind of show that struggling nbc needs, according to the network's new entertainment boss <mark>robert greenblatt</mark>. \"what it has going for it is a recognizable brand that's automatically going to draw attention to it, good or bad,\" he said. \"...it's the right kind of thing for us to try .\" as for those comparisons to \"mad men,\" <mark>greenblatt</mark> simply waves them off. \"i have great respect for\" mad men,' but apart from the setting and period being similar, i think (it's) much more of an energized soap opera. \"not running dry: come this fall, millions of pbs viewers will want to raise a glass to filmmaker <mark>ken burns</mark>' latest project: a three-part documentary,\" prohibition. \"it arrives oct. 2--just a week after the season 2 premiere of hbo's\" boardwalk empire, \"a drama series that deals with the same subject matter. what does <mark>burns</mark> think of that show? turns out he's a big fan .\" (hbo) has another huge hit on their hands in the mode of \"the sopranos,'\" he said. \"...americans always love to watch people who get to kill the people who (tick) them off and women who take their clothes off at the drop of a hat .\" as for his own work, <mark>burns</mark> said he has laid out a 10-year plan with films that include the history of the dust bowl; a look back at the infamous 1989 central park jogger assault and rape case; a 14-hour examination of the lives and legacies of theodore, franklin and eleanor roosevelt; a biography of <mark>jackie robinson</mark>; an extensive series on vietnam; the history of country music; and a biography of ernest hemingway. twitter lands $800 million venture capital deal, breaking record another san jose hero! boy, 9, saves 3-year-old girl from drowning"}, {"articleID": "2019012912_00200237_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Jack Phillips": ["Q21622368", "Q6114605"], "Daniel Lee": ["Q2215646", "Q41065588", "Q42313359", "Q43085242", "Q5217896", "Q706142", "Q9430586"], "Shen Yun": ["Q45457380", "Q45457386", "Q45555929", "Q45653546", "Q45696161"], "Robert Barnes": ["Q20751527", "Q21293016", "Q9310720"], "John Mccallum": ["Q3182037", "Q3182039", "Q41805358", "Q51874515"], "Jillian Michaels": ["Q2971799", "Q6193168"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Chris Ford": ["Q2733760", "Q5189144"]}, "date": "2019-01-29", "url": "https://www.theepochtimes.com/lawsuit-filed-against-california-county-fair-over-gun-show-ban_2779309.html", "content": "Guns for sale at a gun show on Nov. 24, 2018, in Naples, Fla. (Spencer Platt/Getty Images) Lawsuit Filed Against California County Fair Over Gun Show Ban By Zach Li January 29, 2019 Updated: January 29, 2019 Share LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON A Southern California county fair is being sued by the California Rifle & Pistol Association (CRPA) over its controversial ordinance prohibiting firearm vendors from continuing a gun show that has been held there for 30 years. The lawsuit, which was filed on Jan. 21, says that a gun show ban passed by the board members of Del Mar Fair in 2018 is unconstitutional and has violated the plaintiffs' Second Amendment rights and others. \"The 41-page complaint alleges that the Del Mar action has purposely violated the First Amendment free speech rights of the plaintiffs and constitutes a prior restraint on speech, along with the equal protection of the plaintiffs,\" said a written statement from the CRPA. Crossroads of the West, one of the plaintiffs, has held gun shows about five times a year at the fairground over the past 30 years, according to Fox 5. In September 2018, the 22nd District Agricultural Association, a nine-member board operating the Del Mar Fairgrounds on behalf of the state, decided to stop renewing the contract with the Crossroads of the West Gun Show for 2019. Lots of people at the Del Mar Fairgrounds Board of Directors meeting voicing support & opposition for the Crossroads of the West Gun Show. With so many speakers, board went straight to public comment. Next gun show here is May 19-20. Board isn't taking action on this today. pic.twitter.com/Sb3V6M2zC7--Matt Hoffman (@ MHoffmam) April 24, 2018 The board voted 8-1 to put the gun show on hold while the board develops a comprehensive policy, which includes converting the show to one that only serves educational and safety training purposes as well as enhancing its security plan, according to a statement the board released in September 2018. Board President Steve Shewmaker said at a meeting that he's concerned about safety issues after several arrests were made in the fairground as felony offenders sent \"their wives and girlfriends in to buy ammunition and guns\" at the gun show. More pics: https: //t.co/mLZVqybJ8w As the two-day Crossroads of the West Gun Show was going on inside the Del Mar Fairgrounds, about 80 supporters from NeverAgainCa protested the gun show from outside the fairgrounds. @ sdut @ sdutPhotography pic.twitter.com/ivjgnByIn0--Howard Lipin (@ hlipin) March 18, 2018 The new policy regarding the gun show is expected to be established by December 2019. However, the board's decision didn't convince everyone. \"It sounds like a nice,\" here is our olive branch,' but it's really nothing. It means we're going to do whatever we can to make sure you can't do your business model the way you normally operate, \"Tracy Olcott, president of Crossroads of the West, told Fox 5. Olcott also said the Crossroads shows typically brought the fairgrounds between $500,000 and $700,000 a year. Vendors display hunting rifles for sale at the Crossroads of the West Gun Show at the Pima County Fairgrounds on Jan. 15, 2011, in Tucson, Ariz. (Kevork Djansezian/Getty Images) The CRPA indicated in its statement that the ban is one of the campaigns aiming at annihilating gun shows at\" several state-owned fairgrounds \"across the state led by anti-gun activists who are trying to eliminate the\" gun culture. \"In 2018, then Gov. <mark>Jerry Brown</mark> vetoed a bill that would prohibit gun shows at the Cow Palace, which is a state-owned fairground at the Bay Area. Crossroads of the West is also the gun show organizer at the Cow Palace .\" In fact, the Fairground's own head of security noted that the gun shows are operating in full compliance with the law and that there are no safety concerns with the show, \"the statement reads .\" Nonetheless, the Del Mar Fair Board bowed to the political pressure of anti-gun activists and gave in to those Board members with a particularly strong bias against the tens of thousands of individuals who attend these shows. \"Share this article RECOMMENDED TOP VIDEOS Videos of the Day: US Acting Defense Secretary Meets NATO Secretary General in Pentagon 9hr By Epoch Newsroom Videos of the Day: Border Patrol Working to Stop Sickness at the Border 1d By Epoch Newsroom Videos of the Day: Pompeo Urges International Community to Financially Disconnect From Maduro Regime 2d By Epoch Newsroom US News November 8, 2018 What We Know About Ian David Long, California Bar Shooter By <mark>Jack Phillips</mark> Former U.S. Marine Ian David Long has been named as the suspect who shot and killed 12 people in a Southern California bar before turning the gun...Southern California November 28, 2018 Thousand Oaks Shooter\" Ambushed' First Officers on Scene, Say Police By Sarah Le, Epoch Times Officials have revealed new details to the public into the investigation of the Nov. 7 shooting at the Borderline Bar and Grill in Thousand Oaks, California that...US News January 22, 2019 Supreme Court to Hear Biggest Gun Rights Case Since 2010 By Reuters WASHINGTON--The Supreme Court took up its biggest gun rights case in nearly a decade on Jan. 22, agreeing to hear a challenge to New York City's strict...US News January 24, 2019 Supreme Court Green-lights NYC Gun Law Appeal By Matthew Vadum The Supreme Court has decided to take up a gun rights case for the first time in nine years, this time a challenge to New York City's...Southern California January 29, 2019 Insurance Claims From Deadly California Wildfires Top $11.4 Billion By The Associated Press SACRAMENTO, Calif.--Insurance claims from California's deadly November 2018 wildfires have topped $11.4 billion, making the series of fires some of the most expensive in state history, officials...Southern California January 26, 2019 California Election Watchdog Hopes to Set Up Town Hall With President Trump By Sarah Le, Epoch Times The Election Integrity Project California (EIPCa) hopes to set up a meeting with President Donald Trump to discuss safeguarding the integrity of the election process. \"We believe...US News January 25, 2019 US Returns Asylum Seekers to Mexico By Reuters TIJUANA/MEXICO CITY, Mexico--The United States was expected to send a first group of 20 Central American asylum seekers back to Mexico through the border city of Tijuana...US News January 25, 2019 California Couple and Dogs Rescued After Two-Week Mountain Ordeal By Tom Ozimek Members of the Special Enforcement Bureau tactical squad and sheriff's deputies rescued two California campers and their dogs, trapped by snow for two weeks in the mountains...Companies January 25, 2019 Suspicious Website Publishes False Press Release, Claiming to Be PG & E By Ilene Eng A suspicious website that imitates the official Pacific Gas and Electric Company (PG & E) site issued a false press release on January 23 and fooled several media outlets. The...Southern California January 24, 2019 Smart Home Device Falsely Alarmed California User, Saying Incoming North Korea Missile By Zach Li A Northern California resident was pranked by a hacker who manipulated her Nest camera into sending warnings that ballistic missiles were launched from North Korea and headed...Northern California January 24, 2019 New California State Movement Challenges Supreme Court Decision on Reynold v. Sims By Nathan Su More than a year after the New California state movement claimed its independence, it's become clear that the movement may have a real chance in challenging the...Southern California January 23, 2019 Man Arrested After Allegedly Stealing Money From Donation Box at Buddhist Temple By Zach Li A man linked to a theft at a Buddhist temple was taken into custody on Jan. 18, according to the Chino Hills Police Department. The suspect, 32-year-old <mark>Daniel Lee</mark>... Chinese Regime January 28, 2019 Undercover Phone Call Reveals Chinese Embassy Pressure to Cancel <mark>Shen Yun</mark> in Spain By Janita Kan A top-level official from the Chinese embassy in Spain admitted in a recent phone call that he made a personal visit to the general manager of the...China-US News January 28, 2019 US Charges Huawei and CFO With Iran Sanctions Violations, Stealing Trade Secrets By Cathy He, Epoch Times The U.S. Department of Justice (DOJ) unsealed two indictments against China's Huawei Technologies Co., its chief financial officer (CFO), Meng Wanzhou, and several of the company's subsidiaries, in a...US News January 28, 2019 Lawyer Names Those to Be Sued for Comments About Covington Students By Petr Svab Lawyer <mark>Robert Barnes</mark> named several celebrities and media personalities he intends to sue for libel against some students of the Covington Catholic High School, whom he represents ....US News January 28, 2019 President Trump to Give State of the Union Address on Feb 5 By <mark>Jack Phillips</mark> President Donald Trump has said he will be giving the State of the Union address on Feb. 5, according to an announcement from the White House following...Politics January 28, 2019 New California State Movement Sends Letter to Trump By Ilene Eng ROSEVILLE, California--The New California State movement held its third Constitutional event at Veterans Memorial Hall in Roseville, California, on Jan. 26. The self-governed legislature is a statewide grassroots...US News January 28, 2019 US Sanctions Put Chinese Chipmaker on the Brink of Shutdown By Emel Akan WASHINGTON--U.S. sanctions on Chinese firms that steal U.S. technology are yielding results. State-owned chipmaker Fujian Jinhua is reportedly poised to cease operations as a result of Washington's...US News January 28, 2019 US Hits Venezuela State-Owned Oil Company With Sanctions By The Associated Press WASHINGTON--The Trump administration imposed sanctions Monday on the state-owned oil company of Venezuela, a potentially critical economic move aimed at increasing pressure on President Nicolas...Americas January 28, 2019 Israel, Australia Join Growing List of Countries Recognizing Venezuela's Opposition Leader By Bowen Xiao and Luke Taylor CUCUTA, Colombia--Israel and Australia on Jan. 27 joined a growing list of countries pledging their support for Juan Guaidó, Venezuela's opposition leader. At the same time, socialist dictator Nicolas...Trump Presidency January 28, 2019 House Democrats Likely to Go Too Far in Investigating Trump, Poll Indicates By Petr Svab Americans tend to think that Democratic legislators in the House of Representatives will go too far in investigating President Donald Trump, according to a Washington Post-ABC News poll ....Canada January 28, 2019 The Man Behind <mark>McCallum</mark>'s Controversial Press Conference That Led to His Removal as Canada's Ambassador to China By Limin Zhou and Omid Ghoreishi News Analysis TORONTO/OTTAWA--For <mark>John McCallum</mark>, Canada's former ambassador to China and self-proclaimed\" son-in-law of China, \"the fiasco that culminated in his resignation started with a now-infamous press...US News January 28, 2019 Extreme Wind Chills Expected in Chicago, Midwest as\" Polar Vortex' Moves In By <mark>Jack Phillips</mark> A so-called \"polar vortex\" is slated to descend on the United States, potentially impacting the Midwest. Some weather forecasters are saying it could minus 45 to minus...US News January 28, 2019 Trump Donates $100,000 From Salary to Fight Alcoholism By Zachary Stieber President Donald Trump donated his entire salary from the third quarter of 2018 to fight alcoholism. The $100,000 went to the National Institute on Alcohol Abuse and...Better Life January 28, 2019 9 Organic DIY Shampoos for Healthy Hair and Prevent Hair Loss--#2 Is Jennifer Aniston's Favorite Hair Product By Ruby Mey If you are experiencing hair loss, hair thinning, or brittle hair, one way to improve the condition of your hair is to avoid harmful shampoo chemicals like...Fitness & Nutrition January 27, 2019 6 Keys to Living Longer, According to Fitness Guru <mark>Jillian Michaels</mark> By Cathy Cassata, Healthline At 44 years old, renowned fitness and nutrition expert <mark>Jillian Michaels</mark> defines aging gracefully. To some, she even makes the process look easy. In fact, she took...Performing Arts January 28, 2019 <mark>Shen Yun</mark> Principal Dancer Kaidi Wu's Ethereal Grace By Irene Luo, Epoch Times In a bustling restaurant of excited chatter and shouting toddlers, Kaidi Wu is the opposite of her surroundings. Her voice is like a spring breeze--gentle and slow,...Arts & Culture January 25, 2019 The Tale of President Lincoln's Act of Compassion Toward a Wounded Soldier Before He Died By Li Yen, Epoch Times The Civil War broke out shortly after President Abraham Lincoln become the United States' 16th president. The following heart-rending tale, retold and circulated in books and on...Entertainment News January 28, 2019 <mark>Michael Jackson</mark>'s Family Speaks Out After \"Leaving Neverland' Documentary Alleges Sex Abuse By Colin Fredericson The family of <mark>Michael Jackson</mark> have issued a statement in response to sexual abuse allegations in the documentary\" Leaving Neverland \"after it screened at the Sundance Film Festival ....Entertainment News January 28, 2019 Essay Published by Top Chef's Fatima Ali Days After Her Death By <mark>Jack Phillips</mark> An essay penned by\" Top Chef \"contestant Fatima Ali, who died of cancer last week, was released following her death, detailing her attitude in the face of...Foodstuffs January 28, 2019 Make an Intense and Buttery Molten Chocolate Cake at Home By The Associated Press Fallen chocolate cake, or molten chocolate cake, is an undercooked-in-the-center mound of intense, buttery chocolate cake. We wanted to turn this restaurant-menu standard into a practical recipe...Better Life January 26, 2019 10 Drinks That Can Help Shed Some Weight While You Sleep--#1 Is a Surprisingly Potent Belly Fat Burner By GQ Pan For many people, losing weight is a daunting challenge to take on. If exercising and changing your diet seem like a tall order, you may want to...Travel January 28, 2019 A Visit to Phnom Penh's Vibrant Night Market By <mark>John</mark> M. Smith While we were docked in Phnom Penh on our Viking River Cruise, my wife and I decided to check out the Cambodian capital's famous Night Market. After...Travel News January 27, 2019 Tribal Land Known for Waterfalls Won't Allow Tour Guides By The Associated Press FLAGSTAFF, Ariz.--The thousands of tourists who travel to a remote Native American reservation deep in the Grand Canyon each year to camp near a series of picturesque,...Life January 26, 2019\" Coolest Day Ever:' Deaf Baby Hears Mom and Dad for the First Time in Life By <mark>Chris Ford</mark> A world of silence is something hard for most of us to comprehend, and the delight of these parents and their deaf baby is palpable when you...Life January 26, 2019 Grandpa Shunned By Family, but a 4-Year-Old Makes Parents Regret Their Actions By Li Yen, Epoch Times Words of Wisdom aims to highlight important morals, which we feel our readers will benefit from reading. We hope you enjoy this fable. \"How one generation loves,...TOP NEWS Undercover Phone Call Reveals Chinese Embassy Pressure to Cancel <mark>Shen Yun</mark> in Spain 9hr By Janita Kan US Charges Huawei and CFO With Iran Sanctions Violations, Stealing Trade Secrets 12hr By Cathy He, Epoch Times Lawyer Names Those to Be Sued for Comments About Covington Students 12hr By Petr Svab President Trump to Give State of the Union Address on Feb 5 12hr By <mark>Jack Phillips</mark> New California State Movement Sends Letter to Trump 12hr By Ilene Eng US Sanctions Put Chinese Chipmaker on the Brink of Shutdown 12hr By Emel Akan US Hits Venezuela State-Owned Oil Company With Sanctions 13hr By The Associated Press Israel, Australia Join Growing List of Countries Recognizing Venezuela's Opposition Leader 13hr By Bowen Xiao and Luke Taylor House Democrats Likely to Go Too Far in Investigating Trump, Poll Indicates 14hr By Petr Svab The Man Behind <mark>McCallum</mark>'s Controversial Press Conference That Led to His Removal as Canada's Ambassador to China 16hr By Limin Zhou and Omid Ghoreishi"}, {"articleID": "2019071820_00107127_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2019-07-18", "url": "http://feeds.latimes.com/~r/OpinionLa/~3/xkyDDrADNHs/senate-democrats-consider-killing-filibuster", "content": "Sen. Dick Durbin (D-Ill .), the chamber's second-ranking Democrat, told the Hill that he is \"reflecting\" on whether to end the filibuster on bills if the 2020 elections give his party control of the Senate. (Jim Lo Scalzo / EPA) By Jon Healey Deputy Editorial Page Editor July 18, 2019 12:02 PM Facebook Twitter Show more sharing options Share Close extra sharing options Facebook Twitter LinkedIn Copy Link URL Copied! Print \"Severe memory lapse\" must be one of the (many) debilitating side effects that can result from being elected to Congress. I can't think of any other way to explain why Senate Democratic leaders told the Hill that they won't rule out killing the last vestiges of the filibuster if they retake control of the chamber in 2020. Less than six years ago, Democrats led by former Senate Majority Leader <mark>Harry Reid</mark> (D-Nev .) ended the filibuster on presidential nominees for the executive branch and most federal courts. It was an act born of frustration--the Republican minority had resolutely blocked votes on all three of President Obama's nominees to the Court of Appeals for the District of Columbia Circuit. But in doing so, <mark>Reid</mark> laid the path for Republicans to eliminate the filibuster on Supreme Court nominees after they retook the Senate and President Trump nominated his first justice. That's why Neil M. Gorsuch and Brett M. Kavanaugh are on the high court, despite attracting the support of bare majorities of the Senate. And why Trump has been able to flood the courts with his nominees, a number of whom have been rated unqualified by the American Bar Assn. Notably, <mark>Reid</mark> made no move to kill the filibuster on legislation, which means that bills routinely require 60 votes to come up for debate on the floor, then 60 votes to go to a vote. His successor as majority leader, Republican Mitch McConnell of Kentucky, has similarly resisted the push from partisans to end the legislative filibuster, despite pressure from Trump just to steamroll Democrats and enact his agenda. Advertisement Now, top Senate Democrats are signaling a willingness to bar filibusters on bills too, should they reclaim the majority. According to the Hill, both Senate Minority Leader Charles E. Schumer (D-N.Y.) and Minority Whip Dick Durbin (D-Ill .) said the idea was on the table, which marks a considerable shift for Durbin. When asked why, Durbin told the newspaper that the status quo in the Senate was no longer acceptable: \"This is a different Senate. It is unproductive under the current state of affairs .\" The best arguments for killing the filibuster are that it's undemocratic and that it has been transformed from a rarely used tool to force compromises into a quotidien implement of obstruction. Both of those points are valid, yet the Senate is undemocratic and inefficient by design. Less populous states hold disproportionate power, given that the four senators from Idaho and Wyoming have as many votes as the four from California and New York. The Founders' intent was for the House to channel the passions of the electorate and for the Senate to cool them through a more deliberate process. The salutory effect of the filibuster is that it promotes legislation that has at least some bipartisan buy-in. Without that, you end up with embattled initiatives like the Affordable Care Act, which Republicans feel free to undermine because none of them voted for it. Durbin is right, though, that the gridlocked status quo in Washington cries out for change. For more than a decade, Congress has been unable to get anything done on the biggest issues of the day. The only exceptions have come when power was concentrated in one party's hands and the issue could be addressed through a budget bill not subject to the filibuster. The result: inaction on problems like our failed immigration policies, and purely partisan and often unsustainable actions on issues like healthcare and tax rates. Advertisement The fundamental problem here is that members have little interest in compromising or not enough incentive to do so. This is one of the bitter fruits of partisan gerrymandering that the Supreme Court ignored. When the only real threat to your reelection is drawing a primary challenge from someone more deeply partisan than you are, you don't have much reason to work with the other side on solutions that neither side loves but both sides can live with. Killing the filibuster won't fix that. Instead, it will simply make federal law and policy more volatile, with statutes and regulations being whipsawed by each change in control of Congress. Granted, it makes little sense to allow two filibusters on every piece of legislation, as is the case today; ideally, senators would eliminate the filibuster on the motion to begin debate on a bill while preserving the option to filibuster the motion to end it. But then, any more to restrict legislative filibusters would probably hasten the end to all of them. Lawmakers seem to be moving in only one direction on the filibuster, and it's not the right one."}, {"articleID": "2009061315_00055188_W", "names": {"Al Green": ["Q14469655", "Q313260", "Q4703915", "Q749039"], "David Byrne": ["Q1173887", "Q16151648", "Q21466735", "Q22000528", "Q28232492", "Q336640", "Q43128176", "Q5231984", "Q5231985", "Q5231986", "Q53098115"]}, "date": "2009-06-13", "url": "http://billboard.com/bbcom/news/bonnaroo-heats-up-with-phish-beastie-boys-1003984215.story", "content": "troy carpenter and jeff vrabel, manchester, tenn. day 2 at bonnaroo: the rain held off but the heat didn't, animal collective and phoenix made fans believe the hype, public enemy had them arguing otherwise, the beastie boys brought out a fellow new york mc to debut a new track and an energized phish ended their night with \"a day in the life .\" phish held down their responsibilities as ringleader of the main stage on friday night. the two-day headliners (including sunday's festival-closing set) came through with a set full of crowd-pleasers, a little something for everyone but nothing outrageously mind-blowing all told. five years on from \"farewell festival\" coventry, phish seemed back at home in front of the immense crowd, playing a good deal of the classic phish canon including \"harry hood,\" \"wilson,\" \"you enjoy myself,\" \"divided sky\" and \"chalkdust torture\" roller-coaster improvisational work highlighted \"kill devil falls,\" while the band's playful nature was best represented by a trio of covers: ac/dc's \"highway to hell,\" \"also sprach zarathusra\" (\"2001\" ), and an encore performance of the beatles' \"a day in the life .\" phish put on what for most bands would be a powerhouse headlining performance, but it was clear restraint was a factor as well; some surprises surely were held back for sunday night. nonetheless, friday ended on a celebratory note: phish is back, they're not the only exciting band on display, and bonnaroo 2009 is off to an impressive start. friday at bonnaroo broke about as gorgeously as could be expected following thursday night's one-day monsoon season, and stayed that way throughout; by day's end the previous evening's vast, flip-flop-abducting mud puddles were taking on that nice baked-mud smell, which, incidentally, is not a complaint. this was good news, as there was much to get to, starting with gomez, who eased things open with a solid, sprawling which stage performance featuring a lovely, breezy \"see the world\" singalong and a groovy trip through \"airstream driver .\" the main what stage opened for business on friday, hosting the rev. <mark>al green</mark>, who shimmered throughout his soul-drenched set of love standards like \"let's stay together\" and \"here i am,\" despite being forced to more or less catapult red roses to fans across the security barrier. the beastie boys provided an early highlight, bringing out fellow new york rapper nas to debut a new track from the band's upcoming \"hot sauce committee\" record, possibly titled \"too many rappers .\" the more often you blog, the more likely you were to be found at the which stage, which hosted skewed-pop outfit animal collective, who played to a massive afternoon crowd, the yeah yeah yeahs (performing in a brutal afternoon sun), tv on the radio and <mark>david byrne</mark>. <mark>byrne</mark> closed out the which stage with a two-hour performance ranging from recent material to a handful of talking heads classics, including a memorable trio from \"remain in light\" : \"born under punches,\" \"crosseyed & painless,\" and \"once in a lifetime,\" the latter interpreted into movement by <mark>byrne</mark>'s energetic dancers. vermont-based roots-rock outfit grace potter and the nocturnals brought its new six-piece incarnation to bonnaroo; potter's voice, especially on tracks like \"joey,' keeps getting better with age (not hard, as she's all of 25). drive-by trucker frontman patterson hood debuted his band the screwtopians and performed a set from his sophomore solo disc,\" murdering oscar (and other love songs), \"due later this month. but others stuck to the past: while phish was staging its bonnaroo comeback, public enemy was revisiting its storied past in the this tent, performing its 1988 classic\" it takes a nation of milllions to hold us back \"to a tent of thousands. the late late shows saw mashup wizard girl talk in that tent and paul oakenfold in this tent, sending regular bursts of bass across the festival grounds. early in the day, organizers reported a crowd of about 75,000 expected at the festival, which they said was\" just shy \"of a sellout. saturday brings jimmy buffett, performing with ilo ferreira, wilco, the decemberists, elvis costello, nine inch nails and a headlining slot by bruce springsteen and the e street band. here is phish's friday night setlist:\" chalkdust torture \"\"stealing time from the faulty plan\" \"the divided sky\" \"possum\" \"down with disease\" \"alaska\" \"stash\" \"golgi apparatus\" \"wolfman's brother\" \"poor heart\" \"kill devil falls> free\" \"wading in the velvet sea\" \"harry hood\" \"highway to hell> 2001\" \"you enjoy myself> wilson\" e: \"a day in the life\" troy carpenter and jeff vrabel, manchester, tenn. day 2 at bonnaroo: the rain held off but the heat didn't, animal collective and phoenix made fans believe the hype, public enemy had them arguing otherwise, the beastie boys brought out a fellow new york mc to debut a new track and an energized phish ended their night with \"a day in the life .\" phish held down their responsibilities as ringleader of the main stage on friday night. the two-day headliners (including sunday's festival-closing set) came through with a set full of crowd-pleasers, a little something for everyone but nothing outrageously mind-blowing all told. five years on from \"farewell festival\" coventry, phish seemed back at home in front of the immense crowd, playing a good deal of the classic phish canon including \"harry hood,\" \"wilson,\" \"you enjoy myself,\" \"divided sky\" and \"chalkdust torture\" roller-coaster improvisational work highlighted \"kill devil falls,\" while the band's playful nature was best represented by a trio of covers: ac/dc's \"highway to hell,\" \"also sprach zarathusra\" (\"2001\" ), and an encore performance of the beatles' \"a day in the life .\" phish put on what for most bands would be a powerhouse headlining performance, but it was clear restraint was a factor as well; some surprises surely were held back for sunday night. nonetheless, friday ended on a celebratory note: phish is back, they're not the only exciting band on display, and bonnaroo 2009 is off to an impressive start. friday at bonnaroo broke about as gorgeously as could be expected following thursday night's one-day monsoon season, and stayed that way throughout; by day's end the previous evening's vast, flip-flop-abducting mud puddles were taking on that nice baked-mud smell, which, incidentally, is not a complaint. this was good news, as there was much to get to, starting with gomez, who eased things open with a solid, sprawling which stage performance featuring a lovely, breezy \"see the world\" singalong and a groovy trip through \"airstream driver .\" the main what stage opened for business on friday, hosting the rev. <mark>al green</mark>, who shimmered throughout his soul-drenched set of love standards like \"let's stay together\" and \"here i am,\" despite being forced to more or less catapult red roses to fans across the security barrier. the beastie boys provided an early highlight, bringing out fellow new york rapper nas to debut a new track from the band's upcoming \"hot sauce committee\" record, possibly titled \"too many rappers .\" the more often you blog, the more likely you were to be found at the which stage, which hosted skewed-pop outfit animal collective, who played to a massive afternoon crowd, the yeah yeah yeahs (performing in a brutal afternoon sun), tv on the radio and <mark>david byrne</mark>. <mark>byrne</mark> closed out the which stage with a two-hour performance ranging from recent material to a handful of talking heads classics, including a memorable trio from \"remain in light\" : \"born under punches,\" \"crosseyed & painless,\" and \"once in a lifetime,\" the latter interpreted into movement by <mark>byrne</mark>'s energetic dancers. vermont-based roots-rock outfit grace potter and the nocturnals brought its new six-piece incarnation to bonnaroo; potter's voice, especially on tracks like \"joey,' keeps getting better with age (not hard, as she's all of 25). drive-by trucker frontman patterson hood debuted his band the screwtopians and performed a set from his sophomore solo disc,\" murdering oscar (and other love songs), \"due later this month. but others stuck to the past: while phish was staging its bonnaroo comeback, public enemy was revisiting its storied past in the this tent, performing its 1988 classic\" it takes a nation of milllions to hold us back \"to a tent of thousands. the late late shows saw mashup wizard girl talk in that tent and paul oakenfold in this tent, sending regular bursts of bass across the festival grounds. early in the day, organizers reported a crowd of about 75,000 expected at the festival, which they said was\" just shy \"of a sellout. saturday brings jimmy buffett, performing with ilo ferreira, wilco, the decemberists, elvis costello, nine inch nails and a headlining slot by bruce springsteen and the e street band. here is phish's friday night setlist:\" chalkdust torture \"\"stealing time from the faulty plan\" \"the divided sky\" \"possum\" \"down with disease\" \"alaska\" \"stash\" \"golgi apparatus\" \"wolfman's brother\" \"poor heart\" \"kill devil falls> free\" \"wading in the velvet sea\" \"harry hood\" \"highway to hell>"}]