[{"articleID": "2015031715_00059534_W", "names": {"Olli Heinonen": ["Q11885409", "Q16298772", "Q7088295"]}, "date": "2015-03-17", "url": "http://nationalinterest.org/node/12433", "content": "It's true: Israeli Prime Minister Benjamin Netanyahu stood before Congress and cast a critical lens on the Iranian nuclear deal being cooked up in Washington. Yet, despite President Obama's assertion that \"there was nothing new\" in the speech and that \"the prime minister didn't offer any viable alternatives,\" the Israeli leader actually did propose some reasonable options that bear consideration. The first is making the \"sunset clause\" conditional upon Iranian behavior, not an arbitrary timetable. The current terms under discussion call for a deal that would expire in around 10 years, at which point Iran would be allowed to operate an unlimited number of centrifuges, of unlimited sophistication, to enrich an unlimited amount of uranium. The narrow focus on Iran's nuclear program in the current grand bargain misses the reality that this issue is but the latest bone of contention between Iran and the West. Without nuclear weapons, Iran is still the foremost sponsor of international terrorism with terrorist networks active on five continents. With its recent expansion through terrorist proxies, Tehran now controls four Arab capitals in Lebanon, Syria, Iraq, and Yemen. Without a definitive change in the regime's behavior, other Arab states won't wait around until the deal expires to acquire their own nuclear capabilities. The Middle East nuclear arms race would begin in earnest immediately. Therefore, any sunset provision should be behavior-based, not time-based. The Israeli leader also raised the issue of verifying Iran's compliance with a deal. This is especially important given that Iran's past nuclear efforts have largely been clandestine or undeclared. The International Atomic Energy Agency (IAEA) can only report-not prevent or punish-violations of the agreement. And that's only if the nuclear watchdog knows the full breadth of Iran's nuclear program and has unfettered access to any site it chooses. Just this month the IAEA, declared - not for the first time-that Iran was being dilatory in its cooperation with the agency. What about violations? If the central point of an agreement is deterrence, then the penalties need to be agreed upon upfront, not debated as they occur, or worse, debated if they even happened depending on how one reads the deal. Another point Netanyahu raised was the size and scope of the nuclear infrastructure Iran would be permitted to keep. The current discussions would allow for Iran to operate around 6,500 centrifuges, but according to the IAEA former deputy director-general, <mark>Olli Heinonen</mark>, that number goes well beyond what is needed for civilian applications. This issue involves a combination of the number and quality of the centrifuges, their output, and the percentage of enrichment allowed. Finding the right number gets to the heart of the agreement as the only argument in favor of the deal that holds any water is that it would keep Iran at least one year away from being able to breakout toward nuclear weaponization-at least during the period of the agreement. That leads to another problem, which is that American and Israeli intelligence assessments differ over how fast Iran would be able to race toward a nuclear weapon. Netanyahu described the discrepancy as \"about a year by U.S. assessment, even shorter by Israel's.\" The difference is key because according to U.S. officials, the deal is designed to allow Iran to become a nuclear threshold state, just a year away from making the plunge if it decided to break off the agreement. As Robert Satloff, Executive Director of The Washington Institute for Near East Policy pointed out, it is questionable whether U.S. analysts can know with certainty if Iran's breakout capability is really one year. Indeed, given the aspects of the program not covered by the agreement, it is unlikely that a year of warning time would remain after three, five, or ten years of the deal. To allay the concerns of critics, the White House might offer Israel a \"nuclear guarantee\" as former American envoy to Israel, Martin suggested. But such an offer is undercut by the perception that the U.S. is retreating from the region, doesn't honor its international commitments, and does not enforce its own red lines such as those drawn in Syria. And why would Israel put its survival in American hands, especially with an administration that has proven so publicly hostile toward the Jewish state? America's word is not what it used to be. The Making of Future American Grand Strategy Unlocking the Puzzle of China's Neutron Bomb Securing Operational Access: Evolving the Air-Sea Battle Concept"}, {"articleID": "2012050400_00021277_W", "names": {"Jennifer Holland": ["Q3177067", "Q6486469"]}, "date": "2012-05-04", "url": "http://cbs19.tv/story/18126302/students-educators-concerned-over-possible-federal-loan-interest-rate-hikes", "content": "meta itemprop = \"datepublished\" content = \"2012-05-03 13:42:23\" > what's trending: tanning mom pleads not guilty; target axes the kindle what's trending: tanning mom pleads not guilty; target axes the kindle (cbs/cnn) - a mom is in trouble for allegedly letting her six year-old daughter go to a tanning salon. patricia krinchull from new jersey pleaded not guilty to a child endangerment charge. state laws a mom is in trouble for allegedly letting her six year-old daughter go to a tanning salon. also trending, it's still unclear as to why, but the kindle won't be gracing target shelves anymore. meta itemprop = \"datepublished\" content = \"2012-05-02 13:10:39\" > web exclusive: attack hawks no laughing matter in one neighborhood web exclusive: attack hawks no laughing matter in one neighborhood (cnn) - an ohio man faces a challenge when he goes out in his yard, attack hawks, perched in a nest in his front yard. he says it's no laughing matter. \"well, i'm cutting the grass over there on the an ohio man faces a challenge when he goes out in his yard, attack hawks, perched in a nest in his front yard. one has already attacked him. meta itemprop =\" datepublished \"content =\" 2012-05-01 15:13:14 \"> consumer corner: occupy activists trying to re-energize their cause consumer corner: occupy activists trying to re-energize their cause (cbs/cnn) - occupy wall street activists are calling for nationwide demonstrations today to mark\" may day. \"protestors say they plan to use the international workers holiday to rejuvenate their cause. occupy wall street activists are calling for nationwide demonstrations today to mark\" may day. \"also making consumer headlines, more dads are staying at home with the kids. (cbs) - would you know what to do if you were in a small plane and the pilot suddenly couldn't fly it? a new program in canada is now teaching passengers how to land safely. the program's popularity would you know what to do if you were in a small plane and the pilot suddenly couldn't fly it? a new program is now teaching passengers how to land safely. meta itemprop =\" datepublished \"content =\" 2012-04-27 14:56:40 \"> web exclusive: what's eating all your smartphone data? web exclusive: what's eating all your smartphone data? (cnn) - between texting, tweeting and smartphone apps, it's easy to get to the middle of the month and ask,\" where did my data go? \"some sneaky things could be pushing you over your limit. posting, watching, between texting, tweeting and smartphone apps, it's easy to get to the middle of the month and ask,\" where did my data go? \"some sneaky things could be pushing you over your limit. meta itemprop =\" datepublished \"content =\" 2012-04-26 13:28:38 \"> we what's trending: beyonce named most beautiful we what's trending: beyonce named most beautiful (cnn/cbs) - she's a superstar, a multi-grammy winner, a new mom, and now\" the world's most beautiful woman. \"people magazine gave beyonce that distinction this year. beyonce is crediting motherhood. she's a superstar, a multi-grammy winner, a new mom, and now\" the world's most beautiful woman. \"people magazine gave beyonce that distinction this year. meta itemprop =\" datepublished \"content =\" 2012-04-25 14:11:06 \"> web exclusive: texas woman gives birth to sextuplets! web exclusive: texas woman gives birth to sextuplets! (cnn) - a woman in texas gave birth to sextuplets--six babies! they were born monday at a hospital in houston. lauren perkins saw her 6 babies for the first time tuesday. the perkins sextuplets were a woman in texas gave birth to sextuplets--six babies! they were born monday at a hospital in houston. meta itemprop =\" datepublished \"content =\" 2012-04-24 13:37:25 \"> we consumer corner: website helps you try before you buy we consumer corner: website helps you try before you buy (cbs) - it's a high-tech way to prevent\" buyers' remorse. \"a new website, ybuy.com, let's you try out gadgets and appliances before you pay for them, but this kind of membership service has a price and it's a high-tech way to prevent\" buyers' remorse. \"a new website, ybuy.com, let's you try out gadgets and appliances before you pay for them, but this kind of membership service has a price and limitations. meta itemprop =\" datepublished \"content =\" 2012-04-23 15:42:01 \"> web exclusive: baby boomers finding love online web exclusive: baby boomers finding love online (cnn) - can people in their 50's find real love on line? the thought is daunting for some baby boomers, but some are finding dating fun again. suzanne gorman went on a blind date, with todd grodnick, can people in their 50's find real love on line? the thought is daunting for some baby boomers, but some are finding dating fun again. meta itemprop =\" datepublished \"content =\" 2012-04-20 14:00:06 \"> web exclusive: dream app goes to work while you sleep web exclusive: dream app goes to work while you sleep trying to shake a recurring nightmare? or, just wish your dreams were a bit more entertaining? there's an app for that! the iphone application goes to work while you're asleep. longview (kytx)--paying for college may soon cost more. it may be harder for students to pay back their loans when they graduate if congress doesn't stop an interest rate hike on certain loans this summer. cbs 19's abby broyles tells us which loans could be affected. the interest rate hike would affect stafford loans, federal financial aid that's available to students enrolled at least part time in college. the interest rates on those loans are set to double july 1st. <mark>jennifer holland</mark> is working toward an education degree at letourneau university. she's concerned about paying off her student loans after she graduates.\" you have to consider, is it worth it to take out this money if it's going to be that much harder to pay it back? \"<mark>holland</mark> said. adding to her concerns is the possibility of interest rates going up on stafford loans - federal financial aid she's applied for the past three years. right now, interest rates on stafford loans are low, at 3.4%. since congress passed the college cost reduction and access act in 2007, interest rates on stafford loans have dropped each year, from 6.8% in 2007, to 3.4% in 2011. the act expires in july, unless congress extends it. last week, the house voted to keep the interest rates low.\" we're finding more and more parents and students are questioning the value of education because the cost of it, \"letourneau university provost philip coyle said. dr. coyle is concerned some students may choose a career field based on income, if what they really want to do doesn't pay as much.\" how are they gifted, what is their skill set, what are their passions? those elements are probably valued less in a choice of college or choice of career field than they were in previous years because of the increased interest rates in federal loans, \"dr. coyle said. now students and educators are looking to washington to see what happens next. the u.s. senate votes on the issue next week. here's a breakdown of how much money students will save if the loan stays at 3.4% instead of shooting back up to 6.8%. let's say you take out a $4,200 loan and repay it over 12 years. you're looking at a savings of about $1,000. meta itemprop =\" datepublished \"content =\" 2012-05-01 14:28:48 \"> man charged in 2-year-old girl's death man charged in 2-year-old girl's death bullard (tyler morning telegraph) - a man who authorities said drove the wrong way on u.s. highway 69 north of bullard was charged with intoxication manslaughter after a three-vehicle accident killed a a man who authorities said drove the wrong way on u.s. highway 69 north of bullard was charged with intoxication manslaughter after a three-vehicle accident killed a 2-year-old girl and injured several others saturday, officials said. east texas (kytx)--it's open season for alligator hunters and they're going up against more than half a million gators statewide. now the state's trying to make it easier to get rid of the ones that it's open season for alligator hunters and they're going up against more than half a million gators statewide. now the state's trying to make it easier to get rid of the ones that cause problems because once an alligator gets to be about six feet long it has no natural predators. meta itemprop =\" datepublished \"content =\" 2012-05-03 22:08:05 \"> scholarships impact east texas businesses scholarships impact east texas businesses tyler (kytx) - more than $110,000, that's how much money ut tyler's patriot golf classic raised last year. all of that money goes toward student scholarships. cbs 19's amanda roberson shows us why those scholarships impact east texas businesses meta itemprop =\" datepublished \"content =\" 2012-05-03 23:47:21 \"> students, educators concerned over possible federal loan interest rate hikes students, educators concerned over possible federal loan interest rate hikes longview (kytx)--paying for college may soon cost more. it may be harder for students to pay back their loans when they graduate if congress doesn't stop an interest rate hike on certain loans this summer. paying for college may soon cost more. it may be harder for students to pay back their loans when they graduate if congress doesn't stop an interest rate hike on certain loans this summer. cbs 19's abby broyles tells us which loans could be affected. longview, texas (kytx) longview police say a man stole a credit card then went on a spending spree with it. the suspect stole the credit card from a wallet left in a parked car then used the victim's credit all content? copyright 2004 - 2012, worldnow and kytx, owned and operated by"}, {"articleID": "2013062103_00002931_W", "names": {"Jerry Butler": ["Q1533288", "Q1565628", "Q372820", "Q6183339"]}, "date": "2013-06-20", "url": "http://www.rollingstone.com/music/news/smith-westerns-mellow-out-before-blasting-off-20130620", "content": "Cullen Omori, Max Kakacek and Cameron Omori of Smith Westerns (from left) Dan Hyman June 20, 2013 3:20 PM ET Cullen Omori has been stoned all day. A busy night lies ahead: The Smith Westerns singer is hoping to whip up a killer gumbo and then, if all goes according to plan, stock his newly minted \"smoking room\" with the early-Nineties action figures he's recently become obsessed with. Right now, though, he's ready to spark up again. \"Go easy - this stuff is pretty heavy,\" he warns, sliding a mini-glass bong snugly packed with choice buds across a table in the living room of his messy, college-style Chicago walk-up apartment. Omori's pet fish, Little Pig, looks on from his murky tank. The 23-year-old frontman and his bandmates - brother Cameron Omori, 21, on bass, and longtime friend Max Kakacek, 22, on guitar - finished recording their third studio album, Soft Will, last October. Save for a pair of Coachella gigs in April, life for the three longhaired musicians has resembled one long, hazy weed nap since then. The daydream ends next month, when they head out on a nationwide tour behind the new album. - The Daily Mail and Perez Hilton are two of his favorites - and messed around with a guitar that he recently outfitted with a marijuana-themed pick guard. Cameron overslept, the result of an up - 'til -3:00 a.m. bender playing Candy Crush on his iPhone. Kakacek, the most put-together of the three (if only by process of elimination), had already met a friend for coffee and a chicken salad sandwich by mid-afternoon; he even found time to stop by the bank to withdraw some money for the early-Eighties Jeep Wrangler he wants to buy. Playing in Smith Westerns is the only job these guys have ever known. Their Nuggets - inspired 2009 debut, recorded while all three were in high school, caught the attention of a handful of influential music blogs; their slightly glossier follow-up, 2011's After a year of touring behind Dye It Blonde, including high-profile opening gigs for Arctic Monkeys, Smith Westerns returned home to Chicago in early 2012. Cullen moved into an apartment with Kakacek in the hipster-friendly Logan Square neighborhood; he later moved down the streeet to his current place, where he lives with his girlfriend. Cameron is still figuring out his plans, so he moved back in with his and Cullen's parents in the northern Chicago neighborhood of Sauganash. \"It was the first time since 2009 that we had this huge gap of time,\" Cullen recalls of their life after the Dye It Blonde tour. After an enjoyable stretch spent doing nothing, the trio got back to writing new songs; last summer, they headed out to Sonic Ranch Studios in El Paso, Texas, to record Yeah Yeah Yeahs, TV On The Radio). Adds Cullen, \"It was nice to get out and go to this weird, isolated place.\" On most days, the trio holed up in the studio from mid-afternoon until the early morning hours. New drummer Julien Ehrlich, formerly of Unknown Mortal Orchestra, joined them for the sessions - the first time they'd recorded with a full band. Cameron recalls the sessions' loose, freewheeling vibe: \"I feel like Dye It Blonde was the [album] where there was a little more pressure. This one was a lot more fun.\" Big-Star - style power-pop with more complex arrangements and lush orchestral melodies. Cullen says he looks to the To read the new issue of Rolling Stone <mark>Jerry Butler</mark> | 1960 A lightly swinging Latin-influenced, almost cha-cha groove and close harmonies decorated <mark>Jerry Butler</mark>'s early soul hit \"He Will Break Your Heart,\" delivering a stately warning that his rival would never love his girl like he did. The melody came to <mark>Butler</mark> as he was driving on the highway from Atlantic City, New Jersey, to Philadelphia with Curtis Mayfield, and as <mark>Butler</mark> told"}, {"articleID": "2017082318_00582948_W", "names": {"Atul Kumar": ["Q41790058", "Q4818789", "Q57090004", "Q58207751"]}, "date": "2017-08-23", "url": "http://www.businesswire.com/news/home/20170823005488/en/Flavored-Water-Market---Trends-Forecasts-Technavio/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE", "content": "LONDON--(BUSINESS WIRE)--Technavio's latest report on the global flavored water market provides an analysis of the most important trends expected to impact the market outlook from 2017-2021. Technavio defines an emerging trend as a factor that has the potential to significantly impact the market and contribute to its growth or decline. The global flavored water market will be growing both in terms of revenue and volume during the forecast period. The growth is expected to be primarily due to changing consumer lifestyle and preferences and growing health awareness among the consumers. These factors have resulted in the development of different varieties of flavors which are fueling the growth of the global flavored water market. Flavored water has emerged as a ready-to-drink (RTD) health beverage. It is a better substitute for carbonated drinks owing to its nutritional benefits. <mark>Atul Kumar</mark>, a lead analyst from Technavio, specializing in research on non-alcoholic beverages sector, says, \"The Americas is the leading region in the global flavored water market, and is expected to witness a high growth rate during the forecast period. Since flavored water is enriched with minerals, vitamins, and natural flavors, the product attracts many health-conscious consumers.\" This report is available at a USD 1,000 discount for a limited time only: View market snapshot before purchasing Buy 1 Technavio report and get the second for 50% off. Buy 2 Technavio reports and get the third for free. The top three emerging trends driving the global flavored water market according to Technavio research analysts are: Introduction of new flavors Innovation in packaging Expansion of flavored water market in emerging economies Looking for more information on this market? Request a free sample report Technavio's sample reports are free of charge and contain multiple sections of the report including the market size and forecast, drivers, challenges, trends, and more. Introduction of new flavors The global flavored water market is witnessing an increasing demand for new flavors and consumers are demanding innovative and exotic flavors. Therefore, players are responding by adding new flavors to their product lines. The competition is becoming intense in the market and players are coming up with various new flavors to stay ahead of the competitors. \"Flavored water products with raspberry, strawberry, pineapple, cucumber, and watermelon have been introduced in the market. Considering this trend among consumers, flavored water manufacturers are introducing many new flavors. H2ROSE uses rose water to create a sweet and fragrant drink, and H2ROSE water comes in four different flavors such as mango, peach, wild berry, and apple,\" according to <mark>Atul</mark>. Innovation in packaging Manufacturers are coming up with innovative packaging that is convenient to carry and enable consumption directly from the package while on-the-go. Consumers are now demanding transparent, labeled, and smaller pack size and that are environment-friendly. Coca-Cola has come up with the plant-based packaging bottle, which is a bio-based plant bottle packaging. Companies such as PepsiCo, Coca-Cola, Danone, and Nestlé are taking the initiative to support for 100% sustainable packaging and increase packaging recovery and recycling rates. Expansion of flavored water market in emerging economies The markets of flavored water in countries like the US are becoming saturated for flavored water. To survive in the market and continue making profits, the vendors of flavored water need to tap new market and customer base. Flavored water, being a functional beverage and having several alternatives, was not that popular in emerging economies. Soft drinks and caffeine-rich drinks like tea and coffee are already in high demand in these nations. Although flavored water by key vendors like Coca-Cola, PepsiCo are present in certain countries but are generally consumed by the upper strata of the society and affluent customers. The key vendors are as follows: Coca-Cola Hint Nestlé PepsiCo Browse Related Reports: Global Sparkling Juices Market 2017-2021 Coconut Water Market in Europe 2017-2021 Global Marzipan Market 2017-2021 About Technavio Technavio is a leading global technology research and advisory company. Their research and analysis focuses on emerging market trends and provides actionable insights to help businesses identify market opportunities and develop effective strategies to optimize their market positions. With over 500 specialized analysts, Technavio's report library consists of more than 10,000 reports and counting, covering 800 technologies, spanning across 50 countries. Their client base consists of enterprises of all sizes, including more than 100 Fortune 500 companies. This growing client base relies on Technavio's comprehensive coverage, extensive research, and actionable market insights to identify opportunities in existing and potential markets and assess their competitive positions within changing market scenarios. If you are interested in more information, please contact our media team at media @ technavio.com."}, {"articleID": "2016121322_00393880_W", "names": {"Jerry Brown": ["Q152451", "Q717620"], "Jose Sanchez": ["Q25860481", "Q3186563", "Q3810586", "Q5548031"], "Dan Siegel": ["Q5214384", "Q5214386"], "John Burris": ["Q6224014", "Q6224016"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-12-13", "url": "http://feeds.latimes.com/~r/latimes/entertainment/news/music/~3/TPRwW2K2Jb8/la-pol-ca-oakland-mayor-libby-schaaf-20161213-story.html", "content": "Libby Schaaf knows how to make being mayor of one of California's most troubled cities look like fun. When the Golden State Warriors won the NBA championship last year, Oakland's top elected official rode in the victory parade with hometown music legend M.C. Hammer atop a fire-breathing car shaped like a snail, her gonzo chariot for city celebrations. But although the car represents an image of Oakland that Schaaf has promoted--creative, exuberant and more than a little offbeat--recent months have brought a cascade of reminders of this Bay Area city's deep-rooted problems. \"There is hardly a day that goes by as mayor of Oakland that I'm not met with some unpredictable challenge,\" Schaaf said in an interview. Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot June 30, 2016, 5:45 p.m. Welcome to Essential Politics, our daily feed on California government and politics news. Here's what we're watching: Legislators sent Gov. <mark>Jerry</mark>... Updates on California politics: Lawmakers send gun measures to Gov. <mark>Brown</mark>, initiative on parole overhaul makes the Nov. 8 ballot June 30, 2016, 5:45 p.m. Welcome to Essential Politics, our daily feed on California government and politics news. Here's what we're watching: Legislators sent Gov. <mark>Jerry</mark>... Read the story The city's police force was rocked by a sex abuse scandal that has stalled the department's effort to emerge from more than a decade of federal oversight. The Oakland Raiders football team is threatening to move to Las Vegas. Local leaders are struggling to keep the city affordable despite a rising tide of wealth from the tech boom. And all of that was before the deadliest fire in Oakland's history ripped through a warehouse Dec. 2, killing 36 people who had gathered for an underground concert. The tragedy was compounded by subsequent revelations that the city appeared to have never inspected the building. When Schaaf stepped to the microphone at a nighttime vigil three days after the blaze, mourners shouted \"go home.\" The boos grew louder as she talked about addressing safety issues in loosely regulated warehouses where artists work and live. Red Cross workers outside the Ghost Ship warehouse Dec. 7. Francine Orr / Los Angeles Times Red Cross workers outside the Ghost Ship warehouse Dec. 7. Red Cross workers outside the Ghost Ship warehouse Dec. 7. (Francine Orr / Los Angeles Times) \"This city is going to go through a lot of emotions and one of them is going to be anger and that's part of my job--to hear that and feel that,\" she told the crowd. \"My job is to keep this city and this community together right now.\" Whether she accomplishes that job may define Schaaf's tenure as mayor of a city that's already undergoing what she describes as \"a radical transformation.\" Cracking down on unsafe buildings could cause evictions, inflaming tensions in a city that declared a housing emergency this year. But doing nothing doesn't seem to be an option either. \"If she doesn't do something quick, and come up with solutions, I don't know how she moves forward,\" said Joseph Sarapochillo, a real estate developer. \"This is just not going to go away.\" Schaaf, 51, one of California's few prominent female elected officials, arrived in office with a solid political pedigree. A former lawyer, she started working in local government as an Oakland City Council aide, then under Gov. <mark>Jerry Brown</mark> when he was mayor. She served as a City Council member for four years before beating out a crowded field of candidates in 2014 to become mayor herself. Deadly Oakland warehouse fire Read more stories If Schaaf wants to seek higher office, she already has the team she needs--she's represented by the same high-powered political consultants at SCN Strategies as <mark>Brown</mark> and Lt. Gov. Gavin Newsom. Once a high school cheerleader, the Oakland-born mayor has been an ebullient booster for her hometown. She wears earrings in the shape of the oak tree the city is named after and considers herself a defender of Oakland's \"secret sauce.\" She says city bureaucrats are really \"fantasti-crats\" and promotes \"techquity,\" her buzzword for ensuring the technology industry's boom benefits rather than displaces low-income residents. Last year the ride-sharing company Uber announced plans for a new office with up to 3,000 employees in downtown Oakland, a development that Schaaf hopes will bring a much-needed economic boost to a city with entrenched poverty. \"She has a lot of goodwill built up,\" said Don Perata, a former state Senate president who unsuccessfully ran for mayor of Oakland. But the city, which is home to a large activist community, has earned a reputation for being difficult to govern. \"Your honeymoon is brief,\" Perata said. \"And the problems are one after another.\" Schaaf's predecessor, Jean Quan, was hobbled by her response to Occupy Oakland protesters in 2011. She initially allowed them to camp out by City Hall, but police later forced protesters to vacate in violent confrontations. Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 Marcio <mark>Jose Sanchez</mark> / Associated Press Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 Mayor Libby Schaaf, center, is flanked by emergency personnel during a press conference near the site of the Ghost Ship fire on Dec. 5 (Marcio <mark>Jose Sanchez</mark> / Associated Press) Now it's Schaaf's turn to face a crisis with the Ghost Ship fire, which struck at the intersection of long-festering problems about affordable housing and the city's sense of identity. Schaaf said she wants to address the former and preserve the latter, improving safety while also ensuring that Oakland remains an eclectic haven for artists. \"It would be another tragedy if we didn't take this moment to improve our systems,\" she said. \"We can still always do better, and that's part of what we owe everyone who has been affected by this tragedy.\" The city convened a task force after the fire, but threading the needle won't be easy. Activists are already wary of an administration they feel has been too cozy with developers who are eager to renovate older buildings or demolish them to make way for higher-priced dwellings. And political opponents criticized Schaaf as slow to get a handle on problems within her administration. \"For someone who has been in city government for as long as Libby Schaaf has been, her failure to get on top of what some of these departments is doing is really inexcusable,\" said <mark>Dan Siegel</mark>, a civil rights lawyer who ran against Schaaf in the 2014 mayor's race. Victims of the Oakland warehouse fire: Who they were Los Angeles Times Staff A fire ripped through a warehouse in Oakland on Dec. 2, killing 36 people who were there for an electronic music concert. Here are the names of those who have been confirmed dead by the Alameda County Sheriff's Office Coroner's Bureau or immediate family members. Did you know one of the victims...A fire ripped through a warehouse in Oakland on Dec. 2, killing 36 people who were there for an electronic music concert. Here are the names of those who have been confirmed dead by the Alameda County Sheriff's Office Coroner's Bureau or immediate family members. Did you know one of the victims...(Los Angeles Times Staff) The Police Department, which is struggling to emerge from federal oversight that began in 2003 after a pattern of civil rights abuses, has been another challenge for Schaaf. A new scandal erupted this year when a 19-year-old woman accused several officers of having sex with her when she was underage. Besides criminal charges for some officers, the scandal has caused widespread turmoil within the department. The chief resigned, and his two successors resigned soon after. The department has been run by a civilian city administrator since June, and the chief position remains unfilled. Barry Donelan, president of the Oakland Police Officers' Assn., Association said the turmoil has been demoralizing and prompted some to leave the force. \"The uncertainty among the rank-and-file fuels that,\" he said. <mark>John Burris</mark>, a civil rights lawyer who brought the lawsuit that led to federal oversight more than a decade ago and now represents the young woman in the recent scandal, said Schaaf was doing the best she could in a difficult situation. \"This is the job you ask for, right?\" he said. \"Every year, something comes up.\" Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. Ben Margot / Associated Press Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. Oakland Mayor Libby Schaaf, left, speaks beside Oakland Chief of Police Sean Whent in May. He resigned amid a department sex-crimes scandal this summer. (Ben Margot / Associated Press) One of those things is the potential for the Oakland Raiders to leave the city, something they've threatened before. Nevada has lined up $750 million in public money to lure the team. By comparison, Schaaf's plan to keep the Raiders in Oakland, which is being placed before the City Council and county supervisors for a vote Tuesday, includes $350 million in public resources, including infrastructure investments and land for a new stadium. Although the proposal leaves taxpayers on the hook for less, it's unlikely to be enough to satisfy the Raiders or the National Football League, which has the final say on whether the team is allowed to move. In the midst of all of these challenges, Schaaf is still trying to carve out time for long-term plans to improve the city. She highlighted a partnership with philanthropists and businesses, the Oakland Promise, to help students graduate high school and attend college. \"We can't just be reactive to crises,\" she said. \"We have to invest in sustainable, comprehensive solutions.\" On Saturday, she attended a meeting in Mosswood, a hub for the city's African American community, the quickly gentrifying Temescal neighborhood, where another fire destroyed a recreation center that housed programs for elementary school children and teens with developmental disabilities. After Schaaf spoke to the crowd, she answered questions from residents and chatted with retired NFL running back Marshawn Lynch, who grew up nearby. Cynthia Armstrong, 37, said she feels for the mayor. \"This is the type of city where there is constantly something happening,\" she said. \"So how do you stop and pause to fix some things that you inherited if the next crisis is always at hand? I think she is doing the best that she can at this point.\" Caption Kanye West at <mark>Trump</mark> Tower Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Caption Kanye West at <mark>Trump</mark> Tower Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Kanye West and President-elect <mark>Donald Trump</mark> met in the <mark>Trump</mark> Tower lobby on Tuesday morning. Caption President Obama and <mark>Donald Trump</mark> in the Oval Office President Obama and <mark>Donald Trump</mark> discuss their visit at the White House President Obama and <mark>Donald Trump</mark> discuss their visit at the White House Caption Hillary Clinton's concession speech A portion of Hillary Clinton's concession speech. A portion of Hillary Clinton's concession speech. Caption President Obama talks about the 2016 election and the future President Obama talks about the 2016 election and the future President Obama talks about the 2016 election and the future Caption <mark>Donald Trump</mark>'s acceptance speech: \"It is time for us to come together' President-elect <mark>Donald Trump</mark> gives his acceptence speech at a election party at a New York City Hilton hotel with his family and vice president-elect Mike Pence. President-elect <mark>Donald Trump</mark> gives his acceptence speech at a election party at a New York City Hilton hotel with his family and vice president-elect Mike Pence. chris.megerian @ latimes.com Twitter: @ chrismegerian ALSO:\" It's excruciating': Inside the heartbreaking recovery of 36 bodies in Oakland warehouse Ghost Ship tragedy puts focus on plight of Oakland artists dealing with soaring Bay Area housing costs Updates on California politics Updates from the campaign trail"}, {"articleID": "2013082321_00031066_W", "names": {"M. Davies": ["Q56597982", "Q59123763"]}, "date": "2013-08-23", "url": "http://yosemite.epa.gov/opa/admpress.nsf/0/3E7AEA67187B17E485257BD0004D1600", "content": "News Releases By Date Hazardous Waste Settlement Leads to School Cleanups...Hazardous Waste Settlement Leads to School Cleanups in 60 Schools in R.I. and Mass.. Release Date: 08/23/2013 Contact Information: David Deegan, (617)? 918-1017 (Boston, Mass. - August 23, 2013) - A commercial waste handler in Rhode Island has agreed to pay a fine of $58,278 and to spend $252,152 to clean hazardous chemicals out of approximately 60 schools in Rhode Island and Massachusetts in order to settle EPA claims that the company violated state and federal hazardous waste laws at a facility in Providence, R.I. Northland Environmental and its owner, PSC Environmental Services, will remove chemicals from 60 high schools and middle schools within a 50-mile radius of their Providence facility at 275 Allens Ave. where the violations occurred. The companies have agreed to pack up and properly dispose of both hazardous and non-hazardous wastes stored at the schools; to do hazardous waste training for science and art teachers; and to purchase safety equipment such as storage cabinets for flammable chemicals, eye washes and deluge showers for classrooms where hazardous chemicals are used. This project will be done over 18 months during times when the schools are closed. EPA alleged that Northland/PSC Environmental Services violated the federal Resource Conservation and Recovery Act (RCRA) and state hazardous waste laws by failing to properly identify certain hazardous wastes and failing to properly maintain hazardous waste tanks and containers. These alleged violations could have resulted in the release of hazardous wastes to the environment. The company also stored incompatible hazardous wastes next to one another, creating a potential for fire or explosions. The company quickly came into compliance after the violations were identified. \"All facilities that generate or manage hazardous wastes have an obligation to make sure they carefully adhere to the environmental requirements that result in safer, cleaner communities,\" said Curt Spalding, regional administrator of EPA's New England office. \"This case will have a positive outcome, since the projects under this settlement will help provide safer classrooms at many schools in Rhode Island and Massachusetts.\" The school clean outs will involve removing outdated and unwanted chemicals from schools at no cost to the participating schools. Chemical management is often a low priority for schools and it is not uncommon for school science departments to have outdated and unneeded stock chemicals present. \"I want to thank the EPA and the Cranston School Department for working cooperatively to provide a safe environment for our students,\" said City of Cranston Mayor Allan Fung. \"We are pleased to see funds from EPA actions like this reinvested in making Rhode Island a cleaner and safer place,\" said Terrence Gray, P.E., Associate Director for Air, Waste and Compliance at the RI Department of Environmental Management. \"For many years, DEM has directly supported school districts across Rhode Island by removing old and unnecessary chemicals, but that effort has always been limited by the resources we have available. This recent investment extends this important initiative so that more of these dangerous materials can be taken out of our schools, providing a much safer environment for students and educators.\" \"The science classroom environment is of the utmost importance as we work to support teaching and learning for students and teachers. Safety is our first concern so we were delighted to have a partnership with the EPA Integrated Chemical Management Program (ICM) who worked with our science teachers to inventory, organize chemicals, with regards to safety and to the benefit of classroom use. Working with this program provided our teachers with invaluable insights with regards to managing chemical supplies. The ultimate goal is to maximize safety and learning of science inquiry in Cranston Public Schools,\" said Dr. Judith Lundsten, Superintendant Cranston Public Schools. Rhode Island schools within a 50-mile radius of the Northland facility were sent emails letting them know of this opportunity to have toxic, hazardous, or chemicals prohibited by the state removed by participating in this project. Schools that were interested provided a list of the chemicals that need to be removed. Cranston, R.I. is using the opportunity to provide both East and West High School with chemical cleanouts before school starts on Aug. 27. In addition to paying the fine and completing the environmental project, Northland/PSC has agreed to make sure the Providence facility remains in compliance with federal and state hazardous waste management regulations. Northland/PSC's Providence facility accepts and handles a broad spectrum of wastes including acids, alkalis, flammable wastes, water reactive wastes, cyanides, sulfides, oxidizers, toxic wastes, oily wastes, photochemical wastes and laboratory packs. Hazardous and non-hazardous wastes are received, stored and or consolidated and then shipped off site for treatment or disposal. More information on hazardous waste management: http: //www.epa.gov/region1/enforcement/waste/index.html Attachment: List of Schools provided with hazardous waste cleanup under this settlement: Barrington High School Barrington Mt. Hope High School Bristol Our Lady of Mount Carmel Bristol Central Falls Senior High School Central Falls Cranston High School East Cranston Cranston High School West Cranston New England Laborers' / Cranston Public Schools Construction Career Academy Cranston Joseph McCourt Middle School Cumberland East Providence High School East Providence Burrillville High School Harrisville Burrillville Middle School Harrisville Johnston Senior High School Johnston Lincoln Senior High School Lincoln William <mark>M. Davies</mark>, Jr Career and Technical High School Lincoln Rogers High School Newport North Providence High School North Providence Ponaganset High School North Scituate North Smithfield High School North Smithfield Blackstone Academy Charter School Pawtucket William E. Tolman Senior High School Pawtucket Portsmouth High School Portsmouth DelSesto Middle School Providence Mount Pleasant High School Providence School One Providence Smithfield High School Smithfield Tiverton High School Tiverton Curtis Corner Middle School Wakefield Toll Gate High School Warwick Pilgrim High School Warwick Warwick Veterans Memorial HS Warwick Chariho Regional High School Wood River Junction Exeter-West Greenwich Regional High School West Greenwich MASSACHUSETTS Braintree High School Braintree Brockton High School Brockton B.M.C. Durfee High School Fall River Malden High School Malden Medford High School Medford Middleborough High School Middleborough Plymouth North High School Plymouth Plymouth South High School Plymouth North Quincy High School Quincy Quincy High School Quincy Randolph High School Randolph Revere High School Revere Saugus High School Saugus Walpole High School Walpole Waltham High School Waltham Worcester Public Schools - Burncoat Middle School Worcester - Forest Grove Middle School Worcester - Dr. Arthur F. Sullivan Middle School Worcester - Worcester East Middle School Worcester - Burncoat High School Worcester - Claremont Academy Worcester - Doherty Memorial High School Worcester - North High School Worcester - South High Community School Worcester Hazardous Waste Settlement Leads to School Cleanups in 60 Schools in R.I. and Mass.. EPA Chief Gina McCarthy will visit Alaska to highlight climate action plan and tour Bristol Bay EPA Awards $1 Million Brownfield Grant to Downriver Community Conference in Southeast Michigan U.S. EPA Announces Brownfield Grants for Genesee County and Mott Community College in Flint"}, {"articleID": "2016120708_00634456_W", "names": {"Dilip Kumar": ["Q377789", "Q57368862"], "Zaheer Khan": ["Q24005467", "Q2508461"]}, "date": "2016-12-07", "url": "http://www.indiatimes.com/entertainment/celebs/dilip-kumar-thanks-fans-for-their-wishes-tweets-he-s-feeling-much-better-from-the-hospital-266912.html", "content": "Home> Entertainment> celebscoop <mark>Dilip Kumar</mark> Thanks Fans For Their Wishes, Tweets He's \"Feeling Much Better' From The Hospital Isha Sharma December 07, 2016 Twitter The 93-year-old veteran actor <mark>Dilip Kumar</mark> was recently hospitalized in Mumbai's Lilavati Hospital on Tuesday after complaining of fever and swelling in the right leg. As soon as the news was reported by the media, many of his fans started pouring messages for their beloved actor. Thanking his sweet fans for their wishes and prayers, <mark>Dilip Kumar</mark> posted a series of tweets, updating his fans about his health. In one his tweets, he even thanked his doctors. Feeling much better now. Was admitted to Lilavati hospital for routine checkup. Your prayers are with me. pic.twitter.com/ii3nCMJG3f--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 A wonderful team of doctors here along with my personal physicians Dr. S Ghokale, Dr. Nitin Ghokale and Dr. R. Sharma. pic.twitter.com/cYeX4wWHSZ--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 Health is wealth said somebody. Mein aap sabhi ka mashkoor hoon ki aapne hamesha apni dua'on mein mujhe yaad rakha. pic.twitter.com/dWzxDpQiUa--<mark>Dilip Kumar</mark> (@ TheDilipKumar) December 7, 2016 Talking more about his health in an interview with Bombay Times, his wife Saira Banu said,\" I was anyway planning to take him for a routine check-up, but the swelling alarmed me. He was also complaining of cold and cough. I don't ignore anything even remotely suspicious when it comes to <mark>Dilip</mark> Saab's health. The doctors are examining him; he's under observation. He's very comfortable with the team here. I just hope there is nothing serious. Inshallah, I will take him home before his birthday on Sunday. \"The couple has time and again reinstated our faith in love and marriage. Twitter Get well soon, <mark>Dilip</mark> Saab. Don't Miss 12 Of The Best College Canteens In India And What You Should Eat There 12.5 K SHARES Virat Kohli Defending Anushka Sharma From Fans And Critics Has Been Chosen As The Golden Tweet...6.9 K SHARES Congratulations Are In Order! <mark>Zaheer Khan</mark> Is All Set To Marry Chak De Actress Sagarika Ghatge 32.6 K SHARES This Video Of Anushka-Virat Dancing With Each Other On\" Gur Naal Ishq Mitha' Will Make Your...27.9 K SHARES 11 Powerful Photos Of Jayalalithaa Tell You Why She Will Always Be The Silver Jubilee Star 17K SHARES just in celebscoop <mark>Dilip Kumar</mark> Thanks Fans For Their Wishes, Tweets He's \"Feeling Much Better' From The Hospital Partner 7 Christmas Hotspots in Germany That One Must Definitely Visit This Holiday Season 1.9 K SHARES celebscoop A Newcomer Can't Afford Lip Surgery, Says Vaani Kapoor Rubbishing Rumors Of Going Under A Knife 771 SHARES celebscoop The Spectacular Trailer Of Shah Rukh <mark>Khan</mark>'s Raees Is Out & It Has Blockbuster Written All Over It 2.2 K SHARES Partner 8 Things You Must Do Right Now To Retire As A Billionaire 17.8 K SHARES celebscoop Baba Ramdev Beating The Shit Out Of Ranveer In This Dance-Off Will Make You Laugh Until You Cry 4.2 K SHARES celebscoop SRK Reaction To AIB's Confession On Roasting Him Proves That He Is The Coolest One Of The Lot 975 SHARES"}, {"articleID": "2009040815_00002699_W", "names": {"Chris Wilson": ["Q1077867", "Q15532385", "Q21464265", "Q27918242", "Q28823527", "Q43140011", "Q5108492", "Q5108494", "Q5108495", "Q5108496", "Q5108497", "Q56064844", "Q57469261", "Q58148303", "Q635367"], "David King": ["Q1174985", "Q1174988", "Q12061011", "Q14918446", "Q18763533", "Q2356700", "Q27062679", "Q27893299", "Q328413", "Q35897288", "Q36137022", "Q3703224", "Q5236015", "Q5236016", "Q5236017", "Q5236019", "Q5240366", "Q56425228"]}, "date": "2009-04-08", "url": "http://collegefootball.rivals.com/content.asp?CID=933427", "content": "carey murdock rivals.com college football editor message boards norman, okla. - one player on oklahoma's defense who hasn't gotten the recognition deserving of his production is end jeremy beal. sure, beal was a second-team all-big 12 selection a year ago, but he was in the shadows of players such as texas' brian orakpo and teammate auston english most of last season. but heading into 2009, beal could be a breakout force after logging nine sacks a year ago. \"i expect him to be an all-american,\" defensive ends coach <mark>chris wilson</mark> said. \"that's his expectation and i have the same expectation.\" beal's all-america candidacy will likely be boosted by the ways ou plans to use the former high school linebacker next season. beal was already a part of a special goal-line package the sooners incorporated into their game plan last season. beal served as a stand-up linebacker in certain situations, and <mark>wilson</mark> said that role is expected to expand. \"he gives us a lot of versatility,\" he said. \"being a former linebacker he can drop, he can rush off the edge, he can get into run fits and play\" backer for us sometimes. he'll be a guy that we'll form some really neat packages around as we get ready to go into the fall. \"the defensive end position will be deep once again for the sooners. english, a 2008 preseason defensive player of the year candidate, should return to full strength next season. english missed several games after undergoing an emergency appendectomy before the start of the '08 season. then he suffered a leg injury against nebraska that limited his availability the rest of the year. but there are no concerns about english's production after a down year last season.\" i can say this without a doubt that he's our starter, \"<mark>wilson</mark> said.\" unless something tragic happens he'll be the guy that starts our first game at byu. \"frank alexander also returns as he'll try and build on an impressive redshirt freshman season in' 08. this spring has been a springboard for alexander to develop at the position. there are high expectations for alexander as spring practice is winding down.\" he's been doing everything on his competitive nature and his athleticism, \"<mark>wilson</mark> said.\" we've got to get him more disciplined and more technically sound and more fundamentally sound. those are the things, when you get down to it, are the things that let you beat texas or florida and obviously that's our goal every year. \"r.j. washington is also vying for playing time. as of today, he wouldn't be in the sooners' four-man rotation. that fourth spot would belong to <mark>david king</mark>.\" <mark>david king</mark>'s really matured a lot. obviously they're as raw as you can get right now, but <mark>david</mark>'s improved and i really like his upside, \"<mark>wilson</mark> said. washington has the type of talent coaches dream of putting on the field. but right now, <mark>king</mark> is doing the little things on a more consistent basis. <mark>wilson</mark> sees washington's situation as a chance for motivation this summer."}, {"articleID": "2012121814_00043613_W", "names": {"Mario Monti": ["Q16576469", "Q47904"]}, "date": "2012-12-18", "url": "http://in.reuters.com/article/2012/12/18/markets-global-idINDEE8BH0AW20121218?feedType=RSS&feedName=businessNews", "content": "london (reuters) - signs of compromise in u.s. talks to stop automatic tax hikes and spending cuts hurting the economy next year pushed world shares towards a three-month high on tuesday and weakened appetite for safe-haven bonds and the dollar. the political divide narrowed on monday night when president barack obama proposed leaving lower tax rates in place for those earning under $400,000, moving closer to the $1 million threshold favoured by republican house of representatives speaker john boehner. european shares were up 0.3 percent and closing in on 2012 highs ahead of the wall street open. the s & p 500, dow jones industrial average and nasdaq 100 were also expected to rise. the rally pushed the msci index of global stocks up 0.2 percent to the brink of a three-month high, with an 18-month peak also in sight. \"it is reassuring that we are now seeing some signs of compromise in the u.s.,\" said daiwa securities economist tobias blattner. \"a deal is key to avoiding a major global recession; if we were to fall over the cliff, there would be massive fiscal tightening.\" the dollar, a traditional safe-haven currency, fell to a two-month low against a basket of currencies, as the broader market appetite for risk strengthened. oil and copper, two commodities closely attuned to global growth expectations both gained, although profit taking saw the latter edge back to $8,026 per tonne as the european session tailed off. \"one would assume that this (fiscal cliff deal progress) would be a positive for commodities,\" said stephen briggs, metals strategist at bnp paribas in london. \"but because base metals have been faring pretty well in the last few weeks, there may be less mileage for them.\" expectations of more monetary easing in japan following sunday's return to power of the ldp and its pro-stimulus leader shinzo? abe added to the optimism and provided additional support for the nikkei which hit an 8-1/2 month high. it also kept the yen near a 20-month low versus the dollar. by 1300 gmt the dollar was worth 83.90 yen, up almost 7 percent compared to when it started rising in early november. \"we are in a situation where we will see the government tell the central bank what to do. such a politicised situation is never good for a currency, and the yen will weaken,\" said peter kinsella, currency strategist at commerzbank. with the european central bank looking increasingly unlikely to cut interest rates in the next couple of months, the euro remained near monday's seven-month high at $1.3175. newly installed ecb board member yves mersch said he saw no logic in cutting rates at the moment. data from the uk showed inflation stayed at its highest level since may, confounding forecasts it would ease and potentially giving the bank of england less room to resume its quantitative easing to support the struggling economy. however, sweden cut its interest rates back to 1 percent, turkey cut rates for the first time in more than a year, while india's central bank reiterated its guidance of further easing in the first quarter of 2013. in bond markets, trading remained subdued ahead of the year-end. u.s and german government bonds futures slipped as increasing signs of progress in the u.s. budget talks eased demand for low-risk assets. concerns that new fiscal stimulus could seriously increase the country's debt burden pushed the benchmark 10-year japanese government bond yield to a one-month high of 0.750 percent. with the thin trade accentuating moves, spanish debt extended gains after its final bill sale of the year raised more than the target amount. spanish 10-year bond yields fell 7.5 basis points to 5.38 percent while the equivalent italian debt fell 8 bps to 4.49 percent, back to where it was before prime minister <mark>mario monti</mark> sparked a wave of selling earlier this month by announcing he would resign early. we welcome comments that advance the story through relevant opinion, anecdotes, links and data. if you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. views expressed in the comments do not represent those of reuters. for more information on our comment policy, see our flagship financial information platform incorporating reuters insider an ultra-low latency infrastructure for electronic trading and data distribution a connected approach to governance, risk and compliance, and interactive television platforms. thomson reuters journalists are subject to an"}, {"articleID": "2018112116_00187422_W", "names": {"Rich Cronin": ["Q466751", "Q7323227"]}, "date": "2018-11-21", "url": "http://www.fox13memphis.com/news/trending-now/lfo-singer-devin-lima-dead-at-41-reports-say/876524903?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "LFO singer Devin Lima dead at 41, reports say Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link LFO singer Devin Lima dead at 41, reports say By: Kelcie Willis, Cox Media Group National Content Desk Updated: Nov 21, 2018 - 9:44 AM Loading...LFO singer Devin Lima dead at 41, reports say LFO singer Devin Lima has died, according to a report. TMZ reported that the singer died of cancer at age 41. He was battling stage 4 cancer for a year, according to the tabloid site. Us Weekly confirmed the news. Lima was a member of the three-man boy band LFO, well known for its 1999 single \"Summer Girls.\" >> Read more trending news People reported that the singer had surgery to remove a tumor in October 2017. A week after the surgery, LFO bandmate Brad Fischetti said Lima had stage 4 adrenal cancer. \"Devin asked me to give you this update without him because, frankly, he's not feeling very well, but he asked me to send you his love and gratitude for all the love and prayers you've sent his way,\" Fischetti said in an Oct. 30, 2017 video. \"He's had a tough recovery and a few really difficult days in the hospital, but thankfully he's home now resting and healing. The pathology report came back and unfortunately it confirmed cancer.\" This is the second death in the band. Singer <mark>Rich Cronin</mark> died of leukemia at age 35 in 2010. © 2018 Cox Media Group."}]