[{"articleID": "2013031516_00047957_W", "names": {"Greg Page": ["Q1390813", "Q5606096"], "Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2013-03-15", "url": "http://sys-con.com/node/2580743", "content": "march 15, 2013 / prnewswire /--as a steadfast supporter of open markets and free trade, cargill welcomes japan's decision to enter the trans-pacific partnership (tpp) negotiations. \"japan's decision to join the tpp negotiations sends a strong signal about the impact this free trade agreement can have on the <mark>greg page</mark>, cargill chairman and ceo .\" we truly hope such an agreement can advance the cause of a more food secure world. \"cargill believes that tpp must be comprehensive and include all products across all industry sectors to be truly effective. this will take unprecedented cooperation .\" japan's role in tpp can be a positive and game-changing event, \"said devry boughner vorwerk, director of international business relations for cargill and co-chair of the u.s business coalition for tpp .\" as one of the world's largest economies, japan enhances the commercial meaningfulness of any agreement. \"cargill looks forward to the next round of discussions in japan at the table in the near future. about cargill cargill is an international producer and marketer of food, agricultural, financial and industrial products and services. founded in 1865, the privately held company employs 142,000 people in 65 countries. cargill helps customers succeed through collaboration and innovation, and is committed to applying its global knowledge and experience to help meet economic, environmental and social challenges wherever it does business. for more information, visit published march 15, 2013 copyright? 2013 sys-con media, inc. - all rights reserved. by jeremy geelan wayne ariola wrote: jeremy - you are an innovator and as i've always said a market-maker. thank god that your sphere of influence graduated from test books to a bigger stage. i know you've been modest in this recollection, however i cannot imagine the industry cycles would have been stifled without your energy and feedback: ws, soa, cloud, big data...very impressive. is your business 100% ready for the new era of cloud computing and big data? the only enterprise it event in 2013 covering the entire scope of both cloud & big data come to new york and get yourself up to date with the big data revolution! as advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the cloud computing boom, cloud expo is the single most effective event for you to learn how to use you own enterprise data - processed in the cloud - most effectively to drive value for your business. there is little doubt that big data solutions will have an increasing role in the enterprise it mainstream over time. get a jump on that rapidly evolving trend at big data expo, which we are introducing in june at cloud expo new york. cloud expo was announced on february 24, 2007, the day the term\" cloud computing \"was coined. that same year, the first c loud expo t ook place in new york city with 450 delegates. next june, cloud expo is returning to new york with more than 10,000 delegates and over 600 sponsors and exhibitors .\" cloud \"has become synonymous with\" computing \"and\" software \"in two short years. cloud expo is the new pc expo, comdex, and internetworld of our decade. by 2012, more than 50,000 delegates per year will participate in cloud expo worldwide. the cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. but moving from theory into practice is where things get complicated, and this is where attending a top industry event like cloud expo comes in. no one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th international cloud conference & expo on june 10-13, 2013 - is to ensure - through an intensive four-day schedule of keynotes, general and breakout sessions, and our bustling expo floor - that attending delegates leave the javits center with abundant resources, ideas and examples they can apply immediately to leveraging the cloud, helping them to maximize performance, minimize cost and improve the scalability of their enterprise it endeavors. delegates will leave cloud expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. whether you're an enterprise or small to medium business, you'll soon be benefiting from the cloud. join your peers in new york city june 10-13, and maximize those benefits already in 2013. see you in new york city! register now! save $500 on your\" golden pass \"! call 201.802.3020 or click here to register early bird expires friday. submit your speaking proposal for the upcoming cloud expo in new york city please call 201.802.3021 events (at) sys-con. com. <mark>carmen gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . copyright? 1994-2013 ulitzer, inc. all rights reserved. all marks are trademarks of ulitzer, inc. ."}, {"articleID": "2011041302_00055306_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2011-04-13", "url": "http://minnesota.publicradio.org/display/web/2011/04/12/pawlenty-is-running/?refid=0", "content": "photo: #former minnesota governor tim pawlenty speaks at the iowa faith and freedom coalition, monday, march 7, 2011, at the point of grace church in waukee, iowa. pawlenty announces candidacy--and then unannounces by madeleine baran, minnesota public radio april 12, 2011 st. paul, minn. - former minnesota gov. tim pawlenty made his most direct statement yet about his presidential ambitions during an interview with cnn's piers morgan tuesday. and then started backtracking. morgan asked pawlenty whether he would consider running as a vice presidential candidate with <mark>donald trump</mark>. \"i'm running for president,\" pawlenty said. \"i'm not putting my hat in the ring rhetorically or ultimately for vice president. so i'm focused on running for president .\" when morgan said he thought that sounded like an announcement, pawlenty replied a formal announcement would come soon but he's headed in that direction. pawlenty moved quickly to knock down any speculation that he had officially entered the race. spokesman alex conant says the quote was taken out of context. he says a formal announcement by pawlenty about running for president would come later this spring. morgan's pr representative didn't immediately respond to an email seeking comment sent tuesday night. pawlenty formed an exploratory committee last month. outstate parks and trails want a bigger piece of the legacy amendment pie the ills of alcohol are well known. however, study after study indicates that people who drink in moderation live longer and are happier. these studies haven't helped to resolve why a drink or two a day can be good for you. sound learning looking for ways to ensure your students are doing quality research from credible sources? sound learning is a launching point to minnesota public radio's content on the web."}, {"articleID": "2014102313_00002057_W", "names": {"Kevin O'Neill": ["Q28149212", "Q3195781", "Q3195782", "Q3814839", "Q6397152"]}, "date": "2014-10-23", "url": "http://www.tradersmagazine.com/news/regulation/sec-rejects-non-transparent-etfs-in-active-manager-setback-113023-1.html", "content": "SEC Rejects Non-Transparent ETFs in Active Manager Setback (Bloomberg)--The U.S. Securities and Exchange Commission rejected plans by BlackRock Inc. and Precidian Investments to open a new type of exchange-traded fund that wouldn't disclose holdings daily, setting back efforts to bring more actively managed ETFs to market. SEC, in preliminary decisions announced yesterday, denied BlackRock's September 2011 and Precidian's January 2013 requests for exemptive relief from the Investment Company Act of 1940. The move puts on hold plans by the firms to start the first non-transparent ETFs. The Precidian proposal falls \"far short of providing a suitable alternative to the arbitrage activity in ETF shares that is crucial to helping keep the market price of current ETF shares at or close\" to its net asset value, <mark>Kevin O'Neill</mark>, a deputy secretary at the The ruling hinders plans by asset managers to sell funds run by traditional stock-picking managers in an ETF package. Firms including Capital Group Cos. have asked for similar regulatory approval as they seek to expand offerings in the fastest-growing product in the asset-management industry. Money managers have been discouraged from introducing active ETFs, which combine security selection with the intraday trading and some of the cost-saving features of traditional ETFs, because the SEC's requirement for daily disclosure of holdings would make it easy for competitors to copy, and traders to anticipate, a manager's portfolio changes. \"We want to work with the SEC--we believe it's part of the process,\" Daniel McCabe, Precidian's chief executive officer, said in a telephone interview. \"We're not surprised by the fact that they have questions, but questions can be answered .\" ETF providers must disclose holdings every day to enable market makers to execute trades that keep the share price in line with the underlying value of the fund's assets. Firms including BlackRock, Precidian and Guggenheim Partners LLC proposed structures that they say would allow the funds to remain priced in line with assets, without revealing specific positions. T. Rowe Price Group Inc. in Baltimore and Boston's Eaton Vance Corp. are also among fund firms seeking SEC approval for non-transparent active ETFs. None of the applications has been approved. \"We are still pursuing our own proposal to offer non - transparent active ETFs,\" Heather McDonold, a spokeswoman for T. Rowe, said in a telephone interview. Melissa Garville, a spokeswoman for New York-based BlackRock, and Ivy McLemore, a spokesman for Guggenheim, declined to comment. Robyn Tice, a spokeswoman for Eaton Vance, and Elizabeth Bartlett for State Street Corp. didn't immediately respond to an e-mail and telephone messages seeking comment. BlackRock was one of the first U.S. fund managers to ask the SEC for approval, after spending three years crafting the product. Their leading role in seeking approval for a non - transparent active ETF has spurred excitement within asset management for the product's prospects, according to Todd Rosenbluth, director of mutual-fund and ETF research at S & P Capital IQ in New York. Mark Wiedman, BlackRock's global head of its iShares ETF unit, said in May that the firm was confident the products would work, \"but we don't actually think it will be much of a commercial opportunity .\" "}, {"articleID": "2012062403_00033681_W", "names": {"Dan O'Brien": ["Q16733571", "Q3013156", "Q30959994", "Q47545592", "Q5214110", "Q5214111", "Q5214112", "Q5214113", "Q5214115", "Q5821"]}, "date": "2012-06-24", "url": "http://q13fox.com/news/ct-spt-0624-track-olympics--20120624,0,7883733.story?track=rss", "content": "philip hersh, chicago tribune reporter eugene, ore. - for two days, the u.s. olympic track and field trials has been an ironic dry run for the london summer games, where the weather could be iffy. wet. unseasonably cold. intermittent flashes of brightness, both in the sky and on the track. and no one shone brighter during those two days than ashton eaton, the olympic decathlon champion-in-waiting. as if the heavens had anointed him, the conditions were perfect saturday when eaton completed the most stunning performance in the 100 years since the decathlon made its olympic debut at the stockholm summer games and king gustav v of sweden said to winner jim thorpe, \"sir, you are the greatest athlete in the world .\" in early evening sun, with no wind and a 59-degree temperature perfect for a man who had done nine events since friday morning, eaton roared through the final lap of the 1,500 meters to break the 11-year-old world record in the decathlon. his total of 9,039 points was 13 better than the mark 2004 olympic champion roman sebrle of the czech republic set in 2001. it is the first decathlon world record for a u.s. athlete since <mark>dan o'brien</mark>'s 8,891 in 1992. eaton needed to run the 1,500 in 4 minutes, 16.23 seconds to break the record. with the crowd at oregon's hayward field standing to urge him on, eaton blew through the last lap in 62 seconds to clock 4:14.48. curtis beach, who had led the race from the start, graciously deferred to the moment by slowing down so eaton could get to the finish first. \"i was trying to get the world record because i knew it was a possibility,\" eaton said. \"i didn't want to shy away from it. this is hayward. this is where this life began for me .\" as the runners lined up for the 1,500, the 24-year-old eaton smiled and steepled his hands in a nearly prayerful gesture of thanks to the crowd in a stadium where he had competed for the university of oregon. he would slap some of those fans' hands on the victory lap, just as he had done a couple of hours earlier after a pole vault performance that put the world record back on the table. trey hardee, winner of the last two world titles, was second at 8,383. brian clay, trying to become the first decathlete to win medals in three olympics, went through a bizarre afternoon during which he wound up 12th after being disqualified and reinstated twice in the hurdles and following that with three fouls for zero points in the discus. clay, 32, the 2008 olympic champion and 2004 silver medalist, kept competing out of respect for what the decathlon represents and the example he was providing to his three children in the stands. \"as much as i didn't want to finish, there really was no other option,\" clay said. \"i want to be the best role model you can be. the last thing you want to do as a role model is quit at something .\" in an event determined by cumulative scores, eaton also had decathlon world records in the 100 meters (10.21) and the long jump (27 feet .). in the vault, he cleared a personal best 17-feet, 41/2 inches, not bad for a guy whom you can see on"}, {"articleID": "2016091620_00590092_W", "names": {"Matteo Renzi": ["Q47563", "Q49661315"], "Theresa May": ["Q264766", "Q30161835"], "Charles Michel": ["Q5080932", "Q56084814", "Q950958"]}, "date": "2016-09-16", "url": "http://www.bloomberg.com/news/articles/2016-09-16/brexit-proves-springboard-for-eu-27-restart-to-avert-collapse", "content": "Bloomberg the Company & Its Products Bloomberg Anywhere Remote LoginBloomberg Anywhere Login Bloomberg Terminal Demo Request Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world. Customer Support French President Francois Hollande, left, and German Chancellor Angela Merkel leave after delivering a joint statement after the European Union Summit of 27 Heads of State or Government in Bratislava, on Sept. 16, 2016. Photographer: Stephane de Sakutin/AFP via Getty Images First summit without the U.K. promises concrete \"roadmap' Italy's <mark>Renzi</mark> brands migration progress a\" flight of fantasy' Share on LinkedIn Share on Reddit Share on Google + E-mail Share on Twitter Share on WhatsApp The U.K.'s impending exit from the European Union provided a kick start for the rest of the 28-nation bloc as leaders identified measures they hope will re-engage EU citizens and avert further disintegration. During an eight-hour meeting in a hilltop castle in the Slovak capital Bratislava, EU heads attending their first summit without Britain discussed national gripes about the bloc and tried to work out how to mesh them into a coherent and common way forward. The result was a \"roadmap\" of concrete steps toward closer cooperation on defense, spurring economic growth and bolstering security both internally and on the EU's external borders, with Brexit cited as the impetus to overhaul the way the EU works. \"Although one country has decided to leave, the EU remains indispensable for the rest of us,\" leaders said in a declaration after the summit. \"We need the EU not only to guarantee peace and democracy but also the security of our people .\" Having emerged from the embers of World War II, the EU is confronting the greatest ever threat to its existence. The U.K.'s vote to quit the club it joined in 1973, terrorist attacks in the EU's major cities, a wave of migration from outside its borders that's frayed the fabric of social cohesion and a jobless rate twice that of the U.S. have combined to strangle Europe's confidence and raise question about the bloc's force for good. \"Dislocation' Risk\" The risk of Europe's dislocation has never been this great, \"French President Francois Hollande said in a stark statement published on Facebook during the summit discussions .\" I'm really talking about a separation, and that means a return to borders, the end of free movement, the end of solidarity, the abandonment of the euro. \"With elections in France, Germany and the Netherlands next year and with anti-EU populists seizing on the bloc's difficulties to present their alternative view of the future, leaders know they are in a race against time to come up with solutions radical enough to win back support from voters. Leaders broadly fell into three camps at the summit, according to an EU official. Some want the bloc to focus on improving its response to migration and bolstering its external borders; another group wants more to be done to tackle youth unemployment that's nudging 50 percent in Spain and Greece; and a third set is mostly concerned about stopping the growing terrorist threat. <mark>Renzi</mark> Apart While the prevailing mood was one of unity, bad feeling boiled over into public as Italian Prime Minister <mark>Matteo Renzi</mark> said he was unable to hold a joint press conference with Hollande and German Chancellor Angela Merkel because he disagreed with them. For <mark>Renzi</mark>, who faces a crunch referendum of his own at a time when his country has the second-highest debt load in the euro area and stands on the front line for arrivals of refugees from Africa, the summit failed to live up to his hopes for an end to the EU's obsession with austerity and for ways cope with the migrant influx .\" I am not satisfied with the conclusions \"of the summit\" on growth and on migration \"and for that reason\" I cannot hold a news conference with Merkel and Hollande, not sharing the conclusions as they do, \"he said shortly after the summit finished. To say progress was made on migration\" is a flight of fantasy. \"EU President Donald Tusk set out leaders' targets for the months ahead, including guarantees to ensure full control of borders, continued work with Turkey and African countries on migration, intelligence-sharing to fight terrorism and exploring ways to cooperate in defense .\" We are determined to correct past mistakes, \"he said. What wasn't on the official agenda was the EU's future relationship with the U.K. post-Brexit, although Tusk reiterated that leaders have made clear they won't enter into negotiations with <mark>Theresa May</mark>'s government until formal notification of Britain's is posted. The period of EU introspection will continue at follow-up gatherings in Malta and Italy in the first three months of next year .\" Bratislava is not the magic moment where we'll wake up tomorrow to find Europe has been revolutionized, \"Belgian Prime Minister <mark>Charles Michel</mark> said after the summit .\" It's a process. \"Before it's here, it's on the Bloomberg Terminal. LEARN MORE"}, {"articleID": "2019052302_00301205_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Charles Reed": ["Q22106118", "Q5081968", "Q57412767"]}, "date": "2019-05-23", "url": "http://www.gamereactor.eu/?system=ps4&sid=ac89f8461540f343d6e8bf40ef18228e", "content": "PS4 Here's everything you need to know ahead of this year's E3. Review The Sinking City gets new gameplay trailer Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 16:00 Frogwares' game is due to launch next month, and here we get another look into <mark>Charles Reed</mark>'s journey into Oakmont. 0 Superhot VR arrives on the Oculus Quest Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:49 The team has been working to tailor the game for the tetherless hardware, which they particularly wanted for Superhot. 0 John Wick's Derek Kolstad making Just Cause film Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:17 Constantin Film is also on board to bring Avalanche's game to the big screen, as is Adrian Askarieh, Square Enix, and more. 0 Devil May Cry 5 has sold 2.1 million units so far Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 15:00 Capcom's new sales update has also revealed that Resident Evil 2 has shifted 4.2 million units, with both games releasing this year. 0 Parasites invade Just Cause 4 with Los Demonios DLC Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 13:42 This brings a whole new kind of threat to Solis in July, along with new enemies, weapons, and more to experience. 0 THQ Nordic acquires Piranha Bytes Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 13:11 The studio is responsible for the likes of Elex, Gothic, and Risen, and now THQ Nordic is coming on board to extend their existing relationship. 0 Valve \"not really sure what to do\" on AC: Unity review bomb Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 11:05 This was a positive review bomb after the Notre Dame fire, as players flooded into the game to see the virtual version for themselves. 0 A new Grid steers its way towards consoles and PC this year Written by Ben Kerry on the 22nd of May 2019 at 10:07 Codemasters has announced that the racing franchise is back after a five-year hiatus, and Grid 2 is currently free to try as well. 0 The Sims 4 is entirely free on Origin until May 28 Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 10:03 If you haven't experienced Simlish or creating an ideal virtual life for yourself, now you can for no cost whatsoever. 0 Watch us play the opening of Observation Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:30 No Code's game is finally here, and we've got a launch trailer as well as our livestream replay to share with you. 0 We're taking on Dauntless on today's stream Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:08 Phoenix Labs' action-RPG has just been released, so we're trying it out on today's stream to see what's what. 0 The Dark Pictures - Man of Medan releases in August Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 09:00 Supermassive Games and Bandai Namco have revealed a Curator's Cut as well, offering new perspectives on the story. 0 Toronto Defiant promote Gods and Sharyk to main team Written by <mark>Sam Bishop</mark> on the 22nd of May 2019 at 08 Both of these players have represented Contenders side Montreal Rebellion, and have now earned a place in the Overwatch League. 0 World of Warships: Legends hits one million global players Written by <mark>Sam Bishop</mark> on the 21st of May 2019 at 15:37 There is plenty still to come though, with the Atlanta Campaign, Free and Starter Packs, and Premium Ships this month. 0 World War Z has been played by almost two million Written by <mark>Sam Bishop</mark> on the 21st of May 2019 at 15:05 A new accolades trailer has also been released a month on from release, showing even more of the zombie game."}, {"articleID": "2015121520_00565823_W", "names": {"John Cameron": ["Q10468938", "Q1699530", "Q18164439", "Q24817361", "Q56718151"]}, "date": "2015-12-15", "url": "http://www.vulture.com/2015/12/fargo-season-three-2010-selfie-culture.html", "content": "On Tuesday, FX president John Landgraf and Fargo executive producers Noah Hawley, Warren Littlefield, and <mark>John Cameron</mark> held a Q & A with the press that covered everything from the third season of the anthology series to, yes, those UFOs. Co-creator Noah Hawley said he has already written the first episode of the next season and is currently working with his writing staff on outlining the rest of the episodes. Because the series is set in the winter, production will begin next November in Alberta, Canada, and the series won't premiere until spring 2017. Read on for more from Hawley on season three, and some closure on season two. The third season will move forward to 2010 and deal with our \"selfie-oriented culture .\" \"It's a more contemporary story, and I think that's exciting. Our first year was set in 2006, but we didn't really deal with what it was like to be in that region in a more contemporary world. I like the idea that we're now living in a very selfie-oriented culture where people photograph what they're eating and put it up for other people to see. It feels like a social dynamic that is very antithetical to the Lutheran pragmatism of the region. So many of our crime stories are based on the difficulty that people have expressing themselves and communicating. In a lot of ways, the tragedies that are at the heart of these crimes could all be averted if Jerry Lundegaard (William H. Macy) could have asked his father-in-law for the money or if Lester (Martin Freeman) could have been honest about who he was, or Peggy (Kirsten Dunst) as well. I like the idea of setting up these pragmatic and humble people against the culture of narcissism and [seeing] what that generates for us, story-wise .\" The main characters from season one will not be in the third season. \"None of the main characters from our first year will be back for our third year. The risk we take, obviously, is that we say at the beginning it's a true story. It's what Joel and Ethan Coen did in the movie, and what made the movie so powerful and poignant is that it ended. The danger of bringing them back and putting them through their paces for another crazy case [is] the artifice of the whole thing becomes too clear. That's not to say one of our stories might not intersect with characters we've seen before for a certain period of time .\" In the first season, Lou Solverson (Keith Carradine) told his daughter about the 1979 Sioux Falls massacre, which became the story line for the second season. The writers did not plant clues for the story of the third season in season two. \"We didn't really tee up the story of season three within the body of season two. That said, it's very exciting to now think once more, what else can you do with Fargo? What other kind of movie can it be? It proved in its first year it could be a similar but different story to the actual film. And in the second year, it proved that it could be a much larger epic that somehow managed to turn 1979 into a crime story. And then in the third year, the question becomes, structurally and stylistically, what's left to say, what do we do that feels similar but is different so we're not repeating ourselves? That said, we're always looking for connections and things that fit into the larger body of work that we're building .\" The last time we saw Charlie Gerhardt in season two, he was in jail--but he didn't stay there long. \"I think he served about four years in prison and got out as the sole surviving Gerhardt and had to make a life for himself. On a lot of levels, he's left behind as the last man standing of the Gerhardt family. I'm sure he took a long hard look at himself and his nature, which was much more gentle and in conflict with his upbringing .\" And about those aliens...\"As we used it in the ninth hour--at the point [where] the violence and chaos of our story and of the period became both so deadly and absurd on a real level--the UFO manifests that kind of absurdity in our story. There are two things that I felt gave me permission to use it: The Coens had used a UFO as a conceit in The Man Who Wasn't There. A lot of the imagery had been there. That movie, of course, took place in a much earlier time period. But also the fact that in 1979, two years after Close Encounters of the Third Kind and Star Wars, it was very much in the Zeitgeist--after the kind of crazy political upheavals of the '70s where everyone realized that the conspiracy really did go all the way to the top, and that sense of paranoia in American life was so heightened. It literally felt like you couldn't trust anything, even the skies .\" "}, {"articleID": "2016050900_00158378_W", "names": {"Kevin Allen": ["Q28421808", "Q28556645", "Q561356", "Q6395712", "Q6395714", "Q6395715"], "Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "Mike Sullivan": ["Q14950026", "Q1933555", "Q3313555", "Q6848980", "Q6848981", "Q6848982", "Q6848983", "Q6848986", "Q882921"]}, "date": "2016-05-09", "url": "http://wgrz.com/news/nation-now/allen-penguins-must-return-fleury-to-net-for-game-6/180763144", "content": "<mark>Allen</mark>: Penguins must return Fleury to net for Game 6 <mark>Kevin Allen</mark>, USA TODAY Sports, WGRZ6:49 PM. EST May 08, 2016CONNECTTWEETLINKEDINGOOGLE + PINTEREST Rookie goalie <mark>Matt Murray</mark>'s .937 save percentage and 1.96 goals-against average have dramatically exceeded expectations in these playoffs and yet he isn't the Pittsburgh Penguins' best option in net. Veteran Marc-Andre Fleury should receive the start in Game 6 of the Penguins' series against the Washington Capitals. Pittsburgh leads the series 3-2 but returns home on Tuesday following a 3-1 loss. Coach <mark>Mike Sullivan</mark> hasn't said who will play, and went out of his way Sunday to praise <mark>Murray</mark>'s performance. \"(<mark>Murray</mark>) has provided the timely save for us throughout this playoff series,\" <mark>Sullivan</mark> said. \"We feel strongly that he gives us a chance to win .\" Although <mark>Murray</mark> gave up three goals on 19 shots against Washington in Game 5 on Saturday, it was not his fault that the Penguins lost. At 21, <mark>Murray</mark>'s poise and polish have been impressive. But there's more to consider. <mark>Murray</mark> has played 21 games in his NHL career. Fleury has appeared in more than 700. Fleury was 35-17-6 and had won nine of 10 starts before he went out with an injury. Fleury carried the Penguins when they were not playing well early this season. Fleury has 53 won playoff games in his career, and most important, one Stanley Cup championship. <mark>Murray</mark> doesn't deserve to sit. It's that Fleury deserves to play. This is still a veteran's league and veterans understand what needs to be done to close out a series. Leading 3-2 in the best-of-seven series, the Penguins need to put away the Capitals on Tuesday and not risk returning to Washington for Game 7. The Capitals looked quite dangerous on Saturday. They played with great energy. Alex Ovechkin showed determination. This is a team that feels as if they own the momentum now. If Fleury skates into that net in Game 6, the Penguins will get a lift. He's always been a popular player in Pittsburgh's dressing room. The only question Fleury is whether his game has rust after sitting out for 38 days. In the first round, when both Fleury and <mark>Murray</mark> were out, third-string goalie Jeff Zatkoff started his first game in 51 days and made 35 saves to lead the Penguins to a victory against the New York Rangers. While benching <mark>Murray</mark> may seem unfair after he has brought the team to within one victory of the Eastern Conference final, it's also unfair for an established player such as Fleury to lose the No. 1 job to an injury. In the near future, when the expansion draft is expected, the Penguins are going to have to choose between <mark>Murray</mark> and Fleury. Since <mark>Murray</mark> is 10 years younger and much cheaper, he will likely be the goalie they keep. <mark>Murray</mark> is their goalie tomorrow, but Fleury should still be their goalie today. GALLERY: BEST OF SECOND ROUND"}, {"articleID": "2009080716_00052034_W", "names": {"David Seaman": ["Q214498", "Q22665693", "Q43394623", "Q57432101"]}, "date": "2009-08-07", "url": "http://cnn.com/2009/TECH/08/07/twitter.attack.reaction/index.html?eref=rss_tech", "content": "twitter blackout left users feeling \"jittery,'\" naked' some twitter and facebook users panicked as the sites went down thursday several online social networks were the victims of cyber-attacks one twitter user says she felt \"naked\" without her micro-blog another says he felt \"jittery\" during the time twitter was down by john d. sutter cnn (cnn)--christina cimino was logging onto twitter on thursday morning when something happened that she found deeply unsettling. ireporter <mark>david seaman</mark> says twitter needs a competitor so users don't panic when it goes down. \"i got some weird error message, and i'm like,\" what's going on!? \"the 24-year-old said. that error message was the scourge of online social networkers worldwide on thursday as cyber-attacks shut down twitter and caused sustained glitches in other social-media sites like facebook and the blogging site livejournal. twitter co-founder biz stone wrote the sites were the victims of what\" appears to be a single, massively coordinated attack. \"and a pro-georgian blogger, whose accounts on facebook and twitter reportedly were the targets of the denial-of-service attack, told cnn the online strike was timed to coincide with the one-year anniversary of the russia-georgia conflict. what may prove more lasting about the day social networking suffered its first major blackout is the degree to which people cared. near-panic erupted in some corners of the internet as people lost cherished links to their online friends, family members and news feeds. watch cnn ireporters talk about the attack part of the panic relates to the sheer popularity of the sites. twitter saw a more than 1,300 percent jump in unique visitors between february 2008 and february 2009, according to nielsen netview. the site, which lets users post messages of 140 characters or less, had more than 44 million worldwide users in june, according to comscore. more than 120 million users log onto facebook at least one time each day, the site says. to be sure, not all facebook and twitter users freaked out because of the attacks. some people even reveled in the mayhem. don't miss pro-georgia blogger\" george' target of twitter attack twitter hit by denial-of-service attack but for people like cimino, who said she \"felt naked\" without access to twitter, the attacks were a serious reality check--a chance to evaluate just how dependent they'd become. \"you know how you pat your pockets for your cell phone and your keys? well it's that same kind of phantom [limb] with twitter,\" she said. \"it's like,' i can't update! i can't update!' it's just one of those bugs that gets in you .\" she added: \"i was pretty upset, actually. it feels like a lifeline for me...pretty much everyone knows almost every detail of my life by what i'm doing on twitter .\" it's not worth analyzing whether these online connections are good or bad because the reality is that twitter and facebook are now an important part of our lives, said marc cooper, a journalism professor at the university of southern california's annenberg school for communication. \"for many people, and not just young people, the web is not just media, it's actually a place where they conduct their lives or a portion of their lives,\" he said. \"so the panic [thursday] morning is only reflective of that. this is not just a hobby or an amusement or another accoutrement, it's actually deeply woven into their lives and is integral to their social interaction. so when it's cut off, it's a problem .\" others saw twitter's existence as the problem and relished the chance to make fun of a web site that has become so omnipresent in news cycles. \"horrors!!! people will have to communicate face to face!\" one user commented on cnn's scitech blog. another commenter said, \"turn off your computers and read a book or get outside and discover there is more to life than cyberspace. the internet has become nothing more than the new cocaine .\" now that twitter is back online, the no. 1 conversation thread on the site is called \"whentwitterwasdown,\" where users discuss what they did without their real-time twitter updates. some people are mocking the blackout. a user named paulwilks, for instance, wrote, \"i took up juggling .\" others seem concerned. \"i did absolutely nothing. it's like my heart was gone,\" wrote a user named harajukuxbarbie. \"i felt so empty inside,\" wrote another twitter user called freinhar. some business people on thursday realized just how much they depend on facebook and twitter to do their work. adam ostrow, editor-in-chief at mashable, a blog that covers social media, said the outage made it difficult for his organization to cover the news and to promote its stories. \"for someone like myself who spends all day on twitter, it's incredibly frustrating,\" he told cnn.com live. justin stauffer, a 31-year-old who works in web strategy at a marketing company near philadelphia, pennsylvania, said thursday's attack made him realize just how dependent on twitter he had become. \"when something that's so central to how you do your business or how you gather information goes down, yeah, you get a little jittery--like, when's it going to be back,\" he said. \"i didn't break out in hives or anything like that,\" he said, jokingly. <mark>david seaman</mark>, an ireporter in new york, said he thinks twitter needs a competitor so users will have an alternative if the site is down. watch <mark>seaman</mark>'s talk about the issue on cnn's ireport and amy gahran, who writes about social media on a blog called contentious, said all technologies can break down, so people need to make contingency plans. \"hell, when you get down to it, you can lose your voice or break your writing hand or have a stroke and be unable to communicate. we are fundamentally social creatures, and when we lack our usual communication channels it's scary,\" she writes. \"don't panic. have a backup plan, and be prepared .\" cooper, the usc professor, said the fuss surrounding thursday's attack is a sign that instant, online communication is here to stay. fighting the trend would be like trying to stop the ocean's tides, he said, but it's unclear where the technology will take our society. \"the bottom line is that we don't know. all of this is too new,\" he said. \"it's like sitting around in the year 1500 and trying to figure out where the printing press was going to take us .\" e-mail to a friend share this on: mixx facebook twitter digg del.icio.us reddit myspace stumbleupon | mixx it | share"}, {"articleID": "2015052418_00017282_W", "names": {"Michael Smith": ["Q15637781", "Q1620255", "Q16207164", "Q16225563", "Q1627389", "Q16976514", "Q1720858", "Q18325554", "Q18325556", "Q18344457", "Q1929419", "Q1982423", "Q21175251", "Q3856267", "Q52907019", "Q56394971", "Q58870848", "Q6829665", "Q6831697", "Q6834460", "Q6834463", "Q6834464", "Q6834465", "Q6834468", "Q6834469", "Q6834471", "Q6834472", "Q6834473", "Q6834474", "Q6834475", "Q6834476", "Q6834478", "Q6834480"]}, "date": "2015-05-22", "url": "http://www.brookings.edu/blogs/brookings-now/posts/2015/05/how-to-create-opportunity-in-baltimore-and-beyond?rssid=Blogs", "content": "\"Since Freddie Gray's death and all that has followed, I think many of us, maybe all of us in Baltimore, have experienced a collective, pervasive ache .\" Jennifer S. Vey, a Brookings Metropolitan Policy Program fellow and Baltimore resident, shared her personal response to the death of Freddie Gray and subsequent riots while introducing a recent Brookings panel focused on creating more opportunities for young people and families in distressed communities and the role of place in poverty. Though the events in Baltimore served as the backdrop for a discussion among experts from the nonprofit, community development and public policy sectors, Vey reminded the audience that the challenges faced by her city \"are far from unique\" and that the difficult lessons learned and paths forward following its recent challenges can be applied to struggling urban areas nationwide. Remember that \"it takes a village\" Amy Liu, co-director of the Metropolitan Policy Program, echoed Vey's point, noting that there's currently a broad, national discussion taking place about poverty. (Including a In order to sustain this national conversation and identify real solutions, Liu stressed the importance of convening leaders and organizations who have been on the front lines of these issues. As she put it, \"to convert neighborhoods of poverty to neighborhoods of opportunity, it takes a village. And we've brought a mini village in today .\" Ensure that redevelopment is linked to employment opportunities Part of that village included Bart Harvey who, like Vey, calls Baltimore home. As former CEO of Enterprise Community Partners, a nonprofit focused on developing public-private partnerships to create affordable housing, Harvey helped families purchase about 400 homes in Freddie Gray's neighborhood, Sandtown-Winchester, 20 years earlier. When Harvey returned to the neighborhood a day after the riots, what he witnessed, he said, \"was very different than what you might have expected .\" \"Being a Baltimorean I was [initially] heartbroken, but when I went and toured all of the investments Enterprise had made, and they looked better than they did 20 years ago when we built there. Homeowners were there, and there was a beating heart at the center of Winchester. That was very positive and reassuring .\" If the investments made by Harvey's organization in housing were (and remain) successful, then what went wrong? Harvey said that a lack of economic growth in the area-and associated jobs-are likely to blame. \"There wasn't an economic driver that kept that redevelopment going past where the homeowners and stability were in Sandtown-Winchester. The employment didn't occur .\" The key, Harvey says, to sustaining growth in neighborhoods like Sandtown-Winchester is working to ensure that once housing investments are made, \"economic development and employment follow .\" Plan for change Donald Hinkle-Brown, CEO of The Reinvestment Fund, agreed with Harvey, and attributed careful economic planning to his organization's success in revitalizing other low-income Baltimore neighborhoods. Hinkle-Brown noted that after initiating prudently planned, data-driven building and investment projects, the private market has followed suit. \"The private market is drafting on our wind, and that is what makes it manageable in terms of public subsidies in today's environment of shrinking budgets,\" said Hinkle-Brown. But he was careful to distinguish his organization's work from traditional gentrification, reminding the audience that \"this is planned change. What we're trying to do is manage a joint effort [between public and private sectors] to build value and opportunity for existing residents and new residents in a way that's managed and self-sustaining .\" Focus on more doing and less planning Derek Douglas, vice president for civic engagement at the University of Chicago and former member of the White House Domestic Policy Council, joined the conversation with a unique perspective from both his past policy work and his current role as a representative of the largest economic driver on Chicago's South Side. Douglas's advice for moving the needle in our nation's most troubled urban areas: More doing, less planning. As he put it: \"If you go into these communities they'll have 50 plans, and every year some new group is coming to do a plan. And they feel that they're essentially planned all the time, with nothing ever actually happening .\" This phenomenon, Douglas said, \"is actually a negative for a community .\" In his role at the University of Chicago Douglas has put this advice into practice by helping fully implement civic engagement programs, like UChicago's Urban Labs, that leverage the university's offerings throughout South Side communities. Involve young people in improvement projects Joel Miranda, director of leadership development and graduate leadership at YouthBuild USA, a nonprofit that provides support for unemployed young Americans, says many of the solutions we seek for improving struggling communities can come from the very group that is often blamed for a variety of issues in these areas: local youth. \"If you simply stop and ask a young person what they'd like to do their community, they'll have lots of great ideas,\" said Miranda. Moreover, once some of those ideas are put into place, Miranda says young people are more likely to feel a connection to and invest in the well-being of their communities. \"Once young people are building community assets, they remember that for a lifetime. They drive past that house, that building that they helped build, and they say' I built that, and therefore I am taking care of care of that .'\" When it comes to funding projects, \"un-crowd the field\" and \"bet on winners\" When it comes to successful grant giving, <mark>Michael Smith</mark>, special assistant to President Obama and senior director of cabinet affairs for My Brother's Keeper stressed the importance of funding the right, data-driven organizations. \"As obsessed as we are in American with data...our FitBits, our Apple watches, our Trip Advisor and our Yelp, when it comes to organizations that are supposed to be [our] springboards and safety nets, we throw that all out the window .\" Rather than continuing to invest in organizations \"because our grandparents invested in them, or because it has a friendly member in the legislature,\" he argued that in our current economy, the impetus is on funders to recognize \"that good is not good enough\" and to \"stop investing in organizations that are counting how many kids went through, and not counting real, meaningful impact .\" "}]