[{"articleID": "2012072902_00039684_W", "names": {"Eduardo Paes": ["Q56556418", "Q972007"], "Hugh Robertson": ["Q1824635", "Q22110135", "Q27830915", "Q480170", "Q5932499"], "John Armitt": ["Q16018043", "Q6219383"], "Alexander Litvinenko": ["Q18274700", "Q57410220"]}, "date": "2012-07-29", "url": "http://allnews.rss.themalaysianinsider.com/c/33362/f/567634/s/21d0a1a5/l/0L0Sthemalaysianinsider0N0Cbusiness0Carticle0Cbritain0Eand0Eaustralia0Ebattle0Efor0Ebig0Esports0Eprojects0C/story01.htm", "content": "britain and australia battle for big sports projects london 2012 was seven years in the making. here, rio 2016 olympic games organising committee president carlos arthur nuzman (left) and rio de janeiro mayor <mark>eduardo paes</mark> attend the inauguration ceremony of the athletes' park, august 6, 2011. the park will serve as recreation space for olympic athletes, with large green areas and arenas for concerts. business has joined in the countdown. - reuters file pic london, july 29 - the history of sport is studded with great anglo-australian clashes and that rivalry is spilling over into the business world as the two nations vie for juicy contracts from future olympics and world cup hosts. the stakes are high. brazil, russia and qatar will all stage major sports events over the next decade and are also spending heavily to build roads, railways and power plants to serve their fast-growing economies. australia, its reputation sealed by the success of the sydney olympics in 2000, styles itself as \"the go-to nation\" for major projects in a sports industry that is forecast to be worth us $145 billion (rm457 .8 billion) by 2015. \"sport is in our core, it's part of who we are and as a platform for business there is nothing better,\" australian sports minister kate lundy said at a reception in london yesterday evening to woo potential overseas clients. sports administrators and politicians from qatar, brazil and russia were on the guest list as australia showed how its companies could play a part in every step of the 10-year life cycle of major sports events - from bidding to post-games legacy - in a series of computer presentations. it is a model britain wants its companies to emulate after many of them were given work at the olympic park in east london, the centrepiece of a games funded by? 9 billion (rm44 .6 billion) of public money. \"in terms of the olympics, sydney is the benchmark on which london works,\" said british sports minister <mark>hugh robertson</mark>, an interested spectator as lundy spoke under the chandeliers at the australian high commission. \"our legislation is based on sydney and quite a lot of australian companies are involved in the delivery of the london games. we're sort of the oldest rivals and the greatest friends,\" he told reuters. foot in door <mark>john armitt</mark>, who heads the olympic delivery authority that oversaw the building of the london venues, believes the global exposure from the games should be good for british business. \"london is a massive shop window in terms of showing the world what we have been able to achieve here and building on the back of it,\" he said. brazil hosts the soccer world cup in 2014 and olympics in rio de janeiro in 2016. fellow emerging economic power russia stages the 2014 winter games in sochi and 2018 world cup. britain has broken off security cooperation with russia after the 2006 murder in london of kremlin critic <mark>alexander litvinenko</mark>. that limits the ability of its companies to bid for contracts to build stadia for the 2018 world cup where security needs to be addressed before construction can begin. after russia, the world cup will head to wealthy qatar which has plenty of money but little in the way of soccer grounds. <mark>armitt</mark> stressed the value of breaking into such markets when britain is locked in recession and the government is cutting spending on big building projects at home. \"if you look at what is happening in qatar, yes it's building new stadia for the football but alongside it there is just an ongoing very large investment in infrastructure and other sorts of buildings,\" he said. <mark>armitt</mark> cited the example of british builder carillion which was involved in the olympic park in london and recently won a 395 million pounds commercial property development contract in the qatari capital of doha. \"as with all international markets, it's a case of getting your foot in the door on the back of something,\" he said. it was inevitable that contractors would find themselves fighting their own version of the sporting contests that have helped to define britain's relations with \"down under'. guan eng mahu hishamuddin susun semula polis, ramaikan yang perangi jenayah, kurangkan intipan politik karpal singh jadikan pertuduhan hasutan dihadapinya sebagai isu pada pru-13"}, {"articleID": "2018090512_00181202_W", "names": {"Patrick Osborne": ["Q17521924", "Q7147434"]}, "date": "2018-09-05", "url": "https://www.prnewswire.com:443/news-releases/scality-ring-brings-public-cloud-private-with-hpe-greenlake-flex-capacity-300705228.html", "content": "Scality RING Brings \"Public' Cloud Private with HPE GreenLake Flex Capacity New consumption-based IT model for on-premises infrastructure with cloud-scale economics News provided by 08:00 ET Share this article SAN FRANCISCO, Sept. 5, 2018 / PRNewswire /--Scality, leader in software for distributed file and object storage and multi-cloud data control, today announced that its long-standing partner, Hewlett Packard Enterprise (HPE), is now offering HPE GreenLake Flex Capacity and HPE Scalable Object Storage with Scality RING software-defined storage on Apollo 4000 Systems. Streamlining petabyte-scale storage deployments, HPE GreenLake Flex Capacity gives customers a new choice for data storage deployments: consumption-based pricing for increased agility. Freeing up capital budgets and making growth effortless, this new HPE GreenLake Flex Capacity service offering from HPE Pointnext delivers best of breed Scality RING software on HPE Apollo 4000 servers configured, delivered, installed and managed to meet customers' specific needs. All that, and with the benefits of variable payments based on metered usage and vendor management .\" In the context of today's massive growth in unstructured data, elastic consumption combined with infinitely-scalable HPE Scalable Object Storage with Scality RING clearly makes good sense, \"said <mark>Patrick Osborne</mark>, HPE's VP & GM for Big Data and Secondary Storage .\" The HPE GreenLake Flex Capacity program brings the cloud into the data center, making storage and its inevitable expansion easier to accommodate with an elastic consumption-based technology acquisition model. \"\"This is a great deployment option for organizations that want the benefits of cloud but need the control and/or performance of on-premises IT,\" said Michelle Rockler, Scality's VP of Strategic Alliances. \"Customers can set up IT capacity, pay monthly fees based on usage, and easily scale up or down without repeated capital outlay and lengthy IT procurement processes .\" The HPE Scalable Object Storage with Scality RING offering is a software-defined storage platform that is density-optimized to allow organizations to seamlessly scale to petabytes and beyond in less physical space and without compromising data availability and durability. HPE Apollo 4200 (2U form factor) and HPE Apollo 4510 (4U form factor) servers are the foundation for HPE Scalable Object Storage with Scality RING, giving customers a choice in platforms to meet their requirements. About Scality Scality builds the most powerful storage tools to make data easy to protect, search and manage anytime, on any cloud. We give customers the freedom and control necessary to be competitive in a data driven economy. Recognized as a leader in distributed file and object storage by Gartner and IDC, we help you to be ready for the challenges of the fourth industrial revolution. Let us show you how. Follow us on Twitter @ scality and @ zenko. Visit us at www.scality.com. Press Contact"}, {"articleID": "2009051804_00014489_W", "names": {"Jason Morrison": ["Q2456253", "Q56246664", "Q6163150"]}, "date": "2009-05-18", "url": "http://news.com.au/dailytelegraph/story/0,22049,25500194-5001028,00.html?from=public_rss", "content": "islamic identity keysar trad still feels tormented by a 2005 defamatory sydney radio station broadcast, his daughter has told a judge. sanna trad, a 20-year-old journalist, said her father was \"definitely a lot more upset\" and less motivated to do community work since the 2gb broadcast, made shortly after the cronulla riot. she was giving evidence in the nsw supreme court at the second stage of a defamation hearing brought by mr trad, president of the islamic friendship association, against the station's licensee, harbour radio. in august 2007, a jury found broadcaster <mark>jason morrison</mark>'s tirade against mr trad contained eight matters that defamed the former spokesman for controversial muslim cleric sheik taj aldin alhilali. they included painting mr trad as a dangerous and disgraceful individual who incited people to commit acts of violence. his barrister clive evatt is calling witnesses to give evidence of mr trad's reputation and the effect of the broadcast. richard mchugh, sc, for harbour radio, will seek to show much of the defamatory material is true. the hearing is continuing before justice peter mcclellan. islamic identity keysar trad still feels tormented by a 2005 defamatory sydney radio station broadcast, his daughter has told a judge. sanna trad, a 20-year-old journalist, said her father was \"definitely a lot more upset & squo; & squo; and less motivated to do community work since the 2gb broadcast, made shortly after the cronulla riot. she was giving evidence in the nsw supreme court at the second stage of a defamation hearing brought by mr trad, president of the islamic friendship association, against the station & squo; s licensee, harbour radio. <mark>jason morrison</mark>: islamic spokesman\" tormented' by 2gb property: house affordability hits seven-year high"}, {"articleID": "2010031322_00060047_W", "names": {"David Miller": ["Q1175688", "Q12899557", "Q15455696", "Q16185473", "Q19875639", "Q20656547", "Q28870727", "Q3018511", "Q30607124", "Q404333", "Q404779", "Q5237563", "Q5237568", "Q5237569", "Q5237573", "Q5237574", "Q5237576", "Q55196713", "Q56458216", "Q57729525", "Q57832355", "Q6828449", "Q92986"], "Harry Rosen": ["Q42292483", "Q5672027"], "Steven Page": ["Q16211818", "Q7615119"]}, "date": "2010-03-13", "url": "http://network.nationalpost.com/NP/blogs/toronto/archive/2010/03/13/retail-therapy-due-west-amp-next-door.aspx", "content": "toronto mayor <mark>david miller</mark> announces big surplus and lower tax increases in 1990, george moumouris took over champion leather goods, his parents' queen street west mom-and-pop leather shop (founded in 1973). he had started developing a niche of cool clothes in the basement and eventually took over the main store upstairs with a new concept that focused on denim: due west clothing. in 2007, he expanded into the adjacent store † ¨ with more upscale collections and called it next door. the old basement is now a clearance area for past seasons and † ¨ discontinued styles. \"i think of 20 years, it's a lot of years,\" moumouris says. \"i swear it was just like yesterday that i was downstairs having a cigarette!\" moumouris tells the post's nathalie atkinson what's changed - and what hasn't. then queen street: \"it was a little grungy, you had worn-out storefronts but it had its cachet. the punk rockers with the motorcycle jackets at the black bull, the horseshoe tavern and the greasy spoon the stem .\" who was shopping: \"customers from around toronto, niagara falls - word of mouth back then was what the present-day has with blogs. they were 16, 17 years old and into their twenties. in those days you could smoke cigarettes in the store! there was an ashtray right on the cash table .\" denim: \"the mainstream jeans like levi's were $45 - $50. manager jeans tipped the charts at $65. and then replay was $165. that was' a month's rent' type of feeling. then evisu, energie, miss sixty - we were one of the first! i still remember the day i got the box of diesel women from montreal when they wanted to test it out. i did a bit of pepe, manager, joe bloggs - the really really wide and baggy jeans .\" trends: \"we were just jeans, boots and jackets. commodity-driven, not collection-driven. when replay first started off, it was just shirts .\" footwear: \"i used to dress the whole detroit red wings team! i had this one style of cowboy boots, in red, with a big eagle on the top called the wings. they all bought them, from sergei fedorov to sheldon kennedy. bob probert came shopping here on the first day he was allowed into canada after his probation. because it was really personal service. still is. there's a soul to it .\" now queen street: \"it's gotten commercial - you've got shoppers drug mart coming in [in the former caban building]. the rents went up but for the same reason the big-box stores came in, they're now leaving. buffalo has left, because it's not a mall street. there's still fashion crimes, boomer, get outside - we still have some of the old taste, the boutique niche market. i think the old queen street is coming back .\" who was shopping: \"clients who are allowed to wear more than just suits in the workplace, ages 20 to 40. and we've been bringing back our old customer - they grew up and got more sophisticated so we moved into next door with d & g, moncler, mackage, scandinavian labels like acne .\" denim: \"jeans start as low as $120 and work their way up. diesel's matic with abrasions or, if you're talking japanese denim, they can be $325. the jegging is big: j brand, genetic denim but the most comfortable is the dl1961 [$148]. it's got four-way stretch and the tag inside guarantees 360-degree comfort. and high-waisted unisex nudie longjohn jeans [$225]. really skinny!\" trends: \"you don't expect a store like next door to be downtown; it's a bit more yorkville flavour. i buy some of the same brands that holt's and <mark>harry rosen</mark> buy, but when i buy or my wife sophie buys the women's collection, even if it's a designer label, we look for brand value in each item. we don't discount, but people have the impression that we're less expensive because of the way we buy .\" footwear: \"we're bringing in wolverine, an industrial utility boot from the u.s.a., john varvatos special footwear and moncler footwear, tall boots, for women. men's sneakers from dsquared proclaim\" made in italy' [$485]. and when we first started, we had leather bags from greece and now i've got them custom-making leather gladiator sandals [$85] in unique styles for us coming in for spring and summer. \"rediscovering the city: a guidebook to contemporary architecture in toronto leah miller, <mark>steven page</mark>, ivan reitman and other notables talk about their city. a 26-part series that looks at the things that make this city special january 28, 2010 - today, on the podcast's second anniversary, we jump into the topic all toronto seems to be talking about, and that's the rash of pedestrian deaths in recent weeks - we'll specifically ask why council feels it must do something about it. then we'll move onto the admission yesterday from ttc brass that the city's transit system is in crisis, before closing on the recommendation from city staff that toronto drop one of its two marathons. new toronto <mark>page</mark> for news, sports, arts and more."}, {"articleID": "2011021223_00011945_W", "names": {"Mary Williams": ["Q13562532", "Q18936209", "Q19867085", "Q47120706", "Q56598008"]}, "date": "2011-02-12", "url": "http://nandugreen.typepad.com/chasing_the_wind/2011/02/chinese-miners-on-cedar-creek-a-historical-legeacy-1.html", "content": "gold in quartz? february 12, 2011 tales of chinese miners on cedar creek - a historical legacy discovery why some of montana's history was written in chinese. superior - standing in the mountains of a western montana forest, chris merritt smiled as he held up fragments of a culture from halfway around the world. the newly discovered artifacts - opium tins, soup bones, ceramic bowls, calligraphy stones, a poker chip, a snake oil bottle - are from the first large 19th century chinese mining settlement in montana. merritt, an archaeologist, handled the artifacts lovingly - as though they were the gold nuggets that the immigrants never found in the watery recesses of the lolo national forest. a volunteer group chosen through passport in time, \"in archaeology, you don't need to find whole objects,\" he said. \"fragments are enough to piece together the story of history .\" the history of chinese immigrants in the american west is well-known - laboring in mines, railroads and laundries, facing hardship and prejudice - but the university of montana and the u.s. forest service are teaming up this summer for the first detailed archaeological excavation of early chinese gold mining settlements in the big sky state. merritt, a doctoral student at um, will explore six sites in six national forests across western montana. his work is being overseen by kelly dixon, an assistant professor of historical archaeology at um. chinese laborers helped build the american west in the 19th century, but anti-chinese laws, animosity and an economic downturn forced many to return to san francisco, seattle or china before the turn of the century. in montana, chinese immigrants made up 10 percent of the state's population in 1870, a figure that dropped to about 4 percent by 1890. \"the chinese had a huge impact on every corner of this state, but we have huge gaps in our knowledge about how they adapted to what montana could throw at them socially and environmentally,\" merritt said. \"we know they had a classic story of the old west, going to the places of least resistance\" to seek their fortune and avoid the most overt prejudice, he said. \"in this case, it was china gulch and louisville .\" merritt's dissertation project, which is funded by a $24,000 grant from the forest service, started last week in china gulch and louisville, an 1870s gold mining settlement near superior, where archaeologists have documented the only known remnants of the first large influx of chinese workers into montana. over the years, the six chinese settlements have been documented - as well as looted - and preliminary evaluations have been completed, but merritt's project will be the first comprehensive study of the sites. after gold was discovered in california in 1849, thousands of americans and foreign immigrants flocked to the western united states to seek their fortune. following rumors of gold, prospectors raced from place to place, staking claims and setting up mining camps along streams and mountainsides. white prospectors tended to work alone or in pairs, but chinese banded together in small groups in an effort to improve their chances. boomtowns sprung up overnight and often disappeared just as quickly. one such place was louisville, where two frenchmen found gold in cedar creek in december 1869. the men filed a claim and made a pact to keep the site a secret until they returned in the spring, but one of them drunkenly disclosed the discovery while visiting a missoula saloon. a gold rush ensued, drawing prospectors from around the region, including missoula where the population dropped from 2,500 to 500 as townsfolk headed north and west to cedar creek. by the spring of 1870, 1,100 people had set up camp on about two acres beside the creek, pitching tents and erecting log buildings in a settlement they named louisville - pronounced \"louise-ville\" after the wife of one of the french prospectors. but a few months later, all but about 100 of louisville's inhabitants had departed for other prospecting sites after having failed to find significant gold in cedar creek. at the same time, idaho's moose creek mining district passed a law prohibiting chinese from owning mining claims or property. so about 500 chinese prospectors came over the bitterroot mountains that summer and settled beside the nearly empty louisville, where they sought gold from an unnamed creek just upstream of cedar creek. their settlement became known as china gulch and the feeder creek as china creek. they put up tents, built rock cooking ovens and placered gold, but it was harsh terrain and they faced starvation. in 1871, after all but a few white prospectors had abandoned louisville, the chinese moved in and stayed until the late 1880s - when they departed after failing to strike it rich. mining companies reoccupied louisville in the 1890s and 1930s, using it as a base for industrial mining until the 1950s, when the settlement was abandoned for the last time. archaeology - and looting - have been around for as long as people have wanted to document and profit from human and natural history. in 1979, the federal archaeological resources protection act outlawed looting, but louisville had been picked over by then by mineral county residents and artifact hunters who took most of the intact items. china gulch was reclaimed by the thick, damp forest and largely forgotten. maps mistakenly located it half a mile away. in 1995, <mark>mary williams</mark>, a forest service historian, led an expedition that discovered the actual site of china gulch when they uncovered the remains of the rock ovens. they were the first such hearths identified in western montana. the forest service determined china gulch to be a significant find, but the agency lacked the money and work force for a complete excavation, said milo mcleod, archaeologist for the lolo national forest. \"we were excited, but we didn't know what we really had\" until 2007 when merritt did a more thorough examination of the site, mcleod said. \"we got such unique information that we wanted to do a full follow-up investigation .\" among the most important evidence uncovered are 2,000 fragments of animal bones that the chinese prospectors had boiled for marrow soup. the bones had been chopped and boiled repeatedly in a desperate attempt to fight off starvation. \"these are the kinds of things that tell the stories of the daily lives of these immigrants,\" merritt said. besides physical evidence, project officials also are using newspaper stories, claim records, maps and other materials to piece together the history of china gulch and louisville. another important source of information is area residents, who can relay stories their families have told for generations and who collected artifacts before it was illegal, merritt said. small amounts of gold are still present in china gulch and cedar creek, where prospectors still file mining claims. an estimated $6 million to $7 million in gold has been found in cedar creek since 1870, a relatively small amount in the history of western gold mining, merritt said. harsh mountain weather, collectors and bulldozers left little surface evidence of the early occupation of the two settlements - except for the rock ovens and a collapsed log building that might have been a saloon, hotel or general store. in the 1930s, the federal government inflated the price of gold in an effort to spur economic development during the depression. mining companies reopened louisville and pushed most of the original town into cedar creek. much of the new excavation is being conducted by the forest service's passport in time program, which uses volunteers on archaeological and historic preservation projects nationwide. merritt and mcleod are overseeing the work. working up a sweat in the mountain sunshine, the volunteers pulled away brush - to uncover some areas that looters might have missed - then marked off the sites and sifted down through the layers of dirt. \"i love it,\" said volunteer steve waylett, a retired navy flight officer from idaho. \"it's a chance to see history come alive .\" china gulch and louisville may be opened to the public and an interpretive sign and walking trail constructed after the excavation is completed by late summer. some of the artifacts are to be displayed at the mineral county historical society museum in superior. mike beckes, archaeologist for the forest service's northern region, said merritt, who is just starting his professional career, and mcleod, who is retiring soon after more than three decades in the field, have formed an effective partnership. \"we know there was a chinese presence here, but we don't know the fine detail - how these people lived, what they ate, their illnesses, where they got their supplies,\" beckes said. \"there's a lot more to tell .\" your comment could not be posted. error type: your comment has been saved. comments are moderated and will not appear until approved by the author. the letters and numbers you entered did not match the image. please try again."}, {"articleID": "2013092623_00012682_W", "names": {"Derek Thompson": ["Q23777638", "Q45099198", "Q5262402", "Q5262403", "Q5262404"]}, "date": "2013-09-26", "url": "http://ntdaily.com/four-games-in-standout-football-players-this-season/", "content": "Sports> Four Games In: Standout football players this season The Mean Green football team has hit a break point in its schedule. After four non-conference games, certain players are already beginning to stand out from the pack. Offensive Standout Senior quarterback <mark>Derek Thompson</mark> has already led UNT (2-2) on comebacks against University of Ohio (3-1) and Ball State University (3-1), finishing the win against Ball State. \"He is clearly the most improved player on the offense and we've just scratched the surface,\" head coach Dan McCarney said. \"He's really confident, showing a lot of maturity in the pocket by making better decisions with the ball .\" During the offseason, <mark>Thompson</mark> slimmed down to help provide another aspect at the quarterback position by running the ball. Through four games, <mark>Thompson</mark> is third on the team in total rushing with 79 total yards, including a career-high 26-yard touchdown run that was the game-winning score. Senior wide receiver Darnell Smith leads the team in receptions, receiving yards and touchdowns. Teams have been focusing extra attention on Brelan Chancellor, but might have to rethink their strategy given Smith's production on the opposite side of the field. Defensive Standout Senior linebacker Zach Orr takes his team captain role very seriously while leading the Mean Green defense. \"Coach gave us a mission to force more turnovers this year and to be a great defense,\" Orr said. \"Every day at practice we work on stripping the ball and falling on it .\" Orr is the heart and soul of the defense, leading the team with 42 tackles and adding two forced fumbles and two fumble recoveries. McCarney said the defense starts with Zach Orr and that he can be named MVP of the football team just about every week. Zach Orr may be the captain, but junior safety Lairamie Lee has been his second-hand man so far. His role in coming forward into the box and stopping the run game has helped the defense play as well as it has. The Mean Green defense has become something to behold. The UNT defense is in the top 10 teams in turnover margin, top 15 in opponent red zone conversions and leads the nation in takeaways. Many of the fumbles are thanks to hard-hitting safeties junior Lairamie Lee and senior Marcus Trice, who have become a key to watch when the UNT defense takes the field. \"They're not the biggest players on the field, but if you're not running like you're supposed to, they're going to hit you hard,\" senior running back Brandin Byrd said. \"I've been hit by both of them many times in practice and you learn quickly to keep your head on a swivel when they're around .\" <mark>Derek Thompson</mark> had peaks in previous seasons, but has never strung together four solid games like he has so far this year. His improved consistency is a huge factor in UNT's 2-2 record. Most Exciting Player McCarney said the team's most exciting player award so far goes to senior wide receiver Brelan Chancellor. He was awarded Conference USA Special Team Player of the Week after recording a 99-yard kick return touchdown against Georgia, and is fourth in the nation in punt return yards. \"He's such a dynamic playmaker. That's what we missed so much last year when he broke his collar bone,\" head coach Dan McCarney said. \"He's motivated for a lot of reasons. It's his senior year, he has great pride and he wants to leave a real legacy behind in the return game .\" No disagreement here. Chancellor is worth the price of admission all by himself. Tim Cato, Sports Editor contributed to this story. Golf teams in action for first time since beginning of September Golf teams in action for first time since beginning of September Golf teams in action for first time since beginning of September"}, {"articleID": "2011042716_00071191_W", "names": {"James O'Keefe": ["Q6140497", "Q6140500"], "Jay Rosen": ["Q1378510", "Q554143"]}, "date": "2011-04-21", "url": "http://cbsnews.com/8301-503544_162-20041326-503544.html?tag=delicious", "content": "(credit: cbs/ap) updated 6:18 p.m. eastern time even before conservative activist <mark>james o'keefe</mark> released a hidden camera video showing now-former national public radio executive ron schiller criticizing the tea party and republicans - and saying \"we would be better off in the long-run without federal funding\" - npr was facing perhaps the greatest threat to its taxpayer subsidy in its history. the reason? america's debt and deficit problem had gotten large enough that lawmakers from both parties had finally begun efforts to deal with it. and for the republicans who took over the house in january, there were few targets for spending cuts more tempting than public broadcasting, which conservatives have long derided as a taxpayer-subsidized bastion of liberal elitism. last year, president obama's bipartisan deficit budget commission recommended eliminating funding for the corporation for public broadcasting (cpb), which was allocated $432 million from the government in fiscal year 2011 to distribute to public radio and television. the republican-led house passed a spending bill for the remainder of the current fiscal year that would have eliminated cpb's funding, but the democrat-led senate voted it down wednesday; the parties are now trying to work out a compromise on a spending bill, and cuts to cpb remain very much on the table. (two republican senators have also introduced a (credit: npr) less than ten percent of npr's budget comes from federal funding. (hotsheet took a detailed look at npr funding here; npr does not take a direct allocation from cpb, but it gets taxpayer money through member-station dues as well as grants .) republicans argue that npr \"would be fine\" without federal money, in the words of sen. jim demint (r-s.c.), who says that \"forcing taxpayers to give public broadcasting hundreds of millions of dollars makes little sense when we're facing a $14 trillion debt and there are already thousands of educational and entertainment choices in the media .\" (one side note here: the majority of npr funding comes from tax-deductible donations from individuals and corporations, so even without the cpb funding, taxpayers would still--indirectly--be subsidizing npr .) cpb says that $96.2 million from its fiscal year 2011 allocation is going to public radio, with the majority of that going to local stations and projects, not npr itself. ($288.5 million of the cpb allocation is directed to public television; the rest goes to cpb operations and support .) while npr could likely survive without the federal subsidy, npr says many of its local member stations would not, something schiller noted in his secretly-recorded comments. supporters of npr argue that public radio is a valuable source of quality news that many americans - particularly in rural areas - would lose access to if their member station were to close. \"every month, more than 170 million americans turn to their local public broadcasting stations for free, high-quality programs that focus on the issues most important to them - what's happening in their community,\" congressman earl blumenauer (or-03), founder and co-chairman of the bipartisan congressional public broadcasting caucus, said in a wednesday statement. he added that 21,000 public broadcasting jobs across the country would be at risk without the subsidy. \"as traditional news outlets lay off reporters and offer less coverage of important topics, public broadcasting is filling the gap, bringing critical news and information to communities across the country,\" blumenauer added. \"what's more, public broadcasting stations are the only source of free programming that educates our children rather than the many commercial stations simply trying to sell them products. our communities, our workers and our children would be the true victims of any cuts to funding for public broadcasting .\" (at left, sen. bernie sanders of vermont argues in favor of taxpayer funding for public broadcasting .) for opponents, this argument is absurd; the market, they say, provides the programming that people want. and besides, they argue, npr is not simply a news outlet but rather a purveyor of a liberal agenda - a perception heightened by schiller's criticism of the tea party movement as \"racist\" and comment that \"liberals today might be more educated, fair and balanced than conservatives .\" (schiller was an npr fundraiser who did not have an editorial role at the network .) eric deggans, the media critic for the st. petersburg times who also contributes to npr, said in an interview that he believes npr makes a concerted effort to be fair in its news coverage. (deggans stressed that his connection to the network made him less than impartial .) \"when it comes to their opinion shows and their commentary shows and stuff like that, they're focused on kind of a college educated audience,\" he said. \"and they have a very tight focus on who their listenership is, and they're creating shows that speak to those people. i think sometimes people see that focus and they translate that into a liberal bias .\" ombudsman reported that 50 percent of the npr audience sees the network's coverage as balanced, while roughly 40 percent sees the network as liberal and four percent see it as conservative. according to independent data, it was more likely to be seen as fair in its coverage than pbs, abc, nbc, cbs, cnn, fox news channel and msnbc. (as for the npr audience: according to mediamark research, 37 percent identify as liberal, 28 percent identify as conservative, and 25 percent identify as middle of the road .) in an interview, <mark>jay rosen</mark>, who teaches journalism at new york university and runs the blog pressthink, stressed the ideological balance of the npr audience. he also said attacks on npr grounded in charges of bias were more about the culture war than reality. \"it's impossible to determine [bias], because bias is itself a category subject to bias,\" he said. \"and i don't know the way out of that loop, i don't think anyone does. so bias is a club that people use to beat the news media with, and it has been wielded very successfully in this case .\" conservative commentator and media figure andrew breitbart said the debate over npr's bias is \"long over,\" though he said \"npr is my favorite of the biased media news organs .\" (asked why, he added: \"i like a lot of the local news programming, and there's something pleasant about the whispery, willowy news delivery .\" ) \"i think a lot of their in depth stuff is very, very interesting, but it's important to understand that you're getting liberals and leftists presenting the news in as unbiased way as they possibly can, and it's still exceptionally biased though that machinery,\" he said. breitbart, an ally of <mark>o'keefe</mark>, boiled down the debate over npr's funding this way: \"those on the left want it publicly funded because it comports with their worldview. those on the right because it doesn't comport with their worldview .\" (credit: michael benabib, ap photo/npr) white house press secretary jay carney on wednesday said the obama administration opposes efforts to eliminate public funding for public broadcasting - though he declined to spell out exactly why the funding was necessary. that prompted republican national committee spokesperson kirsten kukowski to argue that \"the fact that the white house can't defend but insists on showering hundreds of millions of dollars on npr in the midst of a fiscal crisis shows this administration has zero credibility on addressing their addiction to spending .\" decision to accept the resignation of ceo vivian schiller (no relation to ron schiller), which was criticized by many on the left, was designed to bolster npr's chances of hanging onto its federal subsidy. (schiller, who was widely criticized by conservatives for her handling of the firing of commentator and fox news contributor juan williams, said in an interview with the associated press wednesday that her continued presence in the wake of the ron schiller incident complicated the network's efforts to maintain the subsidy .) but the resignation was not enough for brent bozell, president of the conservative media group the media research center, who argues that \"npr hates middle america .\" \"the resignation of vivian schiller doesn't change a thing about npr,\" bozell said in a letter to members of congress wednesday. \"...a government that is broke should not be in the business of funding a left-wing playground .\" in a statement released wednesday afternoon, cpb said \"public broadcasting educates our children, increases our sense of community as americans, and provides a respectful non-commercial alternative on a hyper-commercial media landscape .\" trump takes credit for obama birth certificate release, but wonders \"is it real?\" by moretruthnow march 12, 2011 1:30 am est by moretruthnow march 12, 2011 1:30 am est with 100s of tv and radio stations, the american taxpayer should not be forced to fund one. we have very hard choices to make on federal spending. this is not one of those. politicians don't want to be the ones in office to make those choices, that is why many of them say they will not run again. they know what has to be done in order to save this nation - they are just to gutless to handle it on their watch. they want to push this off on the next guy. we have to make very hard choices in a lot areas that no one wants to have to make - we will have to make huge reductions in the size and scope of the federal government. let's put this in perspective: a 2005 washington post article stated that had a \"$318.62 billion deficit\" for the 2004 year. this was for the entire year!!!!!! today, the idiots in washington are over spending at the rate of $222.5 billion in a month!!!!!! this is totally insane. the cbo stated that this deficit spending is \"unsustainable\". what does washington not understand about the word \"unsustainable\" ?????? washington is out of control. and some people wonder what some americans mean by the term \"take our country back\" ??? we have to take this nation out of the hands of irresponsible fools, who are running this once great nation into the ground. to some degree we will have to wait for 2012. however, the need is now. call and write your representative and give him/her an ear full! washington is drunk on spending away our future. maybe millions of phone calls and emails will wake them up a little. by gosstom march 11, 2011 2:51 am est by redkcir-2009 march 11, 2011 12:44 am est march 11, 2011 1:40 am est it's here for me. it's here for you,...by ongelooflijk-2009 march 10, 2011 10:44 pm est npr and pbs: unbiased news, commentary and public interest programming at its finest i've been a fan of npr and pbs for over thirty years and they are about as unbiased as they come. the reason you neocons hate them so much is that they don't push your brand, or any brand for that matter---- - because they are national public radio and the public broadcasting system (emphasis on public) for obvious ethical reasons they can't and won't--while going above and beyond to insure unbiased coverage! in addition, they don't play to advertisers or the ratings which i think is admirable. as regards ron schiller, he's certainly entitled to his private opinions, yet in his capacity as a fundraiser and while on the stump for npr he ought to have used more discretion. the posting of advertisements, profanity, or personal attacks is prohibited. by using this web site you agree to accept our report offensive content: if you believe this comment is offensive or violates the cbsnews.com terms of use, you can report it below (this will not automatically remove the comment). once reported, our staff will be notified and the comment will be reviewed. offensive: sexually explicit or offensive language advertisements, commercial links, or repetitive posts disruptive posting: flaming or offending other users illegal activities: promote cracked software, or other illegal content e-mail this comment to a friend. e-mail this to: send me a copy of this message note: your e-mail address is used only to let the recipient know who sent the e-mail and in case of transmission error. neither your address nor the recipients's address will be used for any other purpose. royal wedding rehearsal miliatry troops rehearse their roles in friday's royal wedding a glimpse at the days news as seen through a camera's lens britain's ministry of defense releases a few never-before-seen photos of the prince's time with the royal navy in 2008 even little changes can bring big improvements in productivity and mental focus 60 minutes ipad app watch segments on demand, browse archives, & get the story behind the story."}, {"articleID": "2013071622_00046206_W", "names": {"Robert Barnett": ["Q3348517", "Q3434508", "Q57084965"]}, "date": "2013-07-16", "url": "http://theleafchronicle.com/viewart/20130716/NEWS01/307160013/Criticized-Petraeus-take-1-salary-NY-school", "content": "Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the...A Clarksville man has been arrested on drug charges following a search of his home on Peacher's...\"Toxic leadership' a rare but potent trigger in Fort Campbell suicides A challenging schedule has always been a part of the formula for Austin Peay women's basketball...Austin Peay's offense figures to rely more heavily on the passing game this fall under its new...Let me get this clear. - 3:32 pm LETTER: Legislators should be fighting for teachers, not against them Delusions of Glamour: Books and exotic experiences take young minds far away When I was a kindergartner, I had this wonderful teacher who sent my mind reeling toward exotic...Diane Welker's At the Table: Hot diggety dog, eat 'em in honor of hot dog month July is National Hot Dog month, and I almost let it slip by unnoticed...NEW YORK - Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the City University of New York's honors college after being criticized for how much he was getting paid. Petraeus, a hero of the Iraq and Afghanistan wars who quit the CIA in scandal last November after it was uncovered he'd had an affair with his biographer, will teach a seminar at Macaulay Honors College in the next academic year for $1, The New York Times reported on Monday. That's down quite a bit from the $200,000 that Gawker.com first reported he was getting paid based on documents it obtained. The high salary for someone teaching one class spurred outrage in a system in which the average full-time faculty member salary is just under $90,000. Petraeus, who was a four-star general, proposed the salary reduction\" to remove money as a point of controversy, \"his attorney said .\" The general never was taking on this teaching assignment for the money, \"said the attorney, <mark>Robert Barnett</mark>.\" Once controversy arose about the amount he was being paid, he decided it was much more important to keep the focus on the students, on the school and on the teaching and not have it be about the money. \"Petraeus has a doctorate from Princeton University and has written widely on international relations, military strategy and tactics and national security issues. He's scheduled to start his job as a visiting professor for public policy on Aug. 1. When Macaulay announced Petraeus' new job in April, he said he was pleased to teach at the college, where most students are the children of immigrants. He said he looked forward to leading a seminar on the global economic slowdown. Macaulay Honors College's dean, Ann Kirschner, said Petraeus has\" engaged the Macaulay and CUNY community with generosity and energy. \"\"Toxic leadership' a rare but potent trigger in Fort Campbell suicides Criticized Petraeus to take $1 salary at NY school Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the City University of New York's honors college after being criticized for how much he was getting\" Toxic leadership' a rare but potent trigger in Fort Campbell suicides Become a subscriber today to enjoy these benefits: iPad-optimized edition Mobile site & iPhone app Are you currently a subscriber? Set up your digital access now. You now have full access. Thank you for subscribing. Access the tablet-optimized site, mobile site and iPhone app Share your access with any friend or family member Subscriber exclusive Top 5 daily email newsletter Create an account or if you have a digital profile To continue using your current Web browser, Adobe Flash must be installed or upgraded:"}, {"articleID": "2017072317_00624227_W", "names": {"Harmanpreet Kaur": ["Q3525920", "Q52239619"]}, "date": "2017-07-23", "url": "http://indiatoday.intoday.in/story/mithali-raj-heartbreak-womens-world-cup-jhulan-goswami-final-india/1/1009151.html", "content": "India Today googlepluse Mithali Raj's heartbreak in World Cup final continues after India go down by 9 runs Mithali Raj's wish of lifting the World Cup remained so as India lost to England by nine runs at Lord's. In 2005, she was a captain of the side that lost to Australia in the final at Centurion in 2005. Highlights 1 Mithali Raj ended up as the second most runs in this World Cup, behind Tammy Beaumont. 2 Jhulan Goswami ended the tournament with 10 wickets and figures of 3/23 in the final. 3 Mithali Raj is the only Indian captain to reach two 50-over World Cup finals. Mithali Raj's heartbreak continued as in the final of the Women's World Cup at Lord's on Sunday. She was the captain of the Indian team that lost to Australia in the final of the Women's World Cup back in 2005 at Centurion as well. India lost to England by nine runs Ahead of the big final, Mithali had said that she wanted to go a step further and lift the Cup this time. \"It's been seven years since we qualified for the final and 12 years since we reached the final. So, the girls want to do well. 2005 we were runners-up and this time I want to go one step further,\" said the Indian captain. But her poor luck continued. Mithali and Jhulan Goswami were the only players from the 2005 team and both sounded positive about a victory after the English were restricted to 228/7 from their 50 overs and India were on course for a victory after a flying start. But, England pulled off a remarkable comeback to bowl India out for 219 and lift their fourth World Cup. GOOD TOURNAMENT FOR THE VETERANS Mithali and Jhulan both stood up in the tournament. While Mithali finished as the second highest run-getter with 409 from nine games in the tournament, Goswami picked up 10 wickets in this year's edition. Although Mithali missed out in the final, Goswami did not. She came up with an to help India restrict England 228/7. inspiring performance in the final Meanwhile, the India captain was the most consistent player of the tournament. She got runs in most of the matches and led the team brilliantly and showed great calmness under pressure. The 34-year-old stood up and hammered a century against New Zealand in a must-win game for India and also played an important knock of 36 against Australia in the semis. She formed an important partnership with <mark>Harmanpreet Kaur</mark> to stabilise the innings before the all-rounder smashed her way to a 115-ball 171 *. On a personal note, Mithali became the first woman to score seven consecutive fifties in One-Day Internationals. Not only that, she is currently the highest run scorer in ODIs with 6190 runs from 186 matches and averages a whopping 51.58. She has hit six centuries and 49 half-centuries. For more news from India Today, follow us on Twitter @ indiatoday and on Facebook at facebook.com/IndiaToday For news and videos in Hindi, go to AajTak. in. ताज़ातरीन ख़बरों और वीडियो के लिए आजतक. इन पर आएं."}, {"articleID": "2015072500_00047402_W", "names": {"Pedro Alvarez": ["Q7159437", "Q767616"], "Adam Berry": ["Q23542551", "Q348765", "Q39073627"]}, "date": "2015-07-25", "url": "http://sandiego.padres.mlb.com/news/article/mlb/pirates-alvarez-homers-into-allegheny-river?ymd=20150724&content_id=138486876&vkey=news_mlb", "content": "<mark>Alvarez</mark> tags Scherzer with Allegheny blast Email Print <mark>Alvarez</mark>'s two-run blast0:43 7/24/15: <mark>Pedro Alvarez</mark> hits a monster two-run homer out of the ballpark to give the Pirates an early lead in the 2nd inning ByAdam <mark>Berry</mark> / MLB.com | | @ adamdberry + 0 COMMENTS PITTSBURGH--Before Thursday's game, Pirates manager Clint Hurdle recalled a recent conversation with <mark>Pedro Alvarez</mark>. The Bucs have been trying to get their first baseman back \"in the productive place that we've seen him,\" Hurdle said, even as his name continues to pop up in trade rumors. <mark>Alvarez</mark> has been back in that productive place the last two days. A night after homering to left field, <mark>Alvarez</mark> launched a two-run shot off Nationals ace Max Scherzer all the way out of PNC Park in right-center on Friday and bounced it into the Allegheny River, giving the Pirates a 2-0 lead in the second inning. The blast was <mark>Alvarez</mark>'s team-leading 14th home run of the season. According to, the ball left <mark>Alvarez</mark>'s bat at 111 mph and traveled 439 feet from home plate. Statcast ™ The ball landed on the lower riverwalk beyond the right-field bleachers before bouncing into the river. It was the fourth time <mark>Alvarez</mark> has reached the river in his career, and the third time he has bounced a homer into the Allegheny. Must C: <mark>Alvarez</mark> homers into boat Must C Crushed: <mark>Alvarez</mark> homers out of PNC, into boat 5/19/15: <mark>Pedro Alvarez</mark> hits a solo home run that goes out of PNC Park and lands in a boat on the Allegheny River <mark>Alvarez</mark> reached the Allegheny River on the fly earlier this season, parking a homer directly into a boat on May 19. It has been a mostly disappointing year for <mark>Alvarez</mark>, who slugged 36 homers and drove in 100 runs in 2013. The former No. 2 overall pick entered Friday batting .232 / .302 / .424 while committing 15 errors in his first 77 games at first base. <mark>Adam Berry</mark> is a reporter for MLB.com. Follow him on Twitter at. This story was not subject to the approval of Major League Baseball or its clubs. @ adamdberry Share This"}]