[{"articleID": "2019080205_00089801_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2019-08-02", "url": "http://www.thedailystar.net/world/news/north-korea-increases-pressure-latest-missile-launches-1780696", "content": "11:30 AM, August 02, 2019 / LAST MODIFIED: 11:38 AM, August 02, 2019 NKorea increases pressure with latest missile launches People watch a TV showing a file picture of a North Korean missile for a news report on North Korea firing short-range ballistic missiles, in Seoul, South Korea, on August 2, 2019. Photo: Reuters Reuters, Seoul North Korea fired missiles for the third time in eight days on Friday, a series of launches that analysts say are designed to improve military capabilities and pressure the United States and South Korea as they seek to restart denuclearisation talks. US President Donald Trump, who has been hoping to revive the stalled talks with North Korea, played down the launches. The North has been testing missiles despite Trump's June 30 meeting with North Korean leader <mark>Kim Jong Un</mark>, where they agreed to revive the talks. South Korea's government said the latest projectiles fired by the North appeared to be new short-range ballistic missiles. The missiles flew 220 km (135 miles) and reached an altitude of 25 km (15 miles), the Joint Chiefs of Staff (JCS) in Seoul said. A US official said US intelligence had detected at least one projectile, and possibly more, that did not pose a threat to North America. US officials said initial information indicated they were similar to two other short-range missile tests by Pyongyang since last week. North Korean state media said <mark>Kim</mark> oversaw the firing of what it described as a new large-calibre, multiple-launch guided rocket system on Wednesday. He also observed the launch of a short-range ballistic missile last week. The launches appear to be intended to put pressure on South Korea and the United States to stop planned military exercises later this month and offer other concessions. <mark>Kim</mark>'s government was not only signalling negotiating demands with the tests, it was assiduously improving military capabilities, said Leif-Eric Easley, an international relations professor at Seoul's Ewha University. \"The aim is not only to increase Pyongyang's ability to coerce its neighbours, another goal is to normalise North Korea's sanctions-violating tests as if they were as legitimate as South Korea's defensive exercises,\" Easley said. Trump was asked at the White House before he set off for a campaign trip to Ohio if he thought <mark>Kim</mark> was testing him and said the launches did not violate the North Korean leader's promises to him. Trump said they were short-range missiles. \"We never made an agreement on that. I have no problem,\" he said. While Trump says he never made an agreement on short-range missiles, the 15-member United Nations Security Council unanimously demanded in 2006 that North Korea suspend all activities related to its ballistic missile programme and \"re-establish its pre-existing commitments to a moratorium on missile launching\" . The <mark>UN</mark> Security Council met behind closed doors in New York on Thursday to discuss the latest missile launches. Representatives from Britain, France and Germany called on North Korea after the meeting to engage in meaningful talks with the United States and said international sanctions need to be fully enforced until Pyongyang has dismantled its nuclear and ballistic missile programmes. The Japanese Ministry of Defence said on Friday no immediate impact was seen on Japan's security after North Korea's latest launch. No ballistic missiles had reached Japan's territory or its exclusive economic zone, it said in a statement. Related Topics"}, {"articleID": "2012052518_00093212_W", "names": {"Nelson Sewankambo": ["Q42855310", "Q6990732"]}, "date": "2012-05-25", "url": "http://voanews.com/content/health_expert_encouraged_by_government_support/1105605.html", "content": "did you know that your internet explorer is out of date? to get best possible experiance using our website we recommend that you upgrade to a newer version or other web browser. a list of the most popular web browsers can be found below. treated mosquito nets reduce malaria risk, says tanzania scientist a prominent ugandan physician and health researcher says a recently formed consortium has launched a transformational framework for training doctors. <mark>nelson sewankambo</mark>, professor of medicine and principal at makerere university college of health sciences, said the group is emphasizing the sustainable health workforce development in uganda. professor of medicine <mark>nelson sewankambo</mark> at makerere university college of health sciences download \"the government's reaction has been superb, which is unprecedented. the government has expressed a lot of interest in collaborating to bring training institutions into a much closer working relationship with both the ministry of education and the ministry of health,\" said <mark>sewankambo</mark>. \"we are having fairly regular meetings between our institutions as a group? and what has also happened is that they had formed an inter-ministerial committee that brings together people from the two ministries again to discuss and plan for issues around health professional education.\" <mark>sewankambo</mark> outlined the goals of the consortium's initiative. \"it's creating an opportunity for the universities themselves and also government departments to think and pay great attention to [the] training of health workers? it is opening up more interest and more discussions about health workers in general,\" said <mark>sewankambo</mark>. \"the [expectation] is that government is going to pay great attention to building capacity in the country, how to retain these health workers in the country. [we expect] government is going to put more resources [or] funding into training of health workers.\" <mark>sewankambo</mark> said the administration seems to recognize the financial needs and the challenges of universities training health care workers. analysts have often expressed concern about retaining them. they cite instances where doctors, nurses and other health professionals emigrate due to poor pay back home. <mark>sewankambo</mark> said policy makers should make judicious use of the country's health care resources. \"it is true that we can increase the efficiency and the way we use available resources right now. through our discussions with the government departments we are going to identify where the hemorrhage is, the wastage of resources [and] where we can improve to utilize the existing resources. indeed there is a movement in that direction,\" he said. <mark>sewankambo</mark> said the consortium's initiative involves working closely with other health professional workers across africa. \"there used to be a very active association of medical schools in africa? we have argued for a revitalization of that association with the intent that it will provide opportunity for collaboration across africa? and indeed that association is being revamped.\" professor <mark>sewankambo</mark>'s comments followed his presentation called developing a sustainable workforce in sub-saharan africa: a unique inter-africa collaboration at the recent council on health research and development group (cohred) 2012 forum in cape town, south africa. egypt's conservative rural vote appears split un calls for suspension of sanctions on zimbabwe rights group says cluster bomb found in sudan conflict zone african leaders discuss sustainable development on continent clinton: significant differences remain over iran's nuclear program"}, {"articleID": "2014081203_00004314_W", "names": {"Dorothy Mcauliffe": ["Q45120525", "Q56282493"], "Brian Moran": ["Q17232911", "Q4964801"]}, "date": "2014-08-11", "url": "http://www.alexandrianews.org/governor-mcauliffe-announces-creation-of-childrens-cabinet-and-the-commonwealth-council-on-childhood-success/", "content": "Alexandria Virginia Local News Since 2008 Governor <mark>McAuliffe</mark> today signed an Executive Order creating a cabinet solely dedicated to the education, health, safety, and welfare of Virginia's children and youth. The newly launched Children's Cabinet will develop and implement a policy agenda that will help better serve Virginia's children and will also foster collaboration between state and local agencies. As a part of that effort, the Governor also signed a second Executive Order establishing the Commonwealth Council on Childhood Success. This Council will be chaired by Lt. Governor Northam and will focus on improving the health, education, and well-being of our youngest children. \"Children are the Commonwealth's most important resource, and it is critical that we provide them with the tools and resources they need to thrive in a 21 st century economy,\" said Governor <mark>McAuliffe</mark>. \"Both the Children's Cabinet and the Commonwealth Council on Childhood Success will help ensure that Virginia's children live happy and productive lives.\" Secretary of Education Anne Holton and Secretary of Health and Human Resources Bill Hazel will serve as co-chairs of the Children's Cabinet. Lt. Governor Ralph Northam, Secretary of Public Safety <mark>Brian Moran</mark>, Secretary of Commerce and Trade Maurice Jones and the First Lady of Virginia <mark>Dorothy McAuliffe</mark> will serve as members of the Children's Cabinet. \"The Children's Cabinet provides an opportunity to work together on the complex issues that affect a child's development. Addressing the need for safe housing, access to healthcare and proper nutrition are important first steps that will help bridge the achievement gap and prepare Virginia's children to succeed in a new Virginia economy,\" said First Lady <mark>Dorothy McAuliffe</mark>. \"It is an honor to be named Chair of the Commonwealth Council on Childhood Success,\" said Lt. Governor Northam. \"I am incredibly grateful that early childhood is a priority for Governor <mark>McAuliffe</mark> and his administration. The early years of a child's life are extremely formative, and have a significant impact on their health, growth, and readiness to succeed. As policymakers we must ensure that our public investments in these services provide adequate access and high quality programs. I look forward to working with state agencies, local school districts, service providers, the business community, and advocates to ensure that every Virginia child has the opportunity to thrive and succeed.\" \"The establishment of the Children's Cabinet is a great first step towards addressing the basic needs of Virginia's youth,\" said Secretary Holton. \"There are schools, neighborhoods, and communities across the Commonwealth suffering under the crushing weight of entrenched poverty, and it is our goal with the Children's Cabinet to offer a helping hand, not a wagging finger.\" Secretary Hazel added, \"While regular communication between secretariats regarding children and youth issues is important, we believe a more significant impact can be achieved by delving further into the issues impacting the health, education and success of our children.\" The Children's Cabinet will focus on five specific priority areas: Eradicating the achievement gap in schools in high poverty communities. Increasing access to basic needs including housing, healthcare, and proper nutrition. Improving outcomes for youth transitioning out of Virginia's juvenile justice, mental health and foster care systems. Increasing workforce opportunities for parents and for youth as they transition out of high school."}, {"articleID": "2011042010_00018375_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2011-04-20", "url": "http://masslive.com/living/index.ssf/2011/04/teens_see_little_harm_in_heavy_drinking.html", "content": "in this march 25, 2009 associated press file photo, actress melissa gilbert arrives at the premiere of \"american identity\" in <mark>beverly hills</mark>, calif. downing five or more alcoholic drinks nearly every day isn't seen as a big problem for many of the nation's teens, says a report released on april 7 by the partnership at drugfree.org. \"it is much more terrifying these days than it was when we were younger,\" says gilbert, the national spokeswoman for the partnership. washington - downing five or more alcoholic drinks nearly every day isn't seen as a big problem for many of the nation's teens, says a new report. when asked if they see \"great risk\" in drinking that much, almost half the teens questioned - 45 percent - didn't see it as a big deal. the study released on april 7 by the partnership at drugfree.org also showed upward trends in marijuana and ecstasy use among young people in grades 9 through 12. \"you're seeing this weakness in this generation of teens' attitudes around drug and alcohol use,\" says steve pasierb, president of the partnership. \"it's not like this generation of kids thinks they're more bulletproof than others, but they really don't see any harm in that heavy drinking.\" and while the numbers suggest many teens do not perceive significant harm in heavy drinking, the percentage of teens drinking is down. \"it's important that we not lose sight of the progress our country has made in fighting underage drinking,\" says dr. raymond scalettar, former chairman of the american medical association and a medical adviser to the washington-based distilled spirits council. \"u.s. government data shows underage drinking and binge drinking are at record low levels.\" the partnership study also shows the percentage of teens drinking alcohol in the past month declining, down to 35 percent last year from a high of 50 percent in 1998. among teens, the average age when they had their first drink was 14, the study said. overall, 68 percent said they had consumed alcohol in their lifetime. of those, one quarter of teens had their first drink at age 12 or younger. \"it is much more terrifying these days than it was when we were younger,\" says actress and mother melissa gilbert, national spokeswoman for the partnership. gilbert, the former \"little house on the prairie\" star, is herself a recovering alcoholic who at one time was drinking two bottles of wine a night but has been sober now for six and a half years. she has faced drug-abuse struggles with one of her four sons, and she says she is doing everything in her power to make sure her youngest, now 15, knows the drama and pain addiction can bring. \"the most important thing is to get to know his friends and stay in constant communication with the people that are around him all day - his teachers, his counselors at school,\" gilbert told the associated press in an interview from her los angeles home. being sober, she says, is the best way to live. \"it's not the easiest, but it's definitely the best,\" she said. according to the study, teens said the top reasons for drinking were \"because it is fun\" and \"so they won't feel left out.\" pasierb says early drinking can often signal deeper problems. \"it's about that vulnerability,\" he said, \"why is a 12-year-old drinking?\" gregg aguero of houston, texas, says he started drinking regularly at 13 after his parents split up. that led to cocaine and other drugs and eventually landed him in rehab for several stays. now 22 and in college, aguero says he's been sober for four months and is trying to help teenagers avoid the mistakes he made. \"it's never too late,\" he tells them. \"that's the most important thing. it's never too late to turn and get help.\" other findings in the study: twenty-five percent of teens said last year that they had smoked marijuana in the past month. while that number is unchanged from the previous year, it is higher than 2008 and confirms an upward trend that ended nearly a decade of declines in pot usage among teens. ecstasy abuse also continued an upward trend, with six percent of teens reporting past-month use - up from four percent in 2008. the partnership's \"attitude tracking\" study was sponsored by the metlife foundation. researchers surveyed 2,544 teens with anonymous questionnaires that the youngsters filled out from march to june of last year. the study has a margin of error of plus or minus 3.6 percentage points. based in new york, the partnership at drugfree.org is formerly the partnership for a drug-free america - perhaps best known for the \"this is your brain on drugs\" ads of the 1980s and 1990s. the group launched its new name last october, a move meant to position the partnership as more of a resource to parents and to avoid the misperception the nonprofit is a government organization."}, {"articleID": "2011100813_00082385_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"], "John Fox": ["Q12892062", "Q13459838", "Q19662010", "Q19750869", "Q24285717", "Q3809274", "Q44786513", "Q6233800", "Q6233806", "Q6233808", "Q6233810", "Q719030"], "Ron Rivera": ["Q1991889", "Q7364319"], "Sean Mcdermott": ["Q7441226", "Q7441228", "Q7441229"], "Thomas Davis": ["Q17721764", "Q28972061", "Q3525031", "Q48841038", "Q7788881"], "Michael Turner": ["Q1372347", "Q1372443", "Q15969753", "Q1929622", "Q2083939", "Q20853582", "Q43210688", "Q562007", "Q6834989", "Q6834993", "Q6834994", "Q6834995"], "Calvin Johnson": ["Q857634", "Q942680"]}, "date": "2011-10-06", "url": "http://prod.www.saints.clubs.nfl.com/news-and-events/article-1/Brees-Ready-for-Tough-Test-against-Panthers/680f0f3f-e0ec-44f7-9b80-d508719ce1ce", "content": "did you ever have a stretch in your career where you personally were playing well but the team was struggling at a 1-3 stretch, possibly comparable to the panthers with <mark>cam newton</mark>? \"i'm not sure. i think my mentality is that you're never going to play a perfect game. so even though you might play very well, you're always going to think about the one or two things you could do differently to affect the outcome of the game. that would be my perspective.\" were you a little disappointed that even though you racked up over 500 yards on sunday, you managed only 23 points? \"yes. i was actually happy that we got a win on the road in a tough environment that you look at statistically in terms of that no nfc south team had ever gone in there and won. we over the last few years can point to a few games that might be similar to that. that was a team that plays very well at home. that was a team that defensively had played very well this season even though the stats in the jets game might not point to it because they were put in some bad positions, but to put up 500 yards of total offense you shake your head because you look at the scoreboard and that should show up some more. obviously you look and say why is that? we got down inside the 20 three times and just came away with field goals and not touchdowns. that certainly could have helped. we had a big play or two and it could have gotten us more points. i was, being the personality i am, i'm happy for us as a team to come out of the game healthy, get a big win and keep the streak going, but i'm also upset at myself for some things and feeling like we still have to improve at some things.\" are you impressed at how <mark>cam newton</mark> has done given the lack of an offseason? \"yes. i haven't seen any film on him. the only thing i saw was when they played jacksonville before us. it (conditions) were really sloppy, so it was hard to get a gauge for the guy. you look at the sheer statistics and shake your head. i don't care how long you've been in this league. it's hard to put up the numbers he's put up. he's certainly a raw talent. we all knew that, but i don't know if anybody could predict it, so you certainly have to give him credit for what he's been able to accomplish so far.\" how would you compare and contrast the defensive styles of <mark>john fox</mark> and <mark>ron rivera</mark>? \"they're (panthers) doing some different things. some stuff you see a little bit of the philly carryover with <mark>sean mcdermott</mark> and his experience there. <mark>ron rivera</mark> being in a 4-3 scheme up in chicago when he was the defensive coordinator there in '06 when we played him and then he went on to be the d-coordinator in san diego where they run the 3-4 and obviously now he's in carolina where they do the 4-3, yet they do some stuff in the nickel that looks like there's some 3-4 ideas. i think it's a mixture of a little bit of everything. i know they had two big injuries in (jon) beason and <mark>thomas davis</mark> but i have a lot of respect for that defense. i lot of those guys have been together for a while. i know they're pretty young up front. the secondary and those guys have been together for a while and i think it shows.\" <mark>cam newton</mark> says he's a big fan of yours and would love to learn how you run an offense. how would you size him up and what words of wisdom would you give? \"how would i size him up? he towers over me. maybe some words of wisdom after the game. i think there's always a competitive thing between quarterbacks when you're playing against each other even though i'm not directly facing <mark>cam newton</mark> and he's not directly facing me. he's facing our defense and i'm facing his defense. it's hard to go into any game against a talented young player or seasoned veteran that you know has a lot of talent and you have a lot of respect for and has a little bit of extra oomph and your kind of going step for step. but, in the end, i'm focused on scoring as many points as i can, hopefully that's more than they score, but he's obviously in our division. we're going to be seeing a lot of this guy.\" when he came to san diego? did you wonder what type of role he would have at his size? \"we drafted him in' 05. he walks in the door and you think gosh this guy is tiny by nfl standards in terms of a running back. he had accomplished some great things in college. he was coming into a situation where we had ladanian tomlinson and <mark>michael turner</mark>, so really he was just fulfilling that special teams role the first year. then from afar, i'm watching him because i liked him and wanted him to succeed. i'm watching his role increase and increase. he really was doing some great things in san diego by the time he entered his fourth, fifth, sixth season and that was a big reason why this offseason, training with him and watching the way he works, he's a pro. he does anything you ask. when it came time to go back to camp, i said to <mark>sean</mark> (payton\" , \"you might want to go after this guy .'.\" was this the first offseason you and todd durkin worked with sproles? \"yes.\" what was his mentality? \"he's a quiet guy, competitive though. there are guys like that. (is) competitive but quiet. devery (henderson), (robert) meachem, you don't hear a lot from those guys vocally, but deep down there's a fire inside that burns. sproles has got unbelievable spirit and that competitive fire. you can see little things. i think that's why he's so good with a lot of things. if you find a thing he hasn't mastered yet or quite worked on, he's going to find a way to get better at it. i see it when there's a big play to be made and he doesn't make it. it's on to the next play too. he's not one to dwell. i really like him. it's hard because my perspective that first year in san diego, him looking at ladanian tomlinson who's in the prime of his career, <mark>michael turner</mark> who i believe was in his second year, but we know what kind of player he's become, so i'm sure sprolesie was thinking he was going to watch these guys, learn how to be a pro, learn how to get it done and contribute. did i think sproles would be the player he now is when he first came in? i don't know. he's just a rare talent, not just physically, but his mental makeup. i think it takes a really tough person, physically, mentally, at his size to do what he's done.\" how often were you making casual references to him to join the saints? \"just when we trained. i didn't know what was going to happen with reggie (bush). i told him if reggie's not here, you're going to be here.\" maybe in san diego he didn't have that many snaps, but what's been the difference here? \"i'm not sure. you'd have to ask him.\" is it a situation where he's used more? \"san diego played a few primetime games. i'm a fan so i watch those. it seems like his name was always coming up. always, whether it was a catch out of the backfield for a 50-yard touchdown, a punt return, his name was always getting thrown around. he was making plays. i never really counted the snaps, but i think here, maybe what's so great about his role here is the fact with our three backs in pierre (<mark>thomas</mark>), mark (ingram) and sproles, each one of them has a role and yet you can plug them all in at any place. i feel very confident about all their skill sets. i think when you take his contributions in all phases? i think he has a hand in everything. he knows his number will get called and he'll have opportunities. i have to give a lot of credit to <mark>sean</mark>, because <mark>sean</mark> has a knack for everything. every guy has their plays, their opportunities. they're in the plan. they're going to get (their number) called. that keeps guys excited and focused, knowing that my number's going to get called and i have to get ready.\" why have you guys had trouble against carolina in the past? \"they're a tough team. i think they play us tough. this is no excuse, two times we played them in the last game of the season when we were resting starters, still if you were looking at it, it's even and i believe in that case it's 4-4. we've traded punches many times, had some close games.\" have other division games been like that? \"yes, you could say the same thing for atlanta. those have been close. tampa, the last two years has been weird. we've gone to their place the last two years and dominated and they've come to ours and beaten us. what the heck? it's divisional opponents, where you know each other well. you know each other's personnel. you really try to beat each other up each time you play. anything can happen can you talk about the importance of your third down conversion percentage?\" third down conversions are big, because those sustained drives, you wear a defense down, the more points you score, at least the more opportunities you will have to score points, the longer you can rest your defense, so they can come out there and give you the ball right back. that's a big stat. turnover ratio is a big stat. red zone efficiency is a big stat. those are a couple that i pay attention to. \"what is your explanation for what you think is a league trend for how much yardage and scoring is occuring?\" i don't know. who knows? we're only four games into the season. i'd like to think that trend's going to continue for us with the yardage, points and everything else. it's hard to put your finger on it because we were all in the same boat this season, offenses and defenses. there's always the argument about what side of the ball needs the most time to execute. you could say offensively if one guy messes up it could mess up a whole play, you could probably say the same for defense. so much of what you do defensively is just reacting, whereas on offense your interacting. i don't know. i'm just kind of talking. i don't know. what do you think of currently having six quarterbacks on pace to beat dan marino's single season yardage record that you came close to breaking three years ago? \"that's unusual. the rules i would say. even though there weren't any rules changes this offseason that i can think of that with the exception of even more emphasis of protecting players down the field with hits. guys aren't worried about catching balls and having their head taken off because of penalties and a fine. guys have more of a chance to catch it because they're hit in the body rather than the head. but other than that, they're protecting the quarterbacks the same as they always have in the pocket. you get out, throw the ball away, not go past the line of scrimmage. all those rules are the same. why this year instead of last year? everybody's searching for the answers. a lot want to blame it on the lockout. i just think there are some good quarterbacks and skill position players in this league. you see what <mark>calvin johnson</mark>'s doing. there's some freak athletes out there. did anybody expect <mark>cam newton</mark> to be doing what he's doing? it's hard to believe. buffalo putting up the points and numbers they're putting up, (ryan) fitzpatrick. there are tons of guys that are playing at a high level around the league. it's fun to watch. for a guy like me who's involved in it. it's still fun to watch. i keep up with it.\" what did you think of the mercedes-benz announcement?"}, {"articleID": "2009090320_00127691_W", "names": {"Andre Bauer": ["Q100446", "Q4759824"], "Mark Sanford": ["Q11669", "Q18352854", "Q3849548"], "Mike Rogers": ["Q1933467", "Q970515"], "Richard Spencer": ["Q16217637", "Q29342932", "Q7329180", "Q7329182"]}, "date": "2009-09-03", "url": "http://charlestoncitypaper.com/HaireoftheDog/archives/2009/09/03/knotts-knows-who-outed-the-100-not-gay-bauer-marks-sanford-men", "content": "calendar + scene browse news + opinion knotts knows who \"outed\" the 100% not gay <mark>bauer</mark> - <mark>mark sanford</mark>'s men taxpayers pay for <mark>sanford</mark> trip to family estate charleston school board chair backs sheheen submit a news tip browse calendar + scene dan aykroyd wants to sign your skull-shaped bottle of vodka magnolia plantation offering labor day deal search events browse arts + movies three new graphic novels continue to redefine comic book conventions pure theatre launches its seventh season with an emotional power punch savannah craft brew fest this weekend chef aaron deal heads to windy city knotts knows who \"outed\" the 100% not gay <mark>bauer</mark> - <mark>mark sanford</mark>'s men chris haire on thu, sep 3, 2009 jake knotts used to be a cop. for 29 years. now, he's just a bull-necked buffoon who with one big ole blast of hot air just made the press coverage surrounding the <mark>andre bauer</mark> \"outing\" that much worse. and the funny thing is, it doesn't sound like that was knotts' intention at all. palmetto scoop, knotts has sent a letter to his fellow members of the general ass., proclaiming that he is \"100% certain the rumor [that <mark>andre</mark> is gay] is false\" and gov. <mark>mark sanford</mark>'s folks are behind it. in fact, he says that \"with absolute certaintity this attack was orchestrated on behalf of <mark>mark sanford</mark>, either directly or indirectly, and financially subsidized by him or one of his many\" front groups .' \"<mark>mike rogers</mark> of blogactive is wrong about <mark>andre</mark> and the govenor's men are behind this\" false rumor \": jake has known\" dre since he was eight years old...and he himself was once the victim of a similar \"internet smear campaign\" by <mark>sanford</mark>'s evil henchmen. and that's it. no proof. no documentation. no taped recordings. no alcohol-fueled confessions. just a stupid gut feeling. way to go walker, texas ranger. before the end of the letter calling for <mark>sanford</mark>'s removal, knotts proclaims that the governor is a \"danger to our state\" and that if the lege doesn't get <mark>mark</mark> out of office, \"you and your family could be the next target.\" and that means you dorothy and your little dog too. way to look after a friend, jake. you just couldn't let the \"outing\" story disappear. you had to go provide even more fodder for the blogosphere and cable news. and cnn has picked up the knotts story, including a mention of the gay rumor that would have never made the national mainstream media if it hadn't been for jake. knotts knows who \"outed\" the 100% not gay <mark>bauer</mark> - <mark>mark sanford</mark>'s men <mark>sanford</mark> told staff a \"little white lie,\" now targeting state colleges the good time police think that the colleton county sheriff deserves a ticket for douchebaggery knotts knows who \"outed\" the 100% not gay <mark>bauer</mark> - <mark>mark sanford</mark>'s men <mark>sanford</mark> told staff a \"little white lie,\" now targeting state colleges gov. office: doesn't count as travel from home to work the trouble with ted liberal pride in kennedy's career cannot erase his dark past smut peddlers penthouse has nothing on s.c. revolving loan program key to energy efficient pitch giving freedom a bad name conservatives don't know what the word means is lindsey graham gay? seven minutes in gay hell: is lindsey graham in s.c.'s airtight closet? did \"blowback\" cause 9/11? americans deserve better answers to old questions taki radio - <mark>richard spencer</mark> and kevin deanna report from cpac 2009 is lindsey graham gay? seven minutes in gay hell: is lindsey graham in s.c.'s airtight closet? <mark>sanford</mark> must go the governor's true sin was being an idiot ambidextrous pitcher pat venditte really is the man in the mirror mt. pleasant's sweetgrass basket makers go further afield to obtain materials"}, {"articleID": "2019111422_00085343_W", "names": {"Joe Gomez": ["Q17505113", "Q6210068"]}, "date": "2019-11-14", "url": "http://romseyadvertiser.co.uk/sport/national/18037946.sterling-supports-gomez-england-defender-booed-wembley-fans/", "content": "Sterling supports <mark>Gomez</mark> after England defender booed by Wembley fans By Press Association 2019 <mark>Joe Gomez</mark> came off the bench for England 0 comment Raheem Sterling has criticised England fans who booed <mark>Joe Gomez</mark> during the 7-0 rout of Montenegro at Wembley. Forward Sterling missed the victory which secured the Three Lions' passage to Euro 2020 after his skirmish with <mark>Gomez</mark> at St George's Park on Monday. Liverpool defender <mark>Gomez</mark> was jeered when he came on in the second half, leaving Manchester City star Sterling unhappy in the stands. especially after a difficult week for him to be booed when he came on tonight was wrong. I've taken full responsibility and accepted the consequence. I felt as though I had to say this get home safe every one ❤ ️ #Euro 2020--Raheem Sterling (@ sterling7) November 14, 2019 Sterling tweeted after the match: \"To all the England fans, I wanted to leave things as it was but tonight I have to speak again.\" It was hard for me to see my team-mate get booed for something that was my fault. <mark>Joe</mark> hasn't done anything wrong and for me to see someone who keeps his head down and work hard...\"Especially after a difficult week for him to be booed when he came on tonight was wrong. I've taken full responsibility and accepted the consequence. I felt as though I had to say this, get home safe every one.\" 0 comment"}, {"articleID": "2017102904_00251127_W", "names": {"Randhir Singh": ["Q48869008", "Q51096185", "Q7291681", "Q7291682"]}, "date": "2017-10-29", "url": "http://www.newindianexpress.com/sport/other/2017/oct/29/after-ramachandran-ioc-secretary-general-rajeev-mehta-calls-for-emergency-executive-council-meeting-1685958.html", "content": "Home Sport Other After Ramachandran, IOC secretary general Rajeev Mehta calls for emergency Executive Council meeting By Indraneel Das | Express News Service | Published: 29th October 2017 02:30 AM | Last Updated: 29th October 2017 09:48 AM | A + A A - | 0 Share Via Email Indian Olympic Association secretary general Rajeev Mehta. | File Photo The power game has begun. The bugle has been sounded and the rapiers are out. Allegations and verbal volleys are being lobbed. In the end, it's the image of the IOA that's getting sullied. But who bothers? The tussle between the president of the Indian Olympic Association N Ramachandran and secretary general Rajeev Mehta is out in the open. Days after the IOA president called for an Executive Council meeting on November 9, the secretary general sent out a letter calling for emergent EC meeting, but on November 7. The meet was called after 19 of 27 EC members met in New Delhi on Friday. It is learnt some of the present and past top sports administrators were present. The president is saying that according to IOA constitution only he has the right to call for a meeting, Mehta and Co believe that if the secretary has the mandate of the members, he too can call for the meeting. The two top officials of the IOA were not in agreement over the next Annual General Meeting (AGM) and the candidate for the president's post. There are 10 agendas listed for the meeting on November 7. The meeting will discuss \"regarding requisition notice already served to the president, IOA by approximately 70 per cent of the members\" . One of them is to discuss the actions of \"the president, IOA which have brought down the image of IOA\" . Mehta told Express that since 19 of the 27 members asked for the meeting on Nov 7, he couldn't have avoided to request. \"When so many members call for a meeting I can't stop it.\" He was also not happy that the president did not accede to the demand of 70 per cent members of the IOA who wanted a requisition meeting. A meeting of Ramachandran's supporters were held over dinner called by former IOA president Abhay Singh Chautala at Delhi Lawn Tennis Association (DLTA) on Thursday. It is learnt there were around seven to eight EC members were present. There are hectic parleys on for the posts of the treasurer of the body. It was in September (around 27/28) when, at a meeting in New Delhi between the president's rival faction, the idea of a requisition meeting was decided. The SGM, according to them, was necessitated because the term of the president and the current Office Bearers (OB) was over in March. And Ramachandran should have called for elections. The requisition for the SGM was however not considered by the IOA saying not enough members have signed the list. Interestingly, the list was handed over to the secretary who felt everything was in order for the president to call for an SGM. \"I felt the president should have called for the meeting,\" Mehta further added. Without SGM, Batra may not qualify as a presidential candidate. The IOA constitution (as it currently stands) doesn't allow a person who is not part of the executive board to contest the elections. The way things stand right now, the secretary seems to be enjoying the support of bigwigs like Narinder Batra, former IOA secretary generals Lalit Bhanot, <mark>Randhir Singh</mark>, vice-president RK Anand while the president has the support of former IOA president Chautala, former AITA president and treasurer Anil Khanna, senior vice president Virender Nanavati. Knowing IOA, the dynamics can change fast depending on whose favour the balance is tilted towards indraneel.das @ newindianexpress.com"}, {"articleID": "2010031721_00139879_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2010-03-17", "url": "http://cbc.ca/world/story/2010/03/17/arrest-drugs-ring.html", "content": "last updated: wednesday, march 17, 2010 | 5:01 pm et an arrest has been made in connection with the california investigation into the death of canadian-born actor corey haim, according to a cnn.com report. a spokesman for california's attorney general announced the arrest wednesday, but did not give details, cnn said. last week, california attorney general <mark>jerry brown</mark> linked haim to an illegal prescription drug ring that created phoney doctors' prescription pads and provided numerous illegal prescriptions. <mark>brown</mark> said pharmacy records show the actor got pills from dozens of doctors in the past year. haim died last wednesday at age 38. an autopsy showed he had pneumonia, an enlarged heart, and water on the lungs, but no official cause of death was released. drug use has not been ruled out in his death, as toxicology reports won't be available for another few weeks. haim was buried in a private funeral service in toronto on tuesday. although he had a history of prescription drug abuse, friends said he was overcoming those problems at the time of his death. authorities in los angeles released a 911 call made by judy haim, his mother, in which dispatchers try to guide her through performing cpr on her son's body. judy haim is heard on the 911 tape saying, \"oh my god, i think my son is dead.\" cbc news has confirmed the identity of a toronto man - believed to have joined an al-qaeda-linked group in somalia and killed in battle - on an insurgent group's online video. an arrest has been made in connection with the california investigation into the death of canadian-born actor corey haim, according to a cnn.com report. ireland's senior catholic church cardinal has offered an apology for his handling of a case involving an abusive priest decades ago. volunteers in north dakota filled thousands of sandbags on tuesday in the hopes of avoiding some of the damage from the fast-rising waters of the red river. the canadian dollar marched closer to parity with its u.s. counterpart wednesday, supported both by higher commodity prices and the prospect of continued low american interest rates. cbc news has confirmed the identity of a toronto man - believed to have joined an al-qaeda-linked group in somalia and killed in battle - on an insurgent group's online video. an arrest has been made in connection with the california investigation into the death of canadian-born actor corey haim, according to a cnn.com report. ndp leader jack layton introduced a motion on wednesday that would prevent the prime minister from proroguing parliament for longer than seven days unless supported by the house."}, {"articleID": "2011030916_00029828_W", "names": {"Jimmy Mullen": ["Q16235666", "Q6200884", "Q6200886"], "Dave Wagstaffe": ["Q5230048", "Q5230049"], "Matt Jarvis": ["Q158723", "Q6788845"], "Steven Fletcher": ["Q150238", "Q3499223", "Q6379374"], "Mick Mccarthy": ["Q40063430", "Q437925"]}, "date": "2011-03-09", "url": "http://expressandstar.com/sport/wolverhampton-wanderers-fc/2011/03/09/a-new-great-age-for-wolves-wingers/", "content": "hancocks and <mark>mullen</mark>, wharton and <mark>wagstaffe</mark> - wing pairings that trip off the tongue for older wolves fans. throw in norman deeley, alan hinton and kenny hibbitt, and from the late 1940s to the early '80s, wolves were blessed with some terrific talent down the flanks. johnny hancocks, <mark>jimmy mullen</mark> and deeley could dazzle and all three were heavy scorers in their trophy-laden careers during the club's halcyon days, while hinton's replacement <mark>dave wagstaffe</mark> was arguably the finest crosser in wolves' history. decades on, could an age-old wolves tradition about to be revived in earnest? in 2008-09, michael kightly and <mark>matt jarvis</mark> dazzled on opposite flanks, providing the ammuntion for chris iwelumo and sylvan ebank-blake to fire wolves to the championship title. and now the tradition could be about to take off again in the shape of <mark>jarvis</mark> and adam hammill. the pair were irresistible in sunday's 3-3 draw against tottenham, with <mark>jarvis</mark> back to his best in a classy performance culminating in the cross for <mark>steven fletcher</mark>'s late equaliser. during their glory years under stan cullis, wolves regularly outscored the opposition and their record of four successive seasons of scoring more than 100 league goals a season from 1957-61 still stands to this day. the class of 2011 have scored seven goals in two home games to give wolves the eighth best home record in the premier league, while only seven teams have scored more in front of their own fans. hammill sees the traditional wing-play being a key factor in their survival prospects. he said: \"you go back to old fashioned wingers and it was always their job to get to the byeline and get crosses in\" i think both \"jarvo' and myself are old-fashioned in the way we take players on and get to the byeline.\" it can be exciting to watch and hopefully we'll carry on doing it and creating plenty of chances between now and the end of the season. \"even after we equalised against spurs we were still attacking. it shows we weren't happy with just a point.\" manager <mark>mick mccarthy</mark> maintains the exciting wing play is no accident. he said: \"we work hard at it and i believe we've got two terrific wingers.\" the spurs game was a bit of a throwback to a more carefree era, as both teams went hell for leather trying to outscore the other. clearly the players enjoyed it as much as the fans, who were left on the edge of their seats. hammill said: \"it was one of the best games i've played in. it was end-to-end and one of those games fans want to see.\" it would have been easy after their second goal to go into our shells but we didn't. \"we had a few minutes where we stayed compact, got our two banks of four and then went on to create chances again.\" <mark>mccarthy</mark> believes punters should expect more thrills and spills watching his side this season. he said: \"it was an exciting game, it's never anything but here. i'm only 35 - it's the game that's doing this to me!\" we shouldn't have to score four goals to win a game but tottenham are a terrific team. \"i was happy with a point, especially after losing a goal straight after half-time which was down to our gross stupidity.\" recalled midfielder nenad milijas, who heavily involved in the game's key moments,, is convinced wolves will win their survival battle. he said: \"it was a crazy game but it was fantastic for the fans.\" i was happy with a point, but when we score three goals at home, we need to take three points. i thought we were really unlucky in the match. \"they scored three magnificent goals - probably the best goals of the weekend. but we gave everything we had just to take one point. we're playing well and if we carry on playing like we are, we'll stay up.\" we don't have someone like lionel messi where we can give one player the ball and they will win matches for us. \"we must play as a team to win games.\" latest blog - robin hood in pay of ye sheriff follow the e & s on twitter keep up with the latest breaking news and best content with our twitter updates. new - dining out map hundreds of reviews by the express & star and shropshire star's teams to help you decide where to eat. all the film reviews before you plan a trip to the pictures, get our critics' verdicts on all the latest movie releases."}]