[{"articleID": "2020031123_00008237_W", "names": {"Lauren Smith": ["Q1433661", "Q57915095"], "Yuta Watanabe": ["Q17492383", "Q24326424"], "Wang Chang": ["Q45371683", "Q45443578", "Q45444521", "Q45455400", "Q45455675", "Q45457665", "Q45465601", "Q45465665", "Q45470071", "Q45473463", "Q45484704", "Q45492033", "Q45506733", "Q45516001", "Q45523085", "Q45536111", "Q45540506", "Q45543056", "Q45545380", "Q45546324", "Q45546389", "Q45560013", "Q45566167", "Q45568468", "Q45591431", "Q45619968", "Q45625146", "Q45626127", "Q45631300", "Q45632583", "Q45636000", "Q45640098", "Q45650008", "Q45653747", "Q45653924", "Q45656329", "Q45661269", "Q45671769", "Q45702354", "Q45703043", "Q52144733"], "Jia Yifan": ["Q15108796", "Q25252608"], "Victoria Williams": ["Q1593494", "Q19966607", "Q23418831", "Q56753795", "Q7927138"]}, "date": "2020-03-11", "url": "http://thelancasterandmorecambecitizen.co.uk/sport/national/18299125.ellis-smith-enjoy-thrilling-first-day-yonex-england/", "content": "Sport National Sport Ellis and <mark>Smith</mark> enjoy thrilling first day at Yonex All England Marcus Ellis and <mark>Lauren Smith</mark> were in jubilant spirits after their scintillating pair of first round victories Marcus Ellis and <mark>Lauren Smith</mark> both powered to a pair of victories on a thrilling first day of the Yonex All England Championships in Birmingham. 2016 Olympic bronze medallist <mark>Smith</mark> booked his place in the last 16 of both the men's and mixed doubles in front of a raucous English crowd, joining forces with <mark>Smith</mark> and Chris Langridge to keep his hopes of a famous hometown glory alive. The decorated 30-year-old eased past Japanese mixed pair Takuro Hoki and Wakana Nagahara 21-9 21-15 alongside <mark>Smith</mark>, teeing up a second round clash with fourth seeds <mark>Yuta Watanabe</mark> and Arisa Higashino. And in the men's competition Ellis and Langridge beat Di Zijian and <mark>Wang Chang</mark> after a pulsating third game decider, coming through 21-16 to book a date with world No. 5s Fajar Alfian and Muhammad Rian Ardianto. \"Both of these matches in the first round were real banana skins, but at the same time they were really winnable,\" Ellis said. Great performance from @ C_Langridge and @ ellis_marcus111 today to match the great celebrations!! #YAE 20 pic.twitter.com/O60aWGVNrR--Badminton England (@ BadmintonEnglnd) March 11, 2020 \"It's been a challenging few weeks for me and Chris with a few issues that have meant we haven't been able to train together very much .\" This is really, really big for us, even just winning this game - it's not even just in regards to points, and it's just really, really important for our partnership in the doubles. \"And when <mark>Lauren</mark> and I are at our best we just make ourselves very, very hard to beat .\" Going from the mixed to the men's doubles varies from tournament to tournament - it sometimes depends on how your confidence levels are that day, but they are very, very different events. \"The game is very different and I really have to switch my mentality, which sometimes can be more challenging than on other days .\" <mark>Smith</mark> first helped Ellis breeze pasty Hoki and Nagahara on Wednesday afternoon, before also turning her attention to another format as she teamed up with Chloe Birch. Amazing moment for @ ellis_marcus111 & @ LaurenE_Smith to take match point in the first round at the @ YonexAllEngland pic.twitter.com/WM0VXGFlWl--Badminton England (@ BadmintonEnglnd) March 11, 2020 And that duo toppled German pairing Linda Efler and Isabel Herttrich 21-18 21-14 under the Arena Birmingham lights, lining up a tantalising date with destiny against world No. 1s Chen Qingchen and <mark>Jia Yifan</mark>. \"Performing in this tournament is important - it's one of the big ones and it's highly-regarded among the badminton community, and it's our home tournament, so I would absolutely love to perform well here,\" <mark>Smith</mark> said. \"I've grown up watching it so it's got a lot of prestige, but I think the important thing is not getting caught up in the occasion - you've got to focus on performing day by day, and controlling the controllables .\" It's about not thinking too much about the event and the occasion, and just enjoying being able to play at home. \"It was first round heartbreak for Chris and Gabrielle Adcock in the mixed doubles, however, as the world No. 13s lost a disappointing three game encounter with eighth seeds Hafiz Faizal and Gloria Emanuelle Widjaja. The experienced double act restored parity at one game apiece after a brilliant 21-17 victory in game two, but lost the decider 21-12 to dash their hopes of a triumph on home soil. But after a build-up to the tournament that has been blighted by injuries, the duo remained upbeat that they had opted to appear at their favourite tournament of all. 2 from 2 for @ LaurenE_Smith as fighting spirit pulled her and @ ChloeBirch95 through today! 21-9 21-15. #YAE 20 pic.twitter.com/RUi5ZMP0Ax--Badminton England (@ BadmintonEnglnd) March 11, 2020\" It's still massive playing in front of a home crowd - obviously it's our favourite tournament and we love playing here, \"Gabrielle said .\" We like playing here each year, and weirdly, even though we've lost I'm just happy that we've got on court and that we've got a tournament next week that I should be fine for, so I'm going to get ready for that. \"Chris added:\" The first time we actually stepped on court for a couple of weeks was yesterday, so we didn't expect anything here really unfortunately. \"We've been a bit plagued with injuries leading into this event which is a shame, but we couldn't really turn down the opportunity to step on court .\" Any other tournament we wouldn't have given a go, but it's obviously hard to turn down an event like this. \"The fact that we took a set off a top ten pair with zero preparation is actually quite surprising .\" Ben Lane and Sean Vendy also succumbed to first round defeat, losing 21-14 21-12 against sixth seeds Hiroyuki Endo and <mark>Yuta Watanabe</mark>. The inexperienced pairing battled hard, however, and were still pleased to turn out in front of such a supportive home crowd. \"Of course it's always an experience I'll enjoy playing here - it's amazing playing in England, and this is the only tournament we really get to play where the crowds all come and we've got our families here,\" Lane said .?? You can watch the action from home on @ BBCSport & @ btsport...Or you can be here to see moments like this live for yourself...https: //t.co/n7BPDLYVZx #YAE 20 pic.twitter.com/vCZCNoEzzE--?? Yonex All England Badminton Championships?? (@ YonexAllEngland) March 11, 2020 \"It's obviously really disappointing when you lose, but at the end of the day they were better than us out there .\" Vendy added: \"The preparation has all been decent really, so I can't put the loss down to any other circumstances - I thought they were just better than us today .\" It's always nice to play in front of our home crowd - I think this is the third time we've played here and it's our favourite tournament by a long way. \"At the moment it doesn't feel quite so good as we've only got to play one game in it, but in years to come we hope we're going to be towards the latter end of the tournament .\" Elsewhere, final English pair Jenny Moore and <mark>Victoria Williams</mark> were unable to progress in the women's doubles, being forced to retire against Ashwini Ponnappa and N. Sikki Reddy when 5-4 down in the first game. And among the top seeds, there were wins for defending champion Chen Yufei in the women's singles, world No. 7 Viktor Axelsen in the men's singles and 2019 winners Zheng Siwei and Huang Yaqiong in the mixed doubles, while men's doubles world No. 1s Marcus Fernaldi Gideon and Kevin Sanjaya Sukamuljo took all three games to progress. The Yonex All England Open continues tomorrow as the last 16 battles get underway, with Ellis and <mark>Smith</mark>, <mark>Smith</mark> and Birch and Ellis and Langridge flying the home flag on what promises to be another scintillating day of badminton action."}, {"articleID": "2017101315_00482639_W", "names": {"Mark Campbell": ["Q18631520", "Q3849456", "Q41212795", "Q54858776", "Q56073254", "Q6766977", "Q6766978"]}, "date": "2017-10-13", "url": "http://www.bucksfreepress.co.uk/news/15595861.Rock_legend_Ozzy_Osbourne_sends_message_of_support_ahead_of_charity_concert/", "content": "Show caption () View gallery Skip to next image \"0 comments Get the latest local news straight to your inbox every day Sign up Rock legend Ozzy Osbourne has sent a message of support to organisers of a charity concert after donating a guitar to be auctioned off at the event. The concert is being held tonight at Pipers Corner School in aid of patients at The South Bucks Community Hospice. One of the highlights will be the sale of a signed LAG Tramontane donated by the Black Sabbath singer. Organisers were thrilled by the donation and have now been given an extra boost by a message from the star, who said:\" I'm delighted to be helping raise much needed funds for The South Bucks Community Hospice through the auction of one of my guitars from my home studio. \"The concert, mainly featuring bands from the school, has been arranged by Pipers Corner's guitar teacher <mark>Mark Campbell</mark>--whose terminally ill father Ian has been treated by the hospice at Butterfly House, High Wycombe. <mark>Mark</mark>, whose own acoustic band Luna Sees will also play on the night, said:\" I wanted to give something back because The South Bucks Community Hospice has done a really wonderful job looking after my father. \"Ozzy Osbourne is a legend and it's fantastic he has donated this guitar. I hope we will raise a lot of money as a result to help the hospice treat patients with life-limiting illnesses .\" <mark>Mark</mark>'s father Ian, 62, suffers from Motor Neurone Disease. He says the Hospice has been of huge help to him and his family over the last year. The concert begins at Pipers Corner, Great Kingshill, HP15 6LP, at 7.30 pm on Friday October 13. Tickets are £ 5 and everyone is welcome, although seats are limited to just under 300. To book tickets for the Pipers Corner concert, email http: //www.piperscorner.co.uk/our-school/box-office or to bid in advance for the guitar, email <mark>Mark</mark> at mcampbell @ piperscorner.co.uk. 0 comments"}, {"articleID": "2018061211_00553927_W", "names": {"Fredrik Ljungberg": ["Q10560", "Q5960884"]}, "date": "2018-06-12", "url": "http://www.eurosport.co.uk/football/premier-league/2016-2017/ljungberg-returns-to-arsenal-as-under-23-coach_sto6804575/story.shtml", "content": "<mark>Fredrik Ljungberg</mark> returns to Arsenal as Under-23 coach By Eurosport 10 minutes ago Updated 2 minutes ago 0 0 Former Arsenal midfielder <mark>Fredrik Ljungberg</mark> has returned to the Premier League club as coach of the Under-23 side, Arsenal said on Tuesday. The 41-year-old Swede, who coached Arsenal's Under-15 team in the 2016-17 season, was part of \"The Invincibles\" side who won the north London club's last Premier League title in 2003-04. \"He understands the club's values and how important it is to give young players the opportunity to grow and develop,\" Arsenal academy manager Per Mertesacker told Arsenal's website https: //www.arsenal.com/news/freddie-rejoin-u-23s-head-coach. \"Everyone knows Freddie loves the club and we look forward to him developing his career with us .\" <mark>Ljungberg</mark> played for Arsenal from 1998-2007 and made 216 appearances, scoring 46 goals. He was named the Premier League's player of the season in 2001-02. On the same topic"}, {"articleID": "2019071607_00228980_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Luke Smith": ["Q13512824", "Q16233583", "Q16853339", "Q17048712", "Q20713853", "Q22097885", "Q55621442"], "Jason Kingsley": ["Q24007513", "Q29033914"]}, "date": "2019-07-16", "url": "http://www.gamereactor.eu/?system=pc&sid=fe566ae8cf93bb2b4604c591b364a712", "content": "PC Alfonso John Romero quenches our thirst for details by explaining the mechanics that underpin Brenda Romero's long-awaited strategy game. Review Written by <mark>Sam Bishop</mark> on the 16th of July 2019 at 08 They've been signed just in time for CWL Miami, with the Championships just around the corner too. 0 Written by <mark>Sam Bishop</mark> on the 16th of July 2019 at 08 Details on the schedule and matchups have been revealed, with 64 streamers battling it out for supremacy. 0 Devotion studio had \"no intent to stage a publicity stunt\" Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 16:16 The developer has released a statement on the game, revealing that they will not be re-releasing it in the \"near term\". 0 Monster Hunter World's Iceborne DLC will deliver more difficulty Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 15:03 Capcom received feedback from fans who wanted a tougher challenge, and some changes are coming in to make sure that happens. 0 Cyberpunk 2077 won't let you fight story NPCs or children Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 14:30 You're free to hassle most people in CD Projekt Red's RPG, but there are a few exceptions in this dystopia. 0 Dota Underlords gets Proto Pass in beta Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:58 This is to test the battle pass system in time for Season 1, and Valve is looking for your feedback on the feature. 0 Gears 5 to feature 60Hz servers Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:52 A whole load of multiplayer details were revealed at the weekend, including the removal of core and competitive tunings. 0 Finishers like \"combat emotes\" in Destiny 2: Shadowkeep Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 13:24 Mark Noseworthy and <mark>Luke Smith</mark> explain these moves in a bit more detail, including the gameplay-altering affects they might have. 0 Stranger Things 3: The Game is on today's stream Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 11:31 We dive into the video game adaptation of the latest series, taking us back into the scary sci-fi adventure. 0 New PUBG video gives insight into anti-cheat measures Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 11:15 PUBG Corp. is using various methods to tackle hacking in their game, from machine learning to international partnerships. 0 Watch us battle through Just Cause 4's Los Demonios DLC Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 10:10 We unleashed an ancient evil on Solís last week, and stepped in to rid the land of the parasite pests. 0 Rebellion: Epic \"paying through the nose to build their store\" Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09:53 <mark>Jason Kingsley</mark> spoke about striking a deal with the company for Zombie Army 4 after saying they'd need a \"bloody good deal\" to do so. 0 Nicolas99FC wins as last 32 FIFA eWorld Cup Finals players confirmed Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09 They will all be heading to London's O2 Arena next month, where the best of the best will collide. 0 Ellivote and LullSiSH join Washington Justice Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 09 The Swedish players join a side with poor results in Stage 3 of the Overwatch League, consisting of Korean and American players. 0 Astralis parts ways with Rfrsh Entertainment Written by <mark>Sam Bishop</mark> on the 15th of July 2019 at 08 The decorated CS: GO team has gone their own way, and an alleged leaked email has emerged indicating this was on the cards for a while."}, {"articleID": "2017071017_00759755_W", "names": {"El Patron": ["Q5945041", "Q79231"], "Jose Rodriguez": ["Q16151948", "Q27049504", "Q3186137", "Q3810571", "Q56525305", "Q6293886", "Q6293887"]}, "date": "2017-07-10", "url": "http://www.pwmania.com/alberto-el-patron-involved-in-domestic-incident-at-orlando-airport-detained-by-police", "content": "News Impact Share on Facebook Tweet on Twitter GFW Impact World Heavyweight Champion Alberto <mark>El Patron</mark> was reportedly detained by police at the airport in Orlando on Sunday afternoon, according to PWInsider. The Orlando Police Department issued the following statement: \"There was an incident at Orlando International Airport at about 3 p.m. Sunday involving <mark>Jose Rodriguez</mark> (DOB 5/25/1977) The reported incident was a domestic violence battery, and it is still under investigation. No arrests have been made as of this time, but the case remains open. That is all the information we have for release at this time .\" <mark>Patron</mark> later missed an indie booking in Texas Sunday night. We do know that Paige and <mark>Patron</mark>'s family were in Orlando over the weekend as she posted the following photo from Universal Studios: @ UniversalORL time with the family. @ rootsoffight #FamilyStickTogether @ PrideOfMexico @ HijoDeDosCaras pic.twitter.com/LlD1SZwr0T--PAIGE (@ RealPaigeWWE) July 8, 2017"}, {"articleID": "2016050413_00526200_W", "names": {"James Smith": ["Q1027519", "Q10464386", "Q16534411", "Q16885746", "Q20738160", "Q2389622", "Q37615128", "Q3808437", "Q39395048", "Q39502042", "Q43911922", "Q52440", "Q54557216", "Q56724422", "Q57903671", "Q5925871", "Q6143308", "Q6143312", "Q6143324", "Q6143330", "Q6143331", "Q6143337", "Q6143352", "Q6201315"]}, "date": "2016-05-04", "url": "http://tewkesburyadmag.co.uk/news/14470423.Drive_to_recruit_more_firefighters_at_Pershore_Fire_Station/", "content": "Drive to recruit more firefighters at Pershore Fire Station On-call firefighter <mark>James Smith</mark>, checks equipment on a fire appliance / Vivien Mason, senior reporter / @ VivienMasonWN Share: 0 comments ON-call firefighters are being sought for Pershore Fire Station to provide cover both at the weekend and during the week. Hereford and Worcester Fire and Rescue Service will be holding an awareness session at the station on Tuesday May 10 for anyone interested in finding out more about the role. The session will be held at 6.30 pm. More information about the role can be obtained by registering an interest online through the fire service's latest vacancies section and then by coming along to the session. On-call firefighters must live or work within five minutes (actual travel time) of their local fire station and all recruits must be 18 or over at the date of joining. Station Commander Phil Berry said: \"We welcome interest from men and women who can get to the station within five minutes of being called and respond to an emergency. The role is a challenging yet extremely rewarding one which provides the local community with a vital service .\" Furthermore, it's also a chance to learn a range of new skills, such as accident prevention and first aid, which can be of real benefit in other areas of your life, whether at home or at work. \"<mark>James Smith</mark> has been an on-call firefighter at Pershore Fire Station for seven months. He said:\" ' I enjoy working as part of a team - it is great for your self confidence. \"Trainee on-call firefighters receive an annual retainer of between & pound; 1,651 to & pound; 2,202 plus extra pay for attending emergency call outs, and when fully trained can earn up to & pound; 8,000 a year, depending on the level of cover provided and the number of call-outs. Further details about the role of on-call firefighters can be found on the HWFRS website at www.hwfire.org.uk. Share: 0 comments"}, {"articleID": "2019012505_00105930_W", "names": {"Ben Okri": ["Q315362", "Q52898244"]}, "date": "2019-01-25", "url": "https://www.news18.com/news/buzz/jaipur-literature-festival-2019-live-updates-hinduism-and-music-engage-the-masses-at-the-kumbh-of-literature-2013023.html?ref=hp_ht_pos_1", "content": "JLF 2019 LIVE Updates: Hinduism and Music Engage the Masses at the Kumbh of Literature News18. com | January 25, 2019, 10:42 AM IST Event Highlights Tech Talk And we're back, boys and girls, readers and tweeters. The second day of the 12th edition of the world's largest literature festival has begun and the sun is shining, weather is sweet, make you want to move your dancing feet (copyright: Bob Marley). In case you're wondering about why we're so giddy, \"tis because the day began with a performance by Usha Uthup. Then, Nasreen Munni Kabir began today's first session with Gulzar on\" Jiya Jale: Stories Behind The Songs .' Another interesting session that is happening simultaneously at Charbagh is on Adi Shankaracharya, Hinduism's greatest thinker, in which Pavan K Varma is in conversation with Malashri Lal. The line-up of Jaipur Literature Festival boasts Man Booker-winner <mark>Ben Okri</mark>; Pulitzer-awardee Colson Whitehead; Yale Professor and renowned astrophysicist Priyamvada Natarajan; best-selling author Alexander McCall Smith; Man Booker-winning Yann Martel; writer and essayist André Aciman whose Call Me by Your Name inspired the movie which made the world fall in love with Timothée Chalamet; Andrew Sean Greer, New York Times bestselling-author and 2018 Pulitzer Prize-winner; Germaine Greer, writer, academic, and feminist first; Sohaila Abdulali, journalist and prolific writer; Anuradha Roy, winner of the DSC Prize for Fiction 2016, and longlisted for the Man Booker 2015; Chitra Banerjee Divakaruni, award-winning novelist, poet, activist and teacher of writing; British novelist and journalist Hari Kunzru; former Newsnight anchor Jeremy Paxman, one of Britain's best-known journalists and author of nine books; Jeffrey Archer, master of the twist-in-the-tale; NoViolet Bulawayo, the first black African woman and Zimbabwean to be shortlisted for the Man Booker; and Alvaro Enrigue, one of Spanish literature's most accomplished writers. Read More Jan 25, 2019 10:42 am (IST) br /> Nasreen Munni Kabir begins today's first session with Gulzar on \"Jiya Jale: Stories Behind The Songs .' Another interesting session that is happening simultaneously at Charbagh is on Adi Shankaracharya, Hinduism's greatest thinker, in which Pavan K Varma is in conversation with Malashri Lal .--ZEE Jaipur Lit Fest (@ ZEEJLF) January 25, 2019 Here's what the second day of the\" greatest literary show on Earth' has in store for you. Tune in to @ ZEEJLF and catch all these exciting panel sessions and others live on Twitter! #ZEEJLF 2019 pic.twitter.com/ufUuWQTfVl Jan 25, 2019 10:39 am (IST) br /> #overheardatJLF: \"This place is therapeutic but cheaper than therapy...I have been away from books for so long that I needed this\" Jan 24, 2019 Meanwhile, it seems the rain Gods are not answering the pleas of the JLF crowd. Very boring launch of The Long March. Audience praying for rain @ JLF--پرندوں کی نظر (@ birdseyeview) January 24, 2019 Jan 24, 2019 5:14 pm (IST) Time for some election talk Taking a dig at Prime Minister Narendra Modi, Shashi Tharoor says the title of his book \"Paradoxical Prime Minister' is apt .\" Initially, Mr Modi was saying all the correct things. He was talking about sabka vikas, He was saying I will be a prime minister for all Indians, he was saying that constitution was my holy book and so on and on. So I said we not only have to welcome these statements but by welcoming them we are putting up a yardstick against which we will judge him in future. If I had criticized him even when he was saying the right things, it undermines our credibility to criticise him when he does a wrong thing, \"Tharoor said. Six months after PM Modi came to power, Tharoor said he started writing his book\" Paradoxical Prime Minister'. \"I was able to begin it with words, I told you so,\" he said. \"He says all these liberal things and makes all these pronouncements. But he rests for his own political importance for his electoral viability across the country on the most liberal elements in the Indian society,\" the Congress leader said. \"Unfortunately, Mr Modi has spent the last four and a half year proving me right .\" Jan 24, 2019 4:16 pm (IST) Shashi Tharoor on what kind of \"liberal' he is:\" I think of myself as an instinctive liberal, not just ideologically but also in my attitude in life. In that sense that I think why should the government tell someone whom to love in the bedroom or what to eat? \"Jan 24, 2019 4:04 pm (IST) Shashi Tharoor's session on Tharoorism begins. Despite light showers at Diggi Palace, the session is packed. We already know #Tharoorism is a winner at JLF. Tharoor's farrago threatening to bring cold rain to #JLF 3:15 pm (IST) Damn it, Nirav. One needs to snack in order to snark. Nirav idk about you buddy can we have some damn lunch? Snark is hard work https: //t.co/hngsUYkGij--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 3:04 pm (IST) Juergen Boos spoke to Urvashi Butalia about\" So many books, so little time \". And we couldn't agree more with the sentiment/topic of discussion .--ZEE Jaipur Lit Fest (@ ZEEJLF) January 24, 2019 So Many Books, So Little Time: Juergen Boos in conversation with Urvashi Butalia https: //t.co/8IG8etZGsR Jan 24, 2019 2:31 pm (IST) While Sachin Pilot spoke to Sreenivasan Jain about democracy and the political process, and noting that he doesn't believe young people should be able to whatever they like, these young students were intently noting down his every word. We hope the deputy chief minister is okay with that. Jan 24, 2019 2:10 pm (IST) About time, no? Germaine Greer, author of the bestseller\" The Female Eunuch', speaks about her latest book \"On Rape', and argues that we need to rethink the discourse around rape. She and @ BeeRowlatt are in conversation at the @ NexaExperience Front Lawn #ZEEJLF 2019 pic.twitter.com/RQmCQf7ixT--ZEE Jaipur Lit Fest (@ ZEEJLF) January 24, 2019 Jan 24, 2019 1:49 pm (IST) Debroy on what the Puranas say about infant mortality:\" There is a story in the puranas that there was a demoness who devoured every third child. That tells us that the infant mortality rate in those days were 333 out of 1000, which was extremely high compared to today's India. \"--HarperCollins India (@ HarperCollinsIN) January 24, 2019. @ bibekdebroy in conversation with @ PushpeshPant on The Puranas at #ZeeJLF 2019 #HCIatZeeJLF. Arguably the most popular purana is the Bhagvad Purana. Many of the Puranas haven't been translated to English. My intent is to translate all 18 Puranas. pic.twitter.com/y4F5xnxLHv Jan 24, 2019 1:38 pm (IST) Nobel laureate and keynote speaker Venki Ramakrishnan:\" Art, literature and science are all ways of capturing essential truths about the world, but science has some distinctive aspects encapsulated in the Royal Society's motto is Nullius in verba, or \"On nobody's word .\" In science, it does not matter who you are or where something is written, but an idea is accepted because it is testable by experiments that can be reproduced by anyone anywhere in the world with the required training and expertise. Today, science is more important than ever. We live in a world in which science and technology are ubiquitous. Decisions are constantly made by governments, corporations, educators and others that affect us in profound ways. \"Jan 24, 2019--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 1:28 pm (IST) Bibek Debroy discussed The Puranas with Pushpesh Pant. Ancient Indian history and Hindu texts seem to be popular with many people at JLF with the masses flocking to Charbagh, Diggi Palace to hear Debroy speak .\" The puranas as well as the Ramanyanas and Mahabharatas suggests that all technologies like pushpak rath or brahmastras were always received from the god. Never invented by human beings. So people who suggest that India had all the science and technologies in ancient times must first read the puranas, \"said the author. Jan 24, 2019 12:56 pm (IST) A hit, a palpable hit. @ JLFInsider so that every time u use a cuss word it falls on your head! https: //t.co/4OSZbfB0eJ 12:06 pm (IST) Say what? Young politician thinks young people shouldn't be allowed to do whatever they want. Sachin Pilot on freedom of expression:\" I don't think young people should be allowed to do whatever they want. There is a limit. \"Wah wah--JLF Insider (@ JLFInsider) January 24, 2019 Jan 24, 2019 12:02 pm (IST) Pilot:\" Vasundhara ji promised 15 lakh new jobs in Rajasthan. There aren't that many jobs in entire Rajasthan even today. I do not want to make such promises which I cannot keep. \"Jan 24, 2019 11:53 am (IST) Sachin Pilot on Sabarimala:\" Generally we believe that women should be allowed to worship in any religious place. But in the particular instance of Sabarimala, there is a different set of sentiments that we also have to respect. \"Sure we do, especially ahead of elections. Jan 24, 2019 11:46 am (IST)\" I wasn't born a father. I wasn't born a mother. It's because of Meghna that I became a father and a mother. \"- Gulzar about Meghna. Jan 24, 2019 11:44 am (IST) Psst, the Vasu referred to here is Sreenivasan Jain Vasu asking Sachin how a young modern progressive foreign-educated person like himself can stand to be in a feudal, dynastic party like the Congress. Sachin's like MY PARTY IS THE BEST PARTY"}, {"articleID": "2020012917_00654235_W", "names": {"Joe Montana": ["Q348011", "Q6211408"], "Bill Walsh": ["Q15993626", "Q2903384", "Q4911274", "Q4911275", "Q4911277"], "Steve Young": ["Q16185674", "Q18818306", "Q30122679", "Q4356818", "Q55634010", "Q740086", "Q7614385", "Q7614386"], "Alex Smith": ["Q12720234", "Q16658140", "Q20011588", "Q2833039", "Q4717806", "Q4717807", "Q4717808", "Q4717809", "Q4717810", "Q4717811", "Q4717812", "Q4717814", "Q4717815", "Q4717818", "Q4717819", "Q57417658", "Q717897"], "Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Patrick Mahomes": ["Q11329045", "Q19667998"]}, "date": "2020-01-29", "url": "https://www.nbcdfw.com/news/sports/joe-montana-headlines-qbs-with-ties-to-49ers-chiefs/2300613/", "content": "Super Bowl <mark>Joe Montana</mark> Headlines QBs With Ties to 49ers, Chiefs <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs By Josh Dubow • Published January 29, 2020 • Updated 34 mins ago Soon after the Super Bowl matchup was set, Hall of Famer <mark>Joe Montana</mark> went to Twitter to send out a picture of his framed jerseys for the Kansas City Chiefs and the San Francisco 49ers. <mark>Joe</mark> Cool will be a champion once again. \"You heard from me first. I GUARANTEE my team will win the SUPER BOWL!!\" <mark>Montana</mark> tweeted. Sports Connection Connecting you to your favorite North Texas sports teams as well as sports news around the globe. Kobe Bryant 9 hours ago \"He Was Special': The NBA Tributes Continue for Kobe Bryant NFL 9 hours ago Hall of Fame DE Doleman Dies at Age 58 <mark>Montana</mark> won four Super Bowl titles in 14 years with the 49ers before finishing his career with two seasons on the Chiefs when he made one trip to the AFC championship game. The path from San Francisco to Kansas City is a well-traveled one for quarterbacks with four other passers besides <mark>Montana</mark> taking that route as starters. In fact, for 11 of 13 years starting in 1988, a former 49ers quarterback led the Chiefs in passing. Here's a look at the QBs who have started for both San Francisco and Kansas City: STEVE DEBERG DeBerg began his NFL career with the 49ers in 1978 and was <mark>Bill Walsh</mark>'s first starting quarterback in San Francisco the following year. DeBerg led the NFL in attempts and completions running <mark>Walsh</mark>'s West Coast offense in 1979 but the Niners still went 2-14. DeBerg was replaced the following year as starter by <mark>Montana</mark> and <mark>Walsh</mark> famously described his tenure like this:\" He plays just well enough to get you beat. \"DeBerg went on to spend time in Denver and Tampa Bay before joining the Chiefs in 1988. He started 52 games over four seasons and led Kansas City to two playoff berths, beating the Raiders in the wild-card round in 1991. <mark>JOE MONTANA</mark> <mark>Montana</mark> had his greatest success in San Francisco, helping establish a dynasty that won four Super Bowl titles in the 1980s. But with <mark>Steve Young</mark> waiting in the wings and an elbow injury that sidelined him for almost the entire 1991-92 seasons, <mark>Montana</mark> was dealt to Kansas City in 1993. <mark>Montana</mark> showed he still had plenty left with the Chiefs, making the Pro Bowl his first year when Kansas City made it all the way to the AFC title game in 1993 for the first time since winning the Super Bowl in 1970. <mark>Montana</mark> led the Chiefs back to the playoffs the following season before retiring. STEVE BONO Bono spent five years as the backup in San Francisco, serving as the third-stringer behind <mark>Montana</mark> and <mark>Young</mark> in 1989-90 and then winning five out of six starts in 1991 when both stars were injured. The Niners traded Bono to Kansas City in 1994 and he backed up <mark>Montana</mark> once again his first year before leading the team to 13 wins in his first season as starter the following year. He started one more year before getting cut when the Chiefs turned to another former Niners quarterback. ELVIS GRBAC After three years as <mark>Young</mark>'s backup in San Francisco, Grbac signed with the Chiefs in 1997 for the chance to be the starter. He started the first nine games that season before getting hurt, but helped Kansas City win the AFC West. Grbac returned for the season finale and then lost the playoff opener at home to Denver. Grbac split time with Rich Gannon in 1998 before starting his final two seasons with the Chiefs. <mark>ALEX SMITH</mark> <mark>Smith</mark> was the No. 1 overall pick by San Francisco in 2005 ahead of Aaron Rodgers. He struggled his first six seasons as a pro as the Niners lacked offensive talent and stability as <mark>Smith</mark> was forced to work with a revolving cast of coordinators that hindered his development. That all changed in 2011 when coach Jim Harbaugh arrived and <mark>Smith</mark> helped lead the Niners to 13 wins and a trip to the NFC title game that season. But <mark>Smith</mark> struggled in that loss to the New York Giants and then lost his starting job the following year to Colin Kaepernick after suffering a concussion. Kaepernick led San Francisco to the Super Bowl and the Niners dealt <mark>Smith</mark> to Kansas City. <mark>Smith</mark> became the starter in coach <mark>Andy Reid</mark>'s first season and led the Chiefs to the playoffs in four of his five seasons in Kansas City. But he was 1-4 in the playoffs, contributing to the decision to draft <mark>Patrick Mahomes</mark> in 2017 and then deal <mark>Smith</mark> to Washington after that season. ___ More AP NFL: https: //apnews.com/NFL and https: //twitter.com/AP_NFL Copyright AP - Associated Press This article tagged under: Super Bowl San Francisco 49ers Kansas City Chiefs <mark>Joe Montana</mark> 0"}, {"articleID": "2011101015_00112924_W", "names": {"Jim Price": ["Q1458383", "Q14950845", "Q14950988", "Q3512293", "Q6197608"]}, "date": "2011-10-10", "url": "http://sys-con.com/node/2013794", "content": "dell & vmware deliver the enterprise hybrid cloud are financial services organizations risking security by avoiding cloud computing? from consolidation to enterprise private paas driving the transformation to next generation cloud data centers the inevitability of an open cloud war in the clouds: are you ready? cloud storage: myths and realities cloud expo new york: cto power panel cloud expo new york: ceo power panel cloud expo new york: cmo power panel roadmap to enterprise cloud computing the move is on: cloud strategies for businesses unlocking the value of the cloud today sap the journey to on demand - lessons learned from small, high-growth customers what if you could transform it your way, using cloud 2.0? changing the game: how to get a cloud service up and running in less than 30 days cisco cloud strategy, within and across data centers next cloud on the horizon: exascale to microservers cloud computing - extending your it infrastructure it's all cloud: blurring the line between dedicated and cloud service parting the clouds - evaluating clouds and cloud providers for the enterprise from the wires papa bello enterprises acquires control of limited edition ink san diego, oct. 10, 2011 / prnewswire /--papa bello enterprises (pink sheets: papa) announced today that the company has acquired control of limited edition ink (leink). limited edition ink is a joint venture with avid ink., a 25% owner, that has developed an apparel vending system that will be deployed in theme parks, concert venues, sporting venues and other high traffic locations and will sell t-shirts related to the specific events. avid ink is one of the world's leading sublimation printing companies. ai's art department houses innovative artists with a library of 35,000 + open line designs. the 125,000 printing and production facilities include pre-press, digital, and four-color sublimation machinery, supported by ai color profile library to deliver the highest quality in the industry. leink is currently a development stage company and expects to deploy its first commercial vending machine in the first quarter of 2012. <mark>jim price</mark>, ceo of papa bello enterprises states, \"we made this acquisition in order to further diversify papa bello enterprises and its subsidiaries. we believe that leink is dynamic young company with a cutting edge concept. their technology presents a tremendous opportunity in the personalized apparel industry and we look forward to helping them grow their business and develop franchise opportunities for aggressive entrepreneurs .\" about papa bello enterprises founded in 2005, papa bello enterprises is a san diego, california based corporation that owns, operates, and franchises food service restaurants as well as other companies in the united states. the company was founded on the principles of providing the consumer with the highest standards of quality, value, and service. for more information on papa bello enterprises, please visit www.papabelloenterprises.com forward-looking statements disclosure this press release may contain \"forward-looking statements\" within the meaning of the federal securities laws. in this context, forward-looking statements may address the company's expected future business and financial performance, and often contain words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"seeks,\" \"will,\" and other terms with similar meaning. these forward-looking statements by their nature address matters that are, to different degrees, uncertain. although the company believes that the assumptions upon which its forward-looking statements are based are reasonable, it can provide no assurances that these assumptions will prove to be correct. all forward-looking statements in this press release are expressly qualified by such cautionary statements, risks, and uncertainties, and by reference to the underlying assumptions. published oct. 10, 2011 copyright? 2011 sys-con media, inc. - all rights reserved. about pr newswire copyright? 2007 pr newswire. all rights reserved. republication or redistribution of prnewswire content is expressly prohibited without the prior written consent of prnewswire. prnewswire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. subscribe to the world's most powerful newsletters subscribe to our rss feeds & get your sys-con news live! publish your article! please send it to editorial (at) sys-con. com! copyright? 1994-2008 sys-con publications, inc. all rights reserved. all marks are trademarks of sys-con media."}, {"articleID": "2014122806_00032218_W", "names": {"Edgar Ramirez": ["Q11290342", "Q273788"], "Louis Walsh": ["Q16228796", "Q658547"], "Enda Kenny": ["Q5375903", "Q57815"], "Jack O'Connell": ["Q16028203", "Q16184113", "Q16733588", "Q16733590", "Q22680912", "Q348066", "Q43379437", "Q6114376", "Q6114380"], "Elton John": ["Q16209157", "Q2808"], "Robin Williams": ["Q16853353", "Q27252", "Q28835708", "Q42954305", "Q7352873", "Q7352874", "Q83338"]}, "date": "2014-12-28", "url": "http://www.independent.ie/entertainment/movies/ramirez-evil-role-exorcised-fears-30865921.html", "content": "<mark>Edgar Ramirez</mark> starred in horror film Deliver Us From Evil Comments The Venezuelan actor, who plays Spanish priest Mendoza in Scott Derrickson's thriller, admitted he got scared of paranormal activities after watching The Exorcist. \"I remember that was the first horror movie that I saw. I saw three or four scenes, and I was traumatised for three years,\" he said. \"It was very difficult for me to sleep and I didn't watch the whole thing, that's how strong my reaction was. Then 35 years later, they offered me this movie, so that was a way to end my childhood fears, by being the exorcist .\" <mark>Edgar</mark>, who stars opposite Eric Bana and Olivia Munn in the film, said there was some unusual happenings on set. \"(It was) probably just hypersensitivity. I was in a bar and I went to the bathroom, and I saw that the paper machine, the ones that give you toilet paper if you put your hand on it, was broken. And then suddenly it went on, it just turned on and gave me paper (even though) I was very far away from it,\" he recalled. \"A couple of hours later, I am back in the bathroom, I am alone, and I heard that the machine was broken and actually somebody from production had put some extra paper on the side for us. Then (the paper towel dispenser) went out again .\" The 37-year-old actor added: \"Other than that, one of my crosses broke from the first exorcism. A metal cross. I put it in my pocket, and when I pulled it out, it was broken. But I wasn't scared any more .\" Rebel Wilson: Cohen wanted me naked Rebel Wilson has revealed how Sacha Baron Cohen kept trying to persuade her to strip off for his new film, Grimsby. Film hardman Ray Winstone has revealed he wet himself when he was introduced to gangster Ronnie Kray - although he was only six months old at the time. Irish writer scripts Sarah Jessica Parker's new show \"Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Movies: Coming soon to a screen near you Netflix October releases - A Separation, Girl Interrupted, Homeland, and...Yellow weather warning: Temperatures to plunge to minus five degrees tonight Hospital sends Christmas babies home in hand-knitted Christmas stockings\" Don't f *** ing insult the Irish people any more' - Liam Neeson won't move home to...Taxpayer faces huge bill over funding of \"quangos' Mother-of-two stabbed seven times with potato peeler by Facebook\" friend' Bus assault victim to return to \"safer' Mexico after Dublin attack Adams rewriting of Provo history sees McAuley-types lionised by SF\" The Interview' review: Controversial gross-out satire is broad, bawdy and bad - but...Take our 100-question quiz of the major events of 2014 VIDEO: Jamie Foxx: Hard missing time with family VIDEO: Seth Rogen attends The Interview movie release on Christmas Day US movie fans queue around the block as The Interview finally...VIDEO: Penguins Of Madagascar, Annie, Night At The Museum 3, all big at...Now that UK cinemas are back open after Christmas, there...The Movie Show: Unbroken and Exodus: Gods and Kings Aoife Kelly is joined in studio by Geroge Byrne and Paul Whittington to take a look at two of the...VIDEO: One Direction's Best Moments of 2014 Take a look back at One Direction's best moments of 2014. From the awards to the...VIDEO: Seth Rogen speaks out on The Interview controversy Seth Rogen finally breaks his silence as Sony announces that The Interview will be released. VIDEO: Sony confirms release of The Interview Sony has announced a limited cinema release of The Interview, putting the comedy back on to...VIDEO: \"One more time' - Independent. ie reporters share their 2014 bloopers It's been a busy year in news, so it's understandable that there...VIDEO: Legendary Singer Joe Cocker Passes Away VIDEO: Barry Egan meets <mark>Louis Walsh</mark> VIDEO: Celebrities Get Festive for the Y100 Jingle Ball A host of celebrities brought Christmas cheer to Florida as they performed at the Y100 Jingle Ball. Video: Build Your Own Gaming PC 1: The Case We're taking a look at what it takes to build your own gaming PC. To start off we're focusing...VIDEO: Barry Egan meets <mark>Enda Kenny</mark> Barry Egan scores a rare interview with our great leader, <mark>Enda Kenny</mark>. VIDEO: Caroline Flack wins Strictly Come Dancing More than 11 million people watched Caroline Flack as she was crowned champion of this...VIDEO: <mark>Jack O'Connell</mark> says Angelina Jolie is loved in Derby Angelina Jolie will always have a fanbase in Derby thanks to a.. . VIDEO: Christmas nuptials: <mark>Elton John</mark> shares snaps of official wedding to David...Nine years after they first tied the knot in a civil ceremony,...The Script, The Coronas and Joe Duffy entertain crowds on Grafton Street From Shirley Temple to <mark>Robin Williams</mark>, the stars of music, stage and screen we lost in 2014 Deck the hair with boughs of holly - Beards are this year's Christmas Jumper Beards are this year's way to flaunt your festive feeling -...The best signs at today's #WaterCharges protest In pictures: Love/Hate Season 5 finale 10 actresses who could play Bridget Jones As reports suggest Reese Witherspoon could be replacing Renee Zellweger on the third...Love/Hate series five - the story so far Top 10 sexist ads - prepare to feel your blood boil...By using this website you consent to our use of cookies. For more information on cookies see our"}]