[{"articleID": "2009020503_00041304_W", "names": {"Charles Reed": ["Q22106118", "Q5081968", "Q57412767"]}, "date": "2009-02-05", "url": "http://feeds.sfgate.com/click.phdo?i=bb663b1d1444cb127deadb94aad1042f", "content": "article: uc regents to vote on new admissions rules: / c/a/2009 / 02/04/mn7u15nebb. dtl \"the bottom line is that it will be more diverse and more fair,\" said uc president mark yudof. the full board is expected to approve these changes today:--sat subject tests would no longer be necessary .--the pool of applicants who'd be considered would widen, but the number guaranteed entry into one of the university's nine undergraduate campuses would shrink .--the top 9 percent of high school graduates statewide would be ensured entry, compared with 12.5 percent previously, as well as those in the top 9 percent of their graduating class - up from 4 percent in the past. taken together, the two groups would constitute 10.1 percent of california's graduating class, based on projections by the university. the revised requirements would affect the freshman class of 2012. the changes would allow high school students to be considered - and granted a full review of their application - who complete by the end of junior year at least 11 of 15 college prep courses required by uc, achieve a weighted 3.0 grade-point average, and take either the act plus writing or sat reasoning test.uc was the only public education system in the country that made students take two sat subject tests. the result: 22,000 high school graduates in california were disqualified in 2007 from applying to the university who otherwise would have been eligible. members of the uc academic senate, who spent almost four years putting together the eligibility proposal, based this estimate on 2007 data from the california postsecondary education commission. that data also made them conclude that 21.7 percent of high school graduates in the state would have been entitled to a comprehensive review of their applications in 2007, compared with the 13.4 percent who were actually eligible for uc in that period. \"this proposal will give us a chance to look at those (kinds of) lost students,\" said regent eddie island. \"they might not get in, but we'll look at them as individuals .\" the promise of uc admission to the top 12.5 percent of graduates goes back to the 1960 master plan for higher education. a few regents worried about deviating from such a venerable road map. \"i feel like i got out my lantern, like diogenes, looking for the master plan,\" yudof said. he emphasized that he had talked to legislators, california state university chief <mark>charles reed</mark> and community college leaders. \"they were all simpatico with this,\" yudof said. to avoid a perception that the university was lowering its standards, yudof had asked the creators of the proposal to raise the required gpa to a 3.0, weighted with honors courses, instead of an unweighted 2.8. that change was reflected in the plan the regents' committee on educational policy unanimously voted for on wednesday. although eligibility changes had been discussed in four earlier regents' meetings, there was still much confusion. \"now i can see why i was not uc eligible,\" said regent norman pattiz. \"how are we going to get this in a little pamphlet and hand it to parents to see what it takes?\" some people saw the shift - endorsed by the university of california student association - as a way to get around proposition 209, which was approved by voters in 1996 and ended race - and gender-based anti-discrimination programs in state, county and city hiring, contracting and school admissions. yudof said he supported affirmative action but would obey prop. 209 because it is the law. he was sure the new rules would increase diversity, but said it was too early to know the specific impact. \"we want to change the behavior of applicants and admissions officers,\" he said. and by looking at the \"whole file,\" as he put it, colleges can find out if a student did volunteer work or overcame a hardship or wrote the great american novel or climbed mount everest. although the changes dominated the meeting, few members of the public addressed them. most, instead, were angry about having to soon contribute to their retirement fund without being represented on the pension board. \"we won't pay without a say,\" they chanted. one protester was ellie corley, 72, an administrative assistant in the uc controller's office who has worked at the university for 33 years and makes $35,000 a year. she got laid off in january and will leave in march. kiss my boy scout gays! buddha! stemware! time to reinvent the scouts for the new world. pharm closes holistic drug store elephant pharm shutters all 3 bay area locations. kiss my boy scout gays! buddha! stemware! time to reinvent the scouts for...site index advertising services: sorry, comments are closed for this story."}, {"articleID": "2016071415_00910319_W", "names": {"David Wilson": ["Q11320682", "Q167028", "Q16849502", "Q19594138", "Q21453228", "Q26329468", "Q2642471", "Q27683615", "Q28914261", "Q29033812", "Q29643806", "Q30122994", "Q3018168", "Q3019005", "Q3703375", "Q39071263", "Q39073912", "Q42841755", "Q5234991", "Q5241195", "Q5241198", "Q5241199", "Q5241202", "Q5241203", "Q5241205", "Q5241209", "Q57025576", "Q676969"]}, "date": "2016-07-14", "url": "http://bworldonline.com/content.php?section=TopStory&title=impact-seen-muted-for-nickel-amid-phl-review&id=130456", "content": "Impact seen muted for nickel amid PHL review Posted on July 15, 2016 MANILA/LONDON--An environmental crackdown on Philippine mines, which helped drive nickel prices to eight-month highs, is likely to have only a muted impact on exports to China in the short term because the biggest mines have met guidelines, experts said. RELATED STORIES Philippines' top nickel ore producer sees flat shipments, better prices this year The Philippines is the biggest exporter to top metals consumer China of nickel ore, used to make stainless steel. A smattering of smaller mines are likely to be affected in coming months and new mines will probably face tough going in the future, but the review of the mining sector is not likely to result in a quick drop in shipments. \"The Chinese think the Philippines will continue exporting ore to China and only some small mines will be affected. They're not worried about the situation at the moment,\" said Peter Peng, analyst at CRU consultancy in Beijing. The biggest Philippine producer, Nickel Asia Corp., which has already complied with international mining standards, accounted for close to 40% of Philippine nickel ore production last year, according to analyst <mark>David Wilson</mark> at Citi in London. Three other major miners also say they have approvals, while small-scale miners only accounted for about 11% of ore produced last year, he added. \"We therefore suspect that the impact of environmental license suspension may be more limited than initially feared, and believe the recent rally will run out of steam,\" he said in a note. Of the 40 operating mines, 21 have obtained their ISO 14001 certification, said Ronald S. Recidoro, Legal & Policy vice-president of the Chamber of Mines of the Philippines. POPULAR ANGER Benchmark nickel prices on the London Metal Exchange have rallied a fifth to eight-month highs since June 4 when incoming President Rodrigo R. Duterte warned mining companies to \"shape up\". What remains unknown is how tough the mining minister, Regina Paz \"Gina\" L. Lopez, a committed environmentalist, will be in enforcing environmental and social responsibility rules. Days after she assumed office on June 30, a review of all mines was launched and two small mines were suspended. Analyst Jim Lennon, a consultant for Macquarie, said politicians in the Philippines were responding to public anger at damaging practices in the small-scale mining sector. \"Small miners are stripping away the overgrowth and the forestry and mining down 5-10 meters (yards), but don't bother replacing the overburden and replanting,\" Lennon said. Philippine nickel ore exports to China were already down this year before the crackdown, due to low prices and as some mines ran out of ore. \"Exports are down 25% in the first half anyway, because of the price and reserve exhaustion, so if any of the mines were to be shut down, there's still plenty of capacity,\" Mr. Lennon said. \"So my feeling is that there will be more of an impact on new mines because I think there will be a much more extended environmental approval process .\" The Philippine government has halted permits to develop new mines since 2012 while it works out ways to get more revenue from the sector, but such efforts in Congress have stalled .--Reuters E-mail |"}, {"articleID": "2009103119_00068576_W", "names": {"Eric Walker": ["Q3056424", "Q5387694"]}, "date": "2009-10-31", "url": "http://southyorkshiretimes.co.uk/sport/Coach-Eric-is-just-knockout.5769055.jp", "content": "the plaudits continue to come in for veteran boxing trainer <mark>eric walker</mark> whose 50-plus year career in and out of the ring has led to a string of awards. <mark>walker</mark> - who runs the wombwell and dearne amateur boxing club in bolton-upon-dearne - has now been named coach of the year at the rotherham sports awards in recognition for his successes over the past year. he said: \"i'm over the moon, this is brilliant. this is about the fifth one i've had now, but it's still great to get them .\" two years ago <mark>walker</mark> received a lifetime achievement award at the south yorkshire sport awards in recognition of his half-century career. current young prospect connor nixon is a champion at national level and will again box for england this weekend - a status he initially acquired after just 11 amateur fights out of wombwell and dearne abc. <mark>walker</mark> also runs coaching sessions where he trains pupils who have had problems at school and helps them achieve a qualification. he first picked up the pads in his early thirties, after a stint as an amateur fighting out of mexborough. initially he took up residence at a gym alongside a karate and kick-boxing instructor, until the amateur boxing association ruled that the disciplines should not be practiced together and he was forced to move out on his own. the black bull pub in stairfoot, barnsley, became his stable's new home as he converted the small upstairs room into a gym with home-made equipment and a ring. as the club expanded he moved into wombwell swimming baths before taking over from his friend jack priestley at a declining gym in bolton-on-dearne where he remains, 20 years on. in his time <mark>walker</mark> has produced some of south york-shire's brightest boxing talents out of wombwell and dearne amateur boxing club through various special techniques and approaches. the brookes brothers - stuart and the late scott - both started their boxing careers with <mark>walker</mark> while successful amateur tommy coward remains in his stable."}, {"articleID": "2014102403_00004096_W", "names": {"John Carr": ["Q37372878", "Q37731921", "Q47546431", "Q55938805", "Q6225265", "Q7307535"]}, "date": "2014-10-24", "url": "http://www.stanforddaily.com/2014/10/23/anita-speaking-truth-to-power-screened-at-title-ix-conference/?utm_source=rss&utm_medium=rss&utm_campaign=anita-speaking-truth-to-power-screened-at-title-ix-conference", "content": "A Tale of Two Transfers Dylan Fugel dives into the to divergent paths of the past two Stanford quarterback transfers, Brett Nottingham and David Olson Back and forth with OSU Daily Barometer With the Oregon State game rapidly approaching, the Daily's Winston Shi talked about the matchup with the OSU Daily Barometer sports editor TeJo Pack Our talented staff of editors, writers and photographers form the hub of Stanford-related news, the voice of the student body and a window into the Farm for a broad print and digital audience. Scene from \"Anita: Speaking Truth to Power .\" Courtesy of American Film Foundation. Like many political events of the past few decades, Anita Hill's 1991 testimony before the Senate's Committee on the Judiciary can be recognized from a few token soundbites. Hill, then an attorney-advisor to Clarence Thomas, accused Thomas of sexual harassment preceding confirmation hearings for his nomination as Associate Justice of the Supreme Court. Hill passed a polygraph test; Thomas declined, calling it a \"high-tech lynching for uppity blacks .\" According to the film \"Anita: Speaking Truth to Power,\" this phrase is a grossly misleading caricature of a difficult case. The original hearing was televised on October 12. As a nod, it seems, both to the anniversary of Hill's hearing and the recent controversy surrounding Title IX rights on campus, Stanford University sponsored a two-day conference from October 16 to 17 with Hill, now a professor at Brandeis University. The conference featured a new documentary and workshops on Hill's hearing and sexual harassment in the workplace. \"Anita: Speaking Truth to Power\" was screened on October 16 at Paul Brest Hall, with a Q & A with Professor Hill afterwards. Director Freida Mock's documentary is a compilation of interviews with Hill and her colleagues and footage from the original hearing. Throughout the film, the audience is granted glimpses of a woman who remained remarkably poised while under attack from members of Congress. In the course of the film's commentary, Hill's friends point out the imbalance of demographics at the trial's outset. The Senate Judiciary Committee was homogeneously white and male (a much younger Joe Biden presided over the proceedings). Gender and race were hot-button topics that received only a cursory evaluation - the film commits a number of blundering inquiries to memory. In an interview, <mark>John Carr</mark>, a friend of Hill's, underscored the invisible consequences of the trial. \"She paid the price,\" said <mark>Carr</mark>. \"She could've been a judicial nominee .\" The film highlighted the committee's bouts of targeted questioning, most of which required that Hill reiterate embarrassing details of her encounters with Thomas, seemed designed to make her sound absurd. Hill's quiet resilience provided a foil for Thomas's fiery rebuttals. \"I think that this today is a travesty,\" said Thomas during his testimony, in reference to the hearing in whole. He proceeded to categorically reject every accusation against him - the phrase \"high-tech lynching\" was used during this opening salvo. \"He played the race card,\" said <mark>Carr</mark> of Thomas's phrasing. The focus of the trial promptly turned away from sexual harassment and towards race. For this reason, perhaps, Thomas was cleared for his hearing and confirmed as a justice by a vote of 52-48, the narrowest margin to date. Hill returned to her teaching position at the University of Oklahoma soon after the trial. Today, Hill speaks on sexual harassment, using her experiences as a vehicle. She engaged the audience in a Q & A session following the film screening. One female audience member expressed her shock at the blatant rudeness of committee members' questions: \"Has anyone apologized?\" Hill's response was at once illuminating, disappointing, and inspiring. \"No, no apologies,\" she said. \"[In] Washington, apologies are easy - they don't mean anything. What I want is action .\" She described her faith in the younger generation of female leaders and politicians, young women who could use her experience to move forward. Event Details CALLING ALL VIDEOMAKERS! CreaTV San Jose announces the Call for Entries for the 2014 CreaTiVe Awards. Videomakers from the Bay Area and Santa Cruz are invited to submit videos and TV shows [...] CALLING ALL VIDEOMAKERS! CreaTV San Jose announces the Call for Entries for the 2014 CreaTiVe Awards. Videomakers from the Bay Area and Santa Cruz are invited to submit videos and TV shows for competition in one or more of 10 categories at www.creatvsj.org through November 15, 2014. Finalists announced 12/8. Winners announced 1/10/15. Winners receive valuable prizes. Questions? Tips? Contact Pam Kelly at (408) 295-8815 ext. 307 or pam.kelly @ creatvsj.org. Time October 10 (Friday) - November 15 (Saturday) Reserved seating $15 / 20 20% discount for Stanford alumni, employees, and students 1:30 p.m. Science showcase 2:30 p.m. CCRMA performance Stanford University's Center for Computer Research in Music and Acoustics (CCRMA, pronounced \"karma\" ) has been on the scene of electronic and computer-generated sound, since, well, before there was a scene. We are proud in 2014 to be celebrating three important moments in the history of CCRMA and of computer music: founder John Chowning's 80th birthday; the 50th anniversary of the first computer music program on campus (in the form of a stack of punch cards); and the 40th anniversary of CCRMA."}, {"articleID": "2017120906_00047358_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2017-12-09", "url": "https://www.timesofisrael.com/angry-worshipers-lash-out-against-trump-across-muslim-world/", "content": "home page Muslim men burn portraits of US President <mark>Donald Trump</mark> and rally against his decision to recognize Jerusalem as Israel's capital in Banda Aceh, Indonesia, Friday, Dec. 8, 2017. (AP Photo/Heri Juanda) Large crowds of worshipers across the Muslim world staged anti-US marches Friday, some stomping on posters of <mark>Donald Trump</mark> or burning American flags in the largest outpouring of anger yet at the US president's recognition of bitterly contested Jerusalem as Israel's capital. In the holy city itself, prayers at the Temple Mount site dispersed largely without incident, but Palestinians clashed with Israeli troops in several dozen West Bank hotspots and on the border with the Gaza Strip. Get The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up <mark>Trump</mark>'s pivot on Jerusalem triggered warnings from America's friends and foes alike that he is needlessly stirring more conflict in an already volatile region. The religious and political dispute over Jerusalem forms the emotional core of the Israeli-Arab conflict. The ancient city is home to major Jewish, Muslim and Christian shrines and looms large in the competing national narratives of Israelis and Palestinians. In a Wednesday address from the White House, <mark>Trump</mark> defied worldwide warnings and insisted that after repeated failures to achieve peace a new approach was long overdue, describing his decision to recognize Jerusalem as the seat of Israel's government as merely based on reality. The move was hailed by Israel's Prime Minister Benjamin Netanyahu and by leaders across much of the Israeli political spectrum. <mark>Trump</mark> stressed that he was not specifying the boundaries of Israeli sovereignty in the city, and called for no change in the status quo at the city's holy sites. <mark>Trump</mark>'s decision on Jerusalem is widely seen in the region as a blatant expression of pro-Israel bias, but it was unclear if protests and confrontations would maintain momentum after Friday. The Saint Georges Cathedral, illuminated by a giant projection of the Church of Holy Sepulchre, in down town Beirut, Lebanon, Thursday, Dec. 7, 2017. A number of US allies in the Middle East are condemning the <mark>Trump</mark> administration's decision to recognize Jerusalem as the capital of Israel, with the United Arab Emirates, Kuwait, Qatar and Saudi Arabia urging Washington to reconsider and reverse the announcement. (AP Photo/Bilal Hussein) Across the region--from Asia's Indonesia, Malaysia and Pakistan to North Africa's Algeria and Lebanon in the Levant--thousands of worshipers poured into the streets after midday prayers to voice their anger. Some protesters burned US and Israeli flags or stomped <mark>Trump</mark> posters that showed the president alongside a Nazi swastika. In Jordan's capital of Amman, thousands marched through the center of town, chanting \"America is the head of the snake .\" Pro-Western Jordan is a crucial US. ally in the fight against Islamic extremists, but King Abdullah II cannot afford to be seen as soft on Jerusalem. His Hashemite dynasty derives its legitimacy from its role as guardian of the Al Aqsa Mosque in Jerusalem, Islam's third-holiest site, that sits on the Temple Mount. <mark>Trump</mark>'s decision has also strained US foreign relations UN Mideast envoy Nickolay Mladenov told an emergency session of the UN Security Council on Friday that <mark>Trump</mark>'s announcement created a \"serious risk\" of a chain of unilateral actions that would push the goal of peace further away. Palestinian UN Ambassador Riyad Mansour warned of the danger of \"a never-ending religious war that will only be exploited by extremists, fueling more radicalism, violence and strife in the region and elsewhere .\" Even traditional US allies sharply criticized <mark>Trump</mark>'s decision. Sweden's UN Ambassador Olof Skoog said the US action \"contradicts international law and Security Council resolutions .\" Britain's Ambassador Matthew Rycroft called the US decision \"unhelpful to peace,\" the French envoy expressed regret and Italy's Sebastiano Cardi warned of \"the risk of unrest and tensions in the region .\" The US ambassador, Nikki Haley, told the council that the <mark>Trump</mark> administration is more committed to peace \"than we've ever been before--and we believe we might be closer to that goal than ever before .\" Haley did not explain. Palestinians hold a placard with the picture of US President <mark>Donald Trump</mark> during a protest in Athens, on Friday, Dec 8, 2017. Several hundred Palestinians living in Greece, backed by Greek leftist demonstrators, protested the US decision to recognize Jerusalem as the capital of Israel (AP Photo/Petros Giannakouris) In Europe, US Secretary of State Rex Tillerson on Friday played down the impact of <mark>Trump</mark>'s policy shift, which also included a pledge to move the US Embassy in Israel from Tel Aviv to Jerusalem. Tillerson said it will likely take years for the US to open an embassy in Jerusalem. In a news conference with the French foreign minister, Tillerson said <mark>Trump</mark>'s recognition of the city as Israel's capital \"did not indicate any final status for Jerusalem .\" The United States is making clear that Jerusalem's borders will be left to Israelis and Palestinians to \"negotiate and decide,\" he said. Most countries around the world have not recognized Israel's 1967 annexation of East Jerusalem and maintain their embassies in Tel Aviv. Under a longstanding international consensus, the fate of the city is to be determined in negotiations. <mark>Trump</mark>'s announcement delivered a blow to <mark>Abbas</mark>, a supporter of the idea of reaching Palestinian statehood through US-led negotiations with Israel. In siding with Israel on Jerusalem, he has said, the <mark>Trump</mark> administration effectively disqualified itself as a mediator. However, Palestinian Authority President <mark>Mahmoud Abbas</mark> has not decided how to move forward, including whether he will rule out future US-brokered negotiations. <mark>Trump</mark> has said he still intends to propose a Mideast peace deal. More than two decades of intermittent Israeli-Palestinian negotiations have failed to bring the Palestinians closer to statehood. Some in <mark>Abbas</mark>' inner circle say the old paradigm, with the US serving as mediator, is no longer relevant. On Thursday, a senior Fatah official said the Palestinians would not receive Vice President Mike Pence when he visits the West Bank later this month, but it was not immediately clear if the official spoke for <mark>Abbas</mark>. The Arab League, an umbrella group of close to two dozen states, is to meet Saturday to try to forge a joint position, followed next week by a gathering in Turkey of the 57-state Organization of Islamic Cooperation. Turkish officials said Russian President Vladimir Putin will travel to Turkey next week for talks with President Recep Tayyip Erdogan on Jerusalem's status and other issues. read more: Israel & the Region <mark>Trump</mark> recognizes Jerusalem anti-Israel protests Muslim world Jerusalem <mark>Mahmoud Abbas</mark> Nikki Haley Facebook Twitter email Print shares comments"}, {"articleID": "2011051222_00012496_W", "names": {"Mark Tyler": ["Q16940283", "Q6770107"], "Mark Wood": ["Q13557592", "Q15834042", "Q1900523", "Q20354220", "Q21457093", "Q48938305", "Q6770410", "Q6770411", "Q6770412", "Q6770413"], "Gareth Taylor": ["Q21461717", "Q27051945", "Q3758314"]}, "date": "2011-05-12", "url": "http://dunstabletoday.co.uk/sport/football/local-football/penalty_wish_works_for_zed_1_2668977", "content": "thu may 12 09:04:49 bst 2011 a wish to the heavens came true for zdenek kroca on tuesday night when <mark>mark tyler</mark> pulled off a dramatic penalty save against wrexham to help propel the hatters into the blue square bet premier play-off final, writes <mark>mark wood</mark>. luton may have won the tie 5-1 on aggregate but tuesday night's game was anything but plain sailing. leading 3-0 from the first leg, town were behind after just eight minutes when andy mangan netted before winning a penalty 12 minutes later that could have turned the tie on its head. but <mark>tyler</mark> came to luton's rescue, denying <mark>gareth taylor</mark> from the spot, with kroca revealing: \"i just wished a bit of luck for us .\" in the fa trophy kevin pilkington saved the penalty but their player had a tap in from the rebound and i just wished a little bit of luck for us. \"<mark>tyler</mark> made a great save and after that moment we played well .\" the czech defender admitted luton had started poorly and <mark>tyler</mark>'s save was the turning point. he said: \"it's hard because we knew we were three goals up and they had nothing to lose and scored an early goal .\" the start of the game wasn't what we wanted. \"we were a little bit nervous and under pressure .\" then from the penalty they had a great chance to extend their lead. \"thanks to tyles who saved a penalty and kept us in the match .\" if they were two-up it would be much more difficult for us. \"kroca then weighed in with a 29th-minute equaliser on the night to all but kill off the red dragons. he said:\" i'm happy that i scored and helped the team to be a little bit more confident. \"i think the keeper made the wrong decision. he took a step forward and i just tried to hit the target and scored over him .\" we calmed down after this goal and it lifted our confidence - we were the best side after the goal. \"they needed to score three goals again and i think after the goal we were the better side .\" we should score more than the two goals. we thought we played the best second half of the two teams. \"kroca was also full of praise for town's fans, adding:\" it was a big game and a big crowd. they supported us. \"athough we were one goal down they still believed in us and we have to say thank you for supporting us. temperature: 6 c to 16 c wind speed: 25 mph terms and conditions all rights reserved? this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by temperature: 7 c to 17 c wind speed: 14 mph temperature: 6 c to 15 c wind speed: 18 mph temperature: 8 c to 16 c wind speed: 17 mph temperature: 10 c to 17 c wind speed: 17 mph"}, {"articleID": "2016092821_00608163_W", "names": {"John Brennan": ["Q16229793", "Q27044621", "Q58198198", "Q6223063", "Q6223068", "Q984191"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Katherine Clark": ["Q58757120", "Q6376330"], "Joseph Kennedy": ["Q18153879", "Q21289316", "Q27981477", "Q8041616"], "Stephen Lynch": ["Q21063195", "Q2164670", "Q2344921", "Q7609833", "Q7609834", "Q7609835", "Q7609836"], "Richard Neal": ["Q1464697", "Q7328011"]}, "date": "2016-09-28", "url": "http://www.bostonglobe.com/news/nation/2016/09/28/congress-votes-override-obama-veto-bill/DjfRAup4ICADpdLFzbEx1I/story.html", "content": "WASHINGTON--Congress voted overwhelmingly Wednesday to allow families of Sept. 11 victims to sue Saudi Arabia for its alleged backing of the attackers, handing Barack Obama the first veto override of his presidency. Both the House and Senate voted decisively to reverse Obama's decision to scuttle the legislation. Democrats in both chambers abandoned the president in large numbers despite warnings from Obama and top national security officials that flaws in the bill could put US interests, troops, and intelligence personnel at risk. Advertisement The Senate vote was 97-1. The House vote a few hours later was 348-77. Lawmakers said their priority was the 9/11 victims and their families, not Saudi Arabia. \"The White House and the executive branch (are) far more interested in diplomatic considerations,\" said Senator Chuck Schumer, Democrat of New York and a sponsor of the bill. \"We're more interested in the families and in justice .\" Speaking at a forum in Washington, CIA Director <mark>John Brennan</mark> said he was concerned about how Saudi Arabia, a key US ally in the Middle East, would interpret the bill. He said the Saudis provide significant amounts of information to the United States to help foil extremist plots. \"It would an absolute shame if this legislation, in any way, influenced the Saudi willingness to continue to be among our best counterterrorism partners,\" <mark>Brennan</mark> said. Advertisement <mark>Brennan</mark>, who said he visited lawmakers Wednesday to argue against an override of Obama's veto, noted that there is a tremendous amount of Saudi investment in the United States. \"Do they want to leave them here so they could potentially be attached by some type of court ruling that is going to award the litigants?\" he asked. After senators acted, White House spokesman Josh Earnest called the vote the \"single most embarrassing thing\" the Senate has done in decades and \"an abdication\" of its responsibility. He accused members of the Senate Judiciary Committee of not understanding the legislation and its impact on the military. Five weeks before state and national elections, lawmakers refused to oppose a measure strongly supported by 9/11 families who say they are still seeking justice 15 years after attackers killed nearly 3,000 people. Saudi Arabia is staunchly opposed to the measure. Despite reversing Obama's decision, a group of senators acknowledged that defects in the bill could open a legal Pandora's box, triggering lawsuits from people in other countries seeking redress for injuries or deaths caused by military actions in which the United States may have had a role. In a letter sent Tuesday to Senate minority leader <mark>Harry Reid</mark>, Obama said the bill would erode sovereign immunity principles that prevent foreign litigants \"from second-guessing our counterterrorism operations and other actions that we take every day .\" <mark>Reid</mark> was the lone senator to side with the president. But proponents of the bill dismissed Obama's concerns as unpersuasive. Senator John Cornyn of Texas, the Senate's No. 2 Republican, and other supporters said the bill is narrowly tailored and applies only to acts of terrorism that occur on US soil. \"This bill is about respecting the voices and rights of American victims,\" Cornyn said. Families of the victims and their attorneys dismissed concerns over the legislation as fear-mongering. Senator Ben Cardin of Maryland, one of the Democrats who broke with Obama and voted to override, said, \"The risks of shielding the perpetrators of terrorism from justice are greater than the risks this legislation may pose to America's presence around the world .\" The legislation gives victims' families the right to sue in US court for any role that elements of the Saudi government may have played in the 2001 attacks. Fifteen of the 19 Sept. 11 hijackers were Saudis. Courts would be permitted to waive a claim of foreign sovereign immunity when an act of terrorism occurred inside US borders, according to the terms of the bill. A group of national-security minded legislators pledged to discuss how to repair problem areas during the upcoming lame-duck session of Congress. But the fact that legislation could pass both chambers of Congress without closer scrutiny left at least a few senators chiding themselves for not examining its ramifications more closely. The Justice Against Sponsors of Terrorism Act moved to the floor of the Senate in May and was passed by voice vote. The bill cleared the House earlier this month, also by voice vote. \"We didn't pay much attention to this,\" said Senator Dianne Feinstein of California, the top Democrat on the Senate Intelligence Committee. \"And boy is that ever a lesson learned .\" Obama vetoed the measure last week, telling lawmakers the bill would make the country vulnerable to retaliatory litigation. In his letter to <mark>Reid</mark>, the president said other countries could attempt to use law to justify similar immunity exceptions to target US policies and activities that they oppose. In a separate letter sent Monday to a senior House member, Defense Secretary Ashton Carter described the potential for foreign litigants to seek classified intelligence data and analysis and sensitive operational information to establish their cases in what could be an \"intrusive discovery process .\" Missing the vote were Senator Bernie Sanders, independent of Vermont, and Tim Kaine, Democrat of Virginia. Of the Massachusetts delegation, both Senators Elizabeth Warren and Edward Markey and Representatives Michael Capuano, <mark>Katherine Clark</mark>, <mark>Joseph Kennedy</mark> III, William Keating, <mark>Stephen Lynch</mark>, <mark>Richard Neal</mark>, and Niki Tsongas backed the override of Obama's veto. James McGovern and Seth Moulton voted to uphold the veto."}, {"articleID": "2010010715_00015339_W", "names": {"Peter Robinson": ["Q15990258", "Q21229743", "Q27922659", "Q29575386", "Q333036", "Q37266874", "Q41787245", "Q41935087", "Q637306", "Q7176623", "Q7176625", "Q7176626", "Q7176627", "Q7176628", "Q7176629", "Q7176630", "Q7176634"], "Gerry Adams": ["Q5552631", "Q76139"], "Sammy Wilson": ["Q262040", "Q26978727", "Q30122827", "Q7409864"]}, "date": "2010-01-07", "url": "http://breakingnews.ie/ireland/business-as-usual-for-robinson-after-affair-revelation-441080.html", "content": "07/01/2010 - 14:32:15 dup leader <mark>peter robinson</mark> was back behind his desk today following the shock revelation that his wife tried to kill herself after confessing to an affair. the north's first minister is meeting sinn féin deputy first minister martin mcguinness this afternoon for talks about devolving policing and justice powers from london to belfast. mr <mark>robinson</mark> arrived at stormont castle for the meeting and sinn féin president <mark>gerry adams</mark> was also present. earlier mr <mark>robinson</mark> went to his belfast constituency office, his wife iris's base in nearby newtownards and dup headquarters in belfast, where he told staff it was \"business as usual\". the east belfast mp will brief dup ministers and deputy leader nigel dodds following this afternoon's meeting with mr mcguinness. mrs <mark>robinson</mark>'s relationship 18 months ago was a brief one but in a dramatic statement yesterday she revealed the devastating impact it had on the family and how she attempted to take her own life last march. mrs <mark>robinson</mark>, 60, said: \"everyone is paying a heavy price for my actions...i am so, so sorry .\" the man has not been identified, and even though mr <mark>robinson</mark> considered walking away because of his sense of betrayal, the first minister insisted he was determined to save his marriage. he also said he would be back at his desk in belfast today, and was staying on as leader of the democratic unionist party going into this year's general election. sitting in the study of his home on the outskirts of east belfast, choking with emotion and with his eyes welling up, mr <mark>robinson</mark> said: \"that is the road i am on. it is a road without guarantees, but not without hope .\" nine days ago mother-of-three mrs <mark>robinson</mark>, mp for strangford and a member of the northern ireland assembly, said she was quitting politics because of a battle with depression. since then there has been intense behind-the-scenes speculation about the state of their 40-year marriage. mr <mark>robinson</mark> has been away from his office at parliament buildings, stormont, but suddenly called a special press briefing yesterday afternoon at his house in dundonald where officials issued a personal statement by his wife before he went on to speak to four journalists to confirm the couple's private turmoil. he said: \"i love my wife. i have always been faithful to her. in a spirit of humility and repentance, iris sought my forgiveness .\" she took responsibility upon herself alone for her actions and i have forgiven her. more important, i know that she has sought and received god's forgiveness. \"the marriage was considered by all sides to be rock-solid, with mr <mark>robinson</mark> frequently rallying to his wife's defence when her outspoken criticism of homosexuality saw many label her a political liability. mrs <mark>robinson</mark> was not to be seen at her luxury home yesterday, but in her statement she spoke about how severe bouts of depression had altered her mood and personality. she said:\" i fought with those i loved most, my children and friends; saw plots where none existed and conducted myself in a manner which was self-destructive and out of character. \"during this period of mental illness i lost control of my life and did the worst thing that i have ever done. over a year and a half ago, i was involved in a relationship .\" it began completely innocently when i gave support to someone following a family death. i encouraged friends to assist him by providing financial support for a business venture. \"regrettably, the relationship later developed into a brief affair. it had no emotional or lasting meaning, but my actions have devastated my life, and the lives of those around me .\" mrs <mark>robinson</mark>, an mp since 2001, disclosed how at midnight on march 1 last year - believed to be at their home - she tried to take her own life when she confessed to the affair because of the guilt she felt. hours later her husband was at the dispatch box answering questions at the northern assembly. mr <mark>robinson</mark> claimed the couple first considered going public about the affair last november, but decided against the move because of medical advice that his wife would not have been able to cope with the consequences. lagan valley dup mp jeffrey donaldson said: \"all political representatives are entitled to private space, but i believe the public, having already recognised the leadership and vision he has given to northern ireland during difficult times, will have a greater understanding of that when they now know other issues he was dealing with during some of those days .\" <mark>peter</mark>'s contribution to the political future in northern ireland will continue and strengthen and everyone within the dup is strengthened in our resolve to build a better future for the province and to see devolution improved and delivering for everyone in our community. \"east antrim dup mp <mark>sammy wilson</mark> said he had known the <mark>robinson</mark> family for more than 30 years .\" i cannot remember any other occasion when there has been such a massive outpouring of love, support and best wishes towards them from right throughout the community. \"i know that it took massive personal bravery for <mark>peter</mark> to come before the cameras and share the details of his private life."}, {"articleID": "2015062517_00006204_W", "names": {"Rodney Rogers": ["Q3909415", "Q634812"], "Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"]}, "date": "2015-06-23", "url": "http://iphone.sys-con.com/node/3345150", "content": "IT Operations and Digital Disruption | @ DevOps Summit #APM #DevOps Transaction-Centric NPM: Enabling IT/Business Collaboration One of the consequences of digital disruption is that IT is propelled much closer to users, who expect applications and services to be available and to perform well anytime, anywhere, on any device. Communicating with the business now more than ever requires communicating with these users, and effective communication requires a clear understanding of their experience with the application services you deliver. But how well do you understand end-user experience? To answer that question, let's first define end-user experience as the transaction response time a user receives from an application service; click to glass seems to be the term in vogue. Alternatively, you can look at the question from a different perspective: How is the quality of your application services measured? Are you driven primarily by infrastructure and application performance metrics, or by end-user experience? Whether your data center supports customer-facing applications that directly generate revenue or enterprise applications that automate and manage critical business processes - or, increasingly, both - application performance matters. It is the way your service quality is perceived by your users - consumers or employees. Business owners understand this intrinsically; poor ecommerce site performance results in lost revenue and damaged loyalty, while internally, poor application performance leads to decreased productivity and lost business opportunities. APM's Three Aspects Application performance monitoring can be segmented into three aspects, or disciplines: Device monitoring provides critical visibility into the health of the infrastructure components - the servers, disks, switches, routers, firewalls, desktops, etc. required to deliver application services. Application monitoring provides visibility into critical application components, such as application containers, methods, databases, APIs, etc.. End-user experience monitoring, within its performance context, provides visibility into user productivity, and provides a top-down business-centric perspective of both device and application performance. It's clear that the first two aspects - device and application monitoring - are fundamentally important. We should also be able to agree that, to answer our earlier question about service quality, you must also measure the end-user's experience. When users complain, they speak in terms of transaction speed, not network latency, interface utilization, database queries, java server pages, or CPU speed. (Well, if you're on the network team, you'll claim they often will say the network is slow, but we generally know better .) The user's experience can be considered the intersection between business metrics (productivity) and IT metrics (device and application); it's the one metric both groups have in common. Most of us are pretty good at device and application monitoring; this is often not the case when we consider end-user experience monitoring. So what are the penalties if you're not measuring end-user experience?' You won't know users are having a problem until they call you (unless something catastrophic happens). You will chase after problems that don't affect users (because you're monitoring dozens, or hundreds, of metrics of varying impact). You won't have a description of the problem that matches your metrics (and therefore don't have a validated starting point for troubleshooting). You won't know when or if you've resolved the problem (without asking the users). At Cisco Live this week, an IT manager told me of his frustration with all-too-frequent 3 a.m. infrastructure or application alerts: should he get up and investigate? He had no idea if the problem of the moment had any impact on users. Only by adopting end-user experience monitoring was he able to qualify and prioritize his response. Don't We Already Measure End-User Experience? It's true that many applications - particularly those based on Java and. NET platforms - may already be instrumented with APM agents, some of which provide exactly this insight into end-user experience. However: These APM solutions are often not used by operations teams Not all Java and. NET apps will be instrumented (and if you're not using Dynatrace, you might only be sampling transactions) Many application architectures don't lend themselves to agent-based instrumentation IT operations teams therefore usually rely on more traditional infrastructure-centric device and network monitoring solutions. The rise of application-awareness (primarily in Application Aware Network Performance Monitoring - AA NPM - solutions, but also in device management offerings) has given IT varying degrees of insight into application behavior - and sometimes a degree of insight into application performance. However, without visibility into end-user experience, without a user transaction-centric starting point, these tools do little to foster the communication and collaboration we mentioned earlier. As I pointed out in a recent webcast called the Top Five Benefits of Transaction-Centric NPM, AA NPM solutions are generally quite limited in their ability to measure actual end-user experience, especially across a broad range of application architectures. Instead, these tools use key infrastructure measurements such as network latency, packet loss, jitter, etc., as indicators or hints of application performance as experienced by end users. These metrics may be quite meaningful to IT specialists, but they aren't end-user experience and don't provide a basis for effective communication. Published June 25, 2015 - Reads 1,136 Copyright © 2015 SYS-CON Media, Inc. - All Rights Reserved. Add your comment You must be signed in to add a comment ., we encourage comments that are on topic, relevant and to-the-point. We will remove comments that include profanity, personal attacks, racial slurs, threats of violence, or other inappropriate material that violates our Please wait while we process your request...In his General Session at 16th Cloud Expo, David Shacochis, host of The Hybrid IT Files podcast and Vice President at CenturyLink, investigated three key trends of the \"gigabit economy\" though the story of a Fortune 500 communications company in transformation. Narrating how multi-modal hybrid IT, service automation, and agile delivery all intersect, he will cover the role of storytelling and empathy in achieving strategic alignment between the enterprise and its information technology. Jun. 25, 2015 09:45 AM EDT Reads: 1,415 Slides: Growing IoT from Industry to Society It is one thing to build single industrial IoT applications, but what will it take to build the Smart Cities and truly society-changing applications of the future? The technology won't be the problem, it will be the number of parties that need to work together and be aligned in their motivation to succeed. In his session at @ ThingsExpo, Jason Mondanaro, Director, Product Management at Metanga, discussed how you can plan to cooperate, partner, and form lasting all-star teams to change the world and it starts with business models and monetization strategies. Jun. 25, 2015 09:00 AM EDT Reads: 879 Microservices and IoT Power Panel Buzzword alert: Microservices and IoT at a DevOps conference? What could possibly go wrong? In this Power Panel at DevOps Summit, moderated by Jason Bloomberg, the leading expert on architecting agility for the enterprise and president of Intellyx, panelists peeled away the buzz and discuss the important architectural principles behind implementing IoT solutions for the enterprise. As remote IoT devices and sensors become increasingly intelligent, they become part of our distributed cloud environment, and we must architect and code accordingly. At the very least, you'll have no problem fillin...Jun. 25, 2015 09:00 AM EDT Reads: 1,470 IT Transforming into the Cloud Enabler Business as usual for IT is evolving into a \"Make or Buy\" decision on a service-by-service conversation with input from the LOBs. How does your organization move forward with cloud? In his general session at 16th Cloud Expo, Paul Maravei, Regional Sales Manager, Hybrid Cloud and Managed Services at Cisco, discusses how Cisco and its partners offer a market-leading portfolio and ecosystem of cloud infrastructure and application services that allow you to uniquely and securely combine cloud business applications and services across multiple cloud delivery models. Jun. 24, 2015 12:00 PM EDT Reads: 1,260 @ ThingsExpo Keynote: The Internet of Everything Converging digital disruptions is creating a major sea change - Cisco calls this the Internet of Everything (IoE). IoE is the network connection of People, Process, Data and Things, fueled by Cloud, Mobile, Social, Analytics and Security, and it represents a $19Trillion value-at-stake over the next 10 years. In her keynote at @ ThingsExpo, Manjula Talreja, VP of Cisco Consulting Services, discussed IoE and the enormous opportunities it provides to public and private firms alike. She will share what businesses must do to thrive in the IoE economy, citing examples from several industry sectors. Jun. 24, 2015 11:45 AM EDT Reads: 1,461 There will be 150 billion connected devices by 2020. New digital businesses have already disrupted value chains across every industry. APIs are at the center of the digital business. You need to understand what assets you have that can be exposed digitally, what their digital value chain is, and how to create an effective business model around that value chain to compete in this economy. No enterprise can be complacent and not engage in the digital economy. Learn how to be the disruptor and not the disruptee. Jun. 24, 2015 11:30 AM EDT Reads: 1,235 Slides: <mark>Rodney Rogers</mark> Keynote Presentation In his keynote at 16th Cloud Expo, <mark>Rodney Rogers</mark>, CEO of Virtustream, discussed the evolution of the company from inception to its recent acquisition by EMC - including personal insights, lessons learned (and some WTF moments) along the way. Learn how Virtustream's unique approach of combining the economics and elasticity of the consumer cloud model with proper performance, application automation and security into a platform became a breakout success with enterprise customers and a natural fit for the EMC Federation. Jun. 24, 2015 09:30 AM EDT Reads: 1,564 Opening Keynote at Cloud Expo New York Growth hacking is common for startups to make unheard-of progress in building their business. Career Hacks can help Geek Girls and those who support them (yes, that's you too, Dad!) to excel in this typically male-dominated world. Get ready to learn the facts: Is there a bias against women in the tech / developer communities? Why are women 50% of the workforce, but hold only 24% of the STEM or IT positions? Some beginnings of what to do about it! In her Opening Keynote at 16th Cloud Expo, Sandy Carter, IBM General Manager Cloud Ecosystem and Developers, and a Social Business Evangelist, d.. . Jun. 24, 2015 08:30 AM EDT Reads: 1,393 Containers & Microservices Expo Launched SYS-CON Events announced today that the \"Second Containers & Microservices Conference\" will take place November 3-5, 2015, at the Santa Clara Convention Center, Santa Clara, CA, and the \"Third Containers & Microservices Conference\" will take place June 7-9, 2016, at Javits Center in New York City. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 22, 2015 02:15 PM EDT Reads: 2,115 SYS-CON Events announced today that the \"First Containers & Microservices Conference\" will take place June 9-11, 2015, at the Javits Center in New York City. The \"Second Containers & Microservices Conference\" will take place November 3-5, 2015, at Santa Clara Convention Center, Santa Clara, CA. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 20, 2015 12:00 PM EDT Reads: 3,357 @ ThingsExpo Sponsorship Opportunities With major technology companies and startups seriously embracing IoT strategies, now is the perfect time to attend @ ThingsExpo in Silicon Valley. Learn what is going on, contribute to the discussions, and ensure that your enterprise is as \"IoT-Ready\" as it can be! Internet of @ ThingsExpo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, is co-located with 17th Cloud Expo and will feature technical sessions from a rock star conference faculty and the leading industry players in the world. The Internet of Things (IoT) is the most profound change in personal an...Jun. 15, 2015 08:45 PM EDT Reads: 3,636 Cloud Expo Sponsorship Opportunities Announced 17th Cloud Expo, taking place Nov 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, will feature technical sessions from a rock star conference faculty and the leading industry players in the world. Cloud computing is now being embraced by a majority of enterprises of all sizes. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS - software, platform, and infrastructure as a service. Jun. 15, 2015 07:15 PM EDT Reads: 3,376 Cloud Expo Silicon Valley \"Call for Papers' The 17th International Cloud Expo has announced that its Call for Papers is open. 17th International Cloud Expo, to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA, brings together Cloud Computing, APM, APIs, Microservices, Security, Big Data, Internet of Things, DevOps and WebRTC to one location. With cloud computing driving a higher percentage of enterprise IT budgets every year, it becomes increasingly important to plant your flag in this fast-expanding business opportunity. Submit your speaking proposal today! Jun. 15, 2015 10:15 AM EDT Reads: 5,362 Virtustream: A Blue Collar Unicorn In his keynote at 16th Cloud Expo, <mark>Rodney Rogers</mark>, CEO of Virtustream, discusses the evolution of the company from inception to its recent acquisition by EMC - including personal insights, lessons learned (and some WTF moments) along the way. Learn how Virtustream's unique approach of combining the economics and elasticity of the consumer cloud model with proper performance, application automation and security into a platform became a breakout success with enterprise customers and a natural fit for the EMC Federation. Jun. 11, 2015 08:00 AM EDT Reads: 1,890 @ ThingsExpo Silicon Valley Call for Papers The 4th International Internet of @ ThingsExpo, co-located with the 17th International Cloud Expo - to be held November 3-5, 2015, at the Santa Clara Convention Center in Santa Clara, CA - announces that its Call for Papers is open. The Internet of Things (IoT) is the biggest idea since the creation of the Worldwide Web more than 20 years ago. Jun. 10, 2015 06:00 PM EDT Reads: 2,844 SafeLogic CEO at Cloud Expo New York SafeLogic is proud to promote CEO Ray Potter's speaking engagement on the agenda of Cloud Expo New York City. Cloud Expo will be hosted at the Javits Center in Manhattan, New York, on June 9 - 11, 2015, alongside SYS-CON Media's Big Data Expo, Internet of Things Expo, SDDC (Software-Defined Datacenter) Expo, DevOps Summit, and WebRTC Summit, to form one massive event focused on today's hottest technologies. The need for reliable and secure data storage and processing is a common thread across each sub-event. Jun. 10, 2015 11:00 AM EDT Reads: 1,693 MediaTek Labs to Exhibit at @ ThingsExpo New York SYS-CON Events announced today that MediaTek Labs will exhibit at SYS-CON's @ ThingsExpo, which will take place on June 9-11, 2015, at the Javits Center in New York City, NY. MediaTek Labs is a global ecosystem initiative supporting Wearables and Internet of Things device creation, application development, and services based around MediaTek chipset offerings. Developers can use the MediaTek LinkIt ™ ONE development platform and the LinkIt ONE HDK to easily access the features and functions of the MediaTek MT2502 System on a Chip (SoC), with the goal of creating the next generation of MediaTek p.. . Jun. 9, 2015 01:00 PM EDT Reads: 1,769 Architecting IoT Enabled Supply Chains Businesses are increasingly considering IoT product enablement as a means to implement connected supply chains to support rapidly evolving business models. Manufacturing firms that are used to managing physical supply chains are suddenly finding themselves knee deep in requirements to implement digital supply chains with which they have little experience. While many analysts are jumping over each other to claim ever larger predictions for the expected growth of IoT over the next five years, it is clear that customers can be expected to vote with their feet, if they do not see value or trust th...Jun. 9, 2015 11:00 AM EDT Reads: 1,712 The Stories We Tell: Three Key Narratives In his General Session at 16th Cloud Expo, David Shacochis, host of The Hybrid IT Files podcast and Vice President at CenturyLink, will investigate three key trends of the\" gigabit economy \"though the story of a Fortune 500 communications company in transformation. Narrating how multi-modal hybrid IT, service automation, and agile delivery all intersect, he will cover the role of storytelling and empathy in achieving strategic alignment between the enterprise and its information technology. Jun. 9, 2015 09:15 AM EDT Reads: 1,855 Aria Systems to Discuss IoT at @ ThingsExpo NY Aria Systems, which helps enterprises grow recurring revenue, today announced that its co-founder and inventor of cloud billing <mark>Brendan O'Brien</mark>, will be a featured speaker at the Cloud Expo, June 9-11 at The Javits Center in New York. Aria also will be demonstrating its Active Monetization platform in Booth #424 on the Expo Floor. <mark>O'Brien</mark> will lead the following sessions: June 9 - 11:00 am - 11:35 am, Room 1A16 with participants from Constant Contact, MGI Research and ATG Enabling Complex Recurring Revenue Strategies - With IoT exploding, massive data will transform businesses with oppor...IBM Delivers Docker Based Container Services Microsoft Opening Keynote | NoOps! = No Operations DevOps Summit Keynote | Purpose-Defined Computing: The Next Frontier in Automation General Session | Verizon Pay-As-You-Go Model for Oracle Database Licenses Means Costs Savings and Business Benefits Creating a Faster, More Secure Cloud General Session | [Podcast] Hybrid Cloud - Different Clouds for Different Needs SAP General Session | Innovation with Cloud and Big Data Solutions That Will Revolutionize Your Business - Join SAP and Partners General Session | How to Architect and Optimize Your Cloud for Consistent Performance Lunch Power Panel at 15th Cloud Expo | Choosing the Right Cloud Option View Dr. Kristof Kloeckner Keynote: Cloud Needs DevOps Microsoft Azure for Enterprise: What and Why Big Data Management System: Smart SQL Processing across Hadoop and your Data Warehouse Real-time Big Data: An Agile Approach Day 2 Keynote | How to Maintain Relevancy in a Cloud World: A Step-by-Step Approach to the Future Business of IT Day 2 Lunch Keynote | Application Delivery in the Cloud: Debunking Myths and Showcasing the Realities Day 3 Keynote | Navigating Storage in a Cloudy Environment Lighten Your Data Center TCO with Helium Storage Solutions Fear & Loathing in the Enterprise Cloud (with apologies to Hunter S. Thompson) In a recent survey of eighty IT and business professionals, 73 percent responded that having optimized mobile applications and user experiences was\" very important to critical \"to their company's future success. In the same survey however, 78 percent reported their mobile strategies and plans were inhibited or limited by their existing IT environment. These results reveal a critical gap between the requirements for success and the reality of the obstacles enterprises are facing. Overcoming these challenges is the strategic imperative facing large enterprises today. Jun. 25, 2015 12:17 PM EDT Reads: 159 Intelligent Infrastructure Defined Today, more organizations are looking at new technologies and applications for their operations. There is a convergence of industries that were thought to be independent which are now interdependent. What is missing is the ability to find common ground in definitions of infrastructure and other terminologies. From the US Army Corps of Engineers'\" Infrastructure and the Operational Art \"Handbook: The word infrastructure has many definitions, each tailored to the particular perspective of the author. Each is correct for the needs of the author, but in a broader, conceptual sense, multiple defi...Jun. 25, 2015 11:15 AM EDT Reads: 1,428 To the Industrial Internet...and Beyond In the last blog we started the conversation on our findings from @ Cloud Expo 2015 and @ ThingsExpo 2015 as the industry came together to explore the impact of Cloud and Internet of Things (IoT) on business models as we know them. While often the focus of IoT are consumer services and the sometimes over-simplification of what constitutes an IoT company or service, one area there is no disputing is the significant advancement in the Industrial Internet (a term made popular by GE). Ongoing improvements in sensor technologies - including performance, miniaturization, cost and energy consumption -...Jun. 25, 2015 11:15 AM EDT Reads: 1,366 Critical Communications & the Internet of Things The Internet of Things, IoT, is without a doubt one of the most buzzed about topics in our tech-obsessed culture right now. While I agree that the near-endless possibilities of the consumer side of IoT will transform our everyday lives for the better, making things simpler and more connected, it's not the only angle our society should focus on. There is a huge opportunity for the industrial IoT to significantly impact the world - especially in critical situations. Jun. 25, 2015 09:45 AM EDT Reads: 1,263 When something as simple as an API can integrate massive amounts of data into, and through, a wide variety of applications, any company can be a digital enterprise. There is a perception that some industries are using technology to innovate, while others languish in antiquated ways of running their business. But in our massively connected age, it's rare to find examples where technology isn't making an impact on helping organizations grow and become more efficient. John Deere is one of the world's largest and most successful manufacturers of agricultural machinery, and it's not a stretch to s.. . Jun. 25, 2015 09:45 AM EDT Reads: 1,151 IFTTT and the Internet of Things IFTTT stands for the conditional statement\" If this then that'. It is a web based service with a simple workflow. Flow of work (action, that) is created by a trigger based on a condition (this), like say, \"If it rains take the umbrella'. This service was provided in some cases, such as the various financial services that you could get an email if your chosen stock price reached a new high, etc.. They were called alerts and they are also used by banks and credit card companies. Jun. 25, 2015 09:30 AM EDT Reads: 388 Over the last couple months, in between some video coverage for events, I've been writing a series of IoT stories. From the basic What are These\" Things \"? and IoT Influence on Society to the descriptive IoT Effect on Applications and the IoT Ready Infrastructure. I thought it only fair to share how F5 can play within an IoT infrastructure. Because F5 application services share a common control plane-the F5 platform-we've simplified the process of deploying and optimizing IoT application delivery services. With the elastic power of Software Defined Application Services (SDAS), you can rapidl...Jun. 25, 2015 08:00 AM EDT Reads: 1,317 Where the Network Got Invited to the Party At DevOps Summit NY there's been a whole lot of talk about not just DevOps, but containers, IoT, and microservices. Sessions focused not just on the cultural shift needed to grow at scale with a DevOps approach, but also made sure to include the network\" plumbing \"needed to ensure success as applications decompose into the microservice architectures enabling rapid growth and support for the Internet of (Every) Things. Jun. 25, 2015 08:00 AM EDT Reads: 1,167\" People' Are Latest Trend at Cloud Expo People have re-entered the picture in discussions about cloud computing. This was my primary takeaway from this year's Cloud Expo East in New York, an event for which I serve as Conference Chair. Over three days, we hosted thousands of delegates attending sessions from more than 150 speakers, including two prominent women as keynoters, and a range of topics that covered not only enterprise cloud in general, but microservices and containers, Big Data and the IoT, WebRTC, software-defined most-anything, an emerging DevOps culture...and people. People, Process, & Technology People, process,...Jun. 25, 2015 07:45 AM EDT Reads: 773 Forking Hell, Why Unification Matters Leaving aside (most of) the deeper technical details of the situation, an interesting development occurred in the open source community this week. Under the auspices of The Linux Foundation, a new \"neutral' coding community emerged as a result of the coming together of the Node. js and io. js developer groups who will now collaborate to merge their respective code bases. Jun. 25, 2015 07:00 AM EDT Reads: 800 This week, the team assembled in NYC for @ Cloud Expo 2015 and @ ThingsExpo 2015. For the past four years, this has been a must-attend event for MetraTech. We were happy to once again join industry visionaries, colleagues, customers and even competitors to share and explore the ways in which the Internet of Things (IoT) will impact our industry. Over the course of the show, we discussed the types of challenges we will collectively need to solve to capitalize on the opportunity IoT presents. Jun. 24, 2015 08:00 AM EDT Reads: 1,398 I Almost Bit...and Would've Been Bitten SYS-CON Events announced today that the\" First Containers & Microservices Conference \"will take place June 9-11, 2015, at the Javits Center in New York City. The\" Second Containers & Microservices Conference \"will take place November 3-5, 2015, at Santa Clara Convention Center, Santa Clara, CA. Containers and microservices have become topics of intense interest throughout the cloud developer and enterprise IT communities. Jun. 20, 2015 12:00 PM EDT Reads: 3,357 Monitoring an Ear of Corn with an IoT Sensor? Today agricultural drones with sensors and analysis software can fly over large fields and analyze the crops and their needs precisely in seconds. Once upon a time, farmers would walk through a field or ride a horse around it to determine the amount of fertilizer and water their crops required. I have done this myself. Today agricultural drones with sensors and analysis software can fly over large fields and analyze the crops and their needs precisely in seconds. If we wanted to get even more ambitious, we could place an IoT (Internet of Things) sensor next to every stalk of corn to monito...Jun. 18, 2015 08:42 AM EDT Reads: 620 Performance Testers: Prepare for the IoT Within the next decade, we are going to see everything from power plants to transportation systems to factories to the appliances in our homes connected together for data collection, analytics, command-and-control, and all sorts of other applications. What is all this going to mean for performance testing? It's almost impossible to know for sure as so much of this story remains unwritten. However, there are industries where IoT is already happening. Let's take a look at a few of these and ponder the future of performance testing for IoT applications. iPhone Developer's Journal provides updates on related technology advances, software and business trends, and new products and standards relating to the iPhone. Sharding for Scale By @ LMacVittie | @ DevOpsSummit #Microservices Simplified API Monitoring for DevOps Teams | @ DevOpsSummit #API #DevOps Five Requirements for Application Services By @ LMacVittie | @ DevOpsSummit #DevOps DevOps with Containers for Microservices By @ SiRuslan | @ DevOpsSummit #DevOps Cloud Migration: From Monolith to Microservices | @ CloudExpo #Cloud #Microservices Sumo Logic Delivers Analytics for #Microservices & #Containers | @ DevOpsSummit #DevOps Microservices & IoT Power Panel at @ DevOpsSummit | #IoT #Microservices IBM Delivers #Docker - Based #Container Services | @ DevOpsSummit @ IBM #DevOps Deploy Applications with Containers | @ DevOpsSummit #DevOps #Containers Announcing @ CommVault\" Bronze Sponsor \"of @ CloudExpo Silicon Valley | #IoT #API #DevOps #Microservices Growing IoT from Industry to Society By @ JMondanaro | @ ThingsExpo #IoT Replication, Backup, and Recovery By @ Windstream | @ CloudExpo #Cloud IT Operations and Digital Disruption | @ DevOps Summit #APM #DevOps Announcing @ Solgenia_Corp to Exhibit at @ CloudExpo Silicon Valley | #IoT #API #DevOps #Microservices Critical Communications & the Internet of Things By @ ImadMouline | @ ThingsExpo #IoT Why Workloads Are Not on the Public Cloud | @ CloudExpo #IoT #API #Cloud Forking Hell, Why Unification Matters By @ ABridgwater | @ ThingsExpo #IoT IndependenceIT to Present at @ CloudExpo New York | @ IndependenceIT [#Cloud] To the Industrial Internet...and Beyond By @ EsmeSwartz | @ ThingsExpo #IoT #API ThingsExpo World's Most Influential M2M Media Brand @ ThingsExpo [#IoT] Private Cloud-in-a-Box By @ KellyMurphyGS | @ CloudExpo #DevOps #Docker BaaS - The New Possibility in Mobile Cloud Technology | @ CloudExpo #Cloud IT Transforming into the Cloud Enabler by @ CiscoCloud | @ CloudExpo #IoT #API #DevOps IBM Acquires @ BlueBox | @ CloudExpo #IoT #DevOps #OpenStack #Microservices Free Registration to #Containers and #Microservices Expo | @ CloudExpo #DevOps #IoT #API Day 3 Keynote at @ CloudExpo By @ RJRogers87 | #IoT #BigData #DevOps #Microservices Announcing @ AlertLogic\" Bronze Sponsor \"of @ CloudExpo & @ DevOpsSummit Silicon Valley | #IoT #DevOps I Almost Bit...and Would've Been Bitten By @ PSilvas | @ ThingsExpo #IoT Day 2 Keynote at @ ThingsExpo by @ ManjulaTalreja | @ Cisco_IoT #IoT Day 3 Keynote at @ CloudExpo By @ RJRogers87 | #IoT #Cloud #BigData Four Ways Technology Is Advancing Business By @ FrankMakesSense | @ CloudExpo #Cloud Containers and Microservices at @ CloudExpo New York By @ IoT2040 [#Cloud] DevOps Summit\" Call for Papers' Open | @ DevOpsSummit #DevOps #Docker #Microservices IoT Sponsorship Opportunities @ ThingsExpo Silicon | #IoT #M 2M #WebRTC #DevOps #Microservices WSM to Exhibit at @ CloudExpo New York | @ WSMINTL [#DevOps #Cloud] Cisco \"Gold Sponsor\" of @ CloudExpo New York | @ CiscoCloud [#Cloud #IoT] Myths of Cloud Computing with @ Wrecks47 | [@ CloudExpo @ OracleCloudZone] Data Lake and Data Refinery - Gartner Controversy! | @ CloudExpo [#BigData] Infrastructure as a Toolbox By @ SoftLayer at @ CloudExpo | #IoT #API #DevOps #Microservices Announcing @ Plutora to Exhibit at @ DevOpsSummit New York [#DevOps] Sponsorship Opportunities | @ CloudExpo #IoT #DevOps #Linux #Containers #Microservices Internet of Things and SAP HANA Cloud Platform | @ ThingsExpo @ SAPInMemory #IoT Internet of Things Supply Chains By @ Microsoft | @ ThingsExpo [#IoT] OpenShift Commons Latest in Battle with Cloud Foundry By @ IoT2040 | @ DevOpsSummit [#DevOps] Keep CALM And Embrace #DevOps By @ Momskij | @ DevOpsSummit [#IoT #Microservices] \"Cloud Foundry Deployment' By @ Altoros | @ DevOpsSummit [#DevOps] Top Three Cloud Takeaways from @ CloudExpo By @ IanKhanLive | #Cloud\" Signaling Layer for WebRTC' By @ MatrixDotOrg | @ ThingsExpo [#WebRTC #IoT] Integrating Security into #DevOps By @ ScriptRock | @ DevOpsSummit Seize The Biggest #Cloud, #BigData & #IoT Opportunity in 2015 | @ CloudExpo WebRTC, Internet of Things and API Gateways | @ ThingsExpo [#IoT #WebRTC] WebRTC Startup @ TemasysRTC Appoints Leaders | @ ThingsExpo [#WebRTC] Software-Defined Business with @ AppDynamics | @ DevOpsSummit #DevOps How to Accelerate Government IT By @ DHDeans | @ DevOpsSummit #DevOps Internet of Things Maturity Model By @ TonyShan | @ ThingsExpo [#IoT] New Relic's #Microservices and #Docker Platform | @ DevOpsSummit [#DevOps] \"UP Your OPs Game' By @ DTzar | @ DevOpsSummit [#DevOps @ MS_ITPro]. NET SDK for Cloud From @ ProfitBricksUSA | @ DevOpsSummit [#DevOps]\" Pillars of Modern Enterprise' By @ KrishAtRH | @ DevOpsSummit [#DevOps] Don't Skeu Up #Containers, Use #Microservices | @ DevOpsSummit [#DevOps] Andi Mann Outlines Vision | @ DevOpsSummit @ AndiMann #DevOps #Containers #Microservices DevOps Summit Was a Terrific Event! By @ QubellInc | @ DevOpsSummit [#DevOps] Scalable Cloud-Based Video Surveillance Solutions | @ CloudExpo [#Cloud] Timely, Optimal and Efficient with @ Creative_Busine | @ CloudExpo #Cloud Announcing @ Creative_Busine to Exhibit at @ CloudExpo New York [#Cloud] Making Agile Real: The Zen of Continuous Delivery By @ XebiaLabs | @ DevOpsSummit [#DevOps] Kafka Poll: Producer and Consumer Client By @ Sematext | @ DevOpsSummit [#DevOps] All the World's a Cloud All of Cloud Is at Cloud Expo! Cloud Computing - Big Data | Analytics - Internet of Things Containers - Microservices - WebRTC - DevOps Join Us at the Santa Clara Convention Center in Santa Clara, California, November 3-5 Cloud computing software is eating the world, and each day is bringing new developments in this world. Yesterday's debate about public vs. private has transformed into the reality of hybrid cloud: a recent survey shows that 74% of enterprises have a hybrid cloud strategy. Meanwhile, 94% of enterprises are using some form of XaaS - software, platform, and Infrastructure as a Service. Big Data | Analytics and the emerging Internet of Things (IoT) are driving exponentially increased demands on datacenters and developers alike, as we cross the zettabyte horizon this year. Containers and microservices are now part of every PaaS conversation, and IaaS providers are increasingly competing for platform customers. WebRTC continues to reform web communications, and DevOps is pushing its way into an enterprise IT world that is increasingly agile, lean, and continuous. Through all this, Cloud Expo remains the single independent event where delegates and technology vendors can meet to experience and discuss the entire world of the cloud. Only Cloud Expo brings together all this in a single location: • Cloud Computing • Big Data | Analytics • Internet of Things • Containers | Microservices • WebRTC • DevOps Cloud computing budgets worldwide are reaching into the hundreds of billions of dollars, and no organization can survive long without some sort of cloud migration strategy. Each month brings new announcements, use cases, and success stories. Cloud Expo offers the world's most comprehensive selection of technical and strategic Industry Keynotes, General Sessions, Breakout Sessions, and signature Power Panels. The exhibition floor features 100 + exhibitors offering specific solutions and comprehensive strategies. The floor also features a Demo Theater that give delegates the opportunity to get even closer to the technology they want to see and the people who offer it. Save $300 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires June 8, 2015! Speaker Opportunities Submit your speaking proposal for the upcoming Cloud Expo in Santa Clara [November 3-5, 2015] Exhibitor Info. Copyright © 1994-2014 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2013100611_00054598_W", "names": {"Mark Helfrich": ["Q15813758", "Q660685", "Q6767986"], "Paul Richardson": ["Q16234953", "Q3898140", "Q43291493", "Q7153218", "Q7153220", "Q7153222"]}, "date": "2013-10-06", "url": "http://www.heraldonline.com/2013/10/05/5277935/recap-colorado-vs-oregon.html#storylink=rss", "content": "Boulder, CO (SportsNetwork.com) - Marcus Mariota threw five touchdown passes to lead second-ranked Oregon to a 57-16 drubbing of Colorado at Folsom Field. Mariota completed 16-of-27 passes for 355 yards and also rushed for a pair of scores for the Ducks (5-0, 2-0 Pac-12), who have won each game this season by at least 39 points. Bralon Addison caught five passes for 158 yards and two touchdowns, Josh Huff finished with five catches for 103 yards and two scores and Byron Marshall picked up 122 yards on the ground in the win. \"I didn't really think about mercy,\" Oregon head coach <mark>Mark Helfrich</mark> said. \"That's a good program, a proud program. We're not in the embarrassment business. We're not in the statistic business and we don't think about individual awards. That's not our deal. We just wanted to get in a rhythm offensively .\" Connor Wood was 11-for-33 passing for 205 yards and two interceptions. <mark>Paul Richardson</mark> finished with 134 yards receiving and also threw a 75-yard touchdown pass for the Buffaloes (2-2, 0-2), who have dropped back-to-back games. Colorado jumped out to an early lead as Will Oliver booted through a 33-yard field goal. The Ducks, though, answered back just over two minutes later as Mariota ran it in from two yards out. Pharaoh Brown bulled his way across the goal line for the two-point conversion to make it 8-3. The Buffs got creative on their next touch as <mark>Richardson</mark> took a pitch on a reverse then found D.D. Goodson wide open along the right sideline for a 75 - yard touchdown. Oregon, however, added three touchdowns before the end of the first quarter to blow the game wide open. First, Thomas Tyner ran it in from two yards out, and Mariota followed with a 75-yard touchdown strike to Addison. After Wood was picked off by Terrance Mitchell on the Colorado 26, Mariota connected with Keanon Lower for a 17-yard score to make it 29-10. Oliver added a pair of field goals early in the second, but Mariota tacked on two more touchdowns to close out the half. \"I felt like if we would've kept coming away with nothing, I felt it might have deflated us,\" MacIntyre said. \"I felt the field goals us a little bit of energy .\" The sensational sophomore capped a 12-play, 67-yard drive with a 1-yard TD plunge before orchestrating an 11-play, 92-yard march which ended in a 4-yard toss to Huff for a 43-16 lead heading into the break. Mariota found Addison for a 44-yard touchdown 4:21 into the second half for a 50-16 cushion before adding a 26-yard TD strike to Huff just under four minutes later .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer Also check out our community publications"}]