[{"articleID": "2010120720_00052482_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"]}, "date": "2010-12-07", "url": "http://blogs.babble.com/strollerderby/2010/12/07/sure-fire-way-for-teens-to-get-on-tv-become-pregnant/", "content": "i'm blaming him. shows like mtv's \"16 and pregnant\" and \"teen mom\" make me sick. there. i said it. in fact reality tv shows, as a whole, make me sick. for the vast majority of them turn morons into icons, thus littering our pop-culture sky with dim-witted stars who are void of substance, not to mention discernible talent. i blame oj simpson and the bronco ride that the (allegedly) murderous clown took back in 1994. you know, the one that compelled every single american to drop whatever it was he or she was doing at the time in order to watch? after all, it was way more interesting than anything he had ever done on the football field, or in any of his hertz commercials, for that matter. it was during that surreal, low-speed pursuit when, i suspect, the light went off in some aspiring tv exec's head. hmmm. real-life situations are capable of delivering huge ratings. and at the time, the only reality show around was mtv's \"real world.\" plenty of room for more. which is exactly what we've seen since. more. and more and more. but did we really need to dip into the complex well of teen pregnancy? as i have with most reality tv shows, i've managed to steer clear of these particular ones. but that hasn't stopped me from forming an opinion on them. i find them morally repugnant. it's one thing to televise a season-long singing contest. after all, at least an actual talent is required to win. or to document a battle of attrition carried out in some exotic locale. but to make celebrities out of young ladies who find themselves in the unenviable position of being pregnant teenagers? to somehow glorify the role of teen mom by delivering such young ladies a platform which provides them fame which could quite possibly lead one day to fortune, thus providing incentive to others to follow suit? it all seems distasteful to me. surely, one would hope, this limelight would never be one which other teens would actually seek it. but that's exactly what seems to be happening according to popeater. rob shuter tells his readers today that \"industry insiders tell me young ladies are so eager to be on reality tv that they are actually getting pregnant just to score an audition? not much of a surprise. simply take a spin around the various internet forums filled with young girls inquiring about what's required to score a role.\" shuter then quotes a relationship expert, a \"mommy expert\" and a rabbi, all of whom chime in from various angles with what is essentially the same message: if actually true, the situation is beyond sad. rabbi shmuely boteach puts it best when he says it displays \"the moral rot in american society.\" and that's where i am with it. i personally believe that the vast majority of what our society seems to find mesmerizing is anything but. and while in most cases, catering to a base desire is harmless, teen pregnancy is not most cases. so when mtv decided to run not one, but two shows that showcase little girls stumbling through a maze meant for a grown woman, they're doing our society a disservice. even if the intent of such shows is to discourage teen pregnancies. they have to think one step ahead and acknowledge that even if it doesn't happen, there is, indeed, a chance that such shows might result in teens trying to get pregnant. and taking that chance doesn't seem like it'd be worth it. not even for all the ratings in the world. wikipedia more from strollerderby: <mark>cam newton</mark>, auburn to play for bsc championship despite <mark>cam</mark>'s dad bristol palin to keith olbermann: i'm perfectly qualified to advocate teen abstinence prominent british women against government's new breastfeeding initiative all text, images, design, titles, recipes, and other matter appearing on babble.com (\"babble.com material\" ) are copyright of babble.com unless otherwise specified and may not be transferred or copied - digitally or otherwise - in any manner without written permission of babble.com. no alterations or modifications whatsoever may be made to babble.com material including to any of its images, designs, or recipes without written permission."}, {"articleID": "2018041118_00114251_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"], "Patrick Murray": ["Q16234061", "Q2057835", "Q43395509", "Q43912276", "Q7123558"]}, "date": "2018-04-11", "url": "http://observer.com/2018/04/poll-phil-murphy-job-approval-rating/", "content": "<mark>Phil Murphy</mark>. Spencer Platt/Getty Images New Jersey Gov. <mark>Phil Murphy</mark> is starting his tenure with a better job approval rating than his two predecessors, but many residents know little or nothing about his budget proposal, according to a new poll released on Wednesday. A Monmouth University poll found that 44 percent of New Jersey adults like the job <mark>Murphy</mark> is doing, compared to 28 percent who disapprove and 28 percent who don't have an opinion. <mark>Murphy</mark>'s net positive job rating is a departure from his two predecessors, who had slightly negative ratings at the same point in their terms. Chris Christie held a 41 percent approval rating and a 44 percent disapprove rating in April 2010. Jon Corzine had a 34 percent approval rating and a 37 percent disapproval rating in April 2006. Many New Jerseyans are still unfamiliar with <mark>Murphy</mark>'s $37.4 billion budget, which includes $1.7 billion in tax increases. Just 15 percent said they have heard a lot about the spending plan, compared to 55 percent who've heard little and 30 percent who know nothing about it. By contrast, more residents knew a lot about the first budgets submitted by Christie (45 percent) and Corzine (25 percent). Only nine percent are satisfied with <mark>Murphy</mark>'s budget proposal, while 29 percent said they can live with it and 23 percent are dissatisfied. Nearly four in 10 (38 percent) have no opinion or haven't heard about the plan, according to the poll. \"Perhaps one reason why <mark>Murphy</mark>'s overall job rating is so positive is because fewer New Jerseyans are paying attention to this new governor than in the past,\" <mark>Patrick Murray</mark>, director of the independent Monmouth University Polling Institute, said in a statement. \"It's worth noting that turnout in last year's election was a record low, and Monmouth's polling found that most voters couldn't say whether <mark>Murphy</mark>'s views were in line with the state. It's not clear how much more they know now.\" Residents are split on whether <mark>Murphy</mark> cares more about governing New Jersey (40 percent) or is more concerned about his political future (39 percent). That's more positive than what residents said about Christie, who left office with 79 percent of New Jerseyans believing he put personal ambition over the state. The poll of 703 New Jersey adults was conducted from April 6 to April 10. It has a margin of error of plus or minus 3.7 percentage points."}, {"articleID": "2016091707_00501658_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-09-17", "url": "http://10thousandcouples.com/2016/09/reversing-himself-after-years-trump-concedes-obama-was-born/", "content": "Reversing himself after years, <mark>Trump</mark> concedes Obama was born in U.S. by Ron Matthews | September 17, 2016 | 10:17 At the end of the \"event\" , <mark>Trump</mark> finally said what people came to hear: \"President Barack Obama was born in the United States, period\" . \"Hillary Clinton in her campaign of 2008 started the\" birther \"controversy\" . In her interview with Blitzer, Solis Doyle said she was not aware of a memorandum written by Mark Penn, a Democratic pollster and Clinton 2008 strategist, that seemed to question the President's Americanism. Clinton went on to say <mark>Trump</mark> traffics in conspiracy theories and should not be president. Clinton accused <mark>Trump</mark> of giving rise to the birtherism movement in remarks she gave at the Black Women's Agenda Symposium in D.C. only a couple of hours earlier. \"<mark>Trump</mark> lies about Hillary Clinton starting birther movement\" , her campaign said. But in reality the GOP nominee continued to raise questions about Obama's citizenship even after the president released his birth certificate. He replied: \"I'm shocked that a question like that has come up at a time when we have so many other things to do\" . \"Actually I am not that shocked\" , he went on, not missing the opportunity to at least deliver a jab to Mr <mark>Trump</mark>. Other CBC members called <mark>Trump</mark> a racist and bigot, to cheers of \"Amen!\" \"He's not sure. That's not the same as\" I'm certain the president was born either in Hawaii \"or\" I'm certain that he was not,' \"said Stone. She said <mark>Trump</mark> had tried to\" delegitimize our first black president \". Speaking Friday on ABC's\" Good Morning America \", <mark>Trump</mark>'s son said a statement by the campaign Thursday night acknowledging Obama's USA birth\" should be the definitive end \"of questions about <mark>Trump</mark>'s views. The Atlantic adds that the Clinton campaign didn't raise questions about whether or not Obama was eligible to be president. A few years into his presidency, Obama, the first African American to win the White House, released a longer version of his birth certificate to answer those who suggested he was not US born. Speaking at George Mason University in Fairfax, Virginia, Friday, First Lady Michelle Obama addressed the controversy head on.\" I don't talk about it because if I talk about that, your whole thing will be about that \", <mark>Trump</mark> said. Mrs. Obama is emerging as one of Clinton's most effective advocates, especially with voters who backed President Barack Obama but are less enthusiastic about his potential Democratic successor.\" <mark>Donald Trump</mark> owes him and the American people an apology \".\" This sickening display shows more than ever why <mark>Donald Trump</mark> is totally unfit be president \". <mark>Trump</mark> has claimed to have devoted considerable resources to Obama's birth place, telling reporters in 2011 that he had sent a team of his own investigators to Hawaii in hopes of resolving the issue. By August 2012, he was promoting the un-true claims on Twitter, writing that an\" extremely credible source \"had told him Obama's birth certificate is a fraud. Obama, meanwhile, asked that the presidential campaign move on to more serious issues. She said <mark>Trump</mark> is feeding into the\" worst impulses, the bigotry and bias \"that lurks in the nation. Related Articles"}, {"articleID": "2015012422_00012993_W", "names": {"Jane Brown": ["Q163599", "Q55858089"], "Robert Gould": ["Q18603402", "Q3435258", "Q52890002"]}, "date": "2015-01-24", "url": "http://www.dailyherald.com/article/20150124/news/301249862/", "content": "SPOKANE, Wash.--The Catholic Diocese of Spokane has settled a malpractice case it filed against the law firm that handled its bankruptcy over priest sex abuse claims. The church and the Paine Hamblen law firm settled Friday, but the terms of the settlement were not disclosed, The Spokesman-Review reported (http: //goo.gl/O4C5O2). Interested in reusing this article? Custom reprints are a powerful and strategic way to share your article with customers, employees and prospects. The YGS Group provides digital and printed reprint services for Daily Herald. Complete the form to the right and a reprint consultant will contact you to discuss how you can reuse this article. Need more information about reprints? Visit our close The malpractice lawsuit was set for a trial in February, but both sides reached a settlement through a mediation effort. \"The settlement does not constitute an admission of wrongdoing by either side,\" both sides said in a joint statement. \"Rather, it is a resolution of differences in an amicable manner which allows the parties to move forward with the important work that each conducts in the service of the common good.\" <mark>Jane Brown</mark>, the managing partner of Paine Hamblen, told the newspaper her firm is pleased with the outcome. <mark>Robert Gould</mark>, a lawyer hired by the diocese to pursue the malpractice case, declined comment. The diocese filed for bankruptcy in 2004. It reached an agreement in 2007 to pay people who claimed abuse at the hands of priests dating back decades. Former Spokane Bishop Blase Cupich, who now serves as archbishop of Chicago, reviewed the bankruptcy case when he arrived in 2010 and decided to pursue a claim against the law firm. The church had sought $3.6 million in legal fees from the law firm, saying its lawyers underestimated how many victims would come forward with sex abuse claims after the bankruptcy was first resolved. The law firm had disputed the claim. A $1 million fund was created to handle future claims after the bankruptcy case was first resolved, based on Paine Hamblen's estimates of how much it would cost the diocese to settle the allegations. But the fund was quickly depleted, raising the prospect of foreclosure on some Catholic parishes that had been put up as collateral. Paine Hamblen disputed the malpractice claims by pointing to the vitality of the Catholic Church in Spokane following the $48 million bankruptcy settlement. Guidelines: Keep it civil and on topic; no profanity, vulgarity, slurs or personal attacks. People who harass others or joke about tragedies will be blocked. If a comment violates these standards or our Obituaries Search DailyHerald.com obituaries. \""}, {"articleID": "2019010821_00092744_W", "names": {"Ryan Burr": ["Q56248288", "Q7383927"]}, "date": "2019-01-08", "url": "https://www.avinteractive.com/news/audio/sheraton-kuwait-enhances-conferences-sennheiser-08-01-2019/", "content": "Sheraton Kuwait enhances conferences with Sennheiser By Guy Campos in Audio January 8, 2019 0 The Sheraton Kuwait has upgraded to the Sennheiser ADN-W wireless conferencing system for meetings and conferences, eliminating RF interference issues with previous microphones. In a move that has significantly enhanced the meeting and conferencing experience of its corporate customers, the Sheraton Kuwait has upgraded to the latest wireless conferencing system from Sennheiser. Implemented across the property's two large ballroom-style conference facilities as well as its many meeting rooms of varied sizes, the audio specialist's ADN-W system delivers crystal clear audio conferencing with the convenience of flexible and secure wireless connectivity. Intuitiveness and customer satisfaction were top of mind for the five-star hotel. \"Our hotel's world-class facilities meet the needs of very large to extremely intimate gatherings and the wireless conferencing system allows the equipment to also be\" right-sized' exactly as per customer requirements, \"said engineer Mohamed Monieb, maintenance manager at the Sheraton Kuwait. Especially beneficial for Monieb and his team has been the system's ability to eliminate the RF interference issues that plagued the microphone system they had previously utilised.\" Prior to selecting Sennheiser, we conducted a test between ADN-W, our existing system and another manufacturer's solution and this not only demonstrated vastly superior sound quality, but also convincingly addressed our concerns around interference, \"he said. It is the ADN-W's ability to hop between frequencies in the 2.4 GHz and 5GHz ranges that makes this performance possible. Robust and reliable wireless connectivity was also assured through the direct involvement of Sennheiser's team in the design and deployment of the antennas and central control units. <mark>Ryan Burr</mark>, head of technical sales and application engineering in System Solutions at Sennheiser Middle East, commented:\" The requirement from the Sheraton was quite complex as they wanted to be able to use the system in multiple rooms throughout their premises. Through meticulous planning and modelling, we settled on permanently locating the antennas and control units in three of the rooms and then providing a floating system with accompanying wireless microphone units that can be easily moved between meeting rooms as required. \"As a simple\" plug-n-play' solution, ADN-W offers instant ease of use and is preloaded with powerful software that Sennheiser regularly updates for continuous improvement and extension of its state-of-the-art features. Conference participants can intuitively control ADN-W from the integrated PC simply by attaching a monitor and keyboard, or with a third-party media control system. The system also offers two USB ports that enable recording of conference audio onto connected drives or memory sticks. Sennheiser, working together with its long-standing partner and distributor in Kuwait, aDawliah Electronics, commissioned the system and on the day the installation was completed, the Sheraton utilised the system for a high-profile event attended by ministers of trade and industry from across the Arabian region. \"We have received very positive feedback from these as well as other clients who have been very satisfied using the new system,\" said Monieb. The following Sennheiser solutions have been deployed at the Sheraton Kuwait: 2 x ADN CU1 Central Unit 8 x ADN-W AM Antenna Module 2 x ADN-W C1 Chairman Unit 60 x ADN-W D1 Delegate Unit 62 x ADN-W MIC 15-50 50cm (long) gooseneck Full Charging and Transport Case solution to make the system completely portable. sennheiser 2019-01-08 Guy Campos Share Facebook Twitter Google + LinkedIn Email"}, {"articleID": "2019123020_00098735_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-12-30", "url": "https://www.themorningbulletin.com.au/news/depressed-greta-stopped-talking/3911861/", "content": "Greta Thunberg was deeply \"depressed\" and had \"stopped talking and eating\" before her life changed due to climate change activism. Environment Greta Thunberg suffered from depression by Patrick Knox 31st Dec 2019 6:06 AM 0 Greta Thunberg had \"stopped talking and eating\" before climate activism \"saved her\" , according to her dad. Svante Thunberg said he thought depression would kill his daughter before she launched her worldwide \"climate crisis\" campaign. He also said he thought it was a \"bad idea\" for his daughter, 16, to take the \"front line\" in combating climate change, The Sun. Mr Thunberg's remarks to the BBC came during a special edition of the Radio 4 Today program guest-edited by Greta. In an interview he said of her climate change activism: \"We thought it was a bad idea, just the idea of your own daughter sort of putting herself at the very front line of such a huge question like climate change.\" You wouldn't want that as a parent. \"Greta Thunberg stares down US President <mark>Donald Trump</mark> as he enters the United Nations on September 23, 2019. He said they spoke several times with Greta before she pursued her campaigning, explaining that she would have to do it by herself and be well prepared for questions she would face - praising her response. Mr Thunberg also talked about the difficulties that his daughter, who has been diagnosed with Asperger's syndrome, experienced with depression. Asked how she got better, he said:\" We just took a very, very long time to spend a lot of time together and just work it out together. \"He said Greta thought her parents were\" huge hypocrites \"because they were active advocates for refugees, noting that his daughter would ask\" whose human rights are you standing up? \"Mr Thunberg said his wife stopped flying and had to\" change her whole career \". He added:\" To be honest, she didn't do it save the climate - she did it to save her child because she saw how much it meant to her, and then, when she did that, she saw how much she grew from that, how much energy she got from it. \"He said he\" became vegan \"and Greta\" got more and more energy \"from this.\" I knew they were the right things to do because I understood the facts at that time, but I didn't do it to save the climate, I did it to save my child, \"he said. Environmental activist Greta Thunberg finds the trolls\" hilarious \". Picture: AP/Jason DeCrow) Svante Thunberg has lifted the lid on how he feels about his daughter's work. Picture: BBC\" HATE?...SHE FINDS IT HILARIOUS' On the abuse the teenager faces, Mr Thunberg said: \"The hate, quite frankly, I don't know how she does it but she laughs most of the time, she finds it hilarious.\" Greta, who has become a global icon for her activism, has been repeatedly trolled. In October Piers Morgan sparked outrage on Good Morning Britain today after impersonating her. The outspoken presenter was slamming civil disobedience group Extinction Rebellion when he launched a bizarre imitation of the 16-year-old climate activist. \"How dare you, how dare you?\" Morgan said, mocking Greta, who has Asperger's. \"You have stolen my morning, you have stolen my airtime. I have no life. How dare you?\" Morgan, 54, was using some of the Swedish activist's rhetoric from an impassioned speech at the UN Climate Action Summit earlier this year, when she accused those present - including <mark>Donald Trump</mark> - of \"stealing my dreams, my childhood\" . But <mark>Trump</mark>, who Greta famously glared at during a UN summit, called her a \"very happy young girl looking forward to a bright future\" . Later he retweeted one of his supporters who branded the teen an actress. Russian leader Vladimir Putin also took aim at the teenager branding her \"poorly informed\" and saying she was \"telling developing countries they should keep living in poverty\" . Meanwhile a private school head teacher cruelly branded Greta \"a little girl with mental problems\" in a newsletter sent to parents. Rodney Lynn, the principal of Coffs Harbour Christian Community Primary School in New South Wales, Australia, has been slammed for his comments about the climate activist. He accused the Swede of promoting \"doomsday waffle talk\" and labelled her a \"false prophet\" in the letter sent out to students and parents. But despite her detractors, Greta has been recognised for her devotion to fighting climate change. Earlier this month she was named Time magazine's youngest ever person of the year. Greta, who turns 17 in January, was awarded the recognition as she stood on a box to make a speech at the COP25 climate summit in Madrid. She accused politicians and businessmen of using \"creative PR\" to duck their responsibilities and \"not behaving as if we are in an emergency\" . She stormed: \"The biggest danger is not inaction; the real danger is when politicians and CEOs are making it look like real action is happening, when in fact almost nothing is being done apart from clever accounting and creative PR.\" This story was originally published in The Sun and is reprinted with permission. 0 climate change Read More Login to follow depression Read More Login to follow editors picks Read More Login to follow greta thunberg Read More Login to follow health Read More Login to follow climate change depression editors picks greta thunberg health"}, {"articleID": "2016050515_00003038_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2016-05-06", "url": "http://thediplomat.com/2016/05/trump-or-clinton-does-it-matter-to-india/", "content": "<mark>Trump</mark> or Clinton: Does It Matter to India? Should New Delhi expect a major change in U.S. policy? By Tridivesh Singh Maini for The Diplomat May 05, 2016 0 Shares Indian Prime Minister Narendra Modi will be visiting the U.S. in June, where he will address Congress at the invitation of Speaker <mark>Paul Ryan</mark>. Modi will be the fifth Indian prime minister to address that body, following Rajiv Gandhi, P.V. Narasimha Rao, Atal Bihari Vajpayee, and <mark>Manmohan Singh</mark>. It will also be Modi's fourth visit to the U.S. in two years. Since his election, Modi has strengthened India's strategic partnership with the U.S., while also seeking to enhance economic ties, much to the surprise of some pundits who had no hesitation predicting that he would focus more on Asia, while preferring a transactional relationship with Washington. Instead, Modi has taken some significant steps to reach out to the U.S., perhaps most notably his decision to invite U.S. President Barack Obama as chief guest at the 2015 Republic Day Parade. What clearly emerges is that the bilateral relationship has been \"institutionalized\" in the strategic sphere, with a number of convergences, especially in the context of issues like the South China Sea dispute. Both countries have also \"in principle\" signed the Logistics Support Agreement, which will deepen defense cooperation. A number of strategic analysts in India argue that a Republican in the White House would be better for India than a Democrat would be. If one were to look at the primaries, India has found mention a few times. While the candidate set to win the Republican nomination, <mark>Donald Trump</mark>, first mentioned India in the context of taking away U.S. jobs and also imitated an Indian call center worker, he also recently spoke about using India to stabilize Pakistan. Strategic analysts in India who are skeptical about a Democrat president have naturally taken note of <mark>Trump</mark>'s remarks, arguing that Hillary Clinton--the likely Democrat nominee--will be much softer on Pakistan. A number of points need to be kept in mind when looking at the bilateral relationship. In the strategic sphere, ties have moved beyond personalities and parties. Few would have thought that Modi would have visited America four times in two years. It would have also been unimaginable to think that a Congress prime minister would invest so much in the India-U.S. relationship as <mark>Manmohan Singh</mark> did, although a recalcitrant opposition and sections of the old guard in his own party did not support his initiatives. Second, while it is true that the relationship witnessed a high during the tenure of a Republican president, namely President George W Bush, the foundations for a strong relationship were laid by President Bill Clinton, a Democrat. Just a few month's after India's nuclear tests--which prompted condemnation from Washington--then Prime Minister Atal Bihari Vajpayee spoke about the affinities between the countries, especially their democratic credentials. This was followed by a visit to India by Clinton in March 2000 and a visit to the U.S. by Vajpayee in September 2000. Meanwhile, Obama, a Democrat, is the only U.S. president to have visited India twice, and has not adhered to the traditional practice of visiting Pakistan afterwards. During his second term, the U.S. president has also sought to find common ground with India on the South China Sea issue. In the economic sphere, the relationship is transactional. Much will depend on India's economic performance and whether it can initiate what are often called \"big-bang\" reforms, one of them being the GST. During his address to the U.S.-India Business Council in his January 2015 visit, Obama noted that America's trade with China far outstrips that with India. \"We are moving in the right direction...That said, we also know that the U.S.-India relationship is defined by so much untapped potential,\" Obama said. \"Every one here will agree, we've got to do better.\" Even <mark>Trump</mark> has spoken about the close relationship between China and U.S. in the economic sphere, although he has taken a tougher line on strategic issues. Indeed, in the economic sphere, India will need to address the concerns of U.S. investors, especially with regard to red tape--and not just in New Delhi, but in its states as well. So it would be fair to say that the India-U.S. relationship is very likely to strengthen in the strategic sphere, irrespective of which party takes power in Washington. The only issue on which there could be a divergence with a future regime could be Iran, an important strategic partner for India. Even Hillary Clinton is likely to take a very different approach to Iran than Obama's bold and imaginative policy. Tridivesh Singh Maini is a New Delhi-based policy analyst associated with The Jindal School of International Affairs, Sonipat. Topics"}, {"articleID": "2011010719_00158706_W", "names": {"Robert White": ["Q1726234", "Q173845", "Q2125056", "Q21598417", "Q25190359", "Q51585369", "Q53837056", "Q54556503", "Q58150224", "Q7351007", "Q7351012"]}, "date": "2011-01-07", "url": "http://courier-journal.com/article/20110107/NEWS01/301070081/-1/rss", "content": "your browser's security settings are preventing some features from appearing. louisville metro police detective crystal marlowe fired louisville metro police detective crystal marlowe was fired friday by chief <mark>robert white</mark>, more than a year after the department began investigating allegations that she made wrongful arrests and missed court hearings. marlowe, who was a police officer for 14 years and a detective for about three, refused to comment when the courier-journal reached her by telephone on friday: \"you been asked numerous times not to call this number, so i suggest you not call it again,\" she said, before hanging up. in an interview with the newspaper last year, marlowe said she had done nothing wrong and considered herself to be \"one of the more diligent detectives we have.\" her attorney, mary sharp, said friday that she considered <mark>white</mark>'s decision \"unjustified and unwarranted\" and she intends to file an appeal with the police merit board. before her termination, marlowe had been stripped of her law-enforcement responsibilities and assigned to a job in crime prevention. the department's investigation began in september 2009, after an assistant jefferson county attorney questioned a number of her arrests. the courier-journal reported last february that in 2008 and 2009 marlowe had accused more than a dozen defendants, many of them juveniles, of crimes they did not commit. the newspaper found that some defendants could not have been guilty of the offenses with which they were charged because they were in jail or had other evidence of their innocence. in other cases, marlowe arrested suspects based on identifications that victims later said they never made. some of those marlowe accused of crimes spent days or even months in jail before they were exonerated. during the past year, five people have joined a lawsuit against marlowe and <mark>white</mark>, claiming they were wrongfully arrested by the detective and then incarcerated. the courier-journal also reviewed approximately 130 felony cases in which marlowe made arrests during 2008 and 2009 and found that 40 percent of them ultimately were dismissed - often at prosecutors' request. at least 10 were thrown out because marlowe missed court appearances. all told, the newspaper found that she failed to appear to testify in felony cases more than 50 times during that two-year period. police conducted a criminal investigation, but the jefferson county commonwealth's attorney's office concluded in may there was insufficient evidence that marlowe broke the law. detective crystal marlowe sits in a jefferson county courtroom last february during an evidence suppresion hearing. (by david r. lutman, special to the courier-journal) subscribe copyright? 2010 use of this site signifies your agreement to the"}, {"articleID": "2011122313_00005783_W", "names": {"Omar Cook": ["Q21005431", "Q971463"], "Jonas Kazlauskas": ["Q16453637", "Q31554"]}, "date": "2011-12-23", "url": "http://au.rd.yahoo.com/sport/rss/sports/*http://au.sports.yahoo.com/news/article/-/12449774/milan-reach-last-16-as-cska-moscow-stay-perfect/", "content": "belgrade, dec 23 (reuters) - an inspired performance by american imports malik hairston and <mark>omar cook</mark> allowed triple euroleague winners emporio armani milan to keep alive their dream of winning their first title since 1988 after a 72-66 win at partizan belgrade on thursday. needing to win by at least four points to reach the last 16, milan overcame an 11-point deficit in the third quarter and clinched a berth in the second group stage of the competition. shooting guard hairston scored 18 points, playmaker <mark>cook</mark> added 17 and drew nicholas had six, including a crucial three-pointer coupled with a free throw. milan were one of the four teams to secure a top 16 berth in the final round of matches in the preliminary stage and hairston said it was down to the team's character. \"we had faith in ourselves all along because you can't ever quit and we now have to mature as a basketball team and play better in the top 16 than we did in the preliminary pool,\" the 24-year-old told reuters. \"the atmosphere in the pionir arena was incredible, the fans did all they could for their team but we got going when the going got tough and we are delighted.\" <mark>cook</mark>, who had faced partizan and their boisterous fans several times when he played for city rivals red star and spanish side malaga, was also impressed by the noise level. \"i've been here before but it was never like this. we are slowly coming together as a team and learning how to win tight games and what we pulled off tonight was amazing,\" he said. nicholas added: this is one of the toughest away courts in europe and it's almost impossible to win here so we will head into the top 16 devoid of any pressure but confident that we can progress to the quarter-finals. \"the second stage features four groups of four, with the top two advancing to the best-of-five quarter-final series whose winners will qualify for the may 11-13 final four in istanbul. rampant russians six-times euroleage winners cska moscow completed their perfect preliminary stage record with a 10th win after serbian point guard milos teodosic poured 18 points and compatriot nenad krstic scored 14 in a 91-83 win at unicaja malaga. it was only the third perfect regular season record since the turn of the century, as cska emulated their own achievement in the 2004-05 season and barcelona's in 2009-10, when the spanish outfit won the title. rampant cska had secured a top 16 berth with four games to spare but kept their foot on the gas pedal, much to the delight of their lithuanian coach <mark>jonas kazlauskas</mark>.\" i hope our fans enjoyed the game and i am happy with the way we played tonight, \"he told the competition's official website (www.euroleage.net).\" we came out focused on both ends of the court and beat a great team. \"in contrast, panathinaikos coach zeljko obradovic was fuming after the holders laboured to a 71-66 home win over unfancied german side bamberg and finished behind cska in their preliminary pool with a 7-3 record. although panathinaikos had little trouble in securing a second-stage berth in an easy group, their unconvincing performances prompted obradovic to warn the players that some of them were perilously close to being shipped off.\" we need more players who are aware what is needed over here because the door is open to those who are not, \"said obradovic, who won five euroleague titles with panathinaikos as well as one each with partizan, real madrid and fellow spaniards joventut.\" unfortunately, we have players who don't help the team and i cannot pretend the situation is perfect. things have to change and all players must be ready to play. \"elsewhere, bilbao beat caja laboral 77-72 and knocked them out of the competition in an all-spanish dogfight while turkish side fenerbahce ulker also advanced with an 83-76 success at already qualified bennet cantu of italy."}, {"articleID": "2018010903_00251133_W", "names": {"David Ryan": ["Q5239324", "Q5239326", "Q57430658"]}, "date": "2018-01-09", "url": "https://www.nytimes.com/2018/01/08/theater/review-mankind-robert-ohara-playwrights-horizons.html", "content": "Photo Bobby Moreno, left, and Anson Mount find themselves the unlikely high priests of a new religion in \"Mankind,\" at Playwrights Horizons. Credit Sara Krulwich/The New York Times A collage of female voices--including those of Michelle Obama and Barbara Walters--greets the audience arriving at Robert O’Hara's new play, \"Mankind.\" Listen carefully, because that's the last you'll hear from anyone but men in the daring, daunting comedy, which opened at Playwrights Horizons on Monday evening. In Mr. O’Hara's not-too-distant future, women have gone extinct. Exactly how this happened is not clear, but a combination of environmental insults and anatomical over-regulation seems to have made women give up on the project of feminism--and the fact of femaleness--in a universal #NotMe moment. And though men quickly evolved to replace their procreative capacity, even the universal homosexuality that resulted has not made the survivors any less male. They still screw everything up. The plot takes that notion literally at first, as Jason (Bobby Moreno) announces to Mark (Anson Mount), with whom he's had a series of casual hookups, some bad news: \"Dude, I'm pregnant.\" You may wish to know how, but neither Mr. O’Hara nor the characters seem clear on that point. (Both Jason and Mark, we learn, were on the pill .) In any case, the mutual recrimination over how the pregnancy happened soon resolves itself in an agreement to \"get rid of it\" --the baby, that is. Continue reading the main story Not so fast. In a reversal of the joke that if men gave birth, abortion would be a sacrament, the Big Brother-ish World Power Authority still outlaws pregnancy termination. After his OB-GYN rats him out, Jason is forced to deliver the \"Cry-Baby\" growing inside him by means of a machine that looks like an M.R.I. scanner crossed with a Keurig. But the child, which pops out pre-swaddled, is not what anyone expected. Photo Mr. Mount and Mr. Moreno are a couple having a baby, and <mark>David Ryan</mark> Smith, far right, is their OB-GYN in Robert O’Hara's play. Credit Sara Krulwich/The New York Times I won't spoil that part of the busy plot by saying more about the Cry-Baby, except that it somehow becomes, in this full-out patriarchy, the centerpiece of a new feminist religion. By intermission, Jason and Mark are that religion's unwilling high priests, wearing glittery robes and Ziegfeld headgear (by Dede M. Ayite) that would make a cardinal--the bird or the prelate--blush. You may blush, too, if you are a man who does not relish audience participation, as you will be asked to raise your voice in hymn to the \"most merciful Goddess.\" (Women aren't given the prayer cards .) Unfortunately, the development of this woman-and-baby-worshiping cult hijacks what seemed to be a topical comedy of gender roles and drags it around for most of the second act. Religious ideology and professions of faith, especially Catholic ones, are lampooned as idiotic and venal, but the satire will likely infuriate traditional believers of any stripe. The first of the new Ten Commandments is \"Abortion is a human right.\" I wasn't bothered by that: Surely religion is fair game for mockery. And no one should go to a Robert O’Hara play who isn't up for some trampling of sensitivities. Deliberate outrageousness is his métier, but he's an equal opportunity purveyor, eager to rile stray conservatives who venture into the theater, as well as their liberal antagonists. Newsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. See Sample Manage Email Preferences Not you? Privacy Policy Opt out or contact us anytime Actually, Mr. O’Hara has always reserved his most wicked blows for the liberals, puncturing their comfortable pieties and exposing their unexamined blind spots. In \"Barbecue,\" seen at the Public Theater in 2015, he let the audience laugh at the down-market doings of a black family picnic before repeating the scene, verbatim, with a white family. In \"Bootycandy,\" an earlier satire of black theatrical tropes and the white people who love them, a stand-in character for the playwright tells audience members at a postshow talk back that he hopes they will \"choke\" trying to swallow what he's written. \"The work should be work,\" he says. But at their intermittent best those plays were so hilarious that the work was not work--or if work, then the highly pleasurable kind. Each had a defining gimmick that made it deliciously theatrical: a twist, Mr. O’Hara writes in a program note, \"that gives the play its Shout.\" So does \"Mankind,\" in its triumph-of-the-patriarchy premise. The problem here is that the story keeps twisting even when you need it to stay put and shout. Another switcheroo arrives every few minutes, which quickly grows as tiresome as a joker roommate and lets the satire deflate into mere sarcasm. It's a problem of focus. Satire is about the sharpness of the darts but also of the targets. Here there are too many targets to leave a coherent impression. Religion seems to be the intended bull's - eye, and it's certainly instructive to see how the church of \"She\" (whose name is thought to be unpronounceable) grows into a grotesque expression of mansplained feminism. So is the way casual, catty utterances of Jason and Mark are misinterpreted by apostles and transformed into dogma. Mr. O’Hara also asks you to cackle about the vapidity of talk shows, the clichés of dystopian dialogue, bromosexuality, sexism, Trumpism and futurism itself. This pinwheel of snark feels like a stunt, and there's little that the cast--which also includes <mark>David Ryan</mark> Smith, Ariel Shafir, Stephen Schnetzer and André De Shields--can do, under the author's seemingly distracted direction, to keep a feeling of agitated desperation at bay. Their varying choices to play the material as serious drama or sketch comedy seem almost random. Mr. O’Hara has said that with satire, especially now, you can't go partway: \"You have to go for the throat.\" That's probably true--and the viciousness of \"Mankind\" that would offend some people is perhaps its best quality. But when you go for too many throats at once, the result feels less like comedy than mayhem, and hasn't the patriarchy already shown us enough of that? Playwrights Horizons 416 W. 42nd St. Midtown West 212-279-4200 website Find Tickets Category Off Broadway, Comedy, Play Credits Written and directed by Robert O'Hara Cast André De Shields, Bobby Moreno, Anson Mount, Stephen Schnetzer, Ariel Shafir and <mark>David Ryan</mark> Smith Preview December 15, 2017 Opened January 8, 2018 Closing Date January 28, 2018 Upcoming Shows Wednesday January 10 7:00 pm Thursday January 11 8:00 pm Friday January 12 8:00 pm Saturday January 13 2:30 pm Saturday January 13 8:00 pm Continue reading the main story We're interested in your feedback on this page. Tell us what you think."}]