[{"articleID": "2011091207_00029290_W", "names": {"Abdul Razaq": ["Q4665685", "Q59552812"]}, "date": "2011-09-12", "url": "http://risingkashmir.com/news/poor-bsnl-services-irk-city-residents-15277.aspx", "content": "rising kashmir news srinagar: sep 11: irked by the poor service of the telecom company bsnl, residents of several localities of have accused the company of deliberately putting its customers into crisis by not paying any heed to their complaints. \"bsnl claims to be the largest service provider in india but in kashmir the poor service has only annoyed the customers who have opted for it. while making or receiving calls the connectivity drops suddenly and one has to make repeated calls,\" said <mark>abdul razaq</mark> of abi guzar. due to the lackadaisical attitude of the telecom company people have lost faith in it. editor, owner and publisher,: syed rafi-u-din bukhari rni no: jkeng/2007/20786 postal address: p.o. box no. 793, gpo srinagar, 190001 (kashmir) phone / fax: 2477887 feedback: editor @ risingkashmir.com sister publications: buland kashmir (urdu), sangarmal (kashmiri) administration & marketing: managing editor hafiz ayaz gani email: ayaz @ risingkashmir.com, advt @ risingkashmir.com phone no: 91-8803003150, 91-9419537002 published on behalf of kashmir media group: flat no. 7, press enclave residencyroad srinagar - 190001 (kashmir) contact us copyright? 2011 rising kashmir. all rights reserved."}, {"articleID": "2018112713_00221022_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Jack Fitzpatrick": ["Q6112506", "Q6112508"]}, "date": "2018-11-27", "url": "https://windsorstar.com/news/world/trump-demanding-5b-for-border-wall-in-spending-bill-republican-says-amid-fears-of-government-shutdown/wcm/8c649e67-21d6-4f16-9eb6-051508bd57c0", "content": "5 / 5 Trump demanding $5B for border wall in spending bill, Republican says, amid fears of government shutdown Trump's position in the spending debate could harden further after his recent actions over the U.S. border with Mexico Bloomberg News Updated: November 27, 2018 Donald Trump delivers remarks at a Make America Great Again rally in Biloxi, Mississippi, on November 26, 2018. JIM WATSON/AFP/Getty Images Share Adjust Comment Print The head of the Senate Appropriations panel says that President Donald Trump is holding firm in his insistence on $5 billion for a border wall in a year-end spending package, a demand that risks blowing up negotiations and triggering a partial government shutdown. Committee Chairman Richard Shelby, an Alabama Republican, has been working to find some middle ground between the House version of the spending bill that includes $5 billion for the wall and the $1.6 billion Republicans and Democrats on the Senate panel have proposed. Asked whether the $5 billion is a red line in the negotiations, Shelby said, \"for the president .\" He said he can't predict what will happen or whether Trump is looking at a confrontation with Democrats over the wall that leads to a partial shutdown as a political benefit. \"The president has to speak for himself,\" Shelby said. \"I'll just say that I don't think it's a good idea to shut the government down, period. But people are going to posture. And it could happen, it's happened before. But all the government won't be shut down, even if it is. I hope none of it shuts down .\" A pigeon flies near the border wall that separates Mexico, left, from the U.S., where the wall ends in the Pacific Ocean, seen from Tijuana, Mexico, Wednesday, Nov. 21, 2018. Ramon Espinosa/AP If lawmakers can't complete a handful of remaining spending bills by Dec. 7, funding will expire for several government departments, including Homeland Security and Justice. House Speaker <mark>Paul Ryan</mark> and other members of the Republican leadership are scheduled to meet Tuesday with Trump at the White House to plan out the rest of the congressional term. Trump's position in the spending debate could harden further after his recent actions over the U.S. border with Mexico. They have included threatening to close it permanently in the wake of a confrontation between Central American migrants and Customs and Border Patrol agents at the busy San Ysidro port of entry between Tijuana and San Diego. The wall was clearly on the president's mind Monday when he appeared at a campaign rally in Tupelo, Mississippi, to support the candidacy of GOP Senator Cindy Hyde-Smith, who faces a runoff in her re-election bid Tuesday. \"We want to finish the wall. We've got to get funding from Congress,\" Trump said the rally. \"And if this isn't the right time to get funding, when you look at what's happening at the border, there will never be a right time. So we're going very strongly for funding for the wall .\" With assistance from <mark>Jack Fitzpatrick</mark>."}, {"articleID": "2018082605_00100578_W", "names": {"Sergio Gonzalez": ["Q28514300", "Q52162147", "Q56501664", "Q7454279"]}, "date": "2018-08-26", "url": "http://www.shropshirestar.com/sport/uk-sports/2018/08/26/valverde-hits-out-at-state-of-pitch-after-barcelonas-victory-at-real-valladolid/", "content": "Valverde hits out at state of pitch after Barcelona's victory at Real Valladolid Less than an hour ago Barca secured a narrow win. Subscribe to our daily newsletter Sign UpErnesto Valverde was left unhappy Coach Ernesto Valverde has criticised the pitch at Real Valladolid after Barcelona scraped to a 1-0 victory. The players were seen struggling as the newly laid turf began cutting up during the match at the Estadio Jose Zorrilla, with Valverde saying he had not seen anything like it \"for a long time\". The Barca coach blamed the state of the surface for making it difficult for his players to launch a counter attack and find a second goal. Quoted on the club's official website, he said: \"Valladolid played with good pressure and they pushed us, but the pitch had a lot to do with it .\" We were more dominant and had opportunities, but we couldn't score the second goal. \"There was a time when they changed the system and we could've made it 0-2 then, but in the last few minutes we did badly .\" These results give us opportunities to win the league, but we feared that there could be some injury, the state of the pitch has conditioned both teams. \"Ousmane Dembele scored the only goal just before the hour in the hard-fought win, but the hosts would not lie down and almost snatched a last-gasp point. Advertising Deep into stoppage time, Keko headed home what he thought was an equaliser but it was eventually ruled out for offside after intervention by the video assistant referee. Valladolid coach <mark>Sergio Gonzalez</mark> said after the match he thought his team had deserved to walk away with a draw .\" We were very involved the first 30 minutes, we knew how to suffer, be strong and endure situations of danger to grow and surpass us, making good football and looking for a point that finally did not come and maybe we deserved, \"he told the club's website. He defended the state of the pitch, saying they had done\" everything possible \"to have it in the best condition. Advertising\" My players are also soccer players, not farmers. Nobody is interested in playing on a lawn that does not meet good conditions, \"he said. The grass\" was the same for everyone \", he added, saying the only option was to\" adapt \"to what was there. LaLiga president Javier Tebas tweeted after the match to say the turf\" did not meet the minimum conditions required \", adding that the league planned on opening a disciplinary file."}, {"articleID": "2010011319_00190803_W", "names": {"Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"]}, "date": "2010-01-13", "url": "http://guestofaguest.com/events/up-in-the-air-big-winner-at-last-nights-national-board-award-awards-gala/", "content": "\"up in the air\" big winner at last night's national board award awards gala award-winning streak last night at the national board of motion pictures awards gala at george clooney and anna kendrick, as well as best picture. - woody harrelson won best supporting actor for his role in \"the messenger\" , carey mulligan won best actress for her role in \"gabourey sidibe won breakthrough performance by an actor for her starring turn in\" precious \". in another nod to clooney's midas touch, wes anderson picked up an award for special filmmaking achievement for note: if you have already signed up for our newsletter, you can login using your existing account credentials. admission: invite only description: throw a cocktail party like a pro: hostessing workshop with hors d'oeuvres and wine where: broadway party rental showroom, 137 grand street, 6th floor, new york, ny 10013 (admission: ticketed event description: admission: ticketed event description: where: nirvana, 346 lexington avenue, btw e 39th and e 40th st., new york, ny 10016 (admission: open description: admission: invite only description: admission: open description: where: submercer, 147 1/2 mercer street, new york, ny (admission: open description: where: harem-by le souk, 510 laguardia pl. between bleecker/houston, new york, ny (admission: invite only description: lorenzo martone the 30 year old brazilian creative talks about work and his impending marriage to designer <mark>marc jacobs</mark>. fakebakedselfhatingjew-jlr, uhelpmefallsleepwhenihaveinsomniaandamwideawake:\" i know jrl \"personally\". no-he's as real as most of hollywood's boobs.he is a big talker and has a camera ready \"justin\" case he sees a celebrity. pop goes the photo and out is is sent to the network...\"jrl, the\" supercharged super jew \"continues to take nyc's shiksas by storm chiara:\" i'm...pretty obsessed with that name, now. that cannot be real. \":\" here is the official link to the real estate listing for justin lees parents modest hamptons home. the fact that they are selling while real-estate is at an all-time low should be a clear indication...\"jrl, the\" supercharged super jew \"continues to take nyc's shiksas by storm industry expert:\" just lee is the heir apparent to a large apparel business - lee jeans. how else would he be so rich? maybe it's because they also own other businesses, too - including lee, wrangler, varv...\""}, {"articleID": "2019050114_00184518_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-05-01", "url": "http://www.gamereactor.eu/?system=ps4&sid=3811f52c6576984cc21c4a9b2f425cd7", "content": "PS4 Dóri and Lisa are in LA to get a sneak peek at the Gearbox sequel, and we're able to share some of this with you tonight. Review Assassin's Creed Odyssey gives us Testiklos the Nut Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 14:17 The new mercenary wields the Nutcracker and is the brother of Testikles, so you can see what Ubisoft is getting at here. 0 Catherine: Full Body has a Death By Nightmare trailer Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 12:11 We also get details on the Launch Edition and the Heart's Desire Premium Edition, featuring extra tantalising goodies. 0 Power Rangers: Battle for the Grid gets new DLC Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 11:44 This adds a story mode featuring voiceovers from the original cast, as well as new characters and fresh arenas. 0 Watch 40 minutes of The Sinking City right here Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 11:05 We've been shown the first main quest of the game, so you can take a look at Frogware's title ahead of the June release. 0 Renegades reveals new Rocket League team Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 10 After a year out from the game, they've come back with the roster formerly under the Chiefs banner. 0 Operation Oracle landing in Ghost Recon: Wildlands tomorrow Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09:54 Players are also getting a free weekend across all platforms until May 5, giving access to all the content including Oracle. 0 Wonder Boy: The Dragon's Trap hitting mobiles this month Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09:30 We have a new trailer showing us the Android and iOS version, which has been optimised for mobile by Playdigious. 0 The eFootball. Pro League finals are on May 19 Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 09 We know three of the teams attending, and the Last Chance Group will determine who faces Celtic that day. 0 We've got a very special Borderlands 3 livestream today Written by <mark>Sam Bishop</mark> on the 1st of May 2019 at 08:49 Dóri and Lisa are in LA to get a sneak peek at the Gearbox sequel, and we're able to share some of this with you tonight. 0 Usmakabyle on controversial PES League celebration: \"I'm a little mad\" Written by David Caballero on the 1st of May 2019 at 08 The AS Monaco player showed a lot of emotion when he finally managed to beat Alex Alguacil in the semi-finals. 0 Team Sonic Racing \"actually feels like you're working with teammates\" Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 16:20 We spoke to Sumo Digital in London about the game's team-based premise, and how they've ensured it's meaningful. 0 Check out all our Team Sonic Racing gameplay Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 16:00 We tried out the multiplayer and the single-player at a recent event, and we've got some races to show you on a number of tracks. 0 Wolfenstein II, Tacoma, and more headed to Xbox Game Pass Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 15:05 Game Pass has expanded with a number of big games, all of which are landing over the next few weeks. 0 Players can earn loot during Borderlands 3's gameplay reveal Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 14:42 Tomorrow streamers will be heading into the game, and you can earn in-game items ahead of release via the ECHOcast extension. 0 Saxophonist Leo Pellegrino latest to launch Fortnite lawsuit Written by <mark>Sam Bishop</mark> on the 30th of April 2019 at 14:17 This isn't exactly the same as the other cases we've seen, but he is represented by the same lawyer as the other claims."}, {"articleID": "2012062511_00039108_W", "names": {"Aaron Cook": ["Q16526050", "Q187488", "Q2820034", "Q4661931"]}, "date": "2012-06-25", "url": "http://marionstar.com/article/20120625/HSSPORTS01/206250313/All-Star-Classic-Mount-Gilead-QB-Carver-scores-South-s-only-TD-loss?odyssey=mod|newswell|text|Frontpage|p", "content": "heat hard on elderly, crops marion--with no rain in the foreseeable future and the temperatures expected to creep up again,...it is in the heart of our community, but you forget it's there. it's local, but world-famous. another blown save for chapman cincinnati (ap) - aroldis chapman got another chance, and gave it away. new orleans - former saints linebacker scott fujita, a union leader with a record of criticizing...thank you, roger george forty years - a lifetime for some, a storied career for roger. today our sentimental journey is taking us to 1910 for a look at some of the interesting things...lexington - all mason minnich could do was watch for the first 8:14 of saturday night's buckeye superstore/mcdonald's all-star football classic. the crestview running back spent the rest of the night making up for lost time and helping the north erase a 10-0 deficit after the south held the ball for nearly 12 of the first 16 minutes. minnich rang up 155 yards of total offense and scored the go-ahead touchdown late in the third quarter as the north rallied for a 21-10 victory at lexington high school to keep coach todd fox perfect in this all-star series. the loss spoiled a terrific start by the south and put a damper on head coach <mark>aaron cook</mark>'s 32nd birthday. on the plus side, <mark>cook</mark> saw two of his players at marion pleasant - jasone montgomery and tyler ferguson - take home most valuable defensive player and offensive lineman honors, respectively. \"we were most worried about their two quarterbacks,\" <mark>cook</mark> said, referring to buckeye central's tyler erwin and ashland's zach bernhard. \"they are two prolific quarterbacks who can create problems. the south held the ball for the first 8:14, driving 83 yards on 17 plays to take a 7-0 lead on mount gilead quarterback justin carver's 17-yard run. the lead increased to 10-0 when ontario's harry stickleman drilled a 32-yard field goal on the south's second possession, capping an eight-play, 65-yard drive. but after mustering 148 yards on its first two series, the south was limited to 68 yards the rest of the game. minnich, named offensive mvp, put the north in front to stay when he found the left pylon from six yards out to make it 14-10 with 2:56 left in the third quarter. it was poetic justice since minnich's two big plays in the first half went for naught. his 28-yard gain on a pitchout was wasted when the north missed a 26-yard field goal on the last play of the first quarter. on the north's first series in the second period, minnich was wide open down the left sideline for a 43-yard reception, but the drive fizzled at the 20 when he got stuffed on fourth-and-one .\" i had no idea i would get as many carries as i did, \"minnich said .\" as the quarters go on, i like getting the ball more and more, and i'm glad i got the opportunity. \"minnich, a division iii runner-up in the 100 meter dash at the state track meet three weeks ago, appeared to be in mid-season form even though the all-stars practiced for only four days .\" it's just like i said during track season, \"minnich said .\" football is never over with me, and (that attitude) paid off tonight. \"the north sealed the victory by ripping a page from the south's first quarter playbook. the north played keep-away in the fourth quarter, running 20 plays to the south's three over the first 10:29 of the final period. the kill shot was the 10-yard insurance score by plymouth running back tyler hicks on a 13-play, 58-yard drive that took 5:37 off the clock and left the south down two scores with only 1:31 to play. all-star classic: mount gilead qb carver scores south's only td in loss lexington - all mason minnich could do was watch for the first 8:14 of saturday night's buckeye superstore/mcdonald's all-star football classic."}, {"articleID": "2019080117_00100716_W", "names": {"Phil Murphy": ["Q260042", "Q3378818", "Q7182210", "Q7182211"]}, "date": "2019-08-01", "url": "http://woai.com/content/2019-08-01-terminally-ill-patients-in-new-jersey-to-be-allowed-to-end-their-lives/", "content": "Terminally Ill Patients in New Jersey to be Allowed to End Their Lives posted by R.J. Johnson - @ rickerthewriter - Just Now Beginning today (Thursday, August 1), terminally ill adults in the state of New Jersey will be allowed to ask their doctors for prescriptions for medication to help end their lives. The law goes into effect today after New Jersey Gov. <mark>Phil Murphy</mark> signed the Medical Aid in Dying for the Terminally Ill Act that was passed by lawmakers earlier this year. The bill allows for any patient who has a diagnosis of six months of fewer to live to request life-ending medication from the doctors. The law requires the patient undergo counseling by either a psychiatrist or psychologist in order to determine whether the patient has the mental capacity to make such a decision. If approved the patient can get a prescription of a series of self-administered pills that can be taken at home. \"Allowing residents with terminal illnesses to make end-of-life choices for themselves is the right thing to do,\" said Governor <mark>Murphy</mark> when he signed the bill in April. \"By signing this bill today, we are providing terminally ill patients and their families with the humanity, dignity, and respect that they so richly deserve at the most difficult times any of us will face .\" The bill has floated around the New Jersey legislature stretching back to 2014, but this was the first time it made it to the state Senate for a vote. It narrowly passed, with many concerned about its effects. Supporters on the other hand, including several terminally ill patients cheered the law when it was passed. \"Just having this option is a godsend that will enable me to live the rest of my life, however long it is, as fully as possible knowing I won't have to suffer needlessly at the end,\" said supporter Susan Boyce, a Rumson resident who has a terminal lung disease. Several other states in the U.S. allow physician-assisted suicide including: California, Oregon, Washington, Hawaii, Montana, Colorado, Vermont and the District of Columbia. Another nineteen states are reportedly considering similar physician-assisted suicide bills. Photo: Getty Images"}, {"articleID": "2013040410_00037062_W", "names": {"Tom Clements": ["Q7815342", "Q7815343", "Q7815344"]}, "date": "2013-04-04", "url": "http://hawaiitribune-herald.com/sections/news/nation/friends-say-slain-wva-sheriff-targeted-drug-use.html", "content": "friends say slain w.va. sheriff targeted drug use williamson, w.va. (ap) - a sheriff known for cracking down on the drug trade in southern west virginia's coalfields was fatally shot wednesday in the spot where he usually parked his car for lunch, a state official said, and a suspect was in custody. state police told gov. earl ray tomblin that mingo county sheriff eugene crum died of his wounds, said his chief of staff rob alsop. state police spokesman sgt. michael baylous identified the suspect as 37-year-old tennis melvin maynard and said he was being treated at cabell huntington hospital in huntington for gunshot wounds late wednesday. baylous said the suspect's condition was unknown, but maynard was shot by a sheriff's deputy after a short pursuit in delbarton that ended with maynard crashing his car. the shooting was blocks from the county courthouse that was evacuated after the shooting. streets into the city were temporarily blocked off and officers held white sheets around the crime scene, crum's body further shielded by two vehicles. though there is no indication of any direct connection, crum's killing comes on the heels of a texas district attorney and his wife being shot to death in their home over the weekend, and just weeks after colorado's corrections director also was gunned down at his home. delegate harry keith white, who campaigned with crum last year, said his friend was shot to death in the same place where he parked his car most days to eat lunch, near the site of a former pharmacy known for illegally distributing pills. \"i think anybody you ask would tell you he was a great guy, always with a positive attitude, always trying to help people,\" white said. \"it's just a sad, sad day for mingo county and the state of west virginia. soon after he took office this year, crum led a drug task force and an initiative called operation zero tolerance, making good on a campaign pledge, white said. state, federal and local authorities have all tried to crack down on west virginia's drug problem, which centers on the illegal sale of prescription drugs in the southern counties. mingo county is in the southwest corner of west virginia, on the border with kentucky. the centers for disease control and prevention says west virginia has the second-highest rate of drug overdose deaths in the nation. and in february, the u.s. attorney's office said it had prosecuted more than 200 pill dealers in the past two years. kenneth jude, 23, of chatteroy, has known crum his whole life and believes he was targeted because of his crusade .\" they shouldn't scare cops into not wanting to do their jobs, \"he said .\" it's people like that that give this place a bad name - somebody that would do something that stupid, to kill somebody that's trying to make it a better place, \"jude said .\" you wouldn't think something like that would happen, especially in the middle of town. \"jerry cline stood near the site of crum's slaying hours later, recalling how crum watched the traffic and the community but\" never messed with nobody unless they were violating the law. \"authorities have not said whether the shooting was related to crum's drug crackdown, but it was on cline's mind .\" he told them right before he got in as sheriff, \"if you're dealing drugs, i'm coming after you. i'm cleaning this town up,'\" cline said. \"? he got out just to do one thing, and that's the clean this town up. that's all that man tried to do .\" cline's wife, loretta, said the sheriff was a good friend to everyone, even those who barely knew him. \"once you meet him one time, it's like you've known him all your life,\" she said. \"every time you'd see him, he was always the same. he always had a smile on his face. he was a very loving person .\" crum had resigned his post as a county magistrate before launching his sheriff's campaign as a signal of integrity, preferring to run as a civilian rather than an official, white said. he won the primarily handily and ran unopposed in the general election in the fall. crum had been a magistrate for 12 years and had previously served as police chief in delbarton. delegate justin marcum, d-mingo and an assistant county prosecutor, called crum \"a true friend to the county .\" \"he'll be dearly missed,\" he said. williamson, a town of about 3,200, sits along the tug fork river in a part of the state long associated with violence. mingo and neighboring mcdowell county are home to the legendary blood feud between the hatfield family of west virginia and the mccoy family of kentucky, a conflict dating to the civil war. crum's county was dubbed \"bloody mingo\" during the early 20th century mine wars, when unionizing miners battled baldwin-felts security agents hired by the coal operators. in may 1920, after evicting striking miners in red jacket, some of the baldwin-felts men tried to board a train in nearby matewan but were confronted by the mayor and the chief of police, sid hatfield, a former miner, who had family ties to the hatfields in the feud. after a gun battle recreated in the 1987 john sayles film \"matewan,\" the mayor, two miners, a bystander and three agents lay dead. hatfield became a hero but was gunned down on the courthouse steps a year later in matewan. in the slayings of the texas district attorney and his wife, officials suspect a white supremacist prison gang. those killings happened a couple of months after one of the county's assistant district attorneys was killed near his courthouse office. over the last century, 14 prosecutors have been killed, according to news reports and statistics kept by the national district attorneys association. at least eight of them were targeted in the line of duty. colorado's corrections director, <mark>tom clements</mark>, was killed march 19 when he answered the doorbell at his home outside colorado springs. two days later, evan spencer ebel, a white supremacist and former colorado inmate suspected of shooting <mark>clements</mark>, died in a shootout about 100 miles from kaufman. u.s. attorney booth goodwin called crum's killing \"shocking\" and said he's spoken to the state police, which will lead the investigation. he pledged the assistance of his office and whatever other federal agencies are needed. the officer down memorial page says 197 police officers in west virginia have died in the line of duty, 136 of them from deliberate gunfire .--smith contributed from morgantown. associated press writer lawrence messina contributed from charleston. rules for posting comments comments posted below are from readers. in no way do they represent the view of stephens media llc or this newspaper. this is a public forum. comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. comment posters are solely responsible under the communications decency act for comments posted on this web site. stephens media llc is not liable for messages from third parties. ip and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. do not post: potentially libelous statements or damaging innuendo. obscene, explicit, or racist language. copyrighted materials of any sort without the express permission of the copyright holder. personal attacks, insults or threats. the use of another person's real name to disguise your identity. speed limit to drop on highway 130 activists stage \"grow-in' on state land"}, {"articleID": "2009032504_00033160_W", "names": {"Rob Nicholson": ["Q1566929", "Q600859"], "Robert Brooke": ["Q52848187", "Q7342387"]}, "date": "2009-03-25", "url": "http://wellandtribune.ca/ArticleDisplay.aspx?e=1493271", "content": "atvers' hopes derailed in wainfleet posted by kaesha forand kforand @ wellandtribune.ca wainfleet - despite a plea from quad niagara atv president gerry stull and a 130-signature petition, township council will continue to forge ahead with the sale of an abandoned rail line. during a march 10 council meeting, there was discussion of setting aside the abandoned rail line for an atv trail instead of selling it to abutting land owners. council voted 3-2 in favour of the latter. after hearing of that discussion, stull and members of the atv group went door to door and collected 130 signatures hoping to encourage council to rescind its decision and to have a public meeting about the rail line. \"i am still a believer...that town councils are supposed to work for its people and what they want as a whole .\" he said the old east-west rail line that runs north of forkes rd. starting just east of deek's rd. and ending close to the dunnville town line would encourage atvers to ride legally on a trail, instead of riding on private property. \"these lands are a corridor that can link several of our local communities together via a multiuse trail which would run though virtually the heart of our community,\" stull said. longtime club member dennis zierle said he was saddened to hear of council's decision to sell the land without holding a public meeting. ald. evan main said he remembered stull's first presentation to council to create a policed trail system where people could pay to ride. fees would be applied to providing abutting land owners with $5 million in insurance coverage. however, main noted more than 10 months ago council began the process to dispose of the land through sale to abutting land owners, a process he said would be unfair to overturn. \"i do have a problem with going back on my word,\" main said. \"somehow it doesn't seem fair to me to change policies on a whim .\" operations director greg wuisman said the township has three applications to purchase portions of the land where residents have paid a $1,000 application fee. another two applications are in the works and he's received numerous other inquiries. continued after advertisement below ald. rudy warkentin has taken time to speak to farmers and home owners whose property abuts the line. he said many would be opposed to the trail. although he was elected to represent wainfleet as a whole, his concern is for people who would be directly affected. \"it's almost impossible to police this 24/7,\" he said. \"liability still leaves me with unanswered questions .\" mayor barb henderson said although councillors are elected to make decisions, \"people don't always like them .\" she said councillors have been accused of not listening to taxpayers when making decisions, but in this case they are listening to people who would be most affected by change. \"i for one will not change my mind with a public meeting,\" she said. group a week 27 march 23, 2009 away team score home team score club lasalle 22 st. joseph's bakery federal justice minister and niagara falls mp <mark>rob nicholson</mark> will be the special guest speaker as the stamford kiwanis celebrate 50 years of service to is the recent economic turmoil a terrible crisis for investors, or a terrific opportunity? patrick baichoo and <mark>robert brooke</mark> will be at the centennial the library barrels towards one of the busiest weeks of the year! this year's march break features hands-on and entertainment activities for children from brock u - c! rca: 46 circus acts in 45 minutes - march break a hip and humorous, fast and furious, stamford kiwanis the stamford kiwanis club meets each monday at 6:30 p.m. at the best western cairn croft on lundy's lane. \"flying into spring\" saturday april 25th, 2009, royal canadian legion, 383 morningstar, welland' @ st. catharines public library - easter egg hunt contest (ages 11 and under) @ st. catharines public library - free ca tax clinics - for low income earners"}, {"articleID": "2013011518_00087189_W", "names": {"David Cole": ["Q1174036", "Q1174040"], "Kate Middleton": ["Q10479", "Q17506155"]}, "date": "2013-01-15", "url": "http://wfmj.com/story/20586366/21-news-goes-to-the-detroit-auto-show", "content": "meta itemprop = \"datepublished\" content = \"2013-01-15 18:35:07\" > dr. phil to do a show on steubenville rape case dr. phil to do a show on steubenville rape case it's a case that has made headlines and rattled the tight-knit city of steubenville, ohio. two high school football players are accused of raping a 16-year-old girl, while partying in august 2012, and it's a case that has made headlines and rattled the tight-knit city of steubenville, ohio. meta itemprop = \"datepublished\" content = \"2013-01-15 18:11:46\" > commercial vehicle rollover on state route 5 in warren commercial vehicle rollover on state route 5 in warren warren, ohio - an accident involving a rolled over commercial vehicle has been reported in warren. warren, ohio - an accident involving a rolled over commercial vehicle has been reported in warren. meta itemprop = \"datepublished\" content = \"2013-01-15 01:36:00\" > updated: study reveals city of youngstown could face deficit problems study reveals city of youngstown could face deficit problems youngstown, ohio - as budget hearings begin for the city of youngstown, a fiscal study reveals that the city could experience a projected deficit of $5-million dollars over the next year. youngstown, ohio - as budget hearings begin for the city of youngstown, a fiscal study reveals that the city could experience a projected deficit of $5-million dollars over the next year. meta itemprop = \"datepublished\" content = \"2013-01-15 18:06:49\" > children services complete investigation of alleged assault children services complete investigation of alleged assault youngstown, ohio - school officials are waiting to hear what children services has to say about an alleged assault that took place last week involving an autistic student and multiple teaching assistants. youngstown, ohio - school officials are waiting to hear what children services has to say about an alleged assault that took place last week involving an autistic student and multiple teaching assistants. girard, ohio - a trumbull county fire chief is facing driving under the influence charges. girard police say kenneth bornemiss went through a stop sign early sunday morning and hit another vehicle. a girard, ohio - a trumbull county fire chief is facing driving under the influence charges. meta itemprop = \"datepublished\" content = \"2013-01-15 02:00:13\" > mahoning county coroner investigating the cause of death of a 4-year-old mahoning county coroner investigating the cause of death of a 4-year-old youngstown, ohio - the mahoning county coroner's office is investigating the cause of death of a four-year-old boy. dr. joseph ohr conducted the autopsy on monday morning. the boy died unexpectedly youngstown, ohio - the mahoning county coroner's office is investigating the cause of death of a four-year-old boy. meta itemprop = \"datepublished\" content = \"2013-01-15 04:50:39\" > struthers cop loses chance to get job back through arbitration struthers cop loses chance to get job back through arbitration struthers, ohio - a former struthers police officer, who was fired after an ovi arrest, will not get his job back through arbitration. struthers, ohio - a former struthers police officer, who was fired after an ovi arrest, will not get his job back through arbitration. meta itemprop = \"datepublished\" content = \"2013-01-14 22:34:00\" > valley gas processing plant to bring jobs valley gas processing plant to bring jobs springfield township, ohio - a gas processing plant is expected to be up and running by the end of the year in springfield township. springfield township, ohio - a gas processing plant is expected to be up and running by the end of the year in springfield township. meta itemprop = \"datepublished\" content = \"2013-01-14 21:21:16\" > mahoning county turns over paulin road in springfield mahoning county turns over paulin road in springfield springfield township, ohio--mahoning county commissioners have agreed to turn the upkeep of paulin road in springfield township over to the lake club in poland township. springfield township, ohio--mahoning county commissioners have agreed to turn the upkeep of paulin road in springfield township over to the lake club in poland township. meta itemprop = \"datepublished\" content = \"2013-01-15 02:15:07\" > austintown teachers protest lack of contract austintown teachers protest lack of contract austintown, ohio - austintown school officials are reacting to teachers who may be protesting a lack of a contract. detroit, michigan - the first major auto show of the new year has car manufacturers from around the world gathered in detoit. the 2013 detroit auto show officially opens on tuesady, but 21 news was in detroit for a sneak peak of the show. for car enthusiasts, the massive cobo convention center has been transformed into a car lover's dream garage. the hall is filled with more than 500 vehicles in every shape, size, color and power train; including many that are being seen for the first time. at this same show last year, 38 vehicles made their debut. this year that number is up to more than 50. it's just another sign of how the industry is changing long-time auto industry reporter phil lebeau of cnbc says the u.s. market has become hyper competitive. \"we'll see more new models rolled out in north america and in the united states in one year than we've ever seen. and that's a reflection of they can turn cars quicker and there more name plates in this market and they're trying to cut the market finer,\" lebeau said. it means a bigger, more diverse selection than ever for consumers, whether it's a luxury vehicle or an economical compact. this year's show continues a trend toward more fuel efficient vehicles from hybrids to plug-ins. industry analyst <mark>david cole</mark> says another continuing trend is the complete merger of the auto and electronics industries. \"the ability to download apps into the car it's all very exciting,\" <mark>cole</mark> said. general motors claimed car of the year honors with the cadillac ats. and will also be revealing the new cadillac elr which is a companion to the chevrolet electric volt. meta itemprop = \"datepublished\" content = \"2008-02-22 20:33:26\" > it's time to enter for the wfmj today wedding! it's time to enter for the wfmj today wedding! 2012 wfmj today wedding couple sarah & andrew barabas the 12th annual wfmj today wedding will be held on friday, may 17, 2013 at the butler institute of american art. and we are looking for a couple who wants to have the wedding the 12th annual wfmj today wedding will be held on friday, may 17, 2013 at the butler institute of american art. and we are looking for a couple who wants to have the wedding of a lifetime!>> inside you will find the 2013 application meta itemprop = \"datepublished\" content = \"2009-12-24 03:07:20\" > win a pizza party with a harlem globetrotter teachers! the harlem globetrotters are coming to the valley! and you can win a pizza party with a globetrotter at your school on january 28th! teachers! the harlem globetrotters are coming to the valley! and you can win a pizza party with a globetrotter at your school on january 28th! nominate an outstanding teacher in your community for the giant eagle class act award! nominate an outstanding teacher in your community for the giant eagle class act award! it's pizza and live tv...it's a fun adventure at the children's center for science and technology...it's pizza hut lunch box weather! follow along as we get ready for the 2012 wfmj today wedding! we'll have all of the behind the scenes details and photos as we move towards wedding day on friday, may 18, 2012! meta itemprop = \"datepublished\" content = \"2013-01-14 19:44:45\" > lancaster mayor urges action to curb gun violence lancaster mayor urges action to curb gun violence the mayor and police chief of lancaster are joining in calls for congress to stop gun violence. the mayor and police chief of lancaster are joining in calls for congress to stop gun violence. meta itemprop = \"datepublished\" content = \"2013-01-14 20:56:53\" > police: teens in pa. crash were inhaling drug police: teens in pa. crash were inhaling drug state police say three teens were inhaling compressed air cleaner before they were involved in a collision last fall in southwestern pennsylvania that killed four people and seriously injured four others. state police say three teens were inhaling compressed air cleaner before they were involved in a collision last fall in southwestern pennsylvania that killed four people and seriously injured four others. meta itemprop = \"datepublished\" content = \"2013-01-14 11:36:13\" > woman's body found mutilated at ohio apartment woman's body found mutilated at ohio apartment police have arrested a man on a murder charge after authorities found a woman's naked, mutilated body in a northwest ohio apartment. police have arrested a man on a murder charge after authorities found a woman's naked, mutilated body in a northwest ohio apartment. meta itemprop = \"datepublished\" content = \"2013-01-14 17:16:34\" > police seek missing rifle in w. pa. homicide police seek missing rifle in w. pa. homicide police are seeking a missing rifle that may have been used to kill a western pennsylvania man at his truck repair shop. police are seeking a missing rifle that may have been used to kill a western pennsylvania man at his truck repair shop. meta itemprop = \"datepublished\" content = \"2013-01-14 16:44:32\" > families of flight 93 names new president families of flight 93 names new president the families of flight 93 charity has named gordon felt to be its new president. homeland's winning streak continued at the golden globe awards, while argo won big just days after a huge oscar snub. homeland's winning streak continued at the golden globe awards, while argo won big just days after a huge oscar snub. meta itemprop = \"datepublished\" content = \"2013-01-14 14:30:01\" > jodie foster comes out, retires and slams lack of privacy in surprising golden globes speech there were winners and losers at the golden globes, but one of the biggest newsmakers was jodie foster, who came out as a lesbian and seemed to retire from hollywood. there were winners and losers at the golden globes, but one of the biggest newsmakers was jodie foster, who came out as a lesbian and seemed to retire from hollywood. prince william and <mark>kate middleton</mark>'s baby is due in july, buckingham palace has announced. prince william and <mark>kate middleton</mark>'s baby is due in july, buckingham palace has announced. meta itemprop = \"datepublished\" content = \"2013-01-14 14:24:40\" > 30 percent of u.s. teen girls meet up with online strangers nearly a third of american teenage girls say that at some point they've met up with people with whom their only prior contact was online, new research reveals. nearly a third of american teenage girls say that at some point they've met up with people with whom their only prior contact was online, new research reveals. meta itemprop = \"datepublished\" content = \"2013-01-13 19:30:01\" > miss new york crowned the new miss america miss new york mallory hytes hagan was named the new miss america in las vegas. miss new york mallory hytes hagan was named the new miss america in las vegas. meta itemprop = \"datepublished\" content = \"2013-01-14 14:24:40\" > twitter may help those trying to lose weight using twitter may help people lose weight by providing them with social support, researchers report. using twitter may help people lose weight by providing them with social support, researchers report. meta itemprop = \"datepublished\" content = \"2013-01-12 19:30:01\" > howard stern calls girls' lena dunham a \"little fat girl\" howard stern has never been one to mince words, but he certainly caused a stir after calling girls' creator and star lena dunham a \"little fat girl .\" howard stern has never been one to mince words, but he certainly caused a stir after calling girls' creator and star lena dunham a \"little fat girl .\" meta itemprop = \"datepublished\" content = \"2013-01-09 21:30:45\" > the most dangerous spiders in your home venomous spiders can be dangerous to those who spend time outside. these spiders occasionally find their way inside home and can present a serious risk. venomous spiders can be dangerous to those who spend time outside. these spiders occasionally find their way inside home and can present a serious risk. after six days scouring las vegas for the best of best in technology at ces 2013, here are the gadgets people can't seem to stop talking about. after six days scouring las vegas for the best of best in technology at ces 2013, here are the gadgets people can't seem to stop talking about. meta itemprop = \"datepublished\" content = \"2013-01-11 14:30:02\" > ashley judd \"definitely interested\" in run for public office, kentucky congressman says ashley judd appears to be inching closer to a run for office."}]