[{"date": "2013-04-30", "url": "http://us.rd.yahoo.com/finance/news/rss/story/SIG=14m6vloq3/*http%3A//us.rd.yahoo.com/finance/news/topfinstories/SIG=12jltkod5/*http%3A//finance.yahoo.com/news/apple-wows-market-record-17billion-190308679.html?l=1", "content": "by john balassi and josie cox new york/london, april 30 (ifr) - apple inc wowed the debt markets on tuesday with the largest non-bank bond deal in history, offering a whopping $17 billion for sale as the u.s. computer giant switches strategy to placate restless shareholders. just a week after announcing its first drop in quarterly earnings in a decade, apple came to market with the massive deal to raise funds for an ambitious program that will return $100 billion in cash to holders of apple shares. sources said investors could barely submit orders fast enough to get in on the deal from apple, the only major tech company without a single penny of debt on its books. the six-part all-dollar offering attracted more than $50 billion of orders by midday in new york - a massive level of demand even in the current red-hot climate of the bond markets. \"apple made its intentions clear that this deal is for shareholder-friendly activity, but they have tremendous metrics and brand recognition,\" rajeev sharma, portfolio manager at first investors management co, told ifr. \"apple is something everyone wants in their portfolio .\" the $17 billion size easily trumps the previous biggest single deal according to thomson reuters/ifr data, a $14.7 billion deal from abbott laboratories spin-off abbvie last november. earlier, a source said potential investors had been told on monday that this would be apple's only bond deal of the year, apparently scuttling hopes of possible euro or sterling issues - and helping fuel demand for tuesday's mega-deal, which was led by deutsche bank and goldman sachs. changing their tune the massive deal caps a milestone week for apple, which in seven days has changed tack to satisfy its investor base, becoming the world's biggest dividend payer and recapturing its mantle as the world's largest company by stock market value at $413 billion. investors unhappy with chief executive <mark>tim cook</mark>'s previous reluctance to share any of apple's massive $145 billion cash pile with shareholders - and unimpressed by its diminishing prospects for earnings growth - had been relentless sellers of apple's stock since its share price topped out above $705 in late september. the stock tumbled more than 45 percent from september 21 through march 19, falling by roughly $320 per share. but the stock has rallied more than 12 percent in the past 10 days as a new class of income-oriented investor, enticed by its dividend yield of nearly 3 percent, snaps up shares. they rose more than 3 percent on tuesday to over $444. expectations for future profit growth have trailed off significantly in the past year. after 10 years of high double-digit profit growth, analysts on average now expect a 10-year compound annual earnings growth rate of less than 7 percent, according to thomson reuters starmine, which tracks analyst forecasts. raising the cash although the company has a staggering $145 billion in cash, only $45 billion of that is readily available in the united states - meaning apple needs to raise about $60 billion over the next three years to fund the shareholder capital return plan. analysts suggest that hitting the debt markets now makes sense with interest rates - and thus the cost of raising funds - near record lows. but the maker of the iconic ipad and iphone failed to win the highest triple a rating from agencies. s & p rated the company aa +, while moody's rated it aa1. nevertheless, the massive investor interest allowed apple to tighten every tranche of the deal - from 3-year to a maximum 30-year tenor - by five basis points (bp) from guidance to launch. the company is offering $1 billion of three-year floating-rate notes, $1.5 billion of three-year fixed-rate notes, $2 billion of five-year floating-rate notes, $4 billion of five-year fixed-rate notes, $5.5 billion of 10-year fixed-rate notes and $3 billion of 30-year fixed-rate notes. analysts had initially suspected that the overwhelming interest would allow apple to price the deal even inside last week's bond from microsoft. but some investors said apple was leaving some spread on the table so that the deal, which was to price later on tuesday, would eventually trade tighter than the microsoft issue - and so that apple could get even better pricing next time round. \"if they are going to come back with another deal, be it in dollars or another currency, they will need to satisfy a similar investor type, so you want to leave a good taste in everyone's mouths,\" said matt duch, senior portfolio manager at calvert investments. (reporting by john balassi and josie cox; additional reporting by danielle robinson and reuters news; writing by marc carnegie; editing by ciara linnane)", "articleID": "2013043019_00069635_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}}, {"date": "2013-05-01", "url": "http://www.crestviewbulletin.com/news/community/guardian-ad-litem-remembers-needy-children-with-ceremony-1.135845", "content": "CRESTVIEW - The Guardian Ad Litem in Crestview on Sunday remembered needy, unrepresented children with a ceremony at Twin Hills Park. Guardian Ad Litem is a government-assisted, volunteer-based organization that speaks for children moved from their homes due to courtroom intervention. These children, who have been abused, neglected or abandoned, are often removed from a toxic environment and placed into care of others. Carita <mark>Smith</mark>, the Crestview Guardian Ad Litem program's volunteer coordinator, hosted the event. The goal was to encourage more people to volunteer for the program. \"We have lots of volunteers and I appreciate them,\" <mark>Smith</mark> said during the ceremony. \"But right now, we have over 200 (children) without Guardian Ad Litem. So that means those children get up and have nobody to speak on their behalf and have nobody to visit them and nobody to make sure they are not hurt, harmed or endangered again .\" A basket with 201 flowers was placed inside a lookout pavilion overlooking a pond at the park. Following the service, attendees tossed flowers into the pond in remembrance of children without representation. Additionally, area judges and program directors spoke and there were performances from the Macedonia Missionary Baptist Church children's choir, Jeilani Champion and Dr. <mark>Linda Smith</mark>. \"Doing from my heart' Crestview resident Malcolm Parker said Sunday's event taught him a lot about the issue .\" It opened my eyes a little bit, \"he said .\" You don't always pay attention to what's going on with the children in the community. \"Parker said he's considering volunteering and wants to help spread the word. Tammy Hillsman, who has worked with Guardian for the past eight months, said she enjoys speaking on the children's behalf .\" I just want to be there because whatever situation we step in to, it's a tragedy from the very beginning, \"she said .\" I'm basically there to help them get through it. \"Hillsman said she is working on two cases involving four children. On average, she handles two cases at a time, she said. The workload is never a burden, she said .\" They try not to overwhelm you; they start you off slow \"Hillsman said. And it's fulfilling, she said .\" I'm doing from my heart - I don't want to get paid for it, \"Hillsman said .\" I'm just doing it for those children. \"Want to volunteer? Prospective Crestview Guardian Ad Litem volunteers can call 689-5060. Learn more about the program at guardianadlitem.org. Contact News Bulletin Staff Writer <mark>Matthew Brown</mark> at 850-682-6524 or matthewb @ crestviewbulletin.com. Follow him on Twitter @ cnbMatthew.", "articleID": "2013050201_00004253_W", "names": {"Linda Smith": ["Q16885749", "Q3241375", "Q435239", "Q57744472"], "Matthew Brown": ["Q16205624", "Q22323679", "Q3852260", "Q38801557", "Q48869864"]}}, {"date": "2013-05-03", "url": "http://www.bellinghamherald.com/2013/05/03/2993545/ri-now-10th-state-to-allow-gay.html#storylink=rss", "content": "PROVIDENCE, R.I. - Rhode Island has become the nation's 10th state to allow gay and lesbian couples to wed, after a 16-year effort to extend marriage rights in this heavily Roman Catholic state. Gays, lesbians, their friends and families erupted into cheers Thursday following a final 56-15 vote in the Rhode Island House, and then again an hour later when Gov. Lincoln Chafee signed the bill into law on the Statehouse steps. \"Democracy feels good, doesn't it?\" said House Speaker Gordon Fox, D-Providence, who is gay. Fox struggled to keep his composure as he addressed the crowd at the Statehouse, looking over at his longtime partner, Marcus LaFond. \"This tells me our relationship does matter. It means that we mean something .\" The first marriages will take place Aug. 1, when the new law takes effect. The day was bittersweet for Deborah Tevyaw, whose wife, state corrections officer <mark>Pat Baker</mark>, succumbed to lung cancer two years ago. Months before she died, <mark>Baker</mark>, relying on an oxygen tank, angrily told lawmakers that it was unfair that Tevyaw wasn't considered her wife in Rhode Island despite their marriage in Massachusetts. \"I'm ecstatic, but sad she's not here to see this,\" Tevyaw said. \"I'm sure she's watching, but she's not here next to me. Before she died, she told me,' I started this, and now I'm leaving it in your hands .' We worked hard for this. There were petitions, door knocking, phone calls. I think people decided,\" just let people be happy .' \"Once consigned to the political fringe, gay marriage advocates succeeded this year thanks to a sprawling lobbying effort that included support from organized labor leaders, religious clergy, leaders including Chafee and Providence Mayor Angel Taveras and hundreds of volunteers. Their efforts overcame the opposition of the Roman Catholic Church and lawmakers including Senate President <mark>Teresa Paiva</mark> Weed, who voted no but allowed the issue to come to a vote anyway. Supporters framed the issue as one of civil rights, arguing in daylong legislative hearings that gay and lesbian couples deserve the same rights and protections given to opposite-sex married couples. The Catholic Church was the most significant opponent, with Bishop Thomas Tobin urging lawmakers to defeat what he called an\" immoral and unnecessary \"change to traditional marriage law. On Thursday, Tobin repeated his opposition, writing in a letter to the state's Catholics that\" homosexual acts are...always sinful. \"\"Catholics should examine their consciences very carefully before deciding whether or not to endorse same-sex relationships or attend same-sex ceremonies,\" Tobin wrote. \"To do so might harm their relationship with God .\" The Rhode Island legislation states that religious institutions may set their own rules regarding who is eligible to marry within the faith and specifies that no religious leader is obligated to officiate at any marriage ceremony and no religious group is required to provide facilities or services related to a gay marriage. While ministers already cannot be forced to marry anyone, the exemption helped assuage concerns from some lawmakers that clergy could face lawsuits for abiding by their religious convictions. Under the new law, civil unions will no longer be available to same-sex couples as of Aug. 1, though the state would continue to recognize existing civil unions. Lawmakers approved civil unions two years ago, though few couples have sought them. The first marriages will take place Aug. 1, when the new law takes effect. Raymond Beausejour, 66, used to photograph weddings, but the gay North Providence man never expected he would have one himself. \"I've been waiting 32 years for this day, and I never thought it would come in my lifetime,\" said Beausejour, who has been with his partner for 32 years. \"For the first time in my life, I feel welcome in my own state .\" Delaware could be the next state to approve gay marriage. Legislation legalizing same-sex marriage has narrowly passed the Delaware House and now awaits a vote in the state Senate. Advocates in Rhode Island say that while they're proud the state is the 10th to legalize gay marriage, they expect other states to quickly follow as support for gay marriage grows around the country. According to polling experts at Gallup, 53 percent of Americans support giving gay and lesbian couples the right to marry, up from 27 percent in 1996. Rep. Frank Ferri, D-Warwick, who lobbied for gay marriage before becoming a lawmaker himself, recalled that years ago he asked a sitting lawmaker if he would consider supporting same-sex marriage. \"He said\" I'll pour gasoline on my head and light myself on fire before that bill passes,' \"Ferri recalled. That has changed, said Ferri, who is gay. Ferri said he hopes Fox can marry him and his partner on Aug. 1, which also happens to be the couple's 32nd anniversary .\" Today a dream has come true, \"he said .\" No more hiding in the shadows. No more being ashamed of who we are. \"ANALYST Lummi Natural Resources> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013050318_00045817_W", "names": {"Pat Baker": ["Q16105028", "Q7143202"], "Teresa Paiva": ["Q18857593", "Q42795317"]}}, {"date": "2013-05-04", "url": "http://www.rockymounttelegram.com/opinion/columnists/john-hood-unemployment-improvement-reflects-well-gop-1971655", "content": "Gail Collins: In South Carolina, the \"luv guv' makes his last stand Scott Mooneyham: A minor league system would address what ails college sports Maureen Dowd: The president has a responsibility to nudge Congress Thomas Friedman: Fayyad's transparent leadership a rarity among Palestinians <mark>David Brooks</mark>: Health care reform - and its frustrations - are here to stay <mark>John Hood</mark>: After 100 days in office, McCrory has become Gov. Fix-It\" People generally quarrel, \"G.K. Chesterton once wryly observed,\" because they cannot argue. \"To the extent North Carolina politics looks increasingly quarrelsome at the moment, it is because of a breakdown of argument - of constructive debate among people of good faith who happen to disagree on public policy. Instead, traditional and online media alike are filled with venom, personal attacks, conspiracy theories and overall boorishness. The Republicans now in power in Raleigh campaigned for and won their offices on the basis of specific policy promises. They promised to reform North Carolina's decrepit, anti-competitive tax code and regulatory process. They promised to reduce government spending on bloated transfer programs and pork-barrel schemes in order to free up resources for core public services and tax relief. They promised not to hasten the implementation of what they perceive as the disastrously counterproductive Affordable Care Act. And they promised to enact a voter identification bill. For the most part, GOP lawmakers and the new Pat McCrory administration have delivered on these promised policies, or are in the midst of doing so. They deserve no deference simply because they are currently in power. Our political system doesn't work that way. The public deserves a debate about these proposals (and Republicans ought to welcome it as a means of sharpening their own arguments). There's an important distinction, however, between spirited debate and character assassination. Republicans don't favor tax cuts, regulatory reform, energy exploration or school choice because some shadowy special interest group has paid them off. Republicans favor these ideas because they believe them to be good public policy. They believe cutting taxes and reforming regulations will improve the state's economy in the short run and that energy exploration and school choice will improve the state's economy in the long run by upgrading physical and human capital. Republicans have believed these things for a very long time - way before they were in the majority and showered by special interest cash and attention. The Republicans could be mistaken, of course. Their critics ought to construct valid arguments to that effect. Some do. But others have chosen to question the Republicans' intentions, honesty or sanity. Why? One reason is that such tactics get attention. They generate online traffic and checks from true believers (this dynamic is evident on both sides of the aisle). Another reason, however, is that consequentialist arguments against the GOP agenda are premature. On the top issue facing North Carolina, economic growth, it is difficult to argue that Republican policies have failed when they are, at most, two years old. Moreover, the state's economy is performing better today than it was when the GOP captured the legislature in 2010, creating an obvious rhetorical challenge for the party's critics. In December 2008, North Carolina's unemployment rate was 8.4 percent. Over the next two years, the jobless rate skyrocketed and then fell slightly, to 10.5 percent in December 2010. On the broader measure of unemployment and underemployment, North Carolina averaged 17.4 percent in 2010, up from 11.3 percent in 2008. During the same two-year period, the state's economy shed a net 158,000 jobs. Since the end of 2010, by contrast, the state's economy has added some 157,000 net new jobs. As of March 2013, the jobless rate has fallen to 9.2 percent and the broader rate to 16.2 percent - still high rates (partly because of continued migration of job seekers to North Carolina) but on a downward trajectory. It would be unwise for legislative Republicans to claim credit for this modest but welcome improvement in North Carolina's economic momentum. There are many factors at work. Still, it would be even more unwise - and unpersuasive - for their critics to try to construct an empirical argument against the state GOP's economic policies in light of these statistics. Look Up Opinion Now Define Words Quickly-Free Download!", "articleID": "2013050505_00061620_W", "names": {"David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"], "John Hood": ["Q19325421", "Q30603484", "Q56597744", "Q6239743"]}}, {"date": "2013-05-06", "url": "http://www.sys-con.com/node/2646233", "content": "May 6, 2013 / PRNewswire /--Stone Energy Corporation (NYSE: SGY) today announced financial and operational results for the first quarter of 2013. Some of the highlights include: Two deep water drilling rig contracts were secured for the Stone operated projects in the proximity of its Pompano platform. The Diamond Ocean Victory is scheduled to drill the Amethyst exploration prospect starting in September 2013 and an ENSCO 8500 series rig is anticipated to commence drilling the Cardona and Cardona South development wells starting in the first quarter of 2014. Production volumes slightly exceeded the upper end of first quarter guidance. In Appalachia, volumes have been substantially restored from the third party pipeline interruptions which affected production from January through April 2013. Stone Energy Corporation was awarded the prestigious Safety in Seas Award from the National Ocean Industries Association. Stone Energy was recognized for innovative safety leadership in pioneering a new decommissioning method which resulted in a four-fold increase in the volume of work with zero OSHA recordable incidents. Chairman, President and Chief Executive Officer <mark>David Welch</mark> stated, \"We have taken a significant step in our deep water efforts by securing the Diamond Ocean Victory rig and the ENSCO 8500 series rig. The rigs will be used to drill the Amethyst exploration prospect and the Cardona and Cardona South development wells. If successful, these wells will be produced through the Stone-operated Pompano deep water platform, with Cardona and Cardona South production projected for late 2014 and Amethyst production projected for 2015. In addition to our Stone-operated deep water program, we plan to accelerate our participation in non-operated deep water wells with 5-7 exploration prospects being drilled in 2013 and 2014. In our liquids rich Deep Gas area, initial production from the third well at La Cantera is projected by June 2013 and is expected to increase gross field volumes to over 100 MMcfe per day (over 25 MMcfe per day net). In Appalachia, third party pipeline repairs around our Mary field have been made, allowing Marcellus net volumes to reach over 60 MMcfe per day again. Our conventional shelf drilling program for 2013 will start in May with several low risk development wells scheduled in the second and third quarters. Finally, with over $400 million credit facility and cash flow from operations, we are well positioned to fund our 2013 capital program .\" Financial Results For the first quarter of 2013, Stone reported net income of $0.82 per share, on oil and gas revenue of $232.9 million, compared to net income of $51.0 million, or $1.04 per share, on oil and gas revenue of $244.1 million in the first quarter of 2012. Discretionary cash flow totaled $159.1 million during the first quarter of 2013, as compared to $175.1 million during the first quarter of 2012. Please see \"Non-GAAP Financial Measures\" and the accompanying financial statements for a reconciliation of discretionary cash flow, a non-GAAP financial measure, to net cash flow provided by operating activities. Daily production during the first quarter of 2013 averaged 40.1 thousand barrels of oil equivalent (MBoe) per day (241 million cubic feet of gas equivalent (MMcfe) per day), compared with daily production of 45.0 MBoe (270 MMcfe) per day in the fourth quarter of 2012, and daily production of 41.0 MBoe (246 MMcfe) per day in the first quarter of 2012. First quarter of 2013 production was negatively impacted by third party pipeline interruptions in Appalachia. First quarter of 2013 production mix was 46% oil, 6% natural gas liquids (NGL), and 48% natural gas. Prices realized during the first quarter of 2013 averaged $42.49 per barrel of NGLs and $3.17 per Mcf of natural gas. Average realized prices for the first quarter of 2012 were $67.26 per barrel of NGLs and $2.41 per Mcf of natural gas. Effective hedging transactions increased the average realized price of natural gas by $0.38 per Mcf and increased the average realized price of oil by $2.72 per barrel in the first quarter of 2013. Effective hedging transactions increased the average realized price of natural gas by $0.48 per Mcf and decreased the average realized price of oil by $3.13 per barrel in the first quarter of 2012. Lease operating expenses during the first quarter of 2013 totaled $14.70 per Boe or $2.45 per Mcfe), compared to $11.93 per Boe or $1.99 per Mcfe), in the first quarter of 2012. Depreciation, depletion and amortization (DD & A) on oil and gas properties for the first quarter of 2013 totaled $20.65 per Boe or $3.44 per Mcfe), compared to $22.48 per Boe or $3.75 per Mcfe), in the first quarter of 2012. Salaries, general and administrative (SG & A) expenses for the first quarter of 2013 were $3.87 per Boe or $0.64 per Mcfe), compared to $3.68 per Boe or $0.61 per Mcfe), in the first quarter of 2012. Capital expenditures before capitalized SG & A and interest during the first quarter of 2013 were approximately $14.9 million of plugging and abandonment expenditures. Additionally, $6.6 million of SG & A expenses and $10.0 million of interest were capitalized during the first quarter of 2013. May 6, 2013 we had no outstanding borrowings under our bank credit facility. In addition, Stone had letters of credit totaling $379.0 million available for borrowing based on a borrowing base of $400 million. The borrowing base was reaffirmed at April 30, 2013. Operational Update Mississippi Canyon 26 - Amethyst (Deep Water). Stone has contracted the Diamond Ocean Victory deep water drilling rig for Stone's Amethyst oil exploration prospect at Mississippi Canyon 26. The deep water Amethyst exploration well is currently scheduled to spud late in the third quarter of 2013. Stone is the operator of the well and currently holds a 100% working interest, although expects to reduce its working interest in the prospect. The well is estimated to take four months to drill. Pompano Area - Cardona and Cardona South Prospects (Deep Water). Stone has contracted an ENSCO 8500 series dynamically positioned deep water drilling rig for Stone's Cardona oil development program at Mississippi Canyon 29. Drilling on the Cardona well is expected to commence in the first quarter of 2014 followed by the drilling of the Cardona South well. Stone plans to tie back both wells to the 100% owned Pompano platform with production projected for late 2014. Stone holds a 65% working interest in the Cardona wells and will be the operator. Each well is estimated to take three to four months to drill. Mississippi Canyon 983 - San Marcos (Deep Water). The deep water San Marcos exploration well is currently scheduled to spud late in the third quarter of 2013. Stone currently holds a 25% working interest in the prospect, which is operated by Apache. The well is estimated to take four months to drill. Mississippi Canyon 555 - Guadalupe (Deep Water). The deep water Guadalupe exploration well is currently scheduled to spud in late 2013 or early 2014. Stone currently holds a 40% working interest in the prospect, which is operated by Apache. The well is estimated to take four months to drill. Deep Water). The deep water Taggert exploration well is currently planned to spud in the second half of 2013. Stone currently holds a 23% working interest in the prospect, which is operated by LLOG. The well is estimated to take two months to drill. Deep Water). The deep water Phinisi exploration well is now projected to spud either in the fourth quarter of 2013 or the first half of 2014. Stone currently holds a 20% working interest in the prospect, which is operated by ENI. The well is estimated to take four months to drill. La Cantera (Deep Gas). The third well in the La Cantera field, the Broussard #1 ST #1, has been successfully drilled to 18,000 feet and is currently in completion operations with first production expected by June 2013. Combined with the first two wells, gross production from this field is projected at over 100 MMcfe per day (over 25 MMcfe per day net) when the third well commences production. Stone holds a 34.6% non-operated working interest in the field. Appalachian Basin (Marcellus Shale). Stone drilled 9 and completed 8 horizontal wells in the first quarter, and plans to drill and complete 28 to 32 horizontal wells in Appalachia in 2013. First quarter net volumes were negatively impacted by approximately 20 MMcfe per day as a result of third party pipeline failures and unscheduled gas processing plant outage. The Williams pipeline has been repaired and production is being restored, although there remain some pressure restrictions on volumes. Production is expected to increase as 11 recently completed wells in the Heather field (50% working interest) are brought on production. Appalachia is currently producing approximately 60 to 70 MMcfe per day, net. Conventional Shelf. The ENSCO 81 jack-up rig is expected to begin drilling on a three to four well conventional shelf/deep gas drilling program in May 2013. Stone expects to drill the Hammerlock oil prospect located on South Timbalier 100, followed by the Taildancer and Coracle oil prospects located on Ship Shoal 113. The Parker 50B inland barge rig spudded the Stone-operated Hyena prospect in the Clovelly field in April 30, 2013. Stone holds a 94% working interest in the Hammerlock prospect and a 100% working interest in Taildancer, Coracle, and Clovelly prospects. Other Information Stone Energy has planned a conference call for Tuesday, May 7, 2013 to discuss the operational and financial results for the first quarter of 2013. Anyone wishing to participate should visit our website at www.StoneEnergy.com for a live web cast or dial 1-877-228-3598 and request the \"Stone Energy Call .\" If you are unable to participate in the original conference call, a replay will be available immediately following the completion of the call on Stone Energy's website. The replay will be available for one month. In addition, as previously announced, Stone Energy will hold its 2013 Annual Meeting of Stockholders on 10:00 a.m. Central Time at the Windsor Court Hotel, 300 Gravier Street, New Orleans, Louisiana. The Company proposes to elect ten directors, to ratify the appointment of Ernst & Young LLP as the Company's independent public accounting firm for the fiscal year ending December 31, 2013, to have a non-binding advisory vote on the compensation of the named executive officers (say on pay), and to transact such other business as may properly come before the meeting. The close of business on March 25, 2013 has been fixed as the record date for determination of stockholders entitled to receive notification of and to vote at the Annual Meeting. Non-GAAP Financial Measures In this press release, we refer to a non-GAAP financial measure we call \"discretionary cash flow .\" Management believes discretionary cash flow is a financial indicator of our company's ability to internally fund capital expenditures and service debt. Management also believes this non-GAAP financial measure of cash flow is useful information to investors because it is widely used by professional research analysts in the valuation, comparison, rating and investment recommendations of companies in the oil and gas exploration and production industry. Discretionary cash flow should not be considered an alternative to net cash provided by operating activities or net income, as defined by GAAP. Please see the \"Reconciliation of Non-GAAP Financial Measure\" for a reconciliation of discretionary cash flow to cash flow provided by operating activities. Forward Looking Statements Certain statements in this press release are forward-looking and are based upon Stone's current belief as to the outcome and timing of future events. All statements, other than statements of historical facts, that address activities that Stone plans, expects, believes, projects, estimates or anticipates will, should or may occur in the future, including future production of oil and gas, future capital expenditures and drilling of wells and future financial or operating results are forward-looking statements. Important factors that could cause actual results to differ materially from those in the forward-looking statements herein include the timing and extent of changes in commodity prices for oil and gas, operating risks, liquidity risks, political and regulatory developments and legislation, including developments and legislation relating to our operations in the Gulf of Mexico and Appalachia, and other risk factors and known trends and uncertainties as described in Stone's Annual Report on Form 10-K and Quarterly Reports on Form 10-Q as filed with the SEC. Should one or more of these risks or uncertainties occur, or should underlying assumptions prove incorrect, Stone's actual results and plans could differ materially from those expressed in the forward-looking statements. Estimates for Stone's future production volumes are based on assumptions of capital expenditure levels and the assumption that market demand and prices for oil and gas will continue at levels that allow for economic production of these products. The production, transportation and marketing of oil and gas are subject to disruption due to transportation and processing availability, mechanical failure, human error, hurricanes and numerous other factors. Stone's estimates are based on certain other assumptions, such as well performance, which may vary significantly from those assumed. Delays experienced in well permitting could affect the timing of drilling and production. Lease operating expenses, which include major maintenance costs, vary in response to changes in prices of services and materials used in the operation of our properties and the amount of maintenance activity required. Estimates of DD & A rates can vary according to reserve additions, capital expenditures, future development costs, and other factors. Therefore, we can give no assurance that our future production volumes, lease operating expenses or DD & A rates will be as estimated. Stone Energy is an independent oil and natural gas exploration and production company headquartered in Lafayette, Louisiana with additional offices in Houston and Morgantown, West Virginia. Our business strategy is to leverage cash flow generated from existing assets to maintain relatively stable GOM shelf production, profitably grow gas reserves and production in price-advantaged basins such as Appalachia and the Gulf Coast Basin, and profitably grow oil reserves and production in material impact areas such as the deep water GOM and onshore oil. For additional information, contact Published May 6, 2013 Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. Niklas Bjorkman wrote: Firstly I agree with your conclusion. NewSQL takes the best of the traditional databases and NoSQL databases to combine the benefits of both worlds. I do not agree that NewSQL vendors focus on giving scale-out features to transactional data. The NewSQL market is focusing on giving true ACID support combined with extreme performance, stepping away from the traditional relational structures in databases. A lot of developers appreciate the ease of accessing data using SQL and I think we will see more and more databases supporting standard SQL. As you said - NewSQL databases often maintain the...Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to New York and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in June at Cloud Expo New York. Cloud Expo was announced on February 24, 2007, the day the term \"cloud computing\" was coined. That same year, the first C loud Expo t ook place in New York City with 450 delegates. Next June, Cloud Expo is returning to New York with more than 10,000 delegates and over 600 sponsors and exhibitors. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Conference & Expo on June 10-13, 2013 - is to ensure - through an intensive four-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Javits Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in New York City June 10-13, and maximize those benefits already in 2013. See you in New York City! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in New York City Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2013050703_00020633_W", "names": {"Carmen Gonzalez": ["Q5043478", "Q9697469"], "David Welch": ["Q16193927", "Q27913581", "Q42174943", "Q5240945", "Q5240946", "Q5240947"]}}, {"date": "2013-05-09", "url": "http://hawaiitribune-herald.com/sections/sports/procollege/hit-liner-happ-says-?i-feel-really-fortunate?.html", "content": "Associated Press ST. PETERSBURG, Fla. - J.A. Happ isn't sure how he'll react when gets on a mound again. One thing he does know is that he's going to try to forget what happened Tuesday night. Toronto's 30-year-old left-hander returned to Tropicana Field on Wednesday, less than 24 hours after he was struck on the head by a line drive that sent him to a hospital for an overnight stay. Happ expects to make a full recovery from a skull fracture behind the left ear that doctors believe will heal on its own, adding he doesn't anticipate having any fear of returning to work. \"I think you've just got to get back out there and try to forget about it,\" he said. \"I won't know until I'm out there, but I don't anticipate it being a problem .\" He's not sure when he'll get the opportunity. The pitcher sprained his right knee when he dropped to the ground Tuesday night, and that could affect how soon he'll be ready to pitch again. Happ realizes his injuries could have been worse. \"I feel really fortunate,\" he said after limping into the auxiliary clubhouse for a news conference and climbing a couple steps to sit behind a microphone. \"It looks like I moved just a little bit. I don't remember doing that, but it looks like it was just enough to where it must have caught me in a better spot, because I think it could have got me head on,\" he said. \"I've got some stitches and there's a fracture in the skull, I suppose, behind my ear, but it's not serious or threatening. We'll let those heal .\" Happ, who was put on the 15-day disabled list, had a brief conversation with Tampa Bay's Desmond Jennings, who hit the line drive that caught him squarely on the left side of the head. Happ shook hands with several teammates outside the Blue Jays clubhouse while assuring each one: \"I'm fine .\" \"He just wished me the best and hoped for a quick recovery,\" Happ said. \"Obviously, something like that is never intentional. I let him know that I knew that and I appreciated him coming over. It's a scary thing, I'm sure on his end, too .\" When Jennings arrived at the ball park he was relieved to learn from one of the Rays' trainers that Happ appeared to be OK. \"That enabled me to breathe a little bit,\" Jennings said. \"But you still don't know until you talk to him, until you see him face to face .\" Happ remembers releasing the ball, as well as teammates talking to him while he received medical attention on the field. \"I don't remember seeing it,\" he said. \"Just immediate loud ringing in my ear. Just pressure on my ear, and I was on the ground. That was kind of it. It took me a few seconds to kind of figure out what was going on, but I do remember them being there...the coaches and Gibby (manager <mark>John Gibbons</mark>) and obviously the trainers. I was coherent and talking pretty quickly .\" He also called his mother while an ambulance was transporting him to nearby Bayfront Medical Center. \"They were holding the phone up to my ear for me ....She was definitely relieved, glad to hear my voice,\" Happ said. The hit, still being replayed on TV a day later, left some of his fellow players unsettled. \"I felt horrible yesterday. I played with Happ last year for a little bit,\" Chicago Cubs pitcher <mark>Carlos Villanueva</mark> said. \"There's a lot of talk out there about the gear and protective stuff. Hopefully, they'll come out with something that won't affect us pitching out there, but it's still such a fast game. What happens if the ball comes directly at your face? There's nothing you can do. You can't pitch with a mask on. It just comes down to the draw of the luck I guess .\" Major League Baseball, meantime, is trying to determine the best way to protect pitchers from similar injuries. The league's senior vice president, Dan Halem, said a half-dozen companies were designing headgear for pitchers but no product so far was sufficiently protective and comfortable. \"If it doesn't absorb enough impact, then it may be ineffective,\" he said. Dr. <mark>Gary Green</mark>, MLB's medical director, said the Head Injury Criterion (HIC) scale is being used to evaluate products and that a cap liner likely would have to be 8 ounces or lighter. \"We've found some things that are very lightweight, but they're not very protective, and then other things that might be protective but they are too heavy and don't meet the other specifications,\" he said. <mark>Robert Vito</mark>, president of Pennsylvania-based Unequal Technologies Co., said a patent had been submitted for a product he hopes to make available in June. <mark>Vito</mark> said his employees met with pitchers, coaches and trainers from 26 big league teams during spring training. \"My biggest concern coming from the MLB Players Association is the mirror test. When they put it on, it must be concealed protection that cannot be detected by the fan,\" he said. In testing the product, he had someone smash a Louisville Slugger bat into his chest. \"Energy is like water. It's got to go somewhere,\" <mark>Vito</mark> said. \"So the energy is either going to go into my body and devastate tissues, tendons and break ribs and crush my heart to where I'm bleeding out internally, or it's going to get absorbed into the pad and then return some of that energy to the bat, all the while protecting me .\" While Unequal has used Kevlar-based products in the past, Georgia-based Evoshield employs \"gel-to-shell\" technology. \"There is no fast and easy solution,\" Evoshield CEO Bob Pinckney said in a statement. <mark>Green</mark> said an average of two pitchers had been struck on the head by line drives during the past seven or eight seasons. \"While these things are catastrophic, they're still rare events,\" he said. Baseball stepped up its efforts after two pitchers were struck last year. Oakland's Brandon McCarthy was hit on the head by a liner last September, causing a skull fracture, an epidural hemorrhage and a brain contusion that required surgery. He was released from a hospital six days later. Detroit's Doug Fister was struck in the head by a batted ball during the World Series; he was unhurt and stayed in the game. \"I've heard a lot of pitchers say they wouldn't mind trying it. And a lot of pitchers just don't want it,\" said Tampa Bay's <mark>David Price</mark>, the reigning AL Cy Young Award winner. \"So I think the decision would still be left up to that player. If it worked and it didn't affect anything in the mound, I would definitely look into it .\" When a product is available that MLB thinks will provide protection without getting in the way, it will ask the players' association for its input. \"I guess you'd have to see some prototypes,\" Happ said. \"It would be tough .\" In the macho culture of baseball, the adoption of protective gear has been slow. While Cleveland's <mark>Ray Chapman</mark> died when he was hit by a pitch in 1920, MLB didn't make the use of helmets or protective cap inserts mandatory until the National League required them for the 1956 season. Helmets weren't required until the 1971 season and, even then, they weren't mandatory for players already in the big leagues. An earflap on the side of the head facing the pitcher was required for new players starting in 1983. Stronger and slightly heavier carbon-fiber helmets, the Rawlings S100 Pro Comp, were required starting this year. \"You can't ask a pitcher to use material that he's not comfortable with. But I'm hopeful that, much like with batting helmets, we'll figure something out that both allows the players to play without any obstruction but adds to player safety,\" union head <mark>Michael Weiner</mark> said. \"When they get close to something that they think might work, then at that point we're both going to look at it together .\" Bryce Florie doesn't see well in his right eye to this day, the result of being struck by a line drive hit by the Yankees' <mark>Ryan Thompson</mark> while pitching for Boston in September 2000. Florie returned the following year but ended his career after just seven more big league appearances. \"With the way everything is being condensed, I think it's inevitable that it's going to happen, that they're going to have something in the hat,\" Florie said. \"You'll have a hard time to get major leaguers and minor leaguers to say,\" OK, Let me try this out .' Most of them are not going to want to be the first guy. But if you talk to guys like myself and other guys that have been hit, up in the face, in the head, we'll be, \"Like yeah, I'll do it .' But then, it's kind of late .\" Rules for posting comments Comments posted below are from readers. In no way do they represent the view of Stephens Media LLC or this newspaper. This is a public forum. Comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Stephens Media LLC is not liable for messages from third parties. IP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. Do not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity. Online Extra: Warriors unfazed in taking Division II title Man pleads no contest in peeping Tom cases", "articleID": "2013050917_00081986_W", "names": {"Carlos Villanueva": ["Q2939496", "Q716965"]}}]