[{"articleID": "2017051116_00525742_W", "names": {"Nick Evans": ["Q3339740", "Q7025358", "Q7027082", "Q723355", "Q981527"]}, "date": "2017-05-11", "url": "http://www.breitbart.com/news/massive-snake-slowly-slithers-across-south-africa-golf-course/", "content": "Massive snake slowly slithers across South Africa golf course by UPI 11 May 2017 0 11 May, 201711 May, 2017 SIGN UP FOR OUR NEWSLETTER May 11 (UPI)--A massive python was spotted slinking past golfers at a golf course in South Africa on Wednesday. The KwaZulu-Natal Amphibian and Reptile Conservation shared video captured by Kyle Caitano of the enormous snake slithering toward a sand trap at the Zimbali Country Club. Conservation staff member, <mark>Nick Evans</mark>, said the giant snake was likely a Southern African Python measuring about 11 feet long and \"made of pure muscle .\" Video shows the python slowly crawling past a golfer before winding its body side to side toward a walkway after apparently becoming startled. \"Notice how, at first, it appears to move a bit like a slug, moving in a straight line,\" <mark>Evans</mark> said. \"As you'll see towards the end of the video, when it feels threatened, it is very capable of moving rather quickly!\" <mark>Evans</mark> said the golfers were lucky to witness one of South Africa's largest snake species, which have faced dwindling numbers due to poaching. \"What an amazing encounter! Lucky golfers!\" <mark>Evans</mark> said. \"I'd definitely take up the sport if I could see this on a regular basis!\" Comment count on this article reflects comments made on Breitbart.com and Facebook. Visit Breitbart's Facebook Page. BREITBART CONNECT"}, {"articleID": "2013120607_00037057_W", "names": {"Ricky Lee": ["Q7332121", "Q9198162"]}, "date": "2013-12-05", "url": "http://www.newsletter.co.uk/sport/hockey/ulster-elks-trying-to-buck-the-trend-in-women-s-hockey-1-5726031", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online Documentary examines the \"cult' of Sinn Fein Adams: Murdered RUC officers\" disregarded safety' Parade organiser silent on next stage of protest activity Unionists reject Haass's proposal for a new Northern Ireland flag Why I'd still write this even if I knew it would provoke a riot Inquiry finds Garda-IRA collusion in RUC murders City hall flag issue continues to divide our politicians Adams: Murdered RUC officers \"disregarded safety' Adams slammed over bid to blame victims Unionists reject Haass's proposal for a new Northern Ireland flag Ulster Elks trying to buck the trend in women's hockey The Ulster Elks went the extra mile on Saturday in more ways than one when they sacrificed home advantage to host Lisnagarvey in an Irish Senior Cup second round clash at the Glade. Normally the Elks play their home games on their own patch at the University of Ulster Jordanstown but it proved to be a low risk strategy as they won the game 4-1. Although it was an all Ulster affair <mark>Ricky Lee</mark> and his team did their utmost to make the occasion a bit special and they deserve immense credit for doing so but more on that later. I hadn't been to Mossley's headquarters for more than a decade and, although I didn't mention it at the time, I was somewhat puzzled when our intrepid photographer Rowland White said to me\" you can't miss it, it's right beside the railway station \".\" What railway station? \"I asked myself. There was no such station on my last visit as it was so long ago, but some things never change and after getting there in good time I was greeted by some familiar faces at the entrance to the club house. Club stalwarts Harry Burns, Bertie Moore and Dougie Sleith were all there and three proud men they were as they chatted about the new club house and pitch which had, a week previously, hosted the boys under 16 and under 18 inter-pros and in March a series of women's internationals. But one comment from Dougie set me thinking .\" Visiting players don't stay around any more - they just arrive in their track suits and go away in them. \"But back to the Elks and they made a tremendous effort to make the occasion a special one although they were less welcoming on the pitch as\" Garvey will testify to. I was amazed to see half a dozen ball girls lined up around the pitch and all of them were wearing Elks gear under several other layers as they kept warm. Music blared out over the PA System before the start, at half time and at the end of an excellent game of hockey watched by a big crowd. It's a very user friendly club house as spectators who don't wish to brave the cold can watch in comfort from an elevated position with their favourite tipple in hand. After the game the Elks had laid on a meal for both teams and umpires, again to enhance the sense of occasion. But such occasions are, sadly, all too rare outside the two all Ireland competitions when visiting teams who have often travelled long distances are fed and watered as a matter of course. Also present at Saturday's game was Randalstown co-captain Louise Creighton, who was manning the club shop. She, too, laments the fact that it just isn't the same any more as far as the camaraderie between teams at domestic level is concerned. \"In the men's game opposition teams tend to make an effort to come in for a drink but I suppose in the women's game, it's because a lot of us don't have club houses and many teams play at Leisure Centres .\" she explained. \"Back in the old days we went back to the rugby club in Randalstown. Often then there were a lot of players from the surrounding area and (local) players were brought up through the club .\" Nowadays though there are a lot more school kids playing on women's teams and they often have Ulster or Irish training the next day. \"The pressure on these kids is immense and, quite, honestly I don't know how they do it .\" Due to work commitments I had to decline Louise's invitation to stay for some hospitality at Mossley's palatial club house and instead I headed to my normal base at Queen's Sport to put pen to paper, or more accurately, fingers to keyboard. The place was buzzing as players from opposing sides were sitting down to sandwiches and stew and enjoying each other's company in the club house which, like Mossley's, is superbly appointed. But it was the footballers of Queen's University and Glebe Rangers who were enjoying the \"craic' and there wasn't a hockey player in sight. Queen's Football Club always make a point of entertaining visiting teams although I am not sure if it is a widespread phenomenon outside of Upper Malone. But I know, from experience on other Saturday afternoons that it also applies to rugby when players and supporters from Queen's and their opposition are seen mingling together after matches. As dusk fell the footballers from both teams said their\" cheerios' and went their separate ways while I continued my work and it was one of those \"last out, please turn the lights out' occasions. However the bar would have remained open had any one else wanted to sample it's contents or merely sit around and have a chat in the club house. As I left, as if to illustrate the point, two women's hockey teams were trudging off one of the pitches and both sets of players headed straight for their cars without even considering the possibility of even the briefest bit of socialising. So well done to the Ulster Elks for trying to break the norm and making Saturday's Cup game a special occasion and to Mossley for their offer of hospitality - I will take it up next time and leave the lap top at home. Try the News Letter app for 30 days free! View the latest news and sport or download full editions of the newspaper to read offline. Search for News Letter in your Android or iOS app store today. Newspaper subscribers get free unlimited access to the app. Contact us If you wish, you can contact us using any of the methods below. Ground floor, Metro Building 6-9 Donegall Sq South clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Belfast Newsletter provides news, events and sport features from the Belfast area. For the best up to date information relating to Belfast and the surrounding areas visit us at Belfast Newsletter regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads? Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Webtrends / Google Analytics? This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers? This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore? ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting? Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot? We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online? Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This? Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2019120413_00062087_W", "names": {"Jimmy White": ["Q27942290", "Q366681", "Q6201553", "Q6201558"]}, "date": "2019-12-04", "url": "http://www.maldonandburnhamstandard.co.uk/uk_national_sport/18079177.osullivan-cruises-last-16-despite-running-injury/", "content": "National Sport News O'Sullivan cruises into last 16 despite running injury By Sportsbeat staff O'Sullivan cruises into last 16 despite running injury Five-time world champion Ronnie O’Sullivan admitted a recurring foot injury was affecting his credentials at the table despite cruising into the Betway UK Championship last 16. The 43-year-old hadn't dropped a frame en route to a third-round clash with Thailand's Noppon Saengkham, and continued his comfortable progression at the first Triple Crown event of the season with a 6-2 win over his world No. 32 opponent. But while O’Sullivan safely continued his journey toward the defence of his crown--in what would be a record eighth win at the York Barbican--he explained an old running injury was threatening his ongoing performances. \"My foot's in a lot of pain,\" he said. \"I've had problems with it for ages and I've been trying to rest it but running's something I really love and I'm not prepared to stop forever .\" I can feel it in the arena and it affects my back, but I'll just have to manage it, not run on the days I'm not playing and hopefully it'll be OK. \"It was an enjoyable game against Noppon. The conditions were hard, and it was quite difficult to score and get in amongst the balls .\" The table played a lot easier in the first two rounds which made it harder but I quite enjoyed the challenge out there and I'm pleased to get through. \"With Judd Trump having been knocked out by veteran Nigel Bond on Monday, O’Sullivan has emerged as the outright favourite to lift the trophy, but he insisted anyone left in the tournament is capable of winning on their day. And with a mouth-watering match-up against two-time UK Championship winner Ding Junhui next up, the Londoner is confident he and his counterpart can produce a snooker spectacle for fans around the world. He said:\" There should be a lot of people watching that match--here and in China. I have a good following in China and I love my time out there so it should be good fun. \"Ding seems to be playing well. I haven't been taking too much notice and I just take care of my own business, but he's been beating some good players so I'm sure it'll be a tough test .\" The tournament changes as it goes on and the main arena reduces to two tables. It's going to be a good occasion, for sure. \"Watch the UK Championship live on Eurosport and Eurosport Player with analysis from Ronnie O’Sullivan and <mark>Jimmy White</mark>."}, {"articleID": "2011081719_00094906_W", "names": {"Mike Adams": ["Q1394381", "Q1926746", "Q1933021", "Q2033463", "Q21004722", "Q30234135", "Q3857347", "Q6845832", "Q6845834", "Q6845836", "Q6845838"]}, "date": "2011-08-17", "url": "http://tinymixtapes.com/news/mount-eerie-announces-phil-elverum-super-great-tour-probably-because-phil-elverum-super-great", "content": "phil elverum is great. we can all agree. if you like the works of mount eerie/the microphones, then you already know that he is great. if you do not like the works of mount eerie/the microphones, then look into the closest mirror and slap yourself with your right hand. there, now you know that phil elverum is great. because phil elverum is great, it would be similarly great if he went on tour with mount eerie. fantastic (read: great) news everybody, mount eerie is going on tour! prepare for your eardrums to be crushed by chunks of blistering guitar. prepare for aforementioned eardrums to be subsequently strained through attempts at hearing whispered vocals and the world's most lightly strummed guitar. it's not just a party for you, it's a party for your ears. many of these upcoming mount eerie dates will also feature appearances from drone-metal kings earth. you may know earth from the fountains of praise bestowed on them from this very website. and those fountains of praise may seem familiar simply because they resemble the fountains of praise we employ for the purpose of telling phil elverum that he is great. if neither band performs in front of a banner reading \"tiny mix tapes luvs u 4ever,\" then mistakes are being made. it's a thing that they could do, as well as a thing that they should do. mount eerie dates: 09.03.11 - missoula, mt - zoo city apparel * 09.05.11 - minneapolis, mn - cedar cultural center * & 09.06.11 - chicago, il - berry united methodist church * ^ 09.08.11 - asheville, nc - the grey eagle% 09.09.11 - raleigh, nc - hopscotch festival 09.10.11 - athens, ga - caledonia% 09.11.11 - atlanta, ga - the earl% 09.12.11 - huntsville, al - flying monkey% 09.13.11 - birmingham, al - bottletree% 09.14.11 - new orleans, la - one eyed jacks% $09.16.11 - memphis, tn - hi-tone cafe% 09.17.11 - nashville, tn - the end% 09.18.11 - gressnboro, nc - legitimate business * 09.19.11 - charlottesville, va - uva chapel * 09.21.11 - brooklyn, ny - 210 kent * 09.22.11 - boston, ma - pozen center at mass art * 09.23.11 - waltham, ma - brandeis university * 09.24.11 - biddeford, me - the oak & ax * 09.25.11 - purchase, ny - suny purchase * 09.26.11 - new york, ny - le poisson rouge * 09.27.11 - philadelphia, pa - first unitarian church * 09.28.11 - braddock, pa - carnegie library * 09.29.11 - gambier, oh - kenyon college * 09.30.11 - bloomington, in - russian recording * #10.01.11 - st. louis, mo - pig slop studios * 10.02.11 - lincoln, ne - drift station * * nicholas krgovich & andrew broder ^ cains & abels% earth $thou #<mark>mike adams</mark> at his honest weight, stagnant pools? mount eerie:"}, {"articleID": "2011061923_00057919_W", "names": {"Dan Green": ["Q19282196", "Q4119907", "Q5213603"]}, "date": "2011-06-19", "url": "http://sonic.wikia.com/index.php?title=Mephiles_the_Dark&diff=444105&oldid=prev", "content": "* mephiles was voiced by <mark>dan green</mark>, the same actor who voices [[knuckles the echidna]]. in \"sonic the hedgehog\" , he is credited * mephiles was voiced by <mark>dan green</mark>, the same actor who voices [[knuckles the echidna]]. in \"sonic the hedgehog\" , he is credited * mephiles also appears on a card in \"[[sonic rivals 2]]\" , after earning an s on knockout mode. * mephiles also appears on a card in \"[[sonic rivals 2]]\" , after earning an s on knockout mode. [[file: mephilescard.png | thumb | left | mephiles as he appears in [[sonic rivals 2]]]] [[file: mephilescard.png | thumb | left | mephiles as he appears in [[sonic rivals 2]]]] * mephiles is the only villain who has managed to kill sonic. * mephiles is the only character in sonic '06 without an official artwork * mephiles is the only character in sonic '06 without an official artwork [[sonic universe]] issue 29 where he is sitting next to an alternate version of [[void]]. he comments that [[scourge the hedgehog]] needs to lighten up when he yells at [[fiona fox]] and the [[destructix]] before leaving the no zone prison cafeteria. * \"finally, the seal has been broken! at long last, i'll be able to join with you!! iblis!\" - mephiles when iblis was freed. * \"finally, the seal has been broken! at long last, i'll be able to join with you!! iblis!\" - mephiles when iblis was freed. * \"now, chaos emerald!! it's time for the final curtain call!!!\" - mephiles using his corrupted chaos emerald to join with iblis. * \"now, chaos emerald!! it's time for the final curtain call!!!\" - mephiles using his corrupted chaos emerald to join with iblis. \"of now absorbed your power through your shadow in the past. what may have worked 10 years ago, no longer does\" ' of now absorbed your power through your shadow in the past. what may have worked 10 years ago, no longer does \"= = gallery = = latest revision as of 22:32, june 19, 2011 reptilian <mark>green</mark> with chaotic red sclera or in his shadow-like form white sclera with <mark>green</mark>, reptilian irises iblis, suffering of others, jealousy, messing with other people's minds, evil, killing, wrath, greed, chaos, destruction, himself, tricking people shadow for imprisoning him, the duke for splitting him, kindness, love, joy, justice, sonic, silver (and their friends), elise, eggman iblis fusion flight energy projection ageless immortality?) (pronounced [m? f? l? s] or [m?\" f? li? z] in english) is one of the main villains of the game sonic the hedgehog (2006). he is the conscious, mind and will of the sun god shadow the hedgehog's story, although he plays a pivotal role in all three of the game's storylines. he is a skilled manipulator, tricking silver's future. he also has a particular interest in shadow, who originally imprisoned him after his creation, and whose appearance and powers mephiles absorbed upon his release. mephiles repeatedly attempted to convince shadow to join him, but shadow refused each time. he is famous for being the only character in the various mephiles from both shadow's story, and silver's story in similar lighting. mephiles has three forms. its original form was an amorphous mass of darkness. in his second form, mephiles appears almost identical to shadow the hedgehog, aside from having <mark>green</mark> eyes with slit pupils, no visible mouth (though his muzzle moves when he speaks, as if he does have a mouth), and the fact that everything that is red on shadow is a pale powder blue on mephiles. his third and most common form was a crystalline, anthropomorphic hedgehog. in this form, he has no visible nose, mouth, or feet. edit mephiles was accidentally created during the iblis, its raw power, and mephiles, its cunning mind. mephiles was sealed in the shadow the hedgehog, who had traveled through time to ten years before the events of the game. doctor eggman somehow acquired the scepter of darkness. in the present day, the scepter was shattered during a struggle between eggman, shadow and rouge, and mephiles was released. mephiles then transformed into a copy of shadow by absorbing shadow's shadow, and in doing so absorbed shadow's powers as well. realizing that shadow did not know who mephiles was (as shadow had not yet travelled back in time to face mephiles in the past), mephiles transported shadow and rouge into the future. princess elise, in order to release the \"flames of disaster\" (a.k.a. iblis), who had been sealed inside elise's soul until she cried. mephiles intended to fuse with iblis, reuniting them into a single entity, solaris. sonic the hedgehog was the cause of iblis being released, which led to the destruction of their world. sonic was, thus, referred to as the \"iblis trigger\". he sent the two back in time, making them believe that killing sonic would save their future. along the way, as all three storylines progress, the three main characters discover how mephiles was somehow involved in the incident which created the \"flames of disaster\" , wielded by princess elise. mephiles has a very pivotal role in all of the storylines, throughout the course of the game. he has the most direct role in shadow's story. he also has a major role in silver's story, as he manipulates silver and blaze into attempting to kill sonic so that he can finally fuse with iblis. while he himself has a very minor role in sonic's story, where he is only seen when sonic, knuckles, and tails are eavesdropping on his conversation with silver and blaze that ends with them time-traveling back to present-day soleanna, his actions are still very much prevalent to sonic's story, especially with his encounters with silver. mephiles attempted to break shadow's will to fight and join him, much like black doom had, by revealing that in the current future, the world and an unwilling omega would turn against shadow and imprison him in suspended animation (mephiles keeps his hatred for shadow a secret). thus, he attempted to get shadow to join him, saying they would both get revenge on the world. however, shadow proved immune to mephiles' tactics, saying that he would determine his own destiny, leading to a battle between the two of them. though shadow took the upper-hand, mephiles knocked him into a wall with an energy blast and incapacitated him when he lowers his guard, but omega intervened and drove mephiles off. later, omega met mephiles again, who revealed to omega that he was one that would imprison shadow in the future, prompting the robot to shoot him with two miniguns. as shadow (along with silver after shadow foiled his second assassination attempt on sonic) had traveled back into the past at that point, he learned of mephiles' true nature (and silver learned that mephiles had lied about sonic being the iblis trigger). shadow, omega, and rouge later meet mephiles in the desert temple. again, mephiles offers shadow a chance to join him, but shadow, knowing mephiles' true intentions, flat-out refused the offer. mephiles was fought again and lost. after his seeming defeat, however, mephiles proved immune to being imprisoned in a new scepter of darkness that shadow tried to use on him, saying that it wouldn't work on him anymore (he implies that the reason he was immune was due to his time traveling to ten years ago, due to his line of \"the\" i \"of now absorbed your power through your shadow in the past .\" ). mephiles then uses two chaos emeralds to create an army of clones of himself. he then boasts to shadow that he can't defeat him, and asks why he is even bothering to protect a world that will eventually turn against him. shadow responds by saying, \"if the whole world decides to become my enemy, then i will fight like i always have\" , and, mirroring a similar ability from the, removes his bracelets and destroys the entire army in a massive burst of energy. in the last story, mephiles, having either escaped or simply survived the fight with shadow, finds the purple chaos emerald, uses it to warp to sonic and elise's location shortly after they escape eggman's exploding egg carrier, blinds them with the emerald's powers, and projects an energy spear that impales sonic through the back, killing him instantly. elise cries over his death and, as a result, releases iblis, allowing mephiles to fuse with him and transform into solaris (who is soon destroyed during a battle against shadow, silver and a revived sonic in super form). it is also revealed in the last story that mephiles' lie to silver and blaze about sonic being the iblis trigger was partially true: sonic is indeed the iblis trigger, but his death would not stop iblis's resurrection; in fact, his death would be the very event that would release iblis from elise's soul. the key to iblis's freedom was an event that would cause elise to become so consumed with despair or guilt that she would cry, as she had formed a very close friendship with sonic. mephiles as compared to shadow. note the color differences. oddly, mephiles' muzzle has jaged edges, but it may be due to an incomplete character model. unlike most of the villains in the sonic series, who are driven by a lust for power or revenge, mephiles (as shadow stated) only seems to crave destruction. he is portrayed as a cold, ruthless villain with no sense of compassion. he would do anything to accomplish his goals, even if it means taking innocent lives. mephiles happens to take great pleasure and delight in hurting others and has been shown to have a very warped and twisted sense of humor, making him a very sadistic and psychotic individual. for example, he made it his sole mission to cause pain to elise throughout the entire course of the game, and even broke out into a maniacal laughter after ending sonic's life. this is also seen when he taunts omega by telling him he would be reprogrammed to capture shadow. mephiles also happens to be highly intelligent, as he's capable of using and manipulating people to further his evil plans. this is shown when he preyed upon silver's frustration and desire to save the world, by deceiving him into thinking that sonic was responsible for everything, knowing that killing him would have done the exact opposite of what silver was trying to achieve. he also has nihilistic tendencies, as evidenced in his final fight against shadow, where he asks why shadow even bothers fighting at all, and why shadow even bothers defending humanity when they will inevitably persecute him later. it has also been speculated that mephiles might also be somewhat of a coward, judging from several actions he displayed throughout the game: he operated most of his plans secretively, and his main target, sonic, was almost totally unaware that he existed. he then killed sonic by impaling him through the back without warning, which usually in battle, attacking from behind is an act of cowardice. during both boss fights, mephiles hardly attacks on his own without aid, by either summoning shadows, or cloning himself to use as distractions. he uses the shadows in the first boss fight as shields, and increases the number of them when you get too close. also during the boss fights, he waits to attack you until your back is turned. he also doesn't fight you directly until you expel him from shadow's shadow. he also managed to convince silver and blaze into attempting to kill sonic before actually doing it himself, which would in turn release iblis, though there was a much stronger form of iblis already free in his time while he had a chaos emerald at hand. after he begins to lose the first boss fight, he promptly flees by opening a portal in time, and altering it before shadow and omega can jump through. in the time ten years previous to the story that takes place, when shadow corners the newly created mephiles before sealing him away, mephiles' voice sounds startled if not frightened before quickly shifting into his more recognizable tone as he makes a threat to shadow. mephiles appeared in sonic universe issue 29 as a cameo. probaly as a sign that mephiles will appear in other comics. mephiles also seems to have a habit of waving his hands when he speaks, as he's seen doing so in nearly all of his appearances, ranging from holding his hands up high while making a declaration, to holding them out to the sides slightly or even in front of himself while making himself appear as an ally to silver and blaze. mephiles also showed limited interest in people, taking particular interest in shadow, omega, silver and sonic, the latter only because he needed to kill him. mephiles is shown to hold a particular hate for shadow since it was he who sealed him in the scepter of darkness. this being said, mephiles did not acknowledge rouge, blaze or elise, whom he would have been aware of, while the rest of the game's cast did not know of him just as much as he did them. edit mephiles can manipulate and move through time with an ability similar to chaos control. his primary offensive technique is a massive sphere of black energy that is spawned from his hands that home in on their targets. he can also use the energy spheres to move himself and others through time. furthermore, he can alter his physical form to sink into the ground and merge with the shadow of another. he can also manipulate shadows to create \"clones\" of himself, although they are warped and imperfect without the power of the mephiles is also a highly skilled manipulator, as he was able to easily manipulate silver and blaze to nearly get his desired result. mephiles has also demonstrated the curious ability to, with one chaos emerald in his possession, warp the other six emeralds to his location instantly, which he did after the flames of disaster were released from elise and before reuniting with iblis. he is also shown to have adept knowledge on using modern technology, as evidenced by his knowing exactly which files in dr. eggman's computer to use when trying to persuade silver to assassinate sonic the hedgehog. this is most likely due to his apparently endless lifespan and time travel power allowing him to study the world around him for as long as he needs to. edit mephiles battles shadow after the latter refused his offer to join him. for the most part, mephiles hides in shadow's shadow, commanding his shadow clones to attack the black hedgehog. the shadow clones grab on to shadow, then detonate a few seconds after enough have grabbed on. shadow can avoid damage, however, if he is in the middle of using chaos attack when they explode. to draw mephiles out, shadow must defeat shadow clones to fill the energy gauge. each clone takes one hit to kill. they don't all have to be defeated, just enough to fill the energy gauge. once the energy gauge is completely filled, activate shadow's chaos boost ability to draw mephiles into the open. after that, the battle becomes more straightfoward. mephiles will mainly keep his distance from shadow, attacking him with large energy blasts. he may also command his shadow clones to \"dance\" around him, creating a large shield to protect him. but otherwise, dodge his attacks and attack until he is defeated. edit it seems that shadow is nearing victory, but mephiles gains the upper hand, knocking him away with an energy blast. he then proceeds to finish shadow off, but is interuptted by omega, who is here to support shadow. for this battle, the player takes control of omega. mephiles will now hide among his shadow clones to confuse the player. he still retains his energy blast attack, but can now fire smaller energy blasts. use omega's omega shot to attack mephiles. to make the fight easier, hold down the button to lock on to multiple enemies. then release to fire. edit mephiles now fights shadow as the final boss of the latter's story. mephiles' tactics are the same as the first battle, albeit with some changes. mephiles will float in the middle of the arena, waving his hands to command his shadow clones to dive into the floor. you cannot harm mephiles at this point, so take the opportunity to collect rings. once his clones have jumped in, mephiles himself will dive in (if you are too close to where he will dive in, you will take damage .). mephiles then will summon giant shadow monsters, made of numerous shadows. these giga-shadows attack by slamming the ground to create shockwaves, and firing a large laser from their mouths. despite their size, they can be defeated with a few good hits to the head. the player must defeat each giant shadow to fill the energy gauge. once the energy gauge is filled, activate chaos boost to return the shadow floor to normal and draw mephiles into the open. the fight is largely the same as the first, except that mephiles has two new attacks in his arsenal. he can now create perfect clones of himself, each with an energy blast. the player must find the real mephiles before they all fire their energy blasts. when desperate, mephiles will spiral upward, leaving a clone of himself and then firing an energy blast from above. to reach mephiles, use a homing attack on each clone until you reach mephiles. edit mephiles was voiced by <mark>dan green</mark>, the same actor who voices knuckles the echidna. in sonic the hedgehog, he is credited under the alias \"jay snyder\". dr. eggman had shown an interest in capturing mephiles, trying to take the scepter of darkness, and later when shadow asked eggman who mephiles was, he said he would tell him if he brought him mephiles. it isn't stated why eggman wanted to capture mephiles, but based on his actions in the game, it can be guessed that he had hoped to harness mephiles' powers to travel through time if he failed to do so with iblis, or that he needed both iblis and mephiles to completely control time. even though mephiles appears to lack a visible mouth, the general area on his \"muzzle\" moves in and out as he speaks in a manner similar to an inflating balloon. when mephiles is in the future, he has a purple chaos emerald, but later he doesn't have it or doesn't use it for some reason until last story. however since he can travel through time, the actions he does throughout the game could be in any unspecified order. it should also be noted that mephiles may have first heard his name while shadow trails after him during the aquatic base level, as shadow declares \"mephiles! i won't let you escape!\". since mephiles had not taken a name at the time, shadow may have inadvertently given him the idea for it, and the rest may have come from his element and the scepter itself. it may have also been all that he could see and sense in the scepter as well. many aspects of mephiles, most notably his hateful connection to shadow, his ability to make clones of himself, and his desire to flat out destroy existence in itself, bears several similarities to the matrix villain agent smith. also, his implied hatred of humanity mirrors agent smith's hatred of humanity. shadow and mephiles' final conversation in \"showdown with mephiles\" mirrors a similar conversation during the final fight between neo and agent smith in \"matrix revolutions\" though considered a key character to the plot of sonic 2006, having been arguably the main villain, of 11 other key characters to the game, (all the playables, eggman, elise, and excluding solaris, and iblis), mephiles interacted with only 3 of them directly (omega, shadow and silver), was sighted for sure by team dark and silver, and blaze, glimpsed briefly by team sonic (who mistook him for a shadow look-alike, and possibly never connected him to the events later). amy and eggman never meet him directly, and mephiles never once directed his attention from shadow, omega, silver, and to another extent, elise and the task of killing sonic to make her cry. mephiles never directly spoke to any female characters he encountered. it can be assumed that mephiles is physically very weak, as shown when mephiles was overcome by two individuals and even has a bit of trouble regaining his balance after bouncing on the ground. it's possible that mephiles might have a low tolerance for aggravation, which can be seen when shadow refused to join with him. the result of that was mephiles changing form and during the following boss fight, as well as the followup one later, snippets of dialogue suggest a more aggressive side, in which he will growl and even make threats. however, being that both fights are paired against shadow and only shadow, it's also likely that due to mephiles' hatred towards him, that this was merely a display of hostility. in his crystalline form, it's possible that his quills and ears, and for that matter, the rest of himself, is as pliable as it would be in his shadow form, as several cutscenes show the quills bending and being influenced by movement, and in one scene, his ear twitches slightly. mario & sonic at the olympic winter games, shadow will bear a great resemblance to mephiles after wiping-out on any skiing or snowboarding event. mephiles is the only villain who has managed to kill sonic. mephiles is the only character in sonic '06 without an official artwork sonic universe issue 29 where he is sitting next to an alternate version of mephitis, the personification of the poisonous gases emitted from the ground in swamps and volcanic vapors. edit \"ah ha ha ha ha! oh how ironic fate can be .\" mephiles' first line in shadow's story \"i thank you, shadow the hedgehog .\" - mephiles introducing himself to shadow after escaping the scepter of darkness. \"i'm mephiles, mephiles the dark! what, did you forget me?\" \"what you gave to me, i now return to you! a one-way ticket to oblivion!\" \"such foolishness...very well, let's see if you can entertain me .\" - mephiles' battle opening \"i'm your shadow...you can't even touch me .\" - mephiles whilst battling shadow. \"you're just a nuisance...robot .\" - mephiles while battling e-123 omega. \"drown into darkness!\" - mephiles phase 2 battling shadow \"just as a flower comes from a seed, or a chicken comes from an egg. everything has an origin. you need to find the being originally responsible for this catastrophe .\" - mephiles explaining how to alter the devesatated future to silver and blaze. \"with my help, you can...because i have the power to travel through time .\" - mephiles explaining to silver and blaze he can \"help\" them change the future in sonic next gen. \"i was expecting you sooner, as you must know, you're already too late...but there is still time for you to change your mind...join me shadow. let us teach this world a lesson, and rewrite the future...\"- mephiles offers shadow again to join his side before the final battle in sonic next gen.\" finally, the seal has been broken! at long last, i'll be able to join with you!! iblis! \"- mephiles when iblis was freed .\" now, chaos emerald!! it's time for the final curtain call!!! \"- mephiles using his corrupted chaos emerald to join with iblis."}, {"articleID": "2018041100_00090086_W", "names": {"Scott Myers": ["Q6381100", "Q7436939"], "John Day": ["Q16186636", "Q16239406", "Q21554065", "Q21554066", "Q28012733", "Q54321637", "Q6228897", "Q6228899", "Q6228901", "Q6228903"]}, "date": "2018-04-10", "url": "http://www.bluemountaineagle.com/Local_News/20180410/election-2018-county-judge-myers-running-for-re-election", "content": "ELECTION 2018: County Judge <mark>Myers</mark> running for re-election Touts experience, common sense and patience. By Richard Hanners Published on April 10, 2018 5:13 PM <mark>Scott Myers</mark> Job descriptions pdf file Editor's note: County Judge <mark>Scott Myers</mark> is running for re-election against County Commissioner Jim Hamsher. If either candidate receives more than 50 percent of the vote in the May primary, as is likely, that person will win the election outright, and the position will not appear on the ballot in November. <mark>Scott Myers</mark>, 63, Canyon City, is running for a second term as Grant County judge. Prior to that, he served two six-year terms as a county commissioner. After graduating from high school, <mark>Myers</mark> worked for 10 years in construction before landing a job at the Malheur Lumber Co. mill in <mark>John Day</mark>, where he worked from 1983-1998. He's been a self-employed building contractor since then. The biggest issues facing Grant County are jobs, housing and public safety, he said. \"In any order,\" he added. <mark>Myers</mark> has supported <mark>John Day</mark>'s proposal to bring broadband internet service to Grant County, including the county's participation in the Grant County Digital Network Coalition with <mark>John Day</mark> and Seneca. \"I think we need it,\" he said. \"We need competition. The small communities at the will of the internet providers need help .\" <mark>Myers</mark> has been at the table reviewing options to replace the existing 911 dispatch center now operated by the city of <mark>John Day</mark>--including outsourcing the service to Frontier Regional 911 in Condon. <mark>Myers</mark> said he would support the decision of the 911 User Board. \"If it's not Frontier, then I'd like to see the hybrid cost-sharing formula used to pay for a local dispatch,\" he said. \"It would be nice to retain payroll in Grant County .\" <mark>Myers</mark> has concerns about establishing a new natural resource adviser position for the county--including its role and funding. \"We have a lot of eyes looking at natural resources for us already,\" he said, citing the Eastern Oregon Counties Association and the Association of Oregon Counties. He said the new position was not sustainable for more than a year, and if the county turned to federal Secure Rural Schools or payment-in-lieu of taxes funding, that might not be available two years from now. <mark>Myers</mark> has a straightforward vision for the area's economy. \"We need to sustain jobs that we have while attempting to attract new ones,\" he said. \"Tourism does not bring family-wage jobs--industry does .\" Bringing broadband access to the county could help by encouraging home businesses that the area doesn't have now, he noted. In addition to common sense and patience, <mark>Myers</mark> said he's bringing legacy knowledge to the job. \"I have experience--there's no substitute for institutional experience,\" he said. \"I've been here a long time .\" "}, {"articleID": "2019043020_00052377_W", "names": {"Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"]}, "date": "2019-04-30", "url": "http://www.oxfordtimes.co.uk/sport/national/17608689.firmino-looks-to-be-winning-fitness-race-ahead-of-barcelona-showdown/", "content": "Firmino looks to be winning fitness race ahead of Barcelona showdown By Press Association 2019 Roberto Firmino could return for Liverpool's Champions League semi-final at Barcelona 0 comment Roberto Firmino appears to be winning his fight to be fit for the first leg of Liverpool's Champions League semi-final against Barcelona. The Brazil forward, who missed last Friday's Premier League victory over Huddersfield with a small muscle tear, was included in Jurgen Klopp's 23-man squad to travel to the Nou Camp for Wednesday's first leg. Firmino featured in training as the Reds allowed media cameras into their Melwood complex for their final preparations before flying to Spain on Tuesday afternoon. A great sight for Liverpool--Firmino training ahead of Barcelona game #LFC pic.twitter.com/8msFIZ9WUq--Andy Hampson (@ andyhampson) April 30, 2019 Manager Klopp told the club's website, www.liverpoolfc.com: \"We all knew from the beginning it would be a race .\" We don't have to make a decision today because there's no game today, we can wait. It looked good so far, but I have until tomorrow to make that decision. \"Midfielder Fabinho has been passed fit after he was forced to miss the 5-0 thrashing of Huddersfield following a blow to the head in the previous game against Cardiff. Fabinho could also return for the Reds (Adam Davy/PA) Klopp said:\" Every human being needs time and he needed that time, but if the Huddersfield game had been a day later he could have played. \"Rumours that forward <mark>Mohamed Salah</mark> had suffered an injury scare proved wide of the mark as the Egyptian played a full part in Tuesday's session. Alex Oxlade-Chamberlain, who returned last week after a year-long lay-off with a knee injury, was also involved. Adam Lallana, who has been sidelined with a muscle problem, did not participate and was not included in the travelling squad. Merseyside?? Barcelona #UCL pic.twitter.com/Vn7Ymh6MNI--Liverpool FC (@ LFC) April 30, 2019 That group did include 19-year-old forward Rhian Brewster, who is building up his fitness after more than a year on the sidelines with knee and ankle injuries. The England Under-17 World Cup-winner is not expected to feature on matchday, but the experience may benefit him ahead of his expected elevation to the first-team squad on a full-time basis next season. Klopp said:\" He is the next really exciting prospect. Next season will be his season, his first real season. \"He is with us, he is our player and we want to have him around. In this case I thought,\" Come on, it's Barcelona, let's give him a first sniff'. \"0 comment"}, {"articleID": "2008120407_00020583_W", "names": {"Edward Carey": ["Q5342209", "Q59473533"]}, "date": "2008-12-04", "url": "http://irishtimes.com/newspaper/breaking/2008/1204/breaking10.htm", "content": "last updated: thursday, december 4, 2008, 07:10 oil price falls to 4-year lows under $46 oil fell below $46 a barrel to near four-year lows today, extending four consecutive days of falls as continued demand worries minimised bullish draws in us oil stocks. oil prices have lost more than $100 a barrel since an all-time high of $147.27 hit in july, and some 16 per cent from last week, as demand is seen weakening worldwide and analysts expect it to contract this year and next. us light crude for january delivery fell 83 cents to $45.96 a barrel by 2.28 am, off an earlier low of $45.75, the lowest since a $45.42 low hit on february 10th, 2005. oil settled down 17 cents at $46.79 yesterday. london brent crude edged down 34 cents to $45.10. \"stabilisation in macroeconomic expectations is likely to precede any switch in oil market sentiment away from a mainly demand-side focus,\" barclays capital said in its weekly oil data review. bullish oil data on wednesday pushed prices higher during the session, when the us energy information administration said crude stocks fell 400,000 barrels in the week to november 28th, against an expected 1.7 million barrels build. distillate stocks, which include heating oil, fell 1.7 million barrels to 125 million, against a forecast for a 300,000-barrel increase, while gasoline supplies dropped 1.6 million barrels, having been expected to rise by 900,000 barrels. but the product inventory falls came amid lower refinery utilization, which fell 1.9 percentage points to 84.3 per cent of capacity last week against a predicted rise of 0.2 percentage point, showing weakening demand. \"refiners began to cut processing rates significantly,\" said jan stuart, economist in new york for ubs, in a report. 1 nine brothels raided in human trafficking operation 2 \"late late show' special and floodlit croke park match to start celebrations 4 over 60% of top schools limit admission to certain groups 1 unemployment rate hits 10-year high of 7.8 per cent 2 nine brothels raided in human trafficking operation 3 tourists asked to stay away as venice inundated by floods resultsshould we be supporting irish retailers this christmas? download and print the daily irish times sudoku grid plain-speaking president says market could stabilise in the last half of 2009 oversupply of properties is one of the big problems with the current market, iavi president <mark>edward carey</mark> tells rose doyle for many, babylon represents excess, greed and sexual licence, but its rich culture gave us the first numbers, law-making and astronomy a dublin property developer has acquired the canadian embassy residence on nine acres opposite bono's house in kiliney in exchange for a d6 home - and ¬ 3m donations to political parties not given to support democracy at last, it's official: people give political donations not because of altruistic concerns for democracy but because they want an\" in \"with ministers - and des richardson has confirmed it"}, {"articleID": "2015012222_00042963_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Matthew Slater": ["Q52906896", "Q6791235"]}, "date": "2015-01-22", "url": "http://www.kboi2.com/sports/Patriots-coach-I-had-no-knowledge-of-deflated-footballs-in-AFC-game-289440961.html", "content": "FOXBOROUGH, Mass. (AP) - Patriots coach Bill Belichick said Thursday he doesn't know how footballs became deflated during the game that got his team to the Super Bowl. But Belichick declined to answer questions after saying he knew nothing until Monday morning about accusations that his team cheated with underinflated footballs in its win against the Colts in the AFC championship game on Sunday night. The NFL is investigating. Belichick said the team is fully cooperating. \"I had no knowledge of this situation until Monday morning,\" said Belichick, who said he was \"shocked\" to learn the news. \"I would say I've learned a lot more about this process in the last three days than I knew or have talked about it in the last 40 years that I've coached in this league,\" Belichick said during an 8 1/2 - minute opening statement during an 11 1/2 - minute news conference. \"I had no knowledge of the various steps involved in the game balls and process that went through .\" Belichick did not specify who in the Patriots organization was responsible for the underinflated balls, or absolve anyone besides himself of potential wrongdoing. Softer balls are generally considered easier to throw and catch, and quarterbacks, specialists and equipment managers are known to have very individualized preferences in how footballs are readied for games. Belichick said he was unaware of the process for game balls until the accusations were raised. Belichick said he sometimes hears quarterbacks, kickers and other specialists talk about their preferences. \"I can tell you and they will tell you that there is never any sympathy from me whatsoever on that subject. Zero,\" Belichick said. Patriots quarterback <mark>Tom Brady</mark> is expected to address reporters later Thursday. \"<mark>Tom</mark>'s personal preferences on his ball, footballs, are something that he can talk about in much better detail and information than I could possibly provide,\" Belichick said. \"I can tell you that in my entire coaching career I have never talked to any player, staff member about football air pressure .\" The NFL requires balls to be inflated between 12.5 and 13.5 pound per square inch. Under league rules, each team provides 12 balls for use on offense. Referees approve the balls more than 2 hours before game time, then keep the balls until they're turned over to ball handlers provided by home teams just before kickoff. Belichick said the balls used by the Patriots offense are inflated to the \"12 1/2 - pound range\" and \"any deflation would then take us under that .\" Going forward, he said, the Patriots will inflate footballs to a safe level to prevent them from dropping under allowable air pressure during games. \"We will take steps in the future to make sure that we don't put ourselves in this type of situation again,\" he said. The coach who has won three Super Bowls said he generally forces players to practice under bad-ball conditions. \"Anytime players complain about the quality of the footballs, I make it worse and that stops the complaints,\" he said. \"We never use the condition of the footballs as an excuse. We play with whatever or kick with whatever we have to use .\" The issue has drawn strong reaction from around the game and its fans as the Patriots prepare to play the Seattle Seahawks on Feb. 1 in Glendale, Arizona, for the NFL title. Several players said it would not distract them in preparing for the game. \"It's unfortunate. We'd rather be celebrating our trip to the Super Bowl,\" special teams captain <mark>Matthew Slater</mark> said. \"It's important to us that we respect the game and deal with things in a way that's considered professional .\" Copyright © 2015 Sinclair Interactive Media"}, {"articleID": "2019062901_00060604_W", "names": {"Chris Evans": ["Q17490263", "Q178348", "Q21538587", "Q23418578", "Q27918241", "Q2964709", "Q2964710", "Q303577", "Q466583", "Q5106513", "Q51990270", "Q5392352"]}, "date": "2019-06-29", "url": "http://www.wsbtv.com/news/national-news/ap-top-news/castro-orourke-both-hit-texas-capital-after-debate-dustup/962388469?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Castro, O'Rourke both hit Texas capital after debate dustup Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Castro, O'Rourke both hit Texas capital after debate dustup By: CLARICE SILBER and WILL WEISSERT, Associated Press Updated: Jun 28, 2019 - 9:20 PM Loading...Castro, O'Rourke both hit Texas capital after debate dustup AUSTIN, Texas (AP) - One Texan became a political sensation waging a longshot Senate campaign, then stormed into the presidential race with even more momentum, climbing in the polls, running up monster fundraising and dominating the national conversation. The other announced his 2020 bid earlier and to far less fanfare, then struggled for months to even stay relevant. Both Beto O'Rourke and Julián Castro were in Austin on Friday night staging dueling events within an hour - and a few blocks - of each other. But, suddenly, those gatherings unfolded as Castro is the Texas presidential candidate on the rise, at least partially at the expense of O'Rourke, whose early buzz has fallen away. Castro, a former Obama administration housing chief and mayor of San Antonio, has been buoyed by a well-received performance during Wednesday's first night of Democratic debates in Miami, when he railed on O'Rourke for not backing his idea of decriminalizing the act of crossing the U.S.-Mexico border illegally. O'Rourke, a former congressman from the U.S.-Mexico border city of El Paso who sees immigration as an issue of strength, responded that doing so might shield drug - and human-smugglers from punishment. Looking for a breakout debate moment to catapult him back among the race's leaders, O'Rourke instead saw Castro upstage him. The fallout from that exchange followed both back to Texas' capital. And, despite being longtime friends, the pair's paths didn't cross. Castro held a Texas Democratic Party fundraiser at one bar. At another, O'Rourke had a meet-and-greet with his supporters recalling the feel-good days of his Senate bid last year, when he nearly upset Republican Ted Cruz in the country's largest red state. \"To all of you, who made everything possible in 2018, starting with meetings like this one,\" O'Rourke told a large crowd that filled an outdoor patio. Spokesman <mark>Chris Evans</mark> said O'Rourke had an open day on his calendar before a previously planned weekend trip to Houston and decided to hit Austin. He said it had nothing to do with Castro being there: \"When scheduling a presidential campaign, we don't look through what 23 other Democratic candidates are doing .\" Anna Guerrero, 45, saw O'Rourke before heading to Castro's event, saying, \"I decided why not, let's come and see what I think of them up close and personal .\" Asked if she'd support O'Rourke, Guerrero said: \"I don't know right now, and immigration is my biggest concern, and I'm not sure he is where I want him to be for me to be comfortable voting for him in that area .\" <mark>Evans</mark> said he wouldn't comment until the final numbers are ready, but O'Rourke's campaign advisers are privately worried they'll fail to meet key targets ahead of the end-of-quarter deadline Sunday. Supporters were hoping for a bump after the debate, but O'Rourke failed to deliver a breakout moment. Russell Buyse, 54, attended O'Rourke's event and said O'Rourke could have been stronger during the debate and seemed a little bit nervous. \"His empathic way of connecting with voters is one of his great strengths,\" Buyse said, \"and that doesn't come across quite as well on a debate stage with nine other people on the podium .\" In a role reversal, Castro finds himself on a post-debate upswing. Although his campaign didn't disclose exact figures, Castro said Friday that nearly 16,000 people donated on Thursday alone, 71% of whom were new donors. \"I think he gave a great performance at the debate. Before that, he wasn't exactly on my radar,\" said 28-year-old Arturo Garza, who attended the Castro party fundraiser. \"I was hopeful, but after that, I was like,\" OK, he's definitely a solid contender that's willing to put himself out there .' \"Not everyone was convinced, though. Tiam Leyva, a 36-year-old wearing a black T-shirt emblazoned with\" Beto Days Are Coming, \"drove three-plus hours from Plano for O'Rourke's gathering. She said of Castro:\" He changed my mind in a negative way because last year I know he campaigned for Beto. \"She said the debate dustup\" kind of made me get turned off to him because he bullied his friend for gain. \"___ Weissert reported from Washington. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:"}]