[{"articleID": "2014052211_00027477_W", "names": {"Francis Allen": ["Q23302652", "Q52637531", "Q5479982"], "Joseph George": ["Q2405425", "Q56561702"]}, "date": "2014-05-22", "url": "http://triblive.com/news/fayette/6152652-74/stolen-allen-railroad", "content": "A Bullskin scrap yard operator who was sentenced this month to probation and fined $2,000 after admitting his role in a Fayette County chop shop operation was charged on Wednesday with accepting large amounts of stolen railroad equipment for scrap. Rodney <mark>Francis Allen</mark>, 64, the owner of B & R Recycling at 145 Bellview Drive, and his wife, Linda, 59, who co-owns the business, were arraigned on Wednesday on a charge of receiving stolen property for allegedly possessing large, steel railroad tie plates that were stolen in April from CSX Corp.. Trooper James Pierce said investigators recovered 795 steel tie plates that were stolen from the railroad inside a Dumpster at the couple's business. He said the steel scrap is valued at more than $7,000. The Allens were released on signature bond after the arraignment before District Judge Richard Kasunic II, pending a preliminary hearing on May 29 before Connellsville District Judge Ronald Haggerty. The Allens did not return telephone calls seeking comment. On May 9, Rodney <mark>Allen</mark> pleaded no contest to receiving stolen property for his role in the theft of a 2005 Ford F-150 truck from Davies Ford in Connellsville Township in 2011 and allegedly using parts to repair another truck. Under the plea agreement, <mark>Allen</mark> was sentenced by Judge <mark>Joseph George</mark> to serve one year of probation and pay $2,000 in restitution, plus court costs. He originally was charged with owning, operating and conducting a chop shop; conspiracy for operating a chop shop; disposing of an illegally obtained vehicle; and theft, but those charges were dropped as part of the plea agreement. The charges stem from a case in March 2011 when <mark>Allen</mark>; his nephew, Joshua DeWitt, 28, of Connellsville, and Dale Robert Naugle, 30, of Tidioute in Warren County, a former employee of <mark>Allen</mark>'s, were accused of stealing a truck from Davies Ford and dismantling it to use for parts for one of <mark>Allen</mark>'s trucks. After executing a search warrant at <mark>Allen</mark>'s garage at 169 Bellview Road in Bullskin, police located the stolen truck, which had been stripped of parts. Charges against DeWitt were dismissed. Naugle pleaded guilty to conspiracy for operation of a chop shop and was sentenced earlier this year to serve six to 23 months in jail. Pierce said criminal charges of theft and conspiracy are pending before District Judge Wendy Dennis against Justin A. Pirl, 26, of Normalville and <mark>Joseph</mark> E. Miller, 30, of White, who also allegedly were involved in the thefts of the CSX materials. \"Investigation revealed that most of the tie plates were stolen by Pirl and Miller from CSX railroad tracks near Confluence on the Fayette County side,\" Pierce said. TribLive commenting policy You are solely responsible for your comments and by using TribLive.com you agree to our Terms of Service. We moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where readers can share intelligent and informed commentary that enhances the quality of our news and information. While most comments will be posted if they are on-topic and not abusive, moderating decisions are subjective. We will make them as carefully and consistently as we can. Because of the volume of reader comments, we cannot review individual moderation decisions with readers. We value thoughtful comments representing a range of views that make their point quickly and politely. We make an effort to protect discussions from repeated comments - either by the same reader or different readers. We follow the same standards for taste as the daily newspaper. A few things we won't tolerate: personal attacks, obscenity, vulgarity, profanity (including expletives and letters followed by dashes), commercial promotion, impersonations, incoherence, proselytizing and SHOUTING. Don't include URLs to Web sites. We do not edit comments. They are either approved or deleted. We reserve the right to edit a comment that is quoted or excerpted in an article. In this case, we may fix spelling and punctuation. We welcome strong opinions and criticism of our work, but we don't want comments to become bogged down with discussions of our policies and we will moderate accordingly. We appreciate it when readers and people quoted in articles or blog posts point out errors of fact or emphasis and will investigate all assertions. But these suggestions should be sent via e-mail. To avoid distracting other readers, we won't publish comments that suggest a correction. Instead, corrections will be made in a blog post or in an article. Fayette scrap yard owner, wife charged with receiving stolen goods eTrib The eTRIB is an electronic version of your favorite daily Trib Total Media newspaper edition. You can read the Trib-or any of our other daily newspapers-anywhere, anytime! Read the eTRIB on your tablet, smartphone, iPad or iPhone. Available eTRIB editions include the Pittsburgh Trib, Greensburg Trib, Valley News Dispatch, Valley Independent, Daily News, Daily Courier and Leader Times. Print Source Welcome to PrintSource, a division of Trib Total Media. We have established a veteran team that provides daily and weekly newspaper companies with a comprehensive set of services that include design, print, packaging and delivery of their products, all from one source and location. Gone are the days when each facet of newspaper printing and delivery had to be outsourced to different companies and venues. Now, PrintSource provides a viable solution with just one phone call. Digital Sales We offer a wide variety of traditional and new digital advertising options customized to fit your needs! Whether you're just starting out, or you've been a keystone in the community for years, our knowledgeable staff can provide you with a customized package including online banners/advertisements, Social Media Marketing (Facebook / Twitter), Website development, Search Engine Optimization, Email Marketing solutions and much more! Images and text copyright? 2014 - Trib Total Media, Inc. ."}, {"articleID": "2013082119_00057637_W", "names": {"Peter Chou": ["Q16336639", "Q7173267"]}, "date": "2013-08-21", "url": "http://tech2.in.com/news/general/peter-chou-htcs-savior-or-obstacle-to-revival/911756", "content": "N ow in his tenth year as CEO of HTC, <mark>Peter Chou</mark> is lauded as the architect of the Taiwanese firm's award-winning smartphones. But as the company's fortunes have dived, some insiders say he's now an obstacle to any revival. Rocked by internal feuding and executive exits, and positioned at the high-end of a smartphone market that is close to saturation, HTC has seen its market share slump to below 5 percent from around a quarter five years ago; its stock price is at 8-year lows, and it has warned it could make a first operating loss this quarter. Reuters interviewed a dozen former and current HTC executives who said <mark>Chou</mark>'s abrasive management style and weak strategic vision play their part in the company's decline, which has coincided with the success of Apple's iPhone and Samsung's Galaxy phones. <mark>Chou</mark> has said publicly he has no intention to stand down, and executives - none of whom wanted to be named because of the sensitive nature of the issue - said HTC has no clear internal successor. \"Part of the weakness is there is no obvious successor, and that's not been good for morale,\" one said. <mark>Chou</mark> declined to be interviewed for this article, but in response to Reuters queries, the company said, \"HTC's board and broad employee base remain committed to <mark>Peter Chou</mark>'s leadership. The (flagship) HTC One product family - which has been met with accolades by media and consumers alike - was a result of <mark>Peter</mark>'s vision and leadership, and speaks for itself .\" HTC CEO <mark>Peter Chou</mark> may be an obstacle in the company's recovery Born in Myanmar but educated as an electrical engineer in Taiwan, <mark>Chou</mark> joined HTC from Digital Equipment in 1997. Colleagues describe him as a perfectionist with an obsessive eye for materials and hardware design. Staff would deliver trays of prototype phones for him to inspect and pore over, spinning them to check for balance and running his fingers across the bevelled edges and joints. Phones would pile up on his desk, sometimes spilling onto the floor. That attention to detail and <mark>Chou</mark>'s willingness to make decisions on the fly helped build a culture within HTC of moving quickly to address market demands. At an offsite meeting two years ago, for example, the HTC team realised it needed another device for its portfolio. <mark>Chou</mark> quickly drew some sketches on a whiteboard, recalled one of those present, and soon had the outlines of a device, its price point, and a launch date - just three months away. Most manufacturers would need up to 18 months for a similar project, yet the Sensation XL appeared on schedule, and to rave reviews. \"Having the ability to just tear up a plan and say, OK, this is the new thing and we're going to get it done fast. That's <mark>Peter</mark>,\" said another former senior foreign executive. This shoot-from-the-hip approach served HTC well when the market was growing fast. Shortening the time to market meant HTC could alter plans at the last minute to take advantage of new or cheaper parts. But, as the market has matured, making it harder for handset makers to differentiate their products, the approach has left HTC vulnerable. Locking in the supply of more advanced components and materials to make products stand out requires more foresight and planning than HTC currently allows, former executives say. \"The weak point is they don't really have a long term strategy,\" said one. Rationalising his stance, the executive said, \"It used to be a strength, and now is becoming a weak point as they don't have a clear direction going forward .\" HTC's second-quarter net profit was well below forecasts even after resolving component shortages that hit its HTC One phone, and the company has said current quarter revenue could fall by as much as 30 percent from the previous quarter. HTC shares trade at around a tenth of their 2011 peak. Just three years ago, HTC was shipping 25 million smartphones a year and <mark>Chou</mark> led a huge expansion, bringing in foreign executives from Sony Ericsson, Apple, Motorola and Microsoft as he sought to take on Apple by doubling HTC's shipments. HTC was named Device Manufacturer of the Year at the world Mobile Congress in February 2011 and its market value topped that of rivals Research In Motion, now BlackBerry, and Nokia. <mark>Chou</mark> ordered champagne to celebrate. But as Apple and Samsung reigned supreme, HTC's annual shipments never reached that 50 million level, and by the end of last year HTC had dropped to number 10 among global smartphone makers. The HTC One, and earlier so-called \"hero' handsets from HTC, have won wide praise. The problem has been selling them. Executives say HTC's failure to hit sales targets was at least partly down to <mark>Chou</mark>'s management style. After hiring a slew of foreign executives, he fell short on promises to senior staff to foster a more open culture and cede sufficient authority. He openly berated managers and overrode their decisions, often with little discussion. Such an atmosphere, executives said, damaged morale and left managers uncertain of their roles. <mark>Chou</mark> kept his sales, product, marketing and design executives separate and, in some cases, created parallel teams doing the same thing. He didn't hold meetings of executives of the different departments to iron out problems even as HTC's performance wilted .\" There's a culture in HTC not to discuss numbers at senior management meetings, \"said one former executive .\" Those discussions tend to become hard or ugly, but if you don't solve it, it becomes bigger. \"<mark>Chou</mark>'s difficulty in developing a durable global brand of handsets and building an ecosystem of apps and services around it raise questions about how HTC can recover under his leadership at a time when high-end smartphone sales growth is slowing .\" With intensifying competition from other top-tier players and the entrance of lower-tier players, we think a long-term margin downtrend is inevitable, \"SinoPac wrote in a recent note. Many of the foreign hires have now quit, and HTC's old guard has re-established charge, running nearly all operations except design from Taipei. That, say those both inside and outside the company, is a mixed blessing. While leadership tensions may have eased, some warn that concentrating global marketing in Taiwan will create a one-size-fits-all, local approach that won't help HTC grow globally .\" What works in Taiwan is different from other markets, \"said one of the former executives. Chief Marketing Officer Benjamin Ho defended the move, saying in a recent interview with Reuters that it made sense to centralise key functions, but that HTC was\" not forgetting that we know we're an international brand. \"Even his fiercest critics agree <mark>Chou</mark> remains the heart of the company and say it's hard to imagine HTC coming up with great devices without him. As it seeks to turn around its fortunes, HTC has launched cheaper phones in China, and brought out a smaller, cheaper version of its flagship phone, the One Mini. It is trying to revive its US business by working more closely with operators and forming a new operations team. Bill Gates believes Google's Project Loon isn't that helpful Google celebrates World Photography Day in Mumbai Supreme Court hasn't really\" gotten to' email, says...Google faces 5-minute outage and web traffic worldwide takes nosedive HTC's weird new ad with Robert Downey Jr. leaks Micromax owners arrested by CBI in bribery case Google faces 5-minute outage and web traffic worldwide takes nosedive A \"Made in India' chip may be a reality soon Google earns flak for messing up colours in Independence day doodle KartRocket: Helping small time e-tailers take off Setting up your e-shop isn't as easy as it looks. With KartRocket,...Deliverwithme: Start-up that attempts to make your travel a little more rewarding If you are frequent-flyer, then apart from the clocking air mile rewards,...Startup emo2 builds multi-touch, multi-user computing surface If you are a TV buff then you don't have to worry about missing out on...InterviewStreet - Disrupting the IT sector hiring process What started out as part of a college project at National Institute of...3 Must-watch Indian lifestyle channels on YouTube If you are a TV buff then you don't have to worry about missing out on...Deliverwithme: Start-up that attempts to make your travel a little more rewarding If you are frequent-flyer, then apart from the clocking air mile rewards,...InterviewStreet - Disrupting the IT sector hiring process"}, {"articleID": "2014051811_00026594_W", "names": {"Matt Carpenter": ["Q2351564", "Q6788447"], "Matt Adams": ["Q3299390", "Q48797070"]}, "date": "2014-05-18", "url": "http://www.miamiherald.com/2014/05/17/4123198/cards-miller-drop-braves-4-1.html", "content": "ST. LOUIS--ST. LOUIS_There was more to his reboot at Class AAA Memphis for speedy infielder Kolten Wong than just getting regular playing time and relocating his swing. He had a chance to reacquaint himself with his feet. On Saturday, he introduced them to the St. Louis Cardinals. Sparks flew. Wong led the Cardinals' fast-forward offense with two bunts for base hits, a stolen base, a forced error, two runs, and a key run on a sacrifice fly. The rookie second baseman's footprint was all over the Cardinals' first three runs as they cruised to a 4-1 victory against Atlanta at Busch Stadium. Starter Shelby Miller authored seven innings and his sharpest start of the season to compel the Cardinals to their fourth consecutive victory, tying the longest winning streak of the season. \"Going back down I realized I wasn't doing much with my feet,\" Wong said. \"When I came back I wanted to make sure that speed was a main element to work with. Even though my swing is coming around I still have to make sure that people know I can run, that I can do things with my feet. That's what I'm here for .\" As the Cardinals look for the offense they expect to have, an injection of footspeed gives them the chance to push for runs until the lineup revs to life. With Wong and Peter Bourjos, the two fleetest of Redbirds, getting more regular playing time this weekend against the Braves, they've had the chance to show another way to provide runs for a team lacking in power. The only Cardinals to have multiple hits in the game, Wong and Bourjos combined for four bunt singles. The Cards are the first team since Detroit in September 2003 to have four bunt base hits in a single game, according to the Elias Sports Bureau. The win \"was one of the best representations of what speed can do for us,\" manager Mike Matheny said. \"How guys made things happen and then getting on base and creating havoc ....I think it just gives us more weapons. Days when we can sit back there and slug, I'd like to see us slug. Days when we've got a tough pitcher like (Atlanta's Aaron) Harang that's not giving us a lot, we have to figure out a way to manufacture and that's what we did. It was fun to watch the guys use their gifts .\" Hours before first pitch, Matheny sat in his office and described how the club's frustration stemmed not from an inability to play individual games at their best but \"to replicate that on a consistent basis or a semi-consistent basis .\" The unsteady start to the season has been a long tease for the Cards, who have been unable to build winning streaks because of ragged play - at the plate, on defense, or, more recently, on the mound. The Cardinals go for a sweep of the Braves Sunday, with Jaime Garcia making his first start in a year, because of two of their cleanest and best games of the season. While Wong's speed provided the runs and embroidery on the second win in as many days against first-place Atlanta, it was another teammate finding his pace that was the core of the Cardinals' more-complete game. Miller (6-2) has scuffled in recent starts because his mechanics falter or fail him in the middle innings. After consultation the past week with pitching coach Derek Lilliquist, Miller increased his tempo on the mound Saturday and had his best variety of pitches. During one at-bat against Braves slugger Evan Gattis, Miller flipped four breaking balls. He had downward movement of his fastball and maintained the horsepower to elevate for three consecutive strikeouts on 93-mph fastballs in the fourth inning. Miller struck out seven and completed seven innings for only the second time in his past 29 starts. \"Most of our guys work quickly,\" Miller said. \"That was one of the main focuses. Try to stay in the zone and throw strikes and everything works out. The biggest thing is trying to get outs as quick as possible .\" The only run Miller allowed was unearned because of an error from Wong. He threw wild to third base as the Cardinals pressed for an out in the second inning on a single to left field. Rather than lament the outcome, Matheny lauded the idea, calling it \"an aggressive play .\" In the fifth inning, Yadier Molina jumped on a bunted ball that appeared to be foul and spun a double play that unplugged the Braves' rally. Atlanta manager Fredi Gonzalez was ejected for arguing the call, though he came out two more times after the ejection to keep fuming. \"Aggressive plays\" are the type of things Matheny has urged to jar the Cardinals from their funk. The Cardinals entered Saturday as one of the lowest-scoring teams in the majors, complete with the fourth-lowest slugging percentage (.362) and second-fewest homers (23). Speed offers them a way to rewire the offense. Behold the power of the right bunt. \"When I'm not feeling that great at the plate, you drop a bunt down and get a hit out of it,\" Bourjos said. \"It can affect a lot of games. It's not always there, but when it is, take advantage of it. And then, sure enough, you get your swing going and I don't feel like bunting. It can hold you over for a little bit .\" Wong led off the fourth with a drag bunt against Harang (4-4). He scored from third when second baseman Tyler Pastornicky faded to shallow right and caught Yadier Molina's fly ball instead of right fielder and better arm Jason Heyward. Wong said he likely wouldn't have tried to score and tie the game had Heyward caught the ball. In the sixth, Wong meant to bunt <mark>Matt Carpenter</mark> into scoring position, but ran it out for a base hit. He tried to steal second and Gattis' throw went to center. <mark>Carpenter</mark> scored to break the 1-1 tie, and Wong followed on Allen Craig's RBI single. The only Cardinals run Wong didn't influence came in the seventh, again on a bunt. <mark>Matt Adams</mark> tripled and then scored on a safety squeeze bunt by Bourjos. Trevor Rosenthal collected his 13th save with a flawless ninth. Now, the Cardinals can see how far they can run with their best stretch of baseball. \"That starts things. That's how baseball is - one little thing can start a rally,\" Wong said. \"When you get two bunts for hits in one game, you know things are going right .\" "}, {"articleID": "2016091011_00581610_W", "names": {"Lee Clark": ["Q2608437", "Q6513299"]}, "date": "2016-09-09", "url": "http://stv.tv/sport/football/1366542-kilmarnock-boss-hails-kris-boyd-s-courage-following-brother-s-death/", "content": "Kilmarnock boss hails Kris Boyd's courage following brother's death PA 9 September 2016 Share via email Share via Facebook Share via Twitter Share via Whatsapp Striker made emotional speech to squad after Scott Boyd, 27, was found dead at his home. Respect: <mark>Lee Clark</mark> says Kris Boyd will receive whatever support he needs after his brother's death. SNS <mark>Lee Clark</mark> has revealed Kris Boyd delivered an emotional speech to the Kilmarnock squad following the death of his younger brother. Scott Boyd, 27, was found dead at his home in the Ayrshire village of Auchinleck on Wednesday. Manager <mark>Clark</mark> expressed his condolences to Boyd and his family following the tragedy and says he will let the striker make his own decision over featuring against Dundee on Saturday. \"It has been tough for the football club since we learned the news on Wednesday morning,\" he told Press Association Sport. \"Our supporters, the board and everyone connected with the football club send their deepest condolences to Kris and his family .\" I addressed the players on Wednesday and Kris came in today and addressed the players. \"It was emotional for everybody. It was emotional for me, the staff, for the players because we are very close .\" It was a delivery of a speech from a very strong character, a very experienced man. \"Him and his family have had an horrendous few days and it was very emotional but it shows me that the group has a tremendous togetherness and we will stay strong for him .\" Whatever Kris needs, we will support. We will be there every step of the way, whatever is needed. \"I have been speaking to Kris since the horrendous news and it will be left up to him, it is his decision, whether playing or training. I will be guided by him .\" The best tribute to Kris, his family and his late brother, that we can go there (Dundee), put on a performance and get the win. \"Midfielder Greg Kiltie could miss the next month after a hamstring injury suffered earlier this season, flared up again. Share this article Share via email Share via Facebook Share via Twitter Share via Whatsapp"}, {"articleID": "2017120316_00480260_W", "names": {"Justin Evans": ["Q15975248", "Q30122523", "Q6317576"], "Chris Baker": ["Q1076963", "Q20200808", "Q20987938", "Q42718943", "Q5105791", "Q5105792", "Q5105794", "Q5105795", "Q5105796", "Q5105797"], "Mike Evans": ["Q14951064", "Q1621683", "Q25189874", "Q6846717", "Q6846719"]}, "date": "2017-12-03", "url": "https://thepewterplank.com/2017/12/03/buccaneers-participating-nfls-cleats-cause-campaign-2017/", "content": "Comment TAMPA, FL--OCTOBER 29: <mark>Justin Evans</mark> #21 of the Tampa Bay Buccaneers celebrates after defending a pass in the second quarter of a game against the Carolina Panthers at Raymond James Stadium on October 29, 2017 in Tampa, Florida. (Photo by Joe Robb ins/Getty Images) This week, several Buccaneers players will be wearing custom cleats to show a little of their personality and a lot of their support. In one of the better marketing moves made by the NFL, \"My Cause, My Cleats' is a favorite week of mine. Players on the Buccaneers roster, and across the NFL, will get to break most of the league's equipment rules this week to show support for various organizations and causes. I don't know if every player is taking advantage of this, but there certainly are a good amount. The team has been joining the players in getting their messages out there. Some have taken to social media to bring theirs to life. I looked in both places, and the following are just some of the contributions from Bucs this weekend. Gerald McCoy The All-Pro defensive tackle gives a shout-out to his childhood with his appreciation of the difficulties experienced in single parent homes. As a father, I can say raising a family is hard enough sometimes with the dedicated partner I have found in my Wife. I couldn't imagine doing it without her. It's a silent battle often times as many of those in this situation make it look easier outside their homes while the good fight continues inside it. On one side of each cleat there is a depiction of\" Super Mom' and \"Super Dad' in full on hero mode. On the alternate side of each shoe, the same parent with the love of their children glowing in their eyes as they battle everyday problems. It's a touching tribute, and has an obvious flare of McCoy's own personality with the comic book design. Must Read: Bucs to Watch in Green Bay A post shared by <mark>Chris Baker</mark> (@ bigbake92) on Dec 2, 2017 at 11:00 am PST <mark>Chris Baker</mark> It's Bakers first year as a Buccaneers player, but not his first making a difference with the opportunity he's gotten. Knowledge is power, so they say, and <mark>Baker</mark> believes in this mentality completely. His foundation is the vehicle he uses to reach out to youth in Connecticut and in Washington DC where he played for the Redskins for five seasons prior to joining Tampa Bay. Using free youth camps, establishing literacy programs, and providing mentorship to his benefactors, this player is ensuring his legacy just begins when he steps off the field. <mark>Mike Evans</mark> Racial tensions have been a major part of the last two NFL seasons, and the Buccaneers were not immune to it either. On two occasions, wide receiver <mark>Mike Evans</mark> took a knee to demonstrate his displeasure with perceived injustices in our country. His cleats this weekend will show his efforts to help bridge these gaps with the simply stated,\" Sideline Racism \", painted onto his shoes. The Ross Initiative in Sports for Equality (RISE) is described on their website as,\". . an unprecedented alliance of professional sports leagues, organizations, athletes, educators, media networks, and sports professionals using sports to bring people together. . \"At the end of the day, we may not all understand each other's strife and struggles, but we can all work towards a more unified tomorrow. His cause is just this, and <mark>Evans</mark>' cleats are a beautiful representation of this message. Next: Knowing the Green Bay Packers Jameis Winston The Buccaneers quarterback is no stranger to working with kids, and as he makes his return to the field, he'll bring his Dream Forever Foundation with him. He'll have another partner though too. JDRF works to help find ways to improve the lives of people battling type 1 diabetes (T1D). According to their website JDRF.org, the organization is the leading funder for T1D research. They envision a world without the affliction and are working to accelerate life-changing steps towards treatment and curing of this terrible disease. These aren't all of the Buccaneers wearing special cleats today. Find the rest on the team's website, and click each image to get a little background on why each player chose the designs and causes they did. Locked on Bucs is on the air with a look at the return of Jameis Winston and a Week 13 Preview! Which ones are your favorite? Let me know in the comments, on Facebook, or find me on Twitter. Also find me now as one half of the Locked on Bucs podcast team, with episodes airing Monday--Friday every week of the 2017 NFL Season. Enjoy the rest of your weekend, and Go Bucs!"}, {"articleID": "2014021910_00059812_W", "names": {"Mark Webber": ["Q1378842", "Q6770266", "Q82667"]}, "date": "2014-02-19", "url": "http://www.wetpaint.com/celebrity-moms-babies/articles/2014-02-18-teresa-palmer-gives-birth-boy", "content": "Photo: Teresa Palmer and new baby Bodhi Rain Palmer Teresa Palmer is officially a mommy! The Warm Bodies star and her husband, actor <mark>Mark Webber</mark>, welcomed a baby boy to the world Monday, February 17. The Instagram with a first look at her bundle of joy...well, a first look at his hand, anyway. His tiny fingers wrapped around his mother's ring finger (which bears her stunning wedding ring), we can't tell much about this little man yet other than the fact that he's tiny! According to Teresa, it was natural birth. \"Thank you God for blessing us with the most divine gift of our baby son,\" she writes in her birth announcement, along with his full name: Bodhi Rain Palmer. Explaining the significance of each name, Teresa says \"Bodhi\" means \"Enlightened One\" while \"Rain\" stands for \"Abundant Blessings From Above .\" As for Bodhi's last name, the new mom says that's something of a tradition now: <mark>Mark</mark>'s first son Isaac, born to actress Frankie Shaw, carries his mother's last name rather than <mark>Webber</mark>."}, {"articleID": "2014082700_00040908_W", "names": {"Mark Sanchez": ["Q15991558", "Q15991574", "Q6769581", "Q946184"], "Robert Mills": ["Q28180932", "Q7347693"], "Chris Harrison": ["Q19873951", "Q30602676", "Q3675503", "Q5106802", "Q5106804", "Q55362792"], "James Foley": ["Q1680393", "Q17562199", "Q721389"], "Brock Lesnar": ["Q220556", "Q25421397"]}, "date": "2014-08-26", "url": "http://inquisitr.com/1434431/bachelor-in-paradise-spoilers-new-episode-5-teasers-entice-fans", "content": "Outdoors? Oh Noes! Cats Overwhelmed By Awesomeness Of Going Outside For First Time In Their Lives WWE News: WWE Legend Superstar Billy Graham Says He Has Only 2 Years To Live WWE: Roddy Piper Vs. Vince McMahon? Hall Of Fame Wrestler Insults Ric Flair, TNA, And The Boss <mark>Mark Sanchez</mark> Rumors: Quarterback Would Reportedly Rather Be Backup In Philadelphia Than Start In St. Louis Breakfast Study States Meal Is No Longer \"The Most Important Of The Day'\" Minecraft: PS4' Edition Back In Certification, \"Xbox One Edition' Imminent WWE SuperCard For iPhone And Android Brings Pokemon To The Wrestling World, But Will It Flair Flop?\" Bachelor In Paradise' Spoilers: New Episode 5 Teasers Entice Fans A new episode of Bachelor in Paradise airs Tuesday night, and fans are anxious for more of this wild summer hit. Everybody was left hanging with Monday's episode, so they want detailed Bachelor in Paradise spoilers regarding episode 5 airing on Aug. 26. What can everybody expect? There will be drama and romance to be sure, but apparently there are some other crazy things ahead as well. Fans would expect nothing less at this point. According to ABC executive <mark>Robert Mills</mark>, there are definitely juicy things ahead. He tweeted a spoiler teasing, \"PSA: there is a NEW #BachelorInParadise TONIGHT at 8 and - SPOILER ALERT - there will be vomit and a 3some .\" Here's hoping those two things aren't part of the same event. As it happens, the vomit teaser has already been explained via Reality Steve's spoilers. He indicates that the vomit is related to both the ambulance and the chase through the woods teased in spoiler previews. Steve says that Lacy Faddoul gets sick, and she runs into the woods as she's throwing up to get away from the cameras. Eventually an ambulance is brought in to help her, as it seems she has food poisoning or is dehydrated or something. She won't have to leave the show, however. As for the supposed threesome, Reality Steve's spoilers haven't broken down the fun on that one yet. Chances are fairly good that <mark>Mills</mark>' tease is a bit exaggerated, as surely Steve would have heard and shared if this was anything truly juicy. In fact, host <mark>Chris Harrison</mark> didn't even tease anything of this nature in his chat with Entertainment Weekly. He did point out that it may well be very telling that How will that all play out? It is said that Graham left because he was feeling sick, but he does return and accept AshLee's rose. <mark>Harrison</mark> does also tease Bachelor in Paradise spoilers that someone does leave Tuesday's episode in an ambulance, clearly Lacy if Reality Steve's spoilers are accurate, and <mark>Chris</mark> promises that \"It only gets better from here .\" Abdel-Majed Abdel Bary: London Rapper Identified As ISIS Militant Who Beheaded <mark>James Foley</mark> Whoopi Goldberg Reportedly Leaving \"The View' Due To Ongoing Feud With Rosie O'Donnell Royal Move: Take A Peek At Kate And William's Gorgeous New Residence [Photos] WWE News: The Original Plans For <mark>Brock Lesnar</mark> Heading Into SummerSlam Revealed WWE News: WWE Legend Superstar Billy Graham Says He Has Only 2 Years To Live"}, {"articleID": "2014012203_00066854_W", "names": {"Andrew Patterson": ["Q47316518", "Q4758220", "Q4758221", "Q56539743"], "John Reid": ["Q10426352", "Q13738404", "Q19325643", "Q19894401", "Q22955229", "Q29643487", "Q333461", "Q39078793", "Q43393930", "Q43912712", "Q57566044", "Q6234400", "Q6254532", "Q6254536", "Q6254540", "Q6254544", "Q6254752", "Q751972"]}, "date": "2014-01-21", "url": "http://nz.rd.yahoo.com/news/rss/top_stories/*http://nz.news.yahoo.com/a/-/top-stories/20928927/speakers-to-bring-local-perspectives-to-queentown-event/", "content": "Three speakers with unique Queenstown connections will be joining the programme for TEDxQueenstown: Sense of Place on 22 February 2014. Broadcaster <mark>Andrew Patterson</mark>, musician Mathias Piano Man Lefebvre - known as Mathias Piano Man, and University of Canterbury senior research fellow <mark>John Reid</mark> will join the existing line-up of esteemed speakers to bring some more local perspectives on \"Sense of Place'. RadioLIVE correspondent <mark>Andrew Patterson</mark> has strong roots in Queenstown as a former resident in the 90s. He is a passionate business champion with a bold vision for young people and their place in society. <mark>Patterson</mark> believes that supporting and growing entrepreneurism and investment in youth builds their connection with their community and is vital to the future of New Zealand. Well known by locals for his poignant melodies, Mathias Lefebvre is often seen playing an old kart-mounted piano on the shores of Lake Wakatipu. His unique image has been captured on an award-winning photo in National Geographic, but his story from Belgian masters graduate in humanitarian management to professional busker in Queenstown is even more captivating. <mark>John Reid</mark> is a Senior Research Fellow at the University of Canterbury's Ngai Tahu Research Centre. His research explores the way in which Indigenous and Western cultures shape identity, sense of place, and approaches to social and economic development. In particular, <mark>John</mark> is interested in fostering novel approaches to development through engagement between Indigenous and Western ways of knowing. Event co-curator Cesar Piotto welcomes these speakers as the glue that will tie theme with location .\" These speakers will bring valuable local connections to ideas around sense of place in Queenstown which will reinforce how fitting this theme is for our unique setting. \"Global warmers glad to see the back of 2013 It was the perfect Goon Show script. Scientists denying that ice in Antarctica was expanding got stuck in expanding ice. Global warmer researchers al.. . James Robins January 21, 2:50 pm The National: being brave and being kind It borders on cacophony, building and building, rising and rising, a serene, hazy storm of guitars and rioting drums. Amongst the melee, a bearded fi...Kids Can Corner November 12, 12:52 pm Yahoo! New Zealand News Preferences"}, {"articleID": "2018110403_00065414_W", "names": {"Graham Arnold": ["Q1336203", "Q5592634"]}, "date": "2018-11-04", "url": "https://www.brisbanetimes.com.au/sport/soccer/it-s-a-lie-muscat-and-merrick-accuse-each-other-of-handshake-snubs-20181104-p50dwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "\"It's a lie': Muscat and Merrick accuse each other of handshake snubs\" It's a lie': Muscat and Merrick accuse each other of handshake snubs Merrick and Muscat celebrate the 2009 A-League grand final win. Sebastian Costanzo Credit: The frosty relationship between Newcastle Jets coach Ernie Merrick and Melbourne Victory coach Kevin Muscat has become even colder, after they accused each other of failing to shake hands during Victory's 1-0 win over the Jets on Saturday night. Merrick and Muscat were a formidable coach and captain duo at Melbourne Victory, winning two A-League grand finals between 2005 and 2011. However since then, and especially since 2017 when Merrick became coach of the Jets while Muscat continued his time at the helm of Victory, the relationship has soured. Victory won Saturday night's grand final re-match at Hunter Stadium courtesy of a brilliant second-half strike by Terry Antonis. In the post match press conference a journalist asked Merrick to \"elaborate\" on suggestions the Jets coach couldn't find Muscat to shake hands straight after the final whistle. \"I walked over to the bench to shake hands as I did with the assistant coach, the goalkeeping coach, the fitness coach but Kevin sprinted in the opposite direction over to his fans and I wasn't going to chase him,\" Merrick said. \"But that's just the way he is .\" Advertisement Merrick also suggested former Sydney FC coach <mark>Graham Arnold</mark> may have had a similar experience with Muscat. \"I was looking forward to a handshake,\" Merrick said. \"He's the one that disappeared, I mean I don't make a big thing of it but it's just disappointing, really. He won the game, should be happy .\" The same journalist told Muscat that \"Ernie's apparently made some mention after the game that he went to shake your hand and you declined\". To which Muscat responded: \"I didn't see Ernie. That's a lie. One of you are lying\". \"I was also waiting for a handshake prior to the game and there was none, which normally happens when you're the home team,\" Muscat said. Loading \"If you watch the footage I shook all the officials' hands, and all their players' hands. So, it is what it is .\" I don't mean to jump down your throat but if you're going to assassinate someone's character, I know you're only passing the message, but it's a lie. \"The handshake incident comes after Merrick refused to have a joint press conference with Muscat before the Jets and Victory grand final in May. It was the first time in A-League history there was no joint coaches' press conference before a grand final. Victory won the game on Newcastle's home turf 1-0, thanks to a controversial Kosta Barbarouses goal that should have been ruled out by VAR for offside in the build-up, but the technology suffered a malfunction .\" One thing we want to do here in Newcastle is host a wonderful grand final and show our hospitality, \"Merrick told Macquarie Radio at the time .\" The last thing I wanted was a joint press conference descending downwards and it becoming about the coaches one way or another. \"I think we're the only country in the world that has joint press conferences with coaches before a match .\" \"I've moved on. I don't know if Kevin Muscat has regarding our time,\" he said."}, {"articleID": "2018020921_00502455_W", "names": {"Peter Hunt": ["Q12372343", "Q7174790", "Q7174792", "Q7174793", "Q7174795"], "Candice Bergen": ["Q106942", "Q2936261"], "Bob Black": ["Q1266007", "Q42421345"], "Michael Douglas": ["Q119798", "Q172140", "Q358096"]}, "date": "2018-02-09", "url": "http://ew.com/tv/scott-bakula-photos-role-call", "content": "CBS Photo Archive Murphy Brown The actor joined the hit CBS sitcom in 1993 (during its sixth season) as reporter <mark>Peter Hunt</mark>, who was a love interest for <mark>Candice Bergen</mark>'s titular character. \"The show was so smart. And I loved that there was a live audience; it felt natural to me,\" he says. \"The cast was so gracious when I joined their company, and <mark>Candice</mark> set that tone .\" In fact, he has hopes of reuniting with <mark>Bergen</mark> on the upcoming revival of the series. \"I didn't die. I just went off to work!\" he says of his character's potential return. More...Everett Collection American Beauty After headlining the CBS crime drama Mr. & Mrs. Smith with Maria Bello and appearing in the final Major League movie, Bakula set his sights on working on Broadway director Sam Mendes' first feature film, 1999's American Beauty. \"I read the script and called my agent and said,\" I'll take any part in this movie. I just want to be involved,' \"says the actor, who was ultimately cast alongside Sam Robards as a gay couple living in the film's seemingly idyllic but truly troubled central neighborhood .\" I really connected to the idea of \"What is going on behind our neighbors' doors? When we close the door, who are we?'\" says Bakula. \"I mean, I was in a movie that won a bunch of Oscars,\" he adds. \"That's something I never imagined would happen for me!\" More...Everett Collection Star Trek: Enterprise Bakula became a Star Trek fan watching the original TV series in reruns while in college, so he welcomed the opportunity to become a part of the mythology when he was offered the role of Jonathan Archer, the captain of Earth's first long-range interstellar ship, on Star Trek: Enterprise, which ran from 2001 to 2005. \"The key, to me, was when they said the show would take place 100 years before Kirk and Spock,\" says Bakula. \"I liked that I didn't have to follow anyone, and the idea of being the first ship in space, the Wild West of it all, and there being no Federation .\" And he had no fears about being embraced by the Star Trek fans. \"From Quantum I understood sci-fi fans and their passion,\" he says. \"And if they love you, then you're theirs forever .\" More...Greg Gayne/TNT Men of a Certain Age \"It was so much fun,\" Bakula says of working with Andre Braugher and Ray Romano on their TNT series. \"It was a good bunch of guys .\" Critics raved about Men of a Certain Age and Bakula's performance as unemployed actor Terry, but the show never found the audience its stars had hoped for and it was canceled in 2011 after two seasons. \"It was really hard to let go after just 22 episodes, it was painful,\" he says. \"Even though it was a show about old guys, there was a really cool feeling about it .\" More...Claudette Barius/HBO Behind The Candelabra Bakula says he initially heard about Behind the Candelabra while working with director Steven Soderbergh on the 2009 crime comedy The Informant! \"There had been some talk of Candelabra, and then it went away for several years,\" says Bakula. \"Then, out of nowhere, I got a call while I was doing a show at the Globe in San Diego .\" The 2013 HBO TV movie reunited Bakula with \"Mr. Soderbergh\" and provided him with the chance to step back in time as <mark>Bob Black</mark>, a Hollywood producer who introduces young Scott Thorson (Matt Damon) to flamboyant pianist Liberace (<mark>Michael Douglas</mark>). \"From the first costume fitting to the end, it was a riot,\" he says. But it wasn't just a good time. His work on the movie scored him an Emmy nomination (an honor he'd received four times during his tenure on Quantum). \"That was an unnecessary perk, but I took it!\" he says, laughing. \"It was really exciting to attend all the awards-season events. I hadn't been nominated in 20 years, so I got to enjoy it when it happened .\" More...Skip Bolen/CBS NCIS: New Orleans The chance to lead the latest installment of the NCIS franchise came to Bakula as he was preparing to shoot season 2 of HBO's Looking in 2014. He loved the character of Special Agent Dwayne Pride, but shooting on location in New Orleans didn't make it easy to film his scenes as entrepreneur Lynn on Looking in California. \"I was shooting in Louisiana five days a week and then flying to San Francisco to shoot until the wee hours of the morning every Saturday and then flying back,\" he says. \"It was wild .\" Now Bakula is more singularly focused on New Orleans and is proud of how his show has expanded the franchise's universe. \"It's encased in the NCIS world--and there are certain things we do to present the procedural elements to that audience--but we've been able to branch out and make it our own. We've built a community of characters that feel authentic to the city,\" he says. \"I love New Orleans. I just wish I had more time outside of work to explore .\" More...Shout! Studios Basmati Blues Bakula shot this movie musical with Brie Larson before her Academy Award-winning turn in 2015's Room (or, as he puts it, \"before Brie Larson became Brie Larson\" ). \"It's a love card to India,\" Bakula says of the film, in which he plays a scientist whose daughter (Larson) gets involved in a romantic triangle while they are working in Asia. \"I got to work with Donald Sutherland, Tyne Daly, and this spectacular group of Indian actors. They took us places and told us stories. It was the perfect way to see such an incredible, massive country. I'm awed by my whole experience .\" More ..."}]