[{"date": "2013-05-09", "url": "http://hawaiitribune-herald.com/sections/sports/procollege/hit-liner-happ-says-?i-feel-really-fortunate?.html", "content": "Associated Press ST. PETERSBURG, Fla. - J.A. Happ isn't sure how he'll react when gets on a mound again. One thing he does know is that he's going to try to forget what happened Tuesday night. Toronto's 30-year-old left-hander returned to Tropicana Field on Wednesday, less than 24 hours after he was struck on the head by a line drive that sent him to a hospital for an overnight stay. Happ expects to make a full recovery from a skull fracture behind the left ear that doctors believe will heal on its own, adding he doesn't anticipate having any fear of returning to work. \"I think you've just got to get back out there and try to forget about it,\" he said. \"I won't know until I'm out there, but I don't anticipate it being a problem .\" He's not sure when he'll get the opportunity. The pitcher sprained his right knee when he dropped to the ground Tuesday night, and that could affect how soon he'll be ready to pitch again. Happ realizes his injuries could have been worse. \"I feel really fortunate,\" he said after limping into the auxiliary clubhouse for a news conference and climbing a couple steps to sit behind a microphone. \"It looks like I moved just a little bit. I don't remember doing that, but it looks like it was just enough to where it must have caught me in a better spot, because I think it could have got me head on,\" he said. \"I've got some stitches and there's a fracture in the skull, I suppose, behind my ear, but it's not serious or threatening. We'll let those heal .\" Happ, who was put on the 15-day disabled list, had a brief conversation with Tampa Bay's Desmond Jennings, who hit the line drive that caught him squarely on the left side of the head. Happ shook hands with several teammates outside the Blue Jays clubhouse while assuring each one: \"I'm fine .\" \"He just wished me the best and hoped for a quick recovery,\" Happ said. \"Obviously, something like that is never intentional. I let him know that I knew that and I appreciated him coming over. It's a scary thing, I'm sure on his end, too .\" When Jennings arrived at the ball park he was relieved to learn from one of the Rays' trainers that Happ appeared to be OK. \"That enabled me to breathe a little bit,\" Jennings said. \"But you still don't know until you talk to him, until you see him face to face .\" Happ remembers releasing the ball, as well as teammates talking to him while he received medical attention on the field. \"I don't remember seeing it,\" he said. \"Just immediate loud ringing in my ear. Just pressure on my ear, and I was on the ground. That was kind of it. It took me a few seconds to kind of figure out what was going on, but I do remember them being there...the coaches and Gibby (manager <mark>John Gibbons</mark>) and obviously the trainers. I was coherent and talking pretty quickly .\" He also called his mother while an ambulance was transporting him to nearby Bayfront Medical Center. \"They were holding the phone up to my ear for me ....She was definitely relieved, glad to hear my voice,\" Happ said. The hit, still being replayed on TV a day later, left some of his fellow players unsettled. \"I felt horrible yesterday. I played with Happ last year for a little bit,\" Chicago Cubs pitcher <mark>Carlos Villanueva</mark> said. \"There's a lot of talk out there about the gear and protective stuff. Hopefully, they'll come out with something that won't affect us pitching out there, but it's still such a fast game. What happens if the ball comes directly at your face? There's nothing you can do. You can't pitch with a mask on. It just comes down to the draw of the luck I guess .\" Major League Baseball, meantime, is trying to determine the best way to protect pitchers from similar injuries. The league's senior vice president, Dan Halem, said a half-dozen companies were designing headgear for pitchers but no product so far was sufficiently protective and comfortable. \"If it doesn't absorb enough impact, then it may be ineffective,\" he said. Dr. <mark>Gary Green</mark>, MLB's medical director, said the Head Injury Criterion (HIC) scale is being used to evaluate products and that a cap liner likely would have to be 8 ounces or lighter. \"We've found some things that are very lightweight, but they're not very protective, and then other things that might be protective but they are too heavy and don't meet the other specifications,\" he said. <mark>Robert Vito</mark>, president of Pennsylvania-based Unequal Technologies Co., said a patent had been submitted for a product he hopes to make available in June. <mark>Vito</mark> said his employees met with pitchers, coaches and trainers from 26 big league teams during spring training. \"My biggest concern coming from the MLB Players Association is the mirror test. When they put it on, it must be concealed protection that cannot be detected by the fan,\" he said. In testing the product, he had someone smash a Louisville Slugger bat into his chest. \"Energy is like water. It's got to go somewhere,\" <mark>Vito</mark> said. \"So the energy is either going to go into my body and devastate tissues, tendons and break ribs and crush my heart to where I'm bleeding out internally, or it's going to get absorbed into the pad and then return some of that energy to the bat, all the while protecting me .\" While Unequal has used Kevlar-based products in the past, Georgia-based Evoshield employs \"gel-to-shell\" technology. \"There is no fast and easy solution,\" Evoshield CEO Bob Pinckney said in a statement. <mark>Green</mark> said an average of two pitchers had been struck on the head by line drives during the past seven or eight seasons. \"While these things are catastrophic, they're still rare events,\" he said. Baseball stepped up its efforts after two pitchers were struck last year. Oakland's Brandon McCarthy was hit on the head by a liner last September, causing a skull fracture, an epidural hemorrhage and a brain contusion that required surgery. He was released from a hospital six days later. Detroit's Doug Fister was struck in the head by a batted ball during the World Series; he was unhurt and stayed in the game. \"I've heard a lot of pitchers say they wouldn't mind trying it. And a lot of pitchers just don't want it,\" said Tampa Bay's <mark>David Price</mark>, the reigning AL Cy Young Award winner. \"So I think the decision would still be left up to that player. If it worked and it didn't affect anything in the mound, I would definitely look into it .\" When a product is available that MLB thinks will provide protection without getting in the way, it will ask the players' association for its input. \"I guess you'd have to see some prototypes,\" Happ said. \"It would be tough .\" In the macho culture of baseball, the adoption of protective gear has been slow. While Cleveland's <mark>Ray Chapman</mark> died when he was hit by a pitch in 1920, MLB didn't make the use of helmets or protective cap inserts mandatory until the National League required them for the 1956 season. Helmets weren't required until the 1971 season and, even then, they weren't mandatory for players already in the big leagues. An earflap on the side of the head facing the pitcher was required for new players starting in 1983. Stronger and slightly heavier carbon-fiber helmets, the Rawlings S100 Pro Comp, were required starting this year. \"You can't ask a pitcher to use material that he's not comfortable with. But I'm hopeful that, much like with batting helmets, we'll figure something out that both allows the players to play without any obstruction but adds to player safety,\" union head <mark>Michael Weiner</mark> said. \"When they get close to something that they think might work, then at that point we're both going to look at it together .\" Bryce Florie doesn't see well in his right eye to this day, the result of being struck by a line drive hit by the Yankees' <mark>Ryan Thompson</mark> while pitching for Boston in September 2000. Florie returned the following year but ended his career after just seven more big league appearances. \"With the way everything is being condensed, I think it's inevitable that it's going to happen, that they're going to have something in the hat,\" Florie said. \"You'll have a hard time to get major leaguers and minor leaguers to say,\" OK, Let me try this out .' Most of them are not going to want to be the first guy. But if you talk to guys like myself and other guys that have been hit, up in the face, in the head, we'll be, \"Like yeah, I'll do it .' But then, it's kind of late .\" Rules for posting comments Comments posted below are from readers. In no way do they represent the view of Stephens Media LLC or this newspaper. This is a public forum. Comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Stephens Media LLC is not liable for messages from third parties. IP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. Do not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity. Online Extra: Warriors unfazed in taking Division II title Man pleads no contest in peeping Tom cases", "articleID": "2013050917_00081986_W", "names": {"David Price": ["Q1176177", "Q16063598", "Q20804677", "Q20973688", "Q332804", "Q37830471", "Q5238707", "Q5238709", "Q5238711", "Q5238712", "Q5238713", "Q5238714", "Q5238716", "Q56072488", "Q56952850", "Q634326", "Q984010"], "Gary Green": ["Q1348874", "Q42422013", "Q5525162", "Q5525163", "Q5525164", "Q5525165", "Q5525167", "Q58756268"], "John Gibbons": ["Q19953474", "Q21557552", "Q27074107", "Q30122089", "Q3181578", "Q53552549", "Q55403007", "Q6235234"], "Michael Weiner": ["Q3308574", "Q39710513", "Q56850515", "Q6835258", "Q6835259", "Q878144"], "Ray Chapman": ["Q19871984", "Q28421918"], "Robert Vito": ["Q15993612", "Q3938452"], "Ryan Thompson": ["Q21651804", "Q3453865", "Q3943098", "Q4416955"]}}, {"date": "2013-05-10", "url": "http://www.ibabuzz.com/oaklandraiders/2013/05/09/raiders-work-out-veteran-punters-woodson-open-to-signing-with-any-team/", "content": "Raiders work out veteran punters; Woodson open to signing with any team By Steve Corkran Thursday, May 9th, 2013 at 7:58 pm in Oakland Raiders. Slow down on that talk of Marquette King being the unquestioned replacement for departed punter Shane Lechler. For evidence, notice how the Raiders signed an undrafted free agent and recently worked out veterans Mat McBriar and Jason Baker. King has the benefit over the others of having been with the Raiders last season. He worked with the team through training camp before being placed on season-ending injured reserve. It's wise of the Raiders to bring in some competition for the vacancy created by Lechler signing with the Houston Texans, given King has yet to punt in a regular-season game. In other news, former Raiders cornerback Charles Woodson now sounds more open to signing with teams not viewed as legitimate Super Bowl contenders. In other words, that brings the Raiders into the mix. For more on what Woodson had to say, here's an excerpt from an interview on NFL Network: On his future as an NFL player: \"If it were left up to me, I will be in the NFL again this coming season. Right now, it is kind of slow out there, the options have dried up but I am still waiting for an opportunity to play for a team, help a team win. So I plan on playing in the future .\" On being one of the many free agent veterans currently available: \"It is kind of the process, but at the same time it is frustrating. You have guys that can flat out play football. You look at Dwight Freeney and what he is able to do. They had a system last year that is different than he is used to playing, but he can play football. <mark>John Abraham</mark>, he led his team in sacks and you say\" we don't have a spot for you on our roster?' I can't understand that. Myself, I am just a ball player. I need to be on a team. \"On if he wants to play for a contender:\" When this process first started out, that was my thing, I needed to go to a contender. I know I am towards the end of my career. At this point, I want to play football. So if it is a rebuilding stage, at this point if that is the circumstances I have to play under, then that is what I am going to do. \"On if he would return to the Green Bay Packers:\" I don't want to speculate on that because I have not heard anything from Green Bay. We parted our ways a couple months ago. They told me they were moving on. I guess I took that to mean there was no opportunity to go back so I am looking for a future with another organization. \"On how a team would react to an openly gay player in the NFL: 26 Responses to\" Raiders work out veteran punters; Woodson open to signing with any team \"May 9th, 2013 at 8:00 pm Slow down on that talk of Marquette King being the unquestioned replacement for departed punter Shane Lechler. ***************************** Only the fringe element thought that Steve = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = Lechler is 36 and not getting any younger. His best days are well behind him. Not upset about moving on there. May 9th, 2013 at 7:58 pm Moore did fumble more last year, and he looked awful in punt returns. 7 TD's for a crappy offense is a lot more impressive to me than his 2011 5 TD's with a good offense .---------------- Better numbers, yes. But he was electric his rookie season. And he is to valuable a WR to be a punt returner. Don't like that. May 9th, 2013 at 8:02 pm Of course we're bringing in punters. Can't just hand the keys to King. Prove you can be consistent. May 9th, 2013 at 8:02 pm My guess is King will be our starting punter and Woodson will be playing somewhere not called called oakland, if so I guess it will be for the visiting team...May 9th, 2013 at 8:03 pm Just goes to show how stats can be misleading. Moore looked much better in 2011 than in 2012. May 9th, 2013 at 8:04 pm Unfortunetly, Reggie handed the keys to Flynn, however. May 9th, 2013 at 8:06 pm Moore\" looked \"better in 2011 because he was a rookie with no expectations upon him. Every pass thrown his way was house money. Throw some expectations on his plate, and even though he DID INCREASE HIS PRODUCTION it seemed as a down year to some. He could of, and should of played better, no doubt. But he is a better player now than he was in 2011. They will give it to a vet who can hold, and directional punt. May 9th, 2013 at 8:03 pm Just goes to show how stats can be misleading. Moore looked much better in 2011 than in 2012 .-------- - Yes he did. Especially that game vs SD on Thurs night with Palmer. May 9th, 2013 at 7:58 pm Moore did fumble more last year, and he looked awful in punt returns. 7 TD's for a crappy offense is a lot more impressive to me than his 2011 5 TD's with a good offense. = = = = = = = = = = Give me a break. He also average 4 more yards per catch his rookie year. He started 15 games as opposed to 10 his rookie year. So yeah I hope he was able to eclipse a couple meaningless stats. Go WATCH the film & tell me which Moore was better. Another playmaker Krapp destroyed. Great move Shreg! This is his third year. The third season is the breakout one historically for WRs The only knock against him is that he not that big and Reggie seems to love big receivers. But Reggie did refer to him last year as the #1 even though DHB had had a pretty solid year the year before (in his 3rd season!). May 9th, 2013 at 8:10 pm The Pryor Brigade sure are a bunch of whiny little b1tches. May 9th, 2013 at 8:04 pm Unfortunetly, Reggie handed the keys to Flynn, however. Competition...competition...competition...here's my guy who's never played in a Raider uni...he's our #1 .--------------- It's mind boggling. It is so baffling you have to wonder what the heck is really going on. Does Reggie want the number 1 pick next year? Just sayin. . May 9th, 2013 at 8:11 pm You guys don't remember Moore disappearing for months in 2011? I think he went like 6 games without eclipsng 20 yards receiving. May 9th, 2013 at 8:12 pm Just Fire Baby Says: May 9th, 2013 at 8:06 pm I don't think King makes the roster. They will give it to a vet who can hold, and directional punt. May 9th, 2013 at 8:12 pm Anyone who follows football would completely expect Flynn to be named the #1 guy. He was traded for. He's a vet. He actually looks like a passer. Only here do people think that Pryor should be the #1 due to being a raider longer. They said the other qbs can compete. Grow up and act like men. May 9th, 2013 at 8:12 pm He started 15 games as opposed to 10 his rookie year. So yeah I hope he was able to eclipse a couple meaningless stats. *********************** Yards PER game, catches PER game, were higher last year. They are bringing in vets for looks. Why? They can't kick it further than King, they don't have as big of legs. They will cost more as vets. Don't have as much upside. But as vets they will understand the nuances of the position, like holding and directional punting. May 9th, 2013 at 8:16 pm I would welcoe Woodson back. He would be a coach on the field as was Rod. It may be just what this young team needs to know how to approach this game. May 9th, 2013 at 8:17 pm Just Fire Baby Says: May 9th, 2013 at 8:14 pm What's so funny about that KK? They are bringing in vets for looks. Why? They can't kick it further than King, they don't have as big of legs. They will cost more as vets. Don't have as much upside. But as vets they will understand the nuances of the position, like holding and directional punting. Get it?-------- Reggie's prudent, so what? Oh yeah, I forgot King is black, he can't possibly directional punt. All he has is his natural gorilla like leg strength. May 9th, 2013 at 8:04 pm Unfortunetly, Reggie handed the keys to Flynn, however. Competition...competition...competition...here's my guy who's never played in a Raider uni...he's our #1. = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = Don't worry TSR. Mark will see to it TP6 gets a fair shot at the so-called open competition. By the sound of Marks' interviews, he's not gonna put up with any bull sh + t from Allen and if TP6 is the better QB, he'll start. Pryor is a favorite of Marks. May 9th, 2013 at 8:19 pm just like when he left here, woodson looking for whoever gives him the most $. can't blame him, but not the kinda player i'll root for I would welcoe Woodson back. He would be a coach on the field as was Rod. It may be just what this young team needs to know how to approach this game.", "articleID": "2013051010_00023820_W", "names": {"John Abraham": ["Q313025", "Q3180862", "Q47503507", "Q6218074", "Q6324382"]}}, {"date": "2013-05-10", "url": "http://readingeagle.com/article.aspx?id=476318", "content": "After watching his ace hit three batters in one inning, Nick Evangelista quickly trotted out to the mound. Hamburg's coach had no interest in removing Joey Cominsky. It was just time for a talk. \"I told him he needed to stay even-keeled and keep his composure,\" Evangelista said. \"He was in control of the game at that point. He needed to finish strong .\" Cominsky responded by fighting through two tough jams and helping sixth-seeded Hamburg edge No. 3 Conrad Weiser 4-3 in the Berks Baseball League quarterfinals at George Field Thursday. Hamburg (16-5) advanced to face Oley Valley (17-3) in Monday's semis. Second-seeded Oley defeated No. 7 Twin Valley 1-0 in the other quarterfinal here. Cominsky held a 4-1 lead in the fifth inning when he mysteriously lost his control. The right-hander drilled John Helwig, Connor Tom and Zach Reis to load the bases for Conrad Weiser (13-7). Once Cole Weinhold's seeing-eye single scored two runs to cut the deficit to 4-3, Cominsky was in trouble. \"I just battled through it,\" he said. \"That's what I've been taught to do since I was young. Don't give up. That's pretty much it .\" Cominsky escaped the fifth without further damage and maneuvered through a two-on, two-out jam in the sixth to preserve the victory. Cominsky homered and Trevor Roberts and Ryan Atkinson hit RBI doubles to lead Hamburg's offense. It was the first game for Conrad Weiser since athletic director Russ Kline suffered a heart attack following Monday's regular season finale. Players planned to pay tribute to Kline, who is recovering in Reading Hospital, by wearing his initials on their caps. Oley Valley coach <mark>Rick Harrison</mark> didn't have the luxury of relying on one pitcher Thursday. Lynx ace Nick Distasio struggled with his control while dealing with cramps in his forearm. That forced <mark>Harrison</mark> to turn starter Garrett Pelko into a closer for a day. Distasio went 42/3 innings and Pelko handled the final 21/3 for Oley. The duo combined for a two-hit shutout and 12 strikeouts. Distasio walked six and was removed with a runner on first in the fifth inning. Pelko retired six of the eight batters he faced, five via strikeouts. The lefty kept getting Twin Valley to chase high fastballs, including a strikeout of Jon Abbadusky with runners on first and second to end it. \"A lot of their bigger hitters are more eager,\" Pelko said. \"I was trying to use that to my advantage. I wanted to work with my breaking stuff low and heat them up top. That was my game plan .\" Oley scored the lone run on a throwing error in the second. Craig Eidle advanced from second to third on a groundout to shortstop. First baseman Cooper Jones tried to get Eidle but the throw skipped past third baseman Alex Alexy. Twin Valley (11-10) couldn't turn the walks into a run. The Raiders had three baserunners caught stealing. \"Those are good pitchers,\" Twin Valley coach Matt Royer said of Distasio and Pelko. \"That's why we ran and were going to keep on running if we got the right guys on. We knew we weren't going to string four hits in a row .\" Oley advanced despite its pitchers issuing seven walks and its offense producing three hits. It was by no means a pretty performance. \"Sometimes,\" <mark>Harrison</mark> said, \"this time of year you have to learn how to win games like that .\" ? 2013 Reading Eagle Company, All Rights Reserved - Serving the Berks County community and surrounding areas for over 140 years! These links are not endorsements of any products or services in such sites, ites,", "articleID": "2013051017_00033202_W", "names": {"Rick Harrison": ["Q27994413", "Q7331444"]}}, {"date": "2013-05-11", "url": "http://bleacherreport.com/articles/1635616-lessons-the-ufc-can-learn-from-big-time-boxing-promoters", "content": "The rapid rise of the UFC, combined with the boxing's decline in the American mainstream, has led to a slew of pundits, including yours truly, suggesting that the sweet science has plenty to learn from its cage fighting brethren. And it's true. The UFC does many things extremely well, and their success has not come by chance. From providing excitement up and down the fight card to expert use of social media, the UFC has much to teach its older combat sports brother. Former junior welterweight boxing champion Ricky Hatton pinpointed the most important lesson after he spent a little time studying exactly how the neophyte Las Vegas-based MMA promotion has managed to do so well in recent years: What boxing can do is learn from what the UFC is doing. One thing that hinders fighters is not being able to get the fights they need as quickly as they need. I'd like to see boxing's promoters work more closely together. It would be for the good of the sport. But that doesn't mean the UFC has it all figured out. Boxing promoters have been raking in money hand over fist since John L. Sullivan was boasting he could \"whip any man in the room\" way back in the 1890s. There are some time-tested tricks boxing folks use very, very well that the UFC would be smart to pay careful attention to. The best thing boxing does is build stars. A cynic might replace the word \"build\" with the word \"manufacture .\" Either way, by the time boxing's best young fighters are ready to take on the world, they have been carefully matched in a way that maximizes their strengths, minimizes and slowly works to improve their weaknesses and gives them a chance to build a fanbase on increasingly large television platforms. The UFC doesn't nurture it's young fighters in the same tender way. Instead, matchmaker Joe Silva tends to throw them to the wolves, demanding they sink or swim early and often. Take, for example, the 2010 fight between then 25-year-old wrestling star <mark>Phil Davis</mark> and then 23-year-old Swedish striker <mark>Alexander Gustafsson</mark>. In boxing, these two prospects would have been on parallel paths, learning and developing at the same time. When and if they met, it would be in a fight that mattered, sometime well down the line. In MMA, they met up in what was just the second UFC fight for both young fighters. <mark>Davis</mark> got the better of <mark>Gustafsson</mark> that day, meaning before he'd ever had the chance to shine, a young prospect faced a very public and very bitter defeat. That fight should have never happened-and it wouldn't have in boxing. Once a star is built, even if you take the long way around like the UFC does, he needs to propelled onto the national scene. The UFC hasn't had great success making this happen. They've had one notable success in Chuck Liddell and another work in progress in <mark>Jon Jones</mark>. The rest of their crew are stars only in the insular world of fight fans. The bulk of the UFC's television time is spent attempting to make a name, not for potential pay per view drawing cards, but for young fighters, often no-hopers, on The Ultimate Fighter reality show. There's very little time or promotional muscle left for fighters climbing their way up the ladder, the grinders who build their success in tiny increments on card after card. Boxing has been kind enough, however, to leave behind a template for making a rising boxer a bona fide star. HBO, along with the gifted Floyd Mayweather, turned the young fighter from pay-per-view bust to pay-per-view sensation with their own reality television special called 24/7. Instead of investing hours and millions into fighters who will likely never leave the undercard, boxing turns its attention to the top of the card. 24/7 and All Access on Showtime let fans know what fighters are like outside the ring, and media tours to select cities make every major fight feel like an event, not just another night of television. As yet, the UFC has been content to promote their brand over any individual fighter. National media about the group almost always features the promotion's owners and president Dana White. Attention, and credit, is rarely deflected to the fighters themselves. It's a major part of the reason boxing has cornered the market on the \"mega event .\" When Floyd Mayweather and Manny Pacquiao fight, it's national and international news. What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? Craziest MMA GIFs From: BroBible.com We'd like to send you the most entertaining", "articleID": "2013051121_00079082_W", "names": {"Alexander Gustafsson": ["Q20680376", "Q723744"]}}]