[{"date": "2013-05-11", "url": "http://bleacherreport.com/articles/1635616-lessons-the-ufc-can-learn-from-big-time-boxing-promoters", "content": "The rapid rise of the UFC, combined with the boxing's decline in the American mainstream, has led to a slew of pundits, including yours truly, suggesting that the sweet science has plenty to learn from its cage fighting brethren. And it's true. The UFC does many things extremely well, and their success has not come by chance. From providing excitement up and down the fight card to expert use of social media, the UFC has much to teach its older combat sports brother. Former junior welterweight boxing champion Ricky Hatton pinpointed the most important lesson after he spent a little time studying exactly how the neophyte Las Vegas-based MMA promotion has managed to do so well in recent years: What boxing can do is learn from what the UFC is doing. One thing that hinders fighters is not being able to get the fights they need as quickly as they need. I'd like to see boxing's promoters work more closely together. It would be for the good of the sport. But that doesn't mean the UFC has it all figured out. Boxing promoters have been raking in money hand over fist since John L. Sullivan was boasting he could \"whip any man in the room\" way back in the 1890s. There are some time-tested tricks boxing folks use very, very well that the UFC would be smart to pay careful attention to. The best thing boxing does is build stars. A cynic might replace the word \"build\" with the word \"manufacture .\" Either way, by the time boxing's best young fighters are ready to take on the world, they have been carefully matched in a way that maximizes their strengths, minimizes and slowly works to improve their weaknesses and gives them a chance to build a fanbase on increasingly large television platforms. The UFC doesn't nurture it's young fighters in the same tender way. Instead, matchmaker Joe Silva tends to throw them to the wolves, demanding they sink or swim early and often. Take, for example, the 2010 fight between then 25-year-old wrestling star <mark>Phil Davis</mark> and then 23-year-old Swedish striker <mark>Alexander Gustafsson</mark>. In boxing, these two prospects would have been on parallel paths, learning and developing at the same time. When and if they met, it would be in a fight that mattered, sometime well down the line. In MMA, they met up in what was just the second UFC fight for both young fighters. <mark>Davis</mark> got the better of <mark>Gustafsson</mark> that day, meaning before he'd ever had the chance to shine, a young prospect faced a very public and very bitter defeat. That fight should have never happened-and it wouldn't have in boxing. Once a star is built, even if you take the long way around like the UFC does, he needs to propelled onto the national scene. The UFC hasn't had great success making this happen. They've had one notable success in Chuck Liddell and another work in progress in <mark>Jon Jones</mark>. The rest of their crew are stars only in the insular world of fight fans. The bulk of the UFC's television time is spent attempting to make a name, not for potential pay per view drawing cards, but for young fighters, often no-hopers, on The Ultimate Fighter reality show. There's very little time or promotional muscle left for fighters climbing their way up the ladder, the grinders who build their success in tiny increments on card after card. Boxing has been kind enough, however, to leave behind a template for making a rising boxer a bona fide star. HBO, along with the gifted Floyd Mayweather, turned the young fighter from pay-per-view bust to pay-per-view sensation with their own reality television special called 24/7. Instead of investing hours and millions into fighters who will likely never leave the undercard, boxing turns its attention to the top of the card. 24/7 and All Access on Showtime let fans know what fighters are like outside the ring, and media tours to select cities make every major fight feel like an event, not just another night of television. As yet, the UFC has been content to promote their brand over any individual fighter. National media about the group almost always features the promotion's owners and president Dana White. Attention, and credit, is rarely deflected to the fighters themselves. It's a major part of the reason boxing has cornered the market on the \"mega event .\" When Floyd Mayweather and Manny Pacquiao fight, it's national and international news. What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? Craziest MMA GIFs From: BroBible.com We'd like to send you the most entertaining", "articleID": "2013051121_00079082_W", "names": {"Jon Jones": ["Q285450", "Q3183202"], "Phil Davis": ["Q576360", "Q7181829", "Q915916"]}}, {"date": "2013-05-13", "url": "http://www.salon.com/2013/05/13/monsanto_wins_scotus_case_over_genetically_engineered_soy_beans_ap/", "content": "Charles Ramsey: My past \"helped me become the man I am\" Monsanto wins SCOTUS case over genetically-engineered soy beans WASHINGTON - The Supreme Court has sustained Monsanto Co.'s claim that an Indiana farmer violated the company's patents on soybean seeds that are resistant to its weed-killer. The justices, in a unanimous vote Monday, rejected the farmer's argument that cheap soybeans he bought from a grain elevator are not covered by the Monsanto patents, even though most of them also were genetically modified to resist the company's Roundup herbicide. Justice Elena Kagan says a farmer who buys patented seeds must have the patent holder's permission. More than 90 percent of American soybean farms use Monsanto's \"Roundup Ready\" seeds, which first came on the market in 1996. Monsanto has a policy to protect its investment in seed development that prohibits farmers from saving or reusing the seeds once the crop is grown. Farmers must buy new seeds every year. The case had been closely watched by researchers and businesses holding patents on DNA molecules, nanotechnologies and other self-replicating technologies. But Kagan said the court's holding only \"addresses the situation before us .\" Farmer Vernon Hugh Bowman bought the expensive, patented seeds for his main crop of soybeans, but decided to look for something cheaper for a risky, late-season soybean planting. He went to a grain elevator that held soybeans it typically sells for feed, milling and other uses, but not as seed. Bowman reasoned that most of those soybeans also would be resistant to weed killers, as they initially came from herbicide-resistant seeds too. He was right, and he repeated the practice over eight years. In 2007, Monsanto sued and won an $84,456 judgment. Bowman said he should not be liable, in part, because soybeans naturally sprout when planted. Kagan said the court did not buy that argument. \"We think the blame-the-bean defense tough to credit,\" she said. _ Justices said unanimously that use of the bankruptcy term \"defalcation\" requires an intentional wrong. This came in a case where an Illinois man took improper loans from his father's trust, the first at his father's direction. _ They also unanimously said that federal law does not pre-empt a state law claim against a New Hampshire towing company that towed, stored and then disposed of a car owned by a man who was seriously ill in a hospital. Astronaut Chris Hadfield's greatest hits Is climate change fueling an epidemic? New York terror suspect case could challenge NSA spying Must-see morning clip: Bill Gates plans to eliminate polio and tuberculosis Bloomberg editor apologizes for, explains spying Congress wants to let you unlock your cellphone The Pirate Bay steps in to distribute 3-D gun designs Kickstarter: Stop blaming us for Zach Braff and \"Veronica Mars\" Hidden in immigration reform, vast biometrics plan The future of television: Zombie gamers gone wild Bidding war over Sprint Nextel Corp. heating up State Dept. orders 3-D gun designs be taken offline YouTube launches pay channels with B movies Cybergang loots ATMs of $45m in mere hours A missing poster hangs on a tree outside the Cleveland home of Amanda Berry Wednesday. Berry and two other women, Michelle Knight and Gina DeJesus, made a daring escape this week after being held captive for more than a decade. Elvis <mark>Rafael Rodriguez</mark> and Emir Yasser Yeje pose with a stack of cash allegedly stolen using bogus magnetic swipe cards at ATM machines across New York. On Thursday, state prosecutors identified the pair as members of a worldwide gang that robbed $45 million in a matter of hours by hacking into a database of prepaid debit cards. New Jersey Gov. Chris Christie walks to a podium during the groundbreaking ceremony for the Technology Enhanced Accelerated Learning Center at Essex County Newark Tech in Newark, N.J., Tuesday. Christie made less flattering headlines this week after undergoing a secret stomach surgery to curb his weight. Workers stand outside the Tung Hai Sweater Ltd. factory in Dhaka, Bangladesh, Thursday after a fire broke out in its 11-story building. Eight people were killed in the blaze. Workers rescue a woman trapped for 17 days in the rubble of a garment factory building in Saver, Bangladesh, Friday. The building's collapse was the worst industrial disaster in the country's history, killing more than 1,000 people. Former South Carolina Gov. <mark>Mark Sanford</mark>, left, gives his victory speech in Mt. Pleasant, S.C., after winning back his old congressional seat in the state's first district. Jodi Arias reacts in Maricopa Country Superior Court Wednesday after being found guilty of first-degree murder in the gruesome killing of her one-time boyfriend, Travis Alexander. Arias has subsequently said she wants the death penalty, claiming she'd \"prefer to die sooner than later .\" Credit: AP/The Arizona Republic/Rob Schumacher Ariel Castro stands for his mug shot Thursday at the Cuyahoga County Corrections Center, where he is being held on $8 million bail. The former bus driver is accused of imprisoning three young women and beating them repeatedly over a period of 10 years. Neighbor Charles Ramsey speaks to media near the home on the 2200 block of Seymour Avenue, where three missing women were rescued in Cleveland, on Monday, May 6, 2013. Cheering crowds gathered on the street where police said Amanda Berry, Gina DeJesus and Michele Knight, who went missing about a decade ago and were found earlier in the day. So UK carriers are selling anonymized customer data? That may not be a bad thing. Startup Gridcom uses photons and quantum physics for smart grid security Sponsored post: Cloud and co-location hybridization (live webcast) Lamborghini Egoista: Photos Of The 50th Anniversary Single-Seat Supercar That Will Remain' A Dream' Airbus Shows Off The First A350 XWB, The Boeing 787's Rival [PHOTOS] Bloomberg Snooping Got You Spooked? Here Are 5 Alternatives To The Bloomberg Terminal Bangladesh Garment Industry: H & M Commits To Fire And Building Safety Agreement Copyright? 2013 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON? is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. .", "articleID": "2013051323_00055448_W", "names": {"Mark Sanford": ["Q11669", "Q18352854", "Q3849548"], "Rafael Rodriguez": ["Q20993830", "Q2126998", "Q29650178", "Q3417271", "Q7282299"]}}, {"date": "2013-05-16", "url": "http://www.express.co.uk/news/uk/400138/Crowds-cheer-Royal-Marines-return-from-Afghanistan-as-Prince-Philip-awards-medals", "content": "UK Crowds cheer Royal Marines return from Afghanistan as Prince Philip awards medals Crowds cheer Royal Marines return from Afghanistan as Prince Philip awards medals About 700 Royal Marines marched through Taunton to the sound of cheering crowds Good riddance Afghanistan. I haven't got much affection for Afghanistan, it was just a job. I'm glad it's over. The homecoming parade marked the end of Somerset-based 40 Commando unit's fourth and final deployment in the region, and it was followed by a medal ceremony attended by Prince Philip. Since the unit's first deployment in 2001, 18 Royal Marines have died in Afghanistan, with Cpl <mark>David O'Connor</mark> the most recent fatality. Sgt Richard Winslade was relieved to be home, and said: \"Good riddance Afghanistan. I haven't got much affection for Afghanistan, it was just a job. I'm glad it's over .\" It's horrendous, especially if you know those who are killed. But it's a matter of cracking on with life and the job. \"You get back from the tour and that's when you reflect on what's happened .\" Prince Philip presented medals to 40 Royal Marines Crowds lining the route waved flags and cheered as the soldiers marched past, before coming to halt outside Castle Bow. The town's mayor, Libby Lisgo, thanked the Royal Marines and led a short reflection remembering Cpl <mark>David O'Connor</mark> who was killed in this last tour of duty. <mark>Phil Smith</mark>, whose son Stuart was on his first tour of duty, travelled from Surrey to watch the parade. He said: \"We were very nervous before the tour so today is the culmination of things and we are very pleased our boy is back safely .\" They have done a fantastic job. \"Also present was Carol Atcheral, who watched her son John march through the town. She said:\" It's wonderful to see him, it's so great but they're all so young and so fit. \"I've got mixed emotions because thinking about the way they were in Afghan - and look at them, so young, so healthy and fit - it's so great to see them back again .\" Rory Eccleson, 6, prepares to cheer on the returning troops Commanding Officer Lt Col <mark>Matt Jackson</mark> said: \"I remember a time when the military were an inconvenience and people only ever saw problems. Since Iraq, people are more grateful to the military and the parade's a way of thanking everybody .\" If you prevent a foreign country from being a haven for terrorists it increases security in the homeland. \"Afghanistan remains a dangerous place but the Afghan security forces are good enough now to take on responsibility for delivering security in their own country .\" He said the first part of their last tour involved fighting insurgents and latterly helping Afghan forces take the lead ahead of the withdrawal of foreign forces. Speaking ahead of the medal ceremony, which would see 40 troops presented with honours, Lt Col <mark>Jackson</mark> said: \"It's a significant moment for us because Prince Philip is the captain general of the Royal Marines so he is the most important person within the Royal Marines .\" \"We have paid a high price in Afghanistan' PM maintains work is\" vital' despite deaths Soaring energy bills scandal: shocking 10 per cent rise in prices to hit millions Northern and Shell Copyright? 2013 Northern and Shell Media Publications.", "articleID": "2013051623_00008386_W", "names": {"David O'Connor": ["Q28321062", "Q364502", "Q50976251", "Q5238131", "Q5238132", "Q5238134", "Q57902003"], "Matt Jackson": ["Q21621555", "Q2596323", "Q3299492", "Q41321960", "Q6791039"], "Phil Smith": ["Q16018910", "Q21598350", "Q7182421"]}}, {"date": "2013-05-20", "url": "http://au.news.yahoo.com/a/-/business/17248707/oxfam-warns-of-health-risks-to-syria-refugees/", "content": "AMMAN (AFP) - Aid organisation Oxfam warned on Monday that the warmer weather will increase health-related risks for hundreds of thousands of Syrian refugees in Jordan and Lebanon, and appealed for urgent funds. With temperatures set to soar up to 40 degrees Celsius (104 Fahrenheit), and as refugees continue to flee to Jordan and Lebanon, \"the health risks must be urgently addressed,\" Oxfam said in a statement. \"Increased cases of public health-related diseases such as diarrhoea and skin infections have already been recorded in host communities and temporary settlements where an increasing number of refugees now live,\" it added. Oxfam said it is \"crucial to ensure funds are in place to provide refugees with shelter, clean water and adequate sanitation,\" adding that it is aiming to raise $53.4 million (41.6 million euros) over the next year. So far Oxfam's appeal is only 23 percent funded, the statement said. The UN High Commissioner for Refugees has said the number of refugees in Jordan alone could reach 1.2 million by the end of the year--equivalent to one fifth of the kingdom's population. The kingdom says it currently hosts more than 500,000 Syrian refugees. Lebanon currently houses 400,000 Syrians, according to the United Nations. \"Providing safe water, appropriate sanitation facilities and access to health care is costly. It's time for the key donors to wake up and face that reality,\" said Rick Bauer, regional humanitarian coordinator of Oxfam. \"The sad reality is that the vast majority of Syrian refugees are not going home soon. It is also crystal clear that host communities in Lebanon and Jordan need urgent help .\" Bauer said Oxfam is \"starting to really worry about the health of Syrian refugees\". \"The aid effort must be properly funded and focused on providing refugees with affordable and decent places to stay, where they can live with dignity. That's priority number one for refugees and host communities alike,\" he said. NRL walks away from reported $50m sponsorship deal with bookie Tom Waterhouse <mark>Tony Abbott</mark>'s top adviser Peta Credlin charged with drink-driving", "articleID": "2013052008_00050121_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}, {"date": "2013-05-20", "url": "http://www.justmeans.com/press-releases/The-No--18-M-amp-M-S-Toyota-Team-Pits-To-Help-M-Prove-America/12525.html", "content": "Mars, Incorporated In 1911, Frank C. Mars made the first Mars candies in his Tacoma, Washington kitchen and established Mars first roots as a confectionery company. In the 1920s, Forrest E. Mars, Sr. joined his father in business and together they launched the MILKY WAY (R) bar. In 1932, Forrest, Sr. moved to the United Kingdom with a dream of building a business based on the objective of creating a mutuality of benefits for all stakeholders - this objective serves as the foundation of Mars, Incorporated today. Based in McLean, Virginia, Mars has net sales of more than $33 billion, six business segments including Petcare, Chocolate, Wrigley, Food, Drinks, Symbioscience, and more than 72,000 Associates worldwide that are putting its Principles into action to make a difference for people and the planet through its performance. Mars brands include: Petcare - PEDIGREE (R), ROYAL CANIN (R), WHISKAS (R), KITEKAT (R), BANFIELD (R) Pet Hospital, NUTRO (R), SHEBA (R), DREAMIES (R) and CESAR (R); Chocolate - MMS (R), SNICKERS (R), DOVE (R), GALAXY (R), MARS (R), MILKY WAY (R) and TWIX (R); Wrigley - DOUBLEMINT (R), EXTRA (R), ORBIT (R) and 5 (tm) chewing gums, SKITTLES (R) and STARBURST (R) candies, and ALTOIDS (R) AND LIFESAVERS (R) mints. Food - UNCLE BENS (R), DOLMIO (R), EBLY (R), MASTERFOODS (R), SEEDS OF CHANGE (R) and ROYCO (R); Drinks - ALTERRA (R) Coffee Roasters coffee, THE BRIGHT TEA CO. (R) tea, DOVE (R) / GALAXY (R) Hot Chocolate, and FLAVIA (R) brewer; Symbioscience - COCOAVIA (tm), WISDOM PANEL (tm) and SERAMIS (R). The No. 18 M & M'S? Toyota Team Pits To Help M'Prove America? CHARLOTTE, N.C., May 20, 2013 / 3BL Media / PRNewswire /--Almost daily, Kyle Busch and members of his No. 18 M & M'S? Toyota team practice to improve their efficiency changing tires and pouring gas, to ensure they can save precious seconds necessary to maintain track position. Today, the team banded together with colleagues from <mark>Joe Gibbs</mark> Racing, NASCAR and M & M'S to make improvements of a different kind. This unique team, comprised of more than 50 volunteers, is helping build two Habitat for Humanity of Charlotte homes in the Charlotte area, which includes the future homes of Yasin Mohamed and Egland Isak and their three children, as well as Kung Mang and Sung Thluai and their two children. The effort is part of M & M'S M'Prove America? campaign, a year-long partnership with Habitat designed to fund construction of new Habitat homes across the United States. Fans can join Busch and M & M'S by pledging to volunteer their time and talents at Habitat for Humanity build sites across the country at www.mproveamerica.com. This year, M & M'S is encouraging its associates and fans to log an ambitious 1.5 million minutes - or 25,000 hours - of volunteer time with Habitat. \"Charlotte has always been good to the NASCAR community - and especially to me and my teammates,\" said Kyle Busch. \"So it feels great to help two local families fulfill their dreams of homeownership. I encourage all race fans to join M & M'S in the effort to M'Prove America in their own hometowns, as there are few things in life as rewarding as helping a neighbor .\" In addition to encouraging fans to volunteer time, M & M'S is also making a donation of $500,000 to Habitat for Humanity to fund the construction of Habitat homes in 2013. Later this month, M & M'S will also introduce specially marked M'Prove America packages of red, white and blue M & M'S? Brand Candies in stores nationwide. The M & M'S M'Prove America campaign will also be on display during the Coca-Cola 600 on May 26 at the Charlotte Motor Speedway when Busch gets behind the wheel of a special No. 18 M & M'S M'Prove America Toyota. About Mars Chocolate North America: Mars Chocolate North America is the North American chocolate operations of Mars, Incorporated. In 1911, Frank C. Mars made the first Mars candies in his Tacoma, Washington kitchen and established Mars' first roots as a confectionery company. In the 1920s, Forrest E. Mars, Sr. joined his father in business and together they launched the MILKY WAY? bar. In 1932, Forrest, Sr. moved to the United Kingdom with a dream of building a business based on the philosophy of a \"mutuality of benefits\" for all stakeholders - this vision serves as the foundation of the Mars, Incorporated we are today. Based in McLean, Virginia, Mars has net sales of more than $30 billion and six business segments including Petcare, Chocolate, Wrigley, Food, Drinks and Symbioscience. More than 65,000 Associates worldwide are putting our Mars Principles in action every day to make a difference for people and the planet through our performance. Mars brands include: Chocolate - M & M'S?, SNICKERS?, DOVE?, GALAXY?, MARS?, MILKY WAY? and TWIX?; Petcare - PEDIGREE?, WHISKAS?, SHEBA?, CESAR? and ROYAL CANIN?; Wrigley - ORBIT?, EXTRA?, STARBURST?, DOUBLEMINT? and SKITTLES?; Food - UNCLE BEN'S?, DOLMIO?, EBLY?, MASTERFOODS? and SEEDS OF CHANGE?; Drinks - ALTERRA COFFEE ROASTERS?, THE BRIGHT TEA CO.?, KLIX? and FLAVIA?; Symbioscience - SERAMIS?, CIRKU? and COCOAVIA?. For more information, please visit www.mars.com. About Habitat for Humanity International Habitat for Humanity International is a global nonprofit Christian housing organization that seeks to bring God's love into action by bringing people together to build homes, communities and hope. Since 1976, Habitat has served more than 600,000 families by welcoming people of all races, religions and nationalities to construct, rehabilitate or preserve homes; by advocating for fair and just housing policies; and by providing training and access to resources to help families improve their shelter conditions. For more information, to donate, or to volunteer, please visit www.habitat.org, or follow us at www.facebook.com/habitat or at www.twitter.com/habitat_org or join Habitat's blog community at www.habitat.org/blog. About Habitat for Humanity of Charlotte Seeking to put God's love into action, Habitat for Humanity of Charlotte brings people together to build homes, communities and hope. Since 1983, Habitat Charlotte has served more than 1,200 families. Visit www.habitatcharlotte.org or call 704-376-2054 for more information. Your comment has more than 5000 characters. Please delete part of it before submitting. you are just one step away. Please check your email inbox and copy-paste \"Security code\" into below Text Box Click the button below to continue. You might need to disable your popup blocker to sign in. Click the button below to continue. You're using Internet Explorer to browse Justmeans right now. Justmeans will work better for you if you upgrade to the new version, or switch to another Web browser. A list of the most popular modern web browsers can be found below. If you have to use Internet Explorer because you are at work, we recommend version 8.", "articleID": "2013052020_00052760_W", "names": {"Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"]}}, {"date": "2013-05-20", "url": "http://www.shropshirestar.com/education/2013/05/20/wrockwardine-wood-arts-academy-in-telford-celebrates-80th-anniversary/", "content": "Wrockwardine Wood Arts Academy celebrates 80th anniversary Former pupil <mark>David Wright</mark> MP prepares to cut the cake Current staff and pupils at Wrockwardine Wood Arts Academy organised the event to mark the milestone. And town MP <mark>David Wright</mark>, who left in 1983, and Joyce Rowding, who started in 1936, were two of the star guests. The school in New Road opened in 1933 and has steadily grown in size over the years, with more than 600 pupils now on the roll. Telford MP Mr <mark>Wright</mark>, who was born and raised in the town, said he was delighted at being invited to cut the anniversary cake. He said: \"I am so glad to be back celebrating the 80th anniversary of my school. I left in 1983 and today really has brought the memories flooding back .\" It is great to see so many people who have attended the school over the years coming back for the anniversary to share their memories. \"Great-grandmother Mrs Rowding, now of Donnington, admitted Saturday had been the first time she had returned to the school since she attended there in the 1930s .\" It is the first time I have been back and I couldn't believe it. I hardly recognise the place, so much has changed, \"she said .\" My children and their children also attended here, so three generations of my family have passed through the doors over the years. \"Widow Mrs Rowding, who has five children, 17 grandchildren and\" at least as many \"great-grandchildren, helped out on the Home Front in various factories during the Second World War after leaving school before going on to work as a home help. Headteacher <mark>John Jones</mark> said it was especially important to celebrate the anniversary with the historic school buildings due to be bulldozed in the next couple of years as part of a? 200 million improvement programme across the borough. Pupils are due to move to a new site next to Oakengates Leisure Centre in a merger move with nearby Sutherland School. In the run-up to the event on Saturday, pupils and staff launched a website and appealed for past pupils to tell them about their memories in a bid to piece together a history of the school. Mr <mark>Jones</mark> said:\" I have been absolutely delighted by the commitment of all the students, teachers, parents and governors in organising this very special event. \"Everyone who has been involved with it can feel very proud indeed and when you see how many past students have turned out to join us it makes it all worthwhile .\" Music teacher Ben Millington has played a leading role in piecing together the history of the site. He said: \"We would still like to appeal to people to go on to our website, sign our guestbook and tell us about their memories and share old pictures. We know about how the school started and we obviously know about the present but there are still a lot of gaps in between, particularly from the 1950s to the 1980s .\" The event featured performances by the senior choir, pupil rock and pop bands and also soloists. Teacher Rob Star bravely put his head on the block by asking pupils to pay for the privilege of throwing a wet sponge at him, while there was also a variety of stalls in the school playground. More than 300 past and present pupils of a Telford school, including an MP and an 88-year-old woman believed to be its oldest surviving pupil, turned out to celebrate its 80th anniversary. Staff and children at a Shropshire nursery are celebrating after being commended by education inspectors. A series of events aimed at encouraging \"Lifelong Learning' has been launched at one of Shropshire's leading schools as part of a new community involvement initiative. Telford College's new engineering centre to fill the skills gap", "articleID": "2013052101_00016286_W", "names": {"David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"]}}]