[{"articleID": "2016091220_00741741_W", "names": {"Alejandro Lopez": ["Q4714585", "Q4714587"], "Jon Brennan": ["Q59316526", "Q6270439"]}, "date": "2016-09-12", "url": "http://ctpost.com/business/article/Culinary-incubator-finds-fast-success-in-Stamford-9217902.php", "content": "http: //www.stamfordadvocate.com/business/article/Culinary-incubator-finds-fast-success-in-Stamford-9217902.php Culinary incubator finds fast success in Stamford By Paul Schott Published 3:56 pm, Monday, September 12, 2016 Photo: Paul Schott / staff Photo Image 1of/3 Caption Close Image 1 of 3 In the Flavorism culinary incubator at 207 Greenwich Ave., Puebla Grill chefs Adlin Fleurancy, left, and Plinio <mark>Lopez</mark>, right, prepare orders, while Flavorism culinary director Wayne Homsi looks on. In the Flavorism culinary incubator at 207 Greenwich Ave., Puebla Grill chefs Adlin Fleurancy, left, and Plinio <mark>Lopez</mark>, right, prepare orders, while Flavorism culinary director Wayne Homsi looks on. Photo: Paul Schott / staff Photo Image 2 of 3 Image 3 of 3 Mason/Dixon Smokehouse co-owners <mark>Alejandro Lopez</mark> and Nestor Laracuente stand in front of their meat smoker, in their space at the Flavorism culinary incubator at 207 Greenwich Ave. Mason/Dixon Smokehouse co-owners <mark>Alejandro Lopez</mark> and Nestor Laracuente stand in front of their meat smoker, in their space at the Flavorism culinary incubator at 207 Greenwich Ave. Photo: Paul Schott / staff Photo Culinary incubator finds fast success in Stamford 1 / 3 Back to Gallery STAMFORD--The table was already set for the chefs when they arrived this summer to start their enterprises at 207 Greenwich Ave. They would walk into a refurbished South End building that included a commercial kitchen and a dish room. They would have a website ready to take orders and a fleet of delivery drivers prepared to transport their food. All they would have to do is cook and handle personnel matters in this culinary incubator launched last month by the Stamford startup Flavorism. \"What we're trying to do is save all these operators money so that they focus more of their revenues on ingredients and labors,\" said <mark>Jon Brennan</mark>, Flavorism's marketing director. Flavorism operates as an online, delivery-only service for local gourmands, who can pick out and combine dishes in one order from the various menus from flavorism.com, in the same way that they would shop for a range of brands on Amazon. The Flavorism kitchen delivers to customers in Stamford, Greenwich and Darien. Even in a crowded and competitive culinary market like Stamford, Flavorism can stand out, <mark>Brennan</mark> said. More Information For more information about the culinary incubator Flavorism, visit www.flavorism.com \"When they design a menu, it's designed specifically for delivery,\" <mark>Brennan</mark> said. \"It completely changes how the food is prepped, even what ingredients they're using, the menu content.\" Three startups based in the Flavorism complex are already taking orders: TBC Pizza Co.; Puebla Grill, which makes Mexican cuisine; and Fahrenheit 760, which uses a wood-fired oven and features a menu with French-Canadian influences. Fahrenheit 760's owner Wayne Homsi also serves as Flavorism's culinary director, a position that involves advising the other chefs in the Flavorism kitchen. The shared space encourages the chefs to share ingredients and ideas, he said. \"I'm here as a sounding board for other people,\" Homsi said. \"We're working in the same place, but we're a team. Everybody can learn from everybody else.\" Other chefs who work in the hub said that they have thrived in the new space. \"It's a good environment,\" said Puebla Grill chef Adlin Fleurancy. \"It's somewhere you get new ideas every day.\" Mason/Dixon Smokehouse is the sole enterprise in the Flavorism building that has its own brick-and-mortar restaurant. The new barbecue restaurant is scheduled to next month replace Gastro Bar at 78 West Park Place. The owners said that they needed an off-site location for their meat smokers because they said their landlord would not let them keep the apparatus at the downtown property. \"We couldn't have asked for a better place,\" said Nestor Laracuente, a Mason/Dixon co-owner and the restaurant's pitmaster. \"You would think this guy built this spot just for us. So far, it's been working out really well. I feel we complemented each other in a bunch of different ways.\" The owners of the startups pay a lease to operate in the Flavorism center. Flavorism takes a cut of the income from the orders, a share that amounts to about 7 percent of all revenues, according to <mark>Brennan</mark>. The next two brands in the Flavorism network, Aji Ramen and Farmers Palette, are set to launch within the next few weeks. Flavorism executives are eyeing an expansion beyond the Stamford kitchen, which formerly served as a local base for Airgas. The company is developing plans for incubators in Fairfield and Brooklyn, N.Y.. But Flavorism's focus remains its Stamford hub, in which it has invested about $500,000. The Greenwich Avenue complex could eventually host 20 brands, <mark>Brennan</mark> said. \"We're going to fill the building with a mix of cuisines,\" <mark>Brennan</mark> said. \"My goal is to have the most diverse group of people, because they'll all benefit from each other.\" pschott @ scni.com; 203-964-2236; twitter: @ paulschott Today's Deals Powered by SHOP NOW Athletic Works Men's Active Tee for...WalmartPosted 21 hr 35 min ago SHOP NOW Walmart Dare To Compare Sale WalmartPosted 6 days 10 hr ago SHOP NOW Hyper-Tough 57-Piece Plumber Tool Set...WalmartPosted 8 hr 50 min ago SHOP NOW Refurb HP Probook Intel i5 Dual 14 \"...WalmartPosted 5 days 2 hr ago Most Popular 1 Man murdered Saturday night in Bridgeport 2 Motorcycle crash disrupts 9/11 ride in Fairfield 3 Sources: Bar cars returning to New Haven Line trains on Metro...4 Woman arrested after alleged poolside assault 5 Man accused of blocking exit 6 TLC star arrested on child rape charge 7 Police: Fairfield man says friendly escort stole $500 View Comments & copy; 2016 Hearst Communications, Inc. ."}, {"articleID": "2011110423_00023465_W", "names": {"Andrew Mason": ["Q24809513", "Q2846672", "Q4757903", "Q4757904"], "John Williams": ["Q11310708", "Q12633687", "Q131285", "Q1367551", "Q14950380", "Q15429336", "Q15821602", "Q1606354", "Q16105524", "Q16224055", "Q1702438", "Q18385583", "Q19325807", "Q20821181", "Q20821436", "Q21176199", "Q21481534", "Q22019624", "Q2333172", "Q24249667", "Q25190475", "Q2567288", "Q2688830", "Q28434529", "Q29643791", "Q30122882", "Q30612128", "Q370293", "Q3809678", "Q46993819", "Q49546744", "Q51585685", "Q54932733", "Q56187903", "Q56597939", "Q56604636", "Q6264302", "Q6264304", "Q6264308", "Q6264311", "Q6264317", "Q6264319", "Q6264346", "Q6264352", "Q6264355", "Q6264357", "Q6264363", "Q6264366", "Q6264372", "Q6264380", "Q6264382"], "Eddie Murphy": ["Q16095779", "Q43874", "Q5336342"]}, "date": "2011-11-04", "url": "http://wgnradio.com/business/breaking/chi-groupons-stock-jumps-as-it-begins-trading-20111104,0,6061024.story", "content": "groupon's stock shot higher in its first day of trading as a public company on friday, with shares jumping 31 percent. the chicago-based daily deals company's shares, trading as grpn on the nasdaq, opened at $20 per share and quickly rose $7.71 to $27.71. by midday, shares were up 46 percent, or $9.24 to $29.24. they closed at $26.10, up 31 percent. groupon priced its ipo late thursday, raising $700 million and garnering a valuation of $12.76 billion. pricing for the ipo came in above groupon's initial anticipated price range of $16 to $18, which would have resulted in a valuation between $10.1 billion and $11.4 billion. groupon raised the number of shares it is selling from 30 million to 35 million, but this still represents just 5.5 percent of the company and is considered a small float compared with typical ipos. in its regulatory filings, the company had cautioned that the relative scarcity of its stock could lead to volatility in the share price, given the imbalance between supply and demand. groupon's underwriters have the option of selling an additional 5.25 million shares. the friday debut on nasdaq capped off a tumultuous journey for groupon, which went from tech darling to the poster child of a new tech bubble during the five-month prelude to the ipo. while the $12.76 billion valuation falls below early chatter of $30 billion, it's above the nearly $6 billion that google offered for the company in late 2010. groupon chief executive <mark>andrew mason</mark> was in new york to ring the nasdaq opening bell on friday. he also posted a short message on the company's official blog that contained no trace of the quirky humor or references to cats that have marked his other correspondence. \"our ipo is a small milestone on our journey,\" <mark>mason</mark> wrote. he added: \"i feel incredibly grateful to serve as ceo of groupon. with our ipo behind us, i couldn't be more excited about what lies ahead.\" \"it's a ridiculous policy'--<mark>john williams</mark> talks about the case of the family jailed for forgetting to pay for a sandwich eaten while shopping higher temps and some sun this weekend, ebert only so-so on new <mark>eddie murphy</mark> movie, best to keep active (or die), milwaukee guy\" car jumps' into record books and the resurgence of public clocks bail denied in girl's slaying: \"there are no words to describe how horrific it is '"}, {"articleID": "2018101101_00100780_W", "names": {"Derek Dooley": ["Q5261924", "Q5261925"]}, "date": "2018-10-10", "url": "https://eu.montgomeryadvertiser.com/story/sports/2018/10/10/how-arkansas-surprised-alabama-defense/1592899002/", "content": "How Arkansas surprised Alabama's defense, may have provided blueprint for Missouri Alex Byington Montgomery Advertiser Published 5:00 PM EDT Oct 10, 2018 Arkansas tight end Cheyenne Oâ € ™ Grady (85) is stopped by Alabama linebacker Mack Wilson (30), defensive back Deionte Thompson (14), defensive back Xavier McKinney (15) and defensive lineman Isaiah Buggs (49) during second half action in Fayetteville, Ark., on Saturday October 6, 2018. Mickey Welsh TUSCALOOSA--Given the tireless preparation Alabama's coaches go through in the buildup to games, it's not often that the top-ranked Crimson Tide defense gets surprised on Saturdays. But Arkansas found away to do just that last Saturday, utilizing a simple tight end screen to burn Alabama's usually stingy defense for a pair of first-half touchdown passes to junior Cheyenne O’Grady in the closer-than-it-should've - been 65-31 loss. \"It was just how they ran it (that) surprised us,\" Tide sophomore nose guard Quinnen Williams admitted Tuesday. \"It looked just like a type of pass protection that we go over all the time. The quarterback held the ball almost like 3-4 seconds and then the tight ends just slipped out of the back.\" You see something new every game, something new every day, so it's (about) correcting it and getting it better so if we see it again, it won't happen again. \"Of course, with Missouri's potent offense coming to Tuscaloosa for Saturday's Homecoming game (6 p.m. CT, ESPN), including 6-foot-5 and 255-pound junior tight end Albert Okwuegbunam, who led all FBS tight ends last season with 11 receiving touchdowns. Missouri Tigers tight end Albert Okwuegbunam (81) celebrates after scoring a touchdown in the second quarter against the Arkansas Razorbacks at Donald W. Reynolds Razorback Stadium. Nelson Chenault, USA TODAY Sports The Razorbacks took advantage of this particular tight end screen multiple times on its first touchdown drive, as O’Grady began the play as a blocker against a blitzing outside linebacker before releasing and immediately turning around near the line of scrimmage to face quarterback Ty Storey for a quick pass over the middle. At that point, O’Grady simply followed the blocks laid by Razorback offensive linemen already 5 yards downfield for an 11-yard completion across midfield. Storey and O’Grady connected three times on that drive for 35 yards, including an 8-yard touchdown pass to the left corner of the end zone to pull within 21-7 of Alabama with 24 seconds left in the first quarter. O’Grady led the Razorbacks with seven catches for 48 yards and the two touchdowns.\" A couple of those plays last week, I think three of them, are where the guy blocked, blocked, blocked, and we kind of released them in coverage, whoever had them, and then a lineman gets in between you and the tight end and they throw them a little screen, \"Tide head coach Nick Saban said Monday.\" We hadn't seen that play prior to last week's game. It didn't kill us in the game, but it is certainly something we need to defend better in the future. It is a difficult play and you have to be disciplined in coverage. \"Arkansas head coach Chad Morris and Alabama head coach Nick Saban chat at mid field before the Alabama vs. Arkansas game in Fayetteville, Ark., on Saturday October 6, 2018. Mickey Welsh In developing the game plan against Alabama last week, Arkansas head coach Chad Morris noticed how aggressive the Tide defensive front seven is, especially in the pass rush, and figured a delayed screen for the tight end could be just what can help even the odds.\" We felt like they were just aggressive up front, they give a lot of pressure, and did a really good job of retracing on any screen releases you had, so we tried to use that against them, \"Razorbacks head coach Chad Morris said Wednesday on the SEC teleconference.\" They're very sound and very well coached, so when you go against teams of that caliber, you try to do some things that maybe make a few of their keys lie to them. \"More: Tide defense seeks return to\" Alabama standard' against Mizzou More: Imperfect Alabama defense knows the buck stops with them For defensive linemen like Williams, the tight end's initial attempt at blocking at the line of scrimmage sent sure signals for a natural run or run-pass option play, but instead utilized those predetermined notions to catch Alabama off guard, even if it was only good for a series or two in the first half. \"We're all thinking,\" pass rush, pass rush, \"' Williams said.\" So when the tight end slipped out of the back, it was like, \"Woah .' I've never seen it before like that .' It was just a great game plan on Arkansas' behalf.\" Added sophomore middle linebacker Dylan Moses: \"That was something that I really didn't see on film. I'm pretty sure they looked at that as something that could hurt us and it did. We went in at halftime, game planned against it and fixed it.\" Of course, with Missouri (3-2, 0-2 SEC) and preseason Heisman Trophy contender Drew Lock bringing the Tigers' own innovative offense to town this Saturday, and senior receivers Nate Brown and Emanuel Hall still out with injuries, it's a safe bet first-year Tigers offensive coordinator <mark>Derek Dooley</mark> will try and find different ways to move the ball against No. 1 Alabama (6-0, 3-0 SEC), including taking advantage of a potential mismatch with the 6-5 Okwuegbunam at tight end. \"They have a prolific offense, (and) Drew Lock is hands down one of the best quarterbacks in the nation, if not the best,\" junior safety Deionte Thompson said Monday. \"The way that he can get the ball out of his hands is very fast. The way they move, they average a play every six seconds after the ball is snapped. They average the most plays in college football. It's going to be a fast-paced game. We have to get lined down, get the call, communicate and be ready to play.\" Missouri Tigers tight end Albert Okwuegbunam attempts to make a catch in the end zone as South Carolina Gamecocks defensive back Jaycee Horn defends in the second half at Williams-Brice Stadium. Jeff Blake, USA TODAY Sports Published 5:00 PM EDT Oct 10, 2018"}, {"articleID": "2018031718_00121197_W", "names": {"Andrew Mccabe": ["Q27734885", "Q29878677"], "Michelle Lee": ["Q16233958", "Q28465824", "Q6837119", "Q717070"], "Terry Mcauliffe": ["Q3518911", "Q49001865"], "Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2018-03-17", "url": "http://www.bdtonline.com/region/the-latest-trump-says-mccabe-caught-called-out-and-fired/article_ff30b313-0184-5e7c-aaed-dda69f1e3032.html", "content": "The Latest: Trump says <mark>McCabe</mark> \"caught, called out and fired' The Latest on the second round of the NCAA Tournament (all times Eastern): More Headlines Birth Announcement HAGER--<mark>Michelle Lee</mark> and Jay O’Keith Hager announce the birth of their daughter, Kinsley Paige Hager, born on August 15 at Bluefield Regional Medical Center, the baby weighed 7 lbs. 2 oz. The mother is the former <mark>Michelle Lee</mark> Reed. Maternal Grandparents are Tina and <mark>Terry</mark> Reed of Bluefield,...North Korea negotiations Maybe it's President Donald Trump's\" fire and fury \"threats and coarseness with the leader he calls\" Little Rocket Man. \"Maybe it's the squeeze of international sanctions. Maybe it's both. But after years of brinkmanship and missile tests, North Korean leader <mark>Kim Jong Un</mark> appears to be signal...More Headlines The Latest: Trump says <mark>McCabe</mark>\" caught, called out and fired' Mar 17, 2018 Updated 2 min ago WASHINGTON (AP)--The Latest on the dismissal of <mark>Andrew McCabe</mark>, a former FBI deputy director (all times local): 2:10 p.m. President Donald Trump says \"the Fake News is beside themselves that <mark>McCabe</mark> was caught, called out and fired.\" Trump is referring to <mark>Andrew McCabe</mark>, the FBI deputy director fired by Attorney General Jeff Sessions late Friday. The president tweets Saturday: \"How many hundreds of thousands of dollars was given to wife's campaign by Crooked H friend, <mark>Terry</mark> M, who was also under investigation? How many lies? How many leaks? Comey knew it all, and much more!\" As a candidate for state office, <mark>McCabe</mark>'s wife accepted a campaign contribution from the political action committee of then-Virginia Gov. <mark>Terry McAuliffe</mark>, a Democrat. <mark>McAuliffe</mark> is a longtime friend of Democrat Hillary Clinton, whom Trump defeated in 2016. Trump fired James Comey as FBI director last May, citing the Russia investigation. <mark>McCabe</mark> says Sessions fired him as part of the Trump administration's \"war on the FBI.\" ------1:55 p.m. President Donald Trump says many people are finding out about \"tremendous leaking, lying and corruption at the highest levels\" of the FBI and the Justice and State Departments. He provided no details in his tweet Saturday. But his tweet comes a day after Attorney General Jeff Sessions announced that he had fired FBI deputy director <mark>Andrew McCabe</mark> following a recommendation from FBI disciplinary officials. <mark>McCabe</mark> has long been a target of Trump's anger. His dismissal precedes the release of an inspector general report that's expected to conclude that <mark>McCabe</mark> was not forthcoming about matters related to the FBI investigation of Hillary Clinton's emails. In Saturday's tweet, Trump also repeated that there had been no collusion between his 2016 presidential campaign and Russia. That matter is under investigation by special counsel Robert Mueller .------12:55 p.m. <mark>Andrew McCabe</mark>--the former FBI deputy director just fired by the attorney general--kept personal memos regarding President Donald Trump. That's according to a person with direct knowledge of the situation who wasn't authorized to discuss the memos publicly and spoke on condition of anonymity. This person says the memos are similar to the ones maintained by former FBI Director James Comey, who Trump fired last May. Comey's series of notes detailed interactions with Trump that Comey said unnerved him. The person with knowledge of <mark>McCabe</mark>'s situation says <mark>McCabe</mark>'s memos include details of interactions with the president, among other topics. It's not immediately clear whether any of the <mark>McCabe</mark> memos have been turned over to special counsel Robert Mueller or requested by Mueller .------1:25 a.m. Attorney General Jeff Sessions says he has fired former FBI deputy director <mark>Andrew McCabe</mark>, a regular target of President Donald Trump's anger and criticism, just two days before his scheduled retirement date. <mark>McCabe</mark> immediately decried the move and suggested it was part of the Trump administration's \"war on the FBI.\" The Friday dismissal was made on the recommendation of FBI disciplinary officials and comes ahead of an inspector general report expected to conclude that <mark>McCabe</mark> had authorized the release of information to the news media and had not been forthcoming with the watchdog office as it examined the bureau's handling of the Hillary Clinton email investigation. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}, {"articleID": "2009081904_00010204_W", "names": {"Kyle Parker": ["Q24005416", "Q6451344"], "Jeff Scott": ["Q18637860", "Q42322479", "Q6174929"], "Aaron Kelly": ["Q14951103", "Q4662147"]}, "date": "2009-08-19", "url": "http://heraldonline.com/news/sports/story/1545919.html", "content": "published: wednesday, aug. 19, 2009 / updated: tuesday, aug. 18, 2009 11:45 pm tigers' receiving corps an inconsistent bunch clemson--when receiver jaron brown reviewed his performance in tuesday's scrimmage, he highlighted a block that freed running back andre ellington for a decent gain. asked to name the best catch by any receiver, brown drew a blank. so did coach dabo swinney. such has been a recurring theme through the offseason. clemson's fleet of young, inexperienced receivers are either hit-or-miss or, more appropriately, catch-or-miss. senior receiver jacoby ford ranks as the acc's leading returning pass-catcher from last season, but the tigers entered august hopeful that a few of their budding prospects would emerge. the odds of that happening were thought to have improved when ford went down with a pulled hamstring on the first day of camp, opening the door for others to take his practice reps and show their stuff. there have been days when brown and sophomore marquan jones displayed playmaking abilities, teasing the group's dynamic potential. but the names of the standout receivers differ from practice to practice. and then there are sessions like tuesday's - when <mark>kyle parker</mark>'s 3-for-10 line suggest that dropped passes (swinney counted four with <mark>parker</mark> at the helm) and pass protection are bigger offensive issues than which quarterback is starting. \"you hear receivers might be the downfall, but we have to take it as a positive,\" jones said. \"that just makes us bust our butt and work hard.\" clemson is counting on offsetting its shortcomings at receiver by using its running backs and tight ends more in the passing game. in that context, position coach <mark>jeff scott</mark> offers a middle-ground assessment of the receivers. <mark>scott</mark> says they still have a long way to go, but they have improved since the spring, when most were still learning because so few owned experience beyond the scout squad. \"overall, in terms of tempo, they have the confidence they know what they're doing,\" <mark>scott</mark> said. \"in the spring, we were far from that. everyone was looking around, trying to figure out where everybody was going. the knowledge - especially from our first group, of what they're doing and how to adjust routes - has been taken to another level.\" arguably the biggest unknown is how much clemson can produce at split end, previously occupied by school record-holder <mark>aaron kelly</mark>, and a spot where swinney prefers tall, rangy receivers. xavier dye is pegged as the starter there, but the 6-foot-5 junior has tallied 10 career catches and has done little this month to shed his reputation for inconsistency. behind dye are 6-5 redshirt sophomore brandon clear and 6-4 redshirt freshman brandon ford. clear's progress has been stunted this month by a rib injury, while ford is the least athletic of the trio and still working on the techniques necessary to get open and maximize his soft hands. the cupboard is stocked with more talent at the flanker and slot receiver spots. jacoby ford is the headliner at flanker unless clemson goes to three-receiver sets. ford then becomes the inside slot receiver and relinquishes the flanker spot to former walk-on terrance ashe, a junior with 10 career catches. jones, a sophomore from blythewood, has trained at both spots as ford's heir apparent. and perhaps the most significant development this month is that brown - a 6-2 redshirt freshman - has joined dye, ashe and jones in the team's second tier of receivers behind ford, <mark>scott</mark> said."}, {"articleID": "2009121205_00122065_W", "names": {"Raymond Martinez": ["Q21465828", "Q29034918"], "Paul Browne": ["Q20604957", "Q24006919", "Q7149553"]}, "date": "2009-12-12", "url": "http://abclocal.go.com/wabc/story?section=news/local&id=7167346&rss=rss-wabc-article-7167346", "content": "police find 2nd gun in deadly times square shooting authorities on friday said a machine pistol used by a street hustler shot dead in a times square gunfight was purchased at a virginia gun shop whose business card was found in the aspiring rapper's pocket, and they were looking for the woman who bought the gun. <mark>raymond martinez</mark>, who wrote songs about staring down cops in times square and hawked cds to tourists, was carrying a pocketful of business cards from virginia gun dealers and a stolen mac-10 pistol when he was killed by a plainclothes officer near the marriott marquis hotel. the handgun, which held 30 rounds, jammed after <mark>martinez</mark> got off three shots. jordan kelsey-stewart, 25, bought the weapon from dale's guns in powhatan, va., chief nypd police spokesman <mark>paul browne</mark> said. officials with bureau of alcohol, tobacco, firearms and explosives are trying to find her and are investigating whether she had any connection with <mark>martinez</mark>; a telephone listing for her could not immediately be found on friday. view all 10 photos police said kelsey-stewart reported the gun stolen from her car oct. 28 in richmond, va. it was unclear how <mark>martinez</mark> obtained it, and there was some evidence he owned it for only a brief period of time - weeks at most and perhaps just days. investigators also were trying to determine whether <mark>martinez</mark> had other weapons. they said they found a .22 - caliber handgun during a police search of <mark>martinez</mark>'s home on friday. story: exclusive: times sqr. gunman's mom talks to ewn story: suspect killed in times square shooting more: see news? send it to eyewitness news! more: get email updates: pick your topics here \"we're actively investigating whether he was involved in purchasing firearms,\" <mark>browne</mark> said. dale blankenship, who owns dale's guns, said he provided the information about who bought the gun to the atf earlier friday. he said kelsey-stewart was from the richmond area, had all the proper identification and passed a background check when she purchased the weapon. blankenship said she bought the gun by herself. he didn't know what happened to the gun after he sold it. \"i have no idea,\" he told the associated press. \"i really don't know what happened. i don't know how the gun was stolen.\" <mark>martinez</mark>, 25, went by the rap name \"ready\" and regularly sold cds for his group, square free, in times square. he was part of a freelance collection of hawkers who sell self-produced wares on the street. police said <mark>martinez</mark> ran a scam in which he would autograph a cd or put a passerby's name on it, and then demand payment of $10. he had been arrested june 19 at 1515 broadway, the exact same location where thursday's confrontation started, for not having a tax stamp, which allows hawkers to sell their self-produced wares. vendors selling their own work are protected by the first amendment and fall outside the stricter regulation of vendors selling retail goods. the sheer number of vendors in times square and their aggressiveness lead to frequent confrontations with authorities trying to catch counterfeiters and protect tourists from scams. <mark>martinez</mark> and his brother are well known to regular times square denizens and videos of them rapping and getting hassled by police are posted on youtube. in one shaky video, <mark>martinez</mark> shouts, \"they ain't taking me nowhere!\" and \"i'm ready to lay some down!\" as officers, their hands in their pockets, escort him from the area. his lyrics talk of hawking cds and staring down cops. sgt. christopher newsom usually works in uniform on a task force that tracks aggressive peddling. he was in plainclothes when he stopped <mark>martinez</mark> on thursday and asked him for his tax stamp, setting off the chase and shootout. josiah deandrea, who was distributing fliers friday to a comedy act a block from the shooting scene, said he had seen <mark>martinez</mark> in the area in the past. \"nobody had any idea he had a gun,\" deandrea said. daniel o'phalen, 24, who passes out fliers in times square for the musical \"white christmas,\" said <mark>martinez</mark> was part of a regular crew of cd salesmen. sometimes, he said, the group would order him off a corner, saying he was on their territory. \"they're pushy. they're not nice guys,\" he said. still, it's rare that police encounters with peddlers escalate to gunfire. \"these are usually quality-of-life violations, and they typically do not escalate, they don't involve violators being armed,\" <mark>browne</mark> said. if <mark>martinez</mark> had recently gone looking for a gun, it wouldn't have been unusual for him to look out of state. because buying a firearm is so difficult in new york, people barred from owning pistols here often travel south to shop at gun shows where there are no required background checks for people buying secondhand weapons. <mark>martinez</mark> didn't have a license to own a firearm. there is also a steady supply of guns purchased at southern gun shops and smuggled north. mayor michael bloomberg has been a fierce critic of gun stores with a record of selling weapons that later wound up in the hands of criminals, suing several of them in recent years for reckless conduct and driving several out of business. there are \"too many guns on the streets,\" the mayor said friday. \"this is one of the great public health threats. and our police officers are clearly in danger.\" the machine pistol like the type used thursday are rare in the city: only 26 have been recovered so far this year, compared with 5,427 other guns. in 2008, there were 46 recovered, and 5,959 other guns .--associated press writers cristian salazar, david b. caruso, adam goldman, ula ilnytzky and sara kugler in new york and dena potter in richmond, va., contributed to this report. contests, promotions, and registration"}, {"articleID": "2014031900_00021548_W", "names": {"Peter Grant": ["Q19882721", "Q20027846", "Q27486091", "Q3067879", "Q3376624", "Q7174337"], "Frans Steyn": ["Q181263", "Q3752066"]}, "date": "2014-03-18", "url": "http://www.supersport.com/rugby/article.aspx?Id=2363534", "content": "Please enter your email address / username. Please enter a valid email address / username. Please enter a valid email address. Please enter a valid email address. Tweet With 92 Vodacom Super Rugby caps and nearly 850 points behind his name, the return of <mark>Peter Grant</mark> has been a big plus for the DHL Stormers on their tour of Australasia. The 29-year-old flew straight from Japan earlier this month to join up with his teammates for the start of their tour and he has played off the bench twice this season - against the Crusaders and the Chiefs. While his second-half cameos were not able to help the Stormers to victories over the past fortnight, the man himself is looking forward to more game time against the Brumbies in Brisbane this Saturday (kick-off 10h40 SA time) and the next weekend against the Reds. \"I was buzzing when I came off the field against the Chiefs,\" <mark>Grant</mark> told www.iamastormer.com from his team's base in Coogee on Tuesday, \"it was great wearing the Stormers jersey again after a year away.\" Just to be part of this team again...it's always a great honour to be involved with the Stormers and I'm really looking forward to more game time in the coming weeks. \"His on-field abilities aside, as a no-nonsense defender and accurate goalkicker, <mark>Grant</mark> knows that he also has a big role to play off the field as a long-time and experienced member of this squad.\" The young guys seem to have some respect for me, \"said <mark>Grant</mark>, half-chuckling at the notion.\" But I don't think it's about me arriving here and just barking orders. It's about backing up someone like Jean de Villiers, who does a lot of the talking, and also (backline coach) Robbie Fleck who I have a good relationship with. \"In the past we had myself, Jean, Bryan Habana, Jaque Fourie and Dewaldt Duvenage all being able to contribute as experienced players - now it's myself, Jean and Gio Aplon who the younger guys are leaning on and we have a responsibility to help them where we can.\" Last weekend, against the Chiefs, I was actually a bit too frantic at times - probably because I was overly excited to be out there playing again! It's something I admitted when speaking to (coach) Allister Coetzee earlier this week. We must remain calm and it's up to us more experienced players to lead by example in that department. \"I think I will find my voice more as the season progresses, so for me game time will be key. I didn't play a lot in this recent stint in Japan, between my early-season injuries and (later on) with the two-foreigners-per-team rule, but I'm hungry to play more and to contribute on any level for the Stormers.\" <mark>Grant</mark> made his Super Rugby debut back in 2006 - against the (then) Cats - and he toured Australasia for the first time as a Stormers player later that season. The team won two from four on that tour (two wins in Australia and two defeats in New Zealand) and the experienced Stormers No 10 sees a lot of similarities between then and now. \"My first two tours as a Super Rugby player, 2006 and 2007, were tough for us as a team but I remember that the older players around us simply kept telling us younger guys to remain calm on the field, no matter what.\" We still have two games left on this tour and our aim is to pick up two wins, which would mean we could return home from a tough tour with another nine/ten points to go with our home win over the Hurricanes, which would be a huge boost ahead of seven home games between then and July. Great moments in Currie Cup history Steeped in history and tradition, the Currie Cup dates back to 1891 and is one of the oldest rugby competitions in the world. Rugby in our blood Read about Oscar Pistorius' first love and Joost van der Westhuizen's one love. Plus, true stories from Smit, Skinstad, Kallis, Holomisa, Schuster & more. More expert analysis and opinion from Sport24 Why the Sharks are razor sharp While New Zealand franchises have traditionally proved Super Rugby powerhouses - most recently...No need to get carried away Sometimes as a commentator your instincts take over, and you make a call based on what you think is...The rocket-launching option The strong performance that <mark>Frans Steyn</mark> turned in at flyhalf for the Sharks against the Lions at ..."}, {"articleID": "2018072910_00135037_W", "names": {"Derek O'Brien": ["Q5262230", "Q5262231", "Q5262233", "Q5262236"]}, "date": "2018-07-29", "url": "http://indiatoday.intoday.in/india/tamil-nadu/story/photo-of-karunanidhi-in-kauvery-hospital-out-condition-stable-1299475-2018-07-29", "content": "A photograph from inside the Kauvery Hospital in Chennai where DMK chief M Karunanidhi is admitted has surfaced today. It shows Vice President M Venkaiah Naidu meeting Karunanidhi for inquiring about his health condition. Along with Naidu were Tamil Nadu Governor Banwarilal Purohit and Karunanidhi's family members. Naidu said doctors informed that Karunanidhi's condition was stable. \"Visited Kaveri Hospital and met former Chief Minister Thiru Kalaignar Karunanidhi. Met his family members and doctors and enquired about his health. Doctors said he is stable. Wish him a speedy recovery,\" Naidu tweeted. Last night, the hospital had said, \"Karunanidhi's health condition continues to remain stable with ongoing active medical support. He is continuously being monitored and treated by the panel of expert doctors in the ICU.\" The 94-year-old DMK president, who is being treated for fever due to urinary tract infection, was admitted to the Intensive Care Unit (ICU) of Kauvery Hospital yesterday following a dip in his blood pressure. Besides Naidu, TMC leader <mark>Derek O'Brien</mark> also visited the hospital. \"I came here on behalf of the TMC and Mamata Banerjee. I met M K Stalin and Kanimozhi and inquired about Karunanidhi's health,\" <mark>O'Brien</mark> said. With inputs from PTI READ MORE | DMK patriarch Karunanidhi's health condition continues to remain stable ALSO WATCH | Karunanidhi's well-wishers gather in large numbers outside hospital"}, {"articleID": "2011121422_00090473_W", "names": {"Randy West": ["Q1351141", "Q7292507", "Q7292508"]}, "date": "2011-12-14", "url": "http://kens5.com/sports/headlines/Ex-president-of-Amateur-Athletic-Union-Robert-Bobby-Dodd-accused-of-molesting-boys-in-1980s-135617053.html", "content": "(cbs/ap/wreg) memphis, tenn. - two former youth basketball players told espn that robert \"bobby\" dodd, ex-president of the amateur athletic union, sexually assaulted them in the 1980s. \"he always somehow had a key for the room i was in, that was his m.o., coming in in the middle of the night when you are asleep and try to assault you,\" said <mark>randy west</mark>, an alleged victim, during an espn interview. the aau has launched an internal investigation into the \"serious allegations,\" said interim president louis stout. dodd, 63, is accused of masturbating in the boys' presence, hiding in a room attempting to film a boy performing a sexual act, and keeping boys' underwear in his closet, according to cbs affiliate wreg. one of the incidents is alleged to have taken place at the memphis ymca. memphis police director toney armstrong told wreg, \"the memphis police department takes allegations of child sexual assault abuse very seriously. although this case has its challenges due to the amount of time that has passed, it will be thoroughly examined; and if the investigation reveals the law was violated, the person responsible will be held accountable.\" previous article a & m-kingsville pitcher who died apparently fell you may need to allow pop up window for this step of registration welcome. thank you for becoming a member of kens5.com. you now have full access to the best local coverage and late breaking news from kens5.com. soon you will be redirected to the page you were seeking, and a confirmation email will be delivered to you. you will need to respond to the confirmation e-mail for your account to be activated."}, {"articleID": "2015111404_00093834_W", "names": {"John Doe": ["Q23727991", "Q3181360"], "Daniel Cohen": ["Q1835077", "Q3013863", "Q3013871", "Q5216825", "Q5216826", "Q53544958"]}, "date": "2015-11-14", "url": "http://in.reuters.com/article/2015/11/14/hacking-indictment-outsourcing-idINKCN0T308B20151114", "content": "Hired-gun hacking played key role in JPMorgan, Fidelity breaches NEW YORK/SAN FRANCISCO | By Jim Finkle and Joseph Menn U.S. Attorney for the Southern District of New York Preet Bharara points to a chart during a news conference in New York November 10, 2015. Reuters/Shannon Stapleton NEW YORK/SAN FRANCISCO When U.S. prosecutors this week charged two Israelis and an American fugitive with raking in hundreds of millions of dollars in one of the largest and most complex cases of cyber fraud ever exposed, they also provided an unusual look into the burgeoning industry of criminal hackers for hire. The trio, who are accused of orchestrating massive computer breaches at JPMorgan Chase & Co and other financial firms, as well as a series of other major offences, did little if any hacking themselves, the federal indictments and a previous civil case brought by the U.S. Securities and Exchange Commission indicate. Rather, they constructed a criminal conglomerate with activities ranging from pump-and-dump stock fraud to Internet casino break-ins and unlicensed Bitcoin trading. And just like many legitimate corporations, they outsourced much of their technology needs. \"They clearly had to recruit co-conspirators and have that type of hacker-for-hire,\" said Austin Berglas, former assistant special agent in charge of the FBI's New York cyber division, who worked the JPMorgan case before he left the agency in May. \"This is the first case where it's that clear of a connection.\" Berglas, who now heads cyber investigations for private firm K2 Intelligence, said additional major cases of freelance hacking will come to light, especially as more people become familiar with online tools such as Tor that seek to conceal a user's identity and location. RENTED TIME This week's indictments accused a hacker referred to as \"co-conspirator 1\" of installing malicious software on the servers of multiple victims at the direction of Gery Shalon, the alleged mastermind of the scheme now under arrest in Israel. A second indictment charges a man referred to as <mark>John Doe</mark>, believed to be in Russia, for an attack on online trading firm E * Trade. Officials have not said if the co-conspirator and <mark>John Doe</mark> were the same person, or even if the FBI knows their true identities. Law enforcement and computer security officials say that outsourced cyber-crime services - including rented time on networks of previously compromised personal computers and custom break-ins - are most readily found on underground Russian-language computer forums, where skilled attackers advertise their services. The forums are tight-knit communities where newbies must be vouched for by multiple known members and pay membership fees that cost thousands of dollars, said <mark>Daniel Cohen</mark>, who oversees an undercover team at EMC Corp's RSA Security that monitors the forums. \"You can find anything you want for an operation. Hackers, servers, software, code writing. They are all available,\" said <mark>Cohen</mark>. Individuals hide their identities even from each other, making infiltration and arrests rare. In this case, the ringleaders are accused of hiring hackers to steal contact information and other data that they then used to help convince ordinary investors to buy little-regulated stocks. Prosecutors have not disclosed how the hackers were compensated. Fees vary greatly in the cyber underground, depending on the complexity of the assignment and supply of talent available to do a particular job. Elite hackers who pull off the most technically challenging attacks might get a percentage of profits, while others might earn an hourly rate or get paid a few thousand dollars for winning access to a target's network, researchers said.PUMP-AND-DUMP All three of those accused this week - Shalon, Joshua Samuel Aaron, who is at large, and Ziv Orenstein, who is also in jail in Israel--began promoting penny stocks before the hacks took place, according to U.S. government claims. They used websites including Pennystockdiscoveries.com and Stockcastle.com to send emails as part of a scheme in which they invested in penny stocks, spread false information to boost their prices, and then sold them to make windfall profits, according to an SEC suit filed in July. Orenstein's lawyer declined to comment, and Shalon's lawyer did not return messages seeking comment. In one case in early 2012, the SEC claims that they used the website Stockcastle.com to promote shares in Mustang Alliances Inc, reaping $2.2 million, the largest pump-and-dump cited in the regulator's lawsuit. In March of that year, the British Virgin Islands Financial Services Commission issued an alert warning that two entities tied to Stockcastle were falsely claiming to be registered in the territory. That same year, the enterprise began a massive hacking spree to get contact information for investors who might be good targets, according to prosecutors. By the end of 2013 they had ordered up six hacks that provided data on tens of millions of customers, prosecutors said. They hit the mother lode in 2014 when they attacked three other firms, and stole data on 83 million customers from JP Morgan alone, prosecutors said. In addition to JP Morgan and E * Trade, the firms attacked included the mutual fund giant Fidelity Investments, Scottrade, TD Ameritrade Holding Corp and News Corp's Dow Jones unit, the publisher of the Wall Street Journal, according to court documents and people familiar with the cases. \"To do a\" pump-and-dump' operation, you no longer need 30 people behind phones in a strip mall, \"said Shane Shook, a security consultant specializing in investigating financial breaches. All you need is to find a hacker on a\" Dark Web \"forum to provide addresses from customers of financial services firms like Fidelity or JPMorgan, then hire a spam service to push out promotional emails, he said. Shalon bragged about the stock manipulation scheme, telling the hacker known as co-conspirator 1 in a web chat message that it was\" a small step towards a large empire, \"according to the indictment. His plan, Shalon told the hacker, was to distribute\" mailers \"on stocks to those customers. The hacker asked if buying stocks was popular in America, the indictment said, prompting Shalon to reply:\" It's like drinking freaking vodka in Russia. \"Shalon ultimately made good on his promise to build an empire, according to the indictments. Profits from the pump-and-dump fed into a sprawling conglomerate including offshore Internet casinos and payment-processing services for other criminal operators, such as counterfeit pharmaceutical makers. Shalon also allegedly directed hackers to attack rival casinos, stealing customer data and temporarily bringing down their websites with denial-of-service attacks, which are easily commissioned online. BUTTERFLY AND HIDDEN LYNX While this week's indictments opened the first major criminal case involving outsourced hacking, there have been other substantial break-ins that researchers believe were contract jobs. Researchers at Symantec in July attributed a series of precision breaches at Apple, Facebook, Microsoft and Twitter in 2012 and 2013 to a sophisticated gang called Butterfly, which also attacked law firms and pharmaceutical companies. Computer security firm Symantec concluded that the group likely works for hire, either for a client looking for financial gain in the stock market or for competitors. How Butterfly gets hired remains unclear. Tech criminologist Marc Goodman, author of the book\" Future Crimes \", says another group, dubbed Hidden Lynx by Symantec, may consist of contractors moonlighting from jobs with the Chinese military. here\" It's crime as a service, \"\"Goodman said.\" They take all the pain out of it. \"(Reporting by Joseph Menn in San Francisco and Jim Finkle and Nate Raymond in New York; Additional reporting from Maayan Lubell in Jerusalem; Editing by Jonathan Weber and Martin Howell .) Trending On Reuters"}]