[{"date": "2013-05-20", "url": "http://www.shropshirestar.com/education/2013/05/20/wrockwardine-wood-arts-academy-in-telford-celebrates-80th-anniversary/", "content": "Wrockwardine Wood Arts Academy celebrates 80th anniversary Former pupil <mark>David Wright</mark> MP prepares to cut the cake Current staff and pupils at Wrockwardine Wood Arts Academy organised the event to mark the milestone. And town MP <mark>David Wright</mark>, who left in 1983, and Joyce Rowding, who started in 1936, were two of the star guests. The school in New Road opened in 1933 and has steadily grown in size over the years, with more than 600 pupils now on the roll. Telford MP Mr <mark>Wright</mark>, who was born and raised in the town, said he was delighted at being invited to cut the anniversary cake. He said: \"I am so glad to be back celebrating the 80th anniversary of my school. I left in 1983 and today really has brought the memories flooding back .\" It is great to see so many people who have attended the school over the years coming back for the anniversary to share their memories. \"Great-grandmother Mrs Rowding, now of Donnington, admitted Saturday had been the first time she had returned to the school since she attended there in the 1930s .\" It is the first time I have been back and I couldn't believe it. I hardly recognise the place, so much has changed, \"she said .\" My children and their children also attended here, so three generations of my family have passed through the doors over the years. \"Widow Mrs Rowding, who has five children, 17 grandchildren and\" at least as many \"great-grandchildren, helped out on the Home Front in various factories during the Second World War after leaving school before going on to work as a home help. Headteacher <mark>John Jones</mark> said it was especially important to celebrate the anniversary with the historic school buildings due to be bulldozed in the next couple of years as part of a? 200 million improvement programme across the borough. Pupils are due to move to a new site next to Oakengates Leisure Centre in a merger move with nearby Sutherland School. In the run-up to the event on Saturday, pupils and staff launched a website and appealed for past pupils to tell them about their memories in a bid to piece together a history of the school. Mr <mark>Jones</mark> said:\" I have been absolutely delighted by the commitment of all the students, teachers, parents and governors in organising this very special event. \"Everyone who has been involved with it can feel very proud indeed and when you see how many past students have turned out to join us it makes it all worthwhile .\" Music teacher Ben Millington has played a leading role in piecing together the history of the site. He said: \"We would still like to appeal to people to go on to our website, sign our guestbook and tell us about their memories and share old pictures. We know about how the school started and we obviously know about the present but there are still a lot of gaps in between, particularly from the 1950s to the 1980s .\" The event featured performances by the senior choir, pupil rock and pop bands and also soloists. Teacher Rob Star bravely put his head on the block by asking pupils to pay for the privilege of throwing a wet sponge at him, while there was also a variety of stalls in the school playground. More than 300 past and present pupils of a Telford school, including an MP and an 88-year-old woman believed to be its oldest surviving pupil, turned out to celebrate its 80th anniversary. Staff and children at a Shropshire nursery are celebrating after being commended by education inspectors. A series of events aimed at encouraging \"Lifelong Learning' has been launched at one of Shropshire's leading schools as part of a new community involvement initiative. Telford College's new engineering centre to fill the skills gap", "articleID": "2013052101_00016286_W", "names": {"John Jones": ["Q10502076", "Q16089943", "Q16151785", "Q1829452", "Q19360718", "Q20733490", "Q22116791", "Q23022440", "Q40744539", "Q47123953", "Q47467135", "Q47545673", "Q51588437", "Q56187543", "Q56187544", "Q56274376", "Q56597672", "Q56597777", "Q56604622", "Q56678613", "Q6241998", "Q6242049", "Q6242052", "Q933190"]}}, {"date": "2013-05-20", "url": "http://www.firstpost.com/world/attention-shifts-to-white-house-in-irs-probe-800073.html", "content": "IPL spot-fixing probe Live: Rajasthan Royals suspend contracts of tainted trio - Firstpost WASHINGTON (Reuters) - Two senior aides to President Barack Obama knew weeks ago about a watchdog report on the U.S. Internal Revenue Service targeting of conservative groups, a spokesman said on Monday, shifting the focus to the White House in a fast-moving controversy. White House Counsel Kathryn Ruemmler was told on April 24 about an upcoming report by the Treasury's Inspector General for Tax Administration (TIGTA) on the IRS practice, which an IRS official apologized for on May 10, triggering the controversy. Soon after she learned of the report, Ruemmler briefed White House Chief of Staff Denis McDonough and other members of the senior staff, White House spokesman Jay Carney told reporters at 7a news briefing. Ruemmler decided there was no need to inform the president, Carney said, as the administration struggled to put a lid on the IRS affair which has become a major distraction early in Obama's second term. Carney defended White House inaction prior to the completion of the inspector general's probe, saying any intervention would have been inappropriate. In any case, he said, there was no urgency because the activity in question had stopped about a year earlier. Carney last week said Ruemmler had not necessarily been told of the contents of the TIGTA report, which found IRS agents had targeted conservative groups for extra scrutiny based on the use in their names of key words, such as \"Tea Party\" and \"Patriot .\" Ruemmler was told on April 24 the report would address \"line IRS employees improperly scrutinizing...organizations by using words such as Tea Party and Patriot,\" Carney said on Monday. \"While we had an indication of the likely findings, until the IG finalizes his report, the findings and conclusions are subject to change,\" Carney said. \"That's why we had to wait, appropriately, until the report was publicized or published for the president to be able to review it and respond, as he did very quickly,\" Carney said. Obama fired acting IRS Commissioner <mark>Steven Miller</mark> on Wednesday and called the inspector general's findings outrageous. The report found no evidence of political motivation for the targeting or of any White House involvement. There was no White House intervention at any time into the contents of the report, Carney said. POSSIBLE EXITS As the White House fought to contain the political damage, two congressional committees were preparing to hold hearings on the report, with some lawmakers calling for the Obama administration to fire more people linked to the scandal. Lois Lerner, chief of the IRS tax-exempt unit, was scheduled to testify on Wednesday to a Republican-controlled investigative committee of the House of Representatives, along with other officials. Lerner's apology on May 10 for the IRS targeting at a legal conference in Washington set off the furor. Representative Sander Levin called for Lerner's resignation on Friday, saying she had recently testified to a House subcommittee and failed to disclose what she knew about the targeting. \"This is wholly unacceptable,\" he said. Levin is the top Democrat on the House Ways and Means Committee, which writes tax law and oversees the IRS. Senate Republican leader Mitch McConnell's office on Monday drew attention to a Washington Post article that questioned Lerner's statements, including her contention that applications for tax-exempt status by groups had doubled during the time period in question. Republican Vern Buchanan, another member of the Ways and Means panel, last week called for Lerner to be dismissed. Joseph Grant, acting commissioner for the IRS tax-exempt and government entities division and Lerner's boss, said last week that he will retire. \"I don't see how Lois makes it. It's saddening to me,\" said Philip Hackney, assistant law professor at Louisiana State University who worked until 2011 at the IRS with Lerner. \"She is nonpartisan; I say that with great confidence .\" Lerner was scheduled to testify on Wednesday to the House Oversight and Government Reform Committee alongside Deputy Treasury Secretary Neal Wolin, former IRS Commissioner Douglas Shulman and Treasury Department Inspector General for Tax Administration J. Russell George. On Tuesday, George, <mark>Miller</mark> and Shulman were set to testify before the Democrat-controlled Senate Finance Committee. As the IRS scandal as widened, Republicans have focused on what officials knew about the targeting and when they knew it. The inspector general's report showed that the targeting got under way in mid-2010. In 2011, Lerner was told about how the practice was being handled at a Cincinnati field office. She halted the use of the controversial key words, but lower-level employees by January 2012 had resumed using them. At a first congressional hearing on the matter last Friday, Republicans made clear they are looking beyond the IRS. \"This appears to be just the latest example of a culture of cover-ups and political intimidation in this administration,\" Republican House Ways and Means Chairman Dave Camp said on Friday. Democratic Senate Finance Committee Chairman Max Baucus and top committee Republican Orrin Hatch on Monday requested documents on possible White House involvement and sought nearly 300 tax-exempt status applications delayed by the targeting. Firstpost encourages open discussion and debate, but please adhere to the rules below, before posting. Comments that are found to be in violation of any one or more of the guidelines will be automatically deleted: Personal attacks/name calling will not be tolerated. This applies to comments directed at the author, other commenters and other politicians/public figures Please do not post comments that target a specific community, caste, nationality or religion. While you do not have to use your real name, any commenters using any Firstpost writer's name will be deleted, and the commenter banned from participating in any future discussions. Not just niceties, China and India need to focus on thorny issues India's discourse with China has traditionally been trapped in the Mao-ist maze that defines how \"friends\" ought to conduct themselves. But Chinese statecraft has evolved, and India too must up its diplomatic game. Why the Indian media gives a damn about poverty In that sense the poverty line of India is cruel. It is merciless and doesn't allow the majority of Indians any money for shelter or access to education or healthcare or sanitation or anything else that civilised nations would consider as essential as food. Can the party resolve internal discord and take a call on Modi's PM candidature? Try following a game on twitter or with friends or at the ground. At every step of the way, the spot-fixing question raises itself. Movie Review: \"The Reluctant Fundamentalist' leaves you dissatisfied If you forget the politics and just look at the film, The Reluctant Fundamentalist doesn't fare much better. It's a thriller that lacks tension and suspense. After monitoring a phone call, the investigation had virtually turned pan-India with some of the bookies based in Gujarat and Mumbai. Ex-Citi CEO Vikram Pandit, JM Financial join hands for banking foray in India JM Financial will nominate Pandit as the non-executive chairman of the proposed bank. Pandit and Aiyar will have the right to purchase shares up to the amount prescribed by the RBI in this entity. Movie Review: The Great Gatsby is the most Bollywood of Baz Luhrmann's films The great American dream is an integral part of America. It's\" great' in that it symbolises not truth, but hope when the truth is disillusioning; it symbolises not facts, but ideals when facts are unnerving; it symbolises not likelihood, but promise when likelihood is all but bleak. Google I/O 2013 keynote: New Maps, Search, Plus, and S4 with \"pure' Android We're tracking the Google I/O conference 2013 live - what will be unveiled? Hero worshipped in Kerala, Sreesanth still innocent in his state The summary of the response in his Sreesanth's home turf is that of incredulity. They are unwilling to believe that the pacer is guilty. The original promise of the Dreamliner has failed to materiallise due to limitations in its flying range. Will Air India continue to pay a price for this? The UPA ads eulogising MGNREGA as a a huge success needs to be taken with bags of salt. The scheme did make a difference, but not as is claimed. Angelina's breast surgery possible in India, but there's a catch So can we test in India and gain from the same treatment privilege that Jolie had? Yes, but there is a catch. Live detailed updates as KKR take on Pune in a must-win game at Ranchi. Bedi's argument that we should focus on the legal wrong committed by the girl slapped by cops is technical, disingenuous and enabling. The\" two heads \"power arrangement between Congress president Sonia Gandhi and Prime Minister <mark>Manmohan Singh</mark> is coming apart at the seams. Lessons from Karnataka: Cong must stop backing corrupt leaders in Andhra The fact that it has allowed individuals named in chargesheets to continue as ministers is evidence that the Congress runs Andhra Pradesh as if it is its fiefdom, without a care for ethics in public life. IPL 2013: How Isa Guha is changing perceptions about cricket presenters Isa Guha is not your usual female cricket presenter. Apart from being an ex-player, she's highly educated and injects a breath of fresh air on Indian screens. Android and Chrome aren't merging for now, says Google's Sundar Pichai The fate of the two ministers is reportedly in the hands of the Prime Minister who has been told to take a final call. The Sarabjit-Sanaullah episode shows that for all of India's attempts to project itself as an emerging global power, with a footprint larger than just the South Asian peninsula, it is unable to break out of its hyphenated relationship with Pakistan. Changing dynamics: Is low-cost flying becoming really high cost? Consumers may have to pay a high price for both the lower price and increased choice.", "articleID": "2013052106_00016005_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"], "Steven Miller": ["Q16225127", "Q20404318", "Q7615056", "Q7615057", "Q7615058"]}}, {"date": "2013-05-23", "url": "http://www.belfasttelegraph.co.uk/sport/football/premier-league/manchester-city-face-long-haul-to-win-over-new-york-citizens-29290722.html", "content": "Gunmen have kidnapped the father of Afghanistan's national cricket team captain, the sport's chiefs said. Groups of youths have burnt down a restaurant, torched more than 30 cars and injured three police officers in a fourth night of riots in suburbs of the Swedish capital. Manchester City face long haul to win over New York citizens There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Manchester United command and the Abu Dhabi-owned side do not. The marketing materials for the new club are identikit Manchester City. There was sky blue everywhere at the official launch of the club in east Harlem. Manuel Pellegrini faces call on Carlos Tevez contract as Manchester City name starting date Manuel Pellegrini is expected to meet his new Manchester City players a week on Monday, seven days after the club's anticipated confirmation that he is to succeed <mark>Roberto Mancini</mark> and become first-team coach. The Rolling Stones' return to Hyde Park will see them team up with former guitarist <mark>Mick Taylor</mark>, but there will be no reappearance of the white dress Mick Jagger wore at the original 1969 gig because he has lost it. The Hangover III star <mark>Heather Graham</mark> says she will miss playing sexy stripper Jade because the excitement makes up for her \"boring\" real life. Khlo? Kardashian believes girls can never wear too many \"sparkles, glitz and bling\". Alexa Chung: Heartache inspires trends Alexa Chung has joked that in times of turmoil you can get away with more risky fashion choices than usual. Artificial light from gadgets \"disrupting sleep' Electric lights, including those illuminating laptop computers, smartphones and tablets, often play a key role in causing people to sleep badly, a leading expert has said. Microsoft finally unveils its Xbox ONE console Don Mattrick, the software giant's president of Interactive Entertainment, has told an audience of gaming journalists at Microsoft HQ in Redmond, Washington, that the new Xbox ONE console is not simply a games console, but\" The ultimate all-in-one home entertainment system \". Plenty of Fish dating site pulls\" Intimate Encounters' option to ward off sleazy men New York Giants quarterback Eli Manning looks downfield for <mark>James Milner</mark> By Ian Herbert - 23 May 2013 There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Whelan hopeful Martinez will stay Yankees was dominated by the story of what the paper described as \"inserting a soccer stadium into the green lungs of Queens County\". Its headline - \"A Team Is Born, but Not All Cheer\" - captured the mood. City's chief executive Ferran Soriano insisted the club were not mindless colonisers. \"In England we run a football club which takes its place in the community very seriously. It embraces its community, listens to its community and that will be exactly the same approach we would aim to take over here. We will listen to people. This is not a marketing trick, this is about soccer. It begins and ends with playing good soccer and we will do our best to be the best .\" Woolwich: Two arrested after separate attacks on mosques as English Defence League supporters clash with police Awesome Cannes: Russian model Irina Shayk and Alessandra Ambrosio dazzle at \"All is Lost' premiere Woolwich: Police shoot two men after soldier is beheaded in London street <mark>Kate Middleton</mark>: nice-but-dull Duchess cuts an annoying baby bump pose You will never be safe: chilling words of man filmed wielding a meat cleaver after soldier is hacked to death in the streets of London FHM's sexiest women poll sees Mila Kunis knock Tulisa off her perch Power NI faces customer exodus over an 18% jump in charges Cannes glamour - stars doll up for red carpet stroll Left Midfield - Ralph Milne The man Ferguson himself labels as his worst ever signing despite only setting him back? 170,000 is almost totally unheard of, largely because he failed to impress at United, contributing almost nothing on the pitch. In some ways he was the second coming of George Best unfortunately this was restricted to his activities off the pitch and Milne recently admitted he squandered most of his money on alcohol, women, and gambling. United was to be his last professional club in England .\" > Sir Alex Ferguson's worst ever starting XI at United FHM's sexiest women - Kunis knocks Tulisa off her perch <mark>Sergio</mark> Garcia/Tiger Woods row: is golf racist? The joke wasn't funny any more. It never was, of course, and the sense of revulsion felt by all in golf weighed heavily on <mark>Sergio Garcia</mark>. Manchester City face long haul to win over New York citizens There is an abundance of evidence already that Manchester City's new little brother club in New York City - \"NYCFC\" , as they are already being called here - will be a mini-City in every way, using the access to the American market place to drive up the kind of awareness that Manchester United command and the Abu Dhabi-owned side do not. The marketing materials for the new club are identikit Manchester City. There was sky blue everywhere at the official launch of the club in east Harlem. Manuel Pellegrini faces call on Carlos Tevez contract as Manchester City name starting date Manuel Pellegrini is expected to meet his new Manchester City players a week on Monday, seven days after the club's anticipated confirmation that he is to succeed <mark>Roberto Mancini</mark> and become first-team coach. <mark>Sergio Garcia</mark> fights for reputation as Tiger Woods slams \"hurtful' joke By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2013052316_00054649_W", "names": {"Heather Graham": ["Q224026", "Q28592327", "Q427886"], "James Milner": ["Q191136", "Q57324227"], "Kate Middleton": ["Q10479", "Q17506155"], "Mick Taylor": ["Q312696", "Q6834811"], "Roberto Mancini": ["Q23289352", "Q48330", "Q55466310"], "Sergio Garcia": ["Q19878179", "Q3479663", "Q7454265", "Q7454266", "Q7454268"]}}, {"date": "2013-05-24", "url": "http://www.digitaljournal.com/article/350712", "content": "What would Captain Kirk do if ordered to fire burners into the cabin supposedly occupied by Chis Dorner? In \"Star Trek Into Darkness,\" we saw Kirk's solution: disregard immoral and illegal orders and bring the suspect back alive for trial. In the latest Star Trek movie, Captain Kirk is ordered to fire 72 torpedoes at a supposedly deserted planet to execute a man who killed Star Fleet officers, including Kirk's mentor and father figure. This is not unlike the situation with Chris Dorner, where officers were told that Chris had a vendetta against the LAPD and was executing officers and families of officers. While there were no witnesses to the supposed killings attributed to Chris Dorner, Captain Kirk observed the killing spree of John Harrison/Khan. As much as Kirk might have wanted revenge, his sense of justice overrode any anger and he disregarded orders to murder the accused, a choice that rendered Kirk a fugitive himself and risked the lives of his entire crew. This is in stark contrast to the deadly manhunt for Chris Dorner, the firing of burners into the cabin and the lack of any attempt to bring the man back alive for trial. It is important to remember that Chris Dorner was never convicted of anything. He died an innocent man under the laws and Constitution of this country. Unlike with Khan, there appears to be little or no evidence that Chris Dorner killed anyone, though the mainstream media may have told you otherwise. Adding to the tragedy of the Chis Dorner execution is the fact that media outlets throughout the country, without sufficient evidence, claimed that Dorner wrote a manifesto that was clearly written by two different people. Portions of this false manifesto were repeated and repeated in the media for the purpose of firing up the public to support a pre-trial execution. It used to be that the press would place the word \"alleged,\" before an unproven accusation. This was not the case with Chris Dorner. Among the media outlets that joined those cheering on the deprivation of Chris Dorner's rights was opednews.com. Editor-in-Chief and Managing editors Rob Kall, Lisa Milazzo and Meryl Ann Butler officially opposed Dorner's Sixth Amendment right to trial and became cheerleaders for the cook-out. I was an editor at OpEdNews at the time the Dorner story broke. I could not in good conscience remain silent and go along with that site's opposition to one of the most important Amendments to the U.S. Constitution. In refusing to go against my conscience, I joined a large group of former editors and writers who objected to policies that promoted the pharmaceutical industry, the nuclear industry and other matters unrepresentative of OEN's claim that it was liberal and progressive. OEN went further. One of the Kalls actually emailed threats of sending Homeland Security after people complaining about Close-up of security camera across street from parking garage Look again at the picture of the video camera that would have recorded anyone entering or leaving the parking garage where Monica Quan and <mark>Keith Lawrence</mark> were supposedly killed on February 3, 2013. The video was confiscated by the Irvine Police Department. If it showed Dorner entering and leaving, that would have proven that he very well might have done the killings. The video could end the questions. It would be in the public interests to see what happened that night and know that the right man was barbecued--unless that is not what the video shows. So I filed a Freedom of Information request to see the video. Jennifer Kaiser, Business Services Administrator of the for the Irvine Police Department. responded with a denial, citing California Government Code 6254 (f) Here is the exemption within that section: \"the public interest in withholding those records clearly outweighs the public interest in disclosure .\" In other words, the denial had nothing to do with privacy or concerns about police work in progress. It was a concern about the effect on the public of seeing the truth. Is this an admission that the truth is that someone other than Chris Dorner killed Monica Quan and <mark>Keith Lawrence</mark> and the public would revolt if it knew what really happened? Please read other articles on this case. \"A good cup of coffee to go with your police shootouts and burning cabins, but was it really Dorner who was killed?\" \"Op-Ed: March for Women's Rights honors those killed by police .\" Star Trek Into Darkness. It's fun, action-packed, and may actually teach your kids a sense of morality and justice they won't learn from the mainstream media or from those who supported the frying of an untried man at Big Bear. As previously noted, Chris Dorner was innocent under Constitution and laws of the United States of America. He had as much of a right to live as you or I. Before you believe the hype and write off Chris Dorner as not your problem, think of this. If Southern California law enforcement officers are killing innocent people in violation of the U.S. and California Constitutions and a host of other laws, how much danger are you and your family in? What officials did to Dorner, they can do to you or to your brother or to your sister or to your child. Is that the future you want for yourself and your family? There is still time and we still have rights but maybe there isn't too much time and maybe soon, there won't be any rights Martin Niemoller) First they came for Lynne Stewart. and I didn't speak out because I wasn't Lynne Stewart. and I didn't speak out because I wasn't Bradley Manning. and I didn't speak out because I wasn't Julian Assange. and I didn't speak out because I wasn't Chris Dorner and I didn't speak out because I wasn't Dzhokhar Tsarnaev. Amazon to monetize fan fiction using new platform \"Kindle Worlds' Op-Ed: Flying a drone over your neighbour's place - No, it's not OK", "articleID": "2013052420_00098381_W", "names": {"Keith Lawrence": ["Q18737087", "Q6384633"]}}]