[{"articleID": "2009092420_00014056_W", "names": {"Jeff Cogen": ["Q16728119", "Q21005401"], "Ted Wheeler": ["Q43381254", "Q7693864"]}, "date": "2009-09-24", "url": "http://oregonlive.com/portland/index.ssf/2009/09/state_rep_chip_shields_is_legi.html", "content": "portland neighborhoods \"state rep. chip shields is legislature's newest senator from portland shields state rep. chip shields will replace sen. margaret carter to represent portland's district 22. the multnomah county board of commissioners selected shields after an hour-and-a-half question-and-answer session. the public was not allowed to comment. in the original vote, commissioners deborah kafoury and <mark>jeff cogen</mark> supported candidate karol collymore, and judy shiprack and diane mckeel voted for shields. chairman <mark>ted wheeler</mark>, who voted last, chose joann bowman, which would have triggered a revote. but then <mark>wheeler</mark> switched his vote to shields after telling bowman that because she'd received just one vote it wasn't her day. shields was considered the favorite against collymore, an aide to <mark>cogen</mark>, and bowman, a community organizer and former state representative. they'd all been selected by the multnomah county democratic central committee from a pool of seven. shields will take over for carter, who resigned to take a job with the oregon department of human services. the commissioners faced pressure to strongly consider a black candidate to fill the seat in the district that holds about half the black people in the portland metro area and more black constituents by far than any other senate district. with carter's departure, just two people of color remain in the oregon senate, both republican. <mark>wheeler</mark>, citing prodding from constituents and several media stories and opinion pieces, asked the candidates whether race should matter in the board's decision. shield's, the only white candidate, was up to answer first, which drew some ironic laughs from the crowd.\" i do believe ethnicity, gender, sexual orientation and diversity in general are significant, \"he said. if all things are equal, he said, they have a role. but he pointed out where he thought things were not equal between the candidates, citing his lengthy and successful track record in the legislature. bowman said:\" all things are not equal. we live in an unequal society. when i hear things being phrased if all things are equal, i wish we lived in an equal society, but we don't. what i can tell you is that when i walk into a legislative building and nobody looks like you. \"and collymore answered the question by referring to a tv show she watches about a white suburban mom who deals drugs from her home, but how collymore found herself afraid of the black drug dealers on the show. she said that says a lot about how others view black people and how black people view themselves.\" the only way that can change is when we start to integrate people of color \"into higher office, she said. yet shields received backing from several prominent community african americans, including carter's daughter. he brought some black supporters to the meeting and pointed to them and said how he has helped them. before casting her vote, kafoury said:\" this is the only district where we're talking about does race matter. that is a tragedy and an opportunity. i hope these conversations happen all across oregon and not just the north and northeast portion. \"shiprack and mckeel said it really is the decision of district 22 constituents and so they were going to cast their ballot with the democratic committee, which gave shields the majority of its votes. 0) {document.location.href =d. options [d.selectedindex]. value;} return false;\" >> \"type =\" image \"width =\" 33 \"height =\" 13 \"> © 2009 oregon live llc. all rights reserved. use of this site constitutes acceptance of our"}, {"articleID": "2012032907_00060828_W", "names": {"Jack White": ["Q10539822", "Q24073723", "Q272031", "Q6115762", "Q70713"]}, "date": "2012-03-29", "url": "http://tennessean.com/article/20120329/BUSINESS01/303290061/2275/RSS05", "content": "an estimated 800 homeless people from across middle tennessee were helped at the event. metro has received a nearly $400,000 federal grant to study the area south of broadway and the...predators lock up playoff berth the nashville predators clinched their seventh playoff berth in eight seasons without playing after...wyoming transfer austyn carta-samuels is hoping to push jordan rodgers for vanderbilt's starting...this watercooler dispenses free beer, business advice and a behind-the-scenes look at nashville's...bills in the tn legislature call for closer scrutiny of tennesseans who get weekly unemployment pay...annie thurman arrives at the world premiere of the hunger games on march 12 in los angeles. annie thurman is a 15-year-old nashville girl who is one of the tributes killed in \"the hunger...i'm not exactly part of the target market, but there's no denying the nostalgic fun of too old for...celebrity column: taylor swift to receive award from michelle obama i love the beginning of spring for the flowers bursting into pastel blooms, the beautifully budding...food is the star in food stylist <mark>jack white</mark>'s world. allie greiner, right, takes notes during a training session inside brooks brothers to prepare for today's relaunch of opry mills mall, which officially reopens to shoppers at 10 a.m. zoom allie greiner, right, takes notes during a training session inside brooks brothers to prepare for today's relaunch of opry mills mall, which officially reopens to shoppers at 10 a.m. a painter puts final touches on a storefront in preparation for today's reopening of opry mills mall, which was forced to close after the may 2010 flood. opry mills' resurrection is almost complete. mall officials, contractors and store employees scurried to put on the final touches wednesday in preparation for a grand reopening today - one year, 10 months and 27 days since the swollen cumberland river damaged the shopping center, forced its closure and prompted a $200 million makeover and an ongoing insurance lawsuit. inside, workers polished tile floors and walls, added touch-up paint and vacuumed construction dust. mall officials monitored the progress via walkie-talkies as they hosted a sneak preview for the news media. outside, a steady stream of cars - driven by curious would-be shoppers and other onlookers - circled the complex as workers painted stripes, crosswalks and parking emblems on the repaved parking lot.\" it's so exciting to see it reopen again, \"said ada nosowicz, a national account manager for mall operator the mills, who was at opry mills when it originally opened in 2000. belle meade police officer's facebook posts about trayvon martin raise questions david climer: pat summitt should end tennessee lady vols' pain by retiring belle meade police officer's facebook posts about trayvon martin raise questions opry mills mall reopens today opry mills' resurrection is almost complete. keep up with the protests at legislative plaza and the legal battles surrounding them."}, {"articleID": "2018090909_00081225_W", "names": {"Sergio Ramos": ["Q483309", "Q514286"], "Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"], "Luis Enrique": ["Q222789", "Q322350"]}, "date": "2018-09-09", "url": "http://www.90min.com/posts/6166114-real-madrid-s-sergio-ramos-reveals-death-threats-to-his-family-after-mohamed-salah-injury", "content": "Spain and Real Madrid captain <mark>Sergio Ramos</mark> has revealed that \"death threats' were sent to his family after his infamous incident involving <mark>Mohamed Salah</mark> in the Champions League final in June. The incident in question saw <mark>Ramos</mark> lock arms with <mark>Salah</mark> in a challenge, leading to an awkward landing and a subsequent game-ending injury that put the Egyptian's World Cup participation at risk.  ️ @ SergioRamos joined Real Madrid #OnThisDay in 2005!  2014, 2016, 2017, 2018 #UCL pic.twitter.com/kJecF86c8c--UEFA Champions League (@ ChampionsLeague) September 8, 2018 Real went on to win 3-1, and despite <mark>Ramos</mark>' repeated insistence that his\" conscience is clear', some fans have not let the incident go. Upon his visit to Wembley with Spain for the first round of Nations League fixtures, <mark>Ramos</mark> received a hostile reception. Speaking after the match, he told ESPN: \"One tries to evade the boos. In the end you feel it, but I stay out of everything. It doesn't affect my game.\" I would have liked another reception because people only remember the action of the final, and nobody remembers the death threats that my family and my children received. Any time <mark>Sergio Ramos</mark> is on the ball he's met with a chorus of boos. I guess some Liverpool fans are at Wembley  #ENGSPA pic.twitter.com/KPgMSzAuKZ--90min (@ 90min_Football) September 8, 2018 \"It is a very sensitive issue that people maybe take as a joke about and that's why they whistle in a great stadium like this. My conscience is very clear. I do not have to give more explanations.\" The victory over England eased tensions in the Spain national side after a disappointing World Cup, and gave <mark>Luis Enrique</mark> victory in his first game in charge. <mark>Ramos</mark> was a prominent topic of conversation with new La Roja boss <mark>Enrique</mark>, who hailed his captain's leadership qualities. \"When you see him compete you see that he is special,\" the former Barcelona boss said, via Marca. \"He is a great leader in any situation and a person who leads on the pitch and off it.\" I'm thrilled about him and hope that he is with us for a long time. He has exceeded what I expected of him. \""}, {"articleID": "2017071818_00654828_W", "names": {"Russell Dickerson": ["Q24572267", "Q58067337"]}, "date": "2017-07-18", "url": "http://klaw.com/thomas-rhett-wife-lauren-date-night-sunset/", "content": "Thomas Rhett and Wife Lauren's Pre-Baby Date Night Features Sunset, Dolphins By Cillea Houghton July 18, 2017 11:40 AM | Taste of Country Share on Facebook Share on Twitter Sunset date night at the beach A post shared by ThomasRhettAkins (@ thomasrhettakins) on Jul 17, 2017 at 5:31 pm PDT Thomas Rhett and his wife Lauren have been on a beach vacation, and Rhett shared a sweet video of the two of them enjoying a sunset date night. Rhett shares that they were on a kayaking adventure and decided to pull over to a little sandbar and watch the \"sick\" sunset from the beach. But they had some special guests--dolphins can be seen popping their heads out of the water in a video he posted on Instagram. \"Oh they're so close!\" Lauren adorably gushes. \"Date night to the sandbar. The colors God painted tonight were unbelievable aaaand dolphins were playing in the sunset right in front of us,\" she writes on her own Instagram page, describing the gorgeous evening. It's Bikini Season for These Country Mamas-to-Be Subscribe to KLAW-FM on This is just one of many glimpses of the couple's tropical getaway that they've shared. Rhett posted a cute photo of he and his pregnant wife in the water, with Lauren showing off her baby bump in a bikini and her husband dubbing her a \"100% smoke show.\" She's set to give birth to their second daughter on August 8. After a year-long adoption process, the beloved country music couple brought home Willa Gray from Africa in spring of 2017, just months after announcing they were pregnant with another little girl. Rhett just scored another No. 1 hit with his most recent single, \"Craving You\" featuring Maren Morris, which serves as the lead single off his upcoming third studio album that will drop in fall of 2017. He's currently on his 2017 Home Team Tour with openers Kelsea Ballerini, <mark>Russell Dickerson</mark> and the newly-engaged Ryan Hurd. Baby Bump on the Mind? Check Out These! Image of Next: See Country's Best Baby Announcements Source: Thomas Rhett and Wife Lauren's Pre-Baby Date Night Features Sunset, Dolphins Filed Under: Thomas Rhett Category: Country Music News Share on Facebook Share on Twitter More Leave a comment Send to a friend! Print this page Pin it! Reddit This! Share on Tumblr!"}, {"articleID": "2018092515_00080540_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"], "Jon Peters": ["Q2563751", "Q27983586"], "Todd Phillips": ["Q362824", "Q7812568"], "John Gregory": ["Q28016802", "Q49783724", "Q55739798", "Q6236260", "Q942124"], "Robert Carson": ["Q3434739", "Q43911818"]}, "date": "2018-09-25", "url": "http://www.comingsoon.net/movies/trailers/986957-new-a-star-is-born-teaser-previews-lady-gaga-song-is-that-alright", "content": "By Maggie Dela Paz ON September 25, 2018 BEGIN SLIDESHOW New A Star is Born teaser previews Lady Gaga song \"Is That Alright?' Lady Gaga took to Twitter to release a new teaser for Warner Bros.. Pictures\" s upcoming A Star is Born featuring a short preview of one of the films' song \"Is That Alright?\" The ballad track was written by Gaga along with other collaborators including \"Born This Way\" producer DJ White Shadow and Lukas Nelson. Check it out below! RELATED: A Star is Born Soundtrack Now Available For Pre-Order A Star is Born stars four-time Oscar nominee <mark>Bradley Cooper</mark> (American Sniper, American Hustle, Silver Linings Playbook) and multiple award-winning, Oscar-nominated music superstar Lady Gaga (as Stefani Germanotta), in her first leading role in a major motion picture. <mark>Cooper</mark> helms the drama, marking his directorial debut. In this new take on the tragic love story, <mark>Cooper</mark> plays seasoned musician Jackson Maine, who discovers--and falls in love with--struggling artist Ally (Gaga). She has just about given up on her dream to make it big as a singer...until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons. The cast of A Star is Born also includes Andrew Silverstein (aka Andrew Dice Clay), with Dave Chappelle and Sam Elliott. RELATED: A Star is Born Trailer Starring <mark>Bradley Cooper</mark> & Lady Gaga In addition to playing Ally, Gaga, who earned her Oscar nod for the song \"Til It Happens to You\" from The Hunting Ground, performs original songs in the film, which she wrote with <mark>Cooper</mark> and a handful of artists, including Lukas Nelson, Jason Isbell and Mark Ronson. All the music is original and was recorded live. A Star is Born is being produced by Bill Gerber, <mark>Jon Peters</mark>, <mark>Bradley Cooper</mark>, <mark>Todd Phillips</mark> and Lynette Howell Taylor; with Basil Iwanyk, Michael Rapino, Heather Parry and Ravi Mehta serving as executive producers. The screenplay is by Will Fetters & <mark>Bradley Cooper</mark> and Eric Roth, based on the 1954 screenplay by Moss Hart and the 1976 screenplay by <mark>John Gregory</mark> Dunne & Joan Didion and Frank Pierson, based on a story by William Wellman and <mark>Robert Carson</mark>. The feature will arrive in theaters on October 5, 2018. Is that alright? #AStarIsBorn pic.twitter.com/aTsNiTmMXD--Lady Gaga (@ ladygaga) September 25, 2018 4 images SHARE TWEET Show Comments Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2010082419_00437303_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2010-08-23", "url": "http://nzherald.co.nz/lifestyle/news/article.cfm?c_id=6&objectid=10668520&ref=rss", "content": "expand jimena navarrete of mexico is crowned miss universe 2010 by last year's winner stefania fernandez of venezuela. photo / ap shrink from left: miss universe 2010, jimena navarrete of mexico, first runner-up yendi phillipps of jamaica and second runner-up jesinta campbell of australia. photos / ap las vegas - a 22-year-old mexico woman has won the miss universe pageant after donning a flowing red gown and telling an audience it's important to teach kids family values. jimena navarrete of guadalajara was first to answer an interview question during the competition and the last of 83 contestants standing in the headline-grabbing pageant on the las vegas strip. her one-strap gown flowed behind her like a sheet as she walked. earlier, she smiled in a violet bikini as she confidently strutted across the stage. asked by olympic gold-medal figure skater evan lysacek how she felt about unsupervised internet use, navarrete said the internet is important but parents need to be careful and watch over their children. \"i do believe that internet is an indispensable, necessary tool for the present time,\" she said through an interpreter. \"we must be sure to teach them the values that we learned as a family.\" first runner-up was miss jamaica yendi phillipps, while second runner-up was miss australia jesinta campbell. navarrete - who's been modelling since she was 15 - is mexico's second miss universe. lupita jones of mexico won the title in 1991. navarrete replaces miss universe 2009 stefania fernandez of venezuela. navarrete's win thwarted miss venezuela marelisa gibson from giving the south american country a third consecutive win. neither gibson nor miss usa rima fakih made the top 15 finalists. with fans in some 190 countries watching on television and keeping tabs on twitter, navarrete and her competitors introduced themselves while wearing over-the-top national costumes. they then danced in silver and black dresses for the show's opening number before the top 15 finalists were announced. the final 15 walked in swimsuits while cirque du soleil musicians played elvis presley songs including viva las vegas. the last 10 impressed in their gowns while john legend and the roots played a soulful medley including save room. by the end of the show, seven of the top 10 trending topics on twitter had to do with the pageant, its contestants, its judges or owner <mark>donald trump</mark>. the mogul co-owns the pageant with tv network nbc. navarrete won a package of prizes including an undisclosed salary, a luxury new york apartment with living expenses, a one-year scholarship to the new york film academy with housing after her reign, plus jewellery, clothes and shoes fit for a beauty champion. help and tech support your questions answered & how to report a technical issue feedback how to contact someone at nzherald.co.nz group sites copyright 2010, apn holdings nz limited"}, {"articleID": "2018073011_00037463_W", "names": {"Michael Hooper": ["Q6831231", "Q6831232"], "Andrew Kellaway": ["Q21621665", "Q4757590"], "Paddy Ryan": ["Q55375304", "Q7123620"]}, "date": "2018-07-30", "url": "http://hardenexpress.com.au/story/5556502/gibson-believes-folau-is-happy-at-tahs/", "content": "NSW Waratahs are hopeful they'll retain Israel Folau, who is yet to confirm his playing future. NSW Waratahs coach Daryl Gibson says there's every indication his superstar back Israel Folau is happy at the Super Rugby club and he's also backed captain <mark>Michael Hooper</mark> to be fit for Australia's first Rugby Championship game. Australia's representation in the Super Rugby competition ended last weekend when the Waratahs lost their semi-final to the Lions in Johannesburg. With teams travelling overseas in the finals disadvantaged, Gibson liked the idea of having a break during the series, along the lines of the NFL, where there is a week off before the Superbowl. NSW arrived home on Monday, with their established Test stars not having to go into the Wallabies camp until Sunday. Gibson expected some of their other players on the fringe of the Wallabies squad to get a run in Friday's trial game in Sydney. Speculation has surrounded Folau's future, with suggestions he could head to Queensland, though Gibson remained hopeful the star back would stick with the Tahs \"Obviously a lot of those negotiations are with Rugby Australia, but certainly every indication is that Israel is really happy here,\" said Gibson, who is soon expected to re-sign as head coach for another two years. Wallabies and Waratahs leader and flanker <mark>Hooper</mark> hasn't played since injuring his hamstring early in the final Test against Ireland on June 23, missing the Tahs last five games, Gibson expects the forward to be right for the August 18 clash with the All Blacks in Sydney. \"Hoops is tracking really well,\" Gibson said. \"I know he's getting a little frustrated with the delay and where he wants to be, but certainly he's on course, from what I understand, to be available for that Bledisloe.\" Gibson felt Australian players were in a good space going into that game. \"I think it's been a good year for Australian rugby in terms of Super Rugby,\" he said. \"In my view, the gap is closing against New Zealand, particularly the performances of all Australian sides against New Zealand opposition this year, so I think we're trending and heading in the right direction.\" Gibson endorsed the trial between the Wallabies squad and a team primarily comprised of other players drawn mostly from Super Rugby sides. \"I think it's become vital now, the short preparation time, getting a new team together and giving it a hitout against some quality opposition,\" he said. \"I think its the right thing, but finding that opposition is a bit tough at the moment, but I fully support what Australia are doing.\" He will be reviewing the Tahs roster with some spots to fill, with backs Taqele Naiyaravoro, <mark>Andrew Kellaway</mark> and Irae Simone leaving and veteran prop <mark>Paddy Ryan</mark> not having his contract renewed. Australian Associated Press facebook SHARE twitter TWEET email whatsapp"}, {"articleID": "2013101503_00084148_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2013-10-14", "url": "http://truth-out.org/news/item/19421-on-the-news-with-thom-hartmann-house-republicans-and-president-obama-stalemate-in-fiscal-negotiations-and-more", "content": "Parkinson's and Disability Have an Image Problem, and Michael J. Fox Isn't Helping A new show can't decide if it wants to canonize its disabled icon or poke fun at the soft-voiced people who do. In today's On the News segment: Over the weekend, House Republicans and President Obama hit a stalemate in fiscal negotiations, and the Senate moved on to work out their own plan; the debt limit fight has moved to the Senate, but that won't stop House Republicans from trying to insert a few demands into the deal; another business owner is proving that fair wages and benefits don't stand in the way of success; and more. TRANSCRIPT: Thom Hartmann here - on the news...You need to know this. Over the weekend, House Republicans and President Obama hit a stalemate in fiscal negotiations, and the Senate moved on to work out their own plan. On Saturday, after meeting with the President, House Speaker John Boehner told his party that talks with the White House had broken down. So, Senate leaders immediately started their own negotiations to deal with the government shutdown, and the debt ceiling. But, now there are new disagreements in the upper chamber about what should be offered in exchange for such legislation. What started out as a fight over Obamacare, has morphed into a debate about the sequester, tax revenues, and cuts to Social Security and Medicare. On CBS's \"Face the Nation,\" democratic Senator Chuck Schumer explained the proposal, saying, \"The plan would be, open up the government immediately for a period of time before the sequester hits, and then have serious discussions where we might be able to undo the sequester.\" However, President Obama already rejected a similar plan offered by House Republicans. That plan would have opened the government, raised the debt ceiling, and replaced the next round of sequester cuts with cuts to Social Security and Medicare. And, it appears unlikely that Senate Republicans will accept a plan that repeals the sequester without equal cuts to another program. Republican Senator Bob Corker said, \"I just can't imagine how that has any possibility of becoming law.\" But, at least Senate leaders are still talking, and still working with the White House to find a way to avoid default. As the debate continues, the debt ceiling deadline grows closer, and Americans - and the World - want our lawmakers to end this fight. In screwed news...The debt limit fight has moved to the Senate, but that won't stop House Republicans from trying to insert a few demands into the deal. According to the Washington Post, Representative <mark>Paul Ryan</mark> said, \"[the] House could not accept either a debt-limit bill or a government funding measure that would delay the fight until the new year.\" That is, of course, unless Republicans are allowed to use the looming deadline as leverage to delay Obamacare, and deny women coverage of birth control. In a private meeting with Republicans, <mark>Paul Ryan</mark> said that the House should demand a delay in the individual mandate, and a so-called \"conscience clause,\" which would allow employers and insurance companies to deny contraception coverage. Although it's unlikely that Senate Democrats, or the President, would ever sign such legislation, women around our nation are furious that <mark>Paul Ryan</mark> even proposed it. And, they'd like him to answer - what exactly does women's healthcare have to do with the debt limit? In the best of the rest of the news...The people of Oklahoma will soon see a big drop in their electric bills. And, it's all thanks to green energy. That state's 100-year-old power company - the Public Service Company of Oklahoma - just signed an agreement with wind farms that are being developed in that state. The company purchased 600 megawatts of power, which was three times their original plan, \"after seeing extraordinary pricing opportunities that will lower utility costs by an estimated $53 million in the first year, and even more thereafter.\" Their purchase, which is awaiting approval from the Oklahoma Corporation Commission, will provide enough energy to power 200,000 homes. In addition, just one of these three developing wind farms will create 200 jobs during construction, about 50 permanent jobs, and inject more than $130 million dollars into the local economy. The President of Clean Line Energy Partners, Michael Skelly, said, \"The Panhandle of Oklahoma truly is one of the mother loads of wind in this country.\" And it appears that these wind farms will bring a mother load of savings and new jobs to the state of Oklahoma. Another business owner is proving that fair wages and benefits don't stand in the way of success. In a recent op-ed in The Detroit News, <mark>Paul</mark> Saginaw, owner of Ann Arbor's iconic Zingerman's Deli, called for a living wage and benefits for workers around our nation. He railed against industry groups like the National Restaurant Association for opposing a living wage, and wrote, \"Our success at Zingerman's with over 30 years of operating and opening food-related businesses was not achieved by underpaying or withholding benefits from our employees.\" Zingerman's has joined with more than 100 businesses around our nation to form a new association called \"RAISE.\" The group is committed to taking the \"high-road\" of labor practices, and to proving that \"investing in [their] employees has been a driving force in [their] growth and success, not an impediment.\" And, Mr. Saginaw predicts that businesses uniting in support of fair labor practices will only lead to further success. He wrote, \"I sense we are ready for this change. Just as customers have voted with their pocketbooks for locally-sourced, organic and free-range products, they are voting for ethical employment by patronizing high-road restaurants.\" And finally...If you name a dog Houdini, you better be prepared for him to pull off a few tricks. That's what happened in Colorado Springs, with an Australian shepherd waiting at an animal shelter for a new home. The dog decided he was sick of waiting, so he opened his own kennel, two external doors, and went out to find his new owner. If it wasn't all captured on the shelter's security footage, the staff would have thought that Houdini just magically disappeared. Thankfully, a woman named Ashley found the dog wandering her neighborhood and decided to adopt Houdini. If no one comes to claim the dog from the shelter, he will soon go to his new home. Ashley said, \"We think he's a wonderful dog, and as much as I would love his owner to come and claim him...I can't wait to welcome him into my family.\" Hopefully, Ashley is prepared to secure her doors a little better so that little Houdini doesn't make another great escape. And that's the way it is today - Monday, October 14, 2013. I'm Thom Hartmann - on the news. This article was first published on Truthout and any reprint or reproduction on any other website must acknowledge Truthout as the original site of publication. Thom Hartmann is a New York Times bestselling Project Censored Award winning author and host of a nationally syndicated progressive radio talk show. You can learn more about Thom Hartmann at his website and find out what stations broadcast his radio program. He also now has a daily independent television program, The Big Picture, syndicated by FreeSpeech TV, RT TV, and 2oo community TV stations. You can also listen or watch Thom over the Internet. Columbus Day Is the Official Endorsement of White European and US Conquest of Indigenous Peoples"}, {"articleID": "2015030200_00020550_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Susan Rice": ["Q23848423", "Q50612"]}, "date": "2015-03-02", "url": "http://tucsonnewsnow.com/story/28231183/kerry-tries-to-dampen-fuss-over-israeli-pms-speech", "content": "<mark>Kerry</mark> tries to dampen fuss over Israeli PM's speech (AP Photo/Marc Sellem, Pool). Israeli Prime Minister Benjamin Netanyahu looks on before praying at the Western Wall, the holiest site where Jews can pray, in Jerusalem's Old City, Saturday Feb. 28, 2015. By BRADLEY KLAPPER Associated Press WASHINGTON (AP) - Secretary of State <mark>John Kerry</mark> on Sunday tried to calm tensions with Israel before Prime Minister Benjamin Netanyahu's congressional address, yet insisted the Obama administration's diplomatic record with Iran entitles the U.S. to \"the benefit of the doubt\" as negotiators work toward a long-term nuclear deal. On a mission to warn of the dangers of a nuclear-armed Iran, the prime minister arrived in Washington for the speech the White House didn't want him to give. <mark>Kerry</mark> said in an interview broadcast before he arrived in Switzerland for talks with Iran's foreign minister that Netanyahu was welcome to speak in the U.S. and that the administration did not want the event \"turned into some great political football.\" That sentiment was a step back from some of the sharp rhetoric between the allies in recent weeks, and <mark>Kerry</mark> mentioned that he talked to Netanyahu as recently as Saturday. But <mark>Kerry</mark> stressed that Israel was safer as a result of the short-term nuclear pact that world powers and Iran reached in late 2013, and he described that improvement as the \"standard we will apply to any agreement\" with the Islamic Republic. Officials have described the United States, Europe, Russia and China as considering a compromise that would see Iran's nuclear activities severely curtailed for at least a decade, with the restrictions and U.S. and Western economic penalties eased in the final years of a deal. \"We are going to test whether or not diplomacy can prevent this weapon from being created, so you don't have to turn to additional measures including the possibility of a military confrontation,\" <mark>Kerry</mark> told ABC's \"This Week.\" \"Our hope is that diplomacy can work. And I believe, given our success of the interim agreement, we deserve the benefit of the doubt to find out whether or not we can get a similarly good agreement with respect to the future.\" Netanyahu will press his opposition to a diplomatic accommodation of Iran's program in his speech Tuesday to Congress. \"We are not here to offend President Obama whom we respect very much,\" said a Netanyahu adviser, who was not authorized to be identified. \"The prime minister is here to warn, in front of any stage possible, the dangers\" of the agreement that may be taking shape. The adviser, who spoke shortly before the delegation touched down in Washington, said Israel was well aware of the details of the emerging nuclear deal and they included Western compromises that were dangerous for Israel. Still, he tried to lower tensions by saying that Israel \"does not oppose every deal\" and was merely doing its best to warn the U.S. of the risks entailed in the current one. The invitation to speak to Congress extended by House Speaker John Boehner, R-Ohio, and Netanyahu's acceptance have caused an uproar that has exposed tensions between Israel and the U.S., its most important ally. By consenting to speak, Netanyahu angered the White House, which was not consulted in advance, and Democrats, who were forced to choose between showing support for Israel and backing the president. \"I will do everything in my ability to secure our future,\" Netanyahu said before flying to Washington. Boehner said Iran's nuclear ambitions were a threat well beyond the region. \"We're not going to resolve this issue by sticking our heads in the sand,\" Boehner told CBS' \"Face the Nation.\" He said Netanyahu \"can talk about this threat, I believe, better than anyone. And the United States Congress wants to hear from him, and so do the American people.\" The congressional speech also has sparked criticism in Israel, where Netanyahu is seeking re-election on March 17. He also planned to speak Monday at the annual conference of the pro-Israel lobby AIPAC. Netanyahu considers unacceptable any deal that does not entirely end Iran's nuclear program. But President Barack Obama is willing to leave some nuclear activity intact, backed by safeguards that Iran is not trying to develop a weapon. Iran insists its program is solely for peaceful energy and medical research. The dispute has become more personal of late. Last week, Obama's national security adviser, <mark>Susan Rice</mark>, described the timing and partisan manner of Netanyahu's visit as \"destructive\" for the U.S.-Israeli relationship. On Sunday, <mark>Kerry</mark> painted a more positive picture of continued close cooperation. He said the U.S.-Israeli security partnership was closer than at any point before, and noted the large investment of American money in the Jewish state's Iron Dome missile defense system. He said the U.S. government has \"intervened on Israel's behalf in the last two years a couple of hundred\" times in more than 75 forums \"in order to protect Israel.\" <mark>Kerry</mark> plans to make precisely that point when he addresses the U.N. Human Rights Council on Monday in Geneva. U.S. officials have often accused the council of being biased against Israel and inappropriately focused on the Jewish state. Officials traveling with <mark>Kerry</mark> said he would urge the council to take a more balanced approach. Associated Press writer Aron Heller contributed to this report. Lights, camera, blossom! Disney films inspire floral fantasy Lights, camera, blossom! Disney and Pixar films inspire exhibits at Philadelphia Flower Show Lights, camera, blossom! Disney and Pixar films inspire exhibits at Philadelphia Flower Show Graceland brings Elvis back to his Las Vegas home Graceland brings Elvis back to his Las Vegas home with exhibits, shows at Westgate Las Vegas Graceland brings Elvis back to his Las Vegas home with exhibits, shows at Westgate Las Vegas AP: Trayvon Martin's mother says killer got away with murder AP interview: Trayvon Martin's mother says Justice Department let killer get away with murder AP interview: Trayvon Martin's mother says Justice Department let killer get away with murder 3 nabbed in NY, Florida in plot to join Islamic State group 3 arrested in NYC, Florida on charges they plotted to go to Syria to join Islamic State group 3 arrested in NYC, Florida on charges they plotted to go to Syria to join Islamic State group Texas attorney general argues gay couple's marriage is void Texas attorney general argues marriage license of gay couple allowed to wed is void meta content = \"2015-03-01 16:25:08\" > Obama invoking civil rights struggles past and present For President Barack Obama, it's a week to invoke America's civil rights struggles from past to present. For President Barack Obama, it's a week to invoke America's civil rights struggles from past to present. meta content = \"2015-03-01 16:35:03\" > Newspaper: Nurse who survived Ebola says hospital failed her Newspaper: Nurse who survived Ebola says hospital failed her A 26-year-old nurse said in a newspaper interview that a hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed...A 26-year-old nurse said in a newspaper interview that a hospital where she had worked in Dallas and its parent company failed her when she contracted Ebola while caring for the first person in the U.S. diagnosed with the...meta content = \"2015-03-01 18:15:12\" > Brrr! February brought record cold, snow to Northeast February 2015 was one for the record books in the Northeast - the coldest month ever for four cities in New York and the snowiest ever for Boston. Hardy souls who shivered and shoveled their way through February in the Northeast now have evidence of just how brutal the weather was, with record cold in at least eight cities and record snowfall in Boston. meta content = \"2015-03-01 09:04:52\" > New round of snow could push Boston to season record Parts of California were getting a welcome dose of rain and snow from a storm system moving through the state, while late-winter weather dumped snow elsewhere in the Southwest. After cold and snow that set February records, southern New England is entering March with another round that could push Boston over its 20-year-old snowfall record. meta content = \"2015-03-01 17:15:11\" > Sale will secure future for shelter for asylum-seekers The list goes up on the lobby bulletin board of Vive La Casa and the refugees who've come from their rooms tentatively approach and scan for their names. The lucky ones will take a taxi to Canada the next day ..."}, {"articleID": "2013052106_00016005_W", "names": {"Steven Miller": ["Q16225127", "Q20404318", "Q7615056", "Q7615057", "Q7615058"], "Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2013-05-20", "url": "http://www.firstpost.com/world/attention-shifts-to-white-house-in-irs-probe-800073.html", "content": "IPL spot-fixing probe Live: Rajasthan Royals suspend contracts of tainted trio - Firstpost WASHINGTON (Reuters) - Two senior aides to President Barack Obama knew weeks ago about a watchdog report on the U.S. Internal Revenue Service targeting of conservative groups, a spokesman said on Monday, shifting the focus to the White House in a fast-moving controversy. White House Counsel Kathryn Ruemmler was told on April 24 about an upcoming report by the Treasury's Inspector General for Tax Administration (TIGTA) on the IRS practice, which an IRS official apologized for on May 10, triggering the controversy. Soon after she learned of the report, Ruemmler briefed White House Chief of Staff Denis McDonough and other members of the senior staff, White House spokesman Jay Carney told reporters at 7a news briefing. Ruemmler decided there was no need to inform the president, Carney said, as the administration struggled to put a lid on the IRS affair which has become a major distraction early in Obama's second term. Carney defended White House inaction prior to the completion of the inspector general's probe, saying any intervention would have been inappropriate. In any case, he said, there was no urgency because the activity in question had stopped about a year earlier. Carney last week said Ruemmler had not necessarily been told of the contents of the TIGTA report, which found IRS agents had targeted conservative groups for extra scrutiny based on the use in their names of key words, such as \"Tea Party\" and \"Patriot.\" Ruemmler was told on April 24 the report would address \"line IRS employees improperly scrutinizing...organizations by using words such as Tea Party and Patriot,\" Carney said on Monday. \"While we had an indication of the likely findings, until the IG finalizes his report, the findings and conclusions are subject to change,\" Carney said. \"That's why we had to wait, appropriately, until the report was publicized or published for the president to be able to review it and respond, as he did very quickly,\" Carney said. Obama fired acting IRS Commissioner <mark>Steven Miller</mark> on Wednesday and called the inspector general's findings outrageous. The report found no evidence of political motivation for the targeting or of any White House involvement. There was no White House intervention at any time into the contents of the report, Carney said. POSSIBLE EXITS As the White House fought to contain the political damage, two congressional committees were preparing to hold hearings on the report, with some lawmakers calling for the Obama administration to fire more people linked to the scandal. Lois Lerner, chief of the IRS tax-exempt unit, was scheduled to testify on Wednesday to a Republican-controlled investigative committee of the House of Representatives, along with other officials. Lerner's apology on May 10 for the IRS targeting at a legal conference in Washington set off the furor. Representative Sander Levin called for Lerner's resignation on Friday, saying she had recently testified to a House subcommittee and failed to disclose what she knew about the targeting. \"This is wholly unacceptable,\" he said. Levin is the top Democrat on the House Ways and Means Committee, which writes tax law and oversees the IRS. Senate Republican leader Mitch McConnell's office on Monday drew attention to a Washington Post article that questioned Lerner's statements, including her contention that applications for tax-exempt status by groups had doubled during the time period in question. Republican Vern Buchanan, another member of the Ways and Means panel, last week called for Lerner to be dismissed. Joseph Grant, acting commissioner for the IRS tax-exempt and government entities division and Lerner's boss, said last week that he will retire. \"I don't see how Lois makes it. It's saddening to me,\" said Philip Hackney, assistant law professor at Louisiana State University who worked until 2011 at the IRS with Lerner. \"She is nonpartisan; I say that with great confidence.\" Lerner was scheduled to testify on Wednesday to the House Oversight and Government Reform Committee alongside Deputy Treasury Secretary Neal Wolin, former IRS Commissioner Douglas Shulman and Treasury Department Inspector General for Tax Administration J. Russell George. On Tuesday, George, <mark>Miller</mark> and Shulman were set to testify before the Democrat-controlled Senate Finance Committee. As the IRS scandal as widened, Republicans have focused on what officials knew about the targeting and when they knew it. The inspector general's report showed that the targeting got under way in mid-2010. In 2011, Lerner was told about how the practice was being handled at a Cincinnati field office. She halted the use of the controversial key words, but lower-level employees by January 2012 had resumed using them. At a first congressional hearing on the matter last Friday, Republicans made clear they are looking beyond the IRS. \"This appears to be just the latest example of a culture of cover-ups and political intimidation in this administration,\" Republican House Ways and Means Chairman Dave Camp said on Friday. Democratic Senate Finance Committee Chairman Max Baucus and top committee Republican Orrin Hatch on Monday requested documents on possible White House involvement and sought nearly 300 tax-exempt status applications delayed by the targeting. Firstpost encourages open discussion and debate, but please adhere to the rules below, before posting. Comments that are found to be in violation of any one or more of the guidelines will be automatically deleted: Personal attacks/name calling will not be tolerated. This applies to comments directed at the author, other commenters and other politicians/public figures Please do not post comments that target a specific community, caste, nationality or religion. While you do not have to use your real name, any commenters using any Firstpost writer's name will be deleted, and the commenter banned from participating in any future discussions. Not just niceties, China and India need to focus on thorny issues India's discourse with China has traditionally been trapped in the Mao-ist maze that defines how \"friends\" ought to conduct themselves. But Chinese statecraft has evolved, and India too must up its diplomatic game. Why the Indian media gives a damn about poverty In that sense the poverty line of India is cruel. It is merciless and doesn't allow the majority of Indians any money for shelter or access to education or healthcare or sanitation or anything else that civilised nations would consider as essential as food. Can the party resolve internal discord and take a call on Modi's PM candidature? Try following a game on twitter or with friends or at the ground. At every step of the way, the spot-fixing question raises itself. Movie Review: \"The Reluctant Fundamentalist' leaves you dissatisfied If you forget the politics and just look at the film, The Reluctant Fundamentalist doesn't fare much better. It's a thriller that lacks tension and suspense. After monitoring a phone call, the investigation had virtually turned pan-India with some of the bookies based in Gujarat and Mumbai. Ex-Citi CEO Vikram Pandit, JM Financial join hands for banking foray in India JM Financial will nominate Pandit as the non-executive chairman of the proposed bank. Pandit and Aiyar will have the right to purchase shares up to the amount prescribed by the RBI in this entity. Movie Review: The Great Gatsby is the most Bollywood of Baz Luhrmann's films The great American dream is an integral part of America. It's\" great' in that it symbolises not truth, but hope when the truth is disillusioning; it symbolises not facts, but ideals when facts are unnerving; it symbolises not likelihood, but promise when likelihood is all but bleak. Google I/O 2013 keynote: New Maps, Search, Plus, and S4 with \"pure' Android We're tracking the Google I/O conference 2013 live - what will be unveiled? Hero worshipped in Kerala, Sreesanth still innocent in his state The summary of the response in his Sreesanth's home turf is that of incredulity. They are unwilling to believe that the pacer is guilty. The original promise of the Dreamliner has failed to materiallise due to limitations in its flying range. Will Air India continue to pay a price for this? The UPA ads eulogising MGNREGA as a a huge success needs to be taken with bags of salt. The scheme did make a difference, but not as is claimed. Angelina's breast surgery possible in India, but there's a catch So can we test in India and gain from the same treatment privilege that Jolie had? Yes, but there is a catch. Live detailed updates as KKR take on Pune in a must-win game at Ranchi. Bedi's argument that we should focus on the legal wrong committed by the girl slapped by cops is technical, disingenuous and enabling. The\" two heads \"power arrangement between Congress president Sonia Gandhi and Prime Minister <mark>Manmohan Singh</mark> is coming apart at the seams. Lessons from Karnataka: Cong must stop backing corrupt leaders in Andhra The fact that it has allowed individuals named in chargesheets to continue as ministers is evidence that the Congress runs Andhra Pradesh as if it is its fiefdom, without a care for ethics in public life. IPL 2013: How Isa Guha is changing perceptions about cricket presenters Isa Guha is not your usual female cricket presenter. Apart from being an ex-player, she's highly educated and injects a breath of fresh air on Indian screens. Android and Chrome aren't merging for now, says Google's Sundar Pichai The fate of the two ministers is reportedly in the hands of the Prime Minister who has been told to take a final call. The Sarabjit-Sanaullah episode shows that for all of India's attempts to project itself as an emerging global power, with a footprint larger than just the South Asian peninsula, it is unable to break out of its hyphenated relationship with Pakistan. Changing dynamics: Is low-cost flying becoming really high cost? Consumers may have to pay a high price for both the lower price and increased choice."}]