[{"articleID": "2018071907_00161277_W", "names": {"John Glenn": ["Q16230701", "Q182642", "Q6235502"]}, "date": "2018-07-19", "url": "http://hardenexpress.com.au/story/5537037/bezos-launches-spacecraft-higher-than-ever/", "content": "Blue Origin's passenger was Mannequin Skywalker, an instrumented dummy which has flown before. Jeff Bezos' Blue Origin rocket company has shot a capsule higher into space than it has ever done before. The New Shepard rocket blasted off from west Texas on the company's latest test flight. Once the booster separated, the capsule's escape motor fired, lifting the spacecraft to an altitude of 120 kilometres. It is part of a safety system intended to save lives once space tourists and others climb aboard for suborbital hops. Wednesday's passenger was Mannequin Skywalker, an instrumented dummy in a blue flight suit which has flown before, plus science experiments. The booster and capsule - both repeat fliers - landed successfully. It was the ninth test flight and lasted 11 minutes. \"Crew Capsule looks great even after it was pushed hard by the escape test. Astronauts would have had an exhilarating ride and safe landing,\" Mr Bezos said in a tweet. Blue Origin has yet to announce when it will start selling tickets or how much flights will cost. Launch commentator Ariane Cornell promised it would be soon. Mr Bezos, founder and chief executive of Amazon, aims to send people and payloads into orbit from Cape Canaveral. Those missions will rely on the bigger, more powerful New <mark>Glenn</mark> rocket still under development. He has named his rockets after NASA's original Mercury astronauts Alan Shepard, the first American in space, and <mark>John Glenn</mark>, the first American to orbit the Earth. Australian Associated Press facebook SHARE twitter TWEET email whatsapp"}, {"articleID": "2018040511_00069529_W", "names": {"Dave Thompson": ["Q1173362", "Q1176844", "Q18619721", "Q25171579", "Q28224816", "Q3703057", "Q5229992", "Q5229993"], "Andrew Robertson": ["Q15915040", "Q20979480", "Q23035861", "Q2846717", "Q4758409", "Q49707939", "Q58937110"], "Mohamed Salah": ["Q1354960", "Q22109496", "Q43975293", "Q50365713"]}, "date": "2018-04-05", "url": "http://sfgate.com/sports/article/Guardiola-set-to-come-up-short-again-in-Champions-12807378.php?cmpid=overnight", "content": "https: //www.sfgate.com/sports/article/Guardiola-set-to-come-up-short-again-in-Champions-12807378.php Guardiola set to come up short again in Champions League Steve Douglas, Ap Sports Writer Updated 3:39 am, Thursday, April 5, 2018 LIVERPOOL, England (AP)--Pep Guardiola was ridiculed when he backed Barcelona to mount a historic comeback from 4-0 down against Paris Saint-Germain in the Champions League last season. Back then, the former Barcelona player and coach warned that Spanish team \"will be back and prove you wrong.\" He was right about that, Barcelona won the second leg 6-1. But with a similar deficit facing Manchester City, Guardiola didn't sound quite as convinced. \"In this room, I think there is nobody, except the guy talking to you, who believes we can go through,\" the Spaniard said after City's 3-0 loss at Liverpool in the first leg of the Champions League quarterfinals. \"There are 90 minutes more. We are going to try.\" His statement lacked conviction. Just like City's play at Anfield on Wednesday when Guardiola's tactics were pulled apart, not for the first time at this level in recent years. Guardiola's decision to change his approach and play an extra central midfielder, Ilkay Gundogan, instead of winger Raheem Sterling was based on his belief that it would allow City to take charge of midfield. window. _ taboola = window. _ taboola | | []; _ taboola. push ({mode: \"thumbnails-c', container:\" taboola-interstitial-gallery-thumbnails-4', placement: \"Interstitial Gallery Thumbnails 4', target_type:\" mix'}); _ taboola. push ({flush: true}); Photo: <mark>Dave Thompson</mark>, AP Image 1 of / 4 Caption Close Image 1 of 4 Manchester City coach Josep Guardiola ahead of the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. Manchester City coach Josep Guardiola ahead of the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. Photo: <mark>Dave Thompson</mark>, AP Image 2 of 4 Manchester City coach Josep Guardiola wipes his face during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. less Manchester City coach Josep Guardiola wipes his face during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday,...more Photo: <mark>Dave Thompson</mark>, AP Image 3 of 4 Manchester City coach Josep Guardiola speaks to his coaching staff during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool, England, Wednesday, April 4, 2018. less Manchester City coach Josep Guardiola speaks to his coaching staff during the Champions League quarter final first leg soccer match between Liverpool and Manchester City at Anfield stadium in Liverpool,...more Photo: <mark>Dave Thompson</mark>, AP Image 4 of 4 Guardiola set to come up short again in Champions League 1 / 4 Back to Gallery \"We wanted more passes, more control,\" Guardiola said. By the time Gundogan traipsed off after 57 minutes--the game having virtually passed him by--to be replaced by Sterling, City was losing 3-0 and its players were struggling to clear their minds after Liverpool's devastating first-half display. Liverpool had taken advantage of City's lack of width on the right as left back <mark>Andrew Robertson</mark> repeatedly burst forward in support of Sadio Mane, leaving City right back Kyle Walker exposed. City's central-midfield four seemed unsure about their exact roles, the diagonal switch to left winger Leroy Sane became a default ploy because of a lack of options on the other flank, and lone striker Gabriel Jesus was left too isolated. It revived memories of Guardiola's time at Bayern Munich, when he changed his formation to 4-2-4 for the second leg of the semifinals against Real Madrid. Madrid, 1-0 ahead from the first leg, won the return match 4-0 in one of the most humiliating nights of Guardiola's career. Unless City pulls off a Barcelona-style recovery, it will be seven years since Guardiola last won the Champions League--when Barcelona won for the second time with that enchanting 3-1 victory over Manchester United at Wembley Stadium. A semifinal loss with Barcelona in 2012 was followed by three straight exits at the last four with Bayern. City under Guardiola was eliminated by Monaco in the last 16 last year, and now faces going out in the quarterfinals. It seems ungrateful to criticize Guardiola and his approach, given his City team could clinch the Premier League in record time this weekend after playing some of the best soccer ever seen in the English game. But in the Champions League, he has been found wanting, either through his overthinking (which was the case against Liverpool) or an unwillingness to change his attack-at-all-costs style (like against Monaco last season). He acknowledged before Wednesday's game that City's style plays right into the hands of Liverpool, but said he would not budge in his beliefs. What followed was a kind of fudged change, bolstering his central midfield but leaving another area of the field undermanned. He picked the same midfield against Arsenal in the English League Cup final and City was somewhat fortunate to go into halftime leading 1-0 before running out an easy 3-0 winner. Guardiola won't make the same mistake in the second leg against Liverpool. He has no option but to go on all-out attack, returning to the way City usually plays. The fact that City plays Manchester United in a potentially title-clinching derby match on Saturday makes things even more complicated for Guardiola. He will cling to the fact that City already has beaten Liverpool 5-0 at home in the league this season, and that City has scored at least three goals in 23 of its 49 games this season. Liverpool also has a big game over the weekend, a Merseyside derby against Everton, and there are doubts about the fitness of forward <mark>Mohamed Salah</mark>. \"I am too long in the business,\" Liverpool manager Juergen Klopp said, when asked if the quarterfinal match was virtually over. \"No one was in the dressing room dancing around and celebrating after the halftime result. This leg is about 180 minutes.\" Klopp has now won seven of his 13 career meetings against Guardiola, and appears to have his number. It's time for Guardiola to strike back. ___ Steve Douglas is at www.twitter.com/sdouglas80 Most Popular 1 Fat-shamed teen buys all the cupcakes at her local bakery to...2 An AirAsia passenger caused an uproar after trying to upgrade...3 Muni assault: SF man seriously injures woman for bumping into him 4 NFL Star Julian Edelman Stopped Potential School Shooter After...5 \"Fascinated and horrified' scientists watched as a killer...6 Big storm raising flooding fears across Northern California 7 Atmospheric river could hit Bay Area with month of rain in 2 days 8 SF man arrested in Fisherman's Wharf, Richmond District car...9 YouTube shooting: Family claims police failed to heed warnings 10 Women kicked out of sumo ring--despite helping with a.. . LATEST NEWS NFL star may have stopped potential school shooting Women kicked out of sumo ring despite medical emgergency Cyclist fired for flipping off Trump sues former employer 3 robbery suspects detained in Concord after standoff Teen buys every cupcake at bakery to spite fat-shaming woman Woman on flight tries to upgrade without paying, causes uproar SF police arrest man suspected of multiple car break-ins SF man seriously injures woman on Muni for bumping into him SFGate Giants mash four homers, slam King Felix in rout of Mariners Search Make and Model View Comments © 2018 Hearst Communications, Inc. ."}, {"articleID": "2017030817_00592117_W", "names": {"Ajit Pai": ["Q3528364", "Q4699790"], "Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}, "date": "2017-03-08", "url": "http://www.computerworld.com.au/article/615569/senators-push-fcc-keep-its-net-neutrality-rules/?utm_medium=rss&utm_source=taxonomyfeed", "content": "The U.S. Federal Communications Commission should reverse course and keep the net neutrality rules it passed just two years ago, several Democratic senators said Wednesday. The FCC has not yet moved to repeal the regulations prohibiting broadband providers from selectively blocking or slowing web traffic, but the agency's new chairman, Republican <mark>Ajit Pai</mark>, has called the rules a \"mistake.\" Broadband customers, however, still need the protections of the net neutrality rules, several Democratic members of the Senate Commerce, Science, and Transportation Committee said during a hearing. Since President Donald Trump appointed him chairman in late January, <mark>Pai</mark> has moved to roll back transparency provisions in the net neutrality rules, suspended some ISP privacy regulations, and removed some companies from the Lifeline broadband subsidy program for low-income people, noted Senator <mark>Bill Nelson</mark>, a Florida Democrat. \"These are actions that directly impact the lives of millions of Americans and I sincerely hope they are not a sign of things to come,\" <mark>Nelson</mark> said to <mark>Pai</mark>. \"Because, at the end of the day, the FCC has a responsibility to put the public interest ahead of powerful special interests.\" Many lawmakers expect the FCC to uphold the laws they have passed and \"enforce the regulations properly adopted by the agency,\" <mark>Nelson</mark> added. Concerns that the net neutrality rules would hurt the broadband market seem to be unfounded, added Senator Cory Booker, a New Jersey Democrat. \"A lot of gloom and doom was predicted if this was to happen, but clearly, the sky's not fallen,\" he said. \"Businesses have continued to innovate in this space.\" <mark>Pai</mark> largely avoiding talking about his net neutrality plans during the hearing, and Republican senators avoided asking him about it. He laid out other priorities for the commission, including broadband deployment to underserved areas and consumer protection from robocalls. Fellow Republican Commissioner Michael O'Rielly also called on the FCC to end the \"scourge\" of pirate radio, saying unauthorized radio signals cause interference with other stations. But Mignon Clyburn, the commission's lone Democrat at the moment, called on the FCC to keep net neutrality rules and take other actions that put \"consumers first.\" \"Will there be a cop on the beat in a broadband world?\" she sad. \"If not the FCC, who will consumers turn to when their broadband provider throttles their favorite website? And what if there is a billing dispute? Poor service? Privacy concerns?\" The agency's rollback of its privacy rules last week, along with a Senate resolution to remove the rest of the net neutrality-related privacy rules are the \"opening salvo\" in a fight to remove the entire suite of net neutrality regulations, said Senator Ed Markey, a Massachusetts Democrat. Democratic FCC members argued for the privacy rules after they reclassified broadband as a regulated common carrier as part of the net neutrality rules. That reclassification took privacy enforcement authority for broadband away from the FCC's sister agency, the Federal Trade Commission. \"I fear [the privacy rollback] is just a preview of coming attractions,\" Markey said. \"Big broadband companies don't want to give consumer privacy protections the attention they deserve.\" 7 Habits of the Effective Network Manager More from NetScout Join the Computerworld newsletter! Join Error: Please check your email address. More about <mark>Bill</mark> FCC Federal Communications Commission Federal Trade Commission Transportation"}, {"articleID": "2010072714_00314004_W", "names": {"Chad Wright": ["Q20829640", "Q42567677"]}, "date": "2010-07-27", "url": "http://highheelsathomeplate.wordpress.com/2010/07/27/all-star-lineup-change/", "content": "july 27, 2010...9:02 am all star lineup change scott woodward, who earned himself the lead-off spot for the cape cod baseball league all stars west division team, will not be playing in the game on wednesday at fenway park due to an injury to his foot that he sustained in a game earlier this week. he will be replaced by bourne teammate daniel bowman, who had earned himself a spot in the home run hitting contest at fenway and will now be a reserve as well. woodward will be replaced as lead-off by <mark>chad wright</mark> (cotuit). the lineups are now as follows: 2010 ccbl western division starting line-up 1. cf <mark>chad wright</mark> cotuit kettleers (kentucky) 2. lf johnny ruetigger hyannis harbor hawks (arizona state) 3. rf zach wilson wareham gatemen (arizona state) 4. dh jordan leyland cotuit kettleers (cal. - irvine) 5. 1b cam seitzer hyannis harbor hawks (oklahoma) 6. 2b kevin medrano falmouth commodores (missouri state) 7. 3b tyler bream wareham gatemen (liberty) 8. c andrew susac falmouth commodores (oregon state) 9. ss kc serna falmouth commodores (oregon) p austin wood cotuit kettleers (st. petersburg) head coach harvey shapiro bourne braves 1. lf drew martinez brewster whitecaps (memphis) 2. cf caleb ramsey y-d red sox (houston) 3. 2b kolten wong orleans firebirds (hawaii) 4. ss joe panik y-d red sox (st. john's) 5. 3b tyler hanover y-d red sox (lsu) 6. c pratt maynard harwich mariners (north carolina state) 7. rf cohl walla brewster whitecaps (texas) 8. 1b aaron westlake chatham anglers (vanderbilt) 9. dh clint moore harwich mariners (west point) p andrew gagnon brewster whitecaps (long beach state) head coach scott pickler y-d red sox my twitter great shirt: \"i collect scars and first place trophies\" 15 hours ago games today: cot @ yd (5), war @ bre (5), hya @ cha (7), bou @ har (7), fal @ orl dbl (4). 3 days ago officially a rain out tonight. thanks for comin. 3 days ago ladies and gentlemen...it's raining. i'd be surprised if tonight's game gets in."}, {"articleID": "2010031915_00158445_W", "names": {"Kevin Campbell": ["Q22305539", "Q42725237", "Q6395969", "Q6395970", "Q6395971", "Q927006"]}, "date": "2010-03-19", "url": "http://news.bbc.co.uk/go/rss/-/1/hi/northern_ireland/8576733.stm", "content": "fermanagh council fined over worker's death the accident happened at a landfill site in enniskillen fermanagh district council has been fined £ 45,000 for breaching health and safety rules after the death of one of its workers at a landfill site. digger driver ronnie marshall suffered brain damage when the ground beneath the vehicle he was driving collapsed. he died shortly after the accident which happened at the drummee waste management facility in april 2008. the council said it regretted the tragedy and had \"done everything\" to \"make sure this doesn't happen again\" . judge gemma loughran said the court had a duty send to out the message that such tragic accidents should never happen. fermanagh council had pleaded guilty at an earlier hearing to two charges under health and safety legislation of failing to protect their own employees and those not directly employed by them. <mark>kevin campbell</mark>, investigating inspector with the health and safety executive, said it was essential \"all work activities are properly assessed and plans put in place to protect everyone from danger\" . here is the weather forecast for europe in 2040 the most striking images from around the world the bbc is not responsible for the content of external internet sites."}, {"articleID": "2020032201_00019609_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}, "date": "2020-03-21", "url": "http://www.greatlakesadvocate.com.au/story/6690659/all-non-essential-travel-should-be-cancelled/?cs=17267", "content": "All non-essential travel should be cancelled: Leaders move to stop travel as school holidays near Coronavirus Prime Minister <mark>Scott Morrison</mark> has now told Australians to cancel all non-essential travel. He also flagged \"far more draconian measures to enforce social distancing\" saying too many Australians did not seem to be getting the message. He had planned to consider more travel advice at a meeting of state and territory leaders on Tuesday evening, but on Sunday said the decision had been brought forward. \"After consulting with premiers and chief ministers overnight, we have decided that we are moving immediately to recommend against all non-essential travel in Australia,\" he said in Canberra. \"All non-essential travel should be cancelled,\" he said. The move will disrupt school holiday travel plans within Australia, with Australians already told not to travel overseas, and the borders already closed to arrivals of non-residents. The leaders will meet again on Sunday night to consider \"far more draconian measures to enforce social distancing\" , he said. \"More stronger measures will be coming,\" Mr <mark>Morrison</mark> said. \"What happened at Bondi beach yesterday was not OK. And served as a message to federal and state leaders that too many Australians are not taking these issues seriously enough,\" he said. \"So the measures that we will be considering tonight means that state premiers and chief ministers may have to take far more draconian measures to enforce social distancing, particularly in areas of outbreaks.\" More to come For information on COVID-19, please go to the ACT Health website or federal Health Department's website. You can also call the Coronavirus Health Information Line on 1800 020 080 If you have serious symptoms, such as difficulty breathing, call Triple Zero (000) We have removed our paywall from our stories about the coronavirus. This is a rapidly changing situation and we want to make sure our readers are as informed as possible. If you're looking to stay up to date on COVID-19, you can also sign up for our twice-daily digest here. If you would like to support our journalists you can subscribe here. Prime Minister <mark>Scott Morrison</mark> in Canberra. Picture: Dion Georgopoulos"}, {"articleID": "2019100210_00125261_W", "names": {"Ryan Clark": ["Q16598380", "Q16979868", "Q20877034", "Q5403956", "Q7383958", "Q7383961"], "Tom Jackson": ["Q21075060", "Q55602687", "Q660635", "Q7816304", "Q7816305"], "Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"], "Jordan Gross": ["Q55946456", "Q6276575"], "Ron Rivera": ["Q1991889", "Q7364319"], "Eric Washington": ["Q1118847", "Q48852210"], "Thomas Davis": ["Q17721764", "Q28972061", "Q3525031", "Q48841038", "Q7788881"]}, "date": "2019-10-02", "url": "http://www.espn.com/blog/nflnation/post/_/id/301223/amid-defensive-changes-luke-kuechly-remains-the-panthers-stopper", "content": "Amid defensive changes, Luke Kuechly remains the Panthers' stopper Amid defensive changes, Luke Kuechly remains the Panthers' stopper play <mark>Clark</mark>: Losing Short a big deal for Panthers (0:21) <mark>Ryan Clark</mark> weighs in on how losing Kawann Short to a season-ending injury will be detrimental to Carolina's defense. (0:21) Covered Panthers, NFL for 11 years More than 25 years experience covering NFL, college football and NASCAR Joined ESPN in 2006 print CHARLOTTE, N.C.--Gerald McCoy is a vegan these days, but when asked to describe what it's like being a teammate with Carolina Panthers linebacker Luke Kuechly, the defensive tackle hearkened back to his meat-eating days. \"Luke is like going to a famous steakhouse, hearing about Wagyu steak,\" said McCoy, who signed with Carolina in June after being released by Tampa Bay. \"It's been pampered all its life, played music, too, and wined and all this so it can be prime for you to enjoy. And then when you get to this famous steakhouse and you order the steak and bite into it, it's like,\" Wow, it is as advertised .' NFL PrimeTime on ESPN + Chris Berman and <mark>Tom Jackson</mark> recap the weekend's games with extended highlights and analysis. The show will stream live at 7:30 p.m. ET each Sunday during the 2019 season and will be available on demand each week until late Wednesday night. Watch on ESPN + \"Like Luke Kuechly. Luke Kuechly. Prime steak. As advertised.\" With 17 tackles in Week 2, the 28-year-old Kuechly surpassed Hall of Famer Brian Urlacher for the most tackles by an NFL player through his first eight seasons. He needs eight tackles on Sunday against the Jacksonville Jaguars to reach 1,000 career tackles. No player has more tackles than Kuechly since he entered the league in 2012. He truly has been a \"tackling machine,\" as he was dubbed at Boston College, where he led the nation in tackles with 191 as a senior under coach Frank Spaziani. \"He was the human eraser,\" said Spaziani, now the defensive coordinator at New Mexico State. \"He would just make plays other people couldn't make or didn't make. The defense was a whole lot better when Luke was on the field. I'm sure it's the same way today.\" Kuechly is perhaps the best player in Panthers history, a lock to one day be inducted into the team's Hall of Honor that wide receiver <mark>Steve Smith</mark>, tackle <mark>Jordan Gross</mark>, quarterback Jake Delhomme and tight end Wesley Walls will enter during halftime of Sunday's game. \"I like the way he plays. I like the style. I like the leadership. I like everything about him,\" said Jacksonville coach Doug Marrone, who is facing a Carolina team that has won two straight after an 0-2 start. \"A potential Hall of Fame type of player. He's one of those players that we can all look at and really have a great appreciation for.\" Luke Kuechly has made more tackles in his first eight seasons than any player in NFL history. He could surpass 1,000 on Sunday against the Jaguars. Daniel Dunn/Icon Sportswire The Panthers made it a priority to improve defensive speed and moved to a 3-4 base to get more pressure on quarterbacks. Kuechly has been the one constant. He doesn't get the splashy sacks that make headlines, but he's a big reason the defense ranks No. 1 against the pass and No. 4 overall. He's tied for fourth in the NFL in total tackles with 44. According to NFL Next Gen Stats, he has eight stuffs--tackles made on run plays resulting in no gain or loss--the most in the league among linebackers. His 23 stops--tackles resulting a successful play for the defense--are tied for second among linebackers and only one off the league lead held by Jordan Hicks. Kuechly's ability to effectively drop into coverage allows coach <mark>Ron Rivera</mark> to be more creative with his blitz and rush package that has produced 18 sacks, which is tied with New England for the league lead a year after the team finished 27th in sacks. \"He's one that, if you don't have someone on him, he can make every play,\" Marrone said. The tackles made by Luke Kuechly through the first four weeks of the 2019 season show that he's all over the field. NFL Next Gen Stats Perfectionist Seventeen tackles, including one for a safety, would be a career game for most players. Kuechly was more upset after his Week 2 performance he didn't come down with an interception that would have been an incredible highlight play, as he soared into the air 24 yards downfield. \"I dropped a pick,\" a despondent Kuechly said afterward. \"Got to catch that ball.\" Kuechly is a perfectionist. He spends as much or more time studying film than most coaches. But it's what you don't see in practice, when Kuechly makes a rare mistake, that shows just how important perfection is to the six-time Pro Bowl selection. \"He'll talk to himself. He'll say bad things to himself,\" defensive coordinator <mark>Eric Washington</mark> said with a smile. \"He'll go off to the sideline and he'll immediately want to review the series. He wants it to be right. He wants it to be perfect.\" By the time we get to Sunday we all see the results and benefits from that kind of mindset. \"On game day, it's almost like Kuechly is in the offensive huddle the way he anticipates. Safety Tre Boston cited as an example a play during the NFC Championship Game following the 2015 season.\" They were running a toss and Luke literally was telling us before the snap, \"Hey, toss to the right, toss to the right,'\" Boston recalled. \"And then they audibled the play and he knew what it was.\" He was supposed to be in the middle. But when they said hut, he was on the edge of the defense, pretty much catching the ball with the running back with the sweep. That preparation really gives him the confidence to make those plays. \"Luke Kuechly maintains a friendly rivalry with <mark>Thomas Davis</mark> on who gets more tackles, though <mark>Davis</mark> is now playing for the Chargers. AP Photo/Bob Leverone\" Pride' Kuechly's career has been threatened by concussions. He has spent three stints in the concussion protocol, the first one in 2015 after a violent collision at Jacksonville. Kuechly doesn't like talking about those moments. When he missed time in training camp this year after what he called being \"rolled up weird\" during a drill, he anticipated reporter's questions before they were asked. \"My head's good,\" Kuechly said. \"I wasn't in the protocol.\" Get the best of ESPN sent to your inbox The ESPN Daily delivers the biggest sports news and moments every weekday. Sign me up! Privacy Policy Read the Latest Email: Kuechly hasn't been in the protocol since 2017. That's allowed the outside focus to remain on his superb play and Kuechly's focus to remain on the field and talking about how the opponent's best player as a \"good dude\" or \"stud.\" He's not a boisterous voice in the locker room, but his leadership is more important than ever, especially with outside linebacker <mark>Thomas Davis</mark> now with the Los Angeles Chargers. For seven years, Kuechly and <mark>Davis</mark> had a friendly competition for the most tackles. That hasn't stopped because they're on different teams. \"He called me the first week and told me he beat me, so, a little resentment there,\" Kuechly said with a laugh. Panthers outside linebacker Shaq Thompson, whose star has risen since <mark>Davis</mark> departed, also is in on the competition. As it stands, Kuechly has 44 tackles, Thompson 40 and <mark>Davis</mark> 38, all among the top 10 in the league. What's the ultimate winner get? \"Pride,\" Kuechly said. \"The NFL, there's no gambling.\" Pride drives Kuechly. It's something McCoy believes is at the core of a locker room culture that didn't let the Panthers collapse after losing their first two games. It's one of the reasons he chose to sign here. \"His ultimate goal is to get off the field and get the offense back out there,\" McCoy said. \"He doesn't care who makes the plays. Whoever makes them, makes them. He just makes more than most people.\" "}, {"articleID": "2017092103_00054648_W", "names": {"Antonio Rojano": ["Q5699579", "Q5699581"]}, "date": "2017-09-21", "url": "http://www.eveningtimes.co.uk/sport/15546802.Hamilton_winger_David_Templeton_could_be_out_for_six_weeks/", "content": "Show caption () View gallery Skip to next image \"0 comments Get the latest local news straight to your inbox every day Sign up DAVID Templeton has been ruled out for four to six weeks after suffering a fractured foot during the defeat to Hearts. The Hamilton winger limped off early in the second half following a strong tackle, and manager Martin Canning revealed the injury was worse than first thought. Templeton was initially expected to be okay to return to face St Johnstone on Saturday, but instead will face another frustrating wait on the sidelines having impressed against his former side.\" We've lost David Templeton who will be out for four to six weeks, \"said Canning.\" He has a wee avulsion fracture in his foot following a blocked tackle on Saturday. \"He was very good on Saturday. It's frustrating for him because he's worked very hard to get himself ready to start games and he did very well in the game, but he's now going to miss four to six weeks.\" It's a blow to him, but it's a blow to us as well, but we have players in Steven Boyd and Louis Longridge and Botti Biabi who are desperate to go and play, so it's an opportunity for someone else. \"It is the latest setback in what has been an injury-plagued few years for Templeton, but Canning insisted there was no reason to doubt his future. He said:\" It's not a concern, because there's nothing you can do about it. \"It was a blocked tackle and that can happen to anybody, regardless of what your history of injury is.\" It's not a concern for me, it's a contact sport. \"Meanwhile, <mark>Antonio Rojano</mark>'s absence from competitive action looks set to continue as the club continues to wait for a work permit. The Argentinian striker joined late in the transfer window, but has not yet been able to take to the field as he waits for clearance to play. Canning said:\" It's an ongoing thing. Hopefully it's imminent. It's out of our hands as much as we can do. \"I think he will be out of this weekend.\" Hopefully if it's not at the end of this week, it will be at some point next week. \"0 comments"}, {"articleID": "2019070710_00013085_W", "names": {"Brian Connelly": ["Q2924876", "Q57543497"]}, "date": "2019-07-07", "url": "https://riverheadnewsreview.timesreview.com/2019/07/94394/let-grow-group-films-promotional-video-roanoke-avenue-elementary-school/#comments", "content": "Roanoke Avenue Elementary School third-graders found themselves in the spotlight last Tuesday after a nonprofit asked for their feedback on a nationwide movement. The nonprofit Let Grow filmed an unscripted promotional video in the Roanoke Avenue cafeteria as six students were interviewed by fellow third-grader Maya Sadeli-Weidner. The organization trains kids to be \"flexible, creative problem-solvers\" through alternative learning programs, according to its website. The filming coincided with the academic year-long Let Grow projects completed by students in Gary Karlson and Donna Verbeck's third-grade classes. Once per week, students were encouraged to do something they never did before, principal Thomas Payton said. \"One day, instead of getting a math worksheet for homework, kids would have to go home and do something they've never done before or try something they've never tried before and get their families involved,\" he said. \"Then, kids memorialize that with pictures. There was a writing component to it the next day, reflecting on what they did.\" Posters created by each student, documenting their new experiences, were hung throughout the cafeteria. Student Bryan Garcia said his favorite new activity was baking a cake with his father. He also took out the trash, locked the front door, and helped put Halloween decorations on his house with his family. When he first heard about the project from Mr. Karlson, he was \"really excited.\" \"I thought it was going to be fun,\" he said. \"He told us maybe we would have a party at the end of the school year about this and this is it.\" Let Grow co-founder Lenore Skenazy gave background on the program to the audience before the film crew recorded the students. She also interviewed Mr. Payton on camera for the video. \"Let Grow is an easy way to make it normal again to give our kids some freedom,\" she said. Mr. Payton said Mr. Karlson brought the Let Grow projects into the classrooms around September. Mr. Karlson said he discovered the program when his colleague shared information about it on social media. \"I explored the website and quickly adapted and translated the materials with the help of our bilingual secretary,\" Mr. Karlson said in an email. \"After that, really, the kids took it from there.\" He said the group of students did not rehearse, so everything picked up on camera was all natural. Other than the interviewer, Maya, the school did not know who was going to participate until they arrived at the event after school that day. Superintendent Aurelia Henriquez attended the event with school board member <mark>Brian Connelly</mark>, assistant superintendent for curriculum and instruction Christine Tona, director of professional personnel <mark>Brian</mark> Doelger and director of pupil personnel services Eileen Manitta. Dr. Henriquez said the program advances the district's goal of tackling the \"whole-child approach.\" \"As a mother of two young children and an educational leader, it is really important that we continue to find ways to increase our children's confidence, life skills, bravery, social skills and kindness,\" she said. \"It's never going to be just about the academics.\" Mr. Payton said he plans to expand the program to the entire third grade next year, which will be unique to each classroom. Second - and fourth-grade teachers have also expressed interest in picking up the program, he said. \"We're hopeful that other teachers in Riverhead will look at this, too,\" Mr. Payton said. \"Even Mr. Karlson will tell you, he does not necessarily want this to be Riverhead's way of doing it. This was just how the children in rooms 307 and 309 did it, this is their interpretation of Let Grow.\" [email protected] Photo caption: Third-grader Maya Sadeli-Weidner (standing) asks fellow student Sari Thompson a question about the Let Grow program last Tuesday at Roanoke Avenue Elementary School. (Kate Nalepinski photo) Comments comments Let Grow, Roanoke Avenue Elementary School, Thomas Payton"}, {"articleID": "2014052021_00129225_W", "names": {"Jimmy Page": ["Q10426092", "Q165467"], "Jordan Lee": ["Q15624487", "Q27983275", "Q30602316"]}, "date": "2014-05-20", "url": "http://www.guitarworld.com/acoustic-nation-watch-mutual-benefits-lets-play-statue-of-man-video", "content": "Nikki Sixx Discusses M? tley Cr? e's Future and Past, When \"Debauchery was King - and We Embraced It\" <mark>Jimmy Page</mark> Discusses \"Evil Sounds\" Heard on New Led Zeppelin Re-Issues Interview: Billy Duffy of The Cult Answers Readers' Questions on Gear, Songwriting and More In Deep with Andy Aledort: Unraveling the Mysteries of Chicago and Texas Blues Shuffles, Part 1 Video Lesson: Slash Shows You How to Play Guns N' Roses' \"Paradise City\" Chop Shop with John 5: A Country-Influenced Application of Hybrid Picking for Blues and Rock Mutual Benefit Announces 2014 Tour and New Album, \"Love's Crushing Diamond' <mark>Jordan Lee</mark>'s Mutual Benefit has debuted a new video for\" Let's Play / Statue of a Man. \"Directed by Stefan Grabrowski, the video was shot over the span of 6 months in and around Boston using mostly analog equipment and some experimental developing techniques. The resulting images have a frenetic, but also organic quality to them evoking the very personal and soul-searching nature of the song. As described by <mark>Jordan</mark>,\" I think Stefan really captured the spirit of the song by finding the beauty of rusted train tracks and flooded ponds and mashing it all together into a colorful mess. \"You can catch Mutual Benefit throughout the UK and North America this summer. They'll be touring the Northeast with Wild Beasts and playing a bunch of festivals, including the Pitchfork Music Festival, NXNE, Hopscotch, Pygmalion, Way Out West, Green Man, amongst others. Tour Dates: Mon.. May 19 - Dublin, IE @ Workmans Club Tue.. May 20 - Manchester, UK @ Deaf Institute Wed.. May 21 - Glasgow, UK @ Mono Thu.. May 22 - Leeds, UK @ Brudenell Social Club w / Hospitality Fri.. May 23 - London, UK @ Union Chapel Sat. May 24 - Utrecht, NE @ Le Guess Who? Festival Sun. May 25 - Diksmuide, BE @ 4AD Sat. June 14 - Rehoboth Beach, DE @ Dogfish Head Mon.. June 16 - Rochester, NY @ Water Street Music Hall Wed.. June 18 - Toronto, ON @ NXNE @ Legendary Horseshoe Tavern Thu.. June 19 - Buffalo, NY @ Iron Works Sat. June 21 - Northampton, MA @ Iron Horse Sun. June 22 - Providence, RI @ Columbus Theatre Thu.. July 10 - New York, NY @ Pier 84 w / Wild Beasts Fri.. July 11 - Philadelphia, PA @ Union Transfer w / Wild Beasts Sat. July 12 - Washington, DC @ 9:30 Club w / Wild Beasts Mon.. July 14 - Cambridge, MA @ The Sinclair w / Wild Beasts Tue.. July 15 - Montreal, QC @ Corona Theatre w / Wild Beasts Sun. July 20 - Chicago, IL @ Pitchfork Music Festival Thu.. Aug. 7 - Oslo, NO @? ya Nights - Caf? Mono Fri.. Aug. 8 - Gothenburg, SE @ Way Out West Wed.. Aug. 13 - Birmingham, UK @ Hare and Hounds Fri.. Aug. 15 - London, UK @ Jabberwocky Festival Sat. Aug. 16 - Brecon Beacons, UK @ Green Man Festival Sun. Aug. 17 - Brighton, UK @ Proud Cabaret Thu.. Sep. 4 - Sat. Sep. 6 - Raleigh, NC @ Hopscotch Festival Thu.. Sep. 25 - Sat. Sep. 27 - Cincinnati, OH @ MidPoint Music Festival Guitar World's Paul Riario Demos Ernie Ball Aluminum Bronze Strings - Video Fingerstyle Arrangement of Pink Floyd's\" Comfortably Numb, \"Filmed with Guitar-Mounted Camera - Video Exclusive Stream: Sevendust\" Time Travelers & Bonfires' Premiere"}]