[{"date": "2013-05-22", "url": "http://seattletimes.com/html/entertainment/2021037223_felajonesxml.html?syndication=rss", "content": "An interview with Tony-winning choreographer Bill T. Jones about \"Fela!,' the musical about Afrobeat star Fela Kuti, which is coming to Seattle May 28-June 2, 2013. One of the exuberant dance numbers in\" Fela! \"The bedrock of the show is the infectious music by Afrobeat pioneer Fela Kuti. The Afrobeat star Fela Kuti might have seemed an unlikely candidate for a Broadway musical. But theatrical producer Stephen Hendel, a passionate fan, was determined to create a biographical show about the man, a musical with both artistic and mass-audience appeal. He brought the idea to the right person: Bill T. Jones, the leader of the innovative Bill T. Jones/Arne Zane Dance Company and a Tony Award winner as choreographer for the musical\" Spring Awakening. \"The resultant vibrant 2009 theater piece,\" Fela! \"- coming to the Paramount Theatre this week - shook Broadway out of its commercial family-musical torpor .\" Steve didn't want a conventional Broadway director, but someone who could give Fela (as he was widely known) the treatment he deserved, \"Jones recalled by phone recently .\" He felt Fela was the greatest musician nobody heard of. I'd been listening to him since the 1970s, and he's a staple among great jazz and pop musicians, but he had no presence in the world of musical theater. \"Fela did, however, have quite a backstory. The flamboyant composer and multi-instrumentalist pioneered the blending of jazz, funk, psychedelic rock and African rhythms into an exciting, intoxicating Afrobeat brew. He was an outspoken political dissident against the military regime in his native Nigeria. He was also a macho polygamist who had 27 wives; he was a marijuana lover whose pot habit rivaled Jamaican pop idol Bob Marley's; and he had an enormous ego. He was arrested and jailed repeatedly by the Nigerian authorities - often on charges (including conspiracy to murder one of his own band members) that Fela claimed were politically motivated. In 1977, his Lagos compound was burned down, and his activist mother killed, in a Nigerian army raid. How to convey Fela's saga (he died in 1997 of AIDS) to a Broadway crowd? How to evoke his musical genius and political courage, but not sidestep the less savory, more contradictory aspects of his hedonistic life?\" We felt people needed to know in the first half of the show what a brilliant person this is, who he was, why he's important, and make that emotional connection with him, \"said Jones. And his character?\" I was not in a position to judge Fela. Let's assume you went to a concert of his, and he revealed himself to you. You can take what you need and leave the rest. First and foremost, he was an artist. \"The framework for the musical Jones and co-writer <mark>Jim Lewis</mark> devised is a late-1970s concert that Fela gave at The Afrika Shrine, his Lagos nightclub. Riffing off and through the feverish Afrobeat numbers are nonlinear biographical incidents and musings, inspired by Carlos Moore's authorized biography,\" Fela: This Bitch of a Life! \"But the bedrock of the piece is Fela's infectious music - complemented by Jones' fevered choreography and executed by hip-swinging dancers who sometimes encourage the audience to get up and groove along .\" It took over four years to clear all the music rights with Fela's family, \"said Jones. Members of Antibalas, a Brooklyn-based Afrobeat tribute band that performs many of Fela's compositions note for note, were brought in to perform, as well as oversee the musical direction and arrangements .\" The band wanted to play the shows exactly as Fela would, \"said Jones .\" But I wanted to deconstruct the music, change some of the instruments, because Afrobeat is really music for dancing. There's no relief from the groove, and that groove can become deadly in a theater if it's not relieved by storytelling. \"After a years-long gestation and many changes,\" Fela! \"was unveiled in a short pre-Broadway 2008 run at New York's 37 Arts. Though some critics felt the script was weak, Variety reviewer <mark>David Rooney</mark> pointed out that the show\" aims to be less traditional musical theater than cathartic experience, lacing its communicative passion with infectious euphoria, rebellious anger and heartfelt despair. \"After more revisions,\" Fela! \"moved to Broadway in 2009, aided by an infusion of cash and cachet from celebrity co-producers Jay-Z, <mark>Will Smith</mark> and Jada Pinkett-Smith. In the Disneyfied precincts of Broadway, the show's white-hot music, carnality and revolutionary politics were (to my mind) a glorious anomaly. But\" Fela! \"ran just 18 months - though it earned Tony Awards for choreography, costumes and sound design, and many other Tony nominations, had a strong run in London, and has been on tour since last January. (The show had a brief return engagement on Broadway last year .) The cast coming to Seattle includes <mark>Michelle Williams</mark> (of Destiny's Child), and British soprano Melanie Marshall (as Fela's mother, Funmilayo). Adesola Osakalumi and Duain Richmond alternate in the demanding title role. Though the elaborate set had to be condensed for the tour, Jones promises this\" Fela! \"is as much of a thrill ride as the Broadway version .\" The music is still as hot as ever, the performers are just as committed, what's onstage is beautiful as ever. Some things changed out of necessity, some out of maturity. \"The prolific Jones is back making dances for his company, and he's the artistic director of a dance organization, New York Live Arts. Despite all of the compromises, lag time and financial pressures of working in the commercial theater world, he isn't done with Broadway .\" I'm considering a musical based on the movie \"Super Fly,'\" he noted. \"I've been working on it for about four years .\" Misha Berson: mberson @ seattletimes.com Subscribe today for unlimited access! Our introductory rate of only 99? a week includes: Unlimited access to seattletimes.com Seattle Times smartphone and tablet Web apps", "articleID": "2013052619_00014908_W", "names": {"David Rooney": ["Q5239197", "Q5239198"], "Jim Lewis": ["Q15485791", "Q16731449", "Q3178877", "Q47091330", "Q57243784", "Q6196406", "Q6196408", "Q6196413", "Q6196418"], "Michelle Williams": ["Q156796", "Q229153", "Q23893381"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2013-05-26", "url": "http://www.newnownext.com/tell-us-where-it-hurts-rugby-god-ben-cohen-gets-sunburn/05/2013/", "content": "Ex-rugby star and current athlete ally <mark>Ben Cohen</mark> posted this picture from sunny Mauritius, where he and his family are shooting a spread for Hello! magazine. The caption read, \"chillin #Sunburnt #Mauritius at Long Beach Hotel .\" <mark>Ben</mark>, dear, you just tell us where to put the lotion. Tags: <mark>Ben Cohen</mark> | hello magazine | Long Beach Hotel. | Mauritius | standup", "articleID": "2013052706_00004376_W", "names": {"Ben Cohen": ["Q2278517", "Q816463"]}}, {"date": "2013-05-29", "url": "http://bleacherreport.com/articles/1655313-tottenham-hotspur-the-constant-tinkering-of-gareth-bales-identity", "content": "Gareth Bale's career, but by tinkering with his identity, he's now their MVP. Santos and Kevin-Prince Boateng didn' t do-fight on in spite of adversity to become a star at White Hart Lane. \"C' mon Gareth, stop messing about with your hair,\" pleaded then-Spurs manager Harry \"Bale realised he had to be tougher if he was going to make it in the Premier League and he has done that,\" said Redknapp as he reflected on the Welshman persevering through hardship. Paul Gilham/Getty Images The signing of Benoit Assou - Ekotto from Lens-the club that later produced Raphael Despite hopes that he would become a Premier League ace, Bale's tenuous status as a squad player was further exacerbated by playing in 25 winless games for the club, a statistical anomaly. With constant lapses in concentration when he was afforded an opportunity at left-back, Redknapp's patience was growing thin as he lamented (via Tribalfootball. com): \"Bale has to learn how to defend, learn how not to let people play balls inside him, learn to recover, just learn parts of his game .\" Jol: \"I tried to sign Bale on loan at Hamburg. He'd played 20 games without winning but Spurs knew he was exciting\" The Daily Mail's headline on October 21, 2009 was \"Spurs flop Gareth could Bale out in January as Birmingham boss Alex McLeish eyes? 3m defender .\" \"I'm not looking for a left-back because you won't get a better one than Gareth Bale,\" stated The Belfast Telegraph) when queried on the possibility of the Welshman leaving. Inter Milan, cue the taxi for Maicon chants, Redknapp stuck to his gut-instinct (via The National's Rob Shepherd): \"In the long-term I eventually see Gareth dropping back and playing at left-back where he can be one of the best, if not the best .\" Redknapp was a friend of <mark>Peter Knowles</mark>, whose brother, Cyril, was one of Spurs' greatest ever players (via Everyone knows the phrase \"Nice One Cyril' - renowned after the pop record-and every Spurs fan knows that Cyril <mark>Knowles</mark> is one of the best left-backs to grace White Hart Lane. <mark>Knowles</mark> soon developed the style of the overlapping full-back, using all his natural ability from his days as a winger to great effect. envisioned Bale being a modern-day Cyril <mark>Knowles</mark>. Either way, the idea of Bale being a world-class left-back #Spurs left. Imagine writing those words last January - Oliver Kay (@ OliverKayTimes) November 2, 2010\" I remember coming back from scouting him and thinking \"I've seen the new Paolo Maldini',\" recalled former Spurs director of football Damien, the poster boy for de - facto wide forwards masquerading as full-backs, explained his reasoning for starting Bale at left-back (via Sid Lowe at The Guardian): In my team he'd always be a full-back. People get scared and play attacking full-backs as wingers. They think they will attack more, but often they attack less and less well. It happened with <mark>Roberto Carlos</mark>: as a winger, he was less effective, he needs to start his run sooner. skilful and good as a winger, but at Barcelona he would be a full-back. Bale's sudden rise from struggling left-back to world-class winger perpetuated the misconception that Redknapp, never one to shy away from tooting his own horn, always wanted to change the Welshman into a winger from the get-go, when that Jol, who managed Tottenham from 2004-07, was closer to being correct with his initial analysis of Bale's best position than ESPN FC): \"He can play as a wide player but Bale's best position would be as a wing-back in a 3-5-2, what he does with Wales, but we play 4-4-2 .\" \"Was he a left-back or a winger?\" pondered former teammate The Daily Mail). Neither. \"He's turned into a player who is very similar to Manchester United in the way he progressed and started picking up the ball in central positions and scoring goals,\" Shaun Botterill/Getty Images The manager that deserves to receive the most credit for Bale's transformation is Andre Villas-Boas. \"Bale is extremely comfortable playing as a striker and the more he plays there the more he is likely to help the team,\" said Villas-Boas (via <mark>Darren Lewis</mark> at The Mirror). Demanding Bale to be Spurs' deep-lying forward with the ability to roam (talk about a bold tactical move) has Villas-Boas stamped all over it. Gif via The Guardian When Sir Alex Ferguson afforded Ronaldo more freedom, the Portuguese forward's goal tally spiked from 26 to 42 ., he's now scored 50 + goals or more in three successive seasons. By transitioning so quickly from an assist-first mentality to a shoot-first approach, something Villas-Boas encourages, it's understandable why Bale's shots per league goal is a wasteful 7.8, compared to Ronaldo's 6.9 (inefficient) and Lionel Messi's 3.5 (what Bale should aspire to). If Bale stays with Spurs instead of moving to Real Madrid, What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? This comment and all replies have been deleted This comment has been deleted We'd like to send you the most entertaining", "articleID": "2013053000_00092604_W", "names": {"Darren Lewis": ["Q5225019", "Q5225021"], "Peter Knowles": ["Q2076364", "Q473272"], "Roberto Carlos": ["Q10363269", "Q429039", "Q465191", "Q59205376", "Q7351627"]}}, {"date": "2013-06-02", "url": "http://www.nationnews.com/articles/view/just-wait-people/", "content": "By Peter Wickham | Sun, June 02, 2013 - 12:01 AM \"But they that wait upon the Lord shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; and they shall walk, and not faint .\" - Isaiah 40:31 It is entirely understandable that across Barbados people are becoming uneasy regarding our economic situation, as the global environment that feeds our economy is growing worse. Against this background, the recent speech of Minister of Finance Christopher Sinckler was timely. It is difficult to summarize his presentation in a few lines, however, the gist of his position appears to be that \"his\" Government understands the problem, knows what it needs to do and will (in due course) take the necessary action to remedy any economic shortcomings. In addition, we can also take some comfort in the fact that the minister has also (to some extent) taken ownership of this crisis, which was perhaps unwise since the Democratic Labour Party (DLP) Government has hitherto resisted taking ownership. Critics of the DLP administration have understandably not been satisfied with the Minister's response. Leader of the Opposition Mia Mottley's \"cotton candy\" analogy could be considered a kind assessment of a statement that admitted too much that was wrong but said little about how it would be fixed. As amusing as her analogy is, it speaks volumes about the peculiarity of this political scenario and the implications of the DLP's victory in the last election. The minister appears to think that his critics want him to \"fight an election\" all over again. However, to my mind, the clear message in the public's criticism is the concern that this Government needs to \"get cracking\". As he correctly said, and certainly as I have said repeatedly, the election is over, the battle has been won - the people have spoken and reposed confidence in the DLP...Matter closed! There is, however, a fundamental difference between the election battle and the matter of governance and it is at this point that one needs to seriously reflect on the applicability of the \"cotton candy\" reference. Cotton candy is known for being very sweet but not particularity substantive, and for this reason it is popular at events where the sweet taste is applicable, although one would never consider it for a meal. The Leader of the Opposition, therefore, seems to be saying the party is over and now it is time for the \"main course\" , which is a position few can find issue with. If, therefore, we agree that it is time for the main course to begin, the next logical question relates to the ingredients or shape Government's action will take, and this too, is an issue about which there can be much speculation. Certainly, the DLP administration has circumscribed its likely action by making it \"pellucid\" that it will not be sending home public servants now, or in the future. This is a policy position articulated by late Prime Minister <mark>David Thompson</mark> and reiterated by Prime Minister Freundel Stuart and reinforced by the minister, even in the face of recent suggestions by one trade unionist that Government was preparing the \"turf\" for a wave of dismissals. There will be presumably equal comfort in the presumption that the DLP Government's solution to this economic crisis will not include any significant component of privatization, since that too, was soundly rejected by the party in the last election campaign. The fact that the Dems won the election, therefore, means this position has been endorsed and we can rest easily in the knowledge that the \"demon\" of privatization has been set aside for the time being. The admission that our deficit is a problem is not particularly helpful without an indication of the manner in which this problem will be approached, especially as the two logical facilities to address it have been effectively \"ruled out\". I am also inclined to think that problems such as these are easier to tackle when one is proactive, hence, it would make sense to take action sooner rather than later. I am, however, aware that this is not about what I think or feel, but about the confidence the people of this country have placed in the DLP and its leadership. This vote of confidence means that we all have to sit quietly and wait until the time when this administration considers it appropriate to act. Services For information about this website or content published please contact the Online Editor respectively. Regarding press releases please contact Janice Griffith. Subscribe Subscribe to NationNews with our Twitter. Legal Copyright? 1997 - 2012, Nation Publishing Co.. Limited? P.O. Box 1203, Fontabelle, St. Michael, BB11000, Barbados, West Indies? All Rights Reserved", "articleID": "2013060211_00003638_W", "names": {"David Thompson": ["Q1176843", "Q14950372", "Q15378706", "Q16499854", "Q16830995", "Q18924157", "Q20710001", "Q28434580", "Q310082", "Q5236246", "Q5240375", "Q5240378", "Q5240379", "Q5240380", "Q5240381", "Q5240382", "Q5240383", "Q56192238", "Q58065993", "Q718669"]}}, {"date": "2013-06-02", "url": "http://www.standard.net/stories/2013/06/01/local-police-gear-never-say-door-kicks-few-far-between", "content": "OGDEN - The suspect is dead and the prosecution may be closed, but the <mark>Matthew</mark> <mark>David Stewart</mark> case will stay with us, flying in two directions. <mark>Stewart</mark> was facing the death penalty for a Jan. 4, 2012, shootout with police that left him and six officers wounded, one fatally. On May 24, <mark>Stewart</mark> was found dead of an apparent suicide in his jail cell. The state Department of Public Safety is investigating. Formal charges against <mark>Stewart</mark> are scheduled to be dismissed Tuesday in 2nd District Court. <mark>Stewart</mark> faced execution in the killing of officer Jared Francom, whose name is now on the Ogden Public Safety Building. On the one hand, the many websites and pages put up by <mark>Stewart</mark>'s family and supporters talk about getting money together for a memorial. They see him as the victim of the heavy-handed, jack-booted power of the state, even calling him a political prisoner in the war on drugs. On the other hand, police here are armoring up like never before. The gun battle at <mark>Stewart</mark>'s home a year and a half ago erupted as the Weber-Morgan Narcotics Strike Force broke down <mark>Stewart</mark>'s door, serving a \"knock and announce\" search warrant for his pot plants. Last August, four Weber police agencies formed the Tactical Operations Group, or TOG, essentially in response to the lessons of the <mark>Stewart</mark> raid. \"TOG was in the planning stages before <mark>Stewart</mark>,\" Sheriff Terry Thompson said, \"but that incident added to the urgency of getting it up and running .\" His agency, along with the police departments of Ogden, Roy and North Ogden, supply officers to the 40-member TOG, officers with extra training and gear in forcibly serving search warrants. \"<mark>Stewart</mark> is the new standard,\" said Lt. Troy Burnett, who administers the TOG. Meaning, he said, TOG squads will serve all warrants with full body armor and helmets as strict policy, regardless of whether the warrant is judged low or medium risk or is for a minor or major offense. The <mark>Stewart</mark> warrant was considered low risk, officers nonetheless entering the home with guns drawn but wearing Kevlar vests, no helmets. \"It's about what the next <mark>Stewart</mark> decides to do,\" Thompson said. \"This wasn't about marijuana. It was a violation of the law. They want to make it about marijuana, but we served a legal search warrant and got the shit shot out of us .\" The TOG is available to any police agency. Those forces are typically expected to adopt the TOG full-armor policy when supporting a TOG unit. Thompson said his agency is considering adopting that Tactical Operations Group policy as its own. <mark>Stewart</mark> supporters rallying online include marijuana decriminalization groups, as well as Second Amendment fans, but for the family, the issue isn't marijuana. It's not pot Erna <mark>Stewart</mark>, a sister-in-law who has emerged as the family spokesperson, says it's the proliferation of what they call \"home invasion raids .\" She said blame is easily assigned, \"but everyone had their faults that night,\" referring to Jan. 4, 2012. \"I just want people to admit that so we can heal. Our community has been ripped in two, and that's very hard. My faith in the system has been ruined. I don't like that either...\"I would like to have some peace officers come sit down and talk to me so I can have some hope .\" She said her brother-in-law's death in the jail still leaves her in tears every day. They buried <mark>Stewart</mark> in a private ceremony Tuesday, unannounced even to the web groups. The \"Supporters of <mark>Matthew Stewart</mark>\" Facebook page, for one example, counted 885 members as of Friday. Erna <mark>Stewart</mark> said the online pages will continue to raise awareness of the dangers of increasing numbers of the search warrant \"door kicks\" and other aggressive tactics. Concerns nationally The American Civil Liberties Union in April announced a nationwide study on the \"militarization\" of police. Law enforcement scholars point to a near doubling of \"SWAT-style\" raids nationally to near 80,000 a year since 2001 with the proliferation of armament grants to local police from the Department of Homeland Security. \"We're not going away,\" Erna <mark>Stewart</mark> said. \"There's no way I can stop now. People need to know what we know .\" As to the monument, honestly, we're so exhausted right now. We're still grieving. But we could do it, find a place, on private property. It would be amazing. \"The first mention of a possible <mark>Matthew Stewart</mark> memorial was made the day after <mark>Stewart</mark>'s death. A day later, seven people had pledged money for a memorial\" to mark this gross violation of human rights. \"They included Salt Lake lawyer Andrew McCullough, former Libertarian Party candidate for Utah attorney general. Todd Blair video Some on the <mark>Stewart</mark> sites enjoy savaging Burnett, the Tactical Operations Group administrator. Burnett is memorialized on YouTube in the September 2010\" no-knock \"raid by the strike force at the home of Todd Blair in Roy. In helmet-cam video later released to the media, Blair is seen being fatally shot three times as Burnett enters the front room some five seconds into the raid. Blair had a golf club raised over his head; Burnett said he thought Blair was brandishing a sword. Web comments attached to news stories over the years on the <mark>Stewart</mark> case inevitably included a link to the shooting on YouTube. Burnett's TOG has been called a death squad. Erna <mark>Stewart</mark> calmly said the TOG is a step in the wrong direction .\" We want to avoid being a negative site altogether if we are really going to make a positive change happen. \"She said she would like to hear from police opposed to strong-arm enforcement of the law. Bernie Allen, one of <mark>Stewart</mark>'s defense lawyers, said they're out there but are a minority .\" I get emails all the time from law enforcement officers who are very concerned about it, since this case and Blair's, \"Allen said .\" It's a handful, but there is concern, and prosecutors outside Weber County have expressed concerns. I hope that means something. \"The whole war on drugs is a horrendous way to look at this...why crash his house?\" he said of the <mark>Stewart</mark> case. \"Was he going to flush his 4-foot pot plants down the toilet?\" ' A minority view' A veteran former prosecutor is also concerned. \"I'm not taking sides on the <mark>Stewart</mark> case,\" said Camille Neider, former deputy Weber County attorney, now a defense attorney. \"I see good arguments and reasoning on both sides. But you have to ask, was that type of force necessary, legal or not, for someone growing pot in their basement?\" You have to balance on a scale. Like a child abduction, or a kidnapping, obviously you have to move quickly. But I don't think we need the TOG, another squad to kick in doors. \"But Thompson and other officials said they are not aware of any agencies that are considering cutting back, as a matter of policy or practice, on\" dynamic entries, \"as the door kicks are sometimes called. That includes the Ogden Police Department, said Lt. Chad Ledford. After the strike force's roughly 100-plus search warrants served a year, Ogden's force is typically next in volume with well under 100. TOG, Ledford said, fills a need for the warrant servicing that doesn't reach the danger level of needing a full SWAT callout .\" There's always the philosophical argument of \"Is it worth it?' But the Legislature makes the laws, and we have to enforce them .\" Ledford added that people are imagining \"we're booting doors in every day. That's not happening .\" \"A good portion of people answer the door. Only a small percentage require a breach .\" As to officers individually or personally rethinking door kicks for minor offenses such as pot plants, Ledford said, \"It's not the topic of conversation every day. But there are those who are wondering about it, if you look hard enough .\" Weber County Attorney Dee Smith, an ardent defender of the breaches as necessity, is not wondering. He even trained with the TOG, brandishing a firearm with \"sim rounds,\" plastic simulated bullets, and shouting \"Police - search warrant\" during door-kick drills. \"I wanted to understand the process they go through, what they face,\" Smith said. TOG squads are available for all agencies, all types of investigators, for serving warrants, \"even property crime detectives .\" He discounted the <mark>Stewart</mark> supporters: \"I don't see that as any kind of movement, just people with an agenda who are grabbing ahold of the <mark>Stewart</mark> case. But it's a minority view .\" Thompson concluded he's confident if there were problems or abuses with forceful serving of search warrants, the judiciary would remedy them. \"I know good people who are concerned about the breaches, and I still love 'em, they're still my friends .\" ", "articleID": "2013060213_00021099_W", "names": {"David Stewart": ["Q1176741", "Q43393739", "Q43912947", "Q5240083", "Q5240087", "Q5240088", "Q5240089", "Q723284"]}}]