[{"articleID": "2013121300_00097075_W", "names": {"Ashley Benson": ["Q230609", "Q725763"], "Phil Davies": ["Q3378756", "Q3378758", "Q47488684", "Q55629811"]}, "date": "2013-12-12", "url": "http://www.belfasttelegraph.co.uk/news/world-news/spain-says-no-to-catalonia-vote-29833318.html", "content": "Ireland's police chief has said he will never accept a judge's finding that officers valued loyalty to the force over the truth during an eight inquiry which uncovered collusion with the IRA. Ford's reputation has been blemished by its failure to fulfil its moral duty to pay former employees their full pensions, MPs heard today. The Ulster Bank Belfast Festival at Queen's may be over for another year, but the Belfast Telegraph - official media partner to the event - is proud to announce the results of its ever-popular Audience Award. Belfast Festival: Ten days of events that pushed the boundaries <mark>Ashley Benson</mark> has hit out at the new Pretty Little Liars poster for making them look \"ridiculous\" . Blanchett recalls first style splurge Cate Blanchett bought an Armani suit with her first ever paycheque. A royal baby, a raunchy dance, a new pope, a boy band and the crowning of a tennis champion were just some of the hot topics of conversation this year on Twitter. West Norfolk: Exploring a rejuvenated King's Lynn Pre-dating the EU by more than half a millennia, the Hanseatic League was a vibrant North European free trade organisation. /> The leader of the center-right Catalonian Nationalist Coalition (CiU), Artur Mas has set the date for a planned referendum on possible independence (AP) The president of Spain's regional government of Catalonia has said he wants to hold an independence referendum on November 9, 2014, but the Spanish government immediately said no. Eurozone industrial output slumps Putin defends conservative values Thousands queue to bid sad farewell as Mandela lies in state Mourners pay respects to Mandela Barcelona that the referendum would ask the region's voters if they want Catalonia to be a state and, if so, should it be independent. Mr Mas did not clarify the distinction between a state and an independent state. However, the questions appeared to open a door for those nationalists who want Catalonia to have the structure of a state but remain a part of Spain, possibly along the lines of Puerto Rico and the United States. Justice Minister Alberto Ruiz Gallardon responded to Mr Mas' announcement, saying a referendum would be illegal and would not be allowed. Spain's Constitution says only the central government in Mariano Rajoy recently rejected a request by Mr Mas to allow one. The government has not said what it might do to prevent a ballot. Mr Mas said the referendum date was set almost a year away so as to give ample time for negotiations with Madrid on \"the way to stage the consultation legally.\" Polls indicate that Catalans are roughly evenly split on independence. The European Union and Nato have warned Catalonia it would be excluded if it seceded. Scotland is staging an independence referendum next year, on September 18. That vote has been approved by the British government. Mr Mas began pushing for a referendum after he failed to clinch a better financial pact for Catalonia with the central government in 2012. The referendum proposal got the support of some one million people who turned out at two demonstrations held since then. The possibility of a region having the right to decide its future has stirred much political debate and raised questions as to whether it is time to reform the 1978 constitution to ease territorial discontent. The Basque region, which has traditionally sought greater powers, failed in a bid to hold a self-determination referendum several years ago. Catalonia is one of the country's most powerful regions and represents roughly a fifth of Spain's 1.1 trillion euro (? 930 bn) GDP. Its population of 7.5 million is greater than those of EU members such as Denmark, Ireland or Finland. The region, like others in Spain, has its own language as well as Spanish. Its financial powers include some tax collecting rights. Nelson Mandela: Sign language interpreter at memorial event was \"fake' who\" made up his own signs' This year's university winter graduations Victoria's Secret opens first shop on island of Ireland new Ireland's police chief has said he will never accept a judge's finding that officers valued loyalty to the force over the truth during an eight inquiry which uncovered collusion with the IRA. new Ford's reputation has been blemished by its failure to fulfil its moral duty to pay former employees their full pensions, MPs heard today. new Crystal Palace manager Tony Pulis has dismissed speculation of a move for Blackburn's Scotland striker Jordan Rhodes in the January transfer window. new Cardiff Blues director of rugby <mark>Phil Davies</mark> has warned his side they must raise their game to a new level if they are to complete the Heineken Cup double over Glasgow. new A personal assistant accused of defrauding Nigella Lawson and Charles Saatchi has told a court that she saw evidence of regular drug use by the celebrity cook. new Never mind the X Factor, here's the Xmas fodder...artist Nathan Wyburn has given a taster of the talent show's climax by creating portraits of the finalists from food. new Helena Bonham Carter will face Dame Helen Mirren at the Golden Globes as they are both up for the same award. By using this website you consent to our use of cookies. For more information on cookies see our"}, {"articleID": "2009031300_00029393_W", "names": {"Martin Bryant": ["Q6775074", "Q970560"]}, "date": "2009-03-13", "url": "http://watoday.com.au/national/reforms-target-youth-mental-health-problems-20090313-8wrw.html", "content": "single page view mental health workers will go into schools, youth centres and even kindergartens, looking for the earliest signs of preventable mental illness as a first step in victoria's youth-focused mental health strategy to be released today. under the 10-year plan, victoria will also appoint a chief child psychiatrist, a first for australia, and set up a $1.8 million program to help families traumatised by the bushfires. a youth mental health expert welcomed the strategy as potentially the biggest step forward since the kennett government scrapped asylums, but warned that the rest of the plan must be put into effect urgently or victoria could miss treating a young \"potential <mark>martin bryant</mark>\" (the port arthur gunman). premier john brumby said it was not financially possible to reform the whole mental health system straight away. the first step will be two pilot projects, one in the grampians and one in melbourne's south, that will send mental health workers into the community to spot early signs of mental illness and guide young people to help. the workers will go into schools, kindergartens, youth centres, gp clinics, hospitals and housing support services in order to make mental health services more accessible. \"one of the key challenges we've got is moving into this space earlier, tackling these issues earlier and focusing more on child and adolescent mental health issues,\" mr brumby said. \"some of the problems, like bipolar (disorder) and schizophrenia, often emerge in late adolescence, and if you are able to tackle those things early, it can just make a fundamental difference to people in later life.\" the strategy paper also incorporates a program called renew, under which experts in post-traumatic stress disorder will work with bushfire victims. the government will appoint a chief child psychiatrist to establish new standards for the treatment of mental illness in children."}, {"articleID": "2017061500_00806727_W", "names": {"Samuel Johnson": ["Q1251433", "Q1255535", "Q27824338", "Q4119435", "Q44872191", "Q57777407", "Q7411862", "Q7413148"]}, "date": "2017-06-15", "url": "http://www.ipswichadvertiser.com.au/news/tv-host-embraces-fire-survivor-he-breaks-down/3189856/", "content": "Mother posts video from burning tower 12 dead in London tower fire Girl photobombs live TV Former Top Gear hosts have a new name <mark>Samuel Johnson</mark> Foxtel launches Netflix rival MKR contestants JP & N elly BBC host almost eats his own flesh A BBC TV host has embraced London fire survivor Mahad Egal as he broke down describing \"horrific\" scenes of people jumping and throwing babies from the blaze. Mr Egal, a resident of the Grenfell Tower where 12 people died in the overnight blaze on Wednesday, put his head in his hands and wept as he recalled the dramatic scenes of the tragedy. Clad in a blue tracksuit and standing on the street, Mr Egal was speaking on camera to BBC host Victoria Derbyshire who was forced to cut the interview and embrace Mr Egal as he struggled to speak. BBC host Victoria Derbyshire embraces London fire survivor Mahad Egal as he breaks down describing \"horrific scenes' of the Grenfell Tower blaze. Picture: BBC\" This was really horrific. There's people who were jumping out. There's a man who threw two of his children, \"Mr Egal said before he became choked up with emotion. Ms Derbyshire pulled Mr Egal to her in a comforting embrace for several seconds, before separating from him but keeping her hand on his shoulder, shaking her head and saying,\" Wow \". With his eyes still downcast, Mr Egal then said,\" We saw a lot, we saw a lot. We saw a lot with our own eyes, we saw...\"He broke down again and held both his hands up to his face as if to block out the horror. 12 dead in London tower fire: London's Fire Commissioner describes fire as\" completely unprecedented \". Derbyshire again tried to comfort him with her hand on his shoulder and said,\" it's alright, you don't have to say anymore \". Other Grenfell residents have described terrifying scenes of their narrow escape from the blaze. Hanan Wahabi fled the building with her husband and their 16-year-old son and daughter, eight. However she last spoke with her brother, who lives on level 21, at 2am on Wednesday.\" I told him to leave. He said he was going to come. Then I called him and he said there was too much smoke. \"I've not heard from them since.\" Related Items MP queries safety of Australian buildings after London fire Mum trapped in London fire posts harrowing videos London fire: \"Nobody on top three floors survived' Grenfell Tower fire: Why was cladding added? London horror: 12 confirmed dead but toll likely to rise London inferno:\" The baby just fell straight down' London Fire: \"They can't say they haven't been warned' Show More 0 bbc Read More Login to follow deaths Read More Login to follow editors picks Read More Login to follow grenfell tower Read More Login to follow london fire Read More Login to follow media Read More Login to follow Topics: bbc deaths editors picks grenfell tower london fire media Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}, {"articleID": "2009021602_00022212_W", "names": {"Mike Green": ["Q1381562", "Q16123603", "Q1612734", "Q16729427", "Q1933171", "Q6847063", "Q6847064", "Q6847065", "Q6847066", "Q6847067", "Q6847068", "Q6847069"], "Mike Mckenna": ["Q3313440", "Q6847938"]}, "date": "2009-02-16", "url": "http://msn.foxsports.com/nhl/story/9226638/Ovechkin-gets-Caps", "content": "<mark>green</mark> streak ends; ovechkin lifts capsthe florida panthers shut out washington's record-setting defenseman, but couldn't stop the nhl's top goal scorer. <mark>mike green</mark>'s nhl-record goals streak for defensemen ended at eight games, but alexander ovechkin scored three times to give the capitals a 4-2 victory sunday. \"arguably the best player in the game made some big-time plays,\" florida coach pete deboer said. \"that's what beat us.\" ovechkin's second goal broke a tie with 2:31 left, and he completed his third hat trick of the season and the eighth of his career with an empty-netter to push his nhl-leading goals total to 41. alexander semin (was - right wing) news: semin scored a goal and added two assists saturday to help the caps beat the lightning 5-1. [impact: semin returned to the lineup saturday, after a one game absence and re-united with his \"usual\" top linemates, alex the great and nicklas backstrom. he took advantage of his opportunities and assisted on <mark>mike green</mark>'s historic eighth consecutive game with a goal. he added a plus-1 rating, three shots on goal, and two penalty minutes. the \"minor injury\" did not seem to bother him saturday. owners should keep him active. ((was - left wing) news: ovechkin netted a goal in the caps' 5-1 victory over the lightning saturday. [impact: ovechkin added a plus-1 rating, five shots on goal, and two penalty minutes in the win. the goal he scored was a quick snap that <mark>mike mckenna</mark> did not even see. he continues to amaze all when he is on the ice. ((was - goaltender) news: neuvirth was sharp saturday, earning his first career nhl win as the capitals routed the lightnng 5-1. [michael frolik (fla - center) news: frolik has been back to his scoring ways in the panthers' two games after a two-week disappearing act. the rejuvenation could be a response to reduced ice time last weekend, according to the miami herald. [impact: frolik has 13-13-26 in 52 games this season, but coach peter deboer may have thought his young winger was hitting a bit of a rookie wall. frolik was back up to 17 minutes of ice time in the panthers' win over the n.y. rangers on friday, so all seems to be well moving forward. ((fla - goaltender) news: vokoun will start sunday's game against washington, the miami herald reports. [impact: vokoun has won three straight and is 10-3-2 since early january. ((fla - goaltender) news: vokoun made 34 saves as the panthers beat the rangers 2-1 in a shootout on friday evening. [statistical information provided by:"}, {"articleID": "2018012705_00448176_W", "names": {"Curtis Fleming": ["Q3007800", "Q56461130"], "Colin Cooper": ["Q1108398", "Q28873601", "Q472373", "Q5145003", "Q5145005"], "Steve Vickers": ["Q364424", "Q3973412"], "Chris Martin": ["Q16724461", "Q17744566", "Q21020921", "Q21663261", "Q25171658", "Q28678811", "Q30122010", "Q43133913", "Q48589106", "Q5107345", "Q5107346", "Q5107348", "Q5107349", "Q5107350", "Q5107353", "Q5107354", "Q5107355", "Q5107356", "Q519982", "Q712860"]}, "date": "2018-01-27", "url": "http://www.thenorthernecho.co.uk/sport/15901628.SUNDERLAND__The_coach_who_used_to_clean_Juninho__39_s_boots_is_enjoying_seeing_young_Black_Cats_shine/", "content": "Show caption () View gallery Skip to next image \"0 comments ROBBIE STOCKDALE remembers what it was like to be a teenager making the breakthrough at first team level. He would clean the boots of Juninho as a teenage scholar at Middlesbrough, dreaming of the time he might join the Brazilian on the first team stage. A little later than normal, because of Juninho's departure and then return to Teesside a few years later, Stockdale eventually did. Through hard work and determination, the young man from Redcar made it onto the first team stage--and that is the message he has been banging at Sunderland over the last five-and-a-half years. And, having first joined Sunderland as a coach in the youth set-up from Grimsby Town, he was as proud as anyone else at the club last weekend when five graduates of the academy system helped secure a vital 1-0 win over Hull City at first team level. Loading article content Joel Asoro scored the winner that afternoon and he had George Honeyman, Josh Maja and Ethan Robson alongside him. Lynden Gooch emerged from the bench too. Having experienced what it is like to make the grade the grade at Premier League level with Middlesbrough and then eventually move on seven years later, when he went onto have spells at numerous clubs in lower leagues, Stockdale has stressed the challenge is to stay there. He said:\" The distance from the Under-23s room to the first team room at the Academy is maybe 50 steps. That is the hardest 50 steps any player will ever make. They think they're closer but it is the hardest to take. You have to embrace it and once you do get there you have to stay there. \"I always remember <mark>Curtis Fleming</mark> at Middlebsrough saying to me, when we were battling for the right-back place and an Argentinian came in for the trial. <mark>Curtis</mark> said to me,\" come on, he's not taking our place'. That's the mentality you've got to have, people always want to take your place. \"Sunderland manager Chis Coleman is showing he is willing to give youth a chance, even if he is probably giving more than he would like because of the club's predicament. In that sense, Championship football and relegation from the Premier League has helped. Stockdale said:\" If they're good enough they would get the chance. Certainly this year we wanted them to be part of it and that drips down to the academy. So the Under-23s on Tuesday night was a young team, we're trying to mould that into an Under-19 team if we can so they get an experience of older football. \"We want to get the Under-16s in the Under-18s and if they're good enough the U23s. That's the idea, filter the better players if you like and test them quicker. We'll be sending players out on loans, too.\" Sunderland have wasted plenty of cash over the last decade on players who have not fitted into the club's way or not lived up to their billing; so the change of direction should be applauded and welcomed now that they are in the Championship's relegation zone. Coleman is also keen to build a reputation for helping Sunderland by developing youth from other clubs, highlighted by his capture of Chelsea youngster Jake Clarke-Salter and how he has put him in the team straightaway. Stockdale, who has remained a first team coach under Coleman, said: \"Sometimes it can lift them to have senior players alongside them, because you feel that extra responsibility to the players next to you.\" We had <mark>Colin Cooper</mark> in yesterday, he works with the England Under-21s now and so he came in to see Jake. Jake said to him, I've learned more about defending playing alongside John O’Shea in two games than I have in any amount of junior football. The senior pros have all been in that situation and you really do remember those chats you have, those little bits of information. \"Stockdale certainly had that in his younger days. As a teenager in 1998 his debut was alongside Mark Schwarzer, Paul Merson and Co in Middlesbrough colours. He said:\" It was a cup game on the Tuesday night against QPR. Bryan Robson told me the day before I was in, which didn't help me sleep! But then, and this is the high and lows, on Saturday I was cleaning the boots. \"What is important, and it was exactly the same with me and Boro, is that the younger players come into an environment with really good senior pros. Nigel Pearson was my captain, Robbie Mustoe, <mark>Steve Vickers</mark>. They lead the way and you follow, it is still the same now.\" Now Stockdale is playing a huge part in providing the link between the academy at Sunderland and the first team picture, where the likes of Honeyman are grateful to the advice they have received. Honeyman has played more than any other player for Sunderland this season, and is determined to stay in the mix for the longer term. Sunderland might be in the throes of a relegation battle, but he is convinced that the experience can make all of the young talents stronger people and players. He said: \"I think it can make or break you. To get to this stage, though, I think you have to have a certain mental toughness anyway. There are so many young lads who come through who are all desperate to be first-team players, and you go through so many ups and downs even at a young age, that if you don't have that mental toughness then you will have probably fallen by the wayside anyway by now.\" It (the relegation fight) is not where we want to be, obviously, but once we come through it I am sure it will help the young lads in the long run. \"When you are a young player coming in, you have that excitement, and you probably don't realise the pressures. Ethan, Joel and Maj, they just want to come in and do really well--they are not focused on the consequences of defeat. That's the kind of freshness that young players can bring.\" Sunderland are up against Birmingham on Tuesday and Coleman hopes to have more new arrivals in by then. He signed winger Kazenga LuaLua on a free until the end of the season on Thursday night and is still in the hunt for at least one striker and a goalkeeper. Derby's <mark>Chris Martin</mark> is still on the radar, while it has emerged Hearts striker Kyle Lafferty is also under serious consideration. The Scottish Premier League club, however, are seeking a fee for the experienced Northern Ireland front-man. 0 comments"}, {"articleID": "2019050311_00332192_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-05-03", "url": "http://www.gamereactor.eu/games/72423/Tennis", "content": "TENNIS WORLD TOUR REVIEW. Written by Jonas Mäki on the 31st of May 2018 at 14 \"It may have a stable foundation but it also has a very uncertain future.\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 12th of February 2019 at 10 The esports competition is getting an expanded second edition ahead of the game's full launch in May this year. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 20th of May 2018 at 11:25 PC and Switch players will have to wait a touch longer. 0 NEWS. Written by Sergio Figueroa on the 18th of April 2018 at 15:55 They \"served' us up an\" ace' of a trailer. 0 ESPORTS. Written by Islem Sharouda on the 29th of March 2018 at 14 This will be held at Roland Garros, the French Open."}, {"articleID": "2018071907_00284814_W", "names": {"Fernando Torres": ["Q3821470", "Q42731", "Q47088453", "Q58658056"]}, "date": "2018-07-19", "url": "http://www.espnfc.us/sydney-fc/story/3569724/sydney-fc-wont-rush-into-marquee-signing-chief-executive-danny-townsend", "content": "By AAP Share Tweet less than a minute ago Sydney FC won't rush into marquee signing - chief executive Danny Townsend Steve Corica has an extra $1.3 million in the kitty after pocketing a transfer fee for Adrian Mierzejewski. Sprinting great Usain Bolt appears close to securing a trial stint with the Central Coast Mariners. Manchester City manager Pep Guardiola takes time to meet Melbourne City players and fans in Australia. Sydney FC won't rush into signing replacements for Bobo and Adrian Mierzejewski, with chief executive Danny Townsend aiming to reel in a big fish as European transfer actions heats up. The Sky Blues are searching far and wide as they attempt to cover the loss of Bobo, who earlier this year broke the record for most goals in an A-League season, and Mierzejewski, who claimed the Johnny Warren medal in his only season with the club. They unsuccessfully courted Spanish striker <mark>Fernando Torres</mark>, while Japanese star Keisuke Honda has been strongly linked with Melbourne Victory. Townsend still has high hopes of attracting a high-profile player with the help of the Football Federation Australia's marquee fund. \"<mark>Torres</mark> was obviously one to be allocated some of those funds. If we come up with another one that has that level of marketing attraction then we'd put it to the FFA,\" he told AAP. \"We're doing that every day. Every day another player comes up, we ask the question.\" They run it through their models and tell us if it's viable. \"The important thing is we don't need to rush. We've got the core nucleus of the team in place and we'll look to add some quality, most probably in the front three.\" The A-League season starts in October while European transfer windows close in August. \"If you look back over the years, our foreign players have come in reasonably late,\" Townsend said. \"We're not panicking, we've got plenty of time.\" We want to make the right decision both from a performance and marketing perspective. \"There's plenty of fish in the sea...every day throws up a different name.\" There's so many different players, particularly as the window in Europe opens and gets going post World Cup; there'll be more and more opportunities. \"Bobo and Mierzejewski scored a combined 40 goals in the 2017-18 season, underling the immense void the Sky Blues are attempting to fill. Captain Alex Brosque--who has scored more goals and made more appearance for Sydney FC than any other player--insists the duo's departure won't change the way his side plays.\" Our style, defensively how aggressive we are...that won't change, \"Brosque said.\" The boys that come in will have to adapt to that and learn that quickly. \"Adrian and Bobo leave a very big hole, when you consider what they did last season, but it's the way football is.\" They'll leave and new players will replace them and do just as good a job. \"Comments Use a Facebook account to add a comment, subject to Facebook's Terms of Service and Privacy Policy. Your Facebook name, photo & other personal information you make public on Facebook will appear with your comment, and may be used on ESPN's media platforms. Learn more. Sydney FC Australian A-League"}, {"articleID": "2018082819_00041447_W", "names": {"Ted Kennedy": ["Q134549", "Q326157"], "Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"]}, "date": "2018-08-28", "url": "https://www.rollingstone.com/politics/politics-news/trump-mccain-veterans-716470/", "content": "President Trump, surrounded by Vietnam veterans, speaks before signing a proclamation commemorating the 50th anniversary of the Vietnam War during a veterans event at the Grand Hyatt, in Danang, Vietnam. AP/REX Shutterstock For someone who talks a big game about respecting the military, President Trump spends a lot of time offending service members. His latest affront came after John McCain died Saturday. That night, the president reportedly nixed the released of a statement honoring McCain's legacy, instead opting to fire off a perfunctory tweet that failed to commend the senator. The next morning, Trump occupied himself by attacking the Justice Department, and on Monday he ordered the American flags at the White House to return to full-staff, despite the tradition that they remain lowered until the deceased can be interned. While appearing before reporters later in the day, Trump refused to answer questions about McCain. Some of America's most prominent veterans groups were not happy. \"On the behalf of the American Legion's two million wartime veterans, I strongly urge you to make an appropriate presidential proclamation noting Senator McCain's death and legacy of service to our nation, and that our nation's flag be half-staffed through his interment,\" Denise Rohan, the national commander of the American Legion, wrote in a statement, adding that McCain \"was an American hero and cherished member of The American Legion\" before listing his credentials as a Vietnam veteran and member of Congress. AMVETS posted several tweets expressing their disappointment \"in the lack of traditional and appropriate respect in the White House's reaction to the death of McCain, a\" retired Navy captain and former prisoner of the Vietnam war, who gave 60 years of honorable service to his country. \"3 ️ ⃣ / deaths of Senators <mark>Ted Kennedy</mark> and <mark>Robert Byrd</mark>. But John McCain was not just a sitting senator. He was a war hero, twice a presidential contender, and a national treasure who devoted his entire adult life to protecting and improving the American way of life. pic.twitter.com/Qtf3OQnpAG--AMVETS (@ AMVETSHQ) August 27, 2018 Veterans of Foreign Wars chimed in, as well.\" The U.S. Flag Code calls for lowering the flag to half-staff on the day of and the day after the death of a member of Congress, \"a VFW spokesman told HuffPost.\" That the White House did on Saturday and Sunday. We have asked the White House if the honor could be extended. No response back yet. \"The backlash from veterans' groups reportedly spurred the president to order White House flags be returned to half-staff later on Monday.\" Despite our differences on policy and politics, I respect Senator John McCain's service to our country, and, in his honor, have signed a proclamation to fly the flag of the United States at half-staff until the day of his interment, \"Trump said in a statement. While speaking at a dinner celebrating evangelical leadership Monday night, the president said,\" We very much appreciate everything that Senator McCain has done for our country. \"AMVETS thanked Trump for ordering the flag be re-lowered to half-staff. The American Legion and the VFW tweeted the news. Sen. Lindsey Graham (R-SC), an Air Force veteran and one of McCain's best friends, didn't seem too bothered about the president's response during an appearance on the Today show Tuesday morning.\" It is all over now, \"Graham said.\" The flag is down. When the president mentioned John he got applause. \"He added that Trump was\" not the only one to have a tense relationship with John McCain. \"Related Jamil Smith: Lessons From a Botched Voter Suppression Scheme Taibbi: Why Did John McCain Continue to Support War? For some former service members, the damage may have already been done. Hearing tonight from a surprising number of veterans and vets' relatives who all say Trump's handling of McCain's death, esp the flag fiasco, did irreparable damage to their opinion of him, which had been positive until now. WH & GOP, take note: It's more serious than you think .--Christina Wilkie (@ christinawilkie) August 28, 2018 But no one should be surprised by Trump's pettiness toward McCain, which is only the latest example of the conditionality of the president's respect for the military. If showing appropriate reverence for service members in any way conflicts with his own ego, he'll throw any veteran under the bus without giving it a second thought. He did so with McCain after the senator was critical of him in 2015, arguing that the Vietnam veteran--who not only was shot down and jailed, but refused to be released because other American soldiers had been imprisoned longer--was not a war hero. That comment alone should have disqualified Trump from ever pretending to respect those who have served. Veterans, including Lindsey Graham, were outraged. If there was ever any doubt that @ realDonaldTrump should not be our commander in chief, this stupid statement should end all doubt .--Lindsey Graham (@ LindseyGrahamSC) July 18, 2015 At the heart of @ realDonaldTrump statement is a lack of respect for those who have served--a disqualifying characteristic to be president--Lindsey Graham (@ LindseyGrahamSC) July 18, 2015 Trump never apologized for the statement, and after McCain's family announced on Friday that the senator had decided to discontinue medical treatment, the Washington Post reported that Trump still did not regret making it. A year after discounting McCain's service, Trump bashed Khzir Khan after the Gold Star father criticized Trump during a speech at the Democratic National Convention.\" Mr. Khan who has never met me, has no right to stand in front of millions of people and claim I have never read the Constitution, (which is false) and say many other inaccurate things, \"Trump said in a statement. A few days later, while discussing how he was gifted a Purple Heart by a retired lieutenant colonel who served in Iraq, Trump joked about the honor.\" And I said, \"Man, that's like big stuff. I always wanted to get the Purple Heart,\" Trump said. \"This was much easier.\" (Trump famously received five dubious draft deferments during the Vietnam War .) Once again, everyone was outraged. \"A direct attack on a Gold Star family, for their patriotism, for their integrity, is totally unprecedented,\" Paul Reickhoff, the founder and CEO of Iraq and Afghanistan Veterans of America, told Rachel Maddow. \"This is beyond partisanship. This is about honor. This is about integrity. It's completely out of bounds.\" Reickhoff added a belief that the issue would affect Trump at the polls. \"There are 22 million veterans in America,\" he said. \"Our members are extremely diverse. A lot of them are independents, but they vote at over 90 percent. They're very influential in their communities.\" A few months later, veterans would vote for Trump by a two-to-one margin. Since becoming president, Trump has continued to make empty, ostentatious shows of support for the armed services. He regularly accuses NFL players of disrespecting the military as they protest police brutality during the national anthem. He ordered the Pentagon to plan an over-the-top military parade in Washington D.C., one that he ultimately canceled as costs ballooned. He has been known to literally hug the flag. At the same time, the Trump administration is working to prevent transgender Americans from serving their country. On Memorial Day he used dead soldiers as a means to tout his own accomplishments. ProPublica reported earlier this month that three members of Trump's Mar-a-Lago club--a Marvel executive, a Palm Beach doctor and a lawyer--were essentially running the Department of Veteran Affairs despite having no relevant experience. A few days later, the administration announced its plan to stop checking for violations of the Military Lending Act, making it easier for financial predators to take advantage of service members and their families. The list goes on. This is the most inappropriate #MemorialDay comment that a @ POTUS has ever made. Self-promotion on a day to remember the fallen, and wishing those remembering their deceased loved ones a \"happy\" holiday is appalling. #CadetBoneSpurs pic.twitter.com/kRse4dnwiu--VoteVets (@ votevets) May 28, 2018 Veterans have long been used as political props, but never before has a politician failed to uphold so many baseline standards for decency toward those who have served. It hasn't seemed to matter, though. The Veterans of Foreign Wars, which vociferously condemned Trump's attacks on the Khan family, recently hosted the president in Missouri. The welcome was warm and, as expected, Trump mostly used the occasion to complain to the thousands of veterans assembled in front of him about how unfairly he has been treated by the media. He might as well have been talking to his supporters at one of his campaign-style rallies. Trump doesn't respect or care about veterans in any meaningful sense, and, as is the case with Trump's obstruction of justice and his campaign's collusion with Russia, the evidence is hiding in plain sight. His behavior is just so abhorrent that it's easier to find twisted ways to rationalize it rather than confronting the president's moral vapidity directly. \"Everyone keeps talking about this as breaking a taboo, crossing a line and doing something unprecedented,\" Maddow said while speaking with Reickhoff in 2016. \"Because of that we don't actually know what the response is. There's nothing like this in history to say this is the appropriate response or this is the equivalent political fate that befell somebody else who did this.\" The same is true two years later, and while the nation remains paralyzed in bewilderment, Trump continues to be president. His response to McCain's death won't be the last time he disrespects the military in service of a mind-numbingly petty grudge or the enrichment of the ruling class. Whenever that next time comes, America will once again be outraged. Now, however, it knows better than to think it will affect Trump at the polls."}, {"articleID": "2018040620_00068090_W", "names": {"Joe Greene": ["Q505256", "Q6210111", "Q982412"], "Franco Harris": ["Q1333547", "Q5868373"], "John Madden": ["Q1345694", "Q51516", "Q6246350", "Q945652"]}, "date": "2018-04-06", "url": "https://247sports.com/Bolt/WATCH-Pittsburgh-Steelers-Joe-Greenes-crazy-play-during-1974-season-117084762", "content": "WATCH: <mark>Joe Greene</mark>'s crazy play during 1974 season <mark>Joe Greene</mark> knew exactly what the Steelers needed during a 1974 matchup against the Cleveland Browns. Slot to 247Sports Links <mark>Joe Greene</mark> new exactly what the Pittsburgh Steelers needed during a 1974 matchup against the Cleveland Browns: points. Pittsburgh's offense was downright struggling against Cleveland, with starting quarterback Terry Hanratty throwing more interceptions (three) than completions (two) against the Browns' defense. With the Steelers' offense struggling, <mark>Greene</mark> made sure to make the most of his opportunity when Cleveland quarterback Brian Sipe fumbled while trying to pitch the ball to running back Billy Lefear. Instead of simply pouncing on the loose pigskin, <mark>Greene</mark> scooped up the ball and lateraled it to Pittsburgh cornerback J.T. Thomas. Thomas caught <mark>Greene</mark>'s toss and scampered into the end zone to give the Steelers a 23-16 fourth quarter lead. Pittsburgh would tack on a field goal to defeat the Browns, 26-16. When <mark>Joe Greene</mark> pitches you the??, you make sure to take it to the??. #tbt pic.twitter.com/9kgpwxFVft--Pittsburgh Steelers (@ steelers) April 5, 2018 The victory helped jumpstart a 4-1 finish to the regular season for the Steelers, who ended the 1974 regular season with a 10-3-1 record en route to winning the AFC Central division for the second time in three years. Pittsburgh would then dismantle O.J. Simpson and the Buffalo Bills in the first round to set up a matchup with the rival Raiders in the AFC Championship Game in Oakland. Pittsburgh had shocked Oakland two years earlier following <mark>Franco Harris</mark>' \"Immaculate Reception\" in the '72 divisional round, giving the Steelers their first-ever playoff victory. The Raiders got even by defeating the Steelers in the same round in the 1973 playoffs. While the Steelers were already itching at the chance to face the Raiders with a trip to the Super Bowl on the line, Oakland coach <mark>John Madden</mark> added some added incentive when he called his Raiders and the Miami Dolphins--the two time defending Super Bowl champions and the team Oakland defeated to get to the AFC title game--the two best teams in football. <mark>Madden</mark>'s comment did not sit well with Pittsburgh coach Chuck Noll, who delivered a rare inspirational speech to his team before heading to Oakland to face the Raiders. \"People out in Oakland think that the two best teams in football played yesterday,\" <mark>Greene</mark> said while recalling Noll's speech in his book,. \"But you know what? The Super Bowl will be played in two weeks and the best team in football is sitting right here in his room.\" \"<mark>Joe Greene</mark>: Built By Football\" <mark>Greene</mark> said Noll's words changed the complexion of the Pittsburgh Steelers for good. \"When he said that,\" <mark>Greene</mark> wrote, \"the case was closed. I knew we were going to win. I believed him and he was right.\" Noll was right, as his super charged Steelers defeated the Raiders 24-13. They then defeated the Minnesota Vikings in Super Bowl IX, as <mark>Greene</mark>, Noll and the rest of the Steelers were on their way to becoming the team of the decade by winning four Super Bowls in a six-year span. Author"}, {"articleID": "2013093011_00030750_W", "names": {"J. Cole": ["Q204018", "Q56604513", "Q6105158"], "Jimmy Kimmel": ["Q20793563", "Q4914"], "Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Rick Ross": ["Q297831", "Q431969", "Q606032"]}, "date": "2013-09-30", "url": "http://www.sohh.com/2013/09/photo_of_the_day_j_cole_kills_it_on_the.html?utm_source=google&utm_medium=feed&utm_campaign=general-feed", "content": "<mark>J. Cole</mark> Says Mission Accomplished: \"I Wanted To Come & Strike A Nerve\" <mark>J. Cole</mark> Receives Some TLC After \"Crooked Smile\" Music Video No-Show <mark>J. Cole</mark> Isn't Sweating The Haters: \"I Don't Care About The Chattering\" <mark>J. Cole</mark> controls the stage during his What Dreams May Come tour at Hard Rock Universal Studios. Photo credit: Donovan Brooks Photography Kanye West Makes Head-Scratching Decision Following <mark>Jimmy Kimmel</mark> Dispute After Nickname Jerseys Proposal, NBA Wants Another Game-Changing Move Danny's Long-Awaited \"Old\" Album Leaks In Entirety, <mark>Brown</mark> Addresses Unofficial Release New York: A Love Story - \"I Called On Guys That Watched Me Grow Up Like Raekwon & Method Man\" My Name Is Curtis Snow & I'm A G - \"[Learn] The Countless Times Curt's Outsmarted Police & Escaped Their Clutches\" Rubber Souls - \"It Ain't Miley Cyrus, But Your Family'll Dig It\" GTA V Put On Blast Over Horrific In-Game Play, Group Demands Immediate Boycott <mark>Chris Brown</mark> & Drake Finally Kiss & Make Up, Spotted Hugging & Drinking Together Rockstar Isn't Sweating Over GTA V Boycott Demand: \"It's A Fake World\" Birdman Reacts To Drake's Alleged Kendrick Lamar Diss: \"He Really Slick\" Gucci Mane Apologizes To Baby, Drake & <mark>Rick Ross</mark>: \"I'm Currently Incarcerated But I Will Be Going To Rehab B/C I Need Help\" After Kanye West's Los Angeles Paps Clash, KimYe Spotted Overseas M.I.A. Keeps Her Middle Finger Up, Fights Back NFL W / Dicey Clip [Video]"}]