[{"date": "2013-06-05", "url": "http://www.birminghammail.co.uk/sport/football/football-news/aston-villa-special-feature-look-4051836", "content": "A lot of people believe that when a player is linked to a club this way that it is reality and a cert to happen when nothing could be further from the truth. \"City turns back the clock at Birmingham Museum and Art Gallery Echoes exhibition at Birmingham Museum and Art Gallery celebrates the city's diverse recent history. In an age where the economy is leaving most of us with little cash to splash, it's only right to expect to get value for money .\" Fionnuala Bourke on J-Lo's saucy outfit and candles that smell of bacon! Jobs Search for jobs in the Midlands Motors Find new & used cars for sale Property Buying, Selling or Renting? Directory Search our local business directory Family Notices View latest announcements online Mail Cashback Earn cashback on your everyday shopping Dating Looking for a date in Birmingham? BuySell Buy or sell 1000s of new and used items Birmingham Mail The best of the Birmingham Mail in your Facebook feed @ birminghammail The latest Birmingham news, sport, weather and events @ BCFC_News The Birmingham Mail provides the best online coverage of Birmingham City FC @ AVFC_News Aston Villa FC news updated around the clock from the Birmingham Mail @ bhamcommunities Localised community news from your area News A daily bulletin of the best Midlands news Comments Special feature: A closer look at Ian Culverhouse effect \"My assistant boss Ian Culverhouse has a real eye for a player. If he reckons we should go for someone I will back his judgement 100 per cent .\" As <mark>Paul Lambert</mark> plots the next phase of Villa's recruitment he can rely on a talent-spotter who puts <mark>Simon Cowell</mark> and Co to shame. <mark>Lambert</mark> uses Culverhouse as a sounding board for all transfer transactions and the right-hand man has an impressive track record for identifying potential signings, too. During their seven-year association at Wycombe, Colchester, Norwich and now Villa, Culverhouse has alerted <mark>Lambert</mark> to a host of promising players, who the Scottish boss has subsequently signed. <mark>Ashley Westwood</mark> is one such example, with Culverhouse spotting very early the ability the former Crewe midfielder is now showcasing on the Premier League stage. \"I remember Ian saying a few years back\" there's a lad at Crewe you should keep your eye on'. <mark>Ashley</mark> has been fantastic for us. \"It is not just player recruitment where <mark>Lambert</mark> trusts Culverhouse implicitly - their entire football philosophy has been in sync since teaming up at Wycombe in 2006. Culverhouse was a youth coach at Adams Park then, having made more moves during his fledgling coaching career than the loyal Norwich stalwart did during his playing days. Regarded as a Canaries legend for his part in their early 1990s heyday, the full-back-turned-sweeper spent almost a decade there, helping them challenge towards the top of the top-flight table and embark on a UEFA Cup adventure, including a famous victory over Bayern Munich. The former Tottenham trainee left to join Swindon in 1994, spent four years at the County Ground and then went to Brighton, where he hung up his playing boots in 2000. Seagulls boss <mark>Jeff Wood</mark> gave him his first taste of coaching with a backroom role and Culverhouse later returned the favour by recruiting him as Norwich's goalkeeping coach. After leaving Brighton, Culverhouse coached at Barnet and Leyton Orient, progressing to assistant manager under John Still and Martin Ling .\" Ian was an excellent coach but things broke down on a personal front between us, \"explained Ling, who replaced Culverhouse with <mark>Dean Smith</mark> - now Walsall manager - in August 2005. Culverhouse was snapped up by Wycome boss <mark>John Gorman</mark>, initially in a youth team capacity and continued in that post when <mark>Lambert</mark> took charge of the Chairboys in August 2006. Soon Culverhouse found a kindred spirit in <mark>Lambert</mark>, who elevated him to a first-team role. The pair have never looked back since. Through Culverhouse's experiences at Norwich and <mark>Lambert</mark>'s at Borussia Dortmund, the duo developed a philosophy based around a strong team ethic and giving unknown players a chance to shine. <mark>Lambert</mark> took Culverhouse to Colchester as his assistant in October 2008 and again to Norwich less than a year later. They inspired a rapid rise from League One lowliness to Premier League mid-table comfort. Culverhouse is trusted to take the lead in the Bodymoor Heath training sessions. Their rapport allows <mark>Lambert</mark> to get his ideas across to the squad, but still maintain a distance - an approach he picked up from managerial mentor and former Villa boss <mark>Martin O'Neill</mark>.\" One of the things the gaffer told me was \"don't let them hear your voice all the time every day because you'll want them to hear it and listen to it on Saturday\" ', said <mark>Lambert</mark> \"So at training Ian does the sessions and I walk around and tell the players if I don't think the standard is what it should be .\" Villa know all about assistant managers going out on their own as bosses from their European Cup triumph under <mark>Tony Barton</mark> in 1982 But while Culverhouse's brother David has dabbled with non-league management, the former right-back has previously spoken of his satisfaction at staying as a No. 2 for now. \"I'm quite happy with what I'm doing. I suppose it's something you'd like to do, to test yourself as No. 1 .\" said Culverhouse. \"But the freedom I get now is good enough for me. <mark>Paul</mark> and I have had a successful relationship, so it's not something I'm thinking about at the moment .\" Their close bond was evident when <mark>Lambert</mark> jumped on Culverhouse with a jubilant piggy-back celebration during the win over QPR, and the manager had no qualms about putting his No. 2 in charge when he served a touchline ban against Arsenal. So as Villa embark on another busy summer it is no surprise to learn <mark>Lambert</mark> once described Culverhouse as one of the best signings he has ever made. \"With the quality of the coaching, Ian has been equally as important as anybody who has ever played under me,\" beamed <mark>Lambert</mark>. \"I'm grateful to have such a good assistant. <mark>Lambert</mark> was pleased a dramatic upturn in form and fortunes guided Villa to Premier League safety during a testing first campaign at the club. Special feature: Twenty years ago Villa went to United with the same ambitions Darts Diary with Alan Towe: Sheldon chief Alan has a Jubilee celebration Patients suffer 12-hour A & E wait as three NHS trusts running Birmingham hospitals miss targets Contact us Got a story in your area? Is there something happening in your area you would like us to report on? 0121? 234? 5536 / 5564 Postal Address BPM Media (Midlands) Floor 6, Fort Dunlop, Fort Parkway, Contacts Newsdesk 0121? 234? 5536 / 5564 Head of Web: Anna Jeys 0121? 234? 5280 Photosales: Patricia O'Gorman 0121? 234? 5450 Competitions and promotions: 0121? 234? 5707 Organised a special event? Tell us about it and, if possible, send us a picture Postal Address BPM Media (Midlands) Floor 6, Fort Dunlop, Fort Parkway, Birmingham, B24 9FF Advertise with the Birmingham Mail We reach over 784,967 * unique users a month with dedicated coverage of Birmingham and the West Midlands. Over 66% of our visitors, who view over 4m * page impressions every month, are in the desirable ABC1 socio-economic groups. To book an advert with the Birmingham Mail team call 0121? 234? 5000, email Trinity Mirror Midlands, offering you unique access to our audience across the region online and in print. * Source: Omniture (UK 6 month average Jan-Jun 12) / Survey Interactive 09 Editor, Birmingham Mail Editor-in-Chief, Trinity Mirror Midlands A born and bred Brummie, David was appointed editor of the Birmingham Mail in November 2009. He has over 30 years experience as a journalist in the West Midlands including editorships on the Coventry Telegraph and Sunday Mercury. Chris Lepkowski West Bromwich Albion reporter", "articleID": "2013060516_00081766_W", "names": {"Simon Cowell": ["Q162629", "Q7518530"], "Tony Barton": ["Q30122079", "Q666255"]}}, {"date": "2013-06-06", "url": "http://blog.chron.com/ultimaterockets/2013/06/james-parker-to-pit-enhanced-skills-since-07-nba-finals-meeting/", "content": "James, <mark>Parker</mark> to pit enhanced skills since '07 NBA Finals meeting LeBron James will get his chance at revenge on the Spurs after they knocked his Cavaliers out of the Finals in 2007. (AP Photo/Tony Dejak) By <mark>Jeff McDonald</mark> MIAMI - They met in a hallway in the catacombs of Cleveland's Quicken Loans Arena in the champagne-soaked moments following an NBA Finals sweep. San Antonio's <mark>Tim Duncan</mark>, mere minutes into life as a four-time champion, embraced LeBron James, thanked the 22-year-old Cavaliers star for allowing him at least one more title, and then made the surest prediction ever. \"The league is going to be yours soon,\" <mark>Duncan</mark> told James. Six years later, that vision has come to fruition. James is in Miami now. He has a better supporting cast than in Cleveland, not to mention four NBA Most Valuable Player awards. He is on the cusp of a third consecutive appearance in the Finals since joining the Heat in 2010, seeking a legacy-building second straight championship. \"Knowing the player that he was then and the trajectory he was on, I had no doubt he would be back here,\" <mark>Duncan</mark> said Wednesday. \"Driving their success' There was another young star on the rise in Cleveland that night, and you didn't have to look hard to spot him. He was the guy in the Spurs' locker room, cradling and kissing his Finals MVP trophy like a newborn baby. <mark>Tony Parker</mark> was 25 then, a two-time All-Star, and nowhere near the player he would become. As James again takes the NBA Finals stage, he will find a familiar face - but a different player - standing in his way. Having supplanted <mark>Duncan</mark> as the team's centerpiece, the 31-year-old <mark>Parker</mark> has emerged as the propelling force behind the Spurs' bid to reclaim a championship after a six-year dry spell .\" He was the best player in the Western Conference playoffs each game, \"Miami coach Erik Spoelstra said of the Spurs' All-Star point guard .\" He was driving their success. \"Like James, <mark>Parker</mark> used failure as fuel for self-improvement. Unlike his Miami counterpart, <mark>Parker</mark> didn't have to change addresses to do it. An Olympic challenge After being outplayed by Memphis' Mike Conley in a first-round flameout in 2011, <mark>Parker</mark> returned to France to lead his national team to an Olympic berth. It was in that Olympic qualifying tournament that today's incarnation of <mark>Parker</mark> was born. When <mark>Parker</mark> returned stateside, Popovich challenged him to apply the same fire and leadership to his day job .\" I took it as a challenge to improve my game and get better every year, \"said <mark>Parker</mark>, who is averaging postseason career highs in points (23) and assists (7.2) per game .\" As the responsibility and the ball came into my hands, I try to do more and try to deliver. \"G1: at Miami8 today G2: at Miami 7 Sun. G3: at San Antonio 8 Tue.. G4: at San Antonio 8 June 13 James, <mark>Parker</mark> to pit enhanced skills since '07 NBA Finals meeting", "articleID": "2013060610_00025194_W", "names": {"Jeff Mcdonald": ["Q21458890", "Q6174469"], "Tim Duncan": ["Q193020", "Q7803451"], "Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"]}}, {"date": "2013-06-11", "url": "http://inforum.com/event/article/id/402710/group/homepage/", "content": "E-mail Published June 10, 2013, 10:38 PM Yellowjackets have sights set on a chance to play at Target Field Perham baseball players celebrate after the Yellowjackets won the Minnesota Class 2A, Section 8 baseball tournament. <mark>Robert Williams</mark> / Forum News Service PERHAM, Minn. - Eric Brauch's father doesn't have any interest in watching the Twins play at Target Field, but if his son can make it to the Minnesota Class 2A state baseball championship game, he'll be the first in line to buy tickets. Brauch's stellar season at the plate and on the mound has led Perham to its first state tournament in nine years. Its last appearance was in 2004, when the Yellowjackets took third place. \"I was talking to my dad and he has never been to Target Field,\" Brauch said. \"He was just saying how cool it would be (for me) to get there and play. It would be crazy .\" Over the course of the season, Brauch has pitched 37 innings and given up 22 hits. He leads the team in strikeouts with 51, and has a 4-1 record. He also has a team-high 19 RBIs and has two of the team's four home runs. Catcher Cameron Mulcahy is second in RBIs with 14, but leads the team with 30 hits. Brauch is just one of three potential threats the Yellowjackets have on the mound. Mulcahy and Austin Erickson each hold 4-0 records and Josh Still is undefeated with one win. Erickson is second on the team in strikeouts with 34 and has one save. A struggling offense early on paved the way to an 11-5 regular-season record. But as the playoffs drew closer, the Yellowjackets found out their best was yet to come. \"If I had anything to complain about during the regular season, it is the lack of competitiveness and our lack of having fun,\" Perham head coach Hans Hanson said. \"We didn't see a whole lot of consistency, but we hit the playoffs playing our best baseball of the season .\" The only thing that we couldn't really do was pick up our bats. But ever since the playoffs, we've been hitting the ball really well. Hopefully we can continue it into the state tournament. \"The Yellowjackets won the Class 2A, Section 8 tourney with a 5-2 win over Roseau and finished fourth in the conference after a three-way tie for first. Perham will face Delano in the first round of the state tournament Thursday at 5:30 p.m. and from that moment on, Target Field will be fixated on Brauch's mind .\" We have our whole community rooting for us, so if we ended up getting to that final game, and ending up on top, I'd be speechless, \"Brauch said .\" There's nothing more I want to do my senior year than win this state title. \"UPDATE: Police say NDSU's Beck left man unconscious following fight outside Sports Bar UPDATE: Police say NDSU's Beck left man unconscious following fight outside Sports Bar Ex-Fargo investment broker Medhus pleads guilty to 16 felony charges in\" Ponzi' scheme", "articleID": "2013061111_00047936_W", "names": {"Robert Williams": ["Q1193089", "Q17249329", "Q18917399", "Q1897911", "Q19595690", "Q21062888", "Q21165673", "Q2159205", "Q22019626", "Q24191102", "Q28151848", "Q33699032", "Q3436573", "Q42638026", "Q4470093", "Q45374718", "Q50391378", "Q55363277", "Q7341311", "Q7341617", "Q7345132", "Q7345678", "Q7349522", "Q7350633", "Q7351124", "Q7351126", "Q7351127", "Q7351130", "Q7351131", "Q7352629", "Q888323"]}}, {"date": "2013-06-11", "url": "http://www.ottawasun.com/2013/06/11/cops-called-after-fan-gets-too-close-to-brad-pitt", "content": "Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall U.S. actress Angelina Jolie is seen upon arrival for the world premiere of her husband <mark>Brad Pitt</mark>'s film \"World War Z\" in London June 2, 2013, and the Spanish premiere of the movie \"The Tourist\" in Madrid December 16, 2010, in this combination picture made June 2, 2013. Sunday marks Jolie's first public appearance after announcing she underwent a double mastectomy in February 2013. REUTERS/Neil Hall/Juan Medina/Files <mark>Brad Pitt</mark> arrives for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. REUTERS/Neil Hall <mark>Brad Pitt</mark> and Angelina Jolie arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com <mark>Brad Pitt</mark> kisses Angelina Jolie at the World premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. WENN.com Kimberly Wyatt arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Natasha Bedingfield arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie and <mark>Brad Pitt</mark> arrives for the world premiere of World War Z in London June 2, 2013. Lia Toby/WENN. com Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Muse's Matthew Bellamy, Dominic Howard, Chris Wolstenholme at the World premiere of World War Z in London June 2, 2013. WENN.com Angelina Jolie poses with her husband <mark>Brad Pitt</mark> as they arrive for the world premiere of his film World War Z in London June 2, 2013. REUTERS/Neil Hall Angelina Jolie arrives for the world premiere of her husband <mark>Brad Pitt</mark>'s film World War Z in London June 2, 2013. REUTERS/Neil Hall Police were called to <mark>Brad Pitt</mark>'s hotel in Sydney, Australia on Monday after an overzealous fan attempted to get too close to the actor and his son. The Hollywood superstar was leaving the city's InterContinental Hotel with his adopted son Pax, nine, on their way to a cruise around Sydney Harbour when they were approached by a man in the building's underground car park. The fan - identified as <mark>Michael Joseph</mark> - was tackled by <mark>Pitt</mark>'s bodyguards and police were called to the scene. Officers issued <mark>Joseph</mark> with a warning and ordered him to move on. A police spokeswoman tells the Sydney Daily Telegraph, \"It was ascertained that, although being an enclosed public space, the car park was controlled land under the control of the hotel. The man was issued with a move-on order following the incident .\" <mark>Pitt</mark>, who visited Australia to promote his new movie World War Z, went on to enjoy a day out on a yacht with his son, and they flew out of the country on Monday night. Subscribe now! Ottawa Sun SUN + account includes: In-depth Local News Insider Sports Live Edgy Columnists", "articleID": "2013061123_00043810_W", "names": {"Brad Pitt": ["Q35332", "Q373912"], "Michael Joseph": ["Q17124758", "Q21458869", "Q39073364"]}}, {"date": "2013-06-12", "url": "http://www.ledger-enquirer.com/2013/06/11/2540957/richard-hyatt-commentary-a-front.html#storylink=rss", "content": "Richard Hyatt: An eventful year for the Muscogee County school board When Forrest Gump nervously peered over the shoulder of a fellow in a federally issued suit standing next to the feisty rooster that was <mark>George Wallace</mark>, Mike Raiford had seen enough. \"I was there,\" he exclaimed. His wife told him to be quiet, that everybody in the movie theater could hear him, but Raiford had to tell someone. \"No, I was there .\" On a day that his home state commemorated the 50th anniversary of <mark>Wallace</mark>'s defiant charade in the schoolhouse door, Raiford talked about a 17-year-old freshman from Phenix City that, on his first day at the University of Alabama, had a front-row seat to history. It was a great movie, but Forrest Gump wasn't really there. And there's no record of him toting a football for Bear Bryant either. Winston Groom, his creator, was on campus though, and so was Raiford. Ink was still wet on his Central High diploma when Raiford's family drove him to Tuscaloosa. He had never been away from home alone when they left him at his dormitory on June 7, 1963. That weekend, Raiford and some buddies went to town for a movie, and when they got back, the campus was sealed off, teeming with state troopers, conservation officers, policemen from all over the state and members of the Alabama National Guard. There were as many news people as there were lawmen. \"Word was out there was going to be trouble,\" he says. \"I thought to myself,\" this college life was going to be exciting .' \"Everybody knew <mark>George Wallace</mark> was taking a stand against integration on Tuesday. The governor didn't care what the White House said. Black students weren't registering at his alma mater. The doorway to Foster Auditorium would be his stage. What transpired was nothing but political theater .\" \"Little <mark>George</mark>' took up his position to stand against the federal government--at least that's what they told us. Standing all around were serious-looking men wearing dark suits in the Alabama heat.... I had never seen as many people carrying guns in my life.... It was over quickly. The guard marched in, and the governor left in his limo with the crowd cheering him on. I was caught up in the moment .\" As his car crept past Raiford and his friends, <mark>Wallace</mark> waved and they waved back. \"He gave us the victory sign. I may have given him one back,\" he said. Ceremonies Tuesday marked those events. Articles have tried to put that landmark day in perspective, claiming it led to the creation of a different Alabama. In an era of violence, no guns were fired and no blood was shed. Such things went over Raiford's head in 1963: \"We went back to the dorm and found a game of pool .\" <mark>Wallace</mark> went on to run for president three times, and at one campaign stop, he was seriously wounded, relegating him to a wheelchair for the last 26 years of his life. Raiford graduated from Alabama in 1967 and never had a black classmate. He served in the Air Force, finished law school and came home to practice law. That spectacle 50 years ago is only a memory. \"It was like a non-event after it happened,\" he said. \"We went back to the dorm and never talked about what we had seen. I didn't know how important it was until later .\" Raiford doesn't call it a watershed event in his own maturity or his view of other races. \"Something inside of me had always told me those things were wrong, but what could I do? You don't get above your raisin',\" he said .--Richard Hyatt is an independent correspondent. Reach him at www.twitter.com/hyattrichard .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013061210_00050350_W", "names": {"George Wallace": ["Q3101983", "Q43913855", "Q48817450", "Q5545830", "Q5545832", "Q5545834"]}}, {"date": "2013-06-12", "url": "http://www.timesfreepress.com/news/2013/jun/12/stephen-king-john-mellencamp-break-rules-ghost-bro/", "content": "<mark>Stephen King</mark>, T Bone Burnett and John Mellencamp, from left, collaborated on the musical \"Ghost Brothers of Darkland County .\" <mark>Stephen King</mark> and John Mellencamp had a simple problem when they started the long odyssey to create a musical. \"Quite frankly, we didn't know what the hell we were doing,\" Mellencamp says. Thirteen years later they've created \"Ghost Brothers of Darkland County,\" a musical that's not quite like anything out there - as you might expect from two of America's most independent artists. Along the way, the author and the singer picked up producer T Bone Burnett to serve as a general contractor, enlisted stars like Sheryl Crow, Elvis Costello, Kris Kristofferson and Rosanne Cash, and broke several rules in the classic musical theater handbook. <mark>King</mark> says he might have given up long ago had Mellencamp not kept rolling things forward. Mellencamp says that's a bunch of bull. Now that they're done - \"Ghost Brothers\" now out with a CD box set, mini-documentary and e-book, with a theatrical tour starting in October in Bloomington, Ind. - they say the project strengthened their friendship and left them with a tremendous sense of accomplishment. \"This morning when I went over to my office there was a big stack of the box sets and I looked at that thing and said,\" We actually have a product here,' \"<mark>King</mark> says .\" It's all been give up to this point. You give of your talent and you give of your time, and then you get something back. It's here and people are either going to play these tunes or not, buy and download or not, go to see the show when it comes to a town near them or not. \"The musical started with a real-life ghost story. Mellencamp was looking for a cabin on Lake Monroe in his home state of Indiana. As the owners handed over the keys, they casually let it drop that the cabin might be haunted, the spiritual remnants of a terrible tragedy that had happened decades earlier when two brothers quarreled over a girl. The story came with a stack of ancient pulp magazines that detailed the deaths in grisly detail, complete with photos of a headless body and plenty of purple prose. Mellencamp scoffed, had the cabin remodeled and took his family to the lake for a long visit. They noticed the\" weird vibe \"immediately .\" I don't believe in this stuff, \"Mellencamp says,\" but stuff would start moving. You'd start smelling cigars. Funny smells would appear and stuff would turn on and turn off. It was kinda creepy, you know? \"Mellencamp unloaded the cabin and eventually relayed the story to his agent sometime before the turn of the century. He'd recently been approached about doing a musical based on his hits, but he wasn't interested. The agent suggested the ghost story could serve as the basis for that musical, and suggested they contact mutual client <mark>King</mark> to help write it. <mark>King</mark> and Mellencamp had met a few times over the years, and to Mellencamp's surprise the idea quickly took root. It was just the kind of challenge <mark>King</mark> likes .\" Once you get to a certain age - I'm in my 60s now - you've got to try to keep expanding your field, \"<mark>King</mark> says .\" You've got to try new things and if you don't, you tend to get conservative. I always say you dig yourself a rut and then you furnish it. \"John asked me when we started this if I'd ever done anything like this before. I says,\" John, yes, I have. I wrote a play for my Boy Scout troop when I was 11 years old. And it was a big hit with my relatives .' \"They traveled to New York together where they took in several musicals on Broadway. And almost nothing appealed to them .\" It was like, how does this work? \"Mellencamp says .\" What we saw on these musicals, at least to me, was a bunch of s--we didn't want to do. OK, we don't want any dancing, that's the first thing. We just don't. We don't want this, we don't want that. We don't want to advance the story forward with song, it's too corny. \"They decided they'd use their songs to color their characters. The spoken-word sections of the musical would drive the story, just as they do in a play .\" I just feasted on that because I'm a big rock music fan and country music fan and alt-rock fan and all that stuff, and I thought, that's what music does, \"<mark>King</mark> says .\" Music speaks to the heart and words speak to the brain, and we can really do something here. We saw eye to eye on a lot of things and one was we didn't really want this big orchestral, violin-heavy music. We wanted a kind of American soundtrack. \"<mark>King</mark> roughed out the story about two generations of brothers in fictional Lake Belle Reve, Miss., caught in a tragic tape loop and marked out spaces for songs, sometimes including a little rhyme to give Mellencamp cues. Mellencamp then worked up songs from several perspectives. That's where Burnett, the only producer Mellencamp's ever had, enters the picture about five years ago. Mellencamp played him the songs and, always up for a challenge, Burnett signed on .\" It's a very interesting group of tunes he's put together and I do believe some of his best songs, \"Burnett says .\" Time will be the judge of that but it seems so to me. They're real powerful tunes, and real stripped down, of-the-earth type tunes ....John and <mark>Stephen</mark> work a lot of the same turf, the legends of small-town America, that stuff. So I can see the resonance between the two of them pretty clearly. \"Burnett brought in friends and colleagues to hang Spanish moss from tree limbs, add humidity to the air and bring the characters to life. Actors like Matthew McConaughey and Meg Ryan helped with the spoken-word parts. Crow sings from the perspective of the coveted woman at the center of the story. Kristofferson provides a moral compass. And Costello had a great time taking it fire and brimstone .\" I had to be the Devil in that story so I made some very extraordinary sounds, \"he says .\" I mean I was creaking. I sounded like my teeth were about to fall out. I thought the Devil, that can't be an ordinary voice. So I sang in harmonic shrieks and whispering and everything. \"The thing that Mellencamp loves about the final product is you can't pigeonhole it. All the principles will be replaced by other actors and musicians when the musical hits the road around the country later this year. The ultimate goal is to debut\" Ghost Brothers \"on Broadway, but producers have been leery of that unconventional structure. No matter. Ethics policy - Copyright? 2013, Chattanooga Publishing Company, Inc.. All rights reserved.", "articleID": "2013061211_00034921_W", "names": {"Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}}]