[{"articleID": "2017102502_00481548_W", "names": {"Pete Johnson": ["Q16730368", "Q18627300", "Q7172045", "Q7172046", "Q7172047"], "David Thompson": ["Q1176843", "Q14950372", "Q15378706", "Q16499854", "Q16830995", "Q18924157", "Q20710001", "Q28434580", "Q310082", "Q5236246", "Q5240375", "Q5240378", "Q5240379", "Q5240380", "Q5240381", "Q5240382", "Q5240383", "Q56192238", "Q58065993", "Q718669"]}, "date": "2017-10-25", "url": "http://dailyitem.com/news/local_news/state-prison-for-gregg-township-meth-lab-suspect/article_6c9ec59f-beca-50c6-91d3-a2bc206dcf23.html", "content": "State prison for Gregg Township meth lab suspect LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. More Headlines DANVILLE--The 22nd Annual Danville Area Community Center 5K Race and Community Walk will be held Nov. 4. More Headlines My Turn: The right question on gun safety In an interview with experts on gun safety, a news show host recently posed the question \"What law could have prevented the event at Las Vegas?\" I have often heard the same question, stated over and over in pretty much the same fashion by representatives of the NRA and its supporters in Congress. More Headlines State prison for Gregg Township meth lab suspect The Daily Item 29 min ago LEWISBURG--A Selinsgrove man avoided trial in three separate cases and was handed a state prison sentence by a Union County judge. According to District Attorney <mark>Pete Johnson</mark>, Chris Biddinger, 29, entered a guilty plea to operating a methamphetamine laboratory along with simple assault and possession of drug paraphernalia. His plea scuttled jury selection proceedings scheduled to have been held Monday. Judge Michael Sholley sentenced Biddinger to serve one to three years on the methamphetamine charge and serve consecutive one-year probation sentences upon release on the other two charges, <mark>Johnson</mark> said. Remaining criminal counts in the three separate cases were dismissed, <mark>Johnson</mark> said. Biddinger was among several defendants accused of manufacturing methamphetamine in a \"one-pot\" method of cooking on two separate occasions in Gregg Township in the summer of 2016. He was charged with a combined 30 counts. Biddinger also was charged with assault by prisoner and related counts for his role in allegedly injuring a fellow inmate inside the Union County jail in March. He was one of two charged in the alleged assault .--ERIC SCICCHITANO Police: Driver had marijuana DANVILLE--A Macombe, Mich., woman faces drug charges after being stopped by state police for traveling in the left lane of Interstate 80 and not passing or attempting to pass a vehicle Oct. 3. Tpr. Jared Mowen charged Alexandra M. Skiba, 20, with possessing a small amount of marijuana, possessing drug paraphernalia and restrictions on the use of limited access highways. Mowen detected a strong odor of marijuana coming from the vehicle and asked where the marijuana was. Skiba indicated she had it in one of her bags in the trunk, according to police. Police seized a white jar with about 20 grams of marijuana inside along with a gold grinder in Skiba's luggage in the trunk .--KAREN BLACKLEDGE Veterans breakfast Nov. 8 ELYSBURG--Veterans in Pennsylvania's 107th District are invited to attend a Veterans Appreciation Breakfast on Nov. 8, at the Elysburg Fire Company's social hall, 1 E. Mill St., Elysburg. Hosted by Pa.. House Rep. Kurt Masser, R-107, Elysburg, and his staff, the breakfast is a show of appreciation for veterans who put their lives on the line for our country's freedom. \"These men and women deserve to be thanked and appreciated every day, and this is our way to say thank you for all they've done,\" Masser said. Pre-registration is required for this event. Call Masser's district office at 570-648-8017 by Nov. 3. Information can also be found online at RepMasser.com. Kreamer bridge to be complete Nov. 20 KREAMER--The year-long bridge reconstruction along Route 522 in Kreamer is scheduled to be completed next month. <mark>David Thompson</mark>, community relations coordinator, PennDOT District 3-0, said construction on the Route 522 bridge in Kreamer, Middle Creek Township, Snyder County, is to be completed on Nov. 20, according to the project manager. The bridge work began in November 2016. Final paving will take place in spring 2018. The new bridge, according to <mark>Thompson</mark>, will be 12 feet wider than the existing bridge with a 12-foot driving lanes and 8-foot shoulders in each direction .--TABITHA GOODLING Continuance granted in identity theft case SELINSGROVE--A preliminary hearing has been continued for a Selinsgrove businessman accused of using his employee's identity without permission to obtain several credit cards and make more than $40,000 purchases. Nathan T. Fisher, 26, co-owner of Vivace Music Center was granted a continuance Tuesday by District Judge Lori R. Hackenberg, who is setting aside two hours for an upcoming hearing yet to be scheduled. Fisher is being held in Lancaster County jail on a detainer for violating conditions of probation. He was sentenced to five years of probation in 2013 for convictions on identity theft, theft by deception and bad checks and has convictions for similar crimes in other counties, including Union and Dauphin. In the latest case in Snyder County, he allegedly obtained credit cards with the identity of an employee that he used to make $40,447 in fraudulent purchases .--MARCIA MOORE Shamokin man hurt in motorcycle crash SHAMOKIN--A 28-year-old Shamokin man was injured Tuesday and had to be taken to Geisinger Medical Center, in Danville, after the motorcycle he was riding on Market Street was hit by a vehicle at the intersection of Market and Chestnut Street. Allen Cole was riding a 2011 Harley Davidson motorcycle north on Market Street when, at about 5:15 p.m., a 2003 Chevrolet Trailblazer driven by a 17-year-old male pulled into the path of the motorcycle, according to Shamokin Police Chief Darwin Tobias. Cole, who was wearing a helmet, was thrown from the cycle. The cycle also flew off the road and into a building at 1 Market Street causing property damage, Tobias said. A hospital nursing supervisor said Cole was listed in serious condition Tuesday night. Police are investigating the accident .--Rick Dandes Halloween celebrations Oct. 31 SUNBURY--Oct. 31 will be a busy night in the city as Halloween parties are shaping up to be a treat for all. Starting at 5 p.m. and running until 9 p.m. Cameron Park will play host to \"Light the Night,\" an event presented by the River of Life Assembly of God. The Halloween party will include food, games and bounce houses for children. Also, at Degenstein Community Library, there will be a \"Boo Bash\" event for children trick or treating. There will be vendors giving away candy. The event starts at 6 p.m. and ends at 9 p.m. Oct. 31 is also Sunbury's annual trick-or-treating night and there will be several police officers and firefighters spread out through the city to ensure safety for children out trick-or-treating."}, {"articleID": "2017102106_00051087_W", "names": {"Cristian Garcia": ["Q5186193", "Q5186194"]}, "date": "2017-10-21", "url": "http://registerguard.com/rg/sports/preps/36070696-79/head-goes-right-hereyy-hereyyyyy.html.csp#civil-comments", "content": "MONROE--There was nothing fancy about this performance. It was just good, old-fashioned, smashmouth football. Monroe dispatched Oakland 35-14 on Friday night behind a no-frills offensive game plan that churned out 263 rushing yards and battered the visiting Oakers into submission. In the process, the third-ranked Dragons locked up the Mountain View Conference title and potentially a high seed for the Class 2A state playoffs that begin in two weeks. \"I'm very pleased,\" said Monroe coach Bill Crowson, whose team wraps up the regular season next week with a nonleague game against Stanfield. \"I feel like Lost River and Oakland are both quality football teams. Their records may not be great, but they're going to both maybe be playoff teams and I feel like...the four wins over them is a good statement for us .\" Monroe (6-1, 4-0 MVC) made a different kind of statement Friday, dialing up some old-school playcalling that involved a lot of fullback dives and tailback counters. The result was nearly 5.5 yards per carry as a team and a healthy time of possession advantage that eventually wore out visiting Oakland (4-3, 0-3). The Dragons were led by sophomore running back Zach Young, who had 142 yards on 18 carries and scored two touchdowns--the first a 12-yard run late in the second quarter that gave Monroe a 20-7 halftime lead, and the second an 18-yard backbreaker with four minutes left that iced the game after Oakland had briefly sliced the margin to 27-14. Junior fullback Colton Sutton rushed for 42 yards and a pair of touchdowns, senior Parker Wynn had 34 yards and a score, and fellow senior Zack Esplin finished with 37 yards on the ground. Quarterback Kairen Garber attempted only eight passes, completing three of them for 39 yards. \"We're a little dinged up,\" Crowson explained. \"Nothing bad, but our personnel is a little different, so we knew all week that we were going to go back to fullbacks and just kind of grind a little bit. We haven't really done that this year, so it was something that we needed to work on and something we needed to do tonight .\" Monroe boasts one of the biggest offensive lines in the state at the 2A level, featuring 6-foot-4, 320-pound <mark>Cristian Garcia</mark> and 6-1, 280-pound Jorge Sanchez, among others. Going to a ground-and-pound strategy, Crowson said, was one way of maximizing the Dragons' size advantage against an active defensive front. \"They attack really well,\" Crowson said of Oakland's front four. \"They put a lot of pressure on you up front. I think that was a good challenge for our linemen .\" We were a little cute in the first half, but we needed to just settle in. We felt like we could run the football, we just weren't being real consistent. We made some adjustments and tried to get some schemes right, and I felt like we were more consistent (in the second half). \"Oakland was led by senior Andrew Harrington, who started the game at running back, then moved to quarterback after the first offensive series ended in a three-and-out. Harrington completed 9-of-24 pass attempts for 106 yards with two interceptions and ran for 36 yards and both of the Oakers' touchdowns. More Prep Football articles\" "}, {"articleID": "2018021013_00351907_W", "names": {"Marco Haller": ["Q1240107", "Q695085"]}, "date": "2018-02-10", "url": "https://timesofindia.indiatimes.com/sports/more-sports/cycling/elia-viviani-wins-final-stage-lifts-maiden-dubai-tour-title/articleshow/62863613.cms", "content": "Times of India Elia Viviani wins final stage, lifts maiden Dubai Tour title Elia Viviani wins final stage, lifts maiden Dubai Tour title | | Updated: Feb 10, 2018, 18:13 IST TIMESOFINDIA.COM Highlights Viviani needed at least a second place finish with good timing <mark>Marco Haller</mark> and Adam Blythe secured second and third position respectively This is Elia Viviani's third stage win of the season Elia Viviani. (TOI Photo) DUBAI: Elia Viviani of Quick Step Floors bagged his second stage win and emerged as the winner of the 2018 Dubai Tour. With about 50 meters to go for the finish line, Viviani made the most of a crash right when the peloton, moving at over 80 kmph, took a sharp turn and stranded the likes of Mark Cavendish and Marcel Kittel. Holding a two seconds advantage to be placed atop the overall classification, Viviani, gold medallist at the Rio Olympics, needed at least a second place finish with good timing but went one better to cross the line before <mark>Marco Haller</mark> and Adam Blythe, who secured the second and third positions. \"It's amazing. This morning I was very stressed but I tried to look relaxed. Two seconds lead meant all or nothing. But we rode well as a team,\" Viviani said after the win. \"The ideal situation for us was a breakaway without anyone involved in the top of the overall ranking. I had six teammates leading me out in the last corner. We missed the crash by very little. [Fabio] Sabatini closed the gap on the four guys ahead after the crash. With 50 meters to go I understood I could win the stage. With the headwind, it would have been dangerous to launch from too far out .\" To win GC here is an important step up. I want to be one of the best sprinters in the world. This is a good start towards this goal with the great team I have now. \"Having conquered Stage 7 of the Tour Down Under and the opening stage of the Dubai Tour on Tuesday, this is Viviani's third stage win of the season. Get latest news & live updates on the go on your pc with News App. Download The Times of India news app for your device. Read more Sports news in English and other languages. RELATED"}, {"articleID": "2019030813_00027537_W", "names": {"Scott Morrison": ["Q1286476", "Q21285393", "Q7436904", "Q7436906", "Q7436908"]}, "date": "2019-03-01", "url": "http://www.canindia.com/womens-empowerment-shouldnt-come-at-cost-to-men-australian-pm/", "content": "Author: CanIndia New Wire Service Views: 1 Canberra, March 8 (IANS) Australian Prime Minister <mark>Scott Morrison</mark> sparked outrage on the International Women's Day on Friday by saying that men should not have to make way for women's empowerment. \"We're not about setting Australians against each other, trying to push some down to lift others up. We want to see women rise. But we don't want to see women rise only on the basis of others doing worse,\" <mark>Morrison</mark> said at a function organized by Australia's Mining Industry, according to CNN. The Prime Minister, who has been criticized for the lack of female representation among his party's leadership, was slammed on social media for his comments. \"Men who are threatened or worried of women achieving equality is the bloody problem,\" tweeted Australian Senator Sarah Hanson-Young. ALSO READ: Iraq arbitrarily arresting, torturing child IS suspects: Report Independent MP Kerryn Phelps, who last year won a by-election seat given up by <mark>Morrison</mark>'s predecessor Malcolm Turnbull, gave the Prime Minister \"the emoji treatment\" , posting a single wide-eyed, shocked face in response to his comments. After the event, <mark>Morrison</mark> tweeted: \"Today is about appreciating all the women in our lives and our nation--celebrating their value and achievements .\" During his speech, <mark>Morrison</mark> told the Chamber of Minerals and Energy that a stronger Australian economy would improve job prospects for women. However, several resignations from female members of <mark>Morrison</mark>'s government led many to question his commitment to jobs for women within his ruling Liberal Party. Independent parliamentarian Julia Banks told a crowd at an event that <mark>Morrison</mark>'s leadership style was akin to \"Mad Men crossed with House of Cards\". She quit <mark>Morrison</mark>'s Liberal Party last November, citing a \"culture of gender bias, bullying and intimidation\". ALSO READ: 7 killed in Paris building fire Former Foreign Minister Julie Bishop will leave Parliament altogether at the next election, which is due before the end of May. The Prime Minister also addressed on Friday his party's efforts to remedy its \"bad-for-women\" reputation, saying: \"I have been doing a bit of advancement of women lately myself. There are now seven women in my Cabinet, which is the highest number of women ever in a Cabinet in Australia's history .\" <mark>Morrison</mark>'s online detractors pointed out that just 22 per cent of sitting Liberal Party members across Australia's two houses of Parliament were women .--IANS"}, {"articleID": "2017031704_00050764_W", "names": {"Lee Williams": ["Q1423984", "Q23041966", "Q6515522", "Q6515525", "Q6515526", "Q6515531"], "Elizabeth Smith": ["Q1331318", "Q28530491", "Q43391751", "Q43393828", "Q43394133", "Q43395523", "Q43395873", "Q43396043", "Q55761719", "Q56535801", "Q644208"]}, "date": "2017-03-16", "url": "http://playbill.com/article/acting-company-tour-arrives-in-nyc-march-17", "content": "Acting Company Tour Arrives in NYC March 17 | Playbill Mar 17, 2017 The company presents two plays in repertory, X: Or, Betty Shabazz v. The Nation and Julius Caesar. Jimonn Cole The Acting Company tour of X: Or, Betty Shabazz v. The Nation and William Shakespeare's, presented in repertory at nearly 30 universities, colleges, and community partners across the country, arrives in New York City March 17. Julius Caesar The Acting Company's 44th tour runs through March 26 at The New Victory Theater. Marcus Gardley's X: Or, Betty Shabazz v. The Nation concerns the assassination of Malcolm X. The cast comprises Jimonn Cole as Malcolm X, Jonathan-David as Louis X, William Sturdivant as Elijah Muhammad and Bootblack, Joshua David Robinson as Brother Eugene X and Doc, Gabriel Lawrence as Muhammad the First, Chelsea <mark>Lee Williams</mark> as Betty Shabazz, Kevis Hillocks as Wilbert X, and N’Jameh Camara as the Judge with ensemble members Austin Purnell and Tatiana Wechsler, all under the direction of Acting Company artistic director Ian Belknap. The creative team also includes Lee Savage (scenic design), Candice Donnelly (costume design), Mary Louise Geiger (lighting design), Justin Ellington (sound design/music composition), Byron Easley (choreography), <mark>Elizabeth Smith</mark> (voice, speech, and text consultant), and Orlando Pabotoy (fight direction). Gardley adapts the framework of Shakespeare's Julius Caesar for his play to \"deepen our understanding of one of America's most complex, compelling historical figures and explores the tumultuous landscape of ideology and activism in the 1960s,\" according to press notes. \"Through the story of Julius Caesar, a rising political star torn down by his most trusted allies, audiences witness the art of persuasion, the ugliness of backroom politics, and the historical patterns we can't stop repeating. Tackling essential questions about the balance of ambition, personal loyalty, and love of country, Shakespeare's timeless political masterpiece has never been more relevant .\" Gabriel Lawrence Devin Brain directs the Julius Caesar cast, which includes Gabriel Lawrence as Julius Caesar, William Sturdivant as Caius Cassius, Jimonn Cole as Marcus Brutus, Jonathan-David as Mark Antony, Joshua David Robinson as Casca and Titinius, N’jameh Camara as Calpurnia, Chelsea Williams as Portia, Kevin Hillocks as Octavius, Austin Purnell as Soothsayer, and Tatiana Wechsler as Trebonius. The creative team also features Lee Savage (scenic design), Jennifer Moeller (costume design), Mary Louise Geiger (lighting design), Nathan A. Roberts and Charles Coes (music and sound design), <mark>Elizabeth Smith</mark> (voice, speech, and text consultant), and Orlando Pabotoy (fight direction). The company is also joined on tour by Lindsey Turteltaub (production stage manager) and Geoffrey Boronda (assistant stage manager). For more information and ticketing visit www.theactingcompany.org."}, {"articleID": "2011041312_00014766_W", "names": {"Richard Hall": ["Q15842382", "Q28225127", "Q3098577", "Q42777272", "Q51587393", "Q6584457", "Q7326214", "Q7326216", "Q7326217", "Q7326219"]}, "date": "2011-04-13", "url": "http://packagingeurope.com/Packaging-Europe-News/40638/2011-Global-Dairy-Congress-shapes-up-in-St-Petersburg.html", "content": "styron announces plans to change company name to trinseo it's mile family open house event at the fabio perini premises in lucca record speed and production with tissueflex v3 and duocleaner express 2 new gas analysers by witt - quality control for modified atmosphere packaging flexicon demonstrates bulk handling efficiencies on stand g02 at sch? ttgut schweiz bericap releases next generation hysteresis capping head replacement filter elements with universal fitting feature iggesund moves to further reduce its fossil carbon emissions hct celebrate at the packaging design beauty awards 2011 berlin packaging completes integration with continental packaging actega rhenania at interpack 2011: innovative and customer focused designing a food microbiology laboratory - new guidance from campden bri 2011 global dairy congress shapes up in st. petersburg this year's global dairy congress will be held in st petersburg, russia, from 7 to 9 june 2011. its theme of healthy outlook aims to address three priorities of commercial success, good nutrition and sustainable business. leading regional companies wimm-bill-dann, unimilk and valio will open proceedings, followed by global perspectives from us dairy export council, rabobank and a keynote address from pepsico. there will be a session on sustainability with luxlait, elopak and unilever as well as a focus on key markets from zenith, dairy farmers of america and gujarat co-operative milk marketing federation. lait & milk, arla foods, danish agriculture & food council and the organic milk suppliers co-operative will look at communicating dairy values. speakers from dairy innovation magazine, meiji and nizo will present the latest in new product development. suppliers colormatrix and gualapack will talk about technical innovation. a panel session with experts from fcstone, rabobank, us dairy export council and zenith will discuss shifting trade patterns and the impact of price volatility on commodity markets. there will also be a workshop on global developments in fresh dairy products and cheese from zenith. as part of the congress programme, delegates will have the opportunity to visit the local production sites of piskaryovsky, unimilk, wimm-bill-dann and elopak's new state-of-the-art plant. the social highlight of the event will be a gala dinner at the belosselsky-belozersky palace in the city centre. \"we are delighted to be offering such a full line up of top global and regional companies as well as plant tours to three leading russian dairies,\" commented zenith chairman <mark>richard hall</mark>. \"the 5th global dairy congress will cover the latest developments in consumer trends, social responsibility, health, innovation and emerging growth opportunities, providing a comprehensive view of the global market in just three days .\" "}, {"articleID": "2019121116_00048406_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-12-11", "url": "http://uspolitics.einnews.com/article/504568984/Yd-02WSQ1-bpGm1J", "content": "https: //www.greenwichtime.com/news/article/Warren-s-new-ocean-plan-includes-Western-drought-14896771.php Warren pushes back against more moderate path to White House Scott Sonner, Associated Press Updated 1:09 am EST, Wednesday, December 11, 2019 Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno, Nev.. She said her party will lose the 2020 presidential election if it settles for a \"business as usual\" agenda that \"only nibbles around the edges .\" (Andy Barron/The Reno Gazette-Journal via AP) less Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno,...more Photo: Andy Barron, AP Photo: Andy Barron, AP Image 1 of / 7 Caption Close Image 1 of 7 Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno, Nev.. She said her party will lose the 2020 presidential election if it settles for a \"business as usual\" agenda that \"only nibbles around the edges .\" (Andy Barron/The Reno Gazette-Journal via AP) less Sen. Elizabeth Warren, D-Mass ., pushed back at fellow Democrats who advocate a more moderate path to the White House during a speech at Truckee Meadow Community College, Tuesday night, Dec. 10, 2019, in Reno,...more Photo: Andy Barron, AP Warren pushes back against more moderate path to White House 1 / 7 Back to Gallery RENO, Nev. (AP)--Pushing back against fellow Democrats who advocate a more moderate path to the White House, Sen. Elizabeth Warren said Tuesday her party will lose the 2020 presidential election if it settles for an agenda that's \"business as usual\" and only \"nibbles around the edges\" of past U.S. policies. The Massachusetts senator said in a speech at a community college in Reno that her progressive campaign has the \"big ideas\" the country needs, including a 2% wealth tax on incomes over $50 million and Medicare for All. She also told the crowd of more than 600 in the biggest gold producing state in the U.S. that in addition to ending all new drilling and mining on federal lands, she would give Native American tribes veto power over pipelines and other development with environmental impacts on lands adjacent to their tribal lands. \"This country is in a crisis,\" Warren said at the close of a speech that devoted about half of her nearly 90-minute appearance to answering questions from audience members. Polls show former Vice President Joe Biden with a slight lead in Nevada over Warren and Vermont Sen. Bernie Sanders. Biden has been critical of both for pushing agendas he believes are overly ambitious and too costly, including Medicare for All. Warren didn't name any of her Democratic rivals during Tuesday night's speech but took direct aim at such concerns. \"Party insiders...think that somehow that running a vague campaign that nibbles around the edges on these huge problems is a safe strategy,\" Warren said. \"If the best that Democrats can offer is business as usual after <mark>Donald Trump</mark>, then Democrats will lose. When we have ideas big enough to meet the problems in people's lives, that's when we win .\" An individual's first $50 million of income would be exempt from Warren's proposed wealth tax, with 2% levied on every dollar after that and an additional 1% surcharge above $1 billion. She estimates it would raise $800 billion annually. Earlier Tuesday, Warren updated her strategy to combat climate change with a focus on protecting ocean habitat as well as Western drought and wildfires. She released her plan for The New Blue Deal Tuesday as an addendum to the Green New Deal following a gathering with a powerful casino workers' union in Las Vegas Monday night. Th addition is mostly directed at ways to address how climate change is affecting oceans, including expanding protection of marine areas and prohibiting new offshore drilling in federal waters. But it also highlights the need for new plans to ease the stress on critical water supplies like the Colorado River basin, where drops in reservoir levels forced mandatory water cuts this summer in Arizona and Nevada. Sanders appeared before the Culinary Workers in Las Vegas Tuesday after stops in Carson City, Reno and Elko the past two days. Biden plans to meet with the union in Las Vegas on Wednesday. Most Popular 1 \"We ate their lunch': Democrats claim legislative victories with dealmaker <mark>Trump</mark> 2 Greenwich teen pleads guilty to two burglaries 3 Child dies after being struck by vehicle in New Canaan driveway 4 Snowfall could impact Wednesday morning commute in CT 5 We shopped at Kohl's and JCPenney, and both had real issues. Here's why I'd rather shop at Kohl's anyway. 6 Fotis Dulos faces foreclosure on New Canaan house 7 Greenwich police: Drunken driver had left child alone before crash View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2016042009_00019010_W", "names": {"Jeff Evans": ["Q17385896", "Q6173783"]}, "date": "2016-04-20", "url": "http://www.nwaonline.com/news/2016/apr/20/parts-of-houston-still-closed-by-floodi/", "content": "Parts of Houston still closed by flooding By DEMOCRAT-GAZETTE STAFF AND WIRE REPORTS Posted: April 20, 2016 at 3:48 a.m. Updated: April 20, 2016 at 3:48 a.m. DAVID J. PHILLIP Credit: AP Residents are evacuated from a retirement and assisted-living complex as floodwaters rise Tuesday in Spring, Texas. HOUSTON--As more than a foot of rain deluged the nation's fourth-largest city, inundating homes, shutting down highways and leaving at least six people dead, Houston's mayor said there was no immediate solution. Residents are evacuated from their apartment complex Tuesday in Houston. Storms have dumped more than a foot of rain in the a.. . (By: DAVID J. PHILLIP) Louis Marquez carries his dog Chocolate through floodwaters Tuesday after rescuing the dog from his flooded apartment in Hous...(By: DAVID J. PHILLIP) (Credit: AP) Flash flooding and a 50 percent chance of more rain were possible after nearly 18 inches fell in 24 hours. The National Weather Service had the area under a flash flood watch through this morning. \"A lot of rain coming in a very short period of time, there's nothing you can do,\" Mayor Sylvester Turner said Monday. Scores of subdivisions were flooded, and most schools remained closed, although the city itself was returning to normal Tuesday. Municipal offices reopened Tuesday, and by midmorning, fewer than 10,000 CenterPoint Energy customers were without power, an improvement from 24 hours earlier when electricity failures topped 100,000. Houston's Metropolitan Transit Authority resumed service, and most highways within the city were open. Outside the city and into the suburbs of northwest Harris County, runoff from Monday's rains pushed creeks over their banks and forced more people to evacuate their homes overnight. In addition to its location, Houston's \"gumbo\" soft soil, fast-growing population and building boom that has turned empty pastures into housing developments all over the city's suburbs make it vulnerable to high water. Harris County has seen a 30 percent jump in population since 2000. Its surrounding counties have grown by nearly 10 percent since 2000, according to the Greater Houston Partnership, a business group. Some of the resulting developments include adequate greenspace for water runoff, but not all of them do, said Philip Bedient, an engineering professor at Rice University. \"Could we have engineered our way out of this?\" Bedient asked. \"Only if we started talking about alterations 35 or 40 years ago .\" Rainstorms last year over Memorial Day weekend caused flooding that required authorities to rescue 20 people, most of them drivers, from high water. Drivers abandoned at least 2,500 vehicles, and more than 1,000 homes were damaged by flooding. The year before, flash flooding in Houston and suburban counties left cars trapped on highways. Still, those storms pale in comparison with the devastation from Hurricane Ike in 2008 and Tropical Storm Allison in 2001. Allison left behind $5 billion in damage and flooded parts of downtown and the Texas Medical Center, which sits near the Brays Bayou, a key watershed. <mark>Jeff Evans</mark>, the National Weather Service's chief meteorologist for Houston, said Monday's soaking and the 2015 Memorial Day deluge were the second - and third-biggest rain events on record after Allison, which dumped more than 30 inches of rain on parts of the city over two days. He said the El Nino weather phenomenon, caused by heightened surface temperatures in the eastern Pacific, could \"be a player in why we've had so many big rain events this year .\" <mark>Evans</mark> said rain fell in some places Monday at a rate of 3-4 inches per hour. \"No matter what drainage system you build, anything will struggle with that kind of volume in that short a time,\" he said. Bedient has worked with the Texas Medical Center on better preparing its facilities for large rainfalls. Those preparations include the use of a sophisticated weather alert system that gives the medical center extra time to activate gates and doors that block excess rainwater. Improving the monitoring of specific watersheds and flood-prone areas might give affected residents the extra bit of time they need to save lives and take protective measures. \"We can't solve this flood problem in Houston,\" Bedient said. \"All we can do is a better job warning .\" The upper-level low that took heavy rain to Texas will pump moisture into Arkansas, although National Weather Service forecasters say the state will not see the deluge that Houston and Dallas saw. Weather service meteorologist Charles Dalton of North Little Rock said the state should see \"garden-variety\" showers and light thunderstorms through Thursday evening. No severe weather is expected, he said. \"There are no signals of strong convection or heavy rain in this,\" he said. \"We could see some impulses sparking off a few thunderstorms, but nothing severe .\" Rain entered Arkansas late Monday and will move slowly east across the state. The southern half of the state should see more rainfall, although accumulations may not top 1-2 inches total, he said. Dalton said remnants of the system should cross the Mississippi River by Friday. He said meteorologists are watching another system that could bring heavier storms to the state by midweek next week. Information for this article was contributed by Michael Graczyk, Nomaan Merchant and Frank Bajak of The Associated Press; and by Ken Heard of the Arkansas Democrat-Gazette. A Section on 04/20/2016"}, {"articleID": "2019051417_00043918_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"]}, "date": "2019-05-14", "url": "https://timesofindia.indiatimes.com/world/us/in-echo-of-iraq-war-build-up-us-weighs-proposal-to-deploy-120000-troops-in-middle-east/articleshow/69331089.cms", "content": "In echo of Iraq war build-up, US weighs proposal to deploy 120,000 troops in Middle-East In echo of Iraq war build-up, US weighs proposal to deploy 120,000 troops in Middle-East Chidanand Rajghatta | TNN | Updated: May 14, 2019, 22:15 IST <mark>John Bolton</mark> WASHINGTON: The more things change, the more they remain the same, a weary satirist wrote of the French revolution, and it appears the United States has drawn a page from that playbook, with fresh plans to deploy 120,000 troops in the Middle-East, this time to face-down Iran. In echoes of the run-up that led to eventual decimation of Iraq, hardliners in the Trump administration led by National Security Advisor <mark>John Bolton</mark> are reported to have presented a military plan that envisions sending as many as 120,000 troops to the Middle East should Iran attack American forces or accelerate work on nuclear weapons. This, despite President Trump's well-known anathema towards fighting foreign wars that do not involve American vital interests. The ostensible trigger for floating this proposal is the attack on four oil tankers and an oil pipeline belonging to US allies UAE and Saudi Arabia, which hawks in the Trump administration are blaming on Iran and its proxies in the Gulf. The Saudis, Iran's regional rivals in a Sunni-Shia battle for dominating the region, have said the sabotage was intended to \"undermine the freedom of maritime navigation, and the security of oil supplies to consumers all over the world .\" Teheran, in turn, has suggested they were \"false flag\" operation by the US to provoke a confrontation with Iran. Trump, who hosted an iftar dinner at the White House on Monday, issued a cryptic warning to Teheran amid the US build-up, saying, \"I'm hearing little stories about Iran. If they do anything, they will suffer greatly. We'll see what happens with Iran .\" While it was not clear what the US President meant (clarity has never been his strong point), some analysts recalled the hasty rush into war against Iraq after 9/11 when Baghdad and Saddam Hussein had nothing to do with the attack, which was carried out mainly by Saudi extremists. The New York Times, which first reported the US proposal to return troops to the region, attributed the hawkish move to <mark>Bolton</mark>, calling him \"one of the administration's most virulent Iran hawks\" and recalling his push for confrontation with Tehran was ignored more than a decade ago by President George W. Bush. The paper said the size of the force suggested has shocked some who have been briefed on the proposal, noting that the 120,000 troops would approach the size of the American force that invaded Iraq in 2003. It would reverse years of retrenching by the American military in the Middle East that began with President Barack Obama's withdrawal of troops from Iraq in 2011, it noted. But apparently, hawks in the administration have been arguing that the US drawdown from Syria and its diminished naval presence in the region has emboldened Iran. The US has in recent weeks moved an aircraft carrier group, B-52 bombers, a Patriot missile interceptor battery and more naval firepower to the Gulf region. The Trump administration's dialing up of involvement in the Gulf region, ostensibly at the behest of its ally Israel, comes even as Washington is struggling to manage a rising China, with whom President Trump has initiated a trade war."}, {"articleID": "2012100518_00055273_W", "names": {"Derrick Johnson": ["Q2761348", "Q27842989", "Q40232099", "Q5263041", "Q5263042"], "Brandon Flowers": ["Q309697", "Q4956854"], "Tom Coughlin": ["Q1378304", "Q7815428"], "Greg Jennings": ["Q1544938", "Q5605252"], "Mike Mccarthy": ["Q1933317", "Q21062541", "Q22279122", "Q506866", "Q6847875", "Q6847876", "Q6847877"], "Chuck Pagano": ["Q5115650", "Q761601"]}, "date": "2012-10-05", "url": "http://columbiatribune.com/news/2012/oct/05/injuries-continue-to-pile-up-for-struggling/", "content": "romeo crennel shuffled into the small interview room, settled into a chair behind a table holding a couple of microphones and launched into what's become his usual routine. \"all right,\" crennel said, \"i'm going to start with our injuries .\" and with that, crennel started the roll call. peyton hillis was out with an ankle injury. glenn dorsey a calf injury. jon baldwin, jalil brown and devon wylie with hamstring troubles. <mark>derrick johnson</mark> a sore groin, ropati pitoitua an elbow injury, kendrick lewis an ailing shoulder and ryan lilja a bad back. just what the chiefs (1-3) don't need heading into sunday's game against baltimore. \"we've got a good football team coming into town,\" crennel said yesterday, \"i think we're probably the only ones who think we've got a chance. so we're going to work our preparation and continue our preparation to try to get it ready to play .\" the only problem is that it's hard to prepare when there are eight guys missing from practice and a couple more who are limited. it reached the point this week that crennel had to ponder throwing practice-squad defensive end jerome long in with the starters for lack of able bodies. the most loathed three letters in kansas city these days? dnp, as in, did not participate. \"the guys who can practice will practice, and the ones who are limited will be limited, and we'll go from there,\" said crennel, who also had to put tight end kevin boss - one of the chiefs' main offseason acquisitions - on season-ending injured reserve this week with a head injury. by comparison, the ravens (3-1) had just two players on this week's injury report. it's hard to decide which of the chiefs' injuries are the most debilitating, which players the most difficult to replace. six players on the report are starters, most of the rest of them key contributors, including pitoitua, who started this past sunday's game in dorsey's place. hillis hurt his ankle two weeks ago against new orleans and hasn't practiced since, putting more of the load in the ground game on jamaal charles and shaun draughn. dorsey injured his left calf before last week's game against san diego, the game in which pitoitua got hurt. <mark>johnson</mark> has been dealing with a number of bumps and bruises this season, but the pro bowl linebacker's latest appears to be the most severe. \"he'll be out there in practice,\" crennel said, \"but i don't think he's going to do much .\" not exactly encouraging, huh? baldwin hurt his hamstring in practice this week, and crennel said it would be taped and he would give it a go in yesterday's workout. baldwin has 10 catches for 148 yards this season. lewis hasn't played all year after hurting his shoulder in an exhibition game at st. louis. brown struggled earlier this season with a groin injury, and now he's missing time because of a hamstring. his injury robs kansas city of some valuable depth behind <mark>brandon flowers</mark>, the team's best cover cornerback, who aggravated a heel injury against san diego that had already caused him to miss most of training camp and the start of the regular season. crennel doesn't know for sure whether any of the injured chiefs players will be around for sunday's game, though it's a good bet that several will try to play. one thing is certain: the ravens aren't going to feel sorry for them. \"we cannot feel sorry for ourselves,\" crennel said. \"even though we don't like it, where we are, how we got where we are, we can't feel sorry for ourselves, that woe's - me syndrome. we have to get ourselves mentally ready, because we have a good football team coming in .\" giants' nicks out again: new york giants wide receiver hakeem nicks won't play in sunday's game against cleveland because of recurring left foot and knee problems. nicks has missed the last two games, and coach <mark>tom coughlin</mark> said yesterday that nicks won't be available against the browns. that complicates new york's passing game because backup ramses barden has a concussion and his status is uncertain. packers' <mark>jennings</mark> to miss game at indy: green bay packers wide receiver <mark>greg jennings</mark> will not play sunday at indianapolis. coach <mark>mike mccarthy</mark> said yesterday that the two-time pro bowler will miss the game because of a groin injury that has nagged him all season. <mark>jennings</mark> suffered the injury in the sept. 9 regular-season opener against san francisco then missed the team's sept. 13 victory over chicago. he returned to play at seattle on sept. 24 then aggravated the injury this past sunday against new orleans and had to come out of the game in the second quarter after a 9-yard touchdown catch. colts to honor ill coach: beginning today, the colts plan to honor coach <mark>chuck pagano</mark> by selling t-shirts, handing out wristbands and promoting a blood drive. <mark>pagano</mark> was diagnosed last week with a form of leukemia and has been undergoing treatment at an indianapolis hospital. copyright 2012 columbia tribune. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. use the comment form below to begin a discussion about this content. post a comment our policy regarding reader comments be courteous. don't post comments that are abusive, defamatory, illegal, libelous or obscene. it is possible to debate without engaging in personal attacks. we cannot review every comment, but we reserve the right to remove or delete comments at any time. for more information, read our / news/2012/oct / 05/injuries-continue-to - pile-up-for-struggling / romeo crennel shuffled into the small interview room, settled into a chair behind a table holding a couple of microphones and launched into what's become his usual routine. \"all right,\" crennel said, \"i'm going to start with our injuries .\" and with that, crennel started the roll call. peyton hillis was out with an ankle injury. glenn dorsey a calf injury. jon baldwin, jalil brown and devon wylie with hamstring troubles. <mark>derrick johnson</mark> a sore groin, ropati pitoitua an elbow injury, kendrick lewis an ailing shoulder and ryan lilja a bad back. just what the chiefs (1-3) don't need heading into sunday's game against baltimore. \"we've got a good football team coming into town,\" crennel said yesterday, \"i think we're probably the only ones who think we've got a chance. so we're going to work our preparation and continue our preparation to try to get it ready to play .\" the only problem is that it's hard to prepare when there are eight guys missing from practice and a couple more who are limited. it reached the point this week that crennel had to ponder throwing practice-squad defensive end jerome long in with the starters for lack of able bodies. the most loathed three letters in kansas city these days? dnp, as in, did not participate. \"the guys who can practice will practice, and the ones who are limited will be limited, and we'll go from there,\" said crennel, who also had to put tight end kevin boss - one of the chiefs' main offseason acquisitions - on season-ending injured reserve this week with a head injury. by comparison, the ravens (3-1) had just two players on this week's injury report. it's hard to decide which of the chiefs' injuries are the most debilitating, which players the most difficult to replace. six players on the report are starters, most of the rest of them key contributors, including pitoitua, who started this past sunday's game in dorsey's place. hillis hurt his ankle two weeks ago against new orleans and hasn't practiced since, putting more of the load in the ground game on jamaal charles and shaun draughn. dorsey injured his left calf before last week's game against san diego, the game in which pitoitua got hurt. <mark>johnson</mark> has been dealing with a number of bumps and bruises this season, but the pro bowl linebacker's latest appears to be the most severe. \"he'll be out there in practice,\" crennel said, \"but i don't think he's going to do much .\" not exactly encouraging, huh? baldwin hurt his hamstring in practice this week, and crennel said it would be taped and he would give it a go in yesterday's workout. baldwin has 10 catches for 148 yards this season. lewis hasn't played all year after hurting his shoulder in an exhibition game at st. louis. brown struggled earlier this season with a groin injury, and now he's missing time because of a hamstring. his injury robs kansas city of some valuable depth behind <mark>brandon flowers</mark>, the team's best cover cornerback, who aggravated a heel injury against san diego that had already caused him to miss most of training camp and the start of the regular season. crennel doesn't know for sure whether any of the injured chiefs players will be around for sunday's game, though it's a good bet that several will try to play. one thing is certain: the ravens aren't going to feel sorry for them. \"we cannot feel sorry for ourselves,\" crennel said. \"even though we don't like it, where we are, how we got where we are, we can't feel sorry for ourselves, that woe's - me syndrome. we have to get ourselves mentally ready, because we have a good football team coming in .\" giants' nicks out again: new york giants wide receiver hakeem nicks won't play in sunday's game against cleveland because of recurring left foot and knee problems. nicks has missed the last two games, and coach <mark>tom coughlin</mark> said yesterday that nicks won't be available against the browns. that complicates new york's passing game because backup ramses barden has a concussion and his status is uncertain. packers' <mark>jennings</mark> to miss game at indy: green bay packers wide receiver <mark>greg jennings</mark> will not play sunday at indianapolis. coach <mark>mike mccarthy</mark> said yesterday that the two-time pro bowler will miss the game because of a groin injury that has nagged him all season. <mark>jennings</mark> suffered the injury in the sept. 9 regular-season opener against san francisco then missed the team's sept. 13 victory over chicago. he returned to play at seattle on sept. 24 then aggravated the injury this past sunday against new orleans and had to come out of the game in the second quarter after a 9-yard touchdown catch. colts to honor ill coach: beginning today, the colts plan to honor coach <mark>chuck pagano</mark> by selling t-shirts, handing out wristbands and promoting a blood drive. romeo crennel shuffled into the small interview room, settled into a chair behind a table holding a couple of microphones and launched into what's become his usual routine. \"all right,\" crennel said, \"i'm going to start with our injuries .\" and with that, crennel started the roll call. peyton hillis was out with an ankle injury. glenn dorsey a calf injury. jon baldwin, jalil brown and devon wylie with hamstring troubles. <mark>derrick johnson</mark> a sore groin, ropati pitoitua an elbow injury, kendrick lewis an ailing shoulder and ryan lilja a bad back. just what the chiefs (1-3) don't need heading into sunday's game against baltimore. \"we've got a good football team coming into town,\" crennel said yesterday, \"i think we're probably the only ones who think we've got a chance. so we're going to work our preparation and continue our preparation to try to get it ready to play .\" the only problem is that it's hard to prepare when there are eight guys missing from practice and a couple more who are limited. it reached the point this week that crennel had to ponder throwing practice-squad defensive end jerome long in with the starters for lack of able bodies. the most loathed three letters in kansas city these days? dnp, as in, did not participate. \"the guys who can practice will practice, and the ones who are limited will be limited, and we'll go from there,\" said crennel, who also had to put tight end kevin boss - one of the chiefs' main offseason acquisitions - on season-ending injured reserve this week with a head injury. by comparison, the ravens (3-1) had just two players on this week's injury report. it's hard to decide which of the chiefs' injuries are the most debilitating, which players the most difficult to replace. six players on the report are starters, most of the rest of them key contributors, including pitoitua, who started this past sunday's game in dorsey's place. hillis hurt his ankle two weeks ago against new orleans and hasn't practiced since, putting more of the load in the ground game on jamaal charles and shaun draughn. dorsey injured his left calf before last week's game against san diego, the game in which pitoitua got hurt. <mark>johnson</mark> has been dealing with a number of bumps and bruises this season, but the pro bowl linebacker's latest appears to be the most severe. \"he'll be out there in practice,\" crennel said, \"but i don't think he's going to do much .\" not exactly encouraging, huh? baldwin hurt his hamstring in practice this week, and crennel said it would be taped and he would give it a go in yesterday's workout. baldwin has 10 catches for 148 yards this season. lewis hasn't played all year after hurting his shoulder in an exhibition game at st. louis. brown struggled earlier this season with a groin injury, and now he's missing time because of a hamstring. his injury robs kansas city of some valuable depth behind <mark>brandon flowers</mark>, the team's best cover cornerback, who aggravated a heel injury against san diego that had already caused him to miss most of training camp and the start of the regular season. crennel doesn't know for sure whether any of the injured chiefs players will be around for sunday's game, though it's a good bet that several will try to play. one thing is certain: the ravens aren't going to feel sorry for them. \"we cannot feel sorry for ourselves,\" crennel said. \"even though we don't like it, where we are, how we got where we are, we can't feel sorry for ourselves, that woe's - me syndrome. we have to get ourselves mentally ready, because we have a good football team coming in .\" giants' nicks out again: new york giants wide receiver hakeem nicks won't play in sunday's game against cleveland because of recurring left foot and knee problems. nicks has missed the last two games, and coach <mark>tom coughlin</mark> said yesterday that nicks won't be available against the browns. that complicates new york's passing game because backup ramses barden has a concussion and his status is uncertain. packers' <mark>jennings</mark> to miss game at indy: green bay packers wide receiver <mark>greg jennings</mark> will not play sunday at indianapolis. coach <mark>mike mccarthy</mark> said yesterday that the two-time pro bowler will miss the game because of a groin injury that has nagged him all season. <mark>jennings</mark> suffered the injury in the sept. 9 regular-season opener against san francisco then missed the team's sept. 13 victory over chicago. he returned to play at seattle on sept. 24 then aggravated the injury this past sunday against new orleans and had to come out of the game in the second quarter after a 9-yard touchdown catch. colts to honor ill coach: beginning today, the colts plan to honor coach <mark>chuck pagano</mark> by selling t-shirts, handing out wristbands and promoting a blood drive. romeo crennel shuffled into the small interview room, settled into a chair behind a table holding a couple of microphones and launched into what's become his usual routine. \"all right,\" crennel said, \"i'm going to start with our injuries .\" and with that, crennel started the roll call. peyton hillis was out with an ankle injury. glenn dorsey a calf injury. jon baldwin, jalil brown and devon wylie with hamstring troubles. <mark>derrick johnson</mark> a sore groin, ropati pitoitua an elbow injury, kendrick lewis an ailing shoulder and ryan lilja a bad back. just what the chiefs (1-3) don't need heading into sunday's game against baltimore. \"we've got a good football team coming into town,\" crennel said yesterday, \"i think we're probably the only ones who think we've got a chance. so we're going to work our preparation and continue our preparation to try to get it ready to play .\" the only problem is that it's hard to prepare when there are eight guys missing from practice and a couple more who are limited. it reached the point this week that crennel had to ponder throwing practice-squad defensive end jerome long in with the starters for lack of able bodies. the most loathed three letters in kansas city these days? dnp, as in, did not participate. \"the guys who can practice will practice, and the ones who are limited will be limited, and we'll go from there,\" said crennel, who also had to put tight end kevin boss - one of the chiefs' main offseason acquisitions - on season-ending injured reserve this week with a head injury. by comparison, the ravens (3-1) had just two players on this week's injury report. it's hard to decide which of the chiefs' injuries are the most debilitating, which players the most difficult to replace. six players on the report are starters, most of the rest of them key contributors, including pitoitua, who started this past sunday's game in dorsey's place. hillis hurt his ankle two weeks ago against new orleans and hasn't practiced since, putting more of the load in the ground game on jamaal charles and shaun draughn. dorsey injured his left calf before last week's game against san diego, the game in which pitoitua got hurt. <mark>johnson</mark> has been dealing with a number of bumps and bruises this season, but the pro bowl linebacker's latest appears to be the most severe. \"he'll be out there in practice,\" crennel said, \"but i don't think he's going to do much .\" not exactly encouraging, huh? baldwin hurt his hamstring in practice this week, and crennel said it would be taped and he would give it a go in yesterday's workout. baldwin has 10 catches for 148 yards this season. lewis hasn't played all year after hurting his shoulder in an exhibition game at st. louis. brown struggled earlier this season with a groin injury, and now he's missing time because of a hamstring. his injury robs kansas city of some valuable depth behind <mark>brandon flowers</mark>, the team's best cover cornerback, who aggravated a heel injury against san diego that had already caused him to miss most of training camp and the start of the regular season. crennel doesn't know for sure whether any of the injured chiefs players will be around for sunday's game, though it's a good bet that several will try to play. one thing is certain: the ravens aren't going to feel sorry for them. \"we cannot feel sorry for ourselves,\" crennel said. \"even though we don't like it, where we are, how we got where we are, we can't feel sorry for ourselves, that woe's - me syndrome. we have to get ourselves mentally ready, because we have a good football team coming in .\" giants' nicks out again: new york giants wide receiver hakeem nicks won't play in sunday's game against cleveland because of recurring left foot and knee problems. nicks has missed the last two games, and coach <mark>tom coughlin</mark> said yesterday that nicks won't be available against the browns. that complicates new york's passing game because backup ramses barden has a concussion and his status is uncertain. packers' <mark>jennings</mark> to miss game at indy: green bay packers wide receiver <mark>greg jennings</mark> will not play sunday at indianapolis. coach <mark>mike mccarthy</mark> said yesterday that the two-time pro bowler will miss the game because of a groin injury that has nagged him all season. <mark>jennings</mark> suffered the injury in the sept. 9 regular-season opener against san francisco then missed the team's sept. 13 victory over chicago. he returned to play at seattle on sept. 24 then aggravated the injury this past sunday against new orleans and had to come out of the game in the second quarter after a 9-yard touchdown catch. colts to honor ill coach: beginning today, the colts plan to honor coach <mark>chuck pagano</mark> by selling t-shirts, handing out wristbands and promoting a blood drive. green-beckham among three tigers arrested on suspicion of marijuana possession green-beckham among three tigers arrested on suspicion of marijuana possession tigergal: aaup's givler needed a fact-checker--he renamed the chancellor emeritus \"ronald\" in his note of congratulations. thank you for the great coverage, janese. vanessa: and the university didn't even wait until after press time on a friday before a long (for some) weekend. obzervers: where is wed mental math and answer for tuesday? i've looked in 225 places...jsilvey: gislebertus--clair was the only press employee actually laid off in the process of phasing out the press. other employees found new jobs ..."}]