[{"date": "2013-06-12", "url": "http://www.npr.org/blogs/thetwo-way/2013/06/12/190940465/spurs-blow-out-the-heat-take-2-1-lead-in-nba-finals?ft=1&f=", "content": "The Spurs were red hot Tuesday night, not the Heat. San Antonio blew out Miami in Game 3 of the NBA finals, winning 113-77 and taking a 2-1 lead in the best-of-seven series. i The San Antonio Spurs' Manu Ginobili (left) congratulates teammate Gary Neal on his three-pointer during Tuesday night's game. Al Diaz / Miami Herald / MCT / Landov The San Antonio Spurs' Manu Ginobili (left) congratulates teammate Gary Neal on his three-pointer during Tuesday night's game. Led by <mark>Danny Green</mark> and Gary Neal, the Spurs went on a tear?? \"hitting a Finals record 16 shots from beyond the three-point arc. As NPR's Tom Goldman said on Morning Edition,\" Miami melted into the hardwood like the wicked witch of the west \"as San Antonio hit shot after shot. As often happens, though, the winners do have something to worry about. Point guard <mark>Tony Parker</mark>, who drives San Antonio's offense, has a right hamstring injury. He's due to be examined Wednesday. USA Today Sports thinks that if <mark>Parker</mark> can't play in upcoming games,\" there's simply no way the Spurs can finish this job and win their fifth title. \"Game 4 is set for Thursday in San Antonio. Game time: 9 p.m. ET. ABC-TV is the broadcaster. For some background on what to watch for in the finals, see our earlier post: Experts Doubt NSA Leaker's Claim About Wiretaps Top Stories: NSA Wiretap Doubts; Spurs Crush Heat In NBA Finals Sports Spurs Blow Out The Heat, Take 2-1 Lead In NBA Finals News Experts Doubt NSA Leaker's Claim About Wiretaps Sign In / Register Please keep your community civil. All comments must follow the", "articleID": "2013061219_00090440_W", "names": {"Danny Green": ["Q1164622", "Q5220400", "Q5220401", "Q555436"], "Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"]}}, {"date": "2013-06-13", "url": "http://www.independent.ie/lifestyle/motoring/new-sporty-kia-pro-ceed-is-a-real-hot-hatch-contender-29342928.html", "content": "Government publishes abortion legislation 25-year-old woman arrested in connection with attempted bomb attack on policeman French air controller strike sparks chaos here Fears G8 militants are already in country Quinns claim finance chiefs knew of unlawful Anglo loans Cycleway generates? 1.1 m for community McIlroy to march into eye of storm with Tiger Simon Zebo to start for Lions against Waratahs Double injury blow for Barry-Murphy Nani eyes move to Juventus or Monaco after failing to agree new contract \"Rough Rider' Kimmage is subject of new doc Royal Ascot back on agenda for Dawn Approach EU court rules against Ryanair in airline battle FitzPatrick\" anxious to help' PAC with glass-bottle site probe NAMA boss brands UK rumours of Ulster Bank shares swap as \"kite-flying' DCC succeeds in FTSE 250 listing after quitting Irish exchange Good news for construction sector as output rises Niall Horan gets mobbed after day spent on lavish yacht Jason Segel\" attached at the hip' to new girlfriend Pregnant model Caprice to have two babies in four weeks <mark>Liam Gallagher</mark> to realise his dream and appear on The Voice RTE axes its Premier League show to save station? 1.3 m a year Kim Cattrall sizzles in new stage role Mumford and Sons bassist in hospital with blood clot \"I prefer The Fall to X Files,\" says star Gillian Anderson A favourite child is the final taboo So what's next for Jacko's daughter? Ian Mallon - 13 June 2013 THE year is 1971 and a group of councillors are sitting around discussing the mad idea of putting a \"dual carriageway' (the word motorway was too British at the time) around Dublin. New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Mercedes hoping young owners will opt for\" baby' coupe Look, no hands! My car is driving itself Everybody is falling about at the mad notion of such a thing. One councillor looks set to explode in tears and snot as he can no longer contain his laughter, while another is almost sick with giddy hilarity. The man who brought up the idea lights a cigarette and sits back down, his humiliation complete. The answer to his earlier private consultation about whether he should bring such a notion to the table now very much apparent. And so began the longest running comedy in transport, which was back with a brand new series last week thanks to more cack-handed suggestions from the brains trust which now run such matters. CONTROVERSY And so more than 40 years after the very idea of the M50 was first mooted, it is still causing much controversy, if not as much hilarity. This time around the suggestion is to penalise anybody who uses the entire M50 every day to the tune of? 6.50 - more than three times its current rate. The very idea of putting in five different tolling areas on the M50 goes against everything that we stand for here at Herald Motoring. And the fact that the matter is even on the table without consideration for those who will be out of pocket to the tune of? 32.50 a week for using a road designed to get you around Dublin, is perverse. Leo Varadkar will say such a thing won't happen on his watch - sure isn't the M50 a big part of his constituency. But it looks like the M50 will be getting more and more toll spots in the future, and if there are no provisions in place for the many people who use the entire road every day, well that would be a travesty. Just off the M50 at Ballymount sits the HQ of Kia Ireland, a place that is getting more and more exciting with each visit. This time around I took possession of the Kia pro_cee'd, a lovely looking medium sized car - a heady mix of hot hatch meets cool coupe. The pro_cee'd comes in 1.4 and 1.6 litre diesel engines and comes in at just under? 23,000. The car has been transformed into an extremely sporty and pacy looking machine, thanks to a roofline which has been lowered substantially. When I read about lower rooflines I always fear for my medium sized head, every time I get into any newly height-challenged models. But this is not an issue with the newly-sized c \"eed, which from the inside feels roomy and almost vast for what you are getting. Apart from having a name that looks like it was created in Silicon Valley, the pro_ceed is a car for the modern ages. It is sporty, comfortable and performs majestically, giving a greater impression than all of its considerable sum parts. The people in Kia say it as\" a more sophisticated car \"and I tend to agree. The new range of Kia cars completely reinforce the stats that Kia is one of only three car brands in the world selling more cars than ever before. This mix of modernity and class make for some exciting times ahead for Kia and its increasing stable of thoroughbreds. Comments that are judged to be defamatory, abusive or in bad taste are not acceptable and contributors who consistently fall below certain criteria will be permanently blacklisted. Comments must be concise and to the point. The moderator will not enter into debate with individual contributors and the moderator's decision is final. The comment facility is removed after 48 hours. blog comments powered by Disqus New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Credit where credit's due. Toyota were the first out of the blocks with the compact/crossover SUV - they just didn't know it. This flashy Clio showed some nifty needlework Here's a car people I know have really liked in previous incarnations Jam, Glam and Slam - you've got to see it to Adam and Eve it Boy, does it counterbalance\" boring' New Mazda6 sets down benchmark for large family saloon and estates In the space race, this little star proves big's not always best! Car makers accused of overhyping fuel efficiency by up to 30pc Face-lifted 5-series is leaner, meaner and even greener New 5-door Focus ST makes no apologies for being fantastically fun to drive 12:42 New deal for Villa youngster Johnson 12:42 Van Wolfswinkel eyes \"next level' 11:42 Watchdog boss defends his conduct 11:42 Watchdog boss defends his conduct 04:52 Tests due on boat tragedy brothers 11:32 General strike in Greece in TV row 11:12 Prism leaker\" still in Hong Kong' 11:07 Woman dies in vintage rally crash 10:53 Thousands flee Colorado wildfires 12:42 New deal for Villa youngster Johnson New RAV4 is bigger, bolder, better...and a staggering? 5,000 cheaper Credit where credit's due. Toyota were the first out of the blocks with the compact/crossover SUV - they just didn't know it. This flashy Clio showed some nifty needlework Here's a car people I know have really liked in previous incarnations Jam, Glam and Slam - you've got to see it to Adam and Eve it Boy, does it counterbalance \"boring'\" Unfortunately it's not a nightmare \"- family of three tragic drowned brothers Three brothers dead after fishing punt capsizes in Tramore Bay RTE axes its Premier League show to save station? 1.3 m a year Russell Brand reveals he had nine orgasms in one evening in Dublin Robert Pattinson stares directly at the camera and sports a beard in a new role - the face of Dior Homme fragrance. Alan Partridge is\" chatting for his life \"in a siege on his local radio station in the latest trailer released for his new film Alpha Papa. Kanye West's reps have denied claims he cheated on Kim Kardashian. <mark>Olivier Martinez</mark> has revealed he and Halle Berry are expecting a son, and he will be born in America. Paul Hollywood's estranged wife has opened up on Twitter about coping without the TV star. Caprice is expecting two babies within a month of each other as she discovered she was pregnant just after hiring a surrogate. Miami Nice - Niall Horan gets mobbed after day spent on lavish yacht One Direction boys came up with a novel way of escaping fans - sailing away on a luxury boat in Florida. Superman braved the rain at Man of Steel's European premiere. Pregnant model Caprice to have two babies in four weeks The 41-year-old model who is due a baby in September, has revealed a surrogate will give birth the month before. Hair today, gone tomorrow - Wayne Rooney gets second hair transplant HE'S recently become a dad for the second time, and although they say stress can cause hair loss, it may not be the case for Manchester United star Wayne Rooney. By using this website you consent to our use of cookies. For more information on cookies see our", "articleID": "2013061322_00003906_W", "names": {"Liam Gallagher": ["Q216708", "Q30084404"], "Olivier Martinez": ["Q3351197", "Q504886"]}}, {"date": "2013-06-13", "url": "http://www.popsugar.co.uk/Jennifer-Aniston-Wedding-Hair-30795328", "content": "\"I Was Fat Cavill\" and More of Henry Cavill's Best Quotes Double Debut: Anna Paquin and Stephen Moyer Reveal Twins' Names at Their True Blood Premiere Inside Stella McCartney's 2014 Resort Collection Garden Party See Sienna Miller Blooming in Burberry from All Angles Jennifer Aniston is known for her fabulous hair, so it's only fitting that it was the subject of a special Q & A with Marie Claire. Jen was joined by her longtime stylist, Chris McMillan, as they discussed her least favorite hairstyle of all time and how she may wear her hair for her \"<mark>Kate Middleton</mark>. Does she do her hair herself? She's got a hard job, being scrutinized like that. When I have a bad hair day, my hair just goes in a clip .\" On her ideal wedding hair: \"For my wedding, I wouldn't do an updo, but I think a veil is always pretty. I like loose and natural hair because it goes against the formality of the dress. Loose, like' I just got out of bed, maybe had a romp' hair .\" Stylist Chris McMillan on the Rachel: \"I know that was Jen's least favorite hairstyle because I hear about it every time I style her hair .\" See Robert Pattinson's First Dior Ad", "articleID": "2013061322_00088116_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"]}}, {"date": "2013-06-15", "url": "http://www.complex.com/music/2013/06/watch-king-louie-send-it-up-kanye-west", "content": "Watch: King Louie Talk About Creating \"Send It Up\" WIth Kanye West As most of you probably already know, King Louie is one of the featured artist on Kanye West's album, Yeezus. Louie sat down with MTV to discuss the recording process for \"Send It Up\". In the video, King Louie touches on the work ethic that was needed to record with Mr. West: \"When I did the joint, we were in the studio - no B.S., like 20 hours strong, a day\". He also mentioned that he woke up and \"spit the freestyle\" --which became the actual verse used on the album. Check out the complete recap of King Louie's studio time in Paris with Kanye West. Yeezus will be available June 18th. [via <mark>Sandro Silva</mark> & Quintino - \"Epic (Gent & Jawns Edit)\" 10 Quick Reactions to Kanye West's \"Yeezus\" A Father's Day Gift Guide for Kanye West Footage of 2 Chainz Being Robbed Has Surfaced Listen: Action Bronson and Harry Fraud \"Saab Stories\" EP Watch Lil Wayne's Amazing Appearance on \"<mark>Jimmy Kimmel</mark> Live\" The 20 Best Rappers in Their 20s (Right Now) Freddie Gibbs on Young Jeezy: \"I Know It Hurts You to Hear Your Favorite Rapper's a Fraud\" 10 Rappers Who Rapped About Croissants Before Kanye Watch Videos of Famous Musicians Before They Got Famous 10 Quick Reactions to Kanye West's \"Yeezus\" The 50 Funniest Comedians on Twitter A $AP Rocky's Best Style Instagram Pics The 25 Best Sneaker Photos on Instagram This Week", "articleID": "2013061508_00037760_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Sandro Silva": ["Q1851114", "Q2707256"]}}, {"date": "2013-06-18", "url": "http://www.3news.co.nz/US-Taliban-to-start-peace-talks/tabid/417/articleID/301929/Default.aspx", "content": "US, Taliban to start peace talks By <mark>Patrick Quinn</mark> In a major breakthrough, the Taliban and the US announced Tuesday (local time) that they will hold formal talks on finding a political solution to ending nearly 12 years of war in Afghanistan, but President Barack Obama warned the process won't be quick or easy. The comments came on a day in which Afghan forces took the lead from the US-led NATO coalition for security nationwide, marking a turning point for American and NATO military forces, which will now move entirely into a supporting role. It also opened the way for the full withdrawal of most foreign troops in 18 months After months of delays, the Taliban opened a political office in the Qatari capital of Doha, paving the way for talks to begin. The decision was a reversal of months of failed efforts to start peace talks while Taliban militants intensified a campaign targeting urban centres and government installations. In Doha, Taliban spokesman Mohammad Naim said the group opposes the use of Afghan soil to threaten other countries and supports the negotiating process, two key demands of both the US and Afghan governments before talks could begin. He made the statement shortly after the deputy foreign minister of Qatar said the Emir of the gulf state had given the go ahead for the office to open. Naim said the Taliban are willing to use all legal means to end what they called the occupation of Afghanistan. He thanked the leader of Qatar, Sheik Hamad bin Khalifa Al Thani for allowing them to open the office. Obama administration officials said US representatives will begin bilateral meetings with the Taliban at the office in a few days, and Afghan President Hamid Karzai's High Peace Council is expected to follow up with its own talks a few days later. Obama later called the opening of the Taliban political office an important first step toward reconciliation between the Taliban and Afghanistan's government, although he said the Taliban still must denounce al-Qaida and predicted there will be bumps along the way. Obama, who spoke after meeting with French President Francois Hollande at the G-8 summit in Northern Ireland, also praised Karzai for taking a courageous step by sending representatives to Qatar to discuss peace with the Taliban. The administration officials, who spoke on condition of anonymity because they were not authorized to speak on the record, vowed to continue to push the Taliban further and said that ultimately the Taliban must also break ties with al Qaida, end violence and accept Afghanistan's constitution - including protections for women and minorities. Officials said that Obama was personally involved in working with Karzai to enable the opening of the office, and that US Secretary of State <mark>John Kerry</mark> had also played a major role. The US officials said the first meeting in Doha will focus on an exchange of agendas and consultations on next steps. The Taliban have for years refused to speak to the Afghan government or the Peace Council, set up by Karzai three years ago, because they considered them to be American \"puppets .\" Taliban representatives have instead talked to American and other Western officials in Doha and other places, mostly in Europe. Karzai also said he will soon send representatives from the High Peace Council to Qatar for talks but expressed hope the process would quickly move to Afghanistan - something US officials said was unlikely. \"We are hopeful that after starting negotiations in Qatar, immediately the negotiations and all the peace process should move into Afghanistan. Afghanistan shouldn't be centre of the discussions outside of the country,\" Karzai said. \"We don't have any immediate preconditions for talks between the Afghan peace council and the Taliban, but we have principles laid down,\" Karzai said, adding that they include bringing an end to violence and the movement of talks to Afghanistan so they are not exploited by other countries. The US and its Western allies are trying to foster a peace process as foreign troops prepare to end their combat mission by the end of 2014. The US-led NATO coalition formally handed over responsibility for nationwide security to Afghan security forces earlier Tuesday, with foreign troops moving entirely into a supporting role. The transition comes at a time when violence is at levels matching the worst in 12 years, fuelling some Afghans' concerns that their forces aren't ready. The top US commander in Afghanistan, Marine Gen. Joseph Dunford, said the only way to end the war was through a political solution. \"My perspective has always been that this war is going to have to end with political reconciliation and so I frankly would be supportive of any positive movement in terms of reconciliation particularly an Afghan led and an Afghan owned process that would bring reconciliation between the afghan people and the Taliban in the context of the Afghan constitution,\" he said as reports were breaking that the Taliban were about to open an office. For US and other foreign combat troops on the ground, the transition means they will not be directly carrying the fight to the insurgency, but will provide training and mentoring, and back up as needed with air support and medical evacuations. NATO Secretary-General Anders Fogh Rasmussen said the coalition will help militarily if and when needed but will no longer plan, execute or lead operations. \"This is a historic moment for our country and from tomorrow all of the security operations will be in the hands of the Afghan security forces,\" Karzai said at the ceremony, held at the new National Defence University built to train Afghanistan's future military officers. Karzai said that in the coming months, coalition forces will gradually withdraw from Afghanistan's provinces as the country's security forces replace them. In announcing the fifth and final phase of a process that began at a November 2010 NATO summit in Lisbon, Portugal, Karzai said \"transition will be completed and Afghan security forces will lead and conduct all operations .\" Alliance training since 2009 dramatically increased the size of the Afghan National Security Forces, bringing them up from 40,000 men and women six years ago to about 352,000 today. Afghans will now have the lead for security in all 403 districts of Afghanistan's 34 provinces. Until now, they were responsible for 312 districts nationwide, where 80 percent of Afghanistan's population of nearly 30 million lives. Afghan security forces were until now carrying out 90 percent of military operations around the country. By the end of the year, the NATO force of 100,000 troops from 48 countries will be halved. At the end of 2014, all combat troops will have left and will be replaced, if approved by the Afghan government, by a much smaller force that will only train and advise.", "articleID": "2013061900_00091893_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Patrick Quinn": ["Q28740794", "Q460291", "Q7143938"]}}, {"date": "2013-06-19", "url": "http://www.wgem.com/story/22628652/award-winning-journalist-michael-hastings-dies", "content": "Award-winning journalist <mark>Michael Hastings</mark> dies (AP Photo/Blue Rider Press/Penguin). This undated photo provided by Blue Rider Press/Penguin shows award-winning journalist and war correspondent <mark>Michael Hastings</mark>. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:24\" > Zimmerman jury selection moving into a new phase Attorneys in the George Zimmerman murder trial are set for the next phase of jury selection. Prosecutors and defense attorneys in the George Zimmerman murder trial are about to move into the next phase of jury selection. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:41\" > Award-winning journalist <mark>Michael Hastings</mark> dies <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:41\" > FBI hunt for Jimmy Hoffa remains entering 3rd day FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:21\" > W. Va. mine safety lab creates disasters to train Alpha Natural Resources is unveiling a $23 million training complex for coal miners that combines the world's best technology in a single West Virginia complex - and may save lives. Orange flames lick at the roof of the coal mine, heat building and visibility dropping as smoke begins to fill the underground passageway. Then, with the push of a few buttons on a hand-held remote, the flames flicker out,...meta itemprop = \"datePublished\" content = \"2013-06-19 07:10:20\" > Baked Alaska: Unusual heat wave hits 49th state Baked Alaska: Unusual heat wave hits 49th state A heat wave hitting Alaska doesn't rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the weather feels like a stifling oven - or a tropical paradise. A heat wave hitting Alaska may not rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the days of hot weather feel like a stifling oven - or a tropical paradise. meta itemprop = \"datePublished\" content = \"2013-06-19 06:50:19\" > Ohio woman accuses 3 of holding her captive Authorities say a woman was held captive by three people who forced her to do housework, raided her bank account and menaced her with snakes. A woman told authorities she was held captive for more than a year by three people who forced her to do housework, raided her bank account and menaced her with snakes and pit bulls. meta itemprop = \"datePublished\" content = \"2013-06-19 06:40:17\" > Ex-Bulger cohort to spend 3rd day on witness stand Ex-Bulger cohort to spend 3rd day on witness stand A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. meta itemprop = \"datePublished\" content = \"2013-06-18 21:49:57\" > Rural lawmakers push for farm bill votes in House Rural lawmakers push for farm bill votes in House Farm-state lawmakers are scrambling to win bipartisan votes for a five year, half-trillion dollar farm bill on the House floor this week. Farm-state lawmakers are scrambling to win bipartisan support for a five-year, half-trillion-dollar farm bill on the House floor this week. meta itemprop = \"datePublished\" content = \"2013-06-18 11:29:33\" > NSA director says plot against Wall Street foiled NSA director says plot against Wall Street foiled The chairman of the House Intelligence Committee says it appears the much-criticized national electronic surveillance program foiled \"dozens\" of terrorist plots. The U.S. foiled a plot to bomb the New York Stock Exchange because of the sweeping surveillance programs at the heart of a debate over national security and personal privacy, officials said Tuesday at a rare open hearing on...meta itemprop = \"datePublished\" content = \"2013-06-19 04:10:11\" > Gov' t report: Smooth launch unsure for health law Gov' t report: Smooth launch unsure for health law There's no guarantee that President Barack Obama's health care law will launch smoothly and on time, congressional investigators say in the first in-depth independent look at its progress. Seeking a Syria consensus despite US-Russia divide At the G-8, leaders seek a Syria consensus despite a US-Russia divide To ease shortage of organs, grow them in a lab? As more patients get lab-grown body parts, scientists face challenge of making complex organs Some evacuations lifted in destructive Colo. fire With flames in check, some evacuation orders lifted in devastating Colo. wildfire 2 found dead in area burned by out-of-control Colo. wildfire that destroyed 379 homes Colorado wildfire destroys at least 360 homes Out-of-control Colorado wildfire destroys at least 360 homes, surpasses last year's record Defense hints at no trial in Ohio kidnap-rape case Defense hints at plea to avoid trial for Cleveland man charged with kidnapping, raping 3 women US spy programs raise ire both home and abroad No plans to end broad US surveillance despite sharp backlash from foreign allies, Congress Man kills 6 in Calif. before police shoot him dead Gunman kills 6 in Santa Monica before he reaches college library and is shot dead by police Not quite the ER: Boston hospital cleaning mummy Boston hospital that 2,500-year-old mummy calls home gives its patient a good cleaning Monumental phone-records monitoring is laid bare Government sweep of millions of citizens' phone records ignites fresh debate over surveillance Associated Press LOS ANGELES (AP) - <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Hastings</mark>, who was 33, was described by many of his colleagues as an unfailingly bright and hard-charging reporter who wrote stories that mattered. Most recently, he wrote about politics for the news website BuzzFeed, where the top editor said colleagues were devastated by the loss. \"<mark>Michael</mark> was a great, fearless journalist with an incredible instinct for the story, and a gift for finding ways to make his readers care about anything he covered from wars to politicians,\" said <mark>Ben Smith</mark>, BuzzFeed's editor-in-chief. <mark>Smith</mark> said he learned of the death from a family member. Authorities said there was a car crash early Tuesday in the Hancock Park neighborhood of Los Angeles that killed a man, but coroner's officials could not confirm whether <mark>Hastings</mark> was the victim. <mark>Hastings</mark> won a 2010 George Polk Award for magazine reporting for his Rolling Stone cover story \"The Runaway General .\" His story was credited with ending Gen. Stanley McChrystal's career after it revealed the military's candid criticisms of the Obama administration. <mark>Hastings</mark> quoted McChrystal and his aides mocking Obama administration officials, including Vice President Joe Biden, over their war policies. At a Pentagon ceremony for his subsequent retirement in 2010, McChrystal made light of the episode in his farewell address. The four-star general warned his comrades in arms, \"I have stories on all of you, photos of many, and I know a Rolling Stone reporter .\" When he died, <mark>Hastings</mark> was a contributing editor at Rolling Stone, where Managing Editor Will Dana was quoted Tuesday saying <mark>Hastings</mark> exuded \"a certain kind of electricity\" that exists in great reporters whose stories burn to be told. \"I'm sad that I'll never get to publish all the great stories that he was going to write, and sad that he won't be stopping by my office for any more short visits which would stretch for two or three completely engrossing hours,\" Dana said. <mark>Hastings</mark> was also an author of books about the wars. \"The Operators: The Wild and Terrifying Inside Story of America's War in Afghanistan\" was published late last year and details shocking exploits of the military overseas. In 2010, with the publication of \"I Lost My Love in Baghdad,\" <mark>Hastings</mark> told the story of being a young war correspondent whose girlfriend died in Iraq. \"<mark>Michael Hastings</mark>' death cuts short a life dedicated to speaking truth to power. He believed that journalists must be more than bystanders; he was a truthteller, a charming provocateur and a relentless seeker of decency in a nasty world,\" said <mark>David Rosenthal</mark>, president of The Blue Rider Press, which published \"The Operators .\" In the summer 2013 issue of Vermont Life magazine, <mark>Hastings</mark> was quoted telling an audience at the Burlington Book Festival that he doesn't believe in objectivity in journalism. \"What I try to do is be intellectually honest in my writing,\" he said. <mark>Hastings</mark>' family moved to Vermont when he was 16, a state he told the magazine was his \"spiritual home .\" According to the magazine, he lived in New York with his wife. All content? Copyright 2000 - 2013 WorldNow and WGEM. All Rights Reserved.", "articleID": "2013061914_00064939_W", "names": {"Ben Smith": ["Q21622916", "Q21622918", "Q2895559", "Q31193", "Q3637951", "Q4886477", "Q4886478", "Q4886480", "Q4886481", "Q4886482", "Q4886483", "Q4886484", "Q4886490", "Q56144844"]}}]