[{"articleID": "2014121700_00011410_W", "names": {"Robert O'Neill": ["Q18510195", "Q57892227"], "Kevin Williamson": ["Q16191505", "Q16566420", "Q360642"]}, "date": "2014-12-16", "url": "http://forums.floridasportsman.com/showthread.php?177580-Anyone-have-Snopes-on-speed-dial&goto=newpost", "content": "Members who have not reregistered since June, 2011 will need to. REREGISTER. Sorry for the inconvenience. Also, due to the high number of spammers/Robots attempting to access the site memberships are approved manually several times a day, so you may experience a delay between the time you registered and are approved and can use all of the forum functions. If this is your first visit, be sure to check out the Bin Laden Shooter Rob <mark>O'Neill</mark> Mistakenly Attacked By Street Thugs Seeking To Collect Debt From Neighbor <mark>Robert O'Neill</mark>, the former United States Navy SEAL who shot and killed Osama Bin Laden, had his home mistakenly invaded by members of a street gang this morning shortly after 1AM. <mark>O'Neill</mark> was uninjured, the five intruders all suffered injuries and remain hospitalized, but are expected to make a full recovery. Their names were not released in anticipation of the oncoming media storm. Butte Police Commissioner Bartholomew S. Harrington told members of the Associated Press in a brief press conference that the five men, part of a local street gang connected with the infamous Crips, were seeking to collect on a drug debt and invaded the wrong house, with the intended target just so happening to be the next door neighbor of <mark>O'Neill</mark>'s. \"Mr. <mark>O'Neill</mark> had just turned in for the night, but was awoken by a loud crash when his backdoor was abruptly kicked in. As the five thugs ran aimlessly through the home, Mr. <mark>O'Neill</mark> used silent hand-to-hand combat tactics to individually disarm them of their weapons. Once Mr. <mark>O'Neill</mark> had taken down the five men and secured his home, he brewed a pot of coffee and called the police station. Those boys sure did find the wrong house!\" commissioner Harrington said as he chuckled. <mark>O'Neill</mark> had little to say on the matter when Butte Daily Times journalist <mark>Kevin Williamson</mark> interviewed the celebrated war hero. \"It was nothing really. Those kids didn't have their mission planned out properly and hit the wrong target. I hated to break their wrists and dislocate each of their knees like I did, but it was necessary in order to immobilize the invasion. I hope they get the money that is owed to them once they get out of jail and decide to live better lives. My main concern is getting my back door fixed. Those boys really did a number on the door jamb,\" <mark>O'Neill</mark> stated. The neighbor who was the intended target seems to have abandoned home and has not been found by police. According to the men in custody, the debt was over a $50 bag of marijuana. Location Ft Myers Posts 726 You may not post new threads You may not post replies You may not post attachments You may not edit your posts All times are GMT -4. The time now is 08:12 PM"}, {"articleID": "2017112119_00777989_W", "names": {"Charlie Rose": ["Q1064593", "Q715515"]}, "date": "2017-11-21", "url": "http://6abc.com/charlie-rose-fired-from-cbs-amid-sexual-misconduct-allegations/2678671/", "content": "BREAKING NEWS Shots fired at New Castle County police Full Story Email share share tweet email <mark>Charlie Rose</mark> fired from CBS amid sexual misconduct allegations Email share share tweet email ABCNews TARA FOWLER Tuesday, November 21, 2017 02:48 PM CBS has fired veteran journalist <mark>Charlie Rose</mark> after multiple women accused him of sexual misconduct. In a statement to staff posted on Twitter, CBS said <mark>Rose</mark> was terminated \"effective immediately .\" \"This followed the revelation yesterday of extremely disturbing and intolerable behavior said to have revolved around his PBS program,\" the statement read in part. \"Despite <mark>Charlie</mark>'s important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace .\" Shortly thereafter, PBS released a statement of its own: \"In light of yesterday's revelations, PBS has terminated its relationship with <mark>Charlie Rose</mark> and canceled distribution of his programs. PBS expects all the producers we work with to provide a workplace where people feel safe and are treated with dignity and respect .\" <mark>Rose</mark>'s dismissal came after multiple women shared their personal stories with The Washington Post and Business Insider. The Post reported that <mark>Rose</mark>'s accusers either worked with or aspired to work with him on his PBS show, \"<mark>Charlie Rose</mark>,\" from the late 1990s to 2011. At the time of the alleged incidents, the women ranged in age from 21 to 37, according to the paper. Business Insider featured three women, all former \"<mark>Charlie Rose</mark>\" interns, who also accused <mark>Rose</mark> of inappropriate behavior, speaking to the site on the condition of anonymity. Before being fired on Tuesday, <mark>Rose</mark>'s \"CBS This Morning\" co-anchors Gayle King and Norah O'Donnell addressed the situation, calling for an end to the alleged behavior from <mark>Rose</mark> or anyone else in a position of power. \"Let me be very clear, there is no excuse for this alleged behavior,\" O'Donnell said. \"It is systematic and pervasive and I've been doing a lot of listening ....Women cannot achieve equality in the workplace or in society until there is a reckoning and a taking of responsibility .\" <mark>Rose</mark> issued an apology to the Post after the allegations first broke and later shared it on Twitter Monday night. \"In my 45 years in journalism, I have prided myself on being an advocate for the careers of the women with whom I have worked,\" he said in a statement to the newspaper. \"Nevertheless, in the past few days, claims have been made about my behavior toward some former female colleagues .\" It is essential that these women know I hear them and that I deeply apologize for my inappropriate behavior. I am greatly embarrassed. I have behaved insensitively at times, and I accept responsibility for that, though I do not believe that all of these allegations are accurate. I always felt that I was pursuing shared feelings, even though I now realize I was mistaken, \"he continued .\" I have learned a great deal as a result of these events, and I hope others will too. All of us, including me, are coming to a newer and deeper recognition of the pain caused by conduct in the past, and have come to a profound new respect for women and their lives. \"Related Topics: abc news national Email share share tweet email (Copyright © 2017 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. Top Stories Shots fired at New Castle County police Granddaughter arrested in Port Richmond stabbing CBS, PBS fire <mark>Charlie Rose</mark> following sexual misconduct allegations Police arrest suspect in fatal shooting of Pa. officer Bank bandit caught on camera in Center City Video shows moments before, after Plymouth Twp. attack FCC chairman sets out to repeal\" net neutrality' rules Day care owner charged with abuse in Del.. Show More Several assaulted, robbed by teen flash mob Border Patrol agent may have fallen to his death: AP Source Woman struck and killed on Black Horse Pike in NJ AccuWeather: Mostly Sunny, Milder This Afternoon Formerly conjoined twins head home from CHOP More News Photos PHOTOS: Mass shooting at Texas church PHOTOS: Arrests target drug, gang activity in Delaware 16 charged with murder in Delaware prison riot 15 indicted in Philadelphia/Camden drug ring bust More Photos"}, {"articleID": "2017091519_00710289_W", "names": {"Joey Gibson": ["Q11310827", "Q43378375"]}, "date": "2017-09-15", "url": "http://news.opb.org/news/article/npr-hacker-group-ourmine-targets-vevos-data-and-removes-it-by-request/", "content": "Vevo, the music video platform co-owned by the three major labels along with Google's parent company and the Dubai-based Abu Dhabi Media, was the victim of a hack by the prolific group OurMine in the early hours of Friday. The hack was revealed by OurMine in a blog post. Data including one-sheets on featured artists and marketing materials, supposedly 3.12 terabytes worth, was posted to OurMine's website. Hours later, Vevo requested that the stolen info be taken down, and OurMine removed it. In an email to NPR, OurMine, which operates anonymously, claims it did not initially intend to post the data publicly and tried to alert Vevo of the breach privately, but that Vevo responded, \"F *** off, you don't have anything .\" OurMine shared a screenshot of that exchange, which lacked any identifying information and so could not be verified as taking place between the two, with NPR. Vevo would not verify the exchange to NPR when asked. Why was Vevo targeted? In its email to NPR, OurMine wrote, \"Every month we pick random companies to check their security and Vevo was one of them .\" (So it was not this 2016 tweet .) Asked for particulars about the hack, such as when it learned of the attack, whether any user data was posted publicly, when it requested its data be removed from public availability and what steps it was taking to prevent future attacks, Vevo issued this statement: \"We can confirm that Vevo experienced a data breach as a result of a phishing scam via LinkedIn. We have addressed the issue and are investigating the extent of exposure .\" In addition to posting private documents publicly, OurMine is also a business, offering its security services to both individuals (for $30) and companies (price upon request). While high-profile hacks of companies like Vevo and individuals like the singer Troye Sivan and tech mogul Mark Zuckerberg (password: \"dadada\" ) act as marketing for the company--generating articles like the one you're reading now--OurMine says that's not the point of its activities. \"We are doing this to improve the world security, as we said before we start all the hacks we did. No one is safe from hackers, even us!\" According to the group's own posts that doesn't seem to be the whole truth--its hack of BuzzFeed Media in Oct., 2016, appeared to be retaliatory, \"because they are reporting fake news about us .\" The group posted on BuzzFeed's website a warning: \"don't share fake news about us again, we have your database. Next time it will be public. Don't f *** with OurMine again .\" Copyright 2017 NPR. To see more, visit http: //www.npr.org/. Featured Adventure explore view more photos get driving directions print field guide + map powered by Explore Nearby Adventures More News UO Agrees To Pay Fired Bach Festival Artistic Director $90K Rep. Greg Walden Is Oregon's Champion Of Self-Driving Cars Net Neutrality Billboard Targets Oregon Rep. Greg Walden All Classical Portland CEO Retires Amid Station Unrest More OPB News Roundtable | Opera Theatre Oregon | PSUAH's Response To <mark>Joey Gibson</mark> An Interview with GoGo Penguin Portland Mayor Wheeler | Type 1 Diabetes | \"Oregon Field Guide '"}, {"articleID": "2011032418_00102509_W", "names": {"John Squire": ["Q1342312", "Q19335514", "Q42647499", "Q42855438"]}, "date": "2011-03-24", "url": "http://destinationcrm.com/Articles/ReadArticle.aspx?ArticleID=74576", "content": "ibm unveils social and email optimization suite tweet ibm today launched coremetrics social and unica pivotal veracity email optimization suite, two new cloud-based solutions aimed to provide marketers real-time data from social media channels. with coremetrics social, companies can measure the return on investment from their social marketing initiatives by using data from social media web sites. <mark>john squire</mark>, chief strategy officer for ibm coremetrics, says these new solution will help marketers develop \"more targeting, highly-measurable, and effective social media marketing campaigns .\" \"ibm's approach to social media analytics is based on the understanding that people interact with an organization's brand in a number of ways, including email, social networking sites, and company web sites, and the true measure of business impact demands a fully integrated view of the interaction with these resources,\" said <mark>john squire</mark>, chief strategy officer for ibm coremetrics, in a statement. unica pivotal veracity email optimization quite analyzes email links that are shared across social network platforms, tracking all links associated with a marketer's brand and email. after several months of developing the solution, michelle eichner, vice president of product marketing at unica, an ibm company, believes her team has created a one-of-a-kind product that reflects consumer interactions with brands through email and social media. \"today, marketers are extending their email into social in a number of different ways,\" eichner says. \"this is a whole new set of metrics where our industry has never had the ability to say\" here are all of my links that were shared, here are the campaigns they are associated with, here is which campaigns are more popular in influencing people to share, and now i can know exactly who these people sharers are and take that that data to try to get them to do more, to get them to keep on singing the praises of my brand'. \"according to eichner, ibm has a\" huge competitive advantage \"in the marketplace .\" there is literally no one else who has actually applied these two pieces together to this degree, \"she claims .\" we have the technology, and no one has it. this is the first of its kind. \"ibm's launch of coremetrics social and unica pivotal veracity email optimization suite come soon after ibm's recent announcement about its smarter commerce initiative, which includes new cloud analytics software for companies to monitor their brands' presence in real time. to contact the editors, please email itiresearch.com - a collection of market research and reports for executive management and business & it professionals crm software solutions - learn why users love pivotal crm software send us a sample of your data. we'll clean and analyze it for free. no obligation."}, {"articleID": "2013042915_00096792_W", "names": {"Alex Neil": ["Q1515752", "Q1828808"]}, "date": "2013-04-29", "url": "http://deadlinenews.co.uk/2013/04/29/nhs-lothian-hospitals-under-threat/", "content": "monday, april 29th, 2013 | posted by health chiefs have admitted several scottish hospitals could face closure - because the buildings are too old to care for patients. three nhs lothian hospitals - astley ainslie, corstorphine and liberton - are under threat because they don't provide the \"optimal setting for patient care\". officials said the closures don't pose any threat as more patients are being treated outside of hospitals. but as closures were being discussed the health secretary <mark>alex neil</mark> said more beds are needed to deal with an ageing population. critics accused health bosses of \"singing from different hymn sheets\" and questioned the snp's pledge of maintaining crucial bed numbers. the closures were announced at the same time a planning document set out nhs lothian's priorities over the next eight years. the report stated fewer hospital beds may be required as more patients are set to be treated in the community. bed numbers in lothian across all specialities have been slashed by almost 20% in the last decade from 4445 in 2003 to 3655 in 2012. nhs lothian said it is committed to its major hospitals but can make no guarantees over the smaller sites of astley ainslie, corstorphine and liberton - which have only 467 bed between them. the health board said the buildings \"provide less than optimal setting for patient care\" and that it would now look at \"opportunities to safely move off sites .\" but mr <mark>neil</mark> told workers at a unison conference in glasgow that a growing older population would mean the same number of beds in hospitals would be needed. labour lothians msp sarah boyack called for clarity on the contradicting messages. she said: \"<mark>alex neil</mark> is saying we need the same number of beds to cope with demographic change, yet nhs lothian is talking about reducing bed numbers. it seems like they are singing from different hymn sheets .\" scottish tory health spokesman jackson carlow also accused nhs lothian and mr <mark>neil</mark> of sending out mixed messages. he said: \"there has been no end of negative news stories from nhs lothian about capacity pressure and other issues, how can it come to the conclusion it can afford to cut more beds is beyond me .\" in response mr <mark>neil</mark> said: \"even if we are able, through better treatment at home, to reduce by 50% the level of hospitalisation of our elderly population, we are still going to need the same number of beds, the same number of hospitals, the same number of doctors and nurses just to stand still because this population [over 75s] is doubling .\" professor <mark>alex</mark> mcmahon, director of strategic planning at nhs lothian said the board was committed to modern facilities, and there would be a rise in beds at the edinburgh royal infirmary. he said: \"we will review our current methods of care and make decisions on maintaining, expanding, refurbishing or replacing facilities to ensure we have the right mix of inpatient beds and capacity in the community to meet the needs of the growing population .\" a spokeswoman for the scottish government said: \"we are committed to at least maintaining the level of quality and provision in scotland's nhs - and that means having the right numbers of staff and beds, in the right place .\" all health boards continually work to shape their services to best meet the care needs of their local populations. \"short url: in brief. you can follow any responses to this entry through the sheena williamson: i'm not surprised. i have worked in the healthcare sector for years and am astounded how...elizabeth alcock: no animal should be kept in a cage, where do humans get off thinking they have the right to take...zoolover: i go to the zoo frequently and there is no extra charge for the pandas. never has been. you book a time ..."}, {"articleID": "2019031415_00865411_W", "names": {"Harry Kane": ["Q16093851", "Q29095108", "Q969725"], "Adam Richman": ["Q350691", "Q4679665"]}, "date": "2019-03-14", "url": "http://www.messengernewspapers.co.uk/news/national/17501643.spurs-mad-boy-receives-harry-kane-message-after-hospital-song-goes-viral/", "content": "Spurs-mad boy receives <mark>Harry Kane</mark> message after hospital song goes viral By Press Association 2019 <mark>Harry</mark> Pankurst along with Tottenham stars <mark>Harry Kane</mark> and Hugo Lloris 0 comment A Tottenham-mad child who has been ill in hospital for weeks has received a special message from <mark>Harry Kane</mark> and Hugo Lloris after a video of him singing went viral. Stuart Pankhurst posted a video of his eight-year-old son <mark>Harry</mark>, who had been in hospital for three weeks, singing Glory, Glory Tottenham Hotspur in his bed at Sheffield Children's Hospital over the weekend. My sons been in hospital and very poorly for over 3 weeks, having numerous operations to make him better, over this time he's been very subdued and not wanting to do much but sleep, today I played his favourite song and this happened @ SpursOfficial?? pic.twitter.com/uOty2EMgO3--stuart p (@ panky80) March 9, 2019 Mr Pankurst wrote: \"My sons been in hospital and very poorly for over 3 weeks, having numerous operations to make him better, over this time he's been very subdued and not wanting to do much but sleep, today I played his favourite song and this happened @ SpursOfficial .\" The video struck a chord with Twitter users, and it racked up over 700,000 views. Lincolnshire-based <mark>Harry</mark> and Stuart received hundreds of messages from well-wishers, and even caught the attention of Tottenham themselves, with the help of some high-profile supporters including TV presenter <mark>Adam Richman</mark>. And that inspired two Spurs stars--<mark>Harry</mark>'s favourite player <mark>Kane</mark> and goalkeeper Lloris--to send the youngster a get-well-soon message. Thank you all again for your kind messages, this is what your amazing support achieved?? pic.twitter.com/mrgjTzNP8j--stuart p (@ panky80) March 12, 2019 \"Hi <mark>Harry</mark>, me and Hugo here,\" the England captain said in a video sent to his dad via the official Tottenham Twitter account. \"We've seen your video, huge inspiration. We just want to wish you all the best. Keep going and hope to see you soon .\" The clip \"absolutely made his day\" according to Stuart. He wrote on Twitter: \"Thank you all again for your amazing support and kind messages, he's slowly getting better day by day, your support means so much to me and my family\" Just want to say a massive thank you to @ SpursOfficial @ HKane and Hugo lloris for sending <mark>Harry</mark> a msg wishing him well, it has put the biggest smile on his face and even made his twin brother cry as he's a massive spurs fan and was so happy for his brother ❤ ️--stuart p (@ panky80) March 11, 2019 Stuart said on March 2 that his son had been rushed into surgery after his shunt had become infected. A shunt is often used to treat children with hydrocephalus, to help drain away excess fluid from the brain. <mark>Harry</mark> and his twin brother Oscar were born prematurely at 26 weeks, according to Stuart who has shared a number of details of their medical complications via social media. 0 comment"}, {"articleID": "2012020621_00104430_W", "names": {"Michael Elliott": ["Q16728810", "Q19872969", "Q39734929", "Q59140206"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2012-02-06", "url": "http://ednewscolorado.org/2012/02/06/32744-commentary-medical-marijuana-industry-welcome-regulation", "content": "commentary: marijuana industry welcomes regulation this commentary was written by <mark>michael elliott</mark>, esq., executive director of the medical marijuana industry group (mmig), the largest medical marijuana trade association in colorado, and norton arbelaez, jd, mmig's board chair. staff sergeant mary mcneely joined the military, went to iraq and served her country with honor. while there, she was injured in a car bombing. upon returning to colorado springs, physicians at the veteran's administration prescribed her narcotic pain medications to treat her various injuries. nonetheless, her health kept deteriorating. the drugs did not effectively treat her pain, made her irritable, nauseous and unable to function. she grew distant from her daughter and husband. through colorado's medical marijuana system, she discovered that cannabis controlled her pain and nausea with minimal side-effects. as a result, she was able to stop taking several high-risk prescription drugs including percocet and vicodin. medical marijuana allowed her to regain a semblance of a normal life. colorado's medical marijuana program is here for mary and the tens of thousands of patients like her. while neither pariah nor panacea, medical cannabis provides substantial relief to the sick and injured, and is void of many toxic side-effects common to prescription drugs. regulated and taxed, medical cannabis also improves public safety and provides colorado with a sorely needed source of revenue and jobs. cannabis indica has been used as medicine for thousands of years. for most of american history, the united states pharmacopeia recommended it for conditions as diverse as asthma, nervous disorders and insomnia. in 1937, amid propaganda steeped in institutional prejudice, all uses of cannabis were outlawed by the federal government. in light of failed attempts at national reform, colorado voters approved a state constitutional amendment allowing for medical marijuana in 2000. currently, 16 states and the district of columbia allow medical marijuana, encompassing about one-third of all americans. conservative estimates forecast as many as 25 states will have adopted medical marijuana laws by 2014. as re? ected by an october 2010 gallup poll in which 70 percent of americans favor making medical cannabis legally available, colorado's regulated model reflects a national trend. in 2010 and 2011, the colorado general assembly, in a bipartisan effort, codi? ed the licensing, regulation and taxation of medical marijuana businesses. these regulations created a closed-loop system that requires local and state licensing, establishes \"good moral character\" standards for ownership and employment, and mandates rules for security and surveillance aimed at eliminating illicit activity. nationwide, colorado has the most comprehensive and effective medical marijuana regulatory framework. in colorado, regulated medical cannabis has provided medicine to 473 hiv/aids patients, 9,771 patients suffering from severe nausea, 14,112 patients suffering from muscle spasms, 75,424 patients suffering from severe or chronic pain, and 2,181 patients with cancer. despite all the accusations of abuse surrounding this issue, less than 2 percent of colorado's population are registered patients. according to state statistics, the average age of a medical marijuana patient in colorado is 42. as medical marijuana becomes more accepted, its medicinal uses become more apparent. recent studies have shown the potential of cannabis to treat premenstrual syndrome, insomnia, migraines, multiple sclerosis, spinal cord injuries, alcohol abuse, arthritis, asthma, atherosclerosis, depression, huntington's disease, parkinson's disease, alzheimer's disease, sickle-cell disease, sleep apnea, anorexia nervosa and many forms of cancer. with so much potential, it's not surprising that the federally funded national institute of health currently holds u.s. patent 6,630,507 b1 for \"cannabinoids as antioxidants and neuroprotectants .\" in addition to providing a mechanism for safe and legal access, regulated medical cannabis is a net positive for the state. it contributes to deferred prosecution and incarceration, as well as providing a source of revenue in hard budgetary times. in total, colorado medical marijuana businesses have paid approximately $20 million in local, state and federal taxes, and another $9 million in licensing and application fees. with regard to jobs, some estimates indicate that the medical cannabis industry has created upwards of 20,000 new jobs, as well as a boom in ancillary businesses such as real-estate, accounting, carpentry, engineering, plumbing, law, medicine and security. a recent university of colorado study indicates that states which pass medical marijuana laws see on average a 9 percent reduction in traffic fatalities. in addition, a 20-year study documented in the journal of the american medical association (january 2012) indicates that smoking cannabis on an occasional basis does not appear to produce adverse effects on lung function. moreover, the increase in criminality predicted by opponents of regulated medical marijuana has simply not materialized. though much has been made of the supposed link between medical marijuana and teen use, finds no evidence that medical marijuana laws are related to the use of marijuana by minors. other studies show that, on average, teen usage decreases after states pass medical marijuana laws. regardless, regulation remains the most effective way to limit unauthorized access and abuse. after all, street dealers do not check ids. the most comprehensive solution likely involves education and prevention initiatives, restrictions on advertising and increased penalties for illicit diversion to minors. though colorado attorney general john suthers opposes the state's medical marijuana program, consider the alternative - the continuation of a failed policy that criminalizes patients and subsidizes a violent black market operating clandestinely out of homes and public lands. this emboldened black market would pose an immediate threat to public safety and further strain our state's limited resources. u.s. attorney general <mark>eric holder</mark> has issued recommendations to u.s. attorneys to use their prosecutorial discretion, in light of limited resources, to focus on those individuals and organizations who are not in \"unambiguous compliance with state law .\" meanwhile, in colorado, the democratic process has made regulated medical cannabis the law of the land, and it is the duty of our state of? cials and our chief executive to implement the colorado medical marijuana code."}, {"articleID": "2018062020_00370523_W", "names": {"Nathan Smith": ["Q18088901", "Q1966636", "Q1966650", "Q24005445", "Q24663895", "Q27448076", "Q30123019", "Q6969340", "Q6969341", "Q6969342"], "Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2018-06-20", "url": "http://nbr.co.nz/article/wall-street-calm-us-drops-out-unhrc-ns-p-216462", "content": "Wall Street calm as US drops out of UNHRC <mark>Nathan Smith</mark> Thursday June 21, 2018 Play NBR radio on Wall Street was buoyed mostly by large NASDAQ gains as fears of a US/China trade war dissipate. Twenty-First Century Fox lifted 7.8% after Walt Disney, also up 0.7%, increased its offer for some of Fox's assets to $US71 .3 billion, hoping to muscle Comcast's recent bid. PayPal shares also rose after the company agreed to acquire financial-technology company Hyperwallet Systems for $US400 million. Elsewhere, although the S & P tech sector was 0.7% higher, Facebook rose 2.8%, Alphabet advanced 1.5% and Amazon.com climbed 1.4%. Shares in those companies have been relatively unaffected by trade worries. The Dow Jones Industrial Average fell 15.7 points, or 0.06%, to 24,684.51, the S & P 500 gained 8.69 points, or 0.31%, to 2,771.28 and the Nasdaq Composite added 74.08 points, or 0.96%, to 7,799.67. The S & P 500 almost broke a three-session losing streak, as gains in media stocks helped send the consumer discretionary sector up 0.7%. Shares in Boeing, which has acted as a proxy for trade fears, rose 0.8% after six straight declines keeping the Dow almost unchanged. The aerospace company was considering plans of a new mid-market jet that could enter service in 2025. Among those which dipped, shares of Starbucks fell 9.2% after it said it would close 150 US stores in its 2019 fiscal year, while Oracle dropped 6.4% after warning currency conversions would weaken the company's quarterly performance. The yield on the benchmark 10-year US Treasury yield edged up to 2.924%, from 2.893%. Federal Reserve Chairman Jerome Powell says sturdy US economic growth has built a strong case for continuing to gradually lift interest rates. US out of UNHRC \"For too long, the [UN] Human Rights Council has been a protector of human rights abusers, and a cesspool of political bias,\" US ambassador to the UN Nikki Haley the 47-member Council based in Geneva. Ms Haley cited the Council's \"chronic anti-Israel bias,\" and says she had warned a year ago that the US would leave if the council failed to kick out human rights abusers and continue to discuss Israel's treatment of Palestinians at every meeting. Ms Haley then announced the US will leave the council. \"We take this step because our commitment does not allow us to remain a part of a hypocritical and self-serving organisation that makes a mockery of human rights,\" adding that the decision \"is not a retreat from human rights commitments .\" Ms Haley highlighted says the council has passed more resolutions against Israel than the \"number passed against North Korea, Iran and Syria combined,\" condemning the \"disproportionate\" focus. The Israeli Prime Minister Benjamin Netanyahu praised the US decision against \"this prejudiced body\" in a message on Twitter yesterday. The Democratic Republic of Congo's election to Council membership in the past year was one of the final straws for the Trump administration, Ms Haley explained, adding that the US would be \"happy to rejoin\" if the body reforms. \"The Secretary-General [António Guterres] would have much preferred for the United States to remain in the Human Rights Council,\" the spokesperson for the UN chief said in a statement. <mark>Kim</mark> and Xi talks North Korean leader <mark>Kim Jong-un</mark> is on the second day of his visit to China, having been greeted by Chinese President Xi Jinping yesterday. Mr Xi says he hopes Pyongyang and Washington would be able to implement fully the outcome of last week's nuclear summit in Singapore, where Mr <mark>Kim</mark> pledged to work toward denuclearisation in return for US security guarantees. He also praised <mark>Kim</mark> for the \"positive\" outcome of the summit, adding that \"the Chinese people's friendship for the North Korean people will not change, and China's support for socialist North Korea will not change .\" For his part, Mr <mark>Kim</mark> reportedly promised to cooperate with Chinese officials to secure \"true peace\" in the process of \"opening a new future\" on the Korean Peninsula. South Korean President Moon Jae-in urged Pyongyang to produce a plan for concrete steps toward denuclearisation raising pressure on Mr <mark>Kim</mark> during his Beijing visit. Mr Moon remarked that \"it's necessary for North Korea to present far more concrete denuclearisation plans, and I think it's necessary for the United States to swiftly reciprocate by coming up with comprehensive measures .\" US and South Korean officials are hoping the suspension yesterday of a major joint military exercise will help solidify nuclear negotiations with the DPRK. And North Korea could begin the process of handing over the remains of troops missing in the Korea war in the next few days, including those of US soldiers. Cambridge Analytica denies tampering Aleksandr Kogan, the British professor at the centre of the Cambridge Analytica data scandal, denied that the user data he provided to the firm helped in targeting voters during the 2016 US election. \"I believe there is almost no chance this data could have been helpful to a political campaign--and I still have not seen any evidence to indicate that the Trump campaign used this dataset to micro-target voters,\" Dr Kogan told the Senate Commerce subcommittee on consumer protection. However, Cambridge Analytica whistleblower Christopher Wylie says he was aware of efforts by the firm to reduce voter engagement and turnout among certain demographic groups. Mr Wylie says he \"was aware of various projects where voter suppression\" was discussed at the firm, including efforts to \"demotivate turnout\" by certain \"target groups,\" primarily African Americans. Violence in Israel A major escalation of violence flared up overnight between Israel and the militants in the Gaza Strip after Hamas fired a volley of rockets at Israeli territory, leading the Israeli military to target 25 Palestinian militant Hamas group positions in Gaza. Israel's Iron Dome defence system intercepted seven of the 45 rockets fired into Israel, and there have been no immediate official reports of deaths or injuries from the militant attacks. The escalation started shortly after Israel carried out strikes against three Hamas sites in response to Palestinians flying fire kites and balloons over the Gaza border, which have caused significant damage to Israeli territory."}, {"articleID": "2014032401_00008252_W", "names": {"John Regan": ["Q10470735", "Q58938074", "Q6066150", "Q6254507"]}, "date": "2014-03-23", "url": "http://historiccity.com/2014/staugustine/news/florida/editorial-free-nation-without-free-press-43639", "content": "MICHAEL GOLD Editorial: No free nation without a free press HISTORIC CITY NEWS St Augustine FL Historic City News readers who know me, are not surprised to learn that I have written a \"harsh\" article, probably half sarcastic and half tongue-in-cheek, about government transparency, fraud, waste and abuse in government, or elected officials who think they are privileged, or show a sense of entitlement above the people. But, if you are close enough to really know me, you know that although I may write jokingly about politicians or bureaucrats and their behavior, I really don't think it's a joke and I am a strong advocate for government and public integrity. One of my strongest issues is the right to a free press. I often write, and believe, that news should be free and freely available to readers. But, a free press, in the Constitutional sense from which I draw the expression, refers to the freedom of press reporters to gather news and freely publish it, as they see fit, un-edited by self-serving forces - especially the government. I was a little ticked this week, actually I was pissed off, after St Augustine City Manager <mark>John Regan</mark> told a Historic City News reader on facebook that I was trying to \"sucker\" her with a harmless news article, from third party sources, informing the public about a proposal to offer a trolley service between the Visitor Information Center and Riberia Pointe. Although the defamation of me and Historic City News, that occurred between the City Manager and the reader, was likely seen by hundreds of citizens, that wasn't what had upset me. It was the written comment he made to me, publicly, saying, \"I would appreciate you calling me to discuss before you write articles about the city .\" Of course, after the news broke on historiccity.com, it was picked up by other news reporters, including former mayor, George Gardner, but not the local newspaper - which did not surprise me, given the history of their reporting on local government. Perhaps I should infer from <mark>Regan</mark>'s remarks and the Record's past (non) reporting on local politics and government, that they check with him before they do \"write articles about the city\". Our readers may rest assured that Historic City News will always be the ones asking questions. We will never put publication of an article on hold merely because the reporter has not discussed the article with the City Manager, beforehand. I maintain a collegial relation with <mark>John Regan</mark>; I like his personality, I think he is well educated, and, I voiced my support for his appointment even before Bill Harriss retired. That hasn't changed."}, {"articleID": "2015110521_00118061_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2015-11-05", "url": "http://nbcnews.com/video/four-dead-in-shooting-in-central-maine-560236099944", "content": "Feedback advertisement advertisement NBC News Video Sponsored By LIVE NOW Follow NBC News Facebook Twitter Google Plus Newsletter More RSS Youtube Tumblr Instagram Sorry, this video needs JavaScript turned on Play Four Dead in Shooting in Central Maine Investigators are not yet sure what led 42-year-old Herman Derico to shoot and kill three housemates and then himself. A 4-year-old girl who also lived as the home was not hurt. Four Dead in Shooting in Central Maine Authorities now suspect explosive device caused Russian plane crash Expert: Russian jet crash now being investigated as \"intentional' Wife and son of cop who committed suicide are now under investigation <mark>Donald Trump</mark> still set to host SNL, amid controversy <mark>Donald Trump</mark> on why he's now running ads and his use of bankruptcy laws Quentin Tarantino doubles down on controversial remarks about police Kidnapped boy found safe in Cleveland after 13 years Marijuana Legalization Initiative Fails in Ohio Previous Next Your Playlist Expand Collapse advertisement Latest Most Popular Topics U.S. World Politics Investigation Health Tech Science Pop Culture Lifestyle Business Sports Latest Latest Most Popular U.S. World Politics Investigation Health Tech Science Pop Culture Lifestyle Business Sports Search for a video Search for a video Search for a video Mascot Too Sexy For This Town? Police: Shooting That Claimed Young Boy's Life May be on Tape Four Dead in Shooting in Central Maine\" You Don't Live in the Casino? \": Behind the Life of a Casino Worker Pennsylvania Cop on Trial for Murder:\" This Is Horrible For Me' NASA: Mars Atmosphere Blown Away by Solar Wind Police Rape Trial Underway Hear Thunder Snow Strike Nashville Council Member Shot Pope Francis Releases his First Album GOP Super PACs: A Failed Experiment Meet the Girl Who May Have 48 Siblings <mark>Paul Ryan</mark> on President Obama: \"We had a Couple Conversations on the Phone' Stabbing Hero Describes Attack British PM: Egypt Flight Changes Based on Intelligence Tourists in Egypt React to Flight Security Concerns Burglar Drops In For Lunch Jeb Bush Says Cheney Served Dad and Brother Well Dance party! KLG, Hoda bust a move on TODAY Deaf Customer, Barista in Viral Video Hope More Drive-Thrus Will Use Video Chat The Trail Tapes: Life as a <mark>Donald Trump</mark> Impersonator Marcela Valladolid makes creamy pumpkin cheesecake - with squash! Reindeer, lynx, beavers, oh my! Meet Dr. Dee's furry friends\" Are you serious?!' This mom can't believe her Ambush Makeover Deaf woman's sign-language exchange with Starbucks barista goes viral Bobbie's Buzz: See KLG and Hoda's Favorite Things Meghan Trainor, KLG, Hoda dance - and put her lyrics to the test Sweet sounds of success! The highest paid women in music are...Hoda was right! Blake Shelton and Gwen Stefani are dating KLG and Hoda's big morning out: We took the subway! Missing Alabama Boy \"Did Not Know' He Was Taken\" Brooklyn' star Saoirse Ronan: This film is \"my mom and dad's story' Halfway to healthy! '16 to' 16' challenge participants check in at Week 8 Missing Boy Found Alive 13 Years Later Just hit send: Google rolls out automated replies for Gmail Tourists gape at spectacular Northern Lights in Iceland Study: A child's self-esteem develops by kindergarten Kozy Shack is recalling thousands of cases of pudding Meet Bond women of\" Spectre': Monica Bellucci, Lea Seydoux, Naomie Harris First Victim of Metrojet Plane Crash Buried in Russia Shows Watch the day's top stories and analysis to help wrap up your day. Watch Chuck Todd interview newsmakers from around the world. Watch episodes of Dateline NBC, story-telling at its best. U.S. News Video Businesses Go After Customers Who Post Bad Online Reviews Business News Cop Who Fatally Shot Motorist in Back Cleared of Murder U.S. news Crooked Cop Tried to \"Put a Hit' on Town Worker: Police U.S. news Video of Barista Helping Deaf Customer Goes Viral, Inspires U.S. news Video Four Dead in Shooting in Central Maine U.S. news World News U.S. Gunship Shot Victims Fleeing Bombed Hospital: Charity World Video Mascot Too Sexy For This Town? Weird News What We Know About the Doomed Russian Jetliner Russian Plane Crashes in the Sinai Gallery Haunting Portraits of Sleeping Children Show Migrants' Plight World Video Russian Plane Crash 101: What Do We Know? 101 advertisement Get Breaking news updates Privacy Policy advertisement Follow @ NBCNews Tweets by @ NBCNews advertisement Follow NBC News NBC News advertisement"}]