[{"articleID": "2014082122_00070249_W", "names": {"Ian Read": ["Q1655624", "Q20797619"]}, "date": "2014-08-21", "url": "http://fiercepharma.com/story/pfizer-eyes-actavis-back-plan-another-astrazeneca-bid/2014-08-21", "content": "Every business day, FiercePharma updates pharmaceutical executives on the latest Pharma industry news and deals. Stay up to date on: Pharma Company News ∣ Generic Drug Companies ∣ Pharmaceutical Marketing & Sales ∣ FDA Regulations & Warnings ∣ Phase IV Clinical Trials Who loses most in Lilly vs. Novo diabetes study? AstraZeneca Thumbs up or down on megamergers? Depends on your point of view Eisai's revved-up Belviq marketing starting to pay off, analysts say Reprint Pfizer may not get a great shot at buying AstraZeneca this fall--but it's preparing to give it a try. Meanwhile, Bloomberg reports, the U.S.-based drug giant is looking at Actavis, the generics maker with a new home address in Ireland, among other targets. That domicile is a key factor, of course, given Pfizer's (Warner Chilcott last year. That deal--and its subsequent buyout of U.S.-based Forest Laboratories--also built up Actavis' business in branded pharmaceuticals. So in addition to the company's large portfolio of generic meds, Actavis would bring along a few notable brands, and some newly approved meds. So, an Actavis buy would build up Pfizer's established products unit, widely seen as the first prospect for another sale or spin-off. It would add some new products to Pfizer's branded stable, which is in need of help. And because of Actavis' recent buying spree, it's worth some $59 billion--large enough to allow Pfizer to shift its domicile to Dublin, Bloomberg says. Whether Actavis is receptive to Pfizer's advances isn't clear; the smaller company didn't comment. Whether Pfizer would prefer Actavis, AstraZeneca ($AZN) or another buy? The company won't say, of course; Pfizer's spokeswoman Joan Campion told Bloomberg her company is continuing to \"evaluate all opportunities, regardless of size, through the lens of value creation for our shareholders and enhancing the competitiveness of our business.\" That pretty well echoes what CEO <mark>Ian Read</mark> said during the company's Q2 earnings call. Analysts and media reports have trotted out a variety of other potential Pfizer targets--even GlaxoSmithKline ($VRX), Bloomberg points out, but the Canadian drugmaker is embroiled in a hostile move to buy Allergan. The history of Pfizer's AstraZeneca bid is well documented. So is the U.K. M & A code that prevents Pfizer from mounting a new offer until November. What Bloomberg points out now is that, since Pfizer's most recent foray, AstraZeneca has raised its 2014 revenue forecast, bought a portfolio of respiratory meds from Spain's Almirall and trotted out some promising data for three cancer drugs. That means AstraZeneca would likely raise its asking price even further, Helvea analyst Odile Rundquist told the news service. \"My impression is that the deal will never go through, because it is too expensive for Pfizer.\" Will he or won't he? Pfizer CEO scouts big deals but \"silent' on AstraZeneca rebid Prepping for $25B merger, Actavis taps Forest CEO Saunders to lead combined company Join 105,000 + Insiders SIGN UP FOR OUR NEWSLETTER FiercePharma is the pharma industry's daily monitor, with a special focus on pharmaceutical company news and the market development of FDA approved products. Join thousands of pharma industry leaders who get Don't worry about a hep C pricing war, analysts tell Gilead-watchers Big Pharma doesn't win the margin stakes. That's Jazz, Celgene, Regeneron and Alexion Price could be key for Sanofi's new Gaucher pill as it sets out against IV rivals Celgene's cost-sharing offer persuades NICE to about-face on Revlimid Don't worry about a hep C pricing war, analysts tell Gilead-watchers Price could be key for Sanofi's new Gaucher pill as it sets out against IV rivals Will Allergan bid for Salix as it looks to escape Valeant's clutches? Celgene's cost-sharing offer persuades NICE to about-face on Revlimid Improve the Inclusion & Exclusion Criteria for Your Next Clinical Trial | Tuesday, September 9th, 2pm ET / 11am PT | Presented by: Rho Communiqué to sales reps: With today's docs, it's the medium and the message The formularies are here! Brace yourselves for the 48 new exclusions Seton Hall Law Online Graduate Certificates in Pharmaceutical & Med Device Law & Compliance BIOGEN IDEC NAMES ADRIANA KARABOUTIS EVP, TECHNOLOGY AND BUSINESS SOLUTIONS Celleration Announces Next Generation UltraMIST ™ System Receives FDA Clearance is the pharma industry's daily monitor, with a special focus on pharmaceutical company news and the market development of FDA approved products. Join 100,000 + pharma industry leaders who get"}, {"articleID": "2010122206_00016368_W", "names": {"Derrick Jensen": ["Q1199836", "Q5263040"]}, "date": "2010-12-22", "url": "http://yourblogs.miamiherald.com/go.php?http://minimumsecurity.net/blog/2010/12/22/my-assistant/", "content": "\"mischief in the forest\" a children's book written by <mark>derrick jensen</mark>, and illustrated by me. hardcover. 40 pages of cuteness. \"as the world burns: 50 simple things you can do to stay in denial,\" need a speaker for your event? i've got a solid powerpoint routine with q & a. funny, engaging, interesting. try it. contact: steph @ minimumsecurity.net stephanie mcmillan p.o. box 460673 fort lauderdale, fl 33346 this entry was posted on wednesday, december 22nd, 2010 at 12:00 am and is filed under"}, {"articleID": "2017040500_00759408_W", "names": {"Cary Smith": ["Q5047652", "Q5047654"]}, "date": "2017-04-05", "url": "http://www.ktvq.com/story/35071088/bill-would-prohibit-enforcement-of-federal-ban-on-firearms-in-montana", "content": "Bill would prohibit enforcement of federal ban on firearms in Mo - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Bill would prohibit enforcement of federal ban on firearms in Mo - KTVQ.com | Q2 | Continuous News Coverage | Billings, MT Member Center: Bill would prohibit enforcement of federal ban on firearms in Montana Posted: By Freddy Monares - UM Legislative News Service HELENA - The House of Representatives gave preliminary approval Tuesday to a bill meant to preserve Montanans' right to bear arms by prohibiting the enforcement of any federal ban on firearms or ammunition. The House passed Senate Bill 99 on a 60-40 vote. It will be up for a final vote on Wednesday. The bill passed out of the Senate in February on a 30-20 vote before moving to the House. It would establish the \"Montana Federal Firearm, Magazine and Ammunition Ban Enforcement Prohibition Act.\" Rep. Seth Berglee, R-Joliet, is carrying the bill in the House for Sen. <mark>Cary Smith</mark>, R-Billings. \"We did add a couple of amendments to it to allow for federal assistance, as long as it is not for the primary purpose of prohibiting, restricting or requiring any of the federal bans,\" Berglee said. At the bill's first hearing in the House Patrick Audet, lobbyist for the School Administrators of Montana, opposed the bill and said it would allow firearms on school campuses. \"If an officer couldn't enforce that law, that would be a problem. We would be opposed to that,\" Audet said. Gary Marbut, president of the Montana Shooting Sports Association, said Audet is referring to a federal act called the \"Gun-Free School Zones Act.\" The act prohibits anyone from openly carrying a loaded firearm (one that's not properly stowed) within 1,000 feet from school grounds. Marbut supported SB 99 and said past legislation already exempts Montana from that law. \"The Legislature passed a statute, frankly that I wrote, that said because we have the right to keep and bear arms in Montana every law-abiding adult is deemed to be licensed by the state, pursuant to the federal\" Gun-Free School Zones Act, \"' Marbut said. Marbut said the only other ban for firearms on school grounds is a different one called the\" Gun-Free Schools Act, \"in which the federal government encourages each state to introduce their own laws for firearms on campus. He said since that ban would be considered a state law, a school resource officer's enforcement of the state's ban would not be affected by the bill. Freddy Monares is a reporter with the UM Legislative News Service, a partnership of the University of Montana School of Journalism, the Montana Broadcasters Association and the Greater Montana Foundation. Top Trending Videos"}, {"articleID": "2018100903_00163824_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-10-09", "url": "http://www.gamereactor.eu/?system=android&sid=efa9733869f9835d56639913891369e8", "content": "Android With 2012's reboot, Firaxis fanned the flames for a whole sub-genre. Review Written by Bengt Lemne on the 8th of October 2018 at 09:28 Robert Kirkman's Skybound steps in, though all details are not final. 0 Written by <mark>Sam Bishop</mark> on the 7th of October 2018 at 09:30 \"There's better ways to spend time on the road.\" 0 Written by <mark>Sam Bishop</mark> on the 6th of October 2018 at 09:13 He laughed about it on stream. 0 Written by Christian Gaca on the 4th of October 2018 at 18:00 Make a deck and then play either in the story or PvP. 0 Report: Telltale staff might get hired to finish Walking Dead Written by Bengt Lemne on the 4th of October 2018 at 11:49 Sources tell Kotaku Telltale are looking for another company to hire staff and finish the last two episodes. 0 Written by Arya W. Wibowo on the 3rd of October 2018 at 13:54 Calamity is now the third most searched character. 0 Written by <mark>Sam Bishop</mark> on the 3rd of October 2018 at 12 Mark December 1 in your calendars. 0 Written by <mark>Mike Holmes</mark> on the 3rd of October 2018 at 12:34 We're taking a look at the latest content to drop in Fortnite. 0 Written by <mark>Sam Bishop</mark> on the 2nd of October 2018 at 14 FaZe Clan get some good news in the competition. 0 Written by Sergio Figueroa on the 2nd of October 2018 at 13:42 Less shooting, more grooving. Written by Bengt Lemne on the 29th of September 2018 at 18:30 Villagers get updated, improved add-on system, and pandas. 0 Written by Petter Hegevall on the 29th of September 2018 at 13:30 Planned for mobiles and based on a game franchise. 0 Written by Islem Sharouda on the 28th of September 2018 at 17:17 \"This is unintended, embarrassing, and it was careless for us to let this ship.\" 0 Written by Islem Sharouda on the 28th of September 2018 at 12:01 Shadow Stones pulled after exploit exposed. 0 Written by Petter Hegevall on the 27th of September 2018 at 17:00 Including a llama."}, {"articleID": "2010022420_00071238_W", "names": {"John Clancy": ["Q17275274", "Q21603229", "Q39070859", "Q6226152"]}, "date": "2010-02-24", "url": "http://rawstory.com/news/afp/Cuba_in_crackdown_after_dissident_s_02242010.html", "content": "published: wednesday february 24, 2010 security agents detained dissidents across cuba wednesday to prevent protests at the funeral of a leading political prisoner, an activist said, after the death of the hunger-striking detainee sparked international outrage. cuban president raul castro \"regrets the death of cuban prisoner orlando zapata tamayo, who died yesterday after having been on a hunger strike,\" a foreign ministry statement said. but castro denied allegations of repression in the americas' only one-party communist regime after the late dissident's mother charged her son was tortured. \"there are no tortured people, there were no tortured people, there was no execution,\" raul castro, 78, told reporters. \"that is what happens at (the us naval base in) guantanamo.\" the government's initial reaction however appeared to be to move swiftly against other dissidents. elizardo sanchez, spokesman for the outlawed commission for human rights and national reconciliation, told afp that security agents had detained about 30 activists tuesday and wednesday. \"some also have been held in their houses, without a judicial warrant, to prevent people from going to the wake,\" he said. dissidents have been rounded up in the eastern provinces of santiago de cuba, guantanamo, las tunas and camaguey, and in the central city of placetas, sanchez said. zapata, 42, was to be buried in his hometown of banes, 830 kilometers (500 miles) east of havana, after a wake at the home of his mother. \"my son was tortured the whole time he was in prison,\" reina luisa tamayo charged in a video on the blog generacion y, run by independent journalist yoani sanchez in defiance of havana's tightly controlled state media. tamayo implored \"the international community to demand the release of the rest of (cuba's political) prisoners...so that what happened to my boy does not happen again.\" zapata's death drew international condemnation and calls for an investigation. jailed since 2003 and deemed a prisoner of conscience by amnesty international, zapata had blamed his already deteriorating health on harsh conditions inside cuba's jails. sanchez said it was the first time in nearly 40 years that a cuban opposition figure has died while on a hunger strike. zapata's death is \"bad news for the human rights movement and for the government as well,\" he said. the movement \"is not seeking martyrs,\" said oswaldo paya, leader of the christian liberation movement dissident group. zapata died \"defending the freedom, rights and dignity of all cubans,\" paya added. in washington, us state department spokesman philip crowley said zapata's death \"highlights the injustice of cuba's holding more than 200 political prisoners who should now be released without delay.\" related article: us urges cuba to free political prisoners the eu commission also voiced deep regret at zapata's death. the european union urges the cuban government \"to improve effectively the human rights situation in the country by releasing unconditionally all political prisoners,\" eu commission spokesman <mark>john clancy</mark> told afp. related article: eu \"deeply regrets' death of cuban hunger striker cuba claims it has no political prisoners; it says regime opponents are all\" mercenaries \"in the pay of the united states or right-wing cuban exiles. zapata was one of 55\" prisoners of conscience \"adopted by amnesty international in cuba, most of whom were also arrested in the 2003 government crackdown on activists seeking political change. initially given a three-year prison term, zapata saw his sentence grow to 36 years as the government piled on additional charges of\" disobedience \"and\" disorder in a penal establishment. \"amnesty international said zapata\" felt he had no other avenue available to him but to starve himself in protest is a terrible indictment of the continuing repression of political dissidents in cuba. \"hector palacios, one of 75 political prisoners convicted in 2003 and who met zapata in prison, told afp\" people are outraged, \"and that a national mourning and fasting period was being weighed."}, {"articleID": "2013040410_00018826_W", "names": {"Brad Pitt": ["Q35332", "Q373912"]}, "date": "2013-04-04", "url": "http://ibtimes.com/hollywood-caters-chinese-audience-iron-man-3-transformers-4-video-1170071", "content": "expected to overtake the u.s. as the world's biggest film market by 2020, but it seems that hollywood movies have already begun catering to a growing chinese audience. most recently, the makers behind the anticipated third-installment of the marvel superhero series \"iron man,\" which was partially shot in china, announced that a different version of the film will be released, and it will differ from what audiences outside of china will see. the chinese version of the trailer, which can be seen above, also differs from the movie's american trailers, as it more prominently features chinese actors and settings. typically, when china releases its own version of a hollywood movie, it means the film did not pass the sometimes-arbitrary standards of the nation's media censorship group, the state administration of radio, film and television, which is this time, however, legendary comic book company marvel is behind the decision to create the special china-version of \"iron man 3,\" starring robert downey jr. in the title role. according to the diplomat, chinese actress fan bingbing will be in the chinese version of the movie, but her scenes will be cut from all non-chinese showings. but marvel explained that chinese audiences can expect more than just fan bingbing. \"the chinese version of the film will also feature a special appearance of china's top actress, fan bingbing, and will offer specially prepared bonus footage exclusively for the chinese audience,\" the company noted. in addition, chinese actor wang xueqi will be featured in both versions of the movie. the production of \"iron man 3\" has received a lot of international attention for its friendly involvement with chinese authorities while filming and for its use of chinese actors. \"marvel studios' experience working on this film with fan bingbing and wang xueqi and in shooting in china has been very positive and has created a springboard for future collaboration with china's talented stars and its growing film and television industry,\" marvel said. marvel isn't the only entertainment company with eyes on china. paramount pictures had a screening of their upcoming zombie movie, \"world war z,\" which stars <mark>brad pitt</mark>, for executives and decided to make a minor change to the film, keeping in mind a major audience: china. the wrap, paramount decided to alter a minor plot detail, changing the geographic origin of an outbreak that eventually caused the zombie apocalypse from china to a different location. while paramount executives say that the plot does not hinge on china being the origin, they made the change to be conscious of the fast-growing chinese market, and the state censorship that would have likely carried out the the change for them. just yesterday, paramount announced that the making of another potential blockbuster, \"transformers 4,\" will involve working with china. entertainment weekly is reporting that paramount will be co-producing the movie with two high-profile chinese companies, china movie channel and jiaflix enterprises."}, {"articleID": "2019032918_00161014_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2019-03-29", "url": "https://www.rt.com/news/455075-george-clooney-hotel-boycott-brunei/?utm_source=rss&utm_medium=rss&utm_campaign=RSS", "content": "Also on rt.com Brunei's law mandating STONING TO DEATH of gays & adulterers to come into force next week \"Every single time we stay at, or take meetings at or dine at any of these nine hotels we are putting money directly into the pockets of men who choose to stone and whip to death their own citizens for being gay or accused of adultery,\" Clooney argued. \"Are we really going to help pay for these human rights violations?\" Brunei is a tiny kingdom with a population of just 450,000 located on the island of Borneo, neighboring the Islamic nations of Indonesia and Malaysia. It does, however, have significant oil reserves and was ranked by Forbes as the world's fifth-richest nation. The nine hotels (including the Dorchester and 45 Park Lane in London, and the <mark>Beverly Hills</mark> Hotel and Hotel Bel-Air in Los Angeles) are operated by the Dorchester Collection luxury chain, which itself is owned by the Brunei Investment Agency. Clooney did, however, concede that similar efforts in the past eventually were only \"effective to a point\" as the outrage that fueled the initial boycott eventually subsided \"and certainly any boycott would have little effect on changing these laws.\" The Kingdom of Brunei first announced its intention to introduce Sharia law back in 2013 but only recently confirmed the death penalty for homosexuality and adultery, which will take effect from April 3. Clooney received many plaudits for his activism online. I am following my friend George Clooney in boycotting all of the hotels owned by the Sultan of Brunei following the April 3rd law in Brunei to stone and whip to death all gays. The <mark>Beverly Hills</mark> Hotel, Hotel Bel-Air, The Dorchester, Hotel Plaza Athenee, Hotel Eden and more. pic.twitter.com/Tp6iBYbRU8"}, {"articleID": "2019080218_00063817_W", "names": {"Ben Shephard": ["Q4886455", "Q4886456"], "Alex Smith": ["Q12720234", "Q16658140", "Q20011588", "Q2833039", "Q4717806", "Q4717807", "Q4717808", "Q4717809", "Q4717810", "Q4717811", "Q4717812", "Q4717814", "Q4717815", "Q4717818", "Q4717819", "Q57417658", "Q717897"], "Jenny Ryan": ["Q16832087", "Q21066498"], "Stephanie Davis": ["Q6134141", "Q7608260"], "Katie Price": ["Q21466514", "Q237602"]}, "date": "2019-08-02", "url": "http://www.entertainmentdaily.co.uk/daytime-tv/this-morning/this-morning-slammed-for-glamourising-shoplifting-by-interviewing-career-criminal-kim-parry/", "content": "Share Share Share This Morning viewers have slammed the ITV show for featuring an allegedly \"inappropriate\" and \"pointless\" interview with a career criminal. On Friday (August 2), Kim Farry joined hosts <mark>Ben Shephard</mark> and Rochelle Humes in the studio to talk about her profitable life as a shoplifter. She claims to have stolen goods worth £ 2million (Credit: ITV) Read more: Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage And it wasn't the first time she had appeared on the show. Kim, who now says she has turned over a new leaf, claims her illegal lifestyle allowed her to wear designer clothes, drive expensive cars and go on endless holidays. Her 45-year shoplifting habit once saw her \"earn' up to £ 20,000 pounds a month - two million pounds in total! She told <mark>Ben</mark> and Rochelle:\" In the end, because I was so good at it, it was just a business. Like you've got a job, I've got a job. \"Kim now wants to help others escape crime (Credit: ITV) Read more: Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live She also admitted she became so successful at stealing that she began to employ other people to go back to stores with de-tagged stolen goods and get money back for them. However, after serving five prison sentences, Kim has now decided to leave it all behind for the sake of her daughter Paris who\" wanted a normal life \". What's with this interview? Feels like it's glamorising shoplifting? Completely inappropriate! She has now written a book about her crimes, with part of the fee going to charity she says, which she discussed with the This Morning hosts. But fans weren't happy about her appearance on the show at all, and accused them of\" glamorising \"criminality. What's with this interview? Feels like its glamourising shoplifting? Getting a step by step on how to do it too. Completely inappropriate. #ThisMorning--Sian Humphreys (@ Sian_humphreys) August 2, 2019 Why put this woman on again. Giving a vile thief airtime. Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning pic.twitter.com/aoKJrEh2ay--LFCFan (@ LFCSIXTIMES123) August 2, 2019 This woman giving top advice on how to steal?? #ThisMorning--stacey ♡ (@ SLG__x) August 2, 2019 Y on earth would #thismorning pay someone 2 sit of that sofa telling the country she's a thief and criminal. Beggars belief .--2012 (@ Bufferb2012) August 2, 2019 Morales of an alley cat, disgusting. #thismorning should b ashamed .--2012 (@ Bufferb2012) August 2, 2019 Why have the brought this absolute scum bag on #thismorning trying to justify theft??--<mark>Alex Smith</mark> (@ DiscourseIsDead) August 2, 2019 Well done this morning. With your shoplifting guest on your program today you have told the nation how to conceal items and shop lift #ThisMorning--Claire Roberts (@ clairejoroberts) August 2, 2019 What is the point of this interview? Bloody thief #thismorning--jonah (@ jonahmoffster) August 2, 2019 So @ thismorning is promoting a thief who now is writing a book. What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!--Doug Flo (@ DougFlo) August 2, 2019 @ thismorning don't promote thief's. Regardless of how much they regret it a criminal is a criminal #ThisMorning--Mr IMPACT Blog (@ MrImpact_blog) August 2, 2019 One fumed:\" What's with this interview? Feels like it's glamorising shoplifting? Getting a step-by-step on how to do it too. Completely inappropriate. #ThisMorning. \"Another agreed, recalling when she was on the show before, typing:\" Why put this woman on again? Giving a vile thief airtime? Even Schofe told her things should be bolted down to stop her robbing. Get a job you rat #ThisMorning. \"A third blasted:\" Why on earth would T his Morning pay someone to sit on that sofa telling the country she's a thief and criminal? Beggars belief. Morals of an alley cat, disgusting. This Morning should be ashamed. \"Sorry Kim, the viewers just weren't that into you! (Credit: ITV.com)\" Why have they brought this absolute scumbag on T his Morning trying to justify theft? \"asked another, while one more tweeted:\" So This Morning is promoting a thief who now is writing a book. \"What are the chances of the profits going back to the companies that she stole from? People have probably lost jobs and businesses because of this woman. Shoplifting is not a victimless crime!\" Do you think it was wrong to give Kim Farry airtime? Leave us a comment on our Facebook page @ EntertainmentDailyFix and let us know what you think! Share Share Share Trending Articles Gareth Gates shares beautiful photo with \"lookalike' daughter Love Island host Caroline Flack goes official with new man Lewis Burton Emmerdale star James Hooton shows off climbing skills on holiday Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield The Chase's Bradley Walsh warns <mark>Jenny Ryan</mark> to\" settle down' after harsh comment about contestant Abbey Clancy shares beautiful family pic with husband Peter and all four kids More This Morning Harry Judd's wife Izzy admits to guilt over finding motherhood hard after fertility issues and miscarriage Sophie Brady shows off size 20 body in a bikini and insists she's healthy Mum of brain-damaged Tafida Raqeeb pleads with doctors to let her live Strictly star Susannah Constantine reveals lifelong anxiety left her praying she'd be hit by a lorry This Morning caller swears live on air after technical glitch nearly robbed her of prize This Morning guest insists grandparents should get consent before kissing grandkids This Morning viewers gobsmacked as woman \"MARRIES' her dog live on show Jessie J shuts down <mark>Ben Shephard</mark> on This Morning when he asks about famous boyfriend This Morning viewers divided over\" animal lover' mum who hunts and kills animals to feed family This Morning opens with technical blunder as blue title card appears on viewers' screens This Morning slammed for \"glamorising shoplifting' by interviewing career criminal AGAIN Latest News Carol Vorderman reveals secret to her incredible figure at 58 The Chase star <mark>Jenny Ryan</mark> clashes with fan who describes chasers as\" rude and snarky' EastEnders' Jessica Plummer shares adorable photo of daughter Noa Lily on her third birthday Billie Faiers mocked by fans for having yet another holiday Coronation Street's Dolly-Rose Campbell looks a world away from chavvy Gemma as she shares holiday pics Love Island host Caroline Flack goes official with new man Lewis Burton Hollyoaks' <mark>Stephanie Davis</mark> unveils new long blonde hair Love Island's Iain Stirling predicts winter version of show will be bigger hit <mark>Katie Price</mark> \"faces row with ex Peter Andre as she refuses to take drug test' Holly Willoughby horrified as husband Dan suffers hilarious mishap on holiday with Phillip Schofield"}, {"articleID": "2013052020_00052760_W", "names": {"Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"]}, "date": "2013-05-20", "url": "http://www.justmeans.com/press-releases/The-No--18-M-amp-M-S-Toyota-Team-Pits-To-Help-M-Prove-America/12525.html", "content": "Mars, Incorporated In 1911, Frank C. Mars made the first Mars candies in his Tacoma, Washington kitchen and established Mars first roots as a confectionery company. In the 1920s, Forrest E. Mars, Sr. joined his father in business and together they launched the MILKY WAY (R) bar. In 1932, Forrest, Sr. moved to the United Kingdom with a dream of building a business based on the objective of creating a mutuality of benefits for all stakeholders - this objective serves as the foundation of Mars, Incorporated today. Based in McLean, Virginia, Mars has net sales of more than $33 billion, six business segments including Petcare, Chocolate, Wrigley, Food, Drinks, Symbioscience, and more than 72,000 Associates worldwide that are putting its Principles into action to make a difference for people and the planet through its performance. Mars brands include: Petcare - PEDIGREE (R), ROYAL CANIN (R), WHISKAS (R), KITEKAT (R), BANFIELD (R) Pet Hospital, NUTRO (R), SHEBA (R), DREAMIES (R) and CESAR (R); Chocolate - MMS (R), SNICKERS (R), DOVE (R), GALAXY (R), MARS (R), MILKY WAY (R) and TWIX (R); Wrigley - DOUBLEMINT (R), EXTRA (R), ORBIT (R) and 5 (tm) chewing gums, SKITTLES (R) and STARBURST (R) candies, and ALTOIDS (R) AND LIFESAVERS (R) mints. Food - UNCLE BENS (R), DOLMIO (R), EBLY (R), MASTERFOODS (R), SEEDS OF CHANGE (R) and ROYCO (R); Drinks - ALTERRA (R) Coffee Roasters coffee, THE BRIGHT TEA CO. (R) tea, DOVE (R) / GALAXY (R) Hot Chocolate, and FLAVIA (R) brewer; Symbioscience - COCOAVIA (tm), WISDOM PANEL (tm) and SERAMIS (R). The No. 18 M & M'S? Toyota Team Pits To Help M'Prove America? CHARLOTTE, N.C., May 20, 2013 / 3BL Media / PRNewswire /--Almost daily, Kyle Busch and members of his No. 18 M & M'S? Toyota team practice to improve their efficiency changing tires and pouring gas, to ensure they can save precious seconds necessary to maintain track position. Today, the team banded together with colleagues from <mark>Joe Gibbs</mark> Racing, NASCAR and M & M'S to make improvements of a different kind. This unique team, comprised of more than 50 volunteers, is helping build two Habitat for Humanity of Charlotte homes in the Charlotte area, which includes the future homes of Yasin Mohamed and Egland Isak and their three children, as well as Kung Mang and Sung Thluai and their two children. The effort is part of M & M'S M'Prove America? campaign, a year-long partnership with Habitat designed to fund construction of new Habitat homes across the United States. Fans can join Busch and M & M'S by pledging to volunteer their time and talents at Habitat for Humanity build sites across the country at www.mproveamerica.com. This year, M & M'S is encouraging its associates and fans to log an ambitious 1.5 million minutes - or 25,000 hours - of volunteer time with Habitat. \"Charlotte has always been good to the NASCAR community - and especially to me and my teammates,\" said Kyle Busch. \"So it feels great to help two local families fulfill their dreams of homeownership. I encourage all race fans to join M & M'S in the effort to M'Prove America in their own hometowns, as there are few things in life as rewarding as helping a neighbor.\" In addition to encouraging fans to volunteer time, M & M'S is also making a donation of $500,000 to Habitat for Humanity to fund the construction of Habitat homes in 2013. Later this month, M & M'S will also introduce specially marked M'Prove America packages of red, white and blue M & M'S? Brand Candies in stores nationwide. The M & M'S M'Prove America campaign will also be on display during the Coca-Cola 600 on May 26 at the Charlotte Motor Speedway when Busch gets behind the wheel of a special No. 18 M & M'S M'Prove America Toyota. About Mars Chocolate North America: Mars Chocolate North America is the North American chocolate operations of Mars, Incorporated. In 1911, Frank C. Mars made the first Mars candies in his Tacoma, Washington kitchen and established Mars' first roots as a confectionery company. In the 1920s, Forrest E. Mars, Sr. joined his father in business and together they launched the MILKY WAY? bar. In 1932, Forrest, Sr. moved to the United Kingdom with a dream of building a business based on the philosophy of a \"mutuality of benefits\" for all stakeholders - this vision serves as the foundation of the Mars, Incorporated we are today. Based in McLean, Virginia, Mars has net sales of more than $30 billion and six business segments including Petcare, Chocolate, Wrigley, Food, Drinks and Symbioscience. More than 65,000 Associates worldwide are putting our Mars Principles in action every day to make a difference for people and the planet through our performance. Mars brands include: Chocolate - M & M'S?, SNICKERS?, DOVE?, GALAXY?, MARS?, MILKY WAY? and TWIX?; Petcare - PEDIGREE?, WHISKAS?, SHEBA?, CESAR? and ROYAL CANIN?; Wrigley - ORBIT?, EXTRA?, STARBURST?, DOUBLEMINT? and SKITTLES?; Food - UNCLE BEN'S?, DOLMIO?, EBLY?, MASTERFOODS? and SEEDS OF CHANGE?; Drinks - ALTERRA COFFEE ROASTERS?, THE BRIGHT TEA CO.?, KLIX? and FLAVIA?; Symbioscience - SERAMIS?, CIRKU? and COCOAVIA?. For more information, please visit www.mars.com. About Habitat for Humanity International Habitat for Humanity International is a global nonprofit Christian housing organization that seeks to bring God's love into action by bringing people together to build homes, communities and hope. Since 1976, Habitat has served more than 600,000 families by welcoming people of all races, religions and nationalities to construct, rehabilitate or preserve homes; by advocating for fair and just housing policies; and by providing training and access to resources to help families improve their shelter conditions. For more information, to donate, or to volunteer, please visit www.habitat.org, or follow us at www.facebook.com/habitat or at www.twitter.com/habitat_org or join Habitat's blog community at www.habitat.org/blog. About Habitat for Humanity of Charlotte Seeking to put God's love into action, Habitat for Humanity of Charlotte brings people together to build homes, communities and hope. Since 1983, Habitat Charlotte has served more than 1,200 families. Visit www.habitatcharlotte.org or call 704-376-2054 for more information. Your comment has more than 5000 characters. Please delete part of it before submitting. you are just one step away. Please check your email inbox and copy-paste \"Security code\" into below Text Box Click the button below to continue. You might need to disable your popup blocker to sign in. Click the button below to continue. You're using Internet Explorer to browse Justmeans right now. Justmeans will work better for you if you upgrade to the new version, or switch to another Web browser. A list of the most popular modern web browsers can be found below. If you have to use Internet Explorer because you are at work, we recommend version 8."}, {"articleID": "2016050217_00093057_W", "names": {"James Taylor": ["Q11075364", "Q1168698", "Q16561148", "Q17092246", "Q17140631", "Q18218071", "Q20631287", "Q21064423", "Q21996614", "Q23618920", "Q24005465", "Q25190090", "Q2536187", "Q28465652", "Q30362443", "Q310300", "Q39073622", "Q42322786", "Q43910676", "Q56885192", "Q58492697", "Q59162274", "Q6128460", "Q6128651", "Q6141741", "Q6144041", "Q6144043", "Q6144049", "Q6144051", "Q6144058"]}, "date": "2016-05-02", "url": "http://supersport.com/cricket/more-cricket/news/160502/Thought_I_was_dying_says_Taylor", "content": "Thought I was dying, says <mark>Taylor</mark> 02 May 2016, 18:59 Tweet Former England batsman <mark>James Taylor</mark> said he thought he was going to die during a pre-season match for Nottinghamshire last month as a heart condition that forced his early retirement from cricket flared up. \"My heart was going wild at a funny rhythm. It was probably only about four degrees, really cold, and I got inside. Sweat from me is hitting the ground hard so I knew I wasn't right,\" he said of the match against Cambridge University. \"That's when I thought I was going to die.\" <mark>Taylor</mark>, 26, thought he was suffering from a viral infection but scans showed he had a heart condition known as Arrhythmogenic Right Ventricular Arrhythmia (ARVC), the same condition that almost killed former Bolton Wanderers footballer Fabrice Muamba. The middle-order batsman played seven tests and 27 one-day internationals for England and captained the side against Ireland in May last year. Speaking to the BBC, <mark>Taylor</mark> said he had no inkling of the heart complaint as the new season loomed and was \"in hysterics\" when doctors first told him he would have to retire. \"I was feeling good as gold, in fact my lead up to this season was probably the best I've ever felt, mentally and technically,\" he said. \"When the doctor told me I was in hysterics at first.\" But then he told me that the majority of these cases are only found out in the post-mortem. I almost stopped crying at that point and felt more lucky that I'm in a position to tell this story now, \"added <mark>Taylor</mark>."}]