[{"date": "2013-06-19", "url": "http://www.wgem.com/story/22628652/award-winning-journalist-michael-hastings-dies", "content": "Award-winning journalist <mark>Michael Hastings</mark> dies (AP Photo/Blue Rider Press/Penguin). This undated photo provided by Blue Rider Press/Penguin shows award-winning journalist and war correspondent <mark>Michael Hastings</mark>. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:24\" > Zimmerman jury selection moving into a new phase Attorneys in the George Zimmerman murder trial are set for the next phase of jury selection. Prosecutors and defense attorneys in the George Zimmerman murder trial are about to move into the next phase of jury selection. meta itemprop = \"datePublished\" content = \"2013-06-19 07:30:41\" > Award-winning journalist <mark>Michael Hastings</mark> dies <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:41\" > FBI hunt for Jimmy Hoffa remains entering 3rd day FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. FBI agents plan a third day of digging Wednesday in suburban Detroit for the remains of former Teamsters union leader Jimmy Hoffa, who disappeared 38 years ago. meta itemprop = \"datePublished\" content = \"2013-06-19 07:20:21\" > W. Va. mine safety lab creates disasters to train Alpha Natural Resources is unveiling a $23 million training complex for coal miners that combines the world's best technology in a single West Virginia complex - and may save lives. Orange flames lick at the roof of the coal mine, heat building and visibility dropping as smoke begins to fill the underground passageway. Then, with the push of a few buttons on a hand-held remote, the flames flicker out,...meta itemprop = \"datePublished\" content = \"2013-06-19 07:10:20\" > Baked Alaska: Unusual heat wave hits 49th state Baked Alaska: Unusual heat wave hits 49th state A heat wave hitting Alaska doesn't rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the weather feels like a stifling oven - or a tropical paradise. A heat wave hitting Alaska may not rival the blazing heat of Phoenix or Las Vegas, but to residents of the 49th state, the days of hot weather feel like a stifling oven - or a tropical paradise. meta itemprop = \"datePublished\" content = \"2013-06-19 06:50:19\" > Ohio woman accuses 3 of holding her captive Authorities say a woman was held captive by three people who forced her to do housework, raided her bank account and menaced her with snakes. A woman told authorities she was held captive for more than a year by three people who forced her to do housework, raided her bank account and menaced her with snakes and pit bulls. meta itemprop = \"datePublished\" content = \"2013-06-19 06:40:17\" > Ex-Bulger cohort to spend 3rd day on witness stand Ex-Bulger cohort to spend 3rd day on witness stand A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. A former enforcer for James \"Whitey\" Bulger is expected to face more tough cross-examination by Bulger's lawyers when he returns to the witness stand for a third day. meta itemprop = \"datePublished\" content = \"2013-06-18 21:49:57\" > Rural lawmakers push for farm bill votes in House Rural lawmakers push for farm bill votes in House Farm-state lawmakers are scrambling to win bipartisan votes for a five year, half-trillion dollar farm bill on the House floor this week. Farm-state lawmakers are scrambling to win bipartisan support for a five-year, half-trillion-dollar farm bill on the House floor this week. meta itemprop = \"datePublished\" content = \"2013-06-18 11:29:33\" > NSA director says plot against Wall Street foiled NSA director says plot against Wall Street foiled The chairman of the House Intelligence Committee says it appears the much-criticized national electronic surveillance program foiled \"dozens\" of terrorist plots. The U.S. foiled a plot to bomb the New York Stock Exchange because of the sweeping surveillance programs at the heart of a debate over national security and personal privacy, officials said Tuesday at a rare open hearing on...meta itemprop = \"datePublished\" content = \"2013-06-19 04:10:11\" > Gov' t report: Smooth launch unsure for health law Gov' t report: Smooth launch unsure for health law There's no guarantee that President Barack Obama's health care law will launch smoothly and on time, congressional investigators say in the first in-depth independent look at its progress. Seeking a Syria consensus despite US-Russia divide At the G-8, leaders seek a Syria consensus despite a US-Russia divide To ease shortage of organs, grow them in a lab? As more patients get lab-grown body parts, scientists face challenge of making complex organs Some evacuations lifted in destructive Colo. fire With flames in check, some evacuation orders lifted in devastating Colo. wildfire 2 found dead in area burned by out-of-control Colo. wildfire that destroyed 379 homes Colorado wildfire destroys at least 360 homes Out-of-control Colorado wildfire destroys at least 360 homes, surpasses last year's record Defense hints at no trial in Ohio kidnap-rape case Defense hints at plea to avoid trial for Cleveland man charged with kidnapping, raping 3 women US spy programs raise ire both home and abroad No plans to end broad US surveillance despite sharp backlash from foreign allies, Congress Man kills 6 in Calif. before police shoot him dead Gunman kills 6 in Santa Monica before he reaches college library and is shot dead by police Not quite the ER: Boston hospital cleaning mummy Boston hospital that 2,500-year-old mummy calls home gives its patient a good cleaning Monumental phone-records monitoring is laid bare Government sweep of millions of citizens' phone records ignites fresh debate over surveillance Associated Press LOS ANGELES (AP) - <mark>Michael Hastings</mark>, the war correspondent whose unflinching reporting from Afghanistan led to the resignation of a top U.S. army general, has died in a car accident in Los Angeles, according to his employer and family. <mark>Hastings</mark>, who was 33, was described by many of his colleagues as an unfailingly bright and hard-charging reporter who wrote stories that mattered. Most recently, he wrote about politics for the news website BuzzFeed, where the top editor said colleagues were devastated by the loss. \"<mark>Michael</mark> was a great, fearless journalist with an incredible instinct for the story, and a gift for finding ways to make his readers care about anything he covered from wars to politicians,\" said <mark>Ben Smith</mark>, BuzzFeed's editor-in-chief. <mark>Smith</mark> said he learned of the death from a family member. Authorities said there was a car crash early Tuesday in the Hancock Park neighborhood of Los Angeles that killed a man, but coroner's officials could not confirm whether <mark>Hastings</mark> was the victim. <mark>Hastings</mark> won a 2010 George Polk Award for magazine reporting for his Rolling Stone cover story \"The Runaway General .\" His story was credited with ending Gen. Stanley McChrystal's career after it revealed the military's candid criticisms of the Obama administration. <mark>Hastings</mark> quoted McChrystal and his aides mocking Obama administration officials, including Vice President Joe Biden, over their war policies. At a Pentagon ceremony for his subsequent retirement in 2010, McChrystal made light of the episode in his farewell address. The four-star general warned his comrades in arms, \"I have stories on all of you, photos of many, and I know a Rolling Stone reporter .\" When he died, <mark>Hastings</mark> was a contributing editor at Rolling Stone, where Managing Editor Will Dana was quoted Tuesday saying <mark>Hastings</mark> exuded \"a certain kind of electricity\" that exists in great reporters whose stories burn to be told. \"I'm sad that I'll never get to publish all the great stories that he was going to write, and sad that he won't be stopping by my office for any more short visits which would stretch for two or three completely engrossing hours,\" Dana said. <mark>Hastings</mark> was also an author of books about the wars. \"The Operators: The Wild and Terrifying Inside Story of America's War in Afghanistan\" was published late last year and details shocking exploits of the military overseas. In 2010, with the publication of \"I Lost My Love in Baghdad,\" <mark>Hastings</mark> told the story of being a young war correspondent whose girlfriend died in Iraq. \"<mark>Michael Hastings</mark>' death cuts short a life dedicated to speaking truth to power. He believed that journalists must be more than bystanders; he was a truthteller, a charming provocateur and a relentless seeker of decency in a nasty world,\" said <mark>David Rosenthal</mark>, president of The Blue Rider Press, which published \"The Operators .\" In the summer 2013 issue of Vermont Life magazine, <mark>Hastings</mark> was quoted telling an audience at the Burlington Book Festival that he doesn't believe in objectivity in journalism. \"What I try to do is be intellectually honest in my writing,\" he said. <mark>Hastings</mark>' family moved to Vermont when he was 16, a state he told the magazine was his \"spiritual home .\" According to the magazine, he lived in New York with his wife. All content? Copyright 2000 - 2013 WorldNow and WGEM. All Rights Reserved.", "articleID": "2013061914_00064939_W", "names": {"David Rosenthal": ["Q2714150", "Q5236958", "Q57056589"], "Michael Hastings": ["Q21166753", "Q44706", "Q56087978", "Q6830997", "Q6830998"]}}, {"date": "2013-06-20", "url": "http://www.defence.pk/forums/europe-russia/259390-uk-warns-scottish-defence-industries-loss-privileged-access-us-m.html", "content": "Join Date Oct 2012 Location Usa UK warns Scottish defence industries of loss of \"privileged' access to US m UK warns Scottish defence industries of loss of\" privileged' access to US market By Guy Anderson 6/17/2013 The UK government has reiterated warnings of the consequences for Scotland's defences sector should Edinburgh choose independence in 2014, arguing that military suppliers north of the English border would lose assured access to the UK defence market and \"a privileged level of access to the US market\". The comments came in an official statement released on 14 June in a formal response to the House of Commons Scottish Affairs Committee report - published earlier this year - on the implications of Scottish independence on jobs in the defence sector. Scotland will hold a referendum in 2014 on the issue of independence from the United Kingdom. The views of the government were consistent with those of the select committee. Committee chairman <mark>Ian Davidson</mark> MP said: \"In the evidence it took [relating to the report] the committee was unable to identify any defence supplier or product which would benefit from separation, but did find a large number that would suffer .\" Scotland hosts the facilities of a series of leading defence contractors, including Finmeccanica, Thales, Babcock, and BAE Systems. UK warns Scottish defence industries of loss of \"privileged' access to US market You may not post new threads You may not post replies You may not post attachments You may not edit your posts", "articleID": "2013062020_00009717_W", "names": {"Ian Davidson": ["Q10411614", "Q16195495", "Q296755", "Q56421067", "Q5981374", "Q5981377", "Q5981380"]}}, {"date": "2013-06-20", "url": "http://www.rollingstone.com/music/news/smith-westerns-mellow-out-before-blasting-off-20130620", "content": "Cullen Omori, Max Kakacek and Cameron Omori of Smith Westerns (from left) Dan Hyman June 20, 2013 3:20 PM ET Cullen Omori has been stoned all day. A busy night lies ahead: The Smith Westerns singer is hoping to whip up a killer gumbo and then, if all goes according to plan, stock his newly minted \"smoking room\" with the early-Nineties action figures he's recently become obsessed with. Right now, though, he's ready to spark up again. \"Go easy - this stuff is pretty heavy,\" he warns, sliding a mini-glass bong snugly packed with choice buds across a table in the living room of his messy, college-style Chicago walk-up apartment. Omori's pet fish, Little Pig, looks on from his murky tank. The 23-year-old frontman and his bandmates - brother Cameron Omori, 21, on bass, and longtime friend Max Kakacek, 22, on guitar - finished recording their third studio album, Soft Will, last October. Save for a pair of Coachella gigs in April, life for the three longhaired musicians has resembled one long, hazy weed nap since then. The daydream ends next month, when they head out on a nationwide tour behind the new album. - The Daily Mail and Perez Hilton are two of his favorites - and messed around with a guitar that he recently outfitted with a marijuana-themed pick guard. Cameron overslept, the result of an up - 'til -3:00 a.m. bender playing Candy Crush on his iPhone. Kakacek, the most put-together of the three (if only by process of elimination), had already met a friend for coffee and a chicken salad sandwich by mid-afternoon; he even found time to stop by the bank to withdraw some money for the early-Eighties Jeep Wrangler he wants to buy. Playing in Smith Westerns is the only job these guys have ever known. Their Nuggets - inspired 2009 debut, recorded while all three were in high school, caught the attention of a handful of influential music blogs; their slightly glossier follow-up, 2011's After a year of touring behind Dye It Blonde, including high-profile opening gigs for Arctic Monkeys, Smith Westerns returned home to Chicago in early 2012. Cullen moved into an apartment with Kakacek in the hipster-friendly Logan Square neighborhood; he later moved down the streeet to his current place, where he lives with his girlfriend. Cameron is still figuring out his plans, so he moved back in with his and Cullen's parents in the northern Chicago neighborhood of Sauganash. \"It was the first time since 2009 that we had this huge gap of time,\" Cullen recalls of their life after the Dye It Blonde tour. After an enjoyable stretch spent doing nothing, the trio got back to writing new songs; last summer, they headed out to Sonic Ranch Studios in El Paso, Texas, to record Yeah Yeah Yeahs, TV On The Radio). Adds Cullen, \"It was nice to get out and go to this weird, isolated place .\" On most days, the trio holed up in the studio from mid-afternoon until the early morning hours. New drummer Julien Ehrlich, formerly of Unknown Mortal Orchestra, joined them for the sessions - the first time they'd recorded with a full band. Cameron recalls the sessions' loose, freewheeling vibe: \"I feel like Dye It Blonde was the [album] where there was a little more pressure. This one was a lot more fun .\" Big-Star - style power-pop with more complex arrangements and lush orchestral melodies. Cullen says he looks to the To read the new issue of Rolling Stone <mark>Jerry Butler</mark> | 1960 A lightly swinging Latin-influenced, almost cha-cha groove and close harmonies decorated <mark>Jerry Butler</mark>'s early soul hit \"He Will Break Your Heart,\" delivering a stately warning that his rival would never love his girl like he did. The melody came to <mark>Butler</mark> as he was driving on the highway from Atlantic City, New Jersey, to Philadelphia with Curtis Mayfield, and as <mark>Butler</mark> told", "articleID": "2013062103_00002931_W", "names": {"Jerry Butler": ["Q1533288", "Q1565628", "Q372820", "Q6183339"]}}, {"date": "2013-06-23", "url": "http://thestar.com.my/lifestyle/story.asp?file=/2013/6/23/lifearts/13121425&sec=lifearts", "content": "Sunday June 23, 2013 Endlessly inventive By KATE CONNOLLY Anish Kapoor in front of his installation, Symphony For A Beloved Sun, which involves conveyor belts depositing red wax on the floor of Berlin's Martin Gropius Bau exhibition hall. One of the world's most important contemporary artists has a new exhibition in Berlin that the Germans are hoping the whole world will visit. SITTING in a Berlin gallery over a cup of tea, Anish Kapoor is clearly at home in a city that is staging one of his largest ever shows. The British-based artist, 59, says the exhibition, entitled Kapoor In Berlin, is the best show he has yet put on, which may have much to do with the fact that he feels Germany demonstrates a huge degree of respect for the arts - in stark contrast to Britain and much of the rest of the world. \"Germans have a rather healthy respect for the arts and artists,\" he says, adding that \"in Germany, it seems that the intellectual and aesthetic life are to be celebrated and are seen as part of a real and good education, whereas in Britain, traditionally - certainly since the Enlightenment (in the 17th and 18th centuries) - we've been afraid of anything intellectual, aesthetic, visual .\" One of the most highly regarded sculptors in the world, Kapoor is keeping much of the vast show, which covers more than 3,000 sqm at the Martin-Gropius-Bau exhibition hall, under wraps. But he does reveal that around half the works were created especially for the show. It was, he explains, his concerted effort to stop it from becoming a retrospective, the idea of which he is keen to resist as long as he is alive and working. \"I don't see the reason to be doing a retrospective,\" he says. \"Let somebody else do a retrospective for me. There doesn't seem any reason to dwell on what's been done. Rather, let's build on it and try and do something else. I'm trying to push my practice out there and to see,\" Can I do that? Will it go there?' \"A good half of the show is new, and that's always a risk. But that's the sort of idiot I am .\" Kapoor In Berlin is a culmination of the artist's huge body of work of the past three decades, an extravaganza of colour, shapes and textures that its British curator, <mark>Norman Rosenthal</mark>, has called an \"endlessly inventive theatre of sculpture\". As Kapoor chats before the opening, around him bustling workers in hard hats glide up and down on cranes, spray pigment on to walls, and remove plastic covers from sculptures as the show takes shape. Later, we are given a sneak preview of the works, including the centrepiece of the show. Emerging from holes in walls and a trapdoor in the floor, conveyor belts rise skywards, carrying big rectangular blocks of viscous, wine-red wax. As the wax moves up, it produces a squelching sound before falling off the end of the belt and landing with a satisfying splat on the linoleum floor. Overseen by a huge crimson sphere suspended from a metal frame, Symphony For A Beloved Sun is a new creation that fills the exhibition hall's main atrium. Along with the other structures, it reveals the potential the show has to beguile the public, something Kapoor's audience has long come to expect of him. There is everything from a deflated whale, whose maroon mass spills across three rooms; to warty, cave-like innards fashioned from synthetic resin; huge geometrically fragmented mirrors; twisted stainless steel pillars; and a gigantic, slowly rotating wax bell. There is even an old British Telecom generator. Crafted from sandstone, alabaster, Kilkenny limestone and fibreglass are also the protuberances and orifices, mountains and tomb-like structures that have become Kapoor trademarks, including the subtle bulge in the wall called When I'm Pregnant, all of which reflect the long and complex history of Britain's most celebrated sculptor in a show he says is \"private and public in a very curious, sometimes uncomfortable mix\". Exhibiting at the Martin-Gropius-Bau hall, a neo-Renaissance pile in the centre of Berlin, is both a challenge and an inspiration for Kapoor, who has had to deal not just with its complicated, decorative interior, of late-19th-century ornate pillars and mosaics but also with the history that envelops the building: the Berlin Wall and the SS headquarters (of the Nazi secret police during WWII) are literally squeezed up against it, visible from the gallery's windows; and he makes deliberate references to them in his works. \"It's a building with a curious, difficult history that is inexorably linked to the history of Berlin,\" says Kapoor. \"That's very potent. You can't make a show here without some reference to all of that. And it certainly makes a show here so much more interesting .\" Symphony For A Beloved Sun is a nod to one of Kapoor's heroes, the late German sculptor Joseph Beuys, who exhibited in the same atrium space shortly after the building's postwar restoration, in 1982. It also strongly alludes to the industrialised, bloody mass murders of the Nazi era, according to <mark>Rosenthal</mark>. German critics have been quick to make the same connection to the favourite among Kapoor's fan base, Shooting Into The Corner - which has been given a room of its own - in which a cannon fires round pellets of wax into the far corner, staining the walls a blood red. \"We're pleased to say the wax stains can be removed when smeared with margarine,\" says the Martin-Gropius-Bau's director, Gereon Sievernich, highlighting just one of the many challenges Kapoor's works are posing as he inspects a show that is still very much under construction five days ahead of its opening. Other practical headaches have included the transportation, by a convoy of lorries, of the huge pieces from Kapoor's London studio. Some had to be dismantled before they could be brought into the hall; others were heaved in on horizontal cranes after window frames had been removed. For Kapoor, the arrival of his works in the space for which they were conceived over a period of months, during which their creation dominated his life, brings with it a huge sense of achievement. \"Getting things out of the studio is great, very exciting,\" he says. \"It's only when they are in the real world that they have a life of their own .\" One of his own favourites among the new works - which he describes as a \"mad, crazy idea - is the deflated PVC whale, called Death Of A Leviathan. It takes up an entire side of the building, and reinforces Kapoor's sense of responsibility towards tackling major societal issues .\" It's a big deflated skin, like a huge dead whale, a Hobbesian reference to the state being a kind of Leviathan beast that gives its control to the individual, \"he says .\" Death Of The Leviathan may imply the kind of death or deflation of the state, this present condition we seem to be in all over the world where the individual has to take responsibility for the things that the state once took responsibility for. \"- Guardian News & Media> Kapoor In Berlin is on at the Martin-Gropius-Bau exhibition hall, Berlin, until Nov 24, 2013. For more information, go to tinyurl.com/m3md8k8.", "articleID": "2013062306_00005794_W", "names": {"Norman Rosenthal": ["Q1702411", "Q3343773"]}}, {"date": "2013-06-25", "url": "http://blogs.riverfronttimes.com/dailyrft/2013/06/busch_stadium_cardinals_christian_symbols.php", "content": "Christian symbols on the mound at Busch? A few weeks ago, Daily RFT got an e-mail from a reader and lifelong Cardinals fan who, while watching the games this season, had noticed something he hadn't seen before on the pitcher's mound. Right by the spikes, etched into the dirt, there appeared to be a Christian cross and fish symbol. Michael Vines, who was born and raised in St. Louis, tells us he thought this was unusual and decided to look at some past footage from this season--and noticed that these symbols were on the mound on many different occasions. \"That's when I realized they were doing it all year,\" he says. \"I hadn't noticed. I was shocked I hadn't noticed .\" Vines sent us a handful of images from various games showing the cross and what appears to be the fish symbol--both of which he argues are not appropriate for a baseball stadium. Here's another photo. More evidence below. When Daily RFT first mentioned it to a Cardinals spokesman earlier this month, he told us he personally had not noticed or heard anything about it, but said he would try to look into it. We haven't gotten any additional information since. Worst Cardinals Fans Ever: Homophobic, Racist, Offensive Tweets Catalogued Sports Illustrated Cover Draws On 1968 Lou Brock, Roger Maris, <mark>Bob Gibson</mark> Photo Ballpark Village: Cardinals Move Forward With Construction, Release Renderings Post-Dispatch had a very short item in a Sunday article titled \"MOUND TRIBUTE\" that references the cross: Several times this season the Cardinals starter has gone to the mound to find subtle symbols scratched on its backside, near the rubber spikes used to scrub off dirt. \"They've been there every time for me,\" ace <mark>Adam Wainwright</mark> said. To the left of the spikes is a Christian cross and just below it is a looped figure. It's a \"6\" for Stan Musial, the Cardinals great who died in January. A member of the grounds crew puts the symbols on the mound for most home games. The Cardinals have been one of the few teams not to adopt the trend of stenciling a team logo on the backside of the mound, where television cameras see it for every pitch. Vines had apparently also alerted the P-D to these symbols and in response to the Goold piece, argues it's pretty clear that it's not a \"6\" but rather the fish symbol. And over the weekend, he sent Daily RFT and the P-D a follow-up letter, which is on view below, arguing that it's wrong for the Cardinals to display \"religious iconography on the infield at Busch Stadium, a place of hallowed ground not just for Christians, but for Cardinal fans of all religions, including none at all .\" His argument is that it's not appropriate given that the team owners are the beneficiaries of ticket and real estate tax abatements; he says that though the team and stadium are privately owned, they are \"civic institutions .\" We've printed the full letter below. When we first spoke with Vines on the phone earlier this month, he told us that his gripe is not with the fact that they are Christian images, but that he belives there shouldn't be religious symbols of any kind on a baseball field. \"How come nobody's mentioning this?\" he says. \"It's totally inappropriate .\" He argues that there are \"plenty of Major League Baseball players who don't want that in their face...There may be Christian Cardinals who don't like it .\" Vines is Jewish but says he would not want a Star of David on the mound either. \"You don't have to be Jewish to be offended,\" says Vines, who now lives in New York City, but says he never misses a Cardinals game. Some will argue the symbols are fairly innocuous, given that they've gone largely unnoticed and even disappear as a game progresses. But Vines tells us that it's poor judgment to have these symbols on the field at all. \"Just because you have the right to do something doesn't mean you should do it,\" he says. StLToday.com (June 23, 2013) about a Christian cross etched into the dirt of the pitcher's mound at Busch Stadium. It was I who called attention to the cross, along with what I took to be the image of something commonly known as the \"Jesus fish\" also scratched into the mound. Goold says that the latter is the number \"6\" , a tribute to Stan Musial. If so, it's a very oddly shaped \"6\" (see attached photo) and, considering its proximity to the cross, would seem to be serving a dual purpose. Goold lead his piece with the headline \"Mound Tribute,\" as if there were nothing inappropriate about displaying religious iconography on the infield at Busch Stadium, a place of hallowed ground not just for Christians, but for Cardinal fans of all religions, including none at all. http: //bit.ly/1caTLMW), team owners are the beneficiaries of ticket and real estate tax abatements that will save them $143 million in payments to the city over 25 years, as well as $54 million in state incentives and a $45 million county loan.", "articleID": "2013062520_00038022_W", "names": {"Adam Wainwright": ["Q1185516", "Q57305474"], "Bob Gibson": ["Q1131535", "Q17002469", "Q4932531", "Q4932533"]}}, {"date": "2013-07-03", "url": "http://journalrecord.com/2013/07/03/msc-plan-b-for-moore-real-estate/", "content": "Powered by Bookmarkify? MOORE - Even though the Moore City Council tabled three ordinances that would have changed building codes and required storm shelters in single-family and multifamily dwellings, Mayor <mark>Glenn Lewis</mark> said the effort will continue. The ordinances, <mark>Lewis</mark> said, will be back. \"We're going to keep working,\" he said. \"We've formed a committee and we're taking input from several groups .\" The new rules didn't fly, <mark>Lewis</mark> said, because several members of the City Council felt the ordinances were rushed. He said the council wanted to seek advice from municipal governments who had experienced similar disasters and from builders themselves. \"We're borrowing from Joplin,\" <mark>Lewis</mark> said. In Joplin, an EF5 tornado killed 161 people, destroyed approximately 3,500 homes and damaged another 4,000 homes. After the storm, city officials stopped short of requiring storm shelters in residential and multi-family dwellings, but the city did change its building code to incorporate new designs that could better protect residents from tornadoes. \"We made changes to the code that could help minimize the damage,\" said Sam Anslem, Joplin's assistant city manager. Anslem said some of those changes included requiring more anchor bolts every four feet instead of every six feet and requiring the use of hurricane clips, which helps tie the room to the stud walls. \"The goal is to strengthen the envelope of the house,\" he said. \"The hurricane clips protect the roof from coming off and ending up in your neighbor's home .\" Anslem said the clips sell for $1 to $2. In addition to the code changes, Anslem said residents of the city have been strongly encouraged to add a storm cellar or safe room. With about 84 percent of the destroyed and damaged homes now under construction permit, Anslem said the call for storm shelter is resonating with residents. He estimated about 20 to 25 percent of the new homes would have some sort of safe room. \"The market demand has given us an indicator that more and more people are adding them,\" he said. Still even while Moore officials and their counterparts in Joplin wrestle with proposals to make home and multi-family dwellings stronger, home builders worry that new regulations could price some first time home buyers out of the market. \"With the low interest rates, adding a shelter isn't that big of a deal,\" said Mark Livingston, vice president of the Central Oklahoma Home Builders Association. \"But the fact is if interest rates rise, and they will, the affordability will become more of an issue .\" Right now, he said, the cost of installing a storm shelter in a new home is between $2,700 and $3,700. But should a shelter be required by code Livingston predicted the cost would go up and could delay completion of the house. \"Right now, with so many shelters being built, we're being told that it would be around January or February before a shelter could be installed,\" he said. A better way to make homes safer, Livingston said, is to let the customer and the market place drive the idea. \"There isn't a home builder in Oklahoma who won't put in a storm shelter if it's requested,\" he said. \"The deal is people don't want them. They would rather have amenities. They pick a granite countertop over a storm shelter .\" <mark>Lewis</mark> wants to see that attitude change. After the City Council meeting, <mark>Lewis</mark> said city officials formed a working group that includes representatives from the homebuilding industries, policy experts, city officials and others to develop an ordinance that would better protect residents but reflect concerns about costs, too. \"I think more people are conscious of the need for a shelter,\" he said. \"I understand it's all about balancing economics and safety. But we need to plan for the future. We need to make our communities safer and we to take advantages of the resources we have .\" And <mark>Lewis</mark>, who has served as mayor during all three of Moore's EF-5 tornadoes, said he expects city's building code to change. \"Those ordinances will be back,\" he said. \"And I'm sure they will be different from what they were. We want to get everyone at the table and come up with something that works. I want to help keep people safe .\" Powered by Bookmarkify?", "articleID": "2013070405_00078616_W", "names": {"Glenn Lewis": ["Q38255975", "Q5568951"]}}, {"date": "2013-07-04", "url": "http://au.news.yahoo.com/a/-/sport/17875671/gallen-woes-could-help-sharks-flanagan/", "content": "Gallen woes could help Sharks: Flanagan Steve Jancetic, AAP July 5, 2013, 5:04 am Cronulla coach Shane Flanagan believes Paul Gallen's injury-plagued season could translate into the secret ingredient that catapults the Sharks into genuine NRL premiership contenders. For so long the workhorse which the Sharks have lent on to carry them into a finals berth, Cronulla have this year been forced to get by largely without their inspirational skipper due to a litany of injuries and representative commitments. Currently nursing a torn ligament in his foot, the best case scenario is for Gallen to return to the Sharks line-up for the round 19 encounter against Sydney Roosters, three days after State of Origin III. Flanagan just wants the Sharks - sixth heading into Friday night's home game against Wests Tigers - to keep their head above water until their captain returns, believing a fresh Gallen could make all the difference come September. \"The way I see it, after this injury and he gets through Origin III, Gal will be fresh mentally because he hasn't played a lot of football for us,\" Flanagan told AAP. \"He's only played eight out of 16 games, he's only played half a season for us .\" It's going to be a really good opportunity for Gal to be really fresh and lead us into the semis. \"Never was this more evident than last year, when both Gallen and playmaker Todd Carney - who had also endured an Origin campaign - limped into the finals. Gallen was little more than a punching bag for fired-up Canberra second-rower Josh Papalli - the Sharks leader with the will but not the way to return serve as Cronulla meekly bowed out of the finals. It's why Flanagan went in search of some more class to put alongside Gallen and Carney - with the likes of Penrith duo Luke Lewis and <mark>Michael Gordon</mark> recruited to boost a star-deprived roster. And it is also why Flanagan is happy to take some pain in June and July by having his stars engaged with Origin if it translates to success in the big end of season games .\" We're heading in the right direction in the number of rep players we have, \"Flanagan said,\" The more rep players you have, unfortunately you've got to deal with it during that rep period.", "articleID": "2013070502_00051507_W", "names": {"Michael Gordon": ["Q2779402", "Q3308220", "Q47542706", "Q651955", "Q6830684", "Q6831376"]}}, {"date": "2013-07-05", "url": "http://au.news.yahoo.com/latest/a/-/article/17876411/rudd-apology-over-insulation-deaths/", "content": "Rudd apology over insulation deaths Prime Minister Kevin Rudd is prepared to meet and apologise to parents of tradesmen killed installing home insulation batts under a federal government scheme. But the opposition says Mr Rudd must go further and release all documents relating to advice to him about problems with the scheme, set up during his first term as prime minister. The issue re-emerged just over a week into Mr Rudd's return to the leadership after Queensland coroner <mark>Michael Barnes</mark> handed down a damning report into the deaths of three men. Mr <mark>Barnes</mark> found the rushed rollout of the scheme was a significant factor in the deaths of installers Matthew Fuller, Rueben <mark>Barnes</mark> and Mitchell Sweeney in Queensland. A fourth man, <mark>Marcus Wilson</mark>, died in November 2009 from hypothermia complications with installing batts in a Sydney house. Mr Rudd, who rolled out the scheme to create jobs during the global financial crisis, issued a public apology to the men's families on Thursday during a trip to Jakarta. On Friday, a spokesman for Mr Rudd said the prime minister would meet with any of the parents who wished to meet him in private. \"These events are tragic - and despite what the opposition might believe, they are not some opportunity for a headline .\" Lawyer Peter Koutsoukis, representing Mr Sweeney's family, told AAP they would appreciate a face-to-face apology, even though \"no amount of apologies can bring Mitchell back\". Opposition Leader <mark>Tony Abbott</mark> said an apology was an important \"first step\". But Mr Rudd should also release all 10 warnings he personally received between August 2009 and March 2010 and any others he was aware of relating to the scheme, which also has been linked to 250 fires. Four of the letters were from the then minister in charge of the program, Peter Garrett, who is quitting parliament at the next election. A cabinet committee is known to have discussed the scheme's safety issues in October 2009 and February 2010. \"I think he's got a bit of explaining to do,\" Mr <mark>Abbott</mark> said. Mr Rudd's spokesman said Mr <mark>Abbott</mark> was calling for release of information already made public, except for confidential cabinet documents. The victims' families are considering claims against the state and federal governments. Mr Albanese said the pace at which the program had been rolled out allowed dodgy operators to take advantage. \"What these findings highlight is that because of the pace of the scheme, in some places unscrupulous operators didn't give staff appropriate health and safety training, and that has led to these consequences,\" he said. Attorney-General Mark Dreyfus said the deaths were a tragedy and the government would look closely at the coroner's report. Mr Garrett apologised for the bungled program and defended his own actions in the matter, but accused Mr <mark>Abbott</mark> of playing politics. \"Of course I'm terribly sorry about what happened,\" Mr Garrett told reporters on Friday. The former Midnight Oil frontman said two independent reviews showed he had acted appropriately during the home insulation roll-out. \"At all times I've served the country to the best of my ability,\" Mr Garrett said. \"It's on the public record...you can come to your own conclusions about those matters. British court to hand down Turkcell ownership verdict on July 9", "articleID": "2013070516_00040331_W", "names": {"Marcus Wilson": ["Q18619128", "Q6758543"]}}]