[{"articleID": "2019061816_00408990_W", "names": {"Sir John": ["Q28124344", "Q45996744"]}, "date": "2019-06-18", "url": "http://www.ledburyreporter.co.uk/news/national/17714422.hyponatraemia-whistleblower-was-failed-inquiry-says/", "content": "Hyponatraemia whistleblower was failed, inquiry says By Press Association 2019 <mark>Sir John</mark> O'Hara 0 comment The wrong conclusions were reached following an investigation into how a whistleblower's hyponatraemia concerns were handled by officials, an inquiry said. Chairman <mark>Sir John</mark> O’Hara QC scrutinised the deaths of five children from the condition last year and heavily criticised a \"cover-up\" by some consultants, accusing some doctors of behaving \"inadequately, evasively, dishonestly and ineptly\". On Tuesday he published an update on the adequacy of searches in 2004 of what were then Western Health Board properties for documents relevant to the probe. <mark>Sir John</mark> identified a failure at leadership level after the whistleblower raised concerns in the public interest. He added: \"However, there was a serious failure to address these concerns, whether to investigate them properly or judge them fairly .\" The wrong conclusions were reached. \"This was a failure at leadership level within the healthcare service .\" Not only was the whistleblower failed but so too was the service. \"He said confidence in the critically important systems of whistleblowing depended upon fairness and professionalism .\" These were absent. It is unsettling to be compelled to this conclusion given the many reassurances urged upon me by senior Health and Social Care Board officials. \"He added:\" Whilst it is for others to determine why this particular whistleblower's concerns were not accorded proper response, I reiterate my recommendation that the highest priority be accorded the development and improvement of leadership skills within the healthcare service. \"The brothers of Raychel Ferguson, who died of hyponatraemia in 2001, (from left) Stephen, Jamie and Jason (Brian Lawless/PA) The High Court judge found three deaths from hyponatraemia, a lack of sodium in the blood, were avoidable and the youngsters received unacceptable care during the administration of intravenous fluids. His update said an internal investigation by the Health and Social Care Board ought to have concluded that:--There were gaps in the search for documents in 2004 .--The senior civil servant in the department of health was misled in 2004 as to the completeness of the searches undertaken within the board, for documentation relating to the deaths of Lucy Crawford and Raychel Ferguson .--There was a failure by the health and social care board in 2013 to bring relevant information to the attention of the inquiry, leaving it misinformed. The update said:\" That the Western Health and Social Services Board should have failed to conduct appropriate searches, and misled as to the extent of those searches, is profoundly unsatisfactory and is to be criticised. \"The Health and Social Care Board welcomed the fact that no amendment to the\" essential findings \"of <mark>Sir John</mark>'s report as published in January 2018 is required. It acknowledged issues raised in the summary report and accepted there was scope for learning .\" It is also important to stress that the panel members carried out a very complex investigation within a constrained timeline with honesty, integrity and dedication. \"This was done in line with the whistleblowing policy which provides for anonymity of the whistleblower in accordance with relevant legislation .\" The panel members were acutely aware of the seriousness of the whistleblower's concerns, given the tragic circumstances which led to the Hyponatraemia Inquiry, and strived to consider the issues raised in a fair and impartial manner. \"The HSCB is firmly committed to working with the wider healthcare system to ensure that any learning is fully taken on board .\" 0 comment"}, {"articleID": "2014050921_00073989_W", "names": {"Jack Reed": ["Q528979", "Q6114777", "Q6114779", "Q6114783"]}, "date": "2014-05-09", "url": "http://www.aboutlawsuits.com/senate-ecig-letter-64660/", "content": "By: Martha Garcia | Published: May 9th, 2014 Eight U.S. senators are calling on the FDA to impose stronger restrictions on electronic cigarettes, after new research suggests that some e-cigarettes can produce harmful chemicals similar to those released by traditional cigarettes. letter to the FDA yesterday, asking the agency to recognize two new studies that highlight the harmful byproducts of e-cigarettes. The effort, spearheaded by Massachusetts Senator Edward J. Markey, was also backed by Senators Sherrod Brown, Barbara Boxer, Jeff Merkley, <mark>Jack Reed</mark>, Richard Blumenthal, Tom Harkin and Dick Durbin. The two studies the group of senators highlight describe the many harmful chemicals which may be released in the vapor of e-cigarettes, including formaldehyde and other potential carcinogens. The studies dispel the idea that e-cigarettes contain less toxins than regular cigarettes, as a myth. The letter urges the FDA to recognize the potential impact e-cigarettes may have on the health of users and secondhand inhalers. It also asks the agency to consider the findings of the studies when \"These products put at risk not only adults and youth who use these devices, but potentially also those who are involuntarily exposed to secondhand vapors,\" write the Senators in the letter to FDA Commissioner Margaret Hamburg. Concerns Over E-Cigarette Use By Youths The FDA recently announced its plan to begin regulating e-cigarettes, after continued indecision concerning oversight of the products by the agency. However, under the new enforcement move the FDA said it will not ban the use of flavors in the products, a highly controversial decision. Critics say the wide array of flavors is one ploy used by e-cigarette companies to attract teen users. The range of teen friendly flavors, including cotton candy, bubble gum, peanut butter and jelly and hundreds more, has spurred the use of e-cigarettes to doubled among high school students in only one year. congressional report revealed e-cigarette makers are targeting teens with candy-like flavors and marketing campaigns using celebrities, in an effort to drive sales. The report asserts is the aggressive campaigns are creating a new class of users who will be more likely to become addicted to traditional cigarettes. \"Makers of these products have taken advantage of a regulatory black hole by marketing these new nicotine delivery products directly to youth,\" said the statement. Currently, the limitations on smoking in public spaces does not apply universally to all e-cigarette products, including hookah pens, liquid nicotine products and e-liquids. The senators hope to spur the FDA into creating regulations which will govern the use of these products in public areas, hopefully protecting the public from harmful side effects. A recent report released by the New York Times found heating the liquid used in e-cigarettes at high temperatures can produce vapors which carry dangerous toxins. Some users have also taken to a new process called \"dripping,\" where users apply nicotine liquid directly to the heating element on the device. This intensely and rapidly heats the liquid, offering the user a nicotine rush. In the process, causing a chemical reaction which creates carcinogens similar to those present in traditional cigarettes. \"We simply cannot afford to lag behind in our complete understanding of the health consequences to the user and bystander of these and other advanced nicotine delivery products,\" wrote Markey. Have Your Comments Reviewed by a Lawyer Provide additional contact information if you want an attorney to review your comments and contact you about a potential case. NOTE: Providing information for review by an attorney does not form an attorney-client relationship. da Vinci Hysterectomy Surgeries May Slow Amid Morcellation Cancer Risks First Trial Date for Birth Defect Lawsuit Over Zoloft Pushed Back to Jan. 2015"}, {"articleID": "2009050710_00055007_W", "names": {"Björn Borg": ["Q104506", "Q11854328", "Q879574"], "Kevin Smith": ["Q11301335", "Q1304133", "Q1560574", "Q16189518", "Q19879129", "Q21066521", "Q22681671", "Q30529095", "Q42544817", "Q489831", "Q57314384", "Q6397511", "Q6397512", "Q6397514", "Q6397517", "Q6397518", "Q6397519", "Q6397520", "Q6397521"], "John Kerry": ["Q22316", "Q6242998"]}, "date": "2009-05-07", "url": "http://uncyclopedia.wikia.com/index.php?title=Borg&diff=3821198&oldid=prev", "content": "from uncyclopedia, the content-free encyclopedia. (difference between revisions) jump to: navigation, search revision as of 10:31, 7 may 2009 (edit) 220.235.145.1 (talk) (â \u0086' species of the collective) â \u0086 \u0090 older edit revision as of 10:33, 7 may 2009 (edit) (undo) 220.235.145.1 (talk) (â \u0086' fighting the <mark>borg</mark>) newer edit â \u0086' line 52: line 52: = = fighting the <mark>borg</mark> = = = = fighting the <mark>borg</mark> = = [[image: uncymatrix-00. jpg | thumb | 320px | right | sophia is coming for you .]] [[image: uncymatrix-00. jpg | thumb | 320px | right | sophia is coming for you .]] + [[image: locutus.jpg | thumb | right | 500px | after the destruction of the <mark>borg</mark> queen's vessel, the <mark>borg</mark> where forced to influence alies, like the [[ottoman empire]] in the [[19th century]].]] + the <mark>borg</mark> are virtually unstoppable killing machines. however, here are a few tips to help survive a <mark>borg</mark> attack. the <mark>borg</mark> are virtually unstoppable killing machines. however, here are a few tips to help survive a <mark>borg</mark> attack. * get the all invincible crew of voyager to kill them for you. * get the all invincible crew of voyager to kill them for you. revision as of 10:33, 7 may 2009 we are the <mark>borg</mark>. resistance is pathetic. left \"i am frodo of <mark>borg</mark>. your individuality will be assimilated in the fires of mount doom. you will be ringwraithed. resistance is pathetic .\" - elijah wood <mark>björn borg</mark> - the famous swedish tennis player. he assimilated the wimbledon cup many times. \"assimilate this .\" ~ worf on the <mark>borg</mark> \"all resistance is pathetic, really .\" ~ oscar wilde on the <mark>borg</mark> \"you bloody ripoffs .\" ~ cybermen on the <mark>borg</mark> \"i am dyslexic gorb, your ass will be laminated!\" ~ the <mark>borg</mark> on dyslexia the <mark>borg</mark> are a cybernetic race from the 24th century b.c and the only decent villains on \"star trek: the next generation\" , since both the klingons and romulans turned into wusses and sided with the federation. contrary to popular belief, they do not produce the beer kronenbourg, that's the french. <mark>borg</mark> is also a name for abnormally successful tennis players. contents 1 who are the <mark>borg</mark>? 2 origins of the <mark>borg</mark> 3 borgification 4 species of the collective 5 enemies of the <mark>borg</mark> 6 fighting the <mark>borg</mark> 7 history 8 borgisms 9 see also who are the <mark>borg</mark>? the <mark>borg</mark> are a race of swedish cyborgs who use incredibly advanced technology to \"assimilate\" others into their collective so as to make themselves more perfect. they move from planet to planet, incorporating the inhabitants and their technology into the <mark>borg</mark> collective and stripping planets of all resources. although repeated assertions have been made that they bear an uncanny resemblance to microsoft, any such comparison is angrily rejected by the <mark>borg</mark>. incorporation into the <mark>borg</mark> turns a person into a robotic being, a rigid, soulless automaton devoid of character, individuality, or emotion, rather like keanu reeves or hillary clinton. despite being so advanced, whenever the <mark>borg</mark> walk they stagger around in a stiff and clumsy fashion, like al gore after six beers. in their spare time, the <mark>borg</mark> run a taxi service for the emperor of morley to get a bit of pin money. origins of the <mark>borg</mark> \"your resistance just makes us harder .\" ~ the <mark>borg</mark> on being perverted the <mark>borg</mark> were created when a bdsm club catering exclusively to leatherclad homosexual men entered a spatiotemporal rift presumably caused by a fisting paradox and was jettisoned into a protoplasmic soup of inanimate nanotech on the far side of the galaxy. this mysterious primordial ocean of liquid nanotech then came to life devouring the intruders. but the gay psyche was too strong and came to dominate the nanotech, upon which the <mark>borg</mark> arose out of the protoplasma with only one goal: assimilate! borgification \"in soviet russia, you assimilate <mark>borg</mark>!\" ~ luc-picard on borgification <mark>borg</mark> nanoprobes in action. the process of being assimilated is called borgification. the <mark>borg</mark> remove useless parts of the organic being (such as that little thingy that hangs down in the back of your throat) and the body is upgraded with the installation of cybernetic components, for instance, microchips, fiber optics, lithium power cells, lasers, lots and lots of wires and cables and hoses, inkjet printers, servo motors, toasters, and a robotic little thingy to hang down the back of your throat. during the process the individual is forced to watch \"barney and friends meets teletubbies\" on a windows computer for three days straight to break down any remaining traces of soul or consciousness. the resulting borgified human is a soulless drone without any individuality, a mere cog in a vast, unfeeling machine of destruction. on the plus side, you now have the ability to store up to 200 hours of music on your built-in 30 gb hard drive. there is talk of a huge 1tb hard drive for some <mark>borg</mark>, but these are unlikely to be implemented soon, as google have used up most of the universe's available disk space. species of the collective every time you exploit that joke, the <mark>borg</mark> assimilates a kitten! thousands of species from millions of worlds contribute to the <mark>borg</mark> collective, including humans, romulans, cardassians, sporks and vulcans. however, not all <mark>borg</mark> member species are humanoid. among the non-humanoid <mark>borg</mark> are the cute little kitten pictured here. <mark>borg</mark> vessels may also include borgified pets such as goldfish, parrots and turtles, or livestock such as cows and llamas. after all, there's no particular reason the species you assimilate has to be intelligent if you're just going to subsume it into a hive-mind anyway. the lack of prehensile appendages can quickly be fixed by attaching a spare human arm or two. however, the problem with assimilating too many species without opposable thumbs is that unless you've got a lot of extra human appendages laying around, the collective quickly ends up short-handed. after the destruction of the <mark>borg</mark> queen's vessel, the <mark>borg</mark> where forced to influence alies, like the ottoman empire in the 19th century. enemies of the <mark>borg</mark> enemies of the <mark>borg</mark> consist of pretty much anybody who isn't <mark>borg</mark>. in no particular order: the federation. the <mark>borg</mark> launched an attack on earth to assimilate its population. they were only stopped when skynet and dr. who's cybermen launched copyright-infringement lawsuits against them. the klingons. the <mark>borg</mark> have decided to simply exterminate the klingons rather than assimilate them, because it's really a pain in the ass to get metal components to stick onto those funky foreheads. the fjord. the fjord are a race which split off from the main <mark>borg</mark> collective thousands of years ago. they are exactly the same as the <mark>borg</mark>, except they speak with a norwegian accent. to this day, the fjord and the <mark>borg</mark> remain bitter enemies, forever divided over the issue of whether or not to speak with a norwegian accent. the fjord also smell vaguely of smoked salmon, which is another reason the <mark>borg</mark> don't like them. rust kittens. the war between the <mark>borg</mark> and the planet of cute little defenseless kittens lasted about 23 seconds, after which the kittens accepted the unconditional surrender of the <mark>borg</mark> and told them to get off their planet. \"that piece of metal no-one cut off'. the piece of metal hath claimed many a <mark>borg</mark> life. their senses dont pick it up as an active threat, anyone who meets it dies before they can tell the others, and its alway catching the excess tubing coming out of their heads. species 8472. for no reason at all, those guys can anal the <mark>borg</mark> in less than half a second. rabbids can't be assimilated into the <mark>borg</mark>. but. they. can. dance! computer viruses, which make the <mark>borg</mark> freeze, reboot, delete files and play nsfw movies at inappropriate times. the kazon. of only one reason; the <mark>borg</mark> wants to be perfect, and the kazon are so stupid that even one assimillated kazon would ruin all the work they've done for eternity, plus drones need to be bald, and its a known fact that kazon hair is indestructible. why else do you think the kazon have the shittiest hairdos in the galaxy? cybermen. they are angry that the <mark>borg</mark> stole their shtick. technically they cant be angry, but you get the picture. jehovah's witnesses. they just won't leave the borgs alone. fighting the <mark>borg</mark> sophia is coming for you. after the destruction of the <mark>borg</mark> queen's vessel, the <mark>borg</mark> where forced to influence alies, like the ottoman empire in the 19th century. the <mark>borg</mark> are virtually unstoppable killing machines. however, here are a few tips to help survive a <mark>borg</mark> attack. get the all invincible crew of voyager to kill them for you. if you can, run, although the <mark>borg</mark> ships are capable of moving at incredible speeds. install a sexually transmitted computer virus into data and make him rape the <mark>borg</mark>. use photon torpedoes. and quantum torpedoes. and transphasic torpedoes. and chroniton torpedoes. use your phasers, rapidly shifting frequencies to stay ahead of the <mark>borg</mark>'s ability to shift their shields. the <mark>borg</mark> can rapidly adapt to your phaser fire. use unconventional means of attack such as spreading nasty rumors behind their backs to all their friends. wait...they don't have any friends. never mind. shoot them with holographic bullets from your holographic tommy gun point and laugh at their ugly face. if the <mark>borg</mark> nevertheless invade your ship, try to fit in. if the <mark>borg</mark> think you're already one of them, you won't be assimilated. dance\" the robot \". try covering yourself with aluminum foil. pull some tubing from their heads. hit them with a blunt object. they won't expect it. shine a laser pointer at their scanners. throw worf at them. ridges facing front of course. make kirk do them. put your finger on their chest, say\" you've got something on your shirt \", and when they look down, hit and run. correct their pronunciation of the word\" futile \". magnets. lots and lots of magnets. make them go to sleep. the common cold. get them to see an optical illusion. interpreting the pointless seems efficient against borgs. see philosophy. break off an extended part of their mechanical body. masturbate assimilate them. rickroll them. since they are notoriously slow-moving, just walk away. cover your eyes. the <mark>borg</mark> are notorious for thinking if you can't see them, they can't see you. just download vista into their hard drive. history the <mark>borg</mark> tried other methods of assimilation, but then the writers all wen on strike. violence was more fun anyway. <mark>borg</mark> started their career performing in low-class sundsvall pubs in exchange for beer. sideshow's real parents died in 1982 and for some reason bequeathed sideshow with a music studio in nearby france. the band then decided on a name (<mark>borg</mark>) and cut their first demo tape. the instruments were shoddily played, and the music was crap. <mark>borg</mark> sent their demo tape to all the major, minor, and produced-out-of-basement labels. somehow, their demo tape landed in the hands of <mark>kevin smith</mark>, a visionary filmmaker whose first project was 1984's footloose, an epic story of love and heartbreak in the caribbean starring ross gellar. <mark>kevin</mark> was intrigued by the raw, emotionless music and decided to include <mark>borg</mark> on the movie's soundtrack. following the release of footloose, <mark>borg</mark> skyrocketed to popularity and got their first top-40 hit with\" i wannabe assimilated \". the following year, <mark>borg</mark> produced their first album, the inimitable first contact. the tone and style of their new album was much more mainstream and accessible. the album soon went triple diamond. following the release of the album, in 1985,\" resistance is futile (give me all your love) \"hit #1 and stayed there for all 52 weeks. america, europe, and the world was in love with <mark>borg</mark>. unbeknownst to <mark>borg</mark>, an alien of blood curdling terror was watching them from its imperial starcruiser of force. the alien chose to infest the minds of <mark>borg</mark> and turn their bodies into evil, morphing, visceriods. the visceroids then mega-morphed into the current <mark>borg</mark> with the help of <mark>john kerry</mark>, the ent. the <mark>borg</mark> is currently planting mind seeds into usa's high council. the <mark>borg</mark> has been seen on vacation sailing its 38 ft schooner on lake michigan. borgisms see borgisms according to [1], a borgism is an ancient proverb that follows the format of\" i am (celebrity) of <mark>borg</mark>, you will be ________ \": see also bork bjork bort fjord <mark>borg</mark> collective jehovah's witnesses seven of nine ernest <mark>borg</mark> nine <mark>borg</mark> queen retrieved from\" \"categories: science fiction | star trek | evil technology | axis of evil-doers"}, {"articleID": "2011031518_00024558_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"], "James O'Donnell": ["Q58034955", "Q6140476"], "Claire Jones": ["Q16728064", "Q5125234", "Q58023339"]}, "date": "2011-03-15", "url": "http://boston.com/ae/music/articles/2011/03/15/royal_wedding_music_includes_choirs_fanfare?rss_id=Boston.com+--+Music+news", "content": "royal wedding music includes choirs, fanfare file - this nov. 16, 2010 file photo shows britain's prince william and his fiancee <mark>kate middleton</mark> pose for the media at st. <mark>james</mark>'s palace in london. royal officials at st. <mark>james</mark>'s palace said tuesday march 15, 2011 the couple \"have taken a great deal of interest and care in choosing the music for their service,\" which will include well-known hymns and choral works as well as pieces commissioned especially for the occasion, provided bytwo choirs, an orchestra and a military fanfare team. (ap photo / kirsty wigglesworth, file) by gregory katz associated press / march 15, 2011 e-mail this article to: invalid e-mail address add a personal message: (80 character limit) your e-mail: invalid e-mail address sending your article your article has been sent. e-mail | print | text size - + london - royal officials tuesday named the two choirs, orchestra and military fanfare team that will provide the music for the april 29 wedding of prince william and <mark>kate middleton</mark>. william's office at st. <mark>james</mark>'s palace said the ceremony will feature the choir of westminster abbey, the chapel royal choir, the london chamber orchestra and a fanfare team from the royal air force band. the palace said that william and his fiancee \"have taken a great deal of interest and care in choosing the music for their service,\" which will include well-known hymns and choral works as well as pieces commissioned especially for the occasion. the couple and william's father, prince charles, recently made an unannounced evening visit to westminster abbey to hear live musical performances as part of the preparation process. guests at a buckingham palace reception to be hosted by queen elizabeth ii after the wedding will be soothed by the strains of <mark>claire jones</mark>, prince charles' official harpist, the palace said. the choirs will be directed by <mark>james o'donnell</mark>, organist and master of the choir at westminster abbey. the westminster abbey choir consists of 20 boys and 12 professional adult singers, known as lay vicars. the choir sings the daily choral services in the abbey and often sings at major national events at the abbey. officials said robert quinney will play the organ. the chapel royal choir dates back at least to the era of the norman conquest, officials said. its primary roles are to sing the weekly service in the chapel royal at st. <mark>james</mark>' palace and to perform for the royal family on special occasions. the schedule calls for the london chamber orchestra to be conducted by christopher warren-green, its music director. it will consist of 39 musicians placed in the organ loft of the abbey. the orchestra was founded in 1921 by anthony bernard. no announcement has been made yet about the live entertainment at an evening reception at the palace to be hosted by prince charles for close friends of william and his bride .? copyright 2011 associated press. all rights reserved. this material may not be published, broadcast, rewritten, or redistributed. tweet yahoo! buzz sharethis"}, {"articleID": "2020012104_00053176_W", "names": {"Kevin Roberts": ["Q10408794", "Q28421791", "Q28510868", "Q30122050", "Q6397367", "Q6397368", "Q6397369", "Q6397371"], "Shane Watson": ["Q2732224", "Q7488319"], "Alex Blackwell": ["Q3526026", "Q3610633"], "Michael Clarke": ["Q1428440", "Q16203034", "Q16227744", "Q57942480", "Q6829291", "Q6829292"], "Mel Jones": ["Q47122859", "Q6810744"]}, "date": "2020-01-21", "url": "https://www.hindustantimes.com/cricket/sachin-tendulkar-courtney-walsh-to-don-coaching-hats-for-bushfire-cricket-bash/story-RuKNSYjcw50j7siUZaM2ZO.html", "content": "Home / Cricket / Sachin Tendulkar, Courtney Walsh to don coaching hats for Bushfire Cricket Bash Sachin Tendulkar, Courtney Walsh to don coaching hats for Bushfire Cricket Bash The charity match will be the curtain raiser to the Big Bash final on February 8, with the venue yet to be determined. Both matches, as well as Australia's women's T20 match against India at Junction Oval on the same day. cricket Updated: Jan 21, 2020 09:33 IST Indo Asian News Service File image of Sachin Tendulkar (Getty Images) Indian batting legend Sachin Tendulkar and West Indies fast-bowling great Courtney Walsh will coach the Ponting XI and Warne XI respectively in the Bushfire Cricket Bash set to be played on February 8. The bushfire relief cricket match is one of three headline acts on the cricket's day of giving \"The Big Appeal' with Tendulkar and Walsh joining former Australian captain Ricky Ponting and Shane Warne as leaders of the two sides .\" We are absolutely honoured to be welcoming Sachin and Courtney back to Australia, where they both enjoyed a lot of success as players, and we can't wait to have them involved in what is going to be a special day, \"said <mark>Kevin Roberts</mark>, Cricket Australia Chief Executive Officer .\" Both in the ICC Hall of Fame, Sachin is the greatest run-scorer of all time in international cricket, and we all remember what Courtney could do with the ball, taking more than 500 Test wickets. \"We're looking forward to our people at CA and the entire Australian cricket family coming together for the Big Appeal .\" The charity match will be the curtain raiser to the Big Bash final on February 8, with the venue yet to be determined. Both matches, as well as Australia's women's T20 match against India at Junction Oval on the same day. Former Australian cricketers confirmed to play include Ponting, Warne, Justin Langer, Adam Gilchrist, Brett Lee, <mark>Shane Watson</mark>, <mark>Alex Blackwell</mark> and <mark>Michael Clarke</mark>. Steve Waugh and <mark>Mel Jones</mark> will be involved in a non-playing capacity. The remaining players and further details about The Big Appeal will be announced in the next two weeks. All match profits and funds raised on the day will go to the Australian Red Cross Disaster Relief and Recovery Fund. Get Latest Cricket Updates, Live scores and Top news on HT Cricket. tags"}, {"articleID": "2015111221_00089971_W", "names": {"Matt Murphy": ["Q137546", "Q16213156", "Q6789105", "Q6789106", "Q6789107", "Q6789108", "Q6789109"], "Peter Graham": ["Q13407646", "Q21463827", "Q371099", "Q7174323", "Q7174327", "Q7174328", "Q7174329", "Q7174330", "Q7174332"]}, "date": "2015-11-12", "url": "http://peninsulaclarion.com/arts-entertainment/2015-11-11", "content": "All about that bass: University Wind Ensemble concert highlights tuba Posted: November 11, 2015 - 3:44 pm | November 12, 2015 - 12:05 pm Updated: Photos Philip Hall/University of Alaska Anchorage <mark>Matt Murphy</mark> (center) and Seth Bodine (right) play in the bass section of the University of Alaska Anchorage Wind Ensemble. The group will make its annual stop in Kenai on Friday at Kenai Central High School. By ELIZABETH EARL Peninsula Clarion Most people don't see the tuba as a lead instrument. But on Friday, the University of Alaska Anchorage's Wind Ensemble plans to put the big brass horn in the spotlight. The ensemble will make its 11th annual stop at Kenai Central High School on Friday. The group, composed of woodwind instruments and brass, is mostly music students from the university, but some are students from other departments and members of the community, according to Dr. Mark Wolbers, the ensemble's conductor. \"If you think about orchestras, most of their repertoire is going to be 19th, 18th century pieces,\" Wolbers said. \"Their mainstay is Mozart, Beethoven and Brahms. When you do wind band conducting, you tend to be conducting more modern works that were composed within the last 100 years .\" The featured piece, \"Tuba Concerto,\" was written 61 years ago by British composer Edward Gregson and runs a hefty 19 minutes, Wolbers said. Because the tuba is a newer instrument--invented in the mid-19th century and still largely a support instrument--there are few pieces in the tuba's repertoire. Gregson's piece was considered the first concerto for tuba, Wolbers said. The music he selected for the ensemble, which tours Anchorage and the Kenai Peninsula in the fall, centers around a connection to British band music. Brass bands were common in the U.K. throughout the 20th century, forming the centerpiece for many communities. Some still exist today, Wolbers said. \"Even though our music comes from around the world--we have a piece from New Zealand--it was originally arranged for British brass band, and we have an Australian composer,\" Wolbers said. \"And a piece by Vaughan Williams...it all has the former British Empire kind of relationship .\" The band will play selections from the works of <mark>Peter Graham</mark>, Percy Grainger and Ralph Vaughan Williams as well as an American composer, Eric Whitacre. The tuba concerto will be anchored by Jeffrey Manley, an adjunct professor at UAA and former U.S. Air Force musician. Manley has toured the U.S. and most of Alaska, he said--including every single school in the Bering Strait School District in northern Alaska. \"In all those villages, the school is the central place,\" Manley said. \"It's where everything happens. When the plane lands and you're not from there, suddenly you become a minor celebrity. The whole village would turn out .\" The tuba has been a lifelong commitment, Manley said. The fifth of six siblings, he said he grew up watching his older sisters and brothers enter the band class and select instruments and knew the tuba was for him. He marched for five years with the Cavaliers Drum & Bugle Corp. in Chicago and served 20 years as an Air Force musician, playing in Tacoma, Washington and eventually in Anchorage. He primarily works at Alaska Music & Sound: Home of the Horn Doctor in Anchorage but took an adjunct position teaching applied music for the tuba at UAA. That was when Wolbers approached him with the idea of playing \"Tuba Concerto\" with the wind ensemble. \"A lot of people don't think of the tuba as a solo instrument, but we deserve the recognition,\" Manley said. Wolbers said the music scene has grown in Alaska since he began teaching at UAA in 1992. His first band class included six students; today, he teaches classes with ensembles of up to 40, he said. Even the community members come from other trades and play music on the side, he said. \"I think (the arts scene) has matured quite a bit,\" Wolbers said. \"You see that everywhere, even down on the peninsula. You think about the last 20 years, what's happened with the Kenai Peninsula Orchestra. It's quite different than what it was when I came here .\" The concert will be held at the Kenai Central High School Henderson Auditorium from noon to 1 p.m. on Friday. Admission is free."}, {"articleID": "2018110423_00414404_W", "names": {"Bobby Moore": ["Q4935388", "Q4935389", "Q4935390"]}, "date": "2018-11-04", "url": "https://www.thesun.co.uk/sport/football/7657865/thierry-henry-monaco-flops-reims-loss/", "content": "By Daniel Cutts Invalid Date, THIERRY HENRY has blasted his Monaco flops for lacking desire and refusing to play the way he wants. The Arsenal legend has yet to win any of his first four games as the struggling side's manger, drawing and losing twice - fans were furious at the end of the game, attempting to get onto the pitch to give the players a piece of their mind. Getty 3 Thierry Henry has had a shocking start to his reign at Monaco, with another loss at Reims yesterday The mega-rich club lie second bottom in Ligue 1, and were forced into sacking Leonardo Jardim in October after just one league victory all season. And Monaco were left humiliated against last night after losing 1-0 at minnow Reims, with both teams finishing the match with ten men. Following the game, Henry raged: \"They won basically all the duels. When we were at 11 vs 10, we really weren't in the match at all .\" Then we get a red card of our own and penalise ourselves completely on our own. Getty 3 Henry has a huge job to turn around Monaco, who are shot of confidence and in the relegation zone \"This was more worrying than on previous occasions because we do not produce any football .\" This evening was not about tactics, it was about a lack of desire. If you don't win any duels, then its difficult to win a football match. \"I understand our fans' frustration .\" This is a delicate situation. When you enter the pitch and your players involuntarily refuse to play, it is difficult. 3 Monaco fans vented their anger towards Thierry Henry and the players at full-time yesterday MOST READ IN FOOTBALL \"DO YOUR WORST' Stoke ace slams\" uneducated cavemen' after abuse for not wearing poppy \"truly humbled' Rooney confirms shock England return but insists it will be his last game TELL ME <mark>MOORE</mark> Get in the know on England and West Ham legend <mark>Bobby Moore</mark> PRAYERS FOR A KING Jamie Vardy prays as Leicester City players attend funeral of owner instaslam Thomas Muller's wife removes every photo of her with Germany star from Instagram Latest\" DISGRACE' Nemanja Matic subject to vile abuse after refusing to wear poppy for Man Utd win Exclusive HODD'S HEART OP HOPE Glenn Hoddle faces triple heart bypass surgery after birthday collapse McClean has a pop Stoke to quiz James McClean after attacking own fans over poppy abuse \"We have to find our confidence again. I would not have come to Monaco if I did not think that there was quality in this team .\" Henry and the rest of the Monaco squad were confronted by furious fans at the end of the Reims game, chanting and setting off flares. Stewards had to step in as supporters stormed to the front of the away section to throw abuse at their team, who are on just seven points. Comments Topics AS Monaco Thierry Henry Comments"}, {"articleID": "2012072623_00091331_W", "names": {"Alexander Hamilton": ["Q43390357", "Q43914913", "Q56556511"], "Heather Ross": ["Q21466939", "Q40647466", "Q54326649"]}, "date": "2012-07-26", "url": "http://huffingtonpost.com/charyn-harris/living-on-the-wall_b_1704530.html", "content": "soon you will be able to buy items on \"clearance' at j.c. penney 10 states where you're most likely to make over $200,000 horror: woman dies at mcdonald's, staff keep making food horror: woman dies at mcdonald's, staff keep making food photos: emily maynard smiles for the cameras in a sheer, bra-baring top photo: banana republic makes a model's knee disappear is michele bachmann washington d.c.'s most beautiful? who is liberty ross? meet rupert sanders' model wife\" stand for something or you will fall for anything. \"it's one of my favorite quotes. sometimes attributed to rosa parks, legend also has it associated with <mark>alexander hamilton</mark>. regardless, these are words to live by. a few years ago, i was approached by filmmaker <mark>heather ross</mark> to participate in the hollywood premiere of her documentary,\" girls on the wall. \"for the past several years, this film has stuck out in my mind, as it highlights the lives of young teenage girls who have been incarcerated. the film moves us through their individual journeys towards accepting responsibility, redemption and re-entry into society, using the arts as a medium to support their rehabilitation. it's an important film and reminder of what we are facing if we fail to invest in education and arts for youth, especially in under-served communities. the film hits home for me personally, since i work with a population not far removed from those highlighted in the film. i know these personalities and work hard to keep these youth from living on the wall. i once served as the keyboardist and vocalist for a unit that provided arts appreciation and exposure to inmates in the new york correctional system. riker's island, new york house of detention and it's sister facilities in the remaining boroughs, the legendary\" sing sing,' among others were on our rotation. as a civilian, i had no prior connections with the correctional system or law enforcement. i had no idea what i was stepping into and although fascinating on one hand, this was a raw and unpredictable ride. here, i had to run on instinct. there was no training or briefing about whom or what we may encounter or what may happen on any given day. i had to learn to watch, listen and determine \"how to be' during these visits and yes, my heart pounded every time i stepped into a facility. i had the opportunity to see the infamous electric chair, walking eerie halls in the steps of the unsighted ghosts of lives that had ended in those very walls. we happened to witness several violent riots but were quickly moved into secured areas until they would subside. aside from these experiences, i was impacted by the number of inmates i would encounter in one location and eventually see again in another facility. i remember asking one inmate why he was still locked up after being released and he replied that he makes an effort to re-enter the system because it was easy and it gave him a roof over his head that he otherwise wouldn't have. this may not be true for every inmate but this was how he worked the system. these are our tax dollars hard at work. what are the alternatives for the youth who are on the same path because we are not paying attention or caring enough to reach them? these youth are part of my motivation and inspiration to continue to make an impact in the community on a grander scale. i work in south l.a.. some youth i work with have never experienced what i have but seem to have a romanticized notion of thug life. if i could only take them where i've been to meet whom i have met. a few months ago, one of my former students stopped by and told me how proud he was of my decision to run for city council. he was one who was often approached by gangs who were trying to recruit him. he told me that if it were not for him working with me and being involved in music, he was not sure he would be alive today. i watched this young man struggle to finish high school and to make better decisions. i still think from time to time about how the inmates i knew back then could have had an alternate outcome. of course, there are many variables that rule our circumstances. in my many years as an arts educator and advocate, i have made observed the costs of music education programs versus the costs of incarceration. the cost to house an inmate is estimated to be in the neighborhood of $35,000 annually. hypothetically, with a designated purse of $35,000 per youth, if we invested $10,000 over the 10 years in giving a child access to music/arts education we would have a balance of $25,000 to invest in that same youth's pursuit towards higher learning, vastly lessening the likelihood of incarceration. even if it were discovered that this child may need extra support academically or emotionally, there would be more than enough funding to provide further treatment. living on the wall of education will tear down the walls of incarceration. who's up for a remodeling project?\" stand for something or you will fall for anything. \"it's one of my favorite quotes. sometimes attributed to rosa parks, legend also has it associated with <mark>alexander hamilton</mark>. regardless, these are...amazon.com: sports illustrated swimsuit 2011 wall calendar (9781438809274): dateworks: books this is my orginal picture off the wall of the bad girls club season3 wall with all if out signatures. 30% off sale girls wall art - no boys allowed print 6 in x 10 in here's the second part of what some insecure posted on his girls wall. haha buyers guide - baby wall decorations for girls | murals your way click here to leave a comment. huffpost high school welcomes a lively, thoughtful debate in the comment section. keep in mind that the articles here are penned by young authors, so please keep criticism respectful, and help us to keep this a safe and supportive place for writers of all ages to contribute. bc11t1q5a3lmdsojgm2l3dcjr9lmuaah9wzxuhdsneo03xgcdf17i7tq3syhwjhkj0wnwthmajmqydt8nc8kuaaxudpwrhrg watch: violent, fiery confrontation between police & protestors over officer-involved shootings rt @ aol near death at seaworld! (worldwide exclusive video) via @ huffpostgreen"}, {"articleID": "2019062312_00220796_W", "names": {"Steve Rhodes": ["Q25352324", "Q7478675", "Q7613734", "Q7613736"]}, "date": "2019-06-23", "url": "http://www.dhakatribune.com/sport/2019/06/23/miraz-gets-a-blow-in-the-head-during-practice", "content": "Miraz gets a blow in the head during practice Published at 06:39 pm June 23rd, 2019 Bangladesh's Mehedi Hasan Miraz gets hit on the head Dhaka Tribune/Md Manik from Southampton Bangladesh coach <mark>Steve Rhodes</mark> informed the 21-year old looked all right although they were waiting for a report of the physio Bangladesh's all-rounder Mehedi Hasan Miraz got hit on the head on Sunday ahead of their crucial tie against Afghanistan that is scheduled to take place on Monday. Miraz, who is an important member for the Tigers, were giving an interview adjacent to the boundary rope in the Rose Bowl Stadium in Hampshire when a ball hit on the side of his head. Miraz's teammates were making some net practices in the ground and it was known the ball that hit him came from the centre wicket where Sabbir Rahman was batting. Bangladesh captain Mashrafe bin Mortaza was making some bowling practice while their batting coach Neil Mckenzie was throwing down. Sabbir, the right-handed batsman, played a pull shot that flew over the boundary through the deep square leg region but it ricocheted off the sitting area and hit unfortunate Miraz. However, Bangladesh coach <mark>Steve Rhodes</mark> informed the 21-year old looked all right although they were waiting for a report of the physio. \"He seems okay at the moment. We are looking for the report from the physio. But it looks everything is fine so far\" , said <mark>Steve Rhodes</mark> during the pre-match press conference at Rose Bowl on Sunday. Related News"}, {"articleID": "2015032412_00054187_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2015-03-24", "url": "http://www.truthdig.com/report/item/how_we_know_republicans_serious_plight_working_class_americans_20150324/", "content": "An Early Look at the Republican Nomination for the 2016 Election Here's How We Know Republicans Aren't Serious About the Plight of Working Class Americans Being Mortal By Louise Rubacky \"Shock Wave': A Compelling Poem About the Boston Marathon Bombings WASHINGTON-Briefly, there seemed a chance we might have a cross-party discussion of the biggest economic problem the country faces: the vexing intersection of wage stagnation, declining social mobility and rising inequality. Even the most conservative Republicans were starting to talk about this challenge in rather urgent terms. In a moment whose irony he noted, Sen. Ted Cruz, R-Texas, told a bunch of rich Republicans gathered by the Brothers Koch earlier this year that those doing well in America were\" the top 1 percent, the millionaires and billionaires the president loves to demagogue, one or two of whom are here with us tonight \"while the\" people who have been hammered for the last six years are working men and women. \"And on it went through the country's top Republicans. Sen. Marco Rubio, R-Fla ., stressed\" opportunity inequality \"and Mitt Romney, in another ironic turn, charged that\" under President Obama, the rich have gotten richer. \"It would be wonderful if conservatives really wanted to deal constructively with the predicament they so passionately describe. But thanks to the House and Senate GOP budgets, we now know that conservatives and Republicans (1) aren't serious about the plight of working class and lower income Americans, and (2) would actually make their situations much worse. Their spending plans fail even on conservative terms: They are not fiscally responsible. Instead, they rely on all sorts of magic tricks that shove choices and problems down the road. One heartening sign is that at least some conservatives find these budgets ridiculous. For example, James Pethokoukis of the American Enterprise Institute headlined his commentary for The Week:\" The disappointing unseriousness of the House GOP's budget. \"Pethokoukis wrote:\" House Republicans say they want to balance the federal budget and eventually eliminate the federal debt. They do not have a plan to do so. Oh, to be sure, they have a plan! Just not a realistic one that will actually accomplish their goals. \"He noted that of the $5.5 trillion in cuts from planned spending, $2 trillion would come from\" repealing the Obamacare insurance subsidies and Medicaid expansion and replacing them with...well, nothing right now. \"The wholesale assault on efforts to provide lower income Americans with health insurance is the clearest sign that Republicans don't want to deal with inequality. The inability to get health insurance is one of the biggest burdens on low-income families, particularly those working for low wages and few or no benefits. Obamacare has helped 16.4 million Americans get health insurance. Where would they turn? And Republicans would compound the damage: The Senate proposes cutting an additional $400 billion from Medicaid over a decade, the House more than double that. Robert Greenstein of the Center on Budget and Policy Priorities notes that on other low-income programs, the Senate budget cuts even more than the House. The vagueness of these plans makes it hard to tally how much damage would be done to food stamps, Pell Grants for low-income college students and the like, but Greenstein estimates that about two-thirds of the cuts in both plans come\" from programs for the less fortunate, thereby exacerbating poverty and inequality. \"Greenstein concludes that under such proposals-here's hoping President Obama is relentless in blocking them -\" ours would be a coarser and less humane nation with higher levels of poverty and inequality, less opportunity, \"and an\" inadequately prepared \"workforce. Another bit of hypocrisy: These budget writers care so much about national security that they're not willing to raise a dime in taxes to cover their sharp increases in defense spending. Sen. Bernie Sanders, the Vermont independent, called out his conservative colleagues for how differently they treat defense and social spending .\" You're always telling us the deficit is so bad we've got to cut programs for the elderly, for the sick and for the poor, \"Sanders said,\" and suddenly, all of that rhetoric disappears. \"Budgets are, by their nature, boring. That's why those who assemble these long columns of numbers figure they can assail the well-being of the least privileged people in our society even as they profess to care about them so much. I'd respect these folks a lot more if they said what they clearly believe: They think more inequality would be good for us. It almost makes you nostalgic for the candor of the Romney who spoke about the\" 47 percent \"and the <mark>Paul Ryan</mark> who once divided us between\" makers \"and\" takers. \"Honesty beats saccharine words about the struggles of working people any day. E.J. Dionne's email address is ejdionne @ washpost.com. Twitter: @ EJDionne. An Early Look at the Republican Nomination for the 2016 Election Obama With Drama: Translating the President's Comments on Israel's Netanyahu from the Vulcan An Early Look at the Republican Nomination for the 2016 Election New and Improved Comments If you have trouble leaving a comment, review Mideast Apocalypse 2030: Why Obama Wants the Palestine Issue Solved. Now. An Early Look at the Republican Nomination for the 2016 Election Here's How We Know Republicans Aren't Serious About the Plight of Working Class Americans A Progressive Journal of News and Opinion"}]