[{"date": "2013-07-05", "url": "http://au.news.yahoo.com/latest/a/-/article/17876411/rudd-apology-over-insulation-deaths/", "content": "Rudd apology over insulation deaths Prime Minister Kevin Rudd is prepared to meet and apologise to parents of tradesmen killed installing home insulation batts under a federal government scheme. But the opposition says Mr Rudd must go further and release all documents relating to advice to him about problems with the scheme, set up during his first term as prime minister. The issue re-emerged just over a week into Mr Rudd's return to the leadership after Queensland coroner <mark>Michael Barnes</mark> handed down a damning report into the deaths of three men. Mr <mark>Barnes</mark> found the rushed rollout of the scheme was a significant factor in the deaths of installers Matthew Fuller, Rueben <mark>Barnes</mark> and Mitchell Sweeney in Queensland. A fourth man, <mark>Marcus Wilson</mark>, died in November 2009 from hypothermia complications with installing batts in a Sydney house. Mr Rudd, who rolled out the scheme to create jobs during the global financial crisis, issued a public apology to the men's families on Thursday during a trip to Jakarta. On Friday, a spokesman for Mr Rudd said the prime minister would meet with any of the parents who wished to meet him in private. \"These events are tragic - and despite what the opposition might believe, they are not some opportunity for a headline .\" Lawyer Peter Koutsoukis, representing Mr Sweeney's family, told AAP they would appreciate a face-to-face apology, even though \"no amount of apologies can bring Mitchell back\". Opposition Leader <mark>Tony Abbott</mark> said an apology was an important \"first step\". But Mr Rudd should also release all 10 warnings he personally received between August 2009 and March 2010 and any others he was aware of relating to the scheme, which also has been linked to 250 fires. Four of the letters were from the then minister in charge of the program, Peter Garrett, who is quitting parliament at the next election. A cabinet committee is known to have discussed the scheme's safety issues in October 2009 and February 2010. \"I think he's got a bit of explaining to do,\" Mr <mark>Abbott</mark> said. Mr Rudd's spokesman said Mr <mark>Abbott</mark> was calling for release of information already made public, except for confidential cabinet documents. The victims' families are considering claims against the state and federal governments. Mr Albanese said the pace at which the program had been rolled out allowed dodgy operators to take advantage. \"What these findings highlight is that because of the pace of the scheme, in some places unscrupulous operators didn't give staff appropriate health and safety training, and that has led to these consequences,\" he said. Attorney-General Mark Dreyfus said the deaths were a tragedy and the government would look closely at the coroner's report. Mr Garrett apologised for the bungled program and defended his own actions in the matter, but accused Mr <mark>Abbott</mark> of playing politics. \"Of course I'm terribly sorry about what happened,\" Mr Garrett told reporters on Friday. The former Midnight Oil frontman said two independent reviews showed he had acted appropriately during the home insulation roll-out. \"At all times I've served the country to the best of my ability,\" Mr Garrett said. \"It's on the public record...you can come to your own conclusions about those matters. British court to hand down Turkcell ownership verdict on July 9", "articleID": "2013070516_00040331_W", "names": {"Michael Barnes": ["Q16147689", "Q16164531", "Q16171690", "Q25172118", "Q3355621", "Q56700663", "Q6828429", "Q6828430", "Q6828432", "Q6828433"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}, {"date": "2013-07-07", "url": "http://www.inquisitr.com/834976/james-cameron-will-begin-work-on-battle-angel-alita-movie-in-2017/", "content": "<mark>James Cameron</mark> Will Begin Work On \"Battle Angel Alita' Movie In 2017 <mark>James Cameron</mark> will begin work on his long-delayed Battle Angel Alita movie once he's finished with the Avatar sequels. The Titanic director has been kicking around the project for quite a few years now. Although it's still several years away, <mark>Cameron</mark> intends to move forward with the project in 2017. The award-winning filmmaker recently sat down with Children of Men Avatar around the globe, it's not altogether surprising that <mark>Cameron</mark> currently has plans to finish out the trilogy. Once those films are out of the way, the director can then move on to something else. MTV News last year that the project was still moving forward. Avatar might be taking up the majority of his time at the moment, but he still has every intention of bringing that story to the big screen .\" [You] would have to be pried out of my cold dead fingers, but, on the other hand, I'm not gonna - I don't wannatake it to my grave, either, \"the director explained. Battle Angel Alita takes place 300 years after a war lays waste to most of the world. The story follows a young female cyborg who is unearthed in some wreckage and eventually repaired. Unfortunately for the poor girl, she has no memory of who she is or where she came from. <mark>James Cameron</mark> also discussed his displeasure with most 3D movies. In his opinion, not every motion picture that comes barreling down the Hollywood pipeline needs to be presented in the format .\" I do not think Hollywood is using the 3D properly. The reason I say that Hollywood is not doing well is because it is automatic. For example, \"Man of Steel,'\" Iron Man 3? and all those movies should not necessarily be in 3D. If you spend 150 million on visual effects, the film is already going to be spectacular, perfect, \"<mark>Cameron</mark> explained. h4 class =\" icon-inq-social-friends widgettitle \"> Inquisitr With Friends h4 class =\" icon-inq-facebook widgettitle \"> Facebook h4 class =\" widgettitle icon-inq-featured-news \"> Featured Stories Firefighter's Remains Identified From WTC Attacks Twelve Years Later", "articleID": "2013070801_00013616_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}}, {"date": "2013-07-08", "url": "http://www.granthamjournal.co.uk/news/local/cannabis-dealer-who-made-2-4k-through-crime-in-grantham-to-have-assets-of-60-seized-1-5261056", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online Grantham court: Attack was \"vicious and unprovoked' Grantham court: Grown men did not behave themselves Princess Diana tree bears fruit for the first time Classical guitarist <mark>John Williams</mark> to perform at Lincoln Cathedral before retirement VIDEO: Ropsley Fox crowned champions of Lincolnshire Bytham won cricket competition - but the beer was ruined! Grantham Journal Cartoon: Tony Hook King's School leavers run riot in Grantham, throwing paint, water bombs and firecrackers Highways chief tours battered roads of Barrowby Grantham Journal Letter:\" What has our MP done for you?' Man denies Costcutter robbery and possession of a machete A Grantham drug dealer given a suspended jail sentence has had assets of just? 60 confiscated following a hearing at Lincoln Crown Court. <mark>Craig White</mark> was given a 12-month sentence suspended for two years with 12 months' supervision when he was sentenced last year. This week, Judge <mark>Sean Morris</mark> ruled that <mark>White</mark> benefited from his crimes by? 2,400 but has only? 60 worth of available assets. He ruled that <mark>White</mark> should hand over the money or face a day in jail in default. An earlier hearing was told that <mark>White</mark> was found with over? 250 worth of cannabis when he was stopped and searched by police in Hornsby Road, Grantham. Phil Howes, prosecuting, said <mark>White</mark>'s phone was seized and later examined. He added: \"The phone is of significance. It appears he was being directed as to what to do and as to where to go although he did a little bit of street dealing as well .\" <mark>White</mark> was released and bailed but five months later was stopped again by officers as he cycled along Goodliff Road in the town. He ran away but discarded a plastic bag which was later found to contain cannabis worth? 400. Mr Howes said: \"We say he was a commercial supplier and played a significant role. Clearly he was a trusted lieutenant of others .\" <mark>Craig White</mark>, 28, of Clyde Court, pleaded guilty to possession of 40.58 g of cannabis with intent to supply on March 27, 2012. He also admitted possession of 25.48 g of the same drug with intent to supply on October 27, 2011. Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Get your favourite newspaper at a great low price. Call us on 0844? 292? 0216 or If you wish, you can contact us using any of the methods below. This website and its associated newspaper adheres to the Press Complaints Commission's Code of Practice. If you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the Editor by clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Grantham Journal provides news, events and sport features from the Grantham area. For the best up to date information relating to Grantham and the surrounding areas visit us at Grantham Journal regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads? Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics? This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers? This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore? ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting? Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot? We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online? Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This? Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2013070817_00079697_W", "names": {"Craig White": ["Q3526919", "Q47128766"], "John Williams": ["Q11310708", "Q12633687", "Q131285", "Q1367551", "Q14950380", "Q15429336", "Q15821602", "Q1606354", "Q16105524", "Q16224055", "Q1702438", "Q18385583", "Q19325807", "Q20821181", "Q20821436", "Q21176199", "Q21481534", "Q22019624", "Q2333172", "Q24249667", "Q25190475", "Q2567288", "Q2688830", "Q28434529", "Q29643791", "Q30122882", "Q30612128", "Q370293", "Q3809678", "Q46993819", "Q49546744", "Q51585685", "Q54932733", "Q56187903", "Q56597939", "Q56604636", "Q6264302", "Q6264304", "Q6264308", "Q6264311", "Q6264317", "Q6264319", "Q6264346", "Q6264352", "Q6264355", "Q6264357", "Q6264363", "Q6264366", "Q6264372", "Q6264380", "Q6264382"], "Sean Morris": ["Q7441275", "Q7441276"]}}, {"date": "2013-07-10", "url": "http://www.freep.com/article/20130710/ENT04/307100053/1035/ent", "content": "Detroit's legal fees could top $100 million for a Chapter 9 bankruptcy Detroit on the brink: As Kevyn Orr pushes for a settlement outside of bankruptcy among Detroit's...Left behind at DTW security: Bolt cutters, snow globes, weapons, more weird stuff From bowling pins to snow globes, hundreds of items are left at Detroit Metropolitan Airport...Storms knocked down trees and power lines in parts of Michigan as heavy rains brought flooding to...Michigan marijuana supporters to tout economic clout by spending $2 bills Jeff Seidel: Lions' Stafford the big winner with short-term deal Did the Lions make the right move by signing Matthew Stafford to a three-year extension? Heck yes. Can the Tigers resume their White Sox hiatus? WHAT HAPPENED: After putting on seven two-out baserunners in the first five innings with Justin...Helene St. James: Chelios, Shanahan helped define glorious decade for Red Wings Top 10 places to see Detroit's pain, promise - with or without Orr's tour for creditors Okay, so Detroit Emergency Manager Kevyn Orr scubbed his bus tour for creditors to visit the city's...China's auto sales growth held steady in June and Japanese brands rebounded from a slump despite a.. . 30 arrested as miners union protests Patriot Coal plan to cut benefits Thirty people were arrested Tuesday as some 5,000 coal miners and their families protested bankrupt...He thought he had food poisoning, but it was appendicitis. Barenaked Ladies back with a new confidence and the old sense of humor Barenaked Ladies hit DTE Energy Music Theatre on Friday with a renewed sense of confidence--and...Elisabeth Hasselbeck is leaving the desk at \"The View' for the couch on Fox News Channel's\" Fox &...The Detroit Zoo is hoping there'll be romance in the air on Thursday. Federal regulations require drug and alcohol testing of critical crewmembers after an accident, but...I'm marking my 10-year anniversary of writing the \"Ask Amy' column by rerunning some of my favorite...Carolyn Hax: Husband needs to stop being woman's shoulder to cry on Detroit Emergency Manager won't be showing bankers and creditors the city today. Editorial: Don't let House Republicans thwart immigration reform House Republicans - including four from southeast Michigan - will meet behind closed doors today to...How would you caption this photo of Detroit Tiger slugger Prince Fielder? E-mail your best ideas by...LONDON - <mark>Elton John</mark> says he is grateful to be alive after learning he had been playing European tour dates while suffering from undiagnosed appendicitis. The 66-year-old musician is quoted in The Sun newspaper today as saying he had struggled through the shows in pain, thinking he had food poisoning. He later learned\" I was a ticking time bomb. I guess I could have died at any time. \"He added:\" I feel so lucky and grateful to be alive. \"On Tuesday, <mark>John</mark> canceled a show in London's Hyde Park and other summer dates while he is treated for an inflamed appendix and surrounding abscess. He is due to have surgery in the next few weeks after treatment with antibiotics. Jeff Seidel: Lions' Matthew Stafford the big winner with short-term deal Emergency Manager Kevyn Orr cancels creditor bus tour of Detroit Appendicitis-hit <mark>Elton John</mark>\" grateful to be alive' He thought he had food poisoning, but it was appendicitis. Jeff Seidel: Lions' Matthew Stafford the big winner with short-term deal Top 10 places to see Detroit's pain, promise - with or without Orr's tour for creditors Detroit's legal fees could top $100 million for a Chapter 9 bankruptcy Left behind at DTW security: Bolt cutters, snow globes, weapons, more weird stuff Metro + state: Livonia's Casey Skinner named to U.S. Senior Trampoline and Tumbling National Team Prep Persons of the Year: Meier twins know meaning of sportsmanship", "articleID": "2013071019_00043635_W", "names": {"Elton John": ["Q16209157", "Q2808"]}}, {"date": "2013-07-10", "url": "http://www.sys-con.com/node/2732281", "content": "News Feed Item Enesco Partners With Hot Brands Vera, Cuipo And lil \"panda, July 10, 2013 / PRNewswire /--New gift lines from Cuipo, lil\" panda and Vera brands, along with a new collection of baby gifts from acclaimed designer Romero Britto highlight the offerings set to be unveiled by Enesco (www.enesco.com) at the Atlanta International Gift and Home Furnishings Mart, Suite 1616. \"Retailers visiting our showroom will quickly see that we are continuing our product evolution with hot lifestyle brands and innovative artists that bring great gift options to the industry,\" said Kathi Lentzsch, Enesco's chief merchandising officer. \"We're particularly passionate about our Cuipo product offering, which saves one meter of rainforest with each purchase, and our distinctive BRITTO beb? line which offers our first full range of baby items .\" New lines and products available to retailers include:, the original Vera, was a trailblazer in creating a lifestyle brand. Best known for her brightly colored mid-century designs, Vera's bold patterns translate beautifully to colorful totes, mugs, tech accessories and glass. Cuipo - Pronounced (kwee-po) this lifestyle brand's mission is to offer and sell products that save the rainforest from deforestation one meter at a time. The collection is comprised of a wide variety of product formats including journals, wall prints and reusable shopping totes. With the purchase of a Cuipo item, consumers become a sponsor for preserving a meter of rainforest and can register for their meter on the Cuipo web site. lil \"panda - This growing character-driven brand is filled with optimistic messages and positivity, targeting the tween to 20 something demographic, the assortment includes figurines, frames, journals, mugs, pillows, totes and plush. Hoots n' Howlers - With this collection, your favorite animals spout cheeky messages that will make any co-worker or friend chuckle. Lorrie Veasey, creator of Really Great News and Our Name is Mud, once again brings original humor and design to giftware. BRITTO beb? - Designed in BRITTO's signature just for gift giving. Created for today's parent with a modern aesthetic, there is nothing traditional about this line. Product offering includes blankets, rattles, onesies, plush, meal time and on-the-go items. Enesco is also introducing new items from a variety of established brands including Holy Crap, Our Name is Mud, Foundations, A Trail of Painted Ponies and the perennially successful Jim Shore Heartwood Creek collection. About Enesco, LLC Enesco, LLC, is a global leader in the giftware and home decor industries serving more than 30,000 customers worldwide. Enesco gift products include some of the world's most recognizable and emerging brands including Jim Shore, Disney, Gund, Department 56 Villages, BRITTO, Vera, Cuipo and lil\" panda. Enesco distributes its products to a wide variety of specialty card and gift retailers, home decor boutiques, department stores, as well as large national chains and direct mail retailers. For more information, visit www.enesco.com. SOURCE Enesco Published July 10, 2013 Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. By Ryan A. Mercer Mike Betz wrote: This approach worked well for me. I'm grateful to the author and to SYS-CON Media for keeping the article here, after all these years. Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to Silicon Valley and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in November at Cloud Expo Silicon Valley. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Expo on November 4-7, 2013 - is to ensure - through an intensive four-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Santa Clara Convention Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in Silicon Valley November 4-7, and maximize those benefits already in 2013. See you in Santa Clara! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in Silicon Valley Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2013071104_00088090_W", "names": {"Carmen Gonzalez": ["Q5043478", "Q9697469"]}}, {"date": "2013-07-06", "url": "http://www.miamiherald.com/2013/07/06/3487517/safety-quin-all-business-and-the.html", "content": "DETROIT--New players. New team. New questions. It's always of concern to coaches how new players fit in with their new surroundings. If Lions defensive coordinator Gunther Cunningham had any questions about free-agent safety Glover Quin, one word told him all he needed to know. \"He is something,\" Cunningham said. \"We had a meeting the other day and I turned to (vice president of pro personnel) Sheldon White and I said,\" Quin .' He goes, \"Professional .' I said,\" That's the best description I've ever heard .' That's him. All about business every day. \"Quin already has shown some of his chops on the field and off it. He mixed in well with the starters during minicamp and he has been trying to encourage younger players in the secondary .\" I think we're shaping up pretty well, \"Quin said .\" We've got a good group of veterans. Me and <mark>Chris Houston</mark> and Ron Bartell and Louis Delmas, and we just signed <mark>Chris Hope</mark>. So we've got a great group of veteran guys. We've got a great group of young guys like <mark>Bill Bentley</mark> and Chris Greenwood and Jonte Green, and we just drafted Darius Slay. \"And then Quin has flashed a little of that professionalism. As a four-year veteran, he understands the practical realities that affect an NFL team's success. While most eyes will be trained on the starters, it could be the younger players on the back end of the roster who determine the secondary's success .\" So I think when guys miss, we always look at it is as next man up, \"he said .\" It's a great opportunity to get that experience, to get that depth. \"As you know, depth wins in this league because a lot of things happen over the course of 16 weeks. Guys go down. All types of stuff happens. So you've got to have guys that are able to come in and fill that role .\" ", "articleID": "2013071406_00026590_W", "names": {"Bill Bentley": ["Q3716821", "Q4908108", "Q4908111"], "Chris Hope": ["Q30085120", "Q5106913", "Q5106914"]}}]