[{"articleID": "2009052604_00008823_W", "names": {"Colin Campbell": ["Q1108386", "Q1108388", "Q1108411", "Q1108531", "Q19414277", "Q22323626", "Q27345368", "Q43911673", "Q5144955", "Q5144956", "Q5144961", "Q55469116", "Q5601509", "Q5601513", "Q56380383", "Q56524218"]}, "date": "2009-05-26", "url": "http://article.nationalreview.com/?q=NDRkNjQxMDMwNGM3MjlkZGY4YTRlODdmOTU4NTZkZWM=", "content": "the older i get, the less patience i have with cleverness. t hey say that people mellow with age. however, the older i get, the less patience i have with cleverness. if increased government spending with borrowed or newly created money is a \"stimulus,\" then the weimar republic should have been stimulated to unprecedented prosperity, instead of the runaway inflation and widespread economic desperation that ultimately brought adolf hitler to power. just days after <mark>colin campbell</mark> informed us that the american people were willing to pay higher taxes in order to get government services - and that republicans therefore needed to stop their opposition to taxes - california voters resoundingly defeated a bill to raise taxes in order to pay for the many government services in that liberal state. they say adversity concentrates the mind. now that republicans have been badly beaten in two consecutive congressional elections, what republican leaders in congress are saying today makes more sense than what they said when they were in power. when my sister's children were teenagers, she told them that, if they got into trouble and ended up in jail, to remember that they had a right to make one phone call. she added: \"don't waste that call phoning me.\" we will never know whether they would have followed her advice, since none of them was ever in jail. one of the most important talents for success in politics is the ability to make utter nonsense sound not only plausible but inspiring. barack obama has that talent. we will be lucky if we escape the catastrophes into which other countries have been led by leaders with that same charismatic talent. when i think of the people with serious physical or mental handicaps who nevertheless work, i find it hard to sympathize with able-bodied men who stand on the streets and beg. nor can i sympathize with those who give them money that subsidizes a parasitic lifestyle which allows such men to be a constant nuisance, or even a danger, to others. how surprising is it that barack obama, who spent decades hanging out with people who spewed out their hatred of america, did not say anything in the presence of foreign rulers like hugo ch á vez and daniel ortega, when they spewed out their hatred of america? we seem to be moving steadily in the direction of a society where no one is responsible for what he himself did but we are all responsible for what somebody else did, either in the present or in the past. why let discussions with visiting celebrities be a constant distraction during a televised tennis match or baseball game? if we each sat down and wrote out all the mistakes we have made in our lives, all the paper needed would require cutting down whole forests. much discussion of the interrogation of captured terrorists ignores the inescapable reality of trade-offs. the real question is: how many american lives are you prepared to sacrifice, in order to spare a terrorist from experiencing distress? governments should govern, not micro-manage the economy. a government unrealistic enough to think it can micro-manage is likely to do a worse job than most. inspiring as it is to study the history of the struggles and sacrifices that created and preserved america, it is also painful to see how all those investments of efforts and lives are being frittered away today for short-sighted and self-centered reasons."}, {"articleID": "2011110317_00069310_W", "names": {"Paul Carter": ["Q15434260", "Q15458398", "Q16230104", "Q22003572", "Q29785709", "Q47400077", "Q53186219", "Q58262322", "Q7149747"]}, "date": "2011-11-03", "url": "http://bbc.co.uk/go/rss/int/news/-/news/uk-england-15581756", "content": "schools in the south east have been given a boost with more than? 32m in extra funding schools in the south east have been given a boost with the announcement that they're to receive more than? 32m in extra funding to increase the number of places available. education secretary michael gove has announced an extra? 500m in all for local authorities which will boost the number of places. it aims to help oversubscribed and cramped schools. surrey is the biggest winner and will receive? 11,327,339. it's followed by west sussex which will receive? 8,656,359. kent county council will get? 4,443,409. medway is next with? 3,836,404. east sussex gets? 2,541,730. and brighton and hove will receive? 1,478,846. final decision mr gove is urging local authorities to \"target resources at managing the shortfalls in pupils' places wherever they are most needed\" and to take into account \"the views of parents\" . kent county council was amongst seven local authorities who went to court over the government's decision to scrap its building schools for the future scheme. mr gove announced back in july 2010 that he had decided to halt the building schools for the future programme, in a bid to save more than? 1bn. his decision means that building plans, worth around? 5bn in total, were stopped, requiring many contracts to be drastically scaled back. the leader of kent county council, <mark>paul carter</mark>, said at the time that the county had got nearly 20 projects \"past the point of no return\" , before the school revamps were halted. good news mr gove has stuck with his decision not to give the local authorities bsf funding. michael gove has stuck with his decision not to give the local authorities bsf funding but he has now said the government will pay the value of the claimant authorities proven contractual liabilities. so in effect if a council, such as kent, has had to pull out of a contract and incurred costs for doing so they can now hope to get that money back. it's good news for kent county council in the week it was announced that the troubled bank dexia has returned? 10m to the authority after being bailed out by the french, belgian and luxembourg governments. and last week the council won a victory in iceland's supreme court, which confirmed its status as a preferred creditor, and said it expected to get back most of the? 50m. 06:11 uk time, wednesday, 2 november 2011 watch wwii vet documents life as a soldier through his drawings cain, accused sexual harassment and the legacy of clarence thomas"}, {"articleID": "2013072012_00010342_W", "names": {"Tom Sullivan": ["Q2440154", "Q7817722", "Q7817726", "Q7817727"]}, "date": "2013-07-20", "url": "http://medicinehatnews.com/2013/07/entertainment/entertainment-news/aurora-newtown-survivors-honour-those-killed-in-movie-shooting-progun-groups-rally-nearby/", "content": "At Comic-Con, Jamie Foxx addresses Zimmerman verdict, says he backs Trayvon Martin's mom Fans hold candlelight vigil for \"Glee\" star Cory Monteith in Vancouver Rapper Kanye West scuffles with paparazzi at Los Angeles International Airport NASCAR suspends use of aerial camera systems pending further investigation Fox says \"Glee' production will be delayed by Cory Monteith's death; series to return Sept. 26 By Dan Elliott, The Associated Press on July 19, 2013. Four-year-old Jake Richards watches as his sister Stephanie makes signs reading\" Remember Aurora, \"during a remembrance event at which the names of people killed by gun violence in America over the past year were read aloud, at Cherry Creek State Park in Aurora, Colo., on Friday, July 19, 2013. Saturday, July 20 marks one year since the Aurora movie theater shooting rampage, which left 12 dead and 70 wounded. (AP Photo/Brennan Linsley) AURORA, Colo. - Survivors of mass shootings in Colorado and Connecticut gathered with dozens of supporters Friday in a suburban Denver park to honour those killed in the massacre at an Aurora movie theatre almost a year to the day after the attack. Vigil participants read a list of names of those killed in recent gun violence around the nation and talked about the pain of losing loved ones as they called for strict federal gun control laws.\" Why wait any longer? \"asked Carlee Soto, whose sister was killed at the Sandy Hook Elementary School rampage in Newtown, Conn.\" The time for change is now. \"Mayors Against Illegal Guns, which promotes tough gun laws and was founded by New York City Mayor Michael Bloomberg, helped sponsor the vigil. The scene was sombre, even as about 100 gun rights activists held a protest nearby to oppose new firearms restrictions as infringements on Second Amendment rights. Many wore orange National Rifle Association hats and T-shirts reading,\" I will not comply. \"\"To the families and victims of the tragedy, we offer our condolences and prayers,\" said Dudley Brown, executive director of Rocky Mountain Gun Owners. \"To Mayor Bloomberg and the group that would politicize this, we offer our opposition.\" Brown helped organize the rally and carried a .45 - calibre pistol to the park. The shooting victims, meanwhile, called for more universal background checks and tighter restrictions on gun sales. Colorado has been the only state outside the East Coast to ratchet back gun rights in reaction to last year's mass shootings. A recent push for new federal restrictions failed in Congress. \"I think that Coloradans get it, that something must change,\" said <mark>Tom Sullivan</mark>, whose son Alex was killed in the theatre. Just before their rally started, one gun rights activist, Rob Blancken, tried to stand behind a lectern with a sign that read, \"Tell billionaire Mayor Bloomberg to stay the hell out of Colorado.\" He was told to move by a state parks ranger. Gun rights organizers said they sympathized with the victims but didn't see new gun control laws as a solution. \"We want the families of the victims to know that we are sorry for their loss,\" said Alicia Perez, a Colorado organizer with Gun Rights Across America. For his part, Stephen Barton, who was wounded in Aurora, said, \"You shouldn't wait until it affects you to start caring about it.\" \"I never thought I would ever be affected by gun violence personally,\" Barton added. Mayors Against Illegal Guns said participants were reading the names of about 2,500 people who have been killed by gunfire since Dec. 14, when a gunman killed 20 first-graders and six adults at Sandy Hook. The Aurora vigil came almost a year to the day after 12 people were killed and 70 others were wounded, some paralyzed, in a July 20 attack at a midnight showing of \"The Dark Knight Rises.\" The victims' names were being read until 12:38 a.m. Saturday, the moment that the shootings began in the theatre last year. The theatre planned no midnight showings on July 20 this year. At least eight uniformed police officers were at the theatre complex Friday, including one inside the auditorium where the shootings took place. Dallas Hill of Aurora, who was among about 30 people who watched \"Red 2? in that theatre Friday night, said he had no qualms about being there.\" We've been in there several times before, \"he said.\" The first couple times (after the shooting) it was a little eerie, \"he said. Denver Archbishop Samuel J. Aquila, accompanied by more than 20 white-robed priests, led a memorial Mass for the theatre victims Friday night at St. Michael the Archangel Catholic Church in Aurora.\" Sin, violence and evil does not have the final word, \"he said in his homily. Names of those killed alternated on video screens outside the sanctuary. Remembrance events planned for Saturday included an early morning memorial service and a host of volunteer civic works, music, arts and even meditation. Aurora officials say they wanted to promote healing. ___ Associated Press writer Thomas Peipert contributed to this report."}, {"articleID": "2014021409_00013986_W", "names": {"Adam Lambert": ["Q190231", "Q30310741"]}, "date": "2014-02-14", "url": "http://www.wsoctv.com/feed/entertainment/american-idol-welcomes-its-first-openly-gay/fX3R3/", "content": "Posted: 7:45 p.m. Thursday, Feb. 13, 2014 RumorFix.com Of course there have always been gay contestants on American Idol. But the singing contest has never had a competitor openly discuss their sexual preference until now. 20-year-old MK Nobilette on Wednesday became the show's first gay competitor. While talking to the judges about whether or not she'd advance to the final 30, she said \"I'm very obviously gay, and there are always gonna be people in America and everywhere else who will definitely hate me. But I think that in the last two years there have been a lot of things that have really changed that, and have made it a positive thing.\" To which judge Harry Connick Jr. responded \"thank goodness.\" Past finalists <mark>Adam Lambert</mark> and Clay Aiken are both gay, but neither publicly came out until after they completed their time on Cox Media Group. By using this website, you accept the terms of our Sign in with your existing account {* loginWidget *} Sign in with your email {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Select a display name and password {* #socialRegistrationForm *} {* socialRegistration_displayName *} {* socialRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* backButton *} {* socialRegistration_signInButton *} Select a display name and password Already have an account? Sign In {* #registrationForm *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* createAccountButton *} {* / registrationForm *} Sign In {* #registrationFormBlank *} {* registration_firstName *} {* registration_lastName *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddressBlank *} {* registration_birthday *} {* registration_gender *} {* registration_postalZip *} {* traditionalRegistration_passwordBlank *} {* traditionalRegistration_passwordConfirmBlank *} {* backButton *} {* createAccountButton *} We have sent you a confirmation email. Please check your email and click on the link to activate your account. We look forward to seeing you frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Don't worry, it happens. We'll send you a link to create a new password. {* #forgotPasswordForm *} {* forgotPassword_emailAddress *} We have sent you an email with a link to change your password. We've sent an email with instructions to create a new password. Your existing password has not been changed. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} {* traditionalSignIn_signInButton *} To sign in you must verify your email address. Fill out the form below and we'll send you an email to verify. {* #resendVerificationForm *} {* resendVerification_emailAddress *} Your Verification Email Has Been Sent"}, {"articleID": "2010041607_00068464_W", "names": {"Peter Steele": ["Q18645861", "Q379250"]}, "date": "2010-04-16", "url": "http://feeds.cbsnews.com/%7Er/CBSNewsNational/%7E3/UXP1TUDo7LY/main6400750.shtml", "content": "expired beer theft: crime or waste management? a distributor sent 1,500 cases of expired beer to the landfill on april 1 in two shipments. the first shipment was destroyed immediately, but the second, containing about 700 cases of budweiser and michelob ultra, was not. (ap) two columbia sanitation workers who apparently couldn't stand by and let beer go down the drain allegedly took dozens of cases of expired brew from the city landfill. police and city supervisors are trying to determine if the salvage was a crime - theft of city property - or just a policy violation. \"if we determine it's a police matter, we will take some action,\" said officer jessie haden, a columbia police spokeswoman. a columbia distributor, scheppers distributing co., sent 1,500 cases of expired beer to the landfill on april 1 in two shipments. the first shipment was destroyed immediately, but the second, containing about 700 cases of budweiser and michelob ultra, was not. margrace buckler, the city's human resource director, said two solid waste division workers, who haven't been identified, brought a city pickup truck to the landfill and hauled off about 50 cases of the beer. word spread of the acquisition. a week later, city officials reviewed video from the landfill and saw the workers drive away with their haul. city officials say they still don't know what happened to the beer. when the sanitation workers were confronted on monday, one quit, the columbia tribune reported. the other could face disciplinary action. buckler said it's likely that at least one landfill employee was involved because \"the assumption is that someone made a phone call.\" once the beer was left at the landfill, it became city property. that means the city could be liable if the sanitation workers shared it with other people, buckler said. scheppers president joe priesmeyer said the expired beer would not be a health concern, although it might have lost some of its taste. he said expired beer is usually dumped at the scheppers' plant unless there is too much for the company to handle. it's not unusual for people to want to take some beer, priesmeyer said. \"every once in a while, we'll have some beer get stolen by overzealous people off of our trucks,\" he said. \"beer is a popular product.\" former director porter goss consented to plan to destroy evidence of waterboarding; white house \"livid\" to find out a glimpse at the day's news as seen through a camera lens the \"cbs evening news\" anchor returns to haiti three months after a devastating earthquake struck the country \"type o negative\" singer, <mark>peter steele</mark>, has died from reported heart failure the pussycat dolls workout \"the early show\" takes a look at the hot new pussycat dolls workout by robin antin tea party supporters gather in washington on tax day to protest government spending and taxation"}, {"articleID": "2014052201_00039166_W", "names": {"Scott Ryan": ["Q19519728", "Q7437179", "Q7437180"]}, "date": "2014-05-21", "url": "http://www.standard.net.au/story/2298439/denningtons-st-johns-primary-school-gets-the-finishing-touches/?src=rss", "content": "h1 itemprop = \"name\" > Dennington's St John's Primary School gets the finishing touches THE final classrooms are ready for pupils at St John's Primary School in Dennington after seven years of planning and millions of dollars in work. THE final classrooms are ready for pupils at St John's Primary School in Dennington after seven years of planning and millions of dollars in work. Principal Kathy Dalton, who has led the school for 21 years, couldn't hide her happiness yesterday as pupils, politicians and parents filed in. \"It's a great school, we're very lucky. Not everyone gets the chance to build a new school,\" she said. \"It's a once in a lifetime thing.\" Even though pupils moved into the newest building last year, the final touches were only added on Tuesday. The principal pointed to two new classrooms, freshly carpeted with blank walls - yet to be wallpapered with student art and posters. \"They were finished just last night. Grade five and six will move into those classrooms in the coming weeks,\" Ms Dalton said. \"We purchased the land in 2007 and the building began in 2008 and we moved into the first stage in 2011.\" The building has been something that we've been doing on a journey. \"The long-serving principal may need to take up gardening with the major project behind her. But she didn't rule out bigger plans as the school undergoes a\" rapid \"increase in enrolments. There are 220 youngsters enrolled at the Catholic school.\" We're a school with an increasing enrolment - rapidly, so who knows, \"Ms Dalton said. The school left its former site on Raglan Parade in 2011, with the vacant site sold to a Geelong-based church this week. A delay in the flight of special guest, Senator <mark>Scott Ryan</mark>, also caused a few laughs as Wannon MP Dan Tehan decided to take over the assembly. Dr Hook's Dennis Locorriere to tell his story in concert in Warrnambool Dr Hook's Dennis Locorriere to tell his story in concert in Warrnambool"}, {"articleID": "2009081014_00061072_W", "names": {"Kenny Watson": ["Q28870736", "Q6391245", "Q6391246"], "Brian Leonard": ["Q4964478", "Q4964479"], "Brian Scott": ["Q27070266", "Q4965241", "Q58918564", "Q9179287"], "Paul Alexander": ["Q19871910", "Q3370446", "Q58218982", "Q7149033"], "Andre Smith": ["Q2846283", "Q4754877", "Q4754878", "Q48977286", "Q493240"]}, "date": "2009-08-10", "url": "http://cincyjungle.com/2009/8/10/983925/kenny-watson-released-by-the", "content": "3 comments well, it's starting. for months, we thought <mark>kenny watson</mark> was a possible casualty. one theory was that the <mark>brian leonard</mark> and <mark>brian scott</mark>. and it appears that the bengals are making that theory one step closer to a reality. bengals cut <mark>kenny watson</mark>. <mark>watson</mark> played six seasons with the bengals, of which only three were uninjured seasons. in 2003 and 2005, he missed significant time and in 2007, he had a career year. other than that, <mark>watson</mark> has been a third-down back and a decent blocker. he's not flashy, but he was definitely a support player. the bengals could easily bring him back. last year the bengals released him on october 4, re-signed on october 7, opening a roster spot for the fifth game of the season. however, this is clearly different as roster cut downs and limitations aren't necessary at this point. you better believe though, the bengals have <mark>watson</mark>'s phone number on rolodex. this also means that the depth chart is pointless and a piece of rubbish. <mark>watson</mark> is still listed as the backup running back. in my mind, the backup running back isn't the first running cut. also released was fullback j.d. runnels, who (you guessed it) was the backup fullback on the team's rubbish depth chart. bengals o-line coach <mark>paul alexander</mark>: \"for one day at one small point in time, i was feeling satisfied\" i believe the geoff was saying he is out of practice. he mentioned a plyer sitting out before he mentioned that <mark>watson</mark> and runnels were cut...then he said \"mathis also out.\" i made the same mistake. not to harp, kirk, but i think you meant to type \"\"bernard' <mark>scott</mark>\" . it threw me for a minute trying to figure out who the heck <mark>brian scott</mark> was. welcome to the sb nation blog about the cincinnati bengals. community blog posts and discussion. recent fanposts smoormandiddy 21 minutes ago 0 comments | 0 recs 4 days ago 9 comments | 0 recs report: <mark>andre smith</mark> looking for a five-year deal worth $40 million <mark>andre smith</mark> holdout isn't the most important storyline; but it is the most popular bengals o-line coach <mark>paul alexander</mark>: \"for one day at one small point in time, i was feeling satisfied\" bengals intra-squad scrimmage tonight; dhani jones leaves georgetown; ndukwe to be in lexington on saturday bengals offered <mark>andre smith</mark> (sixth-round pick) less than what darrius heyward-bey (seventh-round pick) received legend hal mccoy let go at dayton daily news; what does that mean for bengals coverage? claim your spot on the cincy jungle fantasy football league...now!"}, {"articleID": "2014100819_00070757_W", "names": {"Stephen \" Twitch \" Boss": ["Q17711905", "Q21284625"], "Greg Jacobs": ["Q15812791", "Q20657044"], "Elizabeth Banks": ["Q219373", "Q47295776"]}, "date": "2014-10-08", "url": "http://www.tracking-board.com/stephen-twitch-boss-dances-into-magic-mike-xxl/", "content": "by: Donna Whitehead <mark>Stephen \"tWitch\" Boss</mark> will appear in director <mark>Greg Jacobs</mark> MAGIC MIKE XXL. The sequel to Steven Soderbergh's male stripper movie <mark>\"</mark> Magic Mike <mark>\"</mark> catches up with Mike and his friends as they head out on a road trip to a stripper convention. Specific details of <mark>Boss</mark>' character aren't known, but he is playing a stripper. The film stars Channing Tatum (who also co-wrote the script with Reid Carolin), Matt Bomer, Joe Manganiello, Amber Heard, Jada Pinkett Smith, Donald Glover, and <mark>Elizabeth Banks</mark>. <mark>Boss</mark> broke out after starring in the dance movie <mark>\"</mark> Step Up 3D <mark>\"</mark> and subsequent sequels <mark>\"</mark> Step Up Revolution <mark>\"</mark> and <mark>\"</mark> Step Up All In. <mark>\"</mark> He's also appeared on episodes of <mark>\"</mark> Drop Dead Diva <mark>\"</mark> and <mark>\"</mark> Bones. <mark>\"</mark> But <mark>\"</mark> So You Think You Can Dance <mark>\"</mark> fans remember him from his beginnings as a contestant on - and ultimately second-place winner of - the show's fourth season. He has since remained involved with <mark>\"</mark> So You Think You Can Dance, <mark>\"</mark> appearing as an All-Star partner to new contestants. <mark>Boss</mark> is repped by Global Artists Agency and A-Team Entertainment. - TO SEE ALL THE PROJECT DETAILS CLICK HERE - Share This 0 1 0 0 0"}, {"articleID": "2019040603_00130402_W", "names": {"Russell Martin": ["Q1027572", "Q555382"], "Dave Roberts": ["Q5229686", "Q5229688", "Q5229690", "Q5229691", "Q5229692", "Q5229694", "Q5229696", "Q5229697", "Q5229698", "Q5229699", "Q5229701", "Q5229702"], "Rich Hill": ["Q3430418", "Q7323297"], "Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"]}, "date": "2019-04-05", "url": "https://thecourier.com/national-sports-latest/2019/04/05/la-longballs-muncy-bellinger-martin-hr-dodgers-beat-rox/", "content": "Advertisement DENVER (AP)--Cody Bellinger couldn't offer up a deep explanation on why the Los Angeles Dodgers are going deep so often. \"Everyone's feeling good,\" he said. That's deep enough. Bellinger, Max Muncy and <mark>Russell Martin</mark> homered as the Dodgers kept up their longball barrage, beating Colorado 10-6 on Friday in the Rockies' home opener. After hitting a franchise-record 235 home runs last year, the NL champion Dodgers have connected a whopping 21 times in only eight games this season. They've homered in every game so far. What's more, the 21 homers through their opening eight games are the second-most in major league history behind the St. Louis Cardinals, who had 23 in 2000. \"We have a talented lineup,\" Muncy said. \"We're very deep. On top of that, we're all up there and having fun.\" Bellinger hit his sixth of the year, breaking the game open with a three-run drive in the fifth. To think, he didn't hit his sixth homer last season until game No. 41. \"I'm just feeling good and trying to keep it going,\" Bellinger said. Muncy finished a double shy of a cycle, walking in the ninth. He can't remember the last time he ever accomplished the feat. \"That would've been pretty cool,\" Muncy said. Trevor Story homered twice for the Rockies. Kenta Maeda (2-0) threw five efficient innings and cruised through a scuffling Colorado lineup. He allowed four hits and his only run on Nolan Arenado's sacrifice fly. Maeda's biggest pitch was a slider in the fifth that Trevor Story took for a called third strike with two outs and the bases loaded. The Rockies were 0 for 6 with runners in scoring position against Maeda. His secret was simple: \"Have a strong heart,\" Maeda said through a translator. A slow-working Tyler Anderson (0-2) couldn't find his groove in allowing six runs over four innings. Both homers he surrendered were on fastballs. The left-hander is coming off a season in which he gave up 30 homers, tied for the most in the NL. \"They have some guys that are really hot and they stayed hot,\" Anderson said. \"I think really the one that turns it from a day that you're grinding through into a bad day is that Bellinger homer. That was a pretty good pitch that usually in the past he hasn't gotten to that pitch. But he's pretty locked in right now.\" Bellinger's drive off Anderson gave him 16 RBIs. In contrast, the Rockies have 22 RBIs as a team. This was the first of 19 games between two teams that needed a tiebreaker last season to decide the NL West crown before the Dodgers prevailed. It's a burgeoning rivalry in the eyes of the Rockies, but not so much to Los Angeles. \"They're a good club that I have a lot of respect for,\" Dodgers manager <mark>Dave Roberts</mark> said. \"But geography plays into a rivalry.\" TRAINER'S ROOM Dodgers: LHP <mark>Rich Hill</mark> (strained left knee) will throw a 20-pitch bullpen session Saturday ....<mark>Roberts</mark> said he was leaning toward LHP Clayton Kershaw (shoulder inflammation) making another rehab start at Triple-A Oklahoma City. Kershaw gave up two runs and struck out six over 4 1/3 innings in a rehab stint Thursday. <mark>KELLY</mark> UPDATE In the ninth, righty <mark>Joe Kelly</mark> came out of the game after being hit by a comebacker that deflected off his glove and caught him in the right wrist. The X-rays on the wrist were negative. \"He'll pick up a baseball tomorrow and see how it feels,\" <mark>Roberts</mark> said. HOME OPENER The Rockies have now dropped three of their last four home openers. The announced attendance was 48,404. \"(The fans) brought it today and we really didn't,\" Story said. JANSEN CLEARED <mark>Roberts</mark> won't hesitate to use closer Kenley Jansen while in Denver's higher altitude. Jansen had surgery in the offseason to address an irregular heartbeat that surfaced again while in Colorado for a series in August. He didn't travel with the team back to Colorado in September as a precaution. \"We feel the heart thing, we have it at bay with the surgery,\" <mark>Roberts</mark> explained. SIGNING The Rockies announced late in the game they agreed on a minor league contract with LHP Jorge De La Rosa, who turned 38 on Friday. UP NEXT Dodgers: RHP Walker Buehler (0-0, 15.00 ERA) looks to bounce back Saturday against Colorado after a rough opening outing. Rockies: RHP Jon Gray (0-1, 4.05) is 3-4 with a 4.70 ERA in 11 starts against the Dodgers. ___ More AP MLB: https: //apnews.com/MLB and https: //twitter.com/AP_Sports Comments RELATED ARTICLES MORE FROM AUTHOR National Sports Latest Magic use huge 1st half to rout Hawks 149-113 in home finale National Sports Latest Spurs get double-figure scoring from 8, beat Wizards 129-112 National Sports Latest Lamb hits 3-point winner, Hornets beat Raptors 113-111 SPONSORED LINKS Daily Polls TRENDING \"Everyday heroes' help combat child abuse, neglect April 5, 2019 Twice blessed April 5, 2019 I-75 project: Next phase of bridge work ready to start April 5, 2019 CIRCULARS Meijer April 5, 2019 Lowe's Home Improvement April 5, 2019 Brinkman's April 3, 2019 Letters to the Editor The Docket Obituaries Classifieds"}, {"articleID": "2019080401_00226850_W", "names": {"Rahul Sharma": ["Q1088902", "Q12450204", "Q18217995", "Q19898335", "Q21064127", "Q57322528", "Q57432005", "Q57985964", "Q7283625", "Q7283626"]}, "date": "2019-08-03", "url": "http://indianexpress.com/article/cities/ahmedabad/fake-video-case-court-in-gujarat-rejects-police-demand-for-jignesh-mevanis-custody-5876334/", "content": "Cities By Express News Service | Surat | Published: August 4, 2019 5:00:16 am Related News Fake video case: Jignesh Mevani's statement recorded Fake video case: Gujarat HC grants anticipatory bail to Jignesh Mevani Fake video case: Jignesh Mevani moves Gujarat HC for anticipatory bail The court told Jignesh Mevani to appear before Valsad police for questioning on any day between 10 am and 5 pm. (File) A Valsad district court on Saturday rejected a police plea seeking the remand of Vadgam MLA Jignesh Mevani for three days, and instead ordered him to remain present before the investigating officer of Valsad police between 10 am to 5 pm on any day for questioning in the fake video case. Advertising Valsad town police had registered a defamation case against Mevani after he uploaded on his Twitter account a video of a teacher beating a student and attributed it wrongly to RMVM school in Valsad. The independent MLA had also had tagged the prime minister's office in the tweet, seeking action. Mevani later deleted the tweet after coming to know that the video was of some other place and not of RMVM school Valsad. He had also posted a clarification regarding the tweet. Mevani had earlier been granted bail by the Gujarat High Court, which directed him to present himself to Valsad police when called. On August 2, Mevani presented himself for questioning. Police officials first arrested him and later released him as he had anticipatory bail. They later told him to appear in the Valsad district court on Saturday, as they would be seeking his remand. Advertising On Saturday afternoon, Valsad police submitted the application to the court of Judge Hina Desai, seeking three days' police remand. The police said they wanted Mevani's mobile phone for investigation. On August 2, Mevani had refused to hand in his phone, saying there was sensitive communication on it between him and political leaders and other important people. Mevani was present in court with his lawyer advocate Ayaz Shaikh and advocate <mark>Rahul Sharma</mark>. After the arguments from both prosecution and defence, the court rejected the police's plea for remand and ordered instead that Mevani be present before the investigating officer of Valsad police when called. Advocate Shaikh said, \"The judge granted our arguments that it (remanding Mevani) would be a breach of personal liberty of my client. We also explained to the court that police cannot pressure us to hand in the mobile phone, as it would be used against us as evidence. The court had agreed to our arguments and rejected the police remand application.\" "}]