[{"date": "2013-07-06", "url": "http://www.miamiherald.com/2013/07/06/3487517/safety-quin-all-business-and-the.html", "content": "DETROIT--New players. New team. New questions. It's always of concern to coaches how new players fit in with their new surroundings. If Lions defensive coordinator Gunther Cunningham had any questions about free-agent safety Glover Quin, one word told him all he needed to know. \"He is something,\" Cunningham said. \"We had a meeting the other day and I turned to (vice president of pro personnel) Sheldon White and I said,\" Quin .' He goes, \"Professional .' I said,\" That's the best description I've ever heard .' That's him. All about business every day. \"Quin already has shown some of his chops on the field and off it. He mixed in well with the starters during minicamp and he has been trying to encourage younger players in the secondary .\" I think we're shaping up pretty well, \"Quin said .\" We've got a good group of veterans. Me and <mark>Chris Houston</mark> and Ron Bartell and Louis Delmas, and we just signed <mark>Chris Hope</mark>. So we've got a great group of veteran guys. We've got a great group of young guys like <mark>Bill Bentley</mark> and Chris Greenwood and Jonte Green, and we just drafted Darius Slay. \"And then Quin has flashed a little of that professionalism. As a four-year veteran, he understands the practical realities that affect an NFL team's success. While most eyes will be trained on the starters, it could be the younger players on the back end of the roster who determine the secondary's success .\" So I think when guys miss, we always look at it is as next man up, \"he said .\" It's a great opportunity to get that experience, to get that depth. \"As you know, depth wins in this league because a lot of things happen over the course of 16 weeks. Guys go down. All types of stuff happens. So you've got to have guys that are able to come in and fill that role .\" ", "articleID": "2013071406_00026590_W", "names": {"Chris Houston": ["Q2964741", "Q5106926", "Q5106927"]}}, {"date": "2013-07-16", "url": "http://theleafchronicle.com/viewart/20130716/NEWS01/307160013/Criticized-Petraeus-take-1-salary-NY-school", "content": "Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the...A Clarksville man has been arrested on drug charges following a search of his home on Peacher's...\"Toxic leadership' a rare but potent trigger in Fort Campbell suicides A challenging schedule has always been a part of the formula for Austin Peay women's basketball...Austin Peay's offense figures to rely more heavily on the passing game this fall under its new...Let me get this clear. - 3:32 pm LETTER: Legislators should be fighting for teachers, not against them Delusions of Glamour: Books and exotic experiences take young minds far away When I was a kindergartner, I had this wonderful teacher who sent my mind reeling toward exotic...Diane Welker's At the Table: Hot diggety dog, eat 'em in honor of hot dog month July is National Hot Dog month, and I almost let it slip by unnoticed...NEW YORK - Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the City University of New York's honors college after being criticized for how much he was getting paid. Petraeus, a hero of the Iraq and Afghanistan wars who quit the CIA in scandal last November after it was uncovered he'd had an affair with his biographer, will teach a seminar at Macaulay Honors College in the next academic year for $1, The New York Times reported on Monday. That's down quite a bit from the $200,000 that Gawker.com first reported he was getting paid based on documents it obtained. The high salary for someone teaching one class spurred outrage in a system in which the average full-time faculty member salary is just under $90,000. Petraeus, who was a four-star general, proposed the salary reduction\" to remove money as a point of controversy, \"his attorney said .\" The general never was taking on this teaching assignment for the money, \"said the attorney, <mark>Robert Barnett</mark>.\" Once controversy arose about the amount he was being paid, he decided it was much more important to keep the focus on the students, on the school and on the teaching and not have it be about the money. \"Petraeus has a doctorate from Princeton University and has written widely on international relations, military strategy and tactics and national security issues. He's scheduled to start his job as a visiting professor for public policy on Aug. 1. When Macaulay announced Petraeus' new job in April, he said he was pleased to teach at the college, where most students are the children of immigrants. He said he looked forward to leading a seminar on the global economic slowdown. Macaulay Honors College's dean, Ann Kirschner, said Petraeus has\" engaged the Macaulay and CUNY community with generosity and energy. \"\"Toxic leadership' a rare but potent trigger in Fort Campbell suicides Criticized Petraeus to take $1 salary at NY school Former CIA director David Petraeus is taking a big salary cut for his visiting professorship at the City University of New York's honors college after being criticized for how much he was getting\" Toxic leadership' a rare but potent trigger in Fort Campbell suicides Become a subscriber today to enjoy these benefits: iPad-optimized edition Mobile site & iPhone app Are you currently a subscriber? Set up your digital access now. You now have full access. Thank you for subscribing. Access the tablet-optimized site, mobile site and iPhone app Share your access with any friend or family member Subscriber exclusive Top 5 daily email newsletter Create an account or if you have a digital profile To continue using your current Web browser, Adobe Flash must be installed or upgraded:", "articleID": "2013071622_00046206_W", "names": {"Robert Barnett": ["Q3348517", "Q3434508", "Q57084965"]}}, {"date": "2013-07-16", "url": "http://www.firstpost.com/politics/bjp-questions-nitin-kumar-on-jdus-support-on-food-security-ordinance-960571.html", "content": "Challenge Congress to debate on development, governance: Venkaiah Clarke called Watson a cancer on Australian team, says Mickey Arthur I-League's JSW sign two players with experience in English football Anti-Sikh riots case: Delhi HC rejects Sajjan Kumar's plea against retrial Bihar to build 1,000 higher secondary schools every year: <mark>Nitish</mark> Solar Scam: HC reserves order on bail plea of Chandy's former secy The UK's proposed Rs 2.7 lakh visa \"deposit' is all about poli...Defence ministry clears MDL-Pipavav JV sans preferential treatment Murthy's return signals admission of failure by Infosys; can he do a Steve...Penalty notice of Rs 650 cr leaves us no choice but to litigate: Bharti Airtel Slowdown is here to stay: After Maruti, M & M lays off temporary staff With 100% FDI in telecom Sibal hopes to make sector more attractive Lost your job? Worry not. Here's how to create a second stream income Rupee effect: Trusts become more sensitive in doling out scholarships India vulnerable to deadly MERS virus, but no screening at airports yet Fashion designers Dolce and Gabbana sentenced to jail for tax evasion Movie review: Nawazuddin Siddiqui, Huma Qureishi steal the show in\" Shorts...Journey to <mark>Michael Jackson</mark>: Listen to Cory Monteith's top five Glee songs Rolling Stones make their first appearance at Glastonbury festival No big deal: Rajasthan CM Gehlot is not the only one buying Facebook likes Instagram will now let users embed photos, videos across the web BlackBerry Q5 in India for Rs 24,990: What we like and don't like about it BlackBerry Q5 review: Solid phone, but is Rs 24,990 too steep a price? Will Nokia Lumia 1020 kill Samsung S4 zoom? Critics say it could Here's a list of NaMo's plans for India and Rahul Gandhi's rep.. . Apple conspired with publishers to fix ebook prices, rules judge New Delhi: Amid reports of a growing proximity between its old ally JD (U) and Congress, BJP today asked Bihar Chief Minister <mark>Nitish Kumar</mark> if his party will support the Food Security Ordinance when it is launched by the UPA government on Rajiv Gandhi's birth anniversary. Continuing with its jibes against <mark>Kumar</mark> on the issue of his increasing closeness to Congress, a party he had been criticising for 17 years when the JD (U) was a part of NDA, BJP said the Bihar chief minister should come clear on whether he is allying with Congress. <mark>Kumar</mark> has already welcomed the move to bring the food security legislation while BJP is opposed to some provisions of the ordinance which is already in place. \"We will not oppose the Food Security Bill when it comes up for discussion and passage in Parliament but we want the loopholes in the bill to be removed,\" BJP spokesperson Shahnawaz Hussain said. <mark>Nitish Kumar</mark>. PTI He maintained that a democratic country functions on the basis of people's mandate (as reflected in the opinion of Parliament) and not through ordinances. Congress has lost this mandate, he added. Hussain said the ordinance route for food security is wrong. \"Only the Congress ruled states and Bihar are supporting the Food Security Ordinance. Will the JD (U) government implement it in Bihar if it is inaugurated on the birth anniversary of Congress leader Rajiv Gandhi (August 20)?\" he Bihar to build 1,000 higher secondary schools every year: <mark>Nitish</mark> Firstpost encourages open discussion and debate, but please adhere to the rules below, before posting. Comments that are found to be in violation of any one or more of the guidelines will be automatically deleted: Personal attacks/name calling will not be tolerated. This applies to comments directed at the author, other commenters and other politicians/public figures Please do not post comments that target a specific community, caste, nationality or religion. While you do not have to use your real name, any commenters using any Firstpost writer's name will be deleted, and the commenter banned from participating in any future discussions. A document from a file received by the Home Minister reveals that 26/11 conspirator David Coleman Headley did know about Ishrat Jahan. The Modi-phobia of some groups of people has hijacked the discourse on post-2002 Gujarat. But inside Gujarat, Muslims are coming to terms with Modi, and so far 178 different groups of Muslims have met him to take forward their development dialogue. BlackBerry Q5 review: Solid phone, but is Rs 24,990 too steep a price? The big question though would be whether the price tag of Rs 24,990 would be seen as too expensive for a price-sensitive market like India where Android smartphones with far better specs on paper retail for less. TOI Crest shuts down: when TV can sell to niche audiences why can't print? Circulation shrank, the cover price stayed static and the advertisers went away, first in a trickle and then in a flood. Ishrat Jahan case: Is Satish Verma a crazed conspiracy theorist? In a letter to the government, former home ministry bureaucrat RV Mani alleges Verma claimed 26/11 and 13/12 were government conspiracies. Isn't Broad as guilty of cheating as Ramdin? Cricket is not a gentleman's game any more and there are a few good men around, but Broad is certainly not one of them. Samsung Galaxy S4 mini to cost Rs 27,990, available from Thursday The Samsung India online store has put the Samsung Galaxy S4 mini up for pre order on its online store at a price tag of Rs 27,990 Decoding the Modi Q & A with Reuters throws up some pointers on where he is not at his best. His spin doctors have a lot of work to do on his rough edges The first thing everyone recalls when they hear \"Pran\" is the look that was almost his trademark: a raised eyebrow, a piercing gaze and sneer-curled lips. A friend of the great Pakistani short-story writer Sadat Hasan Manto and the only villain who commanded more respect (and fatter pay cheques) than heroes, Pran was a proper [...] <mark>Kapil</mark>, Tendulkar or Dhoni: Who is India's greatest ODI cricketer? That is a stunning record and it makes one wonder where Dhoni ranks among India's finest ODI cricketers; where does he rank in comparison to Sachin Tendulkar and <mark>Kapil Dev</mark>; what is his standing...Did BJP just get endorsed by one of India's leading intellectuals? Did the BJP get its first mainstream media endorsement in Pratap Bhanu Mehta's IE column? Mumbai train blasts: Why the real perpetrators may never face justice In 2008, a man called Sadiq Israr Sheikh told the police and intelligence services he had carried out the 7/11 bombings. His claims were dismissed by the Mumbai Police, though official documentation obtained by Firstpost show police in three states and the central intelligence services found them credible. 2014 polls: Why Cong will look to alliances and not Rahul Gandhi The BJP is looking at a Rahul vs Modi style Presidential style 2014 Lok Sabha campaign, but the Congress strategy is very different. Movie review: Bhaag Milkha Bhaag is a near-flawless homage to the Flying Sikh Faster conviction in case of politicians would help cleanse the system better. Who's going to ensure that? Till today we don't know about the truth of Narendra Modi's alleged complicity in the Gujarat communal riots or the encounter deaths. Therefore it would prudent to hold our judgment on him. India's softly-softly approach to the latest instance of Chinese border provocation in Ladakh shows that it has not learnt one important lesson: rolling over and playing dead is a bad strategy to take on Chinese aggression on the border. Leaked to al-Jazeera yesterday, the findings of Pakistan's Commission of Inquiry into the raid which killed Osama will occupy journalists and historians for years. The BJP's defensiveness on Ishrat Jahan and its missteps on the Ram Temple show that the Congress has shifted focus away from its own failures. Sikhs' new fight in America: The US Army Sikhs have truly been path breaking pioneers into the west. They have taken the burden of difference on themselves in way most other Indian immigrants have not had to. While other desis could assimilate in some fashion, Americanize themselves in ways, Sikhs stood out.", "articleID": "2013071622_00070058_W", "names": {"Kapil Dev": ["Q16200677", "Q558189"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Nitish Kumar": ["Q122304", "Q7041330"]}}, {"date": "2013-07-17", "url": "http://www.local8now.com/home/headlines/Man-nearly-beaten-to-death-over-loud-music-215769581.html", "content": "A Jefferson County man is out of the hospital after he was nearly beaten to death. <mark>Tim Brown</mark> was at his house when he was beaten with a baseball bat and a crowbar. Family say it was Browns girlfriend and her son, Shannon Green, who was charged with the assault. The family says <mark>Brown</mark> was attacked because of loud music. Browns younger brother, couldn't believe what happened. He says, \"I freaked out, I, I immediately freaked out. I didn't know what to do .\" Another family member told the brother that <mark>Brown</mark> had been beaten up. He says its a good thing someone said something. \"If someone hadn't come and told me, I don't know how we would've found him,\" says the brother, who didn't want to be identified. Partly sunny, hot, isolated storms Wednesday Crimetracker: Officer fires at suspect during foot chase in Old City WVLT VOLUNTEER TV 6450 Papermill Drive Knoxville, TN 37919 Phone - (865)? 450-8888; Fax - (865)? 450-8869", "articleID": "2013071711_00001591_W", "names": {"Tim Brown": ["Q1735158", "Q18808538", "Q245633", "Q50579797", "Q554239", "Q56798375", "Q57514683", "Q58455196", "Q724801", "Q7803232", "Q7803233"]}}, {"date": "2013-07-20", "url": "http://medicinehatnews.com/2013/07/entertainment/entertainment-news/aurora-newtown-survivors-honour-those-killed-in-movie-shooting-progun-groups-rally-nearby/", "content": "At Comic-Con, Jamie Foxx addresses Zimmerman verdict, says he backs Trayvon Martin's mom Fans hold candlelight vigil for \"Glee\" star Cory Monteith in Vancouver Rapper Kanye West scuffles with paparazzi at Los Angeles International Airport NASCAR suspends use of aerial camera systems pending further investigation Fox says \"Glee' production will be delayed by Cory Monteith's death; series to return Sept. 26 By Dan Elliott, The Associated Press on July 19, 2013. Four-year-old Jake Richards watches as his sister Stephanie makes signs reading\" Remember Aurora, \"during a remembrance event at which the names of people killed by gun violence in America over the past year were read aloud, at Cherry Creek State Park in Aurora, Colo., on Friday, July 19, 2013. Saturday, July 20 marks one year since the Aurora movie theater shooting rampage, which left 12 dead and 70 wounded. (AP Photo/Brennan Linsley) AURORA, Colo. - Survivors of mass shootings in Colorado and Connecticut gathered with dozens of supporters Friday in a suburban Denver park to honour those killed in the massacre at an Aurora movie theatre almost a year to the day after the attack. Vigil participants read a list of names of those killed in recent gun violence around the nation and talked about the pain of losing loved ones as they called for strict federal gun control laws .\" Why wait any longer? \"asked Carlee Soto, whose sister was killed at the Sandy Hook Elementary School rampage in Newtown, Conn.\" The time for change is now. \"Mayors Against Illegal Guns, which promotes tough gun laws and was founded by New York City Mayor Michael Bloomberg, helped sponsor the vigil. The scene was sombre, even as about 100 gun rights activists held a protest nearby to oppose new firearms restrictions as infringements on Second Amendment rights. Many wore orange National Rifle Association hats and T-shirts reading,\" I will not comply. \"\"To the families and victims of the tragedy, we offer our condolences and prayers,\" said Dudley Brown, executive director of Rocky Mountain Gun Owners. \"To Mayor Bloomberg and the group that would politicize this, we offer our opposition .\" Brown helped organize the rally and carried a .45 - calibre pistol to the park. The shooting victims, meanwhile, called for more universal background checks and tighter restrictions on gun sales. Colorado has been the only state outside the East Coast to ratchet back gun rights in reaction to last year's mass shootings. A recent push for new federal restrictions failed in Congress. \"I think that Coloradans get it, that something must change,\" said <mark>Tom Sullivan</mark>, whose son Alex was killed in the theatre. Just before their rally started, one gun rights activist, Rob Blancken, tried to stand behind a lectern with a sign that read, \"Tell billionaire Mayor Bloomberg to stay the hell out of Colorado .\" He was told to move by a state parks ranger. Gun rights organizers said they sympathized with the victims but didn't see new gun control laws as a solution. \"We want the families of the victims to know that we are sorry for their loss,\" said Alicia Perez, a Colorado organizer with Gun Rights Across America. For his part, Stephen Barton, who was wounded in Aurora, said, \"You shouldn't wait until it affects you to start caring about it .\" \"I never thought I would ever be affected by gun violence personally,\" Barton added. Mayors Against Illegal Guns said participants were reading the names of about 2,500 people who have been killed by gunfire since Dec. 14, when a gunman killed 20 first-graders and six adults at Sandy Hook. The Aurora vigil came almost a year to the day after 12 people were killed and 70 others were wounded, some paralyzed, in a July 20 attack at a midnight showing of \"The Dark Knight Rises .\" The victims' names were being read until 12:38 a.m. Saturday, the moment that the shootings began in the theatre last year. The theatre planned no midnight showings on July 20 this year. At least eight uniformed police officers were at the theatre complex Friday, including one inside the auditorium where the shootings took place. Dallas Hill of Aurora, who was among about 30 people who watched \"Red 2? in that theatre Friday night, said he had no qualms about being there .\" We've been in there several times before, \"he said .\" The first couple times (after the shooting) it was a little eerie, \"he said. Denver Archbishop Samuel J. Aquila, accompanied by more than 20 white-robed priests, led a memorial Mass for the theatre victims Friday night at St. Michael the Archangel Catholic Church in Aurora .\" Sin, violence and evil does not have the final word, \"he said in his homily. Names of those killed alternated on video screens outside the sanctuary. Remembrance events planned for Saturday included an early morning memorial service and a host of volunteer civic works, music, arts and even meditation. Aurora officials say they wanted to promote healing. ___ Associated Press writer Thomas Peipert contributed to this report.", "articleID": "2013072012_00010342_W", "names": {"Tom Sullivan": ["Q2440154", "Q7817722", "Q7817726", "Q7817727"]}}, {"date": "2013-07-21", "url": "http://kuer.org/post/woman-among-men-female-firefighter-blazed-trail", "content": "During a drill, teenage girls attending a firefighting camp secure their counselor, firefighter Clare Burley, for a basket rescue at Arlington County's fire station. Arlington County, Va., wants more female firefighters. The fire department there has even set up a camp to inspire potential recruits. Donning helmets and matching camp shirts, teenage girls line up to watch a demonstration: A model room with furniture is ablaze. Camper Tara Crosey says she came to camp in part because she \"wanted to show that girls are as strong as boys and girls can do what boys can do .\" The glass ceiling in this department was broken by Judy Brewer in 1974, when she became the nation's first female career firefighter. She paved the way, but the road to a career as a firefighter is still obscured for many women. That's what Arlington County firefighter Clare Burley is hoping to change with this camp, which started last year. She and her colleagues wanted to give girls an introduction to this potential career path. \"Little boys always hear about it - they get little fire trucks as toys - and girls never really get that kind of introduction,\" she tells <mark>Rachel Martin</mark>, host of Weekend Edition Sunday. \"So we wanted to get them thinking about it, come play with us, you know, see what we do, see how many female firefighters are here .\" Compelled To Help When Judy Brewer decided to become a firefighter in the '70s, there weren't other women to look to. But she was helping her then-husband study for his fire science degree, and (Warning: Images in the publication may be disturbing for some viewers .) \"I had read a publication called America Burning, and was really struck by the pictures of the absence of children, say, in a crib,\" she tells Weekend Edition. \"They would also have pictures of children that were hiding in a closet or under a bed or next to a bureau because they didn't know what to do and they couldn't get out .\" So she thought, \"I'd really like to be able to do something to at least save somebody .\" Support for Brewer's decision came from her family, particularly her four sisters. But not everyone was in favor of the career move. \"When I applied at my local fire station to volunteer in Fairfax County, I was told essentially to go back to my kitchen, it was no place for a woman,\" she says. Fellow churchgoers asked how she could \"lower\" herself to do that kind of job. Brewer's fellow firefighters weren't accepting, either. \"When I first was hired, people were worried about different things,\" she says. \"The one that they used as a reason was that they were afraid that I would compromise them in a fire by not being able to help them if they got into trouble .\" She had no doubts about her own abilities, though, and just maintained her physical shape - and stood her ground - until they decided to let it go. Brewer says it took nearly two years for her to feel accepted as part of the team. Over the years, Brewer did save \"many, many, many people .\" But, she says, \"The ones that stick with me are the ones that I couldn't save .\" There weren't always support services for firefighters, and some incidents affected her more than she realized at the time. Ultimately, however, she says she had to put the losses behind her. \"And you just keep saying, OK, I'm doing a lot of good. And you just keep moving forward,\" she says. Brewer served the Arlington County Fire Department from 1974 to 1999. When she retired, she was the first female battalion chief in the country. Doing More Fast-forward to the current team of Arlington County firefighters, and you'll find not one but 22 women. That's out of more than 300 firefighters. Firefighter Burley says that's pretty good, compared to the rest of the country. The Bureau of Labor Statistics reports that in 2012, women made up 3.4 percent of the nation's firefighters. \"But it's still a pretty small proportion. And it seems like the newest recruit classes are actually getting fewer women, not more,\" she says. \"So we feel like we need to do something more, get out in the community, and talk to girls a little bit more about choosing the fire service as a career .\" ", "articleID": "2013072117_00041038_W", "names": {"Rachel Martin": ["Q16211141", "Q7279321"]}}, {"date": "2013-07-22", "url": "http://uk.reuters.com/article/2013/07/22/europe-markets-stocks-switzerland-idUKL6N0FL0VV20130722?feedType=RSS&feedName=rbssFinancialServicesAndRealEstateNews", "content": "* SMI year-to-date outperformance set to fade * Fund flows show cash left Switzerland in June * Options among most expensive in the region - traders LONDON, July 22 (Reuters) - Signs of an impending retreat from buoyant Swiss stocks may signal the start of a new hunger for risk among investors. Swiss equities have been a perfect middle ground for investors moving out of super-low-yield crisis-era havens such as gold, Swiss franc deposits and U.S. Treasuries, but reluctant to dive back into growth-driven, high-yielding securities. Up 16 percent year to date, Swiss stocks have beaten major European bourses, clocking up gains even while safe-haven gold tumbled 24 percent and the riskier end of equities in emerging markets lost 9 percent. Switzerland's blue-chip SMI index has lagged over the past couple of months, however, eking out just 0.6 percent gains since end-April against 4.3 percent for Germany's DAX and 2.6 percent for Britain's FTSE 100. Higher profits for Swiss banks UBS and Julius Baer helped lift the index on Monday. But banks - which typically outperform a rising market - have a greater weighting in the FTSE, while the DAX has more stocks such as carmakers, which also outperform in a rally. Switzerland's blue-chips are weighted more towards stocks seen as \"defensive\" because of the stable demand for their products, such as pharmaceuticals firms and food groups. The Swiss franc's strength versus other currencies - despite a central bank cap on its exchange rate against the euro - may be helping drive investors towards rival markets such as the FTSE, which has been boosted by a weak pound. \"Switzerland is the most defensive (European) market, which explains its outperformance in volatile low growth times,\" said Old Mutual Global Investors fund manager Kevin Lilley. \"But with the broader economy set to improve, it is difficult to see it sustaining this performance relative to the UK and Germany .\" Factors that attracted investors to Switzerland included cash-rich firms with steady earnings that gave a lot back through dividend payouts, such as food company Nestle, and pharmas Roche and Novartis. While that largesse remains - all three have a forward dividend yield around 3.5 percent - the market's \"hunt for yield\" in the face of low bond market returns has left regional peers looking more attractive on a valuation basis. The FTSE 100 trades on a price to earnings (P/E) ratio of 13.6 while the DAX is on a P/E ratio of 13.5 - both cheaper than the Swiss SMI's P/E of 18.2. A desire to tap into that better growth outlook has already seen money leave Swiss equity funds for 11 straight weeks to the end of June, data from fund flow tracker firm EPFR showed. And while some, such as Morgan Stanley, still favour Switzerland, further outflows are likely to follow. ING Investment Management senior equities strategist Patrick Moonen, said he was considering cutting Swiss equities to \"underweight\" from \"neutral\" , while HED Capital chief <mark>Richard Edwards</mark> has also advised clients to sell any rallies in the SMI. For those who choose to remain invested, the cost of buying protection against future price falls in the options market has increased over the last two months and now ranks among the most expensive in Europe. We welcome comments that advance the story through relevant opinion, anecdotes, links and data. If you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. Views expressed in the comments do not represent those of Reuters. For more information on our comment policy, see http: //blogs.reuters.com/fulldisclosure/2010/09/27/toward-a-more-thoughtful-conversation-on-stories/ Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance Thomson Reuters is the world's largest international multimedia news agency, providing, and interactive television platforms. Thomson Reuters journalists are subject to an", "articleID": "2013072219_00057519_W", "names": {"Richard Edwards": ["Q20734271", "Q27055794", "Q42554954", "Q5102905", "Q7325461", "Q7325464"]}}, {"date": "2013-07-22", "url": "http://www.thewrap.com/tv/media/column-post/nate-silver-officially-joins-espn-104986", "content": "<mark>Nate Silver</mark>'s Blog to Be Its Own ESPN Franchise (Updated) \"Matthew Perry to Grill Lisa Kudrow in Mini -\" Friends' Reunion on \"Piers Morgan Live' <mark>Nate Silver</mark>'s Blog to Be Its Own ESPN Franchise (Updated) Follow @ SaraMorrison <mark>Nate Silver</mark>'s FiveThirtyEight blog will become its own franchise at ESPN, with its own team of journalists, editors and analysts, the network said in officially announcing his move Monday. FiveThirtyEight will be similar to Bill Simmon's Grantland, which is also owned by ESPN. ESPN purchased the FiveThirtyEight name and URL, the network announced in a conference call. Previously, <mark>Silver</mark> owned those rights and licensed them to the New York Times for a three-year contract. ESPN would not disclose how much it paid for the franchise. Its deal with <mark>Silver</mark> is a\" long-term, multi-year deal. \"<mark>Nate Silver</mark> Leaves New York Times for ESPN <mark>Silver</mark> will also contribute to ABC's election coverage through at least the 2016 elections. That's about all we know right now--ESPN president John Skipper said on the call that the rumored appearances on Keith Olbermann's upcoming show and contributions to Oscar coverage were only rumors:\" Speculative notions on where <mark>Nate</mark> will appear on television are just wrong. \"There is no set date for the new FiveThirtyEight's debut, but <mark>Silver</mark> said on a conference call that it should be in the coming months as he hires staff and builds the site. A smaller blog version of the site will be up in the interim .\" This is a dream job for me. I'm excited to expand FiveThirtyEight's data-driven approach into new areas, while also reuniting with my love of sports, \"<mark>Silver</mark> said in a statement .\" I'm thrilled that we're going to be able to create jobs for a great team of journalists, writers and analysts. \"For <mark>Nate Silver</mark>, the Late Apologies Are Trickling In <mark>Silver</mark> is best known for his nearly dead-on election predictions in 2008 and 2012. The New York Times began hosting his blog in 2010 for its election coverage, though <mark>Silver</mark> started his career predicting baseball outcomes. tweeted:\" There are lots of amazing people in the NYT newsroom. I will miss them. I greatly admire the job that Jill Abramson is doing. \"\"Angry Birds Star Wars 2' Coming to App Store in September (Video) Keri Russell Is Searching for the Fictional Man of Her Dreams in\" Austenland' Trailer (Video) Happy Mandela Day: 5 Great Interviews in the Life of a Legend (Video) A Week After Trayvon Martin Verdict, \"Fruitvale Station' Strong at Box Office Comic-Con 2013:\" Community's' Dan Harmon Apologizes to Fans, \"I'm a Bad Person'\" The Conjuring' Buries \"R.I.P.D.' With Record $41M Box-Office Debut (Video)", "articleID": "2013072304_00029204_W", "names": {"Nate Silver": ["Q562521", "Q6968719"]}}]