[{"articleID": "2012010920_00019152_W", "names": {"Pargat Singh": ["Q21622901", "Q7136959"]}, "date": "2012-01-10", "url": "http://news.in.msn.com/national/article.aspx?cp-documentid=5738257", "content": "10/01/2012 advocates seek action against nakkheeran editor chennai, jan 9 (pti) about 100 advocates today petitioned the press council of india, seeking an inquiry and action against the editor and publisher of tamil bi-weekly magazine \"nakkheeran\" for its article on tamil nadu chief minister jayalalithaa. the advocates contended that the article was \"definitely inflammatory and against the spirit and language to be followed by any law abiding print media\". they claimed the january 7 article \"is a totally fictionalised account and has tarnished her image\". akali dal fields olympian <mark>pargat singh</mark>, sukhbir badal files nomination the ruling shiromani akali dal in punjab monday announced that former indian hockey captain <mark>pargat singh</mark> will be the party's candidate for the jalandhar cantt seat in the jan 30 assembly poll. chief election commissioner (cec) s.y. quraishi monday brushed aside criticism of the directive to cover statues of bahujan samaj party (bsp) leader mayawati and the party symbol of elephant in poll-bound uttar pradesh and said the decision was in accordance with the model code of conduct. counting for the assembly polls in five states will be held march 6 instead of march 4, the election commission announced monday after rescheduling the date of uttar pradesh's first phase election to march 3. taking the spat with ally congress into the open for the first time by holding a public rally, the trinamool congress on monday bluntly asked it to choose its manner of exit from the alliance in west bengal."}, {"articleID": "2015010521_00005921_W", "names": {"Jason Wright": ["Q16214266", "Q29048721", "Q42829331", "Q6163814"], "Bob Jones": ["Q4932955", "Q4932956", "Q4932957", "Q4932958", "Q4932959", "Q4932961", "Q56526001", "Q7343799"]}, "date": "2015-01-05", "url": "http://theblaze.com/contributions/is-your-local-telephone-company-really-a-villain", "content": "<mark>Jason Wright</mark> is a New York Times best-selling author of 10 books, including They're the villain you love to hate. If the new \"Star Wars\" movies reveal more children for Darth Vader, they will all be named after local telephone companies. In countless communities around the country, this utility is one plump piñata. But instead of mints and mini Milky Ways, it's packed with plastic modems and Ethernet cables. \"Step right up! Swing away!\" In my corner of the world - Virginia's Shenandoah Valley - the longtime bad guy goes by the name Shentel. Like any other phone company, the common complaints cover the phone bill, Internet speeds or why <mark>Bob Jones</mark> can't watch the Underwater Penguin Poker Network. That's probably not a real channel, but if it were, <mark>Bob</mark> would rant that it's not available on Shentel. \"I need my penguins playing cards!\" Perhaps it's unavoidable. After all, they're a utility, and for generations they've been easy targets with their costar antagonists: the power, water and gas companies. Is it really possible that with so many customers across such a large market that sometimes, maybe, just maybe, believe it or not, they actually do something right? Bays of equipment stand in the 4G area at an AT & T mobile telephone switching office on October 25, 2012 in Charlotte, North Carolina. The center handles wireless AT & T traffic from the western part of North Carolina. (Photo by John W. Adkisson/Getty Images) Let's see. About a month ago, I discovered that the AT & T Microcell that sits perched by the window of my building in Woodstock, Virginia had stopped working. The device functions like a cell phone signal booster and I tried the normal quick fix. I unplugged it, counted to 60, turned my pajamas inside out, flushed three ice cubes and plugged it back in again. Nothing, though we did get a little snow. I took a deep breath, mumbled a prayer and called AT & T's customer service. They waved a wand, spouted some numbers and told me the problem was mine. \"Call your local Internet service provider and tell them they need to quit blocking your ports .\" \"I'm not trying to sail anywhere. I just want my device to work .\" I laughed. They didn't. I explained that no changes had been made on my end and that the device had been working well for three years. It's had only a handful of minor hiccups always solved with the restarting and ice cube tricks. And thus began a three-week adventure with my local telephone company. We started with one call, then another, and another and another. The issue climbed rung by rung up the support ladder and even though the problem was not yet solved, the service was outstanding. Never once did they blame AT & T or whisper even a negative word. Nor did they make me feel as though I had somehow created the problem myself, a common tactic in the tech support world. We tried it all. AT & T sent another device, just in case. Nope. I experimented with several other routers. Negative. I brought in a private networking guru to troubleshoot. Thanks for trying. I invested many hours determining what was broken and how it could be fixed. I tried so many different cabling configurations that my office looked like my kid's Rainbow Loom. When I was nearing my breaking point - the day I was going to let my boys strap bottle rockets to it - I got another phone call from Shentel offering something that just might shock you. An apology. They'd discovered the problem was, in fact, theirs. It was the result of a simple tweak made in their network configurations about the same time my device decided to hibernate. They reverted to the original settings and within two minutes, everything was working perfectly. I didn't even have to flush the ice cubes. How impressive that they didn't pass the buck and they were completely transparent about their internal investigative process. They completely owned it. Simply put: they screwed up, and it took longer than it should have for them to recognize the issue. But the company I'm supposed to distrust and dislike did the right thing in a remarkably honest and genuine way. Perhaps some of my local readers will pounce on the comments to post their horrible experience dealing with the very same company. But as I've written before, we have a responsibility to highlight when things go right. I'm not an expert, I'm just a writer, but perhaps when we form our consumer opinions, we ought to rely more on our own experiences and less on the loud and disgruntled few. I offer public kudos to Emily, Judson, Larry, Michael, Robert and Seth at Shentel for aggressively working to solve a problem they admitted to creating in the first place. If that's a villain, we need a lot more of them in the marketplace. Channel Finder Unfortunately, TheBlaze is not available on to email your provider and urge them to add TheBlaze to your channel lineup. to email your provider and urge them to add TheBlaze to your channel lineup. How Many Christians, Jews and Muslims Will Be Part of the New Congress? Here's the Complete Religious Breakdown \"My Husband's Not Gay': New TLC Show About Married Mormon Husbands Who Are Attracted to Men Sparks Major Protest What Archaeologists Found Under the Floors of an Abandoned Jerusalem Building Could Be the Site of One of the Biggest Events in Jesus' Life Christian Blogger Pens Incredible Message as She Enters Hospice - Just Months After Begging Brittany Maynard Not to Take Her Own Life:' I Pray I Would Live Well and Fade Well' Brewery Apologizes for Naming One of Its Beers After a Famous Historical Figure American Oil Companies Have Sent a Hint That They Think Gas Prices Will Remain Low Your Dollars Just Got a Lot Stronger Against the Euro - Europe's Currency Hit a 9-Year Low and Could Go Lower Someone Gave the World a Brutal Look at Comcast's Inner Workings - but Their Identity Is Still in Question Someone Gave the World a Brutal Look at Comcast's Inner Workings - but Their Identity Is Still in Question These Texas Miners Used Drones in Exactly the Way You'd Expect Texas Miners to Use Drones New Blaze Magazine: The progressive left's threat to free speech State Dept. not looking to sanction Palestinians for trying to join Int' l Criminal Court Republicans target Obamacare in first wave of bills for the 114th Congress There was a problem submitting your tip. Please try again later. Please help us fight spam. Follow the instructions below to prove that you're a real person."}, {"articleID": "2019021523_00173222_W", "names": {"Marie Wilson": ["Q1305569", "Q27888951"]}, "date": "2019-02-15", "url": "http://www.dailyherald.com/news/20190215/cops-suspect-in-aurora-mass-shooting-dead--", "content": "Cops: Suspect in Aurora mass shooting dead Print hello Multiple police officers and civilians have been wounded in an Aurora shooting at the Henry Pratt Company Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Police officers on the scene Friday in Aurora following a shooting an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Four police officers and multiple civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Police officers from throughout the suburbs are responding to a mass shooting in Aurora that has left multiple police officers and civilians wounded. The suspect is in custody, but police are urging anyone in the area of Prairie and Highland avenues to shelter in place. Bev Horne | Staff Photographer Police officers on the scene of a shooting Friday afternoon in an industrial area in Aurora. Bev Horne | Staff Photographer Police officers from throughout the suburbs responded to a mass shooting in Aurora. Bev Horne | Staff Photographer Multiple police officers and civilians have been wounded in an Aurora shooting Friday in an industrial area near Prairie and Highland avenues. Bev Horne | Staff Photographer Some of the Aurora shooting victims are being treated at Advocate Good Samaritan Hospital in Downers Grove. Marni Pyke | Staff Photographer The suspect in a mass shooting in Aurora that wounded four police officers and as many as a dozen civilians in an industrial area near Prairie and Highland avenues is dead, law enforcement sources said. Sources said they are uncertain if the man, said to be an Aurora resident who lost his job in the past several days, was killed by police or from a self-inflicted gunshot wound. They said a ruling may depend on an autopsy and a review of officers' body cameras. Kane County Coroner Rob Russell confirmed at least one person is dead, but would not say if the person is the suspect. Early reports indicated a civilian also may have been killed. Some victims were airlifted to Advocate Good Samaritan Hospital in Downers Grove. Just before 5 p.m. a spokesman said one patient was at Good Samaritan and another was taken to Advocate Lutheran General Hospital. Condition reports were not immediately available. Patients also are being taken to Amita Health Mercy Medical Center in Aurora. Two people are being treated injuries that are not life-threatening at Rush Copley Medical Center in Aurora. Police are conducting a building-to-building search of the area in case there are more people injured. SWAT teams from throughout the suburbs were called to the scene as was the Bureau of Alcohol, Tobacco, Firearms and Explosives and the FBI. By Friday evening, crime scene tape surrounded Alro Steel at 641 Archer Ave. and numerous police officers still were outside the building. Nearby Holy Angels School and all 18 schools in West Aurora Unit District 129 were placed on lockdown during the search for the shooter. Bob Gonzalez, school board president in West Aurora Unit District 129, also works as a State Farm agent with an office on Prairie Street just east of Highland Avenue. As soon as he heard sirens and realized the emergency in the area was a shooting, he got in touch with Superintendent Jeff Craig to start putting student safety measures into place. At 1:56 p.m., Gonzalez said, Craig put all of the district's 18 schools on soft lockdown. The lockdown lasted until the district began dismissing students about 4 p.m., after police said the situation was \"contained\" by about 3:45. Students were to be dismissed in 40-minute intervals, starting with the elementary schools and Hope D. Wall School, then West Aurora High School, the district's middle schools and the West Aurora Learning Center. While police were searching for the suspect, Gonzalez called multiple clients warning them not to come in to his office at 301 Prairie St. and locked down the facility to preserve the safety of his 4-year-old twin grandchildren. Nancy Caal, an employee of Erwin's Truck Repair, 735 Prairie St., said she and three others were locked down inside the shop during the manhunt for the shooter. \"We have not heard from the police, but we can hear all the sirens so I went and shut the front gate and locked all of the doors,\" Caal said at the time. \"I've got three people here with me and there's four people in the building behind me, too. We're not seeing much because we prefer to be all the way inside the building and not in the windows. We're staying calm .\" \"They just recommended to lock our doors,\" said Polo Lozano, the owner of Capital Printing and Dye Company. His entrance is about 75 yards from the shooting scene. CNN is reporting that President Donald Trump has been briefed on the shooting and is monitoring the situation. • Daily Herald staff writers Harry Hitzeman, Justin Kmitch, Robert Sanchez, Susan Sarkauskas, Katlyn Smith and <mark>Marie Wilson</mark> contributed to this report. Get articles sent to your inbox."}, {"articleID": "2012101622_00034420_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}, "date": "2012-10-16", "url": "http://wtol.com/story/19836841/ny-schools-blackface-assault-skit-criticized", "content": "meta itemprop = \"datepublished\" content = \"2012-10-16 07:00:34\" > clinton takes benghazi responsibility; gop unmoved u.s. secretary of state hillary rodham clinton is answering republican criticism of the obama administration's handling of last month's attack at the u.s. consulate in benghazi, libya, saying she - not the...secretary of state hillary rodham clinton's pre-election bid to shoulder blame over the deadly terror attack in libya failed to silence gop criticism that president barack obama is not protecting u.s. diplomats overseas. meta itemprop = \"datepublished\" content = \"2012-10-16 20:31:03\" > release of names in prostitution case stirs debate release of names in prostitution case stirs debate a decision to release the names of alleged prostitution clients is causing big problems for men in a small new england town who have the same names as the accused. paul main's quiet evening was shattered by a phone ringing off the hook and a half-dozen tv crews showing up on his porch. everyone wanted to know: was he the same paul main who's been accused of visiting a.. . meta itemprop = \"datepublished\" content = \"2012-10-16 06:30:33\" > friends memorialize ex-sen. arlen specter in pa. arlen specter, pennsylvania's longest-serving u.s. senator, will be remembered at a funeral service attended by vice president joe biden, his longtime senate colleague. former u.s. sen. arlen specter was an \"irreplaceable\" force who approached politics - and life - with grit and determination, a who's who of politicians and others said tuesday at the longtime senator's funeral. meta itemprop = \"datepublished\" content = \"2012-10-16 22:11:07\" > us-canada crossing closed after agent shot us-canada crossing closed after agent shot the peace arch crossing on the u.s.-canada border has been closed after a canadian agent was shot. the peace arch crossing on the u.s.-canada border has been closed after a canadian agent was shot. meta itemprop = \"datepublished\" content = \"2012-10-16 22:01:07\" > ny school's blackface assault skit criticized ny school's blackface assault skit criticized a pep rally skit by three white high school students who wore blackface and parodied <mark>chris brown</mark>'s arrest for assaulting rihanna has officials in a largely white new york district vowing to set clearer...associated press buffalo, n.y. (ap) - a pep rally skit by three white high school students who wore blackface and parodied <mark>chris brown</mark>'s arrest for assaulting rihanna has officials in a largely white new york district vowing to set clearer expectations for school events. the skit was one of several pop culture parodies performed friday at waverly high school as part of an annual \"mr. waverly\" competition, superintendent joseph yelich said. the one in question had a male student portraying <mark>brown</mark> standing over another cowering actor playing rihanna; a third male student played an arresting officer. a picture from the skit posted to social media and other sites including facebook, tumblr and cnn ireport drew thousands of views and dozens of comments, many calling the skit blatantly racist and blasting the idea of drawing laughs from domestic violence. <mark>brown</mark> was sentenced to five years of probation after pleading guilty to felony assault for the attack on rihanna in 2009. both singers are black. yelich said he has not kept track of the number of complaints to the small district in southern new york's tioga county but said the \"mr. waverly\" tradition is being re-examined. other skits featured tarzan chasing a gorilla, hockey players brawling, and spider-man. \"i mean, this is a pep rally; we're supposed to be cheering on our team,\" said yelich, who has been on the job a little over a year. \"the fact that skits are involved and parodies...it strayed from that and it got into a different kind of competition .\" a waverly high alumnus who posted comments on cnn said that while he doesn't believe the students meant to offend, he was surprised administrators didn't intervene. \"there were adults who should have stood up and said,\" hey, guys, this is not ok. blackface is not ok. is it illegal? no. but you should really not do that,' \"matthew dishler, 24, told the associated press in a telephone interview. rose garrity, executive director of a new hope center, an agency in nearby oswego county that assists victims of domestic and sexual abuse and other crimes, also put responsibility on the adults .\" they were trying to make something funny that is far from funny, and they were being incredibly racist while they were doing it, \"garrity said .\" i doubt any of those children had any idea about the history of racism and minstrels or anything like that. \"garrity said her agency has been working with waverly and other districts on anti-violence and anti-bullying programs and would continue its outreach .\" domestic violence isn't funny, \"garrity said .\" three women every day are killed in this country by the man they're partnered with. it's anything but funny. \"lynx star speaks out against mn marriage amendment lynx star seimone augustus speaking out as minnesota considers amendment banning gay marriage obama out to seize momentum from romney in debate pressure on obama to find right balance in next debate _ come on strong but not overdo it squirrel population boom frustrates fruit growers landowners on border say they were shortchanged landowners say they were shortchanged in deals to make way for us-mexico border fence jump from space's edge provides collective moment daredevil's 24-mile jump from edge of space gives millions on earth collective moment of awe skydiver breaks sound barrier in record jump daredevil skydiver breaks sound barrier in record 24-mile leap over new mexico desert longtime gop senate moderate arlen specter dies arlen specter, longtime senate moderate and architect of one-bullet theory in jfk death, dies shuttle passes obstacle, heads toward la museum space shuttle endeavour surmounts key obstacle, heads through la streets to museum home analysis: veep debate is fierce and focused _ everything the presidential match was not vp debate: biden, ryan at each other on everything' a bunch of malarkey:\" biden and ryan match up in the midst of the romney-and-obama debates all content? copyright 2000 - 2012 worldnow and toledo news now, a"}, {"articleID": "2015071522_00099359_W", "names": {"Daniel Radcliffe": ["Q20744643", "Q38119"]}, "date": "2015-07-15", "url": "http://www.justjaredjr.com/2015/07/15/daniel-radcliffe-plays-receptionist-at-nylon-mag-watch-the-vid/?ref=jrfooter", "content": "<mark>Daniel Radcliffe</mark> Plays Receptionist At Nylon Mag - Watch The Vid! <mark>Daniel Radcliffe</mark> gets ready to play receptionist in this funny new video from Nylon magazine. The 25-year-old British actor took the reins of the front desk at the mag's headquarters in New York City and while JJJ wouldn't actually call it chaos...that's kind of what happened anyway. \"I received no phone calls during that hour, which was strange,\" one staffer wrote of the temp one-hour receptionist and what happened. \"And a package that was supposedly delivered to the office for me never made it to my desk. As I started to track down the aforementioned package, I heard a squeal. Apparently had come into the office, to surprise <mark>Daniel</mark> and try to resume his job .\" Joe Jonas Check out the video below! Nylon--<mark>Daniel Radcliffe</mark> Was Our Receptionist for an Hour Like Just Jared Jr. on FB Share This!"}, {"articleID": "2012012615_00016762_W", "names": {"Yoko Ono": ["Q11464149", "Q117012", "Q16264827"], "Michael Jordan": ["Q1928047", "Q27069141", "Q3308285", "Q41421", "Q6831715", "Q6831716", "Q6831719"]}, "date": "2012-01-26", "url": "http://remotecontrol.mtv.com/2012/01/26/real-world-where-is-arissa-hill-now/", "content": "arissa hill as part of \"real world: las vegas\" in 2002, and now, an aspiring tv chef. <mark>yoko ono</mark> changed the beatles, <mark>michael jordan</mark> changed the face of basketball and, in 2002, las vegas changed \"hill and her six roommates took over a penthouse suite in the lavish palms resort and proceeded to tear the place up with fights and sexual escapades, the intensity of which the series had not yet seen. the quick-as-a-whip wisecracker made a good friend out of frank (who once literally slammed a door in her face) and left the desert after four months having cooled her temper by leaps and bounds. that is, until she returned to sin city years later to film an unprecedented\" challenge \"finalist is busy cooking up ways to land her food project on tv and get her very own restaurant out into the bright lights of l.a. see what she told twitter for some mouth-watering meal-prep shots. do you remember some of your first impressions of vegas and your housemates? i was just in such awe of vegas. i was raised a jehova's witness, so i had never been out in a place called\" sin city. \"i was definitely a little scared, and unsure of what was going to happen. i remember what it was like to first meet frank. it was definitely just like:\" oh! i see where they're going with this. \"i just knew off the bat. he's so different on that human spectrum--really the opposite side of the spectrum. that was my first indication that it would be a lot of conflicting personalities. but then i walked into the house and met essentially my doppelg? nger, irulan. what was it like watching yourself when the show aired on mtv? the experience as a whole was pretty awesome. you have an idea of yourself as you're growing up and going out into the world. you have a way that you think of what your effect on other people is. but it's totally different when people watch your interactions and then decide how they feel about you. i really learned a lot about myself: that i could definitely do better to control my temper. that was the main one. what was it like to get a second chance to go back to vegas, and did you make a concerted effort to do anything differently? at first i was like\" everything is going to be different now. \"but it brought us back to the same situations with the same people who were behaving the same. you're easily reverted back to where you were. you're just like,\" all right, i guess you don't understand this nice new buddhist aspect of me, but you will understand when the lion comes back out. \"how did it feel to hear other competitors say you didn't deserve to make the finals of\" battle of the sexes 2 \"? i think i performed like a g, really. there were things that i sacrificed for my team that weren't even highlighted. i still remember that time i got into that glass coffin and was covered with bugs for three-and-a-half hours. i remember laying next to mark long, and him saying to me,\" the only reason i am not getting out of this coffin is because you are here next to me. \"three-and-a-half hours later, bees are swarming around our heads and we're bitten to shreds. i mean, i was diving into snake pits. for the most part, i was handling my business. but strength training, endurance--that's different. strategically, i will say that if i ever did another\" challenge, \"at the very minimum, i would make it to the end. minimum. please don't underestimate me. i am a strategist. have you seen the promos for\" battle of the exes, \"and what do you think? a whole bunch of exes thrown together? and money--the cash incentive? oh, this is going to be brilliant. brilliant! i'll be voting for mark to win. how has your life changed since your last days on mtv, and what are your plans for the near future? life has been life--i've just kind of been navigating my way through it and picking up lessons along the way. i've settled into doing the things that i love that i love for myself: traveling, eating great food, meeting great people. i've just been living, man. i would love to use modeling and acting as a segue into a food show. i have such a deep passion for food. i love to just present people with delicious plates and watch them enjoy. i'm looking more at my five-year plan--i really hope i will be working at my own restaurant. a very small restaurant...but mine."}, {"articleID": "2016071501_00305960_W", "names": {"Michael Walker": ["Q11255929", "Q3308568", "Q52568899", "Q59395459", "Q6012908", "Q6835179", "Q6835180", "Q6835181", "Q6849193", "Q6849194", "Q6849195", "Q992668"], "Donald Trump": ["Q22686", "Q27947481"], "John Murray": ["Q14248464", "Q15456175", "Q20621123", "Q43912232", "Q6249920", "Q6249923", "Q6249930", "Q6249931", "Q6249935", "Q6249937", "Q6249946", "Q6249951", "Q6249963", "Q8837082"]}, "date": "2016-07-13", "url": "http://weatherforddemocrat.com/opinion/letters_to_the_editor/a-vote-for-trump-makes-salt-tasteless/article_0e98d26a-e39e-5ce2-99c3-2771fe45ef50.html", "content": "Letters to the Editor A few passing clouds. Low 74F. Winds SSE at 10 to 20 mph. Updated: July 14, 2016 @ 7:53 pm NICE, France (AP)--The Latest on a truck that drove into the crowd in Nice (all times local): More Headlines OKLAHOMA--Parker County's Kambria McDougal and Skylar Southerland competed in barrel racing at the International Finals Youth Rodeo earlier this week. More Headlines Daniel and Candice <mark>Walker</mark> are proud to announce the birth of their son, Benjamin <mark>Michael Walker</mark>, born on May 19, 2016 at Huntsville Memorial Hospital. Benjamin weighed 8 lbs ., 13 oz. and measured 21 inches long. More Headlines A Vote for <mark>Trump</mark> Makes Salt Tasteless Jul 13, 2016 <mark>Trump</mark> not the answer Dear Editor: Remember from 2nd Kings Chapter Two, the three Captains and their 50 men whom the King had sent to recall Elijah? The first two captains and their men were killed by fire from heaven because God was not in their hearts although they said, \"Man of God .\" It is not what you say but how you act. \"The third captain went up and fell on his knees before Elijah,\" Man of God \", he begged,\" please have respect for my life and the lives of these 50 men, your servants. \"God let them live. Effective living begins with the right attitude towards God. Let respect, humility, and servanthood characterize your attitude toward God and others. Story continues below video <mark>Donald Trump</mark> has little respect, no humility, and has no servant-like characteristics. Dr. Moore, the Moral and Ethics leader of the Southern Baptist Convention, says,\" <mark>Trump</mark> is against everything Christians believe. \"Listen carefully, because it's important. Why? Because Christians are called to be salt and light of the world. If we become tasteless, we have lost our influence. We cannot compromise our values and vote for a man who does not need to repent because he doesn't sin. If we do, we become tasteless and are no longer salt and light. We need to be light. When light is dim, it's hard to see. We have to be the bright light. Let your light shine so they can see your good works. Let your good deeds reveal the beauty of Jesus. <mark>John Murray</mark>"}, {"articleID": "2018031500_00224512_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-03-14", "url": "http://www.washingtontimes.com/news/2018/mar/14/twitter-truthiness-and-titillation/", "content": "Twitter, truthiness and titillation Are you worried about a trade war? Question of the Day By Suzanne Fields - The Washington Times - Wednesday, March 14, 2018 ANALYSIS/OPINION: When talking politics, online or in person, you don't often hear anything about the \"magnificent middle .\" You'll hear epithets like the \"dirtbag left\" or the wicked \"alt-right,\" and all of the ugly free associations to commies and fascists, loonies and wackos. Moderation is mush, evenhandedness is stupid, considering two sides of an issue is so 20th century (or maybe 19th). Only one side could possibly be right. Arrogance and self-righteousness reign everywhere. And rain, too. Politics has always been a blood sport and we're accustomed to watching red and blue gladiators, but now that everybody's a pundit, human cockfighters and their respective followers are mad and mean 24/7. There's no time out. It's hard to figure out how this came about, but you can't blame it on <mark>Donald Trump</mark>. He merely tapped into great dissatisfaction with the powers that be, and a ravenous cable-TV with time to fill, along with a social media urgently demanding reaction to everything in 140 characters, did the rest. Tweets race from brain to finger without a serious thought for reflection. Marshall McLuhan said the \"medium is the message,\" but that's ancient history. The message today is in the air we inhale. Everybody talks in bursts of short sentences, like comic book characters. Instead of word bubbles over the heads of the characters there's the tap tap tap on a digital keyboard. Over a decade has passed since Stephen Colbert, a political jester on Comedy Central, coined the term \"truthiness\" to poke fun at President George W. Bush's facts, and the American Dialect Society would designate it \"word of the year,\" reflecting the Zeitgeist in 2005. Truthiness was thinking with your heart and intuition, unburdened by facts and logic. Factoids--Norman Mailer's inspired word for something that looks like a fact, sounds like a fact but in fact is not a fact--pushed aside the real thing. Truth in a media-saturated world began to change dangerously when information was no longer delivered by the written word, by newspapers and magazines with editors who held reporters to a strict standard for getting the who, what, why, where and how into the story. \"If your mother says she loves you,\" went the Chicago city room warning, \"check it out .\" The modern \"lead\" of a story is often shaded toward advocacy, trying to shape the reader's attention before a single fact is put to ink. Angry rhetoric determines point of view, placement and the flow of the stories on the front page and TV screen. Editorial pages and pundits struggle to keep up. Anecdotes become the sugar that helps the medicine go down, often replacing hard reporting. Oprah, a master at drawing out the emotional truth in the lives of ordinary people and a driver of television's daytime drivel, has become the designer of the news. Megyn Kelly, once a hard-hitting commentator on the news on Fox, moved to NBC to deliver breathless interviews of celebrities about the intimacies of their personal lives. Her ratings took off after the Weinstein scandals broke and #MeToo victims went to her with their tales of woe and racy revelations. In fact, the harassment scandals, as important as they can be, have defined news standards down, establishing guilt in the public eye and dispensing the sordid facts behind the accusations. Three professors at the Massachusetts Institute of Technology analyzed 126,000 Twitter cascades (unbroken chains of retweets from a common origin) that discovered that false stories (\"fake news,\" some call it) spread significantly farther and faster than tweets of truth, proving again the old maxim, variously attributed to Jonathan Swift, Mark Twain and Winston Churchill, that \"a lie goes halfway around the world before the truth can get its boots on .\" George Orwell created a Ministry of Truth in \"1984,\" his novel about control of human behavior through the manipulation of lies. Orwell could hardly imagine our ministries of truthiness, uncontrolled and chaotic, digital tweets of false stories that titillate and appeal to polarized points of view, spreading easily at the mere touch of fingertip. Research into Twitter trends of false stories is just beginning, and Sinan Aral, one of those MIT researchers, warns that the study of behavioral and psychological incentives for spreading false stories is needed to blunt and bend the trend. Truthiness and factoids appeal to the human craving for novelty and sensation, and advertisers crave the wider diffusion of stories, whether true or false, to attract eyes to their wares. There's a risk. \"Some notion of truth is central to the proper functioning of nearly every realm of human endeavor,\" Sinan Aral writes in The New York Times. \"If we allow the world to be consumed by falsity, we are inviting catastrophe .\" Can anyone doubt it? Suzanne Fields is a columnist for The Washington Times and is nationally syndicated."}, {"articleID": "2009012204_00001317_W", "names": {"President Bush": ["Q207", "Q23505"]}, "date": "2009-01-22", "url": "http://unmitigatedword.wordpress.com/2009/01/21/inauguration-the-day-after/", "content": "standing in freezing temperatures, jammed packed in the national mall like sardines, and with feet swelling from standing in one place for hours, i finally heard the words i never thought i'd hear a person of color say in my lifetime: \"i, barack hussein obama, do solemnly swear that i will faithfully execute the office of president of the united states...\"well, at least it went sort of like that. president obama arguably pulled off the first bushism of his tenure while initially stammering through the oath. but in his defense, it was ridiculously cold and he was in front of almost 2 million people in one place; let alone the tens of millions watching around the globe. the occasional nervous stammer is expected. but i digress. one linguistic episode aside, this inauguration ceremony reflects one of the most important moments in the history of this country. this moment is directly defiant to the shameful years of our past and is a signpost for a promising future. people of all ages, races, and backgrounds gathered to watch this event unfold; an event which emphatically closed the door on america's once prevalent and adolescent mindset that only a certain kind of person could be president. now being ushering in is a new wave of hope and confidence. but now, it's the day after. the confetti has been swept away. it's back to work. for us to truly recognize the significance of the day and of this time in our history, a different type of thinking and practice is necessary. for starters, this event must make us more conscious of the shameful history paving the way for us to arrive at this point. the process for putting a man like barack obama in this position did not start with the inaugural ceremonies. it did not start with an impressive election day victory. it did not start with obama accepting his party's nomination for president. his propellant victory in iowa was not where the movement started. for that matter, not even obama announcing his intentions to run on that cold day two years ago began this process. these moments merely underscored a chain of events tracing back decades. the inauguration of president obama was a fulfillment of entire centuries-worth of anonymous people not remembered in history books, but who were crucial to what we are enjoying today. they suffered, fought, and died for an event in which they would never take part. we owe this all to them by honoring them using a multipronged approach. first as we commemorate this as a critical point in our nation's maturation, it is important that this does not simply become the period at the end of a sentence. i pray that as a nation we do not allow obama's election to become the impetus for complacency. while i am thrilled that america has finally opened its arms to the reality of a person of color, it was certainly not an unconditional acceptance. i've hinted before that weight of an unpopular predecessor was carried by the mccain/palin ticket; only to be magnified when the economy collapsed. at that point, an obama victory was almost inevitable. besides all of that, obama had to be a certain kind of candidate during his run. any endorsement of jeremiah wright's statements, for instance (comments on which i and most black people in this country actually cosign to some extent) would have spelled immediate defeat in a general election. though i suspect obama truly wanted to find solvency with the issue of race by parting from the discussion altogether, had he even wanted to engage in some of the difficult conservations about this nation and race relations, mccain would have no doubt been the man being sworn in yesterday. this reality underscores an important point: we have progressed significantly with race relations, but we still have a long ways to go. secondly, i think it is crucial that we not get so effusively sentimental about obama's victory that we forget to be critical of his performance. the overwhelming issues facing this nation are only temporarily absolved by this euphoric moment. poverty and economic hardships, violence, racism, homophobia, anti-intellectualism, and a host of other issues continue to be staples in the american structure. before victory can truly be claimed, these things must come to an end. what president obama does to address these things will be the ultimate measure of this moments' significance. in his defense, we tend to place blame on presidents without also recognizing the role congress plays. but with the supporting cast he has, president obama has a lot working for him. but if he cannot produce positive results during his tenure, we may only be celebrating the historic election of a captain on a sinking ship. of course, we cannot lay this all at the feet of obama alone. challenging him to be an effective leader must be met with our own self-imposed challenge to be better citizens. as citizens, we have an obligation to be equally as critical of obama's performance as we were of president <mark>bush</mark>'s. we must not be so enamored by the ceremoniousness of all things obama that we forget he's supposed to be our president. after all, we are fresh off the heels of a miserable decade in our political history that could have been avoided had we used sensible criticism of our president instead of mawkish adoration. this all demands that we not stay politically blinded until we vote again. this calls for something much greater than that. this leads me to my final point: we should not find ourselves in the position of resting on our laurels now that obama is officially president. instead of wasting this opportunity by accepting a docile and unassuming role in the change we are seeking, we should make a conscious decision to be involved. the time for excuses is over. the time for action is now. to be sure, a history-making inauguration of the first president of color makes the challenges we face no less difficult to surmount. but it should at the very least trigger a belief that we can face and defeat the obstacles we face daily. we can all be a little more motivated to healing this world. to volunteer. to improve our communities. to mentor our young. to reach out to the poorest and more marginalized among us. to exhibit the same pride and connection that allowed us to endure throughout the generations. our history has not culminated at this moment. if anything, this is only the next step in the process. possibly related posts: (automatically generated)"}, {"articleID": "2019041423_00082371_W", "names": {"Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "David Backes": ["Q1173622", "Q5231027"]}, "date": "2019-04-14", "url": "https://www.pressherald.com/2019/04/14/sundays-nhl-roundup-islanders-move-closer-to-sweep-against-penguins/", "content": "PITTSBURGH--The New York Islanders don't play a particularly sexy brandy of hockey. They forecheck. They backcheck. They block shots and take few risks, more focused on fundamentals than flash. It's a style designed to frustrate opponents regardless of pedigree, one that has them on the cusp of just their second playoff series win in more than a quarter century. Jordan Eberle and Brock Nelson scored 62 seconds apart in the first period to quickly erase an early deficit, Robin Lehner stopped 25 shots, and the Islanders moved within one victory of finishing off Sidney Crosby and the rest of the frustrated Pittsburgh Penguins with a 4-1 win Sunday to take a 3-0 lead in their best-of-seven Eastern Conference quarterfinal series. It's heady territory for a franchise that's advanced past the first round just once since 1993. Yet the Islanders certainly look like they belong on the big stage. They've outscored Pittsburgh 11-5 through three games and have trailed for less than four minutes against a team that began the playoffs looking to capture its third Stanley Cup in four years, a dream that's all but vanished. \"We kind of did our best to play simple hockey and really just grind it out a little bit,\" said Islanders forward Anders Lee, whose empty-net goal with 1:28 to go pushed his team to the cusp of an unlikely sweep. While they lack Pittsburgh's offensive firepower, the Islanders have made up for it with depth and resiliency. Rather than get rattled after Garrett Wilson gave the Penguins just their second lead of the series when he redirected a point shot past Lehner midway through the first period, the Islanders responded immediately. Eberle beat <mark>Matt Murray</mark> short side from just above the goal line 28 seconds after Wilson's goal, and Nelson finished off a 2-on-1 just over a minute later to put New York in front to stay. Lehner withstood a series of pushes by the Penguins, and the Islanders counterpunched brilliantly in the third period, getting goals from Leo Komarov and Lee to pull away. \"Playoffs are all about momentum,\" said Eberle, who has three goals in the series. \"When you can take some team's momentum away and just continue to build yours, it's key .\" <mark>Matt Murray</mark> finished with 32 saves for the Penguins, but Pittsburgh again struggled to generate sustained offensive pressure. New York, which allowed an NHL-low 196 goals on its way to a second-place finish in the Metropolitan Division, has clamped down on Crosby and linemate Jake Guentzel. The two combined for 75 goals and 101 assists during the regular season but have yet to record a point in this series. Pittsburgh needs a win in Game 4 on Tuesday to avoid being swept for the first time since the 2013 Eastern Conference finals against Boston. \"You've got to find ways to score goals this time of year,\" Crosby said. \"It's not easy, but you've got to find a way to do it, and obviously we haven't done a good job of it through the first three games .\" NOTES AVALANCHE: Cale Makar is about to jump from one grueling playoff run straight into another. The 20-year-old defenseman signed a three-year, entry-level deal with Colorado, a day after his UMass squad lost in the Frozen Four championship game. Makar, who's from Calgary, could make his NHL debut Monday in Game 3 of a first-round playoff series against the Calgary Flames. The series is tied at a game apiece. \"I want to make sure he's in, rested, prepared and focused on what we're doing here now. Then we'll make a decision on when we get him in the lineup,\" Avalanche Coach Jared Bednar said. \"It's definitely a big step up from the college game, especially when you're jumping in mid-series, in a heated playoff round, against such a good opponent like Calgary. It's my job to make sure I'm putting him in a position to succeed .\" The 6-foot, 192-pound Makar was the fourth overall pick by Colorado in the 2017 draft. He recently won the Hobey Baker Memorial Award as college hockey's top player after a season in which he had 16 goals and 33 assists in 41 games. Share Read or Post Comments Send questions/comments to the editors. <Previous Linden seeks Boston Marathon repeat Next> Related Stories Latest Articles Business American cancels Max flights through mid-August Sports Sunday's NHL roundup: Islanders move closer to sweep against Penguins Boston Bruins Bruins get physical, thanks to boost from <mark>David Backes</mark> Nation & World Japanese leader visits Fukushima nuclear plant Nation & World Pompeo says China prolonging Venezuela crisis Want the news vital to Maine? Our daily headlines email is delivered each morning. Email * Newsletter Choices * Daily Headlines and Evening Express Breaking News Business Headlines Maine Cannabis Report High School Sports Real Estate * I understand the Terms of Service. Name This field is for validation purposes and should be left unchanged. This iframe contains the logic required to handle Ajax powered Gravity Forms."}]