[{"date": "2013-07-23", "url": "http://www.indianexpress.com/news/fussfree-frizz/1145604/", "content": "Poor man's spending power of Rs 33.33 makes Centre claim poverty fell to 21.9% Ramnath Goenka Excellence in Journalism Awards: Felicitating the best I'm convinced my hair has a mind of its own. And its mind and mine don't seem to gel very well. I have been trying, ever since I was a young girl, to figure out what my tresses were up to and never succeeded. Sometimes it was poker straight, other times it was full and bouncy and rather often, it seemed to curl into coils of different sizes. The thing is: I have wavy hair. It's neither here, nor there. It's just plain confused. And confusing. Like many women of my vintage, I've barely meddled with my hair. As a preteen I wore it long, and school demanded it always to be braided (black scrunchies only, mind you). My teenage years saw me get a fringe, it masked my adolescent insecurities. And the shoulder-length bob was freedom from hair accessories of all hues. I've coloured it once when a pushy socialite was trying to promote her hair salon. But I stuck to the shade closest to my hair. I've still to start dyeing, my few greys are comfortable being hand-plucked so far. Women in Mumbai, where I live, haven't seen the sun all week. The rains have wreaked havoc on the city's roads, traffic and daily life. Understandably, social soirees beyond a 15-minute drive are abandoned. What took 15 minutes to reach last month, now takes 45. But oh, the blow-dry can't wait that long. It is now dank, clammy and wisps of monkey hair have appeared. Besharam to launch at an orphanage \"alt =\" First trailer of Ranbir Kapoor \\'s Besharam to launch at an orphanage \"src =\" http: //static.indianexpress.com/frontend/iep/highlight/1374574626_ranbir-kapoor-150.jpg \"> Ashes 2013: <mark>Nathan Lyon</mark> should start the next Test, says Glenn McGrath Photos: Rare moments of Amitabh Bachchan, Aishwarya Rai, Sridevi\" alt = \"Photos: Rare moments of Amitabh Bachchan, Aishwarya Rai, Sridevi\" src = \"http: //static.indianexpress.com/frontend/iep/highlight/1374569770_amitabh-150.jpg\" > Most murders by spurned lovers in Andhra and UP, says crime study Photos: It's a boy for Prince William and Kate \"alt =\" Photos: It \\'s a boy for Prince William and Kate \"src =\" http: //static.indianexpress.com/frontend/iep/highlight/1374564910_thumb_150.jpg \"> Photos: It's a boy for Prince William and Kate Photos: When Shah Rukh <mark>Khan</mark> met <mark>Salman Khan</mark>'s father before the\" hug' \"alt =\" Photos: When Shah Rukh <mark>Khan</mark> met <mark>Salman Khan</mark> \\'s father before the \\ \"hug \\'\" src = \"http: //static.indianexpress.com/frontend/iep/highlight/1374558449_thumbnewsrks.jpg\" > MP is No. 1 state, says Chouhan, party ignores Modi at campaign launch Most murders by spurned lovers in Andhra and UP, says crime study", "articleID": "2013072400_00036535_W", "names": {"Nathan Lyon": ["Q6969216", "Q6969217"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2013-07-23", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/6506912", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. Bold stock picks, money-making trades and in-depth market analysis. PSP Children's Foundation's 2013 Summer Experience in Seattle July 23, 2013 / PRNewswire /--PSP Children's Foundation (PSPCF) is hosting eight children, who are survivors of the 2011 Tsunami in Japan, along with two teachers from Minami Sanriku-cho and Kesennuma, Miyagi, Seattle for ten days. This is the first official program offered since the organization's inception as a nonprofit in January 2013. PSPCF was established to provide programs and opportunities for children who are the victims of disasters. Its mission is to support children who suffered great losses in catastrophic disasters, such as the Great Eastern Japan Earthquake of 2011. One of the ways in which it does this is by sponsoring and running the Summer Experience in Seattle. The Summer Experience program began in the summer of 2012, when Pacific Software Publishing, Inc. (PSPINC) sponsored a homestay program in Seattle, Washington for eight junior high school students and two teachers from Kesennuma and Minami Sanriku-cho. The original group of students lost parents during the Tsunami, and they touched many hearts in In order to continue the program, PSPINC founded PSPCF as a nonprofit organization to administer and run the Summer Experience in the coming years. The Board of Directors includes members from many businesses in Japan as well as the program's partners in Japan. Their efforts have come to fruition this week as they prepare for the arrival of this year's group of students and teachers on This year's Summer Experience will include visits to several major businesses in the Seattle Metro area as well as excursions to several attractions and classroom sessions. Host families have donated their time and opened up their homes to house the students for the duration of their stay as well. \"Last year, this program not only provided opportunities for these children but also many lifetime lessons for all who participated in this program from volunteers, host families and others who had the opportunity to be touched by these children,\" said <mark>Mayumi Nakamura</mark>, President of both PSPCF and PSPINC. \"We strongly believe that this year's Summer Experience in Seattle will be equally successful in instilling hope for the future in this group of children. PSPCF believes hope is something we receive by giving it others, and we hope to continue to do so through program and others in years to come .\" PSPCF believes that hope is something we receive by giving it to others. Their mission for the future is to provide children affected by disasters with opportunities for hope through programs such as the Summer Experience in PSPINC is a web hosting and Internet solutions company located in Bellevue, WA. During the 1990s, its focus shifted from localization and \"double byte specialists\" to \"Internet specialists .\" In August 2000, PSPINC opened its first data center, providing superior reliability and security for clients. Now in 2013, PSPINC continues to expand and provide domain name, web, and email hosting, data storage and original software to over 38,000 companies in both the U.S. and Japanese markets. But while PSPINC provides expert service for companies large and small, they never forget that their real business is supporting customers. Learn more at Netflix, Inc. (NFLX): Content Is King, But Google Trends Show Throne Is At Risk Fortinet, Inc. (FTNT), Palo Alto Networks, Inc. (PANW) Could Be Potential Takeover Targets After Sourcefire Deal SHAREHOLDER ALERT: Law Office of Brodsky & Smith, LLC Announces Investigation of Harris Teeter Supermarkets, Inc.. Putnam Announces Multi-Class Distribution Rates for Open End Funds Missouri Collection Industry Leader Earns Prestigious International Designation Intel Corporation (INTC) Q2 EPS Preview: Tablets Killing The PC Falling Star Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein.", "articleID": "2013072401_00035656_W", "names": {"Mayumi Nakamura": ["Q11365193", "Q11365856", "Q11365860"]}}, {"date": "2013-07-31", "url": "http://feeds.gawker.com/~r/jezebel/full/~3/xGmi9nTTe-Y/jill-abramson-cried-get-over-it-977624085", "content": "The formidable Jill Abramson was named executive editor of The New York Times in June 2011. Since she's taken the helm, The Times whopping four in 2013 alone - and oversaw the prestigious newspaper's breathless coverage of the Boston Marathon bombings, all points that his in-depth profile of Abramson. But amidst the 3,000-word longread, one point stuck with readers and other new sources: Jill Abramson admitted to crying after receiving bad press. Turbulence at The Times, \"a scathing account of Abramson's\" stubborn \"and\" condescending \"temperament, bolstered by the comments of one anonymous Times employee who described her as\" impossible, \"listing example after example of her abrasive, take-no-prisoners attitude. The article prompted backlash from media elite like <mark>Emily Bell</mark>, who criticized the sexist undertones of the Politico article: For every anonymous source anxious to talk about Abramson's mood swings, and absences, there could have been a counterbalancing one to talk about how Abramson is more present on the news floor than a number of her predecessors. For every person who talks about the exhausting nature of her management style, there is another who might point out that the news operation is the strongest it has been for a long time. You might even find people who think there is more than a whiff of sexism apparent in the building, and the critiques. None of this, however, feeds the story of a woman in charge who tells people what to do in a manner they don't like. In The Daily Beas t in-depth, Abramson admits she cried after reading the article:\" I cried, \"Abramson tells me .\" I should say it went right off me, but I'm just being honest. I did cry. But by the next morning, I wasn't completely preoccupied by it anymore. I had my cry and that was that. \"For Abramson to admit she cried is bold. She was lucky that her brief show of emotion wasn't in front of a crew of cameras, as was the case for Hillary Clinton in 2008. Her reaction, in the privacy of her own home, to an article that amounted to a personal attack is more than appropriate. And her admitting some tears after the accusation that she was an ineffective leader was a minor point in an article that otherwise examined Abramson's leadership style from a holistic point of view. But you can trust that the public won't let an example of a woman in the position of power shedding some tears go without mention. Dr. Kim Elsbach of the University of California has studied the repercussions of crying in the workplace, and found that\" The worst offenses...are crying in a public meeting or because of work stress, like a looming deadline or coworker disagreement, because it is considered disruptive and weak. Crying in a private performance evaluation is also considered unprofessional and often manipulative. \"New York Magazine in particular has ran with the Jill Abramson Cries and It's News story: read,\" New York Times executive editor Jill Abramson is not going to pretend she doesn't feel feelings, if only for a moment. \"Another highlight of the profile? An anecdote of Abramson curtly informing a maintenance worker to wait for her to finish her interview with The Daily Beast before carrying away tables and chairs for an event .\" It's a balancing act, and she appears to be pulling it off, \"finished the NYMag piece. A balancing act between what? Being a bitch on one hand and a sensitive woman on the other? The only thing worse than The Bitchy Corporate Woman trope is The Bitchy Corporate Woman Also Cries trope. From The Daily Beast profile, it's clear that Abramson falls into neither. She's an effective editor with certain aggressive personality traits necessary to be at the helm of one of the world's most respected news sources. She led her staff through layoffs, additional replies submitted and awaiting review", "articleID": "2013080103_00060730_W", "names": {"Emily Bell": ["Q15934723", "Q57691495"]}}, {"date": "2013-08-05", "url": "http://www.startribune.com/sports/twins/218432731.html", "content": "KANSAS CITY, Mo.--It's a nice problem to have, Ron Gardenhire said a few minutes ago, trying to decide whether you are overworking your closer. Glen Perkins pitched in all three games of the Twins' weekend sweep of the Astros, and there may be a decision to make if the Twins have a late lead tonight. \"If he says he feels great, we go with what he says he feels,\" Gardenhire said of his closer, whose 44 innings are fewest among pitchers who have been with the Twins all year. \"Perk will tell us. If he's a little beat up, or his arm is a little dead, he'll definitely tell us. We've had him do it before. As long as he's honest with us, we're OK with that .\" The 30-year-old closer said he's \"good to go,\" in the Twins' clubhouse before the game. Perkins hasn't pitched on four straight days since June 30-July 3 of last season. The Twins have lost five of their six games at Kauffman Stadium this year, and were swept by the Royals in Target Field last week, so they definitely have some trends they want to reverse. So does Kevin Correis, tonight's starter, who won only one game in June and one game in July. Pedro Florimon remains out for another game with a wrist injury, but he's on the field taking batting practice, and should return during this series. Tonight's lineups: TWINS Dozier 2B Mauer C Morneau 1B Doumit DH Arcia LF Plouffe 3B Herrmann RF Thomas CF Bernier SS Correia RHP ROYALS Cain RF Hosmer 1B Butler DH Comment on this story StarTribune.com welcomes and encourages readers to comment and engage in substantive, mutually respectful exchanges over news topics. Commenters must follow our Terms of Use. Keep it civil and stay on topic. No profanity, vulgarity, racial slurs or personal attacks. Comments with web links are not permitted. Comments that violate the above will be removed. Repeat violators may lose their commenting privileges on StarTribune.com. 6:05 PM Washington - S. Strasburg 6:05 PM St. Louis - A. Wainwright 6:05 PM Cleveland - C. Kluber 7:10 PM Houston - B. Oberholtzer 7:10 PM Kansas City - <mark>J.</mark> Guthrie 7:10 PM Chicago WSox - <mark>J.</mark> Quintana 9:05 PM LA Angels - <mark>J. Williams</mark> 9:10 PM Seattle - H. Iwakuma", "articleID": "2013080606_00008405_W", "names": {"J. Williams": ["Q1676430", "Q59162550"]}}, {"date": "2013-08-06", "url": "http://www.siliconvalley.com/siliconvalley/ci_23800551/from-hollywood-washington-meet-drama-kings-summer", "content": "This image released by Universal Pictures shows Denzel Washington, left, and Mark Wahlberg in a scene from \"2 Guns .\" (AP Photo/Universal Pictures, Patti Perret) (Patti Perret /) Even by Hollywood's standards, the summer movie season has been notable for boys blowing up their toys: No sooner did Robert Downey Jr. almost destroy L.A. to save it in \"Iron Man 3\" than an onslaught of wanton destruction was loosed on the world, from such interstellar fantasies as \"Star Trek Into Darkness\" and \"Man of Steel\" to the \"real world\" mayhem of \"White House Down\" and \"Fast & Furious 6 .\" On Friday, Mark Wahlberg and Denzel Washington lay waste to greater Texas in \"2 Guns,\" an exercise in ritualized male aggression in which guns, cars and other things that go \"boom\" and \"vroom\" aren't celebrated as much as fetishistically worshipped. It's all in escapist good fun, of course. But, watching Stig Stigman (Wahlberg) and Bobby Trench (Washington) banter and back-slap their way through \"2 Guns,\" audiences may detect a whiff of anxiety beneath the bluster. Maybe it's director Baltasar Kormakur's habit of having his characters aim guns at each other's crotches or the increasingly frenetic (and laughable) escalation in firepower. But as the body count adds up in \"2 Guns,\" the inescapable impression is that the movie's pseudo-casual cool isn't entertainment as much as a cry for help. It's the same feeling that Anthony Weiner inspired this week as he tried to brazen his way through calls to exit the New York City mayoral race, with his compulsive exhibitionism outpaced only by his pathological ambition. Weiner's breathtaking braggadocio called to mind other instances of political posturing this summer, whether it was Rep. <mark>Steve King</mark>, R-Iowa, describing the children of undocumented immigrants as probable drug mules \"with calves the size of cantaloupes,\" or Congress spending this week avoiding substantive work, instead casting meaningless votes to score political points. Washington and Hollywood have always enjoyed a symbiotic relationship, with politicians looking westward for borrowed glamour and contributions, and the movie industry coming here for reflected gravitas and policy bona fides. But these days, the two cities share something else. Both are fear-based cultures whose once-invincible leaders are facing radical changes and imminent extinction. And they're coping with those threats, to use Gloria Steinem's famous phrase, with massive cases of self-induced testosterone poisoning. Facing diminishing domestic movie attendance, sliding DVD revenue and expanding international markets, Hollywood - never a courageous place - has become more risk-averse than ever. Few scripts are approved these days without big, fat valentines to a fanatic (the term of art is \"pre-sold\" ) audience, like comic-book fans or video gamers. With foreign markets now accounting for up to two-thirds of a film's revenue, dialogue is likely to consist of one or two catchphrases, with the bulk of communication occurring through gunplay, fireballs and car stunts that are understandable in any language. This summer has featured particularly bombastic examples of that formula. Even with recent hits like \"The Best Exotic Marigold Hotel\" and \"Bridesmaids\" - proving that grown-ups and women of all ages still go to movies - studio executives still cater to 14-year-old boys in their summer programming. But that strategy has proved wobbly, as bro-dacious spectacles like \"White House Down,\" \"The Lone Ranger\" and \"The Hangover Part III\" have gone limp at the box office. (The industry was reportedly gobsmacked when \"The Heat,\" a raunchy action comedy starring Sandra Bullock and <mark>Melissa McCarthy</mark>, turned out to be a sleeper hit .) For their part, politicians these days are also threatened, either by demographic shifts, primary challenges or their own self-destructive tendencies. Their rhetorical arms race, whether born of strategy or egomania, keeps escalating. But who's buying their lines? \"Quit isn't the way we roll in New York City,\" the chronically clueless - and thoroughly unconvincing - Weiner said in his new campaign videoTuesday. \"We fight through tough things. We're a tough city .\" Stig Stigman, meet Carlos Danger. Whether it's Wahlberg winking and blasting his way through \"2 Guns\" or Weiner arrogantly identifying himself with the city he seeks to lead (and that will surely reject him), both share an air of impunity that, to a far more troubling extent, suffuses the chilling documentary \"The Act of Killing .\" In the film, <mark>Joshua Oppenheimer</mark> interviews an Indonesian death squad leader named Anwar Congo, who reenacts the murders he committed in the 1960s as scenes from the pulp movies he idolized. Congo is so immersed in his own narcissistic myth that he's incapable of seeing the moral implications of his actions, which included torture, garroting and mass murders. It's not difficult to imagine Congo watching \"2 Guns\" and eagerly imitating Wahlberg and Washington's bravado, just as he'd almost certainly approve of - and maybe recognize himself in - Weiner's perverse, self-justifying defiance. To chalk up all this shootin' and shoutin' and brawlin' and braggin' simply to male ego would be glibly reductive, of course: Let it be noted, women buy plenty of tickets to these movies, too. But it's hard to believe that our current outbreak of testosterone poisoning - cinematic and political - isn't compensating for deeper insecurities. While studio executives desperately try to stay relevant by reverting to stereotypical male iconography, their counterparts on the political stage affect comical airs of cocky self-assurance and quien-es-mas-macho theatrics.", "articleID": "2013080618_00092148_W", "names": {"Joshua Oppenheimer": ["Q14634179", "Q6290103"], "Melissa Mccarthy": ["Q229048", "Q50437115"], "Steve King": ["Q37084447", "Q749710", "Q7613030", "Q7613031", "Q7613033", "Q7613034", "Q7613037"]}}, {"date": "2013-08-12", "url": "http://wboc.com/story/23110524/qa-on-anti-gay-legislation-in-russia", "content": "meta itemprop = \"datePublished\" content = \"2013-08-12 13:41:57\" > US judge says NYPD stop-frisk violates rights US judge says NYPD stop-frisk violates rights A federal judge appointed an independent monitor Monday to oversee changes to the New York Police Department's contentious policy known as stop, question and frisk, a significant judicial rebuke for what the...The New York Police Department deliberately violated the civil rights of tens of thousands of New Yorkers with its contentious stop-and-frisk policy, and an independent monitor is needed to oversee major changes, a federal...meta itemprop = \"datePublished\" content = \"2013-08-12 12:01:55\" > Most NY voters embarrassed by Weiner, Spitzer Most NY voters embarrassed by Weiner, Spitzer Even most New Yorkers watching Anthony Weiner (WEE' - nur) and Eliot Spitzer in political races dominated by sex scandals want to forget about them. New York voters, despite their tradition of rooting for comebacks and supporting eccentric candidates, have had it with Anthony Weiner and Eliot Spitzer and their sex scandals. meta itemprop = \"datePublished\" content = \"2013-08-12 06:31:42\" > Bulger jury begins 5th day of deliberations Bulger jury begins 5th day of deliberations meta itemprop = \"datePublished\" content = \"2013-08-12 14:22:05\" > NH AG: No metal detector used before YWCA shooting NH AG: No metal detector used before YWCA shooting New Hampshire's attorney general says a YWCA where a father shot his 9-year-old son to death during a supervised weekend visit had used a metal detector on the man in the past but did not use it Sunday. Usher to keep custody of his 2 young sons Usher to keep custody of 2 young sons; ex-wife asked for them after Atlanta pool accident FCC votes to cap, slash prison phone rates FCC votes 2-1 on decade-old petition to limit charges for inmate phone calls Wildfire spreads, threatening hundreds of homes Southern California wildfire growing amid hot, dry conditions, threatening hundreds of homes Minn. dad claims third of $448M Powerball jackpot Minn. dad claims third of $448M Powerball jackpot; 2 other winning tickets sold in NJ Associated Press MOSCOW (AP) - The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public expression of support for nontraditional relationships. Russian lawmakers say the law doesn't outlaw homosexuality but merely discourages discussion of it among people younger than 18. However, the law has outraged Russian liberals and some sectors of the international community just six months before the start of the Winter Olympic Games in the Russian city of Sochi. WHAT IS PROPAGANDA? The definition of \"propaganda\" is vague and hinges on intent. Anyone who distributes information with the \"intention\" of persuading minors that nontraditional sexual relationships are \"attractive\" or \"interesting,\" or even \"socially equivalent to traditional relationships\" could be accused of breaking the law. The law does not outlaw gay sex, which was legalized in Russia in 1993. It does not explicitly ban participation in gay pride parades or promotion of LGBT equality online, but anyone wearing a rainbow flag on the street or writing about gay relationships on Facebook, for instance, could be accused of propagandizing. WHAT ARE \"NONTRADITIONAL RELATIONS\" ? They are not defined by law. However, in an interview with the channel REN-TV, Yelena Mizulina, one of the bill's authors, said there were four kinds: \"men with men, women with women, bisexuality and being transgender .\" WHAT ARE THE PENALTIES FOR VIOLATING THE LAW? The law sets fines of up to 5,000 rubles ($150) for individuals and 1 million rubles ($30,000) for organizations convicted of violating the law. Punishments are more severe for propaganda on the web or in the media - up to 100,000 rubles ($3,000) for individuals and up to 1 million rubles for organizations. Foreign citizens are subject to fines of up to 100,000 rubles, up to 15 days in prison, and deportation and denial of reentry into Russia. HAS THE LAW BEEN ENFORCED? No one has yet gone to court under the federal law. Six LGBT activists were detained after one of unfurled a banner reading \"Being gay is normal\" near a children's library in Moscow, but so far the participants have not been brought to trial. Four Dutch citizens working on a documentary film about gay rights in the northern Russian town of Murmansk were the first foreigners to be detained under the new law. They were fined and forced to leave the country, but weren't put on trial. There have been six cases in which individuals have been tried for \"propaganda\" under regional legislation. HOW WILL THE LAW IMPACT LGBT RIGHTS? While most activists believe that the law will not be widely enforced, it effectively gives any local government a carte blanche to ban gay pride events and will discourage people from discussing LGBT rights publicly and online. HOW HAVE RUSSIANS REACTED TO THE LAW? While the legislation outraged Russian liberals and activists, a poll by the independent Levada Center in Russia found that 73 percent of respondents supported any government efforts to curb homosexual propaganda. Four out of five Russians say that they do not have a single LGBT acquaintance. HOW HAS THE REST OF THE WORLD REACTED TO THE LAW? The law sparked a boycott of Russian vodka in gay bars across North America and vodka dumps in front of Russian embassies and consulates. There have been scattered calls for a boycott of the 2014 Winter Olympics in the Russian city of Sochi, but no country or athlete has yet declined to attend. Most officials, including President Barack Obama, have called a boycott unnecessary. WHAT ABOUT THE OLYMPICS? That's unclear. Russian Sports Minister Vitaly Mutko said foreign athletes would be expected \"to respect the laws of the country,\" but some lawmakers and the Russian Olympic Committee said the law would be suspended during the Games. Last week the International Olympic Committee called for Russia to clarify its stance. The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public...The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public...meta itemprop = \"datePublished\" content = \"2013-08-12 14:42:08\" > Nigeria: Flood destroys homes in northern Kano Nigeria: Flood destroys homes in northern Kano Officials say floods from heavy rains destroyed up to 400 homes in Nigeria's biggest northern city of Kano. Officials say floods from heavy rains destroyed up to 400 homes in Nigeria's biggest northern city of Kano. meta itemprop = \"datePublished\" content = \"2013-08-12 10:31:53\" > Hard-liners challenge Iran's proposed Cabinet Hard-liners challenge Iran's proposed Cabinet Hard-line Iranian lawmakers have challenged the new president's proposed Cabinet makeup, accusing him of nominating pro-Western figures and opposition supporters to ministerial posts. Hard-line parliamentarians challenged Monday the Cabinet proposed by Iran's new president, accusing him of nominating ministers who are friendly to the West or who back \"sedition\" against the country's clerically...meta itemprop = \"datePublished\" content = \"2013-08-12 07:22:04\" > <mark>Kerry</mark> trip to Brazil, Colombia could be chilly U.S. Secretary of State <mark>John Kerry</mark>'s attempts to build warmer relations with two American allies in Latin America could be complicated by reports that a U.S. spy program widely targeted data in emails and ...", "articleID": "2013081222_00018306_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2013-08-14", "url": "http://au.news.yahoo.com/a/-/sport/18495700/cancer-survivor-lyle-to-return-to-golf/", "content": "SYDNEY, New South Wales (AFP) - Australian golfer Jarrod Lyle will make a return to professional golf at the Australian Masters in November after an 18-month battle with cancer, organisers said Wednesday. Lyle, a member of the US PGA Tour, was diagnosed with a recurrence of the leukaemia he battled as a teenager in March last year and has been sidelined since. But the 31-year-old has agreed to make his return at the Australian Masters from November 14-17, where he will share the limelight with US Masters and defending champion <mark>Adam Scott</mark> and America's world No. 6 Matt Kuchar. \"I've made the decision to play the Masters this year as a test to see where everything is at before I look to head back to the States and the PGA Tour,\" Lyle said on the tournament website. \"That first tee shot is going to be for everybody who's supported me through all of this, but especially for my girls, Bri and Lusi,\" he added, referring to his wife and young daughter. \"I will be smiling from ear to ear for at least 36 holes. I'll enjoy the whole atmosphere, whether I play well or not .\" Lyle last played on the PGA Tour at the Mayakoba Golf Classic in Mexico in early 2012 where he finished in a tie for 37th. <mark>Tony Abbott</mark> makes \"captain's call' to preference Labor over Greens; move will put pressure on Adam Bandt Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay", "articleID": "2013081409_00054206_W", "names": {"Adam Scott": ["Q201842", "Q350869"]}}]