[{"articleID": "2015100511_00142472_W", "names": {"Tom Jones": ["Q16091498", "Q16730416", "Q180850", "Q23303147", "Q23683528", "Q2439753", "Q7816364", "Q7816370", "Q927200"], "Sam Smith": ["Q15123969", "Q15522057", "Q16226475", "Q27763826", "Q3946359", "Q3946360", "Q41249297", "Q41787201", "Q50382049", "Q7408170", "Q7408171", "Q7408172", "Q7408177", "Q7408178", "Q7408180", "Q7408733"]}, "date": "2015-10-05", "url": "http://heatworld.com/2015/10/the-x-factors-4th-impact-admit-theyve-never-been-kissed", "content": "By Anna Lewis Deputy Editor on Monday, 5 October 2015 at 11:32 They're the cutest thing to happen to The X Factor since Squiddly and Diddly, but girlband 4th Impact--previously 4th Power--have admitted that they've never been kissed. TOP NEWS The Vamps unveil Wake Up video starring BROOKLYN BECKHAM <mark>Tom Jones</mark> on leaving The Voice: \"They can go f ** k themsevles\" <mark>Sam Smith</mark> reveals video for Bond theme, Writing's On The Wall The sisters--Almira, 27, Irene, 25, Mylene, 23, and 19-year-old Celena Cercado--revealed to the Daily Mirror that they are all teetotal virgins who take their Filipino parents' strict Catholic rules VERY seriously. Irene told the newspaper: \"We have never kissed boys before. It is very strict in the Philippines, and so different to the UK. Our mum is very strict .\" I'm the only one who has ever had a boyfriend and we make sure Mum is there at all times. We are never on our own together. \"Almira added that the girls' mum (who is also their manager) and dad are worried about them living in the contestants' house with boys should they make it to the live shows. She giggled:\" Our mum is so worried about us living in a contestant house with boys, but we've promised to be well behaved. Some boys are good looking here, but we can't pay attention to them. \"That's right, girls--concentrate on the music. Watch the next episode of The X Factor on Sunday at 7pm on ITV."}, {"articleID": "2013070405_00078616_W", "names": {"Glenn Lewis": ["Q38255975", "Q5568951"]}, "date": "2013-07-03", "url": "http://journalrecord.com/2013/07/03/msc-plan-b-for-moore-real-estate/", "content": "Powered by Bookmarkify? MOORE - Even though the Moore City Council tabled three ordinances that would have changed building codes and required storm shelters in single-family and multifamily dwellings, Mayor <mark>Glenn Lewis</mark> said the effort will continue. The ordinances, <mark>Lewis</mark> said, will be back. \"We're going to keep working,\" he said. \"We've formed a committee and we're taking input from several groups .\" The new rules didn't fly, <mark>Lewis</mark> said, because several members of the City Council felt the ordinances were rushed. He said the council wanted to seek advice from municipal governments who had experienced similar disasters and from builders themselves. \"We're borrowing from Joplin,\" <mark>Lewis</mark> said. In Joplin, an EF5 tornado killed 161 people, destroyed approximately 3,500 homes and damaged another 4,000 homes. After the storm, city officials stopped short of requiring storm shelters in residential and multi-family dwellings, but the city did change its building code to incorporate new designs that could better protect residents from tornadoes. \"We made changes to the code that could help minimize the damage,\" said Sam Anslem, Joplin's assistant city manager. Anslem said some of those changes included requiring more anchor bolts every four feet instead of every six feet and requiring the use of hurricane clips, which helps tie the room to the stud walls. \"The goal is to strengthen the envelope of the house,\" he said. \"The hurricane clips protect the roof from coming off and ending up in your neighbor's home .\" Anslem said the clips sell for $1 to $2. In addition to the code changes, Anslem said residents of the city have been strongly encouraged to add a storm cellar or safe room. With about 84 percent of the destroyed and damaged homes now under construction permit, Anslem said the call for storm shelter is resonating with residents. He estimated about 20 to 25 percent of the new homes would have some sort of safe room. \"The market demand has given us an indicator that more and more people are adding them,\" he said. Still even while Moore officials and their counterparts in Joplin wrestle with proposals to make home and multi-family dwellings stronger, home builders worry that new regulations could price some first time home buyers out of the market. \"With the low interest rates, adding a shelter isn't that big of a deal,\" said Mark Livingston, vice president of the Central Oklahoma Home Builders Association. \"But the fact is if interest rates rise, and they will, the affordability will become more of an issue .\" Right now, he said, the cost of installing a storm shelter in a new home is between $2,700 and $3,700. But should a shelter be required by code Livingston predicted the cost would go up and could delay completion of the house. \"Right now, with so many shelters being built, we're being told that it would be around January or February before a shelter could be installed,\" he said. A better way to make homes safer, Livingston said, is to let the customer and the market place drive the idea. \"There isn't a home builder in Oklahoma who won't put in a storm shelter if it's requested,\" he said. \"The deal is people don't want them. They would rather have amenities. They pick a granite countertop over a storm shelter .\" <mark>Lewis</mark> wants to see that attitude change. After the City Council meeting, <mark>Lewis</mark> said city officials formed a working group that includes representatives from the homebuilding industries, policy experts, city officials and others to develop an ordinance that would better protect residents but reflect concerns about costs, too. \"I think more people are conscious of the need for a shelter,\" he said. \"I understand it's all about balancing economics and safety. But we need to plan for the future. We need to make our communities safer and we to take advantages of the resources we have .\" And <mark>Lewis</mark>, who has served as mayor during all three of Moore's EF-5 tornadoes, said he expects city's building code to change. \"Those ordinances will be back,\" he said. \"And I'm sure they will be different from what they were. We want to get everyone at the table and come up with something that works. I want to help keep people safe .\" Powered by Bookmarkify?"}, {"articleID": "2013012822_00083540_W", "names": {"Michael Bauer": ["Q1282419", "Q13194754", "Q21091340", "Q23559839", "Q3313220", "Q43127233", "Q50638837", "Q52833454", "Q55688645", "Q56953337", "Q6828496"]}, "date": "2013-01-28", "url": "http://sanfrancisco.grubstreet.com/2013/01/cecilia-chiang-james-beard-lifetime-achievement-award.html", "content": "? previous post b. patisserie very close to opening at california and divis food gal local legend cecilia chiang, who at 93 remains a spritely and sociable presence at restaurant openings and food events throughout the year (see her james beard foundation awards in new york. chiang is credited with having widely influenced the way americans perceive chinese cuisine, via her upscale restaurant the mandarin which opened at ghirardelli square in 1968. as critic patricia unterman once wrote, \"[chiang] was the first to offer many of the rich and spicy dishes of szechuan and hunan provinces...the garlicky, chili-infused sauces offered new taste sensations for westerners used to adulterated cantonese cooking .\" and as jbf president susan ungaro said today, on announcing the award, \"cecilia elevated chinese cuisine far beyond the takeout box. she completely embodies the spirit of this award .\" the mandarin closed in 2006, but you can get to know chiang via her two memoirs, the mandarin way (1974) and the seventh daughter (2008). she's credited with having taught szechuan cooking to james beard, herself, and he was a personal friend. chiang's son philip went on to become a co-founder of the chain p.f. chang's. the awards ceremony happens at lincoln center on may 3 and 6. the \"long list\" of semi-finalists in the chef and restaurant categories are due to be announced in a couple of weeks, with the list of finalists, or nominees, to come in mid-march. awards watch: cecilia chiang to recieve 2013 lifetime achievement award cecilia chiang to get lifetime achievement honor at this year's beard awards \"the golden state of cocktails\" trade-show launching in 2014 in l.a. staff meal is now rising sun tavern; the sun sets on sel de la terre meet the chicago pol behind so many food regulations, alderman ed burke laban stunned by the \"ineptitude' at the saint james;\" precise execution and respect for ingredients' a winning combination at the industry cecilia chiang to get lifetime achievement honor at this year's beard awards <mark>michael bauer</mark> mostly enjoys m.y. china; hirsch discovers some great lebanese food at arabian nights assemble to open (possibly) next month at historic ford assembly plant in richmond mina group, squat & gobble, burger bar top list of healthy s.f. offenders many more restaurants facing consequences from healthy s.f. controversy sa-beang thai opens on divis; pancoast pizza comes to walnut creek chalk board bistro, with former va de vi chef, replacing cyrus in healdsburg check out the menu and interior at hillside supper club, opening tonight almanac, a new gourmet fast-casual concept, on its way to spear street lago marsino, featuring fresh bread dough to go, coming to north beach chef moves at ad hoc and poggio; both chefs plotting their own things south american airline surprises bocanova diners with free flights"}, {"articleID": "2020012711_00168433_W", "names": {"Paulo Duarte": ["Q28678923", "Q52836640", "Q56946905"], "Rui Pinto": ["Q43121437", "Q51662097"], "Jeff Jacobs": ["Q16730124", "Q1686321"]}, "date": "2020-01-27", "url": "http://ctpost.com/business/technology/article/I-did-it-Portugal-hacker-says-he-exposed-15006799.php", "content": "https: //www.ctpost.com/business/technology/article/I-did-it-Portugal-hacker-says-he-exposed-15006799.php' I did it': Portugal hacker says he exposed African tycoon Barry Hatton, Associated Press Updated 6:47 am EST, Monday, January 27, 2020 In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in Porto, Portugal. On Monday, Jan. 6, 2020, Angola's foreign minister Manuel Augusto said that there is no political motivation behind the government's demand for more than $1 billion from dos Santos, her husband and a Portuguese business partner. Isabel dos Santos is a daughter of Jose Eduardo dos Santos, who ruled the oil - and diamond-rich nation for 38 years until 2017. less In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in...more Photo: <mark>Paulo Duarte</mark>, AP Photo: <mark>Paulo Duarte</mark>, AP Image 1 of / 1 Caption Close Image 1 of 1 In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in Porto, Portugal. On Monday, Jan. 6, 2020, Angola's foreign minister Manuel Augusto said that there is no political motivation behind the government's demand for more than $1 billion from dos Santos, her husband and a Portuguese business partner. Isabel dos Santos is a daughter of Jose Eduardo dos Santos, who ruled the oil - and diamond-rich nation for 38 years until 2017. less In this March 5, 2015 photo, Isabel dos Santos, reputedly Africa's richest woman, attends the opening of an art exhibition featuring works from the collection of her husband and art collector Sindika Dokolo in...more Photo: <mark>Paulo Duarte</mark>, AP' I did it': Portugal hacker says he exposed African tycoon 1 / 1 Back to Gallery LISBON, Portugal (AP)--A Portuguese hacker is claiming responsibility for leaking confidential documents implicating the billionaire daughter of a former prominent African leader in alleged murky international business deals. Lawyers for <mark>Rui Pinto</mark>, who is in a Lisbon jail awaiting trial in a separate case, said in a statement Monday he gave the information about Isabel dos Santos to the Platform to Protect Whistleblowers in Africa, an advocacy group based in Paris, in 2018. Dos Santos is a daughter of Angola's former president Jose Eduardo dos Santos and is reputedly Africa's richest woman after holding top jobs in Angola and a high-profile international career. The document trove was investigated by the International Consortium of Investigative Journalists and its affiliates, which produced an explosive report a week ago. The report incriminates not only Dos Santos, her husband and her close associates but also banks and businesses in Europe and the Middle East. Angolan authorities suspect Dos Santos of money-laundering, embezzlement, mismanagement, influence-peddling, forgery. They are demanding she repay at least $1.1 billion. Dos Santos has denied any wrongdoing. The more than 715,000 documents leaked by the Portuguese hacker detail allegedly unscrupulous deals by Dos Santos to build her estimated $2 billion fortune. Portugal is the southwest African country's former colonial ruler, and many of the documents were written in Portuguese. <mark>Pinto</mark>'s lawyers, William Bourdon and Francisco Teixeira da Mota, said in a statement their client acted out of \"a duty of citizenship\" and received no financial reward. Gerard Ryle, director of the International Consortium of Investigative Journalists, said on its website Monday: \"The documents came from a concerned citizen--someone doing the right thing by the public .\" <mark>Pinto</mark>, however, has been in jail for almost a year after Portugal extradited him from Hungary. He is charged with publishing internal documents that embarrassed soccer clubs and officials in the Football Leaks case. <mark>Pinto</mark> denies wrongdoing in that case, saying he is a whistleblower who acted in the public interest. Most Popular 1 Kobe Bryant dies in helicopter crash in Southern California 2 <mark>Jeff Jacobs</mark>: Kobe's daughter wouldn't be Auriemma's first recruit from a famed family 3 Police: teen shot in the head in Bridgeport expected to survive 4 Connecticut woman killed in snowmobile crash in Maine 5 Trooper who fatally shot teen to have limited contact with public 6 Bridgeport woman goes to market, wins $120,000 in Keno 7 Judge sets $10 a month rent during Stratford woman's eviction...View Comments © 2020 Hearst Communications, Inc. ."}, {"articleID": "2019072321_00120892_W", "names": {"Hannah Scott": ["Q33983630", "Q42314580"], "Daniel Jones": ["Q28065523", "Q39075157", "Q42763780", "Q446447", "Q5217710", "Q5217712", "Q52502267", "Q56596920", "Q56799640", "Q679289"]}, "date": "2019-07-23", "url": "https://msubobcats.com/news/2019/7/23/womens-volleyball-montana-state-volleyball-program-garners-avca-academic-honors.aspx", "content": "Story Links LEXINGTON, Ky. - The American Volleyball Coaches Association (AVCA) has announced that 1,125 teams have earned the AVCA Team Academic Award for the 2018-19 season, across all divisions. This number breaks the previous year's total of 977 to set an all-time high. The award, which was initiated in the 1992-93 academic year, honors collegiate and high school volleyball teams that displayed excellence in the classroom during the school year by maintaining at least a 3.30 cumulative team grade-point average on a 4.0 scale. Montana State put seven players on the All-Big Sky Conference Academic team, last fall. Bobcats named to the list included Serena Caspersen, Libby Christensen, Lexi Goroski, Hailey Merkes, Allyssa Rizzo, <mark>Hannah Scott</mark> and Kelsie White. As a team, MSU posted a 3.32 cumulative grade-point average. \"We have lofty goals on and off the court,\" said MSU third-year head coach <mark>Daniel Jones</mark>. \"At the start of the year we sat down with the team and clearly stated those goals, first of which was gaining a team GPA of 3.30 or better. I could not be prouder of every young woman on the team for stepping up to the challenge. Achieving this award reflects their commitment to be their best in all areas, and the toughness that it takes to control what they can whilst competing at the highest levels .\" \"We talk about building the legacy of Montana State Volleyball and leaving it better than we found it,\" <mark>Jones</mark> added. \"The 2018-19 team has taken a big step forward in that process .\" In addition to the Bobcats, other Big Sky schools earning team academic kudos included Eastern Washington, Idaho State, Northern Arizona, Portland State, Southern Utah, Northern Colorado and Weber State. Print Friendly Version Related Story Content"}, {"articleID": "2018080110_00081855_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2018-08-01", "url": "http://www.texomashomepage.com/news/politics/house-speaker-paul-ryan-uncovers-jewish-roots-on-pbs-show/1337568137", "content": "House Speaker <mark>Paul Ryan</mark> uncovers Jewish roots on PBS show By: Posted: Jul 31, 2018 08:57 PM CDT Updated: Jul 31, 2018 08:57 PM CDT House Speaker <mark>Paul Ryan</mark> uncovers Jewish roots on PBS show Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. <mark>BEVERLY HILLS</mark>, Calif. (AP) - House Speaker <mark>Paul Ryan</mark> was surprised and proud to find out he has Jewish roots. The Wisconsin Republican discovered his family history while filming a segment for the upcoming season of the PBS series \"Finding Your Roots With Henry Louis Gates Jr.\" Gates said Tuesday at a TV critics meeting that he traced <mark>Ryan</mark>'s heritage back to his 10th great-grandfather born in 1531 in Germany. The research showed <mark>Ryan</mark> is 3 percent Ashkenazi Jewish. \"You could have knocked him over with a feather and then he was very proud of it,\" Gates said of <mark>Ryan</mark>'s reaction. \"We don't know who that Jewish person was, but we know it was on his mother's German line, which makes sense. So somebody who was a Christian German slept with a Jewish German person and that's where that came from .\" Also featured on the show's fifth season debuting in January is Sen. Marco Rubio, R-Florida, and Rep. Tulsi Gabbard, D-Hawaii. Gates said he chose <mark>Ryan</mark> because he was fascinated by him and not his politics. He picked Rubio because he wanted to include a Cuban and Gabbard because of her Pacific ancestry. \"Her genome looks like the rainbow coalition because it's Asian and European and African and it's beautiful,\" he said. Rubio's history was traced to his fifth great-grandparents born in Italy and on his father's side his seventh great-grandparents born in the Canary Islands, off the northwest coast of Africa. \"There was a lot going on politically and in terms of immigration for him,\" Gates said. Gates' wife, Sharon Adams, is a Cuban historian and she had her graduate students research Rubio's history in addition to hiring people in Cuba to find his family tree in parish churches. \"It was like a challenge, an intellectual challenge for me,\" Gates said. Gates said his purpose in doing the show is to deconstruct race and show how racism manifests itself in the current anti-immigrant feeling in the United States. \"We're all immigrants. We're all mixed up,\" he said. \"When the lights came down, everybody was sleeping with everyone else .\" Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More Stories HONOLULU (AP) - U.S. Vice President Mike Pence is flying to Hawaii on...4 hours ago NEW YORK (AP) - The war of words intensified between two titans in...6 hours ago TAMPA, Fla. (AP) - President Donald Trump on Tuesday wrongly claimed...17 hours ago Don't Miss Copyright 2018 Nexstar Broadcasting, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2017072107_00412918_W", "names": {"Hugh Graham": ["Q1634361", "Q5930973"]}, "date": "2017-07-21", "url": "http://jamaicaobserver.com/business-report/paramount-looks-to-markets-in-cuba-and-haiti_105451?profile=1606", "content": "Paramount looks to markets in Cuba and Haiti BY KARENA BENNETT Tweet Listed company Paramount Trading Jamaica Ltd hopes to finalise a deal with some of Cuba's largest manufacturing groups and companies. The company, which is currently in partnership with Pittsburgh-based Allegheny Petroleum to build a $500-million oil-blending plant on Waltham Park Road in Kingston, also has its eyes on exporting products to the French-speaking Caribbean country Haiti. In a series of Jamaica Promotions Corporation (Jampro) - organised tours recently, top representatives from Cuba's largest manufacturing groups and companies--including Imeco, Quimimport, Coralsa and CubaSol--were hosted at Paramount's plant on East Bell Road in Kingston. Members of the delegation, including commercial attaché at the Cuban Embassy, Jorgé Sanchez, were also given a tour of the company's Waltham Park Road lubricant facility set to open in September. In a telephone interview with the Jamaica Observer yesterday, managing director of Paramount Trading, <mark>Hugh Graham</mark>, reckons that now is a good time for companies like Paramount and to a greater extent, Jamaica, to secure contracts with businesses in Cuba. \"The interesting thing about Cuba is that since they seem to be on the verge of opening up, we would want to get in there early because when they do open up, you will have the big companies from America that will come in. So I'm thinking that the first mover advantage would work well for us,\" he said. <mark>Graham</mark> noted that with volume demands three times that of Jamaica, signing off on supplier contracts with the Cuban manufacturers would be \"icing on the cake\" for the company. Paramount currently operates five business units, including its chemical products arm which deals in food and industrial products, the distribution of SIKA-branded products, manufacturing of commercial cleaning agents, haulage services and lubricants business. According to <mark>Graham</mark>, the delegates have shown particular interest in the Altra brand of lubricant for which the company has jointly partnered with Allegheny on producing. \"They displayed other interest in our baking soda from the food side of the business. We have a low sodium baking powder that works well with diabetics because the sodium content is lower than the regular baking powder,\" he told the Caribbean Business Report. In an effort to encourage relationships and business partnerships between Cuba and Jamaica, Jampro spearheaded another meeting with the companies yesterday aimed at determining the specific needs of each business. Paramount anticipates fulfilling the demand of the Cuban manufacturers if it secures a contract, given the planned opening of its lubricant facility later this year. The managing director is also of the view that the company will be able to successfully compete against industry giants in both Cuba and Haiti, given the importation tax relief for local companies manufacturing goods on the island. \"The competitive advantage of manufacturers here in Jamaica is that you don't pay the duties on the raw material that goes in manufacturing in the same way you pay the duties on the finished product .\" So this will certainly make us competitive as it relates to not having to pass that cost on to customers, which is almost 50 per cent duty, \"he said. ADVERTISEMENT"}, {"articleID": "2020020414_00381179_W", "names": {"Eddie Jones": ["Q1773628", "Q3047282", "Q5336166", "Q5336167", "Q5336170", "Q735730"], "Ryan Wilson": ["Q10524", "Q15581918", "Q2745188", "Q3943107", "Q47477514", "Q53660518", "Q7384652", "Q949777"], "George Ford": ["Q18686168", "Q21064450", "Q5539348"], "Jonathan Joseph": ["Q28672687", "Q6273512"], "Anthony Watson": ["Q16236647", "Q47546429", "Q4773680", "Q4773681", "Q48964969", "Q604801"]}, "date": "2020-02-04", "url": "http://bridportnews.co.uk/sport/national/18209988.jones-confirms-tuilagi-will-miss-englands-clash-niggly-scotland/", "content": "Sport National Sport <mark>Jones</mark> confirms Tuilagi will miss England's clash with \"niggly' Scotland By Press Association 2020 England Captains Run--2019 Rugby World Cup--Oita Stadium 0 comment <mark>Eddie Jones</mark> has branded Scotland\" niggly \"ahead of a Calcutta Cup showdown that will be missed by Manu Tuilagi. Tuilagi has been ruled out of the Guinness Six Nations trip to Edinburgh because of the groin injury sustained during last weekend's 24-17 defeat in France which kicked off their title quest in deflating fashion. <mark>Jones</mark> promised\" brutal physicality \"in Paris in comments that backfired because of the controversy they caused across the Channel and the tame performance delivered on the pitch. Undeterred, the head coach has taken early aim at Scotland by claiming that history shows they attempt to provoke England .\" Scotland are a niggly side. Our historical record against Scotland is interesting--over 80 per cent wins in England but only 50 per cent at Murrayfield, \"<mark>Jones</mark> said .\" It's about having good focus, good attention to the moment, good clarity about your game-plan, being well prepared. And we'll start with that today (Tuesday). \"Two years ago England were thumped 25-13 at Edinburgh in a defeat that exposed glaring breakdown deficiencies and launched a five-Test losing run that placed <mark>Jones</mark>' future in doubt. When the teams walked through tunnel to the changing rooms upon completing their warm-up, a brawl erupted that was provoked by Scotland number eight <mark>Ryan Wilson</mark> targeting <mark>George Ford</mark>, prompting Owen Farrell to defend his team-mate. Asked for an example of\" niggly \"conduct, <mark>Jones</mark> replied:\" The dressing-room scene two years ago when they tried to goad a couple of our players. And they were successful. \"Historically they've done that through the ages. That's the way they stay in the game and they're good at it .\" The Murrayfield environment helps them but you've got to be good enough to stay focused, be on task, do what you need to do. \"Composure is always important in rugby, but probably more so at Murrayfield .\" Although Tuilagi will be missing against the Scots, his likely one-match absence is positive news. Tuilagi lasted just 16 minutes against France to sounding alarm bells, given his career was once threatened by a serious groin problem and his recent setback with a similar issue that forced him to miss three games. But significant damage has been avoided and <mark>Jones</mark> is optimistic the Leicester man will return for the rest of the tournament. \"Manu had his MRI scan (on Monday night) and he has a slight, low-grade adductor strain. We're hopeful he'll be fit for Ireland. It's very good news, outstanding news,\" <mark>Jones</mark> said. Tuilagi's absence robs England of their most powerful player behind the scrum and his exit from the field resulted in a lack of firepower at the Stade de France, with Billy and Mako Vunipola already missing. <mark>Jonathan Joseph</mark> came on as his replacement and is competing with Ollie Devoto to deputise at outside centre. <mark>Anthony Watson</mark> was a late withdrawal from the team for the championship opener because of a calf issue but he is due to resume full training on Tuesday. 0 comment"}, {"articleID": "2010031017_00104059_W", "names": {"Matt Cain": ["Q1185532", "Q55108640"], "Brian Wilson": ["Q264117", "Q30090205", "Q313013", "Q338231", "Q4965651", "Q4965652", "Q4965653", "Q4965655", "Q4965656", "Q4965659", "Q4965660", "Q57049964", "Q913269"], "Steven Johnson": ["Q14950943", "Q27043582", "Q29512417", "Q42425350", "Q43071645", "Q52846523", "Q58362818", "Q5889281", "Q980046"], "Fred Lewis": ["Q3086888", "Q5495772"], "Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2010-03-10", "url": "http://mercurynews.com/breaking-news/ci_14643101?source=rss", "content": "santa clara valley water district could lose $70 million if well...purdy: with playoffs approaching, san jose sharks need to polish...scottsdale, ariz. - there's a beer company that proclaims its actor spokesman as the \"most interesting man in the world .\" one of these days, that company will wise up and hire omar vizquel, instead. even as he approaches his 43rd birthday next month, the beloved former giants shortstop and renaissance man remains a picture of fitness in a uniform - whether it's a bullfighter's jacket or major league double knits. vizquel started at shortstop and batted second for the chicago white sox in an exhibition at scottsdale stadium on tuesday. he isn't closing himself off to playing next year, too. \"well, i don't know, man,\" vizquel said. \"i'm letting my body tell me when. i feel good, my body feels good, and i've still got the passion .\" so he will have to postpone those three months of lessons required to step in a bullfighting ring. he took a one-day crash course in venezuela and settled for pictures in the uniform. \"with the cape and the sword, everything,\" he said. the previous winter, vizquel wrestled an anaconda in the rainforest. he actively paints and sculpts. he has skydiving, flying an f-14 jet, attending the triple crown horse races and being part of a formula one pit crew on his bucket list, too. for now, vizquel has to tangle with another form of danger: his outspoken manager and fellow venezuelan, ozzie guillen. a reporter jokingly asked him, off the record, if guillen was certifiably nuts. \"yes, and that's not between us,\" he said. \"i think everybody knows .\" the giants lauded mark derosa's patient approach when he signed a two-year contract. so what did he do on the first pitch he saw in the cactus league? ripped it for a single, of course. \"it was my first time facing live action in four or five months,\" said derosa, who is coming off wrist surgery. \"i wanted to pull the trigger on something .\" buster posey had a big day behind the plate in the giants' 6-2 victory. he caught a strong three innings from <mark>matt cain</mark>, two from closer <mark>brian wilson</mark>, and he helped rule 5 draftee <mark>steven johnson</mark> escape a bases-loaded jam. \"it was a good, crisp game, so i let him go,\" giants manager bruce bochy said. posey also threw out a runner at second base and hit his first home run of the spring. matt downs hit a tiebreaking single in the eighth inning, and <mark>fred lewis</mark> followed with a two-run shot as the giants improved to 6-1 this spring. the giants remain undefeated on bochy's watch. their only loss was a split-squad defeat managed by bench coach ron wotus. second baseman freddy sanchez began taking light swings off a tee over the weekend but said he hasn't achieved full range of motion in his surgically repaired left shoulder. \"i'm ahead of where they thought i would be, but there's no timetable,\" said sanchez, who is expected to begin the season on the disabled list. first baseman aubrey huff returned to camp tuesday. he said he had a case of food poisoning. sporting icon <mark>muhammad ali</mark> visited with giants players, coaches and staff to encourage participation in athletes for hope, an organization that connects athletes with charitable organizations. <mark>ali</mark>, who is afflicted with parkinson's disease, posed for pictures with nearly everyone on the roster. \"special day...and i know the guys really enjoyed it,\" bochy said. \"there's a champion not only in the ring but outside it, too. he has so much influence around the world. i couldn't tell you who won any medals at the atlanta olympics (in 1996), but i can't forget him lighting the torch .\" "}, {"articleID": "2013030313_00014033_W", "names": {"Cleveland Brown": ["Q21288684", "Q21465251"]}, "date": "2013-03-03", "url": "http://cle.scout.com/2/1271198.html", "content": "\"let me be clear,\" j.r. rickert posted on twitter. \"[cribbs] is a <mark>cleveland brown</mark> [until] march 12. no other discussions are [in] process .\" sure seems to have stepped into it. he probably couldn't have stepped into it worse had he put it in a bag, lit it on fire and stepped on the bag to put out the fire. this is shocking, i'm sure, that cribbs said something and caused a ruckus, but that's what happened. appearing on espn-850 on thursday, cribbs basically said his agents have been talking to other teams about his upcoming free agency. which they're not supposed to do. \"my agent has been meeting with several different teams,\" cribbs said in an on-air interview. \"there is a lot of interest. there are already numbers brought to the table. things are happening. wheels are turning behind closed doors .\" wheels turning? not a lot of wiggle room on that one. this of course would be? you know? against the rules. teams are not supposed to negotiate or even talk to agents of players with other teams until three days prior to free agency. doing so is tampering. this led to a scramble by cribbs' agents to say this was not happening. j.r. rickert posted on twitter. \"[cribbs] is a <mark>cleveland brown</mark> [until] march 12. no other discussions are [in] process .\" which of course makes it so. not to say that nfl teams don't violate the no-contact/tampering rule; it happens all the time. it's one of the reasons the league put in a three-day window prior to the start of free agency. in those three days, agents can talk to teams about a contract, but can't sign them. the new rule makes legal what had been happening for years. that wasn't all cribbs had to say, though. asked if he would accept a role as a special-teamer, cribbs said: \"i've been on this team for many years and watched our offense struggle every single year but once. and every time i step on the field on the offense, the majority of the time there was an exciting play. first down. momentum. for me not to be a part of the offense, i'm not ok with that .\" to say, \"hey, you're just a special teams guy .' i'm not ok with that. especially after catching 42 balls as a no. 3, no. 4 receiver (in 2011). you can't say i can't catch the ball. you can't say if you put me on the field i'm not going to produce. because that's what this game is about .\" ultimately it's producing, putting up points and winning. but now it's becoming more and more about whoever you draft, and opportunity for the draft pick. if these scouts didn't bring in this guy, tough for him. he has to get in where he can get in. we have to play these guys because we drafted these guys. \"it shouldn't be that. if you want to win, you play the guys who are the best. play the best guys who are going to win. too many organizations come to the browns trying to build instead of trying to win this year. put all your eggs into this year .\" because as you see, it's not definite that you'll be here the next year. they said (pat) shurmur was gonna be here for years to come, and that's what (mike) holmgren was preaching, consistency in the organization. but as you see, if you don't win there will be high turnover. put all your eggs in one year. win that year so you can have many more to come. \"at this point it seems like cribbs could not do a better job of opening the door to his exit. joe banner said last week that decisions have been made on the future of the browns free agents - cribbs and kicker phil dawson being the most prominent - but he wouldn't say the decisions. he did, though, stress that the browns will emphasize youth, and bring in younger players. that alone does not sound good for cribbs, who isn't exactly old at 29 but has a lot of miles on a 29-year-old body. cribbs still remains one of the better special teams players in the league. last season he had his best punt return average since 2007 and his best kickoff return average since 2009. he's fearless, but he's also not what he was in '07 when he scored three return touchdowns or in '09 when he scored four. since 2009, he has one return touchdown in three seasons. yes, there are new kickoff rules, but it's still not a good trend for a guy trying to stay with a team that is going younger. add on cribbs' recent chattiness and it just doesn't seem like the browns will want to keep him. cribbs is one of the most cooperative media guys on the browns. he's always willing to talk, it's appreciated and a media guy should never turn away from that. but? sometimes for the guy doing the talking, discretion is the better part of valor. and talking about your deal and a role you will not accept as free agency approaches doesn't seem like the best way to cuddle up with this new regime. banner does not seem like a guy who tolerates this kind of thing - especially when cribbs basically admits that he and his agents are guilty of tampering. though of course his agents said that's not so. at this point, it's been a great ride with cribbs, but his future seems like it will be elsewhere. subscribe today and get a full year of copyright? scout.com. all rights reserved. this website is an unofficial independent source of news and information, and is not affiliated with any school, team, or league."}]