[{"articleID": "2015110214_00181439_W", "names": {"Keith Jackson": ["Q6384543", "Q6384545", "Q6384546"]}, "date": "2015-11-02", "url": "http://marinij.com/general-news/20151102/fbi-and-shrimp-boy-chow-set-to-clash-in-epic-sf-trial", "content": "News FBI and Shrimp Boy Chow set to clash in epic SF trial Tony Serra, defense attorney for Raymond \"Shrimp Boy\" Chow, holds a flier for a \"Free Shrimp Boy\" T-shirt last year outside the federal courthouse in San Francisco. (LiPo Ching/Bay Area News Group) By Howard Mintz, Bay Area News Group, @ hmintz on Twitter Posted: #Comments Leland Yee, the former state senator, leaves the federal courthouse in San Francisco in July after accepting a plea bargain in the corruption and gun trafficking investigation. (Laura A. Oda/Bay Area News Group) SAN FRANCISCO>> From the day last year that FBI agents swooped down on former state Sen. Leland Yee and dozens of other targets of the sprawling crime and corruption probe dubbed \"Operation Whitesuit,\" one central figure made it clear he would not go down easily. Raymond \"Shrimp Boy\" Chow. While Yee and every other defendant hunkered down and worked behind the scenes to cope with the U.S. Justice Department's sweeping racketeering indictment, Chow, the reputed head of San Francisco's Chinese crime syndicate, went public with his indignant claims of innocence. J. Tony Serra, a San Francisco defense lawyer famed for taking on the government, even held a news conference in his offices the week of the March 2014 arrests, handing out \"Free Shrimp Boy\" T-shirts to make his jailed client's case. This week, the collision course between Chow and federal prosecutors will finally reach its climax in federal court in San Francisco. Both sides will pick a jury for a trial that will decide racketeering charges against Chow ranging from gun trafficking to murder--and also serve as a referendum on the government's five-year undercover sting operation, which relied on wiretaps, informants, bags of cash and booze-filled meetings in fancy hotels and restaurants to snag the FBI's quarry, including Yee. \"It's all a gamble,\" said San Rafael resident Rory Little, a former federal prosecutor who is a professor at the University of California, Hastings College of the Law, in San Francisco. \"Until the play opens, you don't know how it will end. But when (Serra) makes these arguments, juries like him. If they like him, they hear him on how it's on the big, bad government.\" When the trial begins in earnest Nov. 9, jurors will certainly hear two competing stories. Federal prosecutors will depict Chow as a violent gang leader with a long history of overseeing Chinatown's crime scene. Chow's lawyers will try to sell him as a reformed criminal who turned straight only to be framed by federal agents trying to justify one of the longest and most expensive undercover probes in recent Bay Area history. And given that Yee and other key defendants in the case already have pleaded guilty to racketeering charges and await sentencing, it may be the public's only full glimpse of the government's operation. The \"Dragonhead' Federal prosecutors do have plenty of ammunition. In a sweeping federal indictment alleging dozens of crimes, prosecutors portray Chow as the leader, or\" Dragonhead, \"of an Asian organization called the Ghee Kung Tong that law enforcement agents say was involved in drug and gun trafficking and money laundering, as well as trafficking in stolen booze and cigarettes. Advertisement Charges added to the case in October also now link Chow to the murders of at least two alleged gang rivals, one gunned down in San Francisco in 2006 and the other found dead with his wife in Mendocino County two years ago. During the course of the undercover probe, Chow allegedly accepted thousands of dollars in cash for a variety of crimes from FBI agents posing as businessmen and gangsters, according to court papers. The 55-year-old Chow also has previously served federal prison time for racketeering and other crimes. He was sentenced to 24 years in federal prison in 2000, but served only three years after cooperating in the government's case against another reputed Asian organized crime figure.\" Dave' the FBI agent But defense lawyers plan to put the government itself on trial, particularly the lead undercover FBI agent, who met repeatedly with Chow, plying him with drinks and handing him envelopes of cash in posh spots such as the Hotel Nikko in San Francisco. The agent is only identified as \"Dave,\" denigrated in Chow's court papers as \"suffering from logorrhea and a generous dollop of Tourette's disorder as well.\" Defense lawyers say the recently added murder charges are a late, desperate move to bolster the government's case, relying on what they describe as dishonest informers who've cut deals with prosecutors. \"It is so far astray from legitimate law enforcement it doesn't make any sense,\" said Curtis Briggs, who is aiding Serra in the defense. \"It's a cops-and-robbers game gone wrong.\" The trial is unlikely to delve much into the political corruption allegations against Yee, who was charged with accepting bribes in exchange for political favors. But it is expected to touch on the origins of the investigation, which only stumbled upon Yee as the FBI probe into Chow's dealings connected the ex-legislator with a number of figures, including San Francisco political consultant <mark>Keith Jackson</mark>, who also has pleaded guilty to racketeering. The direct ties between Yee and Chow in the indictment are tenuous, other than an allegation the legislator agreed to back a resolution praising the Ghee Kung Tong organization for campaign cash, but <mark>Jackson</mark>'s involvement with Chow led the FBI to the senator--and the pursuit of the bribery aspect of the probe. \"A workable strategy' James Brosnahan, <mark>Jackson</mark>'s lawyer, said the Chow trial can shine a light on what he considers a wayward investigation that should be reviewed by the Justice Department. And Brosnahan believes a Bay Area jury may be receptive to Serra's fiery style of characterizing the government as worse than the crimes it is pursuing.\" It is a workable strategy, \"said Brosnahan, also a high-profile Bay Area defense lawyer.\" I've not seen a case where the government had a sting operation that lasted this long, cost this much money and went at people who otherwise would not be involved in this kind of thing. \"Little, however, cautions that Chow must do more than simply attack the government for the FBI's tactics.\" It's not a powerful argument to just say the government spent a lot of money, that they spent (many) years on this, \"he said.\" (Racketeering laws) were invented to prosecute Mafia bosses. The allegations here boil down to Shrimp Boy Chow being a Chinese gang Mafia boss. There is no question Shrimp Boy was the main target. \""}, {"articleID": "2017041714_00747013_W", "names": {"John Fraser": ["Q16090802", "Q16729089", "Q1700123", "Q17523755", "Q17523831", "Q19565408", "Q3181531", "Q43910851", "Q52732316", "Q6217676", "Q6234025", "Q6234043", "Q6234047", "Q6234049", "Q6234053", "Q6234056"]}, "date": "2017-04-17", "url": "http://www.bordermail.com.au/story/4602458/land-deal-set-for-corowa-splash-park/?cs=4067", "content": "Federation Council administrator expected to ratify in-principle support for Corowa water fun park READY TO ROLL: Shaun Whitechurch with consortium members Stephen O'Bryan and <mark>John Fraser</mark> with plans for their water fun park to be built near Corowa's tennis centre. A PLAN for a privately-run water fun park at Corowa is set to get a major boost at Federation Council's meeting on Tuesday. Shire administrator Mike Eden should give in-principle support for the development to be located on council land in Riesling Street near the town's tennis club. The approval will be subject to a satisfactory management plan and lease deal between the shire and consortium of fun park investors. In her report recommending the move, Federation Council corporate and community services director Kristy Kay noted positive opinion for the plan. \"The proposal has generated much interest from the local community with 21 responses received,\" Ms Kay stated. \"Overall most people (19) were in support of the proposed development.\" Whilst only two responses were against the proposed development, they identified the location as being the main issue, citing reasons such as safety, cost for families, commercial viability and sustainability. \"Consortium spokesman Shaun Whitechurch welcomed the council's backing.\" From our point of view it's great that they are going to the recommendation and should it go through as presented the consortium can now put their whole development and plans to the council, so we can get the ball rolling, \"Mr Whitechurch said. He expected the group would be able to present a detailed blueprint to the council for consideration at its May meeting. The first stage of the fun park would involve three water slides, a mini splash pad, kiosk and barbecue area. A second leg is to include a putt putt golf course and an area for an animal farm to occupy in school holidays. Mr Whitechurch has not put a value on the aquatic project but it could be similar to the $350,000 spent on the Wangaratta splash park which replaced the Yarrunga pool. A valuation of the land to determine a rental figure will be required as part of the process.\" The consortium don't expect the lease for nix, they expect rent to be on commercial terms, \"Mr Whitechurch said. He admitted the group's original aim of opening by December 1 would be tight.\" Whilst having it ready for next summer is optimistic nothing is impossible if approvals fall into place relatively quickly, \"Mr Whitechurch said."}, {"articleID": "2019052115_00341318_W", "names": {"Paul Davies": ["Q16669255", "Q21131684", "Q535733", "Q7150145", "Q7150146", "Q7150147", "Q7150148", "Q7150149", "Q7150150", "Q976254"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"], "Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-05-21", "url": "http://www.gamereactor.eu/games/17281/Destiny/?sid=56e4cbef0f2287f1edff55384775f80e", "content": "DESTINY REVIEW. Written by <mark>Paul Davies</mark> on the 26th of September 2016 at 10 \"It feels like the end of the road for Destiny before the true sequel. Having said that, it remains a road well worth travelling.\" 0 REVIEW. Written by <mark>Mike Holmes</mark> on the 21st of September 2015 at 14 \"It builds on the base game and improves it in almost every way, and while it might be pricey, it's an essential expansion for fans.\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of August 2017 at 15:09 DeeJ cleared the whole thing up for us. 0 NEWS. Written by Ford James on the 23rd of June 2017 at 17:08 But not if you plan to play on PC. 2 NEWS. Written by <mark>Sam Bishop</mark> on the 5th of June 2017 at 12:34 \"Our sole focus at this time is Destiny 2.\" 1 NEWS. Written by <mark>Sam Bishop</mark> on the 29th of March 2017 at 13:28 Reddit users spotted it."}, {"articleID": "2009082319_00066704_W", "names": {"Lee Johnson": ["Q16238905", "Q1631678", "Q1773767", "Q19979346", "Q6514171", "Q6514172"]}, "date": "2009-08-23", "url": "http://brisbanetimes.com.au/queensland/record-temps-bring-seq-fire-ban-20090824-evbj.html", "content": "brisbane is poised to break its top august temperature in more than 60 years, as many parts of queensland sizzle in the final days of winter. weather forecasters are predicting a maximum of 33 degrees in the sunshine state capital today - marginally topping the august 1946 record of 32.8 degrees. the steamy conditions will be accompanied by strong winds, prompting a complete 48-hour fire ban in the southern half of the state. \"we're going to see near-record or record temperatures,\" bureau of meteorology senior forecaster gavin holcombe said. \"the strong winds, dry conditions, high temperatures will all create probably extreme fire danger for the south-east coast.\" total fire ban the lighting of all fires, including permit fires, has been banned across most areas of the state south of mt isa until midnight tomorrow. queensland fire and rescue service commissioner <mark>lee johnson</mark> has encouraged residents to report small grass fires as quickly as possible. \"in these conditions, a small grass fire can turn into a large bushfire threat very quickly,\" mr <mark>johnson</mark> said. \"if you see a small fire near your property or even on a median strip, dial triple zero straight away.\" \"the qfrs is not taking any chances and we are well prepared for these conditions.\" last night qfrs crews battled grass fires at tallai in the gold coast hinterland, and on the outskirts of beaudesert to the city's south-west and esk to the north-west. rural fire service strike teams are on standby to provide a rapid response if necessary. \"the sooner we can start fighting the fire, the less chance we have of it getting out of control.\" mr <mark>johnson</mark> has also asked motorists not to flick cigarette butts from car windows. \"having to allocate crews to put out median strip fires because a motorist has carelessly flicked a cigarette butt, means we have to draw resources away from where we may really need them,\" he said. queensland's winter sizzle the weather bureau says about 20 centres in the state's west - including birdsville and bedourie - hit record august temperatures on saturday of 38 degrees in brisbane yesterday the mercury climbed to 28 degrees, while in ipswich the temperatures topped 32 degrees. \"after that the winds ease off into tuesday, although it's still dry and temperatures are still high, though not as high,\" mr holcombe said. \"beyond that, tuesday night should be cooler, with cooler weather to follow on wednesday and thursday.\" mr holcombe said persistent northwesterly winds blowing for the northern territory and a series of troughs were blocking the usual southerly change. simply log in below to start commenting on articles .) please check the following fields before continuing: i understand that submission of this comment is covered by the you need to have read and accepted the conditions of use. thank you. your comment has been submitted for approval. comments are moderated and are generally published if they are on-topic and not abusive."}, {"articleID": "2014032112_00054338_W", "names": {"Cameron Clark": ["Q17452418", "Q18637254", "Q5026208"]}, "date": "2014-03-21", "url": "http://www.mitchellrepublic.com/content/no-12-ndsu-shocks-sooners", "content": "Tweet SPOKANE, Wash. - Trending on Twitter. Another No. 12 seed in the NCAA men's basketball tournament with upset hopes. North Dakota State pulled it off Thursday night. Freshman Carlin Dupree, in the game only because Bison star Taylor Braun fouled out, hit two free throws and a key basket in overtime and the Bison won an NCAA Division I men's basketball tournament game in the round of 64 for the Summit League for the first time since 1998. The 80-75 win over No. 5 seed Oklahoma in the West Region second round was stunning in its theatre. \"The atmosphere was 100 times greater than what I expected,\" Braun said. \"The intensity, everything about the game, was unbelievable. We stuck together as a team.\" Earlier in the day in this building, No. 12 seed Harvard knocked off No. 5 Cincinnati in an East Region game that had the local Spokane crowd generally rooting for the Crimson. They really got on the Bison bandwagon a few hours later. \"It was kind of cool to see the whole arena behind us,\" said center Marshall Bjorklund. \"It was pretty nuts.\" With Braun having fouled out in overtime, Dupree hit two free throws with 1 minute, 14 seconds left and NDSU led 74-72. His shot in traffic with 40 seconds left made it a four-point advantage. After another OU miss, Lawrence Alexander capped his monster 28-point night with two free throws for a 78-72 advantage with 32 seconds remaining. \"It was a tough game not to win,\" said Oklahoma head coach Lon Kruger. \"Credit North Dakota State. They did what they needed to do down the stretch. I thought our guys fought like crazy the last 25 minutes in regulation to get in position to win the game.\" The game was tight the entire way. The Bison led 61-57 when <mark>Cameron Clark</mark> went to work for Oklahoma. His 3-pointer with 2:03 remaining started eight straight OU points. Braun stopped it with two free throws with 32 seconds left to bring NDSU within 65-63. Isaiah Cousins made 1 of 2 free throws for OU, giving NDSU a chance. It cashed in. Alexander's 3-pointer with 11 seconds left ignited the arena crowd and tied it. The play, Alexander said, was drawn up to go to Braun. But the Bison senior instead got the assists to Alexander. \"Coming out of the huddle, I told him if you don't have anything, I'll be out there on the right wing,\" Alexander said. After the game, Braun said he could hear Alexander yell \"buckets\" before it went in. \"L.A. hit a game winner his freshman year at Oakland, and I've kind of always trusted him when it came down to it,\" Phillips said. OU had three shots to win it with Buddy Hield having the best look from the corner, but NDSU survived the flurry. \"It was upsetting to miss those three shots, but we were still pumped up to get to overtime,\" said OU forward Ryan Spangler. But NDSU hit 4 of 6 field goals in overtime and all six of its free throws. For the game, the Bison were 20 of 22."}, {"articleID": "2016021301_00084063_W", "names": {"Brian Higgins": ["Q4964039", "Q4964044", "Q505581"]}, "date": "2016-02-13", "url": "http://buffalonews.com/city-region/town-of-tonawanda/town-of-tonawanda-to-receive-160000-in-federal-funding-20160212", "content": "Tweet ADVERTISEMENT WASHINGTON--The Town of Tonawanda has won a $160,000 federal grant to come up with a plan to deal with the pending closure of the Huntley Generating Station. The Economic Development Administration grant will allow the town, in conjunction with the University at Buffalo's Regional Institute, to develop a long-term plan to address what should be done with the facility, and what should be done to cope with the loss of tax revenue from the plant. Sen. Charles E. Schumer, D-N.Y., and Rep. <mark>Brian Higgins</mark>, D-Buffalo, announced the grant. \"What Tonawanda needs now is a comprehensive economic plan to determine its future--and this significant federal Economic Development Agency investment will allow the town to do just that,\" Schumer said. NRG Energy, which owns the out-of-date and pollution-producing coal-fired power plant, has announced plans to begin laying off its 75 employees in March, but <mark>Higgins</mark> said that's just part of the impact of the closing. \"The loss of Huntley Plant tax revenue is leaving a huge hole in the Town of Tonawanda and Ken-Ton school budgets, raising serious concerns about the ability to maintain a level of service that residents, parents, teachers and students deserve,\" said <mark>Higgins</mark>. \"This federal funding will help to develop creative strategies that can help minimize the impact of this loss.\" "}, {"articleID": "2015062718_00017618_W", "names": {"Philippe Petit": ["Q15971636", "Q3380529", "Q705289"], "Greg Foster": ["Q2355201", "Q448013"], "Christopher Browne": ["Q21084520", "Q5111995"]}, "date": "2015-06-27", "url": "http://www.comingsoon.net/movies/news/453915-robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d?utm_source=rss&utm_medium=rss&utm_campaign=robert-zemeckis-the-walk-to-open-one-week-early-in-imax-3d", "content": "Audiences at IMAX 3D and other select theaters will have the chance to be the first to experience The Walk, the new motion picture event from Academy Award winner Robert Zemeckis, when it is released exclusively in those theaters on Wednesday, September 30. The film, which has also been chosen as the opening night selection of the New York Film Festival, will then enter wide release on October 9. Twelve men have walked on the moon. Only one man has ever, or will ever, go where The Walk will take moviegoers. In the film, the director behind Forrest Gump, Cast Away, Back to the Future and Flight, once again uses cutting edge technology in the service of what is targeted to be an emotional, character-driven story. Said to offer innovative photorealistic techniques and IMAX 3D wizardry, The Walk aims to give moviegoers a chance to viscerally experience the feeling of reaching the clouds. A love letter to Paris and New York City in the 1970s and to the Towers of the World Trade Center, The Walk is rated PG, targeting audience members of all ages. The film offers the true story of a young dreamer, <mark>Philippe Petit</mark>, and a band of unlikely recruits who together achieve the impossible: an illegal wire walk in the immense void between the World Trade Center towers. With little more than nerve and blind ambition, <mark>Petit</mark> and his ragtag crew overcome daunting physical obstacles, betrayals, countless close calls and overwhelming odds to beat the system and execute their mad plan. \"We're excited to be part of Sony's exclusive release for\" The Walk,' which was designed for and makes brilliant use of IMAX 3D, \"said <mark>Greg Foster</mark>, Senior Executive Vice President of IMAX Corp. and CEO of IMAX Entertainment,\" No one understands IMAX better than our longtime partner Bob Zemeckis - he is an artistic genius who uses all of his expertise to give audiences an edge-of-your-seat thrill that will make moviegoers feel like they are out on the tightrope themselves. We're excited that our audiences will have the chance to see it first. \"Featuring a screenplay by Robert Zemeckis & <mark>Christopher Browne</mark>, The Walk is based on the book\" To Reach the Clouds \"by <mark>Philippe Petit</mark>, and is produced by Zemeckis, Steve Starkey and Jack Rapke. Joseph Gordon-Levitt, Ben Kingsley, James Badge Dale, Ben Schwartz, Charlotte Le Bon, Clément Sibony and César Domboy star."}, {"articleID": "2018011403_00553729_W", "names": {"John Paul": ["Q1701359", "Q6252169"]}, "date": "2018-01-14", "url": "https://citizen.co.za/news/news-world/1782060/vatican-religion-pope-francis/", "content": "Pope Francis and Latin American winds of change by Catherine MARCIANO/AFP The Archbishop of Buenos Aires was virtually an unknown when he was elected on March 13, 2013, becoming the first pope to choose the name Francis--a homage to St. Francis of Assisi, who dedicated his life to the poor A squall of fresh air with a distinct Latin American feel tore through the Vatican on the election of Pope Francis, a passionate Argentine whose defence of the downtrodden has stirred hearts across the world. On his return to the continent this week with a trip to Catholic majority Chile and Peru, Francis will not only speak his native Spanish but also a vibrant spiritual and cultural language common to all. \"I feel free, nothing scares me,\" the pontiff once said, despite shouldering the burden of leading the world's 1.3 billion Catholics, nearly half of whom live in the Americas. It was a typically American expression according to fellow Argentine, Bishop Marcelo Sanchez Sorondo, who has known Francis for decades. \"North and South America are both societies with European origins that have realised they need independence. The idea of freedom is the cornerstone of the Americas,\" the philosophy professor told AFP. The first pope to address the United States congress has \"a strong sense of human dignity and freedom\" , he says. But while one of the Americas has prospered, the other has become increasingly impoverished. \"The pope is very sensitive to the issue of social justice--a more Latin than North American theme, hence the interest he has for the\" peripheries' in difficulty, \"Sorondo said, referring to Francis's support for those on the margins .--\"Link between worlds'--The Archbishop of Buenos Aires was virtually an unknown when he was elected on March 13, 2013, becoming the first pope to choose the name Francis--a homage to St. Francis of Assisi, who dedicated his life to the poor. The Argentine hails from a family of Italian immigrants and became\" a sort of link between the Old World and the New World \", says Giovanni Maria Vian, editor of the Vatican's L’Osservatore Romano newspaper. However,\" the dramatic history of Argentina at the end of the 20th century is what shapes his personal trajectory \", he says in the preface to a book called\" Francis, the American pope \". In 2007, Jorge Bergoglio was elected by his fellow bishops in Aparecida in Brazil to draw up the final document of the Latin American Episcopal Council, which can be read as a guide to many of the themes dearest to him. Bergoglio stressed the ills of a\" scandalous inequality which wounds personal dignity \", a theme which\" clearly guides his actions at the head of the church today \", Vatican specialist Nicolas Seneze writes in\" The Words of the Pope \". The Aparecida conference\" prioritised the poor \", Sarondo said.\" The pope is very critical of capitalism which sacrifices human rights--a typical stance of the Latin American episcopate, \"he added .--\"Faith and blood'--While Polish pope <mark>John Paul</mark> II had denounced\" wild capitalism \", Francis has taken more concrete steps, such as calling for\" a poor church for the poor \"and turning down a luxurious papal apartment for a humble hotel room, he said. Bergoglio was an active pastor, taking the bus around Buenos Aires and heading without a second thought into slums in Latin America to comfort the poor. An inmate at the Virgen de Fatima Women's prison in Lima shows handmade wooden rosaries made by the prisoners. A total of 72 inmates in the prison have produced 33,000 rosaries to be sold at stores in Lima, to donate the proceedings to Pope Francis His experience of the Argentine economic crisis has also shaped his idea of\" the misery of big cities \", which fatally attract poor farmers from the countryside in search of a better life, stripping them of their culture. His vision was strongly influenced by the\" theology of the people \", the Argentine, non-violent version of the South American Liberation theology--a strain without the focus on the Marxist class struggle. And since his arrival in Rome, the pope has created new Latin American cardinals, saying\" they bring with them the air of new churches and of a history of faith and of blood \". In doing so, he is also reshaping in his image the conclave of cardinals that will elect his successor."}, {"articleID": "2016022119_00774204_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-02-21", "url": "http://dhakatribune.com/world/2016/feb/22/gop-candidates-offer-stark-contrast-visions-field-thins", "content": "today's paper>> world>> published: 00:41 february 22, 2016 GOP candidates offer stark contrast in visions as field thins Reuters As the presidential field winnows after <mark>Donald Trump</mark>'s commanding victory in South Carolina's nominating contest, US Republican voters face a choice that grows starker by the day. Do they back the rage-infused, turn-back-the-clock tone of <mark>Trump</mark>, or perhaps his conservative, evangelical rival, Ted Cruz? Or do they favour the sunnier, more inclusive appeals of emerging establishment favourite Marco Rubio or Ohio Governor John Kasich. Not only will the answer decide the Republican nominee, it may well change what it means to be a Republican. The party is enduring a schism between those who want to work within the system and those want to tear it down. \"The GOP is broken may not be salvageable,\" said Juleanna Glover, a Republican consultant in Washington who had supported Jeb Bush, who dropped out of the race on Saturday after a poor showing in South Carolina. <mark>Trump</mark>'s support, she said, shows that one-third of the party's voters \"want out.\" Bush, the former Florida governor, had been part of that camp of Republican establishment optimists. Ben Carson, the right-wing retired neurosurgeon, was never a factor in South Carolina and could be the next to exit. That leaves a Final Four, of sorts, as the campaign maintains a southern focus for a string of contests on March 1 that include Georgia, Texas, and Virginia. <mark>Trump</mark> and Cruz will be the favourites in many of them, with Rubio, a senator from Florida, and Kasich seen struggling until the primary schedule shifts to more hospitable regions, including their home states. Rubio finished in a near tie for second in South Carolina with Cruz, rebounding strongly from his stumble in New Hampshire, where he finished fifth and was criticised for being overly scripted. He stands to benefit the most from Bush's departure as the perceived establishment standard-bearer. Kasich trailed well behind, managing fewer votes than Bush. Going to extremes Billionaire real estate developer <mark>Trump</mark> has racked up wins in two of the three early-voting states by channeling the disillusionment many Americans, especially the white working-class, feel with stagnant wages, globalisation, the influence of corporate money in politics, and a gridlocked government. Cruz, a senator from Texas, has courted libertarian and religious voters who believe their values are under assault. Both strike a tone of alarm, largely about the porous US southwest border and the threat of Dae's h. And both often offer a paean to the past, asking voters to envision a time when the country appeared to be more prosperous and homogenous. Some Republicans fear that the appeal of either candidate will simply be too narrow. Alternatively, Rubio and Kasich bill themselves as healers of America's fractured politics. On the stump, Rubio speaks of uniting the quarrelsome factions of the Republican Party, and has embraced diversity in a way that his competitors have not. Rubio has vowed to grow and unite the party and broaden its appeal among younger Americans. The contrast between Rubio's events Friday and those of <mark>Trump</mark> and Cruz was vivid. <mark>Trump</mark>, just a day after getting into public spat with Pope Francis, told an apocryphal story about a general who executed Muslims using bullets dipped in pig blood. Cruz's rally featured Phil Robertson, star of the reality show \"Duck Dynasty\" who has condemned homosexuality as sinful. But some Republican voters worry that Rubio, who, like Cruz, is a first-term senator, and Kasich, who has labeled himself \"the prince of light and hope\" , aren't tough of enough to usher in the radical change they crave."}, {"articleID": "2017050716_01009819_W", "names": {"Dustin Johnson": ["Q1002293", "Q30015838"], "Patrick Reed": ["Q15905139", "Q57514710"], "Fabian Gomez": ["Q5427907", "Q6077142"], "Greg Owen": ["Q28860416", "Q3116266", "Q594237"]}, "date": "2017-05-07", "url": "http://www.pga.com/news/pga-tour/dustin-johnson-returns-top-form-wells-fargo-championship", "content": "<mark>Dustin Johnson</mark> returns to top form at Wells Fargo Championship Jim Dedmon | USA Today Sports Images <mark>Dustin Johnson</mark> got back into the swing of things with a 5-under round three at the Wells Fargo Championship. By Series: PGA Tour Published: Sunday, May 07, 2017 | 11:38 a.m. WILMINGTON, N. C .--It took about 45 holes, but <mark>Dustin Johnson</mark> finally looked like the world's top-ranked golfer again on his final nine holes Saturday afternoon at Eagle Point Golf Club. The Coastal Carolina alumnus and shot a bogey-free 5-under 67 in the third round of the 15th Wells Fargo Championship to climb into a tie for 14th at 4-under 212 and pull within four shots of leader <mark>Patrick Reed</mark>. Four of <mark>Johnson</mark>'s five birdies came on his second nine. RELATED: Wells Fargo Championship leaderboard | Photos With his late rally, <mark>Johnson</mark> still has hope of becoming the first player since Tiger Woods in 2007-08 to win four consecutive starts on the PGA Tour. \"If it's windy again tomorrow, hopefully I get off to a good start and post a real good number and let them play for it,\" <mark>Johnson</mark> said. \"Starting today I thought it was going to take 11 or 12 under, and I'm 4 under so I need to shoot 7 under tomorrow probably to have a chance.\" <mark>Johnson</mark> made a 22-foot birdie putt on his first hole of the third round, the par-3 10th, then made four birdies on his second nine with putts of 4, 3, 3 and 9 feet, the final birdie coming on the tough par-4 ninth hole. He's having difficulty reading Eagle Point's greens in his first look at the course. \"I just need to putt better,\" <mark>Johnson</mark> said. \"Even this afternoon I didn't putt good. I shot 5 under and hit it good and chipped it well but didn't make any putts hardly. I made a nice one to start the day and nice one to finish, but I've missed a lot of 10-footers for birdie out there.\" ...The greens are kind of tricky, they're real subtle. I just haven't played and my feel is a little bit off. I just need some more rounds. I feel like it's getting better. It's getting there. \"No. 1 in the World. No. 1 in the FedExCup standings. No. 1 in the Power Rankings. <mark>Dustin Johnson</mark> is back in action. pic.twitter.com/lteVz35y9M--PGA TOUR (@ PGATOUR) May 4, 2017 <mark>Johnson</mark> hit 9 of 14 fairways in the third round after hitting just six fairways in the second. He put a new TaylorMade driver into play in the third round, replacing a driver that won three consecutive tournaments.\" was in play, that's all I care about, \"<mark>Johnson</mark> said.\" I hit one good drive all day...The problem is I'm not swinging good enough to judge. I've got to start hitting it solid first then I'll be able to figure out which one I want to use. \"<mark>Johnson</mark>'s second round was suspended due to darkness Friday, and he made two bogeys and a birdie on the five holes he played to complete his second round Saturday morning to make the cut on the number at 1-over 145. In the second round, <mark>Johnson</mark> birdied the 15th hole, bogeyed holes 16 and 17 and made a par on the 18th to be among the 79 players who made the cut to Saturday's third round.\" I wasn't worried about the cut, \"<mark>Johnson</mark> said. His second-round 3-over-par 75 is <mark>Johnson</mark>'s highest round since last September's Deutsche Bank Championship. <mark>Johnson</mark> practiced in the two hours he had between the second and third rounds, paying particular attention to the short game and putting.\" I'm just rusty. I really hadn't had any practice coming into here. I mean none, \"<mark>Johnson</mark> said.\" ...That's the biggest thing. I had a little bit better feel out there today. It's just going to take a little bit of time to get back into it. But I felt like I played pretty well this afternoon. \"<mark>Johnson</mark> is playing his first tournament since winning the WGC-Dell Technologies Match Play Championship on March 26 and spent the past four weeks recovering from a back injury incurred when he slipped and landed on a small staircase on the eve of the Masters Tournament. <mark>Johnson</mark> tees off with Morgan Hoffmann at 12:25 in the final round, 1:20 before the final group of <mark>Reed</mark> and Alex Noren. Lefty makes charge Phil Mickelson played Saturday like the tournament hasn't changed venues this year. Though he has yet to win at Quail Hollow Club in Charlotte, Mickelson has nine top-10s and seven top-fives including a runner-up finish in 2010 in the Wells Fargo, and he made a move Saturday at Eagle Point. Phil Mickelson enters the third round five shots off the pace. pic.twitter.com/KPXtQy8Vi8--PGA TOUR (@ PGATOUR) May 6, 2017 Shaking off a disappointing double bogey on his final hole in the second round, Mickelson shot a 3-under 69 Saturday to move into a tie for 14th at 4-under 212. He made four birdies--holing a pair of 15-foot birdie putts and a 7-footer, and chipping in from 35 feet on the fifth hole--while making a bogey on the ninth hole.\" I had a lot of opportunities to take it even lower and really move up the leaderboard, but it was a good solid day, \"Mickelson said.\" At least I put myself in position where if I get hot tomorrow and get it going I can make up the ground. I was thinking I needed to shoot 5, 6, 7 under today to get right where I wanted. \"Mickelson believes a low number is possible at Eagle Point, but it won't be easy.\" Surprisingly, you can be a little more aggressive than you think, but you have to use the slopes and contours on the green to stop the ball close rather than just flying it right at it because still, even though they're softer than the first couple of days, they're still tough to hold anything past a wedge, \"Mickelson said.\" But I think it's a lot easier today than it has been the first two days. \"A cut above WATCH: Nicklaus nearly holds out | Fowler, Thomas, Walker at the Derby Because more than 78 players made the 36-hole cut, another cut to the low 70 scores and ties was made after 54 holes Saturday afternoon. Players who didn't qualify for Sunday's final round were <mark>Fabian Gomez</mark>, <mark>Greg Owen</mark>, Jason Bohn, Martin Flores and Steven Alker, who each shot a 5-over 77. This article is written by Alan Blondin from The Sun News and was legally licensed via the Tribune Content Agency through the NewsCred publisher network. Please direct all licensing questions to legal @ newscred.com."}]