[{"date": "2013-08-14", "url": "http://au.news.yahoo.com/a/-/sport/18495700/cancer-survivor-lyle-to-return-to-golf/", "content": "SYDNEY, New South Wales (AFP) - Australian golfer Jarrod Lyle will make a return to professional golf at the Australian Masters in November after an 18-month battle with cancer, organisers said Wednesday. Lyle, a member of the US PGA Tour, was diagnosed with a recurrence of the leukaemia he battled as a teenager in March last year and has been sidelined since. But the 31-year-old has agreed to make his return at the Australian Masters from November 14-17, where he will share the limelight with US Masters and defending champion <mark>Adam Scott</mark> and America's world No. 6 Matt Kuchar. \"I've made the decision to play the Masters this year as a test to see where everything is at before I look to head back to the States and the PGA Tour,\" Lyle said on the tournament website. \"That first tee shot is going to be for everybody who's supported me through all of this, but especially for my girls, Bri and Lusi,\" he added, referring to his wife and young daughter. \"I will be smiling from ear to ear for at least 36 holes. I'll enjoy the whole atmosphere, whether I play well or not .\" Lyle last played on the PGA Tour at the Mayakoba Golf Classic in Mexico in early 2012 where he finished in a tie for 37th. <mark>Tony Abbott</mark> makes \"captain's call' to preference Labor over Greens; move will put pressure on Adam Bandt Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay Two fishermen rescued after cray boat broke anchor and washed up on island off Shark Bay", "articleID": "2013081409_00054206_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}, {"date": "2013-08-14", "url": "http://townhall.com/news/entertainment/2013/08/14/rag--bone-inching-the-window-on-cool-success-n1664471", "content": "Duck Dynasty's <mark>Willie Robertson</mark> Stops By \"The Five' | Katie Pavlich Obligatory: Rodeo Clown Banned For Wearing an Obama Mask | Katie Pavlich Poll: 92 Percent of Federal Workers Don't Want Obamacare | Katie Pavlich The Illegal Alien Murderer of Vanessa Pham | Michelle Malkin Battle of the Sexes | John Stossel Energy Manipulation | Walter E. Williams Another Part of Obamacare Delayed Until 2015 | Katie Pavlich NEW YORK (AP) - Rag & Bone co-founders Marcus Wainwright and David Neville are no longer the cool newbies to the American fashion scene. They've graduated to be the even cooler tweens, with loyal followers and a path in front of them to expand their brand and be industry leaders. Growing up might have its challenges, but after 11 years, it's time, and they still see the window of opportunity they saw when it started. They've even inched it open a bit more .\" People wanted new fashion, \"says Wainwright .\" They wanted the new clothes they could wear and were coming out of New York. It was there for the taking and it is there for taking. \"Their look, offered for both men and women, is decidedly modern and downtown but built on classic menswear tailoring - not the kind of kooky styles that sometimes brand themselves\" downtown. \"Unlike some young guns who make a name for themselves with a dramatic style that few - if any - paying customers can pull off, Neville says they take a realistic approach to the delicate marriage between art and commerce. Commerce is the breadwinner, and it can very much appreciate art, he explains. Rag & Bone started in 2002, was a finalist in the Council of Fashion Designers of America's Vogue Fashion Fund contest in 2006 and won the CFDA's emerging talent award in 2007. Wainwright and Neville were named best overall menswear designers in 2010. Freestanding retail shops began opening in 2008, with flagships here and in Washington, Boston, London, Los Angeles, Tokyo and Seoul, South Korea. Their clothes are available in 39 countries. Earlier this summer, they were tapped by Vogue editor-in-chief Anna Wintour for a sort-of fashion ambassadorship to China. They traveled with the designers of Marchesa and Proenza Schouler to stage an oversized catwalk show that would help introduce the American aesthetic to consumers on the other side of the world. When they show during New York Fashion Week, it's a star-studded front row that's attracted Gisele Bundchen, Charlize Theron and Drew Barrymore, and the clothes are considered a bellwether of trends. Even now, though, when life should be a little more relaxed and a lot more glamorous, there are doses of reality. When needed, Wainwright says,\" I've airbrushed T-shirts, filled out UPS forms ....We can relate to struggles. \"Steven Kolb, CEO of the CFDA, has long been a fan, especially of the duo's commitment to mentoring new talent .\" Marcus and David are the same people today that they were when they were just starting out. They are still wide eyed and humble, \"says Kolb .\" Success hasn't gone to their heads. \"Kolb also is a personal fan of their youthful, tweaked take on gentlemanly style .\" I wear a lot of it. \"So do Wainwright and Neville, of course, but Wainwright makes allowances for his Nike sneakers and Neville wears the boxer shorts his mother sends him from Marks & Spencer. Life hasn't turned out quite as originally planned, or, maybe more accurately, unplanned. Even though they knew each other back in England, they didn't map this out. Nope: Wainwright, 38, had followed a girlfriend he had met bumming around Mexico to New York. (That girlfriend, Glenna Neece, became his wife .) He decided to start a fashion company and called upon Neville, 37, who was working as a banker, to be his partner .\" I was young enough and dumb enough to give it a go. It's worked out pretty good, \"says Neville, laughing. They keep duties fairly well divided now, with Wainwright designing and Neville handing the business side. They say they get along as well now as they did then .\" We wouldn't be sitting here if we didn't get on the way we do, \"says Neville, who is married to makeup artist Gucci Westman. The Rag & Bone office is bustling, with many more people inside than one would think could fit in an unmarked Meatpacking District building. It's important, they say, that the workplace, with upward of 300 employees, maintains an upbeat vibe .\" The general spirit of Rag & Bone is to be a good place to work, to come in on a Monday morning and be inspired, \"says Wainwright .\" If it's not fun, there's really no point in doing it. \"The old boarding-school friends share an office that's decorated with photos, including one of them on ad campaign shoot with Kate Moss and one of a real rag-and-bone man, which, they explain, was a 19th century traveler who'd collect rags and anything he thought he could sell along the way in the English countryside. He certainly was never rich or powerful, but, for the most part, he was considered honorable, Neville says. Neville and Wainwright have done pretty well for themselves - keeping a fridge in the office stocked with the Italian beer Peroni, mingling with models, and owning houses in the Hamptons, which is where, they say, they go with their families to enjoy any down time they might have. It's just a day here and a day there in this run up to the preview of the newest collection in September. Their broods are close, and often spend weekends together. Yes, one big happy family .\" It's pretty amusing. We had our first children a week apart in April 2007. Those two boys were born when we employed about 20 people. Obviously it was a huge coincidence, and a pretty interesting and amazing life experience to go through together, \"Neville says .\" My son was born and I took one week off work, and Marcus' son was born, and he took one week off work, and then we got back to it. The business was basically us, and it still is. \"___ Online: http: //www.ragandbone.com ___ Duck Dynasty's <mark>Willie Robertson</mark> Stops By\" The Five' DC Obamacare Exchange Grants $375,000 to Controversial Planned Parenthood Branch The News Isn't Good for Hillary Clinton Jesse Jackson Jr.. Receives 30 Month Prison Sentence MSNBC: Boston Bombers Not Radical Jihadists--They Are Far-Right Wing White Supremacists Revealing: NYT Exposes Clinton Foundation for Shady Financial and Business Deals and then Goes Offline Republican Parker on Hillary: \"If the world is ever going to be saved, women are going to do it\" Report: Two Journalists Killed in Egypt Lewis: Hillary Clinton is \"the Most Qualified Person in America to be President\" The Illegal Alien Murderer of Vanessa Pham Battle of the Sexes | John Stossel Energy Manipulation | Walter E. Williams Apology to Barney, Barack and Bernanke: I Forgot You're Exempt From Our Laws Levin to the Rescue | Brent Bozell So You're a Revolutionary? | <mark>Mike Adams</mark> Deja Cool: Zero People Attend Obama Climate Change Thing It's Time Conservatives Show Christie the Door Government Pensions Bankrupting Cities - and Individuals The Ed Morrissey Show: The Call-Out Edition Rand Paul on whether Ted Cruz is a natural-born citizen: I'm no Birther Planned Parenthood gets $375,000 from DC ObamaCare exchange Another nail in the Gasland coffin | Erika Johnsen Dem Congressman on ObamaCare: Hey, the Constitution had its problems, too Christians in the Military Barred from Expressing their Faith iPhone/Android Apps About Townhall.com Townhall.com is the leading source for conservative news and political commentary and analysis. Townhall is packed with breaking news headlines, political news, and conservative opinion with Townhall columnists including Ann Coulter, Michelle Malkin, <mark>Michael Barone</mark>, Star Parker, Dennis Prager, Thomas Sowell, and many more of your favorite conservatives. Political cartoons full of satire and political humor from editorial cartoonists including Michael Ramirez, Glenn McCoy, and Henry Payne. Townhall.com also features the latest news videos and pictures on the latest political hot topics including health care reform, the economy, immigration, government tax, President Obama, Sarah Palin, Mitt Romney, Herman Cain, Ron Paul, Iraq, immigration, politics, gay marriage laws, and many more big news issues.", "articleID": "2013081502_00037584_W", "names": {"Michael Barone": ["Q16197964", "Q19865861", "Q6828446"], "Mike Adams": ["Q1394381", "Q1926746", "Q1933021", "Q2033463", "Q21004722", "Q30234135", "Q3857347", "Q6845832", "Q6845834", "Q6845836", "Q6845838"], "Willie Robertson": ["Q14755556", "Q16235773"]}}, {"date": "2013-08-17", "url": "http://www.clubcall.com/ipswich-town/mccarthy-deflated-by-defeat-1618881.html", "content": "Ipswich's 1-0 defeat at QPR was a sickening blow for manager <mark>Mick McCarthy</mark>, who took little comfort from his team's determined performance. Town looked on course for a well-earned point until youngster Tom Hitchcock popped up at the death to steal all three points for the hosts. \"I don't think they should have beaten us,\" a blunt <mark>McCarthy</mark> said. \"We just didn't do enough in that 90th minute. I thought it was going to be a good point until we didn't defend in the last minute .\" I'm pleased with the group of players I've got, but playing well and getting beaten isn't my idea of fun. We've been beaten so have got diddly squat to show for it. \"I thought it was going to be one of those days when <mark>Rob Green</mark> pulled off a save from Daryl Murphy .\" We were even with them, certainly in the first half. But if we want to contest the top six then pretty good has got to become good - we've got to get points.", "articleID": "2013081801_00013023_W", "names": {"Mick Mccarthy": ["Q40063430", "Q437925"], "Rob Green": ["Q2156027", "Q7340166"]}}, {"date": "2013-08-19", "url": "http://www.newkerala.com/news/story/56243/indian-army-chief-meets-pm.html", "content": "New Delhi, Aug 19: Indian Army chief General Bikram Singh met Prime Minister <mark>Manmohan Singh</mark> here Monday, official sources said. The meeting came in the backdrop of increased ceasefire violations by the Pakistan Army at the LoC in Jammu and Kashmir. \"The army chief met the prime minister. The meeting lasted for 15 minutes,\" an official in the Prime Minister's Office told IANS. It is not immediately known what was discussed.", "articleID": "2013081923_00073162_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}}, {"date": "2013-08-20", "url": "http://advanced-television.com/2013/08/20/ezyflix-ott-debuts-in-australia/", "content": "OTT movie retailer Access Digital Entertainment has launched its EzyFlix video on demand and UltraViolet service in Australia, claiming to be the first Australian company to be able to offer viewers the ability to download movies from all of the major Hollywood studios. The service will compete with Quickflix, Telstra and the recently-launched JB Hi-Fi offering, among others. Up to five devices can be registered under one account, with users able to swap devices in and out, with the possibility of syncing in the future. \"When you buy a specially marked video file from EzyFlix, it will be added to your UltraViolet locker. What movies include this is determined by the studios, not EzyFlix, but it will soon include TV shows,\" advised EzyFlix CEO <mark>Craig White</mark> at the launch. The service will be contract free, with no monthly fees. Users can choose between streaming a movie as a rental or buying it and being able to download it for offline viewing. TV episodes can be bought individually, or an entire season can be purchased. New release movies will cost A $5.99 (? 4.06) to rent a standard definition version and A $6.99 for HD. Purchasing the SD file costs A $24.99, while the HD version will cost some A $29.99.", "articleID": "2013082018_00021685_W", "names": {"Craig White": ["Q3526919", "Q47128766"]}}, {"date": "2013-08-20", "url": "http://www.scmp.com/news/world/article/1298131/bradley-manning-should-get-60-years-says-prosecution", "content": "US military prosecutors in the court-martial of Bradley Manning have asked the judge to sentence him to at least 60 years in prison. They argued that his leaks of classified documents to the WikiLeaks website in 2010 severely damaged US intelligence operations and made a mockery of the nation's diplomatic missions. \"There may be no soldier in the history of the army who displayed such an extreme disregard,\" Army Captain Joe Morrow said of the 25-year-old former junior intelligence analyst in Iraq. \"At least 60 years is justified. Pfc. Manning is young. He deserves to spend the majority of his remaining life in prison .\" But Manning's legal defence team, led by <mark>David Coombs</mark>, said the government was \"only interested in punishment\" rather than \"the needs of the individual soldier\". He urged the judge to impose a sentence short enough to permit Manning to someday return to society. \"The defence requests a sentence that allows him to have a life,\" he said. There may be no soldier in the history of the army who displayed such an extreme disregard. At least 60 years is justified. Pfc. Manning is young. He deserves to spend the majority of his remaining life in prison The maximum term that army judge Colonel Denise Lind said she could give Manning is 90 years, without the ability to apply for parole until he has served a third of his sentence. She will announce the sentence today. The judge acquitted Manning of the most serious charge, aiding the enemy, but convicted him on others, including six counts of violating the Espionage Act. Log in using your Facebook account.", "articleID": "2013082101_00012755_W", "names": {"David Coombs": ["Q5232547", "Q5233278", "Q54889010"]}}, {"date": "2013-08-21", "url": "http://www.breakingnews.ie/entertainment/walsh-would-return-to-x-factor-if-cowell-came-back-604290.html", "content": "<mark>Louis Walsh</mark> would consider going back on his decision to quit \"The X Factor' if <mark>Simon Cowell</mark> returns to the show. The music manager announced earlier this month he is to leave the programme after the upcoming 10th series, but admits he could be talked around should' X Factor' boss <mark>Simon</mark> return to the judging panel next year. He said:\" I've been doing it 10 years. It's an awful long time to be on the show. I don't want to be pushed. I'd prefer to leave than be pushed. To leave on my terms. \"Now if <mark>Cowell</mark> came back, I might come back. The two of us, we would not stop laughing. If <mark>Simon</mark> called me up and said...but, oh well. Let's see what happens .\" <mark>Louis</mark> is to return to his day-to-day job of managing bands when he quits the show, and admits' X Factor' bosses haven't even attempted to persuade him to reverse his decision because he didn't tell them he was going to quit. He explained: \"They haven't said anything to me. Because I announced it without really telling them .\" I want to be a manager, because that's my day job. It's my real job. I love doing' X Factor', I absolutely love it. It has its highs and lows. Sometimes I love it more than other times. \"It is the best job in the world though. I'm like the cheerleader. But I do take it seriously, even though it may not always look like that .\" Despite recently saying he has signed up for the next series of The X Factor's rival \"Strictly Come Dancing', <mark>Louis</mark> insists he was only joking and wouldn't appear on the programme for\" all the money in the world \". He added to RadioTimes.com:\" That was a joke! We had a warm-up comic on. He said, \"Oh, you're leaving, where are you going?' And I said,\" Oh yeah, I'm going to \"Strictly',' and Sharon said,\" I'm going with him,' just taking the p ** s at the live show. And it was really funny. \"Cruel' reality TV is the new Bedlam asylum, Only Fools and Horses Star says TV star Nicholas Lyndhurst has hit out at the current state of TV, comparing\" cruel \"Britain's Got Talent to the psychiatric hospital Bedlam. Taylor Swift brings Cher Lloyd out for surprise duet at LA concert", "articleID": "2013082117_00026754_W", "names": {"Louis Walsh": ["Q16228796", "Q658547"]}}]