[{"articleID": "2014070319_00006825_W", "names": {"Helmut Schmidt": ["Q1287343", "Q15989591", "Q1604141", "Q1604142", "Q1604145", "Q22669764", "Q2516", "Q41048665"], "Pierre Rigal": ["Q30126151", "Q3386797"], "Tim Howard": ["Q16226269", "Q200785", "Q7803679"], "Melissa Mccarthy": ["Q229048", "Q50437115"]}, "date": "2014-07-03", "url": "http://slate.com/blogs/the_spot/2014/07/03/patrick_battiston_harald_schumacher_what_happened_after_the_most_horrific.html", "content": "West German goalkeeper Harald Schumacher (right) jumps past the ball as he gets ready to collide with French defender Patrick Battiston during the 1982 World Cup semifinal match. Friday's World Cup quarterfinal between France and Germany is a repeat of one of the most iconic and dramatic games in World Cup history: the 1982 World Cup semifinal, notable for German goalkeeper Harald Schumacher's horrific challenge on Patrick Battiston, which left the French substitute unconscious, with two teeth knocked out and three cracked ribs. Schumacher was not booked and referee Charles Corver did not even award a foul ., Ben Lyttleton details how each of the key players in that game saw the Schumacher/Battiston episode, and how it affected their mindset going into the shootout. In this excerpt, he explains what happened after the final whistle. The game had finished at 23:41 local time, which goes some way to explaining why the Schumacher incident barely registered in the next day's analysis. \"Fabuleux!\" ran L'Equipe's headline, praising the France team for its attacking verve and coach Michel Hidalgo for fielding three playmakers in Alain Giresse, Michel Platini, and Bernard Genghini. \"One day later, the mood changed as the severity of Schumacher's challenge took top billing .\" Red-handed! \"was L'Equipe's front page, with an image of Schumacher's hip making contact with Battiston's jaw .\" A story of unpunished violence ....Schumacher was a brute. It's a morality tale which we will tell our children. \"Hidalgo changed his tone from valiant loser to angry victim .\" You say Corver is an international referee? I have my doubts, if he risks the safety of the players like that. \"L'Equipe's switchboard was jammed with anti-German calls and cars with German number-plates parked in French campsites had tires slashed and windows broken. To improve relations, Chancellor <mark>Helmut Schmidt</mark> sent an open letter of condolence to President Francois Mitterand .\" Our hearts go out to the French, who deserved to go through just as much as the Germans. \"French defender Patrick Battiston lies on the ground while waiting for the medical staff to come during the 1982 World Cup semifinal soccer match between West Germany and France. After Italy had beaten West Germany in the final -\" Justice! \"crowed L'Equipe - someone had the bright idea to send Schumacher on a diplomatic mission to France to apologize in person. Schumacher travelled to Metz on the day before Battiston's wedding and presented him with an FC Köln pennant and an apology. But the trip was not a success .\" Schumacher forgets himself, \"said German magazine Kicker .\" It was a gesture of reconciliation with unpleasant consequences. \"The pair were photographed sitting next to each other at a hastily arranged press conference, looking in opposite directions. Schumacher, objecting to questions from the French press, cut the conference short .\" This is something that concerns only Battiston and me, \"he said .\" If I had known, I would have brought my own German journalists with me. \"The peace offering had turned ugly .\" The bad guy just wanted to poke fun at the good guy, \"wrote One day after the failed reconciliation, Mitterand considered asking Hidalgo to get his players to state publicly that they had no problem with Schumacher. Hidalgo had his response ready:\" What, shall I ask them to take the Germans on holiday with them? \"That gave France Football magazine an idea: It asked the France team where they would take Schumacher on holiday. Here are the answers: Platini: To climb the Grandes Jorasses mountains [in Mont Blanc]. Maxime Bossis: To scale the heights of the Vallée Blanche [in Mont Blanc]. Dominique Rocheteau: To watch a sunset from the cliffs of étretat. Marius Trésor: To do a parachute jump with a delayed opening. Battiston: To help me pick mushrooms in the forest as I still can't bend down. It does not take a mastermind of psychology to spot the common theme. Platini, the French captain, believes that France needed to lose this game-which in French folklore is simply referred to as Sevilla 82-to help them win their first competitive trophy, the European Championship, two years later .\" The legend of this game comes from the fact that we lost it, \"said Platini .\" In losing it, we became a great team. It was the end, but also the beginning of something. In the history of French football, the two turning points were Sevilla 82 and the 1998 World Cup final. Sevilla marked a generation of football fans, gave them a collective state of mind: it's why books and plays have been written about the game. No movie in the world could have provided as much conflicting emotion as Sevila 82. It's certainly a beautiful moment in my career. It's the moment that makes you say afterwards, \"I'm glad I was there!' Even if you lose .\" The heroic failure inspired creativity. France's 1982 defeat indeed spawned books, documentaries, plays and music, all created by a generation for whom the game was a defining moment. In 2006, scenic-representation artist Massimo Furlan pretended to be Platini in his performance Number 10, in which he mimed the France midfielder's pass to Battiston, reaction to his injury, and his penalty kick, in an empty stadium save for one observer: the coach Hidalgo, watching from the sideline. Red, a French musician, played a concert he called Sevilla 82 against a visual backdrop of the game. France-Allemagne was a play examining the relationship between the two countries, set in a Frenchman's living room as he entertains a German guest with the game on in the background. French choreographer <mark>Pierre Rigal</mark>, who was nine in 1982, produced a dance piece, Injury Time, which he took to Potsdam in Germany. \"I remember it as a great injustice and frustration, an event that went beyond sport,\" he said, \"and my piece was a way of looking at how we treat childhood memories .\" Twenty-seven years after the game, totally out of the blue, Battiston received a package from his old teammate Platini. It was his full kit from the game-blue shirt, white shorts with the distinctive circled number three, and red socks-which had been left in the dressing room, kept in a Seville museum, and then presented to Platini on one of his UEFA presidential trips. Battiston was emotional when he opened it; the kit now hangs in his son's bedroom. Schumacher also gave Battiston his goalkeeping jersey before a friendly between the two sides in Strasbourg in April 1984. Battiston has no idea where it is now, or even if he still has it. by Ben Lyttleton, out now from Bantam Press. 1. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone 2. Help! I'm a Woman in My 50s, and if I Don't Have Sex Soon I'll Explode. 3. Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else 4. Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal 5. Doctors Are Examining Your Genitals for No Reason 1. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone 2. U.S. Goalkeeper <mark>Tim Howard</mark> Was the Man of This or Any Match 3. How Obama Can Save the Whales in the World's Largest Marine Reserve 4. What Happens When People Around the World Photoshop the Same Woman's Image July 2 2014 5:23 PM Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal It's music to the ears of Republicans and Obama aides alike. For Democrats in battleground states, not so much. July 2 2014 11:48 PM The Contradiction at the Heart of Road-Tripping Thirteen ways to minimize your nature-loving drive's cost to nature. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone Help! I'm a Woman in My 50s, and if I Don't Have Sex Soon I'll Explode. Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal Doctors Are Examining Your Genitals for No Reason France, West Germany, and the Most Horrific Challenge in World Cup History House Arrest Isn't Keeping a Former Bitcoin CEO Grounded The Cannibal Cop Goes Free-but What About the Murderous Mechanic and Loathsome Librarian? Mississippi Senate Battle Descends Into Madness The Term Could Have Been a Lot Worse, but It Was Pretty Bad Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone Iran's Modern Family Rip-Off Is Not So Modern <mark>Melissa McCarthy</mark> and Susan Sarandon Have Terrific Comic Chemistry in You Won't Be Able to Buy the TVs With the Best Picture Quality Anymore Facebook: \"We Never Meant to Upset You\" People in the Outer Banks Should Seriously Consider Evacuating Today Netizen Report: Researchers Uncover Mobile Phone Spyware in 60 Countries House Arrest Isn't Keeping a Former Bitcoin CEO Grounded The Man Who Won the Bitcoin Auction Would Also Make Silicon Valley Its Own State Census: One-Quarter of Americans Now Live in \"Poverty Areas\" Thirteen Ways to Minimize the Contradiction at the Heart of a Road Trip Nightmare Wasps Build Nests With Corpses NFL Cheerleaders Finally Have Something to Cheer About The First \"Men's Issues\" Conference Makes a Good Point. And a Lot of Bad Ones. What I Learned From Talking to Tinder's Justin Mateen About Women Monday's Other Supreme Court Decision That Attacked Female Workers France, West Germany, and the Most Horrific Challenge in World Cup History Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else Who Was Dent McSkimming, the Lone American Reporter at the 1950 World Cup? Help! My Dad Is Dating My High School Nemesis. Your Novelty Trip to Antarctica Is Threatening Its Ecosystem (Video) One of the World's Rarest Animals Spotted, but Experts Are Concerned (Video) Up to 1 in 10 U.S. Beaches Too Polluted for Swimming (Video) America's Vanishing Historic Movie Theaters Inside a Colorado Marijuana Dispensary Otherworldly Photos of Mysterious Megalithic Stones A Front-Row Seat for the War on Drugs The Gabbers Talk Click Bait. You Won't Believe What They Say. <mark>Tim Howard</mark> Was Everywhere, but It Wasn't Enough for the U.S.. When the Amish Get Rich, the Simple Life Stops Looking So Simple Podcast Extra: What's Hinky About Hobby Lobby? What Should You Be Listening to Right Now?"}, {"articleID": "2020021903_00094723_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2020-02-18", "url": "http://www.gamereactor.eu/mafia-tactics-game-empire-of-sin-held-back-until-autumn/?sid=9819c80aabbe905ad51e1f0eef2c9473", "content": "Empire of Sin Mafia tactics game Empire of Sin held back until autumn Romero Games' Prohibition-era strategy title is being held behind bars until it has well and truly learned its lesson. 2020-02-18 12:03 <mark>Mike Holmes</mark> We've just heard that Empire of Sin, the Prohibition-era strategy game by Romero Games, has been delayed, with the planned spring launch window now looking more like autumn 2020. \"The challenges in making a game like no-one has made before is exactly that - making a game no-one has made before. It takes time to get everything right and presents us with some unique opportunities. I am grateful we are taking the additional time to polish\" , game director Brenda Romero said of the delay. We got our hands on Empire of Sin at Gamescom and our impression at the time was the gangster-filled strategy title had a lot of promise but needed polish and bit more variety. That being the case, news of this slight delay isn't hugely surprising, yet we remain excited at the prospect of playing the finished article once it's done. Empire of Sin is heading to PC, PS4, Switch, and Xbox One. You watching"}, {"articleID": "2014071604_00034261_W", "names": {"Kathleen Lynch": ["Q28740429", "Q3777461", "Q6376795"]}, "date": "2014-07-15", "url": "http://www.thejournal.ie/kathleen-lynch-older-people-1573303-Jul2014/", "content": "Tuesday 15 Jul, 2014 http: //jrnl.ie/1573303 <mark>Kathleen Lynch</mark> says she still has responsibility for older people Image: Sam Boal via Photocall Ireland THE MINISTER OF State for Primary and Social Care, <mark>Kathleen Lynch</mark> has said that she will retain responsibility for older people under the Social Care element of her portfolio. It comes after a change in her title earlier today. <mark>Lynch</mark> was appointed - Minister of State at the Department of Health with Special Responsibility for Primary Care, Mental Health and Disability. However, in 2011 the Minister of State's title was - Minister of State at the Department of Health with Special Responsibility for Disability, Older People, Equality & Mental Health. Minister <mark>Lynch</mark> has released a statement this evening saying that she \"retains responsibility under the Social Care element of her portfolio for Mental Health, Disability and Older People\". Concerns The charity for older people, Alone, said it is \"extremely concerned' about the change of title. CEO Sean Moynihan said,\" The removal of \"older people' from the Ministerial title strongly suggests a shift in priorities within the current Government. The number of people over the age of 65 is increasing by 20,000 a year. Monihan added,\" in such a climate the government should be prioritising the needs of older people and strategically planning for the future instead of removing them from sight. \"After seeing what my dad has gone through, I'm convinced we need an Ombudsman for the Elderly> Please select the reason for reporting this comment. Most viewed articles in the past 24 hours Most commented articles in the past 3 days Opinion: A fatal foetal diagnosis is nobody's fault - the deliberate lack of support by the State is. The newly-crowned Minister for Health's role could be the making or breaking for one of politics' rapidly rising stars. Opinion: The GAA and Samaritans both have an ethos of giving rather than taking So just how young is the country's youngest junior minister?...The Edge has hats that are older The Dublin Embassy of Israel says the country has a right to defend its citizens The Dublin city council chief talked about the Garth Brooks debacle Content copyright © Journal Media Ltd. 2014 Registered in Dublin, registration number: 483623. Registered office: 3rd floor, Latin Hall, Golden Lane, Dublin 8. TheJournal. ie is a full participating member of the Press Council of Ireland and supports the Office of the Press Ombudsman. This scheme in addition to defending the freedom of the press, offers readers a quick, fair and free method of dealing with complaints that they may have in relation to articles that appear on our pages. To contact the Office of the Press Ombudsman Lo-Call 1890 208 080 or go to Please note that TheJournal. ie uses cookies to improve your experience and to provide services and advertising. For more information on cookies please refer to our Photocall Ireland unless otherwise stated. Irish sport images provided by <mark>Kathleen Lynch</mark> says she still has responsibility for older people Comments"}, {"articleID": "2012121123_00014527_W", "names": {"Mike Anderson": ["Q16150230", "Q17659264", "Q3313197", "Q3857345", "Q6845867", "Q6845871", "Q6845872", "Q6845873", "Q6845875", "Q6845876"]}, "date": "2012-12-11", "url": "http://duncanbanner.com/x1752050560/Fair-Expo-Center-adds-pen-set-up-fee", "content": "duncan - in an effort to be fair to all, there will be a small pen set up fee added to the bill for those using the stephens county fair & expo center. the set up fee is already in place for the large animal events, but director <mark>mike anderson</mark> approached the county commissioners monday to update them on the upcoming new business policy. \"i was just advising them, that to be fair with all our customers, we're going to charge a set up fee for the pens,\" he said. the matter didn't need any county official approval, but <mark>anderson</mark> was put on the agenda just for public purposes. he said the fee will be a $1 fee per pen for small livestock use and goes into effect jan. 1, 2013. <mark>anderson</mark> explained to the banner that the fairgrounds already charges a per stall set up fee for horses and other large animals of $25 each, and $35 for bull pens. in turn, the event using the pens can charge, and do, the individuals who need the stalls. it's all part of doing business, <mark>anderson</mark> explained. \"they sell them for whatever they want them for,\" <mark>anderson</mark> said. there has not been a set up fee for the smaller pens, and some events will request up to 200 pens, but may only use 75 pens. <mark>anderson</mark> said his staff has to take time to set those pens up and for example, when setting up bull pens, it takes three employees an entire day to ready the arena and fairgrounds for the event. having the small pen fee in place will reduce the time spent to set up pens that probably wouldn't be used. \"we haven't been charging anyone for the hog and sheep pens. but our staff does all that work for naught,\" he said. and the reason for only a $1 per pen set-up fee is they are smaller pens, but also, since there hasn't been a fee in many, many years, he didn't think it would be fair to automatically charge a higher fee. \"we don't want to take advantage of anybody,\" he said."}, {"articleID": "2010011100_00073376_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2010-01-11", "url": "http://scotsman.com/news/He-believed-his-place-was.5970371.jp", "content": "a british reporter has died after he was caught in an explosion in afghanistan - the first uk journalist to be killed in the conflict. <mark>gordon brown</mark> led tributes yesterday to sunday mirror defence correspondent rupert hamer, while colleagues said he was \"hugely popular\". mr hamer, 39, died of his wounds at the scene north-west of nawa. his accompanying photographer, philip coburn advertisement, was injured in saturday's blast, which also killed a us marine. mr coburn, 43, is in a serious but stable condition, the mod said. he and mr hamer were embedded with the us marine corps when they were caught in the explosion. they were with a patrol when their vehicle struck an improvised explosive device. mr hamer is the second foreign journalist to be killed in afghanistan in recent days. michelle lang, 34, from canada's calgary herald, died along with four canadian soldiers in a roadside bomb attack at the end of december. according to the sunday mirror, the experienced pair flew to the region on new year's eve for a trip scheduled to last a month. mr hamer, who was married to helen, had three children, aged six, five and 19 months had worked for the newspaper for 12 years, taking on the defence correspondent role in 2004. mr coburn has been at the sunday mirror for eight years. the paper's editor, tina weaver, said mr hamer believed the only place to report a war was from the front line. \"he was a seasoned, highly regarded and brave journalist who had reported from both iraq and afghanistan on many occasions,\" she said. \"it was his fifth trip to afghanistan, and he had forged friendships with a number of the soldiers serving out there .\" she said mr hamer earned the nickname \"corporal hamer\" by fellow sunday mirror staff. \"he was a fine, fearless, and skilled writer who joined the paper 12 years ago,\" she added. \"affectionately known as\" corporal hamer' in the office, he was a gregarious figure and a wonderful friend who was hugely popular with his colleagues. \"above all he was devoted to his wife helen and their three young children. our thoughts and condolences are with helen, his father nick, who he was so close to, and the children he was so proud of .\" she described mr coburn as a \"consummate all-round journalist and brilliant photographer\". prime minister <mark>gordon brown</mark> said: \"i was deeply saddened by this tragic news, and my heartfelt thoughts and sympathies are with the families, friends and colleagues of rupert and philip .\" their courage, skill and dedication to reporting from the front line was incredibly important and ensured that the world could see and read about our heroic troops. their professionalism and commitment to our forces will not be forgotten. \"tory leader <mark>david cameron</mark> said he was\" deeply saddened \"to hear of the reporter's death."}, {"articleID": "2019052621_00125727_W", "names": {"Rob Edwards": ["Q10384359", "Q11945772", "Q2067092", "Q7340105", "Q7340107"]}, "date": "2019-05-26", "url": "http://www.wsbtv.com/news/national-news/ap-top-news/rossi-finishes-second-to-pagenaud-in-dramatic-indy-500/952623194?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Rossi finishes second to Pagenaud in dramatic Indy 500 Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Rossi finishes second to Pagenaud in dramatic Indy 500 By: DAVE SKRETTA, AP Sports Writer Updated: May 26, 2019 - 5:18 PM Loading...Rossi finishes second to Pagenaud in dramatic Indy 500 INDIANAPOLIS (AP) - In the waning laps of a rage-filled Indianapolis 500, Alexander Rossi was pacing the field back to the green flag when he made a brazen declaration to his Andretti Autosport crew. \"A bunch of hungry, angry cars behind me,\" he radioed. \"Little do they know I'm angrier .\" The finish didn't bring him any joy. Simon Pagenaud breezed past him high on the restart, triggering a dramatic duel that included five passes in the closing 13 laps. Rossi twice regained the lead, but it was Pagenaud who made the decisive pass, taking the lead heading to the white flag and then holding on through the final lap. It gave Team Penske another win at the Brickyard. And it left Rossi ruing a chance that got away. \"I'm happy to get a result,\" he said, \"but unfortunately nothing else matters here but winning. This one will be hard to get over, but at the end of the day, it's a great showing .\" Rossi said the difference was simple: \"Horsepower .\" All month long, the Chevrolet-powered cars appeared to have an advantage over Honda, particularly when it came to straight-line speed. Honda appeared to have an advantage in fuel mileage, but a late wreck that red-flagged the race wound up making that a moot point. Speed was all that mattered. Pagenaud in his Chevrolet had just a bit more. \"There's not much I can do about that inside the car,\" said Rossi, who won the 2016 race in his first try, and has finished seventh or better in all four starts. \"That last yellow hurt us. We were doing a lot better on fuel mileage than he was. It was the first kind of nail in the proverbial coffin. And the second was I just didn't have the speed out front .\" Rossi acknowledged it was \"a good day for the team,\" but a number of incidents hurt the chances of a car he said was \"by far the best in the field .\" The first came on a pit stop midway through the race, when an issue with a component inside the fueling mechanism caused a problem. While a crew member frantically kept trying to get the gas to flow, Rossi began pounding his steering wheel in frustration for a stop that took more than 20 seconds. It only cost Rossi a handful of spots, thanks to a timely yellow flag. \"It wasn't ideal, for sure,\" said Rossi's race strategist, <mark>Rob Edwards</mark>. The second incident involved Oriol Servia, who was a lap down but found himself jockeying with the leaders with about 50 laps to go. Rossi kept trying to get around him, and at one point got pinched and nearly hit the wall while trying to make a pass, leaving him to ask: \"What is he doing!?\" Rossi finally got around Servia while gesturing wildly from his cockpit at about 230 mph. \"There was a lot of lapped cars and no respect for what we were doing,\" Rossi said. \"It was really unfortunate. Ultimately it didn't make a difference with the result .\" Not with the way Pagenaud was driving down the stretch. He took the lead on Rossi during the restart with 13 laps to go, then gave it up on the next lap, only to regain it once more. Pagenaud patiently waited for the penultimate lap, then swept through Turn 3 to retake the lead as the two of them barreled toward the white flag. Rossi sucked up to his Team Penske rival on the back stretch, but Pagenaud slithered like a snake to keep him behind. Pagenaud then dived low as they exited the final corner, and the break in the draft created enough separation that Rossi was never able to make a finish-line pass. Rossi said that Pagenaud was \"moving in reaction, for sure,\" but he never thought about lodging a protest over the blocking. \"The last lap of the Indy 500,\" he said, \"they're not going to do anything .\" Instead, Rossi tried to turn his anger into a sense of accomplishment. \"This one will be hard to get over, but at the end of the day, it's a great showing,\" he said. \"We have to take the positives from this and the positives are the 27 boys did a phenomenal job .\" ___ More AP auto racing: https: //apnews.com/apf-AutoRacing and https: //twitter.com/AP_Sports Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:"}, {"articleID": "2019051914_00111739_W", "names": {"Chris Russell": ["Q5107950", "Q57920886"]}, "date": "2019-05-07", "url": "http://www.chardandilminsternews.co.uk/news/17623732.if-i-can-anyone-can-inspirational-ilminster-runner-raises-35k-with-london-marathon/", "content": "News \"If I can, anyone can': Inspirational Ilminster runner raises £ 3.5 k with London Marathon By Oliver Palmen See photos images Skip to next photo 1 / 1 Show caption 1 / 1 0 comment AN ILMINSTER man who decided to take up running after passing the age of 50 has conquered the world-famous London Marathon, and raised £ 3,500 in the process. <mark>Chris Russell</mark> had never been a runner in his life, and before April 28 had only completed the Yeovil Half Marathon as a practice for the main event. While <mark>Chris</mark> wasn't the only person in their 50s to take on the capital challenge, his wife Linda said it was especially impressive as he has never been sporty. The massive fundraising feat was also particularly important to <mark>Chris</mark> as it was a cause close to his heart. Linda <mark>Russell</mark> said:\" He has been raising money for the Round Table Children's Wish. \"He was an Ilminster Round Tabler for many years, until he became too old, and now he is a member of the Yeovil 41 club which is the follow on from Round Table .\" The charity has granted wishes - bespoke wishes - to children with life threatening illnesses. \"This is particularly special for us as our nephew suffered with a life threatening illness .\" He has raised £ 3,500, and is even touching on £ 4,000. \"<mark>Chris</mark> only started running a couple of years ago. He completed the Yeovil Half Marathon last year, and then ran it again in 2019 as a warm up for the Virgin London Marathon. <mark>Chris</mark> said:\" I watched my son, Tom, run the 2017 Yeovil Half Marathon and thought \"I would like to do that' .\" But I have never been a runner, so I started training and I managed to do the 2018 Yeovil Half. \"Since then I haven't stopped running and set myself the massive personal challenge of running the 2019 London Marathon .\" I have never been particularly sporty, and the Yeovil Half was the furthest distance I had run in my life. \"To make this more than a huge achievement for myself, I have decided to run for a charity that is close to my family's heart--The Round Table Children's Wish, which is a registered charity dedicated to granting handcrafted wishes for children and young people with life threatening illnesses .\" More than 444,000 applied in the ballot for a place, with 56,398 successful applicants. This was the 39th year of the London marathon, and the total raised for charities since 1981 passed £ 1billion. \"It was brilliant,\" <mark>Chris</mark> added. \"It was an amazing experience to be honest. It went better than I thought it would .\" On the day it was great and the two pacers I ran with were excellent. \"If I can do it anyone can do it, especially as you get older and start to think about your health .\" <mark>Chris</mark> completed the run in a time of 4 hours, 56 minutes and 22 seconds. 0 comment"}, {"articleID": "2010021607_00073136_W", "names": {"David Healy": ["Q1174698", "Q313617", "Q654415"], "Alex Bruce": ["Q2733524", "Q4716749", "Q517062"], "Chris Coleman": ["Q1077115", "Q28001395", "Q381769"]}, "date": "2010-02-16", "url": "http://greenun24.co.uk/content/greenun/sport/football/championship/ipswich-town/story.aspx?brand=ESTOnline&category=SportITFC&tBrand=GreenunOnline&tCategory=xDefault&itemid=IPED15%20Feb%202010%2019%3A43%3A07%3A470", "content": "stead move: nothing personal - roy carl marston last updated: 16/02/2010 07:00:00 leading scorer jon stead may have left portman road, but ipswich town boss roy keane has no plans to bring in a replacement. stead's on-off loan move to coventry city was finally rubber-stamped yesterday afternoon, with the 26-year-old target man signing a deal to the end of the season, with a view to a permanent contract in the summer. the arrival of fellow strikers daryl murphy and <mark>david healy</mark>, on loan from sunderland at the start of the month, had lessened stead's chances of making the starting line-up. but although the ex-blackburn, sheffield united and sunderland striker was desperate for some regular first team football, he still took time to weigh up all his options before agreeing to join coventry, because of personal reasons. the fact that stead's wife is heavily pregnant, and that the couple are well settled in suffolk, made it a difficult decision. keane explained: \"when i put these opportunities to players, it's up to the player, just like it was with <mark>alex bruce</mark> (to leicester) a few weeks ago .\" it's nothing personal, it's just if a player wants a guaranteed run of games, that i can't give them, and if the deal is right for the club, then we'll put it to the player. it's no big issue. \"it happens with players. some see it as an opportunity to play a few games, others will want to stay and fight for their place. players are in control of it,\" added keane. stead actually trained with town on sunday, and even yesterday morning keane was still planning to put stead in his squad for tonight's game at peterborough united. however stead, with six goals to his name this season, travelled up to the ricoh arena yesterday afternoon to discuss terms. he will put pen to paper this morning. coventry boss <mark>chris coleman</mark> said: \"he has all the attributes to be a very good player for coventry .\" keane remains happy with his strike-force department, which also includes pablo counago, connor wickham and the versatile jon walters, in addition to murphy and <mark>healy</mark>. \"we've got a lot of strikers, particularly with the two new boys coming in,\" confirmed keane. \"i wouldn't think we'd need another striker. i didn't bring the two lads in to sit on the bench. they are here to play games .\" we're not too bad in terms of numbers, \"concluded keane."}, {"articleID": "2012042004_00061637_W", "names": {"Lewis Hamilton": ["Q6536656", "Q9673"], "George Galloway": ["Q332483", "Q42322064", "Q5539601"]}, "date": "2012-04-20", "url": "http://suffolkfreepress.co.uk/news/national-news/call-to-cancel-bahrain-grand-prix-1-3754596", "content": "thursday 19 april 2012 06:35 the shadow home secretary has called on the bahrain grand prix to be cancelled as the gulf state braces itself for further violent demonstrations following months of political unrest. yvette cooper said british formula one stars jenson button and <mark>lewis hamilton</mark> should not take part in the controversial three-day event, which is expected to be beset by a wave of protests from pro-democracy campaigners when it begins today. speaking on bbc's question time, she said: \"it shouldn't go ahead, i don't think british drivers should go, i think the formula one should not go ahead in bahrain .\" you have got demonstrations by democratic protesters who have been violently suppressed and although it should be a matter for the sport to decide rather than for the government, i do think government ministers can express an opinion. that opinion should be it should not go ahead, it would sent the wrong signal, it should not happen. \"ms cooper joins a growing number of politicians and human rights campaigners who have called on organisers to pull the plug on the event because of the regime's crackdown on demonstrators. respect mp <mark>george galloway</mark> said the tracks of the middle eastern race circuit were\" stained by the blood of the people who are asking for a vote \". he said:\" there is blood on the tracks and anyone who drives over then will never be forgiven. \"earlier this week shadow foreign secretary douglas alexander also said proceeding would\" send the wrong signal \", while amnesty international said human rights violations are continuing in the gulf kingdom despite government promises that the country is on the road to reform. in a recent report, the campaign group said security forces were still using excessive and unnecessary force against anti-government protesters. the charity also said it was receiving ongoing reports of the torture and ill-treatment of demonstrators, who have been involved in ongoing clashes with police. the 2011 race was cancelled as international criticism grew over the bloodshed, but despite calls for f1 chief bernie ecclestone to scrap this year's event it looks certain to go ahead. security around the event has has been significantly ramped up with the main race taking place on sunday. british f1 star jenson button refused to become embroiled in the issue. when asked about the situation, the mclaren driver said:\" you are here interviewing me as a driver and that's exactly what i am going to talk about - motor racing. the outside issues, i'm not going to talk about. \"www.mofa.gov.bh/london/home.aspx (bahrain london embassy) temperature: 3 c to 11 c wind speed: 14 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. suffolk free press provides news, events and sport features from the sudbury area. for the best up to date information relating to sudbury and the surrounding areas visit us at temperature: 3 c to 11 c wind speed: 13 mph temperature: 3 c to 12 c wind speed: 16 mph temperature: 5 c to 11 c wind speed: 24 mph temperature: 5 c to 11 c wind speed: 15 mph"}, {"articleID": "2010112216_00182729_W", "names": {"Barbara Bush": ["Q153730", "Q190628", "Q2884044"], "Tracy Morgan": ["Q14542", "Q27119857"], "Adam Levin": ["Q16731429", "Q4679399"]}, "date": "2010-11-22", "url": "http://arts.nationalpost.com/2010/11/22/judah-friedlander-comic-crusader/", "content": "<mark>barbara bush</mark> on palin: \"she's very happy in alaska - i hope she'll stay there' judah friedlander, comic crusader although tina fey and alec baldwin take centre stage in the nbc comedy 30 rock, the snl-spoofing sitcom has plenty of secret weapons hidden in its comedy-ringer cast. as the slovenly writer frank rossitano, judah friedlander is one of those aforementioned assets - a stand-up comic by trade who pops into frame every so often with a quick zinger, only to exit stage right immediately after. when he's not upstaging fey or the show's more bombastic headliner, <mark>tracy morgan</mark>, friedlander is busy teaching comedy club audiences how best to defend themselves from such everyday villains as ninjas, three-armed bandits and, of course, bigfoot. the self-proclaimed\" world champion \"has compiled his ultimate fighting strategies in a new deliberately over-the-top comedy book, how to beat up anybody: an instructional and inspirational karate book .\" straight up, i just wanted to keep america safe and keep the world safe, \"says a typically deadpan friedlander over the phone from new york .\" as the world's best athlete, i thought it was important to know what's going on in certain areas, from ninja home invasions to bigfoot attacks .? plus, with deforestation going on, bigfoots are being forced out of their homes and are entering human communities. i'm the only person talking about it. \"while the 200-odd-page book was originally intended as a spinoff of friedlander's alternative stand-up act, the comic says most of the material is fresh, including about 500 photos .\" it's not just a book repeating my act - stand-up is no. 1 for me, but there's only like two jokes from my act that made it in [the book]. i started working on it about seven years ago, and it's all new material, \"says friedlander, who will be in toronto on monday to promote the book (and possibly fit in a surprise stand-up performance). as for his side gig on 30 rock, friedlander isn't too worried about balancing prime-time comedy with karate .\" it's tough to balance it all. it's kind of like having three jobs non-stop, but the main focus was always the book, \"he says .\" it's for the whole world, not just americans .? let's face it, canada may be doing better than the u.s., but when the economy goes down anywhere, crime goes up, and that's when you need to know how to defend yourselves. \"hear ye! our latest selection in the afterword reading society was jonathan safron foer's\" eating animals \". you can read our panel discussions on the book, as well as all our other picks, itsmarkmedley profiles salman rushdie; kyle buckley reviews <mark>adam levin</mark>; randy boyagoda reviews rushdie; more! 2 days ago the importance of story: in luka and the fire of life, salman rushdie pays tribute to invention 2 days ago book review: luka and the fire of life, by salman rushdie"}]