[{"date": "2013-08-21", "url": "http://www.breakingnews.ie/entertainment/walsh-would-return-to-x-factor-if-cowell-came-back-604290.html", "content": "<mark>Louis Walsh</mark> would consider going back on his decision to quit \"The X Factor' if <mark>Simon Cowell</mark> returns to the show. The music manager announced earlier this month he is to leave the programme after the upcoming 10th series, but admits he could be talked around should' X Factor' boss <mark>Simon</mark> return to the judging panel next year. He said:\" I've been doing it 10 years. It's an awful long time to be on the show. I don't want to be pushed. I'd prefer to leave than be pushed. To leave on my terms. \"Now if <mark>Cowell</mark> came back, I might come back. The two of us, we would not stop laughing. If <mark>Simon</mark> called me up and said...but, oh well. Let's see what happens .\" <mark>Louis</mark> is to return to his day-to-day job of managing bands when he quits the show, and admits' X Factor' bosses haven't even attempted to persuade him to reverse his decision because he didn't tell them he was going to quit. He explained: \"They haven't said anything to me. Because I announced it without really telling them .\" I want to be a manager, because that's my day job. It's my real job. I love doing' X Factor', I absolutely love it. It has its highs and lows. Sometimes I love it more than other times. \"It is the best job in the world though. I'm like the cheerleader. But I do take it seriously, even though it may not always look like that .\" Despite recently saying he has signed up for the next series of The X Factor's rival \"Strictly Come Dancing', <mark>Louis</mark> insists he was only joking and wouldn't appear on the programme for\" all the money in the world \". He added to RadioTimes.com:\" That was a joke! We had a warm-up comic on. He said, \"Oh, you're leaving, where are you going?' And I said,\" Oh yeah, I'm going to \"Strictly',' and Sharon said,\" I'm going with him,' just taking the p ** s at the live show. And it was really funny. \"Cruel' reality TV is the new Bedlam asylum, Only Fools and Horses Star says TV star Nicholas Lyndhurst has hit out at the current state of TV, comparing\" cruel \"Britain's Got Talent to the psychiatric hospital Bedlam. Taylor Swift brings Cher Lloyd out for surprise duet at LA concert", "articleID": "2013082117_00026754_W", "names": {"Simon Cowell": ["Q162629", "Q7518530"]}}, {"date": "2013-08-21", "url": "http://tech2.in.com/news/general/peter-chou-htcs-savior-or-obstacle-to-revival/911756", "content": "N ow in his tenth year as CEO of HTC, <mark>Peter Chou</mark> is lauded as the architect of the Taiwanese firm's award-winning smartphones. But as the company's fortunes have dived, some insiders say he's now an obstacle to any revival. Rocked by internal feuding and executive exits, and positioned at the high-end of a smartphone market that is close to saturation, HTC has seen its market share slump to below 5 percent from around a quarter five years ago; its stock price is at 8-year lows, and it has warned it could make a first operating loss this quarter. Reuters interviewed a dozen former and current HTC executives who said <mark>Chou</mark>'s abrasive management style and weak strategic vision play their part in the company's decline, which has coincided with the success of Apple's iPhone and Samsung's Galaxy phones. <mark>Chou</mark> has said publicly he has no intention to stand down, and executives - none of whom wanted to be named because of the sensitive nature of the issue - said HTC has no clear internal successor. \"Part of the weakness is there is no obvious successor, and that's not been good for morale,\" one said. <mark>Chou</mark> declined to be interviewed for this article, but in response to Reuters queries, the company said, \"HTC's board and broad employee base remain committed to <mark>Peter Chou</mark>'s leadership. The (flagship) HTC One product family - which has been met with accolades by media and consumers alike - was a result of <mark>Peter</mark>'s vision and leadership, and speaks for itself .\" HTC CEO <mark>Peter Chou</mark> may be an obstacle in the company's recovery Born in Myanmar but educated as an electrical engineer in Taiwan, <mark>Chou</mark> joined HTC from Digital Equipment in 1997. Colleagues describe him as a perfectionist with an obsessive eye for materials and hardware design. Staff would deliver trays of prototype phones for him to inspect and pore over, spinning them to check for balance and running his fingers across the bevelled edges and joints. Phones would pile up on his desk, sometimes spilling onto the floor. That attention to detail and <mark>Chou</mark>'s willingness to make decisions on the fly helped build a culture within HTC of moving quickly to address market demands. At an offsite meeting two years ago, for example, the HTC team realised it needed another device for its portfolio. <mark>Chou</mark> quickly drew some sketches on a whiteboard, recalled one of those present, and soon had the outlines of a device, its price point, and a launch date - just three months away. Most manufacturers would need up to 18 months for a similar project, yet the Sensation XL appeared on schedule, and to rave reviews. \"Having the ability to just tear up a plan and say, OK, this is the new thing and we're going to get it done fast. That's <mark>Peter</mark>,\" said another former senior foreign executive. This shoot-from-the-hip approach served HTC well when the market was growing fast. Shortening the time to market meant HTC could alter plans at the last minute to take advantage of new or cheaper parts. But, as the market has matured, making it harder for handset makers to differentiate their products, the approach has left HTC vulnerable. Locking in the supply of more advanced components and materials to make products stand out requires more foresight and planning than HTC currently allows, former executives say. \"The weak point is they don't really have a long term strategy,\" said one. Rationalising his stance, the executive said, \"It used to be a strength, and now is becoming a weak point as they don't have a clear direction going forward .\" HTC's second-quarter net profit was well below forecasts even after resolving component shortages that hit its HTC One phone, and the company has said current quarter revenue could fall by as much as 30 percent from the previous quarter. HTC shares trade at around a tenth of their 2011 peak. Just three years ago, HTC was shipping 25 million smartphones a year and <mark>Chou</mark> led a huge expansion, bringing in foreign executives from Sony Ericsson, Apple, Motorola and Microsoft as he sought to take on Apple by doubling HTC's shipments. HTC was named Device Manufacturer of the Year at the world Mobile Congress in February 2011 and its market value topped that of rivals Research In Motion, now BlackBerry, and Nokia. <mark>Chou</mark> ordered champagne to celebrate. But as Apple and Samsung reigned supreme, HTC's annual shipments never reached that 50 million level, and by the end of last year HTC had dropped to number 10 among global smartphone makers. The HTC One, and earlier so-called \"hero' handsets from HTC, have won wide praise. The problem has been selling them. Executives say HTC's failure to hit sales targets was at least partly down to <mark>Chou</mark>'s management style. After hiring a slew of foreign executives, he fell short on promises to senior staff to foster a more open culture and cede sufficient authority. He openly berated managers and overrode their decisions, often with little discussion. Such an atmosphere, executives said, damaged morale and left managers uncertain of their roles. <mark>Chou</mark> kept his sales, product, marketing and design executives separate and, in some cases, created parallel teams doing the same thing. He didn't hold meetings of executives of the different departments to iron out problems even as HTC's performance wilted .\" There's a culture in HTC not to discuss numbers at senior management meetings, \"said one former executive .\" Those discussions tend to become hard or ugly, but if you don't solve it, it becomes bigger. \"<mark>Chou</mark>'s difficulty in developing a durable global brand of handsets and building an ecosystem of apps and services around it raise questions about how HTC can recover under his leadership at a time when high-end smartphone sales growth is slowing .\" With intensifying competition from other top-tier players and the entrance of lower-tier players, we think a long-term margin downtrend is inevitable, \"SinoPac wrote in a recent note. Many of the foreign hires have now quit, and HTC's old guard has re-established charge, running nearly all operations except design from Taipei. That, say those both inside and outside the company, is a mixed blessing. While leadership tensions may have eased, some warn that concentrating global marketing in Taiwan will create a one-size-fits-all, local approach that won't help HTC grow globally .\" What works in Taiwan is different from other markets, \"said one of the former executives. Chief Marketing Officer Benjamin Ho defended the move, saying in a recent interview with Reuters that it made sense to centralise key functions, but that HTC was\" not forgetting that we know we're an international brand. \"Even his fiercest critics agree <mark>Chou</mark> remains the heart of the company and say it's hard to imagine HTC coming up with great devices without him. As it seeks to turn around its fortunes, HTC has launched cheaper phones in China, and brought out a smaller, cheaper version of its flagship phone, the One Mini. It is trying to revive its US business by working more closely with operators and forming a new operations team. Bill Gates believes Google's Project Loon isn't that helpful Google celebrates World Photography Day in Mumbai Supreme Court hasn't really\" gotten to' email, says...Google faces 5-minute outage and web traffic worldwide takes nosedive HTC's weird new ad with Robert Downey Jr. leaks Micromax owners arrested by CBI in bribery case Google faces 5-minute outage and web traffic worldwide takes nosedive A \"Made in India' chip may be a reality soon Google earns flak for messing up colours in Independence day doodle KartRocket: Helping small time e-tailers take off Setting up your e-shop isn't as easy as it looks. With KartRocket,...Deliverwithme: Start-up that attempts to make your travel a little more rewarding If you are frequent-flyer, then apart from the clocking air mile rewards,...Startup emo2 builds multi-touch, multi-user computing surface If you are a TV buff then you don't have to worry about missing out on...InterviewStreet - Disrupting the IT sector hiring process What started out as part of a college project at National Institute of...3 Must-watch Indian lifestyle channels on YouTube If you are a TV buff then you don't have to worry about missing out on...Deliverwithme: Start-up that attempts to make your travel a little more rewarding If you are frequent-flyer, then apart from the clocking air mile rewards,...InterviewStreet - Disrupting the IT sector hiring process", "articleID": "2013082119_00057637_W", "names": {"Peter Chou": ["Q16336639", "Q7173267"]}}, {"date": "2013-08-21", "url": "http://www.charlotteobserver.com/2013/08/21/4253465/settlement-means-another-1475.html#storylink=rss", "content": "By Joseph Neff and Mandy Locke Anson County and its insurers paid $1.475 million to <mark>Floyd Brown</mark>, the mentally disabled man jailed in a psychiatric hospital for 14 years based on a confession that his lawyers said was fabricated by an SBI agent and two county sheriff's deputies. When added to $7.85 million settlement paid by the State Bureau of Investigation and its insurers, <mark>Brown</mark> has been compensated a total of $9.325 million for the 14 years he spent locked in Dorothea Dix Hospital in Raleigh. <mark>Brown</mark> had been charged with the 1993 murder of Katherine Lynch, a retired Anson County school teacher. The only piece of evidence against <mark>Brown</mark> was a six-page confession that SBI Agent Mark Isley claims to have written down verbatim during a 1993 interrogation. Anson County sheriff's deputy Robert Poplin assisted during the interrogation. <mark>Brown</mark>'s attorneys called the confession a work of fiction. Doctors and psychologists agreed that its elaborate details were far too advanced for <mark>Brown</mark>, 49, who has an IQ around 50 and the mental capacity of a 7 year old. The Anson County settlement was struck in December. <mark>Brown</mark>'s attorney, David Rudolf of Charlotte, asked a federal judge to seal the settlement agreement to protect <mark>Brown</mark> from being \"manipulated and taken advantage of by ill-disposed individuals\" if the amount of the settlement were known. A federal judge agreed. Following the Anson settlement, Rudolf set up a special trust, which will manage the proceeds from both settlements on <mark>Brown</mark>'s behalf. The trust will receive about $5 million; the lawyers receive 40 percent of the award plus expenses. State law requires that all settlements by public agencies be public records. After being contacted by The News & Observer, a lawyer for the Anson County insurer asked that the settlement be opened. A federal judge unsealed it Wednesday afternoon. Anna Baucom, chairwoman of the Anson County Commissioners, said she had no idea that a settlement had been reached or its amount until contacted by a reporter. \"It's a sad situation all the way around,\" Baucom said. \"Nobody wins in this case .\" Anson County paid a $5,000 deductible in the case, according to Sean Perrin, the lawyer for the insurer. Insurance picked up the rest. In addition to SBI Agent Isley, two Anson County deputies worked the case; Lt. Bud Hutchinson and Poplin. No other evidence connected <mark>Brown</mark> to the scene. None of the evidence tested at the SBI crime lab linked <mark>Brown</mark> to the crime scene. Subsequently, Anson sheriff's deputies lost virtually all of the physical evidence. According to evidence discovered during the lawsuits, neither Isley nor the deputies investigated alternative suspects, including men who had assaulted Lynch two years previously. And none of the deputies nor Isley developed evidence to corroborate <mark>Brown</mark>'s alleged confession. In 1998, Poplin and Hutchinson pled guilty to federal racketeering charges for soliciting and taking bribes from criminal suspects in return for dropping or reducing charges against the suspects. Soon after his arrest, <mark>Brown</mark> was declared incompetent to stand trial by doctors at Dorothea Dix Hospital in Raleigh. <mark>Brown</mark> was jailed at Dix until 2007, when Durham County Superior Court Judge Orlando Hudson freed him after determining that <mark>Brown</mark> had been unlawfully held and that the confession wasn't enough to prove he had committed murder. <mark>Brown</mark> was never brought to trial because he did not have the mental competency necessary to stand trial. <mark>Brown</mark> is living fulltime with a caretaker, learning life skills at programs for the mentally disabled and dealing with health problems. In a recent interview, he said he would like to visit New York City and Washington, DC.", "articleID": "2013082206_00008545_W", "names": {"Floyd Brown": ["Q5462385", "Q5462386"]}}, {"date": "2013-08-22", "url": "http://www.planetf1.com/driver/3213/8883099/Seb-Never-say-never-to-Kimi-partnership", "content": "Seb: Never say never to Kimi partnership Sebastian Vettel would have enjoyed partnering Kimi Raikkonen at Red Bull but concedes it was not his decision. When <mark>Mark Webber</mark> announced that he would retire at the end of this season, Red Bull immediately set their sights on Raikkonen, revealing that the 2007 World Champion and Daniel Ricciardo were their main targets. Earlier this week, though, it emerged that talks between the Finn and Red Bull had fallen through. \"The negotiations with Red Bull were not successful and ended some time ago,\" his manager <mark>Steve Robertson</mark> told Turun Sanomat. And although Vettel would have liked teaming up with his friend, he says it could still happen in the future. \"I didn't know how realistic it was or not,\" he said when asked about the Raikkonen reports. \"I have learned, similar to most of us from the press, that as it looks like, it is not the case. For sure, I have talked with the team - but it is not my decision .\" I think Kimi would have been nice in many ways, but now it is not happening, so it doesn't make much sense to talk about it. \"But who knows? He is still young. I am still young, and a lot of things can still happen, so never, say never .\" As for rumours that Raikkonen could now be on his way back to Ferrari, Vettel doesn't believe that's at all realistic. \"I get along quite well with Kimi so I would be in a way happy if he finds a spot where he's happy. I think he has a good seat at the moment with Lotus, but if he can improve then I would be happy for him .\" I think Kimi is very straightforward, you don't get any bullshit with him and politics so in that regard I don't know how realistic it is for him to return to Ferrari. Adrian's Diary: Love Of Luigi Adrian reveals that <mark>Fernando Alonso</mark> couldn't possibly join Red Bull due to the Christian and Luigi love-in...<mark>Fernando</mark>, Red Bull Fighter Double World Champion <mark>Fernando Alonso</mark> could line up next year as a Red Bull driver - <mark>Andrew Davies</mark> assesses his chances...From Australia to Brazil, from Sebastian Vettel to Max Chilton, find out all the results of the 2013 F1 World Championship ...", "articleID": "2013082222_00001951_W", "names": {"Andrew Davies": ["Q1151757", "Q27838011", "Q36137018", "Q46996221", "Q4756768", "Q4756770", "Q4756771", "Q4756772", "Q4758350", "Q504430", "Q58192763"], "Fernando Alonso": ["Q10514", "Q20533356", "Q42393967", "Q42394430", "Q5444582", "Q5859158"], "Mark Webber": ["Q1378842", "Q6770266", "Q82667"], "Steve Robertson": ["Q56854966", "Q718672"]}}, {"date": "2013-08-22", "url": "http://blogs.wsj.com/law/2013/08/22/gibson-dunn-hires-another-scotus-relative/", "content": "Supreme Court Justice Samuel Alito pictured in Sept. 14, 2012. Lawyers tend to beget other lawyers, and the latest example of the apple not falling far from the tree comes from a very prominent tree indeed-the Supreme Court of the United States. Philip Alito, son of Supreme Court Justice Samuel Alito, is joining Gibson Dunn & Crutcher LLP as an associate in the firm's Washington D.C. office (h/t Legal Times). \"He is a smart, talented and hard-working young lawyer with impressive credentials,\" Thomas Dupree, Jr., the firm's D.C. hiring partner, told Law Blog in an emailed statement on Thursday. \"We are delighted that he has chosen to begin his career with Gibson Dunn and look forward to welcoming him this fall .\" The appointment of a fee examiner to monitor legal bills in Detroit's Chapter 9 case comes in the midst of a push by the Department of Justice to crack down on the perception of bankruptcy as a billing bonanza for attorneys. Legal Events to Watch This Week This week: Army Pfc. Bradley Manning is likely to learn how much longer he must spend in prison for the largest breach of U.S. classified material in the nation's history. When judges and lawyers invoke Orwell, they usually cite \"Nineteen Eighty-Four .\" A recent court case in Ohio, though, provided fodder for references to \"Animal Farm .\" Attorney General <mark>Eric Holder</mark> said Monday the country's criminal justice system \"is in many respects broken,\" and called for \"sweeping, systemic changes\" to alter how criminal suspects are charged, tried, and punished. close Thank You Your email has been sent .? You must enter the verification code below to send .? Invalid entry: Please type the verification code again. close Thank You Your email has been sent .? You must enter the verification code below to send.", "articleID": "2013082305_00034008_W", "names": {"Eric Holder": ["Q312644", "Q3591180"]}}, {"date": "2013-08-23", "url": "http://yosemite.epa.gov/opa/admpress.nsf/0/3E7AEA67187B17E485257BD0004D1600", "content": "News Releases By Date Hazardous Waste Settlement Leads to School Cleanups...Hazardous Waste Settlement Leads to School Cleanups in 60 Schools in R.I. and Mass.. Release Date: 08/23/2013 Contact Information: David Deegan, (617)? 918-1017 (Boston, Mass. - August 23, 2013) - A commercial waste handler in Rhode Island has agreed to pay a fine of $58,278 and to spend $252,152 to clean hazardous chemicals out of approximately 60 schools in Rhode Island and Massachusetts in order to settle EPA claims that the company violated state and federal hazardous waste laws at a facility in Providence, R.I. Northland Environmental and its owner, PSC Environmental Services, will remove chemicals from 60 high schools and middle schools within a 50-mile radius of their Providence facility at 275 Allens Ave. where the violations occurred. The companies have agreed to pack up and properly dispose of both hazardous and non-hazardous wastes stored at the schools; to do hazardous waste training for science and art teachers; and to purchase safety equipment such as storage cabinets for flammable chemicals, eye washes and deluge showers for classrooms where hazardous chemicals are used. This project will be done over 18 months during times when the schools are closed. EPA alleged that Northland/PSC Environmental Services violated the federal Resource Conservation and Recovery Act (RCRA) and state hazardous waste laws by failing to properly identify certain hazardous wastes and failing to properly maintain hazardous waste tanks and containers. These alleged violations could have resulted in the release of hazardous wastes to the environment. The company also stored incompatible hazardous wastes next to one another, creating a potential for fire or explosions. The company quickly came into compliance after the violations were identified. \"All facilities that generate or manage hazardous wastes have an obligation to make sure they carefully adhere to the environmental requirements that result in safer, cleaner communities,\" said Curt Spalding, regional administrator of EPA's New England office. \"This case will have a positive outcome, since the projects under this settlement will help provide safer classrooms at many schools in Rhode Island and Massachusetts .\" The school clean outs will involve removing outdated and unwanted chemicals from schools at no cost to the participating schools. Chemical management is often a low priority for schools and it is not uncommon for school science departments to have outdated and unneeded stock chemicals present. \"I want to thank the EPA and the Cranston School Department for working cooperatively to provide a safe environment for our students,\" said City of Cranston Mayor Allan Fung. \"We are pleased to see funds from EPA actions like this reinvested in making Rhode Island a cleaner and safer place,\" said Terrence Gray, P.E., Associate Director for Air, Waste and Compliance at the RI Department of Environmental Management. \"For many years, DEM has directly supported school districts across Rhode Island by removing old and unnecessary chemicals, but that effort has always been limited by the resources we have available. This recent investment extends this important initiative so that more of these dangerous materials can be taken out of our schools, providing a much safer environment for students and educators .\" \"The science classroom environment is of the utmost importance as we work to support teaching and learning for students and teachers. Safety is our first concern so we were delighted to have a partnership with the EPA Integrated Chemical Management Program (ICM) who worked with our science teachers to inventory, organize chemicals, with regards to safety and to the benefit of classroom use. Working with this program provided our teachers with invaluable insights with regards to managing chemical supplies. The ultimate goal is to maximize safety and learning of science inquiry in Cranston Public Schools,\" said Dr. Judith Lundsten, Superintendant Cranston Public Schools. Rhode Island schools within a 50-mile radius of the Northland facility were sent emails letting them know of this opportunity to have toxic, hazardous, or chemicals prohibited by the state removed by participating in this project. Schools that were interested provided a list of the chemicals that need to be removed. Cranston, R.I. is using the opportunity to provide both East and West High School with chemical cleanouts before school starts on Aug. 27. In addition to paying the fine and completing the environmental project, Northland/PSC has agreed to make sure the Providence facility remains in compliance with federal and state hazardous waste management regulations. Northland/PSC's Providence facility accepts and handles a broad spectrum of wastes including acids, alkalis, flammable wastes, water reactive wastes, cyanides, sulfides, oxidizers, toxic wastes, oily wastes, photochemical wastes and laboratory packs. Hazardous and non-hazardous wastes are received, stored and or consolidated and then shipped off site for treatment or disposal. More information on hazardous waste management: http: //www.epa.gov/region1/enforcement/waste/index.html Attachment: List of Schools provided with hazardous waste cleanup under this settlement: Barrington High School Barrington Mt. Hope High School Bristol Our Lady of Mount Carmel Bristol Central Falls Senior High School Central Falls Cranston High School East Cranston Cranston High School West Cranston New England Laborers' / Cranston Public Schools Construction Career Academy Cranston Joseph McCourt Middle School Cumberland East Providence High School East Providence Burrillville High School Harrisville Burrillville Middle School Harrisville Johnston Senior High School Johnston Lincoln Senior High School Lincoln William <mark>M. Davies</mark>, Jr Career and Technical High School Lincoln Rogers High School Newport North Providence High School North Providence Ponaganset High School North Scituate North Smithfield High School North Smithfield Blackstone Academy Charter School Pawtucket William E. Tolman Senior High School Pawtucket Portsmouth High School Portsmouth DelSesto Middle School Providence Mount Pleasant High School Providence School One Providence Smithfield High School Smithfield Tiverton High School Tiverton Curtis Corner Middle School Wakefield Toll Gate High School Warwick Pilgrim High School Warwick Warwick Veterans Memorial HS Warwick Chariho Regional High School Wood River Junction Exeter-West Greenwich Regional High School West Greenwich MASSACHUSETTS Braintree High School Braintree Brockton High School Brockton B.M.C. Durfee High School Fall River Malden High School Malden Medford High School Medford Middleborough High School Middleborough Plymouth North High School Plymouth Plymouth South High School Plymouth North Quincy High School Quincy Quincy High School Quincy Randolph High School Randolph Revere High School Revere Saugus High School Saugus Walpole High School Walpole Waltham High School Waltham Worcester Public Schools - Burncoat Middle School Worcester - Forest Grove Middle School Worcester - Dr. Arthur F. Sullivan Middle School Worcester - Worcester East Middle School Worcester - Burncoat High School Worcester - Claremont Academy Worcester - Doherty Memorial High School Worcester - North High School Worcester - South High Community School Worcester Hazardous Waste Settlement Leads to School Cleanups in 60 Schools in R.I. and Mass.. EPA Chief Gina McCarthy will visit Alaska to highlight climate action plan and tour Bristol Bay EPA Awards $1 Million Brownfield Grant to Downriver Community Conference in Southeast Michigan U.S. EPA Announces Brownfield Grants for Genesee County and Mott Community College in Flint", "articleID": "2013082321_00031066_W", "names": {"M. Davies": ["Q56597982", "Q59123763"]}}, {"date": "2013-08-25", "url": "http://www.sportingnews.com/nfl/story/2013-08-24/pga-tour-gary-woodland-matt-kuchar-tied-for-lead-at-barclays", "content": "JERSEY CITY, N.J. - Matt Kuchar and Gary Woodland began their week at The Barclays by going to Citi Field and getting a tour of the clubhouse, where Kuchar noticed an indoor batting cage and asked if they could try it out. He stood behind the net and threw to Woodland, a promising baseball player in high school. \"Gary hit and was really impressive,\" Kuchar said. \"I didn't hit and didn't show anything differently, but Gary was impressive swinging a baseball bat .\" Gary Woodland heads down the course toward a share of the lead. (AP Photo) Woodland isn't too bad with a golf club in his hands, either. Playing with Kuchar in the final group, Woodland ran off four straight birdies Saturday afternoon with another powerful display of his athleticism and shot a 3-under 68, giving him a share of the lead with Kuchar going into the final round at Liberty National. Leaderboard: Tiger in the hunt | Europe: <mark>Johnnie Walker</mark> | Champions Tour | \"Man, that guy can play some golf,\" Kuchar said, knowing that Woodland was within earshot. Kuchar, who played bogey-free on the back nine in blustery conditions for a 70, remains more polished. He already has two wins this year, at the Match Play Championship and Memorial, and he is a past champion at The Barclays. For much of the day they were trading birdies - along with a few bad breaks - and wound up tied at 12-under 201. Kuchar's from off the green on the reachable par-4 16th was stopped by a sprinkler, while Woodland putted his to close range for birdie. Woodland gave back the stroke on the next hole with a drive that plugged into the far end of the bunker, forcing him to blast it out sideways and costing him a bogey. They are close friends and former World Cup partners. But the final round at Liberty National doesn't belong to only them. Kevin Chappell broke the tournament course record with a 62 - 10 shots better than the average score on Saturday - and was one shot behind. \"In the wind, if you would have told me someone was going to shoot 62 today, I would probably have laughed at you,\" Chappell said. And very much in the mix was Tiger Woods, bad back and all. Woods was just hanging around for so much of the day, gingerly bending over to put his ball on a tee and retrieve it out of the cup. His fortunes turned with two strong shots on the par-5 13th led to birdie, he drove the 16th green for another birdie and finished with a 10-foot birdie putt and a 69. Woods was four shots behind, along with <mark>David Lynn</mark>, who also had a 69. \"It starts off great every day, and then it progressively deteriorates as the day goes on,\" Woods said of his lower back, which he hurt from what he said was a soft bed in his hotel room. \"Hopefully, tomorrow it will be one of those days again. Fight through it and see if I can win a tournament .\" The large group at 7-under 206 included 20-year-old Jordan Spieth, Bubba Watson, Jim Furyk, Justin Rose and Rickie Fowler. Chappell's round was evidence that even in windy conditions, low scores are available. For the former UCLA Bruin, it was really was simple as making putts, most of them in that 10-foot to 15-foot range. There were a few par saves on the back nine, and six birdies on the front. \"I just really holed all the putts that you kind of expect to hold but you don't always hole,\" he said. Kuchar and Woodland will be in the final group for the second straight day, and they certainly aren't strangers. Kuchar represented the Americans in the World Cup two years ago in China. After scouting the Mission Hills course and seeing it was long, he picked Woodland as his partner. The Americans wound up winning their first World Cup title in over a decade. Woodland is regarded as one of the best athletes on tour - a promising baseball player in high school who first went to a Division II school to play basketball and then transferred to Kansas to play golf. But he has disappeared since winning at Innisbrook two years ago, mainly from injuries to both wrists. He began working with Claude Harmon III in the spring, and he hired mental coach Julie Elion right before his season turned around by winning the Reno-Tahoe Open earlier this month. \"I've really let my game take over,\" Woodland said. He surged into the lead during a four-hole stretch to close out the back nine - a 5-iron into the par-5 sixth, a sand wedge to 10 feet for birdie on No. 7, a 4-wood for his second shot on the par-5 eighth for birdie, and a 6-iron for a fourth straight birdie on the ninth. Even on the 16th hole, which played 289 yards, Woodland has so much power than he went with a 2-iron and came up just short. Kuchar caught up by playing bogey-free on the back nine with three birdies, starting with a superb shot on the 10th to 3 feet. DIVOTS: Rory McIlroy had an even-par 71 and was six shots out of the lead ....Aaron Baddeley shot 66, and at No. 119 in the FedEx Cup standings, stands a good chance of being among the top 100 players to advance to the second playoff event next week outside Boston ....Greg Chalmers made a hole-in-one on the 135-yard 14th, with the Statue of Liberty in view to the right. In the next group, K.J. Choi almost made an ace ....<mark>Lynn</mark> was squatting to read the line of his putt on the 10th green when he toppled backward and landed on his seat. Looking over, he made a motion that he had been drinking, and the gallery ate it up ....Chappell has gone 25 consecutive holes without a bogey.", "articleID": "2013082508_00011906_W", "names": {"David Lynn": ["Q1175360", "Q28155105", "Q5236858", "Q58003126"]}}]