[{"date": "2013-08-25", "url": "http://www.sportingnews.com/nfl/story/2013-08-24/pga-tour-gary-woodland-matt-kuchar-tied-for-lead-at-barclays", "content": "JERSEY CITY, N.J. - Matt Kuchar and Gary Woodland began their week at The Barclays by going to Citi Field and getting a tour of the clubhouse, where Kuchar noticed an indoor batting cage and asked if they could try it out. He stood behind the net and threw to Woodland, a promising baseball player in high school. \"Gary hit and was really impressive,\" Kuchar said. \"I didn't hit and didn't show anything differently, but Gary was impressive swinging a baseball bat .\" Gary Woodland heads down the course toward a share of the lead. (AP Photo) Woodland isn't too bad with a golf club in his hands, either. Playing with Kuchar in the final group, Woodland ran off four straight birdies Saturday afternoon with another powerful display of his athleticism and shot a 3-under 68, giving him a share of the lead with Kuchar going into the final round at Liberty National. Leaderboard: Tiger in the hunt | Europe: <mark>Johnnie Walker</mark> | Champions Tour | \"Man, that guy can play some golf,\" Kuchar said, knowing that Woodland was within earshot. Kuchar, who played bogey-free on the back nine in blustery conditions for a 70, remains more polished. He already has two wins this year, at the Match Play Championship and Memorial, and he is a past champion at The Barclays. For much of the day they were trading birdies - along with a few bad breaks - and wound up tied at 12-under 201. Kuchar's from off the green on the reachable par-4 16th was stopped by a sprinkler, while Woodland putted his to close range for birdie. Woodland gave back the stroke on the next hole with a drive that plugged into the far end of the bunker, forcing him to blast it out sideways and costing him a bogey. They are close friends and former World Cup partners. But the final round at Liberty National doesn't belong to only them. Kevin Chappell broke the tournament course record with a 62 - 10 shots better than the average score on Saturday - and was one shot behind. \"In the wind, if you would have told me someone was going to shoot 62 today, I would probably have laughed at you,\" Chappell said. And very much in the mix was Tiger Woods, bad back and all. Woods was just hanging around for so much of the day, gingerly bending over to put his ball on a tee and retrieve it out of the cup. His fortunes turned with two strong shots on the par-5 13th led to birdie, he drove the 16th green for another birdie and finished with a 10-foot birdie putt and a 69. Woods was four shots behind, along with <mark>David Lynn</mark>, who also had a 69. \"It starts off great every day, and then it progressively deteriorates as the day goes on,\" Woods said of his lower back, which he hurt from what he said was a soft bed in his hotel room. \"Hopefully, tomorrow it will be one of those days again. Fight through it and see if I can win a tournament .\" The large group at 7-under 206 included 20-year-old Jordan Spieth, Bubba Watson, Jim Furyk, Justin Rose and Rickie Fowler. Chappell's round was evidence that even in windy conditions, low scores are available. For the former UCLA Bruin, it was really was simple as making putts, most of them in that 10-foot to 15-foot range. There were a few par saves on the back nine, and six birdies on the front. \"I just really holed all the putts that you kind of expect to hold but you don't always hole,\" he said. Kuchar and Woodland will be in the final group for the second straight day, and they certainly aren't strangers. Kuchar represented the Americans in the World Cup two years ago in China. After scouting the Mission Hills course and seeing it was long, he picked Woodland as his partner. The Americans wound up winning their first World Cup title in over a decade. Woodland is regarded as one of the best athletes on tour - a promising baseball player in high school who first went to a Division II school to play basketball and then transferred to Kansas to play golf. But he has disappeared since winning at Innisbrook two years ago, mainly from injuries to both wrists. He began working with Claude Harmon III in the spring, and he hired mental coach Julie Elion right before his season turned around by winning the Reno-Tahoe Open earlier this month. \"I've really let my game take over,\" Woodland said. He surged into the lead during a four-hole stretch to close out the back nine - a 5-iron into the par-5 sixth, a sand wedge to 10 feet for birdie on No. 7, a 4-wood for his second shot on the par-5 eighth for birdie, and a 6-iron for a fourth straight birdie on the ninth. Even on the 16th hole, which played 289 yards, Woodland has so much power than he went with a 2-iron and came up just short. Kuchar caught up by playing bogey-free on the back nine with three birdies, starting with a superb shot on the 10th to 3 feet. DIVOTS: Rory McIlroy had an even-par 71 and was six shots out of the lead ....Aaron Baddeley shot 66, and at No. 119 in the FedEx Cup standings, stands a good chance of being among the top 100 players to advance to the second playoff event next week outside Boston ....Greg Chalmers made a hole-in-one on the 135-yard 14th, with the Statue of Liberty in view to the right. In the next group, K.J. Choi almost made an ace ....<mark>Lynn</mark> was squatting to read the line of his putt on the 10th green when he toppled backward and landed on his seat. Looking over, he made a motion that he had been drinking, and the gallery ate it up ....Chappell has gone 25 consecutive holes without a bogey.", "articleID": "2013082508_00011906_W", "names": {"Johnnie Walker": ["Q466525", "Q6266126", "Q939019"]}}, {"date": "2013-08-26", "url": "http://money.cnn.com/2013/08/26/news/companies/trump-university/index.html?section=money_mostpopular", "content": "@ Jose_Pagliery August 26, 2013: 9:56 AM ET NEW YORK (CNNMoney) <mark>Donald Trump</mark>'s real estate school is under attack by New York's top prosecutor, and both sides took to the airwaves Monday to elaborate on the upcoming legal battle. New Day, \"New York State Attorney General Eric Schneiderman called the school a\" bait-and-switch scheme, \"and <mark>Trump</mark> accused the prosecutor of actions akin to extortion. Still, <mark>Trump</mark> dismissed the importance of the matter .\" He's a lightweight, \"<mark>Trump</mark> said of the state's attorney general. It's the aftermath of a $40 million civil lawsuit Schneiderman filed against <mark>Trump</mark> on Saturday, accusing <mark>Trump</mark> of defrauding students who attended the billionaire's for-profit school. Related: N.Y. attorney general suing <mark>Trump</mark>'s school for fraud The lawsuit claims <mark>Trump</mark> used his celebrity status to lure students into a school that over-promised and under-delivered. A free seminar urged prospective students to pay $1,495 for a three-day workshop. That, in turn, was used to sell a $34,995 course. In the school's commercials, <mark>Trump</mark> tells viewers,\" We're going to teach you better than the business schools are going to teach you. \"\"At <mark>Trump</mark> University, we teach success. That's what it's all about: success. It's going to happen to you,\" he says, as triumphant horns blast in the background. Schneiderman said Monday that the lawsuit completes one branch of a long-running investigation into for-profit schools. He said it was prompted by dozens of complaints from former students who contacted his office and the Better Business Bureau, a nationwide nonprofit organization. The attorney general said teachers never got certified. He noted <mark>Trump</mark> University isn't even a university, which is defined as a collection of colleges. And although students were promised an in-person meeting with <mark>Trump</mark>, \"all they got was the chance to stand next to a life-sized poster,\" Schneiderman said. \"We discovered that it was a classic bait-and-switch scheme. It was a scam,\" he said. Schneiderman said his lawsuit partly relies on the sworn testimony of <mark>Trump</mark> University's former president, who explained that <mark>Trump</mark> maintained a close eye on the school and read all of its promotional material. Schneiderman also said he got hold of the school's \"playbook,\" which insisted that instructors keep pitching the upgraded, more expensive programs. \"This is a pretty straight-forward case. The documents pretty much entitle us to a judgment,\" Scheiderman said. When <mark>Trump</mark> appeared on \"New Day\" by phone later in the morning, he defended his program by noting the school had received stellar evaluations by students. \"We didn't think we were going to get sued because we have a 98% approval rating,\" <mark>Trump</mark> said. \"If you go to Wharton or Harvard, they didn't have a 98% approval rating. People loved the school. The school was terrific .\" Related: Morgan Stanley escapes federal dragnet <mark>Trump</mark> then turned his attention to the prosecutor, saying that Schneiderman approached <mark>Trump</mark> for political donations--and when <mark>Trump</mark> refused, Scheiderman followed with a lawsuit as revenge. \"They solicited us during the investigation for campaign contributions,\" <mark>Trump</mark> said. In anticipation to those accusations, Scheiderman had said, \"Prosecutors are all used to people who commit fraud making wild accusations when they're caught .\" But <mark>Trump</mark> cast the legal challenge as a power battle between an overreaching government and a private powerhouse--himself. \"I could have settled this case very easily. They wanted to settle. I chose not to,\" <mark>Trump</mark> said. \"We have a lot of happy students. They'll be testifying .\" Market indexes are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer LIBOR Warning: Neither BBA Enterprises Limited, nor the BBA LIBOR Contributor Banks, nor Reuters, can be held liable for any irregularity or inaccuracy of BBA LIBOR. Disclaimer. Morningstar:? 2013 Morningstar, Inc.. All Rights Reserved. Disclaimer The Dow Jones Indexes SM are proprietary to and distributed by Dow Jones & Company, Inc. and have been licensed for use. All content of the Dow Jones Indexes SM? 2013 is proprietary to Dow Jones & Company, Inc.. Chicago Mercantile Association. The market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. FactSet Research Systems Inc. 2013. All rights reserved. Most stock quote data provided by BATS.", "articleID": "2013082622_00022382_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}}, {"date": "2013-08-29", "url": "http://pwtorch.com/artman2/publish/WWE_News_3/article_73018.shtml", "content": "WWE NEWS: Stephanie McMahon responds to bullying question on WWE TV, P.R. expert takes issue with response By <mark>James Caldwell</mark>, PWTorch assistant editor WWE executive/on-air character Stephanie McMahon responded to a question about how WWE is able to promote their B.A. Star anti-bullying campaign while showing unanswered bullying on their WWE TV programming. Twitter Q: \"What do u say to those fans who say @ WWE is going against their own Anti-Bullying campaign w / showing HHH & Ryback bullying?\" Stephanie A: \"No diff than bullying in a movie, WWE is Entertainment @ beaSTARalliance is real .\" responded to Stephanie's answer on Twitter: \"That is utter nonsense and (bad) PR spin. How does she know that the kids can differentiate it? You cannot profess one thing, then show something else. Kids mimic what they see on TV, right or wrong. It's not the respective medium's fault, but if it's not there, there is nothing to mimic .\" Kids play cops and robbers because they see it on TV and movie. They also try to perform wrestling moves and sometimes people get hurt. Again, it's not the wrestling company's responsibility to be a parent, but it IS the company's responsibility not to be hypocritical. \"<mark>Caldwell</mark>'s Analysis: I would add that there are no consequences to the actions of Ryback and Triple H, which sends a message to kids that it's okay to bully because no one will do anything about it. Especially in the case of Ryback, who has bullied\" people beneath him \"such as scrub wrestlers, caterers, and backstage interviewers without any punishment doled out or wrestlers stepping up to fight him. (Of course, WWE has emasculated the roster the past two weeks, but that's another issue .) Ironically, the only response from the announcers - the\" voices and on-air representatives of WWE \"- has been Jerry Lawler's canned, dry line about Ryback\" not being a representative of the B.A. Star initiative. \"But, that's empty words, especially when the announcers simply sit there looking at each other before moving along and there are no authority figures in-place or wrestlers stepping up to tell Ryback that it's not right. WWE NEWS: Stephanie McMahon responds to bullying question on WWE TV, P.R. expert takes issue with response WWE NEWS: Raw quarter-hour TV ratings - Punk-Heyman delivers again, Bryan Gauntlet, how did A.J.'s promo fare?, more WWE NEWS: Prominent ESPN writer questions lack of pro wrestling off-season, draws attention to wrestler health THE TORCH REACHES MORE COMBAT ENTERTAINMENT FANS THAN ANY OTHER SOURCE PWTorch editor Wade Keller has covered pro wrestling full time since 1987 starting with the Pro Wrestling Torch print newsletter. PWTorch.com launched in 1999 and the PWTorch Apps launched in 2008. He has conducted\" Torch Talk \"insider interviews with Hulk Hogan, The Rock, <mark>Steve Austin</mark>, <mark>Kevin Nash</mark>, <mark>Scott Hall</mark>, Eric Bischoff, Jesse Ventura, Lou Thesz, Jerry Lawler, Mick Foley, <mark>Jim Ross</mark>, Paul Heyman, Bruno Sammartino, Goldberg, more. He has interviewed big-name players in person incluiding Vince McMahon (at WWE Headquarters), Dana White (in Las Vegas), Eric Bischoff (at the first Nitro at Mall of America), <mark>Brock Lesnar</mark> (after his first UFC win). He hosted the weekly Pro Wrestling Focus radio show on KFAN in the early 1990s and hosted the Ultimate Insiders DVD series distributed in retail stories internationally in the mid-2000s including interviews filmed in Los Angeles with Vince Russo & Ed Ferrara and Matt & <mark>Jeff Hardy</mark>. He currently hosts the most listened to pro wrestling audio show in the world, (the PWTorch Livecast, top ranked in iTunes) REACHING 1 MILLION + UNIQUE USERS PER MONTH PWTorch offers a VIP membership for $10 a month (or less with an annual sub). It includes nearly 25 years worth of archives from our coverage of pro wrestling dating back to PWTorch Newsletters from the late - '80s filled with insider secrets from every era that are available to VIPers in digital PDF format and Keller's radio show from the early 1990s. Also, new exclusive top-shelf content every day including a new VIP-exclusive weekly 16 page digital magazine-style (PC and iPad compatible) PDF newsletter packed with exclusive articles and news. The following features come with a VIP membership which tens of thousands of fans worldwide have enjoyed for many years...- New Digital PWTorch Newsletter every week -3 New Digital PDF Back Issues from 5, 10, 20 years ago - Over 60 new VIP Audio Shows each week - Ad-free access to all PWTorch.com free articles - VIP Forum access with daily interaction with PWTorch staff and well-informed fellow wrestling fans", "articleID": "2013083001_00044244_W", "names": {"Brock Lesnar": ["Q220556", "Q25421397"], "James Caldwell": ["Q16106198", "Q3808317"], "Jeff Hardy": ["Q44137", "Q6174013", "Q6174015"], "Jim Ross": ["Q317724", "Q56558062", "Q6197876", "Q6197879", "Q6197881"], "Kevin Nash": ["Q280793", "Q6397074"], "Scott Hall": ["Q16875363", "Q352713"], "Steve Austin": ["Q44313", "Q7611829", "Q7611831", "Q7611832"]}}, {"date": "2013-09-02", "url": "http://www.smartcompany.com.au/politics/057275-labor-pledges-to-raise-asset-write-off-threshold-to-10-000-for-small-business-in-last-effort-campaign-launch.html", "content": "Business groups react to Coalition's decision to cut $5 billion in tax breaks Labor announces GST lodgement relief for small business, but tax experts aren't convinced Coalition unveils small business policy: Superannuation increases deferred for two years Small business divided on Coalition's $5.5 billion parental leave policy - where's the money coming from? The business community has won again. Just days before the federal election, Labor has announced it will increase the instant asset write-off threshold to $10,000 if it returns to government, in a last-minute pledge to business. The announcement caps what has been a lucrative campaign for small businesses, with both sides of politics announcing tax and budget policies which cater to the small end of town. Coalition's announcement it will scrap the increased write-off threshold if it wins government. Peter Strong, executive director at the Council of Small Business of Australia, told SmartCompany the announcement adds \"momentum\" to the economy. \"This is another example of what's happened during the past few weeks with that focus on small business,\" he says. \"Given Joe Hockey wants to remove the tax benefits that have been announced over the past couple of years, the policies are coming much closer together with regard to small business .\" At the Labor launch yesterday, Kevin Rudd said the Coalition was in for a fight as it heads to the polls this coming Saturday - maintaining a defiant stance although polls continue to drift in <mark>Tony Abbott</mark>'s favour. \"And for those who say the fight is up, I say they haven't seen anything yet,\" he said. \"Because we have something worth fighting for .\" Among other promises announced yesterday were a promise to keep investment projects tied to local suppliers and jobs, while Rudd also said the federal government would make states pledge to raise TAFE funding - or face a takeover by Canberra. Several other announcements were made regarding skills and apprentices, including lifting the current apprenticeship completion payment to $2000. The effort may be futile. The latest Australian-Newspoll survey shows support for the government has dropped to 33%. On a two-party preferred basis, the Coalition wins 54% to Labor's 46%. But that hasn't stopped Rudd from trying. This campaign has been mostly focused on small business issues, and the instant asset write-off is a prime example. When the threshold was last increased, small businesses welcomed the move as a boost to confidence. Tax experts are less convinced this time around. Deepti Paton, tax counsel at the Tax Institute, told SmartCompany while the figure is welcome, it doesn't go far enough - the benefit only lasts for less than two years. The higher threshold will last until July 2015, after which it will return to the $6500 rate. \"It's a high number and certainly would be a boost to give the tax system's capability to give an extra bump for additional investments, but you need to bear in mind this only lasts for 22 months .\" \"It's welcome, but we would prefer an affordable long-term change to the tax system such as an accelerated deprecation scheme, rather than constant, short-term boosts .\" Domain names are king: What SMEs need to know and learn from the Melbourne IT-New York Times debacle Domain names are king: What SMEs need to know and learn from the Melbourne IT-New York Times debacle Apple iPhone 5C low-end smartphone photos leak as Steve Wozniak warns of tough fight ahead", "articleID": "2013090208_00023563_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}]