[{"articleID": "2017062711_00324347_W", "names": {"Imtiaz Ali": ["Q16224409", "Q3149575", "Q51735857", "Q6008453"]}, "date": "2017-06-27", "url": "http://www.kollytalk.com/hindi1/bolly/srk-thanks-fans-clocking-25-years-bollywood-579537.html", "content": "Hindi Bolly Cinenews Share on Facebook Tweet on Twitter SRK Mumbai, June 27: Superstar Shah Rukh Khan has thanked all his fans and well-wishers for supporting him in his \"glorious journey\" of over two decades in the Hindi filmdom. Shah Rukh on Monday night shared a 37-second clip on his Twitter handle, where he and his youngest son AbRam were seen addressing a crowd standing in front of his house--Mannat in Bandra here. The father-son duo was seen twinning in all-white kurta pyjamas, while they greeted fans from the terrace of his home in the video. \"Eid Mubarak! Thank you for making my day special. And thank you for joining me on this glorious journey of 25 years. Love you all,\" Shah Rukh captioned the image. The 51-year-old superstar completed the 25-year milestone on June 25, a date which saw the release of his debut film \"Deewana\" back in 1992. Shah Rukh is now gearing up for his upcoming film \"Jab Harry Met Sejal\" , which is directed by <mark>Imtiaz Ali</mark>. The romantic film is extensively shot in Lisbon, Prague, Budapest and Punjab. The film also stars Shah Rukh's \"Rab Ne Bana Di Jodi\" co-star Anushka Sharma. This is the third time the two will be seen sharing screen space together."}, {"articleID": "2012091523_00057613_W", "names": {"Liu Ying": ["Q10897991", "Q24861668", "Q45413699", "Q45440119", "Q45440885", "Q45444698", "Q45446717", "Q45455716", "Q45458585", "Q45477315", "Q45477431", "Q45477443", "Q45477508", "Q45477579", "Q45479224", "Q45481718", "Q45482647", "Q45483443", "Q45502188", "Q45514930", "Q45518283", "Q45520113", "Q45524362", "Q45535209", "Q45542158", "Q45545466", "Q45546919", "Q45547749", "Q45549576", "Q45550165", "Q45550851", "Q45560557", "Q45570070", "Q45594189", "Q45597439", "Q45609948", "Q45612391", "Q45616256", "Q45623798", "Q45623842", "Q45623860", "Q45623923", "Q45625003", "Q45626245", "Q45646966", "Q45649645", "Q45659632", "Q45665883", "Q45671378", "Q45675694", "Q45677014", "Q45696447", "Q4963213", "Q6653851"]}, "date": "2012-09-15", "url": "http://thestar.com.my/sports/story.asp?file=/2012/9/16/sports/12037351&sec=sports", "content": "petaling jaya: egyptian speed merchant tarek momen savoured the sweetest moment of his life after stunning compatriot and second seed mohamed el shorbagy 12-10, 6-11, 12-10, 8-11, 14-12 in the final of the cimb malaysian open squash championships at the curve, mutiara damansara, yesterday. momen has competed in seven kl and malaysian opens and crashed out in the first round in six of them. he made the final of the malaysian open in 2010 but lost to former national no. 1 mohd azlan iskandar. in yesterday's final, the early exchanges seemed to point to another disappointment for world no. 19 momen as he found himself in trouble early on, trailing world no. 8 shorbagy 10-7. the 24-year-old momen, widely regarded as the quickest player in the world of squash, however, saved three game balls before wrapping up the set 12-10. it was touch-and-go in the next three sets as the players set the stage for a dramatic finale. momen again found himself on the back foot but he miraculously saved two match balls before sealing his biggest career win. it was also his second title in two weeks, having captured the columbian open earlier this month. \"i'm over the moon right now...winning two titles in two weeks. i really want to carry this good form into my next tournaments,\" said momen. \"i knew it would be really tough against shorbagy but i really wanted to win after losing in the final here two years ago.\" i don't know how i found the energy to do what i did...it was probably my burning desire to win which carried me through. severe winds and heavy rain put paid to british open second round <mark>liu ying</mark> suffers heartbreak after losing in women and mixed doubles"}, {"articleID": "2012101809_00037874_W", "names": {"Brian Marshall": ["Q16196148", "Q4964615", "Q912685"], "Scott Phillips": ["Q2477913", "Q3476291", "Q3952859"]}, "date": "2012-10-18", "url": "http://entertainment.inquirer.net/63364/creed-coming-to-manila", "content": "one of the most prominent post-grunge acts that have sold no less than 53 million albums worldwide is manila-bound to rock out their loyal disciples and make believers of the rest: creed. on nov. 11, 2012 at smart araneta coliseum, lead vocalist scott stapp, bassist <mark>brian marshall</mark>, drummer <mark>scott phillips</mark> and guitarist/vocalist mark tremonti collectively known as creed will perform live their well-loved songs that have endeared them to fans regardless of shifting trends in the worldwide music industry. some of the most anticipated hits they racked up in their more than a decade of dominance are \"with arms wide open,\" \"my sacrifice,\" \"higher,\" \"what if,\" \"what's this life for,\" and \"are you ready.\" note that creed has its own greatest hits compilation album-one of the few from among their contemporaries. of their hits, \"wide arms wide open\" has proved to be their biggest so far with the song eventually ending up as best rock song in the 2011 grammy awards. the song about fatherhood that many believe has spiritual undertones, pushed the album to sell more than 10 million copies worldwide. it was also nominated in the grammys under the best rock performance by a duo or group with vocal. the voice of stapp is considered by many as one of the most compelling ones in the genre. in a review of one of their earliest performances, stapp's gravely but powerful voice was said to have the ability to energize a room as soon he steps up to the mic and it can fill up every available space! and though creed has been involved in several controversies through the years-including going into hiatus only to return stronger than before - they have remarkably weathered all these through the sheer force of their musical artistry. by the time 2011 had come, the quartet has been hailed by billboard magazine as the 18 th best artist of the last decade. one of their albums that moved 40 million units worldwide also ended up as the ninth best-selling artist of the 2000s. but it's not all nostalgia going for the concert in manila. it is said that the band has started recording new material for their fifth album so it won't be unlikely if they decide to sample some of these during the show, perhaps, even exclusively for their filipino fans. here's interesting trivia about creed: though regarded by many as a christian rock band due to some of their best songs focusing on themes such as eternity and faith, the band has never claimed to be one and, in fact, was never signed to a contemporary christian music label. it's just that unlike many other rock bands, creed chooses to deal with such topics as sexual abuse, hostility and lucid dreaming \"in a substantial, mature manner,\" said a reviewer. in an interview, stapp pointed out the difference between spiritual and religious lyrics: \"religion was about\" what not to do .' spirituality opens you up, sets you free. \"tickets to the creed live in manila are available in ticketnet outlets with the following ticket prices: * patron a standing 5,850 * patron b standing 4,500 * lower box center 4,500 * lower box side 3,500 the comments uploaded on this site do not necessarily represent or reflect the views of management and owner of inquirer.net. we reserve the right to exclude comments that we deem to be inconsistent with our editorial standards. to subscribe to the philippine daily inquirer newspaper in the philippines, call +63 2 896-6000 for metro manila and metro cebu or email your subscription request here. factual errors? contact the philippine daily inquirer's day desk. believe this article violates journalistic ethics? contact the inquirer's reader's advocate. or write the readers' advocate: aquino hails dfa chief del rosario, says no back channel talks with china now"}, {"articleID": "2015092209_00132686_W", "names": {"Joe Schmidt": ["Q284169", "Q6280152"]}, "date": "2015-09-22", "url": "http://harwichandmanningtreestandard.co.uk/sport/national/13775319.World_Cup_officials_clarify_TMO_rules/", "content": "National Sport World Cup officials clarify TMO rules The opening round of the World Cup has been beset by delays involving Television Match Officials 0 comments World Cup chiefs have moved to clarify the role of television match officials following the controversial use of replays during the tournament's opening weekend. England's first match with Fiji last Friday lasted more than 100 minutes as referee Jaco Peyper referred six incidents to the TMO for closer inspection. The over-zealous use of the TV officials continued across the opening round of fixtures, with games involving Tonga and Georgia, Ireland and Canada as well as France's match-up with Italy all interrupted for lengthy periods as big calls were referred upstairs. That prompted a wave of criticism, with Ireland coach <mark>Joe Schmidt</mark> fearing it could spark a wave of injuries as players are left to cool down while they wait on a ruling. His Georgia counterpart Milton Haig warned a new generation of fans could be turned off the sport if the action was not speeded up. Former Australia fly-half Lynagh, a World Cup winner in 1991, criticised the length of time it is taking for decisions to be made, saying: \"It's taking too long. It's the process that's wrong. It's important to get decisions right on these big occasions, but let's work out how we can do that quickly, concisely and correctly.\" Other pundits have also called on match referees to show more courage in their decision-making and not rely on TV replays as back-up. But now World Cup bosses have released a statement explaining just what the TMO can and cannot interfere with. It said: \"The objective of the television match official system is to ensure accurate and consistent decisions are made on the field in a timely and efficient manner. The TMO is a tool to help referees and assistant referees with their on-field calls and the referee remains the decision-maker who is in charge of the process.\" Promoted stories The TMOs can only be used only for four areas - determining the grounding for a try and whether the players involved were in touch before the try was scored, to check whether a kick at goal was successful, to confirm if an infringement in the build-up to a try or scoring opportunity took place and to consider an act of possible foul play. Share article Chairman of the World Rugby Match Officials Selection Committee John Jeffrey said: \"The TMO is a part of the match official team and the fantastic technology available is a tool to be used in the making of key decisions during matches. The TMO process is used to make sure the correct calls are made to protect the integrity of the game.\" It's worth noting that just 28 per cent of stoppage time in the opening match of this Rugby World Cup was taken up by the TMO process but we are committed to reducing that time further while not compromising on accuracy. As such, all involved - referees, TMOs, technicians and television producers - are working together to achieve that. \"Promoted Stories"}, {"articleID": "2019022015_00445231_W", "names": {"Dale Brown": ["Q3012285", "Q323353", "Q5210362"], "Johnny Jones": ["Q15018961", "Q16227667", "Q6267001", "Q6267003", "Q933190"], "Bob Delaney": ["Q4932243", "Q4932260", "Q4932262"], "Bobby Johnson": ["Q18921994", "Q4935199", "Q4935204"]}, "date": "2019-02-20", "url": "http://www.cbssports.com/college-basketball/news/forever-44-how-a-teammates-murder-has-brought-lsu-together-and-fueled-the-tigers-inspired-season/", "content": "The phone buzzed on Will Wade's pillow at 12:57 a.m. Wade, LSU's men's basketball coach, rests his cell phone next to his head on Thursday, Friday and Saturday nights during the school year. Ask many a college coach, and they'll tell you the calls you don't want almost always come after midnight. That night, Wade cracked his eyes and saw that one of his players, freshman Javonte Smart, was ringing him. He picked up expecting to hear Javonte's voice. Instead, it was another one of his freshmen, Emmitt Williams, who was overwrought. He and Smart had been eating at Waffle House when they saw police cars speeding by with their sirens on. Smart and Williams were making their way back toward where they were earlier that night with teammate Wayde Sims. Moments after seeing the police cars, Williams received a call from a friend who told them Sims had been shot. A gut-churning video of the incident was circulating on social media. It was because of this that a friend called Sims' mother, Fay Sims, and woke her up. \"She was frantic and certain it was Wayde,\" Fay said. Williams and Smart got in the car and raced to the scene at 600 Harding Boulevard on the north end of Baton Rouge, Louisiana, near Southern University's Mumford Stadium. Minutes later, Williams had Smart's phone and called their coach. He repeated the same two words. \"He's dead. He's dead. He's dead.\" \"As a coach, you think he's overreacting,\" Wade said. \"He was shot, but I didn't want to obviously believe he was dead.\" Williams and Smart followed the ambulance speeding their teammate to the hospital. Wade made his way posthaste. Fay and Wayne Sims beat their son to Our Lady of the Lake Hospital by about 5 minutes. Initially, they did not know whether Wayde was alive or dead, but approximately 20 minutes after Wayde was brought in, a doctor came out to deliver the news. Less than an hour into Sept. 28, 2018, Wayde Sims, 20, died of a gunshot wound to the head and neck. Fay and Wayne never got to see their only child that night. His body was a crime scene; law enforcement, guarding the door to where doctors were trying to save Wayde, would not his parents through. \"It was hurtful for us because we couldn't go see him, touch him,\" Fay said. They wouldn't see their boy again until more than week later when his body was embalmed in an open casket at his funeral. By the time Wade got to the hospital, Williams, Smart and former LSU teammate Brandon Sampson were waiting in the emergency room alongside Wayde's parents. \"I pretty much knew when I walked in that he was dead,\" Wade said. \"His dad came up and confirmed that to me ....You watch one of your players go to the coroner in a body bag, going into the van, we knew that was him. You almost fall to your knees.\" The killing of Wayde Sims was a senseless act of violence that culminated after an altercation that still has no clear impetus or reason. Sims, Smart and Williams, along with some other friends, attended a concert at Southern University earlier that night, then stopped by a fraternity party before making their way back to LSU, which is approximately a 10-minute drive. Sims stayed back with a friend. What happened after that remains, largely, a frustrating mystery. It's believed Wayde stepped in to stop his friend from being pummeled. From there, a suspect identified as Dyteon Simpson, pulled out a gun, pointed it at Sims and killed him, police said. Simpson, who police say has confessed to the shooting, is facing a second-degree murder charge with the potential for a life sentence. \"Javonte and Emmitt saw him before they left,\" teammate Skylar Mays said. \"Wayde checked to see if they were OK to drive and had everything in order to leave.\" Mays, Sims' oldest friend, awoke the night of Sims' death to an eruption of texts, all of them in some variation of I'm sorry or Stay strong, Sky. \"You don't even know what they're talking about,\" Mays said. \"You don't know what to think, and then to get that call that your best friend was shot ....Can't explain it. You can't explain that type of sorrow.\" Skylar and Wayde were supposed to spend their college careers as best friends on and off the basketball court as they brought LSU back to national prominence. One dumb impulse from a stranger obliterated that. Skylar was called upon to be one of Wayde's pallbearers. He carried his best friend to the grave. Wayde Sims (middle) and Skylar Mays (far ends) grew up together and became best friends before playing at LSU. Skylar Mays Wayde Sims was made for LSU. He grew up 10 minutes from campus and was as perfect a fit for the Tigers as you could find. He attended University High, which is on LSU's grounds. Wayde's father played for legendary Tigers coach <mark>Dale Brown</mark> in the late 1980s and early 1990s. While at U High, Wayde and Skylar won state championships. Wayde totaled 3,045 points and 1,613 rebounds on his way to being named the best high school player in the state of Louisiana. After former LSU coach <mark>Johnny Jones</mark>, Wayne Sims' cousin, was fired following Sims' freshman season, Will Wade got the job. Wade said Sims was one of the first to completely embrace the new staff. \"The two best words you can describe anybody are\" dependable' and \"consistent,'\" Wade said. \"He never missed a practice, never missed a day.\" The bitterness over Wayde's death was all the more infuriating and heartbreaking because those around him said he took a huge step as a person and as a player in the offseason. He was expected to be an important piece for this team in 2018-19. A common refrain in recent months for 21-4 LSU has been: Think how much better we'd be if Wayde was here. \"You look at his locker, and you're in the film room, you almost think he's been gone a few days and he'll be back.\" LSU coach Will Wade \"He had big things coming for him this season before everything happened,\" Wayne Sims said. \"We had high expectations. All that comes to a screeching halt.\" LSU's first official practice was scheduled for the 6 a.m. hour that Friday of his death. Instead, the team wouldn't fully practice until 10 days later--after Wayde was buried. Wade is not a helicopter coach. He doesn't demand curfews. Rather, he tries to curb against players staying out late by holding practice so early. \"We pretty much always do something on a Friday morning. It's just to make sure Thursday night goes smoothly,\" Wade said. \"You look back at everything that's gone on and you look back at anything you could have done, you go through the blame game. <mark>Bob</mark>'s helped me with that. You go back through every scenario.\" Wade is referring to <mark>Bob Delaney</mark>, a former director of NBA officials who was coincidentally hired to be an officiating adviser to the SEC weeks before Wayde Sims was killed. SEC commissioner Greg Sankey brought <mark>Delaney</mark> on for his rules oversight, but <mark>Delaney</mark> is also a former law enforcement agent who successfully infiltrated the mob only to deal with severe anxiety, depression and traumatic stress as a result. He's counseled the U.S. military, 9/11 first responders and dozens of everyday Americans affected by mass-shooting incidents in recent years. <mark>Delaney</mark> and other counselors proved vital in the coping process not just in the days following Sims' death but the months that crept along without him. \"How are we going to be intentional in understanding each person's grieving process as well as their interaction with trauma?\" <mark>Delaney</mark> said. \"When you experience a traumatic event, it peels the wound back on other traumatic events. It's like a scab that went over a wound gets knocked off. Will and his staff and his players, as well as the community and the university, were going to be dealing with a tremendous amount of emotion.\" Players were encouraged to be as open and emotional with <mark>Delaney</mark>, a neutral supporter, as they felt comfortable. But Mays is still caught in a loop where he's trying to stay positive while knowing a part of him is never coming back. \"I don't think it's ever going to feel normal for me as long as I'm playing ball here,\" he said. \"We expected Wayde to have a great year for us and be one of our team leaders because he had that type of summer. We expected him to make a big jump. The biggest asset he was going to bring to our team was his energy, that caring personality and a guy that keeps guys together, keeps guys with the right mindset. He would've done that just being who he was ....There's just some people in this world that everyone gravitates toward you.\" Mays, a junior shooting guard who has started every game this season, is averaging a career-high 13.0 points. Everyone in that program feels the void without Wayde, but Skylar's plight is especially acute. \"Skylar is deeply hurting,\" Fay Sims said. \"He made a comment that it feels like Wayde's on his vacation without his phone.\" Those who knew Wayde best describe him not just as a momma's boy, but as a grandma's boy, too. \"He was really caring for everybody,\" Fay said. \"He didn't see the wrong in people.\" He was also a city-dwelling outdoorsman. Wayde loved fishing, going so far as to get a boating license. He'd go bass fishing at Lake Fields, southwest of New Orleans. Sometimes he'd sneak a quick hour at the pond behind his parents' house, squeezing in the time before midday practice. He'd hop in the trawl-motor two-person boat, even convincing nervous teammate Brandon Sampson to come along. (Because of Wayde, Sampson eventually grew to enjoy fishing, which he now does on occasion .) \"If it takes a life sentence, that's what I want. No plea bargains.\" Wayne Sims Father and son began to take on big adventures, like saltwater angling and going hunting for red fish and trout in the summer of 2017. They'd head out before sunrise and creep down the marshlands well south of New Orleans, combing through brackish water until the sun's blaze baked them nice by noon. On their first trip, Wayde caught a 3-foot red fish. It took him more than 20 minutes to reel it in, tiring him out. Then he caught another one. Wayne still makes time to do the big fishing trips once in a while. As he waits and watches on the boat, his mind will drift. He thinks about his only child. He thinks about the trips that will never be. \"For me, after everything happened, I've questioned God,\" Wayne said. \"Why was he taken away from us? I understand it was a devilish act that happened. What is the purpose? Is there something good that's going to come out of this? Now that we don't have our only son, we miss him dearly and each and every day is a struggle.\" The Sims have gone to every court proceeding and will continue to do so until if/when Simpson is convicted. The case has hit stalls--Wayne personally knew the former judge in the case, causing a conflict of interest and prompting new judge to be assigned--but they are hoping to have a resolution this year. \"It's important that Wayne and I are there,\" Fay Sims said. \"I guess we're Wayde's voice now.\" Wayde Sims' favorite sports: basketball and fishing. Fay Sims Added Wayne: \"Our son was taken away from us, so if it takes for his life, not in the physical sense, but if it takes a life sentence, that's what I want. No plea bargains; we want justice to be served.\" Things have not been easier in the five months that have passed, in part, because the Sims don't have reasons for why their son was pointlessly killed. Closure is that much harder to encircle. They also know the horrific video captured on social media is there for them to watch if they choose, but they refuse. Fay said she knows some who watched it and vomited as a result. \"We don't have a whole lot of facts,\" she said. \"A fight broke out, Wayde stepped in, and the guy had a gun and shot him and killed him.\" Every few weeks brings a new threshold to cross, all of them painstaking. After the initial whirlwind of grief, the funeral, the onslaught of beloved company...then came the optimistic-yet-dreaded opening of LSU's season six weeks later. \"It literally takes my breath when I walk into the PMAC,\" Fay said. \"[Some days are] just way too emotional. When I first walk in, it cuts my breath.\" Thanksgiving for the Sims meant an open seat at the table. On Dec. 13, 2018, what would have been Wayde's 21st birthday, nearly 40 people went to his gravesite in the rain and for a ceremonial balloon release. \"I don't even remember December too much,\" Fay said. Christmas brought no seasonal decorations last year; Fay took a few Christmas items and adorned Wayde's gravesite--still waiting to have its tombstone embedded--with holiday bibelots. Then came the unexpected emotional gush of Dec. 31. \"For me, personally, it was New Year's Eve that was the worst,\" she said. \"That was having to leave 2018, although I kind of felt like I hated of 2018 for taking our son, and didn't want to see 2019 come in because Wayde wasn't a part of it. It's gut-wrenching; it's excruciating pain. I miss him dearly.\" Friends have remained supportive. The Sims' nest has not had the opportunity to become empty. But as the season goes along and LSU keeps playing better, things seem to grow that much more difficult. LSU has gone through an extraordinary--and partly controversial--run this season. Weeks after Wayde's death, Wade and his program came under scrutiny and skepticism after information via wiretap was brought up in federal court (lacking complete context) that illustrated Wade on the phone in 2017 with the now-convicted Christian Dawkins in discussions over a blue-chip recruit. Wade was asked about both that revelation and going through dual-yet-separate personal tribulations. \"It puts everything in proper perspective for you,\" he said. \"It shows you what's really important and rattles you.\" When asked a follow-up question about the wiretap, Wade declined further comment. The death of a player and the exposure of potential/alleged NCAA rule violations are matters detached in importance. But they've also been heavy, obvious, unavoidable storylines--both of which came to light in the preseason--as the Tigers have put together one of the more unexpected success stories on the court in 2019. Watch LSU and you'll see teammates affixed and fond of one another. The body language is affirming and positive. The Tigers are talented, of course, but they're also driven and focused. \"You could see a bonding that takes place where they're taking care of each other in small ways that may not be Earth-shattering, but a guy grabbing another guy by the back of the neck and kind of holding on to him,\" <mark>Delaney</mark> said. \"This is not just emotional and psychological. There's a physiology to this. It's amazing how, when we we go through trauma, people are resilient. We're more resilient than not. When that kind of love comes together, people can do extraordinary things.\" LSU opened its season in nondescript fashion with a 7-3 start. Since then, the Tigers have gone 14-1, climbed to their highest ranking in the AP Top 25 in a decade (No. 13) and improved to 21-4 overall, tied atop the SEC standings with Tennessee. There have been unlikely endings, like the basket interference that wasn't called and thus sealed a win against No. 5 Kentucky on Feb. 12. That gave LSU just its second road win in 37 games all time against a top-five opponent. There was the unreal rally Jan. 26 at Missouri--down 14 with 2:10 left, the Tigers' chances of a win at 0.2 percent--that ended with an 86-80 LSU victory. \"We're going to have six and the other team's going to have five,\" Wade said. \"I think that's the best way to explain what happened at Missouri. It's something that's with our team. Any time you go through something like that as a group, it's tough. You never know how you're going to react.\" LSU has also won in overtime against Arkansas and Mississippi State, the latter featuring an unlikely bounced-in 3-pointer by Javonte Smart to help seal it. A similarly improbable 3-point shot was made by freshman Naz Reid in the Tigers' 83-78 win against Auburn on Feb. 9. \"We like to say that Wayde's made great friends with God,\" Mays said. \"Some of the shots we make, like when Javonte hit the 3 and popped it up and in--similar to how Naz made his 3 at Mississippi State--we like to say Wayde tapped that in a little bit.\" The team has honored Wayde in a number of ways. His No. 44--the same number his dad wore at LSU--is stitched to the uniforms. Some players have taken to writing his name and number on their shoes. All Tigers now finish their weightlifting sessions with 44 reps of bicep and tricep curls. At home games, the team taps his locker before it leaves for the court. \"We're definitely playing for something bigger than ourselves,\" Mays said. \"Amongst all the tragedy and what happened in the past, I feel like we're finding a way to use what happened to give us an extra edge and a drive.\" Wayde Sims' name and number are honored on the shoes of his best friend, Skylar Mays. USATSI Wayde's locker has gone untouched since he died. His playbook is tucked behind his shoes. His practice gear and uniform dangles from the hooks. Wade sits alone in front of the locker once a week, early in the morning, to reflect. \"You look at his locker, and you're in the film room, you almost think he's been gone a few days and he'll be back,\" the coach said. <mark>Delaney</mark> and others helped LSU organize and keep structure as the season started. Everything physical in regard to handling Wayde's loss had to be intentional. His uniform was draped over a seat in the front row of the middle of the team picture. The locker was kept as it was as means of not leaving an empty space for the players to be around the entire season. \"They lose him once, they're losing him again if you do that,\" <mark>Delaney</mark> said. \"The team atmosphere really helps protect them.\" LSU travels with a counselor for its road games and has support staff available for the players and coaches when on campus. Small things can prompt memories of Wayde--good or bad--the emotions of those triggers offering up unpredictable reactions. Routines from previous seasons--Who were the teammates Wayde would sit next to on plane and bus rides? Who would he room with on the road? What songs did he like to play before a game?--are paid more careful attention. \"There's a lot of things that I've learned through all this,\" Wade said. Wade has spoken with veteran college basketball coach Oliver Purnell, who lost a player in his sleep when he was at Dayton, and consulted with former Vanderbilt football coach <mark>Bobby Johnson</mark>, who had a standout player murdered during Christmas break in 2004. \"Sometimes when there's a suddenness to things that triggers you back to being in the hospital,\" Wade said. \"There's a lot of things that can pop up and jolt you and jolt different members of your team at different times.\" For example, it's customary for teams to watch tape of conference opponents and use video from the prior season as means to scout and prep. But for LSU, that film has Wayde on it. Wade will not let his players watch that. He has eliminated it from team prep--though he and his coaches have watched it, and even then, it's as comforting as it can be spooky. He's on the screen but not in the room. \"The jolt is how you forget that you forget the film from last year, it's Wayde making a play,\" Wade said. \"He pops up. We don't want to necessarily trigger that if we don't have to. But as a coaching staff and me, personally, when I watch it, it's very jarring still to this day.\" Wayde Sims with his mother Fay and father Wayne. Fay Sims Cruelly, Wayde's slaying wasn't the first brush with death via gun violence with which the team has dealt. LSU's quietly gone through other trauma with players' family members. Prior to Wayde's death, the team had been involved with the TRUCE program, which targets at-risk areas--like near where he was killed--in Baton Rouge. For LSU, Wayde Sims is now a face of the issue. \"That's what we've tried to transition to, to turn our anger,\" Wade said. LSU's most important moments this season have been equaled or surpassed in private or away from the limelight just as much as the huge victories. Four days after the slaying, Skylar spoke at Wayde's candlelight vigil in front of the Pete Maravich Assembly Center. A few days after that, he got to see his friend one last time. He remembers it with a pause in his voice. \"Walking up to the casket, your knees are weak because you're not ready, but you want to see him,\" Mays said. \"I was honored to be a pallbearer, obviously. I thank Ms. Fay for allowing me to be a pallbearer. That meant the world to me. They had an unbelievable amount of people there and it shows how many people cared about Wayde.\" Skylar and other former teammates of Wayde have taken trips his grave with his mother. She's become a rock for Wayde's friends, to allow them to be vulnerable and cry when needed. She tags messages with plaintive expression: #forever 44?? \"Fay and I are doing the best that we can to live without him, because it's a big hole when you lose a kid like that,\" Wayne Sims said. \"A big void.\" They take two or three trips per week to the cemetery now. It's their only way to feel some modicum of comfort. On the court, Wayde will be honored in a big way come March: At the SEC Tournament, the conference plans to name him this season's SEC Legend for LSU. \"He's always around, he's always in our minds,\" Wade said. But he should be there. This season is not a dream one. It's real, it's painful, it's beyond bittersweet. There is no redemption possible here. The Tigers' success in absence of their murdered brother is a racking reminder, on a daily basis, how unfair life can be. The emotions and subtle aftershocks of his death are still coming out for many who knew him and probably will long after the final game of this season has been played. This team is forever together but forever broken. Wayde Sims' jerseys--he wore the same number as his father--hang in the family home. Fay Sims"}, {"articleID": "2012082504_00025086_W", "names": {"Michael Graham": ["Q16195087", "Q22107127", "Q30907334", "Q6830720", "Q6830721", "Q6830722", "Q6830723", "Q705322"]}, "date": "2012-08-25", "url": "http://bostonherald.com/news/regional/view.bg?articleid=1061155647&srvc=rss", "content": "herald readers reject claims of \"war on women' h erald readers see little that's legitimate in the charges from the left that republicans are waging a war on women during the current election cycle.\" i think you will see the race quickly shift to issues next week during the convention, \"a reader commenting as bobby said during yesterday's friday throwdown news chat. readers tackled the question of whether the incendiary comments about rape made by u.s. rep. todd akin would make a difference in the presidential race nationally or in the u.s. senate race here in massachusetts.\" (elizabeth) warren's attempts to attack (u.s. sen. scott) brown by linking him with the akin and the gop platform on abortion are little more than the desperate failings of a dying campaign, \"bobby continued. the issue erupted this week after akin said in a tv interview that in a\" legitimate rape \"a woman's body has a way of preventing pregnancy.\" i do not think you base your vote in these races on some nitwit in missouri, \"gerry said. by associated press st. louis - rep. todd akin's staunchest defender may turn out to be...by <mark>michael graham</mark> on monday, president barack obama took a break from his media tour with those hard-hitting ...? copyright by the boston herald and herald media. no portion of bostonherald.com or its content may be reproduced without the owner's written permission."}, {"articleID": "2019051709_00206721_W", "names": {"Eddie Johnson": ["Q1179451", "Q2325791", "Q376267", "Q5336165", "Q576969", "Q59196952", "Q960818"]}, "date": "2019-05-17", "url": "http://www.eveningtimes.co.uk/news/17647048.three-charged-after-pregnant-teenager-murdered-and-baby-cut-from-womb/", "content": "News Three charged after pregnant teenager \"murdered and baby cut from womb' By Press Association 2019 Marlen Ochoa-Lopez's family talk to reporters 0 comment A Chicago woman has been charged with murder after allegedly strangling a pregnant teenager and cutting the baby from her womb. Clarisa Figueroa, 46, had previously sold baby clothes to 19-year-old Marlen Ochoa-Lopez, and lured her back to her house with an offer of more clothing, investigators said. Clarisa Figueroa (Chicago Police Department/AP) They added that Figueroa apparently wanted to raise another child two years after her adult son died of natural causes.\" Words cannot express how disgusting and thoroughly disturbing these allegations are, \"Police Superintendent <mark>Eddie Johnson</mark> told reporters at a news conference to announce murder charges against Figueroa and her 24-year-old daughter, Desiree Figueroa. Desiree Figueroa (Chicago Police Department/AP) The mother's boyfriend, 40-year-old Piotr Bobak, was charged with concealment of a homicide. The charges come three weeks after Ms Ochoa-Lopez disappeared and a day after her body was discovered in a bin in the back yard of Figueroa's home on the city's Southwest Side, about four miles from her own home. Piotr Bobak (Chicago Police Department/AP) According to police, the young woman drove from her high school to Figueroa's home in response to an offer of free clothes that Figueroa had posted on Facebook. When she arrived, police said, she was strangled with a cord and the baby cut from her body. A few hours later, Figueroa frantically called 911, claiming that her newborn baby was not breathing. When first responders arrived, the boy was blue. They tried to resuscitate him and took him to hospital, where police said he remained in grave condition and was not expected to survive. Police did not connect the woman's disappearance and the 911 call about the baby until May 7, when friends of Ms Ochoa-Lopez directed detectives to her social media account, which showed she had communicated with Figueroa in a Facebook group for expectant mothers. At the same time, Figueroa had started a GoFundMe campaign for the funeral of what she said was her dying baby, said Sara Walker, a spokeswoman for Ms Ochoa-Lopez's family. Police then conducted DNA tests which showed Ms Ochoa-Lopez and her husband, Yiovanni Lopez, were the baby's parents, Ms Walker said. Yiovanni Lopez (Ashlee Rezin/Chicago Sun-Times/AP) When police arrived to question Figueroa, her daughter said her mother was in hospital with a leg injury, before adding she had just delivered a baby, said Brendan Deenihan, deputy chief of detectives. Police searched the neighbourhood and found Ms Ochoa-Lopez's car a few blocks away. On Tuesday, they returned with a search warrant, finding cleaning supplies as well as evidence of blood in the hallway and the bathroom. They later found the body in a waste bin behind the house and recovered surveillance video that showed Ms Ochoa-Lopez's vehicle driving through the neighbourhood on the day they believed she was killed, authorities said. Missing person notice for Marlen Ochoa-Lopez (Chicago Police/Chicago Tribune/AP) Ms Ochoa-Lopez's family had been looking for her since her disappearance on April 23, organising search parties and holding news conferences as they pushed police for updates. Her father, Arnulfo Ochoa, said relatives were grateful to have found her, and now they want justice. The family was also bracing for the baby's death, while still hoping for a miracle.\" We plead to God that he gives us our child because that is a blessing that my wife left for us, \"Mr Lopez told reporters through a Spanish interpreter outside the morgue where his wife's body was taken. The three suspects are scheduled to appear in court. 0 comment"}, {"articleID": "2009110514_00156318_W", "names": {"President Bush": ["Q207", "Q23505"], "John Kerry": ["Q22316", "Q6242998"], "Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2009-11-05", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=45098341&blogId=517194885", "content": "gender: male status: divorced age: 49 sign: cancer state hey liberals, who's becoming extinct? current mood: i predicted before last november that we're in for a surprise, because people are fed up with the same old thing. i also predicted that if things didn't change after the election, there would be consequences to pay. i think we're seeing that. i also think we're seeing the backlash i predicted against liberalism in this country. homosexual marriage was voted down in maine, a really liberal state. virginia went republican, and the extremely liberal state of new jawsey went republican. liberals can laugh all they want at the tea parties, but they're working. i predict after 2010, liberals will be laughing out of the other side of their collective faces. obama (d) has not delivered the change he promised. he has done the same as any other politician: he's lied to us. but this time it's different, because he's lied big. really big. but i put this to those who did not vote for obama (d). why is anyone surprised by his actions? he told us exactly what he was made of. we knew he had zero experience. we laughed at those who believed he went to a church where the preacher spewed racist hate. obama (d) went to that church for 20 years and managed to convince doe eyed zombies he didn't hear any racism coming from reverend wright. during the campaign, he refused to respect america, our troops and our country by not saluting our flag. we knew it. we all knew what he was. he did that childish thing with scratching his chin and flipping off president <mark>bush</mark>. we knew he was childish. we knew he played childish games. yet america elected him, because he promised change and america said \"ok, we'll fall for it one more time, but if you lie to us...\"so here we are. we know why obama (d) wants to shove through all these bills right now. because he knows there's a storm coming. each and every time he gets up and talks about the health care overhaul, people protest it more and more, and people are more and more against it. he appoints these people to his cabinet who are the most extreme radicals ever to hold a cabinet post. and then he whines like a little titty baby when people find out and complain, and his appointment is forced to resign. he wants us to accept his version of\" change \". the fact is, the majority of this country define themselves as\" conservative \". not republican. but conservative. and that's something liberals have a hard time digesting. after obama (d) was elected, all the pundits weeped with joy that the country finally and totally shifted to the left. that was just wrong, and they had no proof of it. obama (d) was handed the election at the right time. god forbid john mccain should run a decent campaign. just as <mark>john kerry</mark> gave the election to president <mark>bush</mark>, mccain did his dead level best to make sure obama (d) ran pretty much on skates. obama (d) was elected because everything fell in place for him. i'd call it the closest thing to luck as anything could be. call it the great american experiment. it was just time to do something different. if you read my blogs, at one point i was for obama (d). but that quickly changed once i saw what he is. a liar. a thief. a child who has absolutely no business running this country. much less into the ground. the only thing that can help obama (d) in 2010 is if he shifts more to the center. like ex president clinton did. instead of protecting our troops, obama (d) sits at his desk and picks little girly fights with fox news. nancy pelosi (d) and her cohorts celebrated with glee after they came up with their own health care overhaul bill. all 2,000 pages of it. it reminds me of the time democrats celebrated on the floor after they passed their huge tax increase. that next term, in' 94, they paid with their jobs. democrats are worried about their jobs in 2010. and a notice has been sent to the sitting republicans who refuse to listen to their constituents. democrats swore if we gave them the house and senate, they'd clean things up and make everything right. they have so much control, they could pass any bill they wanted, unchallenged. republicans can't even fight it. but democrats can't even agree on one single measure. democrats swore there would be more transparency if we would just give them the house and senate. all they've done since is have meetings behind closed doors, and refuse to post bills on line so everyone can see what's being voted on. instead, they attack <mark>glenn beck</mark> and bill o'reilly. democrats swore they would\" clean up the swamp \"if we would just give them control of the house and senate. now we find out the democrats are more corrupt than anyone imagined. obama (d) can't even find an appointment that's paid their taxes. this country gave obama (d) and democrats what they wanted. ever see the movie\" casino \"? remember joe pesci's character was narrating and he said\" we had it all. paradise. we could do anything we wanted and no one could touch us, and we managed to screw that up \". you screwed up democrats, and now you have to face the music. you had your chance, you had your way. not only did you manage to screw things up, but we managed to learn about it on a daily basis, despite your efforts to shut down free speech. well i cant help but laugh. nobody's riding obama's coattails to victory! you just wait till next year. if the dems up for re-election are smart, they might want to distance themselves from obama. you hit the nail on the head from the get go. good for you and i totally agree."}, {"articleID": "2018120109_00269666_W", "names": {"Richard Sherman": ["Q16205086", "Q2947411"], "Russell Wilson": ["Q1149781", "Q26858692", "Q7381875"], "Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Earl Thomas": ["Q2051514", "Q23304639", "Q5326117"]}, "date": "2018-12-01", "url": "https://www.sacbee.com/sports/nfl/article222485050.html#storylink=rss", "content": "Matt Calkins: <mark>Richard Sherman</mark> would have created a mess if Seahawks had kept him | The Sacramento Bee Matt Calkins: <mark>Richard Sherman</mark> would have created a mess if Seahawks had kept him By MATT CALKINS The Seattle Times December 01, 2018 12:00 AM SEATTLE Sorry, but did you expect something different? Did you think you were going to hear a list of pleasantries and well-wishes? Was there a chance in Hades he was going to wax poetic about fond memories and locker-room bonds? Not likely. A leopard can't change its spots, and a <mark>Sherman</mark> must take his shots. That's as clear as it's ever been. Thursday, 49ers cornerback <mark>Richard Sherman</mark> reminded me how quickly he could put himself on Page 1. He reminded me how his candor was always compelling even if it was cringeworthy. He reminded me how you could never step away when he was at the podium. And he reminded me how the Seahawks were right to part ways with him when they did. Premium content for only $0.99 For the most comprehensive local coverage, subscribe today. SUBSCRIBE NOW Here's the highlight reel from Thursday's news conference with <mark>Sherman</mark>, who will return to CenturyLink Field for the first time Sunday .--On his relationship with <mark>Russell Wilson</mark>: \"I don't have a relationship with <mark>Russell</mark>. We were teammates. We played through a very special time for the franchise.\" --On seeing all the things <mark>Wilson</mark> is capable of: \"I've also seen him throw five picks in a game, so you see what he's capable of on both sides of it. You understand that he can be defended.\" --On how good the Seahawks (6-5) are: \"They're a middle of the road team.\" --On how things ended in Seattle: \"You just expect that once you've done so much for a franchise that they wouldn't cut you when you're hurt. It's kind of a respect thing more than anything.\" There's a double standard in sports media where we loathe the cliches spewed by someone such as <mark>Wilson</mark>, then condemn the barbs spewed by someone such as <mark>Sherman</mark>. I don't think that's right. I also think one could mount a defense that his comments about <mark>Russell</mark> weren't as inflammatory as some are making them out to be. There are a lot of fine people I've worked with that I don't keep in touch with. And <mark>Sherman</mark> has never been afraid to smack-talk opponents--whether it be <mark>Tom Brady</mark> postgame or rival cornerbacks on Twitter. But there was also something about Thursday that seemed particularly resentful. And I can't help but think that resentment would have come to a head had the Seahawks kept <mark>Richard</mark> around. Vicious as <mark>Sherman</mark> has been--whether it be laying into Skip Bayless, Michael Crabtree or Darrelle Revis--he's always contended that they were the ones to start the beef. <mark>Wilson</mark>, on the other hand, has never publicly dissed <mark>Sherman</mark>, and praised him throughout his own news conference Thursday. I don't think <mark>Sherman</mark> would be disrespecting Doug Baldwin if asked about route-running. I don't think he'd point out previous dropped balls if asked about Tyler Lockett's touchdown total. As has been indicated in past stories, this thing with <mark>Wilson</mark> seems personal. As far as the Seahawks cutting him while he was recovering from his Achilles injury this offseason? Can you really blame them? <mark>Sherman</mark> doesn't think a team should release you when you're hurt. Truth is, that's usually the optimal time to do it--especially if you're nearing 30 and playing a speed-based position. That may sound brutal, but that's the NFL. I'll take the ice-cold general manager over the sentimental one every time. Thank-you money is a nice gesture in March, but it won't help get you to February. Considering <mark>Sherman</mark>'s contributions during Seattle's Super Bowl days, the Seahawks owe him all the accolades and honors they can bestow. But after paying him nearly $45 million, they didn't owe him any more cash. Seahawk fans have every right to ignore <mark>Sherman</mark>'s faults and concentrate on his feats. There were the 34 interceptions, the NFC title game tip and a swagger that helped make him the most feared cornerback in the league. But the 12s grounded in reality are also acutely aware of the sideline blowups, the insubordination and a compulsion for conflict. This year's Seahawks are unlike anything <mark>Sherman</mark> was a part of. The offseason turnover was intense, and the early struggles--particularly from <mark>Wilson</mark>--were immense. Throw in <mark>Earl Thomas</mark>' contract situation, and I can't help but wonder if <mark>Richard</mark>'s voice would have been more of a hindrance than a help. Asked about <mark>Sherman</mark>'s exit from Seattle Thursday, Baldwin wasn't cryptic. \"It was really (crappy),\" he said. Maybe so. But also necessary. The Seahawks needed to change. And <mark>Sherman</mark>, well, I'm not sure he can."}, {"articleID": "2014112302_00032393_W", "names": {"Adam Levine": ["Q219631", "Q37840339", "Q4679401"]}, "date": "2014-11-23", "url": "http://examiner.com/article/olympian-manteo-mitchell-is-a-fit-dad-who-encourages-children-and-their-parents", "content": "Manteo Mitchell thinks parents have the most impact on their children's healthy eating habits. Photo by Christian Petersen/Getty Images may train all year for a race that lasts a mere forty-four seconds, but he's also working to extend his life expectancy while bettering his mental and physical health. Mitchell spoke with Examiner on Thursday night, November 22, 2014 about his life as an elite athlete, family man, and motivational speaker. RUNJUMPTHROW event sponsored by USA Track & Field and Hershey's. Mitchell was an ambassador for SUBWAY ®'s Fit For Life campaign. USA Track & Field partnered this fall with local SUBWAY ® restaurants in parts of North Carolina, South Carolina and Georgia, encouraging kids to get active and stay healthy through the SUBWAY ® \"Fit For Life Challenge\" program. Aimed at elementary and middle-school students, the Fit For Life Challenge promotes health habits during a two-week challenge taking place in October, dubbed \"Fit-tober.\" Mitchell, a 2012 Olympic silver medalist, studied health and fitness, and sees the benefit of good eating habits and physical activity for everyone. I have a sports management, Bachelor of Sciences degree. I know the business of sports, the education of sports, and the actual physical activity of sports. I go to these schools and I like to pick the brains of physical education teachers. I want to know if they are actually educating the children and helping them develop fine motor skills, increasing blood flow, and advancing brain activity. I go to some schools and they are actually doing these things that promote healthy brain activity and good blood flow. This actually helps the teachers. If your blood is flowing well, and you have exceptional brain activity, you're going to be more attentive in class. At some schools, they have what I call \"roll the ball out coaches.\" They just roll a ball out, take attendance, and let the kids do what they want to do for thirty minutes .--Mitchell Examiner spoke exclusively, with Mitchell about developing healthy kids, and balancing his busy schedule: One in every three kids is classified as obese or overweight, and we need to decrease that stat, or better yet eliminate it. It's really, really hard to do, but I really believe that it starts in the home. You learn how to say, \"yes ma'am\" or \"no ma'am,\" that starts in the home. [Parents] can't teach it when kids get to high school, if you didn't teach it when they were a baby or were growing up. It's a habit. That's where the whole food intake process happens. It's a habit that you have to establish. It could take a while. I know when I'm in the off-season, I have my days where I will go eat what ever I want. But, when you come back to training it is so hard to get back, and adjust it. It takes one or two weeks for me to actually get adjusted and know,' I can't eat this...I can't eat that .' It's just a learning phase. Some parents don't think much about the way children eat because children can be extremely picky. Fighting over dinner can be stressful. So, letting a child eat whatever makes him or her happy is often the easier route. However, it may not be the healthiest. It is imperative that parents model healthy behaviors for their children. Kids are so young, right now and they have so much time. Usually their metabolisms are so high that they don't really have to worry about not eating certain things. But, it would be so good if they did because it would enhance their performance so much, just like it would an elite athlete. Like I said it starts in the home. We need to educate not only the kids, but the parents as well. You know, usually what ever the parents are eating, the kids are eating. Mitchell, who holds a Masters in Physical Education from Western Carolina University, isn't on a special diet, but does have a nutritionist to help him with planning meals and making appropriate dietary decisions. I'm not the type where I'm going to count all my calories, I don't have time for that. I barely have time for myself. Mitchell's two-year-old son, Khi, briefly joined the phone conversation, which led to a discussion of Mitchell's ability to manage his career with his life as a family man: My entire family understands that I'm more than just an athlete. I actually travel all over the world doing motivational speaking for little kids to Fortune 500 companies, and all these different things. They understand that my time is priceless. Time is something that is on everybody's wish list. So, they understand. My son is two, and I've been doing these speaking engagements since before he was born. I'm pretty sure he knows that when daddy doesn't come home, I'm taking care of business. I'm trying to secure his future, my lady's future, and my family's future. They understand. I know it gets rough sometimes. It gets rough for me too, knowing that I'm in another country or another state, and I can't go next door or go to the room and see him when I get there. When we get back, we always make sure we spend a lot of time together. Just like now, we'll have the whole weekend together, then daddy's back to business again. They understand what it takes...the hard work and dedication. The end result is we get to do cool stuff, like go on vacations, so they understand. @ manteomitchell on Twitter or Instagram, you will see him with Khi taking in a football game at Mitchell's former high school, Crest High in Shelby, North Carolina. Mitchell is extremely focused on heath and wellness outside of the track & field arena, as he feels good nutrition combined with physical fitness can extend your life expectancy and add enjoyment to your life. Sex expert in Jodi Arias trial heats up courtroom, credibility under scrutiny Black Friday 2014 deals: Walmart price matching sales early on HDTVs, PS4 The Black Friday deals are starting early, as in tomorrow! While many retailers such as Target and Best Buy are gearing up for great in store and online sales next week, it seems the Walmart Black...Keystone XL pipeline: Will it hurt the fracking industry in Colorado? Sex expert in Jodi Arias trial heats up courtroom, credibility under scrutiny Jodi Arias trial paused as defense files motion to dismiss death penalty...again Top 8 songs to help you express your feelings when you don't have the words Emergency halts Jodi Arias trial, supporters hold hope Jodi is home by Christmas Teacher drags student to pool: WATCH as Calif. teacher manhandles student, 14 <mark>Adam Levine</mark> rips Taylor Swift: Tension on \"The Voice?' Talks Spotify music pull Ricardo Javid Lugo 12-year-old? Teen poses as 12-year-old to lure kids to abuser Family of little girl attacked by dog calls their pit bull a hero Teresa Giudice drops weight from constant worry over jail sentence Tapeworm in brain: Man's brain hosts tapeworm, claustrophobia one odd symptom Yoga pants camera butt: 59 faces ogling woman's butt in strange video campaign Teacher drags student to pool: Video of P.E. teacher\" grabbing' female student Mario Williams plows Kelly's driveway, delivers food to snowed in neighbors"}]