[{"date": "2013-09-02", "url": "http://www.scoop.co.nz/stories/AK1309/S00040/council-in-strong-financial-position.htm", "content": "Council in Strong Financial Position Interim Year End Results Shows Council in Strong Financial Position The South Taranaki District Council is on track to deliver a healthy $12 million surplus for the 2012/13 year compared to a budgeted surplus of $1.57 million according to its Interim Annual Report presented at Monday's (2 September) Policy Development Meeting. STDC Chief Executive, Craig Stevenson says the result shows the Council is in a strong financial position. \"The bulk of the surplus comes from strong earnings from our Long Term Investment Fund. It performed extremely well over the course of the year which has returned almost $8 million more than what we had budgeted. This extra revenue will be returned to the fund to build it up for those years when it doesn't perform so well,\" says Mr Stevenson. \"The really pleasing result is the $1.74 million of operational savings. These savings are largely the result of reduced contractor costs and savings in energy costs,\" he says. \"They demonstrate our commitment to running a lean and efficient organisation and being prudent with every dollar spent,\" says Mr Stevenson. Asset Sale Petition Goes Through: Govt Must Run Referendum As Soon As Possible - Greens The Government has no mandate for their programme of selling profitable state owned assets, Green Party Co-leader Dr Russel Norman said today. The Keep Our Assets coalition, which includes the Green Party, were today informed by the Office of the Clerk that the petition against the sale of New Zealand's state owned assets has the numbers to trigger a citizens-initiated referendum. \"Now that the Keep Our Assets coalition has reached the numbers needed to trigger a referendum on the asset sales programme, the Government needs to organise a referendum as soon as possible,\" Dr Norman said. Wellington: National's Motorways Driving Us To A More Congested Future Conventional Wisdom: NZIER Report Shows Just 18 More Jobs From SkyCity Deal Work For Families: \"Government Discriminates Against Low-Income Children\" <mark>Gordon Campbell</mark>: On The Police Refusal To Prosecute The GCSB The last gift from <mark>David Shearer</mark> to the National Party was his resignation, which has happily diverted the media into weeks of speculation about his successor. In the process, this has taken the heat off Prime Minister John Key over the GCSB. No Action Over Illegal GCSB Spying - Police Letters to Russel Norman The Police Investigation into the GCSB? Legal Beagle? Public Address Ponzi schemer won't be sentenced as he didn't intend to break law Town Hall To Be Restored: Decisions From Christchurch Council Meeting Hagley Oval upgrade and lease approved...Correction of rates setting irregularities...Councillors unanimously agreed the Town Hall should be fully restored, with construction expected to begin in 2014. Botchulism: Contamination Was \"No Risk To Public\" - New MPI Tests Referendum to be held on asset sales; 327,000 voters' signatures on petition Long-haul flights from Paraparaumu and a high-speed train - Jack Yan's 30-year plan 30 peak-hour buses cancelled; \"we are not perfect,\" says Zane Fulljames NZ Bus deserves to lose its contract, says regional council candidate New-technology speed camera checking all lanes in Ngauranga Gorge More motorways will increase traffic congestion in Wellington - report from Opus \"Transformational\" At Hop card to be installed on all city buses in June Police officer among nine people arrested, charged with making and selling drugs PHOTOS: First look inside Auckland's new high-speed electric trains Air Tahiti Nui's revamped A340-300 makes first landing in Auckland Council claiming credit for taking 12,000 cars off Auckland roads every morning", "articleID": "2013090211_00066335_W", "names": {"David Shearer": ["Q22348643", "Q3456546"], "Gordon Campbell": ["Q19560195", "Q21464957", "Q627888"]}}, {"date": "2013-09-03", "url": "http://townhall.com/news/politics-elections/2013/09/03/ap-interview-world-bank-head-looks-at-lebanon-aid-n1690583", "content": "America: Yeah, Immigration Reform Probably Won't Happen This Year | Katie Pavlich Bloodbath: 40,000 Union Members Leave AFL-CIO Over Obamacare | Katie Pavlich Boehner: I Support The President's Call For Action on Syria | Katie Pavlich Unintended Consequences | Thomas Sowell Book: State Department Knew Benghazi Raid Was Terrorist Attack Within Minutes | Guy Benson New Polls: Americans Strongly Oppose Syria Intervention | Guy Benson The Politics of Syria: Does Obama Have the Votes? | Guy Benson WASHINGTON (AP) - The World Bank president says his staff is doing a rush assessment of the impact of the Syrian conflict on Lebanon to prepare the ground for a new wave of international aid. Jim Kim told The Associated Press in an interview on Tuesday that the Lebanese government asked for the quick assessment and the World Bank made a \"very intensive effort\" to get it done in a few weeks. It will be presented during a Sept. 25 meeting of an international support group for Lebanon at the United Nations General Assembly later this month. Democrats Don't Want to See Obama \"Shamed and Humiliated on the National Stage\" Editor-In-Chief of Mises Institute in Canada Advocates \"Slut-Shaming\" WaPo Editors: DOJ Wants to Keep Poor Minorities in Low-Performing Schools New Polls: Americans Strongly Oppose Syria Intervention Pledge of Allegiance on Trial in Massachusetts Majority Vote: Against Federal Involvement in Marijuana Report: Reid Has Votes For Military Resolution in Syria Get Ready for \"Choice: Texas'--The Abortion Video Game Book: State Department Knew Benghazi Raid Was Terrorist Attack Within Minutes No Syrian War to Save Obama's Face! | <mark>Pat Buchanan</mark> Why France is Suddenly America's Best Friend For the Record, or: The Art of Airbrushing History The Wrong Target on WMDs | Mona Charen The Real Heart of the Matter | Marvin Olasky The Weakened President | Cal Thomas Unintended Consequences | Thomas Sowell 5 Reasons Not To Bomb Syria | <mark>John Hawkins</mark> The President Must Personally Make His Case for War Oregon bakery closes doors after state investigates over refusal to cater same-sex wedding Top House Dem: If Congress opposes Syria intervention, Obama must stand down Two new polls: Heavy public opposition to U.S. strikes in Syria <mark>John Bolton</mark> on Syrian resolution:\" I would vote no \"<mark>John Kerry</mark>, just thinking out loud: I can't rule out boots on the ground if Syria implodes <mark>Kerry</mark> Doesn't Want Boots on the Ground Option Off the Table United Nations: Attack on Syria Would be Outrageous War Crime iPhone/Android Apps About Townhall.com Townhall.com is the leading source for conservative news and political commentary and analysis. Townhall is packed with breaking news headlines, political news, and conservative opinion with Townhall columnists including Ann Coulter, Michelle Malkin, <mark>Michael Barone</mark>, Star Parker, Dennis Prager, Thomas Sowell, and many more of your favorite conservatives. Political cartoons full of satire and political humor from editorial cartoonists including Michael Ramirez, Glenn McCoy, and Henry Payne. Townhall.com also features the latest news videos and pictures on the latest political hot topics including health care reform, the economy, immigration, government tax, President Obama, Sarah Palin, Mitt Romney, Herman Cain, Ron Paul, Iraq, immigration, politics, gay marriage laws, and many more big news issues.", "articleID": "2013090406_00060927_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "John Hawkins": ["Q19522517", "Q22563641", "Q30122693", "Q47347909", "Q6238289"], "John Kerry": ["Q22316", "Q6242998"], "Michael Barone": ["Q16197964", "Q19865861", "Q6828446"], "Pat Buchanan": ["Q149127", "Q48700522"]}}, {"date": "2013-09-07", "url": "http://www.sanluisobispo.com/2013/09/07/2670946/former-greenbrier-chef-now-stars.html#storylink=rss", "content": "This Aug. 18, 2013 photo provided by Trium Entertainment shows Lewisburg, W. Va. resident Rich Rosendale, left, with the host of \"Recipe Rehab,\" Evette Rios, at the studios in Calabasas, Calif.. Rosendale, one of TV's newest celebrity chefs, says his greatest challenges come on the set of \"Recipe Rehab,\" a Saturday morning show that will begin airing Sept. 28 on CBS. MORGANTOWN, W. Va. - He's competed in the culinary Olympics, led a team at a global cooking competition in France and produced countless photo-worthy dishes for guests at southern West Virginia's world-class resort, The Greenbrier. But Richard Rosendale, one of TV's newest celebrity chefs, says his greatest challenges come on the set of \"Recipe Rehab,\" a Saturday morning show that begins airing Sept. 28 on CBS. On the show, families submit a favorite high-calorie recipe. Two chefs then compete to crank out healthier, lower-calorie versions - and make them easy for amateurs to duplicate. \"Some of the recipes taste really good, but they're laden with fat and sugar and sodium and calories,\" Rosendale said. \"Every recipe that was on the show, it was like,\" Yikes! This is going to be interesting .' \"Rosendale, U.S. captain for the international competition Bocuse d'Or in France earlier this year, faces off against California chef Vikki Krinsky throughout 11 episodes .\" Though I have a lot of competition experience, she's an expert in nutrition. And here I am cooking with butter, \"Rosendale said .\" But it was an even playing field. \"They shot four episodes a day, a pace requiring snap decisions on how to rehabilitate a meal. The importance of his work was never lost on Rosendale, a native of Uniontown, Pa., who worked in Pittsburgh before opening a restaurant in Columbus, Ohio. In 2009, the now-38-year-old father of two boys moved to Lewisburg in southern West Virginia - a state struggling with an obesity epidemic. In the 2011-12 school year, nearly 28 percent of fifth-graders screened by West Virginia University were considered obese. So are nearly one-third of West Virginia adults, according to the Centers for Disease Control and Prevention .\" There are a lot of great cooking shows out there that are entertaining, \"Rosendale said .\" But if I can do something that's also going to serve a purpose, I want to do that. \"Nationwide, more than 23 million children and teenagers are considered overweight or obese, and Illinois-based Action for Healthy Kids says the numbers are\" trending in a scary direction. \"If childhood obesity isn't curbed, said spokesman <mark>Matthew Smith</mark>, 39 states can expect that more than 50 percent of their adult population will be obese by 2030. And studies show that children are more sedentary than ever, spending hours a day on TV, computers, tablets and phones .\" But TV can still pay a role and does play a role in education, \"<mark>Smith</mark> said .\" Any way we can get a message out that talks about healthy eating, about balanced eating, about active lifestyles...is a positive. \"Rosendale pointed out that many cooking shows focus on dishes beyond either the imagination or skill set of a typical TV viewer,\" So rather than come up with dishes that people probably aren't going to eat, \"he said,\" why not recreate what people are already eating? \"They can still enjoy spaghetti, for example. But\" Recipe Rehab \"explores how store-bought sauces are loaded with salt and how easy it is to make a fresher, better-tasting alternative. At the end of each episode, the chefs illustrate their techniques and offer tips. Rosendale resigned as The Greenbrier's executive chef and director of food and beverage in June to pursue other, unspecified opportunities. Now he acknowledges it was to do the show, which he hopes will continue after this season. Before he left the White Sulphur Springs resort, he launched the 44-acre Greenbrier Farm to produce vegetables for his kitchen. The certified master chef also oversaw the opening of five new restaurants and The Greenbrier Casino Club .\" Recipe Rehab \"- which used to air on ABC - is part of a new\" Dream Team \"programming block that CBS and Litton Entertainment announced last month. It also features\" <mark>Jamie Oliver</mark>'s 15-Minute Meals. \"<mark>Oliver</mark>, too, has a West Virginia connection: In 2010, he produced\" <mark>Jamie Oliver</mark>'s Food Revolution \"in Huntington after a report declared it America's fattest city. He created Huntington's Kitchen, leading classes that teach parents and children about unhealthy foods and healthy cooking. Today, the program is run by Cabell Huntington Hospital. Dr. <mark>Rachel Johnson</mark>, nutrition professor at the University of Vermont and spokeswoman for the American Heart Association, said TV is helpful in conveying a message and teaching skills, but what really counts is the example families set. Healthy food should be readily accessible, attractive and a normal part of the daily diet. Put baby carrots and apples right in front in the refrigerator, <mark>Johnson</mark> said, and a bowl of grapes on the counter. And keep at it. Research shows a child may reject a new food as many as 12 or 15 times. But <mark>Johnson</mark> said that if parents keep offering it, the child will eventually prefer it, whether it's skim milk or bananas .\" Don't give up. Don't force them, but have a rule: You have to taste it, \"she said .\" It is hard not to revert to the chicken nuggets, to the frozen pizza. I know. I'm a mom ....But over time, they will develop a preference for it. \"--Online: Recipe Rehab: http: //reciperehab.com/> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013090722_00077385_W", "names": {"Jamie Oliver": ["Q1405258", "Q190051"], "Matthew Smith": ["Q1909445", "Q21166693", "Q21166696", "Q27074050", "Q3852276", "Q43091034", "Q43370922", "Q47993229", "Q54152850", "Q54596883", "Q55421655", "Q57016178", "Q6791244", "Q6791245", "Q6791246"], "Rachel Johnson": ["Q21066020", "Q7279284"]}}]