[{"articleID": "2018011614_00753321_W", "names": {"Jake Elliott": ["Q22004199", "Q22277691", "Q27928464"]}, "date": "2018-01-16", "url": "http://www.nbcsports.com/philadelphia/eagles/stefen-wisniewski-was-blocking-machine-first-playoff-game", "content": "Standings Stats Video Toward the end of the regular season, the Eagles' offensive line just didn't seem to be hitting its stride. That all changed on Saturday against the Falcons. The Eagles' O-line dominated in the trenches and helped guide the Birds to a 15-10 win to advance to the NFC championship game. What was the line missing down the stretch? Stefen Wisniewski. The starting left guard missed a couple games with an ankle sprain, but returned for the regular season finale. Then, he just happened to have his best game as an Eagle in the divisional round game. It also happened to be the very first playoff game of his career. The 27-year-old Wisniewski had played in 107 regular season games without getting to the postseason--more than any other player on the active roster. When he got his first shot, he certainly made it count. Because Wisniewski didn't just do his job against the Falcons. He was dominant and made things happen all afternoon. Here's a closer look at some of his impressive plays against Atlanta: good-wiz1a. png This first play came on the Eagles' second drive of the game. It's 2nd-and-3 and Jay Ajayi is about to break off an 11-yard gain right behind the hole Wiz opens up. Wisniewski is about to get to the second level after the snap and find linebacker Deion Jones, who is a dynamic player, but is also just 222 pounds. good-wiz1b. png At the mesh point, Trey Burton has come across to take care of the defensive lineman, while Wiz is getting out in front on Jones. He doesn't just block him, he's about to push him back. good-wiz1c. png Ajayi finishes the run strong, picking up 11 pounds. He rode on the back of Wisniewski the whole way. Here's a different angle on the block to get an idea of how far Wisniewski drove Jones back. good-wiz1v. gif • • • good-wiz2a. png These next three plays happened on consecutive downs. They were the last two plays of the first quarter and the first play of the second. Wiz got in a zone. On this one, Wiz is about to take on big Ahtyba Rubin, who weighs 310 pounds. good-wiz2b. png good-wiz2c. png On this zone read play, Ajayi sweeps left, so the entire defensive line shifts that way. Rubin goes with the play, but you can see where Wisniewski opens the hole. He makes it pretty easy on Ajayi. good-wiz2v. gif • • • good-wiz3a. png The very next play is a screen, which has been a big part of the Eagles' offense when it gets clicking. \"The screen game has been something we've worked on the last couple of weeks,\" head coach Doug Pederson said, \"and it had to get better as the season wore on for us.\" On this play, Nelson Agholor is at the bottom of the screen. He's about to come in motion to create some space at the bottom of the screen. That's where Wisniewski is going to get out in front to clear a path for Ajayi. good-wiz3b. png Ajayi is working through the line and is about to settle in his spot to catch the pass from Nick Foles. Meanwhile, Wisniewski gets to the second level to find a hat to block. good-wiz3c. png Then, Wiz just bullies Jones again. He really used that size and strength edge to his advantage and didn't let the quicker Jones get around him. good-wiz3v. gif This was an important play because it showed just how big of a key the screen game could be. A little later you'll get to see Wiz's most impressive play. It came on a screen later in the game. good-wiz4a. png This is the first play of the second quarter. After Ajayi picked up nearly 50 yards in the first quarter, he's on the sideline getting a breather so LeGarrette Blount is on the field. He's gonna run right behind Wiz. good-wiz4b. png Just after the snap, Wiz lends some help to Jason Kelce, who is blocking big 346-pound tackle Dontari Poe. He then turns his attention to Jones, who has become his whipping boy at this point in the game. good-wiz4c. png At this point, Wisniewski has picked up his second block on the play and you can see where Blount is going to find the room to sneak ahead for an 8-yard gain. good-wiz4v. gif • • • good-wiz5a. png This next play comes about a minute later in the second quarter. The Eagles were running all over the Falcons but Foles was having trouble getting into rhythm. Pederson is going to find a way to get the ball into one of his playmaker's hands anyway. Agholor will take the ball on an end around and Wisniewksi is going to make it happen. good-wiz5b. png Lane Johnson swings around to get out in front of Agholor to provide a lead block, but it's Wisniewski who opens the hole. good-wiz5v. gif The Eagles gained 21 yards on this play to get them down the the 3-yard line. This led to their only touchdown of the game. good-wiz6a. png We went in chronological order, which allowed us to save the best for last. Wiz was incredible on this 32-yard screen pass in the fourth quarter. He actually blocks three guys on one play and forces one away from a tackle. Pederson caught the Falcons off guard by running a screen pass to the same side on two consecutive plays. He knew they wouldn't be expecting it. But it was still gutsy to run it on a key 3rd-and-7. good-wiz6b. png Just after the snap, Wisniewski gets enough of a block on Adrian Clayborn to give Foles plenty of time to deliver the ball. It's Wiz's job to let Clayborn through, but if he doesn't get a piece of him, the talented pass-rusher might have been able to blow up the play before it ever got a chance to develop. good-wiz6c. png good-wiz6d. png After getting the block at the line of scrimmage, Wiz gets out in front and takes care of the two defenders that get in his way. It's hard to see it with the photos, so take a look at his incredible play here: good-wiz6v. gif Pretty impressive, huh? This 32-yard screen pass got the Eagles across midfield and they eventually got close enough for <mark>Jake Elliott</mark> to kick a 21-yard field goal to put them up 15-10. It was a huge score because then the Falcons needed a touchdown instead of a field goal. \"I'll tell you, it was just set up perfectly for us and well-executed to have Wiz downfield and block one,\" Pederson said, \"but take out two, obviously helps the play.\" It took Wisniewski a while to prove himself this season. Even though he signed an extension this offseason, the Eagles seemed hesitant to give him the starting left guard spot. Isaac Seumalo was the starter going into the season and Chance Warmack was given the first shot to replace him when he struggled. Eventually, though, Wisniewski got the nod and has been playing at a really high level all season. The Eagles have three Pro Bowl or All-Pro linemen, but without Wisniewski this line just didn't seem to work. With him, they were dominant on Saturday."}, {"articleID": "2015020916_00012088_W", "names": {"Roy Moore": ["Q17466511", "Q27924997", "Q5302905"], "Anthony Kennedy": ["Q11171", "Q59192346"]}, "date": "2015-02-09", "url": "http://www.themalaysianinsider.com/world/article/same-sex-couples-marry-in-alabama-after-us-supreme-court-refuses-stay", "content": "World Same-sex couples marry in Alabama after US Supreme Court refuses stay Same-sex couples began marrying in Alabama after the US Supreme Court refused a request by Alabama's attorney general to keep such marriages on hold. - Reuters pic, February 9, 2015. Same-sex couples began marrying in Alabama on Monday, defying an attempt by the chief justice of the state's Supreme Court to block probate judges from issuing marriages licences to gays and lesbians. A ruling by the US Supreme Court on Monday helped clear the way for Alabama to become the 37th state to allow same-sex couples to marry. Justices refused a request by Alabama's attorney general to keep such marriages on hold until the court rules whether laws banning them are constitutional. \"We wanted to be part of history,\" said Dee Bush, 40, who received one of the first marriage licences issued to same-sex couples in Birmingham, Alabama. She and her partner of seven years, Laura Bush, quickly wed in a park outside the courthouse. Alabama Supreme Court Chief Justice <mark>Roy Moore</mark> had sought to throw up a last-minute roadblock for marriages between gay and lesbian couples. Late Sunday, the socially conservative justice issued an order directing probate judges in his state not to hand out marriage licences to people of the same sex. He said judges were not bound by a federal ruling that last month struck down Alabama's ban on same-sex marriages. US District Court Judge Callie Granade, an appointee of President George W. Bush, ruled in January that Alabama's prohibition on same-sex marriage was unconstitutional, but put her decision on hold until Monday. Two of the US Supreme Court's conservative justices, Clarence Thomas and Antonin Scalia, dissented from the court's decision not to further delay gay marriage in Alabama. In a dissenting opinion, Thomas hinted that the court's actions in allowing marriages to go ahead \"may well be seen as a signal of the court's intended resolution of that question.\" In April, the Supreme Court is set to hear oral arguments in cases concerning marriage restrictions in Michigan, Kentucky, Ohio and Tennessee. A ruling due by the end of June will determine if 13 state bans will remain intact. There has been a legal sea change, thanks in large part to the US Supreme Court. It began in June 2013 when the court struck down a federal law that restricted, for the purpose of federal benefits, the definition of marriage to heterosexual couples. Judges around the country later seized on the language in the high court decision, written by swing vote Justice <mark>Anthony Kennedy</mark>, to strike down a series of state bans."}, {"articleID": "2017030410_00905609_W", "names": {"Fu Ying": ["Q1006996", "Q3090487", "Q45377513", "Q45444262", "Q45537139", "Q45541786"]}, "date": "2017-03-04", "url": "http://hawaiitribune-herald.com/news/world/china-says-defense-budget-rise-about-7-percent-2017", "content": "China says defense budget to rise by about 7 percent in 2017 Published March 4, 2017 - 12:05 am By GERRY SHIH and CHRISTOPHER BODEEN Associated Press BEIJING (AP)--China will raise its defense budget by about 7 percent this year, a government spokeswoman said Saturday, continuing a trend of lowered growth amid a slowing economy. Total defense spending would account for about 1.3 percent of projected gross domestic project in 2017, said <mark>Fu Ying</mark>, spokeswoman for the legislature. She was speaking at a news conference on the eve of the opening of the body's annual session. The precise figure will be provided by Premier Li Keqiang in his address to the National People's Congress on Sunday morning. <mark>Fu</mark> reiterated China's contention that its military was purely for defense and constituted a force for stability in Asia. \"We advocate dialogue for peaceful resolutions, while at the same time, we need to possess the ability to defend our sovereignty and interests,\" <mark>Fu</mark> said. \"The strengthening of Chinese capabilities benefits the preservation of peace and security in this region, and not the opposite.\" Depending on the final figure, this year's budget could mark the third consecutive year of declines in defense spending growth rates. The budget grew by 7.6 percent last year and 10.1 percent in 2015. The increase of about 67 billion yuan ($9.7 billion) would push the total defense budget past the 1 trillion yuan ($145 billion) mark for the first time. The percentage increases do not track in U.S. dollar figures because of variations in the exchange rate. China's defense budget has for years been the world's second largest, although still lagging far behind the U.S. President Donald Trump has asked for a 10 percent increase in U.S. defense spending this year, adding $54 million to the budget that topped $600 billion last year. China points out that, as a developing country with a population of 1.37 billion, its defense spending per capita is a fraction of those of other nations. <mark>Fu</mark> also said the percentage of GDP China spends on defense is below the 2 percent the U.S. calls on NATO allies to spend. \"The gap in capabilities with the U.S. is enormous, but China's military development and construction will continue in keeping with our need to defend our national sovereignty and security,\" <mark>Fu</mark> said. While China insists its military is purely for domestic purposes, it has been spending heavily on technologies allowing it to project power far from shore, including aircraft carriers, long-range bombers and its first overseas military base located in the East Africa nation of Djibouti. Beijing has also come under criticism from the U.S. and others for militarizing man-made islands in the South China Sea, which China claims virtually in its entirety. <mark>Fu</mark> turned those accusations back on the U.S., saying the strategically vital waterway through which about $5 trillion in trade passes each year was basically calm. \"As to how to the situation develops in future, that depends on U.S. intentions. American actions in the South China Sea have a definite significance in terms of which way the winds blow,\" she said. Rules for posting comments Comments posted below are from readers. In no way do they represent the view of Oahu Publishing Inc. or this newspaper. This is a public forum. Comments may be monitored for inappropriate content but the newspaper is under no obligation to do so. Comment posters are solely responsible under the Communications Decency Act for comments posted on this Web site. Oahu Publishing Inc. is not liable for messages from third parties. IP and email addresses of persons who post are not treated as confidential records and will be disclosed in response to valid legal process. Do not post: Potentially libelous statements or damaging innuendo. Obscene, explicit, or racist language. Copyrighted materials of any sort without the express permission of the copyright holder. Personal attacks, insults or threats. The use of another person's real name to disguise your identity."}, {"articleID": "2012011822_00057802_W", "names": {"Natalie Taylor": ["Q56073390", "Q6968250"], "Ryan Smith": ["Q1387139", "Q16980493", "Q24007149", "Q3453858", "Q57908997", "Q7384530", "Q7384532", "Q7384533", "Q7384534"]}, "date": "2012-01-18", "url": "http://westkentuckystar.com/News/Local---Regional/Western-Kentucky/MCU-Inks-Nashville-Central-Christian-s-Taylor", "content": "mcu inks nashville central christian's <mark>taylor</mark> mayfield, ky - mid-continent university women's basketball coach <mark>ryan smith</mark> is pleased to announce he has signed his first player for the 2012-13 season. <mark>smith</mark> and the cougars have landed <mark>natalie taylor</mark> of smyrna, tn, a player who was recruited by two other transouth schools. <mark>taylor</mark>, a 5' 6 \"point guard, played her high school basketball in the middle tennessee area as a member of the nashville central christian warriors where she averaged 13 points and five assists per game. she has been named an all-american in each of her first three years of high school as well. when asked why she chose mid-continent, <mark>taylor</mark> cited several reasons.\" i love the coaching staff, \"she said.\" they were very welcoming, they are serious about their basketball, and they care a lot about their team. the girls on the team are very nice as well, and they know how to play the game. being a strong follower of christ, i love that it is a christian school, and i believe mcu is where god wants me to be, so it is where i want to be. i have been so blessed to find such a great program, and i can't wait to put on that cougar uniform! \"coach <mark>smith</mark> is thrilled to have <mark>taylor</mark> joining the mix for the 2012-13 season.\" we are thrilled to have <mark>natalie</mark> as a part of the lady cougar basketball family, \"he remarked.\" she comes from a tremendous family that has made a commitment to put god first. <mark>natalie</mark> is a smart point guard and will help stretch defenses with her shooting ability. <mark>natalie</mark> is the kind of player that every coach wants on their team and we are excited to have her. \""}, {"articleID": "2017091906_00061969_W", "names": {"Chris Stewart": ["Q1077782", "Q22254232", "Q30084424", "Q4068880", "Q5108164", "Q713526", "Q902651"]}, "date": "2017-09-19", "url": "http://abc30.com/news/police-vehicle-set-on-fire-3-arrested-at-georgia-tech-during-violent-protests/2431215/", "content": "Police vehicle set on fire, 3 arrested at Georgia Tech during \"violent protests' Email share share tweet email ABCNews KARMA ALLEN Monday, September 18, 2017 11:02 PM Three people were arrested and students were ordered to shelter in place at the Georgia Institute of Technology in Atlanta on Monday as violent protests erupted in response to the police shooting death of a student who allegedly had a knife, the university. The protests broke out after a peaceful vigil for Georgia Tech student Scout Schultz, 21, who was fatally shot by police late Saturday night after he called 911 to report an armed and possibly intoxicated suspicious person, authorities said. A police vehicle was set on fire, two officers suffered minor injuries and one officer was transported to a local hospital with non-life threatening injuries during the\" violent protests on campus, \"according to the university. The university estimated that a about 50 people participated in the protests, including some who marched to the the Georgia Tech Police Department immmdiately after the\" peaceful memorial vigil \"for Schultz. At one point, Georgia Tech police ordered students to stay inside and lock their doors, while off-campus students were told to remain off campus.\" Seek shelter in a secure location until further notice. Lock all doors and windows. Take Immediate Action Now, \"the Georgia Tech Department said in a tweet at 9:28 p.m. Monday. Video posted on social media showed a police vehicle on fire and officers pinning people to the ground while witnesses yelled in the background. Police said they restored order by 11 p.m. Monday and gave students the\" all clear \"to resume normal activities. Three people were arrested and charged with inciting a riot and battery of an officer, a university spokesperson said. Police told students to\" expect additional patrols throughout campus tonight \"and asked them to report\" anything suspicious. \"In a statement released through attorney <mark>Chris Stewart</mark>, Schultz's family urged protesters to remain peaceful.\" [W] e ask that those who wish to protest Scout's death do so peacefully. Answering violence with violence is not the answer, \"the statement said.\" Our goal is to work diligently to make positive change at Georgia Tech in an effort to ensure a safer campus for all students. \"\"Scout's family respects the rights of those who wish to voice opposition to what they feel was an unnecessary use of force, but they ask that it be done respectfully and safely,\" the statement added. Earlier on Monday, <mark>Stewart</mark> described Schultz as a loving child who lost his life simply because the police overreacted. He said Schultz was barefoot and \"disoriented,\" in the middle of a \"mental breakdown\" when he was shot. \"Scout should not have been shot,\" <mark>Stewart</mark> told reporters Monday. \"There has to be a bigger value put on taking a human life than fear when you are doing your job.\" <mark>Stewart</mark> also accused the school of handling the situation poorly and pushing a narrative that Schultz was a \"knife-wielding\" threat despite evidence suggesting otherwise. Scout Schultz's father, William Schultz, said Schultz had a 3.9 GPA and was scheduled to graduate in December. Scout Schultz served as president of the Georgia Tech Pride Alliance, and a leading voice within the campus' LGBTQ community. Scout Schultz identified as nonbinary and intersex and prefers to use the pronouns they, them and their, according to the group's web site. Related Topics: abc news national Email share share tweet email (Copyright © 2017 ABC News Internet Ventures .) Load Comments Please enable JavaScript to view comments. Top Stories Breanna Bradford's ex-boyfriend expected to be charged for her death Man pleads not guilty to exposing self at Wild Water Adventures Valley \"Dreamers' scramble to renew application before Oct. 5 deadline UPS expanding Visalia distribution center, bringing dozens of jobs Officials planning to lift all voluntary evacuations caused by the Pier Fire and reopen HWY 190 Tulare County judge denies DA request to recognize TRMC board member Nurses at Kaiser Permanente rally for patient care Trucking company steps up to help two Clovis Unified bus drivers deliver goods to Texas Show More For the first time ever, the UFC is coming to Fresno in December VIDEO: Deadly Queens bus crash caught on camera Amber Alert canceled for 5-year-old Lemoore girl taken from home Car crash takes out power to 3,000 people in Central Fresno Raw video released showing woman found dead in Rosemont hotel freezer More News Photos PHOTOS: Irma's devastation PHOTOS: Railroad Fire chars Giant Sequoias at Nelder Grove Photos of the Railroad Fire Hurricane Harvey heroes More Photos"}, {"articleID": "2020012314_00174048_W", "names": {"David Lipsky": ["Q2746155", "Q5236652"], "Shaun Norris": ["Q16223846", "Q7490930"]}, "date": "2020-01-23", "url": "http://www1.skysports.com/golf/news/12176/11915791/thomas-pieters-holds-one-shot-lead-at-omega-dubai-desert-classic", "content": "Thomas Pieters holds one-shot lead at Omega Dubai Desert Classic By Ali Stafford Last Updated: 23/01/20 2:37 pm Thomas Pieters grabbed the early advantage in Dubai Thomas Pieters impressed in tough scoring conditions to grab a one-shot lead after the opening round of the Omega Dubai Desert Classic. Latest leaderboard Pieters carded eight birdies in a five-under 67 at a breezy Emirates Golf Club, where narrow fairways, thick rough and fast greens meant only 29 players broke par on Thursday. Get the best prices and book a round at one of 1,700 courses across the UK & Ireland location No results found. Please try another search. Search The Belgian holds a narrow advantage over early starter <mark>David Lipsky</mark>, who carded an opening-round 68, while Eddie Pepperell is in the group two strokes shots off the pace and Bryson DeChambeau began his title defence with a two-under 70. DeChambeau cruised to a seven-shot victory in Dubai in 2019 \"I've been working really hard on my putting,\" Pieters told Sky Sports. \"I just wanted to see some progress and I saw that today. Hopefully we can keep that up, but I know I'm hitting it well and I'm looking forward to the next three days.\" Starting on the back nine, Pieters opened with successive birdies and posted further gains at the 13th, 15th and 18th to reach the turn in 32 and top of the leaderboard. Pieters is searching for a first European Tour victory since 2016 Pieters slipped back after following a double-bogey at the first with a dropped shot at the next, only to make three consecutive birdies from the fifth to set the clubhouse target. <mark>Lipsky</mark> mixed five birdies with a sole blemish at the par-three fourth in the morning wave, while <mark>Shaun Norris</mark> held a two-shot lead until he triple-bogeyed the ninth - his final hole - to close out a three-under 69. <mark>Lipsky</mark> started the week as world No 198 Pepperell finished with back-to-back birdies and Kurt Kitayama made a bogey-free start to the week to both join <mark>Norris</mark> in tied-third, as DeChambeau birdied his final hole to get within three of the lead."}, {"articleID": "2014041518_00057267_W", "names": {"Steve Howard": ["Q23670647", "Q2457386", "Q7612886"]}, "date": "2014-04-15", "url": "http://www.edie.net/news/news_story.asp?id=26156", "content": "IKEA announces largest renewable energy investment with US wind farm In 2013, IKEA produced 1,425 GWh of energy from renewable sources, equivalent to 37% of the company's total energy needs IKEA has announced its largest global renewable energy investment to date, purchasing a 98 megawatt wind farm in Illinois, US. Government's new solar strategy aims to turn \"rooftops into power stations' The wind farm is expected to generate up to 380GWh of renewable energy each year - the equivalent amount of electricity to meet the needs of 34,000 average American households. IKEA's chief sustainability officer <mark>Steve Howard</mark> said:\" The US has amazing wind and sun resources that will never run out. We are delighted to make this investment - it is great for jobs, great for energy security, and great for our business. Importantly, it's great for the future of our climate \". The announcement is the most recent in a series of renewable energy investments, seeing the company now committing to own 206 wind turbines worldwide. IKEA has also installed 550,000 solar panels on its buildings in nine countries. In the US, these investments include solar installations completed on 90% of IKEA locations across 20 states, with a total of 165,000 solar panels providing 38MW installed capacity. According to the company, it produced 1,425 GWh of energy from renewable sources, including wind and solar, in 2013 - the equivalent to 37% of the company's total energy needs. As part of its sustainability strategy, the company has allocated $2bn to invest in wind and solar until 2015 to get closer to its goal of producing 100% as much renewable energy as the total energy it consumes by 2020. IKEA also reports that since 2010, the company has saved nearly $55m through energy efficiency efforts in its stores and warehouses. IKEA's forest management certificate was suspended for its operations in Karelia, Russia Simply copy and paste the HTML below to link to this story Energy efficiency - tips for better measurement, control and efficiency We use cookies to make this site as useful as possible. They are small text files we put in your browser to track and assist usage of our site but, with the exception of cookies that help you log in, they don't tell us who you are. Our site also serves third party cookies, including Google Analytics cookies which are used to produce traffic reports and may be used to serve advertising through Google Adwords or another network, after you have left our site."}, {"articleID": "2010100311_00185738_W", "names": {"Mitchell Johnson": ["Q3180617", "Q54569328", "Q6881268"]}, "date": "2010-10-03", "url": "http://gulfnews.com/in-focus/india-australia/virender-sehwag-takes-criticism-on-his-chin-1.690966?localLinksEnabled=false&utm_source=Feeds&utm_medium=RSS&utm_term=Sport_RSS_feed&utm_content=1.690966&utm_campaign=Virender_Sehwag_takes_criticism_on_his_chin", "content": "virender sehwag takes criticism on his chin on several occasions, virender sehwag's slashed cut had sailed over the point boundary and landed into the stands! mohali: india's virender sehwag thrashed the australian attack for a quick half century to equal the world record for the highest number of consecutive half-centuries in test cricket, on the second day of the first test at the mohali cricket stadium here on saturday. however, the australian journalists here have criticised him. according to them, <mark>mitchell johnson</mark>, who had announced he would trap sehwag with his short-pitched deliveries, has succeeded and that the fiery batsman has a weakness against rising deliveries. one of the headlines in a leading australian newspaper said \"<mark>johnson</mark>'s jibe hits home as short ball removes red-hot sehwag.\" sehwag does not seem to be amused by all this. in fact, many bowlers in the past had claimed they would trap him with short-pitched balls outside the off stump and get him caught. and sehwag did fall a few times to such deliveries. but a short-pitched delivery outside the off stump has often been hit for a six by the dashing delhi opener. on several occasions, his slashed cut had sailed over the point boundary and landed into the stands! just before this series against australia, when someone had asked him to comment on the criticism about his batting style, sehwag cited a popular hindi saying which translates into something like this: \"when an elephant walks, many dogs bark, but the elephant keeps walking without showing any importance to the lesser creatures. and that is exactly how i like to deal with my critics.\" email a friend emailing an article to friend is a simple way to share a news item. your friend will receive an email with your name and email address as well any personal message you choose to send. the information you provide on this page will not be used to send unsolicited emails. india v australia fancy yourself as a cricket pundit? try this quiz & see how you score"}, {"articleID": "2020020911_00031548_W", "names": {"Ronnie Wood": ["Q211094", "Q7366031"], "Jo Wood": ["Q39956380", "Q6204445"], "Dean Martin": ["Q5246331", "Q5246333", "Q5246334"], "Jerry Lewis": ["Q294927", "Q472199", "Q6183975"], "John Meyer": ["Q6248589", "Q6248590", "Q6248592"]}, "date": "2020-02-05", "url": "http://feeds.foxnews.com/~r/foxnews/entertainment/~3/KOlWNT1t-fE/audrey-hepburn-oscar-winner-roman-holiday-inspire-hollywood-stars-expert", "content": "close Video Audrey Hepburn, Oscar-winner for \"Roman Holiday,' continues to inspire Hollywood stars, expert says Audrey Hepburn, Oscar-winner for\" Roman Holiday,' continues to inspire Hollywood stars, says pop culture expert Maude Garrett. The beloved classic film is currently available for streaming on Tubi to coincide with the Academy Awards. Audrey Hepburn became a movie star when she won the Oscar for best actress in 1953's \"Roman Holiday\" --and there's no denying the icon is still inspiring Hollywood today. In the beloved romance, Hepburn plays a princess who runs away from her duties but soon finds herself falling in love with a journalist, played by Gregory Peck. Viewers were immediately \"enchanted by her combination of grace, elegance and high spirits,\" the New York Times reported. Hepburn, who also become a fashion muse, made her mark in both the \"50s and\" 60s, captivating audiences with films like 1954's \"Sabrina,\" 1957's \"Funny Face,\" and 1961's \"Breakfast at Tiffany's.\" The actress also became a special ambassador for Unicef, the United Nations Children's Fund, in 1988 and dedicated the rest of her life traveling the world raising money and awareness for the U.N. organization. She passed away in 1993 at age 63 from cancer. LOU DIAMOND PHILLIPS RECALLS RITCHIE VALENS' SISTER BREAKING DOWN ON THE SET OF \"LA BAMBA'\" TOO CLOSE FOR COMFORT' STAR LYDIA CORNELL RECALLS OVERCOMING ALCOHOLISM: \"A RIVER OF TEARS JUST FLOWED' In honor of the Academy Awards, which is taking place on Feb. 9, free streaming service Tubi is highlighting some of the most influential Oscar-winning films, including\" Roman Holiday. \"Fox News spoke with pop culture expert Maude Garrett about why\" Roman Holiday \"continues to be timeless, what really made Hepburn so special, and how she's influencing today's Hollywood stars, including Kim Kardashian. Fox News: What is it about\" Roman Holiday \"that's so Oscar-worthy? Maude Garrett: Oh, my goodness, this movie had everything that embodies what a classic film is supposed to be. It features Audrey Hepburn, who is an icon of the times there.\" FACTS OF LIFE' STAR LISA WHELCHEL EXPLAINS WHY SHE DIDN'T RELEASE MORE MUSIC AFTER HER ’80S SOLO ALBUM Actress Audrey Hepburn affectionately holding Oscar award she won for her performance in the movie \"Roman Holiday' at the Academy Awards ceremony in New York City. (Photo by Ralph Morse/Life Magazine/The LIFE Picture Collection via Getty Images)\" REBEL WITHOUT A CAUSE' STAR SAL MINEO WAS \"ON A GOOD ROAD' BEFORE HORRIFIC MURDER, AUTHOR SAYS And this kind of story I think is the height of Audrey's career, especially because [back then], you still had the men dominating and it was the women that were always in the shadow. That wasn't the case in this movie. So I think that knowing back in the '50s that this was going to be sort of like the template of what an Academy Award-winning movie looked like, it really paved the path. FORMER TEEN IDOL LEIF GARRETT EXPLAINS DESCENT INTO HARD DRUGS:\" THERE HAS ALWAYS BEEN MORE TO MY STORY' Audrey Hepburn gleefully drives a motorscooter on the set of \"Roman Holiday .' <mark>RONNIE WOOD</mark>'S EX-WIFE <mark>JO WOOD</mark> RECALLS PHOTOGRAPHING THE ROLLING STONES OVER THE YEARS:\" THEY DIDN'T NOTICE' Fox News: How do you think Audrey continues to influence Hollywood today? Garrett: It's funny, with that classic look, even big stars that often aren't known for their class, like Kim Kardashian, have borrowed from Audrey's looks before. That infamous photoshoot she did with the champagne popping over her holding the glass, that is actually inspired by Audrey Hepburn. I'm not sure too many people will notice that. She is the queen of the LBD, the little black dress. She's the one that doesn't show much but makes that look incredibly powerful and, to me, sexy. So, I think that she is a style icon that people borrow from every single day. CURLY HOWARD'S GRANDSON DESCRIBES LEARNING HE WAS RELATED TO THE THREE STOOGES ICON: \"NO ONE WOULD BELIEVE US' Kim Kardashian on the cover of Paper magazine. RISQUÉ STORIES WRITTEN BY ED WOOD REVEALED DECADES AFTER FILMMAKER'S TRAGIC DEATH Fox News: Just by this film alone, what makes Audrey so different and special? Garrett: I think that Audrey really understood what star power was. I mean in the '50s, you had Clark Gable, Cary Grant--it was always about the men. And then some women really stepped up in the spotlight, like Katharine Hepburn as well as Marilyn Monroe. They realized what star power was all about, and these women [held] their own against their male counterparts. [Audrey] had this demure look, a look that was very, very innocent. But it was a gaze that held so much power. HUMPHREY BOGART'S EX-WIFE MAYO METHOT STRUGGLED TO BOUNCE BACK IN HOLLYWOOD AFTER DIVORCE, BOOK CLAIMS Audrey Hepburn is still celebrated as a film and style icon. (Getty) <mark>DEAN MARTIN</mark>'S DAUGHTER DEANA RECALLS GROWING UP WITH\" THE KING OF COOL,' THE RAT PACK AND <mark>JERRY LEWIS</mark> Fox News: It's been said that the filmmakers wanted an unknown for Audrey's role. Do you think this was a huge gamble for Hollywood at the time? Garrett: Yes. They didn't know anything about her [but] when she walked in the doors and delivered the lines, they said that on the spot there was no one else. They couldn't envision anything else happening there. She just blew them away. JUDY GARLAND'S EX-LOVER <mark>JOHN MEYER</mark> RECALLS THE STAR'S FINAL TUMULTUOUS MONTHS Audrey Hepburn plays cards with Gregory Peck in a scene from the film \"Roman Holiday,\" 1953. ((Photo by Paramount/Getty Images)) \"30S STAR THELMA TODD\" WAS BECOMING' TIRED \"OF HOLLYWOOD' BEFORE HER MYSTERIOUS DEATH, BOOK CLAIMS When she walked in, they basically booked her on the spot, and they wanted to make her a star. And the fact that she was up against a massive actor and held her own says everything about her. That's why she had such a long-standing career. Fox News: What can you tell us about the Oscar-winning costumes in\" Roman Holiday? \"Garrett: We are talking road trip demure decor here. It is the headscarf. It is the neck scarf. It is getting from A to B looking as fabulous as possible. Even in that era, the clothes were so perfect. But I think that the fact that it's\" Roman Holiday \"and it is traversing over different coastlines, those holiday-esque looks are just beautiful. And Audrey also perfected the updo with the glasses, and so all of that's in there as well.\" 30S STAR GRACIE FIELDS ENDURED PRESSURE TO LOOK GLAMOROUS, \"HAD ALL HER TEETH PULLED OUT,' BOOK CLAIMS American actor Gregory Peck (1916 - 2003) and Belgian-born actress Audrey Hepburn (1929 - 1993) embrace in a still from director William Wyler's film,\" Roman Holiday'. ((Photo by Hulton Archive/Getty Images)) \"40S STAR ROSALIND RUSSELL REFUSED TO PLAY SECOND FIDDLE TO CARY GRANT IN\" HIS GIRL FRIDAY,' BOOK SAYS Fox News: What's your favorite scene from the film and why? Garrett: The kiss! It's always so funny watching classic movies because they have to be very family-conscious with those sorts of moments. And I always love the fact that it's a very family-friendly moment, but they have a lot of chemistry behind it. [When it comes to classics it's] not usually about getting hot and heavy. It's about the moments that they share, and that's what you have in this film. So when it all comes together, that for me is the cherry on the top. ADVERTISEMENT"}, {"articleID": "2019103006_00034973_W", "names": {"Michel Aoun": ["Q3308880", "Q363392"]}, "date": "2019-10-30", "url": "http://www.dailynews.lk/2019/10/30/world/201437/lebanon-pm-resigns-after-mass-protests", "content": "World Lebanon's Prime Minister Saad Hariri has turned in his resignation to President <mark>Michel Aoun</mark>, satisfying one of the main demands of the country's protest movement. The announcement on Tuesday came on the back of 13 days of mass protests demanding the departure of the country's entire political elite amid growing anger over official corruption, poor public services and years of economic mismanagement. \"We have reached a deadlock and we need a shock in order to brave through the crisis,\" Hariri said in a televised statement from the capital, Beirut. \"I'm heading to the presidential palace to tender the resignation of the government. This is in response to the will and demand of the thousands of Lebanese demanding change,\" he added. His address came after a group of people loyal to the Shia Hezbollah and Amal movements attacked and destroyed a protest camp set up by anti-government demonstrators in Beirut. <mark>Aoun</mark> could now either accept Hariri's resignation and begin consultations towards forming a new government, or ask him to rethink. It took nine months to form the Hariri coalition cabinet that took office in January. Hariri's resignation defied the powerful Hezbollah, whose leader Hassan Nasrallah has twice said he was against such a step, citing the risk of a dangerous void. (Source: Al-Jazeera) Tags: Lebanon Prime Minister Saad Hariri Resigns President <mark>Michel Aoun</mark> Protest Movement Visit Kapruka.com Sri Lanka's Largest online shop. Over 125,000 unique categories such as Fresh Flowers, Cakes, Food, Jewllery, Childrens Toys and other Sri Lankan e-commerce categories. Low delivery cost to most cities here and free delivery in Colombo."}]