[{"date": "2013-09-18", "url": "http://www.salon.com/2013/09/18/gop_deludes_itself_on_shutdown_threat/", "content": "Mitch McConnell, John Boehner, Eric Cantor There's a tendency on the right - I don't know if it's delusion or a subtle psychological operation - to speak as if Republicans control the House of Representatives by a wide majority, and that bills supported by 218 Republicans will be viable in the Senate and possibly signed by the president. \"We have a real chance of getting defund or delay of Obamacare,\" said conservative Rep. Steve Scalise, R-La. wrote that the recent turbulence over Obamacare is a result of the fact that \"Republican leaders are struggling mightily to come up with [government funding] legislation that can pass the House .\" If either of these statements were true, it would be huge news that House Republicans are veering further right, and giving hardliners in the party a vote on a bill that actually ties funding for the government to defunding the health care law. But they're both false. Here are the odds that Scalise and his colleagues will defund or delay Obamacare. Costa's so in the thick of the GOP's internal debate he elided the obvious point that \"passing the House\" doesn't equal winning 218 Republican votes. Plenty of reasonable stuff can pass the House above and beyond a simple bill extending funding for the government, once it gets a vote. Put those irreducible facts together, and it's easier to remember that what we're hearing on the right is the din of 275 Republicans and thousands of movement conservatives caterwauling at each other. It's a fascinating story. It's genuinely newsworthy that John Boehner and company were cowed into giving Ted Cruz and his boosters on the right a vote on the doomed strategy they've been demanding. Assuming the defund Obamacare bill passes the House - not a given! - it'll be extremely revealing to watch Senate Republicans figure out what to do with it, and hear what they say when it inevitably fails. But at the end of the day, it's really just a subplot in the ongoing saga of the GOP's devolution since 2006 or so. It's an internal bluff calling, intended to both placate conservative House members, and prove to others that their strategies aren't workable. Once that happens, then Congress can get on with the entirely separate and much simpler business of funding the government. Boehner's already copped to this! If he's able to placate enough Republicans along the way, they might even walk away with a substantial win. In a way this is actually good news. The debt limit will likely be increased through a similar process of internal deleveraging. But when the news broke, a lot of news outlets treated it like an escalation. The odds of a shutdown just increased, according to the political media. The only reason to believe that, though, is that all this whipsawing takes time. Is it possible there just aren't enough days on the calendar for Congress to pass a spending bill before the government shuts down? Perhaps. I continue to think it's unlikely. Twelve days is an eternity on Capitol Hill when leaders get down to brass tacks. Even if I'm wrong, though, and there's a brief lapse in funding for the government, it'll be an error of timing, not of broader legislative strategy. GOP leaders are still working toward a much different set of objectives than their conservative antagonists, or than Newt Gingrich was in 1995. National Review might have forgotten about the 200-plus Democrats in the House, but John Boehner has not. Industry puppets spew obscene lies while people drown Finally! Alabama ends segregated sororities after public shaming Republicans ramp up war on poor people Diane Ravitch: Testing and vouchers hurt our schools. Here's what works \"I scared the crap out of them!\" : Alan Grayson details how to work with the GOP Help, we're drowning!: Please pay attention to our disaster Cutbacks to the stimulus hang over Fed meeting FLOTUS wants you to drink more water Yellen seen as likely Fed nominee after Summers exit Ken Cuccinelli supporter tells Jewish joke at rally Census bureau: Women earn $11,500 less than men annually <mark>Tony Perkins</mark>: Being fair to gay soldiers is unfair to straight soldiers! New York Times legitimizes anti-choice propaganda Why I'm not returning to Zuccotti Park today Gun nuts peddle gruesome lies in face of tragedy Brazil threatens Facebook, Google over Snowden Leak Lone suspect in Navy yard rampage had history of gun arrests Ted Cruz's nightmare: Obamacare helps people! Colorado floods Residents of an apartment house work to divert flood water from their building in Boulder, Colo., on Thursday, Sept. 12, 2013. brandash/Instagram Colorado floods Colorado floods A man begins cleaning up Canon Avenue in Manitou Springs, Colo. after a flash flood burst through a manhole and sent water rushing down the streets Thursday, Sept. 12, 2013. Colorado floods A couple plays in flood water at Utah Park in Aurora, Colo., on Thursday, Sept. 12, 2013. ekohlfeld/Instragram Colorado floods \"Meanwhile in boulder - it's flooding so we are going to tube down the streets\" wrote Instagram user ekohlfeld. jvaleski/Instagram Colorado floods Colorado floods This image provided by Jason Stillman, shows flooding in Lyons Colo., Thursday Sept. 12, 2013. Boulder County Sheriff Joe Pelle said the town of Lyons was completely cut off because of flooded roads. krbsmith211/Instagram Colorado floods Instagram user krbsmith211 captioned this photo: \"so this used to be lyons\". Colorado floods This image provided by Jason Stillman, shows flooding in Lyons Colo., Thursday Sept. 12, 2013. Boulder County Sheriff Joe Pelle said the town of Lyons was completely cut off because of flooded roads. Colorado floods Residents of a neighborhood on the northern side of Boulder, Colo., work to divert floodwaters away from their homes on Thursday, Sept. 12, 2013. Autorities say flooding in the area has washed out roads, left rural communities isolated and is responsible for at least three deaths. myohmyemily/Instagram Colorado floods \"Well there goes my running path. Thanks, #Boulderflood\" wrote Instagram user myohmyemily. raulfox31/Instagram Colorado floods Obama Calls On CEOs To Help Avoid Debt Ceiling Battle With Republicans OMG, You Guys, Allison Janney Did \"The Jackal' On Arsenio...Everything Is Going To Be Ok! Under Secretary <mark>Patrick Kennedy</mark> and His\" Expeditionary Diplomacy' in Benghazi New Hampshire Senate Candidate: More Women In The Workplace Led To More Mass Shootings Rand Paul's Mom Says He Won't Announce Presidential Decision Until \"After 2014\" Young Members Of Congress Team Up To Create \"Future Caucus\" Torturing Animals At These Places Isn't Illegal, But It Is Illegal To Film It Patton Oswalt's Tale Of Catastrophic Failure Is Hilarious. And Surprisingly Inspiring. One Of The Best Comebacks I've Ever Heard Was Made In A Single Word Why Is One Fast Food Restaurant Paying Double The Minimum Wage? Copyright? 2013 Salon Media Group, Inc.. Reproduction of material from any Salon pages without written permission is strictly prohibited. SALON? is registered in the U.S. Patent and Trademark Office as a trademark of Salon Media Group Inc. .", "articleID": "2013091822_00097126_W", "names": {"Patrick Kennedy": ["Q16105663", "Q17541361", "Q247915", "Q7146936", "Q7146939"], "Tony Perkins": ["Q16193791", "Q5135408"]}}, {"date": "2013-09-18", "url": "http://venturebeat.com/2013/09/18/google-glass-is-shattering-6-months-after-launch-multiple-reports-of-breakage-and-breakdowns/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Google Glass appears to be living up to its name. At least, the latter half of it. The sexy prototype augmented reality devices are unexpectedly fragile, breaking down with some degree of regularity after just a few months of use. \"First, a few weeks ago the side of the prism started to delaminate,\" <mark>Chris Barrett</mark> of PRserve told VentureBeat. \"Then I wore Glass to Made in America festival two weekends ago and...the trackpad stopped working. You could still manually take photos, you could still use voice commands, but you couldn't swipe .\" <mark>Barrett</mark> told me about the Glass issues about a week ago, but I didn't think much of it until I saw on Facebook that the most famous Glasshole, Robert Scoble, also recently experienced a breakdown. He posted that the mirror on the prism of his Google Glass \"totally disintegrated\" due to a sticker he put on the end of it, and bemoaned the fact that he was \"contextless in New York\" for a week while awaiting a replacement. \"The prism problem seems to be happening to a other people...and this was only after about 70 days of daily use,\" <mark>Barrett</mark> told me. The question is: How long should Google Glass last, out of the box? What might be acceptable for the \"Explorer\" edition which is in the hands of a few thousand people is one thing, but what consumers who buy them in the millions expect is probably quite another. Google seems to be pretty good about replacements - you send Glass back to Google in a box they mail you, and they'll send you a new pair if the damage wasn't self-inflicted - but the problems also seem to be fairly widespread. A quick Twitter search for \"Google Glass broken\" brings up dozens of recent results. Most of them, of course, are self-inflicted: Well this isn't good. Just pulled my Google Glass out of my bag to find this. Anybody broken theirs yet? Still works. pic.twitter.com/9UkFqR783b - <mark>Tim Stevens</mark> (@ Tim_Stevens) June 20, 2013 That appears to be at least partially the fault of an inadequate case, which one broken Glass victim called \"a cowboy accessory of gray flannel that is closer to a hard-toed sock than to the Bulgari satin-lined jewelry box that would seem to suit fancy Google Glass .\" photo-1 photo-2 broken g Source: <mark>Chris Barrett</mark> broken google glass Source: <mark>Chris Barrett</mark> IMG_1509 Previous 1 of 5 Next Previous Slides Next Slides X photo-1 But <mark>Barrett</mark>'s delamination and trackpad failures - which he attempted to treat with rice, wondering if it had gotten wet - and Scoble's prism disintegration suggest that there are other issues at play, including ones of product quality. I supposed that's not a big shock, given that this is a prototype device, as a Google representative mentioned as he gave me this statement: \"We're in the Explorer phase of Glass's development, so we're eager to hear back from users about their experiences with both the hardware and software. The more feedback we get, the better we can make Glass ahead of our wider consumer launch in 2014 .\" In addition, Google is replacing almost all non-functioning Glass devices for free - although the company will put a $1,500 hold on your credit card while you still have your old Glass in hand. The only occasions it won't do that, the company says, is when the device was damaged deliberately or via lack of care. <mark>Barrett</mark> agrees, saying that \"Google customer service is top notch .\" However, Glassholes who don't want to spend $1,500 on a new pair might want to invest in a more secure case than Google's default version.", "articleID": "2013091903_00040340_W", "names": {"Chris Barrett": ["Q16198009", "Q5105823", "Q5105824"], "Tim Stevens": ["Q1779960", "Q7804335"]}}, {"date": "2013-09-19", "url": "http://www.oilandgaseurasia.com/en/news/cnpc-help-develop-14bil-junin-10-oil-project-venezuela", "content": "China's CNPC will work with Venezuela's state oil company PDVSA to develop the Junin 10 block in the South American country's Orinoco extra heavy crude belt, the Venezuelan petroleum minister said on Wednesday. The Orinoco region holds one of largest oil reserves in the world, and PDVSA is working on projects there with foreign partners including Italy's ENI, Spain's Repsol and Russia's Rosneft. \"We agreed with CNPC to develop a new project in the Junin 10 block...to produce 220,000 barrels per day with investment of $14 billion,\" <mark>Rafael Ramirez</mark> said on Twitter. The minister, who is in China ahead of an official visit to Beijing by Venezuelan President Nicolas Madurothis weekend, did not immediately give additional details of the CNPC deal. PDVSA began early crude production at Junin 10 last year, operating the project solo after failing to reach an agreement with France's Total and Norway's Statoil. Last week, Malaysia's Petronas said it was quitting a different large project in the Orinoco after what sources close to the venture said were disagreements with PDVSA and the Venezuelan authorities. Apache To Sell Selected Canadian Oil And Gas Assets For $112 Million In Two Transactions July-August 2013 The Great Game Arctic Style - Uncovering Riches Under the Ice Gazprom Takes on South America With New Venture in Bolivia", "articleID": "2013091918_00026254_W", "names": {"Rafael Ramirez": ["Q2127006", "Q5442567", "Q7282286"]}}, {"date": "2013-09-21", "url": "http://www.sportskeeda.com/2013/09/21/mark-hughes-i-wont-let-arsene-wenger-complain-about-my-teams-playing-style/", "content": "Dont have an account? Register Here <mark>Mark hughes</mark> and Arsene Wenger are old foes Stoke City manager <mark>Mark Hughes</mark> has stated that he will not give Arsenal boss Arsene Wenger a chance to complain about his team's \"rugby' playing style when they play each other tomorrow, The Daily Star reports .\" We are a different team in the way we approach the game, \"said <mark>Hughes</mark>.\" I think Arsenal have got twice as many bookings as us, in any case. \"Manchester United striker is keen to end Arsenal's good form this season but is happy that midfielder Aaron Ramsey has found his form. He said:\" For various reasons, I watched Arsenal a lot last season and Aaron was struggling. He has come back (from his broken leg against Stoke) and is now playing well. \"But <mark>Hughes</mark> said,\" Whenever the sides meet, it is a topic of conversation but I do feel that it is time to move on. The boy has returned to a level that is better than he was at before. Now he's probably one of the first names on the team sheet in a fine side that have a real chance of winning the title. \"Top five d? butantes to watch out for at Brazil 2014 FIFA World Cup Youtube? 2010-2013 Absolute Sports Private Limited.", "articleID": "2013092115_00017075_W", "names": {"Mark Hughes": ["Q1494363", "Q214513", "Q21516094", "Q3294110", "Q33676880", "Q39073279", "Q58235929", "Q6768131", "Q6768132", "Q6768133", "Q6768134", "Q6768135", "Q6768136", "Q6768137"]}}, {"date": "2013-09-25", "url": "http://www.denverpost.com/politics/ci_24170331/cruz-vows-speak-till-he-cant-against-obamacare?source=rss", "content": "WASHINGTON-Tea party conservative Sen. Ted Cruz ended his all-night talkathon to dismantle President Barack Obama's health care law after 21 hours and 19 minutes as the Senate pushed ahead to a test vote Wednesday on a bill to avert a government shutdown. Weary after a day and night on his feet, Cruz simply sat down at 12 noon EDT, the predetermined time for the Senate to adjourn, as several of his colleagues applauded. Senate Republicans and some House members congratulated the Texas freshman. As Cruz' allotted speaking time was nearing its end, he offered to skip the initial vote and shorten debate on the underlying stopgap spending bill that's required to avert a government shutdown after midnight on Monday. The Senate's top Democrat, Majority Leader <mark>Harry Reid</mark>, said the vote would go ahead as planned. <mark>Reid</mark> shrugged off Cruz' effort. \"For lack of a better way of describing this, it has been a big waste of time,\" <mark>Reid</mark> said. Since Tuesday afternoon, Cruz-with occasional remarks by Sen. <mark>Mike Lee</mark>, R-Utah, and other GOP conservatives-has controlled the Senate floor and railed against Obamacare. At 10:41 a.m. EDT Wednesday, Cruz and his allies reached the 20-hour mark, the fourth-longest Senate speech since precise record-keeping began in 1900. That exceeded March's 12-hour, 52-minute speech by Sen. Rand Paul, R-Ky ., like Cruz a tea party lawmaker and potential 2016 presidential contender, and filibusters by such Senate icons as Huey Long of Louisiana and <mark>Robert Byrd</mark> of West Virginia. With no food or restroom breaks, his tie finally loosened, Cruz was helped by eight of his conservative allies who gave him brief respites by asking lengthy questions as permitted under Senate rules, though he was required to remain on his feet. Cruz said he has learned that defying party leaders is \"survivable,\" adding, \"Ultimately, it is liberating\" and that his long evening involved \"sometimes some pain, sometimes fatigue .\" But he added, \"You know what? There's far more pain in rolling over ....Far more pain in not standing up for principle .\" Republican leaders and several rank-and-file GOP lawmakers had opposed Cruz's time-consuming effort with the end of the fiscal year looming. They fear that Speaker John Boehner and House Republicans won't have enough time to respond to the Senate's eventual action. Two financial deadlines loom-keeping the government operating after Oct. 1 and raising the nation's borrowing authority. In a letter to Congress on Wednesday, Treasury Secretary Jacob Lew said the government will have exhausted its borrowing authority by Oct. 17, leaving the United States with just $30 billion cash on hand to pay its bills. That's a slightly worse financial position than Treasury predicted last month and it adds to the pressure on Congress to increase the government's borrowing cap to avert a first-ever U.S. default on its obligations. Determined to pressure the Democrats, Republicans have raised the possibility of adding a one-year delay to the individual mandate of the health care law to any legislation to raise the borrowing authority. Paul, who has questioned Cruz's tactics, gave the admittedly tired Texan a respite Wednesday morning by joining the debate and criticizing Obamacare. But in a reflection of the limited GOP support for Cruz' effort, no members of the Senate leadership came to the Texan's aid. Cruz did, however, get help through the wee hours of the morning from <mark>Lee</mark>. <mark>Reid</mark> downplayed the significance of Cruz's speech after arriving at the Capitol Wednesday morning. \"He raised some money with the tea party folks,\" <mark>Reid</mark> said. \"That's what it's all about .\" The House-passed measure is required to prevent a government shutdown after midnight Monday and contains a tea party-backed provision to \"defund\" implementation of what's come to be known as \"Obamacare\". Cruz is opposed to moving ahead on it under debate terms choreographed by Democrats to defeat the Obamacare provision. The mechanics of advancing the bill were overshadowed by Cruz's speech, which included a reading of Dr. Seuss' \"Green Eggs and Ham\" to his daughters back home in Texas. \"When Americans tried it, they discovered they did not like green eggs and ham and they did not like Obamacare either,\" Cruz said. \"They did not like Obamacare in a box, with a fox, in a house or with a mouse. It is not working .\" Senate rules are working against Cruz, who also has angered many GOP colleagues who complain privately that the freshman has set impossible expectations at the expense of other Republicans. Some of Cruz's leading allies include organizations like the Senate Conservatives Fund and the Club for Growth, organizations which frequently donate money to conservatives challenging more moderate Republicans in primaries. At issue is a temporary spending bill required to keep the government fully open after the Oct. 1 start of the new budget year. Hard-charging conservatives like Cruz see the measure as an opportunity to use a must-pass measure to try to derail Obama's signature health care law. Under pressure from Cruz and tea party activists, House GOP leaders added the anti-Obamacare language to the funding measure despite fears it could spark a partial government shutdown that could hurt Republicans in the run-up to midterm elections next year-just as GOP-driven government shutdowns in 1995-96 help revive the political fortunes of President Bill Clinton. \"I just don't believe anybody benefits from shutting the government down, and certainly Republicans don't,\" said Sen. Orrin Hatch, R-Utah. \"We learned that in 1995 .\" Cruz took the floor at 2:41 p.m. Tuesday, vowing to speak until he's \"no longer able to stand .\" Wearing black athletic shoes, he filled the time in a largely empty chamber, criticizing the law and comparing the fight to the battle against the Nazis. He talked about the Revolutionary War, the Washington ruling class and his Cuban-born father who worked as a cook. Missing from the debate were top Republicans like Senate Minority Leader Mitch McConnell of Kentucky and Cruz's home-state GOP colleague John Cornyn, who say that on a second vote later this week, they will support ending Cruz's effort to derail the funding bill. That vote is crucial because it would allow top <mark>Reid</mark> of Nevada to kill the Obamacare provision on a simple majority, instead of the 60 votes often needed for victory. Democrats control the chamber with 54 votes. \"I think we'd all be hard-pressed to explain why we were opposed to a bill that we're in favor of,\" McConnell told reporters Tuesday. \"And invoking cloture on a bill that defunds Obamacare...strikes me as a no-brainer .\" The overnight debate included some diversions. Despite his tenacity, Cruz did not surpass the longest Senate speech on record, a 24-hour, 18-minute filibuster by South Carolina Sen. Strom Thurmond against the civil rights act in 1957. Read this. Note: Our article pages automatically refresh every ten minutes. We cannot change this. If you start writing your comment on this page, please refresh the page before you do so - this will reset the ten-minute counter (your comment will be saved for you while you register). It's quick (it takes about 30 seconds) and we only require your email and name. Comments that include Use the \"Report Abuse\" link when necessary (you don't have to be a member, or be logged in) Lars Ulrich is keeping things in perspective when it comes to his band's new film, \"Metallica: Through the Never .\" Marvel's Agents of S.H.I.E.L.D.' is most buzzed-about fall show", "articleID": "2013092523_00055157_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Mike Lee": ["Q21064126", "Q30122331", "Q55622025", "Q627098", "Q6847648", "Q6847650", "Q6847651", "Q6847652", "Q6847653"], "Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"]}}, {"date": "2013-09-26", "url": "http://ntdaily.com/four-games-in-standout-football-players-this-season/", "content": "Sports> Four Games In: Standout football players this season The Mean Green football team has hit a break point in its schedule. After four non-conference games, certain players are already beginning to stand out from the pack. Offensive Standout Senior quarterback <mark>Derek Thompson</mark> has already led UNT (2-2) on comebacks against University of Ohio (3-1) and Ball State University (3-1), finishing the win against Ball State. \"He is clearly the most improved player on the offense and we've just scratched the surface,\" head coach Dan McCarney said. \"He's really confident, showing a lot of maturity in the pocket by making better decisions with the ball .\" During the offseason, <mark>Thompson</mark> slimmed down to help provide another aspect at the quarterback position by running the ball. Through four games, <mark>Thompson</mark> is third on the team in total rushing with 79 total yards, including a career-high 26-yard touchdown run that was the game-winning score. Senior wide receiver Darnell Smith leads the team in receptions, receiving yards and touchdowns. Teams have been focusing extra attention on Brelan Chancellor, but might have to rethink their strategy given Smith's production on the opposite side of the field. Defensive Standout Senior linebacker Zach Orr takes his team captain role very seriously while leading the Mean Green defense. \"Coach gave us a mission to force more turnovers this year and to be a great defense,\" Orr said. \"Every day at practice we work on stripping the ball and falling on it .\" Orr is the heart and soul of the defense, leading the team with 42 tackles and adding two forced fumbles and two fumble recoveries. McCarney said the defense starts with Zach Orr and that he can be named MVP of the football team just about every week. Zach Orr may be the captain, but junior safety Lairamie Lee has been his second-hand man so far. His role in coming forward into the box and stopping the run game has helped the defense play as well as it has. The Mean Green defense has become something to behold. The UNT defense is in the top 10 teams in turnover margin, top 15 in opponent red zone conversions and leads the nation in takeaways. Many of the fumbles are thanks to hard-hitting safeties junior Lairamie Lee and senior Marcus Trice, who have become a key to watch when the UNT defense takes the field. \"They're not the biggest players on the field, but if you're not running like you're supposed to, they're going to hit you hard,\" senior running back Brandin Byrd said. \"I've been hit by both of them many times in practice and you learn quickly to keep your head on a swivel when they're around .\" <mark>Derek Thompson</mark> had peaks in previous seasons, but has never strung together four solid games like he has so far this year. His improved consistency is a huge factor in UNT's 2-2 record. Most Exciting Player McCarney said the team's most exciting player award so far goes to senior wide receiver Brelan Chancellor. He was awarded Conference USA Special Team Player of the Week after recording a 99-yard kick return touchdown against Georgia, and is fourth in the nation in punt return yards. \"He's such a dynamic playmaker. That's what we missed so much last year when he broke his collar bone,\" head coach Dan McCarney said. \"He's motivated for a lot of reasons. It's his senior year, he has great pride and he wants to leave a real legacy behind in the return game .\" No disagreement here. Chancellor is worth the price of admission all by himself. Tim Cato, Sports Editor contributed to this story. Golf teams in action for first time since beginning of September Golf teams in action for first time since beginning of September Golf teams in action for first time since beginning of September", "articleID": "2013092623_00012682_W", "names": {"Derek Thompson": ["Q23777638", "Q45099198", "Q5262402", "Q5262403", "Q5262404"]}}]