[{"articleID": "2009042107_00028817_W", "names": {"Dave Davies": ["Q364890", "Q5228642"], "Brian Tierney": ["Q4965476", "Q4965479"]}, "date": "2009-04-21", "url": "http://philly.com/r?19=961&43=167721&44=43327407&32=3796&7=195372&40=http%3A%2F%2Fwww.philly.com%2Fdailynews%2Flocal%2F20090421_Ch__11_judge_rejects_hiring_law_firm_but_approves_probe_of_recording.html", "content": "posted on tue, apr. 21, 2009 ch. 11 judge rejects hiring law firm but approves probe of recording by <mark>dave davies</mark> philadelphia daily news a bankruptcy judge has rejected a request by the owners of the daily news and inquirer for permission to hire a law firm to investigate the unauthorized taping of a november meeting between the company and its creditors. but judge jean fitzsimon yesterday asked a committee of unsecured creditors to look into the incident, in which philadelphia newspapers ceo <mark>brian tierney</mark> discovered that vincent devito, an executive of the new york investment firm cit group, was recording the meeting. cit is among the senior lenders who hold the company's secured debt. it's the unsecured-creditors group that can now investigate the incident. according to participants at the november meeting, devito apologized and stopped taping after <mark>tierney</mark> told him that taping without permission is illegal in pennsylvania. <mark>tierney</mark> has since pressed for a further inquiry to determine if other meetings were taped and if confidential information might have been shared with others. \"we're very pleased that the judge agreed with us that this is a very serious matter that needs investigation,\" <mark>tierney</mark> said after a hearing yesterday in which he testified about the meeting. <mark>tierney</mark> said that after he made an issue of the taping in november, negotiations with the company's creditors took a sharp turn for the worse, and led to his decision to file for bankruptcy protection in february. creditors opposed <mark>tierney</mark>'s proposal to use company money to hire the law firm of elliott greenleaf & siedzikowski to investigate, and were pleased that fitzsimon denied the request. fitzsimon said that she wanted the company and its creditors to stay focused on resolving their financial issues, and said that the taping controversy could be \"one of the sideshows\" that distract attention from that effort. because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to"}, {"articleID": "2019032214_00347250_W", "names": {"Ron Morgan": ["Q16745423", "Q20273714"]}, "date": "2019-03-21", "url": "http://ktvl.com/news/local/portlands-dovelewis-animal-hospital-to-be-featured-on-new-tv-show-animal-er-live", "content": "Portland's DoveLewis animal hospital to be featured on new TV show \"Animal ER Live' by KATU Staff File photo by Gia Goodrich A A PORTLAND, Ore.--A local animal hospital will soon be starring in a new show on National Geographic Wild that follows veterinarians as they rush to save injured pets. The network is launching a new TV series called\" Animal ER Live, \"and one of the emergency rooms featured will be DoveLewis in Northwest Portland. The hospital is a nonprofit and treats animals around the clock.\" It's gonna be groundbreaking television that's gonna allow us to pull back the curtain a little bit and show people what happens live in an animal ER on a busy Saturday and Sunday night, \"said <mark>Ron Morgan</mark>, President and CEO of DoveLewis The show runs for two hours and is completely live. It will take camera feeds from 7 different animal hospitals across the U.S. as emergencies begin to unfold. The show premiers on Saturday, March 30 at 6 p.m. on Nat Geo Wild. Unmute"}, {"articleID": "2010012820_00018781_W", "names": {"Saddam Hussain": ["Q16210000", "Q7397653"]}, "date": "2010-01-28", "url": "http://gulfnews.com/arts-entertainment/visual-arts/takes-on-face-value-1.575132", "content": "an arab and a european artist negotiate different roads to arrive at a common destination by jyoti kalsi, special to weekend review \"the path' by abdulnasser gharem. this installation was the artist's subtle but powerful way of questioning the assumptions people often make 3 abdulnasser gharem and al braithwaite come from different backgrounds. gharem was born in khamis mushait, a small town in saudi arabia, and continues to live and work there. his art is rooted in his environment and the people around him. al braithwaite is based in london but has travelled extensively around the middle east. his art aims to bridge cultural divides. but in their own unique ways, each artist challenges accepted norms, ideas and systems in our society and encourages people to re-examine their beliefs and choices. gharem is quite unique, not just as a conceptual artist in saudi arabia but also because he juggles his artistic work with his career as a major in the saudi arabian army. after joining the army he got the opportunity to study at the al miftaha arts village, where he discovered his talent for painting. an invitation to participate in the sharjah biennale exposed him to contemporary art, motivating him to become a conceptual artist. one of his first major successes was a project titled the path, centred around a bridge near his home. during a storm in the area, many people sought refuge on this bridge, believing that the concrete structure would keep them safe. but the bridge collapsed, resulting in the loss of many lives. a year later, gharem got together friends and relatives of those who died and spent three days spraying the words\" al siraat \"(the spiritual path) all over the broken bridge that leads nowhere. besides being an emotional tribute to the dead, this was gharem's subtle but powerful way of questioning the things people trust implicitly and the path they choose. fragility of concrete a video and photographs of that performance are part of gharem's latest exhibition titled restored behaviour. in this show, he explores and questions our trust in certain materials, structures and ideas through a series of installations and paintings created from rubber stamps. here, concrete is used as a symbol of things that we believe to be safe, immovable and absolute and the rubber stamps are a clever reference to bureaucracy and the authority of its accoutrements. and the ever-present grey and yellow markings similar to those on the roads in saudi arabia denote the path we are on. gharem's installations of lightboxes with detour signs, concrete roadblocks and diversions marked in grey and yellow playfully comment on the way we navigate our lives, blindly following rules and regulations laid down by those in authority, with the assumption that they are leading us on the right path. his paintings are witty and thought-provoking. for instance, in a painting titled obama, he uses the advertising slogan for a well-known american brand of children's shampoo to ask whether obama's election will really result in\" no more tears \"for the arab world. and in another painting titled no, no, no, yes, he uses words from palestinian poet mahmoud darwish's poem as a subtle allusion to the things we can and cannot do. as a soldier, gharem is often the one setting up roadblocks and enforcing rules and regulations; but as an artist, he exhorts people to question these routes and rules rather than accept them without thinking.\" life is a kind of stamped contract since the time you are born. you have religion, it's a contract. you have a wife, it's a contract; and between countries there is a contract for trading. but i want people to think about every contract and choice they make in life and to not be misdirected into having a false sense of security regarding certain materials and ideas. ultimately i want to question whether we as individuals, as cultures, as societies are following the right path or whether we should trust in a path at all, \"gharem says. while gharem's message is subtle, braithwaite's work is direct and in-your-face. the young artist is fascinated with the middle east. in 2002, he joined off screen, a group of european artists who travelled in the region holding art workshops and joint exhibitions with local artists. he thus has a good understanding of the middle eastern ethos and thinking. he uses it to confront western stereotypes and biased views and tries to present a balanced perspective on contemporary issues through his art. his latest work, titled hall of mirrors, is a playful and profound statement on the realignment of power in the 21st century. it includes a series of portraits of political leaders and other iconic figures from the middle east. the artist has used the 18th-century eglomise technique to etch the portraits behind mirrors. rather than firm lines, his portraits are composed of childish scrawls made with crayons, marker pens and pencils. but the scratchy mirror paintings are framed in antique gilt frames from the height of europe's imperial past. the rich, ornate frames, sourced from auctions and antique dealers, remind you of paintings of royalty seen in european palaces and manors. but the grand oil paintings of those emperors and generals of the past have been swapped with braithwaite's naïve, airy portraits of personalities such as muammar gaddafi, ayatollah khomeini, reza shah pahlavi, caliph ali ibn abu talib, haifa wehbe, osama bin laden and <mark>saddam hussain</mark>. the artist describes this quirky juxtaposition of the orient and occident, old and new, and ornate and sketchy as\" reverse colonisation \". allusion to regime change\" the world is changing rapidly and people are torn by a conflicting sense of identity and responsibility on issues ranging from climate change to the war on terror. this series comments on the changing reality and our struggle to reconcile the past with present geopolitical situations. showing these antique european frames occupied by middle eastern power barons is an experiment in regime change. europe has a history of colonisation and by recolonising history, i am trying to restore the balance and relieve postcolonial stress by shearing off some of the west's tentacles and puncturing european vanity, \"braithwaite says.\" i used mirrors because i wanted the message to be direct and in-your-face. quite literally, this work holds up a mirror to society to see how it looks and feels when daoud successfully slingshots a piece of rubble into the eye of goliath. \"email a friend emailing an article to friend is a simple way to share a news item. your friend will receive an email with your name and email address as well any personal message you choose to send. the information you provide on this page will not be used to send unsolicited emails."}, {"articleID": "2013100401_00013085_W", "names": {"Steven A. Cohen": ["Q22662502", "Q590212", "Q7614420"]}, "date": "2013-10-03", "url": "http://economictimes.indiatimes.com/news/international-business/citigroup-fined-30-million-after-analyst-sent-report-to-sac-others/articleshow/23474617.cms", "content": "At Modi event, students told to vote out Congress Narendra Modi played listener, mentor and motivational speaker to 7,000 college students at an event that appeared to have been scripted by BJP. Take Brand India to the world: Narendra Modi to admen, marketers Panjab University beats 4 IITs, enters top 400 club Making its debut in the elite club, Panjab Univ joins the group of univs ranked between 226-250, putting it way ahead of its closest Indian rival IIT Delhi. IITs will take nearly 10 years to get to ideal teacher-student ratio Can Rahul Work in a Coalition Matrix? Investor's guide: Dhirendra answers investment queries EOW raids Financial Tech's head office: Sources Market cues for tomorrow's trade by experts Investor's guide: Dhirendra answers inve...EOW raids Financial Tech's head office:...He introduced the Samsung smartwatch - a wearable tech device that acts as an extension to the...Citigroup Inc will pay a $30 million fine after one of its analysts improperly sent confidential research on an Apple supplier to big clients including <mark>Steven A. Cohen</mark>'s hedge fund Citigroup analyst Kevin Chang emailed unpublished research about Hon Hai Precision Industry Co, a major supplier of Apple Inc iPhones, to SAC, GLG Partners, according to William Galvin, Massachusetts' Secretary of the Commonwealth. Apple's iPhones in the first quarter of 2013, which would have had a detrimental effect on Apple, the regulator said. SAC, hedge fund Citadel and mutual fund firm T. Rowe Price all sold Apple stock after receiving the information from Chang, a complaint filed by Galvin's office alleges. At $30 million, the Massachusetts fine is both one of the biggest state securities regulators have ever collected and 15 times the $2 million they fined Citi for improperly disclosing research on Facebook's initial public offering only a year ago. Galvin said the fine is so high because the case came less than one year after the Facebook case and illustrates that aspects of Citi's supervisory culture failed. \"The Citi analyst should not have been that accessible to the clients, he should have been better protected by the compliance team,\" Galvin added. Galvin's office had filed civil charges against Citi for \"failing to supervise\" , and the $30 million fine is the result of a settlement, he said. No criminal charges were filed. A spokeswoman for Citi said the bank takes \"regulatory compliance requirements very seriously and train (s) all of our employees about these obligations.\" She declined to give further details about the case. Chang, who worked for Citi in Taiwan, was terminated last month, the complaint said. The Massachusetts settlement also offers new details about how SAC employees worked at a time the $14 billion hedge fund has come under increased scrutiny about its trading practices. The insider trading charges against SAC in July. The hedge fund said it has done nothing wrong and pleaded not guilty to the charges. Galvin said he would be happy to cooperate with federal or other state authorities probing SAC. \"The emails between Kevin Chang and the hedge funds reveal this cozy culture which illustrates again that there are two types of customers; big ones and retail customers who often dont' receive this information,\" Galvin said in a telephone interview. The complaint cites an email from an unidentified SAC employee who asked a contact at Citi \"can u send me everything u have on the entire iphone 4/4s/5 supply chain?. Citi employees responded immediately by asking their colleagues\" can you please send directly to (employee for SAC Capital)... He needs it asap - works directly for (SAC Capital).' Chang was also contacted directly by a SAC employee. \"Hey Kevin, Are you picking up any order cuts to iPhone?\" the email said. Kevin Chang sent his unpublished research which included the Hon Hai numbers and unpublished research for Apple iPhone order forecasts to the SAC employee on December 13, 2012. Chang's research was published on December 14. A SAC spokesman said he has no comment on the matter. Chang also received emails from Citi colleagues saying that other big clients, including Citadel, wanted his views on Apple. A Citadel employee emailed Chang on December 13 saying \"Can we do a quick call tonight?\" In the securities industry, Galvin, who has been in the job for 18 years, has a reputation as an aggressive regulator happy to take on Wall Street banks in order to protect small, private investors. In 2011, NEXT STORY Japan sales tax hike \"welcome first step': Christine Lagarde Have something to say? Post your comment Have something to say? Post your comment"}, {"articleID": "2010021403_00001550_W", "names": {"Linda Evans": ["Q15993617", "Q234478", "Q28037349", "Q3241335", "Q43124639", "Q6551548"]}, "date": "2010-02-14", "url": "http://kelowna.com/2010/02/13/josie-evans-remembered-with-prayer-and-balloons/", "content": "josie <mark>evans</mark> remembered with prayer and balloons saturday, february 13th, 2010 | 6:48 pm josie <mark>evans</mark> mother, <mark>linda evans</mark> (centre) and josie's two brothers quin (left) and jesse (right) let off white and purple ballons in honour of the teenager who was struck and killed by a truck along bottom wood lake road in lake country. (photo adrian nieoczym) tears and hugs flowed as friends and family of josie <mark>evans</mark> gathered to remember the fallen and much loved teenager. about 60 people attended the simple but moving ceremony this afternoon, held next to the spot where she she was killed. <mark>evans</mark> died one month ago today, when she was hit by a truck as she walked home from school along bottom wood lake road in lake country. darkness was falling when she was struck and her death has elicited cries from the community, demanding that sidewalks and better lighting be installed along the roadway. \"it's important to remember properly so that during the week we can get on with our normal lives,\" said josie's mother, <mark>linda evans</mark>, who described the last month as \"pretty tough.\" as for how she wants people to remember her daughter, <mark>evans</mark> said, \"as a humble but helpful person who was kind, who was learning to use positive energy to change the world around her.\" sadie meise, who said josie <mark>evans</mark> was her best friend, has been collecting signatures on a petition calling on the local government to make the roadside safer for pedestrians. so far over 3,000 people have signed. asked whether she is hopeful that she will see action taken on the safety concerns, meise replied, \"i'm sure we will.\" one of josie's brothers, quin <mark>evans</mark>, 22, said the tragedy of his sister's death has brought his family closer together. \"it's terrible that it had to take something like this to do it but we're all hanging out more and everyone's trying to be a better person,\" he said. after a short prayer, the participants let off dozens of white and purple helium filled balloons. \"you believe they can go right up to her in the sky,\" said meise. \"they're purple because that was her favourite colour.\" a memorial bursary fund in josie <mark>evans</mark> honour has been set up with the central okanagan foundation. donations can be made by mailing a cheque to the central okanagan foundation at #217 - 1889 springfield road, kelowna, bc v1y 5v5 or by friends of josie <mark>evans</mark> give each other comfort. (photo adrian nieoczym) josie <mark>evans</mark> mother <mark>linda evans</mark> ties balloons to the memorial while josie's brother jesse <mark>evans</mark> looks on. (photo adrian nieoczym) josie <mark>evans</mark> friends letiecia hayes and miranda roache by the memorial for <mark>evans</mark>. josie <mark>evans</mark> mother <mark>linda evans</mark> ties balloons to the memorial while josie's brother jesse <mark>evans</mark> looks on. (photo adrian nieoczym) sylvia loewen leads a prayer in honour of josie <mark>evans</mark>. josie <mark>evans</mark> mother <mark>linda evans</mark> ties balloons to the memorial while josie's brother jesse <mark>evans</mark> looks on. (photo adrian nieoczym) this entry was posted on saturday, february 13th, 2010 at 6:48 pm and is filed under news. you can follow any responses to this entry through the"}, {"articleID": "2019092017_00037491_W", "names": {"John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"]}, "date": "2019-09-20", "url": "http://www.bordercountiesadvertizer.co.uk/news/national/17917528.jeremy-corbyn-rules-coalition-event-hung-parliament/", "content": "Jeremy Corbyn rules out coalition in event of hung parliament By Press Association 2019 Labour 0 comment Labour will not enter into coalition government with other opposition parties if it is unable to win an overall majority at the next general election, Jeremy Corbyn has said. On the eve of the party's annual conference in Brighton, the Labour leader said they would look to force an election once it was clear a no-deal Brexit was off the table. However in a round of ITV regional news interviews, he said if there was a hung parliament and they were unable to achieve an overall majority, Labour would seek to govern as a minority government. Labour leader Jeremy Corbyn said he would not be part of a coalition (Gareth Fuller/PA) \"We would go into government with whatever election result was. I am not doing deals. I am not doing coalitions,\" he told UTV. Mr Corbyn rejected the idea that Labour could offer the SNP a second referendum on Scottish independence in order to win its support at Westminster. At the same time however, he refused to rule out a further public vote later in the parliament if there was a demand for one in Scotland. \"It is not our priority. It is not what I want, it is not what I support,\" he told Border TV. \"But if after some years in government there is a demand, then in terms of the devolution settlement we will look at it at that time.\" Speaking on STV, he added: \"Obviously in the longer run, if a request is made...I am not going to be the one who stands in the way of that.\" His comments came after shadow chancellor <mark>John McDonnell</mark> sparked a furious row over the summer when he suggested a Labour government would not stand in the way of a referendum if there was support for one in the Scottish Parliament. The leader of Scottish Labour, <mark>Richard Leonard</mark>, said at the time the 2014 referendum had been a \"once-in-a-generation vote\" and that the Scottish people did not want to go through a second independence poll. Mr Corbyn said that he would press for a general election once it was clear that Boris Johnson could not force through a no-deal Brexit against the wishes of Parliament. \"When the Prime Minister abides by the law which Parliament has passed which requires him if he cannot get a deal to apply for an extension, I think that is the time,\" he told ITV Anglia. \"What we won't do is to fall into some trap created by Boris Johnson which would lead us into a no-deal Brexit with all the chaos that would bring.\" Mr Corbyn defended his position of seeking to negotiate a new Brexit deal with Brussels and then putting it to the public in a referendum along with the option to remain in the EU, without coming down on either side. He rejected criticism that his policy was a \"muddle\" and that he was failing to offer leadership on an issue of crucial national importance. \"I am not sitting on the fence,\" he told YTV. \"I think leadership comes from listening. I think leadership comes from asking people to look at the realities of the situation.\" It is not a muddled position. It is a position that takes the issue seriously. \"Speaking on Tyne Tees, he added:\" We need a democratic mandate from the people. What I will be campaigning for is to make sure the British people have that decision. \"0 comment"}, {"articleID": "2014041621_00037279_W", "names": {"Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"], "Amit Shah": ["Q19946588", "Q4746875", "Q4746876"]}, "date": "2014-04-16", "url": "http://www.hindustantimes.com/elections2014/state-of-the-states/mulayam-slams-ec-for-ban-on-azam-khan-speeches/article1-1208876.aspx", "content": "Mulayam slams EC for ban on <mark>Azam Khan</mark> speeches Samajwadi Party chief Mulayam Singh Yadav on Wednesday condemned the Election Commission for banning election campaign speeches by prominent Muslim leader of the state <mark>Azam Khan</mark>, saying the poll watchdog was \"taking impractical decisions sitting indoors\" . <mark>Khan</mark> had told an election rally in Ghaziabad on April 4 that the Indian soldiers who won back Kargil were Muslims. Narendra Modi aide <mark>Amit Shah</mark> from making poll speeches in the state. <mark>Shah</mark> had exhorted a gathering of Hindus in Muzaffarnagar, which was hit by religious riots last year, to take revenge for the riots through voting. Addressing a rally in Agra, Yadav accused the commission of being unaware of the ground realities of politics. He said there was nothing wrong in <mark>Khan</mark>'s speeches. \"Muslims have made supreme sacrifices for the nation. One such example is that of Abdul Hameed (martyred in the 1965 India-Pak war),\" he said. Yadav also slammed the National Commission for Women (NCW) on serving a notice on him for a controversial remark on rape. He described the notice as an insult to him. \"I am being painted as anti-woman when, in fact, I have gone to prison to safeguard women's rights. Yet, notices are being served on me by the Women's Commission,\" he said. In Moradabad last week, he had said death penalty was too harsh for those found guilty of rape. Referring to the Shakti Mills rape cases in Mumbai, where death penalty was awarded to the three accused youths who were repeat offenders, Yadav had reportedly said \"boys err at times\" . \"I had only talked against fake cases,\" he clarified in Agra on Wednesday. He called for action against those lodging fake cases of sexual assault. \"I have given the reply to the notice served on me. It is a strong one. A counter is awaited,\" he informed the gathering at CTO ground in Agra. Happening in 2014 LS elections: Priyanka Gandhi hits headlines more than ever before Priyanka Gandhi targets Varun, says Lok Sabha elections not a family tea party Varun Gandhi says Priyanka has crossed lakshman rekha of decency"}, {"articleID": "2013071622_00070058_W", "names": {"Nitish Kumar": ["Q122304", "Q7041330"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"], "Kapil Dev": ["Q16200677", "Q558189"]}, "date": "2013-07-16", "url": "http://www.firstpost.com/politics/bjp-questions-nitin-kumar-on-jdus-support-on-food-security-ordinance-960571.html", "content": "Challenge Congress to debate on development, governance: Venkaiah Clarke called Watson a cancer on Australian team, says Mickey Arthur I-League's JSW sign two players with experience in English football Anti-Sikh riots case: Delhi HC rejects Sajjan Kumar's plea against retrial Bihar to build 1,000 higher secondary schools every year: <mark>Nitish</mark> Solar Scam: HC reserves order on bail plea of Chandy's former secy The UK's proposed Rs 2.7 lakh visa \"deposit' is all about poli...Defence ministry clears MDL-Pipavav JV sans preferential treatment Murthy's return signals admission of failure by Infosys; can he do a Steve...Penalty notice of Rs 650 cr leaves us no choice but to litigate: Bharti Airtel Slowdown is here to stay: After Maruti, M & M lays off temporary staff With 100% FDI in telecom Sibal hopes to make sector more attractive Lost your job? Worry not. Here's how to create a second stream income Rupee effect: Trusts become more sensitive in doling out scholarships India vulnerable to deadly MERS virus, but no screening at airports yet Fashion designers Dolce and Gabbana sentenced to jail for tax evasion Movie review: Nawazuddin Siddiqui, Huma Qureishi steal the show in\" Shorts...Journey to <mark>Michael Jackson</mark>: Listen to Cory Monteith's top five Glee songs Rolling Stones make their first appearance at Glastonbury festival No big deal: Rajasthan CM Gehlot is not the only one buying Facebook likes Instagram will now let users embed photos, videos across the web BlackBerry Q5 in India for Rs 24,990: What we like and don't like about it BlackBerry Q5 review: Solid phone, but is Rs 24,990 too steep a price? Will Nokia Lumia 1020 kill Samsung S4 zoom? Critics say it could Here's a list of NaMo's plans for India and Rahul Gandhi's rep.. . Apple conspired with publishers to fix ebook prices, rules judge New Delhi: Amid reports of a growing proximity between its old ally JD (U) and Congress, BJP today asked Bihar Chief Minister <mark>Nitish Kumar</mark> if his party will support the Food Security Ordinance when it is launched by the UPA government on Rajiv Gandhi's birth anniversary. Continuing with its jibes against <mark>Kumar</mark> on the issue of his increasing closeness to Congress, a party he had been criticising for 17 years when the JD (U) was a part of NDA, BJP said the Bihar chief minister should come clear on whether he is allying with Congress. <mark>Kumar</mark> has already welcomed the move to bring the food security legislation while BJP is opposed to some provisions of the ordinance which is already in place. \"We will not oppose the Food Security Bill when it comes up for discussion and passage in Parliament but we want the loopholes in the bill to be removed,\" BJP spokesperson Shahnawaz Hussain said. <mark>Nitish Kumar</mark>. PTI He maintained that a democratic country functions on the basis of people's mandate (as reflected in the opinion of Parliament) and not through ordinances. Congress has lost this mandate, he added. Hussain said the ordinance route for food security is wrong. \"Only the Congress ruled states and Bihar are supporting the Food Security Ordinance. Will the JD (U) government implement it in Bihar if it is inaugurated on the birth anniversary of Congress leader Rajiv Gandhi (August 20)?\" he Bihar to build 1,000 higher secondary schools every year: <mark>Nitish</mark> Firstpost encourages open discussion and debate, but please adhere to the rules below, before posting. Comments that are found to be in violation of any one or more of the guidelines will be automatically deleted: Personal attacks/name calling will not be tolerated. This applies to comments directed at the author, other commenters and other politicians/public figures Please do not post comments that target a specific community, caste, nationality or religion. While you do not have to use your real name, any commenters using any Firstpost writer's name will be deleted, and the commenter banned from participating in any future discussions. A document from a file received by the Home Minister reveals that 26/11 conspirator David Coleman Headley did know about Ishrat Jahan. The Modi-phobia of some groups of people has hijacked the discourse on post-2002 Gujarat. But inside Gujarat, Muslims are coming to terms with Modi, and so far 178 different groups of Muslims have met him to take forward their development dialogue. BlackBerry Q5 review: Solid phone, but is Rs 24,990 too steep a price? The big question though would be whether the price tag of Rs 24,990 would be seen as too expensive for a price-sensitive market like India where Android smartphones with far better specs on paper retail for less. TOI Crest shuts down: when TV can sell to niche audiences why can't print? Circulation shrank, the cover price stayed static and the advertisers went away, first in a trickle and then in a flood. Ishrat Jahan case: Is Satish Verma a crazed conspiracy theorist? In a letter to the government, former home ministry bureaucrat RV Mani alleges Verma claimed 26/11 and 13/12 were government conspiracies. Isn't Broad as guilty of cheating as Ramdin? Cricket is not a gentleman's game any more and there are a few good men around, but Broad is certainly not one of them. Samsung Galaxy S4 mini to cost Rs 27,990, available from Thursday The Samsung India online store has put the Samsung Galaxy S4 mini up for pre order on its online store at a price tag of Rs 27,990 Decoding the Modi Q & A with Reuters throws up some pointers on where he is not at his best. His spin doctors have a lot of work to do on his rough edges The first thing everyone recalls when they hear \"Pran\" is the look that was almost his trademark: a raised eyebrow, a piercing gaze and sneer-curled lips. A friend of the great Pakistani short-story writer Sadat Hasan Manto and the only villain who commanded more respect (and fatter pay cheques) than heroes, Pran was a proper [...] <mark>Kapil</mark>, Tendulkar or Dhoni: Who is India's greatest ODI cricketer? That is a stunning record and it makes one wonder where Dhoni ranks among India's finest ODI cricketers; where does he rank in comparison to Sachin Tendulkar and <mark>Kapil Dev</mark>; what is his standing...Did BJP just get endorsed by one of India's leading intellectuals? Did the BJP get its first mainstream media endorsement in Pratap Bhanu Mehta's IE column? Mumbai train blasts: Why the real perpetrators may never face justice In 2008, a man called Sadiq Israr Sheikh told the police and intelligence services he had carried out the 7/11 bombings. His claims were dismissed by the Mumbai Police, though official documentation obtained by Firstpost show police in three states and the central intelligence services found them credible. 2014 polls: Why Cong will look to alliances and not Rahul Gandhi The BJP is looking at a Rahul vs Modi style Presidential style 2014 Lok Sabha campaign, but the Congress strategy is very different. Movie review: Bhaag Milkha Bhaag is a near-flawless homage to the Flying Sikh Faster conviction in case of politicians would help cleanse the system better. Who's going to ensure that? Till today we don't know about the truth of Narendra Modi's alleged complicity in the Gujarat communal riots or the encounter deaths. Therefore it would prudent to hold our judgment on him. India's softly-softly approach to the latest instance of Chinese border provocation in Ladakh shows that it has not learnt one important lesson: rolling over and playing dead is a bad strategy to take on Chinese aggression on the border. Leaked to al-Jazeera yesterday, the findings of Pakistan's Commission of Inquiry into the raid which killed Osama will occupy journalists and historians for years. The BJP's defensiveness on Ishrat Jahan and its missteps on the Ram Temple show that the Congress has shifted focus away from its own failures. Sikhs' new fight in America: The US Army Sikhs have truly been path breaking pioneers into the west. They have taken the burden of difference on themselves in way most other Indian immigrants have not had to. While other desis could assimilate in some fashion, Americanize themselves in ways, Sikhs stood out."}, {"articleID": "2020032304_00035263_W", "names": {"Jennifer Rubin": ["Q434795", "Q6178769"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2020-03-22", "url": "https://www.msn.com/en-us/news/elections-2020/is-it-tokenism-or-representation-how-to-think-about-joe-bidens-promises-to-nominate-women/ar-BB11v85G?srcref=rss", "content": "Former vice president Joe Biden fully committed in Sunday's debate to picking a woman as his vice presidential candidate if he is the Democratic Party nominee. And he made a commitment to nominate a black woman to the Supreme Court if he is elected president. © Matt Rourke/AP Democratic presidential candidate Joe Biden, accompanied by his wife, Jill, speaks to members of the media at the National Constitution Center in Philadelphia on March 10. In 1984, the Democratic Party became the first major political party to have a woman as the vice presidential candidate, in Geraldine Ferraro. But no president has ever nominated a black woman to the Supreme Court--a move that Biden hopes will make his candidacy more attractive to black women, one of the most influential demographics on the left. The legality of only considering women for these spots appears to be clear--it's permissible. But some critics have criticized the move as pandering and tokenism. The Democratic field started off with more diversity than any other in history, and some voters on the left expressed great disappointment that the last two candidates standing look like the overwhelming majority of individuals who have occupied the White House: straight, white men. Subscribe to the Post Most newsletter: Today's most popular stories on The Washington Post During the CNN debate this week, Biden said: I commit it that if I'm elected president and have an opportunity to appoint someone to the courts, I'll appoint the first black woman to the courts. It's required that they have representation, now it's long overdue. Secondly, if I'm elected president, my Cabinet, my administration will look like the country. And I commit that I'll pick a woman to be vice president. There are a number of women who are qualified to be president tomorrow, I would pick a woman to be my vice president. A moderator asked Sen. Bernie Sanders (I-Vt .) whether he would commit to doing the same. \"In all likelihood, I will,\" he said. \"For me, it's not just nominating a woman. It is making sure that we have progressive women and there are progressive women out there, so my very strong tendency is to move in that direction.\" There was plenty of praise for the news. Some, like conservative Washington Post opinion writer <mark>Jennifer Rubin</mark>, praised Biden for taking the lead on the issue. Keneshia Grant, a political science professor at Howard University, told The Fix that she thinks Biden making these commitments is a good thing if his goal is to win the support of more black voters. \"I think the party has to learn from 2016--or I hope it learns--is that you can't take turnout for granted, especially among black people,\" she said. \"When black people turn out, they will likely turn out for Democrats, but you actually have to work on the numbers.\" \"I can imagine it being about women, but I can also imagine it's about excitement, about giving something additional for voters to be excited about,\" Grant added. \"It's one thing to say turnout needs to be high against <mark>Donald Trump</mark>, but I think it will also be helpful to give people something new, historic and hopeful to turn out for--and I think this might do that.\" Others, including women, dismissed the conversation as pandering and pointed to conservative and moderate women in high places of leadership supporting policies that they believe harm other women. Ashley Ray-Harris, a comedian and freelance writer based in Los Angeles, told The Fix that Biden's commitment felt like pandering because it was obvious. \"Two candidates telling me that they're considering women isn't a shock to me,\" she said. \"They absolutely should be.\" \"We know women can do this,\" Ray-Harris added. \"To me, that Sanders was more concerned with policy and who would actually be the right woman or fit would be more of a concern than Joe Biden just saying he'd pick a woman.\" And others addressed the idea as tokenism with some suggesting that the move will subject the woman to accusations of being hired for their gender. Despite the varied responses, promising to nominate a woman to the Supreme Court is not unheard of--or unique to liberals. No less a conservative than Ronald Reagan did similar. While seeking the White House in 1980, Reagan sought to improve his chances with women voters and those who perceived that the GOP was becoming less welcoming to women by promising to nominate a woman to the Supreme Court. \"I am announcing today that one of the first Supreme Court vacancies in my administration will be filled by the most qualified woman I can possibly find,\" he said. \"It is time for a woman to sit among the highest jurists.\" He did follow through on that, nominating Arizona Court of Appeals Judge Sandra Day O’Connor. Reagan's nomination of O’Connor is a reminder that while controversial, promising to consider only members of one gender for such a powerful position is nothing new. Jamal Greene, a professor at Columbia Law School, whose scholarship focuses on the structure of legal and constitutional argument, told The Fix: There's no law, there's not statute that applies to this situation. The only questions would be: Is it unconstitutional for him to do it? And that's a question that's unlikely to reach a court because he has so much discretion in his decision-making that there'd be no person who can show he'd been injured by this act. The same goes for Biden's promise to name a woman as his vice presidential candidate, if he is the Democratic Party nominee. \"The vice president can make whatever promises he wants,\" Greene said. \"He's a private citizen. He doesn't work for the government. He can make any promise he wants without it running afoul of the Constitution, and there is no law that applies to people nominating their VP that I'm aware of.\" Legal experts have said it would not be legal to promise a specific person a job, as it could be considered a bribe. On the topic of tokenism, Greene said there are ways for Biden to add more women's voices to the highest levels of government without accusations of choosing someone solely because of her gender. What one considers to be tokenism is very subjective. I think a lot depends on how you frame this kind of decision. If it's framed as \"I don't care who the candidates are. I'm going to look for a black woman,\" I think that's different framing from \"There's a lot of qualified candidates for the Supreme Court and I think it's important to look at the kinds of people who have not been looked at in the past, so I'm going to focus on African American women knowing there's a range of qualified options\" is a different framing. Biden being direct in promising to nominate a woman is not that surprising to those who have been following the issue. I previously reported on the issue. At this point, perhaps the biggest question for voters on the left is: Who? Read More"}, {"articleID": "2018110721_00421812_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "John Mcentee": ["Q11727943", "Q28741861", "Q6247725"], "Gary Cohn": ["Q5524866", "Q5524867", "Q5524868"], "Tom Price": ["Q1415243", "Q18737190", "Q21622399", "Q2439995", "Q40284708", "Q6379460", "Q7817278", "Q7817279", "Q9023595"], "Katie Walsh": ["Q28600075", "Q6377580"], "Michael Flynn": ["Q15712142", "Q25599009", "Q27922514", "Q57046897", "Q6830352", "Q6834757"]}, "date": "2018-11-07", "url": "http://www.bromsgroveadvertiser.co.uk/news/national/17208464.youre-fired-notable-departures-from-donald-trumps-white-house/", "content": "<mark>Donald Trump</mark> waving 0 comments With US attorney general Jeff Sessions announcing he is standing down at the request of <mark>Donald Trump</mark>, we take a look at some of the other high-ranking officials who have departed from the White House--either voluntarily or by being sacked by the president .--November 7: US attorney general Jeff Sessions resigns as the country's chief law enforcement officer, saying the move came \"at Mr Trump's request\" .--October 9: Mr Trump announces UN Ambassador Nikki Haley's resignation, effective at end of the year. Saddened to hear @ nikkihaley will resign her post at the end of the year. A terrific Ambassador, Haley has stood up for American interests and championed democratic values around the world. I wish her well in whatever success comes next! pic.twitter.com/oMlj4gFjby--Ambassador Johnson (@ USAmbUK) October 9, 2018--August 29: The president announces that White House counsel Don McGahn would leave sometime in the autumn .--July 5: Environmental Protection Agency Administrator Scott Pruitt--June 5: Communications aide Kelly Sadler--April 12: Deputy national security adviser Ricky Waddell--April 11: Deputy national security adviser Nadia Schadlow Gen McMaster, Dina Powell and Nadia Schadlow did extraordinary job building national security strategy around President Trump's principles--Newt Gingrich (@ newtgingrich) December 6, 2017--April 10: Homeland security adviser Tom Bossert--March 28: Veterans Affairs Secretary David Shulkin--March 22: National security adviser HR McMaster--March 13: Secretary of State Rex Tillerson (PA Graphics)--March 12: Special assistant and personal aide to the president <mark>John McEntee</mark>--March 6: Economic adviser <mark>Gary Cohn</mark>--February 28: Communications director Hope Hicks--February 7: Staff secretary Rob Porter--December 13, 2017: Communications director for the White House Office of Public Liaison Omarosa Manigault Newman ❗ ️ Official Statement from my Publisher @ simonschuster @ GalleryBooks on TRUMPs attempt to stop publication of #Unhinged https: //t.co/iS0wlhAYfb--OMAROSA (@ OMAROSA) August 16, 2018--December 8, 2017: Deputy national security adviser Dina Powell--September 29, 2017: Health and Human Services Secretary <mark>Tom Price</mark>--August 25, 2017: National security aide Sebastian Gorka--August 18, 2017: Chief strategist Steve Bannon Steve Bannon behind White House senior adviser Jared Kushner and then-chief of staff Reince Priebus (Stefan Rousseau/PA)--July 31, 2017: Communications director Anthony Scaramucci--July 28, 2017: Chief of staff Reince Priebus--July 21, 2017: Press secretary Sean Spicer A friend of mine and a man who has truly seen politics and life as few others ever will, Sean Spicer, has written a great new book, \"The Briefing: Politics, the Press and the President.\" It is a story told with both heart and knowledge. Really good, go get it!--<mark>Donald</mark> J. Trump (@ realDonaldTrump) June 30, 2018--May 30, 2017: Communications director Michael Dubke--May 9, 2017: FBI Director James Comey--March 30, 2017: Deputy chief of staff <mark>Katie Walsh</mark>--February 13, 2017: National security adviser <mark>Michael Flynn</mark> 0 comments"}]