[{"articleID": "2018081719_00177767_W", "names": {"Earl Jones": ["Q1628498", "Q2899402", "Q5325944", "Q55610368", "Q969854"]}, "date": "2018-08-17", "url": "http://www.newsobserver.com/news/local/counties/wake-county/article216897850.html#storylink=latest_side", "content": "August 17, 2018 03:40 PM Raleigh Shrouded in black, taller than some children and tucked into a corner on City Plaza downtown, the covered object is out of place. But what's underneath is a musical treat for the brave who dare look under the cover. In an attempt to make downtown Raleigh a little bit more fun, the city placed a piano along Fayetteville Street on Friday afternoon. The hope is that it will stay there for at least a few months and that passersby will play a tune or stop to listen. \"It's a toy,\" said Jen Baker, the city's downtown coordinator. \"I hate to refer to a great musical instrument like that as a toy, but it's really just for fun. SIGN UP\" It's just another opportunity to interact, \"Baker said.\" It's not social media. It's real life. And it's one more way to enjoy downtown Raleigh. \"Before city staff could load the piano stool off the truck, Kristeena Yates started to play. She'd just finished her shift at nearby Jimmy John's and one of her coworkers watched behind her. Yates also plays the guitar, and she insists she only dabbles with the piano.\" There is a piano up here, \"<mark>Earl Jones</mark> said as he walked along the street. <mark>Jones</mark> plays guitar, bass and keyboard and sometimes performs downtown for free. He'd like to make some money, he said, but he wasn't willing to pay the city for a busking permit.\" I think it's cool, \"he said of the piano.\" It'd be great if people want to play the piano and bring a guitar and bass out here. \"Raleigh bought two pianos from the Habitat for Humanity ReStore for $175. While one is on Fayetteville Street, the other will be painted by the Glenwood South Neighborhood Collaborative and placed in that part of downtown. Anyone who wants to donate more musical instruments for downtown can use the social media hashtag #TeamDowntownRaleigh or email teamdowntownraleigh @ raleighnc.gov."}, {"articleID": "2009030222_00021720_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Mike Williamson": ["Q459959", "Q6849288"]}, "date": "2009-03-02", "url": "http://watfordobserver.co.uk/sport/localsport/4166000.DeMerit_doubt_for_Plymouth_encounter_/", "content": "jay demerit may be a doubt for tomorrow's long trip to plymouth argyle when resurgent watford bid to win a fourth consecutive league game for the first time since october 2007. the hornets skipper limped out of saturday's 2-0 victory over crystal palace in the 55th minute with what <mark>brendan rodgers</mark> said was a \"tight calf\" . \"he had a little problem during the week and i think he had a similar thing about a year ago where he felt it and he went on with it and then he tore his calf muscle,\" the manager said afterwards. \"so i've said to him in our work\" we just need to be careful. if you feel it just starting to tighten, let us know', and i think that's what happened. \"i just need to check with the medical team to be 100 per cent, but at this moment i think he's just got a tight calf. it was precautionary that we took him off because we've got other players that can come in and do a good job.\" the captain has been key to the hornets' improved defensive form, but if he is ruled out of the game at home park, <mark>rodgers</mark> could start with the same back four that finished saturday's game. this would see adrian mariappa link up with <mark>mike williamson</mark> in the centre of defence, with lloyd doyley moving across to right-back and harley returning to the starting line-up at left-back. ng_watford, watford says...2:12 pm mon 2 mar 09 i thought harley when he came on was excellent...i thought harley when he came on was excellent...dmuz, bushey says...2:15 pm mon 2 mar 09 shame if he is unfit to play. has been a new player since the arrival of <mark>mike williamson</mark>. just shows what a steady centre half next to you can do for your confidence. shame if he is unfit to play. has been a new player since the arrival of <mark>mike williamson</mark>. just shows what a steady centre half next to you can do for your confidence. wfc4ever, watford says...3:53 pm mon 2 mar 09 at the fans forum <mark>rodgers</mark> pretty much said demerit needed a number 1 leader type defender next to him as <mark>williamson</mark> is. at the fans forum <mark>rodgers</mark> pretty much said demerit needed a number 1 leader type defender next to him as <mark>williamson</mark> is. hogweed, elstree says...6:51 pm mon 2 mar 09 i would be worried with mariappa at centre half. he looked very uncertain in that position against palace when jay went off. i would be worried with mariappa at centre half. he looked very uncertain in that position against palace when jay went off. hog out chris the vic, the vic says...8:13 pm mon 2 mar 09 hog it is a difficult one. jay was the weakest link...along comes <mark>mike</mark> w and mariappa plays well alongside him. against chelsea (i think) hoyte had a nightmare and jay did ok. so backline rejigged and mariappa becomes a full back and looks ok. jay against palace had a nightmarish 5 mins, played thru it, looked good and gets injured. whoever plays will play to the best of their ability...if only we had a few more good specialist defenders. however i am sure team will do their best for themselves, <mark>brendan</mark> and us and if adrian plays centre back he will do well. find a job in watford and all around hertfordshire. search for properties all over watford and across the uk."}, {"articleID": "2012122205_00024230_W", "names": {"Bill Nelson": ["Q22639331", "Q3272899", "Q358437", "Q4910326"]}, "date": "2012-12-22", "url": "http://local10.com/news/Former-Marine-Jon-Hammar-released-from-Mexican-jail/-/1717324/17872922/-/7odwbt/-/index.html", "content": "former marine jon hammar released from mexican jail family, politicians win fight for hammar to come home a marine veteran jailed for months in mexico after trying to carry a family heirloom shotgun across the border has been freed, u.s. officials, his lawyer and family said late friday. shortly after 9:30 p.m., hammar's mother, olivia, received a personal email from a u.s. official who reported that he has crossed the border and was in the united states. \"jon is in u.s. territory. god bless america,\" olivia said through tears. the hammar family said they are unsure about their travel plans. because of hammar's post-traumatic stress disorder, the family will not release the details of their flight home. they are currently in texas and are not sure if they will return to south florida friday night. \"i'm going to be cooking all weekend for him. everything he's ever enjoyed eating i will be cooking this weekend,\" said olivia. \"we're just grateful people. this christmas--we'll never forget it.\" the attorney for 27-year-old jon hammar tweeted friday night that his client had been released from a detention center in matamoros, mexico. patrick ventrell, the acting deputy spokesman for the state department, confirmed hammer's release and return to the u.s. in a statement friday night. \"officials from the u.s. consulate general in matamoros met him at the prison and escorted him to the u.s. border, where he was reunited with members of his family,\" the statement said. \"we sincerely appreciate the efforts on the part of mexican authorities to ensure that an appropriate resolution was made in accordance with mexican law, and that mr. hammar will be free to spend the holidays with his loved ones.\" an aide to a legal representative of the mexican attorney general's office had told u.s. sen. <mark>bill nelson</mark>'s staff about the pending release after the florida democrat's office got word from hammar's mother, according to a press release from <mark>nelson</mark>'s office. \"no american should be in a mexican jail for five months without being able to have his case in front of a judge,\" <mark>nelson</mark> said in that statement. \"we're grateful; this is a good christmas present.\" earlier friday, varon levy said he was flying from mexico city to matamoros to pick up his client. after that, the attorney said, they intended to cross the border at brownsville, texas. \"i'm very happy. i feel that the mexican legal system came out the way it should have,\" he said. u.s. immigration and state department officials had been at the mexican detention center waiting for hammar's release. a defense lawyer said mexican authorities determined there was no intent to commit a crime, <mark>nelson</mark>'s office said. the senator was among a handful of elected officials who urged the state department to help get hammar out of mexico. his family had said he was being held in isolation after threats to his safety were received. \"these past few months have been an absolute nightmare for jon and his family, and i am so relieved that this whole ordeal will soon be over,\" said u.s. rep. ileana ros-lehtinen, r-fla., in a statement. \"i am overcome with joy knowing that jon will be spending christmas with his parents, family and friends.\" the attorney, varon levy, said the path for hammar's return was cleared when mexican officials decided not to appeal the judge's ruling. civilian gun ownership is illegal under mexican law unless the owner purchases the weapon from a special shop run by the country's department of defense. \"the department of state warns all u.s. citizens against taking any type of firearm or ammunition into mexico,\" the u.s. embassy in mexico writes on its website. \"entering mexico with a firearm, certain types of knives, or even a single round of ammunition is illegal, even if the weapon or ammunition is taken into mexico unintentionally.\" mexican law also bans shotguns with barrels of less than 25 inches. the family said hammar's shotgun has a barrel of 24 inches. tourists are allowed to bring guns for hunting on rare occasions, but mexican officials said all visitors must receive a special permit before entering the country. mexican customs agents do not issue gun permits. as a result, anyone crossing the border with a firearm or ammunition without a previously issued government permit is in instant violation of mexican law, which stipulates long jail terms for breaking weapons laws. hammar and his friend were on their way to costa rica in august and planned to drive across the mexican border near matamoros in a winnebago filled with surfboards and camping gear. hammar asked u.s. border agents what to do with the unloaded shotgun. his family said agents told them to fill out a form for the gun, which belonged to hammar's great-grandfather. but when the pair crossed the border and handed the paperwork to mexican officials, they impounded the rv and jailed the men, saying it was illegal to carry that type of gun before hammar's release, varon levy said he was not sure of his client's immediate plans upon being freed. \"probably some down time,\" he said. copyright 2012 by post newsweek. all rights reserved. this material may not be published, broadcast, rewritten or redistributed. the views expressed are not those of this company or its affiliated companies. please note by clicking on \"post\" you acknowledge that you have read the terms of service and the comment you are posting is in compliance with such terms."}, {"articleID": "2019061200_00184513_W", "names": {"Nathan Lyon": ["Q6969216", "Q6969217"]}, "date": "2019-06-11", "url": "https://dailytimes.com.pk/410328/stoinis-to-miss-pakistan-game-marsh-flown-in-as-cover/", "content": "Australia all-rounder Marcus Stoinis has been ruled out of their next World Cup match against Pakistan with a side strain, captain Aaron Finch said on Tuesday. Stoinis, who has played in all three games for Australia in the tournament, picked up the injury in the match against India at The Oval on Sunday. All-rounder Mitchell Marsh has been flown over to England as back-up, but the Australians will wait to make a call on whether he permanently replaces Stoinis in their 15-man squad. \"Marcus Stoinis has a bit of a side strain. He won't be available for tomorrow,\" Finch told a news conference ahead of Wednesday's match against Pakistan in Taunton. \"We've got Mitch Marsh flying over just as a bit of a precaution. He was meant to fly over with the Australia A side on Friday.\" He's just coming a couple days early as a bit of precaution, if Stoinis doesn't recover quick enough or doesn't respond to treatment well enough over the next few days. \"Stoinis bowled seven overs for 62 runs against India, picking up the wickets of Virat Kohli and Mahendra Singh Dhoni. But he was dismissed for a duck and Australia fell 36 runs short of India's total of 352 to lose the match. Australia's pace duo Mitchell Starc and Pat Cummins found their rhythm early against India but the supporting cast of leg-spinner Adam Zampa and seamers Stoinis and Nathan Coulter-Nile struggled to keep it tight in the middle overs. The absence of Stoinis could open up a spot for seamers Kane Richardson and Jason Behrendorff, off-spinner <mark>Nathan Lyon</mark> or middle-order batsman Shaun Marsh against Pakistan, who lost all five ODIs against Australia earlier this year.\" It's just about trying to weigh up whether we go with (Shaun) Marsh tomorrow, or we go with a extra bowler and play Alex Carey at six, \"Finch added.\" We've got to find a few more overs now, whether we play the extra batter or extra bowler, we'll wait and see, and especially tomorrow with the conditions. \"Defending champions Australia won their opening two games against Afghanistan and West Indies."}, {"articleID": "2016042803_00309450_W", "names": {"Sabrina White": ["Q1517525", "Q52159455"]}, "date": "2016-04-27", "url": "http://www.latimes.com/socal/the818now/tn-gnp-crescenta-valley-girls-lacrosse-outlasts-westridge-for-double-overtime-win-20160427-story.html", "content": "Crescenta Valley girls' lacrosse outlasts Westridge for double-overtime win Charles Rich Contact Reporter PASADENA--Lizzy Hales had a brief moment to make an observation. With an opportunity to win a back-and-forth match, the Crescenta Valley High freshman girls' lacrosse player studied the opposing goalkeeper before launching an eight-meter shot. Hales scored with 2:23 left in double-overtime to lift visiting Crescenta Valley to a 9-8 nonleague win against Westridge on Wednesday. \"I wanted to score by shooting through the goalkeeper's legs,\" said Hales, a midfielder who finished with two goals. \"I was thinking to myself that I had to make the shot or else we keep on playing.\" It turned out to be a nerve-wracking game that we were able to win. I'm just going out there trying to live up to my expectations. You put it all on the line and I love the sport. \"It marked the second time this season that Hales scored on an eight-meter shot. Crescenta Valley (8-4) defeated Westridge (7-6) for the second time this season. The Falcons picked up a 7-4 home win in the first meeting April 6. Crescenta Valley finished second in the Pacific League behind Chaminade after tying for third with La Ca & ntilde; ada last season. The Falcons qualified for the USA Lacrosse Southern Section North Division playoffs. Playoff pairings are set to be unveiled Sunday. However, Crowther said he would make a decision as to whether the Falcons will participate in the postseason since several players have Advanced Placement testing that could conflict. The Falcons and Tigers have had a brief history of playing overtime matches. The teams played two overtime tilts last season.\" It's an exciting game, except for me as the coach, \"Crescenta Valley Coach Boz Crowther said.\" We seem to be on paper a marginally better team than Westridge. When we play Westridge, you can throw away the paper because we always seem to go to overtime against them. \"We train our players to watch the tendencies of the goalkeeper. Lizzy saw something to her liking and made a nice shot to win it.\" The Falcons, who finished second in the Pacific League behind Chaminade after tying for third last season with La Ca & ntilde; ada, tied it at 8 on a goal by Madeline Heeg with 7:54 left in the second half. Heeg's goal came a little more than five minutes after Rachel Dillman gave the Tigers an 8-7 lead. Crescenta Valley held a 7-5 halftime advantage. Abby Sheklow scored two goals in a 50-second span late in the first half. Sheklow, a junior attacker, finished with a team-high three goals. \"We went up against a Westridge team that worked so hard,\" Sheklow said. \"They played a great game.\" We wanted it so much in the end. Lizzy made a great shot to win it and we're so proud of her. There's a lot of skill on our team and we are trying to get better. \"Crescenta Valley received 10 saves from goalkeeper <mark>Sabrina White</mark>, including two in the first overtime. Dillman and Quincy Foster had two goals each for Westridge. Dillman's first goal gave the Tigers a 2-0 lead with 23:34 left in the first half. Sheklow knotted it at 3 with 8:49 to go. Crescenta Valley will participate in a nonleague home match at 3:30 p.m. Friday against West Ranch."}, {"articleID": "2010073109_00007404_W", "names": {"Mel Gibson": ["Q3854066", "Q42229"], "Jay Davis": ["Q28942601", "Q6166536"], "Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}, "date": "2010-07-31", "url": "http://buzz.yahoo.com/article/1:y_news:603d7e0a33bdabc0cf5a827230a3462f", "content": "the allegations of ethical violations against waters and rangel are, no doubt, just the tip of the iceberg. corruption runs deep in our present congress and president, and the proof is shown in the results of what they are doing to our nation. lolz, very seldom do the ethics panel come into play. rangel is black, waters is black. two in one week! if you want to see how dumb and dishonest she really is, watch this video. watch it to the end and bill clinton verifies she is a dumb and dishonest. how long before the old marxist hag maxine starts screaming, \"raaacism raaacism raaacism\" . sign in to view buzz updates from your connections! new user? | thomas left a comment - 53 seconds ago from seedlings to servings: 11-year-old grows tons of veggies for the homeless \"inspired...the little ones shall lead really rings true here\" xarcastic xam left a comment - 8 min ago yahoo! news \"as i said earlier, this whole\" <mark>mel gibson</mark> thing \"it's definitely a hoax. it's been 3 or 4 tapes?\" <mark>jay davis</mark> left a comment - 28 min ago usatoday.com \"hey hey ho ho this ain't mexico hey hey ho ho this ain't mexico\" hockeyshark left a comment - 31 min ago \"had obama met with the boy scouts instead, as <mark>jon stewart</mark> pointed out, i'm sure the right wing?\" the web's most remarkable stories, determined by people like you. stories are ranked based on your votes, comments, emails, and searches."}, {"articleID": "2009092313_00051546_W", "names": {"Peter Lewis": ["Q1283838", "Q21002377", "Q25183326", "Q29643126", "Q38589703", "Q7175446", "Q7175448", "Q7175449", "Q7175450", "Q7175451"]}, "date": "2009-09-23", "url": "http://tivysideadvertiser.co.uk/news/4644635.Supermarket_plan_refused_for_Newcastle_Emlyn/?ref=rss", "content": "supermarket plan refused for newcastle emlyn (from tivyside advertiser) 2:10 pm wednesday 23rd september 2009 campaigners have welcomed a decision by carmarthenshire planners to refuse permission for a new supermarket at the cawdor site in newcastle emlyn. but they warn that the application could be re-submitted soon; and they are concerned that a report from planning officers has not addressed the possible economic impact on the town. the plan was refused on tuesday after councillors viewed the site. they were met in the town by a small group of protesters who pointed out that the planning report also ignored the problem of traffic congestion in the town. mayor of newcastle emlyn, cllr <mark>peter lewis</mark>, told the planning committee: \"the overwhelming feeling put to the town council by the town and outlying area is totally against it.\" he added that he had never seen a planning application attract so much opposition in the town before. county councillor haydn jones said he could understand both sides of the argument and that, under the circumstances, it was too difficult for him to make a recommendation. newcastle emlyn action group spokesman richard vale said: \"the planning report does not adequately assess the likely economic impact on the town, in the view of the group, with current levels of trading in the town and surrounding area being massively understated.\" we argue that a new supermarket in the middle of the town would only be able to succeed by taking a huge slice of business away from existing shops, leading to the closure of businesses and the loss of local jobs. \"after hearing submissions from the two sides, some councillors expressed concerns about the accuracy of figures presented by the applicant and the planning report, about the effect on the welsh language of a development which could have consequences for the local economy and the fact that the identity of the supermarket which might operate the new store remains unknown. mr vale told the tivy-side:\" we are keeping a close eye on this. although we are please it has been refused as it stands, the applicant has already made it clear he will be submitting new plans. \"find a job in cardigan and ceredigion find a home in cardigan and ceredigion"}, {"articleID": "2013091313_00036926_W", "names": {"Elton John": ["Q16209157", "Q2808"]}, "date": "2013-09-13", "url": "http://www.carlukegazette.co.uk/news/showbiz/elton-fatherhood-calmed-me-down-1-3090330", "content": "Sign Up For Newsletter Now Daily news delivered direct to your inbox Sir <mark>Elton John</mark> has revealed fatherhood has calmed him down a lot. The singer is dad to young sons Zachary and Elijah with partner David Furnish and told The Sun about the positive effect they had had on his life. He said: \"My life has got simpler over the last few years. I have a great, steady relationship with David. I'm sober. I have a great career. I have my children now. I thought it would be nerve-racking having kids, but in fact, they've calmed me down completely.\" It has been such a dream. It has changed our lives a million per cent for the better and I can't imagine what it was like without it. It's a total joy. Psychologically and subconsciously, it's made me a different person - including when it comes to writing music. \"<mark>Elton</mark>, 66, also said he planned to cut back on his addiction to work so he can spend more time with his family. He said:\" The time has come in my life when I will definitely cut back on shows so I have more time with my family...I'm addicted to playing, I'm addicted to working, I'm addicted to touring, I'm addicted to everything. \"He continued:\" I sat down with David and said, \"You know, I'm fed up with it. The travelling is killing me. I can't do it any more. I've never taken enough time to smell the roses.\" I want to take my boy to school and I want to spend more time with David. I also want to spend more time on projects that maybe I should have done years ago but never found the time for. \"This might be a piano album or something just different. If you're going to be <mark>Elton John</mark>, you have to push the envelope.\" Temperature: 5 C to 12 C Wind Speed: 9 mph This website and its associated newspaper adheres to the Press Complaints Commission's Code of Practice. If you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the Editor by clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Carluke Gazette provides news, events and sport features from the Carluke area. For the best up to date information relating to Carluke and the surrounding areas visit us at Carluke Gazette regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only \"trusted\" sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Google Ads? Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Webtrends / Google Analytics? This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers? This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore? ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting? Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot? We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online? Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This? Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend. Temperature: 7 C to 13 C Wind Speed: 13 mph Temperature: 7 C to 13 C Wind Speed: 36 mph Temperature: 6 C to 10 C Wind Speed: 31 mph Temperature: 5 C to 11 C Wind Speed: 20 mph"}, {"articleID": "2011111603_00004986_W", "names": {"Mark Kelly": ["Q10326587", "Q11770303", "Q22261100", "Q28709861", "Q357510", "Q43127604", "Q554312", "Q6768338", "Q6768340", "Q6768341", "Q6768343"]}, "date": "2011-11-16", "url": "http://abc15.com/dpp/news/region_central_southern_az/tucson/Congresswoman-Giffords%27-book-%27Gabby%3A-A-Story-of-Hope-and-Courage%27-now-on-sale", "content": "congresswoman gabrielle giffords and her husband, <mark>mark kelly</mark>'s, new book is now on store shelves. the book is titled \"gabby: a story of hope and courage\" . it's written by giffords and <mark>kelly</mark> and gives an inside look at her recovery after a gunman tried to assassinate giffords on january 8th. giffords reads the last chapter of the book in the audio version. the chapter is only a page long. giffords admits she has a long way to go and calls her recovery frustrating and mentally hard. the book is dedicated to the six people who lost their lives."}, {"articleID": "2015110508_00111233_W", "names": {"Danny Ward": ["Q19281946", "Q5220916", "Q645145"]}, "date": "2015-11-05", "url": "http://sundayworld.com/news/child-rapist-who-fled-ireland-is-back-in-the-country", "content": "● News By Shuki Byrne Return: <mark>Ward</mark> fled the country during the summer Notprious child rapist <mark>Danny Ward</mark> has returned to Ireland after fleeing the country during the summer following a series of incidents in which he was targeted. <mark>Ward</mark> (35) was the subject of a number of vigilante attacks here before making the decision to flee the country in August. At the time he informed gardai he was leaving the country who in turn informed UK authorities he was intending to reside there for some time. He was spotted by a member of the public who took pictures of him aboard the Dublin to Holyhead ferry. Back in the country his movements are now being monitored at a secret location by gardai and the probation services. <mark>Ward</mark> had been attacked by vigilante groups a number of times in the months prior to leaving the country, and has had to be moved several times and protected by gardaí. In July he was chased and allegedly beaten by a group in Dún Laoghaire. It was reported that he was sleeping rough in the area at the time. <mark>Ward</mark> was set upon in Dun Laoghaire Garda Station. A man who has appeared in a video of the incident allegedly punching and kicking the sex offender has been arrested by appointment. Before that he was ran out of accommodation in north Dublin and Ringsend by angry locals. <mark>Ward</mark> had been drinking in a local pub when he was spotted by a man who recognised him from previous media coverage. <mark>Ward</mark> was said to be \"knocking back pints at the time\" . It is understood that the man who spotted him called a few of his associates and <mark>Ward</mark> left the pub, but by this stage the other individuals arrived at the scene and <mark>Ward</mark> \"suffered a few thumps\" . He then travelled to Wicklow Town hoping to go unnoticed but after he was spotted in the town gardai bundled him into a garda car and took him out of the area in fear a vigilante mob would attack him. Since his return to Ireland in recent weeks the 6ft 2in man has been under the supervision of the Probation Service and Gardai under its Offender Risk Assessment and Management Scheme (SORAM). Under the scheme he has to make his whereabouts known to gardai."}]