[{"date": "2013-09-30", "url": "http://www.sohh.com/2013/09/photo_of_the_day_j_cole_kills_it_on_the.html?utm_source=google&utm_medium=feed&utm_campaign=general-feed", "content": "<mark>J. Cole</mark> Says Mission Accomplished: \"I Wanted To Come & Strike A Nerve\" <mark>J. Cole</mark> Receives Some TLC After \"Crooked Smile\" Music Video No-Show <mark>J. Cole</mark> Isn't Sweating The Haters: \"I Don't Care About The Chattering\" <mark>J. Cole</mark> controls the stage during his What Dreams May Come tour at Hard Rock Universal Studios. Photo credit: Donovan Brooks Photography Kanye West Makes Head-Scratching Decision Following <mark>Jimmy Kimmel</mark> Dispute After Nickname Jerseys Proposal, NBA Wants Another Game-Changing Move Danny's Long-Awaited \"Old\" Album Leaks In Entirety, <mark>Brown</mark> Addresses Unofficial Release New York: A Love Story - \"I Called On Guys That Watched Me Grow Up Like Raekwon & Method Man\" My Name Is Curtis Snow & I'm A G - \"[Learn] The Countless Times Curt's Outsmarted Police & Escaped Their Clutches\" Rubber Souls - \"It Ain't Miley Cyrus, But Your Family'll Dig It\" GTA V Put On Blast Over Horrific In-Game Play, Group Demands Immediate Boycott <mark>Chris Brown</mark> & Drake Finally Kiss & Make Up, Spotted Hugging & Drinking Together Rockstar Isn't Sweating Over GTA V Boycott Demand: \"It's A Fake World\" Birdman Reacts To Drake's Alleged Kendrick Lamar Diss: \"He Really Slick\" Gucci Mane Apologizes To Baby, Drake & <mark>Rick Ross</mark>: \"I'm Currently Incarcerated But I Will Be Going To Rehab B/C I Need Help\" After Kanye West's Los Angeles Paps Clash, KimYe Spotted Overseas M.I.A. Keeps Her Middle Finger Up, Fights Back NFL W / Dicey Clip [Video]", "articleID": "2013093011_00030750_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "J. Cole": ["Q204018", "Q56604513", "Q6105158"], "Jimmy Kimmel": ["Q20793563", "Q4914"], "Rick Ross": ["Q297831", "Q431969", "Q606032"]}}, {"date": "2013-10-01", "url": "http://highschoolsports.silive.com/news/article/-1792473454155855770/late-surge-propels-tottenville-past-new-dorp-in-boys-soccer-3-1/", "content": "Talk about making the most of an opportunity. Tottenville reserve Ethan Francis hadn't received playing time in three straight games entering Monday's PSAL encounter against host New Dorp, but when coach Ron Nathanson called his number during a desperate stretch against the Central Cougars, he delivered in a big way. Just five minutes after the Pirates tied the score, Francis tallied off a header on a rebound as Tottenville registered a 3-1 victory over New Dorp. The Pirates, who also received goals from <mark>Christopher McCormick</mark> and Adrian Cosovic, entered Monday's game tied for second in Staten Island's PSAL division with the Central Cougars and McKee/S. I. Tech. The victory helped Tottenville remain tied with MSIT (which defeated CSI/McCown Monday) for second with 5-1-2 records. New Dorp dropped to fourth with a 4-2-2 mark. Tottenville, meanwhile, has had its troubles finishing this season and including its first game against New Dorp back on Sept. 9, Nathanson's troops had gone 145 minutes without scoring a goal against the Central Cougars this season. \"We really hadn't got many breaks or calls the whole season and I just told the kids,\" we have to make our own breaks, \"said Nathanson, whose team trailed 1-0 when ND's Mark Shnadshteyn scored in the 36th minute on Monday .\" But I do believe we have a good team. We just have been having trouble finding the net. \"But the Pirates finally ended their scoring drought at the 65-minute mark when <mark>McCormick</mark> took a feed from Cosimo Guarnera along the left end line, spun and shot with his left foot in one motion to beat first-time starter Arturo Reyes (in place of Stefan Zima, who is resting a pulled calf muscle) with a shot into the upper right corner. And just five minutes later, senior Francis, who entered the game for the first time 15 minutes into the second half, took center stage .\" I just wanted some energy out there (when I put him in) and (Francis) gave it to us, \"said Nathanson, whose team had only three shots at halftime, but wound up outshooting ND 18-9 .\" I obviously finally did something right, \"laughed the coach. With just 10 minutes left in the game, Tottenville's Oscar Macareno (two assists) entered the top of the box with a head of steam before unleashing a shot in close. Reyes (three saves) made a nice stop to preserve the tie and the ball caromed to the netminder's right, where Francis was closing in. Francis proceeded to get his head on the ball, deflecting it off Reyes' hands and into the right portion of the net to give the Pirates there first lead .\" I saw the ball come off the goalie's hands and I needed to go get it, \"who said even when he doesn't get much playing time, he always stays ready for when Nathanson does call his number .\" It was too high to lift my leg, so I got my head on it and then everything just went in slow motion. But I saw it go off the goalie's hands and in and it felt great. \"The Pirates, who received solid defensive work from Michael Catanzaro and Macareno in front of netminder Keith Pecoraro (four saves), capped their three-goal outburst in a six-minute span when Cosovic did a superb job heading home a shot off a Macareno free kick from midfield. New Dorp, which played superbly defensively behind Taofiki Adeyombo, Peter Zima and Thomas Ambrosino for a large portion of the game, opened the scoring late in the first half when Shnadshteyn took a nifty right-side cross from Donik Mollabeciri and scored from inside the box.", "articleID": "2013100108_00065987_W", "names": {"Christopher Mccormick": ["Q39031838", "Q5112839"]}}, {"date": "2013-10-03", "url": "http://www.hellenicshippingnews.com//News.aspx?ElementID=f43e57c9-32b4-4a92-b159-43f438577b9a", "content": "Legal and contractual issues, piracy and crime, and international sanctions are the most important areas of concern to merchant shipowners. Close behind are crewing and personnel, insurance regulation, loss prevention, environmental legislation, shipboard risk management, cargo preparation and stowage, and port state control. Consequently, owners want information and advice from their P & I clubs on how to tackle the problems associated with these areas. Their priorities have been revealed by the UK P & I Club's latest member survey. As one of the world's largest marine mutuals, the UK P & I Club's 122 million gross tons of international merchant shipping provides a representative cross section of the industry. Some 259 people from among its member shipowners and their insurance brokers were interviewed, spread globally in relation to all major ship types and vessel ages. Members indicated that financial stability was the most important aspect of their relationship with any P & I club. This was followed by speedy claims resolution, strong working relationships, comprehensive loss prevention and risk management advice, understanding members' business priorities, an extensive office and correspondents' network, high quality executives and avoidance of unbudgeted calls. Nick Whitear, director at UK Club managers <mark>Thomas Miller</mark>, explained: \"The aim of our survey has been to identify and understand the issues that really concern our members and those aspects of service and performance which are most important to them. The Club was very pleased with such a high level of participation across such a wide range of ship types, trade sectors, regional and international trades and corporate organisations .\" We are committed to being the leading shipowner-controlled provider of protection & indemnity insurance and place great value on the opinions of our members about how we can extend and enhance what we do for them. However, a survey can only tell us part of the story, so we are always listening to our members' views in all our dealings with them. \"Overall, the UK Club scored a 96 per cent satisfaction rating from its shipowner members who recognised a consistently high level of performance. Over 80 per cent declared their contact with the Club's underwriting and claims staff was\" just right. \"The Club has worked closely with the International Group of P & I Clubs to create detailed guidance on piracy and international sanctions. An updated edition of Frequently Asked Questions--and matching responses--on piracy was published on the Club website in August. These FAQs reflected the greater incidence of piracy and other violent crimes against ships and seafarers off the Gulf of Guinea coast. FAQs on US sanctions against Iran have also been recently revised. The Club has issued publications on handling dangerous cargoes in containers; environmental compliance in relation to ballast water management; and compliance with the Maritime Labour Convention which took effect on 21st August. The survey was undertaken independently by research firm Firebrand Insight under the codes of conduct of The Market Research Society and ESOMAR, the World Research Federation. The United Kingdom Mutual Steam Ship Assurance Association (Bermuda) Limited is generally known as the UK P & I Club. As a mutual association, the UK Club has no outside shareholders and no financial links with other organisations. Since its establishment in 1869, the Club has existed solely for the benefit of its members. Its structure as a mutual insurance association enables it to respond to the changing needs of its assureds and allows it to provide superior service, attention and coverage. The UK P & I Club is directed by the members. Overall control lies with the directors, elected by the members from amongst themselves. The directors normally meet four times a year to formulate policy on calls, the scope of cover, finance, underwriting and claims matters, reinsurance and issues affecting the P & I world. They resolve specific claims which may not fall clearly within the cover. <mark>Thomas Miller</mark>, the Club's managers, is organised to respond promptly to requests for assistance and to provide informed advice and help with members' claims. Individual support goes far beyond that normally provided by a commercial insurer. The UK Club's size and the scale of the managers' operations has enabled the latter to develop specialist skills and expertise seldom seen in marine P & I. Class 1 and Class 2 Policy Year Balances and Mid-Year Financial Update August 2013 Argentina - New Customs Regulations to Determine the Weight of Exported Solid Bulk Cargoes - Update The Email is not valid. Comment:", "articleID": "2013100304_00007748_W", "names": {"Thomas Miller": ["Q1645605", "Q18810669", "Q2426140", "Q24706764", "Q7792461", "Q7792467"]}}, {"date": "2013-10-03", "url": "http://economictimes.indiatimes.com/news/international-business/citigroup-fined-30-million-after-analyst-sent-report-to-sac-others/articleshow/23474617.cms", "content": "At Modi event, students told to vote out Congress Narendra Modi played listener, mentor and motivational speaker to 7,000 college students at an event that appeared to have been scripted by BJP. Take Brand India to the world: Narendra Modi to admen, marketers Panjab University beats 4 IITs, enters top 400 club Making its debut in the elite club, Panjab Univ joins the group of univs ranked between 226-250, putting it way ahead of its closest Indian rival IIT Delhi. IITs will take nearly 10 years to get to ideal teacher-student ratio Can Rahul Work in a Coalition Matrix? Investor's guide: Dhirendra answers investment queries EOW raids Financial Tech's head office: Sources Market cues for tomorrow's trade by experts Investor's guide: Dhirendra answers inve...EOW raids Financial Tech's head office:...He introduced the Samsung smartwatch - a wearable tech device that acts as an extension to the...Citigroup Inc will pay a $30 million fine after one of its analysts improperly sent confidential research on an Apple supplier to big clients including <mark>Steven A. Cohen</mark>'s hedge fund Citigroup analyst Kevin Chang emailed unpublished research about Hon Hai Precision Industry Co, a major supplier of Apple Inc iPhones, to SAC, GLG Partners, according to William Galvin, Massachusetts' Secretary of the Commonwealth. Apple's iPhones in the first quarter of 2013, which would have had a detrimental effect on Apple, the regulator said. SAC, hedge fund Citadel and mutual fund firm T. Rowe Price all sold Apple stock after receiving the information from Chang, a complaint filed by Galvin's office alleges. At $30 million, the Massachusetts fine is both one of the biggest state securities regulators have ever collected and 15 times the $2 million they fined Citi for improperly disclosing research on Facebook's initial public offering only a year ago. Galvin said the fine is so high because the case came less than one year after the Facebook case and illustrates that aspects of Citi's supervisory culture failed. \"The Citi analyst should not have been that accessible to the clients, he should have been better protected by the compliance team,\" Galvin added. Galvin's office had filed civil charges against Citi for \"failing to supervise\" , and the $30 million fine is the result of a settlement, he said. No criminal charges were filed. A spokeswoman for Citi said the bank takes \"regulatory compliance requirements very seriously and train (s) all of our employees about these obligations .\" She declined to give further details about the case. Chang, who worked for Citi in Taiwan, was terminated last month, the complaint said. The Massachusetts settlement also offers new details about how SAC employees worked at a time the $14 billion hedge fund has come under increased scrutiny about its trading practices. The insider trading charges against SAC in July. The hedge fund said it has done nothing wrong and pleaded not guilty to the charges. Galvin said he would be happy to cooperate with federal or other state authorities probing SAC. \"The emails between Kevin Chang and the hedge funds reveal this cozy culture which illustrates again that there are two types of customers; big ones and retail customers who often dont' receive this information,\" Galvin said in a telephone interview. The complaint cites an email from an unidentified SAC employee who asked a contact at Citi \"can u send me everything u have on the entire iphone 4/4s/5 supply chain?. Citi employees responded immediately by asking their colleagues\" can you please send directly to (employee for SAC Capital)... He needs it asap - works directly for (SAC Capital).' Chang was also contacted directly by a SAC employee. \"Hey Kevin, Are you picking up any order cuts to iPhone?\" the email said. Kevin Chang sent his unpublished research which included the Hon Hai numbers and unpublished research for Apple iPhone order forecasts to the SAC employee on December 13, 2012. Chang's research was published on December 14. A SAC spokesman said he has no comment on the matter. Chang also received emails from Citi colleagues saying that other big clients, including Citadel, wanted his views on Apple. A Citadel employee emailed Chang on December 13 saying \"Can we do a quick call tonight?\" In the securities industry, Galvin, who has been in the job for 18 years, has a reputation as an aggressive regulator happy to take on Wall Street banks in order to protect small, private investors. In 2011, NEXT STORY Japan sales tax hike \"welcome first step': Christine Lagarde Have something to say? Post your comment Have something to say? Post your comment", "articleID": "2013100401_00013085_W", "names": {"Steven A. Cohen": ["Q22662502", "Q590212", "Q7614420"]}}, {"date": "2013-10-06", "url": "http://www.heraldonline.com/2013/10/05/5277935/recap-colorado-vs-oregon.html#storylink=rss", "content": "Boulder, CO (SportsNetwork.com) - Marcus Mariota threw five touchdown passes to lead second-ranked Oregon to a 57-16 drubbing of Colorado at Folsom Field. Mariota completed 16-of-27 passes for 355 yards and also rushed for a pair of scores for the Ducks (5-0, 2-0 Pac-12), who have won each game this season by at least 39 points. Bralon Addison caught five passes for 158 yards and two touchdowns, Josh Huff finished with five catches for 103 yards and two scores and Byron Marshall picked up 122 yards on the ground in the win. \"I didn't really think about mercy,\" Oregon head coach <mark>Mark Helfrich</mark> said. \"That's a good program, a proud program. We're not in the embarrassment business. We're not in the statistic business and we don't think about individual awards. That's not our deal. We just wanted to get in a rhythm offensively .\" Connor Wood was 11-for-33 passing for 205 yards and two interceptions. <mark>Paul Richardson</mark> finished with 134 yards receiving and also threw a 75-yard touchdown pass for the Buffaloes (2-2, 0-2), who have dropped back-to-back games. Colorado jumped out to an early lead as Will Oliver booted through a 33-yard field goal. The Ducks, though, answered back just over two minutes later as Mariota ran it in from two yards out. Pharaoh Brown bulled his way across the goal line for the two-point conversion to make it 8-3. The Buffs got creative on their next touch as <mark>Richardson</mark> took a pitch on a reverse then found D.D. Goodson wide open along the right sideline for a 75 - yard touchdown. Oregon, however, added three touchdowns before the end of the first quarter to blow the game wide open. First, Thomas Tyner ran it in from two yards out, and Mariota followed with a 75-yard touchdown strike to Addison. After Wood was picked off by Terrance Mitchell on the Colorado 26, Mariota connected with Keanon Lower for a 17-yard score to make it 29-10. Oliver added a pair of field goals early in the second, but Mariota tacked on two more touchdowns to close out the half. \"I felt like if we would've kept coming away with nothing, I felt it might have deflated us,\" MacIntyre said. \"I felt the field goals us a little bit of energy .\" The sensational sophomore capped a 12-play, 67-yard drive with a 1-yard TD plunge before orchestrating an 11-play, 92-yard march which ended in a 4-yard toss to Huff for a 43-16 lead heading into the break. Mariota found Addison for a 44-yard touchdown 4:21 into the second half for a 50-16 cushion before adding a 26-yard TD strike to Huff just under four minutes later .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer Also check out our community publications", "articleID": "2013100611_00054598_W", "names": {"Mark Helfrich": ["Q15813758", "Q660685", "Q6767986"], "Paul Richardson": ["Q16234953", "Q3898140", "Q43291493", "Q7153218", "Q7153220", "Q7153222"]}}, {"date": "2013-10-10", "url": "http://www.sanluisobispo.com/2013/10/10/2726596/djokovic-nadal-into-quarters-federer.html#storylink=rss", "content": "Shanghai, China (SportsNetwork.com) - Top seeds Novak Djokovic and Rafael Nadal moved into the quarterfinals, while former world No. 1 great Roger Federer suffered a third-round upset Thursday at the $3.85 million Shanghai Masters tennis event. The reigning Shanghai champion and former world No. 1 Djokovic drubbed Italian Fabio Fognini 6-3, 6-3, while the second-seeded, newly-crowned No. 1 Nadal beat Argentine Carlos Berlocq 6-1, 7-6 (7-5) on the hardcourts at Qizhong Forest Sports City Arena. The fifth-seeded 2010 Shanghai runner-up Federer succumbed to oft-injured former top-10 performer Gael Monfils, 6-4, 6-7 (5-7), 6-3, on Day 5. \"[It was] one of those matches that could have gone either way,\" said Federer. \"I think I was a little lucky in the second set to get back, to be quite honest. I played a solid tiebreak .\" I had chances early on in the third set I think to make something happen. He kind of recovered, then started to serve a bit better again towards the end of the third set, which made it difficult for me. It's a bit of an up and down performance for me. \"The struggling Federer, who hasn't reached a semifinal since mid-July, lost to a player outside the top 20 for the fifth time in his last six tournaments. Monfils is now 2-6 lifetime against the 32-year-old 17-time Grand Slam king Federer .\" It's a good win for me, \"said Monfils .\" I feel a bit sorry for him because I know he's running for London. But it's tennis. He's going to have more opportunity those weeks coming up. \"Other big upsets came when German <mark>Florian Mayer</mark> doused third-seeded Spaniard and 2011 Shanghai runner-up David Ferrer 6-4, 6-3 and 15th-seeded Spaniard Nicolas Almagro took out fourth-seeded Czech slugger Tomas Berdych 6-7 (6-8), 6-3, 7-6 (7-4). Also on Thursday, sixth-seeded Juan Martin del Potro advanced via walkover when sixth-seeded Tommy Haas was unable to go because of a back injury, while seventh-seeded Jo-Wilfried Tsonga topped 12th-seeded Japanese Kei Nishikori 7-6 (7-5), 6-0 and eighth-seeded Stanislas Wawrinka bested 10th - seeded Canadian Milos Raonic 7-6 (7-2), 6-4. Raonic was last week's Tokyo runner-up to del Potro and titled in Bangkok two weeks ago. Friday's quarterfinals in Shanghai will pit the Australian Open champion and U.S. Open and Wimbledon runner-up Djokovic against Monfils, the 2009 Shanghai runner-up Nadal versus Wawrinka, the former U.S. Open champion del Potro against Almagro, and Tsonga versus <mark>Mayer</mark>. Djokovic defeated then two-time reigning champion <mark>Andy Murray</mark> in last year's Shanghai finale. Djokovic beat the U.S. and French Open champion Nadal in last week's final at the China Open in Beijing .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013101023_00036435_W", "names": {"Andy Murray": ["Q10125", "Q526811"]}}]