[{"articleID": "2017111708_00005979_W", "names": {"Paul Humphreys": ["Q368348", "Q7151427"]}, "date": "2017-11-17", "url": "http://www.yorkpress.co.uk/news/15667295.From___32_guitar_and_cheap_Electricity_to_The_Punishment_Of_Luxury__the_journey_of_OMD/", "content": "OMD's Andy McCluskey and <mark>Paul Humphreys</mark> 0 comments THE Punishment Of Luxury Tour brings OMD, or Orchestral Manoeuvres In The Dark in old money, to York Barbican on Saturday night. The sold-out 8pm gig forms part of an 18-date autumn tour to back up the September release of OMD's 13th studio album of a career stretching back almost 40 years to when two teenage Kraftwerk fans from the Wirral, Andy McCluskey and <mark>Paul Humphreys</mark>, formed their synth-pop duo. Such OMD albums as 1980's Orchestral Manoeuvres In The Dark, 1981's Architecture And Morality and 1983's Dazzle Ships helped to shape the dominant electronic sound of that decade, alongside The Human League and Tubeway Army's Gary Numan. Now McCluskey and <mark>Humphreys</mark> return with The Punishment Of Luxury, their first studio set since 2013's English Electric, creating a \"daring collection of stylish synth pop and masterful song craft that sees OMD edge out of their comfort zone without compromising their integrity\". \"It's almost like we've gone back to being teenagers after all these years,\" says McCluskey, now 58. \"We just do whatever we want and there's no record company to tell us what we can or can't do .\" Reflective and sanguine in mood, the album was recorded in McCluskey and <mark>Humphreys</mark>' respective studios in Merseyside and London, with the final mixes being handled by both at <mark>Paul</mark>'s place. Their 13th album is \"lucky 13,\" says McCluskey. \"We've taken great care and considerable time to make it a good album, and we're really happy with it. The great thing is that we're back in the place where we were in our very early days in that we're doing it for ourselves. But having said that, you have to be careful not to be self-delusional!\" We're in a good place now, with people praising us, but we don't want to do pale pastiches of what we've done before. By giving yourself time, you can self-edit, and our ethos is to still challenge ourselves, and there's so much on the album that's not the usual \"pop fodder' .\" The Punishment Of Luxury is a progression \"both electronically and in terms of themes on the record,\" says McCluskey. \"I have a collection of notes of what I want to write about but I never write the lyrics first. We always write the music first, then the lyrics, and for this album, for example, some of the tracks have much more crunchy, dirty drums than we've used before .\" Some songs are more sparse than before, using the \"glitch' sound that we've previously discarded: the noises that are normally rejected .\" Now OMD can make such choices where once they were limited by the ultimate limitations. \"When we first began, not only did we not know how to play our instruments, but we didn't actually have any instruments, so it was a voyage of discovery. My left-handed guitar cost £ 32; it was the cheapest in the shop, and though I'm right-handed, I bought it, and I still play it upside down,\" says McCluskey. \"The Selmer Pianotron, of which I've only ever seen one, we had a friend who sold it to us for £ 25, and that's the famous plinky-plonky sound you hear on Electricity .\" Then, after six gigs, we got fed up with borrowing synths, so we bought a micro preset from my mother's mail order catalogue for £ 7 and 76 pence per week for 36 weeks and that was basically the sound of the first album! \"Roll forward all these years and McCluskey says:\" We're blessed to still be able to play concerts, sell lots of tickets and still make interesting records, working hard and being determined that we won't be a grey version of our former selves. \"We started with a fairly radical idea, playing songs on a naive collection of instruments, and it turned out to be a hobby that got out of hand with a crazy name [Orchestral Manoeuvres In The Dark] that we chose when we were only going to do one gig!\" OMD play York Barbican, Saturday, November 18, 8pm; sold out. 0 comments"}, {"articleID": "2011111719_00091404_W", "names": {"Colin Powell": ["Q150851", "Q5145485"]}, "date": "2011-11-17", "url": "http://blogs.worldbank.org/edutech/failfaire-internal", "content": "michael trucano on thu, 11/17/2011 - 14:17 it's fine to celebrate success but it is more important to heed the lessons of failure once remarked. those of us who have worked for any period of time on educational technology projects, or on international development projects (let alone in the space where these two areas meet!), will have come across at least one project that \"failed'--and perhaps did so spectacularly. how might we learn from such failures? one way to do this that is gaining traction in increasing numbers of organizations is a failfaire. what is a failfaire, you ask? big proponent of the approach,\" while we often focus on highlighting successes in our field, it's no secret that many projects just don't work - some don't scale, some aren't sustainable, some can't get around bureaucratic hoops, and many fail due to completely unanticipated barriers. at failfaire we want to recognize the failures: the pilots that never got anywhere, the applications that are not delivering, the projects that are not having any measurable impact on the lives of people, and the cultural or technical problems that arise. \"education for global development blog, ariel fiszbein, the world bank's chief economist in the human development sector (which includes health and education), notes that\" publicizing what doesn't work is a fundamental part of any approach to evidence-based policy. lack of results is a likely outcome of any innovation. we should remain open and even celebrate those that bring us the bad news as they are helping us stay honest. \"dutch institute of brilliant failures (there really is such a thing!),\" sharing lessons from what hasn't worked can stimulate entrepreneurial thinking and behavior (in the broadest sense of the word) by encouraging people to develop new ideas and enabling innovators to turn ideas into reality \". such efforts could be wasted in a culture where failure is seen as shameful and few are prepared to take risks. a failfaire--a term that appears to be novel enough that it is still not in wikipedia--is one small attempt to help change such a culture. ok, you might say, i'm with you so far. conceptually what you say makes a lot of sense. but what is attractive in the abstract can become decidedly less so when you try to translate such laudable sentiments into actual practice. the world bank has hosted three failfaires in the past 15 months or so: two were open to the public (we wrap-up of the second), and one was a strictly an internal affair. in the past week i have been asked by three different organizations for advice on setting up an internal failfaire. while it is always flattering to be asked for advice, i must admit being seen as a\" go-to guy on failure' does leave me a little conflicted. so be it: in case it might be of interest to any other organizations, i thought i'd quickly share some of what i've learned about how to run failfaire events, based on my own personal experience as both organizer and participant, and as a result of discussions with my colleague galina voytsehovska, whose excellent short paper on this topic recently won an internal knowledgement management award here at the world bank. first, it is important to note that we used the excellent general mobileactive. everything that is described below owes a tremendous debt to the innovative thinking and direction that the good folks at mobileactive have provided in this area. if you're interested in hosting your own failfaire, i'd suggest you first have a look at the mobileactive guidelines, and then come back to this blog post here. for our context, doing a failfaire as an internal event meant that we had to change a few things--and we introduced a few additional new \"innovations' as well. (some worked well...some didn't. see below .) an important caveat: it was important to note that at no point were we really\" celebrating failure' (this is a goal expressed by some failfaire organizers). while i understand the intention that is meant to be embedded in this phrase, this is a rather dangerous (and incorrect) formulation in many contexts, i think, for a number of reasons. our goal for the event was to provide a space where could celebrate taking risks and the open and honest sharing of information (even and especially about what doesn't work or isn't working) so that we could learn from these things. in many of the types of institutions that could perhaps most benefit from open discussions of \"failure', enthusiastic rhetoric about\" celebrating' mistakes might well be counterproductive. it is possible to talk with colleagues and peers about things that haven't worked in an informal way while at the same time not losing fact of the fact that much of what is being discussed is serious business, with serious consequences for mistakes and failure of any sort. \"celebrating failure\" : such language may be catnip to critics of your organization or the industry in which you work--as well as to people looking for sensational headlines and posts on twitter. it can also be difficult to get some managers to agree to let their staff participate an event with this theme. (i discussed this concept with one person whose response was: \"my employees are free to celebrate their failures--if they wish to do so, they will have a lot of time for this as they are standing in the unemployment line .') with that in mind, internal failfaires might wish to have the following two core general objectives: to draw lessons from experience and see how it may be useful for other colleagues who are working on similar projects; to foster more open dialogue among staff about how to identify and respond to project challenges of various sorts, in the hopes of making them more successful. no names (i.e. you can't talk about other people by name; as a gimmick, we referred to all presenters by only their first name and last initial, e.g.\" mike t. \"). no blame (you can't blame others) no recording (including no webcasting, no blogging, no live tweeting of identifiable information, no archiving of presentations on the intranet) you can only speak about projects you worked on chatham house rule applies 7 minute time limit per presentation we advised presenters that they were free to change the names of anything in the project they were to discuss. we did not have an open q & a session, in an attempt to limit\" speechifying' from the audience as well as to avoid situations where audience members don't follow the same rules that presenters are using and try to name names, assign blame, etc. the idea here was to help make the presenters feel as comfortable as possible, and to lessen the opportunities for cranks and trolls (in the internet sense of the term) to be disruptive influences. we were very strict about the seven minute time limit: an electronic clock (actually an ipad running a stopwatch app) was set up directly in front of each presenter to help them keep track of time. slides were set to auto-forward and change after 1 minute (presenters were free to advance them more quickly if they wished). we used a large chinese gong to signal the end of each presentation (this would get progressively louder each time we sounded it, eventually drowning out the presenter, at which point the audience was prompted to applaud enthusiastically). presenters were asked to prepare a single question for audience response; the audience then used handheld voting devices to \"answer' each question in real time immediately upon the conclusion of each presentation. we were able to recruit ten brave souls as presenters for our internal failfaire. we made sure to have an equal number of men and women, so as not to associate\" failure' too closely with one specific gender. (that said, we did find it interesting that it was much more difficult to recruit men as presenters than women, a fact which occasioned a rather lively discussion in its own right .) for what it's worth: convincing people even to participate was a rather herculean task. the three \"worst' presentations (or so i've been told) were from people who were among the first to agree to participate. the more people we added to the agenda, the easier it was to convince others to join in. (frankly, i think having even\" bad' presentations is not such a big deal--as long as there aren't too many--as the whole point is to promote/foster a culture of sharing, and if everything is too slick, this may intimidate some staff, who may be less likely to volunteer to participate in future sessions). as noted above, we used a gong to try to keep people to their seven minutes. most did (only one person had to be gonged multiple times--seven separate times in total before the plug was pulled!). in between presentations, we put up slides with quotes about failure. stage management is a real issue when you try to move things along as quickly and cram in as many people as we did. this is something that should definitely be rehearsed beforehand. we had a number of glitches in this regard. we used interactive response devices (\"clickers\" ) as a way to solicit audience feedback. these are handheld polling devices that you can use to respond to multiple choice questions displayed in a specially prepared powerpoint presentation. as we did with the fast pacing, we had some implementation challenges with this, but it something to consider, as it is a potentially valuable tool to help quickly engage with an audience limited way. following on the excellent example from the summer 2010 failfaire organized by the world bank institute (wbi) and mobileactive, we tried to adopt and promote a very informal, friendly presentation style. (one \"joke' that seemed to go over well was repeated references to the' f word'...by which i meant\" failure', of course, but we let this hang in the air for awhile .) we promised the presenters that we would not make the slides available after the event. nothing was archived on the intranet. no tape was made. the internal bloggers did not blog about it. these were concessions to secure people's participation. we would have preferred to share more information, more widely...but our first priority was to make the presenters feel safe and supported. some of the people who ok'd the internal failfaire were a bit worried about the event. to be honest, i don't think a number of these folks exactly understood what we planned to do. (we were, for example, asked not to use the word \"failure' in the title, and to\" focus on success'. we, um, accidentally forgot to do these things .) a number of people pre-cleared their presentations with their managers--something which we encouraged. we went out of our way to ensure participation by very senior and well-respected staff members in the event to make opening remarks. in addition to the content of what these folks said (which was excellent, of course), we wanted to show that there were senior, well-respected staff involved in the event, which was meant to implicitly signal support \"from the top'. many people have said things to the effect of\" you should have had more managers, etc. involved \". yes, that would have been great, but we did the best we could. (for those seeking to do something like this within their own organization: good luck to you on this count .) the feedback i've had from people who participated in the internal failfaire has been very, very positive. are things like a failfaire the answer to promoting greater openness and transparency within an organization? of course not, but as part of a larger concerted effort towards promoting more sharing of information within an institution, something like this can perhaps be quite useful. it can also be used to help energize younger staff: interestingly, there appeared to be a bit of a split by\" seniority' of people within the institution. generally speaking, the reactions i had from folks under, say, age 35, contrasted quite a bit with those from staff over age fifty (read into that what you will). so: if you're interested in running your own internal failfaire, (please make different mistakes than we made .) and, as they like to say in silicon valley: fail forward, fail fast, fail better! galina voytsehovska, with whom i worked on the internal failfaire event, won first prize in the ifc's \"smart lessons' competition for her essay on how to discuss failure-and not get fired! lessons from a 2011 human development forum session. if you want additional background and guidance based on our experience with this internal failfaire event, galina's essay is highly recommended. for a (somewhat) contrary view on this stuff, you may wish to have a look at jason fried's learning from failure is overrated post on the always engaging 37signals blog (be sure to have a look at the comments section too).\" there are no secrets to success. it is the result of preparation, hard work, and learning from failure. \"- <mark>colin powell</mark> note: the image used at the top of this blog post of a train wreck at montparnasse station in paris (\"epic fail\" ) is in the public domain and comes courtesy of allowed html tags: lines and paragraphs break automatically. web page addresses and e-mail addresses turn into links automatically."}, {"articleID": "2014071807_00000869_W", "names": {"Charlie Rose": ["Q1064593", "Q715515"]}, "date": "2014-07-17", "url": "http://www.kspr.com/news/politics/hillary-clinton-says-growing-awareness-points-to-separatists-in-ukraine-air-disaster/21051736_27007430", "content": "\"If there is evidence pointing in that direction, the equipment had to have come from Russia,\" the former secretary of state and possible 2016 Democratic presidential candidate said. \"There is a great deal of concern that not only was a civilian plane shot down but what this means about the continuing conflict in eastern Ukraine and the role that Russia is playing,\" she added. Her comments came as part of a sweeping interview with <mark>Charlie Rose</mark> on PBS and Bloomberg. Malaysia Airlines Flight 17 was carrying nearly 300 passengers and crew when it crashed in a rebel-controlled area of eastern Ukraine. The disaster prompted swift accusations from Ukrainian officials that \"terrorists\" shot it down. U.S. intelligence has also concluded that the plane was shot down. But it hasn't pinpointed who was responsible. Clinton has made tough talk against Russian President Vladimir Putin a staple of her public remarks on foreign policy. She told <mark>Rose</mark> that if Russia is held culpable, Europe should look to toughen its own sanctions over its incursion into Ukraine this year and accelerate efforts to break away from its use of Russian energy. \"Europeans have to be the ones to take the lead on this,\" Clinton said. \"It was a flight from Amsterdam to Kuala Lumpur over European territory. There should be outrage in European capitals .\" Putin is blaming Ukraine's military campaign against the separatists for the disaster."}, {"articleID": "2018120816_00077862_W", "names": {"Anthony Smith": ["Q16197257", "Q20640889", "Q27838053", "Q2852962", "Q2852963", "Q4773483", "Q4773484", "Q4773486", "Q4773487", "Q4773488", "Q4773489", "Q7823446", "Q7823448"], "Robert Nisbet": ["Q16292939", "Q21999572", "Q7348044"]}, "date": "2018-12-08", "url": "http://www.richmondandtwickenhamtimes.co.uk/news/17285726.new-december-train-timetable-to-be-launched-soon/", "content": "News New December train timetable to be launched soon Photo: PA 0 comment Rail passengers are braced for the first national timetable change since the chaotic introduction of new schedules in May. Industry body the Rail Delivery Group (RDG) warned there may be \"some impact on punctuality as the new timetable beds in\" after its introduction on Sunday. Similar statements were made ahead of the summer timetable change, which crippled large parts of the network in the north and south-east of England. The RDG insists the industry is \"learning lessons\" from the disruption and has decided to reduce the scale of the alterations in the winter timetable. Darren Shirley, chief executive of the Campaign for Better Transport, said: \"It is vital the mistakes of last May are not repeated again this winter .\" Passengers have already had a bad year and do not deserve to endure any further problems with their journey. \"Following the May timetable launch, Govia Thameslink Railway (GTR) and Northern cancelled up to 470 and 310 trains respectively each day. Train companies, government-owned infrastructure company Network Rail and Transport Secretary Chris Grayling have all been blamed for the chaos. A review by Office of Rail and Road (ORR) chairman Professor Stephen Glaister called for the industry to improve how information is provided to passengers. <mark>Anthony Smith</mark>, chief executive of watchdog Transport Focus, said:\" This time around passengers expect the rail industry to drive a smooth set of timetable improvements. \"Passengers paid a hefty price for the catalogue of over-optimism, missed deadlines and blurred accountability that led to a summer of timetable crisis and ensuing chaos. To regain their trust, passengers need to see that lessons have been learned .\" Rail timetables are changed twice a year, in May and December. The decision to scale back Sunday's change has been controversial as it will delay the launch of some new services. South Western Railway said it was \"disappointed\" it is not able to go ahead with its planned \"major timetable change\" which would have led to extra services and more capacity. RDG regional director <mark>Robert Nisbet</mark> said: \"We know that people in some areas might be concerned about another timetable change, but - as the Glaister Review acknowledges - the rail industry has worked together to start learning the lessons from May .\" As with the introduction of any new timetable, there may be some pockets of disruption as people get used to new journeys and train times, so we advise people to check before travelling next week. \"0 comment"}, {"articleID": "2015030623_00062654_W", "names": {"Shane Gibson": ["Q1990265", "Q21139692", "Q7488076", "Q7488077"]}, "date": "2015-03-06", "url": "http://myvalleynews.com/local/dogs-owners-take-to-the-streets-during-paws-for-a-cure/", "content": "BREAKING: Defendants in road rage case enter pleas of \"Not Guilty\" BREAKING: Sheriffs conduct \"death investigation' at Lake Elsinore Home Depot BREAKING: Defendants in road rage case enter pleas of\" Not Guilty \"Dogs, owners take to the streets during Paws for a Cure People walk with their dogs in an effort to raise money and awareness for the fight against cancer during the Susan G. Komen Paws for the Cure in Murrieta. <mark>Shane Gibson</mark> photos More than 150 participants, along with their dogs, came out in support of the event held at Town Square Park in Murrieta on Feb. 28, according to Susan G. Komen Inland Empire's Development Manager Bruce Cripe .\" I think we had over 200 last year, \"said Cripe, adding that he believed the weather had something to do with the lower turn out this year .\" There were 152 people who came out to support Susan G. Komen Foundation's Paws for the Cure event, \"Cripe said .\" I think we had over 200 last year. I think the weather had something to do with the lower turn out this year. But we still consider it to be a successful event in the fight against cancer. \"Temecula singer songwriter Joanna Pearl was one of the participants who braved the cold weather to lend her talents to the event .\" I always try to convey that in my singing, she said. \"If I can't feel it, then I usually won't do it any justice by trying to sing it .\" Pearl said that she is a passionate supporter of the Susan G. Komen Foundation because her grandmother passed of breast cancer. \"This is actually the second year that I have been asked to sing and it's a dual honor to support the cause and sing our national anthem,\" she said. \"Plus, I'm a huge dog lover .\" While numbers for funds raised at Saturday's event are not yet available, money that is donated to Komen will be used in the fight against the disease that affects 1.3 million people annually. \"Donations are open until the end of the week,\" Cripe said. \"One in eight women are diagnosed with breast cancer and those who wish to help can continue to donate online at www.Komenie.org .\" Pearl, who has performed for the likes of Olivia Newton-John and Patrick Dempsey and at the House of Blues in San Diego, said she hopes to bring awareness to events and causes like Paws for the Cure by using her voice both on social media and at the events themselves. \"I try and support the things that I believe in and it's a high priority of mine to give back, especially to my community,\" she said, adding that while it was cold and began to rain prior to the event ending the show must go on."}, {"articleID": "2014071006_00078363_W", "names": {"Matt Todd": ["Q1909280", "Q29017168"], "Andy Ellis": ["Q16264611", "Q4756893", "Q4760644", "Q504581", "Q525682"], "Dan Carter": ["Q18642089", "Q5213238", "Q59277840", "Q726199"], "Joe Moody": ["Q16732801", "Q6211415"]}, "date": "2014-07-09", "url": "http://www.voxy.co.nz/sport/crusaders-name-team-play-highlanders/5/195851", "content": "Thursday, 10 July, 2014 - 11:07 Crusaders head coach Todd Blackadder has made just one change to his team to face the Highlanders this Saturday night. Lock Sam Whitelock, who was a late withdrawal from last week's team, has returned to the starting line-up, which means Jimmy Tupou is on the bench. The rest of the line-up is the same as that which beat the Blues last weekend. Eighteen weeks of competition culminate in this southern derby on Saturday night. It is the final round of pool play and will determine log placings and qualifiers for the play-off rounds. While the Crusaders are already guaranteed a play-off spot, they are also working towards a second place qualification that would see them proceed directly to a home semi-final. \"That will require us to beat the Highlanders and beat them well,\" Blackadder said. \"The Highlanders are also a gutsy side though and we know that they will be putting everything they've got into this encounter. We are going to have to put in the performance of the season to come out on top, and that is exactly what the team has committed to doing .\" Kick-off is at 7:35 pm Saturday at AMI Stadium (Addington). Crusaders team to play the Highlanders: 1. Wyatt Crockett 2. Ben Funnell 3. Owen Franks 4. Dominic Bird 5. Samuel Whitelock 6. Jordan Taufua 7. <mark>Matt Todd</mark> 8. Kieran Read (C) 9. <mark>Andy Ellis</mark> 10. Colin Slade 11. Nemani Nadolo 12. <mark>Dan Carter</mark> 13. Ryan Crotty (VC) 14. Kieron Fonotia 15. Israel Dagg RESERVES: 16. Corey Flynn 17. <mark>Joe Moody</mark> 18. Nepo Laulala"}, {"articleID": "2011110123_00034024_W", "names": {"Hugh Grant": ["Q163286", "Q1634366"]}, "date": "2011-11-01", "url": "http://kdwn.com/index.php?page=2&section=ENTERTAINMENT_NEWS&title=Hugh_Grant_becomes_a_dad,_but_mother_undisclosed", "content": "london (ap)--<mark>hugh grant</mark> has become a father for the first time after a brief fling, his spokesman said tuesday - but the identity of the baby's mother is not being disclosed. publicist carrie gordon said <mark>grant</mark> \"is the delighted father of a baby girl .\" she said <mark>grant</mark> and the mother \"had a fleeting affair and while this was not planned, <mark>hugh</mark> could not be happier or more supportive .\" \"he and the mother have discussed everything and are on very friendly terms,\" gordon said. the 51-year-old star of \"four weddings and a funeral\" and \"notting hill\" previously had relationships with model-actress elizabeth hurley and socialite-turned-campaigner jemima khan. <mark>grant</mark>, who built a career playing bumbling british charmers, last appeared in a movie opposite sarah jessica parker in the 2009 comedy \"did you hear about the morgans .\" more recently he has become a high-profile opponent of intrusion by britain's tabloid press. <mark>grant</mark> has said he suspects his cell phone voice mail messages were intercepted by journalists, and has campaigned for tighter regulation of the news industry."}, {"articleID": "2017083004_00558211_W", "names": {"Zhang Yansheng": ["Q45448554", "Q45505592", "Q45658084", "Q45694841"]}, "date": "2017-08-30", "url": "http://www.myrtlebeachonline.com/news/business/national-business/article170144052.html#storylink=hpdigest", "content": "Mobile & Apps In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping shake hands with leaders at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping shake hands with leaders at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo China, India rivalry looms over BRICS summit By LOUISE WATT Associated Press August 30, 2017 12:44 AM BEIJING China and India may have ended a tense border standoff for now, but their longstanding rivalry raises questions about the possibility of meaningful cooperation at an upcoming summit of major emerging economies. The annual summit of the BRICS grouping encompassing Brazil, Russia, India, China and South Africa gets under way this weekend in the southeastern Chinese city of Xiamen, hoping to advance its vision of an alternative to the Western dominance of global affairs. The leaders of all five nations are expected to attend, offering the best opportunity for Chinese President Xi Jinping and Indian Prime Minister Narendra Modi to talk since the border tensions flared in June. While both their countries view BRICS as a significant forum for progress, their rivalry for global influence and fears of containment by the other threaten to overshadow those aspirations. The two countries' militaries are \"prowling the same spaces\" along their land borders, in the Indian Ocean and western Pacific Ocean, said Sreeram Chaulia, dean of Jindal School of International Affairs in the Indian city of Sonipat. Even beyond the region, they are vying in Africa and Latin America \"for the leadership of the developing world,\" Chaulia said. \"There is a contest, whether it is acknowledged or not, and it is because of the ambitions of both nations to be superpowers and to be inheriting the Asian century,\" Chaulia said. Attempting to start the BRICS summit off on a positive note, Beijing and Delhi on Monday announced a resolution of their most protracted and potentially explosive border standoff in years. The saber-rattling had raised fears of renewed conflict between the nuclear-armed Asian giants, who fought a bloody border war in 1962 and remain locked in disputes over extensive chunks of territory along their border. Yet, while India's Ministry of External Affairs said that troops were leaving the face-off site, China's official response avoided any mention of Chinese concessions or the fact that troops from both sides will continue patrolling in the area. \"The attempt is to paint India as the aggressor,\" said Sriparna Pathak, an assistant professor in international relations at Assam Don Bosco University in the northeastern Indian state of Assam. \"Clearly, China wants to somehow portray itself as the winner in a conflict which India had started and has now...been forced to withdraw by China .\" Other sources of distrust include:--Indian fears of Chinese encroachment in the Indian Ocean. China announced Friday it had carried out military drills in the western Indian Ocean, advertising its growing presence there. China is also cooperating with Pakistan, Sri Lanka and other coastal nations on port access, including for its navy .--Indian wariness about the motives behind Beijing's flagship \"One Belt, One Road\" infrastructure initiative, which includes a key component in Pakistan--India's archrival but one of China's staunchest allies. That adds to Indian frustration over lopsided trade that saw China record a trade surplus of about $40 billion with India last year .--China has thwarted attempts by India to gain permanent membership on the U.N. Security Council and join the Nuclear Suppliers Group, or to label Pakistani militant Masood Azhar a terrorist .--Beijing resents India's providing a base for the Dalai Lama, and complained bitterly when the exiled Tibetan spiritual leader was permitted to visit an Indian region claimed by China earlier this year .--Beijing fears what it sees as a U.S.-led encirclement of China by Washington's allies and neighbors, including India and Japan. Modi has sought to balance relations between China and the U.S., along with others such as Russia and Japan, but Beijing continues to view New Delhi as an upstart rival. Given the recent hostility between China and India, \"the air between the two even at the upcoming BRICS summit will not be a calm one,\" although they will likely seek to maintain appearances so as not to be portrayed as the spoil sport, Pathak said. Still, the BRICS grouping holds considerable allure for both countries, underscoring their support for regular meetings over the past decade to discuss economic concerns and issues such as climate change. Some observers see a multilateral arena like BRICS as being one of the few places where the world's two most populous countries can work together despite tensions. \"There is competition and mistrust but also some maturity where they are able to convert these face-offs into face-saving solutions,\" said Chaulia. He said it was \"quite feasible\" to put aside \"bilateral bad blood\" and have worthwhile cooperation at BRICS. \"Both countries cannot hold the other three, as in South Africa, Russia and Brazil, hostage to our narrow nationalistic rivalries,\" he said. The recent border standoff has shown that BRICS now needs to establish a method for sorting out \"problems and contradictions\" between China and India when they arise, said <mark>Zhang Yansheng</mark>, chief research fellow at the Beijing think tank China Center for International Economic Exchanges. The summit is \"a great opportunity to communicate face-to-face and exchange views on the two countries' problems and contradictions and the solutions to them,\" <mark>Zhang</mark> said. The timing of the summit is also significant, coming as the U.S. under President Donald Trump appears to be abandoning the traditional global order, said Alka Acharya, professor at the Centre for East Asian Studies at Jawaharlal Nehru University. Both China and India see BRICS as \"a very significant platform, particularly this time when the West is disengaging from globalization as it had operated until now,\" Acharya said. Yet, she added, \"unless China and India cooperate, this is not going to produce very good results. So this is something I think is realized at the highest levels .\" In this Oct. 16, 2016, file photo, Indian Prime Minister Narendra Modi, left, talks with Chinese President Xi Jinping at the BRICS summit in Goa, India. India and China have agreed to pull back their troops from a face-off in the high Himalayas where China, India and Bhutan meet, signaling a thaw in the monthslong standoff, India's government said Monday, Aug. 28, 2017. Manish Swarup, File AP Photo Never miss a local story. Sign up today for unlimited digital access to our website, apps, the digital newspaper and more."}, {"articleID": "2019031419_01074218_W", "names": {"John Kennedy": ["Q16090838", "Q16105132", "Q16195622", "Q1700694", "Q20737930", "Q25190305", "Q28530228", "Q43021748", "Q48775493", "Q548829", "Q593437", "Q59417950", "Q6242832", "Q6242834", "Q6242838", "Q6242847", "Q6242859", "Q6242864", "Q6242872", "Q6250211"]}, "date": "2019-03-14", "url": "https://kpel965.com/sen-kennedy-looks-for-answers-about-last-minute-fiscal-year-spending/", "content": "Louisiana Network <mark>John Kennedy</mark>, Getty Images Share on Twitter Share on Facebook Senator <mark>John Kennedy</mark>, who sits on the Senate Budget Committee, questioned the acting director of the Office of Management and Budget Russell Vought over transactions that took place in the final month of the fiscal year. A recent report showed several federal agencies spending habits that <mark>Kennedy</mark> wanted answers for. \"Were you aware that at the end of last fiscal year, the Department of Defense at the last minute spent $4.6 million on lobster tail and crab?\" asked <mark>Kennedy</mark> \"I'm aware of that report and we are looking into it,\" responded Vought. <mark>Kennedy</mark>'s questions didn't just stop with the military's fondness of seafood. The federal government spent $97 billion on contracts in the last month of fiscal year 2018. The total for contract spending for the entire fiscal year was $544.1 billion \"Another agency spent $53,004 on China tableware...$673,471 on golf carts. That's a disgrace,\" said <mark>Kennedy</mark>. <mark>Kennedy</mark> also expressed his displeasure with a recent report showcasing cases of fraud with government assistance programs in Louisiana as additional examples of government waste in taxpayer dollars. \"Do you know how much Americans spend of their hard earned money every year, tax dollars, to help people less fortunate than they are? Try a trillion dollars,\" said <mark>Kennedy</mark>. Categories: National News Comments Leave A Comment Back To Top"}, {"articleID": "2011051919_00034274_W", "names": {"Kevin Murray": ["Q57327222", "Q6397056", "Q6397058", "Q6397059", "Q6397060", "Q6397061", "Q6397062"]}, "date": "2011-05-19", "url": "http://cctimesdemocrat.com/story/1729139.html", "content": "piggott is gearing up for the 13th annual heritage park car show and cruise, to be held friday through sunday, may 20-22, at heritage park. organizers of the event have announced that active duty members of the military and their spouses will not be charged admission to this year's event. the portion of the show that is open to the public, from 9 a.m. to 3 p.m. saturday, may 21, falls on armed forces day, prompting the offer. \"we can't do enough to show our appreciation to the members of our armed forces,\" piggott area chamber of commerce secretary lynette cale said. \"our board met last week and voted to allow all active members of the military free admission. the offer applies to general admission at the gate for them and their spouse and includes members of all branches of the military and national guard .\" active duty personnel need only show a current id card at the gate to gain entry to the show. this marks the third year the chamber of commerce has sponsored the annual car show and cruise, which regularly draws several hundred entries and thousands of spectators. the show will be open to the public saturday, may 21, but there are many other activities for the participants. \"many traditions developed over the years that the supercruise group ran the show and we love to see them continue,\" added show chair and chamber president tim blair. \"the participants begin to arrive early in the week and a small community begins to grow in the rv area of the park. during the week we have a lot going on, including a visit to both murphy health and rehab and magnolia manor. it's been going on for a number of years and i've heard the residents, and the car show folks, really get a kick out of visiting and looking over the old cars and trucks .\" friday evening all the registered participants, and the crew of volunteers, will enjoy a barbecue chicken dinner at the park. \"we've got such great corporate sponsors and for the second year kennett national bank is sponsoring a barbecued chicken wing dinner along with the emmanuel baptist church of piggott,\" blair said. \"the dinner proved to be a favorite among the 2010 entries and offered a great opportunity for the entries to enjoy fellowship and a great meal .\" \"we've got a lot going on in piggott on car show day, including the lions club breakfast being served from 6:30 to 10 a.m. that morning at the community center,\" cale added. \"the hemingway pfeiffer museum will be holding their annual quilt show, plus the matilda and karl pfeiffer museum will be open regular hours. the shuttle bus will be running throughout the day and we encourage everyone to take advantage of the convenience to visit the sites .\" subtle changes from last year's show include the return of trophies for the winners, a revival of the various games played by participants and the change in judging to a class system based on age of the vehicle. otherwise, organizers hope to emulate the 12 shows that came before--and made the event the success it is today. \"hopefully, those who have been coming to the show for years will see very little difference from past events,\" blair noted. \"we have listened, though, and hope the changes are for the positive. one new addition this year will be more food vendors, which should afford a bit more variety for those in attendance .\" \"we've got more vendors this year, and expect a few late additions,\" cale added. \"tom rainbow, the montana pinstriper, is coming back this year along with a lot of longtime favorites like al and janet blume of ozark early ford and street rod parts--we're looking forward to a good variety of vendors .\" another new addition this year is turtle races for the kids. the races will be held beginning at 10 a.m. with trophies for the various winners. the turtle races are open to entrants in the sixth grade and younger and will be held near the main pavilion at heritage park. \"mayor gerald morris received a letter suggesting the races, so we thought we'd give them a try,\" blair said. \"we're still working out all the details, but expect a good turnout .\" saturday afternoon paid entrants to the show will be treated to another tradition, as they chow down on a delicious barbecued pork steak dinner. later saturday afternoon, the participants will line-up for the annual cruise to the square, parading along main street to the airport before returning to the court square. once all the cruisers are parked around the square the major awards will be handed out for this year's event, followed by an evening of rock--n-roll featuring kenny and the flashbacks. \"we'll also have our 50's dress and dance contest,\" cale added. \"it's always so much fun to see the little girls in their poodle skirts .\" as has become tradition, the aerial bouquets relay for life team will be selling hot dogs, hamburgers and soft drinks on the square before, during and after the cruise. local pastor and chamber board member bro. <mark>kevin murray</mark> will bring offer a non-denominational church service beginning at 9 a.m. sunday, may 22, at the park, followed by the closing ceremonies. \"we'll be giving out the award for the club that brought the most participants, and drawing for the 50/50 winner that morning,\" blair added. \"we've also got a few special awards and recognitions to hand out before we officially close the show for this year. it's also a great chance to visit with some of the folks that you only see a couple of times a year .\" early registration and check-in will be conducted at the chamber of commerce office in the depot through thursday, may 19. check-in and registration will continue friday, may 20, at heritage park and will be going on throughout the day of the show. judging will be from 11 a.m. to 1 p.m. registration is $35, with a discount offered for multiple entries. admission is $3 per person for everyone age 16 and older the day of the show for entry to the park. those wanting more information may call 870 598-3167."}]