[{"date": "2013-10-10", "url": "http://www.sanluisobispo.com/2013/10/10/2726596/djokovic-nadal-into-quarters-federer.html#storylink=rss", "content": "Shanghai, China (SportsNetwork.com) - Top seeds Novak Djokovic and Rafael Nadal moved into the quarterfinals, while former world No. 1 great Roger Federer suffered a third-round upset Thursday at the $3.85 million Shanghai Masters tennis event. The reigning Shanghai champion and former world No. 1 Djokovic drubbed Italian Fabio Fognini 6-3, 6-3, while the second-seeded, newly-crowned No. 1 Nadal beat Argentine Carlos Berlocq 6-1, 7-6 (7-5) on the hardcourts at Qizhong Forest Sports City Arena. The fifth-seeded 2010 Shanghai runner-up Federer succumbed to oft-injured former top-10 performer Gael Monfils, 6-4, 6-7 (5-7), 6-3, on Day 5. \"[It was] one of those matches that could have gone either way,\" said Federer. \"I think I was a little lucky in the second set to get back, to be quite honest. I played a solid tiebreak .\" I had chances early on in the third set I think to make something happen. He kind of recovered, then started to serve a bit better again towards the end of the third set, which made it difficult for me. It's a bit of an up and down performance for me. \"The struggling Federer, who hasn't reached a semifinal since mid-July, lost to a player outside the top 20 for the fifth time in his last six tournaments. Monfils is now 2-6 lifetime against the 32-year-old 17-time Grand Slam king Federer .\" It's a good win for me, \"said Monfils .\" I feel a bit sorry for him because I know he's running for London. But it's tennis. He's going to have more opportunity those weeks coming up. \"Other big upsets came when German <mark>Florian Mayer</mark> doused third-seeded Spaniard and 2011 Shanghai runner-up David Ferrer 6-4, 6-3 and 15th-seeded Spaniard Nicolas Almagro took out fourth-seeded Czech slugger Tomas Berdych 6-7 (6-8), 6-3, 7-6 (7-4). Also on Thursday, sixth-seeded Juan Martin del Potro advanced via walkover when sixth-seeded Tommy Haas was unable to go because of a back injury, while seventh-seeded Jo-Wilfried Tsonga topped 12th-seeded Japanese Kei Nishikori 7-6 (7-5), 6-0 and eighth-seeded Stanislas Wawrinka bested 10th - seeded Canadian Milos Raonic 7-6 (7-2), 6-4. Raonic was last week's Tokyo runner-up to del Potro and titled in Bangkok two weeks ago. Friday's quarterfinals in Shanghai will pit the Australian Open champion and U.S. Open and Wimbledon runner-up Djokovic against Monfils, the 2009 Shanghai runner-up Nadal versus Wawrinka, the former U.S. Open champion del Potro against Almagro, and Tsonga versus <mark>Mayer</mark>. Djokovic defeated then two-time reigning champion <mark>Andy Murray</mark> in last year's Shanghai finale. Djokovic beat the U.S. and French Open champion Nadal in last week's final at the China Open in Beijing .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013101023_00036435_W", "names": {"Florian Mayer": ["Q47176970", "Q51526161", "Q77170"]}}, {"date": "2013-10-10", "url": "http://www.businesswire.com/news/home/20131010006455/en/Invizeon-Corporation-Hires-Chief-Operating-Officer-Rapidly", "content": "www.invizeon.com) today announced <mark>Kevin Walker</mark> as the Chief Operating Officer for two of its rapidly growing subsidiaries, Seafaring Security Services, LLC and Slipstream Resources, LLC. Mr. <mark>Walker</mark> was previously Vice President and General Manager of ACADEMI, a security, training, and logistics services provider to the U.S. Government, international and domestic military & law enforcement agencies, and numerous commercial customers. While at ACADEMI he successfully led the company's flagship Training Services business unit. Prior to ACADEMI, Mr. <mark>Walker</mark> spent more than 15 years in the semiconductor and telecom industries driving operations, manufacturing, R & D, logistics and supply chain. Most notably with Ericsson of Stockholm, Sweden and Standard Microsystems Corporation (SMSC) on Long Island, New York. \"The Seafaring and Slipstream businesses, are world-class in their respective disciplines and passionate about innovation that works in the real world and delivering superior results to our clients,\" said <mark>David Todd</mark>, President and CEO of Invizeon. \"At the end of the day, our success in delivering exceptional value to our customers is achieved by the synergy of character and talents within a group of individuals who share a passion and a vision. Having <mark>Kevin</mark> join our team exemplifies these attributes and Invizeon's commitment to disciplined growth and innovation leadership. Mr. <mark>Walker</mark> brings to Invizeon a rich history in hi-tech operations and significant experience working with the USG/DOD/DOS, international, and commercial customers, and a proven ability to drive operational excellence & customer satisfaction .\" www.seafaringllc.com) is an internationally recognized leader in maritime safety, security and surveillance, offering a unique blend of innovative technologies, skills and abilities, and unparalleled maritime technology expertise. Seafaring's consultations and solutions are utilized by the who's who of the cruise line, shipping, and oil and gas industries. www.slipstream.us) is quickly emerging as a leader in the high end of the Cyber Security Systems industry. Slipstream draws on the depth of its unique experience and insight in the security industry, to bring technologies and innovative approaches that provide highly effective and specialized solutions to the emerging global cyber security threats on behalf of its tier-one government clients. Matt Winans, VP of Invizeon and President of Seafaring and Slipstream said, \"<mark>Kevin</mark> brings to our organization a new dimension which will greatly assist in the future growth of the company .\" Following Mr. Winans, <mark>Kevin Walker</mark> had this to say, \"I am excited about the incredible opportunities for innovation and growth here at Invizeon. The management team and employees are some of the most talented people I have had the opportunity to work with. Their pioneering spirit and passion are contagious. I look forward to working closely with them to provide our customers the right solutions for their needs .\" www.invizeon.com) owns and develops a growing number of strategic businesses and software platforms operating at the intersection of mission-critical security and socio-economic innovation. Invizeon is headquartered in Washington DC, with offices in Virginia, Florida, Montana, Arizona and Africa.", "articleID": "2013101102_00025254_W", "names": {"David Todd": ["Q16205178", "Q43264256", "Q45836567", "Q5240448"], "Kevin Walker": ["Q16234305", "Q1628988", "Q1740276", "Q6397705", "Q6397706", "Q6397707"]}}, {"date": "2013-10-10", "url": "http://www.nwfdailynews.com/military/top-story/a-final-goodbye-to-revered-wwii-heroes-galleries-1.216621", "content": "The remaining Doolittle Raiders will gather in Dayton, Ohio, for a final time next month. The revered World War II heroes will lift their goblets, sip their 117-year-old cognac and say good-bye to a decades-old tradition of gathering with their comrades to reflect on their contribution to American history. \"It's bittersweet,\" said Wes Fields, who lives in Destin and has served as the Raiders' security guard and escort for decades. He will attend the toast at the National Museum of the Air Force on Nov. 9. \"You want to be involved in it, but in a sense you don't because you dread it. It's coming to an end,\" Fields said. Photos from Doolittle Raiders' April visit: Autograph session .>> Photos from Doolittle Raiders' April visit: Exhibit .>> Photos from Doolittle Raiders' April visit: Family and veteran lunch .>> Photos from Doolittle Raiders' April visit: Parade .>> On April 18, 1942, 80 men led by Lt. Col. Jimmy Doolittle took off in B-25s from an aircraft carrier to bomb Japan. It was the first retaliation after Pearl Harbor, and while the physical damage to Japan was minimal the raid was a tremendous boost for morale back home. Nearly every year since the raid, the men had gathering for a reunion - the last of which was held in Fort Walton Beach earlier this year. As part of the tradition, they hold a toast before a set of 80 goblets engraved with each Raider's name. After the toast, they overturn the goblet of any Raider who passed on that year. Three of the remaining four Raiders - 98-year-old Lt. Col. <mark>Dick Cole</mark>, 93-year-old Lt. Col. Ed Saylor and 92-year-old Staff Sgt. David Thatcher - will attend their final toast. They will open the famed bottle of Hennessy Very Special cognac from 1896, the year Jimmy Doolittle was born. Lt. Col. <mark>Robert Hite</mark>, 93, likely will not attend because of his health. Only about 1,000 people have been invited. Fields, Ted Corcoran and Lyn Dominique will be among them. \"It's kind of like getting to go backstage with the Rolling Stones,\" Corcoran, president and CEO of the Greater Fort Walton Beach Chamber of Commerce, said as he sat in his office adorned with Doolittle memorabilia. He's organized hundreds of events in his career, but his work on two local Raider visits were his favorite, he said. Lynn Dominique of Shalimar also will be on hand. He has been a Doolittle Raider escort for years, including one time when he hopped over a barrier to push the wheelchair of a Raider who was getting left behind the group. They've become like family, sharing stories, and plenty of jokes, he said. \"Getting to know these men has been one of the highlights of my life,\" he said. Contact Daily News Staff Writer Lauren Sage Reinlie at 850-315-4443 or lreinlie @ nwfdailynews.com. Follow her on Twitter @ LaurenRnwfdn.", "articleID": "2013101108_00057448_W", "names": {"Dick Cole": ["Q521537", "Q5272775"], "Robert Hite": ["Q1747703", "Q7345524"]}}, {"date": "2013-10-14", "url": "http://www.recyclingtoday.com/Article.aspx?article_id=146726", "content": "Milwaukee to Promote Recycling of Plastic Bags, Wraps The city of Milwaukee has launched a campaign to increase the recycling of plastic bags and other film products. To kick off the program, Milwaukee Mayor Tom Barrett, along with a coalition of businesses, recycling advocates and government agencies, declared October as \"Milwaukee Plastic Film Recycling Awareness Month .\" The campaign will include a number of public outreach methods, including radio advertising. Wisconsin WRAP (Wrap Recycling Action Project), a public and private partnership that promotes recycling of plastic film beyond bags. The partnership is comprised of the American Chemistry Council's Flexible Film Recycling Group, the Wisconsin Department of Natural Resources, and GreenBlue and the Sustainable Packaging Coalition. \"Many Milwaukee residents already know that they can take back plastic grocery bags to many retail stores for recycling,\" says <mark>Steve Russell</mark>, vice president of plastics for the American Chemistry Council. \"But they also can take back other plastic bags and wraps, such as zip top food storage bags, the bags for newspapers, produce, bread, and dry-cleaning, and even the plastic wraps from products such as paper towels, diapers, cases of water and more .\" Plastic bags and wraps are returned for recycling to Milwaukee grocery and retail stores.", "articleID": "2013101422_00069235_W", "names": {"Steve Russell": ["Q16195304", "Q2634274", "Q30122065", "Q42277880", "Q43388452"]}}, {"date": "2013-10-14", "url": "http://truth-out.org/news/item/19421-on-the-news-with-thom-hartmann-house-republicans-and-president-obama-stalemate-in-fiscal-negotiations-and-more", "content": "Parkinson's and Disability Have an Image Problem, and Michael J. Fox Isn't Helping A new show can't decide if it wants to canonize its disabled icon or poke fun at the soft-voiced people who do. In today's On the News segment: Over the weekend, House Republicans and President Obama hit a stalemate in fiscal negotiations, and the Senate moved on to work out their own plan; the debt limit fight has moved to the Senate, but that won't stop House Republicans from trying to insert a few demands into the deal; another business owner is proving that fair wages and benefits don't stand in the way of success; and more. TRANSCRIPT: Thom Hartmann here - on the news...You need to know this. Over the weekend, House Republicans and President Obama hit a stalemate in fiscal negotiations, and the Senate moved on to work out their own plan. On Saturday, after meeting with the President, House Speaker John Boehner told his party that talks with the White House had broken down. So, Senate leaders immediately started their own negotiations to deal with the government shutdown, and the debt ceiling. But, now there are new disagreements in the upper chamber about what should be offered in exchange for such legislation. What started out as a fight over Obamacare, has morphed into a debate about the sequester, tax revenues, and cuts to Social Security and Medicare. On CBS's \"Face the Nation,\" democratic Senator Chuck Schumer explained the proposal, saying, \"The plan would be, open up the government immediately for a period of time before the sequester hits, and then have serious discussions where we might be able to undo the sequester .\" However, President Obama already rejected a similar plan offered by House Republicans. That plan would have opened the government, raised the debt ceiling, and replaced the next round of sequester cuts with cuts to Social Security and Medicare. And, it appears unlikely that Senate Republicans will accept a plan that repeals the sequester without equal cuts to another program. Republican Senator Bob Corker said, \"I just can't imagine how that has any possibility of becoming law .\" But, at least Senate leaders are still talking, and still working with the White House to find a way to avoid default. As the debate continues, the debt ceiling deadline grows closer, and Americans - and the World - want our lawmakers to end this fight. In screwed news...The debt limit fight has moved to the Senate, but that won't stop House Republicans from trying to insert a few demands into the deal. According to the Washington Post, Representative <mark>Paul Ryan</mark> said, \"[the] House could not accept either a debt-limit bill or a government funding measure that would delay the fight until the new year .\" That is, of course, unless Republicans are allowed to use the looming deadline as leverage to delay Obamacare, and deny women coverage of birth control. In a private meeting with Republicans, <mark>Paul Ryan</mark> said that the House should demand a delay in the individual mandate, and a so-called \"conscience clause,\" which would allow employers and insurance companies to deny contraception coverage. Although it's unlikely that Senate Democrats, or the President, would ever sign such legislation, women around our nation are furious that <mark>Paul Ryan</mark> even proposed it. And, they'd like him to answer - what exactly does women's healthcare have to do with the debt limit? In the best of the rest of the news...The people of Oklahoma will soon see a big drop in their electric bills. And, it's all thanks to green energy. That state's 100-year-old power company - the Public Service Company of Oklahoma - just signed an agreement with wind farms that are being developed in that state. The company purchased 600 megawatts of power, which was three times their original plan, \"after seeing extraordinary pricing opportunities that will lower utility costs by an estimated $53 million in the first year, and even more thereafter .\" Their purchase, which is awaiting approval from the Oklahoma Corporation Commission, will provide enough energy to power 200,000 homes. In addition, just one of these three developing wind farms will create 200 jobs during construction, about 50 permanent jobs, and inject more than $130 million dollars into the local economy. The President of Clean Line Energy Partners, Michael Skelly, said, \"The Panhandle of Oklahoma truly is one of the mother loads of wind in this country .\" And it appears that these wind farms will bring a mother load of savings and new jobs to the state of Oklahoma. Another business owner is proving that fair wages and benefits don't stand in the way of success. In a recent op-ed in The Detroit News, <mark>Paul</mark> Saginaw, owner of Ann Arbor's iconic Zingerman's Deli, called for a living wage and benefits for workers around our nation. He railed against industry groups like the National Restaurant Association for opposing a living wage, and wrote, \"Our success at Zingerman's with over 30 years of operating and opening food-related businesses was not achieved by underpaying or withholding benefits from our employees .\" Zingerman's has joined with more than 100 businesses around our nation to form a new association called \"RAISE .\" The group is committed to taking the \"high-road\" of labor practices, and to proving that \"investing in [their] employees has been a driving force in [their] growth and success, not an impediment .\" And, Mr. Saginaw predicts that businesses uniting in support of fair labor practices will only lead to further success. He wrote, \"I sense we are ready for this change. Just as customers have voted with their pocketbooks for locally-sourced, organic and free-range products, they are voting for ethical employment by patronizing high-road restaurants .\" And finally...If you name a dog Houdini, you better be prepared for him to pull off a few tricks. That's what happened in Colorado Springs, with an Australian shepherd waiting at an animal shelter for a new home. The dog decided he was sick of waiting, so he opened his own kennel, two external doors, and went out to find his new owner. If it wasn't all captured on the shelter's security footage, the staff would have thought that Houdini just magically disappeared. Thankfully, a woman named Ashley found the dog wandering her neighborhood and decided to adopt Houdini. If no one comes to claim the dog from the shelter, he will soon go to his new home. Ashley said, \"We think he's a wonderful dog, and as much as I would love his owner to come and claim him...I can't wait to welcome him into my family .\" Hopefully, Ashley is prepared to secure her doors a little better so that little Houdini doesn't make another great escape. And that's the way it is today - Monday, October 14, 2013. I'm Thom Hartmann - on the news. This article was first published on Truthout and any reprint or reproduction on any other website must acknowledge Truthout as the original site of publication. Thom Hartmann is a New York Times bestselling Project Censored Award winning author and host of a nationally syndicated progressive radio talk show. You can learn more about Thom Hartmann at his website and find out what stations broadcast his radio program. He also now has a daily independent television program, The Big Picture, syndicated by FreeSpeech TV, RT TV, and 2oo community TV stations. You can also listen or watch Thom over the Internet. Columbus Day Is the Official Endorsement of White European and US Conquest of Indigenous Peoples", "articleID": "2013101503_00084148_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}}, {"date": "2013-10-18", "url": "http://www.ibtimes.co.uk/articles/514976/20131018/pleb-plebgate-andrew-mitchell-police-federation.htm", "content": "Penumbral Lunar Eclipse 2013: Where to Watch the Moon in Earth's Shadow Manchester United Given Green Light To Bid? 18m for French Midfielder UK Consumer Credit Card Lending Hits Fastest Growth Rate Since February 2010 Shale Gas Fracking: US Moves Ahead of Russia in Oil and Gas Output Halloween 2013: Craziest Halloween Costumes of Heidi Klum [PHOTOS] <mark>Kate Middleton</mark> wants Prince George's Christening to be \"Different': Will Duchess of Cambridge Break Royal Tradition? Divalicious Demands of Beyonce, Lady Gaga, Naomi Campbell Revealed <mark>Andrew Mitchell</mark> is owed an apology for the Plebgate scandal, said PM <mark>David Cameron</mark> PIC: Reuters <mark>Andrew Mitchell</mark> is owed an apology for the Plebgate scandal, said PM <mark>David Cameron</mark> PIC: Reuters The Plebgate saga took a new twist after a former top Tory MP claimed he had heard <mark>Andrew Mitchell</mark> use the slur\" several times \". Michael Portillo, the former Conservative Defence Secretary, said <mark>Mitchell</mark> had used the word\" pleb \"in private on several occasions. <mark>Mitchell</mark> resigned from his Cabinet job as Chief Whip in 2012 when police officers claimed they had been called\" f ****** plebs \"by him at the gates of Downing Street. He has always denied using the term,\" pleb \"during the verbal spat, which lasted no more than 45 seconds. Speaking on BBC1\" slate night politics TV talk show This Week, Portillo told viewers he had \"heard <mark>Mitchell</mark> use that word a few times in private conversation\". Portillo's claim appeared to contradict <mark>Mitchell</mark>'s own proclamation that he thought \"pleb\" was a toxic word and he would \"never use it\". . However, Portillo added he believed <mark>Mitchell</mark> had not used the slur to police officers: \"I did not believe he could have used it at the gate .\" <mark>Mitchell</mark> was sacked from the the Chief Whip's officer post only weeks after sitting down at his desk for the first time, last year. He clung on for almost a month after the allegations broke. But his reputation looked as though it might be recovering this week after police accounts of the incident fell apart under close scrutiny. Police have some tough questions to answer over plebgate PIC: Reuters The Independent Police Complaints Commission (IPPC) this week intervened after no disciplinary action was taken against three police officers who were exposed for misrepresenting <mark>Mitchell</mark> at a meeting. The trio and <mark>Mitchell</mark> met for \"clear the air' talks during which <mark>Mitchell</mark> repeatedly denied using the word. But a secret recording indicated they later gave a false account of what he said. Confined to the backbenches since the scandal, <mark>David Cameron</mark>, the Prime Minister, this week said an\" apology \"was owed to <mark>Mitchell</mark> by the police. It was <mark>Cameron</mark> who accepted <mark>Mitchell</mark>'s resignation when the storm was at its height. A later decision by West Mercia police not to pursue disciplinary action against the trio was condemned by the IPCC. The Police Federation union led calls for him to resign at the same time as pursuing a high profile and successful campaign to protect pay and conditions for members. Myanmar: Three More Bomb Blasts Leave One Dead and Six Wounded in Namkham British Gas and Centrica Energy Price Hikes Inflict more Pain on Households Ofsted brands Muslim Free School Al-Madinah in Derby\" Inadequate and in Chaos' Public Accounts Committee Slams BBC's Salford Relocation Expenses", "articleID": "2013101819_00031395_W", "names": {"Andrew Mitchell": ["Q333261", "Q4758038", "Q4758039", "Q4758043", "Q48796982", "Q54310554", "Q57820261"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Kate Middleton": ["Q10479", "Q17506155"]}}]