[{"articleID": "2019031319_00154629_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-03-13", "url": "http://www.gamereactor.eu/games/11063/CounterStrike", "content": "COUNTER-STRIKE: GLOBAL OFFENSIVE REVIEW. Written by Rasmus Lund-Hansen on the 27th of August 2012 at 18 \"Like Americans going to Japan only to eat at McDonald's when they could have been eating the same burgers at home .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 11th of March 2019 at 07 We also know the week one bracket for the competition as it kicks off this week, featuring big names in the world of CS: GO. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 8th of March 2019 at 09 Bodyy has been moved to the bench to make way for this new addition, and G2 hopes to improve results with the signing. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 6th of March 2019 at 09 The North American squad has just parted ways with Zellsis, and now a new report indicates the Mousesports player might be coming on board. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 5th of March 2019 at 10 In partnership with OMEN by HP and Elgiganten, the biggest and best teams in the Nordics will battle it out."}, {"articleID": "2013043019_00069635_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2013-04-30", "url": "http://us.rd.yahoo.com/finance/news/rss/story/SIG=14m6vloq3/*http%3A//us.rd.yahoo.com/finance/news/topfinstories/SIG=12jltkod5/*http%3A//finance.yahoo.com/news/apple-wows-market-record-17billion-190308679.html?l=1", "content": "by john balassi and josie cox new york/london, april 30 (ifr) - apple inc wowed the debt markets on tuesday with the largest non-bank bond deal in history, offering a whopping $17 billion for sale as the u.s. computer giant switches strategy to placate restless shareholders. just a week after announcing its first drop in quarterly earnings in a decade, apple came to market with the massive deal to raise funds for an ambitious program that will return $100 billion in cash to holders of apple shares. sources said investors could barely submit orders fast enough to get in on the deal from apple, the only major tech company without a single penny of debt on its books. the six-part all-dollar offering attracted more than $50 billion of orders by midday in new york - a massive level of demand even in the current red-hot climate of the bond markets. \"apple made its intentions clear that this deal is for shareholder-friendly activity, but they have tremendous metrics and brand recognition,\" rajeev sharma, portfolio manager at first investors management co, told ifr. \"apple is something everyone wants in their portfolio .\" the $17 billion size easily trumps the previous biggest single deal according to thomson reuters/ifr data, a $14.7 billion deal from abbott laboratories spin-off abbvie last november. earlier, a source said potential investors had been told on monday that this would be apple's only bond deal of the year, apparently scuttling hopes of possible euro or sterling issues - and helping fuel demand for tuesday's mega-deal, which was led by deutsche bank and goldman sachs. changing their tune the massive deal caps a milestone week for apple, which in seven days has changed tack to satisfy its investor base, becoming the world's biggest dividend payer and recapturing its mantle as the world's largest company by stock market value at $413 billion. investors unhappy with chief executive <mark>tim cook</mark>'s previous reluctance to share any of apple's massive $145 billion cash pile with shareholders - and unimpressed by its diminishing prospects for earnings growth - had been relentless sellers of apple's stock since its share price topped out above $705 in late september. the stock tumbled more than 45 percent from september 21 through march 19, falling by roughly $320 per share. but the stock has rallied more than 12 percent in the past 10 days as a new class of income-oriented investor, enticed by its dividend yield of nearly 3 percent, snaps up shares. they rose more than 3 percent on tuesday to over $444. expectations for future profit growth have trailed off significantly in the past year. after 10 years of high double-digit profit growth, analysts on average now expect a 10-year compound annual earnings growth rate of less than 7 percent, according to thomson reuters starmine, which tracks analyst forecasts. raising the cash although the company has a staggering $145 billion in cash, only $45 billion of that is readily available in the united states - meaning apple needs to raise about $60 billion over the next three years to fund the shareholder capital return plan. analysts suggest that hitting the debt markets now makes sense with interest rates - and thus the cost of raising funds - near record lows. but the maker of the iconic ipad and iphone failed to win the highest triple a rating from agencies. s & p rated the company aa +, while moody's rated it aa1. nevertheless, the massive investor interest allowed apple to tighten every tranche of the deal - from 3-year to a maximum 30-year tenor - by five basis points (bp) from guidance to launch. the company is offering $1 billion of three-year floating-rate notes, $1.5 billion of three-year fixed-rate notes, $2 billion of five-year floating-rate notes, $4 billion of five-year fixed-rate notes, $5.5 billion of 10-year fixed-rate notes and $3 billion of 30-year fixed-rate notes. analysts had initially suspected that the overwhelming interest would allow apple to price the deal even inside last week's bond from microsoft. but some investors said apple was leaving some spread on the table so that the deal, which was to price later on tuesday, would eventually trade tighter than the microsoft issue - and so that apple could get even better pricing next time round. \"if they are going to come back with another deal, be it in dollars or another currency, they will need to satisfy a similar investor type, so you want to leave a good taste in everyone's mouths,\" said matt duch, senior portfolio manager at calvert investments. (reporting by john balassi and josie cox; additional reporting by danielle robinson and reuters news; writing by marc carnegie; editing by ciara linnane)"}, {"articleID": "2014062603_00091453_W", "names": {"Eric Carlson": ["Q5386239", "Q5386240"]}, "date": "2014-06-25", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/mag-silver-reports-voting-results-203000187.html", "content": "VANCOUVER, BRITISH COLUMBIA--(Marketwired - Jun 25, 2014) - MAG Silver Corp. (MAG. TO) (NYSE MKT: MVG) (\"MAG\" or the \"Company\" ) announced today that at its annual general and special meeting (the \"AGSM\" ) held on June 24, 2014, MAG's shareholders approved by majority to decrease the size of the board to seven, elect all seven directors standing for re-election, re-appoint Deloitte LLP as the Company's auditor, and approve the Company's Equity Compensation Plans. The Board of Directors wish to extend their gratitude to Dr. Peter Megaw and Messrs. <mark>Eric Carlson</mark> and Frank Hallam, all of whom did not stand for re-election as directors for the ensuing year. Each of these directors has been instrumental in MAG's successes to date, and in particular, in the initial recognition of the value of property positions assembled at Juanicipio and elsewhere by the Company. Jonathan Rubenstein, Chairman of MAG, said, \"These individuals have been an integral part of the early and continued growth of the Company, and our shareholders have benefited greatly from their expertise, perseverance and commitment. The board thanks them for their dedicated years of service, and wishes each of them continued success in their future endeavours .\" The Company will maintain its close relationship with Dr. Megaw, who will continue to lead our exploration efforts, and Frank Hallam will remain accessible to the MAG Silver Finance Committee. Detailed results of the votes held by ballot at the AGSM are set out below. Nominee Total Votes Cast Votes For% For Votes Withheld% Withheld George N. Paspalas 35,831,724 35,659,529 99.52 172,195 0.48 Daniel T. MacInnis 35,831,724 35,561,749 99.25 269,975 0.75 Jonathan A. Rubenstein 35,831,724 35,538,010 99.18 293,714 0.82 Richard M. Colterjohn 35,831,724 35,716,871 99.68 114,853 0.32 Derek C. White 35,831,724 31,866,236 88.93 3,965,488 11.07 Richard P. Clark 35,831,724 29,940,359 83.56 5,891,365 16.44 Peter D. Barnes 35,831,724 35,643,406 99.47 188,318 0.53 Seconded Amended and Restated Stock Option Plan 45,577,917 32,481,187 71.27 13,096,730 28.73 Share Unit Plan 45,577,917 35,326,346 77.51 10,251,571 22.49 Directors' Deferred Share Unit Plan 45,577,917 35,340,665 77.54 10,237,252 22.46 George Paspalas, CEO and President of MAG Silver Corp., extends his thanks to the shareholders of the Company for their show of support. About MAG Silver Corp. (www.magsilver.com) MAG Silver Corp. (MAG. TO) (NYSE MKT: MVG) is focused on advancing two significant projects located within the Mexican Silver Belt. Our mission is to become one of the premier companies in the silver mining industry. Currently, we are advancing the underground decline towards the high grade Valdecañas Silver vein and delineating the Desprendido and Juanicipio discoveries in Zacatecas State, all within the joint venture between MAG Silver (44%) and Fresnillo PLC (56%). In addition, we are negotiating surface access in order to further delineate our district scale, 100% owned Cinco de Mayo property in Chihuahua state, where two new silver, lead, zinc discoveries are opening up further growth opportunities for MAG Silver Corp.. MAG is based in Vancouver, British Columbia, Canada. On behalf of the Board of MAG SILVER CORP.. George Paspalas CEO & Director Neither the Toronto Stock Exchange nor the NYSE MKT has reviewed or accepted responsibility for the accuracy or adequacy of this press release, which has been prepared by management. This release includes certain statements that may be deemed to be \"forward-looking statements\" within the meaning of the US Private Securities Litigation Reform Act of 1995. All statements in this release, other than statements of historical facts are forward looking statements, including statements that address future mineral production, reserve potential, exploration drilling, exploitation activities and events or developments. Forward-looking statements are often, but not always, identified by the use of words such as \"seek\" , \"anticipate\" , \"plan\" , \"continue\" , \"estimate\" , \"expect\" , \"may\" , \"will\" , \"project\" , \"predict\" , \"potential\" , \"targeting\" , \"intend\" , \"could\" , \"might\" , \"should\" , \"believe\" and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Although MAG believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include, but are not limited to, changes in commodities prices, changes in mineral production performance, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions, political risk, currency risk and capital cost inflation. In addition, forward-looking statements are subject to various risks, including that data is incomplete and considerable additional work will be required to complete further evaluation, including but not limited to drilling, engineering and socio-economic studies and investment. The reader is referred to the Company's filings with the SEC and Canadian securities regulators for disclosure regarding these and other risk factors. There is no certainty that any forward looking statement will come to pass and investors should not place undue reliance upon forward-looking statements. Please Note: Investors are urged to consider closely the disclosures in MAG's annual and quarterly reports and other public filings, accessible through the Internet at www.sedar.com and www.sec.gov/edgar/searchedgar/companysearch.html http: //www.sec.gov/EDGAR. Company Earnings Investment & Company Information NYSE Contact: MAG Silver Corp.. Michael Curlook VP Investor Relations and Communications (604) 630-1399 or Toll free (866) 630-1399 (604) 681-0894 info @ magsilver.com www.magsilver.com"}, {"articleID": "2020031204_00083288_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2020-03-11", "url": "http://uspolitics.einnews.com/article/511757563/BNkqp25NZxubKc8k", "content": "Hillary Clinton at the \"Hillary\" premiere in New York. Picture: Dimitrios Kambouris/Getty Opinion Hillary Clinton still thinks she can be President by Miranda Devine 11th Mar 2020 7:33 AM premium_icon Subscriber only 0 1 Surprise, surprise. Hillary Clinton is trailing her coat to be Joe Biden's Vice President, if not the Democratic nominee for President. Considering the cognitive impairment Biden is labouring under on the campaign trail, the roles are one and the same. Voters concerned about \"Sleepy\" Joe's senior moments and inability to string a sentence together without a teleprompter would be reassured by the presence of a stand-in, ready to go. After all, Hillary almost was President, was Secretary of State and, after eight years as First Lady, knows her way around the White House. And, at 72, she's five years younger than Biden. That's her take, anyway. She hasn't quite come out and said, \"Pick me\" but, as she launched a glowing four-part documentary about her life on Friday, the hints were too heavy to ignore. She still isn't over losing the 2016 presidential election to <mark>Donald Trump</mark>, for all her claims to have found contentment in her garden in bucolic Chappaqua, New York. Her latest suggestion came in an interview with CNN on Sunday when she said she would \"love to have a woman on the ticket, finally, again,\" she said. \"Obviously, I'd like to keep that moving, and actually have it happen in this election that someone would be the first woman vice president .\" Hillary Clinton said she'd \"love to have a woman on the ticket\" for President. Picture: Monica Schipper/Getty \"Someone\". Hmmmm. Wonder who? Last month she told talk show host Ellen DeGeneres that she'd consider being the Democrats' vice-presidential candidate in the November election, if asked. \"I never say never because I believe in serving my country, but it's never going to happen,\" she said, coyly. She has been inserting herself into this election cycle in a way that cries out unfinished business. Now that two white septuagenarians are the last men standing, she sees her opening. The Democratic establishment can't abide socialist populist Bernie Sanders, and they can't keep Biden in witness protection forever. At some point he'll be caught without the teleprompter and Hillary plans to be there for the rescue. She does interviews describing <mark>Trump</mark> as an \"illegitimate president,\" and mere \"occupant of the Oval Office\". She finds new excuses every day to explain away her election loss - from the Kremlin, Sanders, misogyny and self-hating women, to her campaign staff and the deplorables. With a newly wrinkle-free forehead and plumped-up cheeks, she and daughter Chelsea have been pressing the flesh at bookstores with their eponymous The Book of Gutsy Women and the upcoming Grandma's Gardens. On Friday, the hagio-documentary, Hillary, premiered on streaming service Hulu. There are moments where Hillary is surprisingly likeable, particularly in the first episode when we see her as a geeky young woman with thick glasses in the early 1970s breaking the glass ceiling at Yale Law school, and then giving up her shining career prospects to follow a shaggy-haired Lothario named Bill Clinton back to Arkansas. It is to her credit that she persevered with the marriage through all his philandering. However, her greatest strength is also her Achilles heel. The most prominent feminist politician in America showed just how shallow her commitment to the sisterhood is after Bill revealed in Hillary that he had used Monica Lewinsky like a stress ball when he was President. In a gobsmacking moment in Episode three, Bill, 73, dismisses his 1995 affair with the 22-year-old White House intern by saying it was something he did \"to manage my anxieties .\" Hillary's response was to go on TV last week and tell Watch What Happens Live host Andy Cohen how \"romantic and sensitive\" Bill is. \"I will come home sometimes, and he'll have flowers for me because he knows I've had a bad day. He's really so thoughtful .\" Not great timing. But the greatest insight in the Hulu doco comes when Hillary describes her great defeat in 2016. She was so devastated when she realised <mark>Trump</mark> had won the election that she lay on her bed in her suite at the five-star Peninsula Hotel in Manhattan, feeling \"bewildered and astonished\" and later \"collapsed in the back of the van\". Instead of trying to alleviate the anguish of her devoted supporters gathered at the cavernous Javits Center nearby, wearing their \"I'm With Her' T-shirts, she refused to make a concession speech, as Barack Obama had urged her to do in a phone call .\" Obama called me and he said, \"I'm really sorry but you probably should concede .' And I said,' I can't concede 'til the morning .' He said,\" Well, you gotta call <mark>Trump</mark>', and I said, \"oh brother',\" Hillary recalls. At 2am she dispatched her campaign chairman John Podesta to tell the crowd at the Javits Center it was \"too close to call\". It wasn't until 2.30 am that she called <mark>Trump</mark> to concede. But worse is to come. She describes in the doco how she was immensely cheered by the despair of Democrat voters, \"people crying on the sidewalks, holding their children up. [It was] like a death...\"What I loved was the reaction to the loss and the Resistance that grew up because of it,\" she said. \"It began to sprout almost immediately. There was a very big silver lining which made me feel somewhat better .\" This is not the reaction of a person who should ever be president of anything, not even the local school P & F. It's sociopathic. The destructive political polarisation in America over the past four years owes a great deal to Clinton's gracelessness. She embarrassed women by being such a sore loser and poisons any Democratic candidate who emulates her. @ mirandadevine More Stories Picture that proves the Queen has failed premium_icon Calm down. This is about TV programming--not gender premium_icon OPINION: Toilet paper aside, there are more serious issues premium_icon Parents, we need to talk about coronavirus prepping premium_icon Scott Cam can't offer aspiring tradies anything premium_icon Virus panic has taken our common sense, and our manners premium_icon No one seriously looks to the US for leadership any more Show More More Stories Picture that proves the Queen has failed premium_icon Calm down. This is about TV programming--not gender premium_icon OPINION: Toilet paper aside, there are more serious issues premium_icon Parents, we need to talk about coronavirus prepping premium_icon Scott Cam can't offer aspiring tradies anything premium_icon Virus panic has taken our common sense, and our manners premium_icon No one seriously looks to the US for leadership any more Show More 0 1 hilary clinton Read More Login to follow jo biden Read More Login to follow opinion Read More Login to follow politics Read More Login to follow usa Read More Login to follow hilary clinton jo biden opinion politics usa"}, {"articleID": "2013010713_00056441_W", "names": {"Paul Nixon": ["Q17388617", "Q3526760", "Q7152738"], "Mohammad Hafeez": ["Q21662941", "Q25189338", "Q3535271"], "Tony Greig": ["Q2038289", "Q7822491"]}, "date": "2013-01-07", "url": "http://timesofindia.indiatimes.com/sports/cricket/series-tournament/pakistan-in-india-2012/top-stories/India-Pakistan-Kotla-ODI-fixed-Paul-Nixon/articleshow/17924720.cms", "content": "read more <mark>paul nixon</mark> | <mark>mohammad hafeez</mark> | india vs pakistan \"pakistan throwing this game away eh. watch this space. pakistan will just loose last few balls,\" <mark>nixon</mark> tweeted. (toi photo) related new delhi: former england wicketkeeper <mark>paul nixon</mark> has sparked controversy by suggesting that pakistan deliberately lost the third odi against india at the feroz shah kotla in new delhi on sunday. \"pakistan throwing this game away eh. watch this space. pakistan will just loose last few balls,\" <mark>nixon</mark> tweeted after the sudden collapse of pakistan that helped india deny a clean sweep to the visitors. when one of his followers asked <mark>nixon</mark> whether he was claiming that the match had been rigged, the 42-year-old tweeted, \"r u watching the game???\" he further retweeted several tweets, including these two: \"this game is a joke especially when u see <mark>hafeez</mark> play a lap sweep with a leg slip in place\" and \"it must be india's 12th man...the bookmaker!\" <mark>nixon</mark> also said that it was no big deal for pakistan to throw the final match of the series when they had already clinched the series. \"2-0 up perfect to loose nothing matters,\" he tweeted in reply to a follower who questioned his assertion. <mark>nixon</mark> used hashtags like #somethingnotright and #dodgey. <mark>nixon</mark> has played 19 odis and one twenty20 international for england in 2007, including the world cup in the caribbean. share your views also on toi warne banned, fined for big ba...india win thriller at kotla ag...sachin tendulkar scores ton in...india vs pak: suresh raina imi...is the superstar culture to be...sachin chills out in mussoorie...<mark>tony greig</mark> passes away, cricke...michael hussey announces retir...no farewell for sachin tendulk...bcci welcomes tendulkar's reti...sachin announces retirement fr...team india unhappy with duncan...sachin tendulkar at 22nd posit...not right to reveal details of...dhoni evades controversy, says ..."}, {"articleID": "2019070803_00041238_W", "names": {"Diego Rivera": ["Q42868163", "Q58671627"], "Peter Gilmore": ["Q238704", "Q7174243"], "Jack Nicholson": ["Q39792", "Q58917121"]}, "date": "2019-07-08", "url": "http://www.afr.com/lifestyle/where-s-wally-jr-chronicles-the-street-life-of-san-francisco-20190704-p5249k", "content": "Lifestyle Photography Where's Wally? JR chronicles the street life of San Francisco The French photographer likened to Cartier-Bresson and Britain's Banksy has created a digital montage like none other as a homage to the city. Detail from \"The Chronicles of San Francisco\" , a 30-metre-long animated mural that can be seen at SFMOMA until April next year. Aviva Lowy Aviva Lowy Jul 8, 2019--12.11 pm Share Who doesn't love people watching; the pleasure of whiling away time while observing others going about their business. A new exhibition at the San Francisco Museum of Modern Art encourages visitors to do just that: stop a while and stare at the passing parade. The Chronicles of San Francisco, by the digital artist known as JR, is a creation so mesmerising that it's actually difficult to turn away from it. The Paris-born photographer has been described as the Cartier-Bresson of the 21st century. His large-scale mural--over 30 metres long--is both a portrait and an homage to the city. What at first appears to be a static black and white photo montage overcrowded with people is actually animated. Look there: a person is waving, and over there, another plaits her hair. A woman is giving birth. A group of swimmers are improbably floating through an open garage. Quotidian characters nestle alongside fantastical. Is that a unicorn? And someone dressed as Frida Kahlo? It's like a Where's Wally? book for adults, as you search the pageant for activity, trying to take in the whole and its many parts. The entire panorama also scrolls slowly across the screen, taking just over an hour to complete a full cycle. You're unlikely to get bored as there is always something new just coming into view...Assembling the work was a massive undertaking. JR and his crew created a mobile photographic studio in a 16-metre trailer truck, which they took to 22 locations around the city, inviting anyone and everyone to come and take part. In all, 1206 people appear on screen, all of whom were photographed, filmed and interviewed by JR.. No ordinary truck: JR's mobile studio. Lyle Owerko There are a couple of well-known faces, such as the Governor of California, Gavin Newsom, and Golden State Warriors basketball star Draymond Green, but for the most part these are ordinary folk--shopkeepers, children, homeless people, protesters, fire fighters, dog walkers. If your curiosity is piqued by any of the participants, iPad kiosks next to the mural allow you to click on the image of any one of them and hear a little of their story. You can dawdle here for hours. OR you can download the JR: murals app on your mobile phone, hover over a printed image, and then take a listen at home. Describing himself as an urban artivist, JR came to international attention when he was nominated for an Oscar in 2018 for a film he co-directed with the Belgian-born French film director Agnès Varda, Faces Places. The film documented the couple travelling around country France, photographing locals and posting these portraits as giant images on local buildings. More recently, in celebration of the 30th birthday of the Louvre's I.M. Pei glass pyramid in April this year, JR enlisted 400 volunteers to assemble a 2000-piece paper collage that made the pyramid appear to extend into a deep excavated cavity below the ground. The ephemeral artwork, covering 17,000 sq metres around the pyramid, existed for just a day as visitors trampled the ground, tearing and dispersing the paper. JR dedicated the work to Varda whose death coincided, almost to the day, with the event. The Louvre piece was a fitting coda to another trompe l’oeil he created at the site in 2016, when he covered up the pyramid with an image of the Louvre palace sitting behind it. The effect was to make the pyramid disappear from view by blending into the older building's facade. In 2016, JR effectively made I.M. Pei's glass pyramid disappear. Alamy At the time, The Guardian described this as an audacious act, \"the equivalent of Banksy becoming resident artist at London's National Gallery\". A fair comparison as, like Banksy, JR started out as a graffiti artist, tagging buildings. He swapped to photography after finding a camera in the Paris Metro. Since then he has created a number of significant installations, addressing polemical issues such as the US-Mexican border fence, the West Bank wall separating Palestinians and Israelis, gun violence, and the heroism of women in areas of conflict. JR's 21-metre-high installation of a child, \"Kikito\" , peers over the wall that partitions Mexico from the US. Alamy After years of turning his lens on others, JR himself has become the focus of attention. Last year he was named one of Time's 100 most influential people of 2018. For his project at the San Francisco Museum of Modern Art, JR is said to have been inspired by the murals of <mark>Diego Rivera</mark>--and perhaps the appearance of the Kahlo character, <mark>Rivera</mark>'s wife, is a nod to him. The mural will be on display for a year. It will be replaced in the second half of 2020 by <mark>Rivera</mark>'s mural Pan American Unity, which dates back 90 years and was also a commission of the museum. As Neal Benezra, director of the museum since 2002, says: \"Our city has been home to a rich and expressly democratic tradition of mural commissions .\" If you go Chronicles of San Francisco shows in the Roberts Family Gallery, which opened in May 2016 as part of the newly expanded museum. Included in the renovations are two other attractions well worth experiencing during a visit. The museum's colour-saturated toilets. Aviva Lowy The first is the fine-dining restaurant In Situ, under chef Corey Lee, who also owns the San Fran restaurants Monsieur Benjamin and the Michelin-starred Benu. He's described as the museum's \"food curator\" , an apt title as In Situ is a showcase of dishes contributed by 90 chefs from around the world. At our lunch, we \"travelled\" from Paris (red onion and coconut soup) to Copenhagen (raw lobster, yuzu cream and hibiscus) and Brazil (tapioca and cheese fritters). The current menu includes a recipe from <mark>Peter Gilmore</mark> of Quay in Sydney (smoked confit pig jowl, shitake, shaved sea scallop, Jerusalem artichoke leaves). It's a convenient way to taste the creations of the superstar culinary world without needing to score elusive reservations. The second treat is a visit to the bathrooms. The Norwegian architecture firm Snøhetta, which is responsible for the renovation, has created lavatories befitting their station. They have been described as works of art unto themselves \"and making the museum's art\" sing \". In response to the many stark white exhibition walls, the toilets on each floor are bright monochrome pops of colour, all red for one, all green, blue, purple or turquoise for the others. Floor to ceiling. Last year, they were shortlisted for the America's Best Restroom contest. Who knew there was such a thing? NEED TO KNOW The Chronicles of San Francisco is on until April 27, 2020. JR will give an artist's talk on September 27. San Francisco Museum of Modern Art 151 Third Street, open daily except Wednesdays. Share Print article License article Topics Photography Art Travel Destinations Life & Leisure Latest Stories Funding Employment Hero valued at $100m after $22m investment Employment Hero has secured a $22 million cash injection to build a\" WorkLife Passport' for workers to carry a digital footprint of their employment history. 9 mins ago Funding Silicon Valley investors pile into Aussie start-up An investment tech start-up called Jacobi, founded by a trio of Brisbane entrepreneurs, will hit the UK after scoring $11 million from US investors. 9 mins ago World politics Detained writer's wife banned from leaving China The wife of an Australian writer who has been detained in China for six months has been banned from leaving the country and was questioned by authorities for several hours on Sunday. 14 mins ago World election Greece's softly spoken new PM has a nation to convince Kyriakos Mitsotakis will have to persuade a sizeable chunk of the Greek population that he is up to the task of leading the exhausted nation into better times. 18 mins ago Most Viewed In Lifestyle Generation Dry is out and proud How to make the perfect excuse The power of art to invoke change After an \"overcrowded' Everest season, two climbers seek a new route Fire ruins 45,000 barrels of\" young whisky' The young head chef who restores cars on the side Jock Zonfrillo is creating a billion-dollar industry from native foods 6 dishes that define Australia at its most inventive What fashion can teach you about economics The beer-makers at Australia's wild frontier The great pointy-end points heist <mark>Jack Nicholson</mark>'s trick can work for leaders, too What Uber's CEO asks when hiring How Carsales chief sets himself up for the day Let's face it, email has had its day Where's Wally? JR chronicles the street life of San Francisco Horse riding is \"moving meditation' for this director A modern Japanese take on a pilgrim's path Racing Ferraris keeps this director on track On the hunt with a very hungry leopard Special Reports Driving income without taking too much risk Managing conflict the next step Managing wealth after retirement Dealing with the demographic challenge Technology boosting financial literacy"}, {"articleID": "2017100507_00300267_W", "names": {"Anthony Griffin": ["Q4772632", "Q4772633"], "Phil Gould": ["Q7181928", "Q7181933"]}, "date": "2017-10-05", "url": "http://theherald.com.au/story/4970051/knights-confirm-signing-of-origin-prop-lillyman/?cs=12&utm_source=latestnews&utm_medium=cpc&utm_campaign=Latest", "content": "\"The Knights have got some great young players, especially in the forwards, and I am keen to help them in their development .\" View More Local Business List Your Business Here The Knights have taken another step in their NRL rebuild, signing veteran prop Jacob Lillyman on a one-year deal. RECRUIT: Jacob Lillyman His recruitment comes just two days after the club had announced premiership-winning Melbourne forward Slade Griffin has also been lured to Newcastle until the end of the 2019 season. With 250 NRL games and 14 State of Origin matches for Queensland, the long-serving Warriors' prop brings a wealth of experience to the Knights' young roster. Already on the recruitment list are Brisbane duo Herman Ese’ese and Tautau Moga, and Sydney Roosters pair Aidan Guerra and Connor Watson. The biggest fish is North Queensland teenage sensation Kalyn Ponga. \"Newcastle is a good young team on the up and I'm really looking forward to getting over there and getting stuck in,\" the 33-year-old Lillyman said in a statement on the club's website on Thursday. \"I think the Knights have got some great young players, especially in the forwards, and I am keen to help them in their development .\" Newcastle is a very proud rugby league region and town and I can't wait to experience that, first hand. \"Lillyman could soon be joined at the Knights by another front-row veteran, Chris Heighington, who has reportedly been released by the Sharks. Meanwhile, <mark>Anthony Griffin</mark> will guide Penrith until the end of the 2020 NRL season after Panthers boss <mark>Phil Gould</mark> confirmed a two-year extension for the head coach at their end-of-season awards night this week. Following a semi-final finish this year, <mark>Gould</mark> praised <mark>Griffin</mark> for being just the second coach in the club's history to lead the Panthers to consecutive finals appearances. The former Brisbane mentor had been tipped to remain at the foot of the mountains since midway through the year and <mark>Gould</mark> announced the deal on Wednesday night .\" He's had a wonderful start to his term here at Panthers, \"<mark>Gould</mark> said .\" His first two years at the club we've qualified for the finals. It's the first time we've been back-to-back finals for something like 15 years, and only for the third time in the club's history. \"He becomes only the second coach to do it in his first two years of coaching the Panthers .\" So much so that he's been rewarded with an extension of his contract until the year 2020, he brings a lot of great qualities to our club. \"But while <mark>Griffin</mark>'s long-term plans has now been finalised, speculation continues to surround the short-term future of star captain Matt Moylan. Despite being in rehabilitation to address mental issues since the start of the finals series, the Panthers five-eighth is believed to want out and has been linked with a number of rival clubs. <mark>Gould</mark> made no mention of Moylan's status on Wednesday, but insisted forward Sitaleki Akauola would be the only player to depart from this year's squad. He said 24 players of next year's 30-man squad will have come through their program .\" And that's really special for us, so much so that we do not have to recruit a player from outside this club for the next two years, provided we retain all the players that we've got, \"he said .\" This year we will only lose one player, Sitaleki Akauola. We're not recruiting one player from another club because we've developed from within and we've built from within. \"<mark>Gould</mark> also said their premiership window was open for the next two seasons and pre-empted the salary cap squeeze would follow .\" It's a fact of life that salary cap will erode into this, \"he said .\" As I've said to all the players, as soon as one of you wants a few more dollars, someone else has got to go. If someone else wants a few more dollars, that's another that's got to go. \"But our window of opportunity over the next two years when we don't have to recruit from outside, and we don't have to lose a player, gives this team and this club an opportunity to do something really special. I want to see it happen with this group of people .\" "}, {"articleID": "2019101012_00201077_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Matt Donovan": ["Q6380379", "Q6788574", "Q6788575"], "Barbara Barrett": ["Q3500791", "Q42306056"]}, "date": "2019-10-10", "url": "http://m.military.com/daily-news/2019/10/10/air-force-concludes-investigation-aircrew-trump-resort-stays.html", "content": "FILE - In this July 29, 2015 file photo, a helicopter owned by <mark>Donald Trump</mark> departs from the Turnberry golf course in Turnberry, Scotland. (AP Photo/Scott Heppell) 10 Oct 2019 Military.com | By Oriana Pawlyk JOINT BASE MCGUIRE-DIX-LAKEHURST, N.J.--The U.S. Air Force has concluded an internal travel log investigation prompted by a C-17 Globemaster III stop at Scotland's Glasgow Prestwick Airport earlier this year, and the airlift crews' subsequent decision to stay at a Trump-owned property. \"The [investigation] will show that the policies or procedures we had in place for both using civil airfields and lodging, and the crews [decisions] aligned with [current] policy,\" Gen. Maryanne Miller, head of Air Mobility Command, told Military.com Wednesday. Miller, who signed off on the investigation this week, has submitted it to Air Force Chief of Staff Gen. David Goldfein and Acting Secretary <mark>Matt Donovan</mark> for additional review; the Air Force Inspector General will have final authority over the report before it is submitted to Defense Secretary Mark Esper. \"If you look at Prestwick and you look at the rules for lodging that our crews abide by, 77% of the crews stayed right around there,\" Miller said during an interview here. The Air Force reviewed records and travel vouchers between 2015 and 2019. Another 17% stayed near Glasgow, about 30 miles away; and 6% of other crews stayed at the Trump Turnberry Luxury Collection Resort, roughly 20 miles away, she said. The breakdown is similar to what officials had already provided to lawmakers in recent weeks, AMC said. \"They rolled to Turnberry only because others weren't available,\" the general said. \"Turnberry is not a first option. You end up rolling down [there] as a solution .\" Miller continued, \"There was no violation of anything. There was nothing that was out of alignment with all of that; and we even looked at the perception side of things, and the crews just did exactly what they were supposed to do .\" The House Committee on Oversight and Reform recently began investigating U.S. military stopovers at Prestwick as part of a larger probe into military stays at Trump-owned properties. Related: Air Force Defends C-17 Crew's Stopover at Scotland Trump Resort In March, a C-17 crew, consisting of seven active-duty and National Guard crew members from Alaska, stayed at Trump's Turnberry resort when en route to Kuwait; they only landed at Prestwick airport on the return trip to the U.S., according to the Air Force. But the stop in Scotland prompted the committee to investigate whether U.S. military stays have boosted Turnberry's revenue. An exchange between the Pentagon and lawmakers last month revealed the Defense Department has spent nearly $200,000 at Turnberry since Trump became president in 2017. In a letter from the committee to Esper dated Sept. 18, lawmakers wrote that the Defense Department's response to their query was \"belated and deficient,\" but added that the Pentagon revealed total military spending at Turnberry could be \"more than $184,000\" if calculating in unspecified charges unrelated to hotel rooms. It remains unclear whether associated travel guidance will be updated via Congressional mandate, or if DoD will consider a military-wide policy. Despite the initial findings of the service, lawmakers still want assurances the service will make ethical choices going forward. Sen. Richard Blumenthal, a Democrat from Connecticut, announced Sept. 19 that he intends to place a hold on <mark>Barbara Barrett</mark>, Trump's Air Force secretary nominee, stalling a confirmation vote unless she assures the committee she will \"implement a policy to prohibit Air Force spending at Trump-owned properties .\" During her confirmation hearing Sept. 12, <mark>Barrett</mark> demurred on whether she would issue a sweeping policy, but said any guidance should keep the appearance of propriety in mind. Blumenthal then voiced his displeasure with her answers. \"Ambassador <mark>Barrett</mark> refused to provide a clear commitment to ending unnecessary Air Force spending at President Trump's lavish Scottish hotel. This is unacceptable, especially for a service secretary in an administration run by Grifter-in-Chief <mark>Donald Trump</mark>,\" Blumenthal said days after her testimony. The Senate is expected to vote on her confirmation following its two-week recess .--Oriana Pawlyk can be reached at oriana.pawlyk @ military.com. Follow her on Twitter at @ oriana0214. Read more: Army Confirms Two Soldiers Being Treated for Severe Lung Injuries from Vaping Show Full Article Related Topics Military Headlines Air Force Topics <mark>Donald Trump</mark> Military Scandals © Copyright 2019 Military.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2010090814_00155631_W", "names": {"H?Ctor Reynoso": ["Q1369230", "Q5906386"], "Jorge Campos": ["Q26775234", "Q27039095", "Q313761", "Q5934685"]}, "date": "2010-09-08", "url": "http://rbr.com/radio/radio-programming/27309.html", "content": "radio programming | chivas de guadalajara vs. chivas usa to air on w radio 690 am chivas de guadalajara vs. chivas usa to air on w radio 690 am socal's w radio 690 am says the broadcast of the \"chivaclasico\" soccer game between chivas usa of major league soccer and club deportivo guadalajara of the mexican first division will take place on tuesday, 9/14 from petco park in san diego at 8:00 p.m. pt. this year's \"chivacl? sico\" - which features copa libertadores finalist chivas de guadalajara against its los angeles-based counterpart, chivas usa - is the second edition of the match, with the teams having squared off almost a year ago at the rose bowl stadium in pasadena, ca, where omar arellano scored two goals to give chivas de guadalajara the 2-0 victory. chivas de guadalajara, mexico's most successful club in history with 11 league championships, is famous for using only mexican players and features many of the top players in the country, including jonny magall? n, adolfo \"bofo\" bautista, alberto \"venado\" medina and luis michel, who all represented mexico at the 2010 fifa world cup in south africa. other stars on the team include omar bravo, edgar mejia, patricio \"pato\" araujo, and <mark>h? ctor reynoso</mark>. in just its sixth season in major league soccer, chivas usa has established itself by making the playoffs for four consecutive seasons and appearing in three straight editions of the superliga, and this season, the club is in the semifinals of the lamar hunt u.s. open cup. led by united states world cup veteran jonathan bornstein, the team features an international roster including mariano trujillo and rodolfo espinoza of mexico, paulo nagamura of brazil, and venezuelan forward giancarlo maldonado, as well as former chivas de guadalajara player jes? s padilla. w radio is the flagship station for soccer in los angeles and san diego. the station holds exclusive radio rights for chivas de guadalajara, chivas usa, copa santander libertadores, copa nissan sudamericana and renowned <mark>jorge campos</mark>' show, \"f? tbol mexicano? al d? a!\" ."}, {"articleID": "2013030719_00029579_W", "names": {"Mehdi Hosseini": ["Q21621496", "Q452959"]}, "date": "2013-03-07", "url": "http://ITBusinessNet.com/articles/viewarticle.jsp?id=2468380", "content": "german industry orders unexpectedly slide in january us-germany-orders: german industry orders unexpectedly slide in january berlin (reuters) - german industrial orders unexpectedly slid in january as orders from the euro zone dropped sharply, economy ministry data showed on thursday, disappointing hopes europe's biggest economy had picked up after a dismal end to last year. seasonally and price-adjusted order intake fell 1.9 percent on the month, undercutting even the lowest forecast in a reuters poll of 39 economists. the consensus forecast had been for a 0.5 percent rise in bookings. domestic orders were down 0.6 percent, while orders from abroad dropped 3.0 percent, driven by a 4.1 percent decrease in contracts from the euro zone. \"the decline in orders at the start of the year suggests that the industrial sector has not yet overcome its weak phase,\" the economy ministry said in a statement. ryan beatty says hey to la in his new music video, and also opens up about what he hopes fans take away from his tunes! just releasing his newest music video for his single, \"hey la\" --we see the singer experience california for the first time...twilight breaking dawn part 2 new trailer and parody video it's friday, so let's laugh, shall we! in this hilarious viral twilght parody, edward and bella talk all things fish and cake!? bella and edward reunite in this very funny bad lip reading parody! okay, so it's actually scenes from the movie t.. . apple news - <mark>mehdi hosseini</mark>, iphone, foxconn samsung's investment in sharp could prick appleapple still no. 1 smartphone makerios gains on android in january as windows phone remains stagnantiphone 5s production reportedly now underway samsung electronics news - sharp, apple, new york times"}]