[{"articleID": "2010020314_00125882_W", "names": {"Jack Johnson": ["Q1390184", "Q20984477", "Q21095529", "Q21583280", "Q23683490", "Q27055829", "Q297097", "Q373161", "Q6113351", "Q6113357"], "Simon Fox": ["Q38803692", "Q7518773"]}, "date": "2010-02-03", "url": "http://ticketnews.com/HMV-Mama-Group-deal-complete-live-music-and-ticketing-growth-planned210303%20", "content": "gruvr develops search for haiti benefit concerts in wake of disaster utah house member backs off after introducing anti-scalping bill live nation entertainment pays out millions in bonuses after merger is approved <mark>jack johnson</mark> revives kokua festival for sixth season ahead of world tour new jersey sports & exposition authority remains undecided on ticketing contract 2009 nfl ticket sales hold strong for top teams, but economy hurts weaker clubs natb makes push for more members and contributions to legal fund corinne bailey rae tour brings \"the sea' to north american audiences ticketmaster / live nation merger: promoters angry about their data being compromised hmv/mama group deal complete, live music and ticketing growth planned super bowl, pro bowl ticket sales help keep sun life stadium the top venue gruvr develops search for haiti benefit concerts in wake of disaster liberty media begins tender offer for larger stake in live nation live nation entertainment pays out millions in bonuses after merger is approved <mark>jack johnson</mark> revives kokua festival for sixth season ahead of world tour hmv/mama group deal complete, live music and ticketing growth planned wed, feb 3rd 2010 9:27 am est by richard kastelein hmv's recommended cash offer for mama group has been declared unconditional and the deal is done. hmv said that as at january 29th it had received valid acceptances in respect of 455,812,753 mama shares or 56.4 percent of the total .\" i am delighted that our offer for mama group has been successful, and to welcome our new colleagues from mama to hmv, \"said hmv chief executive <mark>simon fox</mark> in a statement .\" the acquisition represents a further significant step for hmv as we continue the transformation of our business begun in 2007. building on the successful platform created by the formation of our joint venture with mama just over a year ago, we will be embarking on exciting new growth plans for the group in live music and ticketing. \"the mama group is comprised of three divisions: - live music, which includes the barfly network of live music venues, the hammersmith apollo, the jazz cafe, the forum and the borderline in london and also holds interests in live music events including the lovebox festival; - artist services, which includes artist and producer management, music publishing, merchandising and investments in recording businesses; and the fly, one of the uk's widest distributed music magazines, campus group, a collection of specialist media and marketing agencies working for clients interested in the student and wider youth audiences and a ticketing business. music and media solutions is responsible for all brand partnerships activity and is uniquely positioned to integrate and deliver a variety of brand objectives across mama group's stable of assets. hmv group (lse: hmv) is an international entertainment retail chain and is the largest of its kind in the united kingdom and canada. the company also operates stores in ireland, hong kong and singapore. it is listed on the london stock exchange and is a constituent of the ftse 250 index. acquisitions by the hmv group include waterstone's in 1998 from w h smith, the music retailer fopp in august 2007, and selected zavvi retail outlets in february 2009. <mark>simon fox</mark> has been chief executive officer since 28 september 2006. for this role he is paid an annual salary of £ 493,000. who's online there are currently"}, {"articleID": "2009030211_00031125_W", "names": {"Steve Young": ["Q16185674", "Q18818306", "Q30122679", "Q4356818", "Q55634010", "Q740086", "Q7614385", "Q7614386"], "Dennis Byrd": ["Q5258245", "Q5258246"], "Greg Moore": ["Q1544964", "Q16732811", "Q16855293", "Q3791646"], "David Boone": ["Q38053862", "Q59140285"], "Bill Stevenson": ["Q177111", "Q18808528", "Q23005315", "Q4911009"], "Pat Quinn": ["Q16250611", "Q328604", "Q460291", "Q712344", "Q7143937", "Q7143938", "Q7143939"], "Colin Campbell": ["Q1108386", "Q1108388", "Q1108411", "Q1108531", "Q19414277", "Q22323626", "Q27345368", "Q43911673", "Q5144955", "Q5144956", "Q5144961", "Q55469116", "Q5601509", "Q5601513", "Q56380383", "Q56524218"], "Olli Jokinen": ["Q18632809", "Q28785376", "Q28785633", "Q706944"]}, "date": "2009-03-02", "url": "http://ottawasun.com/Sports/OtherSports/2009/03/02/8584341-sun.html", "content": "help pro sports can make you rich. they can make you famous. they will most certainly make you hurt and they might even make you dead. the college recruiters, player agents and the public know all about the first but hardly anyone is eager to mention that last bit. every professional team's season highlight video has pictures of happy, healthy athletes, dancing girls and touchdowns, goals and winner's circle celebrations. rarely is the public reminded of the cost--one that can be counted in blood, broken bones and lost dreams. in fact, many of the players don't even understand the ravages that sport can inflict on their bodies. and, even if they do, it's not as if it would suddenly make anyone decide to give up being a quarterback or nascar driver to take up an exciting career in bookkeeping. the center for disease control and prevention estimates that about 300,000 sports-related concussions are suffered each year in the u.s. the average elite athlete will die by age 67, considerably lower than the 76-year life expectancy of the average american. according to the nfl players' association, the average life expectancy of an nfl player is 58 years. \"there's a dramatic difference from the rest of society,\" says stu laird, president of the canadian football league players' association. \"there are some insurance carriers who won't insure them past 51. i've heard figures anywhere from 55 to 59...it's quite dramatic. i wouldn't imagine the cfl to be a lot different in that regard .\" soccer leagues in europe are doing studies that show significant brain damage in players from mid-air collisions and from striking balls with their heads. hockey recently saw the death of don sanderson, a senior player with the whitby dunlops. that is an isolated incident. but serious injuries are not--an nhl player will suffer on average three injuries a season. that can be anything from bruises and lost teeth to herniated discs and concussions. laird understands the dangers and the sacrifices athletes make physically, personally and emotionally. and with team salary caps of $4.2 million for a 40-man cfl roster, nobody is getting rich. the average nfl and cfl career is less than four seasons. but as a 13-year veteran who retired in 1996, laird also understands why <mark>young</mark> athletes will challenge those odds. \"when you're 20, you feel bullet-proof. retirement? getting old? that's 30 years down the road...you don't think that far ahead. i know i wouldn't have given it up for the world. we were having such a good time .\" and, the good times do roll. \"it's glamorous. no doubt a unique lifestyle,\" says toronto maple leafs player development coach paul <mark>dennis</mark>, of the pro lifestyle. \"guys go from making $65-a-week riding the buses from regina to seattle to earning hundreds of thousands of dollars .\" but there is also the reality of eric lindros lying in a crumpled heap with the fairies dancing in his brain. some, such as race-car drivers gilles villeneuve, <mark>greg moore</mark> and dale earnhardt, pay the ultimate price in deadly crashes. jockey avelino gomez's brilliant career ended with a deadly fall at the 1980 canadian oaks. then there are the after-shocks. there is the reality of former cfl lineman <mark>david boone</mark>, found dead on the deck of his home of an apparent suicide. <mark>boone</mark>, who won five grey cup rings with edmonton, suffered from chronic pain and depression believed to have been brought on by haunting football injuries. teammate york hentschel died of organ failure at age 52. another teammate, <mark>bill stevenson</mark>, couldn't escape the bottle. last year, b.c. lions' terry bates broke two vertebrae in his neck and then discovered that the league allowed teams to release injured players and cut their benefits at $60,000 before the next season's training camp. the league's disability plan leaves a bit to be desired. the players hope to improve it in future negotiations with the owners but economics, as always, restricts what the league can do. but money does not heal all wounds. in the nfl, a neuropathologist found that concussions andre waters sustained playing football led to his depression and suicide. former pittsburgh lineman justin strzelczyk was killed in a high-speed police chase. a post-mortem showed he suffered from chronic traumatic encephalopathy, which causes depression and dementia and is usually found in people more than 80 years old. strzelczyk was 36. \"the elite athlete grows up believing he is invincible,\" says sports agent boblamonte. he is also an educator and on the board at new york university. \"they've grown up being the strongest, the best. that invincibility doesn't allow them to see the forest for the trees. you're indestructible. even if they're shown otherwise, they don't see it. it's the classic\" you're not talking about me' syndrome. it's you, and me, and bob, we go into pro sport and we were great in junior high, great in high school, we were great in college and now we're in the pros and it's never going to end. we're the greatest that ever was. \"the adulation, the money and the excitement of pro sports can be intoxicating. today, glenn healy is director of players affairs for the nhl players' association but there is a certain boyish charm to the excitement that comes into his voice when he recalls the 1994 playoffs .\" the challenge, that rush you feel when you're trying to win a championship; i still remember how we felt with the rangers when we stepped on the ice with one game to win in game 7. where are you going to get that? you find me the office anywhere that can match the rush of that experience. you can't. \"it is a high that cannot be diminished by psycho-babble or medical statistics .\" even today, i still miss playing, \"says laird, and he hasn't strapped on the pads in 13 autumns .\" if you look at other sports, baseball, hockey, volleyball, basketball, you can still play the game at a recreational level for a long, long time. but when football is over, you're done. the game just leaves you. there are very few opportunities to stay involved. \"so dallas cowboys quarterback troy aikman hung on through 10 concussions before retiring. san francisco quarterback <mark>steve young</mark> suffered four concussions in three years before he stepped down. in the nhl, mike richter retired only after doctors told him one more concussion might leave him with a lifetime of headaches .\" the game beats you up. you typically don't leave healthy, whether it's a knee, an ankle, a hip. we're like timebombs. we feel good at 35, \"healy says,\" but i'm starting to see guys now who have had hips replaced, knees replaced. you just abuse your body and play when you shouldn't. \"look at <mark>pat quinn</mark>, ken dryden, <mark>colin campbell</mark>, steve yzerman--all had post-career operations. a lot of guys get things done .\" boxing and soccer players are susceptible to many of the same types of injuries. even women's hockey isn't immune. in a study of ncaa sports, women's hockey players were twice as likely to suffer a concussion than their male counterparts. it is the most dangerous female sport, on par with men's soccer. but none compare with pro football. \"in many cases the players are their own worst enemies,\" laird says, \"in the sense that they want to play...to help the team. you don't want to be the person to let down the team and you'll push yourself to extremes. it's such a macho sport...we have to educate people that there could be long-term consequences .\" the anecdotal evidence sometimes seems overwhelming, even when the science is sketchy. the hamilton tiger-cats lost two promising players. defensive back jamaica jackson, 26, died of heart failure last april. offensive lineman travis claridge, 27, died mysteriously in las vegas of \"acute pneumonia, exacerbated by respiratory depression brought on by intoxication with the painkiller oxycodone,\" according to a cbc report. a few years ago, a mental breakdown put barret robbins, the oakland raiders pro bowl centre, in hospital on super bowl sunday. former blue bomber nick benjamin died at 46 of kidney failure, his body so beaten up he had to crawl to the bathroom at night. \"you have to be such an extremely fit individual to play at this level that it is hard to understand why these same guys are so susceptible later,\" laird says. \"how can that be the same person?\" last summer, former tiger-cat receiver leif pettersen, 57, died of a heart attack. former alouettes star tony proudfoot has lou gehrig's disease. sometimes pain becomes familiar and unquestioned. laird says that could explain what happened with his nfl counterpart gene upshaw, who was diagnosed with cancer on a sunday and was dead within the week. \"you just get used to the pain,\" laird says, \"you look at someone like gene...he thought all that pain he felt was because he played 16 years. i'd seen gene in march and noticed he lost weight but he looked great. someone else would've felt that and gone to a doctor .\" the stories tend to be less catastrophic in the nhl, but equally heart-breaking. pat lafontaine and brett lindros lost nhl careers prematurely due to concussions. eric lindros was also forced from the game after too many blows to the head. he is not going gently into the dark. \"you have big strong men, there's going to be high impact. inevitably concussions will occur. that being said, the respect level of our game has diminished so much that it has never been this low,\" says eric, who recently stepped down as an ombudsman with the players' association. the average nhl career is over in less than five years. and, while not everyone leaves on a stretcher, it doesn't minimize the hurt. \"i'd hate to see these goaltenders today who go down on every shot. i'd hate to think what their knees and hips are going to be like at 60,\" healy says. still, leave it to a puck warrior to find some levity amidst the ruins. \"you shake hands with johnny bower and you think:\" are those feet or hands?' he's broken every finger. they are, \"says healy, chuckling,\" enormous: like oktoberfest sausages. \"--the disabled list the following are examples of competitors who were severely injured while competing in their chosen sports.in some cases the injuries were career-ending or fatal. former buffalo sabres goaltender clint malarchuk bleeds profusely after his carotid artery was severed by the skate of st. louis blues' steve tuttle during a collision on march 22, 1989, in buffalo. more than 300 stitches were required to close the wound. florida panthers foward richard zednik, centre, is helped from the ice after his carotid artery was accidentally cut by the skate of teammate <mark>olli jokinen</mark> feb. 10, 2008, coincidentallyin buffalo. auto racing is inherently dangerous. many drivers have suffered serious injury or died as a result of crashes over the years. but few as high profile as seven-time nascar champion dale earnhardt sr. earnhardt was killed when he suffered a basilar skull fracture among other injuries in a last-lap crash during the 2001 daytona 500. earnhardt's death was the catalyst for various safety improvements in nascar. former buffalo bills tight end kevin everett is tended to by emergency personnel after sustaining a fracture and dislocation of his cervical spine during an nfl game in 2007. everett was temporarily paralyzed, but fortunately regained the ability to walk. he never played another game in the nfl. some other former nfl players to suffer serious neck injuries include mike utley (detroit lions, 1991), <mark>dennis byrd</mark> (new york jets, 1992) and mack strong (seattle seahawks, 2005). published by sun media corporation, a quebecor media company"}, {"articleID": "2017061414_00904466_W", "names": {"Jim Whelan": ["Q21459473", "Q6198889"]}, "date": "2017-06-14", "url": "http://www.mycentraljersey.com/story/news/environment/2017/06/14/bringing-balloons-down-earth-bill-would-end-mass-release/375533001/", "content": "Skip in Skip x Embed x Share CLOSE Environmentalists push for N.J. balloon ban. Wochit Buy Photo Balloon releases like this one in 2012 where Brownies, Daisies, and troop leaders release balloons bearing messages to veterans, would be banned under a bill making its way through Trenton. (Photo: File photo) Buy Photo CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Intentionally releasing helium-filled balloons as part of celebrations, remembrances or any organized event could soon be illegal in New Jersey. A bill introduced last month and making its way through the legislature bans the release of balloons because they are a significant source of litter when they fall to the ground, can be a danger around power lines and threaten sea turtles and other wildlife that mistake balloons for food. But a ban won't come without a fight. Representatives for the balloon lobby plan to meet with the bill's sponsor--Sen. <mark>Jim Whelan</mark>, D-Atlantic--to persuade him to drop the measure. The Trenton-based Balloon Council beat back a similar attempt in New Jersey three decades ago and has spent more than $1 million in the past five years lobbying legislators against regulations, state records show. The group, a coalition of balloon manufacturers and retailers, has also spent hundreds of thousands of dollars in the past few years defeating proposed bans across the nation. The bans \"are a threat to a lot of mom and pop businesses in the balloon industry,\" said Dale Florio of Princeton Public Affairs, the powerful Trenton lobbying group that represents the Balloon Council. \"It creates a negative narrative about balloons, which is unfounded .\" But the idea has taken hold again in New Jersey. Recently, bans have been enacted in a handful of municipalities along the Shore, including Atlantic City. <mark>Whelan</mark>'s bill is similar to those bans. Advocacy groups, including the Association of New Jersey Environmental Commissions and Hackensack Riverkeeper, have begun lobbying towns in North Jersey to enact similar measures. \"Having it town by town is spotty,\" <mark>Whelan</mark> said. \"If another town allows balloon releases, it really doesn't take care of the problem. A statewide ban does .\" Buy Photo Balloon releases are done at a myriad of events. Here a girl releases a balloon in 2013 at the Feast of Saint Joseph at St. Joseph Catholic Church in Lodi. (Photo: File photo) <mark>Whelan</mark>, who introduced the bill on May 15, said he has already been contacted by lobbyists for the council and said he will entertain a meeting with them to discuss the bill. Violators could be fined up to $500 under the bill. Although balloon releases have long been common at celebrations and public memorials, there has been a push nationwide to stop the practice. States like Connecticut and Florida have banned the release of 10 or more balloons at one time. The U.S. Fish & Wildlife Service says balloons are a real threat to animals. The agency has urged people not to release balloons and has even posted grisly photos of dead birds and a turtle on a webpage. In recent months, Atlantic City, Margate, Ventnor and Longport have passed bans at the urging of environmental groups concerned about the coastal impact. Buy Photo Friends and family release 42 balloons in 2013 at a vigil in North Bergen near the site of a hit-and-run accident. (Photo: File photo) And with graduation season underway, PSE & G recently reminded its customers not to release foil balloons because they can drift into electric lines and cause power outages. The metal foil can cause a short circuit. The Balloon Council has argued that the threat to wildlife has been blown out of proportion. Although latex balloons can be found tangled in trees or littering beaches, they have not risen to the level of common litter like bottles and cans, the council says. This is not the first time a statewide ban was proposed. In 1989, the state Assembly unanimously passed a bill that prohibited all but scientists from releasing more than 10 helium balloons a day. But the Balloon Council lobbied against the measure, which died in the Senate. \"Policymakers have been very appreciative of the efforts put forward by the industry,\" Florio said. ENVIRONMENT: Pressure building in debate over releasing balloons CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: https: //njersy.co/2t1NnYS"}, {"articleID": "2012082820_00037694_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Jim Messina": ["Q3088816", "Q6196934"]}, "date": "2012-08-28", "url": "http://adelaidenow.com.au/news/world/mitt-romneys-wife-ann-to-argue-his-case-at-republican-national-convention/story-fnd11ay0-1226460373117?from=public_rss", "content": "mitt romney's wife ann to argue his case at republican national convention poised at last to claim the prize he's been chasing for years, mitt romney has barrelled into tampa, florida, as republicans worked to showcase him at their national convention as a man who understands everyday americans and a leader who can fix the economy. ann romney, the woman who knows him best, said she was tickled that her husband would be on hand for her evening speech to the convention. and tough-talking new jersey govermor chris christie was ready to make the case in his keynote address for mr romney as the right leader to get the economy moving. \"it's going to be fun for him to be there,\" mrs romney told reporters before touching down in tampa, where she headed to the convention hall for a microphone check, practicing with a few lines from lincoln's gettysburg address. running mate <mark>paul ryan</mark> arrived in the convention city, too, still tweaking the speech he'll deliver tomorrow. but with new orleans and much of the gulf coast waiting fearfully to see where hurricane isaac makes landfall, politics became an awkward enterprise and no one knows what sort of party the republican gathering will turn out to be. after a one-day weather delay, the convention proceeds according to its latest script: delivering mr romney the presidential nomination he fought years to achieve, calling the party to unify around him and setting the stage for the final stretch of the hotly contested campaign to unseat president barack obama. mr obama, not one to cede the spotlight, tended to presidential business, urging gulf coast residents to prepare for the approaching storm. and then he headed out on a three-state campaign trip focused on winning over college students. mindful of the political perils of campaigning in the face of a natural disaster, aides said mr obama was open to adjusting his schedule if warranted. but campaign spokeswoman jen psaki added: \"it's important for him to be out there less than 70 days before the election making the case for why he's a better choice for the american people .\" mr romney has finalised his own friday aest convention speech, said aide stuart stevens, and it will be \"a clear vision of a romney presidency and very much from his heart about america and why he wants to be president and what his presidency would be like\". the cash demands of campaigning never far away, mr romney worked two fundraisers into the schedule for his first day in tampa, while ann romney and mr <mark>ryan</mark> both popped out new email appeals for campaign contributions. obama campaign manager <mark>jim messina</mark> was out with his own fundraising appeal for cash to fight what he said were sure to be distortions at the republican convention. the day's convention business got under way at midafternoon, with a string of republican governors and congressional candidates set to warm up the crowd for the roll call of the states that will nominate mr romney and the evening's main speakers. mr christie, ready for his keynote address, said that for those americans who aren't yet sold on mr romney, \"you start turning it around tonight\". in a round of morning talk-show appearances, mr christie said ann romney would humanise her husband for the nation, and that his own speech would make the case for mr romney's economic credentials. but ultimately, mr christie said, it will up to mr romney himself \"to let the american people see who he is\". meeting with michigan delegates, mr christie insisted that an effective president trumps likability. \"we need somebody who cares more about getting the job done than they care about being temporarily popular with any particular segment of our country,\" mr christie said. mr christie has his own fan club. \"i just love him,\" said sandy barber, a delegate from rural northwest ohio. \"he's plain-talking. he's himself. he's someone who lets his personality come through .\" mr romney \"is a different kind of personality. his personality exudes leadership .\" part of the tampa tableau: a slew of republican presidential also-rans: michele bachmann and herman cain posed for a photo after running into each other at the convention centre. mr cain joked that the caption could be: \"we ain't mad. we support mitt and <mark>ryan</mark>.\" newt gingrich and rick santorum were on hand too, both with speaking slots. the high campaign season opens with mr romney and mr obama about even in the last of the pre-convention polls, with each candidate possessing distinct and important advantages. the democrat is the more likable or empathetic leader; the republican is more highly regarded as the candidate who can restore the economy, the top issue for voters. ann romney's convention speech was designed to speak to that divide. it was an important part of the party's effort to flesh out her husband and present him to the nation as more than a successful businessman and the former republican governor of a democratic state, massachusetts. she went about the business of humanising the romney family with a taped appearance on cbs this morning in which she talked about the pain of a miscarriage, telling details about the experience that were news even to her husband. the romneys have five sons. isaac, which reached hurricane strength tuesday, skirted tampa, a big relief for convention organisers worried about the safety of the host city and gop delegates. but they remain saddled with the question of how to proceed with a political festival - one devoted both to scoring points against obama and firing up excitement for romney - under the shadow of a dangerous storm crawling toward the gulf coast. tampa awoke to sunny skies while convention planners monitored weather reports for the storm's impact on the gulf coast some seven years since hurricane katrina devastated the region. in a reminder of both the storm and the presidency, mr obama warned residents of the gulf coast to heed warnings from local officials."}, {"articleID": "2018120207_00023518_W", "names": {"Harry Clark": ["Q20685783", "Q27950254", "Q47546735"]}, "date": "2018-12-02", "url": "http://www.southburnetttimes.com.au/news/update-tropical-cyclone-owen-is-on-its-way/3591096/#comments", "content": "A satellite image showing the location of the tropical low forming off the coast of the Solomon Islands that is expected to track towards the Queensland coast. Brisbane Storm Chasers Breaking UPDATE: Tropical Cyclone Owen is on its way by Maddelin McCosker Maddelin McCosker Full Profile Login to follow 2nd Dec 2018 4:42 PM | Updated: 5:02 PM 0 2 5PM: THE Bureau of Meteorology has just confirmed that Tropical Cyclone Owen is tracking southeast over the Coral Sea. The category one cyclone is currently situated which is about 545 km east northeast of Willis Is and 990 km east northeast of Cairns. According to the Bureau, TC Owen has recently slowed down but is expected to deepen in the coming hours. \"The system has been moving to the south southeast through today, but has recently slowed to around 8 kilometres per hour,\" the bulletin read. \"Owen is expected to deepen further overnight and is likely to reach Category 2 on Monday .\" The system is likely to drift slowly south until Monday afternoon or evening, and is then expected to turn and move slowly to the west and commence a weakening trend. \"This system poses no immediate threat to the Queensland coast, and should remain well off the coast until it weakens later in the week .\" 4.45 PM: A TROPICAL cyclone has formed approximately 500kms northeast of Cairns, according to the Joint Typhoon Warning Centre. The Hawaiian based JTWC said the cyclone has been tracking south-south-westward over the past few hours. The Bureau of Meteorology said it would be making an announcement on the cyclone status within the hour. It said the system had continued to intensify meaning there was a good chance it will be upgraded to a tropical cyclone which would be named Owen. <mark>Harry Clark</mark> a Meteorologist from the Bureau said the cyclone could reach a category two system in the next 48 hours, but the coast of Queensland will remain out of the cyclones reach for at least a few days. \"The only real risk to the coast is if the remnant low meanders towards the coast in the latter part of this week,\" he said. \"That would increase the rainfall and winds if anything and it certainly wouldn't be cyclone strength, mostly just some increased shower activity along the coast .\" The Bureau is still yet to confirm if the system has developed into a tropical cyclone. The Bureau of Meteorology 8.25 am: THE Bureau of Meteorology has issued a cyclone tracking map for the tropical low which is moving towards the Queensland coast. The bureau said that at 4 am, a tropical low was located over the northern Coral Sea about 610 km north east of Willis Island and 1030 km east north east of Cairns. Tropical cyclone forecast tracking map for a tropical low system of the Queensland coast issued at 4:45 am, Sunday 2, December 2. BOM The low was moving south at 9 kilometres per hour and expected to deepen further, most likely developing into a tropical cyclone during the next 24 hours. \"The system will continue drifting south until Monday afternoon or evening, and is then expected to turn and move slowly west,\" the bureau said. \"It is expected to intensify further during this time. However, this system poses no immediate threat to the Queensland coast, and should remain well off the coast until it weakens later in the week .\" The Joint Typhoon Warning Centre this morning said the system would continue tracking to the south over the next several days, and then \"model guidance diverges to go either south east or south west\". \"The models agree that the system will continue to intensify to warning criteria within the next day,\" it said. \"Maximum sustained surface winds are estimated at 25 to 30 knots. The potential for the development of a significant tropical cyclone within the next 24 hours remains high .\" 3pm: According to the Joint Typhoon Warning Centre (JTWC), based in Pearl Harbor, there is now a high chance a tropical cyclone will develop on Sunday between the Australian coast and the Solomon Islands. The JTWC said today the \"low level circulation centre' was moving in a south-westerly direction at 13 knots. The cyclone was located approximately 333 nautical miles west of Honiara on the Solomon Islands, over 1000 kilometres off the coast of Cairns. The Joint Typhoon Warning Centre, based in Pearl Harbor, has put out a notice advising there is a high chance of a tropical cyclone developing off the coast of Queensland in the next 24 hours. Joint Typhoon Warning Centre At 2.30 pm the BOM said a developing tropical low was currently located southeast of the Papua New Guinea mainland, near Sudest Island .\" The low is forecast to develop into a tropical cyclone during Sunday afternoon or evening while shifting south to southwest. It is expected to enter the Eastern Region later this evening or early Sunday morning and stay well offshore of the Queensland Coast in the northern Coral Sea, \"the outlook report read .\" Uncertainty does exist with the systems movement and development from Tuesday. \"Janine Yuafa, Meteorologist with The Bureau of Meteorology confirmed they were closely monitoring the situation, however he said it should remain well off the coast of Queensland for the time being. The tropical low was detected over 300 nautical miles from Honiara on the Solomon Island. It is predicted to turn into a tropical cyclone in the coming days. Joint Typhoon Warning Centre\" At the moment it is south east of Papua New Ginuea, \"she said .\" It is expected to move south-westwards into the Coral Sea over the next few days. \"Ms Yuafa said the tropical low was expected to remain well off the Queensland coast until early next week, saying after that it was not clear where it would go .\" There's a great deal of uncertainty surrounding its movements over coming days, beyond Sunday and Monday, \"she said .\" At this stage there's a moderate to high chance of development, but what it does after that once it reached tropical cyclone strength, if it does, is extremely uncertain. \"0 2 burea of meteorology Read More Login to follow cyclone Read More Login to follow joint typhoon warning centre Read More Login to follow tmbweather Read More Login to follow burea of meteorology cyclone joint typhoon warning centre tmbweather"}, {"articleID": "2010072804_00079421_W", "names": {"Guy Hasson": ["Q17870818", "Q5622324"]}, "date": "2010-07-28", "url": "http://lavietidhar.wordpress.com/2010/07/28/extract-from-2010-an-israeli-space-odyssey/", "content": "posted on july 28, 2010 by lavietidhar as i mentioned earlier, <mark>guy hasson</mark>'s article on israeli sf, \"2010: an israeli space odyssey\" , has just been published in uk magazine the jewish renaissance. here is just a snapshot from the opening of the article (you'd have to get the magazine to read the full article)."}, {"articleID": "2019052501_00116662_W", "names": {"Jon Adams": ["Q29650168", "Q42392966"]}, "date": "2019-05-25", "url": "http://highschoolsports.nj.com/news/article/-4425574274652336114/county-champs-nottingham-ww-p-north-chase-sectional-track-and-field-titles-video/", "content": "County champs Nottingham, WW-P North chase sectional track and field titles (VIDEO) By Andrew Borders | For NJ Advance Media on May 24, 2019 9:05 PM Central Jersey, Group 2 and 3 Meet Results Nottingham and West Windsor-Plainsboro North claimed the Mercer County boys and girls track and field titles two weeks ago, and now that the NJSIAA postseason has begun, those two teams are aiming high. Nottingham got a win in the 100 from Dana Ridley in the 100 (10.50) and WW-P North got wins from Nadia Elhossieni in the shot put (38-4 3/4) and Aditi Parekh in the long jump (18-0 1/4) to stand fifth and second their respective Central Jersey, Group 3 meets at Jackson Liberty heading into Saturday's 9 a.m. resumption. With both the Central Jersey, Group 2 and 3 boys discus results outstanding from Friday, as well as the Group 3 triple jump, WW-P North's boys lead Central Jersey, Group 3 28.5-26 over host Jackson Liberty with Hopewell Valley third at 16 and Nottingham fifth at 14. Colts Neck's girls lead WW-P North 47-44 with Northern Burlington third at 39. In Group 2, Matawan's boys lead Rahway 48-34, and Rumson-Fair Haven's girls lead Matawan 47.5-47. Competitors who finish in the top six in their events will advance to next weekend's group meet at Central Regional. \"Outperforming seeds is helping us out,\" WW-P North coach Matthew Warren said. \"When we showed up today, I said just like, girls, go for it. So far, they have. The performances have been either, like I said, outperforming seeds or just overwhelmingly incredible PRs from, like, Aditi. Tomorrow, we have another day .\" Parekh's previous outdoor long jump best was 17-3 1/2 from the sectional meet two years ago. Ridley's time surpassed the section record of 10.62 in fully-automated time as well as the hand-timed marks of 10.6, but the wind level of 3.6 meters per second surpassed the standard of 2.0 meters per second for the record to stand. \"I didn't have a time (goal) because I knew it was going to be wind-aided, so I just was going for place,\" Ridley said. Nottingham was dealt a tough blow when sprinter Louis Akpadago's hamstring did not recover in time for the meet after an injury suffered at the Mercer County meet. \"We thought that he had enough time to recover, but obviously, he didn't, so he won't run again until the nationals now. That's a big, big hole, but we needed something, we needed a spark, and (Ridley) kind of gave us one,\" Nottingham coach <mark>Jon Adams</mark> said. \"Dana kind of came to the rescue. Really, he's been working hard. We needed Superman to step up, and he showed up. The kid is a warrior and he proved that he's one of the top sprinters, and that's great for him .\" Carteret's Stephon Kelley-Gordon surpassed his own sectional record distance of 46-9 in the triple jump, leaping 48-0 3/4 to win that event in Central Jersey, Group 2, but those results had the No Wind Instrument designation to measure the gusts on an afternoon that saw its share of them. All in Central Jersey, Group 3, Steinert's Terris Burton won the high jump in 53.73, Hopewell Valley's Sean Dolan won the 1600 in 4:22.59, and Northern Burlington had two wins, from Kaneisha Raymond in the 400 hurdles in 1:07.37 and from Nathina Wright in the javelin at 111-0. Among the performances of note at the meet from outside the capital region, Metuchen's Nina Suss, Caroline Schleif, Camille Lussier and Mary Malague won the 4x800 in 9:40.90 to break the Central Jersey, Group 2 meet record of 9:42.64 Matawan set two years ago. When the meet resumes on Saturday, Nottingham will be looking to move up a spot from the runner-up finish it had to WW-P North last year, and the Knights' will be aiming to jump four spots from their fifth-place finish in 2018. <mark>Adams</mark> feels confident about where the Northstars stand. \"We'll see what happens tomorrow when we run our wheelhouse events, the 110 hurdles, the 200, the 4x1 and the javelin,\" <mark>Adams</mark> said. \"We put ourselves in pretty good position .\" "}, {"articleID": "2017062216_00680720_W", "names": {"Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"]}, "date": "2017-06-22", "url": "https://mic.com/articles/180597/jordan-peele-says-dont-get-your-hopes-up-for-a-get-out-sequel?mic_referral=homepage:latest:4", "content": "There is pretty much no filmmaker hotter right now than Jordan Peele. His debut film, Get Out, became the highest grossing movie in the United States by a black director (since surpassed by The Fate of the Furious), and has an outstanding 99% on Rotten Tomatoes from 272 reviews. Yes, that equates to just two negative reviews. Get Out was praised for its mix of humor, horror and social commentary, especially regarding race relations, and some have gone as far to say that the film will be a contender for a number of Academy Awards next year. And with Peele's directorial debut being such a smashing success, it is hard not to wonder whether he would double down with a sequel. Get Out was produced by Jason Blum, who is no stranger to sequels. Blum-produced films like Insidious, The Purge, Paranormal Activity and Sinister have all spawned sequels, in some cases multiple ones. But Get Out is a film that works so well as a standalone feature, that a sequel could do it a disservice. And perhaps that is why one is not being planned. In an interview with The Hollywood Reporter, Peele was asked about his next movie, an untitled Blumhouse production with a reported $25 million budget. While Peele did not reveal much about the \"social thriller,\" he did put to bed any notion that it could be a Get Out sequel. \"I'll tell you this, it's going to be a very different movie than Get Out,\" Peele said. \"Don't expect a sequel .\" Jordan Peele shot down any expectation for a \"Get Out' sequel. Source: Rich Fury/AP As for further down the line, a natural assumption would be that Peele might direct a large-budget studio tentpole. After all, it is not unusual for a filmmaker to follow up a well-received indie pic with a massive franchise production. For instance, Colin Trevorrow went from directing the small budget Safety Not Guaranteed to the worldwide hit Jurassic World. <mark>Gareth Edwards</mark>' follow-up to Monsters, a film with a reported $500,000 budget, was Godzilla, which carried a price tag north of $150 million. And the list goes on and on. Peele, though, is in no rush to board a franchise film as director, as he explained to The Hollywood Reporter:\" The most important thing for me is maintaining as much of the virtues of the process of Get Out as possible. My goal and plan is to rise in budget slowly. It doesn't make any sense for me to jump to an enormous budget when it changes the process entirely. I pinch myself and realize how lucky I am to be able to have created something. And if i can do that again, isn't that the best? \"Perhaps someday we will see what a big-budget Jordan Peele film looks like, but for now, fans should be excited for what the Get Out director comes up with next. Mic has ongoing coverage of Movies. Please follow our main Movies hub here."}, {"articleID": "2013031817_00034842_W", "names": {"Bill Day": ["Q15637604", "Q16095546", "Q20740769", "Q21460510", "Q4908716"], "Linda Johnson": ["Q3832607", "Q6551688"]}, "date": "2013-03-18", "url": "http://livetradingnews.com/valero-nysevlo-restarts-idled-ethanol-plants-107985.htm", "content": "valero nyse: vlo restarts idled ethanol plants valero energy corp. will soon aveh all 10 of its ethanol plants online and operating \"at or close to capacity,\" after it idled 3 of them last year due to low or negative margins, company spokesman <mark>bill day</mark> said monday. valero restarted its plant in albion, neb., around the start of the year. its bloomingburg, ohio, plant restarted at the beginning of march, and the company expects to restart its linden, ind., plant in the next week or so, mr. <mark>day</mark> said. \"corn prices have moderated somewhat and ethanol prices have kept pace,\" improving margins at the plants, he said. local corn shortages have challenged various ethanol producers since severe drought last year sharply cut the size of the us corn harvest. ltns analysis for vlo: overall short intermediate long hcm manages clients' existing accounts with their current brokerage firms and provide alternate choices of service providers. greater transparency, liquidity and control; clients own the stocks purchased on their behalf accounts can be financed with either current stock holdings or cash dividends credited to your account client statements are available at anytime lower investment management fees than similar products. <mark>linda johnson</mark>, business development director - private client group, 3 raffles place #07-01 bharat building singapore 048617 tel: +65 6329 6408 fax: +65 6329 9699 paul a. ebeling, jnr. writes and publishes the red roadmaster's technical report on the us major market indices, a weekly, highly-regarded financial market letter, read by opinion makers, business leaders and organizations around the world. latest news.you can follow any responses to this entry through the strong deleveraging pressures exist, cyprus is just an example of how fast some of the eu nations can unravel. following on from the disastrous greece default, the ecb, imf and world bank are ready for the sequels, spain, italy, portugal and? great savings this easter on thomson reuters metastock from live trading news asia's leading management consultants the heffernan group of companies use a top down approach developed by dr. heffernan ph.d. to develop value protected, growth driven portfolios with in the guidelines of the clients risk tolerance investing in malaysia, trade, finance and islamic banking shayne heffernan has been bullish on malaysia for several years now and the run is not over yet according to heffcap one of asia's leading financial advisors. great savings this easter on thomson reuters metastock from live trading news alan d. gaines' state oil is considering taking the company to market in singapore as well as a main board usa listing. designer john galliano puts luxury labels in legal irons medical marijuana inc (pink: mjna), vaporbrands international inc (pink: vapr)"}, {"articleID": "2012040615_00072156_W", "names": {"Robert Plant": ["Q28036733", "Q428223", "Q58449717"]}, "date": "2012-04-06", "url": "http://premierguitar.com/Magazine/Issue/2012/May/Album_Review_Carolina_Chocolate_Drops_Leaving_Eden.aspx", "content": "media review \\ album review: carolina chocolate drops - \"leaving eden\" album review: carolina chocolate drops - \"leaving eden\" foot-tapping ensues right out of the barn on the carolina chocolate drops sophomore effort, as the thunder-picking melody of a 5-string banjo collides with a fiddle moan going rounds with a primitive yet wildly syncopated fife-and-drum beat in \"riro's house .\" it doesn't take long to realize there's something important about that galloping banjo (several models appear on the album: 5-string, 4-string, 5-string cello banjo, and a 5-string \"gourd\" ), an instrument with roots in african-american traditional music, and more specifically, africans in colonial america. it's been said the carolina chocolate drops are among the only-if not the only-black traditional string band this side of, well, anywhere. it's fair to say founding members rhiannon giddens and dom flemons have knocked hard on the doors of their past. for leaving eden, the follow-up to 2010's grammy winning genuine negro jig, the group enlisted nashville producer buddy miller (emmylou harris, solomon burke, <mark>robert plant</mark>), beat-boxer adam matta, brooklyn guitarist / banjoist hubby jenkins, and cellist leyla mccalla to expand upon these firm roots. the piedmont multi-instrumentalists may be of a vanishing breed who call and respond to their ancestors, arranging classics like \"briggs' corn shucking jig,\" dating as far back as 1855. but the ccd spirit reflected in today's world is unmistakable in original tunes like \"country girl\" - written by giddens as an ode to her north carolina stomping grounds-or by reinventing classic selections of their string-playing mentors. the group's self-proclaimed \"modern take on traditional sound\" is eclectic and exciting: each arrangement is nuanced and interesting vocally, instrumentally and lyrically-from the a cappella chain-gang vibe of \"read 'em john,\" to the unique use of jugs, quills and bones. vocals are split diversely between the magnificent, bluesy songbird giddens and her spitfire counterpart flemons, not to mention matta's instrumental bass vocal talents. casual listeners may not discern that the underlying hip-hoppin' bass line in \"ruby (are you mad at your man?)\" is a human voice - that's right, matta lays down the low end with his voice on several tracks. guitar purists might notice audible rhythm and acoustic fingerpicking here and there, but its absence is the true indication to the heart of this sound. the banjo is to this style of roots music what the electric guitar is to modern rock. fiddle and mandolin paired with acoustic guitar are power-string combos in most bluegrass and folk groups, but the carolina chocolate drops make a powerful case for straight-up banjo with anything. the drops are stylists, but rare are those who can simultaneously hold up a genre while innovating within it. this is where the \"old meets new\" magic happens and the hootenanny spills into the town square, revealing southern string music for then and now, oozing with soul and interpreted authentically right down to the last drop. all comments are subject to editing or deletion by the premier guitar staff. p #319-447-5550 / 877-704-4327 copyright? 2011 all rights reserved"}]