[{"date": "2013-10-22", "url": "http://ksla.com/story/23745137/nev-student-opens-fire-kills-teacher-and-himself", "content": "meta itemprop = \"datePublished\" content = \"2013-10-21 15:23:30\" > Nev. student opens fire, kills teacher and himself Nev. student opens fire, kills teacher and himself Police are responding to reports of a shooting at Sparks Middle School in northern Nevada. A student at a Nevada middle school opened fire with a semi-automatic handgun on campus just before the starting bell Monday, wounding two 12-year-old boys and killing a math teacher who was trying to protect children from...meta itemprop = \"datePublished\" content = \"2013-10-22 00:43:52\" > Wis. judge: Officials in contempt for union curbs Wis. judge: Officials in contempt for union curbs A Madison judge on Monday found Wisconsin labor relations officials in contempt for enforcing parts of Gov. <mark>Scott Walker</mark>'s contentious bargaining restrictions despite a ruling that they're unconstitutional,...A Madison judge on Monday found Wisconsin labor relations officials in contempt for enforcing parts of Gov. <mark>Scott Walker</mark>'s contentious bargaining restrictions despite a ruling that they're unconstitutional,...meta itemprop = \"datePublished\" content = \"2013-10-21 07:33:18\" > Defense: <mark>Holmes</mark> was coerced into discussing bombs <mark>James Holmes</mark> returns to court for another round of skirmishes over what evidence can be used against him when he goes on trial for the Colorado theater shootings. Attorneys for Colorado theater shooting defendant <mark>James Holmes</mark> argued Monday that police coerced and misled him into talking to them about bombs that were found in his apartment after the shootings, and they said his...meta itemprop = \"datePublished\" content = \"2013-10-21 08:03:19\" > New talks raise hopes for end to SF transit strike New talks raise hopes for end to SF transit strike Facing a new work week, San Francisco Bay Area commuters girded for gridlock with a major transit strike underway, while federal investigators searched for clues to a weekend transit train crash that killed two...Representatives of the San Francisco Bay Area's transit rail system and its striking unions returned to the bargaining table Monday, raising hopes among the region's frustrated commuters that a four-day work...meta itemprop = \"datePublished\" content = \"2013-10-22 00:33:54\" > Philanthropist on trial in money laundering case An ex-Carnegie Mellon University trustee was accused Monday by a Texas federal prosecutor of conspiring with a romantic interest to launder half a billion dollars for a Mexican drug cartel. meta itemprop = \"datePublished\" content = \"2013-10-21 22:37:01\" > Video evidence: <mark>Marcus Taylor</mark> describes Tavia Sills' murder KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. meta itemprop = \"datePublished\" content = \"2013-10-22 00:21:55\" > Texarkana man arrested for extorting local \"Voice\" contestant Cole Vosbury A Texarkana, Arkansas, man was arrested Monday on a Caddo Parish Sheriff's warrant for extorting Cole Vosbury, a contestant on the television music competition \"The Voice .\" Caddo Sheriff Steve Prator A Texarkana, Arkansas, man was arrested Monday on a Caddo Parish Sheriff's warrant for extorting Cole Vosbury, a contestant on the television music competition \"The Voice .\" Caddo Sheriff Steve Prator meta itemprop = \"datePublished\" content = \"2013-10-20 21:02:22\" > BCPD: Alcohol likely a factor in accident with train The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. meta itemprop = \"datePublished\" content = \"2013-10-21 17:30:46\" > Back on the field: Grambling players end boycott, return to practice Grambling's football team returned to the practice field on Monday afternoon, preparing to play Texas Southern University in a game scheduled for Saturday. Grambling's football team returned to the practice field on Monday afternoon, preparing to play Texas Southern University in a game scheduled for Saturday. meta itemprop = \"datePublished\" content = \"2013-10-21 20:52:00\" > Gas line leak stopped: Major Bossier City intersection back open A major intersection in Bossier City has reopened after a gas line leak shut it down Friday afternoon. Congress votes to end shutdown, avoid US default Congress sends Obama bill to avoid default, open government, ending 16-day stalemate Senate deal on debt, shutdown sends stocks soaring Senate deal on debt and shutdown sends stocks soaring; S & P index climbs to near record high Deal reached to avoid default and open government Bipartisan deal to avert default, reopen federal government; passage possible by day's end Ground employee arrested in LA airport ice blasts Police arrest ground handling employee in dry ice explosions at Los Angeles airport On the edge: House shutdown plan fails; now Senate House shutdown effort collapses: Up to Senate now as deadline nears, US credit rating doubted Associated Press SPARKS, Nev. (AP) - A student at a Nevada middle school opened fire with a semi-automatic handgun on campus just before the starting bell Monday, wounding two 12-year-old boys and killing a math teacher who was trying to protect children from their classmate. The unidentified shooter killed himself with the gun after a rampage that occurred in front of 20 to 30 horrified students who had just returned to school from a weeklong fall break. Authorities did not provide a motive for the shooting, and it's unknown where the student got the gun. Teacher <mark>Michael</mark> Landsberry was being hailed for his actions during the shooting outside Sparks Middle School. \"In my estimation, he is a hero ....We do know he was trying to intervene,\" Reno Deputy Police Chief <mark>Tom Robinson</mark> said. Both wounded students were listed in stable condition. One was shot in the shoulder, and the other was hit in the abdomen. The violence erupted nearly a year after a gunman shocked the nation by opening fire in Sandy Hook Elementary School in Newtown, Conn., leaving 26 dead. The Dec. 14 shooting ignited debate over how best to protect the nation's schools and whether armed teachers should be part of that equation. Landsberry, 45, was a military veteran and leaves behind a wife and two stepdaughters. Sparks Mayor Geno Martini said Landsberry served two tours in Afghanistan with the Nevada National Guard. \"He proudly served his country and was proudly defending the students at his school,\" Martini said. On his school website, Landsberry posted a picture of a brown bear and took on a tough-love tone, telling students, \"I have one classroom rule and it is very simple:\" Thou Shall Not Annoy Mr. L.' \"\"The kids loved him,\" his sister-in-law Chanda Landsberry said. She added his life could be summed up by his love of his family, his students and his country. \"To hear that he was trying to stop that is not surprising by any means,\" she said. Police said 150 to 200 officers responded to the shooting, including some from as far as 60 miles away. Students from the middle school and neighboring elementary school were evacuated to the nearby high school, and classes were canceled. The middle school will remain closed for the week. \"As you can imagine, the best description is chaos,\" <mark>Robinson</mark> said. \"It's too early to say whether he was targeting people or going on an indiscriminate shooting spree .\" At the evacuation center, parents comforted their children. \"We came flying down here to get our kids,\" said Mike Fiorica, whose nephew attends the school. \"You can imagine how parents are feeling. You don't know if your kid's OK .\" The shooting happened on the school's campus and ended outside the school building, according to police. \"I was deeply saddened to learn of the horrific shooting at Sparks Middle School this morning,\" Nevada Gov. Brian Sandoval said in a statement extending his thoughts and prayers to those affected. About 700 students in 7th and 8th grades are enrolled at the school, in a working class neighborhood. \"It's not supposed to happen here,\" Chanda Landsberry said. \"We're just Sparks - little Sparks, Nevada. It's unreal .\" The mayor praised the quick response from law officers who arrived at the scene within three minutes of a flood of 911 calls to find the gunman already dead from a self-inflicted gunshot wound. \"They got it under control very quickly and shut down the scene,\" Martini said. A statement from Nicole Hockley, whose son Dylan was killed in the Connecticut shooting, appeared on the website of gun control advocacy group Sandy Hook Promise. \"It's moments like this that demand that we unite as parents to find commonsense solutions that keep our children - all children - safe, and prevent these tragedies from happening again and again,\" the statement said. The Washoe County School District held a session in the spring in light of the Newtown tragedy to educate parents on its safety measures. The district has its own 38-officer police department. No officers were on campus at the time of the shooting. Sparks, a city of roughly 90,000 that sprung out of the railway industry, is just east of Reno. \"You see it on TV all the time. You just don't think it's going to happen to you,\" Martini said. __ Associated Press writer Michelle Rindels in Las Vegas and news researcher Rhonda Shafner in New York contributed to this report. meta itemprop = \"datePublished\" content = \"2013-10-13 17:38:23\" > Walmart shelves in Springhill, Mansfield, cleared in EBT glitch Shelves in Walmart stores in Springhill and Mansfield, LA were reportedly cleared Saturday night, when the stores allowed purchases on EBT cards even though they were not showing limits. Shelves in Walmart stores in Springhill and Mansfield, LA were reportedly cleared Saturday night, when the stores allowed purchases on EBT cards even though they were not showing limits. meta itemprop = \"datePublished\" content = \"2013-10-21 02:11:01\" > Wrestling over a gun sends man to hospital Police are still investigating after two men wrestling for a gun sent one of them to the hospital after the weapon fired. Police are still investigating after two men wrestling for a gun sent one of them to the hospital after the weapon fired. meta itemprop = \"datePublished\" content = \"2013-10-21 15:08:52\" > Teacher, suspect dead in NV school shooting, 2 other victims in stable condition (RNN) - A shooting has been reported at a middle school in Sparks, NV. CNN reports that the situation is still live, and details are still vague. No reports yet of any injured. Students are being evacuated Authorities said a student was the suspected gunman responsible for a shooting at a middle school in Sparks, NV. The incident left two people dead, the suspect and a teacher. meta itemprop = \"datePublished\" content = \"2013-10-15 03:11:56\" > School: Saying goodbye to deploying parent isn't an excusable absence Columbiana, AL - The Pierce family squeezed in last minute quality time on Thursday, October 3rd. \"He got the email on Wednesday that he was leaving at 1230PM on Thursday,\" explained Angela Pierce. With Her son missed school to say goodbye to his father, who is deployed to Iraq...meta itemprop = \"datePublished\" content = \"2013-10-21 05:05:33\" > Bumpy railroad crossing frustrates Bossier residents A very bumpy and deteriorating railroad crossing has been causing headaches for years in East Bossier Parish. That crossing is at the intersection of Princeton road and Highway 157 near the Calumet Packaging A very bumpy and deteriorating railroad crossing has been causing headaches for years in East Bossier Parish. meta itemprop = \"datePublished\" content = \"2013-10-21 04:03:15\" > Pay raises uneven across La. government State government employees are getting pay raises again - at least $33 million in salary increases have been awarded so far in 2013 - after years of stagnant wages for many...State government employees are getting pay raises again - at least $33 million in salary increases have been awarded so far in 2013 - after years of stagnant wages for many workers meta itemprop = \"datePublished\" content = \"2013-10-20 21:02:22\" > BCPD: Alcohol likely a factor in accident with train The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. meta itemprop = \"datePublished\" content = \"2013-10-12 13:30:02\" > <mark>Michael Douglas</mark> reveals he lied about having throat cancer <mark>Michael Douglas</mark> revealed in a new interview Friday that he lied about having stage four throat cancer. <mark>Michael Douglas</mark> revealed in a new interview Friday that he lied about having stage four throat cancer. meta itemprop = \"datePublished\" content = \"2013-10-21 17:04:55\" > Video evidence: <mark>Marcus Taylor</mark> describes Tavia Sills' murder KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. meta itemprop = \"datePublished\" content = \"2013-10-20 17:10:46\" > Authorities locate ETX man that was reported missing Saturday Released by the Gregg County Sheriff's Office: Sheriff Maxey Cerliano and the Gregg County Sheriff's Office want to thank the media for their response on the Justin Allen missing person case that was reported", "articleID": "2013102208_00024524_W", "names": {"James Holmes": ["Q55363276", "Q5925769", "Q6136182"], "Marcus Taylor": ["Q22681064", "Q332311", "Q42524515"], "Michael Douglas": ["Q119798", "Q172140", "Q358096"], "Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "Tom Robinson": ["Q153289", "Q17198666", "Q42320057", "Q42714349", "Q723493"]}}, {"date": "2013-10-23", "url": "http://www.modbee.com/2013/10/22/2988551/former-broker-admits-defrauding.html#storylink=rss", "content": "FRESNO - The former owner of a Modesto real estate firm pleaded guilty Monday to seven fraud charges in a deal expected to bring eight years in federal prison. <mark>James Lee</mark> Lankford, 74, who previously owned Century 21-Apollo Realty, signed the plea agreement in late August, but illness delayed a formal resolution until this week. He will be sentenced Jan. 27 by U.S. District Judge Anthony Ishii, who will decide the appropriate prison term. Lankford's mortgage scheme duped elderly homeowners from Modesto and Hughson and lenders over an 11-year period, costing them more than $7 million. \"Such fraudulent behavior will not go undetected nor will it go unpunished,\" said Michael P. Stephens, acting inspector general for the Federal Housing Finance Agency. \"We will continue to work with our law enforcement partners to dismantle such schemes and hold all involved accountable .\" The agency cooperated on the case with the Stanislaus County district attorney's real estate fraud unit and the FBI. Lankford's husband, Jon Vance Lankford, who formerly went by the last name McDade, on Sept. 16 pleaded guilty to one count of bank fraud in connection with the scheme and is expected to receive a one-day prison sentence. Bee staff writer Garth Stapley can be reached at SALES ASSOCIATE Hansen's Furniture Class A Drivers E.B. Bradley Co.> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2013102308_00037822_W", "names": {"James Lee": ["Q11309421", "Q16221020", "Q3161221", "Q3161260", "Q42790671", "Q56152921", "Q56597623", "Q6137920", "Q6137925", "Q6137927", "Q6137929", "Q8988115"]}}, {"date": "2013-10-22", "url": "http://cnsnews.com/mrctv-blog/eric-scheiner/you-call-glitch-robocop-or-healthcaregov", "content": "\"I'm sure it's only a glitch, a temporary setback .\" - <mark>Dick Jones</mark> (\"Robocop,\" 1987) Many in the media insist on dismissing the problems with the Healthcare. gov website as mere \"glitches .\" The term seems to trivialize the amount and severity of problems the Obamacare website is having. Software engineers have told CBS News the website is simply poorly designed. \"How do you tax people and force them to buy a product they don't want at a website that doesn't even work?,\" I'm know I'm dating myself, but the whole thing reminds me of \"ED 209\" from the 1987 movie \"Robocop .\" ED 209 was a large, lethal - and flawed - law enforcement robot intended to ensure people comply with the law within a specific time frame (sometimes 20 seconds). A demonstration of Ed's talents (and failings) when he wasn't really ready for deployment ended up causing quite a bit of damage. After a fatality, <mark>Dick Jones</mark>, one of corporate executives responsible for ED's development said, \"I'm sure it's only a glitch, a temporary setback .\" ", "articleID": "2013102320_00084769_W", "names": {"Dick Jones": ["Q2707376", "Q27909772", "Q5273069", "Q5273070"]}}, {"date": "2013-10-23", "url": "http://www.telegraphindia.com/1131024/jsp/sports/story_17488293.jsp", "content": "Was not under any pressure: Shami - \"There was nothing extraordinary in the pitch for the bowlers' <mark>George Bailey</mark> on way to his 98, in Ranchi, on Wednesday. (PTI) Ranchi: Shami Ahmed was the lone bright spot for India in the abandoned fourth ODI against Australia, on Wednesday. Playing his first match of the series, Shami was almost unplayable as he merrily swung the ball in both directions. He got three wickets on the day and all three came off superb deliveries. However, at the media conference, Shami came off as a very chilled customer, completely detached from the great work that he did on the field. Asked if the overcast conditions and the pitch helped him in his endeavour, Shami answered in the negative .\" No there was nothing extraordinary in the pitch for the bowlers. Like most fresh wickets, it was initially helping the fast bowlers. \"There was bounce and carry which I exploited...But the mini rain-break after the first six overs somehow changed the nature of the pitch...It wasn't giving the same bounce and carry...And had also become a little slow,\" he said. While Shami was giving the Australian batsmen all sorts of trouble, his new ball partner, Jaydev Unadkat, too, complemented well, keeping it tight at the other end. What was the plan? \"Nothing special...We just decided that we shouldn't give any room to their batsmen...Especially, Aaron Finch. It was a fresh wicket and we were bowling first, so we had the opportunity to use these factors to our advantage and deny them any room. We wanted to make them play as many deliveries as possible and that turned out to be beneficial for us,\" Shami said. Ignored for the first three matches of the series, common sense says that there was some pressure on him to do well to justify his selection. But the Bengal pacer denied it. \"It doesn't really matter...Whether I'm playing my first match of the series, whether it is my home ground, or stuff like that .\" When I'm selected, it is my job to give my best. I wasn't under any pressure...I only think about my line and length, because at the end of the day that will earn me wickets. \"The deliveries which castled Aaron Finch and <mark>Shane Watson</mark> had classic swing written all over them. Both came in after pitching and went through the gate between the bat and the pad to dislodge the furniture.", "articleID": "2013102406_00026336_W", "names": {"George Bailey": ["Q21288959", "Q4711426", "Q48006354", "Q51587300"], "Shane Watson": ["Q2732224", "Q7488319"]}}, {"date": "2013-10-28", "url": "http://www.4barsrest.com/news/detail.asp?id=17704", "content": "Welsh League climax set for Blaenavon 28-Oct-2013 The destination of the various Welsh League titles will be decided in Blaenavon next month. The exciting climax of the domestic Welsh contesting season takes place in Blaenavon on Saturday 26th November, with the various titles to be decided in all five sections. Champions 37 bands will take to the stage in the World Heritage town's Workmen's Hall, with Derek Broadbent and Paul Holland charged with the task of separating out the contenders looking to be claimed' 2013 Welsh League Champions'. With Wales currently boasting no less than five National Champions as well as British Open, European and Masters title winners, there is sure to be plenty of high class playing on show. Wide open <mark>Colin Evans</mark>, Secretary of the South East Wales Brass Band Association, who is organising the contest, told 4BR: \"This year, more than ever, the situation is wide open and it is not possible to predict - except, possibly in one Section, who will end the year as Champion Bands .\" He added: \"Welsh banding is on a real high at the moment, so players, conductor, supporters and the general public can expect some great battles .\" \"Welsh banding is on a real high at the moment, so players, conductor, supporters and the general public can expect some great battles' Tickets The contest starts with the Fourth Section at 9.30 am, and admission is by ticket priced £ 6.00, with concessions £ 4.00, available from the Box Office at the Hall on the day. Regionals 2014 Featuring YBS, Cory, Black Dyke and Grimethorpe All five test pieces for the National Brass Band Pontardulais town Band Pontardulais Town Band have a vacancy on the front row cornet bench, Percussion section and 1st Horn. Band room is 5mins off...Venue: Skyline Resort, Skegness, Lincolnshire PE25 1NJ Date: 8-Nov-2013 Venue: Embassy Theatre Skegness PE25 2UG Simon Platford BA (Hons), LTCL, ABSM, PGCE", "articleID": "2013102819_00045353_W", "names": {"Colin Evans": ["Q16210795", "Q5145074"]}}]