[{"date": "2013-10-30", "url": "http://www.today.com/entertainment/voice-bromance-blake-shelton-snuggles-adam-levine-8C11493379", "content": "NBC <mark>Adam Levine</mark> cozies up to Blake Shelton on \"The Voice .\" \"The Voice\" bromance between Blake Shelton and <mark>Adam Levine</mark> is hotter than a steaming mug of cocoa. Thank Team CeeLo's Caroline Pennell for bringing out the country superstar's softer (stranger?) side. After her knockout battle with George Horga Jr., Blake began his critique by noting that George was flat throughout. And then...\"Caroline makes me want to buy a cat and a pink blanket,\" Blake said. Most viewers probably did a spit-take with their soda, or at least wondered if they understood correctly. But not his fellow coaches, who didn't seem surprised. \"That's not Caroline who wants to do that,\" <mark>Adam</mark> interrupted. Blake kept going: \"...and build a little fire in the house, and just curl up with a cup of hot chocolate...\"\"And <mark>Adam</mark>,\" Christina Aguilera said. \"With <mark>Adam</mark>,\" Blake agreed. Sound like something that's been discussed previously? Apparently so. \"He said the same thing when he met me,\" <mark>Adam</mark> warned Caroline. \"I've heard it all before .\" Which might well be true. Indeed, the bromance got going earlier in the evening, after Blake praised Ray Boudreaux's performance. \"Ray, you remembered to take out a couple of words,\" commended his coach. \"It allowed you to take that one last breath going into those big things you did at the end, and you did it. And I'm jealous. I wish I could do that. It's studly .\" \"It's OK, Blake,\" <mark>Adam</mark> said. \"I think you're studly. I really do .\" \"Thank you, because Ray makes me feel like less of a man,\" Blake said. It's only October, NBC. There's still time to make that into a holiday special. Blake and <mark>Adam</mark>, a roaring fire, a bottle of wine and some traditional music. Who wouldn't watch \"Blake and <mark>Adam</mark>'s Bromantic Christmas?\" Then again, Blake might have some competition, if the #AdamTina folks get their way. As the coaches were walking towards their seats, <mark>Adam</mark> made a proposal. \"I'm gonna join Christina's team. Can I be a contestant?\" \"AdamTina?\" Christina said. \"Yeah, I think we could do it together,\" <mark>Adam</mark> said. The Internet would be overjoyed. But alas. Christina had her arm around CeeLo Green at the time, so it looked like a guy hitting on a girl in front of her boyfriend, which was reinforced later in the show when the four were, again, walking to their seats and talking the various steals. \"I wish I could steal your heart, Christina,\" CeeLo said. \"You already have it,\" Christina said. So to recap: Blake likes <mark>Adam</mark>. <mark>Adam</mark> likes Blake and also likes Christina. Christina maybe likes <mark>Adam</mark> and definitely likes CeeLo. CeeLo likes Christina.", "articleID": "2013103013_00026998_W", "names": {"Adam Levine": ["Q219631", "Q37840339", "Q4679401"]}}, {"date": "2013-10-31", "url": "http://www.inquisitr.com/1014854/the-simpsons-to-air-marcia-wallace-tribute/", "content": "Tampa Bay Buccaneers Stick With Coach Greg Schiano As Masses Call For His Ouster Kate Upton: \"Golf Digest' Cover Makes Golfing, And Arnold Palmer, Look Sexy Tobacco-Buying Age In NYC Becomes 21, Will Other States Increase Smoking Age? The Simpsons will air a tribute to voice actress Marcia Wallace Sunday, November 3. died October 25 due to complications from pneumonia. She was 70. Wallace, along with five other Simpsons voice actors, earned the first ever Emmy for Outstanding Voice-Over performance in 1992. Wallace won the award for the episode\" Bart the Lover, \"in which Bart (<mark>Nancy Cartwright</mark>) responds to a personal ad Mrs. Krabappel placed in the newspaper. Bart creates an alter ego named Woodrow as revenge for being given a month's detention for breaking the class fish tank with his yo-yo. When Bart sees Mrs. Krabappel sitting in an empty restaurant, he feels guilty and writes her a romantic letter explaining why Woodrow had to leave, which makes her feel better. Fox will re-air the episode, the 16th episode of its third season, Sunday. An all-new episode will follow at 8 pm, The Simpsons and we intend to retire her irreplaceable character .\" \"Marcia would come in, and she was always a ray of light. She's in 178 episodes - a lot more than people might think. That's more episodes than most standard shows,\" <mark>Cartwright</mark> told The Hollywood Reporter. \"Marcia was always a very big part of the group. Always a treat. The room was always a little bit better with her in it .\" <mark>Cartwright</mark> added, \"She had recorded some upcoming episodes, I don't know how they will use it. I don't know what they're going to do with the character. I'm curious to see what they do .\" <mark>Cartwright</mark> also said that \"Bart the Love\" showed that \"deep down inside there was caring there in [Edna's] voice .\" She explained, \"That's the brilliance of the writing of the show.... Of all the kids in the school, it was Mrs. Krabappel and Bart that had this loving relationship. I think Bart gave her a little more joy than grading papers. He provided her with a real relationship .\" Edna Krabappel first appeared in \"Bart the Genius,\" the second episode of the first season in 1990. h4 class = \"icon-inq-social-friends widgettitle\" > Inquisitr With Friends Halloween Obese Letter: Woman Criticized For Plan To Shame Fat Trick-Or-Treaters Heidi Montag: Kristin Cavallari Is Having A Boy! Oops, Nevermind Giraffe Riddle Answer: Creator Of Facebook Question Reveals Answer, Promises More Riddles Nona Gaye Lawsuit Claims Robin Thicke Stole Musical Elements From Marvin Gaye South Carolina Shooting Ends With Six Dead, Police Suspect Murder-Suicide h4 class = \"icon-inq-facebook widgettitle\" > Facebook h4 class = \"widgettitle icon-inq-featured-news\" > Featured Stories George Zimmerman Sends Estranged Wife A Message: A Bullet-Riddled Target [Report] Kim Kardashian Says Bikini Picture Was \"Big Middle Finger' To Weight Critics Halloween 2013 Gaming: The Scariest Games To Get You Ready For Tonight Mick Jagger Hit On Katy Perry? Rolling Stones Singer Says Perry Was Teenage Dreaming Kelly Ripa Twerks On Michael Strahern In Miley Cyrus Halloween Costume, Pair Then Make Numerous Costume Changes", "articleID": "2013110104_00003446_W", "names": {"Nancy Cartwright": ["Q229211", "Q512979"]}}, {"date": "2013-11-02", "url": "http://www.DailyFinance.com/2013/11/02/food-stocks-provide-steady-dividends/", "content": "DailyFinance newsletters may offer personalized content or advertisements. Which Consumer Food Stocks Should Dividend Investors Consider? Dividends have historically made up a large percentage of overall gains made by investors. Picking long term dividend-paying winners is no easier than picking winning stocks but those looking for steady dividends may want to consider owning food stocks. This is because companies like J.M. Smucker Co.. profit from consumers' insatiable appetite for chocolate, peanut butter and jelly. It's hard to imagine any of these products going anywhere anytime soon. Chocolate and grape jam aren't the only products that are irreplaceable to consumers. Kellogg Co. owns a big bite of the cereal market, and ConAgra leads the frozen dinner market with its Healthy Choice meals. Hershey dominates the North American chocolate market and Smucker leads in jellies, jams and coffee with its Folgers brand. Dividend yields for these food companies range from 2% to 3%. An ETF in this space is PowerShares Dynamic Food & Beverage Portfolio ETF. One of the reasons Warren Buffett bought See's Candies was its ability to raise prices while maintaining and growing its customer base over time. Buffett bought See's Candies for $25 million in 1972 and later invested another $32 million into the business. Over the ensuing decades the company returned more than $1.3 billion to Buffetts' company. Buffett once called See's Candies the \"prototype of a dream business .\" We Fools may not be able to find another See's Candies, but there are some great food companies out there. The following chart compares investment data on four food companies and an ETF. Payout Ratio Net Margin Forward P/E YTD Return Dividend Growth Since 2009 Hershey 2% 49.04% 10.65% Smucker 2.1% 41.28% 9.52% 18.88 2.95% 65.91% 6.52% 16.55 3.15% 62.46% 3.94% 13.65 8.44% N/A N/A N/A 30.70% 26.92% PBJ is a non-leveraged ETF that tracks the Dynamic Food & Beverage IntellidexSM Index, which is about 30 U.S. food and beverage companies. The ETF's gross expense ratio is 0.63%. The ETF's top four holdings are Archer-Daniels Midland, 5.39%, General Mills, 4.82%, Flowers Foods, 3.03%, and Boston Beer Co, 2.97%. The ETF was up 30.70% through Oct. 31. Food and beverage stocks are sensitive to commodity prices. When pricing is fairly stable, it's easy to predict margins. Right now stable-to-falling commodity prices should benefit food companies. It goes without saying that Foolish investors should always be on the lookout for companies with high profit margins and steadily rising dividend. Hershey commands a 10.65% profit margin, the best of the group, and a dividend that is up 51.66% since 2009. Smucker isn't far behind with 9.52% margin, and a much higher dividend increase at 60.58%. Kellogg has a 6.52% margin and ConAgra's margin is only 3.94%. ConAgra's earnings were only $0.34 in first quarter 2014, down 44% from $0.61 earnings in the same quarter a year ago. Hershey reported third quarter earnings per share of $1.03, $0.03 better than the analyst estimate of $1.00. Revenue for the quarter came in at $1.85 billion versus the consensus estimate of $1.88 billion. Earnings for the quarter were up 33% from $0.77 per share a year ago. This compares with J.M. Smucker which earned $1.24 in the first quarter 2014, up 5.9% from $1.17 a year ago. Earnings for Kellogg were up 6% in the second quarter. The company plans to announce third quarter earnings on Monday November 4, 2013. A Word of Caution These companies face some headwinds. Consumer stocks as a group are up more than 20% year-to-date while some critics say the sector is overvalued. Consumer foods companies can also face possible increases in regulation. In Washington state, for example, voters will decide Nov. 5 whether to require labels on food containing genetically modified crops. Food companies are afraid of the additional expense in meeting labeling requirements. ConAgra is among the companies fighting the labeling initiative. Conclusion Food stocks are much loved for their reliability of dividends. They also increasingly benefit from stable commodity pricing. Most importantly for Foolish income investors, their dividends tend to increase over time. What's not to love? While high price-to-earnings ratios are cause for concern, particularly in the best stocks like Hershey, there are bargains to be had with other issues. J.M. Smucker, for one, is probably a better value for the money right now. Over time, these stocks should add value to a portfolio of dividend paying stocks. As always, Foolish investors should do their own research before making any investment decision. It's as simple as that. While they don't garner the notoriety of high-flying growth stocks, they're also less likely to crash and burn. And over the long term, the compounding effect of the quarterly payouts, as well as their growth, adds up faster than most investors imagine. With this in mind, our analysts sat down to identify the absolute best of the best when it comes to <mark>Michael Hooper</mark> owns shares of J.M. Smucker, ConAgra Foods, and The Hershey Company. The Motley Fool has no position in any of the stocks mentioned. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that Learn about investing from the comfort of your own home. Portfolio Basics Take the first steps to building your portfolio. safility The Safility Finance Daily is out! http: //t.co/bbR0j1cGs6 Stories via @ daily_finance @ Justin_Ching e401k RT @ daily_finance: If you love football, you hate NFL game blackouts. And finally, the FCC may be getting ready to end them. http: //t.co/tl? CooolStufff RT @ daily_finance: If you love football, you hate NFL game blackouts. And finally, the FCC may be getting ready to end them. http: //t.co/tl? Advertise With Us? Copyright 2013 AOL Inc.. All Rights Reserved", "articleID": "2013110219_00017170_W", "names": {"Michael Hooper": ["Q6831231", "Q6831232"]}}, {"date": "2013-11-04", "url": "http://www.business-standard.com/article/companies/granules-india-acquires-auctus-pharma-113110400432_1.html", "content": "We encourage visitors to register on Business Standard. Registering on the site is absolutely Free and offers you the following benefits. Free Daily E-newsletter Breaking News Alerts in your Inbox Post Comments and Share your Feedback Free Portfolio of Stocks, Equity and Commodities Derivatives Receive Selective Offers from our Third Party Premium Advertisers Granules India Limited has acquired the entire stake of unlisted Auctus Pharma, a manufacturer of active pharmaceutical ingredients (API), for an undisclosed amount. The acquisition process is expected to be completed in the next three to six months. Auctus has an API facility at the Pharmacity in Vishakhapatnam and an intermediate facility in Hyderabad. The API facility has approvals from leading regulatory agencies including the US Food and Drug Administration, European Directorate for the Quality of Medicines & Healthcare (EDQM), Health Canada, Korea Food and Drug Administration and WHO-Good Manufacturing Practices. . \"The acquisition of Auctus fits into our strategy of being a fully integrated manufacturer while diversifying our product portfolio by adding high-value products with significant market demand. We will be a market leader by implementing our operational excellence philosophy while leveraging Auctus regulatory approvals,\" Granules India managing director, <mark>Krishna Prasad</mark>, stated in a press release. \"We want to unlock our investment value and subsequently set up a greenfield pharmaceutical unit\" , a co-promoter of the 10-year old Auctus Pharma, Shivaram <mark>Prasad</mark> Aluru, told Business Standard while explaining the reasons for the sale of the company. Auctus' product portfolio includes twelve APIs including APIs in several therapeutic categories such as antihistaminic, antihypertensive, antithrombotic and anticonvulsant as well as other therapeutic categories. It currently sells its APIs and intermediates to customers in 50 countries. The team and assets from the acquisition will initially operate as a separate division with Granules. Granules also announced the opening of a 10,000 square foot research and development (R & D) facility in Hyderabad. The new R & D will focus on full scale generic API development and will supplement the company's existing R & D facility in Pune, which currently focuses on sustainable technology development. Only a strong bank can be a good partner. Click here to know more", "articleID": "2013110416_00022903_W", "names": {"Krishna Prasad": ["Q6437473", "Q6437474"]}}, {"date": "2013-11-05", "url": "http://www.hotnewhiphop.com/dmx-arrested-for-driving-without-a-license-tags-or-insurance-news.8013.html", "content": "Kanye West Big Boy's Neighborhood Freestyle (Radio Rip) Ty Dolla $ign Fuckin' Tonight Oct 29, 2013 at 2:05 PM <mark>Eddie Murphy</mark> Promise (You Won't Break My Heart) OJ Da Juiceman The Return Of Da Juiceman Oct 31, 2013 at 9:57 PM Roc Marciano The Pimpire Strikes Back 12:06 AM <mark>Chris Paul</mark> Crosses Over & Abuses Jeremy Lin 2 hours ago Victor Oladipo's Dope 360 Dunk Nov 4, 2013 at 10:27 AM Envy: HNHH Exclusive Hotties Photoshoot Aug 2, 2013 at 12:35 PM Drake's Girls: Maliah Michel Vs. The Girl That Got Away AWOL $Cassette Deck Dec 31, 1969 at 7:00 PM D-Blockz We Winnin' (Produced by Dopant Beats) Dec 31, 1969 at 7:00 PM iHateYouFano WakenBaken Dec 31, 1969 at 7:00 PM Jets Quarterback Geno Smith Rocks Red October Yeezy 2s At Nets Game Killer Mike & El-P Announce \"Run The Jewels 2\" Nov 4, 2013 at 12:09 PM News> DMX Arrested For Driving Without A License, Tags Or Insurance In South Carolina Stream JMSN's \"? Pllaj??\" EP In Its Entirety Exclusive Photos: BTS Of <mark>Chris Brown</mark> & Kid Ink's \"Show Me\" DMX was arrested in South Carolina yesterday for driving with a suspended license and not having a car tag or insurance. Apparently, a Spartanburg County Detention Center police officer already familiar with X stopped him for questioning on his way to the airport. \"He was arrested on minor traffic charges and spent only three hours in jail,\" X's publicist Domenick Nati has stated. \"This short arrest will not affect any of his upcoming concerts and he is planning on performing with Kanye West's Second Stop On\" Yeezus \"Tour In Vancouver Postponed [Update: Chicago Dates Postponed] Eminem On Kendrick Lamar's\" Control \"Verse:\" If You Get Mad...You Might Look Foolish \"The Weeknd To Open For Justin Timberlake On U.S. Leg Of Tour Pistons Wore Dope New\" Motor City \"Jerseys Last Night (Photos) Older Article Stream JMSN's\" ? Pllaj?? \"EP In Its Entirety Childish Gambino Talks Instagram Posts, Being\" Depressed \", & Relationship With Jhene Aiko Cover Art Revealed For B.o.B.'s\" Underground Luxury \"[Update: Tracklist Revealed]", "articleID": "2013110601_00065131_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"], "Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "Eddie Murphy": ["Q16095779", "Q43874", "Q5336342"]}}, {"date": "2013-11-05", "url": "http://www.freespeech.org/text/pat-buchanan-invokes-george-wallace-bash-first-hustler-obama", "content": "<mark>Pat Buchanan</mark> Invokes <mark>George Wallace</mark> to Bash \"First Hustler' Obama Conservative columnist and cable-news racist <mark>Pat Buchanan</mark> is out with a new column calling President Obama the\" first hustler \"because insurers have dropped some health plans that did not comply with the new health care reform law, meaning that some people have had to change their health insurance plans. In defending his case, <mark>Buchanan</mark> invokes none other than <mark>George Wallace</mark>, the segregationist Alabama governor perhaps most famous for physically blocking two black students from entering the University of Alabama. <mark>Wallace</mark> had his own reasons for disliking the federal government, which he said (while running for president) was composed of\" pointy-headed bureaucrats who can't park a bicycle straight \"- a sentiment that <mark>Buchanan</mark> gleefully repeats. <mark>Buchanan</mark> then goes on to declare that the Affordable Care Act will finish the work done by such travesties as\" free schooling [and] Social Security \"to bring capitalism to\" the end of the line. \"\"Nothing is lost save honor .\" So said Jim Fisk after he and Jay Gould survived yet another scrape in their corrupt and storied careers in the Gilded Age. Fisk's dismissal of honor came to mind while watching Barack Obama in Boston smugly explain how his vow - \"If you like your health care plan, you can keep it!\" - was now inoperative. All along, it had been a bait-and-switch by the first hustler ....Here was the president's signature program - what Social Security was to FDR, Medicare to LBJ - and one month into launch, it is grist for the mills of Saturday Night Live and Comedy Central. Observing the rollout, one begins to appreciate what <mark>George Wallace</mark> meant when he talked of Washington being a city of \"pointy-headed bureaucrats who can't park a bicycle straight .\" And though the Obamacare website will one day be repaired, and people may begin to sign up, the land mines in Obamacare are by no means all exploded. We will be walking right through them ....The welfare state that began with Bismarck is reaching the end of the line, just as the private sector that generates the wealth to sustain that state is now, almost everywhere, buckling under its weight. The deficits stretch to the horizon. The debts rise inexorably. Across the West, neo-socialism is out, the new austerity in. Contact Us WRITE US: P.O. Box 44099, Denver CO 80201", "articleID": "2013110601_00075122_W", "names": {"George Wallace": ["Q3101983", "Q43913855", "Q48817450", "Q5545830", "Q5545832", "Q5545834"], "Pat Buchanan": ["Q149127", "Q48700522"]}}, {"date": "2013-11-05", "url": "http://examiner.com/article/missing-mississippi-family-that-disappeared-after-fiery-crash-found-dead", "content": "Mississippi family of three seemed to vanish into thin air following a fiery car crash, an exhaustive search was conducted to find them. On the morning of Nov. 5, 2013, authorities learned the fates of Atira Hughes Smith, 30, her son Jaidon Hill, 7, and her husband, Lattery Smith, 34, according to the New York Daily News. Each member of the family was found shot to death in an abandoned house near where their SUV was found, a relative reportedly told ABC News. Authorities believe they were murdered prior to the crash, and that the vehicle was burned to destroy any evidence of a crime. Timothy Burns led investigators to the bodies and was subsequently arrested. WAPT, \"The sad part is, we have a young child that has lost his life and he is not going to be able to grow up and be the person he should have been, and that is sad .\" WJTV, Atira's mother, Judith Hughes, said her daughter called just after midnight on Saturday to say she was leaving town for several days, but would not say why before the call was cut short. Before the conversation ended, Judith asked, \"At this late time of night?\" and Atira replied that something had come up. She then asked if everything was OK, and Atira told her everything was fine, reports WJTV. Judith told the local news media outlet that Jaidon, her grandson, lives with her, but was staying with Atira for the weekend. She offered to pick him up, but Atira told her the family was already on the road and he was asleep. That was the moment Atira's cell phone seemed to cut out. When Judith tried to call Atira back, the call was immediately sent to voice mail. The Daily News reports that according to Atira's family, early Saturday morning someone attempted to use the victim's ATM cards, but did not have the PIN code, so the effort was unsuccessful. Anyone with information regarding the case is urged to call Crime Stoppers at 601-355-8477, the Copiah County Sheriff's Dept. at 601-894-3011, or the FBI at 601-948-5000. Entire family mysteriously disappears after Mississippi car crash Baby girl dies after intoxicated mother passes out while breastfeeding Amanda Knox trial: Meredith Kercher DNA not found on knife in new tests LAX shooter, Paul Ciancia, could face death penalty, say authorities Rebecca Sedwick case: Mom of girl accused of bullying faces child abuse charges Rebecca Sedwick suicide: Boyfriend talks, says he didn't know about bullying Man accused of beating <mark>Adrian Peterson</mark>'s son has prior domestic abuse indictment (Photos) Man charged in relation to beating death of NFL star <mark>Adrian Peterson</mark>'s son Baby Kate case: New evidence leads to murder charge against missing girl's dad (Video) Amanda Knox case: Untested evidence on butcher knife may be factor in new trial Bryce Laspisa case: Parents of missing California student plan Illinois vigil 31-year-old woman poses as teen to have sex with 14-year-old boy Baby girl dies after intoxicated mother passes out while breastfeeding A 20-year-old gunman fired shots inside a New Jersey mall before taking his own life The Milky Way could contain billions, yes billions, of habitable planets Roughly 1,500 famous paintings stolen by Nazis have been found in a Munich apartment Dr. Phil hosts Michelle Knight for a powerful tell-all of her 10 year captivity", "articleID": "2013110606_00066259_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"]}}]