[{"articleID": "2014111705_00012548_W", "names": {"Andrew Harrison": ["Q14469654", "Q47339436", "Q4757245", "Q4757246"]}, "date": "2014-11-17", "url": "http://buffalonews.com/feed/ub-makes-statement-in-loss-to-kentucky-20141116", "content": "Educational establishment should be fighting failing schools, not Paladino President, Senate must begin filling federal court vacancies, including 2 in WNY Educational establishment should be fighting failing schools, not Paladino Setting the table for holiday guests shouldn't be a chore The theaters are getting better, but it's still all about the movie on the screen From master printer to journeyman: WNY Book Arts Center's Chris Fritton hits the road The theaters are getting better, but it's still all about the movie on the screen Top-ranked Kentucky struggles but wins LEXINGTON, Ky. - Fourteen minutes into Sunday's game, University at Buffalo forward Justin Moss took a sharp bounce pass from Lamonte Bearden and made a leaping, one-handed, tomahawk dunk over Kentucky center Willie Cauley-Stein. Moss is 6-foot-7. Cauley-Stein is a 7-footer who is likely to be a first-round NBA draft pick next spring. \"I got a great opportunity and took my chance,\" Moss said. \"I guess you could call it a statement .\" No guessing about it. It was the statement play in a statement game for UB. If UB plays anything this season like it did in losing to the No. 1-ranked Wildcats, this is going to be a mighty good year for the Bulls. The final score alone - 71-52 - was a moral victory. But that did not tell the tale. A stunned crowd of 22,175 at famed Rupp Arena watched in silence as UB walked off at halftime with a 38-33 lead. The Bulls still were up, 45-44, with 13:30 to play. They were within four, 51-47, with 10:20 left. They were within 11 with five minutes left. This is a UB team that lost its three best players from last year. It's a Kentucky team that returns 60 percent of last year's national runner-up squad and has nine McDonald's high school All-Americas. \"Are you kidding?\" essentially was the reaction from Kentucky coach John Calipari to UB coach Bobby Hurley after the game. \"I told Bobby after,\" Calipari told reporters, \"he lost three of his guys, his starters, and had two starters back, has pretty much a brand new team. And they came in here and did that? Wow! Hats off to 'em ....I coach young teams. For him to do that the second game out, amazing stuff .\" If that's who they are in their league, they're going to be really, really good. \"UB's players obviously did not read the press clippings of Kentucky's stars before the game. On UB's first possession, 6-3 guard Jarryn Skeete hit a three-pointer on 6-6 guard Aaron Harrison, a preseason first-team All-American. That's Aaron Harrison, the guy who hit winning three-pointers in Kentucky's Sweet 16, Elite Eight and Final Four victories last season. On UB's second possession, freshman point guard Lamonte Bearden drove hard down the lane and drew a foul from 6-6 <mark>Andrew Harrison</mark>, the all-Southeastern Conference guard. When Skeete hit a 16-footer and a 20-footer back-to-back to give UB a 12-10 lead, it was obvious the Bulls were not backing down .\" We've got a tough team; we don't back down from nobody, \"said Moss .\" Intimidation - that's not something in my vocabulary, \"said UB guard Rodell Wiggington .\" But Skeete making some big plays kind of made the expectations bigger for us. \"Skeete, a junior from Ontario, led UB with 16 points. Wigginton, a 6-5 junior college transfer from Michigan, had 15. Moss, UB's best player, managed eight points on 3 of 13 shooting. He took mostly good shots, but Kentucky's front line simply is too tough to score against. Hurley was proud of his team .\" This had the feel of an NCAA Tournament game, \"he said .\" They're at the top of the food chain. For us to be able to be competitive, and to feel like we were outplaying them for a large portion of the game, gives our guys confidence. \"I'm proud of winning the hustle game early in the first half, loose balls, charges, gritty play .\" Among the reasons UB hung with Kentucky: • The Bulls guards - Bearden, Skeete, Shannon Evans and Wiggington - handled the ball well and showed quickness in creating some good shot opportunities. UB shot 44.4 percent from the field in the first half and made just seven first-half turnovers. \"They've got a lot of big guys, and coach just told me every time I go to the hoop make sure I hit a body,\" said Wiggington, who was 9 of 11 from the foul line. \"So that's what I tried to do, create contact and get to the free-throw line .\" • UB's low-post players - mostly Moss and Will Regan - had active hands and did just enough to keep Kentucky's massive post players from dominating. \"We tried to mix up some 2-3 zone, which we don't play that often, just for this game, and also played man just to give them different looks,\" Hurley said. \"Lucky for us they were not hitting their three-point shot in the first half .\" • Kentucky didn't pound the ball inside enough early. The Wildcats were 3 of 14 from three-point range in the first half. \"We came out sluggish, and they were playing harder than us,\" said Kentucky 7-footer Dakari Johnson. \"We needed this,\" Calipari said. \"We needed a team that could beat us on the dribble, that wasn't afraid, that played physical, that had an inside presence .\" Hurley wrote \"0-0\" on the locker room blackboard at halftime. But Kentucky turned up its defense in the second half and held UB to 14 points after intermission. \"The ability of their bigger players to play great defense away from the basket kind of was overwhelming at times in the second half,\" Hurley said. \"Being able to block shots makes it hard,\" Calipari said. \"You can say just drive the ball. But you're looking on the two 7-footers under there and a 6-10 guy .\" UB made just 4 of 19 second-half shots. Kentucky made 13 of 26. Alerts Text message notifications of news happening now. 280 Letter: Bishop's strong stance is a breath of fresh air Copyright 1999 - 2014 - The Buffalo News copyright-protected material. Sorry, an unexpected error occurred. Please try again later."}, {"articleID": "2016081519_00335609_W", "names": {"Martin Beck": ["Q1466639", "Q38326473", "Q42581262", "Q6774971"], "Amy Yao": ["Q40138088", "Q56254225"], "Karel Martens": ["Q22691458", "Q3193071"], "Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}, "date": "2016-08-15", "url": "http://artforum.com/news/id=62917", "content": "NYC's P! to Present Final Season of Exhibitions Installation view of \"O / U,\" 2016, featuring Aaron Gemmill, Julie Ault & <mark>Martin Beck</mark>, Brian O'Doherty (Patrick Ireland), Matthew Schrader, and <mark>Amy Yao</mark>. Photo: Sebastian Bach P!, an arts venue located in Chinatown that calls itself a project space, commercial gallery, and Mom-and-Pop Kunsthalle, has announced that after five years of experimental programming it will launch its final season of exhibitions this fall. From September 2016 to May 2017, P! will present five exhibitions, including \"<mark>Karel Martens</mark>: Recent Work,\" which is the artist's first solo exhibition in North America; \"The Stand,\" a show that will tie <mark>Stephen King</mark>'s 1978 eponymous novel about post-apocalyptic America with the nation's current political state; and Céline Condorelli: Epilogue, \"the UK-based artist's new body of work and the final show at the gallery. P! describes its last season as a group of shows that will engage with questions surrounding display strategies, curatorial models, identity hijinks, conflictual processes, and financial structures. Founded in 2012 by New York--based designer and curator Prem Krishnamurthy, P! has organized over forty exhibitions and offsite projects from its location at 334 Broome Street. Even though the experimental exhibition space is closing its physical location, Krishnamurthy said the organization will still be\" an exhibition-making machine. \"In 2018, P! will reinvent itself by expanding its mission, which will focus on organizing offsite exhibitions at venues in the US and abroad, developing publications with artists, and collaborating with institutions."}, {"articleID": "2017031503_00040234_W", "names": {"Kevin Hart": ["Q1740168", "Q3195712", "Q57439639", "Q618352", "Q6396452"]}, "date": "2017-03-15", "url": "http://forum.blu-ray.com/showthread.php?t=289674&goto=newpost", "content": "The Matrix Reboot in the works at WB User Name Somebody at work told me a theory about the original trilogy that kept me thinking--Makes me want to re-evaluate the trilogy in that context. But that's the whole thing, as everybody else is saying--the three movies (and animes) are fine as-is and hold up, it doesn't need a reboot. Nobody's asking for it. I could take a sequel, prequel, spin-off (and the material is there already--per Reloaded, the Matrix history goes back through five or six other versions of \"The One,\" so there could be many possibilities for more films or even a TV series). But reboot?! Hell no. . [Show spoiler] 11 WB, let's talk. Just because someone decided to make a movie based off Ghost in the Shell, that doesn't mean you have to rush and pull the closest thing you have in your IP closet out for a remake. For starters, they're not even that close. We don't even know if GITS is going to make that much money. The Matrix is already a pretty good movie and even though it's approaching drinking age, it hasn't withered. Besides, you're already preoccupied with ruining your DCU stable. You don't need to ruin everything you own. Thank you ....and sometimes I miss my 1985 RCA console TV. That reminds me, I wonder what's become of that Neuromancer adaptation? Will it ever see the light of day? (wikipedia says it's in a Chinese company's hands now) And a Snow Crash movie is in the works. Big cyberpunk wave is coming our way. I can see why WB wants to surf on it now. 3 Maybe Keanu can convince WB to do a sequel with him as the lead instead of this reboot crap. I mean, he is on top of his game currently and audiences love him in the John Wick films. He is hot NOW, and people want more badass action films with him as the lead. This would be a good time to the The Matrix 4 and John Wick: Chapter 3 right after that. 54 Remember when The X-Files revival was called a \"reboot\" ? More recently, the Twin Peaks revival keeps being referred to as \"reboot\" by the media. Considering how misused that term has become this'll end up being a sequel/prequel/spinoff etc.. Existing in the same universe but focusing on new characters. Last edited by spanky87; Today at 01:59 AM. Not happening, it will be an all black movie. Then it should have Jaden Smith as Neo and <mark>Kevin Hart</mark> as Morpheus. Top 10: (1) Blade Runner (2) Aliens (3) The Thing '82 (4) The Shining (5) Fear and Loathing in Las Vegas (6) My Neigbor Totoro (7) Monty Python and The Holy Grail (8) Evil Dead 2 (9) Stalker (10) Avalon Quote: Originally Posted by BladeRunner2007 Maybe Keanu can convince WB to do a sequel with him as the lead instead of this reboot crap. I mean, he is on top of his game currently and audiences love him in the John Wick films. He is hot NOW, and people want more badass action films with him as the lead. This would be a good time to the The Matrix 4 and John Wick: Chapter 3 right after that. WB: \"Makes too much sense, does not compute .\" Top 25 | Aliens | Amadeus | Annie Hall | Casablanca | Chinatown | The Dark Knight | Days of Thunder | Die Hard | Drive | Fargo | The Fugitive | The Godfather, Part II | Goldfinger | Goodfellas | Lawrence of Arabia | The Lord of the Rings | Psycho | Pulp Fiction | Raiders of the Lost Ark | The Shining | The Silence of the Lambs | Star Wars | The Sting | Unforgiven | Zodiac | (2016 Top 25) | 2017 Movie Ratings"}, {"articleID": "2012040217_00035089_W", "names": {"Brian Sullivan": ["Q18635472", "Q4965414", "Q4965415", "Q4965416", "Q4965417", "Q5092713", "Q849636", "Q913097"]}, "date": "2012-04-02", "url": "http://htrnews.com/article/20120402/MAN0101/304030025/1984&located=rss", "content": "mishicot - rick santorum brought his \"faith, family & freedom\" tour to fox hills resort sunday...htr boys basketball all-area team: valders' binversie bombarded with accolades valders' drew binversie, along with teammate taylor korslin, led his team to a third-place finish...sheboygan - grant pauly had a stable job at his family's kiel-based concrete company and a secure...manitowoc - what do you get when you combine the miracle on the hudson, a seaplane, a western...los angeles - jennifer lawrence's performance as an ozarks teenager searching for her father in...clintonville - a student from madison area technical college used audio equipment to capture the mysterious booming noise heard in the city over the past few weeks. city administrator lisa kuss said the city worked with <mark>brian sullivan</mark> from matc and captured a \"boom event\" on march 24. \"the city appreciates <mark>brian sullivan</mark>'s effort to capture this event,\" kuss wrote in an email. \"the city now has four seismometers in and around the city, which will give the usgs a better chance to pick up small events .\" presidential candidate rick santorum at fox hills in mishicot clintonville boom captured on audio a student from madison area technical college used audio equipment to capture the mysterious booming noise heard in clintonville over the past few weeks."}, {"articleID": "2014082801_00028072_W", "names": {"John Briggs": ["Q15497030", "Q4096455", "Q6223182"]}, "date": "2014-08-27", "url": "http://blogs.westword.com/latestword/2014/08/ethan_abbott_gmo_political_prisoner_harassment.php", "content": "Photo by Ambrose Cruz courtesy of March Against Monsanto Facebook/Occupy Denver Facebook A 2013 March Against Monsanto that Ethan Abbott helped to organize. Even his supporters admit that Ethan Abbott, the embattled natural farming activist who's been feuding with county authorities on several fronts, has a bit of a temper. But Abbott, 38, who was sentenced yesterday to ninety days in jail and eighteen months of probation in Weld County Court over a 2012 altercation with a neighbor, says that there's more to the case than his orneriness--that, in effect, he's the one being harassed and set up by influential people with ties to factory farming and fracking. It's an attitude that the judge who sentenced him finds disturbing. \"Mr. Abbott doesn't deal with conflict well,\" Judge <mark>John Briggs</mark> told the assembled at Abbott's tense sentencing hearing. \"The way that Mr. Abbott perceives things and reacts is not always consistent with reality .\" Denver's March Against Monsanto One of Ten Largest Worldwide, Organizer Says \"Abbott disagrees .\" I believe there's a lot more to this whole story than people are allowing me to bring out, \"he says. Some people who have worked with Abbott consider him to be a gifted and passionate, albeit volatile, proponent of natural farming. He's been heavily involved in the nonprofit Get To Know Your Farmer, which provides consultation and volunteer labor to help small, family-operated farms. He was an organizer of last fall's March Against Monsanto in Denver, hires the homeless to work on his farm projects, has been vocal in the fight against GMOs, and volunteered for the Colorado Foreclosure Resistance Coalition and similar causes. But Abbott has also had some pungent disputes with other activists as well as landlords. A master plumber, his work as a handyman has been blasted on one website by dissatisfied customers. And he's been involved in a series of disconcerting confrontations with vendors, law enforcement, animal welfare inspectors, and others over his farming operations during the past few years, particularly in Weld County. Prosecutors say Abbott has been involved in thirty court cases over the past 23 years, facing charges ranging from making\" terrorist threats \"to obstruction, menacing, and harassment. His public defender says thirteen of those cases were traffic offenses and that eight others ended in his acquittal or dismissal of the charges--including a recent acquittal on animal cruelty charges. That still leaves three assault convictions as an adult and a pile of civil litigation across five counties. Yesterday's hearing was the result of events that unfolded nearly two years ago, when a woman named Ellen Kerbs, who lived a mile from Abbott's farm, stopped by to tell him that one of his calves was loose in the road. According to Krebs, Abbott bellowed at her, cursed her and punched out the back window of her vehicle, spraying glass and terrifying her five-year-old grandson, who was in the back seat .\" I went through the most horrifying, scary event of my lifetime, \"Kerbs told the court .\" I saw somebody who was totally unhinged, disturbed. \"Abbott admits yelling at Kerbs for ignoring his\" no trespassing \"signs and entering his house uninvited, but he denies punching out her window. He says she reversed her van into him while he was in the driveway trying to spot the calf, and that it was his head, not his arm, that went through the back window. He says he suffered injuries to his knee, back and head--and no marks on his hands--but sheriff's deputies declined to conduct an accident investigation and charged him instead. At trial his own attorney didn't produce any of his medical records, and the jury found him guilty of criminal mischief, harassment and reckless endangerment--all misdemeanors. Abbott's statement at sentencing seethed with his frustration at the way the case had been handled. He produced a small pill bottle containing glass fragments that he says were removed from his head .\" I've never gone looking for trouble, \"he told Judge <mark>Briggs</mark>.\" I just want to farm. I do feel that if I go to jail, I am a political prisoner. I believe I would be murdered. \"But <mark>Briggs</mark> wasn't moved by Abbott's claims that he'd been targeted for threats and persecution by the Weld County Sheriff's Office, calling it part of the defendant's\" break from reality. \"In addition to the jail time, he ordered a mental health assessment and anger management classes as conditions of Abbott's probation."}, {"articleID": "2015111122_00111951_W", "names": {"David Klein": ["Q1175006", "Q15699760", "Q16663864", "Q2902258", "Q30611708", "Q5236065", "Q5236067", "Q7066597"]}, "date": "2015-11-11", "url": "http://news.yahoo.com/several-smaller-daily-fantasy-sports-sites-close-shop-222134811--nfl.html", "content": "Several smaller daily fantasy sports sites close shop in NY BySuzanne Barlyn and Sarah N. Lynch 11 minutes ago  Done By Suzanne Barlyn and Sarah N. Lynch NEW YORK/WASHINGTON (Reuters) - Several smaller daily fantasy sports sites have stopped doing business in New York after the state's attorney general ordered market leaders FanDuel and DraftKings to stop taking bets there. DailyMVP and DraftOps said they stopped taking payments in New York after Attorney General Eric Schneiderman sought to shut down the business in the state by their larger competitors. In addition, European daily fantasy site Mondogoal also said it would cease taking money in the state for now. Schneiderman, in a letter to DraftKings and FanDuel on Tuesday, declared that the two daily fantasy sports sites were running an illegal gambling operation. The move jeopardizes a major market in the multi-billion dollar daily fantasy sports industry and leaves many smaller operators in limbo over their New York operations. Schneiderman's order is an edict for other daily fantasy sports sites in New York's market, said <mark>David Klein</mark>, a New York lawyer who advises daily fantasy sports sites on compliance issues. <mark>Klein</mark> immediately told his clients to stop doing business in the state because of the order, he said. \"To proceed otherwise is dangerous, to say the least, at this juncture,\" said <mark>Klein</mark>, who does not advise DailyMVP or DraftOps. In the games, fans pay to compete for daily cash prizes based on imaginary teams assembled from rosters of real players, which accumulate points based on how those players perform in actual games. This has enabled fans to spend money on the games with a frequency that critics say is akin to sports betting. Schneiderman was pleased by the smaller operators' decisions to cease operations in New York. \"We urge FanDuel and DraftKings to follow this example, by immediately meeting the terms of the Attorney General's letter, and by ending their illegal gambling enterprise--and the economic and public health harms that come with it--here in New York,\" spokesman Matt Mittenthal said. DraftKings and FanDuel have five business days to respond to Schneiderman's order and continue to take money from customers in the state. Both are working to fight the order. DailyMVP and DraftOps said they would wait and see how their larger competitors fare in contesting the order. \"While we disagree with this decision, we have determined to respect the order of the attorney general,\" a DailyMVP spokeswoman said. New York customers can continue to play games that are free, she said. DraftOps did not receive an order, but also wants to follow all laws and regulations in the places where it operates, said Marie Vozikis, Operations Manager, in a statement. (Reporting by Suzanne Barlyn and Sarah Lynch; Editing by Michael Erman and Alan Crosby) Eric Schneiderman"}, {"articleID": "2019091303_00090841_W", "names": {"Elizabeth May": ["Q16194189", "Q2289262", "Q42322461", "Q445620"], "Paul Wells": ["Q3372414", "Q3372415"]}, "date": "2019-09-12", "url": "https://www.thepost.on.ca/news/party-leaders-rip-into-conspicuously-absent-justin-trudeau-at-first-leaders-debate/wcm/ce9d6c51-9a03-4a8f-a3f1-ba261196f36c", "content": "More from Vanmala Subramaniam Published on: September 12, 2019 | Last Updated: September 12, 2019 11:20 PM EDT Green Party Leader <mark>Elizabeth May</mark>, Conservative Leader Andrew Scheer and NDP Leader Jagmeet Singh, along with an empty lectern where Liberal Leader Justin Trudeau would have been, at the first leaders' debate on Sept. 12, 2019 in Toronto. Frank Gunn/The Canadian Press Share Adjust Comment Print Conservative Party leader Andrew Scheer took aim at a conspicuously absent Justin Trudeau, while Green Party leader <mark>Elizabeth May</mark> and the NDP's Jagmeet Singh sparred largely at each other in an attempt to cement themselves firmly in third place in the polls, at the first leaders' debate on Thursday night in Toronto. Thursday's Maclean's / City TV debate was the first of four in the federal election campaign, and the first time Scheer and Singh are participating in a leaders debate. Trudeau has chosen to attend only a single English language debate on Oct. 7 and will participate in both French language debates. The debate began with questions on the economy, before moving on to discussions on Indigenous issues, the environment and foreign affairs, particularly Canada's current frosty relationship with China. I'm not going down the little rabbit hole \"Justin Trudeau promised that the budget would be balanced this year, but all we've seen is deficit after deficit. Right after the election he will raise your taxes,\" Scheer said, in opening remarks. \"Governments in Ottawa have always made decisions that make it easiest for the richest and hardest for the poorest,\" declared Singh, who spent most of the 90 minutes hammering home the NDP's signature talking points of reducing inequality and increasing affordability for Canadians. Moderator <mark>Paul Wells</mark> then attempted to pin Scheer down on a question on whether he would defer his plan for a balanced budget in the event of an economic recession, or push further cuts, but Scheer deflected, emphasizing his plan to balance the budget within five years. While all three leaders said they opposed Bill 21, Quebec's religious symbols ban--not unlike Trudeau's stance on the issue--none would entertain the idea of intervening in Quebec's internal politics in order to see some kind of constitutional reversal to the bill. Singh called bill 21 \"legislated discrimination\" and \"hurtful\" , while <mark>May</mark> suggested that if elected Prime Minister, she would find some way of ensuring that those affected by the bill would be able to seek employment in other provinces. Why did Trudeau skip the first leaders' debate? The SNC-Lavalin scandal likely had something to do with it Scheer spent much of the first half of the debate challenging <mark>May</mark> and Singh on their healthcare policies, particularly how they would be able to afford paying for a national pharmacare program. \"You cannot increase healthcare services when you are paying more and more money to pay the service charges on the debt and that is what all these plans will lead to,\" Scheer said. The NDP has pledged to provide nationwide pharmacare and dental care if elected, at a price tag of $43 billion, one that Scheer immediately pointed out would lead to a vast tax hike. \"That money has to come from somewhere .\" <mark>May</mark> focused most of her talking points on issues around climate change and the environment, taking specific aim at what she called the NDP's \"unclear\" climate target, despite Singh's repeated attempts to emphasize his party's position to keep to the 1.5 degree Celsius safe upper limit climate target. The NDP is the only party to have released a full campaign platform so far, which includes rolling back exemptions for heavy polluters, and a promise for $15 billion in green investments which they say would create 300,000 green jobs over the next four years. . Gary Clement/National Post \"The Green Party and NDP share a lot in common: we have a solid position on a women's right to choose, on national unity, on workers' rights, and we believe we should not be putting Mr. Scheer in the prime minister's seat, which Ms. <mark>May</mark> believes is the right choice,\" said Singh. \"Those are absurd statements. I'm not going down the little rabbit hole that Mr. Singh just created,\" <mark>May</mark> said, laughing. \"I think they all did what they needed to do, for the most part,\" said former NDP strategist and current Hill & Knowlton Strategies associate Anne McGrath. \"The big surprise for people is going to be Jagmeet Singh. He was clear, concise and very value-based .\" McGrath added that <mark>May</mark>'s advantage is that she is well known to Canadians, but she tended to go down \"a number of rabbit holes\" during the debate. \"She's very detail oriented partly because she has a lot of knowledge but she was not able to adequately explain some of the difficulties that she's been in in the last week or two, especially around abortion .\" Quotes and exchanges from the first federal leaders' debate: Singh: \"I didn't cut you off while you were talking. Now the people at the very top--\"Scheer:\" I didn't say things that aren't true. \"--<mark>May</mark>:\" I would not cut spending and services. We need to massively expand services. We need 100-per-cent universal pharmacare. Jagmeet's right--we have to bring in pharmacare. \"--Scheer:\" There are many laudable goals within this piece of legislation, many things that a Conservative government will support, that I will support as prime minister, but we cannot create a system in this country where one group of individuals, one Indigenous community, can hold hostage large projects that employ so many Indigenous Canadians. \"--<mark>May</mark> to Scheer:\" Consulting (with Indigenous Peoples) is not,' I will consult with you till you agree with what we've already decided to do .' That's not consultation and it's not--it's what Trudeau thinks is consultation, it's obviously what you think is consultation, but it has to be free, prior, informed consent. \"--Singh\" When it comes down to it, the Green party and New Democrats share a lot of common, except for the following four points: when it comes down to it, we have a solid position, unlike the Greens, on a woman's right to choose. We have a solid position when it comes down to--\"<mark>May</mark>:\" That's not true. \"Singh:\" --national unity. We have a belief that we can't leave workers behind and we strongly believe that we should not be putting Mr. Scheer in the prime minister's seat, unlike Ms. <mark>May</mark> and the Green party who believe that's the right choice. \"<mark>May</mark>:\" Excuse me. Those were absurd statements. I'm awfully sorry. \"--Scheer on his pro-Brexit stance:\" I'm always in favour of countries' being able to chart their own destiny and control their own internal affairs and it is now up to British lawmakers and the British people to determine what happens next (with Brexit). My focus is on restoring Canada's place in the world. \"--Scheer:\" I think I found some consensus. I think we can all agree that Justin Trudeau is afraid of his record and that's why he's not here tonight. He has made life more expensive--\"Singh:\" It might be the only thing we agree on, but we'll agree on that. \"<mark>May</mark>:\" We agree on that ....We can now sing' Kumbaya' and keep going. \"--The Canadian Press"}, {"articleID": "2016041923_00434195_W", "names": {"John Lyon": ["Q6184503", "Q6245630", "Q6245631", "Q6245632"], "Jeremy Hutchinson": ["Q1374545", "Q6181510"], "Charlotte Douglas": ["Q16151703", "Q18239008", "Q54804421"], "Alan Clark": ["Q15378814", "Q16204309", "Q18685443", "Q21453460", "Q676375"]}, "date": "2016-04-19", "url": "http://arkansasnews.com/news/arkansas/amended-version-medicaid-funding-bill-advances", "content": "Amended version of Medicaid funding bill advances Amended version of Medicaid funding bill advances Gov. Asa Hutchinson talks to reporters Tuesday at the state Capitol. (Dale Ellis photo) By <mark>John Lyon</mark> jlyon @ arkansasnews.com LITTLE ROCK--A legislative committee on Tuesday advanced an amended version of a bill to appropriate funding for the state Medicaid program, including Gov. Asa Hutchinson's Medicaid expansion plan. The Joint Budget Committee advanced Senate Bill 121 after adopting an amendment that would end Medicaid expansion on Dec. 31 of this year, but <mark>Hutchinson</mark> has said he will use a line-item veto to remove the sunset provision if the bill reaches his desk. The Senate is expected to vote on the bill Wednesday. Sen. Jim Hendren, R-Gravette, the governor's nephew, presented the amendment as a way to maneuver around the opposition of 10 Republican senators who have blocked funding for the governor's Medicaid expansion plan, titled Arkansas Works. Nine votes are enough to block an appropriation bill requiring a three-fourths vote in the 35-member Senate. <mark>Hutchinson</mark> has said three of the 10 senators who oppose Arkansas Works have told him they are willing to go along with the veto strategy. The Joint Budget Committee had rejected an amendment Thursday that would have removed funding for Arkansas Works from the bill, also with a line-item veto promised. Hendren said Tuesday the new amendment is an improvement on the first. \"Working with Democrats and the attorneys, they pointed out that a provision like this is more defendable in court than a more restrictive measure to prohibit funds from being spent,\" he said. The new amendment also contains language stating that all provisions of the bill are severable, meaning that if any one provision is ruled invalid, the other provisions will still be valid. <mark>Hutchinson</mark> told reporters Tuesday the new amendment \"is probably more clear, and it minimizes any legal challenge that might take place .\" \"The other good thing about it is that this has really brought us together, both Democrats and Republicans, as we sought this solution. This really reflects the best of the legislative process, where we don't reject good ideas, we embrace good ideas,\" he said. More than 267,000 low-income people have obtained insurance under Arkansas' current Medicaid expansion program since it was created in 2013 as an alternative to the expansion of Medicaid rolls proposed under the federal Affordable Care Act. Arkansas Works would add features such as referrals to work training for unemployed recipients and small premiums for people earning between 100 and 138 percent of the federal poverty level. During debate on the amendment in the budget committee, Hendren said, \"We know that if we fail (to pass Arkansas Works), 270,000 people are going to lose their insurance. We know that if we fail, $1 billion a year for the next five years is going to be pulled out of Arkansas' health-care system. We know that if we fail, our budget's going to have some real challenges ahead .\" Rep. <mark>Charlotte Douglas</mark>, R-Alma, said the three-fourths majority requirement for appropriations bills exists as a safeguard. \"I think that we are overlooking an important piece of the equation here when we do not honor the people of Arkansas and what they think should go on up here--the integrity, the ethics, and how they feel like business should be conducted,\" she said. Sen. <mark>Jeremy Hutchinson</mark>, R-Little Rock, also the governor's nephew, said the line-item veto power was approved by Arkansas voters and that \"nobody is doing anything underhanded or with a lack of integrity .\" Sen. Jason Rapert, R-Conway, who last week said he was concerned about Arkansas Works providing coverage for the so-called morning-after pill, provided committee members with a letter from the governor pledging to pursue a federal waiver to allow Arkansas to exclude coverage for emergency contraception from the traditional Medicaid program and inquire about the state's options related to excluding the coverage from Medicaid expansion. The amendment passed 41-11. The committee sent the bill to the Senate in a voice vote. Most Democrats on the committee voted against the amendment that was offered Thursday, but most voted for the amendment offered Tuesday. \"I think it's a good demonstration of, if you just take a deep breath you can come up with better ideas,\" Senate Minority Leader Keith Ingram, D-West Memphis, said after the vote. Earlier Tuesday, a group of opponents of Arkansas Works held a news conference to propose several changes to Arkansas Works that they said would make the program acceptable to them, including restricting coverage to people earning up to 100 percent of the federal poverty level instead of 138 percent and moving them to traditional Medicaid. \"The ACA introduced new government spending while we are hurtling toward a fiscal cliff,\" said Sen. <mark>Alan Clark</mark>, R-Lonsdale. \"We have passed $19 trillion in debt in this country and have passed our gross domestic product. Few, if any, nations have ever survived this milestone .\" The Legislature approved Arkansas Works during a special session earlier this month. The governor said Tuesday that the policy has been decided and that funding it is \"what we're focusing on .\" The House on Tuesday voted down the General Appropriation Act for the second time. The state constitution requires that the Legislature pass the bill, which funds expenses of the Legislature and the judicial branch, before passing any other bill in a session. House Democrats have been blocking the General Appropriation Act while legislators work to resolve the impasse in the Senate over Arkansas Works. _____"}, {"articleID": "2014100704_00062853_W", "names": {"Robert Scott": ["Q16195792", "Q17011471", "Q22280381", "Q26844391", "Q27835060", "Q28792452", "Q43391197", "Q43911924", "Q51589864", "Q55214937", "Q55215079", "Q57398724", "Q7340536", "Q7349659", "Q7349662"], "Tim Johnson": ["Q21279635", "Q329070", "Q3991363", "Q57844502", "Q7803722", "Q7803724", "Q7803725", "Q7803726", "Q7803727", "Q7803728", "Q861115", "Q925052"]}, "date": "2014-10-07", "url": "http://www.wctrib.com/content/willmar-city-council-gives-preliminary-ok-tax-abatement-redevelopment", "content": "Festivities surrounding Meander Weekend set in western Minnesota Tweet WILLMAR - Hutchinson mobile home park owner Gus Wurdell recently purchased the Regency East Mobile Home Park from its Colorado owners and is proposing to redevelop the Willmar park with new infrastructure and new affordable workforce housing. But Wurdell said the project will not support itself without a city business incentive, and he's requesting the Willmar City Council consider a 10-year abatement of city property taxes. Wurdell said the abatement will allow time for sufficient redevelopment and position the project for long-term success. Wurdell's request was reported to the council Monday night and the council voted to give preliminary approval to the abatement and directed City Planning and Development Director Bruce Peterson to solicit a formal application from Wurdell. The council's action was recommended by the Community Development Committee. Councilwoman Audrey Nelsen asked City Attorney <mark>Robert Scott</mark> to clarify the meaning of \"preliminary approval .\" <mark>Scott</mark> said the council was not obligating itself. With preliminary approval, the council will likely receive a formal application, in which case the council will have to apply its policies to make a decision, he said. \"You're not binding the council one way or the other,\" <mark>Scott</mark> said. \"You're giving a signal to the potential applicant that it might be worth his time to go through that process .\" In a Sept. 15 letter to Peterson, Wurdell said Regency East has suffered from poor management and deferred maintenance, which resulted in 75 percent vacancy and blighted conditions. After several years of trying to take over ownership of the park, he successfully closed on the property Sept. 15. Wurdell said affordable, quality housing is in short supply in Willmar as noted in the Vision 2020 and Vision 2040 community studies, \"and I believe this project will make a tremendous impact towards satisfying this need .\" Preliminary approval was recommended by the Community Development Committee. Committee Chair Rick Fagerlie said some questions were raised during committee discussion regarding the value of property that would be subject to the abatement. Fagerlie said staff will research that matter and the matter will be part of the financial analysis. The financial analysis will determine whether or not the mobile homes, which are considered personal property, are included in the abatement. Fagerlie reminded the council that Wurdell came to the committee about a year-and-a-half ago and said he wanted to purchase the park, but that the owners in Colorado decided not to sell. \"I think this would be a great project and really help the northeast part of Willmar,\" Fagerlie told the council. Councilman Jim Dokken asked if the project will be a positive thing for the city. Peterson explained Wurdell must still provide a formal application with a better statement of intent and a financial analysis to demonstrate the need for the tax abatement, among other things. Peterson said the city can expect the infrastructure to be upgraded and streets to be improved. The park will be better maintained and common areas for recreation will be created. Peterson said Wurdell was looking to be the primary home buyer and will resell the homes, but will rent the lots. Councilman <mark>Tim Johnson</mark> said he did not recall that the council had given preliminary approval to tax abatements in the past. Peterson agreed and said the committee worked on a different process to evaluate and review tax abatement requests. As a reasonable first step, Peterson suggested staff receive the developer's proposal and staff do some initial review and bring it to committee to determine if the request adheres to the policies. <mark>Johnson</mark> said Peterson is working on more formalized procedures. \"Obviously on this particular property, it looks quite positive,\" <mark>Johnson</mark> said. Gas prices dip under $3 per gallon 39 min ago COINS, ANTIQUES, GUNS & MISC AUCTION Located: Hawick Town Hall, Hawick, MN. SUN ., OCT 12, 12:00 NOON Coins to be sold at 8:45 am. Apx 350 lots. ANTIQUES, CLOCKS, GUNS & MISC AUCTION Located: Block's Auction Center, 2 mi SW of Spicer, MN on Hwy 23. MON., OCT 13, 4:00 PM Crock bowls; RENVILLE, MN - REAL ESTATE AUCTION Located: 402 SE 3rd ST, Renville, MN. THUR ., OCT 16, 10:30 AM Open House Dates: Mon, Oct 6, 5-6 pm, Mon, Oct 13 ANTIQUES, SHOP, YARD & MISC AUCTION Located: 850 Flanders Dr, Paynesville, MN. From Hwy 23 & MN 55, 4/10 mi SE on Hwy 55, 2 blks S on Maple 2208 Trott Ave. SW / P.O. Box 839 Willmar"}, {"articleID": "2019012119_00080215_W", "names": {"Lauren Anderson": ["Q459868", "Q57431632", "Q6500115"], "Brandon Maxwell": ["Q23766302", "Q30122593"], "Jennifer Holliday": ["Q3062952", "Q439626"], "Jim Nelson": ["Q17370723", "Q6197142", "Q6197145", "Q6197147", "Q6197149"]}, "date": "2019-01-10", "url": "http://chron.com/life/society/article/Lynn-Wyatt-and-Lauren-Anderson-name-remaining-13523999.php?cmpid=hpctp", "content": "https: //www.chron.com/life/society/article/Lynn-Wyatt-and-Lauren-Anderson-name-remaining-13523999.php Lynn Wyatt and <mark>Lauren Anderson</mark> name remaining Texas Medal of Arts Awards honorees at Houston Ballet Austin gala to celebrate Matthew McConaughey, Mark Seliger, <mark>Brandon Maxwell</mark> and Trenton Doyle Hancock and more benefiting Texas Cultural Trust By Amber Elliott Updated 2:36 pm CST, Thursday, January 10, 2019 Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Photo: Elizabeth Conley, Staff Photographer Photo: Elizabeth Conley, Staff Photographer Image 1 of / 22 Caption Close Image 1 of 22 Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Former Texas Medal of the Arts Award recipients Lynn Wyatt and <mark>Lauren Anderson</mark> pose for a photo with Texas Cultural Trust Executive Director Heidi Marquez Smith on Thursday, Jan. 10, 2019. Photo: Elizabeth Conley, Staff Photographer Lynn Wyatt and <mark>Lauren Anderson</mark> name remaining Texas Medal of Arts Awards honorees at Houston Ballet 1 / 22 Back to Gallery A tony group of well-heeled Texans gathered at Houston Ballet on Thursday morning. There wasn't a ballet slipper or pointe shoe in sight. Even <mark>Lauren Anderson</mark>, one of the first African-American ballerinas to become a principal for a major dance company, rocked a patent stiletto. Her task, alongside fellow state treasure Lynn Wyatt, was to unveil this year's three remaining Texas Medal of Arts Awards honorees. The Texas Cultural Trust usually divulges its full roster all at once. Most times, the big reveal happens during a semiformal announcement party. But with bold-face recipients including Matthew McConaughey, Mark Seliger, <mark>Brandon Maxwell</mark> and Trenton Doyle Hancock headlining the 10th biennial list, the Austin-based nonprofit couldn't wait that long--or resist a little early name-dropping. Fellow Texans Stephen Harrigan, Elaine Molinar and Craig Dykers have also been tapped, as has Laredo's Vidal M. Trevino School of Communications and Fine Arts. On Thursday, Texas Cultural Trust's board members traveled from across the state to hear the final trio - Boz Scaggs, Stephen Harrigan and <mark>Jennifer Holliday</mark> - receive their due, bringing the total headcount to 11. Why the extended drumroll? \"We want to garner as much support and celebrate these legends for as long as possible,\" said Heidi Marquez Smith, Texas Cultural Trust's executive director who also feted the early press conference. She told onlookers from the blue-screened stage, \"For artists and those in creative fields, a Texas Medal of Arts Award is the highest honor in the land .\" Houston Ballet's executive director <mark>Jim Nelson</mark> also shared brief remarks. He observed how fitting it was for <mark>Anderson</mark>, who danced with the company from 1983 to 2006, to return for the occasion. Afterward, the crowd posed for photos with <mark>Anderson</mark> and Wyatt. The women, both TMAA winners in 2017, got along famously. \"Lynn, if I'm in the picture, you're in the picture,\" <mark>Anderson</mark> said, coaxing her ally to join her at center stage. It's good practice for the River Oaks cocktail party scheduled in their honor later that evening, and the main event, next month in Austin. Texas Cultural Trust's two-day celebration Feb. 26 - 27 promises quite the show - especially if it's announcement style is any indication. Lifestyle In just 35 minutes, you can have this silky, spicy take on a.. . Major fashion moments steal the show at Winter Ball honoring...Celebrity couples you forgot dated in the '90s Legendary rocker Janis Joplin would have turned 76 this weekend Famous central Texas BBQ spot opens Houston location this weekend Most Popular 1 Mother grieves for teen son killed as friend showed off gun 2 Local business spotlight: Demand high for Crosby Crawfish Shack's well known taste 3 She scammed dozens out of savings so she could stay at the Ritz 4 First Buc-ee's outside of Texas opens today 5 State Bar drops probe into ex-prosecutor accused of withholding evidence in Texas death row case 6 3 dead after East Houston home invasion triggers shootout 7 \"Boss Life Ball' pulls hot crowd for charity 8\" Fox & Friends' Apologizes for Graphic Mistakenly Announcing Ruth Bader Ginsburg's Death (Video) 9 Memes mock gut-wrenching playoff losses by Saints, Chiefs 10 Pearland's iconic rice silos are officially gone, but you can still say goodbye View Comments © 2019 Hearst Communications, Inc. ."}]