[{"date": "2013-11-05", "url": "http://bleacherreport.com/articles/1838845-breaking-down-what-to-expect-from-the-new-version-of-andrew-bynum", "content": "Breaking Down What to Expect from the New Version of Andrew Bynum Oh the irony of Andrew Bynum sitting above a health insurance advertisement. It's time to start forming new expectations for Andrew Bynum. Even after he made his Cleveland Cavaliers debut against the Brooklyn Nets, there was optimism in the air. Boyer wrote, \"The goal/hope always was that Bynum could return to his All-Star form, and if he stays healthy and does that, the Seeing Bynum make an All-Star team is nothing more than a pipe dream now, even if he's looked solid through his first three appearances. On the heels of some sobering news, it seems as though Cleveland will be lucky to get a consistent starting center out of his seven-foot frame: Andrew Bynum tells reporters he's not sure his explosiveness will return and that he'll have to rely more on footwork and skill Boyer also reports the following:\" Preparing to play his third game of the season, Bynum acknowledged that he had experienced \"little, sharp pains .'\" Uh-oh. Bynum has always been a big, physical and skilled center when healthy, but that's no longer true. He may be kind of healthy, but the physicality and athleticism that helped make him special aren't all going to be there any more. Even Bynum himself is admitting it. In the wake of that news, what can we expect from the 7-footer? First of all, don't expect Bynum to play much at any point during the 2013-14 campaign. There are too many factors preventing him from racking up major minutes in his return from a year off. The big man literally sat out an entire season, failing to play even a single second while he was a member of the Philadelphia 76ers. Setback after setback prevented him from stepping onto the court and dashed his hopes of playing like a single pin left standing could shatter dreams of bowling a 300. Because of that, it's important to keep in the back of your mind that this season is already a success. No matter how little action he sees over the course of the year, playing limited minutes is still a positive development. During the first four Cavaliers games of the season, Bynum has recorded one DNP (in an 89-74 loss to the Indiana Pacers) and averaged 12.3 minutes per contest when he has been active. The minutes haven't followed a consistent trend, but the 19 he recorded against the Minnesota Timberwolves were as many as he played in the first two games combined. Nineteen should be viewed as a number approaching the upper threshold this year. Eventually, Bynum may start averaging right around 20 minutes per game, but it's tough to see him earning anything more. Not only is his health working against him, but so too is the rest of the Cleveland frontcourt. and Tristan Thompson both have to get major minutes, and <mark>Anthony Bennett</mark> and Tyler Zeller must get run as well, the former more so than the latter. NBA.com's statistical databases, Bynum is averaging 2.7 close touches per game, defined as touches that originate within 12 feet of the basket and don't come on drives to the hoop. Throughout the league, 60 players have recorded a higher number, including back-to-the-basket specialists (your sarcasm alarm should be blaring) like Jimmy Butler, Andrea Bargnani, Daniel Orton, <mark>Mike Scott</mark>, Biyombo and so many more. Even a non-dominant offensive player like Andre Drummond has recorded 6.7 close touches per game, still well shy of Derrick Favors' league-leading 9.0. That's not going to change. Without his explosiveness and relying solely on his footwork, Bynum isn't going to have the ability to work in the post very often. He can't afford to take the ball out of Kyrie Irving and Dion Waiters' hands for too long, after all. are running at the ninth-fastest pace in the league, averaging 97.3 possessions per 48 minutes. This is a team filled with young players who are built to run, and it's not going to function at a high level if the ball is consistently thrown into Bynum's area so that things can slow down. Cleveland has tried to force things to the big man, but that's not going to work for any sustained period of time. He's only shooting 5-of-18 from the field so far, and just two of those buckets have been created through post moves. Below you can see the release of all five made shots. opportunity that will go down as his first make for the Cavaliers. All screenshots taken from NBA.com's video databases. 4. A floating hook over the outstretched arms of Nikola 5. A spot-up jumper that didn't require him to put the ball on the floor. Of the five makes, only two saw the Cavaliers work to get him post touches, and that's going to be a consistent trend throughout the year. If you're expecting vintage back-to-the-basket Bynum, you'll have to put in tape from his days with the Los Angeles Lakers. Dominant Defense and Rebounding Numbers On defense and when crashing the boards, Bynum has been able to make an impact by using his sheer size. Take his first block of the season, a rejection against <mark>Reggie Evans</mark>: Throughout that play, he remains nearly stationary. While <mark>Evans</mark> rotates around him, he just stays put and deters the Nets from attacking the rim because they know they can't get around him. First, he fends off a driving guard. Then he slides slightly over so that he can get in the way of the power forward. That's all he has to do. On the boards, Bynum hasn't been effective as he was during his basketball prime, but he's still averaging 9.7 rebounds per 36 minutes. Don't expect that number to rise much higher, as it's not positioning that needs work. Competent role-player or low-level stater The big man is doing a good job boxing out offensive rebounders and positioning himself well for the times the ball caroms off the rim, but without the ability to elevate, and especially to elevate twice in quick succession, he isn't going to post elite numbers. Or even elite per-minute numbers. While this will change if Bynum regains his explosiveness and proves-without a shadow of a doubt-that he can play big minutes on a consistent basis, he's going to be a big body functioning as a limited role player. He isn't going to be the All-Star version of Andrew Bynum, but rather a 7-footer who can defend, rebound and give Cleveland occasional scoring bursts. What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? This comment and all replies have been deleted This comment has been deleted We'd like to send you the most entertaining", "articleID": "2013110608_00064755_W", "names": {"Anthony Bennett": ["Q23461646", "Q4772100", "Q4772101", "Q4772102", "Q572881"], "Mike Scott": ["Q16216757", "Q1849355", "Q3313545", "Q582252", "Q6848743", "Q6848747", "Q6848748", "Q6848749"], "Reggie Evans": ["Q2561832", "Q7308228"]}}, {"date": "2013-11-07", "url": "http://news.collegemedianetwork.com/2013/11/07/u-to-create-committee-in-wake-of-kelly-protest/", "content": "You are now leaving College Media Network to visit http: //feeds.browndailyherald.com/~r/BrownDailyHerald/~3/fH3SbwVr2n4/ (If your pop-up blocker is activated, please click on the link above .) President Christina Paxson will form a committee to review actions surrounding the cancellation of New York City Police Commissioner <mark>Ray Kelly</mark>'s Oct. 29 lecture after protestors halted his speech, Paxson wrote in a community-wide email Wednesday. The Committee on the Events of October 29th will also address how to effectively maintain a \"deep commitment to the free exchange of ideas,\" Paxson wrote. After an initial review of the event, the committee will determine whether students who protested will face disciplinary action, as protests that \"infringe upon\" the free exchange of ideas are banned in the Code of Student Conduct. \"Halting a lecture, debate or any public forum is an unacceptable form of protest,\" the Code of Student Conduct states. Paxson, the Faculty Executive Committee and \"relevant student groups\" will help appoint members to the committee, which will include five faculty members, two undergraduate students and one graduate student. The University will likely announce committee members within the next week, wrote Marisa Quinn, vice president for public affairs and University relations, in an email to The Herald. Graduate Student Council President Keila Davis GS and Dean of the Graduate School <mark>Peter Weber</mark> will each nominate two graduate students for the committee, Davis said at Wednesday night's GSC meeting. Provost Mark Schlissel P '15 will have the final say on which graduate student serves. Undergraduate Council of Students President Todd Harris' 14.5 said he has communicated with administrators about how to determine which undergraduates should serve on the committee, though he did not have information on how those students would be picked. At the GSC meeting, Vice President for Campus Life and Student Services Margaret Klawunn said it remains to be seen whether students who protested <mark>Kelly</mark>'s lecture will be allowed to serve on the committee. The committee's composition \"will be very telling of what this committee aims to do,\" said Marguerite Joutz' 15, a leader of Brown Conversation, which hosted an event Saturday night about both the protests and the role free discourse plays at Brown. Incorporating input from faculty members, staffers, undergraduates and graduate students is important, said Iris Bahar, chair of the FEC and a professor of engineering. \"This should really be a process that involves several constituents .\" The committee will seek advice and may host a forum soliciting community input, she added. Some students at the GSC meeting voiced concerns over a lack of representation because only one graduate student will be on the committee. Once committee members are chosen, they will begin the first of two phases of recommendations. In the first phase, the committee will \"review the activities and circumstances related to\" <mark>Kelly</mark>'s lecture and \"identify issues that may have contributed to the disruption,\" Paxson wrote. The second phase will allow the committee to discuss the role of free expression and dialogue on campus, Paxson added. The University hopes to complete this phase relatively quickly while still allowing time for sufficient discussion, Quinn wrote. \"The decision to form the task force is about taking into consideration the fact that there's a broad context for understanding everything that happened,\" Klawunn said. The committee must review everything, ranging from how the event was organized to its title, she added. \"There are some things that are unclear and not everyone knows all of the circumstances,\" Bahar said. In the days following the event, there was \"a lot of discussion with students of color who felt not totally integrated into the community,\" said Rebecca Millstein' 16. She added that she thinks trying to fix this by formulating a committee is a \"really great idea .\" Other students were critical of the decision. \"How many committees is Paxson going to create? There are so many,\" said Ayane Ezaki' 13.5. \"Is that the way she's going to run the University? Relegate every sensitive topic to a committee?\" Though a majority of students supported protesters' actions outside <mark>Kelly</mark>'s lecture or petitioning to have the event canceled, about 73 percent indicated they did not approve of protests causing the event to be shut down, according to a poll The Herald conducted Monday. About 71 percent of students supported petitioning, and about 80 percent of students favored outside protests. Paxson sent out two letters on Wednesday - one to undergraduates and another to the entire campus community. In the first email, Paxson said she wanted to write to undergraduates separately and shared with them what her next letter, to the entire campus community, would entail. Paxson \"felt strongly about writing directly to undergraduates\" after spending a \"great deal of time this last week\" speaking with undergraduates in forums and smaller gatherings, Quinn wrote. Paxson's emails argued for the importance of free expression and protest, as long as they occur under \"acceptable means .\" But, Paxson wrote, the means by which protesters stopped <mark>Kelly</mark>'s lecture were unacceptable and a violation of the code of conduct students agree to before arriving on campus. Joutz said she hasn't read through the entire Code of Student Conduct and thinks most students have not read it either. \"I don't think administrators can disregard policy, though,\" she added. Disciplining protestors would be \"unfair,\" said Johanna Thompson-Westra' 14. After completing the initial review of events, the committee will see \"if any further follow-up is appropriate\" for those individuals who participated in the protest, Klawunn said. \"That decision will be made out of an examination of all of the circumstances,\" she said. There is no \"predetermined outcome\" for code violation, she added. If the University chooses to take disciplinary action, it \"shouldn't be super harsh,\" said Nicola Malakooti' 16. Diego Arene-Morley '16 said that while meeting <mark>Kelly</mark> with such force was not effective, neither is meeting students with force. \"I don't think that punishment is going to make us feel any better about the problems,\" he added. Brown International Socialist Organization: Power to the students!", "articleID": "2013110715_00007263_W", "names": {"Peter Weber": ["Q104841", "Q125546", "Q2078898", "Q2078900", "Q2078902", "Q21012488", "Q21921734", "Q2491705", "Q27230537"], "Ray Kelly": ["Q16509084", "Q3420958", "Q7297693"]}}, {"date": "2013-11-10", "url": "http://feeds.theguardian.com/c/34708/f/663860/s/3384abd9/sc/38/l/0L0Stheguardian0N0Cfootball0C20A130Cnov0C10A0Cred0Ehot0Echili0Epeppers0Edrummer0Ewiping0Eflamengo0Eshirt/story01.htm", "content": "Red Hot Chili Peppers drummer sorry for wiping backside on Flamengo shirt <mark>Chad Smith</mark>, the drummer for the US rock band Flamengo fans after he caused outrage in Brazil by wiping his backside with the club's shirt. <mark>Smith</mark> made the gesture - which was filmed and went viral on the internet - at a drum clinic in Belo Horizonte last week. The band played there as part of a South American tour, before moving on to Rio, home to Flamengo, where they played on Saturday evening. Fans of Flamengo, who claim to be the best-supported club in Brazil with more than 30m fans, were outraged by the incident and forced <mark>Smith</mark> to quickly backtrack. \"I want to apologise for my inappropriate antics at the drum clinic, my joke about team rivalries went too far,\" <mark>Smith</mark> said on twitter. \"Flamenco (sic) fans...I'm sorry .\" Red Hot Chili Peppers drummer sorry for wiping backside on Flamengo shirt More shocking revelations from the mysterious \"Secret Footballer'. Tim Krul inspires Newcastle United to three points at Tottenham Hotspur Robot trade fair in Japan Tokyo's international robot exhibition (iREX) Teenagers say goodbye to Facebook and hello to messenger apps Aid efforts begin after typhoon Haiyan kills 10,000 in Philippines: live updates Manchester United v Arsenal - live! Sunderland v Manchester City - as it happened Homosexuality illegal in 41 out of 53 Commonwealth countries - report Bradley Wiggins capped his remarkable sporting year by taking home the big prize at the ceremony in London A glass of wine with a rough sleeper, Santa in trunks, a thousand partying Muscovites...in a My Best Shot special, top photographers pick the image that sums up winter for them", "articleID": "2013111101_00033483_W", "names": {"Chad Smith": ["Q1058609", "Q17303653", "Q269500", "Q5066355", "Q5066356", "Q5066358"]}}, {"date": "2013-11-11", "url": "http://komu.com/news/using-ethanol-to-fuel-missouri-s-economy-sparks-debate/#comments", "content": "Using Ethanol To Fuel Missouri's Economy Sparks Debate LADDONIA - Drivers could see new options at the gas pumps in 2014. Federal regulations require an increase in biofuels starting next year. Six ethanol plants in Missouri turn corn into fuel for your car. John Eggleston, a farmer in Northern Missouri, sells his corn to the POET Ethanol Plant in Macon. \"It helps in the economics of what we receive as far as income because ethanol does help the overall market,\" Eggleston said. \"Ethanol has made the producer able to raise more acres of corn as long as the increasing technology is there to make higher yields .\" <mark>Steve Murphy</mark>, manager of Laddonia's POET plant, says the Renewable Fuel Standard could bring more money into Missouri's economy. \"In Missouri, agriculture is the biggest industry so it can have a huge ripple effect,\" <mark>Murphy</mark> said. The Laddonia plant receives all of its corn from Missouri farmers and generated 180 million dollars of economic activity last year. \"In Audrain County and in other rural counties, that's a big economic engine for fertilizers, for seeds, for fuel for all of the supplies farmers need and we provide a local source for them to sell their product,\" <mark>Murphy</mark> said. \"We are a big consumer of gasoline and yeah, it's going to have a tremendous impact because of the volume of gasoline that we have to maintain every year,\" Eggleston said. Nearly all of the ethanol produced at Laddonia stays in state. Missouri currently mandates ten percent of ethanol in regular gasoline. E85, which contains 85% ethanol, is an option at some gas stations. Opponents of increasing ethanol use say it would increase food prices, because farmers are working to produce crops for gas tanks instead of grocery stores. \"There are several ways the effects of the Renewable Fuel Standard on a national market could affect Missouri in terms of the corn prices that farmers get, the prices for corn or the distillers grains that farmers or feed lots might pay,\" Wyatt Thompson, MU Professor at Food and Agricultural Policy Institute (FAPRI), said. Thompson says increasing ethanol use could affect the price of food, but it would be small. <mark>Murphy</mark> adds that the corn used to make ethanol is not a sweet corn that you would buy at the grocery store. It's corn used for animal feed, which the plant sells back to farmers. \"Beef poultry pork prices can be affected but the acres planted have caught up with the demand the ethanol industry has put in,\" <mark>Murphy</mark> said. AAA also released a statement warning buyers: \"AAA's automotive engineering experts believe that sustained use of E15 could result in costly problems such as accelerated engine wear and failure, fuel-system damage and false\" check engine \"lights in some cars. An overwhelming 95 percent of consumers surveyed by AAA were not familiar with E15, indicating a strong likelihood of consumer confusion leading to misfueling .\" Filling up with E15 also causes your car to get worse gas mileage. The Environmental Protection Agency approved the use of E15 for all cars newer than 2001. Thompson says it's unclear whether the economy can meet the demands E15 might bring. \"Given what was going on in the markets it seems like the mandates were running against the blend wall and it was becoming harder to mandate,\" Thompson said. The blend wall is the limit on the amount of ethanol that can be used beyond E10. Thompson's research on this issue is ongoing. \"The EPA gave a signal that it might reduce the mandates, which it has the authority to do in 2014, so there's been a lot of debate about what sorts of levels might be appropriate,\" Thompson said. The Missouri Department of Agriculture recently proposed a rule change to add an E15 fuel, a blend of 15% ethanol in gasoline. Lawmakers decided in an October hearing they would have to go through the legislative process to approve the rule change.", "articleID": "2013111109_00000895_W", "names": {"Steve Murphy": ["Q18600435", "Q21090563", "Q26816955", "Q3499030", "Q7613439", "Q7613440"]}}, {"date": "2013-11-14", "url": "http://www.sys-con.com/node/2873444", "content": "CareView Communications, Inc. (\"CareView\" or the \"Company\" ) (OTCQB: CRVW), an information technology provider to the healthcare industry, announced today the success of its products and services in reducing patient falls, reducing sitter costs and increasing patient satisfaction at hospitals owned and operated by IASIS Healthcare, a leading owner and operator of acute care hospitals in high-growth urban and suburban markets (\"IASIS\" ). CareView and IASIS will host a free Webinar on Tuesday, November 19, 2013 at 2:00 pm CST to present relevant product information and details of the implementation of CareView's services which yielded the positive results. https: //careview.webex.com/careview/onstage/g.php? t=a & d=662451196. For those unable to attend the Webinar, an on-demand recording will be available at the Company's website: www.care-view.com. The Webinar will be hosted by Tedd Adair, IASIS' Chief Clinical Officer, Brennan Howes, CareView's VP Business Development, and <mark>Matt Clark</mark>, CareView's VP Software Development. <mark>Matt Clark</mark> stated, \"CareView's Fall Management Program uses advanced, patented video analytics to detect potential falls through our Virtual Bed Rails? and Virtual Chair Rails? modules. These fall management tools have consistently proven to reduce patient falls and have provided nurses with invaluable time to reach patients before an injury occurs. Additionally, our SitterView? module, our GuestView? patient entertainment and satisfaction module, our BedView? bed control module, and our handheld communication tools can assist hospitals in controlling the climbing costs of providing quality healthcare .\" ? Which problems IASIS was trying to solve and why they chose to partner with CareView;? How IASIS handled patient consent and educated patients on the benefits of CareView's products; and? Lessons learned by IASIS during the implementation of CareView's products. Sandra McRee, CareView's Chief Operating Officer, formerly of IASIS where she served as Vice Chair of its Board of Directors, Chief Operating Officer and President, stated: \"After having worked in the healthcare industry for 35 years, CareView is the only company that I have found that improves patient safety and patient satisfaction while reducing cost as evidenced by the results of IASIS Healthcare .\" About CareView Communications, Inc.. CareView's mission is to be the leading provider of products and on-demand application services for the healthcare industry by specializing in bedside video monitoring, archiving and patient care documentation systems and patient entertainment services. Through the use of telecommunications technology and the Internet, our products and on-demand services will greatly increase the access to quality medical care and education for both consumers and healthcare professionals. We offer the next generation of patient care through our unique data and patient monitoring system that connects patients, families and healthcare professionals (the \"CareView System?\" ). Our proprietary, high-speed data network system may be deployed throughout a healthcare facility to provide the facility with recurring revenue and infrastructure for future applications. Real-time bedside and point-of-care video monitoring and recording improve efficiency while limiting liability, and entertainment packages and patient education enhance the patient's quality of stay. Through continued investment in patient care technology, we are helping hospitals and assisted living facilities build a safe, high quality healthcare delivery system that best serves the patient, while striving for the highest level of patient satisfaction and comfort. CareView is dedicated to working with all types of hospitals, nursing homes, adult living centers and selected outpatient care facilities domestically and internationally. Corporate offices are located at 405 State Highway 121 Bypass, Suite B-240, Lewisville, TX 75067. More information about the Company is available on the Company's website at www.care-view.com. About IASIS HealthCare IASIS, located in Franklin, Tennessee, is a leading owner and operator of medium-sized acute care hospitals in high-growth urban and suburban markets. The Company operates its hospitals with a strong community focus by offering and developing healthcare services targeted to the needs of the markets it serves, promoting strong relationships with physicians and working with local managed care plans. IASIS owns or leases 18 acute care hospital facilities and one behavioral health hospital facility with a total of 4,362 licensed beds and has total annual net revenue of approximately $2.8 billion. These hospital facilities are located in seven regions: Salt Lake City, Utah; Phoenix, Arizona; Tampa-St. Petersburg, Florida; five cities in Texas, including Houston and San Antonio; Las Vegas, Nevada; West Monroe, Louisiana; and Woodland Park, Colorado. IASIS also owns and operates a Medicaid and Medicare managed health plan in Phoenix that serves more than 197,000 members. More information about IASIS is available on its website at www.iasishealthcare.com. Questions about this release may be directed to Sandra McRee, CareView's Chief Operating Officer, at (972)? 943-6050. This press release shall not constitute an offer to sell or a solicitation of an offer to buy securities of CareView Communications, Inc.. Certain statements in this release and other written or oral statements made by or on behalf of the Company are \"forward-looking statements\" within the meaning of the federal securities laws. Statements regarding future events and developments and our future performance, as well as management's expectations, beliefs, plans, estimates or projections relating to the future are forward-looking statements within the meaning of these laws. The forward-looking statements are subject to a number of risks and uncertainties including market acceptance of the Company's services and projects and the Company's continued access to capital and other risks and uncertainties. The actual results the Company achieves may differ materially from any forward-looking statements due to such risks and uncertainties. These statements are based on our current expectations and speak only as of the date of such statements. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of future events, new information or otherwise. Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. More Stories By Business Wire Copyright? 2009 Business Wire. All rights reserved. Republication or redistribution of Business Wire content is expressly prohibited without the prior written consent of Business Wire. Business Wire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. New Release of Quest Toad for Oracle Offers Enhancements to Reduce Risk yourfanat wrote: I am using another tool for Oracle developers - dbForge Studio for Oracle. This IDE has lots of usefull features, among them: oracle designer, code competion and formatter, query builder, debugger, profiler, erxport/import, reports and many others. The latest version supports Oracle 12C. More information Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to New York and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in November at Cloud Expo New York. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Expo on June 10-12, 2014 - is to ensure - through an intensive three-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Javits Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in New York June 10-12, and maximize those benefits already in 2014. See you in New York! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in New York Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. .", "articleID": "2013111421_00057505_W", "names": {"Carmen Gonzalez": ["Q5043478", "Q9697469"], "Matt Clark": ["Q1768022", "Q22277379", "Q3180807", "Q6788489", "Q6788491"]}}, {"date": "2013-11-15", "url": "http://www.lex18.com/news/china-to-ease-one-child-policy-abolish-labor-camps/", "content": "0.0 (0 votes) BEIJING (AP) - China will loosen family planning rules that limit many couples to a single child in the first substantial change to the unpopular policy in nearly three decades, as leaders seek to address a rapidly aging population. The ruling Communist Party also said late Friday the country's much-criticized labor camp system would be abolished. The changes were part of a key policy document following a four-day meeting of party leaders through Tuesday. The party said families in which at least one parent was an only child would be allowed to have a second child themselves. Previously, both parents had to be an only child to qualify for this exemption. Rural couples are allowed two children if their first-born child is a girl, an exemption made in 1984 that was the last substantive change to the policy. Demographers argue that the population policy has created an aging crisis by limiting the size of the young labor pool that must support the large baby boom generation as it retires. \"It's great, finally the Chinese government is officially acknowledging the demographic challenges it is facing,\" said <mark>Cai Yong</mark>, an assistant professor of sociology at the University of North Carolina, Chapel Hill. \"Although this is, relatively speaking, a small step, I think it's a positive step in the right direction and hope that this will be a transition to a more relaxed policy and eventual return of reproductive freedom to the Chinese people,\" <mark>Cai</mark> said. The Chinese government credits the one-child policy introduced in 1980 with preventing hundreds of millions of births and helping lift countless families out of poverty. But the strict limits have led to forced abortions and sterilizations by local officials, even though such measures are illegal. Couples who flout the rules face hefty fines, seizure of their property and loss of their jobs. Last year, a government think tank urged China's leaders to start phasing out the policy and allow two children for every family by 2015, saying the country had paid a \"huge political and social cost .\" The China Development Research Foundation said the policy had resulted in social conflict, high administrative costs and led indirectly to a long-term gender imbalance because of illegal abortions of female fetuses and the infanticide of baby girls by parents who cling to a traditional preference for a son. The policy document does not specify when the family-size change takes effect, but details are expected when government offices roll out implementation plans later. The policy document released Friday maps out China's economic policy for coming decade, but also includes directives on improving the judicial system, helping farmers become city residents, maintaining controls on online expression and other issues. It also elaborates on the party's previous announcement that it would set up a national security commission. The party announced at the same time that it would abolish a labor camp system that allowed police to lock up government critics and other defendants for up to four years without trial. It confirmed a development that had been reportedly announced by the country's top law enforcement official earlier this year but was later retracted. Also known as \"re-education through labor,\" the system was established to punish early critics of the Communist Party but has been used by local officials to deal with people challenging their authority on issues including land rights and corruption. Pu Zhiqiang, a prominent Beijing lawyer who has represented several former labor camp detainees in seeking compensation, welcomed the abolition of the extra-legal system. \"There have been many methods used recently by this government that are against the rule of law, and do not respect human rights, or freedom of speech,\" Pu said. \"But by abolishing the labor camps...it makes it much harder for the police to put these people they clamp down on into labor camps .\" \"This is progress,\" Pu said. Earlier this year, state broadcaster CCTV said China has 310 labor camps holding about 310,000 prisoners and employing 100,000 staff.", "articleID": "2013111523_00008046_W", "names": {"Cai Yong": ["Q45545953", "Q45575032", "Q45699895", "Q45725682"]}}]