[{"articleID": "2013082622_00022382_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2013-08-26", "url": "http://money.cnn.com/2013/08/26/news/companies/trump-university/index.html?section=money_mostpopular", "content": "@ Jose_Pagliery August 26, 2013: 9:56 AM ET NEW YORK (CNNMoney) <mark>Donald Trump</mark>'s real estate school is under attack by New York's top prosecutor, and both sides took to the airwaves Monday to elaborate on the upcoming legal battle. New Day, \"New York State Attorney General Eric Schneiderman called the school a\" bait-and-switch scheme, \"and <mark>Trump</mark> accused the prosecutor of actions akin to extortion. Still, <mark>Trump</mark> dismissed the importance of the matter.\" He's a lightweight, \"<mark>Trump</mark> said of the state's attorney general. It's the aftermath of a $40 million civil lawsuit Schneiderman filed against <mark>Trump</mark> on Saturday, accusing <mark>Trump</mark> of defrauding students who attended the billionaire's for-profit school. Related: N.Y. attorney general suing <mark>Trump</mark>'s school for fraud The lawsuit claims <mark>Trump</mark> used his celebrity status to lure students into a school that over-promised and under-delivered. A free seminar urged prospective students to pay $1,495 for a three-day workshop. That, in turn, was used to sell a $34,995 course. In the school's commercials, <mark>Trump</mark> tells viewers,\" We're going to teach you better than the business schools are going to teach you. \"\"At <mark>Trump</mark> University, we teach success. That's what it's all about: success. It's going to happen to you,\" he says, as triumphant horns blast in the background. Schneiderman said Monday that the lawsuit completes one branch of a long-running investigation into for-profit schools. He said it was prompted by dozens of complaints from former students who contacted his office and the Better Business Bureau, a nationwide nonprofit organization. The attorney general said teachers never got certified. He noted <mark>Trump</mark> University isn't even a university, which is defined as a collection of colleges. And although students were promised an in-person meeting with <mark>Trump</mark>, \"all they got was the chance to stand next to a life-sized poster,\" Schneiderman said. \"We discovered that it was a classic bait-and-switch scheme. It was a scam,\" he said. Schneiderman said his lawsuit partly relies on the sworn testimony of <mark>Trump</mark> University's former president, who explained that <mark>Trump</mark> maintained a close eye on the school and read all of its promotional material. Schneiderman also said he got hold of the school's \"playbook,\" which insisted that instructors keep pitching the upgraded, more expensive programs. \"This is a pretty straight-forward case. The documents pretty much entitle us to a judgment,\" Scheiderman said. When <mark>Trump</mark> appeared on \"New Day\" by phone later in the morning, he defended his program by noting the school had received stellar evaluations by students. \"We didn't think we were going to get sued because we have a 98% approval rating,\" <mark>Trump</mark> said. \"If you go to Wharton or Harvard, they didn't have a 98% approval rating. People loved the school. The school was terrific.\" Related: Morgan Stanley escapes federal dragnet <mark>Trump</mark> then turned his attention to the prosecutor, saying that Schneiderman approached <mark>Trump</mark> for political donations--and when <mark>Trump</mark> refused, Scheiderman followed with a lawsuit as revenge. \"They solicited us during the investigation for campaign contributions,\" <mark>Trump</mark> said. In anticipation to those accusations, Scheiderman had said, \"Prosecutors are all used to people who commit fraud making wild accusations when they're caught.\" But <mark>Trump</mark> cast the legal challenge as a power battle between an overreaching government and a private powerhouse--himself. \"I could have settled this case very easily. They wanted to settle. I chose not to,\" <mark>Trump</mark> said. \"We have a lot of happy students. They'll be testifying.\" Market indexes are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer LIBOR Warning: Neither BBA Enterprises Limited, nor the BBA LIBOR Contributor Banks, nor Reuters, can be held liable for any irregularity or inaccuracy of BBA LIBOR. Disclaimer. Morningstar:? 2013 Morningstar, Inc.. All Rights Reserved. Disclaimer The Dow Jones Indexes SM are proprietary to and distributed by Dow Jones & Company, Inc. and have been licensed for use. All content of the Dow Jones Indexes SM? 2013 is proprietary to Dow Jones & Company, Inc.. Chicago Mercantile Association. The market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. FactSet Research Systems Inc. 2013. All rights reserved. Most stock quote data provided by BATS."}, {"articleID": "2013042408_00019390_W", "names": {"Victor Ortiz": ["Q423205", "Q7944702"], "Jacoby Jones": ["Q16730404", "Q3805829"]}, "date": "2013-04-23", "url": "http://feeds.nbcnews.com/c/35002/f/653378/s/2b1770d9/l/0Ltheclicker0Btoday0N0C0Inews0C20A130C0A40C230C17885270A0Evictor0Eortiz0Eknocked0Eout0Eof0Edancing0Ewith0Ethe0Estars0Dlite/story01.htm", "content": "recommended: usher's shocking steal isn't all that shocking on \"the voice' recommended:\" teen mom 2' star jenelle evans tweets about sobriety before arrest for heroin possession recommended: \"the bible' series may head to theaters as a feature film time pubdate datetime =\" 2013-04-23t23:43:02 -04:00 \"> <mark>victor ortiz</mark> knocked out of\" dancing with the stars' the fight is finally over for <mark>victor ortiz</mark> on \"dancing with the stars.\" after floundering for weeks at the bottom of the scoreboard, the welterweight champion and his partner, lindsay arnold, were ko'd tuesday night. abc the bad news did nothing to tarnish the boxer's gleaming grin. \"i'm happy to get this far,\" he told hosts tom bergeron and brooke burke-charvet, admitting with a rueful laugh: \"i definitely need some dance moves!\" , both of whom were in jeopardy of going home. but once again, the spared for another week, will sean follow judge len goodman's advice and \"set (his) sights higher\" than just trying to beat andy? follow @ today_ent and do any of the guys stand a chance of beating aly raisman? the trio of dancing queens were of course declared safe again, followed by ingo rademacher and <mark>jacoby jones</mark>. both men reteamed with zendaya and <mark>victor</mark> for another performance of their group paso doble routine to stevie wonder's \"higher ground.\" (the fans, who voted for the encore, obviously appreciated the guys' toned torsos more than the judges, who gave the win monday night to team samba .) also appearing on the results show were olly murs, who sang \"troublemaker,\" and will.i.am, performing his new single \"#thatpower.\" leading man honors, however, go to ingo's adorable son peanut. the 4-year-old was caught on camera after monday night's show yelling, \"see you at the after-party\" like a seasoned hollywood star."}, {"articleID": "2008112418_00037384_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"], "Chris Anderson": ["Q19609580", "Q2536856", "Q29051924", "Q30121842", "Q40360340", "Q4065282", "Q5105727", "Q5105729", "Q5105730", "Q706222", "Q943061"]}, "date": "2008-11-24", "url": "http://mediabistro.com/tvnewser/fnc/beck_tops_nyt_best_seller_list_101629.asp?c=rss", "content": "<mark>glenn beck</mark>'s new book, \"the christmas sweater,\" debuted at #1 on the new york times best sellers list. at this time that <mark>beck</mark>'s \"an inconvenient book\" was reaching #1 as well. this book, however, falls under the bill o'reilly's \"a bold fresh piece of humanity\" fell from #3 to #6 this week after six weeks and heavily-promoted, \"call me ted,\" debuted at #7. \"the christmas sweater\" was also #1 on the publisher's weekly list. new on mediabistro.com the future of social media with <mark>chris anderson</mark> the editor of wired explains how to create a social network that works. fill out the following information and click on the send button in order to send this post, tvnewser tvnewser staff editor:"}, {"articleID": "2009112701_00130717_W", "names": {"Alan Mccormack": ["Q19942371", "Q2206865"]}, "date": "2009-11-27", "url": "http://parkeschampionpost.com.au/news/local/news/general/difficult-years-lie-ahead/1689963.aspx?src=rss", "content": "details of the latest audit of parkes shire council's financial report has confirmed that difficult decisions will have to be made by council in relation to funding priorities throughout the shire now and in the future. council in 2009/10 has committed to borrowings for the first time since 1998 and its current management plan indicates deficit budgets until 2012/13. council's audit partner john o'malley of the morse group addressed councillors at the most recent council meeting where he gave an overview of the results of the financial year ended 30 june, 2009. he confirmed that council - like their counterparts throughout the state - are facing a number of challenges brought about by the global financial crisis. at the same time he said the auditors had qualified council's 2009 accounts on the basis that they were unable to obtain sufficient audit evidence to satisfy them that the valuation of the $7,081,000 structured securities held by council at balance date as being of \"fair value .' this type of qualification has been given to a number of council's within nsw that hold securities that are similar to those held by parkes shire council. it was noted that this qualification was also applied to the 2008 financial reports and did not indicate council had not taken\" all necessary steps to ensure that the valuation of the investment securities had been undertaken in accordance with the requirements of the relevant accounting standards .' mr o'malley stated the overall result for the year had been substantially affected by the impact of fair value changes upon council's structured investments. a write-down of $5,339,000 in investment fair values for the financial year had a major impact on council's operating loss before capital items of $715,000. the decline in investments has also had a significant impact on council's reserves. current reserves stand at $5,446,000, the lowest since 2000/2001 ($5,045,000). les finn (council's director of corporate services) said this aspect had major implications for council's forward planning. \"especially given the assessed level of impairment that exists in respect of some council investments,\" mr finn said. \"whilst the valuations of council's investments have improved early in the current financial year the ultimate goal is to achieve a full return of the principal invested at maturity.\" \"with major infrastructure challenges facing council over the next few years and the acknowledgement that deficit budgets cannot be sustained in the medium to long term, sound financial decisions will need to be made if council is to continue to maintain services at the current level,\" mr finn said. \"the enormity of this challenge should not be underestimated and is an issue that is not unique to parkes shire council and confronted by council's australia wide.\" \"outstanding\" rates increase other highlights of the audit included an increase in the percentage of outstanding rates and annual charges for 2008/09 from 7.03 per cent to 7.34 per cent. this was regarded as a good result giving the staffing changes that had occurred in the rating and revenue section together with the difficult economic conditions that had prevailed over the course of the year. mr finn said council was considering a sale of land for unpaid rates in the next 12 months which should improve the ratio. increased assets council's net assets increased by $10,929,000 over the course of the year. this included a net operating result for the year of $4,561,000 and an asset revaluation reserve movement of $6,368,000. \"the movement of the asset revaluation was attributable to the revaluation of council's water and sewerage assets in accordance with the office of water indexation,\" mr finn reported. cash-flow decrease total cash and cash equivalents decreased by $10,705,000 over the course of the year. mr finn reported the reduction in cash was the result of council investing in short-term securities with a maturity of greater than 90 days. however, cashflow from operations was strong, generating $12,753,000 over the year. \"these funds were used to purchase or construct $12,103,000 in infrastructure assets and property, plant and equipment,\" he said. \"infrastructure assets expenditure was increased over past years due to the construction of the tullamore sewerage scheme, with $1.7 m spent on the scheme over the course of the year.\" - - - - - - mayor of parkes cr ken keith extended thanks on behalf of council to mr o'malley and his audit team for their assistance and patience over the course of the audit. \"the complexity of council's financial reports has grown substantially over recent years and this has added an additional burden to both council and audit staff,\" cr keith said. he particularly congratulated general manager <mark>alan mccormack</mark>, les finn, peter mcfarlane (finance manager) and staff for their efforts. \"everyone involved put in a great effort - burning candles at both ends in getting"}, {"articleID": "2016080621_00026974_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "James Harrison": ["Q1379040", "Q2086893", "Q28421741", "Q37379040", "Q57911076", "Q6135633"], "Richard Sherman": ["Q16205086", "Q2947411"], "Al Davis": ["Q1389376", "Q16151684"], "Ray Rice": ["Q1523516", "Q23823439"], "Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Andy Reid": ["Q2622812", "Q27830815", "Q470738", "Q4761219"], "Brandon Marshall": ["Q3643713", "Q898156"], "Donald Trump": ["Q22686", "Q27947481"], "Jason Taylor": ["Q16213806", "Q1684006", "Q24738395", "Q2786087", "Q6163606", "Q6163608"]}, "date": "2016-08-06", "url": "http://www.nydailynews.com/sports/football/roger-goodell-1st-10-years-marked-growth-controversy-article-1.2741061", "content": "Happy Anniversary Roger Goodell, just don't expect to be receiving chocolate covered strawberries from <mark>Tom Brady</mark>, DeMaurice Smith, <mark>James Harrison</mark>, Bill Belichick, Drew Brees, <mark>Richard Sherman</mark>, Sean Payton and...get in line. Monday marks the 10-year anniversary of Goodell being promoted from chief executive officer of the NFL in the Paul Tagliabue administration to the most powerful job in sports. The NFL is the only place Goodell has been employed since graduating college in the early \"80s and he worked his way up from his first job as an intern in the public relations department to the commissioner's office 24 years later. Roger Goodell (<mark>Al</mark> Messerschmidt/Al Messerschmidt/WireImage. com) The seven-year contract extension he signed in January of 2012 expires in March of 2019. He has not yet addressed if he will seek or be receptive to another extension--he is 57 years old--and there is no talk of any owners wanting to push him out. But if Goodell decides walk away in less than three years, there is little doubt the next commissioner will be a businessman who will focus on continuing to grow the league financially in the digital era and be less concerned than Goodell has been with the football part of the job. In 10 years, here's what we've learned about Goodell: - The owners love him because he has made some of the wealthiest people in the country even wealthier. The league now brings in about $13 billion a year in revenue. When Goodell officially took office on Sept. 1, 2006, the NFL was pulling in $6 billion a year. His goal is to reach $25 billion by 2027. All the extra loot has allowed Goodell to survive crucial mistakes: Not suspending Belichick in Spygate, Tagliabue reversing most of the severe player punishment Goodell handed out in Bountygate, the <mark>Ray Rice</mark> nightmare, the over-the-top discipline of <mark>Brady</mark>, and the concussion crisis, which he inherited but didn't act quickly enough by putting in measures to educate and protect players. - If the players were polled, they probably would not want to invite Goodell to their birthday party. But also look at it this way: If so many players weren't knuckleheads and always testing NFL rules and the legal system, Goodell would be far less controversial. He comes off as the bad guy, and often seems to embrace the role, but too many players take it for granted that their talent makes them immune to punishment. It's the union's fault for allowing Goodell to keep the role as appeals officer for his own disciplinary decisions. Smith caved in during the 2011 CBA negotiations. It's been the commissioner's job since the first CBA in 1968. - Goodell often talks about how much he cares about the fans and I think that's genuine. But the fans are not buying it and giving him back the love. His appearances at the draft have become embarrassing. In the last few years at Radio City and the two years in Chicago, he was heavily booed each time he walked on stage to announce a pick. Imagine what the reception is going to be like in Philadelphia next year--the likely site of the draft. It's not exactly a city known for its warmth. Goodell was elected commissioner at a special league meeting at a hotel in Northbrook, Ill.. It took Pete Rozelle 23 ballots to get elected in 1960 and Tagliabue 12 ballots in 1989. It took Goodell five ballots to get the two-thirds vote--22 out of 32--when he picked up 23 on the fifth try. The other finalist was NFL outside counsel Gregg Levy. On the first ballot it was Goodell 15, Levy 13 with three other finalists combining for three votes. Oakland's <mark>Al Davis</mark> abstained on every ballot until Tagliabue asked the owners to make it unanimous once Goodell had the required votes. QB WORRIES IN BIG D The best thing the Giants have going for them in the NFC East race is that <mark>Jerry Jones</mark> insists on being the general manager of the Cowboys when he should concentrate on doing what he does best--making money. He has a fragile starting quarterback and was trying to get by with the little lefty Kellen Moore as the backup? Now look at the mess the\" Boys are in. Tony Romo missed seven starts after breaking his left collarbone last year in Week 2 and Dallas was 0-7. He returned and broke it again in his second game back and missed the final five games. Dallas was 1-4. Romo was 3-1 in the Cowboys' 4-12 season. They were 1-11 without him. He is 36 years old and has broken his left collarbone three times in the last six seasons. The first time was against the Giants in 2010. Matt Cassel was 10-5 in games he started for the Patriots replacing <mark>Brady</mark> in 2008, was only 1-6 starting for the Cowboys. He is now with the Titans. A savvy general manager who also didn't own the team might have felt obligated to get veteran protection behind Romo to avoid the season being a waste if he goes down early again. Instead, <mark>Jones</mark> was trying to get by with Moore. He was 0-2 starting the last two games last season after coming in early in the second quarter of a loss to the Jets and tossing three interceptions. Moore broke his right fibula in practice last week and is out 3-4 months. <mark>Jones</mark> drafted Zak Prescott in the third round but now he's scrambling for a veteran backup. When the Rams released Nick Foles on July 27, <mark>Jones</mark> was adamant the Cowboys had no interest. They wanted Foles after Moore was injured, but he elected to sign with the Chiefs. The Cowboys' earlier comments could not have won them again points with Foles when he was deciding where to sign. Chiefs coach <mark>Andy Reid</mark> drafted Foles in Philadelphia in 2012 although he had his great season (27 TDs, 2 INTs) playing for Chip Kelly in 2013. Where does <mark>Jones</mark> go now to get a backup? Cleveland coach Hue Jackson says there's nothing to rumors about trading Josh McCown, who is 38 years old and losing the battle for the starting job to RG3. Michael Vick is a free agent. There's been speculation about Tampa making Mike Glennon available ever since they drafted Jameis Winston first overall last year. Don't forget Tim Tebow is still available. If Romo gets hurt this summer, the only QBs currently on the roster to start the season opener Sept. 11 against the Giants are Prescott and Jameill Showers. ON <mark>BRADY</mark> <mark>Brady</mark>, who turned 39 last week, is still pretty good. He was 25-for-25 in an intrasquad scrimmage on Friday. He said it was a \"personal decision\" to surrender in the Deflategate fight and accept the four-game suspension. <mark>Brady</mark> doesn't like giving up first-team snaps in practice, so having to watch Jimmy Garoppolo do his job for the first month of the season is going to be unbearable. \"I'll deal with it when it comes,\" he said. <mark>Brady</mark> never plays all that much in the preseason games, but it will be interesting to see if Belichick starts Garoppolo to get him accustomed to playing with the first unit right from the beginning of the game or whether he plays <mark>Brady</mark> one series with the starters. Belichick can't afford the injury risk of allowing <mark>Brady</mark> to play with the second string offensive line. The Patriots open the preseason Thursday night at home against the Saints after practicing against them Tuesday and Wednesday in Foxborough. When Belichick was asked Wednesday if he had anything special planned that day for <mark>Brady</mark>'s birthday, his answer displayed his warmth. \"Practicing,\" he said. BOILING <mark>BRANDON</mark> <mark>Brandon Marshall</mark> sure had an interesting week in training camp, punting a football over the bleachers in frustration and then getting into a fight with Darrelle Revis. Between them, Revis ($17 million) and <mark>Marshall</mark> ($9.5 million) are making $26.5 million and they're the Jets' two best players. So that was a foolish scuffle. It's a good thing the only thing they hurt was each other's feelings. DEBATE DEBACLE <mark>Donald Trump</mark> is concerned about two of his debates with Hillary Clinton going up against NFL prime time games. And he should be. The first debate is Monday, Sept. 26, which is Atlanta at New Orleans, 10 years and one day after the Saints' first game back in the Superdome following the devastation of Hurricane Katrina. It was highlighted by Steve Gleason's blocked punt recovered for a TD by the Saints. Gleason, who suffers from ALS, is the subject of a compelling documentary out in theaters now. The second debate is Sunday, Oct. 9, and it goes up against the Giants at Green Bay. The rating of the debates vs. the football games? Never bet against the power of the NFL...The top first-time eligible players for the Pro Football Hall of Fame in 2017 are LaDainian Tonlinson, who played his final two years with the Jets (2010-11), and <mark>Jason Taylor</mark>, who played one year with the Jets (2010) before returning to Miami for one final season. If they both get in to join Brett Favre, it will make three players with Jets connections in the HOF in a two-year span. Send a Letter to the Editor Join the Conversation: facebook Tweet"}, {"articleID": "2019102222_00113778_W", "names": {"Tony Caldwell": ["Q4873687", "Q7822011"]}, "date": "2019-10-22", "url": "https://ottawacitizen.com/news/local-news/barrhaven-youngsters-quick-actions-help-save-mans-life", "content": "Share Adjust Comment Print Juliet Murphy and Darcy Power are best friends, born on the same day, in the same hospital, 11 and a half years ago. They play hockey against one another, and finish each other's sentences. So they were perhaps the perfect duo to spring into action on Saturday afternoon when, pedalling to Juliet's Barrhaven home from a playdate in nearby Furness Park, the two discovered a man in his 60s sprawled on the ground, on his back, in cardiac arrest. The man may owe his life to the two girls. \"He was like this,\" said Darcy, re-enacting the scene, her legs on the sidewalk, her torso on Lydia Way, on the north side of the park. \"And his phone was here,\" added Juliet a Grade 6 student at Jean-Robert Gauthier Catholic school, pointing to a spot on the road near Darcy's outstretched right arm. \"It looked like he was calling someone.\" The man's chest, they noted, was not moving. \"He wasn't breathing,\" recalled Darcy, in Grade 6 at St. John XXIII Catholic school. They recounted, too, how a number of cars approached, slowed, and continued on without stopping. They were frightened, but knew what to do. Darcy, who lives in the Craig Henry neighbourhood and whose father is an Ottawa firefighter, stayed with the man while Juliet went to a friend's house for help. No one was home. Juliet called out to Darcy to go to another house, while she returned to the man's side. Darcy rang a door bell, to no avail. The girls then noticed two men working on a car and approached them for help. One of the men called 911. The other ran over to the fallen man, and told the girls to go get their parents. They then went to the corner of Amarillo and Crestway drives, to direct police, paramedic and fire responders to the scene. Juliet Murphy (right) and Darcy Power pose for a photo at Furness Park in Ottawa Tuesday Oct 22, 2019. Juliet and Darcy found a 60-year-old man who'd suffered a cardiac arrest at Amarillo Drive and Lydia Way, in Barrhaven Saturday and got help. <mark>Tony Caldwell</mark> / Postmedia From their vantage point a block away, the girls couldn't see paramedics use a defibrillator on the man, and didn't learn for a couple of days that he arrived at the hospital unconscious and in critical condition, but alive. It wasn't until Ottawa Paramedic Service put out a news release on Monday, looking to identify the Good Samaritans, that they learned of the man's immediate fate. Juliet cried--tears of joy and relief. Darcy sprang from the dinner table and performed three jumping jacks and one squat. \"It feels really good to help somebody, but if you don't know if they're OK, you start to get scared,\" said Juliet. \"Did I really help this person or did I make it worse?\" \"Did I take too long?\" added Darcy. \"Did I do something wrong?\" But back at the park on Tuesday, the pair were greeted by at least one neighbour who came out to thank them. \"Thanks for what you did,\" he said. People are calling them heroes. \"That means you're helping people in need,\" explained Darcy. \"You're not just helping people to get a reward or something.\" \"Because no matter the cost,\" interjected Juliet, \"you need to help somebody. Because if you don't, it kind of stings.\" \"Nice,\" she added \"always beats self-centered.\" \"We made a good choice,\" said Darcy. \"We were so happy...\"(Juliet)\" ...that we saved a life. (Darcy) \"He could have been gone, just like that.\" I was just scared at the beginning...but getting scared won't help the guy. Things won't go out of control if you just stay calm. \"\"What these two ladies did was really amazing,\" said Marc-Antoine Deschamps of the Ottawa Paramedic Service. \"They took charge. They didn't just walk by and ignore a man in distress.\" The pair credited their parents for teaching them what to do in such emergencies. \"You always learn by your parents because they always talk about it,\" said Juliet. \"Sometimes you don't listen, but the good things always stick in your head.\" "}, {"articleID": "2013110608_00064755_W", "names": {"Anthony Bennett": ["Q23461646", "Q4772100", "Q4772101", "Q4772102", "Q572881"], "Mike Scott": ["Q16216757", "Q1849355", "Q3313545", "Q582252", "Q6848743", "Q6848747", "Q6848748", "Q6848749"], "Reggie Evans": ["Q2561832", "Q7308228"]}, "date": "2013-11-05", "url": "http://bleacherreport.com/articles/1838845-breaking-down-what-to-expect-from-the-new-version-of-andrew-bynum", "content": "Breaking Down What to Expect from the New Version of Andrew Bynum Oh the irony of Andrew Bynum sitting above a health insurance advertisement. It's time to start forming new expectations for Andrew Bynum. Even after he made his Cleveland Cavaliers debut against the Brooklyn Nets, there was optimism in the air. Boyer wrote, \"The goal/hope always was that Bynum could return to his All-Star form, and if he stays healthy and does that, the Seeing Bynum make an All-Star team is nothing more than a pipe dream now, even if he's looked solid through his first three appearances. On the heels of some sobering news, it seems as though Cleveland will be lucky to get a consistent starting center out of his seven-foot frame: Andrew Bynum tells reporters he's not sure his explosiveness will return and that he'll have to rely more on footwork and skill Boyer also reports the following:\" Preparing to play his third game of the season, Bynum acknowledged that he had experienced \"little, sharp pains .'\" Uh-oh. Bynum has always been a big, physical and skilled center when healthy, but that's no longer true. He may be kind of healthy, but the physicality and athleticism that helped make him special aren't all going to be there any more. Even Bynum himself is admitting it. In the wake of that news, what can we expect from the 7-footer? First of all, don't expect Bynum to play much at any point during the 2013-14 campaign. There are too many factors preventing him from racking up major minutes in his return from a year off. The big man literally sat out an entire season, failing to play even a single second while he was a member of the Philadelphia 76ers. Setback after setback prevented him from stepping onto the court and dashed his hopes of playing like a single pin left standing could shatter dreams of bowling a 300. Because of that, it's important to keep in the back of your mind that this season is already a success. No matter how little action he sees over the course of the year, playing limited minutes is still a positive development. During the first four Cavaliers games of the season, Bynum has recorded one DNP (in an 89-74 loss to the Indiana Pacers) and averaged 12.3 minutes per contest when he has been active. The minutes haven't followed a consistent trend, but the 19 he recorded against the Minnesota Timberwolves were as many as he played in the first two games combined. Nineteen should be viewed as a number approaching the upper threshold this year. Eventually, Bynum may start averaging right around 20 minutes per game, but it's tough to see him earning anything more. Not only is his health working against him, but so too is the rest of the Cleveland frontcourt. and Tristan Thompson both have to get major minutes, and <mark>Anthony Bennett</mark> and Tyler Zeller must get run as well, the former more so than the latter. NBA.com's statistical databases, Bynum is averaging 2.7 close touches per game, defined as touches that originate within 12 feet of the basket and don't come on drives to the hoop. Throughout the league, 60 players have recorded a higher number, including back-to-the-basket specialists (your sarcasm alarm should be blaring) like Jimmy Butler, Andrea Bargnani, Daniel Orton, <mark>Mike Scott</mark>, Biyombo and so many more. Even a non-dominant offensive player like Andre Drummond has recorded 6.7 close touches per game, still well shy of Derrick Favors' league-leading 9.0. That's not going to change. Without his explosiveness and relying solely on his footwork, Bynum isn't going to have the ability to work in the post very often. He can't afford to take the ball out of Kyrie Irving and Dion Waiters' hands for too long, after all. are running at the ninth-fastest pace in the league, averaging 97.3 possessions per 48 minutes. This is a team filled with young players who are built to run, and it's not going to function at a high level if the ball is consistently thrown into Bynum's area so that things can slow down. Cleveland has tried to force things to the big man, but that's not going to work for any sustained period of time. He's only shooting 5-of-18 from the field so far, and just two of those buckets have been created through post moves. Below you can see the release of all five made shots. opportunity that will go down as his first make for the Cavaliers. All screenshots taken from NBA.com's video databases. 4. A floating hook over the outstretched arms of Nikola 5. A spot-up jumper that didn't require him to put the ball on the floor. Of the five makes, only two saw the Cavaliers work to get him post touches, and that's going to be a consistent trend throughout the year. If you're expecting vintage back-to-the-basket Bynum, you'll have to put in tape from his days with the Los Angeles Lakers. Dominant Defense and Rebounding Numbers On defense and when crashing the boards, Bynum has been able to make an impact by using his sheer size. Take his first block of the season, a rejection against <mark>Reggie Evans</mark>: Throughout that play, he remains nearly stationary. While <mark>Evans</mark> rotates around him, he just stays put and deters the Nets from attacking the rim because they know they can't get around him. First, he fends off a driving guard. Then he slides slightly over so that he can get in the way of the power forward. That's all he has to do. On the boards, Bynum hasn't been effective as he was during his basketball prime, but he's still averaging 9.7 rebounds per 36 minutes. Don't expect that number to rise much higher, as it's not positioning that needs work. Competent role-player or low-level stater The big man is doing a good job boxing out offensive rebounders and positioning himself well for the times the ball caroms off the rim, but without the ability to elevate, and especially to elevate twice in quick succession, he isn't going to post elite numbers. Or even elite per-minute numbers. While this will change if Bynum regains his explosiveness and proves-without a shadow of a doubt-that he can play big minutes on a consistent basis, he's going to be a big body functioning as a limited role player. He isn't going to be the All-Star version of Andrew Bynum, but rather a 7-footer who can defend, rebound and give Cleveland occasional scoring bursts. What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? This comment and all replies have been deleted This comment has been deleted We'd like to send you the most entertaining"}, {"articleID": "2019101418_00059133_W", "names": {"Abhijit Banerjee": ["Q320578", "Q4667393"], "Abdul Latif": ["Q16018183", "Q16224641", "Q25471297", "Q59554526"]}, "date": "2019-10-14", "url": "http://articles.economictimes.indiatimes.com/news/politics-and-nation/nobel-laureates-abhijit-banerjee-and-esther-duflo-on-free-trade-and-growth-from-their-forthcoming-book-good-economics-for-hard-times/articleshow/71586879.cms", "content": "Nobel Laureates <mark>Abhijit Banerjee</mark> and Esther Duflo on free trade and growth from their forthcoming book - Good Economics for Hard Times By ET CONTRIBUTORS | Updated: Oct 14, 2019, 11.37 PM IST READ MORE ON \"poverty alleviation | poor nations | nobel prize | Good Economics for Hard Times | development economics | Abjijit <mark>Banerjee</mark> Esther Duflo becomes the second woman to win the Sveriges Riksbank Prize in Economic Sciences. By <mark>Abhijit</mark> V <mark>Banerjee</mark> & Esther Duflo Many of the issues plaguing the world right now are particularly salient in the rich North, whereas we have spent our life studying poor people in poor countries. It was obvious that we would have to immerse ourselves in many new literatures, and there was always a chance that we will miss something. It took us a while to convince ourselves that it was even worth trying. We eventually decided to take the plunge, partly because we got tired of watching at a distance while the public conversation about core economic issues--immigration, trade, growth, inequality or the environment--goes more and more off-kilter. But also because, as we thought about it, we realised that the problems facing the rich countries in the world were actually often eerily familiar to those used to studying the developing world--people left behind by development, ballooning inequality, lack of faith in government, fractured societies and polity, and so on. We learnt a lot in the process and it did give us faith in what we, as economists, have learnt best to do, which is to be hard headed about the facts, sceptical of slick answers and magic bullets, modest and honest about what we know and understand, and perhaps most importantly, willing to try ideas and solutions and be wrong, as long as it takes us towards the ultimate goal of building a more humane world. A woman hears from her doctor that she has only half a year to live. The doctor advises her to marry an economist and move to South Dakota. Woman:\" Will this cure my illness?' Doctor: \"No, but the half year will seem pretty long .' Why Whisky and Rum Don't Mix The idea that free trade is beneficial is one of the oldest propositions in modern economics. As the English stockbroker and MP David Ricardo, explained two centuries ago, since trade allows each country to specialise in what it does best, total income ought to go up everywhere when there is trade, and as a result, the gains to winners from trade must exceed the losses to losers. The last 200 years have given us a chance to refine this theory, but it is a rare economist who fails to be compelled by its essential logic. Indeed, it is so rooted in our culture that we sometimes forget that the case for free trade is by no means self-evident. For one, the general public certainly does not think so. They are not blind to the advantages of being able to buy cheap abroad, but worry that at least for the direct victims of cheaper imports, the gains are swamped by the costs. In our survey, 42% of respondents thought that low-skilled workers are hurt when the US trades with China (21% thought that they are helped), and only 30% thought that everyone is helped by the fall in prices (and 27% said that they thought everyone was hurt). So, is the public simply ignorant, or might it have intuited something the economists have missed? Stanislas Ulam was a Polish mathematician and physicist, one of the co-inventors of modern thermonuclear weapons. He had a low opinion of economics--perhaps because he underestimated economists' capacity to blow up the world, albeit in their own way. Ulam challenged Paul Samuelson, our late colleague, and one of the great names in 20th century economics, to\" name me one proposition in all of the social sciences which is both true and non-trivial \". Samuelson came back with the idea of comparative advantage, the central idea in trade theory.\" That this idea is logically true need not be argued before a mathematician; that it is not trivial is attested by the thousands of important and intelligent men who have never been able to grasp the doctrine for themselves or to believe it after it was explained to them. \"Comparative advantage is the idea that countries should do what they are relatively best at doing. To understand how powerful the concept is, it is useful to contrast it to absolute advantage. Absolute advantage is simple: grapes don't grow in Scotland, and France does not have the peaty soil ideal for making scotch. Therefore, it makes sense that France should export wine to Scotland, and Scotland should export whisky to France. Where it gets confusing is when one country, like China today, looks like it's pretty much better at producing everything than most other countries. Wouldn't China simply swamp all markets with its products, leaving other countries with nothing to show for themselves? Ricardo realised in 1817 that even if China (or, in his era, Portugal) was more productive at everything, it could not possibly sell everything, because then the buyer country would sell nothing and would have no money to buy anything from China. This proved that not all industries in 19th-century England would shrink. It was then evident that if any industry in England were to shrink because of international trade, it should be the ones that were the least productive. Based on this argument, Ricardo concluded that even if Portugal was more productive than England at producing both wine and cloth, once trade between them opened up, they would nonetheless end up specialising in the product in which they have a comparative advantage (meaning where their productivity is high relative to their productivity in other sector: wine for Portugal, cloth for England). And the fact that both countries make the goods that they are at least relatively good at making and buy the rest, instead of wasting resources producing the latter ineptly, must add to the gross national product (GNP), which is the total value of goods that people in each country can consume. Ricardo's insight underlines why there is no way to think of trade without thinking about all the markets together--China could win in any single market and yet, there is no way for it to win in every market. Of course, the fact that GNP goes up (both in England and in Portugal) does not mean that there are no losers. In fact, one of Paul Samuelson's most famous papers tells us exactly who they are. Ricardo's entire discussion had assumed that production required only labour, and all workers were identical, so when the economy became richer, everyone benefited. Once there is capital as well as labour, things are not that simple. But Samuelson, in a paper published in 1941, when he was just 25, set out the ideas that are still the basis of how we are taught to think about it. The logic, once you understand it--as is often the case with the best insights--is compellingly simple. Some goods require relatively more labour than others to produce and relatively less capital--think of handmade carpets versus robotmade cars. If two countries have access to the same technologies of production for both goods, it should be obvious that the country that is relatively abundant in labour will have a comparative advantage in producing the labour-intensive product, the carpet if you like. We would therefore expect a labour-rich country to specialise in labour-intensive products and move out of capital-intensive ones. This should raise the demand for labour compared to when there was no trade (or more restricted trade) and therefore wages. And, conversely, in a relatively capital-abundant country, we should expect instead that the price of capital goes up (and wages go down) when it trades with a more labour-abundant partner. Since the labour-abundant countries tend to be poor, and labourers are usually poorer than their employers, this implies that freeing trade should help the poor in the poorer countries, and inequality should fall there. The opposite would be true in the rich countries. So, opening trade between the US and China should hurt US workers' wages (and benefit Chinese workers). That does not mean that the workers in the US must necessarily end up worse off. This is because, as Samuelson showed in a later paper, the fact that free trade raises GNP means that there is more to go around for everybody, and therefore, even the workers in the United States can be made better off if society taxes the winners from free trade and distributes that money to the losers. The problem is that this is a big\" if', which leaves workers at the mercy of the political process. When Trees are Seen as Shady When a rickshaw-puller in <mark>Abhijit</mark>'s native Kolkata takes the afternoon off to spend with his lady love, GDP goes down, but how could welfare not be higher? When a tree gets cut down in Nairobi, GDP counts the labour used and the wood produced, but does not deduct the shade and the beauty that are lost. GDP values only those things that are priced and marketed. This matters because growth is always measured in terms of GDP. 2004, the year when TFP (total factor productivity) growth, after jumpstarting in 1995, slowed down again, is when Facebook began to occupy the outsized role that it currently plays in our lives. Twitter would join in 2006, and Instagram in 2010. What is common to all these platforms is the fact that they are nominally free, cheap to run, and wildly popular. When, as is now done in GDP calculations, we judge the value of watching videos or updating online profiles by the price people pay--which is often zero--or even by what it costs to set up and operate Facebook, we might grossly underestimate its contribution to well-being. Of course, if you are convinced that waiting anxiously for someone to like your latest post is no fun at all, but you are unable to kick the Facebook habit because all your friends are on it, GDP could also be overestimating well-being. Either way, the cost of running Facebook, which is how it is counted in GDP, has very little to do with the well-being (or ill-being) that it generates. The fact that the recent slowdown in measured productivity growth coincides with the explosion of social media, poses a problem, because it is entirely conceivable that the gap between what gets counted as GDP and what should be counted in well-being widened exactly at this time. Could it be that there was real productivity growth, in the sense that true well-being increased, but our GDP statistics are missing this entire story? (Edited extracts from <mark>Banerjee</mark> and Duflo's forthcoming book, Good Economics for Hard Times: Better Answers to Our Biggest Problems) <mark>Banerjee</mark> is Ford Foundation International Professor of Economics, at Massachusetts Institute of Technology (MIT), US, and Duflo is Professor of Poverty Alleviation and Development Economics, MIT. Both are founders of the <mark>Abdul Latif</mark> Jameel Poverty Action Lab (J-PAL) with Duflo as its director. Along with Michael Kremer, Gates Professor of Developing Societies, Harvard University, they are recipients of the 2019 Nobel Prize for Economics."}, {"articleID": "2018061221_00583053_W", "names": {"Patrick Reed": ["Q15905139", "Q57514710"], "Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Dustin Johnson": ["Q1002293", "Q30015838"], "Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"]}, "date": "2018-06-12", "url": "http://www.spokesman.com/stories/2018/jun/12/aging-tiger-woods-phil-mickelson-set-to-resume-sto/", "content": "Twitter Facebook Email Reddit SMS SOUTHAMPTON, N.Y.--The 40-40 club will be front and center this week at Shinnecock. No longer the red-hot weekly rivals they'd been over the previous two decades, Tiger Woods, now 42, is seeking to win his first major title in a decade, while Phil Mickelson, at 47, is still chasing his first U.S. Open title (after six runner-up finishes) to complete the career Grand Slam. \"We're certainly on the back end of our careers,\" Woods said when asked about Mickelson on Tuesday. \"We've been going at it for 20-plus years. That's a long time. We've been ranked 1 and 2 and have gone at it a lot of times throughout the years. And we've developed a pretty good friendship because of it.\" Phil's won ump-teen tournaments all around the world and he's finished second at this event six times. Of all the events, you would think this would be the one event he would have the least chance to win, because of the way he's driven for most of his career. But that short game of his is off the charts. A U.S. Open is about wedging. He can spray it a little bit here and there, but you have to be able to get it up and down from 100 yards. We're all gonna face it. And he's been one of the best of all-time at doing that. So he's made some of the more difficult pars that you have to make to win this championship. It's just that he hasn't, but he's come so close. For him to be able to somehow pull it off at his age, I don't think it's ever been done at that age. But also to complete the career grand slam, it would be an unbelievable task and an unbelievable accomplishment. \"Woods typically had the largest practice-round gallery on Tuesday and spoke to a packed interview room before his first Open appearances since 2015, while recent winners of majors--such as Jordan Spieth, <mark>Patrick Reed</mark>, <mark>Jason Day</mark>, <mark>Dustin Johnson</mark>, <mark>Justin Thomas</mark> and Brooks Koepka--all drew considerably smaller crowds.\" It's not really for me. It's to the game in general. . It adds a whole \"nother level, for sure,\" Spieth said of Tiger's presence. \"I think it's great for the sport, but he's not here because of that. He's here because he loves the game and he loves to compete and he wants to win. And that's what he's been obsessed with, and it's what's driven him, and it's why he's so successful.\" But the kind of extra to that is that it's good for the rest of us. He, like Arnie (Palmer) and Jack (Nicklaus), are in that elite company that have shifted the game and made it popular and made the way of life significantly different for professional golfers. We certainly owe a lot to him. But that doesn't mean that anybody wants to take it easy on him if they're coming down the stretch with him. \"<mark>Day</mark>, the 2015 PGA winner, added that he considers\" the biggest story probably \"of the week to be Woods, despite a star-studded field of past champions.\" Not taking anything away from Phil because winning the career Grand Slam is absolutely huge, and I know that he's been so close so many times now, \"<mark>Day</mark> said.\" But for what happened to Tiger, it's been 10 years, what he did in that period of when he dominated, and I think a lot of people are kind of chomping at the bit for him to come back and do something special. Seeing if he can get back to winning and beating Jack's record (of 18 major titles). I think a lot of people will probably be more excited--well, a lot of people will look at that more so than Phil's. \"So I think he's pretty much ready. He's primed and ready for this week. So it would be pretty cool to see that. But, obviously, I don't want that to happen, because I want to win.\" "}, {"articleID": "2018120716_00359459_W", "names": {"Neil Wilson": ["Q3337844", "Q6989491"]}, "date": "2018-12-07", "url": "http://www.tribtown.com/2018/12/07/eu-opec-meeting-2/", "content": "VIENNA--Oil prices spiked sharply higher Friday after OPEC countries agreed to a proposal that would see global oil production reduced by 1.2 million barrels a day. Following a morning meeting of the Organization of the Petroleum Exporting Countries, Iraq Oil Minister Thamir Ghadhban told reporters the proposed cut would be made up of 800,000 barrels per day from OPEC countries and 400,000 barrels per day from Russia and other non-OPEC nations. His Iranian counterpart, Bijan Zanganeh, confirmed the proposed cuts ahead of a closed-door session to finalize the deal with the non-OPEC countries. He said the cuts were to begin January 1, 2019, for a period of six months. Oil producers have been under pressure to reduce production following a sharp fall in oil prices over the past couple of months. The price of oil has fallen about 25 percent recently because major producers--including the U.S.--are pumping oil at high rates. The mooted reduction has certainly met with the response hoped for by ministers. Brent crude, the international standard, up $3.11 a barrel, or 5.2 percent, at $63.17. Benchmark New York crude was $2.23, or 4.3 percent, higher at $53.72 a barrel. The proposed cut was in line with the 1 million to 1.3 million barrels per day expected by analysts. <mark>Neil Wilson</mark>, chief analyst for Markets.com, said the cut at the upper-end of forecasts and a \"real positive.\" \"The fact that the OPEC-Russia alliance is still holding matters as much as the details of the deal itself,\" he said. Russian Energy Minister Alexander Novak did not mention the specific proposal as he addressed colleagues in public before the beginning of the closed session, but said he was \"confident\" they would be able to \"send a strong to the market, to act with resolve.\" \"I believe that our unity of thought and our resolve will help us achieve success in the goal of achieving long-term sustainability and stability of the market,\" he said. The cut is unlikely to be greeted warmly by U.S. President Donald Trump, who has been pressuring the cartel publicly to maintain production. On Wednesday, he tweeted: \"Hopefully OPEC will be keeping oil flows as is, not restricted. The World does not want to see, or need, higher oil prices!\" Heading into the first round of meetings, Saudi Arabia, the heavyweight within OPEC, said it was in favor of a cut of about a million barrels a day. One stumbling block to an agreement had been Iran, Saudi's regional rival and fellow OPEC member, which had been arguing for an exemption to any cuts because its crude exports are already being pinched already by U.S. sanctions. Zanganeh told reporters Iran had been given the exemption. Rising reported from Berlin"}]