[{"date": "2013-11-19", "url": "http://www.defendingbigd.com/2013/11/19/5046040/patience-key", "content": "Get the latest Dallas Stars news with Defending Big D Patience. It's become akin to a four letter word for the Dallas Stars fanbase. The use of \"patience\" with die-hard fans generally elicits a very emotional and fervent response: \"I've been patient for five playoff-less years, I've run out of patience!\" Yes, the Stars haven't made the playoffs in five seasons straight. But what caused that streak is being turned around over the course of the last few seasons. However, the kind of damage done up until Tom Gaglardi took over isn't going to be undone overnight. During those five years, the Stars were run by <mark>Tom Hicks</mark> and then a group of banks as the team lingered through bankruptcy. As <mark>Hicks</mark> started to have finances go into decline, the amount of money spent on the roster was really reduced. Where Dallas had been a team that was in the top part of the league in spending to the cap, they all of a sudden found themselves near the bottom of the league. They were finally sold to Tom Gaglardi about two years ago. One of the first things Gaglardi did was to rebuild the front office--both on the sales/admin side as well as hockey operations. The Stars worked to get a good staff in sales and customer service in place. Gaglardi then worked to keep all of those employees through the prolonged lockout, even as other teams laid off employees and reduced hours and salaries. He invested in the people. The next focus was in making sure that the right people were hired to run the show. Jim Lites was brought in as the president (again .) He went out and hired Jim Nill, something many in the media felt was one of the biggest coups in hockey operations. They brought in a winning experienced coach in Lindy Ruff to coach the team and, along with Nill, to bring a winning pedigree to Dallas. He's come in and rebuilt the team from the top down, establishing a firm foundation for the team to build from. Then it came time to focus on the on-ice product. In Gaglardi, the Stars got a committed and passionate owner that isn't afraid to spend money on the team when it is warranted. They went out and offered contracts to free agents--something they hadn't been able to do for a time. Trades were made to take on salary, which allowed the team to try to improve in the short term while not rushing the prospects and remain competitive in the NHL. The farm system has been replenished. It had basically been depleted after <mark>Doug Armstrong</mark> had spent the previous seasons packaging up draft picks in trades. Coupled with not picking very high for seasons straight, the farm system was lacking the depth necessary to build a true consistent contender. They had to rely on free agency to plug holes in the roster. Through some shrewd trades, Joe Nieuwendyk did what he could for the team while he was general manager when he couldn't spend to the cap--he amassed draft picks and prospects in deals. The fruits of all of this ground work are starting to show. Young guys like Alex Chiasson are now contributing at the NHL level while guys like Brett Ritchie are developing well down in Austin. The Stars now have a team where prospect depth is a position of strength that they can use to better their roster, by allowing for pieces to be traded without being detrimental to the organization. They've made key trades and free agency signings to help the team be right in the mix this season. But they're still not there--yet. There are obvious holes in the roster: the defensive depth, while it is there, seems to hold a lot of redundancies in players that fit a certain mold. Goaltending depth has been tested at the lower levels due to injury already this season. Scoring wingers are needed for depth. One thing the Stars have now, however, is a man with a plan. Nill has come from an organization where patience with prospect development and roster construction reign supreme. He's bringing that calming, patient presence to a team that has lacked it in seasons past. Yes, the Stars haven't made the playoffs for five seasons straight. But I must say, the idea that this team is going to be built right excites me. I have more faith that Nill's plan will pay off in the long-term. Imagine a team that is a contender consistently instead of a flash-in-the-pan every few years. That dream is what keeps me patient, even when the Stars can be exasperating on some nights. They're going through some growing pains but I have every confidence that they'll get there at some point.", "articleID": "2013111923_00051232_W", "names": {"Doug Armstrong": ["Q19347163", "Q19864682", "Q5300254"], "Tom Hicks": ["Q16233855", "Q553219", "Q7816190", "Q7816193"]}}, {"date": "2013-11-19", "url": "http://www.boxinginsider.com/columns/u-s-buys-manny-pacquiao-brandon-rios-subsidize-chinese-ppv-customers/", "content": "Floyd Mayweather, Andre Ward, 1 & 2 Pound-for-Pound, Still Millions Apart Lack of Education Among Fans Might be the Greatest Danger to Fighters By Ivan G. Goldman Bob Arum and his Top Rank Promotions crew are doing their best to generate a deafening buzz for the Manny Pacquiao-Brandon Rios fight in China this weekend, but so far the result isn't ear-shattering. Obtaining pay-per-view buys in the U.S. won't be an easy sell. HBO executives, in their long history of televising fights, have never staged a PPV event from an overseas location. If they thought it was a good strategy they'd have tried it before. For starters, the promoters can't get boxing media to send people out there. Budgets are tight. Although your average newspaper will send people anywhere to cover the local NFL team, you can't always get editors to send a reporter across town to cover fights, much less to the other side of the world. That's no exaggeration. Check out New York Times boxing coverage. Larger news outlets keep bureaus in Beijing, 1,500 miles from the casino strip in Macau, but they're not staffed with sports writers and probably wouldn't recognize Brandon Rios if he showed up at the door. So HBO and Top Rank, apparently having given up on attracting U.S. boxing media to China, hired George Foreman, <mark>Roberto Duran</mark>, <mark>Ray</mark> Leonard, <mark>Ray Mancini</mark>, Tim Bradley, Marco Antonio Barrera and Mike Alvarado to talk about the fight from what they're calling a \"hub\" in Las Vegas, where the fight should have been in the first place. (Or California, which suffers no shortage of people of Filipino or Mexican heritage). Will the \"old\" Manny show up this time? This card will sell for what looks like $70 in high-def. If your cable provider is anything like mine, you could spend half an hour on its website and still not come up with the exact PPV price until you get to the final stage of buying it. Incidentally, the TV broadcast sells for somewhere between four and five bucks in China, which means U.S. buyers will be subsidizing Chinese customers. The listless undercard, which once again includes Chinese flyweight Zou Shming, 2-0 (zero KOs), the world's only 32-year-old prospect, won't add even 10,000 buys in America. It's all on Pacquiao and Rios. Rios, the American, doesn't have a huge following and lost his last fight. The promoter doesn't even want to talk about Pacquiao's last outing. Though he has plenty of American fans, he opted to stay out of Las Vegas this time so he could avoid paying U.S. taxes, which are considerable. Also, Arum says Macau offered him a \"lucrative\" package. The casinos there seem to be happy with the Asian \"whale\" gamblers they attract with big fights. Everything over there is being done on U.S. time, so the fight will be staged Sunday morning at the Venetian Macao, spelled differently than the city to make life harder for boxing writers. The broadcast will start Saturday at 9 PM Eastern time. This fight the weekend before Thanksgiving is getting the full HBO publicity treatment on the 24/7 series. My local barometer is the Hustler Casino in Gardena, Calif., just down the freeway from my house. It arranges showings of PPV fights only when it anticipates big demand, and I've never seen it wrong. It's not showing this one. Now the good news: The fight itself, fought at the welterweight limit of 147 pounds, will probably be exciting as hell, maybe even sensational. Although Rios, 31-1-1 (23 KOs), has been campaigning as a junior welter, \"Rios is bigger than me,\" Pacquiao frankly concedes. Rios' size may bother the Philippines congressman during the fight itself but is unlikely to cause him any sleepless nights beforehand. Antonio Margarito, for example, was quite a big larger than Pacquiao, and by the final bell he looked like he'd been shredded by wolves. Said Manny's famous trainer Freddy Roach, \"I know I predicted that Manny would knock Rios out inside six rounds, but based on our last workout, I don't see how Rios makes it past the fourth round .\" Brandon's almost-as-famous trainer <mark>Robert Garcia</mark> advises Freddy to \"buy that gold watch for Manny...I guarantee you this will be the last time you ever see Manny Pacquiao on an HBO Pay-Per-View. Rios has won every fight, but one by coming forward and beating him down his opponent punishing, accurate shots. Pacquiao is quicker, uses angles and more footwork, but he loves to trade. Like Rios, he gets a kick out of giving the fans plenty of action. Rios takes that even a step further. He seems to enjoy getting hit. In boxing, that's not as unusual as most people would suppose. Some guys are like that. He is, he maintains,\" nobody's stepping stone. \"Pacquiao, 54-5-2 (38 KOs), will be 35 next month, and he's been through plenty of grueling battles, the kind that shorten careers. Critics are already prepared. If he looks bad, they'll say he's finished. If he looks sensational they'll say Rios was made for him. Ivan Goldman's boxing novel The Barfighter, set in the boxing world, was nominated as a Notable Book by the American Library Association. Available online & at better bookstores everywhere. Information Manny Pacquiao: With The Typhoon-ravaged Philippines, This Fight Means More UFC 167 Results: Georges St. Pierre Retains Title with Controversial Decision over Johny Hendricks Peter\" Kid Chocolate \"Quillin Talks about the Rosado fight and his Future Boxing Insider Notebook: Pacquiao, Mayweather, Rigondeaux, Chisora, and more.... Manny Pacquaio Training Camp Media Interview with Freddie Roach U.S. Buys for Manny Pacquiao-Brandon Rios to Subsidize Chinese PPV Customers Lack of Education Among Fans Might be the Greatest Danger to Fighters\" Weighing In' On A Growing Problem: <mark>Rodriguez</mark> Blows His Big Opportunity Floyd Mayweather, Andre Ward, 1 & 2 Pound-for-Pound, Still Millions Apart Jackie Kallen: Andre Ward vs <mark>Edwin Rodriguez</mark> - The Battle of the Unbeatens", "articleID": "2013112007_00026401_W", "names": {"Edwin Rodriguez": ["Q15994921", "Q3048807", "Q5346783"], "Ray Mancini": ["Q1362799", "Q19666019"], "Robert Garcia": ["Q16204904", "Q16439254", "Q21620332", "Q2275115", "Q4168665", "Q631722"], "Roberto Duran": ["Q471571", "Q5406921"]}}, {"date": "2013-11-22", "url": "http://www.miamiherald.com/2013/11/22/3770961/utah-defeats-grand-canyon-79-54.html", "content": "SALT LAKE CITY--Defense proved to be the perfect antidote to anything Grand Canyon could throw at Utah. The Utes controlled the glass. They forced turnovers, swiping the ball frequently to set up easy transition baskets for 40 minutes. Utah's 79-54 victory on Thursday night offered the Antelopes a glimpse at what life will be like as a Division I newcomer. Delon Wright scored 17 points on 8-of-8 shooting while Jordan Loveridge added 15 points and 15 rebounds to lead the Utes (3-0) as they opened the Global Sports Hoops Showcase. Utah used its speed and size to take control of the game from the opening tip. How dominant were the Utes? Utah owned Grand Canyon around the basket. The Utes had a 49-33 edge on rebounds and a 42-28 advantage in points in the paint. When the Antelopes made any mistakes, Utah made them pay quickly. The Utes produced 20 points off 12 Grand Canyon turnovers. Utah also outscored the Antelopes 17-2 in fastbreak points. \"I want our identity built off of our defense - getting stops and knowing the game becomes easier heading the other direction if we can do that,\" Utah coach Larry Krystkowiak said. \"Our guys have been really locked in to guard. We can't be the type of team that has to see the ball go in to the basket in order to get energized .\" Demetrius Walker had 16 points and Jerome Garrison added 12 to lead the Antelopes, who are still searching for their first win over a Division I opponent. Grand Canyon (1-3) joined the WAC this season after competing in the Pac West - an NCAA Division II conference - last season. After 40 minutes against Utah, there are plenty of miles yet to travel on the road to fully making the transition to Division I. \"This is a level that we aren't at yet,\" Grand Canyon coach Dan Majerle said. \"It's where we strive to be. Going from Division II to Division I we knew was going to be a challenge. Our guys played a little scared and they have to get over that. We have to learn from that and move on .\" Points for Grand Canyon occurred as often as a desert rainstorm in the first half. The Antelopes missed seven straight shots to open the game and did not get their first basket until five minutes into the game. They shot only 28 percent from the field and 10 percent from 3-point range before halftime. Utah wasted no time taking advantage. The Utes opened the game on an 11-0 run - capped by a three-point play from Jordan Loveridge - and hit 5 of 7 baskets during the same stretch where Grand Canyon could not score at all. \"It started on the defensive end,\" Loveridge said. \"We got some stops and then it just made our offense easier. That's how we got up. We were just outplaying them on the defensive end and it made our offense that much easier .\" Grand Canyon whittled the lead down to six when Jeremy Adams scored a layup to cut Utah's lead to 15-9. But that brief comeback simply set the stage for another 11-0 spurt for the Ute offense. A layup from Wright gave Utah a double-digit lead again. Dakari Tucker finished off the run with back-to-back 3-pointers, giving the Utes a 30-12 lead with 5:43 remaining before halftime. The Antelopes managed to trim the lead a little bit before halftime and continued to cut into it coming out of the locker room. Grand Canyon rallied within 12 points, making it 40-28 on a layup from Killian Larson. \"They did a good job of guarding us,\" Krystkowiak said. \"Put some heat on us that we've haven't felt in weeks in terms of trying to take us out of things .\" Utah did not let the Antelopes get any closer. Jeremy Olsen scored layups on back-to-back possessions to spark a 13-2 run. Wright finished off the run with a three-point play, giving Utah a 53-30 lead with 12:00 minutes left in the game. Grand Canyon had one final run left. The Antelopes went on a 10-2 spurt, cutting it to 55-40 on a <mark>Blake Davis</mark> 3-pointer. Utah ended slammed the door shut on any comeback by answering with an 8-0 run. Van Dyke drained a pair of free throws to cap the spurt and give the Utes a 63-40 lead with 7:15 remaining. The Global Sports Hoops Showcase continues Friday with Grand Canyon facing Savannah State and Utah hosting Lamar.", "articleID": "2013112214_00005901_W", "names": {"Blake Davis": ["Q2905829", "Q4924361"]}}, {"date": "2013-11-25", "url": "http://southtownstar.suntimes.com/sports/23932871-419/disabato-marian-catholic-starts-boys-basketball-season-no-1-in-southtownstar.html", "content": "Disabato: Marian Catholic starts boys basketball season No. 1 in SouthtownStar storyidforme: 58254522 tmspicid: 21250567 fileheaderid: 9973726 I could attempt to appease more readers and claim there were as many as a half-dozen teams in the running for the No. 1 spot in the SouthtownStar's Boys Basketball Preseason Top 10. That would be stretching the truth. It was a three-team race, and each, in its own way, had the means to earn top honors. It came down to defending Class 3A state champion Morgan Park, reigning Catholic League South champion St. Rita and Marian Catholic, fresh off a record-setting season in 2012-13. So why Morgan Park? The Mustangs boast a pair of 6-foot-7 forwards in Josh Cunningham and Lamont Walker and a dynamic, young point guard in sophomore <mark>Charlie Moore</mark>. Why St. Rita? Well, there's Vic Law, a 6-7 Northwestern recruit, junior <mark>Charles Matthews</mark>, regarded as one of the top prospects in the Class of 2015, and senior Dominique <mark>Matthews</mark>, who averaged 16 points per game a year ago. Why Marian? Well, the Spartans return their entire starting lineup from a team that won a school-record 29 games and advanced to its first Elite Eight, led by all-world point guard Tyler Ulis, a Kentucky recruit. Selecting the best among the three was like judging a beauty pageant between the Victoria Secret Angels. While I believe St. Rita, from top to bottom, with three bona fide Division I players, is the most talented squad in the Southland, talent alone doesn't guarantee success. That's why Marian Catholic will begin the season as No. 1. Of course, the Spartans are talented. Ulis is the best player in the area, and I believe the seasoned, experienced supporting cast of Ki-jana Crawford, Josh Cohn, Terrone Parham and <mark>John Oliver</mark> will be even better this season. Here's what sets Marian apart: The Spartans realize Ulis is the star of the show and are willing to play Robin to his Batman. Ulis, in turn, is just as pleased to register the assist on a game-winning shot as he is burying a buzzer-beater. In other words, egos are checked at the door. That's as much a compliment to the players as it is to coach <mark>Mike Taylor</mark> and his staff. Beginning his 11th season, <mark>Taylor</mark> has taken the program from the outhouse to the penthouse. \"We're very proud to be No. 1,\" <mark>Taylor</mark> said. \"We have a great appreciation for south suburban basketball. We were never mentioned in the same sentence before with Bloom, H-F, Hillcrest, Thornton and Thornwood. Now, we are .\" Marian was able to fly under the radar for most of the first-half of last season. That won't be the case beginning Monday vs. T.F. South. The Spartans better have a solid jaw, because every opponent is going to give them their best shot. \"I think the kids think they're ready for it,\" <mark>Taylor</mark> said. \"I don't think they realize how hard everyone is going to come at them. Our whole group is going to have to stand up .\" The one area concern for the Spartans is a lack of size. Parham, at 6-7, is their tallest player. \"We're not much different than last year; we're better in a lot of ways,\" <mark>Taylor</mark> said. \"But we haven't gotten any bigger .\" Ulis has gotten noticeably stronger, according to <mark>Taylor</mark>, and that should scare the daylights out of opponents. <mark>Taylor</mark> also said <mark>Oliver</mark> and Cohn have improved their games big time. Now it's time to go out and live up to expectations. \"It's going to be a battle every night,\" <mark>Taylor</mark> said. \"I've told them,' I don't want your season to be defined by one game. Celebrate this year, celebrate each other, celebrate what you've accomplished. '", "articleID": "2013112510_00027505_W", "names": {"Charles Matthews": ["Q27448073", "Q42322466", "Q43167428", "Q47108874", "Q5080729", "Q5080732"], "Charlie Moore": ["Q16211929", "Q5085260", "Q58090551"], "John Oliver": ["Q1701249", "Q1701254", "Q21598301", "Q22279481", "Q47542017", "Q6251229", "Q6251231", "Q6251237"]}}]