[{"articleID": "2015090806_00078709_W", "names": {"John Kerry": ["Q22316", "Q6242998"], "Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2015-09-08", "url": "http://wlox.com/story/29976956/us-israel-spat-over-iran-deal-may-sideline-palestinians", "content": "US-Israel spat over Iran deal may sideline Palestinians - WLOX.com - The News for South Mississippi US-Israel spat over Iran deal may sideline Palestinians - WLOX.com - The News for South Mississippi Member Center: Bounce US-Israel spat over Iran deal may sideline Palestinians (Menahem Kahana/Pool photo via AP). Israeli Prime Minister Benjamin Netanyahu chairs the weekly cabinet meeting at his office in Jerusalem, Sunday, Sept. 6, 2015. By DAN PERRY and JOSEF FEDERMANAssociated Press JERUSALEM (AP) - In recent months, many in the Middle East had assumed - some in hope, others with concern - that once the Iranian nuclear issue was resolved, the United States would make another push for peace between Israel and the Palestinians. But the opposite seems more likely. After a drawn-out confrontation with Prime Minister Benjamin Netanyahu over the Iranian nuclear deal, the White House seems to have little appetite for what would almost certainly be a new round of tensions with the Israeli leader over the terms of Palestinian statehood. With the odds of success slim and U.S. elections approaching, President Barack Obama seems more interested in repairing his tattered relationship with Israel, leaving the Palestinian issue to his successor. In recent comments, Obama has spoken of boosting security cooperation and providing upgraded military hardware to make up for Israeli misgivings over the nuclear deal. Speaking to the Jewish newspaper The Forward last week, he likened his differences with Israel to a disagreement inside a family and predicted relations would survive the test. \"I think it is important for everybody to just take a breath for a moment and recognize that people on both sides of the debate love the United States and also love Israel,\" Obama said. He made no mention of the Palestinian issue. A U.S. State Department official told The Associated Press that the U.S. is not planning any bold new diplomatic initiatives after the Iran deal makes its way through Congress. He spoke on condition of anonymity because he was not authorized to speak to the media. In Israel, there had been speculation that Obama might act otherwise. \"Now that President Barack Obama has got his Iran deal...he will likely also try, in the year and four months until the presidential elections, to turn his attention to other urgent regional issues, such as Syria, and the talks or lack thereof between Israel and the Palestinian Authority,\" Israeli commentator Avi Issacharoff wrote in the Times of Israel in July. The Palestinians have also said they have received vague assurances from the U.S. that they have not been forgotten. Several factors argue against another White House push to end Israel's half-century-old occupation of Palestinians. First is Obama's apparent eagerness to make amends after a period of startling acrimony symbolized by Netanyahu's controversial speech to Congress in March, when he railed against the emerging nuclear deal. Netanyahu has only stepped up his criticism since the deal was sealed in Vienna in July, having his ambassador to Washington lobby against the agreement in meetings with American lawmakers. Even after Obama secured the needed support in Congress to uphold the deal last week, Netanyahu vowed to continue fighting it. The U.S.-led deal gives Iran relief from economic sanctions in exchange for curbs on its nuclear program. Netanyahu, with widespread support among the Israeli public, believes Iran will use its newfound funds to promote violence in the region and says the deal will not prevent Iran from ultimately gaining the ability to produce nuclear bombs. Israeli media often depict Obama as naive or even hostile to the country. Netanyahu's conservative government, meanwhile, shows little patience for being cajoled into concessions. Netanyahu himself declared during Israel's election campaign in March that he would not allow a Palestinian state to be established on his watch, though he has since backtracked somewhat and said he is prepared to resume peace talks. The United States, for its part, is entering an election season in which Obama's Democratic Party can ill afford continued friction with Jewish Americans, a key base of support. And one factor may override all others: The problems dividing Israel and the Palestinians seem oddly resistant to negotiation and mediation, at least under current circumstances. Obama and his secretary of state, <mark>John Kerry</mark>, experienced this firsthand when they sponsored an ambitious round of talks that consumed much of their attention and collapsed in mid-2014 after nine months of quibbling and vexation. It might have come as no surprise. Intervention efforts by outside powers in the Middle East - whether attacks in Iraq or Afghanistan, Libya, Yemen or mediation efforts in Syria - have not fared well of late. But even compared to those quagmires, the century-old Israeli-Palestinian conflict may be truly a case apart. Two decades of on-again, off-again negotiations have strongly suggested the sides are genuinely unable to meet in the middle on a deal. The Palestinians seek all of the West Bank, east Jerusalem and the Gaza Strip - territories captured by Israel in the 1967 Mideast war - for an independent state. Many Israelis do seem to accept letting go of the Palestinians and allowing them have a state on most of the lands they seek. But many also insist on continued control of parts of the West Bank, citing security grounds or religious attachment to the territory. The idea of both countries sharing Jerusalem, and its sensitive holy sites, as a joint capital is a challenge, to say the least. And Israel has no intention of accepting the principle of a \"right of return\" of refugees who fled its territory in 1948 and their descendants, a combined designation that numbers in the millions. Creative efforts to get around the impasse have bedeviled negotiators and mediators for some two decades. Tellingly, opponents of Netanyahu can increasingly be heard yearning for outside pressure to move their fellow Israelis. This derives more from concern about the Palestinians than for them. The logic is that unless Israel finds a way to truly partition, its Jewish majority will be doomed by march of demography: Israel plus the West Bank and Gaza together have some 12 million people, equally divided between Jews and Arabs, with the Arab birthrate higher. It is ironic, many say, that Netanyahu's nationalists are the ones who are taking the Zionist project down this path. \"An honorable Israeli leadership, if there were one, would...find a solution to the Israeli-Palestinian conflict in partnership with the United States and Europe,\" said Shabtai Shavit, a former director of the Mossad intelligence service, addressing a counterterrorism conference on Monday. On the Palestinian side, the frustration is compounded by a sense that their moment may have passed as the world's attention moves on to the many other wars and crises across the Arab world. President <mark>Mahmoud Abbas</mark> has hinted in recent weeks at retiring or canceling the existing 1990s peace deals. Under those arrangements, he heads an autonomy government that governs parts of the West Bank and cooperates with Israel on security. Palestinian officials attribute the threats to a hope by <mark>Abbas</mark> that he can somehow spur the U.S. and international community into action. Indeed, Palestinian officials say U.S. Secretary of State <mark>John Kerry</mark> called <mark>Abbas</mark> over the weekend and promised to meet on the sidelines of the U.N. General Assembly at the end of the month. But skepticism abounds. \"There is no sign that the Americans will present anything new,\" said Nabil Shaath, a senior Palestinian official. \"They will keep saying that the only solution now is to make President <mark>Abbas</mark> (and) Netanyahu sit together. But we have been in this process for 22 years, and nothing has happened .\" Associated Press writer Aron Heller contributed to this report from Herzliya, Israel. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2010072901_00135124_W", "names": {"Brian Scott": ["Q27070266", "Q4965241", "Q58918564", "Q9179287"]}, "date": "2010-07-29", "url": "http://paddocktalk.com/news/html/modules.php?op=modload&name=News&file=article&sid=141332&newlang=&topic=11&catid=33", "content": "posted by: msulka on jul 28, 2010 - 08:00 pm 2010 iowa: <mark>brian scott</mark> nascar nationwide race preview <mark>scott</mark> will make his first nascar nationwide series start at iowa speedway <mark>scott</mark> has one start at iowa in the camping world truck series, starting 18th and finishing ninth. <mark>scott</mark> has completed 200 of 200 (100%) attempted laps at iowa. (cwts) <mark>scott</mark> currently leads raybestos rookie of the year standings by 20 points (189-169) over ricky stenhouse jr. this weekend's kroger 200 will mark the 10th time that <mark>scott</mark> will drive the accudoc solutions toyota camry this season. <mark>scott</mark> talks iowa speedway \"iowa is an excellent facility, i'm glad nascar added it to the nationwide series schedule. iowa is perhaps the only modern short track that used all the factors that create great racing. the surface has tremendous grip and the progressive banking gives us a couple of lanes to pass. there's always a lot of side-by-side racing. i feel the fans out there really appreciate the great facility too. with all that great racing, the people in the area take notice and really support the sport. iowa is one of those events that you look forward to. the racing is great, the fans are great. it's the reason we do this every weekend .\" <mark>scott</mark> on expectations \"we're looking forward to putting last week behind us. the problem after two top-10 runs is that the whole team is expecting great things. we never could get a good handle on our drive off the corner at orp and we ended up finishing 17th. while that is very respectable, we have an expectation now that we can compete week in and week out in the top-10. looking forward to iowa, we are very focused on returning back to top-10 form. looking at what the differences were across all four braun racing teams and what we did differently the weeks before to net those top-10's .\" <mark>scott</mark> on off-track antics \"i've been keeping pretty busy off the racetrack here lately too. last week i was fortunate enough to play in the nationwide children's hospital pro-am. it was really great being able to support nationwide insurance for all the things they do not only in nascar, but in golf and more importantly, their children's hospital. this week i'm getting ready to go to pocono for some more golf for todd bodine's charity golf tournament. before i leave for pocono i'll be attending a skype board meeting for the joe and katherine albertson foundation back in idaho. it's a great cause committed to improving education in the state of idaho .\" crew chief for the no. 83 nascar sprint cup team penalized for rule violation at indianapolis no. 88 nascar nationwide series team penalized for rule violation at o'reilly advantage to old hands or newcomers at nascar trucks' newest playground? all logos and trademarks in this site are property of their respective owner."}, {"articleID": "2017082923_00649148_W", "names": {"Michelle Lee": ["Q16233958", "Q28465824", "Q6837119", "Q717070"], "John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"], "Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2017-08-29", "url": "http://bdtonline.com/news/no-fire-or-fury-but-muted-trump-response-to-nkorea/article_a6212e3f-c85e-5abe-9101-5464b32bcfe3.html", "content": "No fire or fury, but muted Trump response to NKorea missile North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over U.S. ally Japan and splashed into the northern Pacific Ocean, officials said. More Headlines NEW YORK (AP)--The Latest on the U.S. Open, the last Grand Slam tournament of the year (all times local): More Headlines Birth Announcement HAGER--<mark>Michelle Lee</mark> and Jay O’Keith Hager announce the birth of their daughter, Kinsley Paige Hager, born on August 15 at Bluefield Regional Medical Center, the baby weighed 7 lbs. 2 oz. The mother is the former <mark>Michelle Lee</mark> Reed. Maternal Grandparents are Tina and Terry Reed of Bluefield,...Covering Trump: Reports facts, then let the people decide A president's true effect on his country can't be fully and accurately assessed until some time after his or her term ends. But looking at Donald Trump's record so far indicates his effect will be almost 100 percent negative, as is plainly demonstrated by media coverage and the estimates of...More Headlines Close 1 of 9 El presidente Donald Trump habla en una conferencia de prensa conjunta con su colega finlandés Sauli Niinistro, el lunes 28 de agosto de 2017, en la Casa Blanca (AP Foto/Carolyn Kaster) Carolyn Kaster In this Aug. 24, 2017 photo provided by South Korea Defense Ministry on Tuesday, Aug. 29, 2017, a South Korean missile is test-fired at an undisclosed location in South Korea. South Korea has released footage of its own missile tests it says were conducted last week in a response to the latest North Korean missile launch that flew over northern Japan. (South Korea Defense Ministry via AP) HOGP In this photo taken Aug. 28, 2017, President Donald Trump speaks in the East Room of the White House in Washington. President Donald Trump said Tuesday, Aug. 29, 2017 that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. (AP Photo/Alex Brandon) Alex Brandon FILE - In this Aug. 3, 2017 file photo, Japanese Prime Minister Shinzo Abe speaks during a news conference in Tokyo. President Donald Trump said Tuesday that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. President Donald Trump and Abe conferred by telephone over the latest missile test and how to response. (AP Photo/Shizuo Kambayashi, File) Shizuo Kambayashi Japanese Air Self-Defense Force (JASDF) demonstrates the training to utilize the PAC-3 surface to air interceptors at the U.S. Yokota Air Base in Fussa, on the outskirts of Tokyo Tuesday, Aug. 29, 2017. The pre-planned training took place the same morning North Korea fired a missile over Japan. (AP Photo/Eugene Hoshiko) Eugene Hoshiko A visitor uses binoculars to see the North Korea side from the unification observatory in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man AP's news director for Japan and the Koreas explains that Pyongyang's launch of a ballistic missile seems designed to show that North Korea can back up its threat to target the U.S. territory of Guam. (Aug. 29) North Korea's Kaepoong town is seen behind a North Korean military guard post, right bottom, from the unification observatory in Paju, in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man South Korean army's K-9 self-propelled howitzers move on the street in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man No fire or fury, but muted Trump response to NKorea missile By MATTHEW PENNINGTON Associated Press 14 min ago El presidente Donald Trump habla en una conferencia de prensa conjunta con su colega finlandés Sauli Niinistro, el lunes 28 de agosto de 2017, en la Casa Blanca (AP Foto/Carolyn Kaster) Carolyn Kaster In this Aug. 24, 2017 photo provided by South Korea Defense Ministry on Tuesday, Aug. 29, 2017, a South Korean missile is test-fired at an undisclosed location in South Korea. South Korea has released footage of its own missile tests it says were conducted last week in a response to the latest North Korean missile launch that flew over northern Japan. (South Korea Defense Ministry via AP) HOGP In this photo taken Aug. 28, 2017, President Donald Trump speaks in the East Room of the White House in Washington. President Donald Trump said Tuesday, Aug. 29, 2017 that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. (AP Photo/Alex Brandon) Alex Brandon FILE - In this Aug. 3, 2017 file photo, Japanese Prime Minister Shinzo Abe speaks during a news conference in Tokyo. President Donald Trump said Tuesday that \"all options are on the table\" in terms of a U.S. response to North Korea's launch of a missile over Japan. President Donald Trump and Abe conferred by telephone over the latest missile test and how to response. (AP Photo/Shizuo Kambayashi, File) Shizuo Kambayashi Japanese Air Self-Defense Force (JASDF) demonstrates the training to utilize the PAC-3 surface to air interceptors at the U.S. Yokota Air Base in Fussa, on the outskirts of Tokyo Tuesday, Aug. 29, 2017. The pre-planned training took place the same morning North Korea fired a missile over Japan. (AP Photo/Eugene Hoshiko) Eugene Hoshiko A visitor uses binoculars to see the North Korea side from the unification observatory in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man AP's news director for Japan and the Koreas explains that Pyongyang's launch of a ballistic missile seems designed to show that North Korea can back up its threat to target the U.S. territory of Guam. (Aug. 29) North Korea's Kaepoong town is seen behind a North Korean military guard post, right bottom, from the unification observatory in Paju, in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man South Korean army's K-9 self-propelled howitzers move on the street in Paju, South Korea, Tuesday, Aug. 29, 2017. In a first, North Korea on Tuesday fired a midrange ballistic missile designed to carry a nuclear payload that flew over Japan and splashed into the northern Pacific Ocean, officials said. The aggressive missile launch--likely the longest ever from the North--over the territory of a close U.S. ally sends a clear message of defiance as Washington and Seoul conduct war games nearby. (AP Photo/Lee Jin-man) <mark>Lee</mark> Jin-man WASHINGTON (AP)--So much for North Korea's restraint. So much for President Donald Trump's threats of \"fire and fury .\" After Pyongyang's highly provocative missile test over close American ally Japan, Trump offered a surprisingly subdued response Tuesday, pulling back from his administration's recent suggestions of a dialogue with the communist country but also avoiding a repeat of his bombastic warnings earlier this month of a potential military confrontation. Instead, Trump's terse, written statement reiterating that all U.S. options are being considered pointed to an administration cautiously searching for an effective policy, even as the North's test risked endangering Japanese civilians. Washington and its allies called an emergency U.N. Security Council meeting for later Tuesday, but looked short on new ideas for stopping the nuclear and missile advances that are increasingly putting the U.S. mainland within range. \"Threatening and destabilizing actions only increase the North Korean regime's isolation in the region and among all nations of the world,\" Trump said after the North's missile soared almost 1,700 miles (2,700 kilometers) into the Pacific Ocean, triggering alert warnings in northern Japan and shudders throughout Northeast Asia. \"All options are on the table .\" The tone was far more moderate than Trump's colorful language earlier this month, when he spoke of unleashing \"fire, fury and frankly power the likes of which this world has never seen before\" if North Korea kept threatening the U.S.. There were no indications Trump had any imminent intention to make good on his threat to strike North Korea. But such has been the speed of the Trump administration's zigs and zags on North Korea policy. If Tuesday's statement seemed unusually restrained for Trump, it actually marked a toughening of his administration's most recent tone. A senior U.S. official said the restrained nature of the administration's recent responses was intentional, reflecting an effort by new White House chief of staff <mark>John Kelly</mark> to prevent a repeat of the rhetorical escalation that occurred earlier this month. But with Trump's focus diverted to flood-ravaged Texas, it was unclear whether he might ultimately speak or tweet about the launch in greater detail. Three weeks ago, when North Korea responded to Trump's \"fire and fury\" warning by threatening to launch multiple missiles near the U.S. Pacific territory of Guam, Trump tweeted that an American military solution to the standoff was \"locked and loaded .\" Experts warned that the rapid-fire escalation had raised the danger of a miscalculation among the nuclear-armed powers. The administration's more cautious approach in recent days reflects an effort to preserve modest signs of progress with North Korea that had led Trump and his top diplomat to hint at the possibility of direct talks, said the official, who wasn't authorized to discuss the deliberations publicly and requested anonymity. North Korean leader <mark>Kim Jong Un</mark> is \"starting to respect us,\" Trump said at a campaign rally in Phoenix last week, adding that \"maybe, probably not, but maybe something positive can come about .\" Secretary of State Rex Tillerson credited <mark>Kim</mark>'s government with demonstrating \"some level of restraint that we have not seen\" by not conducting a missile test for almost a month, expressing hope it might be the \"signal that we have been looking for,\" leading to a dialogue. Even that suggestion was a surprising one for the Trump administration. On his first trip to Asia, Tillerson said North Korea must first abandon its \"weapons of mass destruction\" for talks to occur. But he later floated the idea that the North merely had to halt its nuclear and missile tests. The North has completely rejected both demands, saying negotiations hinge on the U.S. dropping its \"hostile policy .\" In any case, the optimism generated by North Korea's temporary lull in missile activity ended last Friday, when it fired three short-range projectiles into the sea. It then raised the ante three days later by firing directly over Japan's territory, breaking with its usual practice of launching over open seas where there's no risk that a misfire would land in another country or send debris falling on populated areas. <mark>Kim</mark> on Tuesday expressed great satisfaction with the launch and called for more ballistic missile launches into the Pacific, the Korean Central News Agency reported. <mark>Kim</mark> called it a \"meaningful prelude\" to containing Guam. The agency said the missile the North fired Tuesday was the Hwasong-12 intermediate-range missile it recently threatened to fire toward Guam. But for Trump's earlier bombast, his Tuesday statement wouldn't have been particularly surprising. Democrat and Republican presidents have routinely offered the \"all options on the table\" terminology, even though a pre-emptive U.S. military strike is highly unlikely. North Korea has the world's largest standing army and a massive conventional weapons arsenal that can easily target the capital of South Korea and its metropolitan area of about 25 million people. American officials have long assessed that mass casualties would likely result. But while U.S. officials had been inclined to overlook Friday's launches, the launch early Tuesday in North Korea was harder to ignore. Friday's rocket tests represented a typical North Korean response to annual, U.S.-South Korean military drills that Pyongyang claims are rehearsals for invasion. This year's war games started last week and end Thursday. Tuesday's launch was altogether more provocative. It was only the third time North Korea has fired a missile over Japan. The previous occasions in 1998 and 2009 used rockets purportedly for space exploration. This time, the North unambiguously tested a ballistic missile designed for military strikes and believed capable of carrying a nuclear warhead. Within minutes, cellphones alerted residents on the northern Japanese island of Hokkaido, and loud alarms and emails instructed them to stay indoors. Speakers broadcast an alert saying \"missile is passing, missile is passing .\" Trump and Prime Minister Shinzo Abe of Japan conferred by telephone, agreeing that North Korea poses \"a grave and growing direct threat,\" the White House said. They vowed to increase pressure on the North. \"Japan's and the U.S. positions are totally at one,\" Abe added in a statement, saying Trump expressed his \"strong commitment\" to defend Japan. During a closed-door Security Council session later Tuesday, Nikki Haley, Trump's U.N. envoy, was hoping veto-wielding members China and Russia would cooperate. But Haley didn't specify what action the U.S. its allies sought. \"No country should have missiles flying over them like those 130 million people in Japan. It's unacceptable,\" Haley told reporters. She added, \"Something serious has to happen .\" ------Associated Press writers Josh Lederman and Bradley Klapper in Washington and Jennifer Peltz at the United Nations contributed to this report. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}, {"articleID": "2008091018_00035496_W", "names": {"Jim Brown": ["Q10527478", "Q17612149", "Q19560152", "Q20047085", "Q26944961", "Q27915121", "Q30122227", "Q41446745", "Q6144659", "Q6193865", "Q6193871", "Q6193875", "Q6193882", "Q6379973", "Q927916"]}, "date": "2008-09-10", "url": "http://salon.com/sports/daily/feature/2008/09/10/celebration_letters/index.html?source=rss&aim=/sports/daily/feature", "content": "the readers write--and seem unable to find a middle ground between boorish taunting and stoic restraint bobhuggins as <mark>jim brown</mark> said, \"when you get to the end zone, act like you've been there before .\" there is plenty of opportunity for celebration, pageantry, and tradition with the bands, cheerleaders, fans, etc. the players should play their hearts out and when the whistle blows, toss the ball to the ref and get their butts in the huddle. sequoiap you don't see professional baseball, hockey, or basketball players spiking the ball or performing look-at-me dances after a score. putting aside baseball and basketball, where you do see similar things, and gosh i think they're just dandy as long as it doesn't involve taunting or intentionally humiliating an opponent: ever seen a hockey player after a score? this gets to my point about cultural values. it's fine for someone to say, \"i agree with <mark>jim brown</mark>: when you get to the end zone, act like you've been there before. hand the ball to the ref and go back to your bench .\" great. that's your cultural values talking. mine say, \"go crazy, folks! go crazy! when you achieve the rare feat of scoring a touchdown, you've earned the right to yelp it up .\" your point of view doesn't make you a good person and mine doesn't make me a bad person. they're both legitimate viewpoints. they just happen to be opposite. maybe we should find a compromise. the ncaa rules are not a compromise. they are an extremist version of your point of view. congratulations. it's interesting that you brought up hockey. because in both hockey and soccer--and remember that hockey is the game of the culturally reserved canadian plains, and soccer is pretty big in a lot of places, such as culturally reserved england--it's considered an insult to the other team if you don't yelp it up after a goal. you put on some \"no big deal, i've done it before\" act after you've committed the monumental deed of scoring on us, we'll knock your block off. it is simply not true that celebration = bad and unclassy, stoic nonchalance = good and classy. good question by jmfq: why is restraint fetishized? remitrom: at this level of college football these \"amateurs\" are highly recruited, semi-pro, hired guns \"playing\" out there. this isn't the noble band of misfits who were inspired at half-time by a \"let's win one for the gipper\" speech. gotcha. they're pros. i agree. i don't want to see the practiced grandstanding that takes place in every nfl game by over-paid buffoons trickle down to the much purer saturday contests. whoa. whiplash. mikeinwaco so, should a baseball runner get to stomp up and down on home plate, beat his chest, jump up on the backstop or into the seats behind home plate after scoring a run? should a tennis player get to do summersaults and cartwheels after scoring points? should a prize-fighter get to straddle his unconscious victim while beating on his chest with his fists? should a basketball player get to jump up and slam the backboard with both hands in celebration of every slam dunk or do little dance on the way down to the other end of the court? what's wrong with insisting that football players show a minimum level of restraint following athletic feats on the football field? nothing. but what are you talking about? or, as jr put it: are we really talking about the same thing here? it's not like he [that is, jake locker of the washington huskies] was teabagging the other team's waterboy. if i argued that bumping into someone on the sidewalk should not be a crime, would you say, \"so, should you just be able to shoot someone in the head whenever you want?\" if i said you shouldn't get a ticket for jaywalking on a quiet street, would you say, \"so, should you be able to just walk right into the white house?\" that's pretty much what you're doing with this line of argument. is there a term for that in rhetoric? i don't know. that was a rhetorical question and i never took rhetoric. to answer: no. i would characterize all of those things as either taunting or intentionally humiliating or showing up an opponent. what's the deal with this issue? why are the opinions on it so extreme? why are there so many people who can't seem to see that there's a middle ground between \"putting your head down and pretending that you're not happy about what you've just done\" and \"going bats--t crazy\" ? fishfry any expression of spontaneity and joy is verboten in the new american mindset. submit to authority. it's for you own safety. am i making too much of this? letters: celebration penalties the readers write--and seem unable to find a middle ground between boorish taunting and stoic restraint. wednesday, sep 10, 2008 21:20 edt \"celebration\" crackdown hurts college football the ncaa's ham-fisted enforcement is a threat to the best thing about the game: the intense, celebratory atmosphere. wednesday, sep 10, 2008 14:00 edt sporting news scribe vinnie iyer takes the early lead in this year's contest between \"experts,\" computers, kids, porn stars and you. the dominatrix (550) by gary kamiya king kaufman's sports daily: like talking sports to the guy on the next barstool, if the guy on the next barstool were pretty smart and not drunk. king at salon.com, \"celebration\" crackdown hurts college football the ncaa's ham-fisted enforcement is a threat to the best thing about the game: the intense, celebratory atmosphere. panel o' experts standings: week 1 sporting news scribe vinnie iyer takes the early lead in this year's contest between \"experts,\" computers, kids, porn stars and you. sports daily newsletter to receive the sports daily newsletter, send an e-mail to"}, {"articleID": "2012022623_00083793_W", "names": {"Thomas Jones": ["Q10382179", "Q1338348", "Q20738123", "Q25936032", "Q325823", "Q43169202", "Q56598227", "Q6038242", "Q7787253", "Q7792840", "Q7794697", "Q7794759", "Q7819584", "Q7864895"]}, "date": "2012-02-26", "url": "http://profootballweekly.com/2012/02/26/chiefs-sure-to-address-running-back-this-offseason", "content": "posted feb. 26, 2012 @ 3:57 p.m. et by eli kaberon there are question marks all across the chiefs depth chart, including quarterback, wide receiver, offensive line and defensive line. some of these will be upgraded in free agency and the draft, but others will look the same as they did last season. one position that is sure to see change is at running back. with rbs <mark>thomas jones</mark> and jackie battle free agents and jamaal charles coming off acl surgery, there is a clear need for a runner. many believe the team will draft a back at some point to complement charles. meanwhile, others expect a free agent - specifically benjarvus green-ellis of the patriots - to go to kansas city. the team also could opt bring back battle, along with fb le \"ron mcclain to aide the rushing attack .\" i think it's another solid class, \"gm scott pioli said of the running backs available in the draft .\" there are a number of underclassmen making it another solid class of running backs. i think overall, the entire draft, it's a really solid class all along. \"the chiefs led the nfl in rushing in 2010, gaining 164.2 yards per game. much of that came from charles, who had a record-setting season in leading the team to first place in the afc west. however, last season, when charles went down with an acl tear in week two and <mark>jones</mark> struggled to get much going, the running game as a whole underperformed. kansas city finished 15th in the league at 118.3 yards per game, an issue the team wants to fix this coming season. pioli told reporters at the nfl scouting combine he believes that charles will return to health next season, but that depth at the position is still vitally important .\" i'm a firm believer that even when you have good starters - i think jamaal is a very good starter and hopefully coming back healthy from the injury - you can never have enough good players or depth, \"he said .\" whether we address it in this draft or in free agency, i think it will be, \"where does opportunity meet our needs?'\" battle, who has tremendous value on special teams, is expected to re-sign. we hear <mark>jones</mark>, who turns 34 in august, won't return and might retire. head coach romeo crennel said the chiefs would like to bring back mcclain, who did well as a lead blocker during his first season with the team. pro football weekly, llc. | 302 saunders rd. suite 100 riverwoods, il 60015 | (847) 940-1100 copyrighted? 1998-2012 by pro football weekly, llc. all rights reserved. reproduction without permission is strictly prohibited."}, {"articleID": "2019011216_00013169_W", "names": {"Jennifer Smith": ["Q10306654", "Q14322421", "Q3177108", "Q3177109"], "Jake Thomas": ["Q17182107", "Q380180", "Q58828193"]}, "date": "2019-01-12", "url": "http://kron4.com/news/national/jayme-closs-was-missing-for-3-months-her-hometown-never-gave-up-hope/1699089025", "content": "Jayme Closs was missing for 3 months. Her hometown never gave up hope Jayme Closs was missing for 3 months. Her hometown never gave up hope By: Posted: Jan 12, 2019 07:49 AM PST Updated: Jan 12, 2019 07:49 AM PST Jayme Closs was missing for 3 months. Her hometown never gave up hope Video (CNN)--On Friday, the signs changed in Barron, Wisconsin, from \"Pray for Jayme\" to \"Welcome Home Jayme .\" People in the town of about 3,400 people celebrated the best news they could imagine: Jayme Closs, 13, had been found, three months after she went missing from a bloody crime scene. \"There's so much love and hugs in our district today,\" Diane Tremblay, the administrator for Wisconsin's Barron County School District, said Friday at a news conference. \"Jayme has been found safe and reunited with her family and friends. There is truly nothing in the world better than that .\" \"Jayme: Aunt Jen can't wait to give you that big hug and hold you tight,\" <mark>Jennifer Smith</mark>, Jayme's aunt and godmother, told CNN affiliate WCCO, \"because we're not going to let you go .\" In a nightmare scenario, law enforcement authorities received a 911 call October 15 and went to a country home where Jayme lived with her parents. James Closs, 56, and Denise Closs, 46, were found shot to death. Their daughter, Jayme, was nowhere to be found. She was 5 feet tall and weighed 100 pounds. Authorities said they had no idea who killed her parents or what happened to the teen. Two days after the killings, Barron County Sheriff Chris Fitzgerald told reporters, \"I'll be honest. I'm struggling with this because I don't have some of those answers that I want to give you .\" \\ A small town comes together Despite the lack of clues, law enforcement kept searching. And the people of Barron never gave up hope, proving that in ways symbolic and practical. They helped look for Jayme. On October 22, a week after her disappearance, 2,000 volunteers showed up to assist law enforcement in a search of the countryside. That crowd was the equivalent of two-thirds of the population of Barron. Timeline of Jayme Closs case They congregated to share their hopes and fears. The same day as the search, people poured into the Barron High School football stadium for \"A Gathering of Hope,\" an event to honor Jayme. <mark>Smith</mark>, Jayme's aunt, put out a message to the girl: \"Jayme, we need you here with us to fill that hole we have in our hearts. We all love you to the moon and back. And we will never stop looking for you ....Your dog, Molly, is waiting for you. She's sleeping in one of your sweatshirts .\" A reward of $25,000 was offered, and it soon grew to $50,000. Signs popped up with messages of faith and hope: \"Bring Jayme Home\" and \"We Are Praying For Jayme .\" As the Christmas season arrived, the missing teen was not forgotten. A \"Tree of Hope\" for Jayme was put up at a middle school. The Barron County Clerk of Courts Office dedicated its Christmas tree in the justice center to her. The tree was decorated with green bulbs and ribbons--green being the color often used to raise awareness for missing children. \"Jayme is safe' Jayme was discovered walking alone Thursday afternoon two counties to the north, outside the rural community of Gordon, authorities said. Her accused abductor--<mark>Jake Thomas</mark> Patterson, 21, of Gordon--was arrested shortly afterward, when a law enforcement officer pulled him over in a vehicle after neighbors called 911 to report Jayme's emergence, authorities said. Investigators now believe Patterson shot Jayme's parents and abducted Jayme, and that it appears he went there with the precise intention of taking the girl, Fitzgerald said. He'd apparently kept her inside his house for months. Authorities didn't say how she escaped or provide a motive. Fitzgerald finally was able to deliver a happy message at a news conference Friday, .\" For 88 days I have said we would work tirelessly to bring Jayme Closs home. We have done just that, \"he said .\" Jayme is safe. \"CNN's Faith Karimi, Jason Hanna, Meg Wagner, Brian Ries, Amanda Wills and Veronica Rocha contributed to this report."}, {"articleID": "2019041800_01020940_W", "names": {"Dave Davies": ["Q364890", "Q5228642"], "Danny Miller": ["Q1164698", "Q3015284", "Q3015285", "Q42823193", "Q5220627"]}, "date": "2019-04-17", "url": "https://www.kmuw.org/post/tiger-woods-biographer-says-golfers-masters-comeback-transcends-sports", "content": "Tiger Woods Biographer Says Golfer's Masters Comeback \"Transcends Sports' By <mark>Dave Davies</mark> • 4 hours ago Share Tweet Email Listen Listening.../ <mark>DAVE DAVIES</mark>, HOST: This is FRESH AIR. On the last hole of the Masters Golf Tournament Sunday, Tiger Woods made sports history when he stood over a two-foot putt on the 18th green. (SOUNDBITE OF ARCHIVED RECORDING) JIM NANTZ: Many doubted we'd ever see it, but here it is. (CHEERING) NANTZ: The return to glory. (CHEERING) <mark>DAVIES</mark>: Woods' fifth Masters title at age 43 followed a 10-year drought of major tournament victories and completed a remarkable comeback from a personal scandal that all but ruined his reputation and back surgery that left him unable to swing the club at all. For some perspective on Woods' career and his achievement, we turn to Jeff Benedict. He's the author, with Armen Keteyian, of a widely read biography published last year called\" Tiger Woods. \"It's now out in paperback. Well, Jeff Benedict, welcome to FRESH AIR. Tiger Woods dominated golf like nobody ever - like few people dominate anything, really. Give us a sense of how he was trained for this life and skill. How - you know, how young was he when he started learning golf? JEFF BENEDICT: I think it's fair to say Tiger was 2 years old when he really started to learn golf. He was 1 when he started watching his father play golf or practice golf in the garage. And that was a daily regimen, where he would sit there and watch his father putt. By the time he was 2, Tiger was putting and starting to practice and learn things with his dad. He was in golf all the time. By the time Tiger's 12 or 13, there's some really intense training going on that goes beyond what most parents would deem appropriate. Earl would do things like - they were demeaning. I mean, he would call Tiger very demeaning names, names that I can't use on the air. It was an attempt to put him down or break him down in a mental way and an emotional way while Tiger was practicing. It was intended to toughen him and really prepare him for what was ahead. They had a code word between the two of them. The word was enough. And Tiger was to use that word if his father ever pushed him too far. He never used that word. <mark>DAVIES</mark>: His dad, Earl, was African-American. His mom, Kultida, was Thai. And Earl would sometimes yell racial epithets at Tiger. Was that to prepare him for a racist world that he would encounter? BENEDICT: I think part of the reason he used those epithets was because Earl had a really good understanding of where his son was going. He knew that where Tiger was going was the country club set. When he was a young boy and a teenager - Tiger, that is - Earl was constantly looking for ways to help his son beat the country club kids who had all the advantages of wealth and socioeconomic status. And so part of that, those racial epithets - yeah, he - that's part of what's factored into it. Tiger would be competing on golf courses as a teenager where there were no kids of color. There were no parents of color. There was just nobody of color at these clubs. And then this boy would walk out onto the course, and all eyes would be on him because he was - not only did he look differently than everybody else, but he was so much better than everybody else. And there's a tremendous amount of pressure - emotional pressure that comes with that. And Earl was trying to put a shield or forcefield around his son that would enable him to cope with that when he reached the PGA tour. <mark>DAVIES</mark>: When he joined the PGA Tour - there are a lot of ways to measure this - how good was he? BENEDICT: He arrives like a comet. I mean, if you think about it, in 1997, he hasn't been on the tour for a year yet, and he goes to the Masters and wins by a record margin. I mean, you're talking about a boy basically, right? He's just come out of college as a sophomore. And he doesn't just win the Masters. He trashes the Masters. He completely annihilates the field. His driving distance off the tee is so much farther than everybody else. It's a bit like watching a bionic man hit a golf ball. And everybody's watching this going, this is the future. I mean, this kid's just got here. You're - everybody's playing for second place. I mean, he - that's how he arrived. <mark>DAVIES</mark>: You know, I read in your book about that Masters in which he made history by setting course records and tournament records that - you know, a major golf tournament is 72 holes. The first nine holes, he played horribly. He would have been sent home except he turned it around after nine and refocused. This is remarkable. BENEDICT: It is, and I think that that's one of the reasons that to this day, Tiger Woods gives tremendous credit to his father. There is a bond between them. There's a reason for that iconic moment at the end of that Masters where Earl and Tiger are embracing and crying into each other's shoulders and expressing, I love you to each other. It's - that was sort of the culmination of the 18 years of grinding, driving training between Earl and Tiger. And it paid off with that Masters. It's - that's the role really of Earl that you saw come out in Tiger. He was there for that Masters. And frankly, he shouldn't have been because Earl was ill, and he was - his doctor advised him not to go. But he went, and he had a role in helping Tiger turn it around mentally. <mark>DAVIES</mark>: Tiger Woods had a remarkable career as a professional. I want to talk about, though, what his body went through. It's interesting, you know? You see some golfers - and I play the game a little. And you see some golfers who have a nice, relaxed swing, and the ball just takes off like a rocket. But Tiger didn't. I mean, every time he swung a club, even one of the shorter clubs, it was just an explosion of impact. Tell us a bit about what his body went through and the toll that it took on him - all the practice and play. BENEDICT: I think that the best way to describe or differentiate Tiger's - not only his swing but his approach to golf is this - that when he first joined the PGA Tour in' 96, the adjective that was used to describe his swing was violent. Violent is not a word you typically associate with golf. I mean, that's a word for football or boxing. But Earl was all about weaponizing his son. When Tiger struck the ball, it was like an explosion. His high school girlfriend told us that the first time she witnessed Tiger drive a ball at a driving range, it felt and sounded like a rocket taking off. Now, over time, his swing coach Butch Harmon was concerned that that violent torque of a swing on his back was going to have some negative consequences. They were actually trying early on to tone it down. Even his youth instructor was trying to get him to not swing so hard and so violently. But on the other hand, that was part of who he was and part of what made him great. But it did take a toll. <mark>DAVIES</mark>: And he finally got - what? - spinal fusion surgery. What does that mean? What did it mean for him? BENEDICT: The fourth and final back surgery that Tiger Woods had was a spinal fusion surgery. And, you know, there was a lot of question as to whether that would work, whether he'd be able to return. Most experts and prognosticators predicted that he would never play again. The thing is, as you - everybody underestimates who this man is and how this man was made. And I'm talking more now about - not about how he was built physically, but I'm talking about how he was built mentally. And there's things like determination and grit that Tiger possesses and to a degree that I think really separates him from everybody else. And I don't just mean the other golfers on the PGA tour. I'm talking about athletes in general. He's a rare world-class athlete that has grit and determination and a pain threshold that just - it's unlike any athlete that I've seen or written about. <mark>DAVIES</mark>: Jeff Benedict is the author with Armen Keteyian of the book\" Tiger Woods. \"It's now out in paperback. We'll continue our conversation after a short break. This is FRESH AIR. (SOUNDBITE OF MUSIC) <mark>DAVIES</mark>: This is FRESH AIR, and we're speaking with Jeff Benedict. He is the author with Armen Keteyian of the biography\" Tiger Woods, \"which is now out in paperback. His marriage exploded in a scandal in 2009 - turned out he'd had multiple extramarital affairs. And in general, it's fair to say looking at this biography that he's - was in many ways not the most admirable person. I will say I'd give some slack to people who get fame and wealth at a very young age. I mean, a lot of us do stupid things when we're young, and we just don't have the means and the attention for them to be so noticed. How much has he changed? What's your sense of that? Is he different towards other players, fans, other relationships? BENEDICT: I think he's evolved. He's evolved a lot over time. He's in his 40s now. He's been through more than - it's hard to actually find someone on the planet that's been through things comparable to Tiger because of the fame he had. So when he made the mistakes that he made, we all watched them in real time. And it was a colossal fall from grace. He was mimicked. He was mocked. He was criticized. He was made fun of. He was the butt of jokes on late night television. Where I think this changed was the way he dealt with that. I've never seen a public figure respond to controversy the way he did. He faced the cameras. He answered the tough questions. He didn't run and hide. He took it, and he took it in a way that I think impressed people. People might not have been impressed with what he did, but the way he responded to it, I think, was the beginning of a change. And then you had that 10-year period from 2009 when he had the car accident until 10 years later where he was - went through all the injuries. And now what you're seeing is he's a father with children. He's a super dedicated dad. He's got his career back. He thought he'd never play again. Now he's playing again. He's got his health back and his mobility. And I think he looks at everything differently. He looks at the game differently. He looks at life differently. You can see it. There's a genuineness to the way he is engaged with people now. This is not an act. It's not the nasty thing you saw 15 years ago when he was at the pinnacle of his game. What you're seeing now is a guy, I think, who loves what he's doing. To me, that potentially makes him more dangerous. As long as he stays healthy, he could be really hard to beat over the next few years. <mark>DAVIES</mark>: So what he did last weekend, winning the Masters at age 43 after debilitating surgery and his - you know, the blow-up of his career - how big is this in the annals of sports? BENEDICT: It could very well go down as the greatest comeback in the history of sports. What he came back from is unprecedented because of just how far he'd fallen. This wasn't just, you know, a decent golfer who had some public humiliation. This was the greatest golfer of all time. This was one of the greatest athletes in history who had an incredibly precipitous fall that took him right out of the game. It turned his life upside down. And we all watched it. And then it culminated with a series of injuries that took him out of the sport entirely. People didn't expect him to ever play again, let alone come back and do something like win the Masters. The reason it's doubly great is because this is a comeback story that transcends sports. We all know what's happened to him in his private life because it played out so publicly. And so the message of Tiger's life, I think, has become, you know, just because you're down doesn't necessarily mean you're out. And that's a message that resonates with a lot of people who may not even care about golf or sports in general. I think that there's a lot of people that have watched this. And the reason they've been inspired by it is because they got introduced to him after the scandal. And that's when they realized, oh, this was the great golfer; look what's happened to him. And now they see that he's turned all that around, and he's gotten it back. <mark>DAVIES</mark>: Jeff Benedict, thanks so much for speaking with us. BENEDICT: Thank you. <mark>DAVIES</mark>: Jeff Benedict is the author with Armen Keteyian of the 2018 book\" Tiger Woods. \"It's now out in paperback. It's baseball season, and on tomorrow's show, we learn about fastballs, curveballs, screwballs and spitballs from New York Times national baseball writer Tyler Kepner. He talked to hundreds of pitchers about what they throw and how they try to get a mental edge over the hitters they face. His new book is\" K: A History Of Baseball In Ten Pitches. \"Join us. (SOUNDBITE OF ANTONIO ADOLFO'S\" MILESTONES \") <mark>DAVIES</mark>: FRESH AIR's executive producer is <mark>Danny Miller</mark>. Our technical director and engineer is Audrey Bentham. Our associate producer for digital media is Molly Seavy-Nesper. Thea Chaloner directed today's show. For Terry Gross, I'm <mark>Dave Davies</mark>. (SOUNDBITE OF ANTONIO ADOLFO'S\" MILESTONES \") Transcript provided by NPR, Copyright NPR. Share Tweet Email"}, {"articleID": "2014082905_00063317_W", "names": {"Pat Flynn": ["Q10421241", "Q16151718", "Q25189248"]}, "date": "2014-08-28", "url": "http://www.business2community.com/brandviews/getapp/seven-apps-help-profitably-extend-automate-sales-process-0990205", "content": "5 Reasons Mark Cuban's Cyber Dust App Is The Future Of Mobile Marketing Why You Shouldn't Give Your Social Media Audience the Content They Want Google's New Pigeon Algorithm: What Local Businesses Need to Know Discover The Power Within You: Storytelling and Content Marketing Seven Apps to Help You Profitably Extend and Automate Your Sales Process Your sales process calls for more steps than you might think. Australian media guru and entrepreneur extraordinaire, James Tuckerman, describes in one of his courses how most businesses are under the false impression that online selling is a two-step process: a product and a shopping cart. But the modern online sales loop is a whole lot more than just those two things. a seven-step sales process that involves multiple pages to keep customers moving through your sales funnel - by extending it. Without giving away all of James' secret recipe ingredients, we can tell you that you're going to need some apps to fill-in your sales process - regardless of exactly how many steps you use. You've seen working examples of the multi-step online sales process already. Anytime you've seen a success page, following behind an action taken on a landing page, you've been inside an automated sales process. The number of success pages you add to the process will depend on how many offers your poised to make, of course. But once you start getting creative with adding steps to your online selling routine, the possibilities become abundantly clear. Here at GetApp, we specialize in connecting you with the apps that will get the job done, whatever the job may be. If you're interested in extending your sales process to rake in more conversions, you'll need to get familiar with these tools for automating your sales funnel. \"Free Webcast: Build Better Products by Identifying and Validating Your Riskiest Assumptions Oracle CPQ Cloud From start to finish, there are various stages in the sales funnel, perhaps better called sales lifecyle if it keeps on going, as it should. Oracle CPQ Cloud as its name suggests takes care of configure, price and quoting. Producing sales quotes and business proposals are often the thing that has small businesses procrastinating the most. Oracle works to improve the customer experience and sales process, all by full automating your sales order process from anywhere in the world and on your desk, your iPad, Android or iPhone. Features of Oracle CPQ Cloud: Guided sales process Proposal software; contract creation Upsell and cross-sell recommendations Partnership management Cataloging Branded sales document creation Extensive integrations with enterprise resource planning software (ERP) All with defined and refined user permissions Oracle CPQ Cloud is idiot-proof making sure both you and your customers can find the right products, services and prices to include in proposals, contracts and purchase orders, cutting down on that back and forth. We love that not only does Oracle make your sales processes more effective, but that they then give you the analytics to measure the success. MemberMouse At some point, you're going to want more than simply\" subscribers. \"Sooner or later, you're going to want\" members \"- semi-autonomous ambassadors who, as a\" collective, \"bring your business to life. MemberMouse works inside WordPress (if that's a problem, see the next entrant on this list). MemberMouse is capable of fielding memberships from any size audience. It lets you accept payments, manage customers, and deploy premium content with ease. Features of MemberMouse: Sell Memberships and Subscriptions Password Protected Member's Area WordPress Integration Customer Management No Programming Required Authorize.net and PayPal Integrations Time-Release / Drip Content Sell One-Off and Recurring Digital and Physical Products What's most compelling (to us) about MemberMouse is its scalability. MemberMouse is a value part of your sales process, and it's been designed from-the-ground-up to grow along with your subscribers. That makes MemberMouse particularly interesting for upstart content creators. aMember Pro is a professional alternative to MemberMouse (or perhaps, MemberMouse is the\" alternative \"to aMember Pro). At any rate, aMember Pro is a membership and subscription management app that integrates with your existing website. In your sales automation loop, aMember serves the same purpose as MemberMouse, though in addition to having WordPress integration, you can use aMember with other platforms, like XenForo, vBulletin, and plain old HTML, among others. aMember offers full Web-based administration, payment systems via PayPal, ClickBank and others, and a smattering of creative protection schemes for files, folders and blog posts. Features of aMember Pro: Accept Subscription Payments Manage Customer Profiles Deliver Digital Content Integrate with Your Blog, Forum, or CMS Send Opt-In Newsletters Affiliate Program Integration One of the coolest features of aMember, though, is the fully-automated affiliate program built right into it, which makes it easy to incentivize your customers to become your sales force! Salesformics With a slogan like\" as easy as a search engine, \"you can't go wrong with Scalable customer relationship management software Sales and marketing automation Segment marketing Intuitive Unlimited leads, contacts Instant feedback Salesformics prides itself on setting the standard of security that should provide comfort for both your and your clients that their information is secure. SimplyCast consolidates some of the most advanced marketing elements you can add to your sales process, all under one roof (so to speak!). SimplyCast's robust toolset includes everything you need to get started extending your sales process, including landing page creation, email marketing, and social media marketing. To that, the app adds novel selling tools like surveys and A/B split testing. Features of Simply Cast: Email Marketing Survey Marketing Event Marketing SMS Marketing Social Media Marketing Autoresponder Marketing Form Builder Blacklist Monitoring A/B Split Testing List Management SimplyCast is something of a marketing Swiss Army knife. You really can't go wrong adding it to your arsenal. In fact, you could very well get started with sales automation with just SimplyCast, a membership management app like aMember Pro, and a good customer relationship management (CRM) app. Insightly. Insightly is a CRM app that helps bridge the automated world of your sales process with you (and your team). No matter how much you put your sales processes on autopilot, you can't negate the need for human interaction in sales. Insightly keeps track of your customers and your interactions with them. With tight email integration, you can instantly respond to specific inquiries from customers in situations where automated replies just won't do. Features of Insightly: Email integration with GMail Automatic Address Book Fast Search of everything you've stored Customer Relationship Management Track Opportunities/Pipelines Project Management Tasks and Milestones Mobile App As leads funnel through your sales process, you generate a great deal of customer data. Insightly helps you make the most of that data, and it helps you keeps the sales process going. AWeber An important part of any automated sales loop is an email marketing tool. AWeber focuses on helping businesses of all sizes, from freelancers to large enterprises and all thing in between, stay in contact with their audiences. Aweber is also the top email marketing app of choice for SmartPassiveIncome.com's <mark>Pat Flynn</mark>, who calls it\" The Internet's most powerful email opt-in service and email marketing/broadcasting tool. \"AWeber fits into your sales process because it helps you stage automated responses to incoming subscribers. AWeber has all the tools you need to make your email messages more personal for your audience, which is the key to keeping your automated responses from readily becoming\" spam. \"Features of AWeber: Opt-In Email Marketing Follow up Autoresponder Manage Subscribers Email deliverability tracking HTML email templates Email Blog Articles AWeber is the most popular alternative to Mailchimp, of course. Both are great tools, and worth comparing side-by-side, along with ExactTarget. How do YOU Automate your Sales Process? An automated sales process is one of those perpetual work-in-progress aspects of doing business online. There's always a new tool out there, always some new step to add to the sales process. When you get one step making money for you, you inevitability find some reason to tack on one more. GetApp RSS Feed GetApp is a Business Apps Marketplace that helps Small and Medium Businesses (SMBs), to discover, compare and review Email [will not be published] [required] Giant Fish Eats Shark Right Off Fisherman's Line, Video Goes Viral 5 Reasons Mark Cuban's Cyber Dust App Is The Future Of Mobile Marketing The 6 Step Social Media Marketing Strategy Plan For Your Business Soaked in Success: Behind the Marketing Strategy of the Ice Bucket Challenge for ALS How To Integrate Social Media Into Your Email Marketing Campaigns B2C was named a Most Updated Business Content MVP by Digital Talent Agents"}, {"articleID": "2013010823_00015429_W", "names": {"Marvell Wynne": ["Q1659635", "Q516404"], "Katherine Webb": ["Q16333774", "Q6376571"], "Richard Sherman": ["Q16205086", "Q2947411"]}, "date": "2013-01-08", "url": "http://us.rd.yahoo.com/sports/rss/mls/SIG=12kg4j4hk/*http%3A//sports.yahoo.com/news/rapids-sign-defender-wynne-deal-223600162--mls.html", "content": "colorado rapids, the club made sure to keep a big part of its defense the same heading into the 2013 season. <mark>marvell wynne</mark> to a new contract tuesday, the terms of which were not disclosed per league and club policy. omar cummings and are said to be shopping veteran midfielder jeff larentowicz, made sure to keep hold of the 26-year-old <mark>wynne</mark>, a versatile defender known for his pace. a former no. 1 overall pick in the mls superdraft, <mark>wynne</mark> has been with the rapids since 2010 and was a part of its mls cup-winning squad that season. <mark>wynne</mark> has also been a part of the u.s. national team set-up in the past, collecting five caps. \"<mark>marvell</mark> has proven himself to be an important part of our core group as we move forward, and we're pleased to have signed him to a new deal,\" rapids technical director paul bravo said in a team release. \"his speed and versatility make him an asset to our defense, and he continues to develop as a player every year .\" commerce city, colo. (ap)--the colorado rapids have traded forward omar cummings to the houston dynamo? rapids re-sign goaltender ceus commerce city, colo. (ap)--the colorado rapids have re-signed 25-year-old goalkeeper steward ceus,? not you? log out of facebook how to remove this experience brent musburger, 73, livens up the first half of bcs title game with comments on aj mccarron's girlfriend? aj mccarron, girlfriend <mark>katherine webb</mark> enjoying limelight after fixation sparks internet fervor alabama routs notre dame for yet another bcs title under nick saban aj mccarron feeling it as he starts settling twitter scores about his girlfriend seattle's <mark>richard sherman</mark> sends the redskins into the offseason with a scuffle and a wave alabama qb aj mccarron and center barrett jones have a little spat on the field in a blowout (video)"}, {"articleID": "2020012920_00535647_W", "names": {"John Bolton": ["Q24676423", "Q3079582", "Q311269", "Q53578866", "Q6222404", "Q6222406"], "John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"], "Susan Collins": ["Q22279", "Q7647692"]}, "date": "2020-01-29", "url": "http://www.adn.com/nation-world/2020/01/29/trump-impeachment-trial-gets-more-pointed-with-bolton-book-at-the-center/", "content": "Trump impeachment trial gets more pointed with <mark>Bolton</mark> book at the center Author: Lisa Mascaro, Eric Tucker, Zeke Miller, Associated Press Updated: 3 minutes ago Published 3 minutes ago In this image from video, the Senate chamber during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Tuesday, Jan. 28, 2020. (Senate Television via AP) In this image from video, the Senate chamber during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Tuesday, Jan. 28, 2020. (Senate Television via AP) Share on Facebook Share on Twitter Share via Email Share on Tumblr Share on Reddit Share on LinkedIn Share on Google Plus Print article WASHINGTON--President Donald Trump's impeachment trial shifted to sharply pointed, back-and-forth questioning Wednesday as Republicans strained to contain the fallout over <mark>John Bolton</mark>'s forthcoming book, which threatens their hopes of ending the trial with a quick acquittal. The day started simply enough. Three Republican senators asked Trump's legal team: If there was more than one motive for Trump's conduct in Ukraine, as he pushed for political investigations of Joe Biden, should the Senate still consider the Biden pressure an abuse of power? White House lawyer Pat Philbin responded there's nothing wrong with the president acting on a personal as well as national interest. He declared the charge against Trump \"absurd .\" But Democrats quickly interjected the <mark>Bolton</mark> question that has been hanging over the trial after the contention by Trump's former national security adviser that he personally heard the president say he wanted military aid withheld from Ukraine until it agreed to investigate Biden, his son and a debunked theory that Ukraine, not Russia, interfered in the 2016 U.S. election. Democratic Leader Chuck Schumer asked whether the Senate could really render a fair verdict without calling <mark>Bolton</mark> or acting White House Chief of Staff Mick Mulvaney to testify. \"There's no way to have a fair trial without witnesses,\" responded Rep. Adam Schiff, the Democrat leading the prosecution for the House. \"Don't wait for the book. Don't wait 'til March 17, when it is in black and white to find out the answer to your question,\" Schiff told the Senate. That publication date is now in doubt. The White House on Wednesday released a letter to <mark>Bolton</mark>'s attorney objecting to \"significant amounts of classified information\" in the manuscript, including at the top secret level. The former national security adviser and his attorney have insisted that the book does not contain any classified information. The White House action could delay the book's publication if <mark>Bolton</mark> is forced to revise his draft. <mark>Bolton</mark> left the White House last September and says he resigned. Trump says he was fired. In this Sept. 30, 2019, file photo, former national security adviser <mark>John Bolton</mark> gestures while speakings at the Center for Strategic and International Studies in Washington. (AP Photo/Pablo Martinez Monsivais, File) In this Sept. 30, 2019, file photo, former national security adviser <mark>John Bolton</mark> gestures while speakings at the Center for Strategic and International Studies in Washington. (AP Photo/Pablo Martinez Monsivais, File) Wednesday's questions were expected to ping-pong in an hours-long debate, a last gasp at closing arguments from the House prosecutors and Trump's defense ahead of critical voting this week. Fielding the written questions, Chief Justice <mark>John Roberts</mark> asked them of Trump's accusers and defenders. Senate Majority Leader Mitch McConnell privately told senators he doesn't yet have the votes to brush back Democratic demands for witnesses now that revelations from <mark>Bolton</mark> have roiled the trial. [McConnell says he lacks votes to bar trial witnesses] Republican ideas for dealing with <mark>Bolton</mark> and his book were fizzling almost as soon as they arose--among them, a witness \"swap\" with Democrats or issuing a subpoena for <mark>Bolton</mark>'s manuscript. GOP senators are sternly warned by party leaders that calling <mark>Bolton</mark> as a witness could entangle the trial in lengthy legal battles and delay Trump's expected acquittal. Philbin made exactly that case in his response to Democrats' first question: \"This institution will effectively be paralyzed for months on end,\" he said. In this image from video, Senate Majority Leader Mitch McConnell, R-Ky ., speaks during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Wednesday, Jan. 29, 2020. (Senate Television via AP) In this image from video, Senate Majority Leader Mitch McConnell, R-Ky ., speaks during the impeachment trial against President Donald Trump in the Senate at the U.S. Capitol in Washington, Wednesday, Jan. 29, 2020. (Senate Television via AP) Republican Sen. <mark>Susan Collins</mark> of Maine tried to give fresh momentum to a one-for-one witness deal saying it's \"very important that there be fairness, that each side be able to select a witness or two .\" But Democrats dismissed those offers, especially as Republicans want to draw Joe Biden's son, Hunter, deeper into the proceedings. \"It's irrelevant. It's a distraction,\" said Schumer. <mark>Bolton</mark> writes in a forthcoming book that Trump told him he wanted to withhold military aid from Ukraine until it helped with investigations into Democratic rival Joe Biden. That assertion, if true, would undercut a key defense argument and go to the heart of one of the two articles of impeachment against the president. \"I think <mark>Bolton</mark> probably has something to offer us,\" said Sen. Lisa Murkowski, R-Alaska. She met privately Wednesday with McConnell. Trump disagreed in a tweet Wednesday in which he complained that <mark>Bolton</mark>, after he left the White House, \"goes out and IMMEDIATELY writes a nasty & untrue book. All Classified National Security .\" The uncertainty about witnesses arises days before crucial votes on the issue. In a Senate split 53-47 in favor of Republicans, at least four GOP senators must join all Democrats to reach the 51 votes required to call witnesses, decide whom to call or do nearly anything else in the trial. Several Republicans apparently are ready to join Democrats in calling witnesses. One Democrat, the centrist Sen. Joe Manchin of West Virginia, said he wouldn't have a problem hearing from Hunter Biden, who was on the board of a Ukrainian gas company, but doubted it will happen. Most Republican senators don't want to call <mark>Bolton</mark> and most Democrats would rather avoid dragging the Bidens further into the impeachment proceedings. The Bidens were a focus of defense arguments though no evidence of wrongdoing has emerged. One person watching from the sidelines Wednesday was Lev Parnas, the indicted associate of Trump lawyer Rudy Giuliani, who arrived at the Capitol saying, \"I want to testify .\" Parnas, who has turned over evidence for the proceedings, cannot enter the Senate with his court-ordered electronic-tracking device. The two days set aside for questions, Wednesday and Thursday, also allow each side more time to win over any undecided senators pondering the witness issue. In the meantime, all will have the opportunity to grill both the House Democrats prosecuting the case and the Republican president's defense team. Trump faces charges from Democrats that he abused his power like no other president, jeopardizing Ukraine and U.S.-Ukraine relations by using the military aid as leverage while the vulnerable ally battled Russia. The second article of impeachment says Trump then obstructed the House probe in a way that threatened the nation's three-branch system of checks and balances. The president's legal team tried to lock up its case Tuesday and convince GOP senators that the president was right to ask Ukraine for investigations of Biden and his son Hunter and was well within his power to block the aid. They said he was not bound to abide by the congressional investigation. Trump attorney Jay Sekulow addressed the <mark>Bolton</mark> controversy head-on in closing arguments by dismissing the former national security adviser's manuscript as \"inadmissible .\" Attorney Alan Dershowitz, the Harvard scholar, said earlier that even if <mark>Bolton</mark>'s story is true the actions don't rise to an impeachable offense. Senate Republicans spent considerable time in private discussing how to deal with <mark>Bolton</mark>'s manuscript without extending the proceedings or jeopardizing the president's expected acquittal. They were set to meet privately again Wednesday. Some Republicans including Sen. Pat Toomey want reciprocity--bringing in <mark>Bolton</mark> or another Democratic witness in exchange for one from the GOP side. It's an idea initially pushed by conservative Sens. Ted Cruz and Mike Braun, separate from the centrists whose votes are in doubt. Some Republicans want to hear from Biden and his son, who was on the board of the Ukrainian gas company when his father was vice president. Trump and his lawyers have argued repeatedly that Democrats are using impeachment to try to undo the results of the last presidential election and drive Trump from office. Democrats, meanwhile, say Trump's refusal to allow administration officials to testify only reinforces that the White House is hiding evidence. The White House has had <mark>Bolton</mark>'s manuscript for about a month, according to a letter from <mark>Bolton</mark>'s attorney. ___ Associated Press writers Alan Fram, Mary Clare Jalonick, Andrew Taylor, Matthew Daly, Laurie Kellman and Padmananda Rama contributed to this report."}]