[{"date": "2013-11-25", "url": "http://southtownstar.suntimes.com/sports/23932871-419/disabato-marian-catholic-starts-boys-basketball-season-no-1-in-southtownstar.html", "content": "Disabato: Marian Catholic starts boys basketball season No. 1 in SouthtownStar storyidforme: 58254522 tmspicid: 21250567 fileheaderid: 9973726 I could attempt to appease more readers and claim there were as many as a half-dozen teams in the running for the No. 1 spot in the SouthtownStar's Boys Basketball Preseason Top 10. That would be stretching the truth. It was a three-team race, and each, in its own way, had the means to earn top honors. It came down to defending Class 3A state champion Morgan Park, reigning Catholic League South champion St. Rita and Marian Catholic, fresh off a record-setting season in 2012-13. So why Morgan Park? The Mustangs boast a pair of 6-foot-7 forwards in Josh Cunningham and Lamont Walker and a dynamic, young point guard in sophomore <mark>Charlie Moore</mark>. Why St. Rita? Well, there's Vic Law, a 6-7 Northwestern recruit, junior <mark>Charles Matthews</mark>, regarded as one of the top prospects in the Class of 2015, and senior Dominique <mark>Matthews</mark>, who averaged 16 points per game a year ago. Why Marian? Well, the Spartans return their entire starting lineup from a team that won a school-record 29 games and advanced to its first Elite Eight, led by all-world point guard Tyler Ulis, a Kentucky recruit. Selecting the best among the three was like judging a beauty pageant between the Victoria Secret Angels. While I believe St. Rita, from top to bottom, with three bona fide Division I players, is the most talented squad in the Southland, talent alone doesn't guarantee success. That's why Marian Catholic will begin the season as No. 1. Of course, the Spartans are talented. Ulis is the best player in the area, and I believe the seasoned, experienced supporting cast of Ki-jana Crawford, Josh Cohn, Terrone Parham and <mark>John Oliver</mark> will be even better this season. Here's what sets Marian apart: The Spartans realize Ulis is the star of the show and are willing to play Robin to his Batman. Ulis, in turn, is just as pleased to register the assist on a game-winning shot as he is burying a buzzer-beater. In other words, egos are checked at the door. That's as much a compliment to the players as it is to coach <mark>Mike Taylor</mark> and his staff. Beginning his 11th season, <mark>Taylor</mark> has taken the program from the outhouse to the penthouse. \"We're very proud to be No. 1,\" <mark>Taylor</mark> said. \"We have a great appreciation for south suburban basketball. We were never mentioned in the same sentence before with Bloom, H-F, Hillcrest, Thornton and Thornwood. Now, we are .\" Marian was able to fly under the radar for most of the first-half of last season. That won't be the case beginning Monday vs. T.F. South. The Spartans better have a solid jaw, because every opponent is going to give them their best shot. \"I think the kids think they're ready for it,\" <mark>Taylor</mark> said. \"I don't think they realize how hard everyone is going to come at them. Our whole group is going to have to stand up .\" The one area concern for the Spartans is a lack of size. Parham, at 6-7, is their tallest player. \"We're not much different than last year; we're better in a lot of ways,\" <mark>Taylor</mark> said. \"But we haven't gotten any bigger .\" Ulis has gotten noticeably stronger, according to <mark>Taylor</mark>, and that should scare the daylights out of opponents. <mark>Taylor</mark> also said <mark>Oliver</mark> and Cohn have improved their games big time. Now it's time to go out and live up to expectations. \"It's going to be a battle every night,\" <mark>Taylor</mark> said. \"I've told them,' I don't want your season to be defined by one game. Celebrate this year, celebrate each other, celebrate what you've accomplished. '", "articleID": "2013112510_00027505_W", "names": {"Mike Taylor": ["Q1394224", "Q14951476", "Q17011025", "Q172604", "Q1933556", "Q19666430", "Q22108039", "Q24006988", "Q38917715", "Q6849017", "Q6849018", "Q6849019", "Q6849020", "Q8134165"]}}, {"date": "2013-11-26", "url": "http://www.istockanalyst.com/article/viewarticle/articleid/6666163", "content": "i On The Market - Daily Newsletter Every trading day, be ready to attack the market instead of reacting to the market. You will know where the key technical resistance and support levels are and what the market is likely to do next. iStock will arm you with a target list of stocks to buy and sell - right now - based on our exclusive, proprietary trading models. Invitae Responds to Myriad Genetics Lawsuit Tuesday, November 26, 2013 5:05 PM Invitae Responds to Myriad Genetics Lawsuit Invitae Corporation, a genetic diagnostics company, today announced that it plans to defend its right to provide naturally occurring genetic information and services to physicians for their cancer patients through its genetic testing services. Invitae has been named a defendant in a lawsuit filed by Myriad Genetics, Inc. regarding Invitae's BRCA and MUTYH genetic tests. Invitae disagrees with the allegations of the lawsuit and plans to vigorously defend itself against the lawsuit, which it believes has no merit. Earlier this year, the Supreme Court ruled that naturally occurring DNA and the information it encodes cannot be patented (Assn 'n for Molecular Pathology v. Myriad Genetics, Inc., 133 S. Ct. 2107 [2013]) and thus ushered in a new era of personalized medicine. This followed on a prior Supreme Court ruling establishing that naturally occurring biological correlations were not patentable subject matter (Mayo Collaborative Servs. v. Prometheus Labs ., Inc., 132 S. Ct. 1289 [2011]). The breast cancer community will benefit from these decisions with the introduction of multiple new diagnostic tests to analyze BRCA1 and BRCA2 mutations, increasing the availability and options for patients and physicians. Invitae and its collaborators recently presented results at scientific conferences demonstrating the validity of next generation DNA sequencing technology to accurately identify pathogenic variants in a variety of cancer genes including BRCA1 and 2. Invitae's mission is to reinvent genetic testing by making it more affordable and accessible than ever before. The company's goal is to bring multi-use genetic testing into routine medical practice. Invitae offers full gene sequencing for both BRCA1 and BRCA2 with deletion and duplication analysis to physicians with the ability to upgrade to a larger hereditary cancer syndromes panel of 27 genes--all for just $1,500. \"The issue of DNA patents goes far beyond BRCA testing,\" said <mark>Randy Scott</mark>, co-founder of Invitae. \"Our company was founded around the core belief that every individual has the right to self-knowledge (meaning they have a right to know their own DNA sequence information), and we believe that the Supreme Court rulings validate our view that no company can claim ownership over naturally occurring genetic information .\" Dr. <mark>Scott</mark> continued, \"Today, clinically-observed genetic variants are often held in proprietary databases, restricting their access by the medical community. By broadening access and sharing genetic information, we can collectively harness the power of the genome to improve our understanding of disease and improve healthcare for everyone. Providing broad access to genetic testing will allow the medical community to collectively diagnose disease better, faster and cheaper; offer patients more effective healthcare and reduce costs to the healthcare system .\" Commitment to Sharing Genetic Information: Invitae Supports the Free the Data! Initiative The Free the Data! initiative is a grassroots patient and physician movement to build an open access database to enable the interpretation and diagnosis of clinical variants, including BRCA1 and BRCA2 mutations. The goal of Free the Data! is to fill the public information gap caused by the lack of available genetic information for the BRCA1 and BRCA2 genes with plans to expand to provide other types of genetic information in open, searchable databases, including the National Center for Biotechnology Information's database, ClinVar. Free the Data! invites individuals to share their genetic variation safely, securely and with appropriate privacy settings, in a public database. The medical and scientific community can then access this collective data to accelerate our understanding of genetic disease, find new therapies and eventually prevent disease. Please visit www.free-the-data.org or contact 202.966.5557 x201 for more information about Free the Data! Invitae is a founding member of the Free The Data! Coalition. Other coalition members include Genetic Alliance, UCSF, Facing Our Risk of Cancer Empowered (FORCE), a group of patient advocates, Partners Healthcare & ICCG, GeneDX, amongst others. About Invitae Corporation Specializing in genetic diagnostics for hereditary disorders, Invitae's mission is to make multi-use genetic testing more accessible and affordable than ever before. The company is pursuing a strategy over the next several years to aggregate all the world's medical genetic tests (> 3,000 known Mendelian conditions) into a single assay at a lower cost than most single gene tests today. This capability is increasingly enabled by the rapid advancements in DNA sequencing technology. Invitae hopes to lead the way from an era of genetic scarcity to genetic abundance to significantly improve healthcare worldwide. Huntsman Corporation (HUN): Needs A Perfect Trip To Hit Goldman'S $29 Salesforce.com, Inc. (CRM): Well-Positioned To Capitalize Emerging Mobile Opportunity Time Warner Cable Inc (TWC): Who Could Buy TWC--Charter Or Comcast? VIQ Solutions' Subsidiary Awarded Contract by Australian Capital Territory GNC Holdings, Inc.. Announces $500 million Share Repurchase Authorization, Term Loan increase and repricing Tesla Motors Inc (TSLA): How Tesla Fares Against Upcoming Electric Cars 3D Systems Corporation (DDD): A 3T Look At 3D - D? j? Vu All Over Again? Zacks Investment Research, and Commentary, news and Press Releases provided by YellowBrix and Quotemedia. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. iStockAnalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. The blog articles are opinions by respective blogger. By using this site you are agreeing to terms and conditions posted on respective bloggers' website. The postings/comments on the site may or may not be from reliable sources. Neither iStockAnalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. You are solely responsible for the investment decisions made by you and the consequences resulting therefrom. By accessing the iStockAnalyst.com site, you agree not to redistribute the information found therein.", "articleID": "2013112706_00024184_W", "names": {"Randy Scott": ["Q28421781", "Q7292422", "Q7292423"]}}, {"date": "2013-11-28", "url": "http://manilastandardtoday.com/2013/11/28/personalized-christmas-gifts-/", "content": "Avoid the rush, do your Christmas shopping early. \"At a time like this when our Visayan brothers are suffering from the death and tragedy wrought by Yolanda, some say that the usual color, fun and merriment on Christmastime must take a back seat. But I believe the Yuletide Season is for the children, especially those who still believe that Santa comes once a year to bring them cheer. So, why disappoint the kids?\" says Gandang <mark>Ricky Reyes</mark> Todo Na Toh host <mark>Ricky Reyes</mark>. Tomorrow, 9 a.m. on GMA News TV, <mark>Reyes</mark> takes the audience to different places in Metro Manila and suburbs known for the beautiful decors and colorful lights. <mark>Reyes</mark> also shares tips where to order personalized items such as cups, glasses, mugs, ball pens, ashtrays in affordable prizes. A popular chef gives tips as well. \"Even simple and cheap dishes well cooked and deliciously concocted can make Noche Buena a feast fit for a family bonding,\" he says.", "articleID": "2013112820_00004394_W", "names": {"Ricky Reyes": ["Q16145690", "Q3935060"]}}, {"date": "2013-11-29", "url": "http://www.onenewspage.com/n/Celebrities/74w4fgdcq/Salman-Khan-and-Shahid-Kapoor-talk-about-their.htm", "content": "<mark>Salman Khan</mark> and Shahid Kapoor talk about their ex-girlfriends! Friday, 29 November 2013 (1 hour ago) <mark>Salman Khan</mark>, who at one stage used to date Katrina Kaif has once again spoken about her, \"Katrina and I are friends, were friends and will always be friends .\" Like [...] Shahid Kapoor: Priyanka Chopra and I will always be friends! Katrina Kaif, Kareena Kapoor Khan move on as Hrithik Roshan takes a break from films <mark>Salman Khan</mark> will talk about his personal life on \"Koffee With Karan'! After dating a Bollywood beauties like Aishwarya Rai, Katrina Kaif, Sangeeta Bijlani and Somi Ali, the Dabangg of Bollywood, <mark>Salman Khan</mark> is in search for a.. . Bollywood Celebden 3 days ago - Celebrities A Look Back at The Macy's THANKSGIVING Day Parades of Years Past\" NYC Housewife' Sonja Morgan Shares Her Last-Minute THANKSGIVING DAY This Disgusting MILEY CYRUS Turkey GIF Is Our Way of Saying \"Happy Thanksgiving!' HAPPY THANKSGIVING Weekend! Here's What Is New on Netflix Now Miley Cyrus beating EDWARD SNOWDEN, Pope in Time's Person of the Year poll The INTERNET doesn't want <mark>James Arthur</mark> anymore, Facebook group confirms it GALLERY: UNION J's JJ Hamblett and girlfriend Caterina Lopez's cutest pictures TAMERA FOSTER opens up about\" close' relationship with X Factor reject Sam Callahan. Now kiss! KISS. Ashish Rajvanshi Who is the best dancer in bollywood. .? 1. Hrithik Roshan 2. Shahid Kapoor 3. <mark>Salman Khan</mark> 4. Prabhudeva 5...http: //t.co/b45Rd2XouW @ stuntraviverma making it big in Bollywood with <mark>Salman Khan</mark>, Shah Rukh Khan & Shahid Kapoor projects. Best...http: //t.co/Vsgq1xcqSr Apni Aliya In love with Ranbir Kapoor's smile, Shahrukh Khan's dialogues, <mark>Salman Khan</mark>'s body, Shahid Kapoor's innocence, and your love Ashish Rajvanshi Who is the best dancer in bollywood. .? 1. Hrithik Roshan 2. Shahid Kapoor 3. <mark>Salman Khan</mark> 4. Prabhudeva 5...http: //t.co/kDSuPkZApN @ BeingSandesh_D nice to meet you sandesh!! see you're very fond of <mark>Salman Khan</mark>! I also love Shahid Kapoor Italian former prime minister Silvio Berlusconi expelled from parliament In defiance of a new Chinese air zone, US flies two B-52 bombers through it Discovery of ancient Buddhist shrine suggests earlier date for Buddha's birthday Xbox One sales surpass 1 million - but users report hardware problems China extends air defense zone over East China Sea covering islands also claimed by Japan", "articleID": "2013112915_00021825_W", "names": {"James Arthur": ["Q1679964", "Q16958479", "Q19324892", "Q56884626", "Q717626"], "Salman Khan": ["Q27923598", "Q471472", "Q57488138", "Q9543"]}}, {"date": "2013-11-29", "url": "http://www.indianexpress.com/news/dd-jain-girls-block-traffic-protest-against-rape/1201384/", "content": "During the protest near CMCH Chowk in Ludhiana on Friday. Gurmeet Singh Tehelka case LIVE: The lady is not normal, Tejpal's lawyer argues in court Tarun Tejpal is fighting to protect his wealth, I am fighting to preserve my integrity, says woman journalist They created a moral bubble, now their leader is exposed: Bangaru Laxman Uncertainty the story in Tehelka newsroom, Shoma says damaging time for all Hundreds of girls of Devki Devi Jain College on Friday came out of the college and blocked the main CMCH Chowk in protest against an alleged rape of a class VII girl at Atam Devki Niketan School located on the same campus. The girls shouted slogans of \"we want justice\" and protested against the alleged rape by the conductor of one of the school buses who had been dismissed by the management a few days back. However, the girls were not clear as to who the victim was. Interestingly, the girls came out of the college campus by forcibly opening the doors of the college. A few hundred girls came out while the rest remained inside as the college management soon locked the gates. The girls went to the nearby CMCH Chowk and blocked the traffic. The incident took everyone by surprise as normally such a reaction is not seen in girls' colleges of Ludhiana. The girls alleged that the matter was being suppressed and the victim and her family were not being given justice. The high drama continued for more than three hours outside and within the college campus. ADCP Nilambari Jagdale, who reached the spot along with other officers, said, \"We are investigating the case, but till now neither the victim nor her family has come before us with a formal complaint. We have no idea as who is the sufferer. The girls were protesting on mere rumours and even they were not clear as to who is the actual victim .\" In the morning, the girls met college principal Sarita Behl after they heard about this news. Later, they came out of the campus to protest. Photos: Ranbir, Kareena, Salman other celebs have \"Koffee with Karan' Photos: <mark>Big B</mark>, Rekha at Vishesh Bhatt's wedding IFS officer denies visa to spouse of gay American diplomat, moved out IFS officer denies visa to spouse of gay American diplomat, moved out They created a moral bubble, now their leader is exposed: Bangaru Laxman Firoz Fatma becomes first woman\" crorepati' of \"Kaun Banega Crorepati 7 '", "articleID": "2013113004_00060165_W", "names": {"Big B": ["Q4904960", "Q9570"]}}, {"date": "2013-11-29", "url": "http://commercialappeal.com/news/2013/nov/29/man-charged-fiery-ohio-crash-killed-couple/#comments?CID=happeningnow", "content": "FREMONT, Ohio (AP) - An Ohio motorist traveling at more than 125 mph was charged Friday with vehicular homicide after his car struck a minivan, killing a couple inside, the State Highway Patrol said. Andrew D. Gans, of Kent, faces two counts of vehicular homicide with a reckless specification after Thursday night's crash on the Ohio Turnpike, where both vehicles burst into flames. The victims, Wilbur and Margaret McCoy, both 77, of Toledo, were wearing seatbelts when they were hit and were trapped inside of the minivan, the patrol said. Gans, 24, suffered injuries that are not life-threatening and was hospitalized for psychiatric evaluation at a Toledo hospital, said staff Lt. Anne Ralston, a patrol spokeswoman. Gans has spoken with investigators, but Ralston declined to comment on what he said or whether he offered any explanation for the erratic driving that was reported. He will be taken to jail following his release from the hospital. No court date has been set and the case will go to a grand jury. The patrol said the incident remains under investigation. Two troopers separately spotted Gans' car but weren't able to catch or keep up with it before the crash near Fremont, about 40 miles southeast of Toledo, Ralston said. Other drivers began calling dispatchers about the speeding, weaving vehicle just before 7 p.m., about 20 minutes before it crashed into the back of the minivan. The driver covered roughly 60 miles in that time and passed two troopers, each of whom tried to pull behind the westbound car but lost sight of it as it sped away, Ralston said. \"Just because it was going so fast, we were never able to get into a position where we were actually engaged in a pursuit with it,\" Ralston said. \"We were simply trying to catch up and intercept this vehicle and get it stopped .\" The speeding vehicle stunned some holiday travelers who witnessed it. Josh Pickett of Toledo told The Toledo Blade that he was headed home from Thanksgiving dinner with relatives in Cleveland when the speeding driver passed him, followed about a minute later by a state police cruiser. \"I was going 76, and the guy passes me like I was standing still,\" Pickett told the newspaper. He said within a few minutes, traffic suddenly stopped \"and I saw really big flames .\" Ty Mahaffey told The Blade a car zoomed by him \"at an enormously high rate of speed ....I have never seen a passenger car going so fast .\" The Toledo resident said he was going around 80 mph \"and when he passed me, it was like I was going in reverse .\" He said afterward he had to pull over briefly to collect himself. Kyle Veazey: Ole Miss blew it, Dan Mullen and Dak Prescott won it, and Egg momentum shifts back Pastner confident Johnson will break out of early season shooting slump Published 11/26/2013 at 7:08 p.m. Wendi <mark>C. Thomas</mark>: Follow the story of Thanksgiving past the potluck to the Trail of Tears Lafayette's Music Room returning to Overton Square with live music, chef Chandler's menu Published 11/20/2013 at 9:35 a.m.. Some University of Memphis cuts revealed by Provost Rudd to faculty Senate Get Storm Shield, our new weather radio app for iPhone and Android!", "articleID": "2013113005_00014749_W", "names": {"C. Thomas": ["Q57413099", "Q57913032"]}}, {"date": "2013-12-03", "url": "http://news.ninemsn.com.au/sitecore/content/news/news/entertainment/2013/12/03/11/49/video-emerges-of-walker-fatal-crash", "content": "December 03, 2013: CCTV vision has been released showing the exact moment that <mark>Paul Walker</mark> and Roger Rodas were killed in a high speed crash, resulting in a huge explosion. The first video has emerged of the car accident that killed action movie star <mark>Paul Walker</mark> and his friend Roger Rodas. Civoniceva turns down tilt at Qld politics Australian nude pic suspect indicted in US Californian surfer freaked out about seal Rooftopping: the risky trend in photography The CCTV video posted online by TMZ, shows a street adjacent to the smash, with a massive ball of flames rising above the trees. Cars are seen moving to the side of the road as a massive black plume of smoke rises into the sky. Sources connected to Always Evolving, the garage co-owned by <mark>Walker</mark> and Porsche driver Roger Rodas told TMZ they observed \"evidence of a fluid burst and subsequent fluid trail before the skid marks at the accident scene\". They added that the absence of skid marks almost up to the point of impact suggested the driver was not in control of the car's steering. There were no cars immediately in front of or behind the car at the time of the crash, leading to speculation the Porsche may have been involved in a high-speed street race. December 01, 2013: Drivers that witnessed the burning wreck of the crashed Porsche, in which Hollywood actor <mark>Paul Walker</mark> tragically died, rushed to offer assistance and call an ambulance. Both Rodas and <mark>Walker</mark> were killed instantly in the accident in the Los Angeles suburb of Valencia. Rodas was driving at the time and it is believed that speed was a factor in the fatal smash. The likely cause of the failure that triggered the crash has been identified as a powering steering fluid leak. Hollywood heartthrob <mark>Walker</mark> had starred in six of seven of the Fast and the Furious films, including one that is yet to be released. The 40-year-old has also appeared in films like Pleasantville, She's All That and Varsity Blues. Police have now issued a warning to fans of <mark>Walker</mark> who have been pulling stunt manoeuvres and burn-outs near the accident site in tribute to the late actor. The father of late actor <mark>Paul Walker</mark> spoke to CBS about his famous son's sudden death. <mark>Walker</mark>'s girlfriend Jasmine Pilchard-Gosnell reportedly collapsed in shock after she found out about his death. The couple apparently started dating when he was 33 and she was 16. She is now being comforted by her mother, her uncle said. Ms Pilchard-Gosnell and <mark>Walker</mark>'s 15-year-old daughter, Meadow, were at the fundraiser, held by Reach Out Worldwide to raise money for the Philippines. An engineer at the charity said he received a phone call from his son at the scene of the crash relaying the tragic news. \"<mark>Paul</mark>'s girlfriend was standing next to me when I got the phone call,\" the engineer, Jim Thorp, told Hollywood Life. December 02, 2013: Witnesses have told how they were helpless to react to the fiery scene where actor <mark>Paul Walker</mark> and a driver crashed in their Porsche. \"When I told her what happened she fell, she collapsed .\" Also reportedly devastated in the crash is <mark>Walker</mark>'s ex-girlfriend Aubrianna Atwell, whose father died five days before the car accident. Author: Nick Pearson. Approving editor: Martin Zavan. Actor <mark>Paul Walker</mark> has been killed in a fiery car crash and explosion in Southern California. \\ n The 40 year-old was the passenger in his friend's Porsche when it veered off the road and slammed into a tree before exploding. \\ nBoth were pronounced dead at the scene. \\ nWalker will always be remembered for his role as Brian O'Conner in", "articleID": "2013120309_00006941_W", "names": {"Paul Walker": ["Q15287644", "Q16145846", "Q18218158", "Q20988066", "Q20988089", "Q213864", "Q57551242", "Q7154210", "Q7154213", "Q7154215", "Q7154216", "Q7154217"]}}, {"date": "2013-12-03", "url": "http://www.kamcity.com/namnews/asp/newsarticle.asp?newsid=73133", "content": "UK: Waitrose Serves Up \"Kid Friendly' Brussels Sprouts Waitrose has announced the launch of a\" kid friendly' version of Brussels Sprouts, aimed at getting children to eat more of the vegetable during Christmas. The variant is a sweeter variety of the sprout, and will be available for just two weeks, starting 3 December. The chain said it has been testing two kid-friendly versions with growers over the past year, adding that the final product does not have the traditionally bitter aftertaste of Brussels Sprouts. It added: \"In the tests we have done people definitely notice the sweetness coming through\". Waitrose noted: \"We're not saying where we got them from as we're worried that our rivals would simply copy us. We have bought up the entire UK supply of this new variety - two weeks supply\". Waitrose said the new variant is one of 15 types of sprouts the chain will sell this Christmas, including a \"red' variety. UK: <mark>John Lewis</mark> Looking To Develop Food Offer With New Shop Floor Concessions UK: Waitrose To Stock New House of Cuckoo Cupcake Boxes UK: Tesco Expected To Reveal Another Period Of Falling Sales UK: Frozen Foods And Online Driving Growth At Waitrose", "articleID": "2013120318_00085434_W", "names": {"John Lewis": ["Q14945660", "Q16227288", "Q18922034", "Q19565272", "Q19875174", "Q20733531", "Q20733533", "Q21462286", "Q21462293", "Q21518827", "Q28075578", "Q30611710", "Q45380", "Q51070193", "Q56597791", "Q56604623", "Q56678781", "Q58195543", "Q6244734", "Q6244736", "Q6244742", "Q6244753", "Q6244757", "Q6244759", "Q6244761", "Q6244764"]}}, {"date": "2013-12-05", "url": "http://www.sent-trib.com/youth-news/youth-briefs-12-05-13", "content": "Written by Sentinel-Tribune Staff Create a holiday craft Bowling Green Teen Central is hosting a Holiday Crafting event Saturday at Wintergarden/St. John's Nature Preserve from 3 to 6 p.m. Children ages 11 to 15 are invited to make holiday gifts. Stations will be set up to make a variety of projects for middle school aged children. As we make gifts for family members, participants will have the opportunity to make s'mores around the campfire. Parents do not have to be in attendance but children will need to signed in and out by a parent/guardian. Little ones can make holiday nature crafts earlier in the day Saturday at the nature preserve. Children ages 2.5 to 8 can visit from 9 to 10:30 a.m., 10:30 a.m. to noon and 1 to 2:30 p.m. Make a variety of nature crafts to decorate the house for the holiday season or give as gifts. Stations will be set up to make a variety of projects for preschool and early elementary age children. Register for one of three sessions. Take a break and watch the birds through the window on wildlife or sit by the fire and have a s \"more. Participants must be registered in advance with the Parks and Recreation Department. For more information about either program, contact parks and recreation at 419-354-6223. Hear a story with Santa Santa will visit the Wood County District Public Library and share songs and stories with families in the Children's Place on Saturday at 10:30 a.m. Children are invited to stay after to make a gift with Black Swamp Arts Festival Youth Arts. Parents are welcome to bring their cameras. Call 419-352-8253 with any questions. Celebrate the holidays with 577 Foundation classes PERRYSBURG - Children's music and art classes are being offered at the 577 Foundation at 577 E. Front St. Pre-registration is required for all classes at www.577foundation.org or (419)? 874-4174 .? Partners in Fun is an art class for 3 to 4 year olds with adult. The leader is Carol Jambard-Sweet and the limit is 14 per class. Classes are Tuesdays from 10 to 11 a.m.. The fee is $5 per child. Make decorations to celebrate the upcoming holidays in Tuesday's class. On Dec. 17, make a gingerbread house. A New Year celebration is planned for Dec. 31 .? Join a favorite 577 Foundation tradition by decorating a cookie and candy\" cabin in the woods \"for Christmas in the country. Pre-made cabins and all the fixings will be on hand. The leader is Hannah Lehmann. The class limit is 24 per session. There are two sessions on Saturday, from 9 to 10 a.m. and 11 a.m. to noon. The fee is $7. The gingerbread classes are for children ages 5 through high school. Watch\" The Best Christmas Pageant Ever' movie at library In anticipation of the upcoming Black Swamp Players' production of \"The Best Christmas Pageant Ever,\" the Wood County District Public Library Children's Place will show the movie adaptation of <mark>Barbara Robinson</mark>'s bestselling novel twice on Sunday. The first showing is at 1:30 p.m. and the second is at 3:30 p.m. Osborne books topic of \"Novel Chit Chats' discussion\" Novel Chit Chats, \"a book club for children and adults, will meet on Monday at 7 p.m. in the Wood County District Public Library Children's Place to discuss the Magic Tree House novel\" A Ghost Tale for Christmas Time, \"as well as its nonfiction companion,\" Rags and Riches, \"both by Mary Pope Osborne. Multiple copies are available at the Children's Place desk. For information, call 419-352-8253 .\" Pizza & Pages' meets Dec. 18 \"Pizza and Pages,\" the Bowling Green Middle School book club, will meet on Dec. 18 at 2:30 p.m. in the school's Media Center. The club is a partnership between the school and the Wood County District Public Library and is open to all area sixth through eighth-graders. The Children's Place at the library has multiple copies of the pre-selected books. The books are \"The Colossus Rises\" by Peter Lerangis, \"Savvy\" by Ingrid Law, \"Breadcrumbs\" by Anne Ursu, \"The Storm Makers\" by Jennifer E. Smith, \"Cinder\" by Marissa Meyer and \"Enchanted\" by Alethea Kontis. For more information, call the 419-352-8253. \"Bookaneers' goes to the dogs PERRYSBURG - The next meeting of the Bookaneers Book Club at Way Public Library will be Dec. 12 from 4 to 5 p.m.. The group will be discussing\" A Dog on His Own \"by Mary Jane Auch. Pick up a copy at the Youth Services Desk. This program is for children ages 7-10. For more information, contact Kinsey Zeisler, youth services librarian, at 419-874-3135, ext. 107. Attend an art adventure PERRYSBURG - Students in first through fifth grade are invited to attend two art workshops this month at Way Library. Holiday Art Adventures by Robin Ballmer is a workshop where participants can make assortment of decorative, wearable and giftable crafts. KAREN NADLER COTA Sentinel Lifestyles Editor MARIE THOMAS BAIRD Sentinel Education Editor", "articleID": "2013120523_00036747_W", "names": {"Barbara Robinson": ["Q21459416", "Q30122151", "Q807606"]}}]