[{"articleID": "2011022420_00031016_W", "names": {"James Mitchell": ["Q11309444", "Q20055487", "Q22020369", "Q27443240", "Q27831114", "Q39070569", "Q40231072", "Q6133446", "Q6139843", "Q955098"]}, "date": "2011-02-24", "url": "http://eurekalert.org/pub_releases/2011-02/miot-mss022411.php", "content": "mit scientists say ocean currents cause microbes to filter light cambridge, ma - adding particles to liquids to make currents visible is a common practice in the study of fluid mechanics. the approach was adopted and perfected by artist paul matisse in sculptures he calls kalliroscopes. matisse's glass-enclosed liquid sculptures contain an object whose movement through the liquid creates whorls that can be seen only because elongated particles trailing the object align with the direction of the current; light reflects off the particles, making the current visible to the viewer. researchers at mit recently demonstrated that this same phenomenon is responsible for the swirling patterns scientists typically see when they agitate a flask containing microbes in water; many microbes are themselves elongated particles that make the whorls visible. more importantly, they say this phenomenon occurs in the ocean when elongated microbes caught in a current align horizontally with the ocean surface, affecting how much light goes into the ocean and how much bounces off as backscatter. because many ocean microbes, like large phytoplankton, have either an elongated shape or live in communities of long chains, this orientation to ocean currents could have a substantial effect on ocean light - which in turn influences photosynthesis and phytoplankton growth rates - as well as on satellite readings of light backscatter used to inform climate models or assess algal blooms. in a quiescent ocean, phytoplankton are randomly oriented and light filters through easily. this random arrangement is usually assumed in models of light propagation in the ocean and in satellite readings. but fluid flow can change things. \"even small shear rates can increase backscattering from blooms of large phytoplankton by more than 30 percent,\" said roman stocker, professor of civil and environmental engineering at mit and lead author on a paper about this work. \"this implies that fluid flow, which is typically neglected in models of marine optics, may exert an important control on light propagation, influencing the rates of carbon fixation and how we estimate these rates via remote sensing .\" another consideration is microbial size. very small microbes (less than 1 micrometer in diameter) don't align with the ocean current no matter what their shape. \"these very small things don't align because they are too vigorously kicked around by water molecules in an effect called brownian motion,\" said stocker, who studies the biomechanics of the movements of ocean microbes, often in his own micro-version of a kalliroscope called microfluidics. he recreates an ocean environment in microfluidic devices about the size of a stick of gum and uses videomicroscopy to trace and record the microbes' movements in response to food and current. in this case, however, the research methodology was observation, followed by mathematical modeling (much of which was handled by graduate student marcos, who created a model that coupled fluid mechanics with optics), and subsequent experimentation carried out by graduate students mitul luhar and william durham using a tabletop-sized device. but the impetus for the research was an observation of swirling microbes in a flask of water and a question posed by justin seymour, a former postdoctoral fellow at mit. \"justin walked up to me with a flask of microbes in water, shook it, and asked me what the swirls were,\" said stocker. \"now we know .\" in addition to seymour, who is now a research fellow at the university of technology sydney, other co-authors on the paper are marcos, luhar and durham; professor <mark>james mitchell</mark> of flinders university in adelaide, australia; and professor andreas macke of the leibniz institute for tropospheric research in germany. next steps: the researchers plan to test this mechanism in the field in a local environment suitable for experimentation, most likely a nearby lake. ###funding: funding was provided by grants from the national science foundation and the australian research council and by a hayashi grant from mit's international science and technology initiatives program. source: \"microbial alignment in flow changes ocean light climate,\" by marcos, justin seymour, mitul luhar, william durham, <mark>james mitchell</mark>, andreas macke and roman stocker, in pnas early edition online feb. 21, 2011."}, {"articleID": "2017042021_00755801_W", "names": {"Bill Murray": ["Q29250", "Q4910295"], "Stephen Foster": ["Q26950396", "Q30014866", "Q3498548", "Q3973177", "Q7609210", "Q7609211"], "Tony Bennett": ["Q19946119", "Q23048751", "Q296729", "Q3993198", "Q4772102", "Q7821881", "Q7821882", "Q7821883"]}, "date": "2017-04-20", "url": "https://consequenceofsound.net/go/news/bill-murrays-classical-music-program-new-worlds-to-get-album-release-this-summer/", "content": "The No. 1 Source For Breaking Music and Film Headlines <mark>Bill Murray</mark> to release debut album, New Worlds, this August Plus, the comedian/actor will tour the project later this year <mark>Bill Murray</mark>, the man who once sang \"Take Me Out to the Ballgame\" in the style of Daffy Duck, is gearing up to release an album of classical music. Entitled New Worlds, <mark>Murray</mark>'s debut full-length will surface this August, according to. The New York Times New Worlds finds <mark>Murray</mark> exploring \"themes of American history and identity\" with the help of cellist Jan Vogler, violinist Mira Wang, and pianist Vanessa Perez, among others. While the band plays Bach, Schubert, and Piazzolla, Peter Venkman <mark>Murray</mark> will read selections from Whitman, Hemingway, and Twain. One part, in particular, will feature the band playing \"Moon River\" by Any Williams while <mark>Murray</mark> reads from The Adventures of Huckleberry Finn. In addition to the poetry and literary readings, <mark>Murray</mark> will sing songs from West Side Story, Van Morrison, Gershwin (\"It Ain't Necessarily So\" ), and <mark>Stephen Foster</mark> (\"Jeanie With the Light Brown Hair\" ). (Read: The 10 Worst Oscar Losses of This Century) Not just some silly stunt, New Worlds has been brewing since early 2013 when <mark>Murray</mark> and Vogler met on a flight from Berlin to New York. Two years later, <mark>Murray</mark> took Vogler on the Poets House annual poetry walk across the Brooklyn Bridge, and the first seeds of the project were planted. It might be hard to picture the guy who voiced Garfield or knocked the heads of flowers with a golf club getting serious about classical art forms, but Vogler's respected career adds credence to the concept, and <mark>Murray</mark> is taking it quite seriously. \"When they start playing, the demand is so great that if you are attending to who you are right now, it brings out something that you couldn't have visualized or planned for,\" <mark>Murray</mark> told the Times. \"You hear all those other voices saying,\" That didn't sound like <mark>Tony Bennett</mark>,' or, \"That B flat's not going to break a light bulb .' But they're receding. They're gone .\" In addition to the summer album released, <mark>Murray</mark> plans to take New Worlds on tour. The live show will debut at Festival Napa Valley on July 20th before heading across North America. The only other dates revealed so far are an October 16th stop at New York's Carnegie Hall and the previously announced October 13th performance at Toronto's The Royal Conservatory. Below, revisit <mark>Murray</mark>'s recent collaboration with Paul Shaffer, \"Happy Street\" : Tags"}, {"articleID": "2015101719_00084069_W", "names": {"John Gibbons": ["Q19953474", "Q21557552", "Q27074107", "Q30122089", "Q3181578", "Q53552549", "Q55403007", "Q6235234"]}, "date": "2015-10-17", "url": "http://dailyjournalonline.com/news/state-and-regional/blue-jays-encarnacion-to-play-hurt-in-game-of-alcs/article_40d8617f-afcd-54c2-b6f5-58ecb314faf5.html", "content": "Blue Jays' Encarnacion to play hurt in Game 2 of ALCS Saved 2015-10-17T13:40:22 ZBlue Jays' Encarnacion to play hurt in Game 2 of ALCSThe Associated PressThe Associated Press48 minutes ago (0) Comments KANSAS CITY, Mo. (AP)--Manager <mark>John Gibbons</mark> says Edwin Encarnacion is back in Toronto's lineup for Game 2 of the ALCS, determined to \"deal with the pain .\" Batting fourth as the designated hitter, Encarnacion was removed in the eighth inning of Kansas City's 5-0 win on Friday night when his left middle finger swelled up again. <mark>Gibbons</mark> said Encarnacion underwent an MRI before deciding to play on Saturday. \"A normal game, he wouldn't be in there,\" <mark>Gibbons</mark> said. \"But we need him, so he's in there. He'll battle through it .\" Encarnacion, who hit 39 home runs and had 111 RBIs for the East champs, has struggled with the finger much of the year, missing games in August and September. Justin Smoak pinch hit in the eighth inning and popped out with two runners on base. \"Edwin's a big part of our team,\" said Toronto outfielder Kevin Pillar. \"Any time he's in the lineup we're a better team. It's something he's dealt with throughout the year. He probably wouldn't be playing if it wasn't a postseason game. But Edwin is truly passionate and wants to win and he's going to do whatever it takes to get ready to play today .\" Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2016072311_00823698_W", "names": {"Michael Schilling": ["Q23060283", "Q28006965"]}, "date": "2016-07-23", "url": "http://www.breitbart.com/news/munich-gunmans-spree-linked-to-breivik-not-is-group/", "content": "SIGN UP FOR OUR NEWSLETTER Munich (Germany) (AFP)--A teen gunman who killed nine people in a rampage in Munich was \"deranged\" , police said Saturday, linking his actions to Norwegian far-right mass murderer Anders Behring Breivik rather than Islamic State jihadists. SIGN UP FOR OUR NEWSLETTER Europe reacted in shock to the third attack on the continent in just over a week, after the black-clad gunman went on a shooting spree at a shopping mall on Friday evening before committing suicide. \"There is absolutely no link to the Islamic State,\" Munich police chief Hubertus Andrae said. He describing the attack as a \"classic act by a deranged person\" and described an individual \"obsessed\" with mass shootings. Andrae added: \"The link is evident\" with Breivik's massacre of 77 people, which took place exactly five years ago to the day. Munich prosecutor Thomas Steinkraus-Koch said the 18-year-old German-Iranian--whose name has been withheld for the time being--had suffered depression and reportedly undergone psychiatric treatment. Grieving Munich residents laid roses and lit candles in memory of the victims, with one placard bearing the simple plea: \"Why?\" \"Bloodbath in Munich,\" was the headline on the best-selling Bild newspaper as Germany struggled to come to terms with the killings. The attack had sent Germany's third largest city into lockdown as police launched a massive operation to track down what had initially been thought to be up to three assailants. Chancellor Angela Merkel was to convene her security council on Saturday to address the shooting. The incident occurred four days after an axe rampage on a train in the same German state of Bavaria and eight days after a truck attack in the French Riviera city of Nice that killed 84 people. Both assaults have been linked to jihadism. Armed with a handgun, the attacker opened fire at a McDonald's restaurant and continued along the street before entering the mall. A police patrol shot and wounded the gunman but he managed to escape before police found the body of what they believed was the \"only shooter .\" Among the nine killed were three Kosovans, according to the foreign ministry in Pristina, while Munich police said the injured included children .--Scenes of panic--A video posted on social media appeared to show a man in black walking away from a McDonald's while firing repeatedly on people as they fled screaming. Survivors described terrifying scenes as shoppers rushed from the area, some carrying children in their arms. \"We entered McDonald's to eat...then there was panic, and people ran out,\" one woman told Bavarian television. Another video appeared to show the gunman on a car park roof exchanging a tirade of insults with a man on a nearby balcony. \"I'm German, I was born here,\" the assailant replies after the man fired off a volley of swear words, including an offensive term for foreigners. Police initially believed there could be up to three assailants. But Andrae later said two others had \"absolutely nothing to do\" with the attack--and that they were simply fleeing the scene. Munich's main train station was evacuated and metro and bus transport suspended for several hours while residents were ordered to stay inside, leaving the streets largely deserted .--\"Europe stands united'--President Joachim Gauck said he was horrified by the\" murderous attack \", while US President Barack Obama voiced staunch support for Washington's close ally .\" Our thoughts are with the victims, their families, and all German people. Europe stands united, \"EU foreign policy chief Federica Mogherini said on Twitter. Europe has been on high alert for terrorism after a string of attacks in neighbouring France and Belgium claimed by IS. The attack came just days after a 17-year-old asylum seeker went on a rampage with an axe and a knife on a train on Monday near Wuerzburg, also in Bavaria, injuring five people. Interior Minister Thomas de Maiziere had said that assailant was believed to be a\" lone wolf \"who appeared to have been\" inspired \"by IS but was not a member of the jihadist network. On July 14, 31-year-old Tunisian Mohamed Lahouaiej Bouhlel used a truck to mow down 84 people, including children, after a Bastille Day fireworks display in Nice, the third major attack on French soil in the past 18 months. Friday's massacre spurred many in Munich to think the unthinkable .\" It has reached us. People in Munich have long had a queasy feeling. Fears grew with every attack in Paris, Istanbul or Brussels, \"said the Abendzeitung newspaper's editor-in-chief <mark>Michael Schilling</mark>.\" There were particular concerns about the Oktoberfest. But since Friday it is clear that there can be no security anywhere, not even in the safest German city. \"The train attack had already triggered calls by some politicians to impose an upper limit on the number of refugees coming into Germany, which accepted a record 1.1 million migrants and refugees last year, many through Bavaria."}, {"articleID": "2012070300_00046695_W", "names": {"Joe Johnson": ["Q132208", "Q28439750", "Q6210544", "Q6210546", "Q6210556", "Q8091881", "Q930905"], "Marvin Williams": ["Q23058932", "Q517058", "Q6778510", "Q6778511"], "George Hill": ["Q16105952", "Q18671272", "Q28057479", "Q517675", "Q5540603"]}, "date": "2012-07-03", "url": "http://celticsblog.com/2012/7/2/3133722/joe-johnson-traded-to-nets-things-just-got-interesting", "content": "browse more photos? \"> after months and months of the indecision with dwight howard the nets decided to cut bait and move on. first they traded for gerald wallace and re-signed him this offseason (for too much money most say). now they have traded all their expiring deals for brooklyn nets agree to trade with atlanta hawks for <mark>joe johnson</mark>, sources say - espn new york deshawn stevenson (via sign-and-trade) and a future first-round pick (lottery-protected in 2013 via houston) to atlanta in exchange for <mark>johnson</mark>. deron williams will re-sign, giving them an expensive but very good backcourt tandem. the hawks? well, they appear to be clearing the decks of bad contracts. atlanta hawks trade <mark>marvin williams</mark> to utah jazz for devin harris, according to sources - espn atlanta hawks are closing in on their second significant trade of this early offseason, agreeing in principle monday to trade forward devin harris, according to sources briefed on the discussions. what's their next move? will they build around horford and smith or deal one or both of them? will they make a play for dwight howard? who knows? speaking of dwight? where does this leave him? apparently he's still trying to dictate his destination. source: with nets out of equation, mavs go to top of lakers included - on it. for now. - ric bucher (@ ricbucher) july 2, 2012 tune in tomorrow for the next episode of\" let's make a deal. \"thebillypilgrim about 9 hours ago celtics interested in everybody, and everybody else is interested in celtics players <mark>joe johnson</mark> is set to be the first official cornerstone of the brooklyn nets dwight howard again wants out of orlando, and even staydwight.com is giving up the ghost lavoy allen and <mark>george hill</mark> sign two very reasonable nba deals; league continues apace"}, {"articleID": "2010121512_00045124_W", "names": {"Jon Favreau": ["Q295964", "Q581607"]}, "date": "2010-12-15", "url": "http://cravenherald.co.uk/uk_national_entertainment/8738850.Favreau_not_directing_Iron_Man_3/?ref=rss", "content": "<mark>jon favreau</mark> has confirmed he will not be directing the third iron man film. the actor-filmmaker, who helmed the other two instalments, used his twitter account to correct rumours that he would, once again, be sitting in the director's chair for iron man 3. \"it's true, i'm directing magic kingdom, not iron man 3 - i've had a great run with marvel and wish them the best,\" he tweeted. he later told hero complex blog: \"marvel and i both came of age together. the years that we shared were a pivotal experience. i am happy that i had the opportunity to establish the world that these characters can now play in. iron man has given me tremendous opportunities...i look forward to seeing what others can do playing in the same world .\" the news about <mark>jon</mark>'s decision comes amid reported difficulties between him and marvel, especially with creative control. \"in theory, iron man 3 is going to be a sequel or continuation of thor, hulk, captain america and avengers. this whole world...i have no idea what it is. i don't think they do either, from conversations i've had with those guys,\" he previously told mtv news. find your next job now in skipton and beyond dating make a date in skipton and surrounding areas now homes for sale and to let in skipton and surrounding areas."}, {"articleID": "2012102509_00011014_W", "names": {"Anthony Cox": ["Q18921581", "Q4772322", "Q573046"]}, "date": "2012-10-25", "url": "http://it-online.co.za/2012/10/25/m2mset-to-reach-400m-units/", "content": "posted by it-online on oct 25, 2012 in the telematics and consumer electronics sectors are rapidly becoming the two anchor industries for the m2m (machine-to-machine) market, challenging the position of smart metering. a new report from juniper research forecasts that the market for m2m and embedded devices will reach 400-million by the end of 2017, up from a little over 110-million at present. juniper explains that, while the e-reader has single-handedly enhanced the prospects of embedded devices in the consumer electronics industry, the promise of increased driver efficiency and cost management will drive the success in telematics. \"the automotive market is potentially easier to address than other sectors as it contains fewer players,\" says <mark>anthony cox</mark>, associate analyst at juniper research and the report's author. further findings from the m2m & embedded strategies report include: * almost without exception, mobile network operators have embraced m2m as an industry sector, tailoring services and approaches to the industry. * apis from m2m specialists are becoming increasingly sophisticated with tailored solutions for individual m2m customers now common. * hardware manufacturers are providing increased support for their products including api and industry - specific modules. * 4g chipsets, while shipping in very low volumes at present, will find their market in the automotive industry and specific applications such as live video monitoring."}, {"articleID": "2012031321_00038027_W", "names": {"John Henson": ["Q1926267", "Q21130395", "Q2701598", "Q6239009", "Q764316"], "Roy Williams": ["Q17414660", "Q18391329", "Q18706111", "Q21035306", "Q2170754", "Q30716994", "Q321623", "Q3445837", "Q3445839", "Q7373500", "Q7373502", "Q7373504", "Q7373505", "Q7373506"]}, "date": "2012-03-13", "url": "http://shelbystar.com/sports/henson-62707-hill-availability.html", "content": "\"the most dangerous man in the world is the man you're sleeping with' chapel hill - drawing similarities is understandable for north carolina as it heads to the ncaa tournament with questions about one of its top players. forward <mark>john henson</mark>'s right wrist injury makes him questionable for friday's game at the greensboro coliseum against the winner of tonight's first-round game between lamar and vermont. the 2009 tournament also began for the tar heels in greensboro and the opening games were surrounded by questions regarding point guard ty lawson's ailing toe .\" hopefully, a similar situation, \"senior center tyler zeller said tuesday, referring to lawson's eventual recovery and the tar heels ending up as national champions. <mark>henson</mark>, who wasn't made available for comment tuesday, was injured as a result of fall during friday's atlantic coast conference tournament quarterfinal victory against maryland in atlanta. he didn't play in games the next two days .\" i'm confident he'll be back and it will be the same <mark>john</mark>, \"tar heels point guard kendall marshall said .\" ? selfishly, i missed him because that's two or three assists (each game) that are gone. \"coach <mark>roy williams</mark> of north carolina said it's far too early to think about <mark>henson</mark> possibly not playing in the top-seeded team's ncaa tournament opener friday. the coach said <mark>henson</mark> wouldn't be put through regular practice regarding the use of his wrist early in the week. meanwhile, <mark>henson</mark> extended his hand to greet his coach with a handshake tuesday, with <mark>williams</mark> suggesting a left-handed shake. the coach said that <mark>henson</mark> told him:\" i can shake hands with you. \"otherwise, it's difficult for teammates to tell whether <mark>henson</mark> will be recovered by later this week."}, {"articleID": "2019050315_00327947_W", "names": {"Vijay Goel": ["Q28741461", "Q7929142"]}, "date": "2019-05-03", "url": "http://www.asianage.com/india/politics/030519/bjp-shamelessly-involved-in-horse-trading-aap-leader-gopal-rai.html", "content": "BJP shamelessly involved in horse trading: AAP leader Gopal Rai ANI Published: May 3, 2019, 8:44 pm IST Updated: May 3, 2019, 8:44 pm IST <mark>Vijay Goel</mark> had on Thursday said that 14 AAP MLAs want to leave the party as the party has gone astray from its objectives. All 7 Lok Sabha seats in Delhi are going to polls in a single phase on May 12. (Photo: PTI) New Delhi: The Aam Aadmi Party (AAP) on Friday came down heavily on the Bharatiya Janata Party (BJP) and said that the ruling party is \"shamelessly involved in horse trading .\" \"BJP leader <mark>Vijay Goel</mark> yesterday publicly accepted that 14 AAP MLAs are in contact with him. This shows that BJP is shamelessly involved in horse trading and also indicates that BJP has failed in all its strategies in Delhi and is left with this last option,\" AAP leader Gopal Rai told media here. He added, \"Replying to our accusation, <mark>Vijay Goel</mark> said that BJP is not trying to contact MLAs, rather AAP MLAs are contacting them to join BJP. This is an utter lie. Why would MLAs contact BJP if they have seen what happened with Ved Parkash in Bawana bypolls?\" <mark>Vijay Goel</mark> had on Thursday said that 14 AAP MLAs want to leave the party as the party has gone astray from its objectives. He was replying to the allegations made by Delhi CM Arvind Kejriwal who had alleged on Wednesday that the BJP is trying to buy AAP MLAs. Asserting that the BJP does not need to buy AAP MLAs, <mark>Goel</mark> said, \"14 AAP MLAs want to leave the party because the party has gone astray from its objectives but the BJP does not need to buy these MLAs. Allegations of the BJP offering Rs. 10 crores are false .\" Citing the exit of leaders from Aam Aadmi Party in the past <mark>Goel</mark> said, \"Prashant Bhushan, Yogendra Yadav, Shazia Ilmi and many others left the party saying they are feeling stifled in the party. The party which had come to fight corruption started resorting to corrupt practices .\" All 7 Lok Sabha seats in Delhi are going to polls in a single phase on May 12. General elections in the country are scheduled to be held in seven phases starting from April 11 and ending on May 19. Counting of votes will take place on May 23. Keep yourself updated on Lok Sabha Elections 2019 with our round-the-clock coverage--breaking news, updates, analyses etc all. Happy reading."}, {"articleID": "2011101122_00067231_W", "names": {"Mario Lopez": ["Q1898880", "Q372559", "Q57942357", "Q6007003"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2011-10-11", "url": "http://gossipcenter.com/demi-lovato/demi-lovatos-day-grove-552404", "content": "tweet posted tuesday october 11, 2011 6:21 pm gmt still pushing forth with post-album release press duties, demi lovato was busy interviewing at the grove in los angeles, ca on tuesday (october 11). <mark>mario lopez</mark> while chatting for a segment to air on the entertainment news program \"extra\". meanwhile, miss lovato also recently took to her seventeen blog to dish about life on the road. she wrote, \"to stay strong and healthy in the midst of the craziness, it's really important to me to try to find a balance between work and personal time. i love what i do so much that sometimes it's tough to tell the difference! but to make sure i find time for myself, i think about my family and friends and fans who support me no matter what - it's that unwavering love that helps me stay calm and focused .\" as for those welcome breaks from work, the 19-year-old told, \"when i'm on the road, i like to have dinner with friends and family and try to see some sights. when i was in la for my last show, i made time to go bowling afterward, and it was so much fun!\" also touching on what steps she takes to maintain her health while traveling, lovato shared, \"i try to make time for naps if i have to get up really early. i also make sure to drink hot tea with honey when i am talking a lot during interviews or singing on stage every day. and luckily, dancing and staying active also helps me to feel healthy and happy. but performing takes a lot of energy so i have to make sure i eat enough and get plenty of sleep .\" she concluded by posting, \"traveling is so exciting, but it also feels good to come home .\" e-mail: the content of this field is kept private and will not be shown publicly. gossipcenter welcomes a lively and courteous discussion as long as you follow the rules of conduct set forth in our terms of service. comments are not pre-screened before they post. you agree that anything you post may be used, along with your name and profile picture, in accordance with our george clooney and stacy keibler vacation in mexico: who's clooney's hottest love interest? coroner: no evidence <mark>michael jackson</mark> gave himself fatal dose of propofol"}]