[{"articleID": "2019051515_00169512_W", "names": {"Anthony Hart": ["Q17378082", "Q42565576"], "Mike Nesbitt": ["Q6848174", "Q6848175"], "Patrick Corrigan": ["Q16092601", "Q7146277"]}, "date": "2019-05-15", "url": "http://www.localberkshire.co.uk/news/17642153.northern-ireland-secretary-under-fire-over-abuse-survivors-compensation-scheme/", "content": "News Northern Ireland Secretary under fire over abuse survivors compensation scheme By Press Association 2019 Northern Ireland power sharing 0 comment The Northern Ireland Secretary has been accused of treating abuse survivors like \"political pawns\" . Karen Bradley told victims' groups on Tuesday that political parties would be invited to consider the issue as part of negotiations to restore devolved institutions. A redress scheme, in which victims would have been paid between £ 7,500 and £ 100,000, was one of the recommendations of Historical Institutional Abuse Inquiry (HIAI) two years ago. Retired High Court judge Sir <mark>Anthony Hart</mark> chaired the Historical Institutional Abuse inquiry (PA) Its proposals have never been implemented due to the Stormont impasse. Mrs Bradley has been under mounting pressure to introduce the scheme via Westminster. Northern Ireland's two biggest political parties reacted with strong criticism of her on Wednesday. Sinn Fein deputy leader Michelle O’Neill has accused Mrs Bradley of \"abdicating her responsibilities' (Niall Carson/PA) Sinn Fein vice-president Michelle O’Neill accused Mrs Bradley of using victims as political pawns.\" Compensation for victims of historical institutional abuse should not be a matter for the political negotiations and Karen Bradley is morally and politically wrong to attempt to make it so, \"she said.\" Not only is British Secretary of State once again abdicating her responsibilities to victims, she is now attempting to turn them into political pawns where their needs become a matter for negotiation. \"That is shameful. Karen Bradley needs to start putting the needs of victims and survivors before her own political priorities and immediately put in place the required legal and financial framework to assist them.\" DUP leader Arlene Foster has slammed Mrs Bradley over delays to the delivery of compensation to abuse victims (Liam McBurney/PA) DUP leader Arlene Foster said in the ongoing absence of the Northern Ireland Assembly the UK Government has a \"moral duty\" to deliver the compensation. She said: \"I have met many of the families impacted. I want to see them receive justice but also have their suffering recognised financially. The delay is a shame and disgrace.\" A lack of devolution has been a barrier to this matter being progressed. \"This is why devolution should be restored immediately so matters like this--compensation--can be taken forward by ministers.\" In the absence of devolution, the Government has a moral duty to meet this financial commitment but ultimately the institutions who closed their eyes to the abuse must be prepared to make their contribution to this compensation as has happened elsewhere. \"Ulster Unionist MLA <mark>Mike Nesbitt</mark> said:\" In suggesting the issue should be included in the discussions over the Programme for Government, Mrs Bradley is suggesting victims become pawns in a negotiation, potentially bartered against the issues that are holding up the restoration of devolution. \"That is morally wrong and politically crass.\" . <mark>Patrick Corrigan</mark> from Amnesty International has called for a public apology and compensation for victims of historical institutional abuse. (Amnesty/PA) Amnesty International said the UK Government has so far failed to deliver either a promised apology or financial redress. <mark>Patrick Corrigan</mark>, Northern Ireland director of Amnesty International, accused Mrs Bradley of \"trying to shirk responsibility\" . \"The Secretary of State has been asked by the head of the civil service to fulfil a moral responsibility to abuse victims by bringing forward legislation at Westminster,\" he said. \"Her attempt to shirk that responsibility is a shameful betrayal of victims who have been let down too often by those supposed to be protecting their interests.\" She should listen to the head of the civil service and to victims across Northern Ireland and bring this long, drawn-out process to a conclusion. \"0 comment"}, {"articleID": "2019092519_00059278_W", "names": {"Michael Goodwin": ["Q11778342", "Q6830683"]}, "date": "2019-09-25", "url": "https://www.foxnews.com/media/trump-ukraine-failed-oust-attempt-kimberley-strassel", "content": "close Video <mark>Michael Goodwin</mark>: Democrats botched impeachment push New York Post columnist <mark>Michael Goodwin</mark> said the move will result in Democrats hitting a \"dead end.\" & nbsp; Wall Street Journal columnist Kimberley Strassel offered her analysis of the Trump - Ukraine transcript on Twitter Wednesday, saying it was an \"internal attempt\" to oust the president. \"Having read DOJ's Trump-Ukraine release, here's the real story: This is another internal attempt to take out a president, on the basis of another non-smoking-gun,\" she wrote. \"As to call transcript itself: Trump's actual\" favor' is that Ukraine look backward, to what happened in the 2016 election. This is a legitimate ask, since election meddling looks to have come from both Russia and Ukraine. \"She pointed out that it was Ukrainian President Volodymyr Zelensky who first mentioned Rudy Giuliani and said he was the first to broach the subject of an investigation. REP. RATCLIFFE ON UKRAINE TRANSCRIPT: DEMS\" HAVE HARMED OUR NATIONAL SECURITY' IN THEIR DESIRE TO DESTROY TRUMP Video \"It is actually Zelensky who brings up Rudy Giuliani--saying they can't wait to\" meet him. \"And it is Zelensky who references\" that investigation, \"as he goes on to promise that\" all investigations will be done openly and candidly, \"she continued.\" Trump says \"good' and expresses worries that a\" good' prosecutor was \"shut down .' Mentions\" Biden's son' and that Biden bragged he \"stopped the prosecution .' Ends that bit with\" It sounds horrible to me .' \"She also said the Department of Justice and Attorney General Bill Barr have yet to speak with Trump, or any Ukranian officials, directly about the matter and have released a statement to address the issue.\" And, never mind, because: DOJ in statement says the President has not spoken to AG about investigating Biden and has not asked the AG to contact the Ukraine. Also, Barr has not communicated with Ukraine--\"on this or any subject,\" Strassel added. RUDY GIULIANI CLAIMS UKRAINE SCANDAL REVEALED REAL \"COLLUSION,' ACCUSES BIDEN OF\" SELLING THE PRESIDENCY' Video She ended by claiming the whistleblower who leaked the story had political bias and ulterior motivations, before criticizing Democrats for letting their impeachment fixation steer the ship of state. \"Whistleblower? Look at this nugget, referenced in the OLC opinion. The IG's review found\" some indicia of an arguable political bias on the part of the Complainant in favor of a rival political candidate, \"Strassel wrote.\" Media got all this so wrong. And Democrats look all the more partisan and radical to have moved toward impeachment. \"CLICK HERE TO GET THE FOX NEWS APP Following the release of the transcript, Democrats said Trump abused his power by asking Zelensky to look into Joe Biden and his son, while Republicans fell back on the fact that the president never mentioned money or threatened to withhold military aid. Nick Givas is a reporter with Fox News. You can find him on Twitter at @ NGivasDC. ADVERTISEMENT"}, {"articleID": "2012011220_00016042_W", "names": {"Don Cherry": ["Q27830914", "Q592524", "Q994656"]}, "date": "2012-01-12", "url": "http://bleacherreport.com/articles/1021818-buffalo-sabres-captain-jason-pominville-one-on-one", "content": "jason pominville has played an important role over his seven-year career with the sabres. pominville's on-ice vision and offensive creativity are a few reasons why he's one of the most consistent players each year. bleacher report talked with pominville on the following topics: captaincy \"it means a lot to be the captain of the sabres. it's a huge honor to represent the organization both on and off the ice.\" there's a tremendous amount of history surrounding the sabres, and to wear the \"c\" with pride means the world to me. \"goal/game never to forget\" the overtime goal against the ottawa senators in game 5 in 2006 to send our club to the eastern conference finals to face the carolina hurricanes. \"as a team, though, danny briere's overtime goal in game 6 against the hurricanes to force game 7 was an emotion that was indescribable and will forever be one of the greatest moments i have experienced in hockey.\" \"it was a good experience. it was a bonding experience that benefited our club. the trip helped us build chemistry and we won both games so it made it even more enjoyable.\" lindy ruff \"lindy is an honest coach. he tries to get the best out of his players each game and pushes his players to get better.\" his communication has always been great with his players, which is the reason why he has been coaching in the league for so long. his coaching style has helped his players and the organization to thrive each season. \"growing up in quebec\" i grew up in the montreal area, so there was hockey everywhere. with my father being an ex-professional hockey player, i was always a part of hockey. \"montreal is one of the biggest hockey markets in the world and it was fun to follow the canadiens growing up.\" best team the sabres have faced this season bruins. they are the defending champions and are strong at every position. \"eastern conference race\" just about every team is in contention to make the playoffs in the east. our club is battling for a playoff spot. \"a team can climb quickly up the standings if they get on a winning streak. it's going to be a battle from here on.\" \"we have awesome fans in buffalo. it's a great market for hockey. fans know the game and enjoy watching our organization play. what is the duplicate article? why is this article offensive? where is this article plagiarized from? poking fun at <mark>don cherry</mark> from: buzzfeed.com nhl ref does what?! from: totalprosports.com la kings go kiss from: totalprosports.com we'd like to send you the most entertaining what is bleacher report? the us's 4th largest sports media site with 20 million monthly readers. we deliver entertaining content about all the teams and topics in sports. we have the most popular newsletters for every major team in the us. @ bleacherreport: is tim tebow overrated or underrated? australian open 2012 copyright? 2011 bleacher report, inc. all rights reserved."}, {"articleID": "2009070622_00058225_W", "names": {"Jim Moore": ["Q16732815", "Q17378085", "Q22006996", "Q28444878"]}, "date": "2009-07-06", "url": "http://hannibal.net/homepage/x1885883800/Officers-disciplined-in-Bowling-Green-police-probe", "content": "bowling green, mo - two bowling green police officers have been disciplined after an investigation into their handling of a may 30 traffic stop. the city cited personnel concerns in declining to release details of the probe. but mayor <mark>jim moore</mark>, city administrator j.d. kehrman and police chief don wickenhauser confirmed the results to the courier-post. kehrman said \"internal action\" had been taken and that the two officers were still employed by the city. \"we think appropriate action has been taken,\" <mark>moore</mark> said. \"we looked at the matters we felt needed to be looked at.\" \"the main goal here was to review and see whether action needed to be taken,\" kehrman said. \"i think (the probe) should yield some positive results.\" kehrman said the inquiry looked at whether the two officers' \"actions were consistent with policies of the police department.\" national attention bowling green drew national attention for the may 30 traffic stop. part-time officer brian czarnecki pulled over mayor david koester for speeding at 10:16 p.m. at the south edge of bowling green. the first-year officer reported koester appeared to be drunk, had an open beer bottle in his car and apparently had no valid proof of insurance. a recording captured the 15:55 conversation between czarnecki, koester and backup officer sgt. russ schaible. czarnecki asked koester if he'd been drinking and koester replied that he'd \"had a couple of beers.\" czarnecki, however, gave conflicting reports about koester's status. in his written statement, the officer said koester's \"eyes were glassy and watery, and his speech was slurred.\" but in a conversation with schaible, czarnecki said he believed koester \"could pass a sobriety\" check. also on the tape, koester's speech does not sound slurred. he did ask czarnecki if the officer knew who he was. \"i'm the mayor of bowling green,\" koester said. in a later interview, koester said that the question was a means of introduction and was not an effort to seek leniency. the tape of the traffic stop backs koester up, because he never again raised the issue. on the tape, the two officers can be heard discussing how to proceed. they talked about letting koester drive home. schaible says \"hope he doesn't crash.\" at one point, schaible asks \"anybody else, you'd write a ticket, wouldn't you?\" after several minutes, czarnecki returned to koester's car and asked the mayor if anyone could come pick him up. koester called his wife, sherry, who drove to the scene. \"it should be noted mr. koester stumbled when he exited his vehicle and staggered when he walked to his wife's vehicle,\" czarnecki later wrote in his report. while the written report says koester was given \"verbal warnings on multiple traffic/ordinance violations,\" the tape appears to have captured only the warning about speeding. koester consistently maintained that he was not drunk. koester supporters point to the fact that he was never charged with a crime and said he was unfairly targeted. opponents of the controversial mayor claimed he got preferential treatment when czarnecki issued only a verbal warning. kehrman called for an investigation on june 9. on june 16, just hours before an expected board of aldermen vote on his removal, koester resigned the $500-a-month job he won by 10 votes in april 2008. <mark>moore</mark>, the aldermanic president and a former prison superintendent, was sworn into office. one other stop records show that bowlng green police made at least one other traffic stop the evening of may 30. it happened at 9:23 p.m. in almost the exact spot where koester was pulled over. schaible wrote three tickets for traffic offenses to a frankford woman. kehrman said the 9:23 p.m. stop was not part of the investigation because \"it was the (officers') actions surrounding\" the stop of koester and the accusations of leniency for a city official that prompted concern. \"we thought it needed to be reviewed,\" kehrman said. \"the issue of other stops that night didn't really factor into the investigation.\" the city originally asked the missouri highway patrol to conduct the probe, but the agency called the case an internal matter. wickenhauser, who has more than three decades of police experience, was asked to handle the case. by doing so, the city had no cash expense .'...move forward' kehrman said police policies are being reviewed to see if changes are needed. specific policy revisions would need aldermanic approval before being enacted. \"the challenge is to ensure that something good comes from this,\" kehrman said. \"anything we can do to improve service to the community is a positive thing. hopefully, that has been accomplished here.\" <mark>moore</mark> and wickenhauser also are ready to put the matter to rest. \"we're ready to move forward,\" wickenhauser said. \"we are going to go forward from this and we're going to do the very best job we can.\" "}, {"articleID": "2016050707_00059061_W", "names": {"Shane Watson": ["Q2732224", "Q7488319"]}, "date": "2016-05-07", "url": "http://www.telegraph.co.uk/fashion/people/shane-watson-ott-red-carpet-dressing-only-works-if-youre-famous/", "content": "<mark>Shane Watson</mark>: \"OTT red carpet dressing only works if you're famous\" It takes a celeb like Sarah Jessica Parker to carry off a shorts suit on the red carpet Credit: Getty <mark>Shane Watson</mark> 7 May 2016 • 7:00 am This was the week of the Met Gala--the star-studded party hosted by American Vogue's Anna Wintour, which has become the most competitive red-carpet event in the social calendar. The theme was \"Fashion in an age of technology\" , a good excuse--if any were needed--for laser-cut-out dresses, metallic beading, nude panelling and very long trains. But the real theme, this year and every year, is \"Look and marvel, but don't even think of trying any of this yourself\" . There were a lot of fashion tricks on display on the night that civilians might be tempted to incorporate in their own special occasion looks but that would--with about three exceptions--be a seriously bad idea. Here are the top 10 Do Not Try This At Homes. \"Never wear a shorts suit. Especially not at night.\" <mark>Shane Watson</mark> 1. Never wear gladiator sandals under any circs. I should know. I have not once, but twice, invested in them over the years only to discover that there is no occasion for which you can't find a better option. They look weird. They're not flattering (sometimes the flat suede ones, in a picture, with shorts, but when is that ever happening?). Not only that but they are a major faff to put on. You'll have missed the party before you've got it sorted out. Gladiator boots like Taylor Swift's are hard to pull off Credit: Getty 2. Cutouts, otherwise known as strategic holes in your clothes, should be great if you have the figure for them--but they are the opposite of elegant. Great for the beach, not for the ball. 3. Never wear a shorts suit. Especially not at night. You can wear a regular tuxedo, but it had better be amazing, and frankly spring is not the best time for it. 4. Trains and integral capes are ageing and peculiar and a bit Florence Foster Jenkins. A little pooling fishtail of a thing, maybe. \"If we never saw another leg jutting from a thigh split it would be too soon.\" <mark>Shane Watson</mark> 5. Beading makes you look fat. Always. It's similar to crochet like that. And it's hot and heavy, like wearing one of those lead tabards they put you in when X-raying you at the dentist. Excellent for parties in tents when there's snow on the ground, mind you. 6. Boots for evening, any boots, are, just as your mother always said, not suitable for evening wear and liable to make you look a bit \"working girl\" . 7. The thigh-high split has been overdone and now it's just boring, especially as the wearer always feels obliged to get their money's worth and stick that leg out. If we never saw another leg jutting from a thigh split it would be too soon. Even celebs like Kim Kardashian should resist sticking their leg out of a thigh-high split on the red carpet Credit: Getty 8. At a black-tie do, short is the least attractive option. 9. Yellow is not the easiest colour at night, though Kate Moss's chiffon lemon yellow dress is our favourite thing she ever wore. 10. A few strips of nude panelling (to break up beaded armour) is fine. A lot of nude panelling makes everyone nervous and invites people to stare in the hope of slippage. Just don't do as they do, is the safest rule. READ MORE ABOUT: Met Gala Kate Moss Anna Wintour Florence Foster Jenkins Show more Don't Miss Gallery 07 May 2016, 7:15 am Gallery: 10 head-turning hats for every summer event you've got this season 07 May 2016, 7:05 am The 5 best things to buy this weekend 07 May 2016, 6:30 am Flower power! Why chintz is back in fashion 07 May 2016, 6:00 am Mrs Missoni: \"How I turned my family business into a & pound; 130million empire' 07 May 2016, 5:30 am Dolce & Gabbana takes #DGFamily to the London streets 06 May 2016, 3:14 pm\" You have to moisturise so it slips on \": Meet the woman behind Beyonce's latex dress 06 May 2016, 2:51 pm Dree Hemingway shows us how to wear a band t-shirt the grown-up way Gallery 06 May 2016, 1:59 pm Gallery: Basket bags: the summer staple that will make you feel like a Cannes film star"}, {"articleID": "2019070104_00012691_W", "names": {"Kate Middleton": ["Q10479", "Q17506155"]}, "date": "2019-07-01", "url": "http://msn.com/en-au/entertainment/celebrity/why-prince-william-and-duchess-catherines-upcoming-trip-is-an-exciting-royal-first/ar-AADFoB7?li=AAgfYrC", "content": "© Provided by Bauer Media Pty Ltd In news that has delighted the masses, <mark>Kate Middleton</mark> and Prince William are set to jet off on another royal tour to Pakistan later this year - but the trip is all the more special for this unexpected reason. In news that has delighted royal fans in Asia, it has been confirmed Prince William and <mark>Kate Middleton</mark> will tour Pakistan later this year. Indeed the exciting news comes as a result of the UK's intention to strengthen ties with the South-Asian country - both of which share \"historical links\" according to the official press release from Kensington Palace. The trip, which was initially rumoured to be happening earlier in June, was confirmed on Sunday, with the press release explaining: \"Her Majesty The Queen visited Pakistan in 1961 and 1997, and The Prince of Wales and The Duchess of Cornwall visited in 2006.\" The insight into the previous royal visits has thus revealed something that makes William and <mark>Kate</mark>'s trip ahead quite special - this will mark the first time a royal trip has taken place there in over a decade. While royal tours are big operations in terms of security, the reasoning for such a long period of time between royal visits could have been to do with the safety situation on the ground in Pakistan. However, it has been reported the situation in the country has stabilised recently due to crackdowns on insurgents. © Provided by Bauer Media Pty Ltd <mark>Kate</mark> and William will visit Pakistan later this year, a trip that marks a special royal milestone. What are the dates of William and <mark>Kate</mark>'s tour of Pakistan? While the Palace is yet to confirm the exact dates of the royal tour, it is understood it will occur later this year in the British autumn, according to the press release. In June, it was also reported that the tour would occur within weeks of Prince Harry and Duchess Meghan's visit to South Africa, which is touted to take place in October. © Provided by Bauer Media Pty Ltd Meghan and Harry will also be going on their own royal tour to Africa around the same time. Why are <mark>Kate</mark> and William going to Pakistan? <mark>Kate</mark> and William's tour comes after the Duke of Cambridge's five-day visit to Israel, Jordan and other occupied Palestinian territories in 2018. While the British Foreign Office has urged visitors to be careful with their travel in light of terrorist attacks and risk of kidnapping, there are signs that the threat is easing, and an opportunity for Britain to make the most of strengthening their ties with the country. Indeed royal visits pose a fantastic opportunity for countries to strengthen their ties as international press and global attention turns towards the country in question as the royals partake in a number of formal events, many of which highlight the varying cultures there. Further affirming their intention to better connect with the country, British Airways has just resumed their direct flights to Islamabad, which is the capital of Pakistan. © Provided by Bauer Media Pty Ltd <mark>Kate</mark> and William are no strangers to a royal tour. In the official press release, the High Commissioner for Pakistan, Mohammad Nafees Zakaria shared the positive anticipation ahead of the tour: \"The Government and the people of Pakistan warmly welcome the announcement of the Royal Visit by Their Royal Highnesses The Duke and Duchess of Cambridge to Pakistan this year.\" \"The upcoming Royal Visit is a reflection of the importance the United Kingdom attaches to its relations with Pakistan,\" he added. \"The two countries enjoy historical links which both sides wish to strengthen further.\" © Provided by Bauer Media Pty Ltd Princess Diana paid several visits to Pakistan over the years. What will <mark>Kate</mark> and William do in Pakistan? While details around the couple's engagements are yet to be confirmed, we can definitely speculate on something that is likely to keep royal fans riveted throughout the whole duration of the tour. Indeed the ever-stylish <mark>Kate Middleton</mark> is no doubt set to wear some stunning outfits from her enviable wardrobe. As part of the country's culture, we can expect <mark>Kate</mark> will dress modestly, keeping her shoulders and legs covered. If the pair visit any mosques or certain holy places, she will also be required to cover her head. The tour will also echo a similar trip undertaken by Princess Diana in 1997, which took place in 1997. Indeed the people's princess made the trip over to Pakistan several times through her charity work - so it's even more special to see her son and his wife follow in her footsteps. Read more"}, {"articleID": "2017073005_00062889_W", "names": {"Liam Fox": ["Q16300641", "Q332374", "Q6539597"]}, "date": "2017-07-30", "url": "http://www.thametoday.co.uk/lifestyle/console-corner-new-old-skool-sonic-to-deliver-on-hype-for-all-the-right-reasons-1-8064698", "content": "Console Corner: New old skool Sonic to deliver on hype for all the right reasons? Sonic Mania Have your say It is around this time of year that the video gaming scene - like the football season - really starts kicking back into gear. July and August tend to be pretty quiet for obvious reasons with people holidaying and the like...but there is one release which has gamers old and new skool talking. As I have touched on a number of times in this column in recent months, 2017 has been the year of the classic comeback with retro game, systems, re-releases and remasters taking centre stage. And August is no different with Mega Man Legacy Collection 2 set to launch in the first week of the new month. But it is the \"new\" 2D Sonic game which has caught the eye. Sonic Mania is due out on August 15th and continues the old skool theme this year but with the added bonus of being a new entry into the franchise. The retro title was meant to be released in the spring but was delayed until August. Mania is a new 2D Sonic title in the vein of his classic adventures but features both original stages as well as remixed versions of older Sonic levels like the Green Hill and Flying Battery Zones. Sonic Mania is releasing digitally for Switch, PS4, Xbox One and PC and is available for preorder. It is a precursor to a new 3D Sonic title called Sonic Forces which is also coming to the same platforms later this year. Sonic Mania was named one of the best games shown at E3 2017 by The Guardian, Ars Technica, Twinfinite, and Saucy Gamer, with Ars Technica's Sam Machkovech naming it his \"game of the show\" . It comes with a big billing and plenty of nostalgia too and was described as \"the one carrying hype for all of the right reasons\" when Mania and Forces were discussed by experts. It was also nominated as best platformer but lost out - understandably - to the Switch's as yet undated stellar title, Super Mario Odyssey. Trending <mark>Liam Fox</mark>: No Cabinet deal on free movement for three years after Brexit WITH VIDEO: Animals from Blue Cross rehoming centres wish Her Majesty the Queen a happy birth-neigh! Cakes withdrawn over allergy concerns Nepal namesake is hit by earthquake A life cut short: RAF Halton's popular mascot George the goat has passed away Sign in"}, {"articleID": "2009060223_00014252_W", "names": {"John Mchugh": ["Q6247887", "Q6247891"], "Scott Murphy": ["Q290602", "Q5277878", "Q7436932"]}, "date": "2009-06-02", "url": "http://pressrepublican.com/evening/local_story_153184423.html", "content": "june 02, 2009 06:44 pm - would-be players to jockey for the position. plattsburgh - the expected confirmation of <mark>john mchugh</mark> as the next secretary of the army will open up his seat in the north country's 23rd congressional district. democrats are hopeful that they can finally nab the position, which hasn't been held by a democrat since the days of the civil war. \"absolutely, we can win that seat,\" clinton county democratic party chairman martin mannix said. \"if <mark>scott murphy</mark> can win with a 78,000-vote disadvantage and darrel aubertine can win with a 30,000-vote disadvantage, we can win here.\" mannix was referring to the special election in march where democrat <mark>scott murphy</mark> defeated republican james tedisco for the seat in the 20th congressional district vacated by kirsten gillibrand, who was named a u.s. senator. the 20th district is a heavily populated republican district, as is the 48th senate district in the new york state senate, where aubertine won in a 2007 special election as a democrat. huge area the 23rd district that <mark>mchugh</mark> will be leaving is the largest geographically in the country east of the mississippi river. it covers parts of 11 counties and stretches from lake ontario in the west to lake champlain in the east. <mark>mchugh</mark>, who is from pierrepont manor near watertown, has won easily every time he's run since 1992. mannix said not having to run against an entrenched republican incumbent will give democrats a better chance. p.o. box 459 170 margaret street plattsburgh, ny 12901 newsroom hours: weekdays 8 a.m. to midnight; weekends, 2 p.m. to midnight phone: 518-565-4131 fax: 518-561-3362 e-mail: sports: 518-565-4124 features: 518-565-4138 hours: weekdays 8 a.m. to 5 p.m., saturday and sunday (phone only) 8 a.m. to noon. click on the image of the press-republican frontpage to view our frontpage archives. to receive a subscription to the press-republican for as little as $13.00 per month. cnhi news service associated press content © 2009. all rights reserved. ap content may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2017032910_00732878_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2017-03-29", "url": "http://www.msn.com/en-us/music/news/calvin-harris-teases-pharrell-ariana-grande-young-thug-collab/ar-BByYI1c?srcref=rss", "content": "© Evan Agostini Calvin Harris arrives at the Vanity Fair Oscar Party on Sunday, Feb. 26, 2017, in <mark>Beverly Hills</mark>, Calif.. The next single from electronic dance music star Calvin Harris, \"Heatstroke,\" will feature rapper Young Thug, R & B pop star Ariana Grande, and cross-genre artist Pharrell Williams. Harris revealed the line-up in posts to his social media accounts; Twitter and Facebook updates also featured an expanded credits list for the upcoming single. The Scottish DJ and producer shot to fame with a series of singles taken from his third album, 2012's \"18 Months,\" and in 2016 released singles \"This Is What You Came For\" (featuring Rihanna,) \"Hype\" (with Dizee Rascal,) and \"My Way,\" for which provided vocals. February 2017 saw him release \"Slide,\" which had Frank Ocean and rap group Migos guesting. It was released two days after a similar social media announcement. CALVIN HARRIS / / YOUNG THUG / / PHARRELL / / ARIANA GRANDE pic.twitter.com/9Ups0Eu53O--Calvin Harris (@ CalvinHarris) March 28, 2017"}, {"articleID": "2018053002_00250042_W", "names": {"John Horgan": ["Q16145291", "Q21175985", "Q331298", "Q6239861", "Q6239868", "Q6239870"], "Andrew Wilkinson": ["Q17020421", "Q56446756"], "Dirk Meissner": ["Q1227970", "Q58064401"]}, "date": "2018-05-29", "url": "https://www.thespec.com/news-story/8638734-fight-over-pipeline-continues-b-c-premier/", "content": "Fight over pipeline continues: B.C. premier | TheSpec.com Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company.\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support.\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts.\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company.\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support.\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts.\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press Top Stories Fight over pipeline continues: B.C. premier News07:35 PMThe Canadian Press VICTORIA--Premier <mark>John Horgan</mark> says he will continue the fight to protect British Columbia's coast from the consequences of an oil spill regardless of who owns the Trans Mountain pipeline. The federal government's decision to take over the pipeline from Kinder Morgan doesn't change his government's position to oppose the expansion project from Edmonton to Burnaby or its decision last month to pursue a reference case to the B.C. Court of Appeal, <mark>Horgan</mark> said Tuesday. \"I believe we have an obligation to ensure that we are doing everything we can to avoid the catastrophic consequences of a diluted bitumen spill,\" he said. <mark>Horgan</mark> said Ottawa's decision to buy the pipeline does not reduce the risk to B.C.'s environment and economy, which is why the province is asking the court whether it has jurisdiction to protect itself from a spill. The fact the pipeline is about to be owned by a federal Crown corporation doesn't affect the reference case, he added. But the federal government's decision to take over the project puts Ottawa in charge of managing the pipeline, including its risks, <mark>Horgan</mark> said. \"I do believe the federal government now is totally accountable, not just for regulation and approval of a pipeline, but they now are responsible from wellhead to tidewater and beyond,\" he said. \"That allows us now to have more candid discussions with the owners of the pipeline than I would have been able to when they were shareholders in a Texas-based oil company.\" B.C.'s Opposition Liberals said <mark>Horgan</mark> is about to be given the cold shoulder by Prime Minister Justin Trudeau's government. \"This is a bad day for B.C. because <mark>John Horgan</mark> has decided to kick the feds in the shins,\" Liberal Leader <mark>Andrew Wilkinson</mark> said. \"This is a government that is creating investor chaos here in B.C.\" Political experts said relations between B.C. and the federal government and neighbouring Alberta are strained over the ongoing pipeline dispute, but Trudeau's Liberals have the most to lose with the pipeline purchase. The move could backfire politically in B.C., where the federal Liberals hold 14 seats, and globally on the environmental stage because the government has committed to fight climate change but has chosen to buy a pipeline, said Prof. Kathryn Harrison, an expert on federal-provincial relations at the University of British Columbia. \"By repeatedly saying the pipeline will be built, prime minister Trudeau has painted himself into a corner where this was the last and only option,\" she said in an interview. Prof. David Tindall, an expert on climate change politics at UBC, said <mark>Horgan</mark> has gained support in B.C. for his calm and focused approach to the pipeline debate. \"He's really emphasized the issue of trying to avoid oil spills and protecting the coast,\" he said. \"That's one set of environmental issues, I think, that has broad support.\" <mark>Horgan</mark> also gained support by not appearing as an environmental ideologue through his comments that endorse oil refineries over pipelines and his backing of liquefied natural gas projects, said Tindall. The federal decision to buy the pipeline could prompt further legal challenges by Indigenous Peoples, said Prof. Margot Young, a constitutional law and Indigenous legal rights expert at the University of British Columbia's Peter A. Allard School of Law. \"What is clear is that local and Indigenous opposition to the project can only be inflamed by this federal move,\" she said. \"And that opposition is independent of any constitutional decision reached by the courts.\" (Companies in this story: TSX: KML) By <mark>Dirk Meissner</mark>, The Canadian Press"}]