[{"articleID": "2015012320_00044789_W", "names": {"Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"]}, "date": "2015-01-23", "url": "http://tampabay.com/blogs/the-buzz-florida-politics/scott-recommends-money-for-individuals-with-disabilities/2214899", "content": "State Roundup CFO Jeff Atwater, Agriculture Commissioner Adam Putnam call for investigation into FDLE firing CFO Jeff Atwater, Agriculture Commissioner Adam Putnam call for investigation into FDLE firing Gov. Scott proposes Bright Futures expansion but doesn't address criticisms Enterprise Florida picks new CEO: <mark>Bill Johnson</mark>, Miami-Dade's longtime port chief Editorial: The $1 billion cost of not taking Medicaid expansion money The Buzz From the staff of the Tampa Bay Times Scott recommends money for individuals with disabilities Gov. Rick Scott on Friday unveiled new additional of his budget proposal, including $8 million to enroll all individuals \"with critical needs\" from the waiting list to the Developmental Disabilities Medicaid Waiver Program. \"I am pleased to announce that for the second year in a row, Floridians will be removed from the critical needs waiting list with our proposed funding,\" he said in a statement. Scott is also prioritizing the Personal Learning Scholarship Account program. The program provides scholarships worth $10,000 or more to children with profound special needs. The money can be applied toward private school tuition, tutoring, educational materials and therapy. The governor's proposed budget will include an additional $5 million for the program. \"Every individual should have the opportunity to get a great job and education regardless of the challenges they may face, and that is why we are making this funding a priority,\" Scott said. Analysis: What the House GOP's abortion <mark>bill</mark> about-face really means Tampa Bay Times 490 First Avenue South"}, {"articleID": "2014080202_00039679_W", "names": {"Brendan Gleeson": ["Q206659", "Q58170328"]}, "date": "2014-08-01", "url": "http://www.npr.org/2014/08/01/337130171/no-forgiveness-but-a-kind-of-cinematic-grace-in-calvary?ft=1&f=", "content": "hide caption <mark>Brendan Gleeson</mark>, as tough-minded Father James, faces a death threat from an angry parishioner in the darkly comic new <mark>Brendan Gleeson</mark>, as tough-minded Father James, faces a death threat from an angry parishioner in the darkly comic new Reprisal Films Ireland's barrel-chested force of nature <mark>Brendan Gleeson</mark> plays a priest who has a date with murder in Calvary, John Michael McDonagh's comic but darkly existential detective story. The film continues a winning streak for the actor/director team after their terrific comic thriller (and all-time Irish indie box office champ) The Guard, in which <mark>Gleeson</mark> played a surly, often three-sheets-to-the-wind but undeniably effective cop. Calvary, which is apparently the second installment in a planned trilogy (the concluding chapter will be called \"That's a startling opening line,\" observes the tough-minded priest. But the unseen parishioner is not out to startle; he wants to cause pain to match what he's been bottling up for decades. Raped repeatedly as a child by a priest who has since died, he is now hellbent on an irrational act of retribution. \"I'm going to kill you, Father,\" he says calmly. \"There's no point in killing a bad priest. I'm going to kill you because you're innocent .\" Sunday-a-week ought to give him time to put his house in order, he says, and leaves the confessional. \"Calvary is bleak and corrosively funny in about equal measure, with the rugged grey/green landscape suiting the harshness of the village's attitudes about the Church, and repentance, and the worth of good works. Father James, a widower and recovering alcoholic who came late to the priesthood, and has found it suits him, appears as unprepared for this turn of events as we are. But there's a hierarchy to guide him (albeit, one that turns out not to be much help), and pastoral duties to occupy his time. Now, while the priest knows who's threatening him, we don't. And as he makes the rounds of his parish, talking with the police inspector (but not about the threat because the inspector's male prostitute is there), or arguing religion with a squire whose wealth brings him only bitterness, you start to realize pretty much any of his parishioners could be the one. Well, maybe not the jailed rapist cannibal (played in a nice bit of perverse casting by <mark>Gleeson</mark>'s son Domnall), but certainly the arsonists, adulterers, and coke-snorting doctors in his flock. Their callousness leaves Father James regularly astonished. Us, too, and all the while, the clock keeps ticking towards Sunday-a-week. Calvary is bleak and corrosively funny in about equal measure, with the rugged grey/green landscape suiting the harshness of the village's attitudes about the Church, and repentance, and the worth of good works. It is also so clearheaded about the human cost of the church's abuse scandals that it qualifies as something of a leap of faith in its own right. A leap past the forgiveness preached in last year's Oscar nominee, Movie Reviews No Forgiveness, But A Kind Of Cinematic Grace In\" Calvary' Sign In / Register Please keep your community civil. All comments must follow the"}, {"articleID": "2019040408_00427341_W", "names": {"Kevin De Bruyne": ["Q357984", "Q52835665"]}, "date": "2019-04-03", "url": "http://www.90min.com/posts/6336279-neil-warnock-says-cardiff-s-one-day-of-training-played-a-role-in-defeat-to-manchester-city", "content": "Neil Warnock Says Cardiff's \"One Day of Training' Played a Role in Defeat to Manchester City Cardiff City manager Neil Warnock has hailed his side's showing at Manchester City despite the champions recording a straightforward 2-0 victory. The Bluebirds were vastly outplayed on Wednesday night, being afforded just 21% of possession and having only one shot on target during the contest. First-half goals from <mark>Kevin De Bruyne</mark> and Leroy Sane sealed the points for the hosts as they returned to the top of the Premier League with the win. Conversely, Cardiff are five points adrift of Burnley who occupy 17th position in the table. Many would have predicted a rout following <mark>De Bruyne</mark>'s sixth minute opener for the Champions League quarter-finalists, but the visitors showed resilience to maintain a respectable scoreline. Goalkeeper Neil Etheridge was outstanding, preventing further damage with a string of excellent saves. Though they rarely threatened themselves, Warnock was impressed by the attitude and application of his players during the loss. Speaking after the encounter at the Etihad, he said (as quoted by Wales Online):\" I was just really proud of them. To concede a goal as early as that, you do fear the worst. \"[Manchester City] started like the Real Madrid of ten years ago. They're so quick, everybody's comfortable on the ball. We only had one day [of training] after the disappointment of the Chelsea game. FULL-TIME Man City 2-0 Cardiff City go back to the top of the #PL after a comfortable win, sealed thanks to goals from <mark>De Bruyne</mark> and Sane #MCICAR pic.twitter.com/Qi90e3b08J--Premier League (@ premierleague) April 3, 2019\" The circumstances could have knocked a lot of teams, really, \"the 70-year-old continued .\" But they came to see me on Monday morning when I'd mentioned playing the Under-23s tonight and everybody told me, \"Gaffer, we want to play in this game!' - so that was nice .\" Despite the lack of attacking opportunities, the Welsh outfit fared much better in the north-west than some of their fellow strugglers have this season. In this campaign alone City have hit both Southampton and Huddersfield for six, whilst also racking up five goals in their thrashing of Burnley back in October. Related Topics: Cardiff City Top Stories"}, {"articleID": "2008122221_00033542_W", "names": {"Sara Murray": ["Q27538907", "Q7421717"], "Matt Phillips": ["Q11771611", "Q2639636"], "Robert Frank": ["Q2157418", "Q3435143", "Q467574", "Q7344489"]}, "date": "2008-12-22", "url": "http://blogs.wsj.com/marketbeat/2008/12/22/four-at-four-wishing-for-higher-oil-prices/", "content": "thank you for registering. we sent an email to: please click on the link inside the email to complete your registration an account already exists for the email address entered. this service is temporary unavailable due to system maintenance. please try again later. the username entered is already associated with another account. please enter a different username as a registered user of the wall street journal online, you will be able to: december 22, 2008, 4:30 pm four at four: wishing for higher oil prices the markets have a watery consistency to them now, and did not mix well with sinking oil prices monday. with crude once again struggling, falling $2.45 a barrel to close at $39.91, investors elected to flee rather than fight for a rally, instead letting sellers have their way in the first of an expected series of thinly traded sessions. \"once it started selling off, any buyers looking for the bounce said,\" i'll wait for tomorrow,' \"says joseph saluzzi, co-head of equity trading at themis trading. meanwhile, the price of oil continued to slump, even though the switch in contracts to february as the front-month contract on the new york mercantile exchange technically bumped oil up by more than $8 .\" the oil market is very concerning at this point, \"says mr. saluzzi .\" i would rather see a 10-point rise in oil at this point that would be good for the stock market and it would be good for global growth slowly but surely, some asset markets are responding to the litany of moves from the federal reserve. michael darda, chief economist at mkm partners, notes that the difference between three-month libor and the three-month treasury bill has declined to 1.48 percentage points, compared with 2.17 percentage points two weeks ago. the two-year swap rate has declined as well, and corporate bonds have started to respond to the massive influx of liquidity from the central bank, as the average moody's baa-rated corporate bond fell to a yield of 8.11% thursday, and was at 8.71% a week ago. more people are becoming comfortable with the idea of the fed's involvement, and \"and would note that even though the flow of news has become materially worse over the past few months, the djia is not much changed from mid-october,\" writes jeffrey saut, head of investment strategy at raymond james corp. \"basically, the major market indices have gone sideways despite the news, including news of fraud and manipulation. such pricing action suggests participants have capitulated, and that much of the\" selling' has already been done. \"some companies may be run better than others, but they can only do so much in the face of gale-force economic headwinds. shares of toyota motor lost 6% monday, and while gm continues to struggle with its own viability, toyota is facing the rough economic environment. the company said that it expects to post its first-ever operating loss in its current fiscal year, and will barely post any profits, due to the markets .\" this comes as no particular surprise amid the string of announcements detailing plans for production cuts and media previews indicating that earnings will drop into the red, \"write analysts at j.p. morgan chase. the company's losses put its value at a bit more than half of its 52-week peak, when it hit $117.59 a share .\" if there is any surprise, it lies in the seemingly unending chain reaction slide in global automobile sales and the weakness of toyota's own sales within this decline, \"analysts at j.p. morgan write. the company's outlook remains stronger than those of the detroit three, but the struggles of various auto-parts companies as a result of their decisions to defer payment on sales from the big three means could end up hurting toyota as well. among members of the dow jones industrial average, only citigroup and general motors have been worse in 2008 than alcoa, the aluminum giant, which struggles as commodity prices fall sharply. the market's late-day selloff was, in part, tied to a moody's investors service note, which suggested it might downgrade alcoa as a result of weak demand and high costs for the company. shares of the stock lost 6.2% on the day, and the stock has given up more than two-thirds of its value in the last four months. as a result of the falloff in demand, analysts at davenport & co. dropped per-share earnings estimates to $1.54 and 72 cents for 2008 and 2009, compared with $1.62 and $1.89, respectively .\" with the stock currently trading around $9.70 / sh, we continue to see attractive potential return-both short term and long term for alcoa, \"they write, cautioning that\" a higher stock price will likely only come with a rebound in aluminum prices. permalink | trackback url: wsj.com \\'s law blog focuses on law and business, and the business of law. dan slater is the lead writer .'); \"onmouseout =\" hideddrivetip () \"> political perceptions is wsj.com \\'s center for political analysis, with columns by the journal \\'s gerald f. seib and other campaign-watchers, and a daily roundup of the best analysis on the web led by the journal \\'s <mark>sara murray</mark>.');\" onmouseout = \"hideddrivetip ()\" > real time economics offers exclusive news, analysis and commentary on the economy, federal reserve policy and economics. the wall street journal \\'s greg ip and sudeep reddy are the lead writers .'); \"onmouseout =\" hideddrivetip () \"> wsj \\'s health blog offers news and insight on health and the business of health. the lead writer is jacob goldstein. scott hensley is the editor and a contributor .');\" onmouseout = \"hideddrivetip ()\" > environmental capital collects and analyzes news in everything from oil to gas, from ethanol to wind power. it is updated throughout each market day by wsj.com editors, using sources from around the world .'); \"onmouseout =\" hideddrivetip () \"> the daily fix takes a look at the best sports writing on the web .');\" onmouseout = \"hideddrivetip ()\" > the middle seat terminal tracks and unpacks news for travelers with up-to-the minute analysis, insight and advice. the lead writers are middle seat columnist scott mccartney and journal reporter <mark>matt phillips</mark>.'); \"onmouseout =\" hideddrivetip () \"> marketbeat, led by wall street journal online writer david gaffen, looks under the hood of wall street each day, finding market-moving news and analyzing interesting trends and numbers .');\" onmouseout = \"hideddrivetip ()\" > deal journal is an up-to-the-minute take on deals and deal-makers, updated throughout each market day with exclusive news, analysis, data and more. the journal \\'s dana cimilluca and dennis berman are the lead writers .'); \"onmouseout =\" hideddrivetip () \"> the developments blog tracks the housing market, offering analysis, tips and insight for homeowners and home buyers .');\" onmouseout = \"hideddrivetip ()\" > the wealth report is a daily blog focused on the lives and culture of the wealthy, written by the journal \\'s <mark>robert frank</mark>.'); \"onmouseout =\" hideddrivetip () \"> baghdad life examines life in iraq, conditions since the war began and how conditions today compare with life under saddam hussein .');\" onmouseout = \"hideddrivetip ()\" > independent street covers the aspirations, quirks and unique challenges and opportunity of entrepreneurship. the journal \\'s gwendolyn (wendy) bounds, is the lead writer .'); \"onmouseout =\" hideddrivetip () \"> china journal tracks the earth-shaking changes taking place in the world \\'s most populous country, to explain developments in the country \\'s business world, economy, and culture .');\" onmouseout = \"hideddrivetip ()\" > shaping the new agenda top advisers to john mccain and barack obama in an online debate over today \\'s biggest issues, including energy and the environment, trade and immigration, the economy and healthcare .'); \"onmouseout =\" hideddrivetip () \"> olympics opinion leslie hook blogs from beijing, with commentary from journal editorialists and the far eastern economic review .');\" onmouseout = \"hideddrivetip ()\" > marketbeat, led by wall street journal online writer david gaffen, looks under the hood of wall street each day, finding market-moving news and analyzing interesting trends and numbers. the blog is updated several times daily with contributions from reporters at the wall street journal and the online journal and includes noteworthy commentary from the best blogs and research notes. have a comment? write to tech trader daily by longtime barron \\'s west coast editor eric j. savitz provides news and analysis on events important to technology investors .'); \"onmouseout =\" hideddrivetip () \"> stocks to watch today is a daily update on the stocks and market conditions that investors should know about today, by barron \\'s online stocks columnist bob o \\\" brien .'); \"onmouseout =\" hideddrivetip () \"> subscribe rss--subscribe to updated headlines to read from anywhere on the web. for more about rss, click save & share digg--submit this item to be shared and voted on by the digg community. for more about digg, click here. del.icio.us--mark an item as a favorite to access later or share with the del.icio.us community. for more about del.icio.us, click"}, {"articleID": "2011110103_00061514_W", "names": {"Dzulkefly Ahmad": ["Q12685939", "Q5320031"]}, "date": "2011-11-01", "url": "http://theborneopost.com/2011/11/01/glcs-market-record-rm312-billion-under-programme-says-lim/", "content": "nation - glcs market record rm312 billion under programme, says lim kuala lumpur: the market of government-linked companies (glcs) undergoing the glc transformation programme (glct) has gone up to rm312 billion, says deputy finance minister datuk donald lim siang chai. the total collective returns to shareholders of this group of glcs had also gone up by an annual 14 per cent as of october 14 this year since the glct was initiated in may 14, 2004. \"this rise in returns for the group is also up by 1.5 per cent when compared with companies not within the group,\" he said in his reply to a question from dr <mark>dzulkefly ahmad</mark> (pas-kuala selangor) at the dewan rakyat here yesterday. lim said a total of four companies in the group also saw a rise in their key perfomance index (kpi) by 72 per cent last year compared with 64 per cent in 2009. however, several glcs also recorded a drop in their financial performances due to external factors not within their control such as higher oil and raw materal prices, he said. these glcs had taken various measures to face these problems including joining forces with their competing companies and the private sector as well as replanning their market sector. replying to an additional question from dr <mark>dzulkefly</mark>, lim said that in order to avoid the problem of \"overcrowding' in the domestic market, glcs with potential had been advised to venture into larger overseas markets .\" malaysia's population is only 28 million compared with asean's 600 million, and such a big market will provide our glcs a wider market. we are advising them to not only look at asean but also markets like china. \"to a question from datuk idris haron (bn-tangga batu), lim said the foreign consultant appointed to helm the glct had helped to implement the programme well and had successfully raised the glcs' businesses."}, {"articleID": "2018091513_00194504_W", "names": {"John Singleton": ["Q363005", "Q6258000"]}, "date": "2018-09-14", "url": "http://insideedition.com/student-pilot-who-landed-safely-after-losing-wheel-first-solo-flight-returns-air-46814", "content": "Search Enter the terms you wish to search for. Student Pilot Who Landed Safely After Losing a Wheel on First Solo Flight Returns to the Air News 6:06 AM PDT, September 15, 2018 - Inside Edition Staff Student Pilot Who Landed Safely After Losing a Wheel on First Solo Flight Returns to the Air 6:06 AM PDT, September 15, 2018 - Inside Edition Staff hh: mm: ss The 17-year-old student pilot who successfully landed a plane that lost a wheel during her first solo flight marked her return to the air just days after the frightening incident. Maggie Taraska had just taken off in a single-engine Piper PA-28 Warrior Sunday when the aircraft's right main wheel fell off. \"I was just petrified, I was thinking about all of the bad things that could've happened; I was thinking about how my parents were on the ground and I knew that they were watching,\" Taraska told Inside Edition. Taraska circled the Beverly Regional Airport in Massachusetts for a half-hour under the guidance of her flight instructor and air traffic controllers, and was able to walk away unscathed after landing the plane perfectly. And just several days later, Taraska returned to the tarmac and returned to the sky. \"I'm not nervous right now,\" she said ahead of her flight. \"I don't know how I'm gonna feel once I'm up there, but I'm hopeful everything's going to be fine .\" Taraska went to work ensuring her pre-flight safety inspections were completed before taking off, checking the wings, wheels and under the hood before buckling up and starting the engine. Taraska's flight instructor, <mark>John Singleton</mark>, accompanied her on the flight, which lasted about 30 minutes. Her parents, both Air Force veterans, watched from the ground and sang her praises. And Taraska was all smiles as she landed the plane safely. \"It feels amazing,\" she said of being back up in the air. \"It feels really freeing .\" Taraska has already logged 60 hours of flying. RELATED STORIES"}, {"articleID": "2018102803_00104406_W", "names": {"Marcus Harris": ["Q1379373", "Q17708799", "Q6758213", "Q6758214"], "Roger Vaughan": ["Q52086338", "Q57739110"], "Trent Copeland": ["Q15052216", "Q7838379"], "Mickey Edwards": ["Q1931352", "Q41446770"]}, "date": "2018-10-28", "url": "https://www.theage.com.au/sport/cricket/peter-handscomb-talks-up-harris-test-claims-20181028-p50cgw.html?ref=rss&utm_medium=rss&utm_source=rss_feed", "content": "Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims Peter Handscomb talks up <mark>Harris</mark>' Test claims By <mark>Roger Vaughan</mark> Larger text sizeVery large text size Victorian captain Peter Handscomb would have had <mark>Marcus Harris</mark> in the Test batting debate well before the opener's career-best innings. <mark>Harris</mark> was man of the match for his unbeaten 250 as Victoria thrashed NSW by an innings and 107 runs in their Sheffield Shield match at the MCG. Test consideration? <mark>Marcus Harris</mark>. AAP Credit: Injured tailenders <mark>Trent Copeland</mark> and <mark>Mickey Edwards</mark> defied Victoria for an extra half an hour on Saturday, taking the game into day four. But paceman Scott Boland bowled <mark>Edwards</mark> in the second over on Sunday morning to dismiss NSW for 179 and seal Victoria's second innings win in as many Shield Games. Victoria are on a roll, having also won the one-day title, and now <mark>Harris</mark> has entered the Test batting debate with his first double ton at any level. Advertisement <mark>Harris</mark> has impressed Handscomb since coming to Victoria from WA two years ago. \"He's really put his hand up, but he's been doing a good job for us since he came here,\" Handscomb said. \"It's a shame that it's taken this long for his name to come up .\" I think he was a chance earlier, for sure. \"NSW captain Peter Nevill also praised <mark>Harris</mark>' innings, but noted the game might have turned out much differently had they not dropped a chance from the opener when he was yet to score. <mark>Harris</mark>, 26, left WA with a stinging critique from then-WA coach Justin Langer, now in charge of the national team, who called him mediocre with flashes of brilliance. But <mark>Harris</mark> has scored 1790 Shield runs since the move, the most in that time. He has eight Shield tons, including two last season, and in 65 first class matches <mark>Harris</mark> has scored 3928 runs at an average of 35.38. Handscomb, another potential Test candidate, was left kicking himself when he did a lot of hard work to reach 48, only for a poor shot to end his innings .\" I'm trying not to focus on the one ball I stuffed up and focus more on the 79 that I played really well, \"he said .\" I felt good out there...unfortunately I made one mistake and that's the batter's game. \"But I'm not that worried, I'm not that frustrated and I'm just very happy with how my game's going, but more importantly how the team is going .\" Boland also starred for Victoria in the second innings with 6-49. Handscomb and rival captain Nevill praised the new-look MCG wicket. It is the first Shield or Test result at the MCG since NSW won in February last year by an innings. \"It's obviously better than it has been...it's a great improvement,\" Handscomb said. Nevill was left lamenting his team's 7-56 batting collapse in the first innings and another 4-0 slump on Saturday. AAP"}, {"articleID": "2019030205_00301750_W", "names": {"David Morgan": ["Q12899555", "Q15486799", "Q18685631", "Q21063610", "Q21452763", "Q26250588", "Q30122174", "Q30122521", "Q3703268", "Q5237706", "Q5237709", "Q5237710", "Q5237711", "Q5237716", "Q56596970"], "John Kelly": ["Q1529538", "Q16121409", "Q16190651", "Q19950171", "Q20679793", "Q21543413", "Q23008537", "Q27915220", "Q27915222", "Q3181857", "Q42290073", "Q43132411", "Q45190351", "Q56597784", "Q6232322", "Q6242695", "Q6242701", "Q6242710", "Q6242715", "Q6242718", "Q6242722", "Q6242726", "Q6242728", "Q6242740"]}, "date": "2019-03-01", "url": "https://www.euronews.com/2019/03/01/us-house-panel-demands-kushner-clearance-details-from-white-house", "content": "U.S. House panel demands Kushner clearance details from White House U.S. House panel demands Kushner clearance details from White House By Reuters Text size Aa Aa By <mark>David Morgan</mark> WASHINGTON (Reuters) - A Democratic-led congressional panel on Friday demanded that the White House comply with requests for documents and witnesses for a probe into alleged security clearance abuses involving President Donald Trump's son-in-law Jared Kushner and others. After weeks of White House stonewalling, House Oversight Committee Chairman Elijah Cummings, in a letter to the White House, said \"I am now writing a final time to request your voluntary cooperation .\" Cummings panel has subpoena power. Cummings highlighted in his letter a New York Times story that said Trump ordered his former chief of staff <mark>John Kelly</mark> to provide Kushner with clearance over objections from <mark>Kelly</mark> and Donald McGahn, then White House counsel. [nL1N20N2CM] The Times said <mark>Kelly</mark> and McGahn both wrote memos about the incident and that McGahn outlined concerns raised about Kushner by career security officials, including CIA officers. \"If true, these new reports raise grave questions about what derogatory information career officials obtained about Mr. Kushner to recommend denying him access to our nation's most sensitive secrets,\" Cummings wrote to White House Counsel Pat Cipollone in the March 1 letter, which appeared to set the stage for his committee to subpoena the material. The White House did not immediately respond to a request for comment. The Oversight Committee launched its investigation on Jan 23. Cummings said he and his staff have since written and spoken to White House officials multiple times about obtaining documents and witnesses, but to no avail. Kushner's temporary clearance was suspended by <mark>Kelly</mark> in February 2018, along with other officials operating under temporary clearances, as part of measures to tighten procedures after White House staff secretary Rob Porter was fired when his two ex-wives raised charges of domestic abuse. Cummings said he has provided the White House with detailed descriptions of security clearance abuses by at least nine high-level White House officials including Kushner and current and former national security advisers. The House Democrat's letter included a transcript from a Jan. 31 Times interview with Trump, in which the president denied ordering <mark>Kelly</mark> to overrule security officials and provide clearances for Kushner. Trump said he did not think he had the authority to overrule security officials on clearance matters, according to the letter. But White House adviser Kellyanne Conway told an NBC interviewer on Friday that Trump has said he has \"absolute authority\" to order security clearances. Cummings gave the White House until Monday to respond to his latest demands. His panel's probe is part of a wide-ranging effort by House of Representatives Democrats, launched since they took majority control of the chamber in January, to investigate Trump, his presidency and his business interests. (Reporting by <mark>David Morgan</mark> and Susan Heavey in Washington; Editing by Kevin Drawbaugh and James Dalgleish) euronews provides breaking news articles from reuters as a service to its readers, but does not edit the articles it publishes. Articles appear on euronews.com for a limited time. Share this article"}, {"articleID": "2012041218_00099412_W", "names": {"Owais Shah": ["Q23664755", "Q6831317"]}, "date": "2012-04-12", "url": "http://indiatimes.com/cricket/gambles-we-took-paid-off-pollard-19632.html", "content": "mumbai: big-hitting west indian all-rounder kieron pollard said the gambles mumbai indians took worked for the team in the win over rajasthan royals in the indian premier league. the 24-year-old trinidadian, who scored a blistering 64 off 33 balls and grabbed 4/44, referred to bringing back pace spearhead lasith malinga to bowl the 15th over and his promotion in the batting order, as the two gambles taken by his team. \"we took a gamble in bringing back malinga (in the 15th over) to get a wicket as <mark>owais shah</mark> was batting pretty well. so we took the gamble and it worked for us. some days it would work, some days it wouldn't .\" this is t20 cricket. it just takes just one chance and one over to change the game, \"he said after mi's 27-run victory on wednesday that pitchforked the team into the top of the league table. malinga stumped royals' charge by getting rid off <mark>shah</mark>, who made a belligerent 76 off 42 balls, off the first ball of his new spell, which turned the match in mi's favour. about his promotion in the batting order pollard said,\" i batted at 5 today. (in the) first game i didn't bat, (in the) second game i batted at 7. some days it would come off, some days it wouldn't. today it was a good day and it came off. \"i just play my game and know exactly what to do. i am coming off a series against australia (t20 and odi). it's just a matter of continuing (what i did), adapting to the conditions here in india, continue what i was doing. i would take it from there, game by game and situation by situation (batting higher up),\" he said. against australia in the odi series, he mustered knocks of 4, 47 not out, 36, 102 and 33. the west indian all-rounder, who brought off a few outstanding stops on the boundary besides taking a catch, was happy to get his first fifty in his ipl career and said it would boost his confidence. \"it's my first 50. i don't think you expect me to get a fifty from 17 to 20 overs. i got the opportunity today, it worked for us. it was the first for me and has given me the confidence .\" pollard said the team had gained some momentum with back-to-back wins over deccan chargers and rr. \"yes it's an important victory, first in a home game. we have to make use of 7 or 8 of them. we have the momentum but it's important to continue that throughout the tournament .\" he was of the opinion that the wicket at the wankhede stadium for the game was a better one for batting than the previous one against pune warriors on april 6. \"this one was a better track, with the ball coming on to the bat. we batted well...we knew a score of 160 wouldn't be enough on this .\" in a lighter vein he said he wanted to teach his trinidadian compatriot kevon cooper a lesson, when asked about the six he hit off the royals' bowler off the first ball he faced from his countryman. \"we have played junior cricket (for trinidad and tobago under 19) together. (jokingly) i just wanted to teach him a lesson (first ball six). we could later laugh about it. but it's good for him playing for rajasthan royals. i am happy for him. all of us are trying to play our best. i hope he continues the good work .\" asked about the good fight the west indies were currently giving to australia in the series at home, pollard said captain darren sammy and the other members of the home team had decided to play fire with fire and it was coming off. \"i can't talk about the current bunch as i recently left from them (after the odi series). the fighting spirit is there. we have decided not to back down and play them (australians) hard. and that's what we did .\" we had decided to match australia in aggression. just wanted to show australia we are not going to be bogged down. hope they can come out with a draw even if they don't win the test match, \"said pollard whose first odi ton came against india last season at chennai. his wish, however, came unstuck as australia managed to squeak home past the 192-run target with three wickets in hand in fading light, to win the test series opener at bridgetown, barbados. comments are moderated and will be allowed if they are about the topic and not abusive."}, {"articleID": "2018033109_00085814_W", "names": {"Stephen Harris": ["Q27832749", "Q32103448", "Q56872533", "Q56872534", "Q7609429"], "Juan Alvarez": ["Q5953695", "Q6298824"]}, "date": "2018-03-31", "url": "http://www.rappler.com/life-and-style/travel/ph-travel/199245-misibis-bay-resort-nature-green-resort-albay", "content": "Enjoying nature in Albay's sole high-end green resort PH Travel Enjoying nature in Albay's sole high-end green resort Tourists are welcomed by a school of fish at the breakwater of the Marina Bay area of Misibis Bay Resort, less than 10 meters away from the shore Published 5:24 PM, March 31, 2018 Updated 5:28 PM, March 31, 2018 UNDER THE SEA. Tourists swim and glide with a school of fish at the Marina Bay area of Misibis Bay resort in Cagraray Island, Bacacay town. Photo by Rhaydz Barcia ALBAY, Philippines--In Albay's sole high-end resort situated in Cagraray Island in Bacacay town, tourists don't need to go far from the shoreline to catch a glimpse of colorful fish. Tourists are welcomed by a school of fish at the breakwater of the Marina Bay area of the Misibis Bay Resort, less than 10 meters away from the shore. <mark>Stephen Harris</mark>, a Canadian tourist along with his Filipina wife Celeste snorkeled within the Marina area of the resort. The couple returned to Misibis Bay Resort after 9 years. \"We're supposed to be heading to Catanduanes but we decided to go back in Misibis 9 years after our first visit here. It was an amazing experience again with a lot of development, with healthy corals home of different colorful fish and of marine life,\" <mark>Stephen</mark> said. <mark>Stephen</mark> did not use any GoPro underwater camera to capture the rich marine life. He described the bay as a \"paradise\" with clean water and rejuvenating coral reefs. Green resort Misibis Bay is a resort with a fish sanctuary, and is to home giant clams. Located in Barangay Misibis, the resort known for its white sand beach is the first high-end \"green\" resort in Bicol as it is powered by solar panels. Cecille Balala, associate engineering manager of Misibis Bay, said that the solar panels genetate 310 kwh per day. Businessman Elizaldy \"Zaldy\" S. Co of Sunwestville Realty and Development Corporation developed Misibis Bay and Residential Resort. Co wants to put Bicol on the world map. \"We put up this resort to change the perception that Bicol can be proud no more than Mayon Volcano .\" Co said, adding that the resort was built with enviromental protection in mind. The resort counts as among its guests world leaders, local celebrities, Hollywood actors, international models and beauty queens, and NBA players. Natural beauty On the way to the resort, visitors can stop to appreciate panoramic views of islets with Mayon volcano as a backdrop; Sula Channel, which used to provide sanctuary galleons during typhoons when the country was still under Spanish rule; and Albay Gulf and the rolling mountains. From the resort, one can walk head to caves which houses limestone formations. Pototan Cave in neighboring Batan Island can be reached by boat. Just 20 minutes from the resort is Pighologan Cave. After a half-hour boat ride through the underground riven, tourists can visit the monkey sanctuary in Manaet Islet. Historically, Cagraray Island in Bacacay town where the Misibis Bay Resort is located is considered as a historical jewel because of the archeological relics found there between l879 and 188. <mark>Juan Alvarez</mark> Guevarra found sacred burial jars in two of at least 28 caves in the island. Local historians suggest that these archeological evidences could prove that Cagraray Island was the cradle of Bicolano civilization about 200,000 to 300,000 years ago. The construction of a coastal road network in Cagraray Island is underway former Bicol tourism regional director Maria Nini Ong-Ravanilla worked out the development of Cagraray Island with the help of Albay lawmakers .--Rappler.com"}]