[{"date": "2013-12-23", "url": "http://www.football365.com/news/21554/9085918/Moyes-Sees-Leadership-Qualities-In-Rooney", "content": "T here are plenty of reasons why Frank De Boer would join Spurs. Plus, can West Ham...Sky Bet are paying 1/4 the odds on all each-way bets on the top four Premier League goalscorers this season. Robin van Persie, <mark>Luis Suarez</mark>, Daniel Sturridge and Sergio Aguero are front-runners in the betting market. Check out the latest outright odds on next summer's World Cup in Brazil, where the hosts are the favourites. Predict six correct scores for your chance of winning the? 250k jackpot. Terms and Conditions apply. Who will be the next managerial casualty in the Premier League? Chris Hughton and Andre Villas-Boas are available to back with Sky Bet. Wayne Rooney: Hailed for his leadership qualities Rooney, who was an injury doubt before this weekend's game, was instrumental in United's 3-1 win over West Ham and Moyes believes the England international is now playing a key role in helping his team-mates improve. Moyes has been impressed by Rooney's attitude since taking over at Old Trafford and believes the 28-year-old is showing more maturity on his way to becoming a true United great as he enters his tenth year at the club. \"Do you know what I see more than anything in Wayne? I see leadership,\" said Moyes. \"I see somebody who wants to take responsibility for the team. I see somebody who cares for how he plays and how the team plays. More than anything, that is what I see from Wayne .\" Maybe if he is not quite at the top of his form I will need him to drop in at times and he has no problem doing any of the jobs. He is getting to an age now where he realises he is not a boy any more. He is one of the senior men in the team. He is actually on the verge of being one of the great legends at this club. S oldado's three chances on a plate include one against an advancing keeper from an extremely oblique angle and one stretching awkwardly just to get a touch on a bouncing cross. The other he created himself. Behave. R eplace a proven winner with a complete amateur, about 1% of the time it works, great odds Spurs fans! Oh, he's won one game, well he must have what it takes then, my mistake! Liverpool boss <mark>Brendan Rodgers</mark> says <mark>Luis Suarez</mark> deserves world class tag Liverpool boss <mark>Brendan Rodgers</mark> believes <mark>Luis Suarez</mark> deserves to be mentioned as one of the best players in the world. Premier League: Chelsea boss Jose Mourinho keen to stay for 12 years Jose Mourinho believes stability is the key to success and hopes to remain in charge of Chelsea for another 12 years. West Ham defender <mark>James Tomkins</mark> charged over police officer assault There are plenty of reasons why Frank De Boer would join Spurs. Plus, can West Ham spring another upset at Old Trafford on Saturday? And thoughts on Liverpool's challenge ...", "articleID": "2013122317_00041029_W", "names": {"James Tomkins": ["Q1681200", "Q1681210"], "Luis Suarez": ["Q26517", "Q270367"]}}, {"date": "2013-12-23", "url": "http://hollywoodreporter.com/news/rds-renews-canadiens-regional-rights-667468", "content": "After Rogers' NHL deal, Bell Media keeps hockey on its French language cable sports channel as it now bids for Ottawa Senators rights. Bell Media's RDS cable sports channel has renewed a regional TV rights deal for Montreal Canadiens games for another 12 years. Terms of the deal were not disclosed. But the agreement is key for Bell Media as it has French language subscribers still viewing Canadiens games going forward after the broadcaster was recently outbid by rival Rogers Communications for the national NHL TV rights as part of a US $4.9 billion, 12-year deal. The latest RDS-Canadiens deal includes continuing naming rights to Montreal's Bell Center for Bell Canada, and covers broadcast rights for 60 regular season games, and additional pre-season games each season. Bell Media and Rogers are also bidding for separate regional TV rights to Ottawa Senators games as broadcasters look to airing live NHL games to discourage cable and satellite TV subscribers from cutting or shaving the cord in the digital age. Rogers' Sportsnet cable channel currently has the regional TV rights to Senators games, and so is expected to pay dearly to retain the games in the face of competition from a hockey-hungry Bell Media. \"Duck Dynasty': Petition to Reinstate Star Passes 100,000 Signatures The latest installment in <mark>Peter Jackson</mark>'s trilogy focuses on the dwarves of Erebor's attempt to reclaim the Lonely Mountain. Tom Hanks and Barkhad Abdi reveal secrets of filming their drama\" Captain Phillips. \"The film centers on a 2009 hijacking by Somali pirates .\" It's not very glamorous, but was old school show business. That's how it worked for me, \"Hanks says .\" The Grandmaster' Trailer 2 Wong Kar Wai's biopic of Bruce Lee's kung fu teacher, Ip Man. The martial arts action movie from The Weinstein Co. is set to be released on Aug. 23. George Clooney's \"The Monuments Men' Unveils New Campaign To Find Lost Art Justin Bieber's\" Backpack' Drops With Lil Wayne Off Of \"Journals '", "articleID": "2013122322_00094983_W", "names": {"Peter Jackson": ["Q25521960", "Q3376667", "Q39073400", "Q4160117", "Q4465", "Q52743056", "Q54556363", "Q7174914", "Q7174916", "Q7174918", "Q7174919", "Q7174920", "Q7174922", "Q7174923"]}}, {"date": "2013-12-29", "url": "http://www.wnd.com/2013/12/navy-seals-humiliated-by-political-correctness/", "content": "WND Exclusive: N.Y. Times serves up baloney on Benghazi WND Exclusive: Obamacare used to elevate \"gay' lifestyle WND Exclusive: Spy vs. spy: 2 famous defectors on Russian super-deception WND Exclusive: Ordinance challenged for targeting pro-lifers WND Exclusive: No place to hide from Jesus in this city WND Exclusive: Theologian:\" Brain-dead' doesn't really count WND Exclusive: U.S. slams \"conservative gender norms' WND Exclusive: Obama's NSA watchdog:\" Reasonable' to track cars WND Exclusive: Duck Commander's faith persuades A & E to back down Navy SEALS humiliated by political correctness The night of Sept. 1, 2009, Echo Platoon of Navy SEAL Team 10 headed out into the Fallujah night. Their goal: concluding a five-year search for the al Qaeda killer who had been responsible for the shocking 2004 murders of four American military contractors - one of them an ex-SEAL - whose bodies were then burned, dragged through the streets and hanged from a bridge. This night the SEALs departed with these words from their commanding officer: \"Gents, stay sharp, and expect a firefight .\" In the event, no shots were fired, but the SEALs faced another kind of ambush: a humiliating, baffling, infuriating struggle with the military-justice system that would end with an unsatisfying victory. (Rate this) meta itemprop = \"description\" content = \"(NEW YORK POST) By <mark>Kyle Smith</mark> The night of Sept. 1, 2009, Echo Platoon of Navy SEAL Team 10 headed out into the Fallujah night. Their goal: concluding a five-year search for the al Qaeda killer...\"> div style =\" display: none; \"itemprop =\" aggregateRating \"itemscope itemtype =\" http: //schema.org/AggregateRating \">", "articleID": "2013123002_00055443_W", "names": {"Kyle Smith": ["Q11863385", "Q15043215", "Q24005542", "Q26837179", "Q6451443", "Q6451444"]}}, {"date": "2014-01-02", "url": "http://www.bbc.co.uk/news/uk-england-25568974#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa", "content": "Print Yalding residents get sandbags amid new flooding fears Sandbags have been given to residents in areas of Kent severely affected by flooding over the Christmas period, following more rainfall. Maidstone Borough Council said it delivered supplies to people in several streets in Yalding and Maidstone. It said water levels would peak on Thursday afternoon. We have got to do more and we have got to do better \"<mark>David Cameron</mark> In a statement on its website, the Environment Agency said:\" Flooding is not expected to be to the extent of flooding at Christmas. \"We are continuing to monitor the situation and will update this message if the situation changes .\" Prime Minister <mark>David Cameron</mark> was confronted by a flood victim as he visited Yalding, on Friday, where homes were damaged by floodwater. Resident Ericka Olivares criticised the response of the power firms and local authority but the leader of Kent County Council, <mark>Paul Carter</mark>, defended the way the crisis had been handled. Trains disrupted Following his encounter with Ms Olivares, Mr <mark>Cameron</mark> said the severity of flooding in the area made it difficult to ensure homes were protected, but \"we have got to do more and we have got to do better\". Power was restored to most villagers on Saturday. Warnings are also in place for parts of Surrey, including near the River Mole. South West Trains said flooding meant there were no services were running between Teddington in Richmond, south-west London, and Shepperton in Surrey. Rail firm Southern said trains were still not running between Horsham and Dorking, after a major landslip on Christmas Eve. FLOODY HELL: Britain braced for MONTHS of heavy rain and yet MORE winter storms Watch How will New York's new mayor change policing?", "articleID": "2014010217_00013760_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "Paul Carter": ["Q15434260", "Q15458398", "Q16230104", "Q22003572", "Q29785709", "Q47400077", "Q53186219", "Q58262322", "Q7149747"]}}, {"date": "2014-01-06", "url": "http://www.witn.com/home/headlines/238939511.html", "content": "It's winter, right? So what's the big deal about an arctic blast? One meteorologist made it plain. \"When it gets this cold, people die,\" said CNN's Chad Myers. Even folks in cold climates are often not equipped to deal with the conditions they are experiencing, like a -50 degree wind chill in Chicago. Also, the dangerous cold is gripping much of the U.S. in a way that hasn't happened for decades. Records are being broken. Millions of people, including us here in Eastern Carolina, are impacted. NBC's Al Roker said think of this as a \"polar hurricane .\" It's called a polar vortex, a giant pool of cold air tens of thousands of feet above us. The vortex normally spins at the poles. This one is making headlines because it has moved so far south, causing freezing temperatures for so many of us. The lowest temperature ever recorded in our state was in 1985, according to the state climate office, which lists -32 degrees at Grandfather Mountain in Avery County on that date. That record is expected to stand, as the lowest temperature expected during this vortex assault at Grandfather Mountain is -7 or so. After Monday night, the high in Eastern Carolina isn't supposed to pop back up above freezing until Wednesday. So while frigid temps will grip our lives for a short while, it won't be too long before more normal conditions return. Even better, highs in the 60s are on tap for the weekend. Read the Associated Press story on the big vortex weather picture below. Frigid, dense air swirled across much of the U.S. on Monday, forcing some cities and their residents into hibernation while others layered up and carried on despite a dangerous cold that broke decades-old records. Wind chill warnings stretched from Montana to Alabama. For a big chunk of the Midwest, the subzero temperatures moved in behind another winter wallop: more than a foot of snow and high winds that made traveling treacherous. Officials closed schools in cities including Chicago, St. Louis and Milwaukee and warned residents to stay indoors and avoid the frigid cold altogether. The forecast is extreme: Wind chills were expected to drop as low as negative 55 Monday night in International Falls, Minn., and rebound to minus 25 to minus 35 on Tuesday. Farther south, the wind chill is expected to hit negative 50 in Chicago and minus 35 in Detroit. School systems and day cares shut down as a precaution from the Dakotas to Maryland. But whether residents chose to stay home or head outside appeared to have less to do with the mercury and more with conditioning. Emeric Dwyer of St. Paul wore only a London Fog trenchcoat and light scarf to protect himself from morning temperatures that got down to minus 20 in the Twin Cities. The 30-year-old was just glad his car started. \"It made a grinding noise I never heard before. But it started and got us here. Not too much to complain about,\" said Dwyer, who is originally from Duluth in the northern part of the state. \"In Duluth it's always cold,\" he said. But it hasn't been this cold for almost two decades in many parts of the country. The National Weather Service said the temperature sank to 16 degrees below zero at Chicago's O'Hare International Airport, two degrees lower than the record for Jan. 6. Weekend snowfall at the airport totaled more than 11 inches - the most since a February 2011 storm that shut down the city's famed Lake Shore Drive. In Indiana, where many roads were rendered impassable because of snow and wind, authorities had a simple message: stay home. \"I know the roads look clear, the sun's out and it all looks nice,\" Indianapolis Mayor <mark>Greg Ballard</mark> said Monday. \"But it's still minus 40 in wind chill - deadly temperatures. So we want to be very, very careful .\" <mark>Ballard</mark> issued a travel ban for the city, making it illegal for anyone to drive except for emergencies or to seek shelter, until noon Monday. But he wants schools and businesses to remain closed another day until the worst of the severe cold passes. Much of Indiana was blanketed in about a foot of snow Sunday, and many of the state's schools, businesses and municipal offices were closed Monday. Wind chills through Tuesday could reach 45 degrees below zero, according to the National Weather Service. The Legislature postponed the opening day of its 2014 session, and the state appellate courts, including the Indiana Supreme Court, said they would be closed. Many other cities came to a virtual standstill. In St. Louis, where more than 10 inches of snow fell, the Gateway Arch, St. Louis Art Museum and St. Louis Zoo were part of the seemingly endless list of closed facilities. Shopping malls and movie theaters closed, too. Even Hidden Valley Ski Resort, the region's only ski area, shut down. Further north, those more accustomed to extreme winter weather kept moving, even if just a bit slower than usual. Between a heater that barely works and the drafty windows that invite the cold air into his home, Jeffery Davis decided he'd be better off sitting in a downtown Chicago doughnut shop for three hours Monday until it was time to go to work. He threw on two pairs of pants, two t-shirts, \"at least three jackets,\" two hats, a pair of gloves, the \"thickest socks you'd probably ever find\" and boots, and trudged to the train stop in his South Side neighborhood that took him to within a few blocks of the library where he works. \"I never remember it ever being this cold,\" said Davis, 51. \"I'm flabbergasted .\" Elnur Toktombetov, a Chicago taxi driver, awoke at 2:30 a.m. Monday anticipating a busy day. By 3:25 a.m. he was on the road, armed with hot tea and doughnuts. An hour into his shift, his Toyota's windows were still coated with ice on the inside. \"People are really not comfortable with this weather,\" Toktombetov said. \"They're really happy to catch the cab. And I notice they really tip well .\" In downtown Chicago, a commuter train hit a \"bumping post\" as it pulled into a station, the second such accident of the day. Metra spokesman Michael Gillis said six passengers were taken to a hospital with minor injuries Monday after the train hit the post at the end of a platform. A less serious incident occurred at the same station around 6:15 a.m., but no passengers were injured. Continuing a decades-old practice, Chicago Transit Authority was handing out fare cards to social service agencies to be distributed to the homeless so they could ride buses and trains to stay out of the cold. More than 40,000 homes and businesses in Indiana, 16,000 in Illinois and 2,000 in Missouri were without power early Monday. Indianapolis spokesman Marc Lotter said emergency crews accompanied about 350 people to shelters around the city. Southern states were bracing for possible record temperatures too, with single-digit highs expected Tuesday in Georgia and Alabama. SHERIFF: Onslow County Shooting Ruled Self-Inflicted POLICE: 5-Kilos Cocaine Found In Car Battery, 2 Arrested For Trafficking In Pitt County WITN 275 E. Arlington Blvd.. Greenville, NC 27858 252-439-7777", "articleID": "2014010707_00060757_W", "names": {"Greg Ballard": ["Q2340949", "Q5251212"]}}, {"date": "2014-01-08", "url": "http://www.bloggingtheboys.com/2014/1/8/5289326/first-coaching-change-dallas-cowboys-chris-boniol-rich-bisaccia", "content": "Dallas' Mr. Reliable is losing his coach. - Matthew Emmons-USA TODAY Sports Dallas Cowboys kicking coach Chris Boniol is leaving the team. \"<mark>Jerry Jones</mark>, <mark>Stephen Jones</mark> and Jason Garrett all made great cases on behalf of me staying, and they've all been tremendous to work with,\" Boniol says. \"But we've mutually agreed to move on, with me having some of the best memories and best accomplishments of my life being part of the Cowboys .\" If there was one coach that no one had any complaints about this year, it is the guy who oversaw punter <mark>Chris Jones</mark> and the extremely reliable placekicker Dan Bailey, or, as KD Drummond prefers to refer to him, \"Split 'em\". No matter how you look at it, his contributions to the team were tremendously successful. The article does not really give any reasons for the departure, but you have to suspect that Boniol wants to test the market for his services elsewhere, perhaps as a special teams coordinator. Fisher goes on to say that this is an indication that special teams coordinator Rich Bisaccia, another coach who is almost universally seen as having been very successful in 2013, is not likely to be leaving. Bisaccia has a couple of interviews for head coaching positions set up, and his loss would almost certainly have been a negative for Dallas. It looks like Fisher is reading between the lines that the Cowboys would not need to keep Boniol as a possible replacement. He also may have some other information he is not putting in his article. you can check it here, and catch Dawn Macelli's report on the other players already signed .) The players are: Chris DeGeare, guard. 2010 fifth round draft choice from Wake Forest. Played with Minnesota Vikings, spent time on practice squads there and with the Tristan Okpalaugo, defensive end. 2013 UDFA from Fresno State. Signed with Miami Dolphins and spent a week with Minnesota's practice squad, on the street since September. Quinton Spears, linebacker. 2011 UDFA from Prairie View A & M. Signed with Miami, then played most of the season with the Cleveland Browns. Out of the league in 2012, and then was signed by the Jabara Williams, linebacker. 2011 seventh round pick from <mark>Stephen</mark> F. Austin by the St. Louis Rams. Played two games with them, then was released and played a few games with the Chicago Bears. Spent 2012 on the Rams practice squad, and was out of the league last season. Dallas Cowboys News & Notes: For Cowboys, The Sun Always Shines On TV Would Another Dallas-San Francisco Trade Work? about 8 hours ago / 334 comments / 3 recs", "articleID": "2014010906_00061906_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "Jerry Jones": ["Q1280022", "Q16643824", "Q25190360"], "Stephen Jones": ["Q11836360", "Q1380938", "Q17476791", "Q2374211", "Q25345871", "Q2670107", "Q4160428", "Q43565191", "Q47119713", "Q56598186", "Q7609616", "Q7609617", "Q7609618", "Q7609619", "Q7609620", "Q7609622", "Q7609623", "Q7612967"]}}]