[{"articleID": "2009022422_00039339_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"], "John Adams": ["Q15241538", "Q15501272", "Q16147832", "Q16149461", "Q16646023", "Q19819745", "Q22937675", "Q23302617", "Q27914979", "Q47545565", "Q48294679", "Q51586570", "Q54932731", "Q6218170", "Q6218173", "Q7224739", "Q788469", "Q84114"]}, "date": "2009-02-24", "url": "http://blogs.myspace.com/index.cfm?fuseaction=blog.view&friendId=103251098&blogId=364114040", "content": "gender: male status: in a relationship i'm not normally one for quotes, but these guys and gals say it better than i can. enjoy. \"religion has actually convinced people that there's an invisible man--living in the sky--who watches everything you do, every minute of every day. and the invisible man has a special list of ten things he does not want you to do. and if you do any of these ten things, he has a special place, full of fire and smoke and burning and torture and anguish, where he will send you to live and suffer and burn and choke and scream and cry forever and ever 'til the end of time!. . but he loves you .\" --george carlin \"when i was a kid i used to pray every night for a new bicycle. then i realised that the lord doesn't work that way so i stole one and asked him to forgive me .\" --emo philips \"is god willing to prevent evil, but not able? then he is not omnipotent. is he able, but not willing? then he is malevolent. is he both able and willing? then whence cometh evil? is he neither able nor willing? then why call him god?\" --epicurus \"men never commit evil so fully and joyfully as when they do it for religious convictions .\" --blaise pascal \"the church says the earth is flat, but i know that it is round, for i have seen the shadow on the moon, and i have more faith in a shadow than in the church .\" --ferdinand magellan \"religion is what keeps the poor from murdering the rich .\" --napoleon bonaparte \"those who believe absurdities will commit atrocities .\" --voltaire \"he that will not reason is a bigot; he that cannot reason is a fool; he that dares not reason is a slave .\" --william drummond \"i have examined all the known superstitions of the world, and i do not find in our particular superstition of christianity one redeeming feature. they are all alike founded on fables and mythology .\" --<mark>thomas jefferson</mark> \"we must conduct research and then accept the results. if they don't stand up to experimentation, buddha's own words must be rejected .\" --tenzin gyatso, 14th dalai lama, 1988 \"the government of the united states is in no sense founded on the christian religion .\" --<mark>john adams</mark>, 2nd president of the united states \"the easy confidence with which i know another man's religion is folly teaches me to suspect that my own is also .\" --mark twain \"i would defend the liberty of consenting adult creationists to practice whatever intellectual perversions they like in the privacy of their own homes; but it is also necessary to protect the young and innocent .\" --arthur c. clark \"the presence of those seeking the truth is infinitely to be preferred to the presence of those who think they've found it .\" --terry pratchet"}, {"articleID": "2011032811_00078527_W", "names": {"Chris Lee": ["Q1077464", "Q1077474", "Q12305774", "Q16221404", "Q22670603", "Q25190239", "Q27793227", "Q30028923", "Q42873342", "Q4575323", "Q5107215", "Q602180", "Q698103", "Q9183619"], "Mike Hamilton": ["Q6847116", "Q6847117"], "Chris Mooney": ["Q1077566", "Q5107483", "Q5107484"]}, "date": "2011-03-28", "url": "http://dispatch.com/live/content/sports/stories/2011/03/28/tennessee-hires-martin-as-coach.html?sid=101", "content": "<mark>chris lee</mark> | st. louis post-dispatch tennessee hired missouri state's cuonzo martin yesterday to take over a volunteers program facing punishment by the ncaa for recruiting violations. martin, 39, replaces the popular bruce pearl, who was fired march 21, a month after being charged with unethical conduct for lying to ncaa investigators. martin was hired in 2008 by missouri state after eight years as an assistant at purdue and went 61-41 in three seasons. he was chosen this season's missouri valley conference coach of the year after the bears finished 26-9 and won the program's first mvc regular-season championship. \"cuonzo is among the most promising young coaches in the game, and we are excited about the coaching ability, toughness and energy that he brings to our program,\" tennessee athletic director <mark>mike hamilton</mark> said. \"he has a proven track record of success as a head coach at missouri state and an assistant at purdue as well as an outstanding career as a college basketball player .\" as a player, martin scored 1,666 points in 127 career games with purdue from 1991-95. a news conference to introduce martin is scheduled for this afternoon. kent state's ford hired at bradley kent state coach geno ford is heading to bradley. ford coached the golden flashes for three seasons, winning mid-american conference titles the past two years. he will be introduced at bradley in peoria, ill., today, the school said last night. notable richmond men's basketball coach <mark>chris mooney</mark> signed a 10-year contract extension with the spiders last night after leading them to this year's sweet 16. it is the third straight year that <mark>mooney</mark>, 38, has received an extension. this one comes after the spiders set a school record with 29 victories, eclipsing the record of 26 set last season. sign up to receive our free ohio state headlines e-mail newsletter the dispatch sports department about other osu sports buckeyextra is produced by dispatch.com and the columbus dispatch .? 2011, dispatch interactive, 34 s. 3rd st., columbus, ohio 43215."}, {"articleID": "2016083000_00763083_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-08-29", "url": "http://cnbc.com/2016/08/29/clinton-camp-dismisses-trump-challenge-on-health-records.html", "content": "<mark>Donald Trump</mark> on Sunday challenged Hillary Clinton to release more detailed medical records, but a Clinton aide said the Republican nominee should provide a \"legitimate\" and \"detailed\" letter beyond the brief note he has previously released. <mark>Trump</mark> Sunday afternoon Tweeted: \"I think that both candidates, Crooked Hillary and myself, should release detailed medical records. I have no problem in doing so! Hillary?\" Tweet 1 A Clinton aide said the campaign will not be releasing any more records. Clinton, 68, released a two-page letter last month from her doctor that said the Democratic nominee is in \"excellent physical condition and fit to serve as President of the United States .\" The Clinton campaign points out that the letter Clinton released has much more detail and specifics, like cholesterol levels, medical history and medications, and they argue there is no comparison to the letter <mark>Trump</mark> released and that <mark>Trump</mark> has not disclosed any meaningful medical information. More from NBC News: Clinton's \"right-wing conspiracy' comes full circle with <mark>Trump</mark> shake up <mark>Trump</mark> ad credits tax plan he doesn't support Wasserman Schultz looks to hold line in Sanders proxy war <mark>Trump</mark> in December released a four-paragraph letter from Dr. Harold Bornstein that called <mark>Trump</mark>'s health\" astonishingly excellent \"and claimed the 70-year-old would be\" the healthiest individual ever elected to the presidency. \"Bornstein--who says he has been <mark>Trump</mark>'s physician since 1980--told NBC News Friday that he wrote the letter in just 5 minutes while a limo waited outside his office, but the doctor said he had been thinking about the letter all day. Neither candidate has released the same amount of medical information that other presidential candidates of both parties have in the past. <mark>Trump</mark>'s challenge Sunday mirrors the response from his campaign spokesman on Friday after the NBC interview with Bornstein aired. Medical records have been an unusual source of controversy in a presidential race that has had plenty of them. <mark>Trump</mark> has claimed Clinton\" lacks the mental and physical stamina \"to be president. Others have raised unsubstantiated or debunked claims about Clinton. Fox News' Sean Hannity raised questions about whether Clinton suffered a stroke in the past and the Drudge Report used old photos to suggest she has trouble walking. Both theories have been debunked by news outlets. And fringe outlets have used a photo to question whether her body guard is secretly a doctor who carries a device to deliver anti-seizure injections. The Secret Service said the device in question is a standard flashlight. Clinton aides have called the rumors and claims\" deranged conspiracy theories. \""}, {"articleID": "2014051818_00017991_W", "names": {"Tom Walsh": ["Q16886418", "Q19586386", "Q19664158", "Q20984602", "Q21061744", "Q2440190", "Q37380700", "Q55362473", "Q7817978", "Q7817979", "Q7817980"], "Dan Baker": ["Q16146280", "Q17305661"], "James Young": ["Q18985605", "Q43915246", "Q51589165", "Q57193449", "Q6145950", "Q6145951", "Q6145960", "Q6145967", "Q6145972"]}, "date": "2014-05-18", "url": "http://www.freep.com/article/20140518/COL06/305180076/1081/col", "content": "U.S. House candidate David Trott made millions in mortgage crisis Farmington Hills attorney David Trott has made a fortune on foreclosures in Michigan by buying up,...U.P. community wonders if land sale to mining giant is worth the price The Michigan Department of Natural Resources is considering the largest sale of state-managed...Nominations for Shining Light service awards accepted until June 27 Nominations for the 2014 Shining Light Awards, sponsored by the Detroit Free Press and the...Rochester Hills group sues to block drilling for oil, gas under city parks The minimum wage debate is the equivalent of stretch pants. It takes on the shape of the user. Jeff Seidel: New Pistons boss Van Gundy fascinating, funny, honest to a fault Self-deprecating. Funny. Genuine. Personable. Honest to a fault. That's Van Gundy. Detroit 6, Boston 1: Porcello wins sixth straight as Tigers roll Right-hander Rick Porcello made perhaps the most impressive road start of his career and put the...Yoga, once viewed as a counterculture practice, has gone mainstream and everyone from celebrities...<mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust <mark>Tom Walsh</mark> talked with Ziebart CEO <mark>Dan Baker</mark> about rebranding of the old Troy-based franchising...Wells Castle, survivor of Detroit's elegant age, seeks new tenant Only a handful of these sumptuous residences are still around. Metro Detroit's 2014 summer music season is marked by some monster stadium shows and big-time...Lady Gaga brings hits, inspiration for long-waiting Detroit fans It had been nearly four years since we'd seen Lady Gaga on a metro Detroit stage. Creative costumes: Guests bring Motor City Comic Con characters to life Day two the 25th Motor City Comic Con saw thousands of anxious comic fans of all ages converge on...Civil rights leader Myrlie Evers-Williams recognized for her own work as a leader, not just as...At 20, Kelly Rothe is one of countless metro Detroit women who are fighting or fending off cancer...Springtime brings two words to mind: light and refreshing. Fresh rolls embody both. Kristen Jordan Shamus: Prom dreams come true for teens with life-threatening illness Reimagining Detroit: Fixing our roads means more than patching potholes As the city prepares to deal with its vacancy problem of tens of thousands of empty lots, we could...As a pastoral minister to the Hispanic community in metro Detroit, I know people who have...Raw Data: Michigan is dead last for highway expenditures per capita Michigan ranks last among the 50 states in per capita road expenditures, with spending of $135 per...Business leaders: It's time for Michigan to stop discriminating against gay people (guest column) Ziebart rustproofing back in vogue The longevity of vehicles and car ownership has reinvigorated demand for rustproofing from Ziebart, a company forced to reinvent itself in the late 1980s after automakers improved factory undercoating process and started offering 100,000 mile anticorrosion warranties .? Headquarters: Troy? Founded: 1959? Employees: 100 corporate employees; independent franchisees own and operate all but 12 of 400 Ziebart locations worldwide? Famous slogan: \"It's us or rust\" ? Main products and services Folks at Ziebart International headquarters in Troy, like most Michigan residents, don't enjoy dodging potholes or flying road debris in the aftermath of the state's harshest winter in memory. But if you want to protect your car or truck from salt pellets and crumbling chunks of pavement, Ziebart would love to help. In fact, the 55-year-old Ziebart franchising firm just happens to be launching a new paint protection clear film called Z-Shield, the latest in a growing line of products and technologies devised to protect a vehicle inside and out. The Z-Shield launch, under way now at Michigan locations, is something of a kickoff for a global rebranding of Ziebart, a name still best-known for the automobile rustproofing invented by Kurt Ziebart in the late 1950s, which morphed into a franchise network in the 1960s. Today Ziebart has 400 locations in 32 countries, offering dozens of products and services ranging from antibacterial treatments for car interiors to spray-on truck bed liners, automotive glass repair, window tint and scratch and scuff repair services. Like many companies where the initial products later become commoditized or outdated by advancing technologies, Ziebart - whose memorable slogan was \"It's Us or Rust\" - has wrestled with its legacy as a rustproofing outfit. Today, said President <mark>Dan Baker</mark>, only about 20% of Ziebart's $135 million in worldwide sales come from rustproofing, compared with more than 70% a couple decades ago. Ziebart rustproofing was a popular aftermarket service for car owners in the 1960s and '70s, but auto manufacturers improved their undercoating at the factories - and in 1987 General Motors, Ford and Chrysler all began offering 100,000-mile anti-corrosion warranties. <mark>Baker</mark>, who joined the company in 1988, is proud of Ziebart's longevity - the average franchisor lasts only seven years, he said - but admits the firm wrestled with a midlife identity crisis for awhile. \"We went through a period of trying to be everything but rustproofing,\" he said, but the eventual lesson learned was \"to embrace who we are, a trusted brand .\" In a nutshell, the message is still a simple one about protection: Come to Ziebart to keep your car looking, and even smelling, like new. Along with coatings and films to protect the vehicle's exterior, Ziebart shops offer interior detailing packages that include cleaning, stain removal and Germ Defender antibacterial coatings. Touting the virtues of a changing array of new technologies and products is the job of Lisa Walega, Ziebart's marketing director whose team has grown from two to eight people in recent years. This summer, she said, a new website is planned, along with an expanded social media presence. All in all, Ziebart has about 100 corporate employees who are all part-owners; an employee stock ownership plan (ESOP) structure was adopted in 1994. All but 12 of its retail stores are franchisee-owned. The company-owned stores, including three in the Detroit area, are used for technology research and testing of new products and tweaks to the business model. Interestingly, amid a steady rollout of new technologies, <mark>Baker</mark> said Ziebart stores have experienced an uptick in orders the past few years for the company's original staple product, rustproofing. What's driving that? Cars and trucks are lasting longer. People are keeping them longer. And car-loan terms have stretched to 84 months. It's a good thing, apparently, that Ziebart didn't abandon its roots in rust. Detroit 6, Boston 1: Rick Porcello wins sixth straight as Tigers roll U.S. House candidate David Trott made millions in mortgage crisis Detroit Lions rookie Larry Webster looks promising with his raw ability at defensive end <mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust Jeff Seidel: New Pistons boss Van Gundy fascinating, funny, honest to a fault Lady Gaga brings hits, inspiration for long-waiting Detroit fans <mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust <mark>Tom Walsh</mark> talked with Ziebart CEO <mark>Dan Baker</mark> about rebranding of the old Troy-based franchising company best known for rustproofing car underbodies (\"It's Us or Rust') - until all the carmakers did Detroit 6, Boston 1: Rick Porcello wins sixth straight as Tigers roll U.S. House candidate David Trott made millions in mortgage crisis Detroit Lions rookie Larry Webster looks promising with his raw ability at defensive end Scientists in Argentina unearth the biggest dinosaur ever discovered U.P. community wonders if land sale to mining giant is worth the price U.S. House candidate David Trott made millions in mortgage crisis U.P. community wonders if land sale to mining giant is worth the price NBA draft: Kentucky prepared Rochester's <mark>James Young</mark> for jump to pros May 17 roundup: L'Anse Creuse North, SH Stevenson baseball wins a pair State rules could cut down on concession options for high school boosters"}, {"articleID": "2015011619_00054813_W", "names": {"Ryan Reynolds": ["Q192682", "Q7384463"]}, "date": "2015-01-16", "url": "http://www.vice.com/read/strengthening-family-bonds-with-ecstasy-116", "content": "Horizons Psychedelic Conference took place in a church. There were stained glass windows, columns, and marble angels. The setting matched the mood perfectly, as a series of distinguished psychedelics researchers from around the world described drug-induced mystical states of consciousness often associated with the divine. Most of the speakers were protected in their studies by government exemptions to harsh anti-drug laws. Relationship coach The Writer of \"Queer as Folk' Talks Rimming, Grindr, and <mark>Ryan Reynolds</mark> Masturbating Cry-Baby of the Week: A Church Allegedly Fired a Woman Because She Wasn't Married Studies are showing that therapeutic sessions with the drug can continue to help patients even years later .\" MDMA gives people a template [for how] they can relate to challenging emotions, \"researcher Dr. Michael Mithoefer told me over the phone .\" They can refer back to it after the medicine wears off. \"Lalla recognized the drug's potential to help resolve her own personal and relational issues. She experimented with MDMA first on her own before embarking upon a mission to enroll her mother, father, brother, and sister in MDMA-aided family therapy .\" You get a publicly-witnessed permanent record in your heart of your love for each other, \"she told me .\" It's stored in your heart, and you can draw on it forever. \"I sat down with Lalla to discuss what her experiences with MDMA have taught her about building better relationships. Annie Lalla: Professionally, I work with single clients and couples. The couples are often suffering recurring drama and conflict. They don't know how to move through the power struggle. That's kind of my expertise. I think 90 percent of couples never get past the power struggle. Well, for example, whenever myself and my husband are in conflict, we literally map out the conflict space. We've got our laptop out:\" OK, so you're pissed about this, and I'm pissed about that. What does it have to do with sex, reproductive issues, money? \"We're always tracking where we are in the conflict. I think people fight about the same things in the same ways. There are recurring motifs that I'm looking for, and that I use to help the couples I'm working with. What do you do when you find the source of the conflict? What I've come to realize is that it all basically boils down to,\" Oh, you feel unsafe. \"No matter if they're yelling, screaming, cryingâ €\" if I can feel a power move, I think, Oh, you're scared. So, I try to regulate my nervous system to take care of my sense of safety. Then, from that place, I think about how I can get them back to feeling safe. No matter if they're yelling, screaming, cryingâ € \"if I can feel a power move, I think, Oh, you're scared. Is the power struggle ever resolved? It's never resolved. The best you can do is to become aware of it, and to manage it. You can't stop wanting to arm wrestle, but you can say,\" I'm arm wrestling intentionally, for something I believe in, and I'm not doing it compulsively or unconsciously. \"Instead of letting your animal use your cognitive functions to do whatever it wants, you align yourself with what your animal is trying to do, and what you think is serving your current and future selves. You find the overlap between those, and that alignment is the place where you operate during your power struggle. What do you mean when you say\" animal \"? We are animals, and the more unsafe we feel, the more we want to control our environment. Every animal down from the amoeba all the way up to us does it, and so I think our relationship with our partners [consists of] replaying old dance routines of unfinished power battles that we had with our first attachment figures: our parents. Have your MDMA experiences changed the way you deal with conflict? Absolutely, yes. MDMA is egolytic [ego-dissolving] and the power struggle is between two egos. So, the more that the two egos feel separate, the more polarized the power struggle is. [With MDMA] you can empathically toggle between your perspective and theirs. How do you use their perspective? If you wanted to break into a house from the outside, you can, but it's way easier if you scope out the house from the inside first. Then you can create a map that you can use to infiltrate. Very stealthy. Stealth is important. The reason why I'm ethically comfortable with stealth is my attention. If the thing you're trying to burgle is the other person's presence and yours, I can get behind that. Most people are trying to burgle things that are not sacred. They're not operating on a sacred mission. What other insights have you gained from MDMA? If you pushed me metaphysically, I would have to say there's another step that I think exists in very intense psychedelic states. It's a state of communion beyond the separateness of self. Your being-ness and my being-ness ceases to be separate. We one-ify. So, I think that's possible in intense mystic states, but I don't think most people get there very often. I think our personality is a series of defenses against unsafe childhood conditions. So we develop a defended self that then becomes our character and personality. Are you able to use that insight to strengthen relationships? On MDMA, in my historic private useâ €\" not necessarily with my family, but in my romantic relationshipsâ € \"I can taste where there is a wall [between myself and] the person that I love. And I can feel the wall is obsolete because the ego that is erecting the wall ceases to require it. It's a defense. And when the ego is more porous, it just needs less defenses. What is it defending against? I think our personality is a series of defenses against unsafe childhood conditions. So we develop a defended self that then becomes our character and personality. And, in some ways, I'm grateful for that. I think of a bonsai tree, which is a beautiful work of art. It's a stunted tree, but artfully stunted. So, I feel like the environmental conditions of your life are stunting you into this particular flavor of God. How do you balance a need for defenses with a need for vulnerability? Often your defenses are against circumstances that are no longer the case. You're often using [childhood] strategies in current situations that are obsolete, because you have more resources, intelligence, and wherewithal now. It's like moths moving towards the light. They move towards the light because when they evolved, only stars existed. It kept them alive, and now it kills them. The same strategy that once served life is now destructive. for a project, and I've noticed that those kinds of childhood themes come up again and again. Are dreams something you use in your work? Dreams can be very helpful. I usually try to tell my dream to my partner or someone, because they'll see a pattern that I won't see. The dream is telling me that there's a blind spot. That's why [the issue] has to be smuggled into my dream space. The other trick I use is to identify with each character in the dream, and each item in the dream. So if I dream about a cat walking through a door and falling off a cliff, I'm the cat, I'm the door, and I'm the cliff. I climb into each one, and think, What can I learn from this? They say there's a series of emotions; I really think there's only love and fear. And even then, I don't think there's fear. I think there is just love, and fear is in the shadow of love when you forget temporarily that love is the nature of reality. Can you talk about some of the specific issues that you've worked on with your family? Way back [when we began], there were a lot. My mother had a very marginalized voice in the family, and with my father, there was a subtle tyranny. And through the MDMA sessions, that was a big part of what I was trying to elucidateâ €\" the ways in which he unknowingly was perpetrating this inequity. Once it became part of his consciousness, he could see that it was inconsistent with his identity. He wasn't the typical Indian patriarch. He wouldn't let his daughters learn to cook or clean because he never wanted us to be domesticated housewives. He wanted the feminine to be powerful. What do you mean when you say \"subtle tyranny?\" The way it would show up would be like a raised voice, or he would become impenetrable in conversation. He would just repeat the same thing, and you couldn't talk to him about the issue. How did you make him realize the effect he was having? I remember one time, all of us got together and expressed anecdotal descriptions of moments when he had interacted with us in a way that had made us feel smaller. So him hearing thatâ € \"and being under the influence of the MDMAâ €\" his ego was soft enough that he could not take it as an attack, and just hear it as reflections of behavior that was inconsistent with who we wanted to be. We even had him write out some commitments to remember. It's almost like notes to his future selfâ € \"notes about how he wanted to be as a husband and a father so he could refer to them later. It was his own writing, and his own signature, so there was really strong accountability for taking on the epiphanies that came up. Over the course of five years, he has become less and less tyrannical. It's interesting that you bring up the idea of there being two personas, the MDMA persona and the sober persona. What's the difference? Well, the sober state defends itself more, and the MDMA state is the more real self. What makes it more real? It has less fear. They say there's a series of emotions; I really think there's only love and fear. And even then, I don't think there's fear. I think there is just love, and fear is in the shadow of love when you forget temporarily that love is the nature of reality. There's no such thing as a shadow in and of itself, it's just a lack of sunlight. You could argue that shadows are just as real as the tree and the sun, but there's a way in which the tree is more real. But if I had to bet my life on what's more real, I bet on the thing that inspires me. I consciously confer more reality to the things I'm inspired by. It's to the point now where most of my friends wouldn't know whether I'm on MDMA or not. Getting back to MDMA, I wanted to ask, what was your first time taking it like? It was like home. My whole life up until that point, I was trying to have interactions with people that look like that. As long as I can remember, whenever I've met someone, I was looking for maximal intimacy per square inch per moment in our interaction. What did that look like? Sometimes I would be intrusive, or ask really intimate questions that were socially inappropriate. I just [wanted] to understand all the intricacies of the feelings and thoughts underneath the spoken statements. Shouldn't we be talking about that? Did you expose yourself as well? Or was the exchange mostly one-directional? When I was younger, it was more one-directional. I got alerted to that in high school. I started to realize that everyone felt very exposed around me, but no one actually knew me. Then I realized it was a defense mechanism. MDMA showed me that intimacy is the place that both of us climb into together, and we're naked together. And that felt way better than the other version that I'd been doing. When I was on MDMA, I would have an interaction with another human being I didn't know three minutes ago, and the level of fluid connection and alignment was the highest that I'd ever seen in a first encounter. Are you able to recreate that feeling off of MDMA? I knew from my research not to pin whatever I got from the MDMA onto the MDMA. The MDMA was just the facilitator. Say I was on MDMA right now, and I go and talk to [a nearby woman]. I would feel that I could talk to her easily without having an excuse. I know a lot of people say,\" Oh, it's the MDMA. The MDMA allowed me to talk to her. \"Well, I knew that the MDMA wasn't doing anything that I couldn't normally do. It made me aware of what I could do. And if I took note of what I was doing on MDMA, I could become more like that person when I was off MDMA. It's to the point now where most of my friends wouldn't know whether I'm on MDMA or not. Does your experience with the drug make normal reality less interesting? It makes baseline reality more like a fascinating Sudoku. It's like a mystery. It's very entertaining. I love being on MDMA, but I love being off of it too. My first drug ever was LSD, which goes from six to eight hours and then it's done. It's like going on a roller coaster. Do you say,\" I hate my life when I'm not on a roller coaster? \"No, you enjoy the rest of the park. Why did you choose to use MDMA with your family instead of LSD or mushrooms, for example? I chose MDMA because it's the most likely [drug for] not having anything negative come up or to have a bad trip. It also had the most research behind it, about it being therapeutically useful. What were some of the concerns that you had to overcome with your family about using MDMA? My mom was worried about it being illegal and addictive. She has no knowledge about drugs. Crack, cocaine, heroinâ €\" she had them all mixed together [in her mind] with MDMA. So I had to differentiate them for her. I had to use research to help her see that there's not this thing called \"drugs .\" There are specific drugs. First, I had to separate out addictive and not addictive. I was able to show her that alcohol was actually more dangerousâ € \"she'd be OK having a glass of wine. [But] alcohol actually has more negative physiological effects in the body and is more addictive. She was worried about MDMA being illegal. And I had to say,\" Yeah, it's illegal. And, here are the reasons why it's probably illegal. It doesn't suit the status quo powers in the world. \"My sister was like,\" I'm going to go crazy. \"She thought she could get physically hurt. So again, I had to take her to websites and show how the biochemistry works. We took 5-HTP. We took all the serotonin precursors. We did as much as we could to mitigate any neurotoxicity. What's your end goal with all of this work? I want myself and the people around me to feel the most alive. I mean, basically I think every emotion is a messenger from the unconscious mind to deliver an important insight. Every unfelt emotion becomes a pathology, an addiction, or a neurosis. I'm trying to teach my family, my friends, and the world at large how to hold a wider range of their emotional experiences, and in order to do that, I have to keep practicing doing that myself. The extent that you feel your emotion is the extent [to which] you can develop yourself and actualize. The Future of Sex According to VICE The Hard, Grim Work of Cleaning Up Meth Labs in West Virginia Cry-Baby of the Week: A Church Allegedly Fired a Woman Because She Wasn't Married The Writer of\" Queer as Folk' Talks Rimming, Grindr, and <mark>Ryan Reynolds</mark> Masturbating The Man Who Texted a Photo of Himself Having Sex with a Girl While She Vomited Isn't Getting Any Jail Time Behind Anonymousâ € ™ s Operation to Reveal Britainâ € ™ s Elite Child-Rape Syndicate Trent Reznor Talks About Making It Out of the Midwest The FBI Says It Stopped a 20-Year-Old's Terrorist Plot to Attack the US Capitol The Future of Protest According to VICE"}, {"articleID": "2013080606_00008405_W", "names": {"J. Williams": ["Q1676430", "Q59162550"]}, "date": "2013-08-05", "url": "http://www.startribune.com/sports/twins/218432731.html", "content": "KANSAS CITY, Mo.--It's a nice problem to have, Ron Gardenhire said a few minutes ago, trying to decide whether you are overworking your closer. Glen Perkins pitched in all three games of the Twins' weekend sweep of the Astros, and there may be a decision to make if the Twins have a late lead tonight. \"If he says he feels great, we go with what he says he feels,\" Gardenhire said of his closer, whose 44 innings are fewest among pitchers who have been with the Twins all year. \"Perk will tell us. If he's a little beat up, or his arm is a little dead, he'll definitely tell us. We've had him do it before. As long as he's honest with us, we're OK with that .\" The 30-year-old closer said he's \"good to go,\" in the Twins' clubhouse before the game. Perkins hasn't pitched on four straight days since June 30-July 3 of last season. The Twins have lost five of their six games at Kauffman Stadium this year, and were swept by the Royals in Target Field last week, so they definitely have some trends they want to reverse. So does Kevin Correis, tonight's starter, who won only one game in June and one game in July. Pedro Florimon remains out for another game with a wrist injury, but he's on the field taking batting practice, and should return during this series. Tonight's lineups: TWINS Dozier 2B Mauer C Morneau 1B Doumit DH Arcia LF Plouffe 3B Herrmann RF Thomas CF Bernier SS Correia RHP ROYALS Cain RF Hosmer 1B Butler DH Comment on this story StarTribune.com welcomes and encourages readers to comment and engage in substantive, mutually respectful exchanges over news topics. Commenters must follow our Terms of Use. Keep it civil and stay on topic. No profanity, vulgarity, racial slurs or personal attacks. Comments with web links are not permitted. Comments that violate the above will be removed. Repeat violators may lose their commenting privileges on StarTribune.com. 6:05 PM Washington - S. Strasburg 6:05 PM St. Louis - A. Wainwright 6:05 PM Cleveland - C. Kluber 7:10 PM Houston - B. Oberholtzer 7:10 PM Kansas City - <mark>J.</mark> Guthrie 7:10 PM Chicago WSox - <mark>J.</mark> Quintana 9:05 PM LA Angels - <mark>J. Williams</mark> 9:10 PM Seattle - H. Iwakuma"}, {"articleID": "2010072710_00242289_W", "names": {"Gary Taylor": ["Q16886047", "Q1801939", "Q5526044", "Q5526045", "Q5526046", "Q5526047", "Q5526048"], "Joe Gonzalez": ["Q20993665", "Q22680673"], "David Sims": ["Q3703336", "Q5239819", "Q5239820", "Q5239821"]}, "date": "2010-07-27", "url": "http://desmoinesregister.com/article/20100727/NEWS/7270371/1001/", "content": "your browser's security settings are preventing some features from appearing. determination + investment = a revitalized king irving neighborhood nearly 20 years ago, jo meade looked out her front door and saw a dozen or so overgrown, vacant lots that were magnets for the illegal dumping of junk, garbage and debris. \"we were always policing the vacant lots,\" said meade, a longtime resident of the king irving neighborhood just north of downtown des moines. when meade looks out her door now, she sees new houses on the once vacant lots. since 2003, the king irving neighborhood has seen a 50 percent drop in vacant, buildable lots, a new city report shows. assessed property values have increased 47 percent in the past decade, compared to a 31 increase citywide. in addition, millions of dollars have been pumped into the area for new curbs and sewers. the progress is driven by the pride, pluck and hard work of residents who have banded together to help transform the area from one of des moines' most distressed neighborhoods into one of its most noticeably improved. that resiliency is why king irving residents didn't panic earlier this summer after a string of violent incidents near evelyn davis park. residents galvanized and pressed for solutions. it's what they've done for years. \"we got together and said:\" something has to be done now,' \"meade said .\" it was a line in the sand. \"the gains in the neighborhood have been hard fought .\" there's been a tremendous amount of progress, but the thing is you can't stop working or everything starts to slide backwards, \"said joann muldoon, who's lived in the king irving neighborhood for 20 years .\" everybody has to keep at it because it's a work in progress. \"one of the best indicators of king irving's renewal is its strong gains in property values. coordinated efforts between city leaders, nonprofit groups and adjoining neighborhood associations have spurred the revitalization .\" a drive through the neighborhood would tell you and me the condition of the housing stock and the way families feel about living in the neighborhood is much different than it was five years ago, \"mayor frank cownie said .\" it's the leadership of the people up there and their willingness to work with the city and other groups that have made the difference. \"higher property values and success redeveloping long-vacant residential lots are all positive signs, said <mark>gary taylor</mark>, a professor of community and regional planning at iowa state university .\" if there's been a perception for a long time that a certain neighborhood is troubled, it's more difficult to get people to invest and make the turnaround happen, \"<mark>taylor</mark> said .\" you start to see improvement stick when, over time, you see a gradual rise in incomes and housing values creep back up and stay strong. \"volunteers have helped bring the low - to moderate-income neighborhood back after years of decline. their ranks must grow to help sustain and expand the neighborhood's housing improvements and business growth, leaders say. a $1 million grant to help strengthen king irving and adjacent mondamin presidential neighborhood was provided by thrivent financial for lutherans in 2008. that money went toward housing improvements, block cleanups, public safety, youth programs and job opportunities .\" right now, the biggest challenge is getting more people involved, \"said robin hamel, project manager for thrivent builds neighborhoods. in the early 1900s, the neighborhood was home to various movie theaters, grocery stores, nightclubs, drug stores and filling stations. things started to slide in the 1960s, and king irving's population dropped by nearly one-third during the '70s. scores of abandoned, dilapidated houses and other buildings were razed. the demolitions eventually included irving junior high school, which closed in the 1970s. that site is now home to the forest avenue library and evelyn davis park. the neighborhood was left with more than 200 vacant lots, a problem the city, residents and nonprofit groups have fought over the past 10 years. vacant and foreclosed properties can weaken values of surrounding houses, spawn more foreclosures, attract squatters, vandals and thieves and become nuisances that threaten public safety, experts say. city officials estimate there are 1,770 vacant lots in des moines. sixty-two percent of the lots with development potential are in the northern half of the city, an analysis by city officials shows. king irving had 152 buildable, vacant lots seven years ago. there are 73 today. developing those lots is important to king irving and all of des moines because mature cities typically must grow from within .\" the suburbs build tax base by gaining ground and greenfield development, \"said <mark>taylor</mark>, the isu professor .\" the landlocked, core cities don't have those same opportunities, so they have to build tax base from within and invest in development on land that they already have. \"the king irving, mondamin presidential, river bend and cheat - om park neighborhoods north of downtown all stand to gain from downtown's ongoing renewal .\" the proximity to downtown is going to be a selling point, \"<mark>taylor</mark> said. the neighborhood rebound is also driven by the work of nonprofit organizations such as greater des moines habitat for humanity, home, inc., thrivent and the neighborhood finance corporation, which have focused heavily on the area's rebirth .\" i'm in it every single day and there have been significant changes, especially with the housing, \"said hamel, the thrivent coordinator. by the end of 2009, greater des moines habitat for humanity had finished 65 houses in the king irving and mondamin presidential neighborhoods, bringing $6 million of affordable housing to the area. over the past two years, the neighborhoods have also seen some $2 million in federal grant money to lessen the impact of foreclosures and redevelop vacant lots, a core recommendation in a 2004 king irving neighborhood improvement plan .\" the housing improvements have been key, \"said muldoon, president of the king irving neighborhood association. for instance, the assessed value of one property on the near north side increased from $7,100 to $127,600 when a house was built on a once-vacant lot. the neighborhood finance corporation has also made 51 loans to other nonprofits, developers and private homeowners totaling $3.75 million in the last several years. the loans have resulted in new construction, renovations, home purchases, refinances and second mortgages. the private investments bolster public improvements meant to spur revitalization. taxpayers have spent $1.8 million on street, curb and sidewalk improvements. sewer improvements in the area surpass $2 million. also, some $875,000 has been invested at evelyn davis park in the past several years to improve amenities, security and programs at the park, which some call the town square of the king irving neighborhood. money raised for the various initiatives has included grants from polk county, vision iowa and donations from local business leaders. about 100 people packed into the steamy gymnasium at king elementary school last month to discuss problems in and around evelyn davis park. a week earlier, residents had rallied to make a statement and stake their claim to the 9.8-acre park located at 1400 forest ave. the park is named after a community leader and longtime advocate for children and the poor who died in 2001. turmoil near the park often crops up in the spring, but incidents earlier this year were exceptional, area residents have said. since then, residents and various community groups have held every meeting and activity they can in the park .\" even if good things have been happening for years, one bad thing can overshadow that progress, \"hamel said. the city's parks department has daily activities at evelyn davis park for children through mid-august. in addition, police have also stepped up patrols. two officers are in the park from 4 p.m. until closing time on fridays through sundays. the results?\" so far, so good, \"said des moines police lt. <mark>joe gonzalez</mark>.\" more people and neighborhood organizations have been using the park a lot more frequently, which makes a difference. \"don mayberry, who lives on carpenter avenue across the street from the park, agreed .\" regardless of what people might read or hear, this is a safe neighborhood, \"said mayberry, who's lived in the area for about 50 years. crime patterns in the king irving area have been on par with most other parts of the city over the past 60 days, city data show. residents say things have been quiet .\" it's no different than any other neighborhood in the city, \"<mark>gonzalez</mark> said .\" sometimes things can flare up. \"residents are committed to keeping the park - their town square - safe because its vitality is a symbol for everything they've worked for all these years. they don't dismiss or downplay problems that shook the area just two months ago, meade said. they simply refuse to let the incidents define them or their neighborhood. you must fill out the comment body in order to submit a comment. paris lam, 4, cools off in the fountains at des moines' evelyn davis park on monday evening. her father, thu lam, has lived in the king irving neighborhood for 18 years. king irving neighborhood at a glance population: three-fourths of the neighborhood's 2,163 residents are minorities, according to the 2000 u.s. census, the most recent data available. nearly 38 percent of the neighborhood's residents are 18 or younger; citywide, 25 percent are 18 or younger. forty-three percent of households are headed by single mothers, compared to 27 percent citywide. income: median household income levels in the king irving neighborhood increased by 17 percent between 2000 and 2009, from $22,429 to $26,259, according to census and market research data. polk county median incomes increased 20 percent, from $46,517 to $55,837, during the same time. features: home to the forest avenue library, evelyn davis park, the john r. grubb ymca, and martin luther king, jr. academy of math and science. polk county's central senior center is just outside the neighborhood's west boundary line on forest avenue. casady school: residents in the king irving and mondamin presidential neighborhoods have urged school district officials to keep the casady school in use. the building currently houses preschool and alternative high school programs. bill good, the district's chief operations officer, said he expects those uses to continue in the building for about five years. architecture: the neighborhood's dominant architecture style is arts & crafts, including bungalow and four-square style homes. historic places: the neighborhood is home to the basilica of st. john, listed on the national register of historic places. also on the historic register: the goddard bungalow court located west of 14th street and north of university avenue. isu football: <mark>david sims</mark> being investigated for unlawful use of credit card will dam failure be end of lake delhi? culver might seek fema aid one killed, 23 injured after spooked horses trample crowd at bellevue parade more detail: wells fargo cuts division, plus 3,800 jobs nationwide seven central iowa dishes that might each deliver enough view more than 200 photos from the 2008 floods from all across iowa. view more than 200 photos from the biggest lazerfest in its history. place an ad copyright? 2010 the des moines register. all rights reserved. use of this site signifies your agreement to the"}, {"articleID": "2010010200_00111078_W", "names": {"Huang Qi": ["Q45374977", "Q45437194", "Q45468995", "Q45499078", "Q45503613", "Q45519545", "Q45520756", "Q45547202", "Q45552675", "Q45567746", "Q45572284", "Q45582688", "Q45632418", "Q45656685", "Q45663581", "Q45678365", "Q45679595", "Q45708872", "Q45726160", "Q698795"], "Zhao Yan": ["Q16259837", "Q198264", "Q27498869", "Q28689734", "Q45406740", "Q45437781", "Q45465534", "Q45466426", "Q45470702", "Q45471849", "Q45474544", "Q45475205", "Q45475828", "Q45483076", "Q45491569", "Q45495549", "Q45498577", "Q45513153", "Q45519495", "Q45523677", "Q45540103", "Q45540754", "Q45542031", "Q45546542", "Q45549178", "Q45557450", "Q45578528", "Q45582830", "Q45588690", "Q45590271", "Q45590887", "Q45593489", "Q45593552", "Q45601101", "Q45602846", "Q45615544", "Q45617780", "Q45624609", "Q45636621", "Q45642667", "Q45645288", "Q45656745", "Q45675915", "Q45689607", "Q45724608", "Q45724670", "Q45725007", "Q9348491"], "Liu Xiaobo": ["Q41617", "Q704986"]}, "date": "2010-01-02", "url": "http://nytimes.com/2009/12/23/world/asia/23iht-lawyer.html?_r=1&pagewanted=all", "content": "using china's law to fight for rights sign in to e-mail print by verna yu published: december 22, 2009 hong kong - if not for his \"bad\" family background, mo shaoping might be a senior military officer now. instead, he has become one of china's leading human rights lawyers, representing prominent political dissidents, journalists and even practitioners of the banned falun gong sect. skip to next paragraph related verdict in trial of chinese dissident could come friday (december 23, 2009) his clients have included <mark>huang qi</mark>, who recently was sentenced to three years in prison after demanding an investigation of school collapses in last year's sichuan earthquake; <mark>zhao yan</mark>, a researcher for the new york times who was accused of revealing state secrets; and <mark>liu xiaobo</mark>, who was jailed three times before his current detention, charged with \"inciting subversion\" for his work on the charter 08 democracy manifesto. at the trial, which started wednesday, mr. <mark>liu</mark> will be represented by other lawyers from mr. mo's firm. mr. mo has been barred from representing mr. <mark>liu</mark> directly, because he also signed charter 08, which calls for political reforms and the rule of law. \"i don't agree that he should be convicted,\" mr. mo said of mr. <mark>liu</mark>. \"these things can be debated over, but you can't just send people to prison .\" taking on politically sensitive cases can be hazardous for chinese lawyers, but mr. mo has made this his mission for more than a decade. he began defending dissidents in 1995, when the wife of <mark>liu</mark> nianchun, a veteran democracy advocate, could not find any other lawyer to defend her husband. \"my position is that whatever crime someone has committed, he should always have the right to a lawyer. that is one of the most basic human rights,\" mr. mo, 51, said in an interview in hong kong, where he was attending his daughter's university graduation. \"i believe it is for posterity to judge who is right or wrong .\" perhaps fortunately for his clients, mr. mo was thwarted in his original career ambitions. he joined the army at the age of 18 in 1976, just as the cultural revolution ended. but when he tried to enter a military college a year later, he was told he did not qualify because of his \"complex family background .\" he later learned what that meant. his paternal grandfather had been a landlord and a delegate to the national legislature under the kuomintang government, before the communists took power in 1949. his maternal grandfather had been a professor of philosophy and religion, with a doctorate from the university of chicago. both men had died during the cultural revolution, one tortured by red guards, the other driven to suicide. mr. mo, born in beijing, had never met either grandfather, both of whom had lived in southern china; he had not even known of their deaths, or the circumstances. because of the political climate of the time, his parents - both doctors who were sent to labor in the countryside along with other intellectuals during the cultural revolution - had never discussed his grandfathers' undesirably \"bourgeois\" backgrounds with him. asked whether his grandfathers' sufferings had given him a sense of solidarity with those who face political persecution, the mild-mannered, bespectacled lawyer laughed. \"i suppose it might be in my genes,\" he said. after he left the army in 1980, he was assigned to work at the beijing municipal procuratorate and later studied law at the beijing college of politics and law and the prestigious chinese academy of social sciences. while the new york-based organization human rights watch praises mr. mo as having handled more high-profile human rights cases than any other lawyer in china, he notes that these are also the riskiest and most time-consuming cases and bring the least monetary reward. and he has yet to win one. his clients all have been jailed or exiled for promoting democracy or daring to challenge the communist party's monopoly on power. \"it's impossible to win these cases,\" he said. \"the best you can hope for is a compromise .\" \"compromise\" means the defendant might be given a suspended sentence or be permitted to go into exile, as was xu wenli, a founder of the banned china democracy party. fighting cases that you never win could be demoralizing, but mr. mo insists his efforts eventually will be vindicated. \"if you don't even speak for them, no one will hear their voices,\" he said of his clients. \"but history will prove whether they were right or wrong .\" mr. mo says recent years have been particularly difficult for lawyers. he cited the example of the beijing-based legal aid center open constitution initiative, which has challenged china's so-called \"black jails\" and campaigned for the rights of death-row inmates. recently it was shut down, ostensibly for tax evasion. and more than a dozen rights lawyers were disbarred after failing a mandatory annual review, widely criticized as a vetting system to disqualify lawyers disliked by the authorities. \"if this is used to crack down on or to target those who are not obedient,\" mr. mo said, \"then it isn't right .\" given such harsh conditions, and the publicity his career has attracted - time magazine named him an \"asian hero\" in 2003, and he received the french government's human rights prize in 2007 - is mr. mo worried that he might be a target? he said his wife, who also is a lawyer, worries about him. his phone is monitored, and the authorities often summon him over cases he is handling. still, mr. mo believes he has been allowed to continue his practice and travel freely because he focuses on the legal technicalities of his cases and avoids emotive political statements. \"i do my bit to push forward democracy and rule of law,\" he said, \"but writing essays is not my thing .\" nicholas bequelin, a senior asia researcher at human rights watch, said few lawyers had mr. mo's ability to handle political cases in a strictly professional, depoliticized way. \"not many lawyers have been able to emulate his example,\" mr. bequelin said, \"because they lacked the tactical skills needed to know when to back down and when to push forward, but also because beijing was not ready to tolerate many more prominent defenders for high-profile dissidents .\" mr. mo remains hopeful about his country's future. democracy, he said, is never a straightforward road. \"it's a historical trend. china will move towards democracy, rule of law and constitutional governance,\" he said. \"and no one can stand in its way .\" more articles in world \"a version of this article appeared in print on december 23, 2009, in the international herald tribune."}, {"articleID": "2013012007_00032592_W", "names": {"Chris Paul": ["Q1077636", "Q46040", "Q56754195"], "John Wall": ["Q14945536", "Q17400794", "Q337370", "Q47452330", "Q6262752", "Q6262757", "Q6262759"]}, "date": "2013-01-20", "url": "http://baltimoresun.com/sports/nba/la-sp-clippers-wizards-20130120,0,5220014.story?track=rss", "content": "<mark>chris paul</mark> returns to make it a happy night for clippers clippers a boost, another weapon to throw at the washington wizards. it turned out the clippers and <mark>paul</mark> needed everything they had to withstand an opponent with the worst record in the nba, l.a. pulling out a 94-87 victory over washington on saturday night at staples center. clippers' jamal crawford is getting an initiation as an initiator miami heat regains its mojo, shows what it's made of his jumper with 32.4 seconds left gave the clippers a 91-86 lead that sealed the victory and pushed their winning streak to four games. his two free throws with 8.9 seconds left for the final margin precipitated an \"mvp\" chant from fans. vinny del negro said. \"he's a competitor, he wanted to be out there. we definitely needed him tonight .\" three-point shooting kept the wizards in the game and gave the clippers plenty of trouble. washington was eight for 20 from three-point range; the clippers were only five for 21. bradley beal made a three-pointer with 2:43 left, it pulled washington within 85-83. from that point, the clippers were in a game. <mark>john wall</mark>, who had 24 points in his fifth game since returning from a leg injury, made one of two free throws to make it 85-84. blake griffin (17 points, 11 rebounds) made two free throws for an 87-84 lead, but then fouled nene as the wizards center scored on a driving layup. but nene missed the free throw, leaving the clippers ahead, 87-86, lead with 1:33 left. after <mark>paul</mark> missed a shot, griffin got the offensive rebound and scored off a pass from <mark>paul</mark> for an 89-86 lead. <mark>wall</mark> then committed a turnover, opening the door for <mark>paul</mark> to deliver the game to the clippers. \"washington is getting some of their players back, and they are playing well,\" del negro said of the wizards, who are 8-30 but had won four of five games before saturday, including victories over oklahoma city and denver. \"i knew this was going to be a tough game .\" so the clippers had been warned not to take washington lightly. but it wasn't until late in the second quarter that they were able to get some separation from the wizards. chauncey billups has been making progress in his recovery from tendinitis in his left foot. but the coach said there still isn't a timetable for billups to return. del negro said billups will start playing in three-on-three workouts. billups has continued to get therapy. \"he said it's feeling a lot better,\" del negro said...there already has been chatter that plenty of teams are interested in acquiring eric bledsoe in a trade. the clippers aren't shopping their young point guard, but that hasn't stopped the rumors from flying or stopped scouts and personnel executives from asking to see if bledsoe is available. the trade deadline is feb. 21. commenting policy: readers are encouraged to post comments that are germane to the article. we reserve the right to remove any user, and to delete comments that contain abusive language or personal threats, as well as those that are racist or demeaning. readers may report comments by clicking \"report abuse .\" once a comment has been flagged, a baltimore sun staffer will investigate. click here for more information on commenting."}, {"articleID": "2017090111_00040481_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2017-09-01", "url": "http://journal.com.ph/news/world/us-show-of-force-against-north-korea", "content": "SEOUL--US heavy bombers and stealth jet fighters delivered a show of force directed at North Korea in a live-fire drill Thursday, two days after Pyongyang's provocative test-launch of a ballistic missile that flew over northern Japan. Two B-1B \"Lancer\" bombers from Guam and four F-35B stealth jet fighters from the Marine Corps' Iwakuni airbase in Japan joined four South Korean jet fighters and two from Japan in the exercise over Japanese and South Korean air space, US military officials said. US and South Korean aircraft dropped live munitions onto the Pilseung shooting range in Gangwon province, some 150 kilometres (94 miles) south of the Demilitarized Zone dividing the two Koreas. General Terrence O’Shaughnessy, commander of the US Pacific Air Forces, said in a statement that the exercise meant to signal solidarity between the air forces of the three countries. \"North Korea's actions are a threat to our allies, partners and homeland, and their destabilizing actions will be met accordingly,\" he said. \"Our forward-deployed force will be the first to the fight, ready to deliver a lethal response at a moment's notice if our nation calls .\" North Korea sparked fresh concerns over its nuclear and missile program Tuesday when it launched a Hwasong-12 intermediate range missile over Hokkaido and into the central Pacific, sparking emergency sirens and text alerts sent en masse to people in northern Japan. The launch came as US and South Korean forces were nearing the end of the 10-day annual Ulchi Freedom Guardian joint exercises, which Pyongyang regards as threatening. The North's state media called the Hwasong-12 test \"a part of the muscle-flexing\" against the war games. And leader <mark>Kim Jong-Un</mark> called for more launches into the Pacific, KCNA news agency said. The UN Security Council denounced North Korea's latest missile test, unanimously demanding that Pyongyang halt the program. US Defense Secretary Jim Mattis called the IRBM test a \"reckless and provocative act\" while President Donald Trump said it demonstrated that negotiations with Pyongyang were \"not the answer .\" Tweet Read 0"}]