[{"date": "2014-01-09", "url": "http://www.portlandtribune.com/pt/9-news/206746-62678-artists-sketch-a-better-life-for-typhoon-victims", "content": "Artists sketch a better life for typhoon victims - Thursday, 09 January 2014 06:00 Auto show fundraiser fuels hospital lodging - Thursday, 09 January 2014 06:00 Police threaten complaint as calls mount at the commons - Thursday, 09 January 2014 06:00 - Thursday, 09 January 2014 06:00 EGGERS: Ex-Blazer Ainge rebuilds Celtics New urban developments threaten forests, creeks - Thursday, 09 January 2014 00:00 Monterossi's clutch play carries Southridge over Rams - Thursday, 09 January 2014 00:00 Jesuit's Mondeaux excited to be a Duck Laker boys downed on last-second shot - Thursday, 09 January 2014 00:00 Pacer boys rebound with big win over Putnam - Thursday, 09 January 2014 00:00 Showmen sought for Singers spring session - Thursday, 09 January 2014 00:00 Westside Christian is moving on up - Thursday, 09 January 2014 00:00 Tigard leaders brace for 2014 projects - Thursday, 09 January 2014 00:00 New urban developments threaten forests, creeks Sources Say: Fritz thinks voters should \"own' city elections once again Artists sketch a better life for typhoon victims View Comments Portland 4 the Philippines plans fourth fundraiser Riannah Weaver was supposed to be in the Philippines when Tropical Storm Haiyan struck in November. The 30-year-old Northeast Portland artist had been invited by her pastor's family to teach art at a Philippine orphanage. After the trip was postponed, however, Weaver was shocked to hear that a devastating typhoon had hit the Philippines, leaving more than 6,000 dead, millions homeless, and major logistical challenges for relief operations .\" I was glad I wasn't there but (I thought) there's something I can do, \"she recalls. So she set up a Facebook page to collect donations for her pastor's organization, Christian Frontier Ministries. Within 48 hours, her social media community was so supportive that the effort took on a life of its own. It turned into a group called Portland 4 the Philippines, a collaborative of artists, dancers, musicians, performers and other creatives who've produced three fundraising concerts so far and have a fourth scheduled for later this month. The events include lineups of at least five bands, spoken-word performances, art auctions, raffles and education in the form of updates, photos and blogs from contacts on the islands. The Portand creative community has embraced the effort .\" There's a definite family here. We're all really driven to do something with our arts that actually make a difference, \"says Joseph\" Djo \"Fortunato, a 34-year-old musician and visual artist who is one of three other co-organizers .\" We're all trying to survive off our arts, but everyone wants to have a purpose for it. \"Fortunato, who is half Filipino, grew up on the East Coast but has several hundred relatives in the Philippines and has been there twice for family reunions. He says he'd never thought much about the Filipino community in Portland before, but this tragedy has helped bring many of them together. The events have been family-friendly and affordable, with tickets on a sliding scale of $5 to $20. Local and international artists have donated their work for auction, and local venues and others have pitched in. The three events so far in December and January have raised more than $2,000. The fourth event (they set one in each quadrant of the city) is set for Jan. 25 at the Dublin Pub. Artists Colton Carnahan, Jessica Rose and Kenton Clow, 1000 Fuegos, Jordan Harris, <mark>Jesse James</mark> with Drake Carnahan, and Erick Valle are some of the acts set to perform. All of the proceeds are going to two on-the-ground charities in the Philippines that are focused on relief efforts .\" It's an opportunity to remind ourselves why we pick up an instrument, a paintbrush - which is to make the world a better place, \"Fortunato says. Long-term plans Raising money is just part of the goal. The group wants to keep a spotlight on the disaster for years to come, as the nation rebuilds. They plan to sponsor the extended recovery efforts, which Fortunato's uncle is helping to lead through his organization, Soft Power Philippines. That group formed after the earthquake that struck a month before the typhoon. They offer trauma counseling, education and sustainable materials to the disaster survivors as they rebuild their communities with a 21st century model. They want their efforts to be sustainable, not just a flash in the pan .\" This horrible tragedy creates the need and opportunity to build a better world, \"Fortunato says .\" It wouldn't have been as devastating if they would've planned better, and they know it. \"Most Americans would have a hard time comprehending the scale of the devastation, which has been called far worse than Haiti endured after its 2010 earthquake. That's why Tom Finch volunteered to help, despite not being an artist or a musician .\" It's forced me to confront my own Eurocentrism, that I need to open my eyes to more than just this Eurocentric paradigm, \"says Finch, 39, a longtime teacher at Portland Public Schools, on sabbatical this year. Named by The Princeton Review as one of the 168 best medical schools in the country, the School of Naturopathic Medicine at Bastyr University is committed to developing leaders in the evolving field of natural medicine.", "articleID": "2014010916_00031319_W", "names": {"Jesse James": ["Q18719497", "Q20985425", "Q21062632", "Q530550", "Q954359"]}}, {"date": "2014-01-13", "url": "http://www.forbes.com/sites/steveschaefer/2014/01/13/financial-planning-starts-with-the-truth-about-your-bottom-line/?ss=personalfinance", "content": "There are plenty of things to worry about when it comes to your finances: Are you saving enough? Is your debt dragging you down? Will you be able to afford retirement or sending a child to college? Those types of questions have their place, but they aren't a starting point. To <mark>Joel Johnson</mark>, a Connecticut-based financial planner, the starting point is an honest assessment of your financial standing. <mark>Johnson</mark>'s firm <mark>Johnson</mark> Brunetti manages more than $300 million in client assets, and he says the first thing he tries to do is get a handle on reality with three key questions: What are your goals? What are your job prospects for the next 5-10 years? How much debt do you have? \"Don't be afraid to look at the problems,\" he says, because when you're honest about those the solutions often present themselves. I started covering markets at Forbes in the summer of 2007. Right around then a pair of Bear Stearns hedge funds imploded in the first tremors of the financial crisis, but I swear the recession isn't my fault. Armed with only a basic knowledge of Wall Street at the start, after a few thousand stories I've got a pretty good handle on this business. My contributions to the Forbes brand don't end when I leave the office either: I'm also a two-time MVP of the Forbes .400 softball team. Tips, story ideas, criticism, questions? Follow me here (click under my picture), on Twitter Google +, subscribe on Facebook or e-mail me at sschaefer_at_forbesdotcom.", "articleID": "2014011322_00096162_W", "names": {"Joel Johnson": ["Q16192777", "Q16730355", "Q55362478", "Q58490764", "Q6213614"]}}, {"date": "2014-01-13", "url": "http://www2.kusports.com/news/2014/jan/13/isu-star-kane-game-time-decision-against-kansas/", "content": "ISU star Kane a game-time decision against Kansas The availability of Iowa State men's basketball senior guard DeAndre Kane remains up in the air hours before the Cyclones play host to Kansas at Hilton Coliseum, in Ames, Iowa. ISU coach Fred Hoiberg said Monday morning during the Big 12 teleconference that Kane, who suffered a sprained left ankle in the final minute of the Cyclones' 87-82 loss at Oklahoma on Saturday, did not practice Sunday and will be re-evaluated today before the 8 p.m. game versus KU. \"I've been messaging with him this morning, and he'll be in soon for treatment to see where things stand,\" Hoiberg said before 11 a.m. Monday. \"Obviously, he wakes up sore, and that's to be expected. It's always gonna be a little bit worse in the morning, after sleeping on it. But we'll see .\" Hoiberg said Kane, who averages 16.5 points, 7.3 rebounds and 6.1 assists, will test the ankle at today's shoot-around. \"We'll see if he can run on it and, more importantly, see if he can cut on it,\" the coach said. \"But, again, we'll take a cautious approach with this one. We've got a lot of season left after tonight's game .\" Hoiberg, impressed with the Jayhawks' road win over Oklahoma and their home victory against Kansas State, said KU is playing as well as any team in the country right now. The Cyclones (14-1 overall, 2-1 Big 12), coming off their first loss of the season, will have to adjust against Kansas (11-4, 2-0) if Kane can't play. Hoiberg said Mont? Morris, a backup freshman guard, will have the ball in his hands if Kane is unavailable. \"He's done a really good job of taking care of the ball, making good, safe plays and initiating the offense for us,\" Hoiberg said of Morris, who averages 6.3 points and 2.9 assists. Additionally, Hoiberg said Iowa State's bigs will have to be play-makers if the Cyclones' best all-around player is in street clothes. \"We'll try to do the best job we can,\" Hoiberg said. Kansas coach Bill Self knows his team will have its hands full tonight against the Cyclones. \"They've been terrific,\" Self said on the teleconference. \"Fred has done an unbelievable job. Their defense is under 40 percent (39.3), I believe, overall field-goal percentage defense, they've played a nice schedule and they've had newcomers that have made such a huge difference .\" <mark>Matt Thomas</mark> has been solid for them, obviously, in a freshman role and produced pretty well. And then (Melvin) Ejim and (Georges) Niang have been better coming back and been terrific. But (DeAndre) Kane and (Dustin) Hogue have been awesome. You're looking at a guy (Kane) that arguably could be the front-runner for player of the year in the league with the type of performances so far, and a guy that's as good a rebounder from his spot as any kid in the country in Hogue, \"the 11th-year Kansas coach said of his team's opponents .\" And their bench shoots it, \"Self added .\" They've got a nice team. Fred does such a good job of giving them freedom offensively. They play with a free mind, and if I wasn't playing them I'd say they're definitely one of the more fun teams to watch play. \"While the Big 12 has its share of difficult road venues - Self acknowledged Oklahoma State and Kansas State in that category - Iowa State is at the top of that list, too, and Self said tonight's game at Hilton Coliseum (with 14,384 seats) figures to be as good an atmosphere as Kansas will play in on the road this season. The KU coach stressed that he wants the Jayhawks to enjoy the scene and he hopes it will foster a more intense focus and a tighter huddle .\" I'm excited to see how our guys react, \"Self said .\" It's never easy when you're on the road, and as good as the crowd's gonna be, it's their five guys that can all stretch it from the three-point line that concerns me more than the crowd. \"Video highlights from Late Night in the Phog October 5, 2013 Ben McLemore sends message to KU fans from NBA Draft June 27, 2013 Andrew Wiggins and Bill Self talk after camp scrimmage June 19, 2013 KU blue team summer scrimmage highlights: June 19 June 19, 2013 Press Conferences & Post-Game Interviews Bill Self on KU's 86-60 win over KSU and Monday's showdown with Iowa State Press Conferences & Post-Game Interviews Naadir Tharpe, Wayne Selden and Andrew Wiggins discuss the latest victory in the KU-K-State rivalry Press Conferences & Post-Game Interviews Bill Self talks K-State, a day before Sunflower Showdown", "articleID": "2014011401_00052910_W", "names": {"Matt Thomas": ["Q17511411", "Q22096360", "Q48720082", "Q55368011", "Q6789424", "Q6789425"]}}, {"date": "2014-01-13", "url": "http://www.miamiherald.com/2014/01/13/3868861/no-idle-hands-among-miami-springs.html", "content": "When I was growing up, my mom was never short on chores for me to do when I was out of school. And when I'd protest at the seemingly never ending list of things to do - clean the house, mop and wax the floors, wash and iron the clothes - she would tell me, \"Idle hands are the Devil's workshop .\" In my young mind, I couldn't understand how my hands had anything to do with the Devil's workshop. I didn't even know him. Anyway, my mom could never sell that story to the ladies at Grace Lutheran Church and their friends from other churches in the area. They wouldn't buy it. That's because they never have \"idle hands .\" They keep busy sewing quilts that are used to bless people throughout the United States and even in other countries. On Jan. 26 at 10 a.m., the quilts, made by loving hands and put together from donated materials, will be dedicated during the service. In the past, quilts from Grace have been given to people and families in areas of disaster and trouble. For example, the quilts have blessed in places like Haiti and Peru and send a message of love and support to all who receive them. The blessing of the quilts is also a way of saying thanks to the dedicated women who made them. Grace Lutheran is at 254 Curtiss Parkway in Miami Springs. Organ recital Joanne Schulte is considered one of the finest organists in the world. So, when she tells you that someone is \"perhaps the finest young organist in America today,\" well, you believe her. Schulte is referring to Nathan Laube, who will appear in a recital at 4 p.m. Sunday in Florida International University's Herbert and Nicole Wertheim Performing Arts Center-Concert Hall at 10910 SW 17th St. Laube will perform on the Wertheim concert hall organ, which is according to Schulte, is the only concert hall organ in South Florida. The event is presented by the Miami Chapter of the American Guild of Organists, of which Schulte is sub dean. She also is director of organ studies at FIU. The recital is free and open to the community. A reception will follow the recital. Jewish history A program on the \"Forgotten Jews from Arab Lands\" will be at 2 p.m. Jan. 26 at the Jewish Museum of Florida-FIU, 3012 Washington St. in Miami Beach. According to a press release, little is still known about the nearly one million Jews of North African, Middle Eastern and Iranian decent, also known as Sephardic Jews, who were expelled or forced to flee their homes in the 1940s. <mark>Henry Green</mark>, a University of Miami religion studies professor, is spearheading a project to draw attention to Sephardic Jews, who became refugees after they were uprooted from their communities, lost their citizenship and within a half century, had all but disappeared from their ancestral homes. <mark>Green</mark> calls his audiovisual history project, which he started in 2009, \"Sephardi Voices .\" To date, some 250 testimonies have been collected by research teams in Miami, New York, Los Angeles, London, Paris and Jerusalem. His goal is to collect 5,000 testimonies over the next five years. However, he must work fast, as his subjects are elderly and their memories are fading, while others are passing on each day, he said in a press release. \"This project offers the last chance to save and document this irretrievable period of Jewish history that stretches back to the prophet Jeremiah, the writings of the Talmud and Maimonides,\" he said. The program is free and open to the public. For more information, call the museum at 786-972-3175 or email: info @ jewishmuseum.com. Free lectures Temple Judea at 550 Granada Blvd. in Coral Gables will present Rabbi Lawrence A. Hoffman, Ph.D. in two free lectures. Hoffman, who served for more than three decades as professor of liturgy at Hebrew Union College-Jewish Institute of Religion in New York, will lecture at the Barocas Lecture on \"Judaism for the Next Generation\" at 10 a.m. Jan. 26. The lecture will explore Judaism's response to the frantic search for human meaning against the backdrop of science, art, the challenge to tradition and the \"re-religionization\" of America. At 7 p.m. Jan. 27, Hoffman will speak at the Eric B. Meyers Lecture on \"What's So Critical About Ritual?\" In his lecture Hoffman will explore what Jews get from engaging in ritual and how ritual can lead to a theology. He will also address how Jews respond to traditional critique of ritual from the great thinkers of psychology, sociology and economic theory. Both free lectures are open to the entire community. To RSVP, call or email Janice Garcia at: j.garcia @ judeagables.org or call her at 305-667-5657, ext. 110. Cantorial concert A cantorial concert featuring 14 cantors who represent the Southeast Region of the Cantors Assembly of America, will be at 3 p.m. Jan. 26, at the Sunrise Jewish Center, 4099 N. Pine Island Rd.. In addition to cantorial music, cantors from throughout South Florida will sing selections from Broadway shows, pop songs, and opera. Tickets are patrons $25; sponsors $18, and general admission $10 For more information, call Steven or Florence at 954-741-0295.", "articleID": "2014011406_00023134_W", "names": {"Henry Green": ["Q3784935", "Q54556249"]}}, {"date": "2014-01-14", "url": "http://cbs8.com/story/24439359/sdpoa-backs-faulconer-sen-fienstein-endorses-alvarez", "content": "SDPOA backs Faulconer; Sen. Fienstein endorses <mark>Alvarez</mark> SAN DIEGO (CNS) - Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. \"Kevin Faulconer's experience and proven leadership make him the best candidate for mayor,\" said police union President Brian Marvel. \"He has demonstrated a deep understanding of the dire need to rebuild the San Diego Police Department and retain experienced police officers to keep our neighborhoods safe .\" Last summer, Faulconer spearheaded a City Council effort to increase allowances for officer uniforms and equipment, and hike funding for SDPD recruiting drives. <mark>Alvarez</mark> voted in favor of the plan. Years of recession-era funding reductions for the police department have ended, but the SDPD has in recent months employed roughly 130 fewer officers than called for in the city's budget--largely due to defections to nearby agencies that offer better take-home pay. \"There should be no higher goal for local government than keeping our neighborhoods safe, and if we continue with fiscal reforms at City Hall we can direct the savings toward ensuring every San Diegan lives in a safe and vibrant community,\" Faulconer said. Feinstein said her support for <mark>Alvarez</mark> in the Feb. 11 runoff election is based on his opposition to assault weapons. <mark>Alvarez</mark> said he was \"so honored to stand with Senator Feinstein to get high powered assault weapons off of our streets. We've seen one too many breaking news stories ripping communities apart. Let's put an end to these senseless acts of violence with common sense solutions .\" <mark>Alvarez</mark> has been endorsed by numerous Democratic state officials and the city of San Diego's lifeguards. meta itemprop = \"datePublished\" content = \"2014-01-13 16:57:51\" > Police investigate woman's death near Birch Aquarium A woman was found mortally wounded with apparent stab injuries Monday in a ravine near the Birch Aquarium at Scripps Institution of Oceanography. A woman was found mortally wounded with apparent stab injuries Monday in a ravine near the Birch Aquarium at Scripps Institution of Oceanography. meta itemprop = \"datePublished\" content = \"2014-01-13 14:43:04\" > Trial ordered for man accused in La Jolla double shooting A preliminary hearing is scheduled Monday for a biotech executive accused of wounding his estranged wife's brother and a former business partner in separate shootings in La Jolla last year. A preliminary hearing is scheduled Monday for a biotech executive accused of wounding his estranged wife's brother and a former business partner in separate shootings in La Jolla last year. meta itemprop = \"datePublished\" content = \"2014-01-14 00:58:22\" > SDPOA backs Faulconer; Sen. Fienstein endorses <mark>Alvarez</mark> Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. Councilman Kevin Faulconer's mayoral campaign Monday gained the support of the San Diego Police Officers Association, while his opponent, Councilman <mark>David Alvarez</mark>, was endorsed by Sen. Dianne Feinstein, D-Calif. meta itemprop = \"datePublished\" content = \"2014-01-13 02:31:28\" > Woman who fell to death at Sunset Cliffs ID'd Authorities released the name Monday of a 25-year-old Northern California woman who fell to her death at Sunset Cliffs during a family visit. Authorities released the name Monday of a 25-year-old Northern California woman who fell to her death at Sunset Cliffs during a family visit. meta itemprop = \"datePublished\" content = \"2014-01-13 14:21:35\" > Police break up brawl between Broncos, Chargers fans in National City A peaceful Chargers gathering in National City turned violent following the game against the Denver Broncos. A peaceful Chargers gathering in National City turned violent following the game against the Denver Broncos. meta itemprop = \"datePublished\" content = \"2014-01-12 23:19:46\" > Motorcyclist killed in collision in El Cajon Authorities released the name Monday of a man killed in a weekend motorcycle crash in his East County hometown. Authorities released the name Monday of a man killed in a weekend motorcycle crash in his East County hometown. meta itemprop = \"datePublished\" content = \"2014-01-13 14:57:16\" > Pedestrian struck by car in Barrio Logan A man was struck by a car and seriously injured in Barrio Logan early Monday, police said. A man was struck by a car and seriously injured in Barrio Logan early Monday, police said. meta itemprop = \"datePublished\" content = \"2014-01-13 14:54:08\" > Motorist crashes into power pole in Lemon Grove An investigation was under way Monday into whether alcohol played a role in a crash in Lemon Grove in which a motorist slammed his pickup into a power pole, knocking out electricity to An investigation was under way Monday into whether alcohol played a role in a crash in Lemon Grove in which a motorist slammed his pickup into a power pole, knocking out electricity to nearby residences and traffic intersections. About 140 Camp Pendleton Marines will say goodbye to family and friends Monday as they depart for Afghanistan, where they will remain until late this year. About 140 Camp Pendleton Marines will say goodbye to family and friends Monday as they depart for Afghanistan, where they will remain until late this year. meta itemprop = \"datePublished\" content = \"2014-01-13 14:11:35\" > Fans welcome Chargers back with cheers And while the season is now over the Chargers and their fans--the team was met by a hero's welcome as they returned to San Diego.", "articleID": "2014011409_00030212_W", "names": {"David Alvarez": ["Q26234692", "Q5230747", "Q5241510", "Q5241511"]}}, {"date": "2014-01-15", "url": "http://livingstondaily.com/article/20140115/NEWS01/301150012/Benefit-aid-grieving-family", "content": "Babies gone, but not forgotten Members of a club they never wished to become part of say they're speaking out for the benefit of...A former movie house and almost a restaurant, the Howell Theater building is now for sale. A speech like the annual State of the State address can be a political smorgasbord. Blame the liberals, not Rogers John Hargenrader says, \"Let's assume the Affordable Care Act provides absolutely horrible results'...The start was eerily like the last time the Howell girls basketball team played in the Brighton...Howell rallies past Brighton in basketball; Fowlerville wins second straight Trailing by 13 at one point in the second half, Howell's boys basketball team rallied, scoring 19...No, those weren't UFOs monitoring downtown Howell on Sunday. Amy Poehler made out with Bono, Tina Fey mocked George Clooney's taste in women and Matt Damon...Lights in the night: Sky-lantern launch today at church in Howell <mark>Ken Smith</mark> did everything he could when his best friend and roommate dropped to the floor in their Gregory home. Albert Kendrick died Jan. 1 of a heart attack at age 45 .\" Nobody saw it coming, \"said <mark>Smith</mark>, who met Kendrick years ago through mutual friends .\" If there were any signs, he didn't tell us. \"Kendrick, who worked in construction for more than 20 years, suffered from fused vertebrae and had spinal issues that had left him without the ability to work for more than six years, according to <mark>Smith</mark>. His wife, Barbara, works in adult foster care to support their three children, 7, 10 and 14, but he said the family is struggling .\" He had a pretty hard life, \"said <mark>Smith</mark>, who shares a home with the Kendricks to help offset their costs. His fondest memories of Kendrick are their fishing trips and Kid Rock concert excursions, as well as his\" dry \"sense of humor .\" He was a hell of a good friend, and he loved his kids to death, \"<mark>Smith</mark> said .\" They're taking it real hard. \"To help the family before disability benefits are transferred, a <mark>Smith</mark> has planned a fundraiser Sunday at The Alley, 2830 Baker Road in Dexter. From 3-6 p.m., all-you-can-eat sloppy joes will be served, and attendees can participate in a 50/50 raffle. Prizes include a large tattoo from Inkwell Tattoos in Brighton and a spa package. The suggested donation to attend is $10 per plate. <mark>Smith</mark>, who himself is disabled from working in construction, said he's considering taking up employment to help the family .\" I don't want their bills to get behind, \"he said .\" The kids need clothes for school. \"Those who wish to provide additional monetary support can donate through Chelsea State Bank in Dexter under Barbara Kendrick's name. <mark>Ken Smith</mark> did everything he could when his best friend and roommate dropped to the floor in their Gregory home. Michigan House Envy: Mansion has waterfall, indoor pool, stalls for horses", "articleID": "2014011518_00008899_W", "names": {"Ken Smith": ["Q10496058", "Q11301324", "Q18631625", "Q3814512", "Q55589856", "Q6388510", "Q6388511", "Q6388514", "Q6388515", "Q6388516", "Q6388517"]}}, {"date": "2014-01-17", "url": "http://worthplaying.com/article/2014/1/17/news/91091/", "content": "PC, PlayStation 3, PlayStation 4, Xbox 360, Xbox One Namco Bandai Picks Up \"Enemy Front' And\" Lords of the Fallen' Lords Of The Fallen is an action RPG set within a medieval fantasy world ruled by a Fallen God where you will fight against the formidable Lords and Generals that command his demonic army. Namco Bandai Games America has signed an agreement with CI Games to become the exclusive distributor for the console versions of Enemy Front and Lords of the Fallen. \"We are very excited to be partnering with CI Games for Lords of the Fallen, and looking forward to maximizing the success of both games across the Americas .\" said <mark>Chris Gilbert</mark>, Senior Vice President of Sales and Marketing for, Namco Bandai Games America Inc.. Enemy Front is an innovative First-Person Shooter combining the latest visuals, game mechanics and open-ended maps with an original approach to the fan-favorite setting of World War II. is an Action RPG which takes place in an original setting, co-developed by CI Games and Deck 13 under the direction of executive producer Tomasz Gop whose past projects include the role of senior producer on two installments of", "articleID": "2014011802_00042523_W", "names": {"Chris Gilbert": ["Q5106657", "Q5106661"]}}, {"date": "2014-01-18", "url": "http://www.thenewstribune.com/2014/01/18/3000054/vikings-metrodome-deflates-for.html#storylink=rss", "content": "Killer offers no words, as victim's family remembers South Hill teen MINNEAPOLIS - The Minnesota Vikings' Metrodome has deflated for the last time. Officials from the Minnesota Sports Facilities Authority opened the relief vents to begin the deflation at 7:15 a.m. Saturday. Fans providing the air that supports the roof were turned off. It was done in 35 minutes. The Minnesota Sports Facilities Authority gave the go-ahead despite concerns about weather conditions. According to the National Weather Service, between 4 and 5 inches of snow fell in the area overnight. Wind was a steady 5 to 10 mph Saturday morning. The deflation will make way for construction of a new $1 billion Vikings stadium. It will be located roughly where the Dome stands in downtown Minneapolis. MSFA Vice Chairman <mark>Bill McCarthy</mark> called it \"a sad and exciting day at the same time .\" > Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2014011901_00060872_W", "names": {"Bill Mccarthy": ["Q16239096", "Q2579916"]}}, {"date": "2014-01-20", "url": "http://www.eastcountymagazine.org/node/14764", "content": "By Miriam Raftery January 19, 2014 (Sacramento) - Governor <mark>Jerry Brown</mark> has issued an emergency declaration due to the third straight year of drought in California. \"We're facing perhaps the worst drought that California has ever seen since records began being kept about 100 years ago,\" the Governor said. He asked all Californians to cut water use by 20 percent. Water conservation is voluntary for now, but could become mandatory if conditions worsen. The Governor also directed state agencies to hire more seasonal firefighters. The State Water Agency offers these tips to reduce your water usage. Find and repair leaks. Take shorter showers or switch to a low-flow showerhead. Turn off faucets when not in use. Cut lawn watering to the minimum and fix broken irrigation systems, since residential irrigation accounts for a third of all urban water use. If possible, replace old toilets and clothes washers with new, more water efficient models. Agriculture is also being hard-hit by the drought, and conditions are expected to worsen over the next few months with no significant rain forecast. Up to 200,000 acres of farmland could be fallowed statewide. Governnor <mark>Brown</mark> said he hopes to receive help from the federal government after issuing the emergency drought declaration. The U.S. Department of Agriculture has designated portions of 11 states as natural disaster areas due to the drought, including portions of California, making farmers eligible for low-interest emergency loans to cover their losses. San Diego is not on the list of areas eligible for such help, however. Despite the Governor's emergency declaration, the San Diego County Water Authority issued a press release Friday stating that it has adequate supplies for 2014 because of local investments in diverse and reliable water supplies over the past two decades, along with a decline in demand for water in our region. San Diego's County Water Authority is not predicting a need for countywide water use restrictions beyond the Governor's request for voluntary 20% cuts. But local officials are encouraging residents and businesses to use water as efficiently as possible to avoid water waste. The San Diego region imports about 85 percent of its water supplies, and this year's imports are expected to be very low. Fortunately the Metropolitan Water District of Southern California, the largest provider of water to our region, says it has adequate stored water reserves for this year since the San Diego region's water users have made great strides in water-use efficiency. Per capita water use has decreased about 27 percent since 2007, and local cities and water districts are on pace to meet their state-mandated water-efficiency targets for 2020. The Water Authority and its 24 member agencies offer rebates, tools and educational programs to improve water-use efficiency at homes, businesses and institutions. For more information, go to the WaterSmart link at www.sdcwa.org. In addition, the Water Authority and its member agencies have made significant investments to diversify San Diego County's water supply sources. Conservation-and-transfer programs that are part of the Colorado River Quantification Settlement Agreement of 2003 provide a significant hedge against drought for our region. Another major piece of the Water Authority's supply strategy is the Carlsbad Desalination Plant, which is under construction. The Water Authority signed an agreement to buy up to 56,000 acre-feet of water annually from desalination project, which is expected to start commercial production in early 2016. It will produce enough locally controlled, drought-proof water to serve approximately 112,000 homes. The Water Authority also is assessing proposed solutions to water supply challenges in the Sacramento-San Joaquin Bay-Delta, which is the source of about 20 percent of the San Diego region's water supplies. It has become less reliable as a supply source in recent years and its habitat has deteriorated. The Water Authority's Board is analyzing potential strategies for restoring the Bay-Delta through a conservation plan.", "articleID": "2014012012_00024605_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}}, {"date": "2014-01-20", "url": "http://whattheythink.com/news/66944-sonoco-dedicates-75-million-biomass-boiler-facility/?utm_source=whattheythink&utm_medium=rss&utm_campaign=rss", "content": "Sonoco Dedicates $75 Million Biomass Boiler Facility Monday, January 20, 2014 Press release from the issuing company HARTSVILLE, S.C. - Sonoco, a global provider of industrial products, consumer packaging, protective solutions and packaging services, today dedicated the new biomass facility at its Hartsville, S.C., plant. The biomass boiler is part of a $100 million investment in the Darlington County compound. \"A key part of Sonoco's culture is our commitment to sustainability, including our dedication to improving the environment and our contributions to the future of the communities in which we operate,\" said Sonoco President and Chief Executive Officer <mark>Jack Sanders</mark>. \"This boiler is proof of that commitment .\" \"We took more than two years to complete final engineering, fabricate the boiler, put together the infrastructure and complete construction of what we believe to be one of the nation's most state-of-the-art biomass co-generation boiler systems .\" In 2011 Sonoco committed to a $75 million investment to replace two aging, coal-fired boilers and add the new biomass boiler at its plant in Hartsville. The new boiler is fueled primarily by woody biomass from regional logging activity, but can also run on natural gas. The boiler will produce about 16 megawatts of green energy that will be consumed by the manufacturing complex, as well as steam that is used in the paper making process. \"South Carolina is being called the fastest growing economy in the Southeast,\" said Governor Nikki Haley. \"One of the reasons is because of innovative projects like Sonoco's biomass boiler. Advancements like this help businesses grow and succeed, attract new customers and bring talent and high-paying jobs to the State .\" \"This is a great day for Hartsville, my entire Senate District, the State of South Carolina and the entire reach of this Company. The investment and jobs that are created here will benefit our entire region. Sonoco, as a company and partner, has made it clear that they are committed to the present and also the future. Conservation and sustainability are the foundation of the Biomass Boiler,\" said Senator Gerald Malloy, District 29. \"This announcement marks the conclusion of an event that's taken two years to come to fruition. Two years, $100 million and countless hours. It also marks an important moment for Sonoco, one of the great stewards of our region. Sonoco is known as one of the world's top manufacturing companies, but they're much more than that. This investment is more than just dollars being put into their plant. It's symbolic of their dedication to our area and what the company means to the citizens of the NESA region,\" said Jeff McKay, executive director of the North Eastern Strategic Alliance (NESA). Why \"Green\" Still Matters on Direct Mail and Packaging (Digital Nirvana) Major Update to Adobe Photoshop CC Brings 3D Printing to the Design World Sonoco Display and Packaging Receives Five Awards at 2013 Design of the Times Competition Sonoco Listed on Dow Jones Sustainability World Index for Fifth Consecutive Year Estimating Specialist at Fineline Printing Group in Indianapolis, Indiana Software Developer - Print MIS at Avanti Computer Systems Limited in Toronto (or remote) Channel Development Manager at Avanti in USA or Canada (flexible - home office) Customer Service Representative at manroland, Inc in Westmont IL Department Chair at Clemson University Department of Graphic Communications in Clemson, SC Why \"Green\" Still Matters on Direct Mail and Packaging (Digital Nirvana) The USPS Sneaks a Rate Increase on Christmas Eve; Media Irrelevance Must be Their Objective (Dr. Joe) Join the thousands of printing executives who are already part of the WhatTheyThink Community.", "articleID": "2014012111_00002265_W", "names": {"Jack Sanders": ["Q11977805", "Q31280199"]}}]