[{"date": "2014-01-21", "url": "http://nz.rd.yahoo.com/news/rss/top_stories/*http://nz.news.yahoo.com/a/-/top-stories/20928927/speakers-to-bring-local-perspectives-to-queentown-event/", "content": "Three speakers with unique Queenstown connections will be joining the programme for TEDxQueenstown: Sense of Place on 22 February 2014. Broadcaster <mark>Andrew Patterson</mark>, musician Mathias Piano Man Lefebvre - known as Mathias Piano Man, and University of Canterbury senior research fellow <mark>John Reid</mark> will join the existing line-up of esteemed speakers to bring some more local perspectives on \"Sense of Place'. RadioLIVE correspondent <mark>Andrew Patterson</mark> has strong roots in Queenstown as a former resident in the 90s. He is a passionate business champion with a bold vision for young people and their place in society. <mark>Patterson</mark> believes that supporting and growing entrepreneurism and investment in youth builds their connection with their community and is vital to the future of New Zealand. Well known by locals for his poignant melodies, Mathias Lefebvre is often seen playing an old kart-mounted piano on the shores of Lake Wakatipu. His unique image has been captured on an award-winning photo in National Geographic, but his story from Belgian masters graduate in humanitarian management to professional busker in Queenstown is even more captivating. <mark>John Reid</mark> is a Senior Research Fellow at the University of Canterbury's Ngai Tahu Research Centre. His research explores the way in which Indigenous and Western cultures shape identity, sense of place, and approaches to social and economic development. In particular, <mark>John</mark> is interested in fostering novel approaches to development through engagement between Indigenous and Western ways of knowing. Event co-curator Cesar Piotto welcomes these speakers as the glue that will tie theme with location .\" These speakers will bring valuable local connections to ideas around sense of place in Queenstown which will reinforce how fitting this theme is for our unique setting. \"Global warmers glad to see the back of 2013 It was the perfect Goon Show script. Scientists denying that ice in Antarctica was expanding got stuck in expanding ice. Global warmer researchers al.. . James Robins January 21, 2:50 pm The National: being brave and being kind It borders on cacophony, building and building, rising and rising, a serene, hazy storm of guitars and rioting drums. Amongst the melee, a bearded fi...Kids Can Corner November 12, 12:52 pm Yahoo! New Zealand News Preferences", "articleID": "2014012203_00066854_W", "names": {"Andrew Patterson": ["Q47316518", "Q4758220", "Q4758221", "Q56539743"], "John Reid": ["Q10426352", "Q13738404", "Q19325643", "Q19894401", "Q22955229", "Q29643487", "Q333461", "Q39078793", "Q43393930", "Q43912712", "Q57566044", "Q6234400", "Q6254532", "Q6254536", "Q6254540", "Q6254544", "Q6254752", "Q751972"]}}, {"date": "2014-01-22", "url": "http://www.theroar.com.au/2014/01/23/history-shows-australia-can-topple-south-africa/", "content": "+ enlarge image First cricket Test between South Africa and Australia at the Gabba ground. AFP PHOTO / <mark>Greg WOOD</mark> Watch on for Glenn Mitchell's thoughts on the Australian Test squad - including his surprise at Shaun Marsh's selection. Australia's chances of maintaining their 44-year unbeaten Test series streak in South Africa will be boosted by a likely low-scoring affair in next month's battle. With both sides boasting supreme pace attacks which will cherish pitches predicted to be green and lively, it seems likely team totals of between 200 and 300 will be the norm. History also suggests as much. Over the past 20 years, the 17 Tests between Australian and the Proteas played in South Africa have been dominated by the ball. The average total for completed innings has been just 271. Further emphasising the low-scoring state of these Tests is the fact that only once in every eight innings has a total of 400-plus been posted. Australia will enter the series as rank outsiders against the imposing Proteas. But low-scoring contests in any sport always increase the likelihood of an upset. South Africa has a history of producing \"result' wickets. This seems unlikely to cease with reports that the Proteas are expected to ask for spicy decks to exploit Australia's lesser batting line-up and negate the edge that spinner <mark>Nathan Lyon</mark> offers the tourists. Masterful batsmen Hashim Amla, AB de Villiers and captain <mark>Graeme Smith</mark> provide the Proteas with a bounty of experience and talent around which to construct their batting order. Australia, by comparison, remain susceptible to batting collapses and would be at their most vulnerable on seaming surfaces. South Africa do, however, have one glaring weakness - their lack of anything close to a reasonable spin option. Loose leg spinner Imran Tahir was vaporised by the Aussies last summer, while left arm tweaker Robin Peterson has taken just 15 wickets at 41 in his past seven Tests. <mark>Nathan Lyon</mark>, meanwhile, has graduated into a genuine world-class spinner, having reaped 37 wickets at 27 in his past nine Tests and regularly snared crucial wickets in Australia's recent 5-0 Ashes triumph. South African batsman Faf du Plessis recently revealed his side were wary of the threat posed by both <mark>Lyon</mark> and cavalier opener <mark>David Warner</mark>.\" Their spinner is bowling very well at the moment, \"du Plessis told supersport.com .\" It might suit us to prepare a greener wicket. It might help us to neutralise <mark>David Warner</mark>, as he could do a lot of damage on another wicket. \"Esteemed South Africa-based cricket journalist Mike Haysman went so far as to suggest that <mark>Lyon</mark> could be Australia's ace. In a column for supersport.com, he encouraged the Proteas to request a juicy pitch for the opening Test at Centurion .\" An energised, confident and vastly improved <mark>Nathan Lyon</mark>, given the correct surfaces, could become Australia's trump card as he constructs a valuable holding pattern early, then spins with an attacking nature later, \"Haysman wrote .\" That will mean going into this crucial opening gambit on a surface that will suit the compelling pace potency that South Africa possess. \"The fact that players and pundits in South Africa are paying such close attention to the preferred state of the pitch indicates how highly the Proteas rate Australia. That is not surprising given the boys in the baggy greens have a proud history of excelling on Test tours to South Africa. Not since 1969-70 have they lost a Test series in that country. Over the past 20 years, Australia's win-loss record in Tests in South Africa is 11-5. The Aussies have regularly produced some of their best cricket away from home against the Proteas. While there have also been some shattering lows, such as the 47 all-out debacle at Cape Town in 2011, Australia have often exceeded expectations. On that last tour in 2011, Australia were predicted to get dismantled by a ruthlessly efficient South African side. The Aussies were fresh from a horrific capitulation in the Ashes earlier that year, while the Proteas had lost only two of their previous 12 Tests. Australia threw away a seemingly match-winning 188-run first innings lead by folding for 47 at Newlands in the first Test. But they rebounded ferociously to draw the series by manufacturing a thrilling two-wicket win at Johannesburg. Australia were similarly written off prior to the 2009 series in South Africa. Having just lost to the Proteas at home, the Aussies were expected to struggle. Yet thanks to spectacular displays from <mark>Mitchell Johnson</mark> and fresh-faced opener <mark>Phil Hughes</mark>, Australia stormed to a 2-0 lead in the three Test series. The Aussies are no more underdogs this time than they were on the previous two tours. In fact, they enter the series in better shape with a settled, confident side. The likely low-scoring nature of this series is tailor made for Australia to once again deny the Proteas victory on their home soil. Please be sure to enter your name and email before submitting this comment. Please also refer to our 7/154 Melbourne Renegades won the toss and elected to bat Recent Overs:...4 1 1 | 1. . 4. 2 | Last Wicket: Ludeman, 20 (c: Hill b: Siddle) Current Partnership: 25 runs, 16 balls, RR:156.25", "articleID": "2014012300_00066193_W", "names": {"David Warner": ["Q3018962", "Q363271", "Q57408725"], "Graeme Smith": ["Q1427233", "Q1541330", "Q1541338", "Q370049", "Q3774173", "Q5592397", "Q5592398", "Q58299803"], "Greg Wood": ["Q18346186", "Q5606450", "Q5606451", "Q59216650"], "Mitchell Johnson": ["Q3180617", "Q54569328", "Q6881268"], "Nathan Lyon": ["Q6969216", "Q6969217"], "Phil Hughes": ["Q1189699", "Q3901330", "Q7182030"]}}, {"date": "2014-01-22", "url": "http://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=11190565&amp;ref=rss", "content": "Hannah (left) and <mark>Lauren Williams</mark> saved four children and an adult from heavy surf at Mangawhai Heads on Tuesday. Photo / <mark>Richard Robinson</mark> Two teenage sisters fought 4m waves to save a man and four children at an unguarded surf beach. Auckland schoolgirls Hannah, 15, and <mark>Lauren Williams</mark>, 17, both off-duty lifeguards, were checking out the surf at Mangawhai Heads on Tuesday when they noticed the group in trouble. They said they were in a pretty dangerous position. \"I ran down and <mark>Lauren</mark> came with me,\" said Hannah. \"There were three girls and <mark>Lauren</mark> helped them get back to shore. I swam out to the man and a boy who were getting bashed against the rocks .\" It was 3-4m surf, and really, really dumping. And there was a very strong current. It was not ideal. \"The man and boy, aged about 11, were out the furthest and the boy was pinned against the rocks by the time Hannah reached them. Three younger girls, thought to be 7-8 years old, were not out as far but were not strong swimmers. Two of them were wearing lifejackets .\" They were struggling, they weren't happy, \"<mark>Lauren</mark> said .\" I think they would have eventually been pushed in...and hit the rocks [as well]. I grabbed the two with the lifejackets and the other girl I held. I got behind them and pushed them out of the water. It was difficult because the current was so strong but I could still stand. \"Meanwhile, Hannah was dealing with the boy, who had been cut up on the rocks .\" The man wasn't quite on the rocks. I swam past him and walked up on to the rocks to the boy. I held him so he wasn't getting bashed against the rocks any more. I carried him back to the dad and swam back to shore, \"Hannah said .\" I had the boy under my arm and I was kind of dragging the man behind me. \"If we hadn't been there, I think they probably would've been pushed over rocks and out to sea. They were out of their depth and they didn't really look like they knew what they were doing .\" Once ashore, the sisters received hugs and thanks from the three girls. The man seemed in shock, they said. The group left the beach in a hurry and their identities were unknown to their rescuers. The teens' mother, <mark>Anna Williams</mark>, who was at the other end of the beach during the drama, was proud of her girls. \"That's what lifesaving is all about. They just drop and go, that's the way they're trained. I'm obviously very proud...they know what to do and they're out there helping people .\" Check beach for lifeguards Weekday lifeguards have already vacated Mangawhai Heads, as well as a number of other popular northern beaches. It's something <mark>Anna Williams</mark>, the mother of two lifeguards, says is an accident waiting to happen. Funding for weekend lifeguards comes from councils, which set the dates their beaches are manned. Weekend guards are usually volunteers, who work longer through the summer season. The two beaches most guarded are Piha and Muriwai, with lifeguards every day from December 2 until March 7. Other beaches vary, with most having weekday lifeguards from December 16, but ending on different dates. Mangawhai Heads has one of the shortest runs, and is manned seven days a week only from December 23 until January 17.", "articleID": "2014012300_00072425_W", "names": {"Anna Williams": ["Q21254170", "Q47009464", "Q54345741", "Q59555374"], "Lauren Williams": ["Q25414715", "Q260139", "Q56290577"]}}]