[{"articleID": "2012042712_00002188_W", "names": {"Armando Rodriguez": ["Q16197429", "Q4792821"], "Eric Campbell": ["Q16554203", "Q3056225", "Q5386235"], "Matt Harvey": ["Q3299470", "Q6788770"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Michael Kay": ["Q14928311", "Q18163348", "Q6831796", "Q6831797", "Q6831798"]}, "date": "2012-04-27", "url": "http://amazinavenue.com/2012/4/27/2979267/mets-daily-farm-system-report-4-27-12-pitching-prospects-give-me-a", "content": "buffalo bisons (11-10) _______________________________________ off day - the bisons will return home tonight to start a four-game series with rochester, rhp jeurys familia will get the start off his best performance of the season. stress fracture in the 2nd right metatarsal...aka he hurt his foot. he has not played since april 20th; he's currently batting .270 with 3 homers and 9 rbi's. jeremy hefner took his place on the buffalo roster. binghamton mets (10-9) _____________________________________ box) not a good night if your name is greg peavey. after retiring the first batter the sequence went single-single-homer-single-single-error...and it goes on like this. he allowed five runs twice in the first three innings. the b-mets lineup went 0-for-7 with risp but that didn't much matter. best not to dredge this one up any more than we already have. juan lagares: 1-4, 2 k (.266 / .347 / .391) matt den dekker:3 -5, hr (3), e (2) (.308 / .360 / .538); his single in the seventh was just his third hit against a lefty in 2012 jefry marte:1 -4, 2b, rbi, r, k (.358 / .407 / .491) still no errors in 15 games, he's come a long way from the 49 he made in '09 greg peavey: l, 2.1 ip, 9 er, 12 h, 2 bb, 3 k, 2 hr (2-1, 7.56, 16.2 ip, 26 h, 14 k, 4 bb, 3 hr); after going scoreless in his first 10 + ip, he's allowed 14 earned over his last six with a .347 opp. avg. (after posting a worrisome .289 mark in hi-a last year) <mark>armando rodriguez</mark>: 2 ip, 0 er, 1 h, 0 bb, 1 k, 1 wp (0-0, 1.50, 12 ip, 6 h, 2 bb, 12 k, 1 hr) between a-rod, elvin and edgin, suddenly there's a nice little wave of relief prospects not too far from helping allan dykstra was placed on the disabled list with a fracture in his right forearm suffered reaching for a throw from starter darin gorski. his estimated time of return is around five weeks. he's currently batting .227 with a homer and 2 rbi's in eight games. his would-be replacement at first <mark>eric campbell</mark> was also placed on the dl with a right shoulder strain. st. lucie mets (16-4) ________________________________________ box) in his first start of the season after struggling with shoulder troubles in 2011, righthander erik goeddel was masterful over five scoreless innings. he once again tantalized with top tier stuff in what's been a frustrating game of cat and mouse between his potential and his health. despite a nice 6' 3 \"frame, his slight physique does give pause when you imagine him one day reaching 200 innings. but on this day no imagination necessary. oh and four hitless relief innings helped too. runs weren't any easier to come by on the other side, but you can credit robbie shields who anchored the single-sac fly-single, small ball method. ps - the 2011 st. lucie mets called and said,\" haw-haw, we were 17 & 3. \"cesar puello:0 -3, k, sb (4), hbp (1) (.250 / .311 / .393) wilmer flores: 2-4, cs (1) (.323 / .355 / .523); hit streak to ten as he continues to hold up his end of the\" just hit and we'll figure something out' development plan i said, \"...in my view there's no reason why [tovar] can't become a player very much like ruben tejada, just a little slower/less aggressive on the development curve.\" ...and apparently cory vaughn: 0-3, k (.258 / .361 / .435); .229 over his last ten darrell ceciliani: dnp (.346 / .414 / .615); after missing 11 games, dc re-injured the hamstring in just his second game back and his timetable for return is unclear...too bad as he was off to a very nice start danny muno: 0-4, k (.276 / .353 / .487) 2b robbie shields: 1-4, rbi, 2 k (.258 / .299 / .371) erik goeddel: 5 ip, 0 er, 3 h, 1 bb, 5 k (0-0, 1.13, 8 ip, 6 h, 3 bb, 6 k, 1 hr) andres torres: dnp rehab alert - rhp d.j. carrasco: w, 2 ip, 0 er, 0 h, 1 bb, 0 k; what does it say that i'm actually looking forward to his return to supplant batista? released '08 ninth rounder rhp <mark>eric</mark> beaulac this week. i always liked his potential as a sinkerballing relief prospect but he just couldn't stay healthy. additionally, they welcomed rhp kyle allen and 2011 late season surprise of gilbert gomez ranked gomez the club's 48th best prospect coming into 2012 based almost entirely on his superb september with the team last year...that and his excellent athleticism. finally, in a bit of sad news, of sean ratliff decided to hang up the spikes after his return from that catastrophic eye injury last spring just wasn't working out. ratliff was 3-for-22 with ten strikeouts so far this season. box) just as we prepare to welcome domingo tapia into the top tier of mets piching prospects with open arms, this happens. the talented 20-yr old--who had struck out 17 men over his last 12 + ip--retired just four batters last night, while allowing eight runs on eight hits. oh and a balk for good measure. i know he's young and figuring stuff out and this doesn't mean much in terms of his long term development...but damn it's annoying. like in bingo, gnats batters weren't good with risp (1-for-9), but that didn't really matter. aderlin <mark>rodriguez</mark>: 0-3, bb, k (.200 / .269 / .388); of course i love the plus power but i'm starting to wonder if his hit tool will ever even be passable...walks are up a tick but so are the k's, ceiling here is starting to resemble cam maron: 0-5, k, pb (2) (.224 / .324 / .259) travis taijeron: 0-3, 2 k, hbp (4) (.250 / .395 / .438); lots of k's aren't surprising, lots of bb's are (hbp's too) dustin lawley: 2-4, hr (4), k (.286 / .364 / .506); 23-yr old 2011 19th rounder can definitely hit some and if he picks up the catching gear--as he did this spring--he instantly becomes interesting domingo tapia: l, 1.1 ip, 8 er, 8 h, 1 bb, 0 k, balk (1-1, 6.16, 19 ip, 21 h, 20 k, 3 bb, 0 hr, 6.20 gb: fb); at least all but two hits were just singles...clearly he's still got a lot of learning to do though roster update: 2011 kingsport reliever got to be goeddel tonight who dazzled in his first start of 2012. as always i'll keep my fingers crossed that he stays healthy, knowing that if he does he could join the upper echelon of mets pitching prospects. and if you were wondering, yes that is his brother tyler who is currently crushing for the rays lo-a affiliate. he too was drafted in the first round (last summer) after committing to ucla. good genes. goat of the night peavey, peavey, a million times peavey. broken pitchers applesauce: pelfrey might be done, mets sign an emu mets daily farm system report - 4/26: ladies and gentleman, <mark>matt harvey</mark> this date in mets history: april 26 - keith hernandez's 1000th rbi, dante bichette ruins opening day <mark>david wright</mark> sets new mets rbi mark: a walk through the amazin's record book - sb nation new york rangers baseball couple tells its side of the story, wants an apology from <mark>michael kay</mark> 21-glum salute: pictures of emo albert pujols looking concerned, worried, defeated and/or sad cardinals' lance lynn bears an eerie resemblance to old white sox pitcher lamarr hoyt"}, {"articleID": "2013072117_00041038_W", "names": {"Rachel Martin": ["Q16211141", "Q7279321"]}, "date": "2013-07-21", "url": "http://kuer.org/post/woman-among-men-female-firefighter-blazed-trail", "content": "During a drill, teenage girls attending a firefighting camp secure their counselor, firefighter Clare Burley, for a basket rescue at Arlington County's fire station. Arlington County, Va., wants more female firefighters. The fire department there has even set up a camp to inspire potential recruits. Donning helmets and matching camp shirts, teenage girls line up to watch a demonstration: A model room with furniture is ablaze. Camper Tara Crosey says she came to camp in part because she \"wanted to show that girls are as strong as boys and girls can do what boys can do.\" The glass ceiling in this department was broken by Judy Brewer in 1974, when she became the nation's first female career firefighter. She paved the way, but the road to a career as a firefighter is still obscured for many women. That's what Arlington County firefighter Clare Burley is hoping to change with this camp, which started last year. She and her colleagues wanted to give girls an introduction to this potential career path. \"Little boys always hear about it - they get little fire trucks as toys - and girls never really get that kind of introduction,\" she tells <mark>Rachel Martin</mark>, host of Weekend Edition Sunday. \"So we wanted to get them thinking about it, come play with us, you know, see what we do, see how many female firefighters are here.\" Compelled To Help When Judy Brewer decided to become a firefighter in the '70s, there weren't other women to look to. But she was helping her then-husband study for his fire science degree, and (Warning: Images in the publication may be disturbing for some viewers .) \"I had read a publication called America Burning, and was really struck by the pictures of the absence of children, say, in a crib,\" she tells Weekend Edition. \"They would also have pictures of children that were hiding in a closet or under a bed or next to a bureau because they didn't know what to do and they couldn't get out.\" So she thought, \"I'd really like to be able to do something to at least save somebody.\" Support for Brewer's decision came from her family, particularly her four sisters. But not everyone was in favor of the career move. \"When I applied at my local fire station to volunteer in Fairfax County, I was told essentially to go back to my kitchen, it was no place for a woman,\" she says. Fellow churchgoers asked how she could \"lower\" herself to do that kind of job. Brewer's fellow firefighters weren't accepting, either. \"When I first was hired, people were worried about different things,\" she says. \"The one that they used as a reason was that they were afraid that I would compromise them in a fire by not being able to help them if they got into trouble.\" She had no doubts about her own abilities, though, and just maintained her physical shape - and stood her ground - until they decided to let it go. Brewer says it took nearly two years for her to feel accepted as part of the team. Over the years, Brewer did save \"many, many, many people.\" But, she says, \"The ones that stick with me are the ones that I couldn't save.\" There weren't always support services for firefighters, and some incidents affected her more than she realized at the time. Ultimately, however, she says she had to put the losses behind her. \"And you just keep saying, OK, I'm doing a lot of good. And you just keep moving forward,\" she says. Brewer served the Arlington County Fire Department from 1974 to 1999. When she retired, she was the first female battalion chief in the country. Doing More Fast-forward to the current team of Arlington County firefighters, and you'll find not one but 22 women. That's out of more than 300 firefighters. Firefighter Burley says that's pretty good, compared to the rest of the country. The Bureau of Labor Statistics reports that in 2012, women made up 3.4 percent of the nation's firefighters. \"But it's still a pretty small proportion. And it seems like the newest recruit classes are actually getting fewer women, not more,\" she says. \"So we feel like we need to do something more, get out in the community, and talk to girls a little bit more about choosing the fire service as a career.\" "}, {"articleID": "2018110623_00220012_W", "names": {"Steve Ball": ["Q16836483", "Q7611857"]}, "date": "2018-11-06", "url": "http://www.msn.com/en-gb/news/newsliverpool/47-year-old-man-died-after-horrific-frenzied-attack-inside-kirkby-flats/ar-BBPpuOS?srcref=rss", "content": "© LIVERPOOL ECHO A murder investigation has been launched after a man was attacked inside a flat on Kelday Close in Kirkby A 47-year-old man died in hospital after an horrific \"frenzied attack' inside a block of flats, neighbours said. The emergency services were called out to to an address in Kelday Close in the Northwood area of Kirkby at around 3.45 am on Tuesday, October 23 to reports a man had been assaulted. Days later police put a closure order in place at a flat in the close. Today police said that the victim, who suffered serious head and chest injuries after an assault, died in hospital this morning. A 55 year-old man from the Kirkby area was arrested on suspicion of murder this afternoon and is being questioned by detectives. Today locals told the ECHO that the victim died after a\" frenzied attack .' Man trying to get his stolen bike back is brutally attacked by youths and put in hospital © Credits: LIVERPOOL ECHO LIVERPOOL ECHO A neighbour said: \"The lad's name was Ian. He was visiting the flats when he was attacked. He was beaten and then stabbed. He was a good lad and it was all over it nothing.\" Another local man said: \"It was a frenzied attack, really really bad. He was kicked, punched and then stabbed.\" © Credits: LIVERPOOL ECHO LIVERPOOL ECHO Police declined to comment on the suggestion the victim died from stab wounds prior to a post-mortem which is set to take place. The victim's family have been told of his death. A police closure order was put in place at 15 Kelday Close on October 31 following reports of drug fuelled violence, criminal damage and alcohol misuse. South Liverpool crime wave warning as shocking new tactics being used to raid homes A 50-year-old man and a 55-year-old man arrested at the time of the assault have since been released on bail. Detective Inspector <mark>Steve Ball</mark> said: \"A murder investigation has now been launched following the death of the victim in hospital and I would now urge anyone with information to please come forward.\" You may have been in the Kelday Close area around the time of the incident, or witnessed or heard something in the weeks following. No matter how small, your information could prove vital to the investigation and I would ask you to please contact @ MerPolCC, 101 quoting ref. 18400009584 or @ CrimestoppersUK on 0800 555 111. \""}, {"articleID": "2011052611_00035364_W", "names": {"John White": ["Q10383267", "Q15821600", "Q16215641", "Q17423827", "Q18385573", "Q21230044", "Q21598415", "Q28873238", "Q3182735", "Q3809674", "Q43395687", "Q459082", "Q51586479", "Q53838422", "Q53838425", "Q53838427", "Q53838454", "Q54932732", "Q56817081", "Q6263775", "Q6263782", "Q6263788", "Q6263790", "Q6263798", "Q6263800", "Q6263804", "Q6263809", "Q719350"], "Richard Carpenter": ["Q1342887", "Q18530768", "Q577671", "Q7324631"]}, "date": "2011-05-26", "url": "http://nola.com/opinions/index.ssf/2011/05/progress_in_standarized_tests.html", "content": "public school students in most of the metro area continue to make strides on standardized tests, according to scores released this week, with the recovery school district schools in new orleans posting the largest gains. rusty costanza, the times-picayune archive students at william fischer charter school in algiers participate in a leap test rally in april. that's strong evidence that the transformation of the city's public schools after hurricane katrina continues to yield results. education officials at the state and local level need to continue pushing in that direction and fend off efforts to erode reforms. students across most of our area showed progress, although large discrepancies exist between districts. the top average performance came from students in the 16 schools that remain under the orleans parish school board. that's hardly surprising, as the board in 2005 kept only schools that were not failing before the storm and several of those campuses are magnet schools with admissions requirements. overall, schools in st. tammany, plaquemines, st. bernard and st. charles parishes continued to perform near or above the state averages in most results of the state leap, ileap and graduate exit exams administered this spring. some parishes were significantly better than the state's figure. but not all students saw gains from last year. st. tammany has performed well above the state's average for several years and saw gains in all areas, except the graduate exit exam taken by students in 10th and 11th grades. those results actually dipped a bit from last spring, and officials need to focus on maintaining gains and improving performance across the board. state officials highlighted the gains recorded in st. bernard in recent years. since 2007, the percentage of st. bernard students scoring at \"basic\" proficiency--essentially at grade level--or above has risen 17 percent. that's an impressive gain. but the largest gains overall came among the new orleans schools the state took over after katrina because of their historic poor performance. most of those schools are now independent charters overseen by the rsd, which also runs a number of traditional schools. rsd students, including charter and traditional campuses, posted their fourth-consecutive year of improvement, increasing the proportion of students scoring at grade level or above to 48 percent. that's a 5 percent gain compared to 2010. with that progress, the proportion of rsd students scoring at grade level or better has more than doubled since 2007, from 23 percent to 48 percent. the numbers reflect the progress sparked by the wholesale reform of the system after katrina. the district still has substantial ground to cover to raise its overall performance to the state average. but the progress since katrina would have been unthinkable without the reforms. the track record of the system in recent years--including these latest scores--should stymie efforts by some teacher unions and other critics of charter schools to erode reforms the rsd is not perfect, and it needs to address inequities between individual schools. the system also needs to focus on improving performance among new orleans schools that are still well below the state average. that's particularly true for high schools still run directly by the rsd. rsd superintendent <mark>john white</mark> said the results show the district is a national model for broader education reform efforts. \"the new orleans system of schools works. period. end of story. and we cannot go back to a system that does not put children's needs first.\" he said. \"these results should close the book on that question.\" mr. <mark>white</mark> is right. new orleans' results also show that officials in jefferson parish must accelerate their push for reform. jefferson schools, which now rank 52nd out of 70 public school systems in louisiana, posted gains in five of seven grade levels that take the standardized tests. but jefferson still remained well below the state's average and also had a dismaying 21 percent drop from last year's scores in the gee. that's unacceptable for one of the largest and richest public school systems in the state. \"we cannot be complacent, satisfied or celebratory,\" deputy superintendent <mark>richard carpenter</mark> said of the results. indeed. the message jefferson officials should draw from these results is that they should pursue reform as vigorously as their rsd counterparts have done in new orleans. and even the school systems with the best scores in the region need to continue working to improve."}, {"articleID": "2014042114_00037233_W", "names": {"Stephen Moore": ["Q1410667", "Q15849215", "Q2344985", "Q28168026", "Q28871848", "Q57688178", "Q7610021", "Q7610023", "Q7610033"], "Samuel Bell": ["Q47163071", "Q7410897"], "Ken Block": ["Q16195907", "Q16196378", "Q438382", "Q47361851", "Q6387341"]}, "date": "2014-04-21", "url": "http://eww.golocalprov.com/politics/Top-Natl-Regional-Progressives-and-Conservatives-Debate-at-URI/", "content": "State Report: Marijuana Tax + Bill Targets Prostitutes and Pimps RI Beauty Insider: Pedi Nation - Get the Best Pedicure Ever Fit for Life: Fail to Plan? Plan to Fail - Plan and prioritize, and you will prevail Arthur Schaper: Grand Theft Auto Cicilline - MINDSETTER Arthur Schaper examine's Cicilline's role in Prov's...Five Live Music Musts - April 18, 2014 - Great vibes await Report: Preston Murphy Leaving URI for Boston College EXCLUSIVE: Bryant Tells Grads No Selfies with President at Grad Top progressives and conservatives from the region--as well as national organizations--will be debating the future of Rhode Island in an event on Saturday titled, What's Really in Our Best Interest? The debate will be held on April 26 at the University of Rhode Island, featuring nationally prominent and local political experts who will discuss both the economic and moral implications of public policy in Rhode Island. The RI Center for Freedom & Prosperity, a nonpartisan local think tank organizing the event that, today named the debate moderator and the full slate of panelists. Registration is free and is now open to the public, but seats are limited and pre-registration is required. For event registration, go HERE. The event will be moderated by Josh Fenton, founder and CEO of GoLocalProv.com, the official media partner for the event. Giving the debate a unique angle and optic, students from local colleges were selected to debate alongside professional policy experts. Leading conservative and progressive panelists participating are: <mark>Stephen Moore</mark>, chief economist at the Heritage Foundation and frequent analyst on FOX News and CNN Rich Benjamin, senior fellow at Demos, and frequent analyst on MSNBC and NPR Don Watkins, fellow at the Ayn Rand Institute, published in Forbes and USA Today Tom Sgouros, local public policy expert and writer for RI Future and a former Mindsetter (TM) to GoLocalProv.com Justin Braga, chair of RI College Republicans, studying political science at Brown University <mark>Samuel Bell</mark>, RI coordinator for Progressive Democrats of America, and Amherst College grad \"I anticipate a rigorous debate of issues that most politicians are not bold enough to discuss publicly,\" said Mike Stenhouse, CEO for the Center. \"If you'd like to hear dramatically opposed viewpoints, this is the place to be.\" The debate is presented by the Center in association with the 2014 RI Student Political Empowerment Conference, an annual non-partisan gathering of area college student to discuss public policy issues and advocacy. The debate will take place Saturday, April 26 at Swan Hall on the University of Rhode Island Campus. Doors open at 8:30 am, with refreshments by Dunkin Donuts. The debate begins at 9:30 am. The debate is structured to be a free-wheeling forum where widely divergent public policy approaches will be argued as to which actually helps people the most. The first segment will deal with economic philosophies as they pertains to issues currently under consideration in the Ocean State, such as the minimum wage and sales tax or other tax reforms. The second segment will deal with the moral questions surrounding public policy about whether or not individuals are responsible for the well-being of others and whether some public assistance programs are immoral. A live, streaming webcast of the debate is also being planned, as well as an archived online version. The Rhode Island Center for Freedom and Prosperity, a nonpartisan public policy think tank, is the state's leading free-enterprise research and advocacy organization. The Center works to make a profound, positive impact on the lives of every family and business in the state through the rigorous exchange of market-based ideas and reform solutions aimed at restoring economic competitiveness, educational opportunities and - ultimately - hope for a brighter future. www.RIFreedom.org. Related Slideshow: 7 Strategies for Rhode Island Economic Development in 2014 What will it take to move the Rhode Island economy forward in 2014? GoLocal talked with elected officials, candidates, and leaders for their economic development plans in the coming year. Below are key elements of the economic priorities for Governor Lincoln Chafee, Speaker of the House Gordon Fox, Senate President M. Teresa Paiva-Weed, House Minority Leader Brian Newberry, gubernatorial hopefuls General Treasurer Gina Raimondo and <mark>Ken Block</mark>, and RI Center for Freedom and Prosperity's Mike Stenhouse. Governor Lincoln Chafee \"My goal is to have the state continue to focus on the fundamentals. We will invest in education, workforce development and infrastructure, and provide aid to cities and towns to lessen the burden on property taxpayers. I'm confident that these investments and our focus on the basics will allow Rhode Island to exceed Moody's predictions.\" Speaker Gordon Fox \"Among the many pieces of legislation the House will address will be issues of higher education affordability, expanding apprenticeship opportunities, and offering help to our manufacturers. We will also look closely at our tax structure to make sure we are competitive with our neighboring states, including the corporate tax and the estate tax, and I will carefully review the recommendations of the commission studying our sales tax.\" Senate Pres. Paiva-Weed Greg Pare, spokesperson for the Senate President, said that the Senate is planning to issue recommendations soon on workforce development initiatives to address the skills gap among Rhode Island job seekers. \"An example of a proposal anticipated in that report is the elimination of state's Indirect Cost Recovery on the Job Development Fund, which is about $1.2 million this year. Those funds would be directed towards job training and skills development programs to provide immediate impact and help workers gain the skills necessary to succeed in today's economy.\" Gen. Treasurer Raimondo \"To grow our economy, we need to make Rhode Island a leader in manufacturing again. Great things can happen at the intersection of government, higher education, and the private sector. Rhode Island is lucky to have thriving institutions in each of these three sectors, and we need to foster collaboration among them to find solutions to our challenges, and spark our economy. By promoting partnerships in high-growth areas, [Rhode Island Innovation Institute] will help grow our manufacturing base, and create new, high-quality jobs.\" <mark>Ken Block</mark> \"First, we need to fix Rhode Island's broken Unemployment Insurance program. The state's Unemployment Insurance tax, paid by employers, is ranked worst in the country by the Tax Foundation. It is one of the factors that makes Rhode Island an uncompetitive place to do business. Also, it is inherently unfair that a large group of businesses are effectively subsidizing the payrolls of a small group of businesses who misuse the system. There is a simple change to state law that can fix this problem.\" \"Rhode Island's temporary disability tax (TDI) is broken, and places an unnecessarily high tax burden on Rhode Islanders. This tax, paid for by employees, will be reduced by changing the way we manage the program. As Governor, I will substantially reduce the cost of purchasing this insurance by requiring that Rhode Island's program adhere to national norms.\" \"To best encourage new job creation, I propose the following tax incentive: exempt from future capital gains taxes any new investments in Rhode Island-based businesses. This change would create a powerful incentive for investors who are deciding where to locate a new business, or where they relocate an existing one. This proposal has the potential change the economic playing field for Rhode Island.\" Minority Leader Newberry \"It would be overly ambitious to set being #1 as a goal right now, but we think 25, the middle of the pack, is a reasonable goal to set, one we think we should pursue, and one we can achieve,\" said Newberry. \"One of the initiatives is a requirement that every bill receive a fiscal evaluation before it can be heard by committee, better insuring that legislators know the real cost of the legislation they are acting on.\" \"Another proposal would exempt social security income from RI state income tax, making Rhode Island more tax-friendly for our seniors and keeping them here rather than migrating to more tax-friendly states.\" RI Could Become First State to Legalize Pot Without Voter Approval"}, {"articleID": "2013102320_00084769_W", "names": {"Dick Jones": ["Q2707376", "Q27909772", "Q5273069", "Q5273070"]}, "date": "2013-10-22", "url": "http://cnsnews.com/mrctv-blog/eric-scheiner/you-call-glitch-robocop-or-healthcaregov", "content": "\"I'm sure it's only a glitch, a temporary setback.\" - <mark>Dick Jones</mark> (\"Robocop,\" 1987) Many in the media insist on dismissing the problems with the Healthcare. gov website as mere \"glitches.\" The term seems to trivialize the amount and severity of problems the Obamacare website is having. Software engineers have told CBS News the website is simply poorly designed. \"How do you tax people and force them to buy a product they don't want at a website that doesn't even work?,\" I'm know I'm dating myself, but the whole thing reminds me of \"ED 209\" from the 1987 movie \"Robocop.\" ED 209 was a large, lethal - and flawed - law enforcement robot intended to ensure people comply with the law within a specific time frame (sometimes 20 seconds). A demonstration of Ed's talents (and failings) when he wasn't really ready for deployment ended up causing quite a bit of damage. After a fatality, <mark>Dick Jones</mark>, one of corporate executives responsible for ED's development said, \"I'm sure it's only a glitch, a temporary setback.\" "}, {"articleID": "2008091810_00029341_W", "names": {"John Sheridan": ["Q28007064", "Q30095126", "Q41453110", "Q42806284", "Q552767", "Q6257622", "Q6257625", "Q6257627"], "James Earl Jones": ["Q203960", "Q2074528"], "David Prowse": ["Q128379", "Q5238735"]}, "date": "2008-09-18", "url": "http://pressstartblog.wordpress.com/2008/09/18/farceunleashed", "content": "the farce unleashed? first impressions of the new star wars game (360) did you know that the name of darth vader's secret apprentice in star wars: the force unleashed - \"starkiller\" - was the original surname of luke skywalker in early drafts of the original star wars screenplay? or that babylon 5 showrunner j michael straczynski paid homage to this fact by giving his own lead character, <mark>john sheridan</mark>, the starkiller moniker as his nickname among the mysterious minbari? no? then be assured that i've now outlined my sci-fi geek credentials. you're in safe hands here. i've always ignored the litany of star wars expanded universe material. my view is that if a plot isn't canon, then balls to it. therefore the lucas-approved storyline in force unleashed, which fills in the squiggly bits between episodes iii and iv of the star wars saga, is the first major draw outside the movies for me personally, for years. just how did we get from the jedi being wiped out, to the fledgling rebel alliance? and what does the apprentice - who seemingly exists solely to do darth vader's duplicitously dirty, off-the-books bidding, rather than shouting \"that's what i'm talking abaaaaat!\" every five seconds - have to do with it all? the early story cutscenes are promising. the apprentice himself is surprisingly likeable and sympathetic rather than brimming with the expected genero-teen-angst evil, and an engaging droid character called proxy provides the funnies while having more than a little bit of sinister bite behind him. he doesn't even come across as an hk-47 rip-off, which is refreshing. the only downsides are darth vader's \"it's not really him, is it? why didn't you get <mark>james earl jones</mark>, you idiots?\" voice and subtly misjudged line-readings, which make you root for man-in-the-suit <mark>david prowse</mark> to finally be given the chance to utilise his \"the farrrrce is strang wiv you, moi luvver\" vocal talents. the first test, however, is easily passed. since the story isn't rubbish, force unleashed is automatically better than 99% of narrative-based games. but the other story here - the gameplay itself - is more troublesome, and force unleashed has many of the same problems that crop up again and again in third person action adventures. the major issue is the automatic targeting system, which is, frankly, broken. it selects your target very vaguely based on the direction in which you're facing, but there badly needs to be an option to switch manually, as in the middle of a fight against multiple enemies, with multiple targetable objects also around you, it's almost impossible to force grip the exact stormtrooper you really want to fling about. this leads to the game becoming rather more of a button-masher than it should be. with the targeting woes hampering efforts at precision, the best strategy is to hammer the lightsabre and various force buttons willy-nilly in order to rid the screen of all opposition. the euphoria engine (formerly seen in grand theft auto iv) proves itself to be the ideal technical gubbins to depict chaotic uses of the force here, with the requisite force grip and force push abilities all present, spangly and correct. the action often looks spectacular onscreen, with enemies flying through the air in multiple directions, and electronics being ripped out of their housings to explode all over the place, but when the button-mashing is compounded by the dreaded qte sequences that pop up when defeating some of the larger enemies and in boss battles, it often feels that you're not in complete control of the action. your inability to move while using the force, and the swiftly dwindling energy bar for use of the ability (presumably both present for difficulty balancing purposes), are the final nails in the coffin. having seen jedis fight in the movies, the force unleashed's control problems and restrictions make the combat more old man guinness than young pretender mcgregor. the game isn't helped by the level paths' extreme linearity either, which almost jedi mind tricked me into thinking that n + is a free-roaming extravaganza. still, the art design is absolutely lovely, the music recognisably star wars, and general presentation - apart from the screen tearing and some clunky loading times - is everything you'd expect from a big budget game. certainly the compulsion to get to the next slice of the plot will overcome many of the gameplay problems for star wars fans. however, for anyone who has no interest in the story and has been fooled by the hype into expecting combat on the level of a ninja gaiden or devil may cry, this probably isn't the game you're looking for. darth vader, everyone's favourite intergalactic sir alan sugar, certainly shouldn't fire his apprentice at this point, but neither should he rush to hire him quite yet."}, {"articleID": "2019100410_00108479_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2019-10-04", "url": "https://www.forexcrunch.com/bitgo-customers-can-earn-13-per-annum-on-staking/", "content": "BitGo customers can earn 13% per annum on staking You are at: Home \"Crypto News\" BitGo customers can earn 13% per annum on staking BitGo customers can earn 13% per annum on staking Oct 4, 2019 10:07 GMT | Last Modified: At the initial stage, staking rewards for Dash and Algorand are available. More coins will be added to the platform in the future. A custodian solutions provider BitGo offered customers the opportunity to receive passive income on cryptocurrencies Dash (DASH) and Algorand (ALGO). The coin holders that store their assets with BitGo Trust will receive staking rewards on Dash and Algorand deposits. The rate of return will vary by coin, from 7 percent to up to 13 percent for Algorand. More coins to be added in the future. \"In order to be a great custodian, we need to provide our clients with the ability to use their assets in custody. Staking provides our clients with returns on their investments without ever moving their assets out of custody,\" said Ben Chan, CTO, BitGo. In addition, the company acquired a startup Hedge, involved in building staking infrastructure. BitGo is confident that the new acquisition will provide an opportunity to automate many operations and expand the functionality of the service. \"Our acquisition of Hedge builds on the blockchain and staking expertise within our engineering platform to deliver an automated, end-to-end staking service.\" Read also: A crypto custody provider BitGo supports cryptocurrency staking About ForexCrunch Forex Crunch is a site all about the foreign exchange market, which consists of news, opinions, daily and weekly forex analysis, technical analysis, tutorials, basics of the forex market, forex software posts, insights about the forex industry and whatever is related to Forex. Apple CEO <mark>Tim Cook</mark> not comfortable with private entities creating modern digital currencies Disclaimer Foreign exchange (Forex) trading carries a high level of risk and may not be suitable for all investors. The risk grows as the leverage is higher. Investment objectives, risk appetite and the trader's level of experience should be carefully weighed before entering the Forex market. There is always a possibility of losing some or all of your initial investment / deposit, so you should not invest money which you cannot afford to lose. The high risk that is involved with currency trading must be known to you. Please ask for advice from an independent financial advisor before entering this market. Any comments made on Forex Crunch or on other sites that have received permission to republish the content originating on Forex Crunch reflect the opinions of the individual authors and do not necessarily represent the opinions of any of Forex Crunch's authorized authors. Forex Crunch has not verified the accuracy or basis-in-fact of any claim or statement made by any independent author: Omissions and errors may occur. Any news, analysis, opinion, price quote or any other information contained on Forex Crunch and permitted re-published content should be taken as general market commentary. This is by no means investment advice. Forex Crunch will not accept liability for any damage, loss, including without limitation to, any profit or loss, which may either arise directly or indirectly from use of such information."}, {"articleID": "2015100520_00045677_W", "names": {"Wally Smith": ["Q57829222", "Q7963493"]}, "date": "2015-10-05", "url": "http://westhawaiitoday.com/news/nation-world-news/japan-keeps-lid-rice-us-sugar-trans-pacific-deal", "content": "Japan keeps lid on rice, US on sugar in Trans-Pacific deal Published October 5, 2015 - 9:47 am Updated: October 5, 2015 - 9:47 am By Alan Bjerga Bloomberg News Japan budged little on rice, the U.S. gave few concessions on sugar and Canada's dairy system stayed intact in the Trans-Pacific Partnership agreement reached by trade ministers of 12 nations Monday, with the toughest agriculture issues resolved by tinkering. The deal gives U.S. livestock producers new market access and simplifies inspection rules for fruits and vegetables while lowering taxes across farm goods, according to Darci Vetter, the U.S. Trade Representative's chief agriculture negotiator. While not reaching the ideals hoped for by domestic commodity groups, American agriculture benefits more than enough to line up behind the deal, Vetter said. \"The whole point of trade is that not every country's responsibilities are the same. Not everyone is focused on the same products,\" Vetter said in an interview before the final deal was announced. \"We have some wins in here.\" Negotiators in Atlanta wrapped up final agreements on agriculture, autos, drug patents and other thorny issues that have held up the TPP, a top priority of U.S. President Barack Obama. The deal includes nations that compose 40 percent of the world economy and create a regional trade bloc countering China's growing influence in Asia. U.S. farm exports topped $150 billion in 2014 and account for more than one-fifth of the country's agriculture production, according to government data. TPP will boost sales by \"billions,\" Vetter said, declining to make a specific estimate. Rice, sugar Tariffs and other barriers to farm goods, including rice, sugar and dairy, were among the final snarls that caused earlier talks in Hawaii to break off in July. U.S. negotiators touted agricultural opportunities they're gaining in growing Asian markets, where reductions in tariffs on U.S. goods would make products more competitive with Australia, New Zealand and other competitors, Vetter said. \"Our meat industry is a big winner,\" Vetter said, with pork duties going away in Vietnam and Japan capping tariffs on the meat at 50 yen per kilogram and making it easier for U.S. shippers such as Tyson Foods Inc. to target specific meat cuts for the Japanese markets. Pork was one of Japan's top-priority agricultural commodities heading into the TPP, along with beef, dairy, sugar, rice and other grains. On rice, Japan is establishing a new quota of 50,000 tons of U.S. imports, which will rise to 70,000 over 13 years, along with potential new opportunities for increased U.S. sales within quotas already created through the World Trade Organization. Less than hoped The quota was less than that hoped for by rice exporters in the U.S., the fifth-leading shipper of the grain after Thailand, India, Vietnam and Pakistan. Japan, where the grain has been culturally and economically important for millennia, imports almost none of its supply, thanks to high tariffs supported by JA-Zenchu, the nation's union of farmer cooperatives. While not as important culturally as rice to Japan, U.S. sugar access was another obstacle, with Australia wanting the U.S. to loosen a quota system that protects its own industry and protections that date to the Great Depression. Under TPP, the U.S. is establishing a new quota for Australia, with an option to raise that allotment in years when the domestic import need is greater, Vetter said. \"We're providing Australia with the same upfront quota as other nations,\" Vetter said. Dairy fight Dairy was the last major area to be resolved. Exporters Australia and New Zealand had called for greater access to the U.S. market, though the biggest criticisms were reserved for Canada, where a system of tariffs and supply management has insulated the country's 12,000 dairy farmers from the rest of the world. Dairy has emerged as an emotional issue in Canada's nationwide elections to be held later this month. Tractors converged on Ottawa, the nation's capital, earlier this week as farmers pressured the government to reject any TPP agreement. One of the final pieces of the deal to come together involved Canada's unique protections against imported dairy goods. In the end, Canada agreed to open--over five years--foreign quotas for 3.3 percent of its dairy market, 2.3 percent of its egg market, 2.1 percent of its chicken market, 2 percent of its turkey market and 1.5 percent of its broiler hatching eggs market. \"We obviously would have preferred that no additional market access be conceded in the dairy sector,\" Dairy Farmers of Canada President <mark>Wally Smith</mark> said in an e-mail. \"However, we recognize that our government fought hard against other countries' demands, and have lessened the burden by announcing mitigation measures and what seems to be a fair compensation package.\" To contact the reporter on this story: Alan Bjerga in Washington at abjergabloomberg.net To contact the editors responsible for this story: Jon Morgan at jmorgan97bloomberg. net Elizabeth Wasserman"}, {"articleID": "2014061620_00008254_W", "names": {"Roy Moore": ["Q17466511", "Q27924997", "Q5302905"], "John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"]}, "date": "2014-06-16", "url": "http://thinkprogress.org/justice/2014/06/16/3449221/it-took-until-last-friday-for-an-alabama-court-to-strike-down-that-states-ban-on-gay-sex/", "content": "A law is still on the books in the state of Alabama which provides that a person is guilty of \"sexual misconduct\" if they engage in \"[a] ny act of sexual gratification between persons not married to each other involving the sex organs of one person and the mouth or anus of another\" - meaning that oral and anal sex of any kind is a crime under Alabama state law unless it is enjoyed with one's spouse. Because Alabama is also a marriage discrimination state, this law has obvious implications for gay people in that state. Indeed, the official commentary to the law explains that it was enacted to \"make all homosexual conduct criminal.\" \"Consent,\" under this Alabama sex ban, \"is no defense to a prosecution.\" handed down the state's first decision declaring this law unconstitutional. This isn't a particularly surprising decision. The Supreme Court held in its landmark 2003 opinion in Lawrence v. Texas that the Constitution forbids laws prohibiting consensual, private sexual activity between adults. If an Alabama court allowed the state's sex ban to stand, it would have done so in direct defiance of the Constitution and the Supreme Court of the United States. In fairness, the fact that it took nearly eleven years from the day Lawrence was decided for an Alabama court to strike down this law may be attributable to good behavior by the state's prosecutors (although that still Lawrence). Shortly after Lawrence, the state's attorney general conceded that the law is unconstitutional \"to the extent that it applies to private, legitimately consensual anal and oral sex between unmarried persons.\" So it is possible that the law has not been tested because prosecutors refrained from bringing unconstitutional prosecutions under this statute after Lawrence. Indeed, the defendant in the case that ultimately led the state appeals court to strike this law down was initially charged with \"sodomy in the first degree\" - a much more serious crime akin to rape. The jury, however, did not convict this defendant of a crime involving non-consensual sex. They convicted him of the lesser crime prohibiting consensual anal intercourse. This, the state appeals court held, is not allowed. Despite Lawrence, there is some risk that the state supreme court could try to reinstate the ban on oral and anal sex. The state's chief justice, <mark>Roy Moore</mark>, is compared a judge who struck down the military's anti-gay Don't Ask/Don' t Tell policy to al-Qaeda urging defiance of Supreme Court rulings. The bigger risk, however, will come if the United States Supreme Court adds just one more conservative justice. Although six justices agreed in Lawrence that the state of Texas' ban on gay sex was unconstitutional, one of those justices, Justice Sandra Day O'Connor, has since left the Court. Moreover, four of the Court's current members, Chief Justice <mark>John Roberts</mark> and Justices Antonin Scalia, Clarence Thomas and Samuel Alito, joined anti-gay opinions in the 2013 decision United States v. Windsor. If another conservative joins the Court, there may be enough votes to overrule U.S. Set To Execute First Inmate Since Bungled Oklahoma Execution"}]