[{"date": "2014-01-22", "url": "http://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=11190565&amp;ref=rss", "content": "Hannah (left) and <mark>Lauren Williams</mark> saved four children and an adult from heavy surf at Mangawhai Heads on Tuesday. Photo / <mark>Richard Robinson</mark> Two teenage sisters fought 4m waves to save a man and four children at an unguarded surf beach. Auckland schoolgirls Hannah, 15, and <mark>Lauren Williams</mark>, 17, both off-duty lifeguards, were checking out the surf at Mangawhai Heads on Tuesday when they noticed the group in trouble. They said they were in a pretty dangerous position. \"I ran down and <mark>Lauren</mark> came with me,\" said Hannah. \"There were three girls and <mark>Lauren</mark> helped them get back to shore. I swam out to the man and a boy who were getting bashed against the rocks .\" It was 3-4m surf, and really, really dumping. And there was a very strong current. It was not ideal. \"The man and boy, aged about 11, were out the furthest and the boy was pinned against the rocks by the time Hannah reached them. Three younger girls, thought to be 7-8 years old, were not out as far but were not strong swimmers. Two of them were wearing lifejackets .\" They were struggling, they weren't happy, \"<mark>Lauren</mark> said .\" I think they would have eventually been pushed in...and hit the rocks [as well]. I grabbed the two with the lifejackets and the other girl I held. I got behind them and pushed them out of the water. It was difficult because the current was so strong but I could still stand. \"Meanwhile, Hannah was dealing with the boy, who had been cut up on the rocks .\" The man wasn't quite on the rocks. I swam past him and walked up on to the rocks to the boy. I held him so he wasn't getting bashed against the rocks any more. I carried him back to the dad and swam back to shore, \"Hannah said .\" I had the boy under my arm and I was kind of dragging the man behind me. \"If we hadn't been there, I think they probably would've been pushed over rocks and out to sea. They were out of their depth and they didn't really look like they knew what they were doing .\" Once ashore, the sisters received hugs and thanks from the three girls. The man seemed in shock, they said. The group left the beach in a hurry and their identities were unknown to their rescuers. The teens' mother, <mark>Anna Williams</mark>, who was at the other end of the beach during the drama, was proud of her girls. \"That's what lifesaving is all about. They just drop and go, that's the way they're trained. I'm obviously very proud...they know what to do and they're out there helping people .\" Check beach for lifeguards Weekday lifeguards have already vacated Mangawhai Heads, as well as a number of other popular northern beaches. It's something <mark>Anna Williams</mark>, the mother of two lifeguards, says is an accident waiting to happen. Funding for weekend lifeguards comes from councils, which set the dates their beaches are manned. Weekend guards are usually volunteers, who work longer through the summer season. The two beaches most guarded are Piha and Muriwai, with lifeguards every day from December 2 until March 7. Other beaches vary, with most having weekday lifeguards from December 16, but ending on different dates. Mangawhai Heads has one of the shortest runs, and is manned seven days a week only from December 23 until January 17.", "articleID": "2014012300_00072425_W", "names": {"Richard Robinson": ["Q22280073", "Q25711399", "Q28058362", "Q51590316", "Q55713112", "Q7328701"]}}, {"date": "2014-01-23", "url": "http://www.sanluisobispo.com/2014/01/22/2888500/alabama-house-approves-tax-credit.html#storylink=rss", "content": "Los Osos man linked to burglaries from Paso Robles to L.A., police say MONTGOMERY, Ala. - The Alabama House has passed a bill to give adoptive parents a $1,000 tax credit to make it financially feasible for more people to pursue adoptions. The House voted 72-23 in favor of the bill Wednesday and sent it to the Senate for consideration. The bill's sponsor, Republican Rep. <mark>Paul Lee</mark> of Dothan, told the House about adopting a daughter and the expense involved. He said the income-tax credit would apply to a private intrastate adoption and the adoption of an Alabama foster child where both the birth mother and the adoptive parents are from Alabama. He said 523 foster children were adopted in Alabama last year, and his goal is to increase that number. \"The hope is to get children in a stable home,\" he said. <mark>Lee</mark> said the bill would also save the state about $5,400 a year for each foster child adopted. Two adoptive parents, Dennis and Cindy Weaver of Danville, visited the Legislature on Tuesday to encourage support for the bill. They said it won't help them because it is not retroactive, but they hope it will encourage others to adopt. The Weavers were foster parents for two brothers for about five years before adopting them in February. They said they decided to become adoptive parents after raising four biological children, who are now grown. \"It's the toughest job you'll ever love. But it's very rewarding,\" Cindy Weaver said while accompanied by 7-year-old Juan and 9-year-old Luis. Legislative fiscal experts estimate the bill will apply to 2,500 adoptions per year and cost the state $2.5 million in tax credits. Democratic Rep. Pebblin Warren of Tuskegee said the state needs to do something to help people who raise, but don't officially adopt, the children of relatives due to a death or addiction. \"The job is half done,\" said Warren, who helped raise her husband's siblings .> Apps and services for tablet devices> Apps and services for your mobile phone> Get updates via Facebook and Twitter> Your daily paper delivered to your computer", "articleID": "2014012309_00024593_W", "names": {"Paul Lee": ["Q16210380", "Q20740130", "Q27924830", "Q27924831", "Q50129828", "Q57422067", "Q7151993", "Q7151994", "Q7151996", "Q7151997", "Q9196154"]}}, {"date": "2014-01-27", "url": "http://www.jewishpress.com/news/breaking-news/largest-knesset-delegation-ever-tours-auschwitz/2014/01/27/?utm_source=rss&utm_medium=rss&utm_campaign=largest-knesset-delegation-ever-tours-auschwitz", "content": "tell a friend Dozens of lawmakers from Israel, the United States and Europe convened at the former Nazi death camp of Auschwitz-Birkenau for ceremonies commemorating its liberation 69 years ago. The largest foreign parliamentary delegation landed in Poland from Israel on Monday, Jan. 27 - the day that the United Nations in 2005 designated as International Holocaust Remembrance Day - and consisted of 58 Knesset members. Constituting nearly half of the Israeli parliament, it is the largest Knesset delegation ever to have visited the Auschwitz compound, organizers said. Several Knesset members, including Economy Minister Naftali Bennett, attended a solemn prayer led by Israel's Chief Ashkenazi rabbi, David Lau, near the famous \"Arbeit macht frei\" (\"Work will make you free\" ) sign at the entrance to the Auschwitz camp. The U.S. delegation is headed by Rep. Eric Cantor, a Virginia Republican and first Jewish majority leader of Congress. With Cantor are Reps. Darrell Issa (R-Calif .) and Carolyn Maloney (D-N.Y.). They are scheduled to be joined by 23 lawmakers from 10 European Union member states who came with European Friends of Israel and the Israeli-Jewish Congress. In Krakow, the Knesset delegation is scheduled to hold a ceremonial inter-parliamentary session with the Polish parliament, the Sejm. \"When we say\" Never Again,' we can say it because there is a Jewish state and a Jewish army, \"the event's Israeli initiator, Johnny Daniels, told JTA on Monday .\" The presence of half the Israeli parliament in Auschwitz is a powerful symbol for that reason. \"Daniels, a 28-year-old Britton who immigrated to Israel 10 years ago, began producing the event six months ago as executive director of From the Depths, a nongovernmental organization dedicated to Holocaust education .\" Holocaust survivors are dying fast and it was important for us to create a platform where their voice will be heard, \"he said. The ceremony at Auschwitz will be attended by 24 Holocaust survivors. He also said that the attendance of Sejm lawmakers signifies their government's dedication to commemorating the Holocaust and that\" Poles, too, have been victimized by Nazi Germany. \"tell a friend About the Author: If you don't see your comment after publishing it, refresh the page .\" If we prohibit it [circumcision], we must also address the issue of the Christian ritual of baptism. \"Any permanent agreement with Iran\" cannot succeed if its President Hassan Rouhani acts according to its words, Prime Minister Binyamin Netanyahu told the weekly Cabinet meeting Sunday in his report on conversations at last week's World Economic Forum at Davos. \"Rouhani said that Iran was against international involvement in Syria, but Iran is the country [...] Bill de Blasio, New York's newly installed mayor said,\" Part of my job description is to be a defender of Israel \"while speaking at a private New York event of the American Israel Public Affairs Committee (AIPAC).\" There's no greater ally on earth, and that's something we should say proudly, \"he said last Thursday, as [...] Israeli negotiators are discussing a series of limited withdrawals linked to progress by the Palestinian Authority in maintaining security, a senior Palestinian official said. The withdrawals are part of a plan for a peace agreement being brokered by U.S. Secretary of State <mark>John Kerry</mark>, according to an interview with Yasser Abed Rabbo published in the [...] Secretary of State <mark>John Kerry</mark> is obsessed with forcing a\" Peace Process \"on Israel because...He has no clue how to deal with serious problems, such as Syria. He thinks it will win him a Nobel Prize. He doesn't understand how dangerous what he is doing is. He just wants the frequent flyer miles. He wants Hamas and Islamic Jihad to take over the Palestinian Authority, and needs Israel out of Judea & Samaria to accomplish that. The Jewish Press. All rights reserved. No portion of this website may be copied without the express written permission of JewishPress.com.", "articleID": "2014012720_00034842_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2014-01-28", "url": "http://au.sports.yahoo.com/cricket/news/article/-/21126020/four-nations-oppose-sweeping-icc-revamp/", "content": "meta name = \"description\" content = \"South Africa, Pakistan, Sri Lanka and Bangladesh are set to oppose a push to cede control of world cricket to India, Australia and England .\" /> Four nations oppose sweeping ICC revamp Pakistan, South Africa, Sri Lanka and Bangladesh are likely to oppose sweeping changes in the ICC as the governing body's executive board meeting began in Dubai on Tuesday. Before the meeting, Pakistan Cricket Board chairman Zaka Ashraf told private television channels in Pakistan that all four boards \"have one stance and we will stick to our stance\". The three richest cricket boards of India, England and Australia have drafted a radical position paper in an apparent bid to get more powers in all the administrative and financial matters of the ICC. \"I will vote for Pakistan and whatever is in Pakistan's interests,\" Ashraf said. \"We have to see what is in our interests when we vote. Bangladesh, Pakistan, South Africa and Sri Lanka, we all have one stance .\" The draft has been widely criticised by former Test cricketers and ICC officials Ehsan Mani, <mark>Malcolm Gray</mark> and Malcolm Speed. South Africa was the first to openly criticise the paper citing the \"big three' - Board of Control for Cricket in India (BCCI), Cricket Australia (CA) and the England and Wales Cricket Board (ECB), for not following correct consultation procedures within the ICC. Cricket South Africa termed the proposals as fundamentally flawed. <mark>Paul Marsh</mark>, head of the Federation of International Cricketers' Associations, termed the proposals as disturbing, saying they would broaden disparities between cricket's rich and poor. In case the big three get stiff opposition in Tuesday's meeting, the draft might not be tabled for consideration because - to get any special resolution passed - it would require the backing of eight out of the full 10 members. Officials from the BCCI, ECB and CA reportedly first presented the document to other countries at a meeting this month, with ICC officials even having limited knowledge of the proposals. The proposed reforms would likely revise or abandon the Future Tours Program which guarantees smaller nations regular series against the big three sides. A 21-page document from the ICC's influential financial and commercial affairs committee proposes that a new four-member executive committee be set up, with three places taken by the rich and powerful Indian, English and Australian boards. They would decide on the fourth member. The position paper also recommends the troubled Test Championship, set for introduction in 2017, be scrapped and the limited-overs Champions Trophy be retained in its place. Apparently the four opposing members are also not in favour of promotion-relegation system, as suggested in the draft. That would establish a reduced eight-country top tier for Test cricket from 2015, but with India, England and Australia immune from relegation because of\" the importance of those markets and teams to prospective ICC media rights buyers \". The document argues that cricket, especially Test cricket, is often not financially viable outside of the big three countries.", "articleID": "2014012819_00064305_W", "names": {"Malcolm Gray": ["Q56050641", "Q6742345"], "Paul Marsh": ["Q20640918", "Q7152220"]}}, {"date": "2014-01-29", "url": "http://economictimes.indiatimes.com/news/politics-and-nation/congress-downplays-reports-on-possible-split-with-national-conference/articleshow/29564700.cms", "content": "Indian inflation is so much higher than global inflation that 5% depreciation in the rupee per year is permissible, and probably inevitable. PMEAC Chairman C Rangarajan says RBI rate hike will check inflation KM Birla may not be questioned in Coalgate The closure of the case, would be decided by March, by when the CBI also hopes to \"fast-track\" its entire investigation into the episode. Inter-Ministerial Group to decide fate of 61 coal blocks next week Starting in the first week of Feb, BJP leaders as well as the party's heavyweight CMs will start frequenting tea stalls to discuss politics with locals. Apple also said revenue will be $42 billion to $44 billion in the current quarter, compared with analysts' estimates of $46.1 billion. Carl Icahn: Apple management \"seems to be doing the right thing' Delhi law minister Bharti's vigilantism undermines the basis of India-Africa ties: our resolve to fight prejudices and racism jointly. Tata Motors MD Karl Slym passes away; <mark>Ravi Kant</mark> may be interim head Rahul Gandhi's first TV interview: I have seen my father die, I am not afraid of Modi Tejas: 11 things you didn't know about India's indigenous aircraft What's special about India's own LCA? How does it rate on the global scale? We take a look som...Congress today downplayed reports of a possible split in its alliance with Omar Abdullah would take the final decision on the ties between the two parties .\" The alliance stands as of today \"and it would not be proper to pre-judge the issue, Congress spokesman Randeep Surjewala told reporters in the backdrop of media speculation on the ruling alliance split over the issue of creation of new administrative units in the state which the Congress is stonewalling. Abdullah, a Union Minister, told journalists that Omar, who is said to be thinking of resigning over the issue, would take the final call on the alliance. But, he said, there is a need to resolve the matter amicably because creation of administrative units is for the good of the people and by this way, the work done by the former Chief Minister Ghulam Nabi Azad of creating eight districts will be completed .\" This is not going to benefit one party but credit will go to both the parties, \"Abdullah said. To a question on whether the two parties would be fighting elections together, he said\" no final decision has been taken on this \". Asked whether there was a growing mistrust between NC and Congress, Abdullah shot back,\" there are some people with vested interests who are trying to create mistrust between the coalition partners. \"Congress leaders from the state have been holding meetings with party high command to work out a solution on the issue. <mark>Tara Chand</mark> had said after a meeting last night that the Mushtaq Ganaie Committee had\" recommended 700 new administrative units but the figure may go up to 2000 or more. \"PREVIOUS STORY AAP government moves to replace DCW chief Barkha Singh, who cries foul NEXT STORY Sushil Kumar Modi questions <mark>Nitish Kumar</mark> on Congress support Have something to say? Post your comment Have something to say? Post your comment", "articleID": "2014012922_00094113_W", "names": {"Nitish Kumar": ["Q122304", "Q7041330"], "Ravi Kant": ["Q26905802", "Q7296633"], "Tara Chand": ["Q17495938", "Q7685040", "Q7685042"]}}, {"date": "2014-01-30", "url": "http://www.sltrib.com/sltrib/news/57462135-78/stem-utah-science-businesses.html.csp", "content": "Utah businesses working to make science, math sexy Science \"With $2 million campaign, businesses want to help raise awareness of jobs in science and technology fields. First Published 3 minutes ago? Updated 3 minutes ago Utah businesses will kick in $2 million to promote the state's science, technology, engineering and math (STEM) initiative, the Utah governor and business leaders announced Thursday. It was launched in an event at <mark>Neil Armstrong</mark> Academy, a STEM-centered elementary in West Valley City .\" Imagine what students could achieve if they caught the vision of their own capability to be successful with STEM topics, \"said Jeffery R. Nelson, president and chief executive of Nelson Labs. Nelson is chairman of the STEM Action Center board. The board oversees the 2013 Legislature created as part of the Governor's Office of Economic Development. Its purpose is to help Utah's students become better prepared for jobs in technology and science .\" STEM jobs are the jobs of Utah's future, \"Gov. Gary Herbert said in a news release. Herbert had challenged the business community to support STEM education. Besides raising awareness of science and technology jobs among students and their parents, the campaign is designed to get the word out among businesses that schools and the STEM initiative need their help. Many already are helping. IM Flash, a flash memory maker, donated 70 refurbished computers to a lab at Tooele Junior High last fall.", "articleID": "2014013103_00013458_W", "names": {"Neil Armstrong": ["Q1615", "Q594654"]}}, {"date": "2014-01-31", "url": "http://feeds.sciencedaily.com/~r/sciencedaily/health_medicine/~3/_BquMTCmMTk/140129165409.htm", "content": "New research from Karolinska Institutet in Sweden shows that medication used to treat ADHD in adult men can save lives on the road. According to a large registry study, which is now being published in the scientific journal JAMA Psychiatry, up to half of the transport accidents involving men with ADHD could be avoided if the men were taking medication for their condition. The researchers have studied 17,000 individuals with ADHD over a period of four years (2006-2009) using various population health' registers. They were then able to analyse the risk of transport accidents for individuals diagnosed with ADHD and how ADHD medication influence this risk. In line with previous research in this area, the results from the current study demonstrate that individuals with ADHD have an approximately 45 per cent increased risk of being involved in serious transport accidents, such as car or motorcycle accidents, compared to individuals without ADHD. \"Even though many people with ADHD are doing well, our results indicate that the disorder may have very serious consequences,\" says <mark>Henrik Larsson</mark>, associate professor at the Department of Medical Epidemiology and Biostatistics. Our study also demonstrates in several different ways that the risk of transport accidents in adult men with ADHD decreases markedly if their condition is treated with medication. \"To begin with, the incidence of transport accidents was lower among men with ADHD who received medication than among men with ADHD who did not. When the men were compared to themselves, i.e. during periods with and without ADHD medication, the researchers were able to establish that pharmaceutical treatment involved a significantly lower risk of transport accidents; during the periods of ADHD medication the risk was 58 per cent lower. Comparing the individuals to themselves is one of the study's strengths as it demonstrates that the connection between medication and decreased accident risk is probably not due to differences between individuals. Further statistical calculations showed that 41 per cent of the transport accidents involving men with ADHD could have been avoided if they had received medication for the entire follow-up period. This study, which has now been published, does not explain the specific mechanisms behind the effect of ADHD medication on accident risk. However, the researchers believe that the results may be explained by ADHD medication having an effect on the core symptoms of ADHD such as impulsiveness and distractibility, which in turn reduces the risk of getting into trouble on the road .\" Despite having shown that medication for ADHD very likely reduces men's risk of transport accidents, we could not establish a similar reduction in women's accident risk, \"says <mark>Henrik Larsson</mark>.\" We need further data to be able to comment about the effect on women with statistical certainty. It is also important to point out that most pharmaceutical treatments carry a risk of side effects. The risks must be weighed against the benefits for every individual prescription, taking into account the individual patient's situation. \"About five per cent of all school children and half as many adults suffer from ADHD, which is characterised by lack of attention, concentration difficulties and impulsiveness. Research has shown that ADHD is a relatively stable disorder and many of those who have been diagnosed with ADHD as children also meet the diagnostic criteria as adults. People with ADHD can be treated with medications such as central nervous system stimulants that affects the brain and thereby improve attention and impulse control. Story Source: The above story is based on: <mark>Zheng Chang</mark> Z, <mark>Paul Lichtenstein</mark>, Brian M. D'Onofrio, Arvid Sj? lander and <mark>Henrik Larsson</mark>. Karolinska Institutet .\" ADHD medication saves lives on the road. \"ScienceDaily. ScienceDaily, 29 January 2014. Karolinska Institutet. (2014, January 29). ADHD medication saves lives on the road. ScienceDaily. Retrieved January 30, 2014 from www.sciencedaily.com/releases/2014/01/140129165409.htm Detailed Look at HIV in Action: Researchers Gain a Better Understanding of the Virus Through Electron Microscopy Up Close and 3-Dimensional: HIV Caught in the Act Inside the Gut Childhood Depression May Increase Risk of Heart Disease by Teen Years Researcher Turns Sights on Prostate Cancer, Tissue Engineering, Blood Vessel Repair Sex-Specific Patterns of Recovery from Newborn Brain Injury Revealed by Animal Study More Than One-Third of Women Have Hot Flashes 10 Years After Menopause Does Caregiving Cause Psychological Stress? It Depends, Says Study of Female Twins Reuters - Innovations Video Online (Jan. 30, 2014) - Infant Warmer Created to Save Lives in Developing Countries Nov. 22, 2013 - New study reports that half of U.S. children diagnosed with ADHD received that diagnosis by age 6. The study found that an estimated two million more children in the United States (U.S.) have been Apr. 9, 2013 - Teachers in the Republic of Ireland consistently view medication treatment for Attention deficit hyperactivity disorder (ADHD) as a last resort, even when they view the disorder as biologically Nov. 22, 2012 - Criminal behaviour in people with ADHD (attention deficit hyperactivity disorder) dropped sharply during periods when they were on medication, according to a new extensive registry Study Evaluates Treating Mothers With ADHD to Improve Outcomes in Kids Oct. 17, 2012 - Researchers are conducting a study to determine if treating mothers with Attention Deficit Hyperactivity Disorder--either with medication or parent training--will help children at risk for Synergy Between Behavioral and Pharmacologic Interventions for ADHD Exclusive: Bloomberg tapped to be U.N. cities, climate change envoy - sources Terms of Use Copyright 2013 by ScienceDaily, LLC or by third-party sources, where indicated. All rights controlled by their respective owners. Content on this website is for informational purposes only. It is not intended to provide medical or other professional advice.", "articleID": "2014013113_00039500_W", "names": {"Henrik Larsson": ["Q15695043", "Q179334", "Q37384205", "Q47506015", "Q47506078", "Q5937630", "Q5937640", "Q5937649", "Q5937657"]}}]