[{"articleID": "2014070922_00102662_W", "names": {"Qui Nguyen": ["Q27831085", "Q7271625"]}, "date": "2014-07-09", "url": "http://azcentral.com/story/entertainment/arts/2014/07/09/brelby-theatre-gets-geek-kills-monsters/12374789", "content": "Subscribe today for full access on your desktop, tablet, and mobile device. 7/11-23: Brelby geeks out with \"She Kills Monsters' The cast of the Brelby Theatre Company production of\" She Kills Monsters .' From left: Mia Passarella as Lilith, Melody Knudson as Kaliope, Kristiana Faddoul (back) as Tilly Evans, Shelby Maticic as Agnes Evans, David Magadan as Chuck. span class = \"credit\" > (Photo: Brelby Theatre Company) Story Highlights Glendale's Brelby Theatre Company is a mom-and-pop drama shop founded in 2009. \"She Kills Monsters\" is a bittersweet comedy inspired by the Dungeons & Dragons role-playing game. MORE Sure, a lot of people love \"Game of Thrones .\" But it wasn't that long ago that the whole swords-and-sorcery thing was a one-way ticket to social ostracism. Or maybe it was the only way out. Either way, it sure seems as though the geeks have inherited the earth. At the risk of making an epic overstatement, the redemptive power of geek culture is the heart of a new stage comedy called \"She Kills Monsters,\" which is getting its Arizona premiere from Glendale's Brelby Theatre Company. \"It's kind of about how nerds as a whole have gone on this journey from being underdogs to now being kind of cool,\" says company co-founder Shelby Maticic. Written by New York playwright and fight director <mark>Qui Nguyen</mark>, \"She Kills Monsters\" is inspired by Dungeons & Dragons, the role-playing game from the 1970s that has spawned countless imitators, from old-school dice-and-paper play to mega-popular online RPGs such as World of Warcraft. It's a bittersweet comedy about a schoolteacher named Agnes who loses her family but comes to know her kid sister through the fantastical world she created within the game. \"Obviously the show speaks to nerds and has this incredible quest and really intense battle sequences and monsters that we get to play with onstage,\" says Brian Maticic, the show's director (and Shelby's husband). \"But what it comes down to is the theme of escapism, the chance to live that fantasy that you can't have in real life, but also mixed with the personal growth of the main character. It follows her through the grieving process but also her own self-discovery as she learns about who her sister was and who she is as a person .\" Shelby Maticic, who is also the company's artistic director, will play Agnes. \"It's this beautiful journey of her getting to know a sister that she never paid attention to,\" Shelby says. \"She ends up kind of building a new family along the way out of the characters that she meets through the Dungeons & Dragons world, who all actually have real-world counterparts. They were all members of Tilly's gaming circle .\" It's a really sweet, kind of sad show, but it's perfectly balanced with some seriously epic fight sequences as they play out the quest onstage \"- including a climax involving a five-headed dragon puppet. Quite literally a mom-and-pop operation, Brelby doesn't have the resources for a lot of fancy special effects, but the company does what it can to add pizzazz to its productions, as when it did up Oscar Wilde's\" The Importance of Being Earnest \"in steampunk style, complete with giant working cogwheels as part of the stage .\" We have a really intimate studio, but I think we've gotten pretty creative about finding ways to surprise the audience with tech elements, \"Shelby says. Founded in 2009, Brelby Theatre has cultivated a younger audience - college age to young parents - with an eclectic mix that includes the occasional classic drama or Broadway musical but also less-known works by contemporary playwrights, including local writers. Reach the reporter at kerry.lengel @ arizona­republic.com or 602-444-4896. Brelby Theatre Company:\" She Kills Monsters' When: Friday, July 11, through Saturday, July 26. Where: Brelby Studio, 6835 N. 58th Ave., Glendale. Admission:"}, {"articleID": "2017120818_00309150_W", "names": {"John Jacobs": ["Q22278334", "Q2245422", "Q58150314", "Q6241430", "Q6241433"]}, "date": "2017-12-08", "url": "https://uk.sports.yahoo.com/news/bjorn-leads-tributes-tommy-horton-180611163.html", "content": "Tommy Horton, an eight-time winner on the European Tour, has passed away at the age of 76. More European Ryder Cup captain Thomas Bjorn led the tributes after it was announced Tommy Horton had died at the age of 76. Horton turned professional in 1957 and enjoyed a lengthy career, which encompassed eight victories on the European Tour and a further 23 on the Senior Tour. The Englishman, who twice featured at the Ryder Cup, won the <mark>John Jacobs</mark> Trophy--for the Senior Tour's number one player--a record five times and was awarded honorary life membership of the European Tour in 2012. \"Tommy Horton was one of finest gentlemen I ever met in the game of golf,\" said Bjorn on Twitter. \"His contributions as a player and a coach has formed many young men into great players. Thanks for everything you gave! RIP .\" \"Tommy Horton was an incredibly influential and respected figure in the world of golf, as a wonderful player and coach and as someone who was central to the development of the European Tour and the European Senior Tour,\" added European Tour chief executive Keith Pelley. \"After the passing of <mark>John Jacobs</mark> in January, we have lost two of the true gentlemen of the game in 2017. The thoughts of everybody at the European Tour are with Tommy's family .\" "}, {"articleID": "2015100714_00142905_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2015-10-07", "url": "http://www.denverpost.com/ci_28933921/jay-leno-revisits-tonight-monologue", "content": "Jay Leno revisits \"Tonight' for monologue The Associated Press Posted: 10/07/2015 08:27:44 AM MDT Updated: 10/07/2015 08:27:44 AM MDT NEW YORK (AP)--For a few minutes, it felt like old times back on NBC's\" Tonight \"show on Tuesday night. Jay Leno was telling jokes. Host Jimmy Fallon pretended to pull a hamstring during his monologue, calling for an emergency replacement--his predecessor. Leno, who left the show last year after two decades in charge, is busy promoting a new car-focused show for CNBC. Leno got rolling right away with political one-liners. He noted that presidential candidate Marco Rubio is being called the best communicator in the Republican Party,\" which is kind of like being the smartest Kardashian. \"If Democrat Bernie Sanders wins, Leno said,\" he'll be the first socialist elected president since 2008. \"And if the Republican race comes down to Jeb Bush against <mark>Donald Trump</mark>, it will be like\" the tortoise and the bad hair. \"Leno, looking slightly paunchier than when regular monologues kept him in fighting shape, even poked fun at neighbors of the former California-based\" Tonight \"show. Fallon moved the show to New York when he took over .\" The economy is so bad that parents in <mark>Beverly Hills</mark> are being forced to raise their own children, \"Leno said. Advertisement"}, {"articleID": "2018110708_00335852_W", "names": {"Pat Howard": ["Q10456326", "Q3368542"], "Kevin Roberts": ["Q10408794", "Q28421791", "Q28510868", "Q30122050", "Q6397367", "Q6397368", "Q6397369", "Q6397371"], "Stuart Clark": ["Q10858359", "Q3107247"]}, "date": "2018-11-07", "url": "http://www.newcastlestar.com.au/story/5746510/pat-howard-was-stealing-an-income-macgill/?cs=4783", "content": "Stuart MacGill has slammed the tenure of axed Cricket Australia high performance manager <mark>Pat Howard</mark>. Stuart MacGill has savaged <mark>Pat Howard</mark> for \"stealing an income from Cricket Australia\" , while Ian Chappell believes the sacked team-performance boss's rugby background meant he was in a difficult position from day one. <mark>Howard</mark> made it clear to players and CA staff earlier this year that he intended to leave after the 2019 Ashes, when his contract expired. But he was tapped on the shoulder by CA chief executive <mark>Kevin Roberts</mark> on Wednesday. Former legspinner MacGill wondered why the former Wallabies five-eighth, who was appointed in 2011, lasted so long. \"I just wish we had it a few years ago because <mark>Pat Howard</mark> has been stealing an income from Cricket Australia for a long time,\" MacGill told Macquarie Sports Radio. \"It was always a joke to me and to a lot of my mates that he was high-performance manager when his performance during pretty much his whole time with Cricket Australia has been anything but .\" There was a period of time where <mark>Pat Howard</mark> was providing Australian selectors with a list of players they were allowed to pick the team from. \"In effect there was only one Australian selector and it was <mark>Pat Howard</mark>. It was absolute rubbish .\" Former Test quick <mark>Stuart Clark</mark>, who last year described <mark>Howard</mark> as useless, has also been among his most vocal critics. The high-performance environment created by <mark>Howard</mark> was criticised in last week's independent report but <mark>Roberts</mark> declared it a successful innings. \"I've got a huge amount of respect for <mark>Pat</mark>'s courage,\" he said. \"Multiple World Cups across both genders .\" It's easy to get caught up in our most recent ODI loss or Test loss but Australia over the last three years has been the best-performed non-Asian Test nation playing in Asia. \"Chappell argued <mark>Howard</mark> was\" at a handicap right from the start \", having met stern resistance from key figures in the sport because he was appointed after 20 Tests for the Wallabies and a stint as high-performance manager at the Australian Rugby Union .\" He came into a difficult situation...(people asked) what the hell a rugby union bloke was doing in a position that you'd think would require a lot of cricket knowledge, \"Chappell told Wide World of Sports .\" His other problem was being the person who had to tell blokes they couldn't play because of concerns over workload. \"Australian Associated Press facebook SHARE twitter TWEET email whatsapp"}, {"articleID": "2017072708_00212183_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2017-07-27", "url": "http://www.joplinglobe.com/region/trump-announces-billion-foxconn-plant-in-wisconsin/article_37a131fa-c851-5d87-a974-0e1a4ea5d956.html", "content": "Trump announces $10 billion Foxconn plant in Wisconsin By <mark>SCOTT</mark> BAUER and <mark>PAUL</mark> WISEMAN Associated Press 15 min ago FILE - In this May 26, 2010 file photo, staff members work on the production line at the Foxconn complex in the southern Chinese city of Shenzhen, Southern city in China. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung, File) Kin Cheung FILE - In this May 26, 2010 file photo, staff members work on the production line at the Foxconn complex in the southern Chinese city of Shenzhen, southern China. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung, File) Kin Cheung FILE - In this May 27, 2010 file photo, a worker looks out through the logo at the entrance of the Foxconn complex in the southern Chinese city of Shenzhen. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Kin Cheung) Kin Cheung FILE - In this Feb. 4, 2016, file photo, employees enter and exit the headquarters of Taiwan's Hon Hai Precision Industry Co., also known as Foxconn, in New Taipei City, Taiwan. Wisconsin Gov. <mark>Scott Walker</mark> says President Donald Trump plans to make a \"major jobs announcement for Wisconsin\" as anticipation builds it will be about electronics giant Foxconn locating in the state. Taiwan-based Foxconn is best known as the assembler of the iPhone. Wisconsin is among seven states, mostly in the Midwest, that the company has named as possible locations to build the its first liquid-crystal display factory that could mean tens of thousands of jobs. (AP Photo/Wally Santana, File) Wally Santana WASHINGTON (AP)--President Donald Trump says that electronics giant Foxconn will build a $10 billion factory in Wisconsin that's expected to initially create 3,000 jobs, the largest economic development project in state history. The announcement Wednesday comes at a critical juncture for a Trump administration that pledged to generate manufacturing jobs but has struggled to deliver results as quickly as the president promised. Trump's plans for health care and tax cuts face a murky future in Congress, while his administration is bogged down by an investigation into Russia's possible ties with his presidential campaign. In a White House speech, Trump said the financial commitment by Foxconn CEO Terry Gou was a direct result of his electoral win. \"If I didn't get elected, he definitely would not be spending $10 billion,\" Trump said. \"We are going to have some very, very magnificent decades .\" But the decision to build the plant in Wisconsin also stemmed from $3 billion in state economic incentives over 15 years if Foxconn invests $10 billion in the state and ultimately adds 13,000 jobs. The incentives would only be awarded if Foxconn creates the jobs and pays an average salary of nearly $54,000. The Wisconsin factory, scheduled to be open by 2020, would be massive. The campus dubbed \"Wisconn Valley,\" would cover nearly 1.6 square miles and be three times the size of the Pentagon. Foxconn's plant will produce liquid-crystal display panels, or LCDs, that are used in televisions and computer screens. The factory will be located in the congressional district of House Speaker <mark>Paul Ryan</mark>. It would mark a substantial gain for a state that currently has 472,000 manufacturing jobs and is still recovering from factory layoffs--including the closure of a General Motors plant in <mark>Ryan</mark>'s hometown--that hit after the 2008 financial crisis. Taiwan-based Foxconn is perhaps best known for assembling Apple iPhones in China. The company noted in a statement that having the Wisconsin factory would help it better serve the major U.S. technology companies that are its clients. Inside the White House, discussions with Foxconn about opening a U.S. plant were led over several months by Jared Kushner, a senior adviser and the president's son-in-law, and Reed Cordish, an assistant to the president on technology initiatives. The president had met personally with Gou, who on Wednesday complimented Trump's leadership at the event by saying, \"Mr. President, the eagle flies .\" Seven states had competed for the Foxconn plant. By awarding the plant to Wisconsin, Foxconn would appear to be giving a victory to both Trump and the state's Republican governor, <mark>Scott Walker</mark>, who is up for re-election next year. Other states that vied for the plant are Michigan, Illinois, Indiana, Ohio, Pennsylvania and Texas. Foxconn said in a release the announcement was just the first of several investments the company will be making in the U.S. <mark>Walker</mark> and several other Wisconsin officials, including <mark>Ryan</mark>, attended the White House announcement. Landing the multistate competition has been cast as a once-in-a-generation opportunity. Foxconn is the biggest contract assembler of smartphones and other devices for Apple and other brands. It has been eyeing building the plant in a part of Wisconsin represented by <mark>Ryan</mark>, who said he has met with company officials at <mark>Walker</mark>'s request. Critics have cautioned that Foxconn has made promises before to invest in the U.S. and not followed through. Foxconn promised in 2013, for example, to invest $30 million and hire 500 workers for a new, high-tech factory in Pennsylvania that was never built. State Sen. Alberta Darling, co-chair of the Wisconsin Legislature's budget committee, said any deal would be examined with a \"fine-toothed comb\" and need to win approval by the Republican-controlled Legislature. <mark>Walker</mark> said he planned to call a special legislative session to consider the incentives. They include up to $1.5 billion in income tax credits for job creation, $1.35 billion in income tax credits for capital investment and up to $150 million in a sales tax exemption for the purchase of construction materials. White House chief of staff Reince Priebus, who is from <mark>Ryan</mark>'s congressional district in southeast Wisconsin, told WTMJ-TV on Tuesday that Trump, when flying over the area in Kenosha County during a visit to Wisconsin in April, noticed vacant land where a former Chrysler Motors plant used to be. \"He said,\" That land should be used,' \"Priebus said .\" So when Foxconn came into the White House, into the Oval Office, the president said,' I know a good spot that you should go to, that place in Kenosha .' \"That part of the state is an attractive location for a large plant because of the area's proximity to Lake Michigan and its abundant water supply. To make flat-panel displays, the company will need access to great quantities of water to keep work spaces dust-free, among other things. The news sent a jolt of excitement across Wisconsin, even among longtime Democratic critics of <mark>Walker</mark>.\" It's an exciting opportunity, \"said Democratic state Assembly Minority Leader Peter Barca. Barca, like many Democrats, voiced concern about how much taxpayers may have to contribute in tax breaks and other incentives .\" We want to make sure it's a fair deal for everybody, \"he said .\" We want a win-win-win. \"---- --"}, {"articleID": "2019092810_00067180_W", "names": {"Mohammed Ali": ["Q16002506", "Q6854083"]}, "date": "2019-09-28", "url": "https://www.middleeastmonitor.com/20190928-sisi-hints-at-using-popular-mandate-to-deter-protesters/", "content": "Sisi hints at using popular mandate to deter protesters September 28, 2019 at 11:05 am | Published in: Africa, Egypt, News Egyptian President Abdel fattah Al-Sisi chairs the closing session of the first joint European Union and Arab League summit in the Egyptian Red Sea resort of Sharm el-Sheikh, on 25 February, 2019 [MOHAMED EL-SHAHED/AFP/Getty Images] September 28, 2019 at 11:05 am The Egyptian president Abdel-Fattah Al-Sisi hinted on Friday that he is to use popular mandate to crackdown on the protesters calling for him to resign, AlKhaleejonline.com reported. When he returned to Egypt, he told some of his supporters who were waiting for him at Cairo International Airport \"when I ask the Egyptians to take to the streets in their millions like what happened on the day of popular mandate in 2013, they will do .\" He shook hands with his supporters and exclaimed \"why are you standing here? Good morning. Why did you wake up early? Today is Friday. It does not deserve,\" noting that he is not worried about the protests. This came following calls by anti-Sisi activists, including the Egyptian actor and contractor <mark>Mohammed Ali</mark>, for the Egyptians to take to the streets and oust him over many corruption claims. Pro-Sisi Egyptian media have stated that the corruption claims being made against Sisi are \"lies\" and \"no one can trust them .\" "}, {"articleID": "2017110317_00558702_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2017-11-03", "url": "http://www.philly.com/philly/business/technology/philadelphia-patrons-line-up-outside-walnut-street-apple-store-for-the-new-iphone-x-cook-timothy-stock-20171103.html", "content": "Over 100 people were lined up covering half the 1600 block of Walnut Street on Friday, waiting to snag the newly released iPhone X from the Apple Store. The doors opened at 8 a.m. Friday, but police say customers had lined up as early as 8:30 pm the night before in an attempt to be among the first to pick up the pricey new smart phone. The iPhone X comes with many new features, such as facial recognition software, a larger screen, and a faster processor. Despite its high price--around $1,000 for the base model--people still came out in droves to get it. \"I have the antique, the iPhone 4S, it really is time for an upgrade,\" said Elaine Davidson, 54, a musician from Dallas, Texas who was in Philadelphia to perform with the Phantom of the Opera musical. Davidson said she drives constantly, and the new phone would make it easier for her to listen to music as she navigated to a new city. \"I primarily want the [iPhone X] because of the better camera. I have an iPhone 6, and I usually get a new phone every two years so it is about time .\" said Jason McAndrew, 37, a marketing manager from Philadelphia who stood near the back of the line. McAndrew had ordered the phone, but said he would have to wait two weeks for it to arrive, so he hoped to get the phone Friday if the wait was not too unreasonable. For those who wish to avoid waiting at an Apple Store, the phone can be purchased online at Apple.com. Apple's stock has risen about 3 percent by midday, primarily due to the release of the iPhone X. The iPhone line is the company's dominant product, accounting for about two-thirds of Apple's total sales. Chief Executive Officer <mark>Tim Cook</mark> has focused on growing services, like Apple Music and iCloud, so the company can better bind consumers to Apple's hardware products. \"I've been waiting about two hours. This phone is the new thing, and I want to be one of the first to try it out so I can optimize my client's apps,\" said Gilson Nunes, 27, a developer who said he owns a small company in Brazil. Published: November 3, 2017--1:24 PM EDT We encourage respectful comments but reserve the right to delete anything that doesn't contribute to an engaging dialogue Help us moderate this thread by flagging comments that violate our guidelines Commenting policy | Comments FAQ Comment policy: Philly.com comments are intended to be civil, friendly conversations. Please treat other participants with respect and in a way that you would want to be treated. You are responsible for what you say. And please, stay on topic. If you see an objectionable post, please report it to us using the \"Report Abuse\" option. Please note that comments are monitored by Philly.com staff. We reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. Personal attacks, especially on other participants, are not permitted. We reserve the right to permanently block any user who violates these terms and conditions. Additionally comments that are long, have multiple paragraph breaks, include code, or include hyperlinks may not be posted. Load comments Please enable JavaScript to view the comments powered by Disqus."}, {"articleID": "2019022206_00249792_W", "names": {"Frank Jensen": ["Q113921", "Q11969906", "Q42827888", "Q46924911", "Q8962688"]}, "date": "2019-02-22", "url": "https://www.dawn.com/news/1465249/2021-tour-de-france-to-start-in-denmark", "content": "2021 Tour de France to start in Denmark AP Updated February 22, 2019 Facebook Count Twitter Share Email Your Name * Recipient Email * 1 The opening stage on July 2 will be a 13-kilometre flat run around the capital. .--AP/File COPENHAGEN: The Tour de France will start in Denmark in 2021, beginning with a ride in Copenhagen followed by two more stages around the country. The opening stage on July 2 will be a 13-kilometre flat run around the capital. \"It is an honour to have the grand depart in Copenhagen,\" race director Christian Prudhomme said Thursday. A 190-kilometre stage between Roskilde and Nyborg, a town on the island of Funen, will follow. That stage will include pedaling on the windy bridges that make up the Storebaelt rail-and-road link. \"The wind is very, very important for the race. It was important to have the finishing line close to the bridge,\" Prudhomme said. \"Stage 2 is for sports enthusiasts .\" The last stage before heading back to France will be in the hilly Jutland peninsula between the towns of Vejle and Soenderborg. The contract for the 90 million kroner ($13.7 million) Danish start was signed on Thursday by Prudhomme and Copenhagen Mayor <mark>Frank Jensen</mark>. Danish Prime Minister Lars Loekke Rasmussen, himself an avid cycling fan, called the Tour de France \"the most iconic cycling race of all time .\" Both Prudhomme and Loekke Rasmussen noted Denmark had been picked because of the country's interest in the race but also because many Danes bicycle to work and school every day. Published in Dawn, February 22nd, 2019 Download the new Dawn mobile app here: Google Play Apple Store Facebook Count Twitter Share Email Your Name * Recipient Email * 1 Advertisement Advertisement Read more Can't block Pakistan from World Cup, says BCCI official South Africa hit back to spoil Sri Lanka's day PSL to launch mid-season trade window Advertisement"}, {"articleID": "2015041023_00013884_W", "names": {"Dan Quinn": ["Q3013178", "Q5214234", "Q5214235"]}, "date": "2015-04-09", "url": "http://prod.www.falcons.clubs.nfl.com/news/article-1/Quinn-Falcons-Arrive-in-Ridiculously-Good-Shape/2086d68c-a8a2-4d72-90eb-cd19124e341b", "content": "a The 2015 offseason workouts began Monday for the Falcons, and head coach <mark>Dan Quinn</mark> said his players arrived in \"ridiculously-good shape,\" embracing a mindset of having their best offseason ever You only have one chance to make a great first impression, and the Falcons players made the most of theirs to start their offseason workouts. On Thursday, the media was invited in to watch the Falcons players work out, followed by an evaluation from a very impressed head coach. \"I think there were a number of guys that completely came back in ridiculously good shape,\" <mark>Dan Quinn</mark> said. \"I think that mindset of the guys who started their individual work way earlier than this offseason program showed they're ready to take this offseason on, really having that\" best-offseason-they've - ever-had' mindset coming in; being in that good of shape told me a lot. \"was one of the players who clearly showed he's been working diligently in the offseason. The 24-year-old defensive star said he's loved the energy and excitement <mark>Quinn</mark> has brought to the building. Admitting\" silent success \"during his first two seasons, Trufant said he's ready to take his game\" two or three levels \"higher, if not more."}, {"articleID": "2011072612_00044623_W", "names": {"Stephen Brown": ["Q48487071", "Q57009868", "Q57392252", "Q7608785", "Q7608788", "Q7608789", "Q7608791", "Q7608792", "Q7608793", "Q7608794", "Q7609276"]}, "date": "2011-07-26", "url": "http://businessweek.com/news/2011-07-26/ford-second-quarter-profit-beats-estimates-on-higher-car-prices.html", "content": "july 26 (bloomberg)--ford motor co., the second-largest u.s. automaker, said second-quarter profit beat estimates as buyers paid more for models such as the fiesta subcompact. net income fell to $2.4 billion from $2.6 billion a year earlier, dearborn, michigan-based ford said today in a statement. excluding some items, profit was 65 cents a share, beating the 61-cent average of 14 analysts' estimates compiled by bloomberg. sales climbed 1.4 percent to $35.5 billion even after last year's sale of volvo cars. ford is set to begin negotiations this week with the united auto workers union to close a gap in labor costs with rivals. chief executive officer alan mulally raised prices for fiesta cars and explorer sport-utility vehicles to offset some of the $4 billion in higher costs that ford expects this year, including manufacturing spending. \"there are various kinds of initial hits to the bottom line as you're bringing out new product, but if it's done right you make that up on the back end,\" <mark>stephen brown</mark>, a chicago - based analyst at fitch ratings, said in a phone interview before results were released. industrywide u.s. vehicle sales slowed to a seasonally adjusted annual rate of 12.1 million in the second quarter from 13.1 million in the prior three months, according to autodata corp. ford's u.s. deliveries rose 9 percent to 1.07 million in the first half, trailing the industry's 13 percent gain. the 9 percent figure includes year-ago sales of volvo vehicles. ford raised prices three times and lowered discounts more than the industry average in their home market during the first half, according to woodcliff, new jersey-based autodata. mulally's plan mulally, 65, is betting u.s. consumers will switch from larger vehicles to more fuel-efficient cars such as the fiesta as gasoline prices rise and pay more for amenities such as heated leather seats. * regular unleaded gas has exceeded $3.50 a gallon in the u.s. since march, according to aaa. mulally, 65, is betting u.s. consumers will switch from larger vehicles to more fuel-efficient cars such as the fiesta and pay more for amenities such as heated leather seats as gasoline prices rise. regular unleaded gas has exceeded $3.50 a gallon in the u.s. since march, according to aaa. in 2008, ford's sales plunged when gas prices peaked at $4.11 a gallon and damped demand for the automaker's pickups and suvs. ford had $30.1 billion in losses from 2006 through 2008, before earning $9.28 billion in the last two years. ford fell 14 cents to $13.17 yesterday in new york stock exchange composite trading. the shares have declined 22 percent this year after a 68 percent gain in 2010. ford's second-quarter sales of $35.5 billion topped nine analysts' average estimate for $32.1 billion. the automaker boosted north american production for the quarter by 8.7 percent percent to 710,000 cars and trucks, in line with its forecast on april 26. pretax profit for the region rose less that 1 percent percent to $1.91 billion. pretax profit in ford's european operations fell 45 percent to $176 million .--editors: bill koenig, jamie butters to contact the reporter on this story: craig trudell in dearborn, michigan at ctrudell1 @ bloomberg.net"}]