[{"articleID": "2014121406_00031147_W", "names": {"Lee Adams": ["Q6512930", "Q6512934"]}, "date": "2014-12-14", "url": "http://wzzm13.com/story/news/2014/12/13/scott-flahive-memorial/20376479", "content": "Officer Flahive remembered in Grand Haven MORE GRAND HAVEN, Mich. (WZZM) - Hundreds gathered at the Grand Haven Eagles building Saturday to remember slain public safety officer Scott Flahive on the 20th anniversary of his death. \"We're still very emotional about it,\" said Margery Flahive, Scott's aunt. Officer Flahive was killed the night of Dec. 13, 1994 when he pulled over two escaped inmates on Beacon Boulevard. While approaching the vehicle, Flahive was shot and killed instantly. \"Even though I didn't know him personally, I feel like I did know him,\" said Sergeant <mark>Lee Adams</mark>, Grand Haven Department of Public Safety. \"Just through all the stories. When I went through the academy, he was the first officer I ever learned about .\" <mark>Adams</mark> said Flahive was the first officer in Ottawa County to be shot and killed while on service. A memorial fund has been set up in Flahive's name to pay for a marker that will one day line the entrance of the public safety building. To donate to the fund, email"}, {"articleID": "2019120715_00136856_W", "names": {"Richard Thompson": ["Q17403001", "Q17722161", "Q19845266", "Q21389996", "Q21466506", "Q21466999", "Q27926877", "Q3130586", "Q359373", "Q4460338", "Q45893438", "Q539955", "Q7326541", "Q7329458", "Q7329459", "Q7329460", "Q7329461", "Q7331804"], "Douglas Ross": ["Q24039769", "Q5301949", "Q56165274"], "Richard Leonard": ["Q24039896", "Q50365677", "Q7327335"], "Chris Stephens": ["Q19059345", "Q30056655"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"]}, "date": "2019-12-07", "url": "http://www.northwaleschronicle.co.uk/news/national/18086207.nicola-sturgeon-gets-skates-parties-hit-streets-final-bid-votes/#comments-anchor", "content": "Nicola Sturgeon gets skates on as parties hit the streets in final bid for votes By Press Association 2019 Nicola Sturgeon 2 comments Nicola Sturgeon got her skates on as she visited Aberdeen's Christmas market on the election campaign trail. The SNP leader was joined on the ice by Scottish Finance Secretary Derek Mackay and the party's Aberdeen North candidate Kirsty Blackman. The visit was the first on her tour of the north east, as she urges voters to unite around the SNP to stop Boris Johnson re-entering Number 10, and to prevent Brexit. Ms Sturgeon and Mr Mackay took to the ice (Jane Barlow/PA) Her later engagements involved taking part in a traditional music workshop with Aberdeenshire West and Kincardineshire candidate Fergus Mutch, and a Christmas arts and crafts class with children and Gordon candidate <mark>Richard Thompson</mark>. Meanwhile, Scottish Conservative leader Jackson Carlaw was in Moray campaigning with Tory candidate <mark>Douglas Ross</mark>. Mr Carlaw called on voters to \"lend\" votes to his party, regardless of their voting history, to \"stop Nicola Sturgeon and her second divisive independence referendum\". Brilliant to be in Moray this morning for @ Douglas4Moray with @ MorayTories. <mark>Douglas</mark> has a long record of working hard for the people of Moray and he is the only one who can beat Nicola Sturgeon's separatist candidate here. Just 5 days to go!?????????????????????? pic.twitter.com/Kxs9puqkyd--Jackson Carlaw MSP (@ Jackson_Carlaw) December 7, 2019 Posting online, he added: \"There are just 5 days left to save the union .\" Another referendum would be more divisive, more brutal and more corrosive than last time. \"Independence was also on the agenda as Scottish Liberal Democrat leader Willie Rennie visited a farmers' market in St Andrews, Fife. He said:\" Across the country we are finding people who are willing to lend their vote to the Liberal Democrats to stop another independence referendum. \"You don't have to love every single Liberal Democrat policy, you just have to be among the majority of Scots who look at the prospect of another referendum next year and say no thanks .\" Campaigning in Glasgow, Scottish Labour leader <mark>Richard Leonard</mark> vowed to take seats from the SNP to get his party in power at Westminster. It's the final Saturday of the campaign and I'm with this top team in Glasgow South West. Two years ago @ MattKerrLabour missed out by just 60 votes. We are going to turn it red on Thursday and deliver a majority Labour government. #RedWave pic.twitter.com/ouT6IbfUCi--<mark>Richard Leonard</mark> (@ LabourRichard) December 7, 2019 He was canvassing with Glasgow South West candidate Matt Kerr, who lost the seat in the 2017 General Election by just 60 votes to the SNP's <mark>Chris Stephens</mark>. Mr <mark>Leonard</mark> tweeted: \"We are going to turn it red on Thursday and deliver a majority Labour government .\" In Glasgow on Saturday evening, Labour shadow chancellor <mark>John McDonnell</mark> is to speak at a \"Rally for Real Change\". We are at Ineos Grangemouth calling for an end to imports of fracked gas To #DemandClimateAction vote Scottish Green on Thursday in #GE 2019 pic.twitter.com/fz1GbW51Ji--Scottish Greens (@ scotgp) December 7, 2019 Elsewhere, Scottish Greens co-leader Patrick Harvie joined Linlithgow and East Falkirk candidate Gillian Mackay for a demonstration outside Ineos in Grangemouth, and urged voters to back his party on Thursday for climate action. The party wants imports of fracked gas at the site to stop, arguing that since fracking has been ruled out in Scotland it should not instead enable the controversial gas extraction technique. 2 comments"}, {"articleID": "2017051805_00027269_W", "names": {"Greg Byrne": ["Q3116191", "Q57633545"]}, "date": "2017-05-18", "url": "http://www.timesdaily.com/sports/alabama_football/alabama-struggles-under-new-baseball-coach/article_967be691-67dd-55fb-8a54-19951c74dea9.html#comments", "content": "Alabama has struggled under first-year baseball coach Greg Goff. Entering this weekend's final series at Vanderbilt, the Crimson Tide (19-32, 5-22 SEC) is closing in on a potentially program-worst record. Just three months into the job, new Alabama athletic director <mark>Greg Byrne</mark> has already heard rumblings from fans regarding the season-long struggles. \"Obviously it's not a year that anybody wants,\" <mark>Byrne</mark> said Wednesday at the Regions Tradition Pro-Am from the Greystone Golf and Country Club in Hoover. \"At the same time, too, I like the effort the kids have continued to make and I know the coaches have been out there recruiting and that's what you want them to do .\" To date, Alabama's worst season came in 1994 when the Tide went 21-35 overall and 4-22 in SEC play. And while a series sweep against rival Auburn helped surpass the season-low conference win mark, Alabama could still finish with a program-worst winning percentage if it is swept by the Commodores. But while he commiserates with some fans, <mark>Byrne</mark> remains supportive of Goff--the last coaching hire his predecessor Bill Battle made before retiring. \"For all of our sports, we want to compete for championships--baseball included,\" <mark>Byrne</mark> said. \"I know how passionate our fan base is, that's what separates us from our competition and makes us so special ....This year's not the year we wanted to have at all, but at the same time, I like the steps we're taking moving forward to give us the best opportunity to succeed long term .\" Johnson updates Key's status Before Braxton Key declared for the NBA draft, Alabama coach Avery Johnson laid out his expectations for how the next month would play out. With just a week until the NBA's deadline of May 24 to decide whether to stay in the draft or return to school, the Crimson Tide's 6-foot-8 freshman wing has only had one team tryout (with the Boston Celtics) and hasn't been invited to either of the national pre-draft combines. None of it surprised Johnson. \"When this process started and he came in and said he was very serious about declaring, we talked about what that process would look like,\" Johnson said Wednesday from the Regions Tradition Pro-Am. \"We provided he and his family with all the information, and I told him what I thought the prognosis would be in terms of whether he would get drafted or not, get invited to Chicago or not, how many workouts he'd eventually have, and it's pretty much right in line with what's (happened).\" Despite a lack of interest, Key--who was named to the SEC's All-Freshman team after leading Alabama in points per game and minutes played--has continued to keep tabs with Johnson while working out near his hometown of Charlotte. All the while, the door to return to the Tide remains wide open. \"If he decides to come back, all the returning players know that by 3 o’clock on the 29th, they all have to be on campus and we have a team dinner that night,\" Johnson said. \"We'll know what we're dealing with in the next couple of days .\" Subscribe"}, {"articleID": "2008122708_00024504_W", "names": {"Alan Johnson": ["Q19560876", "Q2830527", "Q332336", "Q4706980", "Q4706981", "Q4706983", "Q4706984", "Q4706985"], "Paul Harris": ["Q16729669", "Q17425211", "Q2059988", "Q2345201", "Q28225916", "Q3520835", "Q7151139", "Q7151140", "Q7151142", "Q7151146", "Q7151147", "Q7151148", "Q7151149"]}, "date": "2008-12-27", "url": "http://thechronicleherald.ca/Business/1097890.html", "content": "from educators to ceos, this group caught our attention this year sat. dec 27 - 4:46 am they're not all rich. they're not necessarily powerful, in the traditional sense. their names won't be familiar to everyone, but they definitely made 2008 interesting. from development veteran ben mccrea's no-nonsense stance on his waterside property to jim wooder's push for a new container business in sydney, here are the stories of seven nova scotians who pushed forward with their dreams in 2008 and are making a difference in the province. ben mccrea founder, armour group for three decades ben mccrea has tried to keep his \"nose below the trench line\" as he built some of the most prominent buildings in halifax. the founder of armour group has always believed that projects such as historic properties, founders square and his new environmentally sensitive office building in the city of lakes business park in dartmouth can say more about the quality of the work his company does than anything he might say in an interview or news release. but in 2008 he was forced into a high-profile fight with both city politicians and a heritage lobby group when his plan to renovate buildings along the granville mall became a focal point for debate on new what kind of development is appropriate for downtown halifax. armour group owns the four heritage buildings along the mall and wants to keep their facades while unifying them under a new six-storey office tower. mr. mccrea argues it represents the only financially feasible basis on which the history represented by the buildings can be preserved. critics counter that to maintain the true heritage quality of the buildings, their interiors need to be saved. there was considerable debate and threats of lawsuits, but in october city hall gave the plan a thumbs-down. not to be deterred, mr. mccrea appealed the decision to the nova scotia utility and review board. then, as if to underscore the seriousness of the effort, he applied for demolition permits for the four buildings and pulled down an old wooden building on the property that was not to be part of the redevelopment. there is a one-year waiting period before the heritage status can be removed and the other buildings taken down, but mr. mccrea hopes it won't come to that. he believes the board will rule in january that he has followed all the rules and should be allowed to proceed with the project as originally proposed. but for mr. mccrea, 2008 was about much more than the waterside project. he was nominated by the halifax chamber of commerce as business person of the year; he was inducted into the engineering hall of fame at the university of new brunswick and his pet project with ducks unlimited, the greenwing legacy interpretive centre at shubenacadie wildlife park, was officially commissioned. his plans for another new office building in dartmouth and work on the $200-million queen's landing office building, hotel complex and revamped maritime museum of the atlantic are proceeding slowly, in part because construction costs have increased by 30 per cent since 2005 and in part because there is little financing for major projects in the current economic climate adamant that halifax has to do more to promote itself as the business centre of atlantic canada, mr. mccrea says his push for the waterside centre shows his commitment to the cause, even if it forces him into a spotlight he would rather avoid. jo ann fewer ceo, colchester regional development agency when jo ann fewer looks out across a wooded area running along highway 104 near debert, she doesn't see the starlings in the trees or the deer prints in the early december snow. the head of the colchester regional development agency sees places where roads can be built, factories can be erected, and stores and retail businesses serving a bustling industrial park can spring up. it's a vision that she's been selling for seven years, but the job of turning the idea into a reality got easier in april when the province transferred the 920-hectare debert air industrial park to colchester county and the county handed responsibility for development and marketing to her 13-member agency. \"we're going to open up lots so that industrial and commercial operators can move into large parcels of land with great highway access,\" ms. fewer says confidently. \"then we'll leverage the advantages of the debert airport for the quick movement of goods and people some of the site-clearing work has begun but more importantly, she says, the potential of the project at the intersection of the province's two most heavily travelled highways is already being recognized globally .\" we've had lots of calls over the past few years, but it was hard to turn them into anything solid until we had the land in hand. that's been accomplished, and i'm confident you'll see the first buildings going up in the spring. \"ms. fewer, the past head of the provincial association of development agencies, is also pushing for the creation of an atlantic bioscience accelerator to bring high-end agricultural jobs to the region; helping draft a transportation master plan for the area; travelling internationally to enhance efforts to attract immigrants to the area (64 have settled in the region since 2005 and 117 are in the application process); and lobbying to make sure businesses in the region will have early access to natural gas .\" she's got boundless energy and you have to run to keep up with her, \"says <mark>alan johnson</mark>, the agency's director of marketing .\" she's a strategic thinker and quick to move on opportunities, but her strength is her ability to bring people together. \"agency figures suggest the organization has injected more than $25 million into the local economy since 2001, but ms. fewer believes that once the economy begins to right itself and several of the group's other projects get traction, that number will look small. she sits on the advisory board for the eco-efficiency centre at dalhousie university and as the mother of two active boys, she spends most of her spare time with her husband at the rink or soccer field as a dedicated fan. joan mcarthur-blair president, nova scotia community college joan mcarthur-blair is a champion of community college education. the president of nova scotia community college hasn't been shy about articulating the crucial role that the community college will play in the health of nova scotia's economy and in solving the impending shortage of skilled workers. the former vice-president of education at vancouver community college came to nova scotia in 2005 to take the job as head of nova scotia community college and has shown determination in matching community college education with rapidly changing needs of industry and business. industry has more input into the design of programs and workers have more choice about how and where a program is delivered .\" a la carte education \"is what ms. mcarthur-blair calls it .\" nova scotia community college generates ideas, applied research and knowledge for its communities, \"she said this year at the opening of a new business incubation centre at the college's annapolis valley campus. the centre brings together scientists, researchers and technology entrepreneurs in the commercialization of research. ms. mcarthur-blair is also busy promoting a stronger link between the colleges and the communities where they are located. students and staff at the 13 college campuses in nova scotia have all taken on projects relating to the health, environment and improvement of the communities they call home. energy sustainability has become part of the college's curriculum. for instance, the college is recruiting students for a new two-year program, energy sustainability engineering technology, at the annapolis valley campus in middleton. the program will teach students with a trades background how to create customized energy systems that include solar, wind, biomass, geothermal, tidal and other alternative renewable sources .\" graduates will be prepared to take a leadership role in helping future employers develop more environmentally sustainable practices, \"ms. mcarthur-blair said earlier this year in a news release. the centre for the built environment, an upcoming addition to the college's new waterfront campus in dartmouth, will open in 2010 and serve about 500 students in 13 enhanced trades and technology programs. mickey macdonald entrepreneur, halifax it's all about doing the right thing, says mickey macdonald. while the halifax businessman has parlayed his business savvy into a successful career, he has also made a difference in a lot of people's lives because he believes in giving back to the community. in 2008, mr. macdonald and his brother colin were recognized with a red cross humanitarian award for their community work and support for local charities. he also received the <mark>paul harris</mark> fellowship award from the rotary club for contributions to the rotary charitable and educational programs. his investment of more than $1.5 million in palooka's boxing club on gottingen street in halifax has created a venue for young people to learn the tactics and strategy of boxing while developing character traits such as discipline, focus and building self-confidence and self-esteem .\" when you get into business, there is no real blueprint to tell you what you are supposed to do as far as your return to the community after you take money out of it, \"he said .\" i guess a lot of times you look to role models to set an example for you to give something back. \"his role models?\" my mother was a big one. she was always very giving and always telling us to give back, take care of the kids, things like that. and in business, my brother colin (ceo, clearwater fine foods), my brother-in-law john risley (co-owner, clearwater seafoods) and their commitment to giving back. other people, like charlie keating and harry steele, all these icons, successful business people, they give back to the community. \"mr. macdonald, whose diverse business interests include retail, food and beverage, fitness, automotive leasing and residential land development, says he is a bit embarrassed about receiving awards for doing what he believes is right and is humbled by it .\" \"i understand that when people are recognized, whether it is me or somebody else, it will inspire others to step up and do these things. i don't really consider myself a role model but hopefully i can make an impression on some people and say that is the right thing to do, to help out and give back. at the end of the day you have a choice,\" he said. jim wooder ceo, laurentian energy there is an air of enthusiasm and optimism for new economic development around the port of sydney these days, and jim wooder has played a big part in creating that climate. the ceo of laurentian energy at sydport has been front and centre at several major project announcements in 2008. it's been a good-news list: the announcement of a port master plan; plans to dredge the harbour channel entrance that will open the port to bigger ships; laurentian's plans with its paris investor to build a new container terminal; formation of a sydney marine group; and the announcement by laurentian to build two onshore drilling rigs for calgary firm nabors canada. \"when i first came here close to 3 1/2 years ago, i was really interested in just how many people here give of themselves and i tried to find something that will help turn the place in the right direction and on a sustainable basis,\" he said. \"i guess what we have been able to accomplish with the harbour development is we have been able to articulate a vision that can be shared by most members of the community. that is really important because if people can't see themselves in it, then they are less likely to pay attention to it and support it, and that maybe is the defining feature of the harbour work,\" he said. mr. wooder said the key to sustainable port growth is channel dredging. \"we exploded a lot of myths, and the master port plan which was launched on jan. 8 brought to people's attention the really significant issue of the dredging as the key enabling event, and we keep saying it because it is true,\" he said. at times mr. wooder was told it was \"difficult to get people pulling on the oar at the same time,\" and he said maybe he has been \"catalytic\" in changing that. \"i think the trust we have developed within the marine group has been very significant in the context of what we have achieved, because you have players who compete but have seen the rationale and the logic in sharing information and working together,\" he said. \"the fact that marine group members are actually funding, in part, the environmental assessment for the channel dredging is really terrific evidence of how far we have come .\" winning the contract to build the two rigs was also significant, mr. wooder said. \"building sustainable capacity is really where the future is here, and i think the nabors example is something this community needs to reflect on as a kind of model to attract other businesses. people do value reasonably priced, very competent labour, and labour is becoming an increasingly important commodity in the overall value chain .\" cohen macinnis president, highland group of companies cohen macinnis cannot understand what all the fuss is about. the 20-year-old created a buzz in new glasgow after acquiring and beginning renovations to the landmark maritime building, which has overlooked the community since 1915. his highland group of companies has refurbished most of the eight-storey structure and it is almost filled with new tenants. \"there is really a lot happening in pictou county, and it is really exciting to be a part of it,\" the entrepreneur said of a project many people in the community associate with a resurgence of interest in the downtown core. he just wishes people would quit making such a big fuss about his age. \"i've actually been at this for a while. i acquired my first building when i was 18,\" he said of his start in property management and development. although he is enthusiastic about the support he received in new glasgow for his renovation, he still calls antigonish home and got his start in business there. before acquiring his first property he managed a hotel and then brought an avis vehicle-rental business to the community. \"i have a supportive family but was not born into money or anything like that,\" said the soft-spoken president of highland group. \"i built the business from the ground up .\" these days mr. macinnis is involved in talks about a couple of buildings that fit his requirements. he is looking for commercial space that is underutilized and undervalued so he can bring new life and value to the property and its neighbourhood. \"the maritime building had about 30 per cent occupancy and it was not an active participant in the community. at christmas there would be lights and decorations on other the other buildings but nothing on the maritime building. that has changed,\" he said. lisa samson-boudreau manager, caper gas lisa samson-boudreau didn't just see a business opportunity in 2008; she seized it. with the retreat of big oil companies from rural cape breton, she saw there was a niche market that she could tap into by simply installing gas pumps and above-ground gas tanks at established businesses. thus caper gas, a division of arichat independent fuel oil distributor boudreau's fuels ltd., was born. caper has installed gas pumps at basque convenience on the chapel island reserve, shamrock store in d'escousse, g. h. smith and son in orangedale, fleur de lis store in l'ardoise, ehler's convenience and coffee shop in whycocomagh and seal cove restaurant and convenience in louisdale. and the company is looking for additional locations. \"it was a challenge as a small business,\" she said, suggesting that might have been a good thing. \"it's helped us look at how we do things and make necessary changes. it was not a throw-away year .\" ms. samson-boudreau also made news in 2008 as a vocal advocate of the province's gas price regulation regime. she took exception to a call by the halifax chamber of commerce to have the government drop gas regulation, wondering how many chamber members have to drive 50 kilometres to fill their tanks. chamber president valerie payn said regulation hasn't delivered stable gas prices or increased opportunities for independent gasoline retailers to make a profit, especially in rural areas. \"free-market forces, not the government, ultimately determine the price of gasoline,\" she said, adding that the administrative costs associated with regulation could be better spent elsewhere. ms. samson-boudreau disagreed, saying that gas price regulation provides guaranteed margins to operators in rural areas who don't have the high-volume sales found in urban centres. she said it offers some security and has allowed her to operate as a distributor and take up the slack the major companies left behind. \"this way people in rural areas get service and retailers can make money,\" she said."}, {"articleID": "2012050520_00059445_W", "names": {"Corey Davis": ["Q27443339", "Q5170350"]}, "date": "2012-05-05", "url": "http://yourdailyjournal.com/view/full_story/2754360/article-Reddy-brings-world-of-experience-to-Richmond-Pines-Country-Club?", "content": "play | stop | | next>> image 1 / 2 naveen reddy, who took over as head golf professional at richmond pines country club on june 2, stands on the tee box at canyon gates country club in las vegas. naveen reddy has traveled internationally teaching golf to many different types of people, and he has brought his expertise to richmond county. reddy has been the head golf professional coach at richmond pines country club since june 2. before coming to richmond pines, reddy was teaching golf in las vegas for a year-and-a-half. \"i was the director of instruction for my own golf academy, where i taught golf to mainly physicians at different hospitals,\" reddy said. las vegas is just one of the many stops on reddy's trek across the world to provide his golfing knowledge and instruction. he has traveled to over 50 countries teaching golf, given more than 30,000 golf lessons and performed in over 300 golf shows. in addition, reddy was the head golf pro on several cruise ships including those owned by carnival cruise lines, celebrity cruise lines, holland america cruises and p & o cruises. \"i've been really blessed to be doing what i'm passionate about,\" reddy said. \"most people that are club pros, you aren't just the teacher of golf, you are like the general manager. but i have always enjoyed teaching because that was the fun part. doing the paper work and working on the computer wasn't that cool. i feel my experience in teaching is second to none because i have given so many lessons .\" benny bowles, owner of several golf courses in the state, took over the lease at richmond pines and persuaded reddy to leave the bright lights of las vegas behind to become the head golf pro at richmond pines. according to reddy, bowles gave him his first big break when he hired reddy as the head pro at woodbridge golf club in kings mountain from 2002 to 2004. \"he told me that i got a course in rockingham that no one is teaching golf, and if you don't teach golf, then there aren't going to be any new golfers,\" reddy said. \"he told me i need your skills and to come down here and teach the community how to play golf. that is what will drive new customers, and he really wants me to make golf exciting .\" the people that play golf are already playing it. he wanted to bring a fresh face, a new angle and for me to get the word out about golf to richmond county. \"reddy has started the process by scheduling four junior golf clinics this summer, as well as, men's and women's golf clinics .\" i'm doing all these clinics for the kids and for older people because that's something that hasn't been done around here, \"reddy said .\" what i'm trying to do is reach out to the community and get everyone involved. i want to bring everyone back to the country club. \"reddy added there are changes being made to the golf course including restoring the greens and remodeling the clubhouse .\" at one time, richmond pines was a thriving country club, was the hottest spot in the whole county and the membership was at 400, \"he said .\" throughout the years, it has gotten neglected, not had that much excitement and the membership is down to 120. i want to revive the country club by bringing excitement back and i've got a lot of plans. \"n contact sports reporter <mark>corey davis</mark> at 997-3111, ext. 44; e-mail cdavis @ yourdailyjournal.com"}, {"articleID": "2018101415_00122137_W", "names": {"Oscar Romero": ["Q22667011", "Q47806597"], "John Paul": ["Q1701359", "Q6252169"], "Francesco Spinelli": ["Q18016120", "Q57491365"]}, "date": "2018-10-14", "url": "http://www.ijpr.org/post/oscar-romero-pope-paul-vi-elevated-sainthood", "content": "<mark>Oscar Romero</mark>, Pope <mark>Paul</mark> VI Elevated To Sainthood By Camila Domonoske • 32 minutes ago Tweet Share Google + Email View Slideshow 1 of 3 A mass for a canonization ceremony of Pope <mark>Paul</mark> VI and the martyred Salvadoran Archbishop <mark>Oscar Romero</mark>, as well as five other people, was in St Peter's Square at the Vatican, on Sunday. Filippo Monteforte / AFP/Getty Images View Slideshow 2 of 3 Fireworks go off as Catholic faithful watch a televised screening of the ceremony of the canonization of martyred archbishop <mark>Oscar Romero</mark> at Gerardo Barrios Square in San Salvador on Sunday. Marvin Recinos / AFP/Getty Images View Slideshow 3 of 3 A man lights a candle in Ciudad Barrios, the hometown of blessed Monsignor <mark>Oscar Romero</mark>, some 165 kilometres from San Salvador, to mark his canonization Sunday. <mark>Oscar</mark> Rivera / AFP/Getty Images <mark>Oscar Romero</mark>, the murdered archbishop of San Salvador who spoke up for the poor and oppressed, and Pope <mark>Paul</mark> VI, the former pontiff who declared birth control \"intrinsically wrong,\" were declared saints on Sunday morning in a ceremony at St. Peter's Square in the Vatican. The ceremony featured seven new saints all told, including, as the Vatican put it, \"five other lesser-known blessed .\" <mark>Romero</mark>, who stood up to a violent regime, was killed by a right-wing death squad on a church altar in 1980. He was a strong influence on Pope Francis, who was born in Argentina, NPR's Sylvia Poggioli reports. \"<mark>Romero</mark>'s dedication to the poor and marginalized greatly influenced the first Latin American pope,\" Poggioli says. \"As soon as he became pope, Francis authorized <mark>Romero</mark>'s canonization--a rebuke to his predecessors, <mark>John Paul</mark> II and Benedict XVI, who believed <mark>Romero</mark> was too far to the left .\" In the ceremony at the Vatican on Sunday, Francis said, <mark>Romero</mark> \"left the security of the world, even his own safety, in order to give his life according to the gospel--close to the poor and to his people .\" During the ceremony, Francis wore \"the blood-stained rope belt that <mark>Romero</mark> wore when he was gunned down,\" The Associated Press reports. Thousands of Salvadoran pilgrims traveled to Rome to watch <mark>Romero</mark>'s canonization, the AP notes. Back in El Salvador, many more stayed up late in the night to watch live video of the canonization of the martyred archbishop. Photos show people weeping in the Gerardo Barrios square in San Salvador, and mothers holding sleepy, blanket-wrapped children in Romeros' hometown of Ciudad Barrios. <mark>Romero</mark>, whose supporters called him by the honorific Monseñor, was a hero to many, particular El Salvador's poor. But others--including some bishops within the church--accused him of being a communist subversive, driven by politics instead of faith. As NPR's Danny Hajek reports, crowds packed into the cathedral in San Salvador to hear his homilies, and across the country, even more people listened to live radio broadcasts. <mark>Romero</mark> called out bloodshed and defended human rights, becoming known as the \"voice for the voiceless .\" He also named the victims of both murders and disappearances, during a time of widespread silence and denial on the topic, making him a source of news as well as comfort and religious guidance. He exhorted members of El Salvador's military to disobey orders to kill civilians, well aware that he was risking his life by speaking up. Hajek reports: \"<mark>Romero</mark> was a champion of human rights at a time when El Salvador was on the brink of civil war. His tireless fight for civil rights ranks him among figures like Martin Luther King Jr....<mark>Romero</mark>'s voice echoed above the violence that engulfed his country .\" \"At a time of so much confusion and anguish,' <mark>Romero</mark> said in his homily on Feb. 10, 1980,' I want to be a messenger of hope. In the midst of tragedy and bloodshed, there is hope .'\" The next month, <mark>Romero</mark> was assassinated. Pope <mark>Paul</mark> VI, who was also elevated to sainthood on Sunday, oversaw the closing of the Church's pivotal Second Vatican Council, and issued the landmark encyclical that cemented the church's opposition to birth control. NPR's Tom Gjelten revisited that encyclical this summer, 50 years after it was released: \"On July 25, 1968, Pope <mark>Paul</mark> VI stunned Catholics around the world with his announcement of Humanae Vitae,\" Of Human Life, \"a document in which he forcefully reaffirmed the church's previously stated position on the use of artificial birth control, calling it\" intrinsically wrong. \"\"\"We are obliged once more to declare that [methods for] the direct interruption of the generative process,' the pope wrote,'...are to be absolutely excluded as lawful means of regulating the number of children .'\" Humane Vitae came as a surprise to many Vatican observers. Though an encyclical issued in 1930 already prohibited birth control, a papal commission had been assembled to revisit that ban, and a majority of the commission members suggested that it be dropped. \"The Vatican calls <mark>Paul</mark> VI the\" pope of modernity \"for his influence on changes in\" liturgy, seminary formation, theological study, and many other areas of ecclesiastical life. \"The five other saints canonized on Sunday were all born in Europe during the 18th or 19th century: <mark>Francesco Spinelli</mark>, born in Milan in 1853, founded a community of nuns. Vincenzo Roman, born near Naples in 1751, taught children and helped his community recover from an eruption of Mount Vesuvius. Maria Catherine Kasper, born in Germany in 1820, created an organization that served the poor. Nazaria Ignazia of Saint Teresa of Jesus, born in Spain in 1889, founded a missionary group in Bolivia that served women and the poor. Nuncio Sulprizio, born in Italy in 1817, died of bone tuberculosis at the age of 19 and was praised for his\" heroic virtues. \"All seven new saints,\" in different contexts, put today's word into practice in their lives, without lukewarmness, without calculation, with the passion to risk everything and to leave it all behind, \"the pope said, according to Vatican News. Copyright 2018 NPR. To see more, visit http: //www.npr.org/. Tweet Share Google + Email View the discussion thread."}, {"articleID": "2015021320_00052018_W", "names": {"David Axelrod": ["Q1251914", "Q519838"], "Ron Johnson": ["Q1741083", "Q19879325", "Q20639273", "Q21229090", "Q27923350", "Q3892458", "Q3940971", "Q7363984", "Q7363985", "Q7363986", "Q7363987", "Q7363989", "Q970272"]}, "date": "2015-02-13", "url": "http://www.huffingtonpost.com/alyona-minkovski/congress-aumf-debate_b_6679944.html?utm_hp_ref=politics&ir=Politics", "content": "<mark>David Axelrod</mark>'s View Inside The Economic Storm Obama Inherited In 2009 Michelle Obama Banned Chelsea Clinton's Favorite Dish From The White House 16 Times The Obama Administration Lied About The President's Position On Same-Sex Marriage Saudi Historian: U.S. Women Drive Because They Don't Care If They're Raped Man In No. 75 Patriots Jersey Doesn't Realize Who He's Talking To Here's Proof That Pricey Fitness Wearables Really Aren't Worth It Smartphone Theft Plummets In Major Cities Thanks To \"Kill Switches' How Our Dog Obsession May Actually Be Making Their Lives Miserable Urban Outfitters Under Fire For Tapestry Reminiscent Of Uniforms Worn By Gay Nazi Prisoners Do Committed Gay Couples View Masturbation Differently Than Straight Couples? This Newly-Named Anti-Gay Extremist Could Be The Next GOP Presidential Candidate Six months after the United States began a bombing campaign against ISIS, President Obama has asked Congress to pass a new\" Authorization of Military Force' to make it official. The proposal has a time-stamp of three years, places limits on the use of ground troops, and sunsets a Bush era AUMF from 2002 that authorized military action in Iraq. It's the administration's attempt to appease both Democrats' supposed uneasiness about endless war and Republicans' thirst for more of it. The truth is, it changes nothing. We can start with the most obvious opportunities for mission creep. The new proposed AUMF applies not only to ISIS but also \"associated persons or forces\" including any \"closely related successor entity\" ; there are no geographical boundaries set in the language; troop limits include the possibility of rescue operations, the use of Special Operations forces and don't adequately define what an \"enduring\" presence would mean, and despite the three year expiration date, it can always be reauthorized. Let's also not pretend that if Congress doesn't give it the go ahead, \"Operation Inherent Resolve\" will suddenly cease. The president will just continue on without official permission as he has done since September 2014. The more important aspect of the new proposal is what it leaves out: the 2001 AUMF remains untouched. Passed in the immediate aftermath of 9/11, the 2001 authorization is only 60 words long and yet it's become, as Gregory Johnsen called it, \"the most dangerous sentence in history .\" Originally intended to provide legal cover for hunting down those responsible for the attacks, the lethal phrasing has been manipulated to justify drone strikes and shadow wars in Yemen, Pakistan, Somalia and beyond. It's also not as simple as repealing the 2001 AUMF. This administration has argued that it has other tools at its disposal, including Article II of the US Constitution, which decrees the president the commander-in-chief. The world has become Obama's battlefield and neither American citizens nor innocent civilians are beyond his reach. Over the years he's been in office, the president's rhetoric has consistently failed to square up with his actions. Speaking from the White House this week, he said \"I do not believe America's interests are served by endless war, or by remaining on a perpetual war footing .\" This echoes statements in past speeches promising to rein in a boundless war on terror, including a Momina Bibi continue to be seen as nothing more than collateral damage, and terrorists without being given a day in court. Perhaps even more disturbing than a constitutional scholar acting so flagrantly despite criticism from the intelligence officials within the administration, is the hands-off policy of Congress. The legislative body has been full of complaints about Obama's foreign policy on both sides of the aisle, but they've never collectively organized to try and put a stop to it. This is often blamed on partisan disagreement, but since no one wants to be seen as \"soft on terror,\" the consensus has been to shirk responsibility and let the president take the blame. Yes, Obama is the commander-in-chief, but the power to declare war lies with Congress (something they haven't officially done since WWII). Apparently checks and balances only matter when it's convenient. The current \"debate\" over the president's new AUMF proposal puts the farce on display. Republican opposition has centered around absurdist concerns that it's too limiting, and that the game plan of how to defeat ISIS either isn't clear enough, or tells the enemy too much. Senator <mark>Ron Johnson</mark> told the National Journal, \"I need to find out exactly what President Obama is trying to achieve...I know he says\" degrade and ultimately destroy ISIS .' I'm not sure what he means by that. I don't think his definition of destroy and defeat is the same as mine. \"While Senator Orrin Hatch told KSL radio,\" If we advertise when the authorization expires with the arbitrary date and time, won't they just hunker down and wait for that date? \"As if ISIS will pause for a few years until America gives up. The real outrage is that Republican shock at executive overreach on health care are absent in the realm of war. Democrats meanwhile have shared their fears about a lack of constraints, but few have said they won't vote for the new proposal. House Minority Leader Nancy Pelosi toed a careful line with a painfully bland,\" We hope to have bipartisan support for something that would limit the power of the president but nonetheless protect the American people. \"Rep. Adam Schiff, who in January said,\" It's I think quite carte blanche in terms of geography, types of forces, etc.. And therefore, I think we're going to have to have a lot of work on that. \"That's a work in progress, not a rejection. Despite a recent and faint uptick in concern over perpetual conflict, AUMF repeal efforts have been blocked numerous times over the last 14 years and are just one reminder that Democrats have become a party that endorses aggression. Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg"}, {"articleID": "2013102208_00024524_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "James Holmes": ["Q55363276", "Q5925769", "Q6136182"], "Marcus Taylor": ["Q22681064", "Q332311", "Q42524515"], "Michael Douglas": ["Q119798", "Q172140", "Q358096"], "Tom Robinson": ["Q153289", "Q17198666", "Q42320057", "Q42714349", "Q723493"]}, "date": "2013-10-22", "url": "http://ksla.com/story/23745137/nev-student-opens-fire-kills-teacher-and-himself", "content": "meta itemprop = \"datePublished\" content = \"2013-10-21 15:23:30\" > Nev. student opens fire, kills teacher and himself Nev. student opens fire, kills teacher and himself Police are responding to reports of a shooting at Sparks Middle School in northern Nevada. A student at a Nevada middle school opened fire with a semi-automatic handgun on campus just before the starting bell Monday, wounding two 12-year-old boys and killing a math teacher who was trying to protect children from...meta itemprop = \"datePublished\" content = \"2013-10-22 00:43:52\" > Wis. judge: Officials in contempt for union curbs Wis. judge: Officials in contempt for union curbs A Madison judge on Monday found Wisconsin labor relations officials in contempt for enforcing parts of Gov. <mark>Scott Walker</mark>'s contentious bargaining restrictions despite a ruling that they're unconstitutional,...A Madison judge on Monday found Wisconsin labor relations officials in contempt for enforcing parts of Gov. <mark>Scott Walker</mark>'s contentious bargaining restrictions despite a ruling that they're unconstitutional,...meta itemprop = \"datePublished\" content = \"2013-10-21 07:33:18\" > Defense: <mark>Holmes</mark> was coerced into discussing bombs <mark>James Holmes</mark> returns to court for another round of skirmishes over what evidence can be used against him when he goes on trial for the Colorado theater shootings. Attorneys for Colorado theater shooting defendant <mark>James Holmes</mark> argued Monday that police coerced and misled him into talking to them about bombs that were found in his apartment after the shootings, and they said his...meta itemprop = \"datePublished\" content = \"2013-10-21 08:03:19\" > New talks raise hopes for end to SF transit strike New talks raise hopes for end to SF transit strike Facing a new work week, San Francisco Bay Area commuters girded for gridlock with a major transit strike underway, while federal investigators searched for clues to a weekend transit train crash that killed two...Representatives of the San Francisco Bay Area's transit rail system and its striking unions returned to the bargaining table Monday, raising hopes among the region's frustrated commuters that a four-day work...meta itemprop = \"datePublished\" content = \"2013-10-22 00:33:54\" > Philanthropist on trial in money laundering case An ex-Carnegie Mellon University trustee was accused Monday by a Texas federal prosecutor of conspiring with a romantic interest to launder half a billion dollars for a Mexican drug cartel. meta itemprop = \"datePublished\" content = \"2013-10-21 22:37:01\" > Video evidence: <mark>Marcus Taylor</mark> describes Tavia Sills' murder KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. meta itemprop = \"datePublished\" content = \"2013-10-22 00:21:55\" > Texarkana man arrested for extorting local \"Voice\" contestant Cole Vosbury A Texarkana, Arkansas, man was arrested Monday on a Caddo Parish Sheriff's warrant for extorting Cole Vosbury, a contestant on the television music competition \"The Voice .\" Caddo Sheriff Steve Prator A Texarkana, Arkansas, man was arrested Monday on a Caddo Parish Sheriff's warrant for extorting Cole Vosbury, a contestant on the television music competition \"The Voice .\" Caddo Sheriff Steve Prator meta itemprop = \"datePublished\" content = \"2013-10-20 21:02:22\" > BCPD: Alcohol likely a factor in accident with train The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. meta itemprop = \"datePublished\" content = \"2013-10-21 17:30:46\" > Back on the field: Grambling players end boycott, return to practice Grambling's football team returned to the practice field on Monday afternoon, preparing to play Texas Southern University in a game scheduled for Saturday. Grambling's football team returned to the practice field on Monday afternoon, preparing to play Texas Southern University in a game scheduled for Saturday. meta itemprop = \"datePublished\" content = \"2013-10-21 20:52:00\" > Gas line leak stopped: Major Bossier City intersection back open A major intersection in Bossier City has reopened after a gas line leak shut it down Friday afternoon. Congress votes to end shutdown, avoid US default Congress sends Obama bill to avoid default, open government, ending 16-day stalemate Senate deal on debt, shutdown sends stocks soaring Senate deal on debt and shutdown sends stocks soaring; S & P index climbs to near record high Deal reached to avoid default and open government Bipartisan deal to avert default, reopen federal government; passage possible by day's end Ground employee arrested in LA airport ice blasts Police arrest ground handling employee in dry ice explosions at Los Angeles airport On the edge: House shutdown plan fails; now Senate House shutdown effort collapses: Up to Senate now as deadline nears, US credit rating doubted Associated Press SPARKS, Nev. (AP) - A student at a Nevada middle school opened fire with a semi-automatic handgun on campus just before the starting bell Monday, wounding two 12-year-old boys and killing a math teacher who was trying to protect children from their classmate. The unidentified shooter killed himself with the gun after a rampage that occurred in front of 20 to 30 horrified students who had just returned to school from a weeklong fall break. Authorities did not provide a motive for the shooting, and it's unknown where the student got the gun. Teacher <mark>Michael</mark> Landsberry was being hailed for his actions during the shooting outside Sparks Middle School. \"In my estimation, he is a hero ....We do know he was trying to intervene,\" Reno Deputy Police Chief <mark>Tom Robinson</mark> said. Both wounded students were listed in stable condition. One was shot in the shoulder, and the other was hit in the abdomen. The violence erupted nearly a year after a gunman shocked the nation by opening fire in Sandy Hook Elementary School in Newtown, Conn., leaving 26 dead. The Dec. 14 shooting ignited debate over how best to protect the nation's schools and whether armed teachers should be part of that equation. Landsberry, 45, was a military veteran and leaves behind a wife and two stepdaughters. Sparks Mayor Geno Martini said Landsberry served two tours in Afghanistan with the Nevada National Guard. \"He proudly served his country and was proudly defending the students at his school,\" Martini said. On his school website, Landsberry posted a picture of a brown bear and took on a tough-love tone, telling students, \"I have one classroom rule and it is very simple:\" Thou Shall Not Annoy Mr. L.' \"\"The kids loved him,\" his sister-in-law Chanda Landsberry said. She added his life could be summed up by his love of his family, his students and his country. \"To hear that he was trying to stop that is not surprising by any means,\" she said. Police said 150 to 200 officers responded to the shooting, including some from as far as 60 miles away. Students from the middle school and neighboring elementary school were evacuated to the nearby high school, and classes were canceled. The middle school will remain closed for the week. \"As you can imagine, the best description is chaos,\" <mark>Robinson</mark> said. \"It's too early to say whether he was targeting people or going on an indiscriminate shooting spree .\" At the evacuation center, parents comforted their children. \"We came flying down here to get our kids,\" said Mike Fiorica, whose nephew attends the school. \"You can imagine how parents are feeling. You don't know if your kid's OK .\" The shooting happened on the school's campus and ended outside the school building, according to police. \"I was deeply saddened to learn of the horrific shooting at Sparks Middle School this morning,\" Nevada Gov. Brian Sandoval said in a statement extending his thoughts and prayers to those affected. About 700 students in 7th and 8th grades are enrolled at the school, in a working class neighborhood. \"It's not supposed to happen here,\" Chanda Landsberry said. \"We're just Sparks - little Sparks, Nevada. It's unreal .\" The mayor praised the quick response from law officers who arrived at the scene within three minutes of a flood of 911 calls to find the gunman already dead from a self-inflicted gunshot wound. \"They got it under control very quickly and shut down the scene,\" Martini said. A statement from Nicole Hockley, whose son Dylan was killed in the Connecticut shooting, appeared on the website of gun control advocacy group Sandy Hook Promise. \"It's moments like this that demand that we unite as parents to find commonsense solutions that keep our children - all children - safe, and prevent these tragedies from happening again and again,\" the statement said. The Washoe County School District held a session in the spring in light of the Newtown tragedy to educate parents on its safety measures. The district has its own 38-officer police department. No officers were on campus at the time of the shooting. Sparks, a city of roughly 90,000 that sprung out of the railway industry, is just east of Reno. \"You see it on TV all the time. You just don't think it's going to happen to you,\" Martini said. __ Associated Press writer Michelle Rindels in Las Vegas and news researcher Rhonda Shafner in New York contributed to this report. meta itemprop = \"datePublished\" content = \"2013-10-13 17:38:23\" > Walmart shelves in Springhill, Mansfield, cleared in EBT glitch Shelves in Walmart stores in Springhill and Mansfield, LA were reportedly cleared Saturday night, when the stores allowed purchases on EBT cards even though they were not showing limits. Shelves in Walmart stores in Springhill and Mansfield, LA were reportedly cleared Saturday night, when the stores allowed purchases on EBT cards even though they were not showing limits. meta itemprop = \"datePublished\" content = \"2013-10-21 02:11:01\" > Wrestling over a gun sends man to hospital Police are still investigating after two men wrestling for a gun sent one of them to the hospital after the weapon fired. Police are still investigating after two men wrestling for a gun sent one of them to the hospital after the weapon fired. meta itemprop = \"datePublished\" content = \"2013-10-21 15:08:52\" > Teacher, suspect dead in NV school shooting, 2 other victims in stable condition (RNN) - A shooting has been reported at a middle school in Sparks, NV. CNN reports that the situation is still live, and details are still vague. No reports yet of any injured. Students are being evacuated Authorities said a student was the suspected gunman responsible for a shooting at a middle school in Sparks, NV. The incident left two people dead, the suspect and a teacher. meta itemprop = \"datePublished\" content = \"2013-10-15 03:11:56\" > School: Saying goodbye to deploying parent isn't an excusable absence Columbiana, AL - The Pierce family squeezed in last minute quality time on Thursday, October 3rd. \"He got the email on Wednesday that he was leaving at 1230PM on Thursday,\" explained Angela Pierce. With Her son missed school to say goodbye to his father, who is deployed to Iraq...meta itemprop = \"datePublished\" content = \"2013-10-21 05:05:33\" > Bumpy railroad crossing frustrates Bossier residents A very bumpy and deteriorating railroad crossing has been causing headaches for years in East Bossier Parish. That crossing is at the intersection of Princeton road and Highway 157 near the Calumet Packaging A very bumpy and deteriorating railroad crossing has been causing headaches for years in East Bossier Parish. meta itemprop = \"datePublished\" content = \"2013-10-21 04:03:15\" > Pay raises uneven across La. government State government employees are getting pay raises again - at least $33 million in salary increases have been awarded so far in 2013 - after years of stagnant wages for many...State government employees are getting pay raises again - at least $33 million in salary increases have been awarded so far in 2013 - after years of stagnant wages for many workers meta itemprop = \"datePublished\" content = \"2013-10-20 21:02:22\" > BCPD: Alcohol likely a factor in accident with train The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. The man who pulled a woman from the railroad tracks in Bossier City over the weekend moments before a train came through says he isn't a hero. meta itemprop = \"datePublished\" content = \"2013-10-12 13:30:02\" > <mark>Michael Douglas</mark> reveals he lied about having throat cancer <mark>Michael Douglas</mark> revealed in a new interview Friday that he lied about having stage four throat cancer. <mark>Michael Douglas</mark> revealed in a new interview Friday that he lied about having stage four throat cancer. meta itemprop = \"datePublished\" content = \"2013-10-21 17:04:55\" > Video evidence: <mark>Marcus Taylor</mark> describes Tavia Sills' murder KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. KSLA News 12 has obtained video evidence that jurors heard, but weren't allowed to see during the trial of <mark>Marcus Taylor</mark>, convicted Friday of manslaughter in the murder of Tavia Sills. meta itemprop = \"datePublished\" content = \"2013-10-20 17:10:46\" > Authorities locate ETX man that was reported missing Saturday Released by the Gregg County Sheriff's Office: Sheriff Maxey Cerliano and the Gregg County Sheriff's Office want to thank the media for their response on the Justin Allen missing person case that was reported"}, {"articleID": "2017071021_01146119_W", "names": {"Phil Simmons": ["Q47434073", "Q6827914"]}, "date": "2017-07-10", "url": "http://www.thehansindia.com/posts/index/Sports/2017-07-11/BCCI-bouncer-New-coach-only-later/311504", "content": "BCCI bouncer: New coach only later THE HANS INDIA | Jul 11,2017, 03:19 AM IST Sourav Ganguly, one of the three Cricket Advisory Committee (CAC) members, addressing the media in Mumbai on Monday In a dramatic turn of events, the three-member Cricket Advisory Committee (CAC) on Monday decided to put the appointment of next India coach on hold despite completion of the interview process. Mumbai: The decision to withhold the appointment is a clear indication that Ravi Shastri is no longer a runaway favourite for the top job after Virender Sehwag appeared in person for the interview which went on for two hours. It was revealed that five people, including Shastri, Sehwag, Lalchand Rajput and Richard Pybus appeared for interview while <mark>Phil Simmons</mark> made himself unavailable. The CAC comprises former captains Sachin Tendulkar and Sourav Ganguly along with VVS Laxman. Tendulkar joined the day's proceedings via skype as he is currently in London. \"We will hold on to the announcements as we need a few more days. We feel there is no hurry, the Sri Lanka tour is coming in a few days' time,\" Ganguly told media persons. Ganguly made it clear that they are looking at the bigger picture for the next two years and will take a decision in the best interest of Indian cricket. Reiterating the policy of the BCCI, Ganguly stated that any appointment will be made till the World Cup. \"Once we make this announcement, it has to be till the World Cup (2019),\" said Ganguly. Ganguly said that the presentations given by coaches on their roadmap for Indian cricket were no different from what they saw last year. \"From what we have heard from the coaches, it is not different from last year. We will take a call in the due course of time. We are not in a hurry. Sri Lanka is a long tour. We want to make sure that everybody is in synchronisation .\" \"It's not me, Sachin, Amitabh ji (Chaudhary) or Rahul (Johri), who will play. It is the players who will be playing and the support staff will be there. Everybody should be in synchronisation,\" Ganguly said in a matter-of-fact manner. He made it clear that skipper Virat Kohli remains an important cog in the decision-making process. \"Virat is an important cog in the system and we will take a call which would be the best way forward for the team and the boys because they are going to play .\" Stay updated on the go with The Hans India News App. Click for Android / IOS download it for your device."}, {"articleID": "2019082017_00268251_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-08-20", "url": "http://www.gamereactor.eu/hearthstone-heroes-of-warcraft/?sid=c748f06a9aee355885e35efd0619862a", "content": "HEARTHSTONE: HEROES OF WARCRAFT REVIEW. Written by Ricardo C. Esteves on the 9th of August 2019 at 14 \"In addition to offering many alternatives to players, it's a really fun expansion in terms of cards, effects, and variety .\" 0 REVIEW. Written by Ricardo C. Esteves on the 15th of April 2019 at 15 \"Hearthstone changes for the better as new content comes in and old cards are swept from the table .\" NEWS. Written by Ricardo C. Esteves on the 18th of July 2019 at 21:09 Sir Finley returns, now with extra power and as a Paladin-only card. Plus, we asked Blizzard's Alec Dawson about the latest addition coming to Hearthstone. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 10th of May 2019 at 13:32 This will provide twists on the existing mechanics, as well as some new features over the five chapters that the heist takes place. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 29th of March 2019 at 11 The top 16 players from three regions will compete for supremacy, and the divisions are set to be announced next month. 0 NEWS. Written by <mark>Sam Bishop</mark> on the 14th of March 2019 at 17:00 Join the League of E.V.I.L. in the battle against the Defenders of Dalaran, featuring new cards and mechanics to keep things fresh."}]