[{"date": "2014-01-31", "url": "http://feeds.sciencedaily.com/~r/sciencedaily/health_medicine/~3/_BquMTCmMTk/140129165409.htm", "content": "New research from Karolinska Institutet in Sweden shows that medication used to treat ADHD in adult men can save lives on the road. According to a large registry study, which is now being published in the scientific journal JAMA Psychiatry, up to half of the transport accidents involving men with ADHD could be avoided if the men were taking medication for their condition. The researchers have studied 17,000 individuals with ADHD over a period of four years (2006-2009) using various population health' registers. They were then able to analyse the risk of transport accidents for individuals diagnosed with ADHD and how ADHD medication influence this risk. In line with previous research in this area, the results from the current study demonstrate that individuals with ADHD have an approximately 45 per cent increased risk of being involved in serious transport accidents, such as car or motorcycle accidents, compared to individuals without ADHD. \"Even though many people with ADHD are doing well, our results indicate that the disorder may have very serious consequences,\" says <mark>Henrik Larsson</mark>, associate professor at the Department of Medical Epidemiology and Biostatistics. Our study also demonstrates in several different ways that the risk of transport accidents in adult men with ADHD decreases markedly if their condition is treated with medication. \"To begin with, the incidence of transport accidents was lower among men with ADHD who received medication than among men with ADHD who did not. When the men were compared to themselves, i.e. during periods with and without ADHD medication, the researchers were able to establish that pharmaceutical treatment involved a significantly lower risk of transport accidents; during the periods of ADHD medication the risk was 58 per cent lower. Comparing the individuals to themselves is one of the study's strengths as it demonstrates that the connection between medication and decreased accident risk is probably not due to differences between individuals. Further statistical calculations showed that 41 per cent of the transport accidents involving men with ADHD could have been avoided if they had received medication for the entire follow-up period. This study, which has now been published, does not explain the specific mechanisms behind the effect of ADHD medication on accident risk. However, the researchers believe that the results may be explained by ADHD medication having an effect on the core symptoms of ADHD such as impulsiveness and distractibility, which in turn reduces the risk of getting into trouble on the road .\" Despite having shown that medication for ADHD very likely reduces men's risk of transport accidents, we could not establish a similar reduction in women's accident risk, \"says <mark>Henrik Larsson</mark>.\" We need further data to be able to comment about the effect on women with statistical certainty. It is also important to point out that most pharmaceutical treatments carry a risk of side effects. The risks must be weighed against the benefits for every individual prescription, taking into account the individual patient's situation. \"About five per cent of all school children and half as many adults suffer from ADHD, which is characterised by lack of attention, concentration difficulties and impulsiveness. Research has shown that ADHD is a relatively stable disorder and many of those who have been diagnosed with ADHD as children also meet the diagnostic criteria as adults. People with ADHD can be treated with medications such as central nervous system stimulants that affects the brain and thereby improve attention and impulse control. Story Source: The above story is based on: <mark>Zheng Chang</mark> Z, <mark>Paul Lichtenstein</mark>, Brian M. D'Onofrio, Arvid Sj? lander and <mark>Henrik Larsson</mark>. Karolinska Institutet .\" ADHD medication saves lives on the road. \"ScienceDaily. ScienceDaily, 29 January 2014. Karolinska Institutet. (2014, January 29). ADHD medication saves lives on the road. ScienceDaily. Retrieved January 30, 2014 from www.sciencedaily.com/releases/2014/01/140129165409.htm Detailed Look at HIV in Action: Researchers Gain a Better Understanding of the Virus Through Electron Microscopy Up Close and 3-Dimensional: HIV Caught in the Act Inside the Gut Childhood Depression May Increase Risk of Heart Disease by Teen Years Researcher Turns Sights on Prostate Cancer, Tissue Engineering, Blood Vessel Repair Sex-Specific Patterns of Recovery from Newborn Brain Injury Revealed by Animal Study More Than One-Third of Women Have Hot Flashes 10 Years After Menopause Does Caregiving Cause Psychological Stress? It Depends, Says Study of Female Twins Reuters - Innovations Video Online (Jan. 30, 2014) - Infant Warmer Created to Save Lives in Developing Countries Nov. 22, 2013 - New study reports that half of U.S. children diagnosed with ADHD received that diagnosis by age 6. The study found that an estimated two million more children in the United States (U.S.) have been Apr. 9, 2013 - Teachers in the Republic of Ireland consistently view medication treatment for Attention deficit hyperactivity disorder (ADHD) as a last resort, even when they view the disorder as biologically Nov. 22, 2012 - Criminal behaviour in people with ADHD (attention deficit hyperactivity disorder) dropped sharply during periods when they were on medication, according to a new extensive registry Study Evaluates Treating Mothers With ADHD to Improve Outcomes in Kids Oct. 17, 2012 - Researchers are conducting a study to determine if treating mothers with Attention Deficit Hyperactivity Disorder--either with medication or parent training--will help children at risk for Synergy Between Behavioral and Pharmacologic Interventions for ADHD Exclusive: Bloomberg tapped to be U.N. cities, climate change envoy - sources Terms of Use Copyright 2013 by ScienceDaily, LLC or by third-party sources, where indicated. All rights controlled by their respective owners. Content on this website is for informational purposes only. It is not intended to provide medical or other professional advice.", "articleID": "2014013113_00039500_W", "names": {"Paul Lichtenstein": ["Q27527282", "Q56460588"], "Zheng Chang": ["Q45408829", "Q45486719", "Q45502031", "Q45502099", "Q45504465", "Q45521819", "Q45528163", "Q45535644", "Q45536920", "Q45549832", "Q45555842", "Q45556765", "Q45586671", "Q45622185", "Q45634960", "Q45636824", "Q50790722", "Q8070709"]}}, {"date": "2014-02-02", "url": "http://www.sugarscape.com/main-topics/book-club/1015678/author-richelle-mead-talks-turning-vampire-academy-book-movie-watch", "content": "What you think of this Article...The suck at school Nobody is a bigger fan of the Vampire Academy series than author Richelle Mead, mainly because she wrote it. But if you're a big fan of the books and are a bit worried about any changes they might have made to the storyline while making the movie then it sounds like you don't need to worry as Richelle reckons it's even bigger and better than its inspiration. With Zoey Deutch taking on the role of ass-kicking dhampir guardian Rose, we never had to worry about it not being hilarious, but apparently Richelle reckons that fans are still in for a few surprises, even if they think they know the story inside out. \"It just blows me away to see what <mark>Mark Waters</mark> and the rest of the team working on the movie can do,\" she explained. \"When I read [the script] I just felt like everything I had done was in there. The humour is there - he wrote lines that are funnier than mine. I was kind of jealous!\" Check out what else Richelle has to say about the movie below...WE CAN'T WAIT. Can you? Comments please...Sarah Hyland talks getting beaten up for Vampire Academy: \"If I didn't come out bruised and bleeding, I wasn't doing my job' Sarah Hyland talks being BFFs with Taylor Swift:\" People have a preconceived idea about her' Theo James, Kate Winslet and Shailene Woodley talk factions behind the scenes on the Divergent set - WATCH Zoey Deutch and Lucy Fry introduce the brand new trailer for Vampire Academy - WATCH Zoey Deutch and Lucy Fry kick butt in two brand new clips from Vampire Academy - WATCH Vampire Academy debuts brand new movie clip full of girl fights and fang flashing - WATCH Dawn O'Porter: \"Any girl who goes out with Harry Styles is going to get loads of grief. Taylor Swift is awesome' Delirium trilogy author Lauren Oliver on making TV shows with <mark>Emma Roberts</mark> and new book Requiem Just how posh are the Made in Chelsea cast? <mark>Andy Jordan</mark>, Fran Newman-Young and Cheska Hull are put to the test - WATCH <mark>Elizabeth Banks</mark> reads aloud her favourite Effie Trinket scenes from Catching Fire - WATCH <mark>Andy Jordan</mark> tests Cheska and Fran's Made In Chelsea knowledge:\" If we were p *** ing off Lucy Watson, what would we be doing? \"Lucy Fry sucks Zoey Deutch's blood in brand new Vampire Academy: Blood Sisters trailer - WATCH Author <mark>John Green</mark> goes behind the scenes on The Fault In Our Stars movie with Shailene Woodley and Ansel Elgort - WATCH Jennifer Lawrence reveals Hunger Games: Catching Fire book to film story changes Divergent author Veronica Roth: Allegiant will be told from two points of view <mark>Michael Grant</mark> live interview stream - submit your questions here! Fall Out Boy take The Stupid Interview and indulge Patrick Stump's armpit fetish The Raven Boys author Maggie Stiefvater on psychics, the supernatural and new book The Dream Thieves Between Shades of Gray author Ruta Sepetys on hanging out with mobsters, brothel Madams and new book Out of the Easy", "articleID": "2014020302_00004457_W", "names": {"Andy Jordan": ["Q16239016", "Q22278438", "Q4760868"], "Elizabeth Banks": ["Q219373", "Q47295776"], "Emma Roberts": ["Q228598", "Q41070739", "Q56187743", "Q56187744"], "John Green": ["Q10451726", "Q16196962", "Q19560608", "Q20646280", "Q20707695", "Q50282022", "Q56597706", "Q6236145", "Q6236157", "Q6236167", "Q630446"], "Mark Waters": ["Q42786460", "Q471552", "Q6770245"], "Michael Grant": ["Q1719607", "Q1752975", "Q18686452", "Q56026228", "Q57428184", "Q6830728", "Q6830729", "Q6830732"]}}, {"date": "2014-02-04", "url": "http://www.prisonplanet.com/soros-corporate-group-predicts-terrorism-at-winter-olympics.html", "content": "Internationalist group believes threat may not come from Muslim North Caucasus region February 4, 2014 The International Crisis Group (IGC) is predicting a terrorist attack in Sochi during the Winter Olympics. The NGO has issued a report, \"Too Far, Too Fast: Sochi, Tourism and Conflict in the Caucasus,\" analyzing the potential for violence at the games. CIA mouthpiece Voice of America predicts terror at games. \"We hope that everything will be fine and safe, but the possibility of a terrorist attack remains,\" said Sokiryanskaya said Russian authorities believe a threat may come from the Muslim North Caucasus republic of Dagestan where an insurgency is currently underway against Russian control of the region. The IGC, however, believes threats against the games may arise elsewhere in the region from Muslims more difficult to distinguish among non-Muslim natives. \"Radicals can come from any region of Russia,\" Sokiryanskaya said. Although Russian officials have introduced what is described as unprecedented security following a terrorist attack in the southern city of Volgograd in December, The Boston Globe reported on Tuesday security is lax in Sochi. Despite questions about Russian security, Thomas Bach, the president of the International Olympic Committee, said at a briefing that \"we have confidence with the Russian authorities .\" The IGC, a non-government organization that supported the so-called \"humanitarian intervention\" in Kosovo, was founded by members of the internationalist Carnegie Endowment for International Peace and the World Bank. It is funded by governments and corporate foundations. Its advisory board is dominated by Chevron, Shell and other transnational corporations. George Soros, chairman of the Open Society Institute, sits on the IGC board of trustees. Soros has established foundations in Czechoslovakia, Poland, Yugoslavia, and Russia and is directly implicated in U.S. Identifies Terror Group Threatening Attacks on the Olympics Russia planning \"near-total surveillance' of visitors, athletes at Sochi Winter Olympics Terror\" Surprise' for Sochi Olympics? Purported Suicide Bombers' New Threat Volgograd Bombings: CIA's Chechen Assets Attack Russia Ahead of Winter Olympics Christian Singer Walks Out on Grammys After \"Satanic' Performances Black students ask University to stop using racial descriptions in crime alerts Police Fail to Stop Violent Attack Just Outside Police Station Chief of Police Harassed by Feds, Fired After Signing Pledge to Uphold Constitution Monday: The Nightly News. Epic Fails Of The Super Bowl Police State. Media Infiltration With Super Bowl Truther Matthew Mills. Monday: The <mark>Alex Jones</mark> Show. Let Freedom Of Speech Ring! Man Infiltrates The Super Bowl With 9/11 Truth. Plus, Jesse Ventura: The Eyes Of The World Are Upon Us. Sunday: The <mark>Alex Jones</mark> Show. Super Bowl: The Largest Media Event In The World, The Super Bowl Is A Super-Distraction. Plus, Tax Exempt NFL Robs The American People. Friday: The Infowars Nightly News. Confessions Of A Disillusioned TSA Agent Hit The Pages Of New York Times & Politico. Plus, Mass Transit Seen As Largest National Security Risk During Super Bowl Frenzy. Friday: The <mark>Alex Jones</mark> Show. Super Bowl Fans Want TSA Administered Proctology Exams. Plus, The Roots Of Communism & America's Descent Into Tyranny With Joel Skousen. Thursday: The Infowars Nightly News. Chief of Police Harassed by Feds, Put On Administrative Leave After Signing Pledge to Uphold Constitution. Plus, Kelly Thomas Aftermath: Cops Laughed About Having License to Kill. Thursday: The <mark>Alex Jones</mark> Show. Immigration Reform Bill Spells The End Of The Republican Party As It Exists. Plus, Infowars Reporter Jakari Jackson Touches Down At Superbowl Stadium Ahead Of The Gladatorial Spectacle. Wenesday: The Infowars Nightly News. Obama Promises To Enact Gun Control Laws\" With Or Without Congress \"Plus, CNN Poll: 67% Oppose Obama's Executive Agenda. Wednesday: The <mark>Alex Jones</mark> Show. The End Of Pure Humans By The Hand Of The Globalist Technocratic Take Over. Plus, Economic Takedown With Trends Forecaster Gerald Celente. Tuesday: The Infowars Nightly News. Obama Using Executive Orders With Increasing Frequency During His\" Year Of Action. \"Plus, Our Live Round Table Session As We Simulcast Tonight's State Of The Union Address. Monday: The Infowars Nightly News. Obama to Assert Unilateral Agenda. Plus, CFR Calls On Obama to\" Befriend' Al-Qaeda Terrorist Group. Monday: The <mark>Alex Jones</mark> Show. Obama Quiets Dissent By All Means Necessary. Plus, Project Veritas Founder and Author of \"Breakthrough\" <mark>James O'Keefe</mark> discusses deeply offensive comments made by members of Battleground Texas. Sunday: The <mark>Alex Jones</mark> Show. Political Dissent Crackdown. Plus, Obama Openly Usurps The United States Congress While Single Handedly Destroying The Economic System Of The United States. Friday: The <mark>Alex Jones</mark> Show. Rebroadcast - Obama Furthers Military-Industrial Complex on the 53rd Anniversary of Eisenhower's Warning To The Nation. Thursday: The Infowars Nightly News. Harvard Professor Warns of \"Devastating\" China-Japan War. Plus, Al-Qaeda: The Best Enemy Money Can Buy. Thursday: The <mark>Alex Jones</mark> Show. History Does Not Repeat Itself, But It Does Rhyme. The Parallels Between Pre WWI 1914 and Today. Monday: The Nightly News. Epic Fails Of The Super Bowl Police State. Media Infiltration With Super Bowl Truther Matthew Mills. Monday: The <mark>Alex Jones</mark> Show. Let Freedom Of Speech Ring! Man Infiltrates The Super Bowl With 9/11 Truth. Plus, Jesse Ventura: The Eyes Of The World Are Upon Us. Sunday: The <mark>Alex Jones</mark> Show. Super Bowl: The Largest Media Event In The World, The Super Bowl Is A Super-Distraction. Plus, Tax Exempt NFL Robs The American People.", "articleID": "2014020501_00037762_W", "names": {"Alex Jones": ["Q16235485", "Q19559933", "Q20666729", "Q26330355", "Q2641401", "Q319121", "Q47113851", "Q4717247", "Q4717250", "Q4717251", "Q4717252", "Q4717253", "Q4717255", "Q50365540", "Q5665987"], "James O'Keefe": ["Q6140497", "Q6140500"]}}]