[{"articleID": "2009091311_00013127_W", "names": {"Robert Shapiro": ["Q446561", "Q7349716", "Q7349717"], "Karen Shaw": ["Q29643587", "Q50414262"]}, "date": "2009-09-13", "url": "http://wral.com/news/political/story/5990002/", "content": "avoiding the abyss: success without glory by jim kuhnhenn associated press writer washington - halting the financial sector's death plunge is arguably the government's most measurable achievement this year. yet as president barack obama observes the one-year anniversary of lehman brothers' collapse, his administration's increasingly sunny assessment of wall street's rebound faces a hard sell. the rescue effort, initiated by his predecessor, was expensive, and it bailed out the very institutions that the public blames for the crisis. small banks are still failing, the institutions once considered too big to fail are putting on weight once again, and obama's main pledge - a more watchful eye on wall street - hasn't taken hold in congress. what's more, it's hard to cheer for wall street when unemployment is rising, foreclosures have not abated and bankers lobby for bigger paychecks. obama on monday plans a speech in new york assessing the condition of the financial markets. his treasury secretary, timothy geithner, previewed the administration's upbeat line this past week. \"the emerging confidence and stability of september 2009 is a far cry from the crippling fear and panic of september 2008,\" geithner told a congressional watchdog panel thursday. <mark>robert shapiro</mark>, a former adviser to president bill clinton and now chairman of sonecon, an economic advisory firm, said the administration gets \"a very good grade for addressing the acute problem, but this is so far from over .\" economists and banking analysts largely agree that after the failure of lehman brothers a year ago, the financial system was on the edge of a precipice. among the steps generally credited for stabilizing the system are the federal reserve's slashed interest rates and trillions in increased bank liquidity; the $700 billion troubled asset relief program that president george w. bush initiated and obama pursued; and tests that obama's treasury administered to determine whether the biggest banks had enough access to money to withstand a further economic downturn. \"the consensus is that we're off the brink. we were certainly on it,\" said <mark>karen shaw</mark> petrou, managing partner of federal financial analytics in washington. while the financial sector is no longer in a panic and many signs point to a recession that is on the mend, the public remains doubtful about their own financial status. a pew research center poll last month found that slightly more than half of those surveyed said the condition of the economy was poor. nearly two out of five said the economy was \"only fair .\" people questioned in august were more pessimistic about their own financial situation than those surveyed in june. no wonder. despite some easing of credit, bank lending remains tight. the treasury department, citing analysts' projections, said more than 6 million families could face foreclosure over the next three years. so far this year, 89 banks have failed, crippled by increasing loan defaults. bigger banks that received billions of dollars from the recovery program are beginning to pay back the money. they are on more solid footing and want to get out from under government restrictions. but even they are relying on extraordinary measures by the fed and the federal deposit insurance corp. \"the fact that some of the biggest banks are not failing is a triumph of very low expectations,\" petrou said. while lawmakers and regulators warn about the hazards of having financial institutions that are too large and intertwined, some institutions have emerged from the financial crisis larger than before. aided and prodded by the government last year, jpmorgan chase & co.bought bear stearns, bank of america corp. was forced to buy merrill lynch & co., and wells fargo & co. acquired wachovia. as of june 30, those three banks held $2.3 trillion in domestic deposits, or $3 out of every $10 in deposit in the united states. three years ago those three institutions held about 20 percent of the industry total. the danger is that large institutions that engage in high-risk ventures could require extraordinary government help to keep them from toppling the entire financial system. that's what the government had to do with american international group inc., the giant insurance company that received nearly $70 billion in bailout money. to avoid that, obama has recommended a series of regulatory changes, including new oversight powers for the fed, increased capital requirements for institutions and other conditions designed to discourage companies from getting too big. but congress has yet to act and some of obama's proposals are meeting resistance within his own party. the public for now is far more focused on the debate over health care to pay attention to the need for restrictions on derivatives and other complex financial instruments. while high wall street salaries and bonuses have caused a sensation, a recent cbs poll shows the public split on whether the government should place restrictions on executive pay. for obama, the blend of success, lingering financial and economic troubles and mixed public sentiment presents a political conundrum. for now, he has time on his side - at least until next year's congressional election campaigns begin in earnest. \"ultimately the public judges presidents and congresses not on whether or not they like a particular policy, but on whether or not the policy has a result they like,\" <mark>shapiro</mark> said. \"if it succeeds, the public will be fine, he will be fine, the democrats will be fine. and if it doesn't, they're all in trouble .\" welcome to golo, where wral.com visitors can comment on stories and create profile pages, blogs and photo galleries. make this story a golo hot topic! this story is 2 votes short of making the electrician and wake technical community college instructor steve windham answers your questions about keeping your home's power running. 10 questions about n.c. wildlife n.c. wildlife commission chairman steve windham answers your questions about the future of hunting and the state's wilderness areas. photos: pops in the park the north carolina symphony's pops in the park concert. sept. 11 observances drawing on the spirit that spurred emergency responders to rush to the burning world trade center on sept. 11, 2001, americans looked for ways to...a year of n.c. drought maps view a time lapse animation of drought conditions during the last year. a yellow lunch box tours n.c. follow wral news photographer richard adkins and his yellow lunch box as they tour north carolina, seeking out the best places for lunch."}, {"articleID": "2010122419_00085616_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"]}, "date": "2010-12-24", "url": "http://philly.com/r?19=961&43=356979&44=112433384&32=3796&7=368304&40=http%3A%2F%2Fwww.philly.com%2Fphilly%2Fblogs%2Finq-eagles%2FVick_reflects_on_holidays_Would_pick_self_as_MVP.html", "content": "two years ago, michael vick spent his second straight christmas at leavenworth federal prison in kansas. the eagles quarterback was asked on the eve of christmas to reflect on those dark times in light of the great success he has had on the football field this season. \"i'm just blessed to be here,\" vick said friday. \"i spent two christmases in kansas and that was by far the toughest thing i ever had to do. i think each and every year i always reflect on that and i think it will always make the holiday season more gratifying .\" vick was also asked what was his favorite christmas toy that he received as a child. \"by far, the nintendo,\" vick said. \"i got that when i was ten years old and i got mine kind of late. my friends had got theirs like two years before ....when i got it that thing was sacred. it was a good thing because it kept me in the house about two years straight .\" vick's play has generated a lot of talk about a possible mvp award for the eagles quarterback. many see vick and patriots quarterback <mark>tom brady</mark> as the two leading candidates. vick was asked to pick a winner. \"why would you ask me that?\" he joked. well, to put you on the spot. \"if you put me on the spot,\" vick said, \"i would pick myself .\" vick was also asked to look ahead at a possible nfc championship showdown that would pit the eagles against the falcons in atlanta and vick against his former team. \"i think it would be a great, storybook ending to close that chapter finally,\" vick said. \"i think it would also be a great game. it would be fun and competitive on both sides. it would bring the best out of both sides, both teams. that would be awesome. that would be great .\" because your contributions are currently under review, no comments can be made at this time. philly.com comments are intended to be civil, friendly conversations. please treat other participants with respect and in a way that you would want to be treated. you are responsible for what you say. and please, stay on topic. if you see an objectionable post, please report it to us using the \"report abuse\" button. about your comments: these comments are monitored by philly.com staff. we reserve the right at all times to remove any information or materials that are unlawful, threatening, abusive, libelous, defamatory, obscene, vulgar, pornographic, profane, indecent or otherwise objectionable. personal attacks, especially on other participants, are not permitted. we reserve the right to permanently block any user who violates these terms and conditions. according to our terms of service, you are not yet of legal age to be able to contribute to this site. thank you for registering! please note that your registration will not be considered fully complete until you confirm by following the link we have provided in a confirmation email that was just sent to jeff mclane (left) began covering the eagles in april 2009 after covering college sports and penn state football in particular. before that he wrote about high school sports and before that he worked in the mailroom (not quite). find jeff on twitter for instant updates on the eagles. jonathan tamari (right) began covering the eagles in april 2010. he previously covered new jersey state government and politics, reporting and writing about elections, policy debates and the many personalities that drive the garden state, from three recent governors to the many musicians bidding to write the state song. he has been at the inquirer since june 2008. follow him on twitter at"}, {"articleID": "2017122021_00496145_W", "names": {"David Lynn": ["Q1175360", "Q28155105", "Q5236858", "Q58003126"], "Julie Duncan": ["Q39127284", "Q53353478"]}, "date": "2017-12-20", "url": "http://onlineathens.com/local-news/2017-12-20/possible-changes-clayton-street-contentious-topic-some", "content": "lee.shearer @ onlineathens.com Possible changes to Clayton Street contentious topic for some Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) A surveyor at work in College Square in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Cars move down Clayton Street in Athens, Ga.. Monday, Dec. 18, 2017. (Photo/Joshua L. Jones, Athens Banner-Herald) Some downtown business owners say they're being left out of the planning process as the Athens-Clarke County government gets ready for a major facelift for three downtown blocks of Clayton Street along with intersecting sections of North Jackson and Wall streets. Athens Downtown Development Authority co-director <mark>David Lynn</mark> wants to fast-forward a part of the project, which includes underground changes such as storm-sewer improvements as well as above-ground changes, which may include moving curbs further out from buildings to have wider sidewalks, reducing Clayton Street to three lanes from its present two, while preserving angle parking. Angle parking allows for more cars to park than parallel parking on the side of a street. \"We're trying to reduce the pain (of street construction during busy retail shopping seasons),\" <mark>Lynn</mark> told Athens-Clarke County Commissioners in the board's agenda-setting meeting Tuesday. The sooner the project can get going, the more likely it is that disruptive construction won't spill over into more busy fall or holiday shopping season, he said. The infrastructure and streetscape project is a continuation of earlier work down on Clayton Street toward its end on Pulaski Street. But officials should share more about the plans and allow for more public discussion before embarking on changes that could actually threaten some businesses' abilities to survive, according to business owners who spoke to commissioners. \"It's a slap in the face of the business owners,' said Frontier owner Devin Clower .\" I do think rushing it is not a good idea, \"said another business owner .\" I think a lot of citizens would like to have input and certainlly some of the merchants are concerned, \"said another speaker, <mark>Julie Duncan</mark>.\" Would it hurt to have one public input session? I don't see the harm, \"said an owner of a downtown building, Russell Edwards. More public input might elicit more creativity in the streetscape part of the project, Clower said. But beginning work earlier on the infrastructure portion of the project would still leave ample time for input into what it will look like, <mark>Lynn</mark> said. He said he'd talked to a number of business owners already. Some commissioners were sympathetic to the business owners' complaints .\" Downtown is the economic and cultural heart of this city. To not reach out to them is unconscionable, \"said District 3 Commissioner Melissa Link. Commissioners asked county administrators for more information before the commission's upcoming voting meeting next month. In a $109.5 million transportation sales tax approved by voters last month, about $7.1 million is earmarked for downtown Athens projects, such as improvements to Clayton Street."}, {"articleID": "2010100818_00478005_W", "names": {"Li Liangshi": ["Q45446826", "Q45514869"]}, "date": "2010-10-08", "url": "http://onearth.org/onearth-blog/china-us-cooperate-in-race-to-deploy-advanced-coal-technology", "content": "coral reefs are trying to tell us something: we must break our addiction to fossil fuels tianjin, china--though chinese workers this week celebrated the 61st anniversary of the founding of the peoples republic of china, a holiday season as significant as july 4 in the united states, a swarm of construction laborers at china's greengen coal-fired gasification power plant were busy welding pipes, fitting massive joints, and bending steel for forms to be filled with concrete. since construction on the $1 billion project began in june 2009, said <mark>li liangshi</mark>, the deputy chief engineer, the dusty construction site has been a nonstop 24/7 hive of activity for 2,100 workers. next year, the consortium of companies financing the project, five of them chinese plus peabody coal, an american producer, plan to start operations. greengen's principle purpose is demonstrating advanced chinese technology to burn coal much more efficiently than conventional power plants, remove many other troubling air pollutants, and prove that its climate-changing carbon emissions can be safely captured. much of the sequestered carbon will be pumped into oil wells to increase production in one of the china's mature oil fields. \"china has a lot of coal,\" said deborah seligsohn, the principal advisor of the world resource institute's china climate and energy program, who joined a clean air task force/uscan-sponsored tour of the plant on thursday. \"this project deals with efficiency and pollution abatement in a fairly clean way .\" outside stalled negotiations, promising steps this week the un climate negotiations inside the expansive meijiang convention and exhibition center here have been stymied, in large part by a dispute between china and the united states about how those two countries take action to combat climate change and how they will measure progress toward those ends. outside the closed negotiating sessions, a series of side events convened by ngos and governments, have detailed the progress, some of it quite impressive, that both countries are making to advance clean technology and energy efficiency that are intended to simultaneously build economic vibrancy while lowering carbon emissions. in some cases, chinese and american companies are cooperating on clean energy and efficiency projects. greengen illustrated both the competition and cooperation between china and the u.s. to develop the tools and technology to burn coal more efficiently, and to safely dispose of its dangerous emissions. in terms of investment and the number of projects, the u.s. and china are both working to perfect the technology, design and deploy the equipment, and command the potential multi-billion dollar annual market for what both countries call \"clean coal\" power, but more accurately can be called \"advanced coal .\" greengen will test gasification technology developed by china's thermal power research institute (tpri). tpri has licensed the gasification technology deployed at greengen to houston-based future fuels llc. future fuels plans to use the technology at its good spring igcc project in pennsylvania, which it expects will deliver 270-megawatts of electricity while capturing over 50 percent of the co2 output initially and nearly 100 percent by 2020. coal in the china, u.s. path to lower carbon future coal's influence in both countries on climate change is significant. the u.s. environmental protection agency reported last year that coal combustion at american utilities accounts for 2.7 billion tons of the roughly 6 billion tons of annual u.s. carbon emissions. in rapidly developing china, coal accounts for 80 percent of the 6.3 billion tons of carbon emissions, or about a quarter of all the climate-changing emissions globally. both governments, along with utilities and manufacturers see the need to reduce coal's influence on global warming, and an opportunity to build economic strength in reaching that goal. last november, during a trip to china, president obama and chinese president hu jintao formally announced the establishment of a joint clean energy research center to collaborate on the science and development of low-carbon energy, and to cooperate specifically on generating energy from coal with much less pollution. in march, steven chu, the american secretary of energy, announced that over the next five years the energy department would invest $37.5 million in the joint center to support research conducted at a facility in the u.s. and another in china. the united states, according to the department of energy, also is spending $3.4 billion to leverage $8 billion more in private investments to build a national array of plants that demonstrate ccs technology, and that showcase new combustion techniques. advanced coal projects they include the $1 billion u.s. investment, just announced in september, for futuregen, to build a high-tech oxygen equipped coal boiler unit to an existing 200-megawatt unit at an american energy resources plant in meredosia, illinois, and then deploy ccs technology to sequester the carbon emissions. the doe also just approved a $308 million investment in a $2.8 billion kern county, california plant to develop cleaner combustion technology and carbon sequestration techniques. other investments include $350 million toward a $1.7 billion a state of the art integrated gasification combined cycle (igcc) plant with carbon emissions directed to producing more oil in old wells in texas, and $36 million for a $2.15 billion igcc plant in minnesota. private igcc plants are under development in indiana and pennsylvania as well, and the duke power plant in indiana is testing ccs storage techniques. recent study by the brookings institution u.s. and chinese companies are collaborating on a number of projects. in august 2009, duke energy signed a memorandum of understanding with huaneng for developing renewable and clean energy technologies. in september 2009, southern company and kbr inc. agreed to license their igcc technology to the beijing guoneng yinghua clean energy engineering company. peabody coal is an investor in the greengen project. huaneng joined the futuregen industrial alliance. here in tianjin, the greengen project is at the head of a pack of chinese power plants designed to burn coal more efficiently and to develop and prove ccs techniques. china has built over 20 supercritical and ultra-supercritical power plants that operate at extremely high water temperatures and pressures that produce much higher efficiencies, producing more power with less coal, and thus lower emissions per megawatt of power generated. according to the world resources institute, china has developed and approved seven major energy projects to demonstrate ccs techniques, and to develop more efficient energy generating practices. they include the 845-megawatt huaneng gaobeidian co-generation plant in beijing, the first in china to fully test co2 capture, and features a full suite of environmental controls. during winter months, steam from the plant is used for district heating, and efficiency can be has high as 84 percent. engineers estimate the plant uses about 400,000 tons less coal annually than a similarly-sized conventional plant. greengen could be big step greengen represents the next step in china's drive for higher efficiency and lower pollution in generating power from coal. when the first of three phases opens next year, greengen will be the first utility-scale igcc power plant in china, and one of the few operating in the world. when fully operational in 2014, chinese officials assert, greengen will generate 650-megawatts at 60 percent to 80 percent efficiency - about twice the efficiency of conventional coal-fired power plants - and dispose of its climate-changing emissions through carbon capture and storage (ccs) technology. some of the emissions will be pumped into wells and used to increase oil production in one of china's older oil fields, which is close by. if the plant is a success, said jiang kejun, a director of research for the energy research institute, a unit of the national development and reform commission, china is prepared to build 20 more such gasification and ccs power plants. \"we want to make sure it works,\" he said. in tianjin, china and the u.s. similarities overshadow differences china's first u.n. climate conference explores urgency, stirs fresh hope for climate progress more from nrdc jake schmidt's blog: what needs to be accomplished at the china international climate negotiation session? keith is a former national correspondent and regular contributor to"}, {"articleID": "2017050920_00448071_W", "names": {"Brian May": ["Q15873", "Q45923599"]}, "date": "2017-05-09", "url": "http://www.wusa9.com/news/local/hurricane-awareness-tour-comes-to-dc/438233685", "content": "Hurricane Awareness Tour Comes to DC Howard Bernstein, WUSA 4:48 PM. EDT <mark>May</mark> 09, 2017 This NOAA image shows Hurricane Matthew in the Caribbean Sea heading towards Jamacia, Haiti and Cuba on October 3, 2016. (Photo by NOAA via Getty Images) (Photo: Handout, 2016 NOAA) CONNECT TWEET LINKEDIN GOOGLE + PINTEREST WASHINGTON (WUSA9) - Hurricanes are the largest and most destructive storms on Earth. With hurricane season starting in just a few weeks, The National Hurricane Center's Hurricane Awareness Tour was in town on a mission to help residents of the Mid-Atlantic be more prepared. It was field day at the Reagan National as the \"Hurricane Hunters\" spent the day talking about their mission and hurricane safety. School groups and the general public toured these special planes that fly into the eye of the storm. Colonel <mark>Brian May</mark> is one of the pilots that flies these missions, \"It's like riding a roller coaster through a car wash, it really is. You're getting bounced around, we can drop, we can hit a down draft and lose 1500 feet like that .\" Hayden Buell was on a field trip today learning about the threat from tropical systems, \"It's very important for the hurricane hunters to go inside of hurricanes and warn people, otherwise a lot more people would get injured by Hurricanes .\" The scientists that fly into the storms collect data critical in forecasting the track and intensity of tropical systems that make for better forecasts and better planning by emergency personnel. Dr. Rick Knabb is the Director of the National Hurricane Center, \"The good thing about hurricanes is that they don't impact severely any one community very often, when they do it's really bad. and if you haven't prepared in advance and you're just wishing the hurricane problem away, you're putting yourself in a position of weakness. Wind and water are both hazards that can affect the Washington area. If you get a strong enough hurricane coming ashore, you could get hurricane force winds here, storm surges can be pushed up the Chesapeake and up the Potomac. heavy rainfall can cause flooding near the coast and well inland .\" Colonel <mark>May</mark> appreciates the seriousness of what and his team do, \"we understand the information that we're collecting to help with that cone of uncertainty and the model predictions that the hurricane center puts out. . it's just too valuable, too important. Obviously there's inherent risks in flying, but we take what we do very serious...very safety conscience .\" The Hurricane Hunters Have 10 WC-130s in their fleet. In the Atlantic Basin, as dangerous as the mission is, they've never lost one. The last time a plane was lost was was October 12, 1974 when a \"Typhoon Tracker\" out of Guam was lost. The plane was flying out of the Philippines and was lost while trying to get a second fix on Typhoon Bess. © 2017 WUSA-TV"}, {"articleID": "2014040408_00056784_W", "names": {"Christopher C. Witt": ["Q28735318", "Q53953377"], "Douglas L. Altshuler": ["Q28735315", "Q46352885"], "Robert Dudley": ["Q21453070", "Q22109978", "Q421864", "Q57408339", "Q57548145"]}, "date": "2014-04-03", "url": "http://www.sciencedaily.com/releases/2014/04/140403132207.htm", "content": "from universities, journals, and other organizations The first comprehensive map of hummingbirds' 22-million-year-old family tree--reconstructed based on careful analysis of 284 of the world's 338 known species--tells a story of rapid and ongoing diversification. The decade-long study reported in the Cell Press journal Current Biology on April 3 also helps to explain how today's hummingbirds came to live where they do. Part of the secret to the birds' remarkable success lies in the formation of nine principal groups or clades, hummingbirds' unique relationship to flowering plants, and the birds' continued spread into new geographic areas, the researchers say. \"Hummingbirds have essentially been reinventing themselves throughout their 22-million-year history,\" says Jim McGuire of the University of California, Berkeley. While all hummingbirds depend on flower nectar to fuel their high metabolisms and hovering flight, coordinated changes in flower and bill shape have helped to drive the formation of new species of both hummingbirds and plants. Remarkably, as many as 25 hummingbird species are able to coexist in some places. \"One of the really cool features of hummingbird evolution is that they all eat the same thing yet have diversified dramatically,\" McGuire says. \"It really is a big surprise that hummingbirds have divided the nectarivore niche so extensively .\" The new, time-calibrated evolutionary tree shows that ancestral hummingbirds split from the swifts and treeswifts about 42 million years ago, probably in Eurasia. By about 22 million years ago, the ancestral species of all modern hummingbirds had made its way to South America, and that's when things really took off. The Andes Mountains are a particular hotspot for hummingbird evolution, because diversification occurred along with the uplift of those peaks over the past 10 million years. About 140 hummingbird species live in the Andes today. The availability of new land areas in North America and the Caribbean has also played an important role in the evolution of new hummingbird species. For example, McGuire says, the bee hummingbirds colonized North America about 5 million years ago and consequently experienced rates of speciation that rival textbook examples of adaptive radiation. The new picture of the birds' past is an important step toward understanding how they have adapted to novel environments, like those found at low-oxygen, high-altitude mountain peaks. It also points to an exciting future. \"Our findings strongly indicate that hummingbirds remain engaged in a dynamic diversification process, filling available ecological and spatial niches across North America, South America, and the Caribbean,\" the researchers write. \"Thus, the dramatic radiation of this unique avian lineage is far from complete .\" Story Source: The above story is based on: Jimmy A. McGuire, <mark>Christopher C. Witt</mark>, J.V. Remsen, Ammon Corl, Daniel L. Rabosky, <mark>Douglas L. Altshuler</mark>, <mark>Robert Dudley</mark>. Cell Press. \"Hummingbirds' 22-million-year-old history of remarkable change is far from complete .\" ScienceDaily. ScienceDaily, 3 April 2014. Cell Press. (2014, April 3). Hummingbirds' 22-million-year-old history of remarkable change is far from complete. ScienceDaily. Retrieved April 3, 2014 from www.sciencedaily.com/releases/2014/04/140403132207.htm Computer Models Soybean Crop With 8.5 Percent More Productivity, Using 13 Percent Less Water Sage Grouse Losing Habitat to Fire as Endangered Species Decision Looms Cave-Dwelling Fish Examination Finds Possible Genetic Link to Human Disorders Hummingbirds' 22-Million-Year-Old History of Remarkable Change Is Far from Complete WebMD Survey Says Most Doctors Believe Medicinal Weed Works Hummingbird Metabolism Unique in Burning Glucose, Fructose Equally Bird Fossil Sheds Light on How Swift and Hummingbird Flight Came to Be High-Speed Video and Artificial Flowers Shed Light on Mysteries of Hummingbird-Pollinated Flowers June 1, 2012 - The glacier lily as it's called, is a tall, willowy plant that graces mountain meadows throughout western North America. It flowers early in spring, when the first bumblebees and hummingbirds Obama's NSA overhaul may require phone carriers to store more data Terms of Use Copyright 2014 by ScienceDaily, LLC or by third-party sources, where indicated. All rights controlled by their respective owners. Content on this website is for informational purposes only. It is not intended to provide medical or other professional advice."}, {"articleID": "2018020117_01314634_W", "names": {"Big Al": ["Q4723642", "Q4904920"]}, "date": "2018-02-01", "url": "http://kgun9.com/news/local-news/potholes-repaired-on-northwest-side", "content": "Potholes repaired on northwest side Pothole Patrol fixes roads again 9:55 AM, Feb 1, 2018 49 mins ago Next Pothole Patrol fixes potholes on northwest side thanks to viewer email. Copyright 2017 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Show Caption Previous Next TUCSON (KGUN-TV) - Kathy Hamstra emailed the Pothole Patrol with <mark>Big Al</mark> about potholes plaguing the northwest side. She sent two pictures of potholes on Ina and Shannon saying, \"All I want for Christmas is these potholes fixed!\" We called Pima County DOT and they repaired the potholes in January. Roger Rd. between Oracle and Romero is in queue to be repaired. On the east side, a pothole near a crosswalk at 5h and Pantano is being reported to the City of Tucson DOT for repair. Have potholes on your commute or in your community? Send an email to Potholes @ KGUN9.com. <mark>Big Al</mark> Traffic Pal has been in the Tucson community delivering traffic updates since 1988. You can reach him here. Copyright 2018 Scripps Media, Inc.. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}, {"articleID": "2016093000_00622436_W", "names": {"Larry Davis": ["Q16120627", "Q6490181", "Q6490183"]}, "date": "2016-09-29", "url": "http://www.kxxv.com/story/33283965/cyclist-going-for-world-record-stops-in-amarillo", "content": "Cyclist going for world record stops in Amarillo - KXXV-TV News Channel 25 - Central Texas News and Weather for Waco, Temple, Killeen | Cyclist going for world record stops in Amarillo - KXXV-TV News Channel 25 - Central Texas News and Weather for Waco, Temple, Killeen | Member Center: Cyclist going for world record stops in Amarillo 2016-09-29T23:39:32 ZDanielle Girdano with APD and Amarillo Fire (Source: KFDA) APD and Amarillo Fire (Source: KFDA) Danielle Girdano's Bike for the Route 66 journey (Source: KFDA) AMARILLO, TX (KFDA) - One woman aiming to break a cross-country cycling world record on Route 66 has made a stop in Amarillo. Danielle Girando is a cyclists who is determined to ride through more than 200 cities in 43 days. Girando began her journey in Chicago on Sept. 18 and is now 11 days into her trip. Sept. 17 was her longest stretch of over 100 miles from Elk City to Amarillo and she will continue on Route 66 for another 1,088 miles. \"This project is actually four years in the making, so doing something like this isn't something that you take lightly,\" Girando said. \"There's a lot of physical training that goes into it. There's a lot of emotional and mental training too. One of the hardest things about Historic Route 66, is the punishment that you take psychologically .\" While cycling Route 66, Girando is also hoping to raise awareness along with funds for childhood obesity and bullying, which is something that she advocates for after she struggled with her weight. At her heaviest, she weighed close to 400 pounds and cycling helped her tackle weight loss. \"Kids are being hurt by child obesity and bullying,\" said Girando. \"I understand that fact first hand. It comes down to education and behavioral patterns and it comes down to the education of parents to help stop this problem .\" This ride was expected to be completed last year, but during her first attempt she suffered an accident. Since first responders were so kind to her, she now is making it an effort to also dedicated the ride to them. \"When we learned what the cause was, we very much supported that,\" <mark>Larry Davis</mark>, Captain of the Amarillo Fire Department, said. \"She dedicated this ride to first responders as well and that's fantastic. Plus, we are proud to be apart of her going for a world record .\" Girando will leave Amarillo early Sept. 30 and continue on Route 66 until she reaches Los Angeles. Those interested in donating to stop childhood obesity and bullying or following Girando's journey can visit her. website Copyright 2016 KFDA. All rights reserved. Thursday, September 29 2016 8:39 PM EDT2016-09-30 00:39:38 GMTUpdated: Thursday, September 29 2016 8:39 PM EDT2016-09-30 00:39:38 GMT It's official: Lady Gaga will headline the Super Bowl halftime show next year. Wednesday, September 28 2016 2:05 PM EDT2016-09-28 18:05:50 GMTUpdated: Thursday, September 29 2016 8:35 PM EDT2016-09-30 00:35:10 GMTJacob Hall (L) in critical condition after shooting. Fireman Jamie Brock (R) saved lives including Jacob's. (Source: Family/Townville FD) School has been canceled for the rest of the week at Townville Elementary School after deputies said a 14-year-old opened fire on the school playground, wounding three people on Wednesday. Thursday, September 29 2016 8:21 PM EDT2016-09-30 00:21:58 GMTUpdated: Thursday, September 29 2016 8:21 PM EDT2016-09-30 00:21:59 GMT It took more than an hour for police to arrive at the shopping center in a San Diego suburb where a distressed black man had been wandering into traffic. It took about a minute for him to be shot and killed. Thursday, September 29 2016 6:09 AM EDT2016-09-29 10:09:03 GMTUpdated: Thursday, September 29 2016 8:03 PM EDT2016-09-30 00:03:13 GMT It is still too early to tell what precise impactHurricane Matthew will have on the U.S. coastline. Thursday, September 29 2016 11:42 AM EDT2016-09-29 15:42:42 GMTUpdated: Thursday, September 29 2016 7:16 PM EDT2016-09-29 23:16:33 GMT A middle school counselor is being hailed as a hero after talking a student at Sycamore Middle School from shooting other students."}, {"articleID": "2009052908_00028371_W", "names": {"Shu Shi": ["Q45364532", "Q45433161"]}, "date": "2009-05-29", "url": "http://thenutgraph.com/yb-kamarul-ramizu", "content": "29 may 09: 3.33 pm by shanon shah kamarul ramizu idris, the eyebrow-raising independent candidate in both the bukit gantang and penanti by-elections, is being skewered for coming out in support of the internal security act (isa). \"whether the isa exists or is abolished is meaningless now. it just should not be abused, either by individuals or the government. it must be transparent and correctly applied,\" he says. lau <mark>shu shi</mark> \"i really don't think you understand the isa,\" lau <mark>shu shi</mark>, a coordinator with the penang branch of human rights organisation suaram, retorts. \"thank you, thank you,\" kamarul replies, and chuckles. \"suzy (sic) ini bahaya sikit,\" he tells the rest of the crowd. \"tapi saya akan cuba jawab soalan dia .\" and then he repeats his stand. still exasperated, <mark>shu shi</mark> hands him an anti-isa leaflet which he accepts before shaking her hand warmly. it is 28 may 2009, the sixth day of campaigning in the penanti by-election. reporters have been at their wits end trying to get in touch with kamarul. by now, everybody is resigned to listening to the digi caller ringtone loop on kamarul's mobile phone at all hours of the day. malaysians for free and fair elections (mafrel) confirmed that kamarul would be taking part in its public debate, the announcement was met with incredulity, not least by the nut graph. but lo and behold, kamarul does show up at the bukit indera muda village security and development committee compound, entourage in tow, even though he arrives half an hour after fellow independent candidate nai khan ari nai keow. the absent candidates vying for the penang state seat are parti keadilan rakyat (pkr) candidate dr aminah abdullah. faith-based politics during the debate, kamarul repeats his campaign spiel from bukit gantang. indeed, he is even recycling his posters from the bukit gantang by-election here in penanti. \"yb\" kamarul ramizu idris \"i am trying to advocate faith-based politics and development,\" he says. \"through iman (faith), we will be able to reduce corruption and social ills, bit by bit .\" he also clarifies that he is not an \"independent\" candidate per se, but a party candidate in the making. \"my independent candidacy is a temporary gig only - i am trying to register my multiracial party now (parti iman semalaysia or pis),\" he says. according to his campaign manifesto, he is not merely seeking to register his own political party, but to set up a \"global religious organisation\". after the debate, reporters crowd around kamarul - he has, after all, been virtually incommunicado. kamarul agrees good-naturedly, but not before he shakes hands with the 20-plus members of the crowd - mostly consisting of reporters and photographers anyway. when he eventually talks to reporters, we lament that he has been virtually impossible to contact. \"i'm so sorry, but it's because i go deep into the kampungs every day, and i am unable to take calls from the media,\" he explains. he says he has already visited voters in eight villages in penanti and has \"four or five\" villages left to cover until polling day. \"i am focusing on canvassing for votes, not just seeking glamour from the media,\" he stresses. kamarul says that his campaign now consists of door-to-door canvassing, and waking up at the crack of dawn to stalk newspaper vendors. kamarul's bukit gantang (left) and penanti campaign flyers \"as an independent candidate, i don't have the means to have a huge campaign, so i slip my flyers into the newspapers before they are delivered to voters' doorsteps,\" he says. he says he has printed 11,000 flyers to be distributed in the penanti by-election, and his campaign costs have come up to rm30,000. that's a lot of money wasted if he loses in penanti, as he did in bukit gantang. \"it's not a waste,\" he says. \"the important thing is that my message gets across and that my party is eventually registered .\" \"i do understand the isa\" but how is he going to get his message across if, as an exasperated lau expressed, he does not even understand issues such as the isa? \"that's unfair,\" he says. \"i do understand the isa, and i do have a stand. in bukit gantang, i also met the families of the <mark>shu shi</mark> and kamarul\" but i couldn't develop my argument tonight, because the topic that the organisers gave me was on what i could offer for the well-being of penanti as a potential state assemblyperson. and so that was what i prepared myself for. \"besides, he says, why harp on sensitive issues? one thing is clear though--kamarul is not sensitive. he takes on jibes with a smile and a chuckle .\" after all, i am a yb - yang bertanding. \"but will voters turn kamarul into\" yang berhormat \"on polling day?\" in bukit gantang, i was up against two giants (from pakatan rakyat and bn), that's why i only captured 62 votes. but here, i am up against only one giant (from pkr), so my chances are better, \"he says during the debate. the audience listens politely and kamarul beams at them. all comments are subject to moderation, and this will delay the display of your comment."}, {"articleID": "2016072415_01143350_W", "names": {"Charles Russell": ["Q25536336", "Q5082285", "Q725006"]}, "date": "2016-07-24", "url": "http://www.getsurrey.co.uk/news/surrey-news/developers-vow-make-guildford-the-11646853", "content": "Developers vow to make Guildford \"the Hollywood of gaming' 16:06, 24 Jul 2016 The second G3 Futures event brought together a range of leading lights from Guildford's thriving gaming industry SharesThe video will start in 8s Cancel Click to playTap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video More than 150 developers and specialists attended the second G3 Futures event, aimed at galvanising the Guildford games industry. The town is often described as the\" Hollywood of the games industry \", home to EA Games, Hello Games (the creator of No Man's Sky) and the\" godfather of Guildford gaming \"Peter Molyneux. Organised by the University of Surrey, UK Interactive Entertainment trade body (UKIE) and technology law specialist <mark>Charles Russell</mark> Speechlys, the purpose of the event was to provide an opportunity for local gaming companies to network, share ideas and learn about the latest innovations and industry issues. Jo Twist, chief executive of UKIE, delivered the first of two keynote speeches. She highlighted the increasing importance of collaboration post-Brexit and of maintaining access to more than 500 million customers across Europe. Dr Twist highlighted her mission to enhance the profile of the games industry, positioning it alongside film, theatre and other cultural mediums. The second keynote speech was given by Ian Baverstock, chief executive of Chilled Mouse, who talked about\" what makes gaming great in Guildford \". He concluded that the cluster of people in successful gaming companies in the town has attracted other developers over the years, resulting in a thriving community that continues to go from strength to strength:\" It's a great place to live and we make great games, \"he said. Nick Hurley, partner at <mark>Charles Russell</mark> Speechlys and co-host at the event, said:\" Our second G3 Futures event was a real success as it pulled in even more indie developers and people from the industry, making the event relevant and authentic. \"A number of delegates told me how energised they felt by the G3 conference .\" Keeping the creative and developer focus in the Guildford area is critical for the South East's continued success in the technology sphere, so we will continue to put all our efforts into supporting this important and vibrant community as it cements its reputation on a world stage. \"Co-host John Collomosse, an academic in the University of Surrey Centre for Vision for Speech and Signal Processing, said:\" G3 is a fantastic opportunity to forge further links between the university and local games sector. \"The university is heavily invested in the creative industries through degree programmes such as the Digital Media Arts, and its research in 5G mobile technology, spatial audio and performance capture, all of which were showcased .\" "}]