[{"date": "2014-02-07", "url": "http://news.brisbanetimes.com.au/breaking-news-sport/coates-lauds-winter-sports-in-australia-20140207-327ma.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Australian snow sports are a shining example to their summer counterparts, according to AOC boss <mark>John Coates</mark>, but that doesn't necessarily mean there's going to be any extra funds coming to winter athletes any time soon. \"It continues to be a matter of spending what is allocated, wisely,\" <mark>Coates</mark> said ahead of the start of the Winter Olympics in Sochi. \"The Australian Olympic Committee has a limited budget .\" We put a million a year into the Winter Institute, the sports commission and the other institutes put another one-and-a-half million in - any increase would be good but there are other priorities in sport - participation sport and whatever. \"He said winter sports in Australia got good value for money because they centralise their programs .\" It is certainly well done. It's probably a lesson to some of the smaller sports and the summer sports too, \"he said. A strong performance at these Games - four medals or more - would undoubtedly be a handy bargaining chip to obtain more money for Australian winter sports but even that may not be enough to please everyone. A number of snowboarders have complained about what they perceive as funding discrepancies in the team, Scotty James particularly vocal while he and others including Torah Bright, Belle Brockhoff and Jarryd Hughes frequently sign off with #teamoutcast on their social media accounts to signify their various frustrations. But <mark>Coates</mark> said while it would be great to offer more support to athletes outside official programs, the reality was limited money meant tough decisions had to be made .\" Some (athletes) manage to do it on their own; some make a lot of money, \"<mark>Coates</mark> said .\" I think it is whether the (Olympic Winter) Institute has got the money to say \"here's X dollars, go off and spend it as you like' .\" It is probably fraught with danger, so they do try to control the programs and ensure the sports science medicine and backup is there in a co-ordinated way - and maybe that model doesn't suit everyone but it works for us. \"Meanwhile <mark>Coates</mark>, also the IOC vice-president, said he was pleased with how the Games were shaping up despite some complaints from athletes and media .\" We've had good reports from our staff and from the organising committee. We've experienced moving around the city, the security looks good, it's not difficult and I get a very positive impression, \"<mark>Coates</mark> said. There have been quirks - from unfinished buildings, to dirty water coming out of taps, the culling of dogs and then the more pressing humans rights, security and spending concerns. But <mark>Coates</mark> was steadfast these Games would be good.", "articleID": "2014020718_00035448_W", "names": {"John Coates": ["Q16135744", "Q19664760", "Q4250255", "Q6226433", "Q6226435", "Q6226437", "Q6226439", "Q671993"]}}, {"date": "2014-02-11", "url": "http://www.timesofmalta.com/articles/view/20140211/world/uk-mps-vote-to-ban-smoking-in-cars.506271", "content": "Press Association Commons votes to ban smoking in cars carrying children Campaigners have welcomed plans backed by MPs which could save hundreds of thousands of children from being exposed to second-hand smoke in cars. Leading medical charities said they were \"delighted\" that the House of Commons had voted in favour of paving the way for for legislation which could outlaw smoking in vehicles carrying children. The Commons gave the Health Secretary the power to impose a ban despite the opposition of some MPs, including leading members of the Cabinet. Ministers were granted a free vote on the measure - successfully introduced by Labour in a House of Lords amendment to the Children and Families Bill - meaning they were not tied to a party line. The British Medical Association (BMA), which has campaigned for a ban since 2011, said the vote was an \"important step forward in reducing tobacco harm\". Dr Penny Woods, chief executive of the British Lung Foundation, said: \"Having campaigned on this issue for many years, we're absolutely delighted that MPs have backed the ban on smoking in cars carrying children .\" This could prove a great leap forward for the health of our nation's children. \"The introduction of a law that would help prevent hundreds of thousands of children from being exposed to second-hand smoke in the car is now within reach .\" With both Houses of Parliament having made their support for the ban clear, the onus is now on the Government to act accordingly and make this crucial child protection measure law at the earliest opportunity. \"The charity estimates that in England more than 430,000 children aged 11 to 15 are exposed to second-hand smoke in cars every week. Research published by the organisation last year concluded that 185,000 children of the same age are exposed to smoke while in the family car on\" most days \", if not every day. Deborah Arnott, chief executive of health charity Ash (Action on Smoking and Health) described the vote as\" an historic victory for Parliament and for children's health \". Tory and Liberal Democrat MPs joined forces with Labour MPs to approve the ban by 376 votes to 107, majority 269. Prime Minister <mark>David Cameron</mark> missed the vote while visiting flood-stricken areas in the south west. Mr <mark>Cameron</mark>'s official spokesman declined to say which way the Prime Minister would have voted had he been able to attend Parliament. But he told a regular Westminster media briefing:\" While he understands the concerns that some have expressed, his view is that the time for this kind of approach has come. \"Health Secretary <mark>Jeremy Hunt</mark> was in favour of the move, together with Chancellor <mark>George Osborne</mark>, Chief Secretary Danny Alexander, Defence Secretary <mark>Philip Hammond</mark> and Education Secretary Michael Gove, International Development Secretary Justine Greening, Scotland Secretary Alistair Carmichael and Energy Secretary Ed Davey. Justice Secretary Chris Grayling was in the\" no \"camp of those who said it was unenforceable. Home Secretary <mark>Theresa May</mark>, Work and Pensions Secretary Iain Duncan Smith and Northern Ireland Secretary Theresa Villiers also opposed the ban. Deputy Prime Minister Nick Clegg missed the vote but has spoken out against attempts to\" sub-contract responsible parenting to the state \". Also missing were Foreign Secretary <mark>William Hague</mark>, Business Secretary Vince Cable, Communities Secretary Eric Pickles, Environment Secretary <mark>Owen Paterson</mark>, who is out recovering from eye surgery, Transport Secretary <mark>Patrick McLoughlin</mark>, Culture Secretary <mark>Maria Miller</mark> and Wales Secretary <mark>David Jones</mark>. Shadow public health minister Luciana Berger welcomed the result as a\" great victory for child health \"but warned ministers not to\" kick this into the long grass \". But pro-smoking groups branded the move as an\" unnecessary intrusion \". <mark>Simon Clark</mark>, director of the smokers' group Forest, said he was\" disappointed but not surprised \"by the decision and accused the Government of being\" spineless \". He added:\" Legislation will have very little impact because so few adults still smoke in cars carrying children. Those that do will carry on because it will be very difficult to enforce. \"Government has banned smoking in public places. Now they're going to ban it in a private place. The home will be next .\" Health Minister Jane Ellison told MPs the success of a smoking ban in cars carrying children will not be measured by the number of times the police enforce it. Instead, she said, its success would be gauged by the reduction in exposure to second-hand smoke. AA president Edmund King said: \"As has been the case with enforcing the ban on hand-held phones while driving, campaigns and legislation have been shown to reduce illegal behaviour afterwards. If a new law manages to make more adults think twice before lighting up with the kids on board, it will have helped .\" Comments are submitted under the express understanding and condition that the editor <mark>may</mark>, and is authorised to, disclose any/all of the above personal information to any person or entity requesting the information for the purposes of legal action on grounds that such person or entity is aggrieved by any comment so submitted. A subscription is required to access Times of Malta content from overseas.", "articleID": "2014021114_00015779_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"], "David Jones": ["Q10450056", "Q1174792", "Q1174894", "Q1174896", "Q16105375", "Q16945194", "Q17314899", "Q18350685", "Q18921618", "Q19665551", "Q20655901", "Q20732856", "Q21467224", "Q21467227", "Q24007312", "Q24007313", "Q260857", "Q2747788", "Q27906151", "Q27983475", "Q3018172", "Q312803", "Q4042624", "Q458276", "Q49193215", "Q50633601", "Q51397308", "Q52356357", "Q5235721", "Q5235722", "Q5235734", "Q5235735", "Q5235742", "Q5235743", "Q5235745", "Q5235746", "Q5383", "Q54666079", "Q56248428", "Q56507984", "Q56596961", "Q56604601", "Q57497739", "Q57552289", "Q728167"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "Jeremy Hunt": ["Q333533", "Q929730"], "Maria Miller": ["Q23020994", "Q334261"], "Owen Paterson": ["Q197894", "Q345827"], "Patrick Mcloughlin": ["Q333267", "Q7147184"], "Philip Hammond": ["Q18388174", "Q332987"], "Simon Clark": ["Q19665441", "Q2082072", "Q7518465", "Q7518467"]}}]