[{"articleID": "2018040519_00085490_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"]}, "date": "2018-04-05", "url": "https://www.thestar.com/news/world/2018/04/05/number-of-palestinians-killed-by-israel-this-week-rises-to-21-after-gaza-airstrike.html", "content": "News World Palestinian protesters carrying tires walk toward the fence along Gaza's border with Israel Thursday. An Israeli airstrike in northern Gaza early on Thursday killed a Palestinian, while a second man died from wounds sustained in last week's mass protest. (Adel Hana / The Associated Press) By Ilan Ben Zion The Associated Press Thu., April 5, 2018 JERUSALEM--An Israeli airstrike killed a Gaza man Thursday, while a second Palestinian died of wounds sustained in last week's mass protest along the Gaza-Israel border, officials said. The deaths brought to 21 the number of Palestinians killed by Israeli fire over the past week, including 15 who had been involved in the protests. The Israeli military said the man killed in the airstrike before dawn Thursday had approached the border fence with an assault rifle. It released a grainy video showing the armed man walking in the dark. Read more: Israel rejects calls for inquiry into Gaza violence Article Continued Below Palestinian death toll from Gaza protests hits 18; Israel rejects excessive force claims Israeli PM backtracks on deal to resettle African migrants in western countries, including Canada A new round of protests along the border is expected on Friday, raising the prospect of further bloodshed. The protest march last week, largely organized by Gaza's Hamas leaders, had been billed as the first of several weeks of intermittent protests against a stifling, decade-old Israeli blockade. Hamas leaders have portrayed the final protest, set for May 15, as the \"Great March of Return\" of Palestinian refugees and their descendants, implying they would try to enter Israeli territory. But they have stopped short of specifically threatening a mass breach of the border fence. The Israeli military has said it will not allow anyone to breach the border fence and has beefed up forces in the area, with snipers and other special units. The military was on high alert ahead of Friday. Nickolay Mladenov, the UN's Mideast envoy, urged both sides to show caution on Friday. \"Israeli forces should exercise maximum restraint and Palestinians should avoid friction at the Gaza fence,\" he said. \"Demonstrations and protests must be allowed to proceed in a peaceful manner,\" he added. \"Civilians, particularly children, must not be intentionally put in danger or targeted in any way .\" Meanwhile, Gaza health officials said a 34-year-old Palestinian who was seriously injured in last week's protests died of his injuries Thursday. Hundreds more were wounded by live fire last week, according to Palestinian health officials. Of the 21 dead so far, 15 were killed during border protests, and videos and witness accounts indicate that most were not armed or carrying out attacks at the moment they were killed. Hamas announced it is distributing money to the families of those killed and wounded in Friday's clashes. Families of those killed receive $3,000 (U.S.). Wounded receive $500 or $200 depending on the injury. Hamas said in a statement the money is part of its \"national and social responsibility in boosting the steadfastness\" of the people. Israel's military spokesman, Brig. Gen. Ronen Manelis, alleged that Hamas is exploiting Gaza residents by urging them to attend the protests and \"under the cover of these civilians carry out terror activities .\" Manelis said several Israeli communities are close to the Gaza border and warned of the consequences of Palestinians breaching the fence. Israel has defended its actions by saying the marches are planned by Hamas, which is sworn to Israel's destruction. It says the border fence was attacked with burning tires, stones and firebombs and, in one case, by a pair of gunmen in recent days. It says its snipers carefully targeted only the main \"instigators,\" and accuses Hamas of using the crowds as cover to stage attacks. \"By defending the border fence, the IDF (army) is protecting civilian homes,\" the military said on Twitter. Defence Minister Avigdor Lieberman warned in a radio interview on Thursday that Israel would respond harshly to any attempt to violate its security. Earlier this week, Lieberman said Gazans who approach the fence would be risking their lives. Rights groups have condemned orders to shoot unarmed protesters as unlawful, saying lethal force can only be used if soldiers face an apparent imminent threat to their lives. The Israeli group B’Tselem, in a rare appeal, urged Israeli soldiers to refuse such orders. The United Nations and the European Union have called for independent investigations into the shootings. Meanwhile, Egyptian intelligence chief <mark>Abbas</mark> Kamel held separate meetings this week with Israeli officials and with Palestinian President <mark>Mahmoud Abbas</mark>, the West Bank-based rival of Hamas, in hopes of preventing an escalation on the Gaza border. In recent months, Egypt had tried to broker a deal that would have enabled <mark>Abbas</mark> to take back control in the Gaza Strip, more than a decade after Hamas seized the territory from forces loyal to him. Hamas, in turn, had hoped that Israel and Egypt would end their blockade of Gaza if the group handed the reins of government to <mark>Abbas</mark>. However, talks broke down last month, in part because Hamas refused to disarm. Hamas and Israel have fought three wars in the Gaza Strip since 2008. <mark>Abbas</mark> told the Egyptian intelligence this week that he would not waste any more time negotiating a deal with Hamas and that he would only assume responsibility for Gaza if Hamas hands over all powers, including control over the security apparatus, according to two Palestinian officials. All the officials spoke on condition of anonymity because they were not authorized to discuss details of the meeting with reporters. Read more about: Israel Delivered daily The Morning Headlines Newsletter Subscribe The Toronto Star and thestar.com, each property of Toronto Star Newspapers Limited, One Yonge Street, 4th Floor, Toronto, ON, M5E 1E6. You can unsubscribe at any time. Please contact us or see our privacy policy for more information."}, {"articleID": "2017070212_00698206_W", "names": {"Michael Keane": ["Q16154778", "Q51427785", "Q6831802", "Q80712"], "Alex Young": ["Q21043040", "Q26710684", "Q353522", "Q4718033", "Q4718035"], "Steve Watson": ["Q21067229", "Q2347391", "Q3499159", "Q56423575", "Q7614250", "Q984352"]}, "date": "2017-07-02", "url": "http://www.dailypost.co.uk/sport/football/transfer-news/everton-fc-news-live-michael-13269823", "content": "Sport Everton FC news LIVE: <mark>Michael Keane</mark> and Sandro Ramirez updates All the latest from Goodison Park Share By Chris Beesley Updated 13:09, 2 JUL 2017 Sport Burnley's <mark>Michael Keane</mark> marshal's Sunderland's Jermain Defoe at the Stadium of Light Share Chris Beesley and the rest of the team will be with you today from 9am to ensure constant coverage of all things EFC, including news, great photos, nostalgia, live interviews and much more. The ECHO will also provide you with the very latest transfer news as it happens throughout the summer, with every rumour and story digested and analysed each day with updates from full-time EFC reporter Phil Kirkbride, as well as EFC editor Greg O'Keeffe. We will also have the very latest on Everton's proposed new stadium on the Bramley Moore dock, pre-season fixtures and injury updates head of the new Premier League season. We want you to get involved too - tell us your thoughts on what's happening at Goodison Park by tweeting @ LivEchoEFC 13:09 <mark>Keane</mark> Gallery Could Everton be getting this record-breaking deal for a defender over the line in the next 24 hours? 12:45 Golden Vision Artistic graphic of the late, great <mark>Alex Young</mark>. 12:13 Why Koeman is best equipped to avoid \"sophomore slump' That's something of an Americanism (or izm) as they might call it. Other here we say\" second season syndrome \". Both David Moyes and Roberto Martinez had a bad case of it - the Scot recovered, the Catalan did not. Alistair Kleebauer examines how current Blues boss Ronald Koeman might fare. Click here for the full article Everton vs Watford. Everton players lap of honour and manager Ronald Koeman (Photo: Colin Lane) 11:32 Coleman delight to hear fans sing his name Everton's Seamus Coleman has been speaking about his friends and family from back home in Ireland and he mentions the time they came to watch last season's game at Manchester United with him. He says:\" I'm quite close to all my friends. \"We had an evening, on the day we played Manchester United at Old Trafford, when all the boys came up to watch the game .\" It was good to chill out with them all. We heard my song being sung by the fans, coming out loud through the TV. That was great. \"Jags' celebration as well was a nice touch. That was a really good evening at home .\" It was like the old days. We are a very close bunch at home. I have a group of friends that I grew up with playing Gaelic football and it's important we all still stay in touch. \"11:06 Blues eye Giroud According to today's transfer rumours, Everton have entered the race for Arsenal's Olivier Giroud. Click here for the full article Allez les Bleus? France striker Olivier Giroud could end up at Everton (Photo: FRANCK FIFE/AFP/Getty Images) 10:35 Fowler salutes Blues transfer business Former Liverpool striker (and boyhood Evertonian of course) Robbie Fowler reckons the Blues transfer business this summer has made rest of league look\" a bit stupid. \"He said:\" I have to hand it to Bill Kenwright and his team at Everton. \"They have stolen a march on the rest of the Premier League clubs and even made them look a bit stupid .\" I honestly think that doing your business early this summer is not only wise, but vital, because I reckon prices are only going one way as deals start to get done...through the roof. \"Click here for the full story Robbie Fowler 10:01 <mark>Watson</mark> long-ranger Despite being primarily a right-back, <mark>Steve Watson</mark> had an eye for goal. The Geordie utility man wasn't even playing as an auxiliary centre-forward in this game but he had his eye in. 09:38 Dowell wants to emulate Arteta Kieran Dowell returns to Finch Farm as a World Cup winner - having been part of England's all-conquering U20s side in South Korea - but it's Basque schemer Mikel Arteta who he wants to base his game on. The Blues midfielder said:\" He was someone I always looked up to as a kid. \"He was so graceful on the ball and he made everything look easy .\" He was great to watch and he is someone who I looked at and tried to implement areas of his game into my own. \"Click here for the full interview Kieran Dowell of Everton celebrates with the trophy during the Premier League 2 match between Everton and Liverpool at Goodison 09:30 Chris Beesley Good morning Well the transfer window is now officially open and the Blues return to pre-season training tomorrow so let's start cranking things up. Share More On Everton FC"}, {"articleID": "2014061001_00018970_W", "names": {"David Noble": ["Q1175923", "Q5238054", "Q5238056"], "George Lucas": ["Q1507803", "Q38222"]}, "date": "2014-06-09", "url": "http://www.onenewspage.com/n/Technology/750hntmyc/Harrison-Ford-Wanted-Han-Solo-To-Be-Killed.htm", "content": "Harrison Ford Wanted Han Solo To Be Killed Off in \"Star Wars: The Empire Strikes Back\" Monday, 9 June 2014 (55 minutes ago) The Star Wars films have been a huge influence on pop culture ever since they originally hit the big screen. Even now, years later, their popularity shows no...It Looks Like The Millennium Falcon Will Be In \"Star Wars: Episode VII' It looks like the Millennium Falcon is going to be in\" Star Wars: Episode VII. \"After releasing more than 40 new photos yesterday, TMZ released a new group of...Business Insider 6 days ago - Business Google launching Android rival to APPLE's iBeacon technology As Apple, GOOGLE and Amazon Roll In, Who Will Be The Last Music Streaming Service Standing? Meet the company that is dangerously close to collecting 1% of Apple's The Critics Are Wrong: GOOGLE GLASS Is Going To Be Huge, And Most People Have No Idea Why (GOOG)\" Halo: The Master Chief Collection' brings all four Halo games to Cartoon HD App Taken Down From App Store; Users Upset Apk No Longer Available for AMAZON goes after PayPal by offering to handle payments for startups & online services <mark>David Noble</mark> Harrison Ford Wanted to Kill Han Solo: The Star Wars films have been a huge influence on pop culture ever sinc...http: //t.co/4ZCLOhFyEb celebrity news Star Wars: <mark>George Lucas</mark> reveals that Harrison Ford wanted Han Solo to die http: //t.co/HB2TmNMbg6 Harrison Gaunce Harrison Ford Wanted Han Solo To Be Killed Off in \"Star Wars: The Empire Strikes Back\" http: //t.co/a9atcVRoX3 Nathan Worthington Harrison Ford wanted Han Solo to be killed off - Waterford News and Star http: //t.co/ZX4XwijEpr @ StarWarsFans101: Star Wars shocker: Harrison Ford wanted Han Solo to die http: //t.co/h0bHo6SyW8 Germany launches criminal investigation of alleged US surveillance of Merkel's phone Queen's new state carriage marks hundreds of years of history as well as featuring 21st century technology"}, {"articleID": "2017080221_00182693_W", "names": {"John Galloway": ["Q29642716", "Q6234758"]}, "date": "2017-08-02", "url": "http://weblogs.baltimoresun.com/entertainment/dining/baltimore-diner-blog/bs-fo-hard-rock-test-kitchen-20170802-story.html#nt=oft13a-20gp1", "content": "Diners at Baltimore's Hard Rock Cafe can now order crab cakes as part of a new program in which some of the chain's restaurants are adding local flavors to their menus. The Inner Harbor restaurant was among 12 Hard Rock Cafe locations selected for the company's \"test kitchen\" program. New items at the Baltimore restaurant became available Tuesday. Local offerings at the Hard Rock Cafe Baltimore include a crab cake sandwich, crab cake entree, crab dip \"Local Legendary Burger\" and a fresh catch of the day. On its drink menu, the restaurant also added a black-eyed Susan cocktail made with Sagamore rye whiskey. <mark>John Galloway</mark>, Hard Rock International's chief marketing officer, said the company began looking for potential test kitchen sites in January, searching for restaurants located in areas with strong \"culinary energy,\" an aptitude for local sourcing, and strong chefs and general managers. Baltimore was among the locations selected from the chain's 176 restaurants. Other Hard Rock test kitchens are in Chicago, Denver and Pittsburgh. Culinary teams at Hard Rock's Orlando headquarters collaborated with chefs in individual markets to develop the new menu items. While the test kitchen items could ultimately end up on Hard Rock's universal menu, the primary goal was adding local flavor to Hard Rock's standard offerings in certain markets. Lorraine Mirabella The Baltimore Sun Unveiling of redesign at Hard Rock Baltimore planned for Tuesday Unveiling of redesign at Hard Rock Baltimore planned for Tuesday (Lorraine Mirabella The Baltimore Sun) \"The bigger idea is to allow a guest who is visiting Baltimore to have their choice of local cuisine or the global Hard Rock cuisine that they may expect,\" <mark>Galloway</mark> said. \"It's about serving the needs of locals as well as the tourists .\" The test kitchen restaurants spent about three months developing local dishes, and <mark>Galloway</mark> said he expects the local menu items to evolve over time. Now that the items are available to the public, his team is taking feedback from customers. <mark>Galloway</mark> was in Baltimore Tuesday for the launch of the new menu and to hear what diners thought of the new options. When it came to the crab cakes, customers told him not to mess with traditional preparations. \"We stuck to a script,\" he said. \"There's not a lot of Hard Rock twist on that .\" CAPTION Hackers have stolen video and other data from HBO, Disney, Netflix, and Sony. (Aug. 1, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) Hackers have stolen video and other data from HBO, Disney, Netflix, and Sony. (Aug. 1, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) CAPTION The French actress Jeanne Moreau, who became one of the most popular and bewitching film stars of the 1960s, died July 31 at 89 in Paris. Her career spanned seven decades and nearly 150 movie and TV roles, establishing her as the thinking man's femme fatale. (July 31, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) The French actress Jeanne Moreau, who became one of the most popular and bewitching film stars of the 1960s, died July 31 at 89 in Paris. Her career spanned seven decades and nearly 150 movie and TV roles, establishing her as the thinking man's femme fatale. (July 31, 2017) (Sign up for our free video newsletter here http: //bit.ly/2n6VKPR) smeehan @ baltsun.com twitter.com/sarahvmeehan MORE BALTIMORE DINER 100 essential food and drink experiences every Baltimorean must try Map: 10 hot Baltimore restaurants Dish Baltimore: Search Baltimore Sun-reviewed restaurants"}, {"articleID": "2015022701_00017792_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"]}, "date": "2015-02-27", "url": "http://cbs19.tv/story/28215160/east-texas-family-fights-for-medical-marijuana", "content": "meta content = \"2015-02-26 14:07:49\" > Web Exclusive: KFC & Seattle's Best Coffee introduce a coffee cup you can eat Now you can have your coffee and eat the cup it comes in, too. KFC is teaming with Seattle's Best Coffee to create the Scoffee cup. Now you can have your coffee and eat the cup it comes in, too. KFC is teaming with Seattle's Best Coffee to create the Scoffee cup. meta content = \"2015-02-25 14:58:35\" > Web Exclusive: Vanilla Ice back in the spotlight for \"act of kindness\" after arrest Web Exclusive: Vanilla Ice back in the spotlight for \"act of kindness\" after arrest Just days after his high profile arrest Vanilla Ice is back in the spotlight, but this time in a gesture of kindness to one family. He helped install a swimming pool and hope for a five year old Florida boy and his family still hurting from a deadly car wreck. Just days after his high profile arrest Vanilla Ice is back in the spotlight, but this time in a gesture of kindness to one family. He helped install a swimming pool and hope for a five year old Florida boy and his family still hurting from a deadly car wreck. meta content = \"2015-02-24 13:59:26\" > Web Exclusive: Mobile payment wars heating up between Apple & Google The mobile payment war between Apple Pay and Google Wallet is heating up. Google says A-T & T, Verizon Wireless and T-Mobile will pre-install its Google wallet payments app on all android phones sold by the carriers this year. The mobile payment war between Apple Pay and Google Wallet is heating up. Google says A-T & T, Verizon Wireless and T-Mobile will pre-install its Google wallet payments app on all android phones sold by the carriers this year. meta content = \"2015-02-23 15:15:28\" > Web Exclusive: Fashion hits and misses from the Academy Awards Red Carpet Bold colors, big necklaces, and metallics ruled the red carpet at last night Academy Awards. There were some hits and misses from Hollywood's biggest night. Bold colors, big necklaces, and metallics ruled the red carpet at last night Academy Awards. There were some hits and misses from Hollywood's biggest night. meta content = \"2015-02-20 14:18:04\" > Web Exclusive: \"Houslet' could be a solution to housing crisis A solution to the Bay Area's housing crisis could be inside a man's garage. His vision requires only 64 square feet of living space. A solution to the Bay Area's housing crisis could be inside a man's garage. His vision requires only 64 square feet of living space. meta content =\" 2015-02-19 13:53:15 \"> Web Exclusive: New Dr. Seuss book hitting shelves soon Big news for fans of Dr. Seuss. More than 20 years after his death, Random House says it's publishing a recently discovered manuscript by the children's book author this summer Big news for fans of Dr. Seuss. More than 20 years after his death, Random House says it's publishing a recently discovered manuscript by the children's book author this summer meta content =\" 2015-02-18 14:37:14 \"> Web Exclusive: Man buys $5.99 watch at thrift store worth $35,000 Web Exclusive: Man buys $5.99 watch at thrift store worth $35,000 A Phoenix man found quite the thrift store treasure. He bought a watch at Goodwill for about $6. Then, he turned around and sold it for $35,000. A Phoenix man found quite the thrift store treasure. He bought a watch at Goodwill for about $6. Then, he turned around and sold it for $35,000. meta content =\" 2015-02-17 14:05:44 \"> Web Exclusive: Gas prices still climbing, but cheaper than a year ago Gas prices continue to climb this week. Triple-A says prices shot up 7 cents last week. Gas prices continue to climb this week. Triple-A says prices shot up 7 cents last week. meta content =\" 2015-02-16 14:07:42 \"> Web Exclusive: Bar Stool Races are an extreme event for the less serious crowd With all the extreme winter sports for serious athletes, a town in central Minnesota is offering an extreme competition for the less serious crowd. The Bar Stool Races in Ironton feature downhill events that are fueled in part by beer. With all the extreme winter sports for serious athletes, a town in central Minnesota is offering an extreme competition for the less serious crowd. The Bar Stool Races in Ironton feature downhill events that are fueled in part by beer. meta content =\" 2015-02-13 14:24:25 \"> Web Exclusive: Valentines to marry in the Big Apple We are just hours away from Valentine's Day, so if want to say\" I do \"overlooking the Big Apple, you better hurry. Valentine's Day is the only day of the year the empire state building allows weddings We are just hours away from Valentine's Day, so if want to say\" I do \"overlooking the Big Apple, you better hurry. TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. Eight-year-old Jacob Bingham suffers from multiple seizures a day, and his parents are worried medical marijuana may be his only hope. Jacob isn't like most 8-year-olds. He can't talk, ride a bike, eat on his own, or even play with his twin brother .\" He's so worn out from the seizures and from all the drugs that he just doesn't have an interest in much of anything. He just lays around, \"his mother Marcy Bingham said .\" It's hard to live through every day, \"Jacob's brother Jarod said .\" At first the day can just start out as a typical day, and then it all turns into a horrible day if Jacob starts to seize. \"Jacob suffers from Dravet Syndrome, a rare disorder that causes him to have violent and uncontrollable seizures--sometimes dozens a day .\" You can't live a normal life, \"Marcy Bingham said .\" You don't take vacations, you can't leave him with people. Even the nurses at times are uncomfortable with him because he seizes so much. \"The Binghams spent Wednesday in Austin meeting with senators in support of two bills that would legalize cannabis-based oils as a medical treatment for children with severe epilepsy. Senate Bill 339 and House Bill 892 would regulate the growth and dispensation of cannabis-based oils in Texas .\" It's amazing some of the stories we have seen and heard as to how it's helped children similar to our son, \"Jacob's father Dirk Bingham said. Children like 9-year-old Charlotte Figi of Colorado, whose parents credit cannabis-oil for relieving their daughter's constant seizures. The problem the Binghams face is that even if Jacob can get a prescription for the drug in Colorado, he can't legally use it here in Texas .\" We would like that opportunity too, and not worry about being prosecuted if he used it and not having to move to Colorado, \"Marcy Bingham said .\" We both have jobs, we have family here, we've lived here all our lives and we don't want to leave, \"Dirk Bingham said .\" But it may come to that. \"The controversial oil comes from the marijuana plant but it's low in THC and rich in cannabidiol, or CBD, and the Binghams say it's Jacob's last hope .\" If we hadn't tried everything, we wouldn't want to put our child on this, \"Marcy Bingham said .\" But we have tried everything, and there are no more drugs for him. The doctor has told us. \"Right now, Jacob takes up to six pills a day--pills that cause life-threatening side effects .\" He could stop breathing, his heart could stop, his brain could stop and that's it, \"Marcy Bingham said. The Binghams' hope is that Jacob will one day be able to live a normal life .\" Just to say \"mama,' if he could even do that,\" Marcy Bingham said. \"If he could play with his brother. And that's what he says, he has no one to play with. He's an only child basically .\" \"I just want him to at least say just a few words. I just want him to say,' I love you' or something,\" Jarod Bingham said. meta content = \"2015-02-26 17:54:45\" > <mark>Peterson</mark> to be reinstated after judge overturns suspension A Minnesota judge has sided with the NFLPA in its case vs. the NFL over <mark>Adrian Peterson</mark>'s suspension, CBS Sports NFL Insider Jason La Canfora has confirmed. A Minnesota judge has sided with the NFLPA in its case vs. the NFL over <mark>Adrian Peterson</mark>'s suspension, CBS Sports NFL Insider Jason La Canfora has confirmed. meta content = \"2015-02-26 20:30:36\" > Supreme Court: Texans, others may lose fed health insurance help Millions of Americans have a big personal stake in next Wednesday's Supreme Court challenge to the nation's health care law: Can they legally continue to get subsidies to help pay for their insurance? Millions of Americans have a big personal stake in next Wednesday's Supreme Court challenge to the nation's health care law: Can they legally continue to get subsidies to help pay for their insurance? TYLER (KYTX)--A border collie tossed off a bridge and left for dead has survived and has just been adopted, but now her unborn puppies need homes. TYLER (KYTX)--A border collie tossed off a bridge and left for dead has survived and has just been adopted, but now her unborn puppies need homes. meta content = \"2015-02-27 00:46:33\" > East Texas family fights for medical marijuana TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. TROUP (KYTX)--As more and more parents turn to medical marijuana in Colorado to treat their children's debilitating epilepsy, one East Texas family is fighting for a bill that would legalize it here at home. meta content = \"2015-02-26 21:30:41\" > Longview sanitation catching up after weather delays Due to the inclement weather this week, the City of Longview Sanitation Division has revised the collection schedule for the remainder of the week of February 23-27. CBS19, MYTX & KCEB 2211 ESE Loop 323"}, {"articleID": "2019020723_00476391_W", "names": {"Al Green": ["Q14469655", "Q313260", "Q4703915", "Q749039"]}, "date": "2019-02-07", "url": "https://www.allaboutthejersey.com/2019/2/7/18204701/gamethread-new-jersey-devils-new-york-islanders-surprisingly-bad-versus-surprisingly-good", "content": "Coleman! Nelson! Again! Tonight! Photo by Elsa/Getty Images Two teams with improbable seasons. This is the second time New York's More Tolerable Team will be at The Rock this season. The Matchup: The New Jersey Devils vs. the New York Islanders (SBN Blog: Lighthouse Hockey) The Time: 7:00 PM ET The Broadcast: TV - MSG + (MSG for the Isles' feed); Digital Audio - The \"Devils Hockey Network .\" A.K.A. Go to Radio.com or NHL.com for an audio feed. The Song for the Night: The Talking Heads were a landmark band. They certainly had a style all of their own. They covered \"Take Me to the River,\" on their 1978 album More Songs About Buildings and Food. The song was originally by <mark>Al Green</mark> and Mabon \"Teenie\" Hodges, but this was a hit for the Talking Heads due to their version of it. The Rules: The rules remain the rules even when you're wondering why I didn't link to the Stop Making Sense version of the song. It is what it is. Please keep your comments clean, legal (read: no streams, no links to streams, no asking for streams, no streams), and all about the games itself. Just as importantly, let's respect each other. There's no need for drama or being unwelcoming of your fellow Devils fan. This is a Gamethread, let's focus on the game. Thank you for reading. Go Devils! Most Read New York Islanders @ New Jersey Devils 7:00 PM - Prudential Center - Newark, NJ Minnesota Wild @ New Jersey Devils 1:00 PM - Prudential Center - Newark, NJ"}, {"articleID": "2012121504_00038215_W", "names": {"Michael Perry": ["Q13410165", "Q16106764", "Q21997881", "Q28835656", "Q57440952", "Q6833482", "Q6833483", "Q6833484", "Q6833487"]}, "date": "2012-12-15", "url": "http://latimes.com/sports/hockey/nhl/la-sp-nhl-lockout-20121215,0,5499394.story?track=rss", "content": "clippers' jamal crawford shows his versatility with passing it was only a matter of time before hockey's labor dispute moved from multiple unproductive bargaining sessions to multiple legal filings. nhl laid the groundwork in not one but two forums friday, filing a class-action complaint in federal court in new york aiming to confirm the legality of its lockout. the league also filed an unfair labor practice charge with the national labor relations board targeting a possible union move to dissolve itself. those moves were anticipated and all about location, location, location. following the lead of the nba's action last year, the lawsuit was filed in u.s. district court in new york, an often-friendly venue to sports leagues and widely known to be pro-employer. the nhl issued a releasethat said, in part, \"by threatening to\" disclaim interest,' the nhlpa has engaged in an unlawful subversion of the collective bargaining process and conduct that constitutes bad faith bargaining under the national labor relations act. \"the nhlpa responded with a statement late friday that it believed the nhl's position was\" completely without merit. \"it had not been served with the lawsuit but said that the nhl\" appears to be arguing that players should be stopped from even considering their right to decide whether or not to be represented by a union. \"earlier, reports surfaced that the players' union has been contemplating dissolution by filing a\" disclaimer of interest, \"which differs from decertification. aaron ward of tsn reported that the nhlpa's executive board voted to give the membership a vote to authorize the board to choose whether to proceed on disclaimer of interest .\" the primary advantage is speed, \"said dana kravetz, managing partner of the law firm michelman & robinson and a specialist in employment counseling and litigation .\" the union is walking away from its right to represent the players. this [disclaimer of interest] is much faster and more informal than decertification, which requires a vote. \"nba players last year filed a disclaimer of interest in mid-november and, despite gloomy declarations of doom, it only took a dozen more days to reach a tentative collective bargaining agreement. the nba's season started on dec. 25. comments are filtered for language and registration is required. the times makes no guarantee of comments' factual accuracy. readers may report inappropriate comments by clicking the report abuse link next to a comment. here are the full full coverage: connecticut school shooting\" width = \"187\" height = \"105\" class = \"headlinethumb\" title = \"juan manuel marquez, manny pacquiao drug tests come back negative - l.a. now 12/14/2012, 7:02 p.m. former indymac ceo <mark>michael perry</mark> to pay $1 million in settlement - entertainment - latimes.com 12/14/2012, 6:33 p.m. - l.a. times - business 12/14/2012, 6:22 p.m. photos: a 2012 apple timeline\" width = \"187\" height = \"105\" title = \"photos: 12-12-12 sandy relief concert\" width = \"187\" height = \"105\" title = \"photos: thousands protest in egypt\" width = \"186\" height = \"105\" title = \"photos: sculptor creates illusions in wood\" width = \"187\" height = \"105\" title = \""}, {"articleID": "2012060114_00034636_W", "names": {"Martin O'Malley": ["Q120260", "Q15221070", "Q20159623"]}, "date": "2012-06-01", "url": "http://baltimoresun.com/news/maryland/bal-mcdonnell-attacks-omalley-on-taxes-20120601,0,6492653.story?track=rss", "content": "virginia gov.bob mcdonnell launched a missile over the potomac yesterday, displaying a video on his republican governors association website attacking md gov. <mark>martin o'malley</mark>'s record of raising taxes. the two neighboring governors lead their receptive party's governors associations but have pledged to cooperate on local issues as they pour money into oppositing sides of campaigns around the country. but both man has a competitive streak. and it seems to be emerging as the fierce gubernatorial race in wisconsin heads into the final days. the video shows a grainy photo of <mark>o'malley</mark> and then a montage of news coverage of his recent income tax hike on people making over $100,000 (including one story from the sun). a blues tune plays and the mcdonnell group promoted the video with the tagline: \"marylanders are singing the blues about gov. <mark>o'malley</mark>'s tax hikes\" the video was put up as news spread that <mark>o'malley</mark> would spend time thursday stumping for commenting policy: readers are encouraged to post comments that are germane to the article. we reserve the right to remove any user, and to delete comments that contain abusive language or personal threats, as well as those that are racist or demeaning. readers may report comments by clicking \"report abuse .\" once a comment has been flagged, a baltimore sun staffer will investigate. annie linskey annie linskey covers state politics and government for the baltimore sun. in her eight years at the sun, she's also covered baltimore city hall, baltimore police and briefly wrote a column on sailing for the anne arundel section. originally from connecticut, annie has also lived in phnom penh, cambodia, where she reported on war crimes tribunals and landmines. she lives in canton. follow her on twitter john fritze has covered politics and government at the local, state and federal levels for more than a decade and is now the baltimore sun's washington correspondent. he previously wrote about congress for usa today, where he led coverage of the health care overhaul debate and the 2010 election. a native of albany, n.y., he currently lives in montgomery county. follow him on twitter at michael dresser is on his second tour of duty covering maryland politics from annapolis. he previously served as state house correspondent from 1996 to 2004, then moved to the transportation beat for seven years, where he wrote the getting there column and blog. earlier in his career, he covered retailing and telecommunications. he lives in ellicott city. follow him on twitter at julie scharper covers city hall and baltimore politics. a native of baltimore county, she graduated from the johns hopkins university in 2001 and spent two years teaching in honduras before joining video: charges against man who says he ate heart, brain of housemate harford county sheriff l. jesse bane details the investigation into the disappea - picture of health - baltimoresun.com man charged with photographing girl in bathroom stall at harborplace - baltimore crime beat - baltimoresun.com"}, {"articleID": "2012083021_00078499_W", "names": {"Josh Fields": ["Q3185962", "Q6288855"], "Tracy Moore": ["Q7831799", "Q7831800"]}, "date": "2012-08-30", "url": "http://newsok.com/josh-fields-is-happy-to-be-healthy/article/3705543?custom_click=rss", "content": "advanced search web search powered by yahoo! <mark>josh fields</mark> was the only oklahoma state quarterback to win bedlam in the past decade before brandon weeden joined the club last year. making the playoffs in triple-a baseball is a different kind of accomplishment. but if albuquerque closes the deal and wins the pacific coast league's south division, it will be rewarding. \"anytime you make the playoffs no matter what level it's good,\" <mark>fields</mark> said. \"and if you win the whole thing, it's sort of like in college football if you go to a bowl game and win. you can put that on your resume. it's looked pretty highly upon. people want winners .\" <mark>fields</mark>, a third baseman for the isotopes, is disappointed it appears he doesn't fit into the parent club los angeles dodgers' long-term plans. but he is encouraged he's been healthy this season and is hitting .319 with 13 home runs and 68 rbis. \"i feel good,\" <mark>fields</mark> said. \"i feel good about the numbers i've put up. i feel good i've stayed healthy. you can only dictate your play. they make the moves they want to make. you hope you're part of them at some point .\" with all the trades they've made and guys they've picked up, it looks kind of bleak. they have a plan and are going to stick with it. i haven't been a part of it so far. they've had a good season. i don't know why they'd change it up much. but you never know. \"<mark>fields</mark>, 29, will be a free agent after the season. he hopes a productive season will lead to an opportunity even if he changes organizations .\" i know i can still hit major league pitching, \"said <mark>fields</mark>, who played at stillwater high school but now lives in florida .\" we have to finish this season first and then we'll see what happens. \"the biggest plus playing for the isotopes is the opportunity to spend time with his parents, wendell and rhonda, during a four-game series that concluded thursday night at chickasaw bricktown ballpark. his wife ashley's parents live in mustang. thank you for joining our conversation on newsok.com. we encourage your discussion but ask that you stay within the bounds of our commenting and posting policy. please help by flagging comments that violate these guidelines. posts that contain obscene or vulgar language will be immediately flagged and not posted. if you prefer your thoughts to appear in the oklahoman, we encourage you to we've upgraded comments. the upgraded comments do not work on internet explorer 7. if you are using internet explorer 8 or internet explorer 9 and do not see comments, turn off compatibility view by clicking the\" broken page \"icon at the right of the address bar. search old obituaries 5,300 historical newspapers. 3-day free trial. start now! oklahoma basketball alumni game pictures from the ou legends alumni game on saturday, aug. 25, in...high school scrimmages, aug. 24 view pictures from high school football scrimmages on aug. 24, 2012. darrell williams rally view photos from a gathering at mt. zion baptist church in...mike baldwin has been a sports reporter for the oklahoman since 1982. mike graduated from okmulgee high school in 1974 and attended oklahoma...mike baldwin has been a sports reporter for the oklahoman since 1982. mike graduated from okmulgee high school in 1974 and attended oklahoma christian university, graduating with a journalism degree in 1978. mike's first job was sports editor of the seminole producer before moving on to the edmond sun as sports editor from 1979-1982. he has covered many beats, starting with high school sports. he has also covered ou, osu and thunder in addition to the dallas cowboys while living in dallas from 1994-2001 while with the oklahoman. oklahoma football: defensive tackle casey walker might not play saturday gop convention notes: ryan wedding and big 12 football don't mix rare pregnancy complication is almost fatal for oklahoma mother and infant be sure to check out our top headlines oklahoma football: defensive tackle casey walker might not play saturday gop convention notes: ryan wedding and big 12 football don't mix rare pregnancy complication is almost fatal for oklahoma mother and infant no one, even oklahoma and oklahoma state, was immune from offseason troubles oklahoma state football: <mark>tracy moore</mark> cited on suspicion of providing alcohol to minor oklahoma state football: expect package involving j.w. walsh to debut against savannah state"}, {"articleID": "2018121719_00640439_W", "names": {"Nick Smith": ["Q16208073", "Q1790063", "Q23992214", "Q390760", "Q6379891", "Q7027945", "Q7027947", "Q7027953", "Q976339"]}, "date": "2018-12-17", "url": "http://feeds.manchestereveningnews.co.uk/~r/menews/~3/1xQwvq9V7NY/wythenshawe-hospital-manchester-crown-court-15564413", "content": "Get daily updates directly to your inbox Subscribe See our privacy notice More newsletters Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email Security guards stole more than £ 200,000 from car park payment machines at Wythenshawe Hospital, a court heard. Hospital bosses said that the money could have instead been used to save lives, and would have funded six nurses for a year. Now gang leader Peter O'Garro, supervisor Stephen Seddon and security officers Christopher Hughes and Shahid Nadeem have all been jailed. Three women, Elizabeth Seddon, Marie McGovern and Karen O'Garro, all wives or partners of the men, were spared jail after laundering or possessing the stolen money. In a statement read to the court by prosecutors, <mark>Nick Smith</mark>, assistant finance director at the hospital, said: \"This amount represents a significant loss for the hospital and its patients and this money would otherwise have been used to enhance the care we provide to our patients .\" For example, it could have been used to fund the salaries of six fully qualified nurses for a full year or for the purchase of major items of medical equipment or lifesaving drugs. \"Stephen Seddon (Image: MEN) Read more of today's top stories The sentencing judge said the crime was motivated by greed, and described it as\" unforgivable'. Judge Hilary Manley said: \"The money was not stolen from some faceless corporate body, but an NHS hospital trust .\" At a time when it is common knowledge that funding the NHS, a service for all, is beset with difficulties, to steal from it is, many would feel, an unforgivable crime. \"The men were eventually caught out after a new member of staff found out what was going on and reported them. A Manchester Crown Court sentencing hearing heard that between June 2015 and February 2016, the men stole £ 207,412 from six car park machines across the hospital. Read More Drunk thug whose\" shirt was ripped' in mosh pit at Royal Blood gig punched innocent woman in the face Read More Police have told idiots throwing rocks from M60 bridges that the could be done for attempted murder Shahid Nadeem (Image: MEN) Hospital security staff were responsible for collecting the money that was deposited into the machines by members of the public, prosecutor Daniel Calder said. Seddon was the security supervisor, while Nadeem, Hughes and O'Garro were security officers all employed by a private firm on behalf of the hospital. Staff were not supposed to have access to the contents of the boxes of notes and coins inside the machines. Hospital protocol meant that they should have immediately been taken to to the cashiers office, for the money to be counted then banked. Christopher Hughes and Marie McGovern (Image: MEN) They were also supposed to sign an electronic register on a computer spreadsheet, recording who was working and who had signed out the key for a particular payment machine. The hospital's computer system made it possible to show how much cash was paid into each parking machine, how much cash was collected and then how much was deposited and then later banked. This would later help prosecutors catch out the thieves. The court was told that the first theft happened in July 2015 and acted as a \"test run'. A total of £ 1,743.60 was taken from a machine, but never taken to the cashiers office while the key was signed out to Seddon and Hughes. Elizabeth Seddon and Stephen Seddon (Image: MEN) Mr Calder said that after the gang were satisfied that the theft had not been detected, the number of thefts then\" dramatically increased'. In August 2015, £ 24,556.70 was stolen. The highest figure was in September 2015, with a total of £ 39,198. In October 2015, £ 37,895.80 was stolen. Then in November 2015, £ 32,031.70 was taken. In December 2015, £ 20,940.10 was stolen. Into the New Year of January 2016, £ 34,444.30 was stolen. Finally in February 2016, £ 16,601.70 was taken by the gang. Their scam was rumbled when a new temporary member of staff started work in the security team. After being trained about the correct banking procedures, the man quickly realised his colleagues were not working as they should have been. Karen O'Garro (Image: MEN) In September 2015, the man overheard Seddon saying that O'Garro was \"getting greedy'. The following month, he then spotted a large amount of cash in the glove box of the security van being driven by O'Garro. He asked O'Garro about the money, and also took a picture of it. Initially O'Garro reacted angrily, but then said the money was\" for all of us. Ten weeks for us, one week for you'. O'Garro invited his colleague into the conspiracy, but he refused. Later, when the man was speaking with Seddon, the defendant warned him \"if you join us, don't get greedy'. Mr Calder said that Seddon also described O'Garro as\" our main guy'. On another occasion when he was out in the security van with Hughes, there was a number of full cash boxes in the boot. When he asked about them, Hughes replied: \"Don't ask any questions. It's none of your business .\" After leaving his job December 2015, he told the hospital about what he had heard. Wythenshawe Hospital The judge praised him as an \"honest man' who had to put up with\" veiled threats' from the defendants, as they realised he knew what they were up to. In February 2016, police arrested O'Garro, Seddon and Hughes at the hospital's security lodge. From inside O'Garro's Mini Cooper, police recovered more than £ 1,100 in coins. Seddon had £ 650 in cash on his person. At the O'Garro family home in Middleton, £ 4,821.34 in coins were recovered. A total of of £ 16,723.65 in cash was seized at the Seddon family home in Failsworth. At the Wythenshawe home of Hughes and McGovern, £ 4,221.34 in cash was recovered. At Nadeem's Cheetham Hill home, £ 1,981.86 almost entirely in coins was found. Officers discovered evidence that O'Garro and Seddon, the prime movers in the gang, had purchased \"high value' goods including electronics, jewellery and clothes. Further investigations led to Karen O'Garro, Elizabeth Seddon and Marie McGovern being brought before the court. The money stolen could have been used to pay for six nurses, hospital bosses said Mrs O'Garro and Mrs Seddon both laundered money stolen by their husbands. Mrs O'Garro deposited £ 15,996.45 stolen by her husband into four bank accounts in her name. Mrs Seddon put £ 6,140 of the stolen money into her bank account, and a further £ 8,041.52 to a credit card in her name. Ms McGovern stored £ 4,221.34 of stolen money at the address she shared with Hughes. Peter O'Garro, 52, of Sherbourne Road, Middleton, who latterly worked for Virgin Media, was jailed for three years, after pleading guilty to theft. Stephen Seddon, 31, of Samuel Street, Failsworth, who trained to be an electrician after losing his job at the hospital, was jailed for two years and six months after pleading guilty to theft. Christopher Hughes, 53, of Burdale Walk, Wythenshawe, who continues to deny his offending, was jailed for two years and three months after being found guilty of conspiracy to steal. Shahid Nadeem, 39, of Blendworth Close, Cheetham Hill, was jailed for two years after pleading guilty to conspiracy to steal. Read More' I was refused a smear test - now I'm battling cervical cancer' Read More Students taken ill after\" pepper spray' let off in high school corridor Karen O'Garro, 48, of Sherbourne Road, Middleton, who works as a nurse at Springhill Hospice in Rochdale, was sentenced to eight months in prison suspended for two years. Trainee teacher Elizabeth Seddon, 32, of Samuel Street, Failsworth, received the same sentence. They both pleaded guilty to converting criminal property. Marie McGovern, 51, of Burdale Walk, Wythenshawe, was sentenced to a two year community order after being found guilty of possessing criminal property. A proceeds of crime hearing aimed at clawing back the gang's ill-gotten gains will be held next year. Got a story or an issue you want us to investigate? Want to tell us about something going on where you live? Let us know - in complete confidence - by emailing newsdesk @ men-news.co.uk, calling us on 0161 211 2323, tweeting us @ MENnewsdesk or messaging us on our Facebook page. You can also send us a story tip using the form here. Join the Manchester Evening News breaking news Facebook group for a place to read and talk about breaking news in Greater Manchester."}]