[{"articleID": "2019012323_00082684_W", "names": {"Jesus Ramirez": ["Q1688370", "Q553050"]}, "date": "2019-01-23", "url": "https://wtop.com/latin-america/2019/01/many-latin-american-governments-support-venezuelas-guaido/", "content": "Home \"Latin America News\" Many Latin American governments...Many Latin American governments support Venezuela's Guaido By The Associated Press January 23, 2019 5:59 pm 01/23/2019 05:59 pm Share Anti-government protesters cheer after Juan Guaido, head of Venezuela's opposition-run congress, declares himself interim president of the South American country until new elections can be called, at a rally demanding the resignation of President Nicolas Maduro, in Caracas, Venezuela, Wednesday, Jan. 23, 2019. (AP Photo/Boris Vergara) Numerous governments in the Western Hemisphere quickly recognized Venezuelan opposition leader Juan Guaido as the interim president of his crisis-torn country Wednesday. The United States and all but one member of the Lima Group of regional nations threw their support behind Guaido after he declared himself interim president in a defiant speech before masses of anti-government demonstrators. The declaration by the Lima Group, which has been vocal in denouncing Venezuelan President Nicolas Maduro, was signed by Argentina, Brazil, Canada, Chile, Colombia, Costa Rica, Guatemala, Honduras, Paraguay and Peru. Mexico was the only member to not sign. The group said it supported the beginning of the process of a democratic transition in Venezuela following its constitution with aim of carrying out new elections as soon as possible. It also condemned acts of violence in Venezuela and made a call for peace. U.S. President Donald Trump called on Maduro to resign and said the U.S. would use the \"full weight\" of its economic and diplomatic power to push for the restoration of Venezuela's democracy. Venezuelans have been suffering from an economic and governance crisis that has led millions to flee hyperinflation and severe shortages of food and medicine. Paraguay was the first regional country to express support after Guaido took an oath before thousands of supporters. \"Count on us to embrace freedom and democracy again,\" Paraguayan President Mario Abdo Benitez said on Twitter. Brazilian President Jair Bolsonaro said Latin America's largest nation also would support the 35-year-old lawmaker \"so that peace and democracy return to Venezuela .\" There was no immediate reaction from Cuba, which is the top regional ally of Maduro, nor from Nicaragua, which is also close to Maduro's socialist government. Maduro was sworn into a contested second term two weeks ago in a move condemned by dozens of nations. Guaido has said it is his right under Venezuela's constitution to take over the presidency until new elections can be called. But not everyone backed his bold move. Bolivian President Evo Morales condemned what he called an imperialist attack. \"Our solidarity with the Venezuelan people and Nicolas Maduro, in these decisive hours when the claws of imperialism are once again trying to deal a death blow on democracy and self-determination on the peoples of South America,\" Morales tweeted. \"We will not be the backyard of the U.S. again .\" A spokesman for Mexican President Andres Manuel Lopez Obrador said Mexico continued to recognize Maduro as Venezuela's president. \"We maintain our position of neutrality in the Venezuelan conflict,\" <mark>Jesus Ramirez</mark> Cuevas told Mexico's Milenio news television channel. \"The Mexican government is analyzing the situation in Venezuela. Until now, there is no change in its diplomatic relations with that country nor with its government .\" Maduro responded to Guaido's move by cutting off diplomatic relations with the U.S., the largest importer of Venezuelan oil, and announced that American diplomats had 72 hours to leave his country. He also heaped much of the blame for developments on U.S. imperialism and Colombia's \"oligarchy .\" Colombian President Ivan Duque said his nation would accompany Guaido \"in this process of transition toward democracy so that the Venezuelan people can free themselves from the dictatorship .\" Copyright © 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed. More News"}, {"articleID": "2016050419_00576080_W", "names": {"Terry Farrell": ["Q15294046", "Q258612", "Q458881"]}, "date": "2016-05-04", "url": "http://www.bclocalnews.com/news/378152541.html#storyComments", "content": "Comox Valley community cleaned up well posted May 4, 2016 at 12:00 PM <mark>Terry Farrell</mark> Record staff The Comox Valley Community Clean-Up grew in 2016, not only in participation size, but also in the collective haul. Simultaneous clean-ups at various locations in the Valley accounted for a total of more than 33,000 pounds of trash being hauled to the dump, and accepted, free of charge. The inaugural Pick A Park aspect of the day was a great success, with dozens of people helping out at different locations, from the waterfront along Lazo Road (Point Holmes Recreation Association), to areas on Lake Trail Road (thanks to Comox Valley Land Trust and Morrison Streamkeepers), and many points in between. The Comox Valley Chamber of Commerce tidied Standard Park. The Comox Valley Pickleball Association adopted the Highland Park area. We Are Wildness, and Kindred Custom Snowboards converged on Farnham Road to clean that area together. We had neighbourhood groups cleaning up their areas (residents along Minto Road were responsible for gathering nearly a ton of garbage), and others who took on popular pathways, such as the Royston Trail (600 pounds picked up there). A crew of volunteers tackled a couple of troublesome spots along Piercy Road, picking up everything from couches to the burned out shell of a boat. Schools even got into the spirit of the event. Saltwater Waldorf School spent a day earlier in the week cleaning up an area west of the Comox Lake Dam. One group that did an outstanding job was the crew from the Fanny Bay area, as organized by James Barth and his Facebook group \"Stop Comox Valley Illegal Dumping .\" Approximately 20 people took ownership of an area at the end of Cook Creek Road and collected 9,900 pounds of garbage in just over four hours of work. Barth acknowledged members from the Comox Valley ATV Club, the Fanny Bay Community Association and even a group from Campbell River that came to lend a hand. \"I help them and they help me,\" Barth said of the Campbell River crew, members of a Facebook group called \"Keep Our Region Beautiful - Help Prevent Illegal Dumping .\" We had a bin supplied by B & D (Containers) - they dropped it off, they picked it up, driver was excellent to deal with, \"said Barth .\" And the CVRD was definitely a help, giving me tips on how to get it all done - that would have been Stephanie. So it went across very well. \"Barth said despite being familiar with the area, the amount of garbage picked up surprised him .\" I had absolutely no idea, \"he said .\" Within two hours, half the bin was full. It blew me away - just blew me away. \"Not to be outdone were the 39 Courtenay and District Fish and Game Protective Association members, who sent 22,500 pounds of garbage to the dump .\" One of the nice things that a lot of people noticed, is many of the areas that have been problem areas in the past weren't problems this year, \"said Courtenay and District Fish and Game Club caretaker Dave Munk. J.R. Edgett Excavating Ltd., donated a backhoe and truck, with drivers, for the day and Gary Marcus Trucking also supplied a truck and a backhoe, for the heavy lifting. Dim's Bins supplied a bin on-site at the F & G, free of charge, for easy dumping access, and Thrifty Foods went above and beyond, supplying free lunch for everyone who showed up at the Fish and Game clubhouse afterwards. We encourage an open exchange of ideas on this story's topic, but we ask you to follow our guidelines for respecting community standards. Personal attacks, inappropriate language, and off-topic comments may be removed, and comment privileges revoked, per our Terms of Use. Please see our FAQ if you have questions or concerns about using Facebook to comment."}, {"articleID": "2018100121_00081141_W", "names": {"Dinesh Sharma": ["Q27918253", "Q5278101"]}, "date": "2018-10-01", "url": "http://www.theshillongtimes.com/2018/10/02/yogi-meets-vivek-tiwaris-family/", "content": "NATIONAL Yogi meets Vivek Tiwari's family By Agencies Last updated Oct 1, 2018 Lucknow: The family of a tech company executive, shot dead by a policeman in the Gomti Nagar area here, met Chief Minister Yogi Adityanath on Monday and said that they \"have faith\" in the state government. \"I have said earlier that I have faith in the state government. This faith has been strengthened after meeting the CM. I have lost capacity to take a stand after the unfortunate incident, which should not have happened. It has shaken me. After meeting the CM, I have gained confidence that I will be able to fulfil the responsibilities my husband left on me,\" said Kalpana Tiwari, the wife of Vivek Tiwari (38). The executive was shot dead on September 29 when he allegedly refused to stop his car. \"All my demands have been met. I wanted strict action against the guilty, a job, accommodation, expenses for education of my daughters and my mother-in-law. The CM acceded to all my demands,\" she told reporters. The chief minister assured family of all the possible help and also met the two daughters and consoled the family promising strict action against the guilty. \"The family is satisfied with the action taken. We will be giving all possible help to the victim's family including a job to Kalpana as per her educational qualifications. A relief amount of Rs 25 lakh, two fixed deposits of Rs 5 lakh each in the name two daughters of the victim and a Rs 5 lakh FD for mother-in-law has been approved by the CM,\" Deputy Chief Minister <mark>Dinesh Sharma</mark> told PTI. (PTI)"}, {"articleID": "2017042619_00083891_W", "names": {"C. Taylor": ["Q56557075", "Q57691505"], "Jim Kennedy": ["Q22088211", "Q6196096", "Q8013466"], "John Dyer": ["Q39079211", "Q6230595", "Q6230596"]}, "date": "2017-04-26", "url": "http://fmqb.com/article.asp?id=3027413", "content": "Cox Enterprises Names Alexander <mark>C. Taylor</mark> President/CEO April 26, 2017 Cox Enterprises Chairman <mark>Jim Kennedy</mark> today named Alexander <mark>C. Taylor</mark>, Executive Vice President and COO, as the company's next President and CEO, effective Jan. 1, 2018. <mark>Taylor</mark> will succeed <mark>John Dyer</mark>, President and CEO, who will retire in December after 40 years with the company. <mark>Dyer</mark> and <mark>Taylor</mark> will both continue serving on the Cox Enterprises' board of directors. <mark>Taylor</mark> oversees Cox Communications, Cox Automotive and Cox Media Group, as well as the company's long-term growth and investment plans, and is the great-grandson of company founder Gov. James M. Cox. \"It's especially meaningful for me that a fourth-generation Cox family member will lead the company my grandfather started in 1898,\" said <mark>Kennedy</mark>. \"Alex has a deep understanding of our company and its culture. Cox has thrived in business because we believe in doing good and being a contributor to society. Alex shares this commitment to our employees and communities .\" <mark>Taylor</mark> has held numerous positions within the company's divisions. He was SVP/Field Operations for Cox Communications and EVP/President of Cox Media Group, where he oversaw its largest television, radio, newspaper and digital properties. He also led the creation of the company's first cross-platform newsroom. <mark>Taylor</mark> began his career at Cox as a reporter for the Grand Junction Daily Sentinel in Colorado in May 2000. <mark>Taylor</mark> previously served as Cox Enterprises' EVP/Strategic Investments. He also oversees Cox's investments in the Cox Innovation Fund and True North Venture Partners."}, {"articleID": "2012013120_00060339_W", "names": {"Rick Hansen": ["Q7331438", "Q978803"], "Dan Campbell": ["Q1159021", "Q5213225"]}, "date": "2012-01-31", "url": "http://highrivertimes.com/ArticleDisplay.aspx?e=3455743", "content": "it was a cold january day in 1987 when one of canada's greatest heroes, <mark>rick hansen</mark>, came into town as part of his man in motion world tour. <mark>hansen</mark>, who was nearing the end of his world tour to raise money for spinal injury research, arrived in town to a heroes welcome. kicking things off for <mark>hansen</mark> was a 30 minute speech at joe clark school, which saw over 600 people cram into the gymnasium to see the man himself. after his presentation, <mark>hansen</mark> received a cheque for $17,000 to help him with his fundraising, which was no small amount for a small town like high river. \"this is just the beginning, i want to thank you all for being a part of it,\" <mark>hansen</mark> told the crowd. <mark>hansen</mark> stayed in nanton for the night before coming to high river. as he came into town, dozens of children and residents began to run behind me. by the time he reached joe clark school, there were over 100 residents running behind the two motor homes, two donation vans, two rcmp cars, a truck towing a trailer full of spare wheelchairs, a camper and an alberta government telephones van that were already following him. at the time <mark>hansen</mark> was almost two years into his journey, which began in vancouver on march 25, 1985, over which he had covered 37,000 kilometres. lorne ball introduced <mark>hansen</mark> to the crowd at joe clark and presented him with a large cheque for his fundraising efforts. \"on behalf of the town of high river, i would like to extend our heartiest appreciation for your courage and determination,\" said deputy mayor <mark>dan campbell</mark>. lorne ball, the master of ceremonies for the assembly went a step further in congratulating <mark>hansen</mark>. \"canada's greatest athlete <mark>rick hansen</mark>,\" ball said when introducing <mark>hansen</mark> to the crowd. <mark>hansen</mark> naturally had high praise for high river. \"i want to thank everybody for their fantastic support, not only here in this event, but those people who have taken time to come out on the road to show their encouragement,\" <mark>hansen</mark> said at the time. with still plenty of time and kilometres ahead of him, <mark>hansen</mark> left the school quickly after the ceremony to make his way to okotoks for yet another gathering."}, {"articleID": "2015102701_00065274_W", "names": {"Kevin Mccarthy": ["Q26837187", "Q281404", "Q56875753", "Q6377709", "Q6396888", "Q6396889", "Q6396891", "Q766866"]}, "date": "2015-10-26", "url": "http://globegazette.com/news/opinion/columns/doyle-mcmanus-ryan-s-fight-for-the-gop-s-soul/article_b2e002cc-ece3-5895-8365-7fb74c6143ee.html", "content": "Doyle McManus: Ryan's fight for the GOP's soul (TNS) | For apple lovers, this is the best time of the year. The markets are full of what seems to be an unending variety of apples, from Pink...Recent CEDAR FALLS | For the first time in weeks the University of Northern Iowa football team earned that extra inch, earned that extra yard in its...Recent PHILADELPHIA (AP)--The Liberty Medal has been presented to representatives of the Dalai Lama in recognition of his efforts to promote compass...Recent Doyle McManus: Ryan's fight for the GOP's soul Saved 2015-10-26T20:45:00 ZDoyle McManus: Ryan's fight for the GOP's soulMason City Globe Gazette46 seconds ago Enlarge Photo Less than a year ago, after Republicans rolled up big majorities in the 2014 congressional elections, their leaders set out to show the nation that conservatives were up to the challenge of governing. \"The logjam in Washington has been broken,\" declared House Speaker John A. Boehner, R-Ohio, and Senate Majority Leader Mitch McConnell, R-Kentucky. \"We will make it our job to prove the skeptics wrong .\" So far, alas, the skeptics have been right. The GOP's big majority in the House became a curse, not a blessing; little of the legislation that Boehner and McConnell sought has passed. Instead, the GOP's zealously conservative Freedom Caucus pushed Boehner out of office and blocked the rise of his chosen successor, Rep. <mark>Kevin McCarthy</mark> of California. \"We are not solving the country's problems; we are only adding to them,\" Rep. Paul D. Ryan, R-Wisconsin, acknowledged last week as he announced his decision to seek the speaker's chair. By all accounts, Ryan is likely to win the job easily. Last week, he won support from all three wings of the House's factionalized Republicans. That will give him a chance to start over. \"We can show the country what a common-sense conservative agenda looks like,\" he told his colleagues. Still, Ryan faces the same challenge that brought down Boehner and <mark>McCarthy</mark>: the Freedom Caucus, which not only spurns bipartisan compromises but has made its first goal to purge the GOP of its moderates. And amazingly, some Freedom Caucus members consider Ryan, a thoroughgoing conservative by any traditional definition, to be dangerously moderate. Ultras in the Freedom Caucus distrust Ryan because, as chairman of the House's tax-writing committee, he made a bipartisan budget deal to keep the government running in 2013. (Any deal had to be bipartisan because the Democrats had a majority in the Senate that year .) Others worry because he long supported bipartisan efforts for comprehensive immigration reform, even though he's abandoned that goal in the face of grassroots opposition. One even derided Ryan for wanting to preserve time to spend with his young family. \"It's like interviewing a maid for a job and she says,' I don't clean windows,'\" Rep. Matt Salmon, R-Arizona, told the Hill. Remarkably, Ryan met these truculent revolutionaries halfway, even though he was already the choice of most House Republicans. The Freedom Caucus demanded changes in House rules to reduce the speaker's power; Ryan agreed that the GOP conference should consider the idea. The caucus asked him to promise that he would never allow a floor vote on any measure unless a majority of Republicans supported it (the \"Hastert Rule\" ); Ryan agreed. And the Freedom Caucus rejected Ryan's proposal to change a rule that allows a single member to call for a vote to remove the speaker, a weapon it used against Boehner. Ryan agreed to postpone the issue. It was a remarkable process. The Freedom Caucus, with less than one-fifth of GOP members in its ranks, won concessions from a man most other Republicans considered their only viable candidate for the job. Still, beneath his show of flexibility, Ryan appeared to be pursuing a pragmatic strategy of divide and conquer, a course that might enable him to defuse the Freedom Caucus as a constantly ticking time bomb. Ryan has the suppor t of about two-thirds of the Freedom Caucus' members, a break from the group's customary unity. Until now, the group has maintained its influence by wielding an undivided bloc of about 40 votes, just enough to deprive Boehner or any other speaker of his working majority. But as my colleague Lisa Mascaro pointed out in The Los Angeles Times last week, that unity is showing signs of fraying. At least two members recently quit the caucus. If Ryan can co-opt half or more of the Freedom Caucus' members, the group's leverage will erode. A divided caucus won't be able to take Speaker Ryan hostage the way it tormented Boehner and <mark>McCarthy</mark>. But making that strategy work won't be easy. Ryan's House faces a series of daunting tests, the same tough fiscal issues that divided Republicans under Boehner. Congress must raise the federal debt limit by Nov. 3; Boehner may stay in office just long enough to engineer a bipartisan vote with Democratic support, relieving Ryan of a headache. But soon after that, Congress must pass a funding bill to keep the government running after Dec. 11. And then Congress turns to the budget, in search of a two-year deal that would last past the 2016 presidential election. All three measures will almost certainly need President Obama's signature to pass, which means GOP leaders will need to compromise somewhere. \"Whatever our differences, we're all conservatives,\" Ryan told House Republicans last week. His election as speaker may give his party a moment of unity, but it will also open a new phase in the unfinished battle over the GOP's soul. The members of the Freedom Caucus haven't promised him a honeymoon; only a truce. Doyle McManus is a columnist for the Los Angeles Times. Readers may send him email at doyle.mcmanus @ latimes.com. Copyright 2015 Mason City Globe Gazette. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}, {"articleID": "2010111602_00625976_W", "names": {"Garry Moore": ["Q5524191", "Q5524192"]}, "date": "2010-11-15", "url": "http://tvweek.com/blogs/tvbizwire/2010/11/tv-writer-coleman-jacoby-dies.php", "content": "tvbizwire tv writer coleman jacoby dies; he introduced jackie gleason to art carney, and created memorable gleason characters such as joe the bartender and reginald van gleason iii ny times coleman jacoby, who wrote some of jackie gleason's most memorable characters on the dumont network's \"cavalcade of stars\" in the 1950s, has died, the new york times reports. he was 95 years old. jacoby and his partner arnie rosen were hired to write sketches for gleason, creating some of his best-known characters, including \"that devil-may-care playboy\" reginald van gleason iii (for a clip, click here), joe the bartender, charlie bratton the loud mouth and the inept rudy the repairman, the story says. jacoby and rosen are also credited with introducing art carney to gleason, when the pair suggested carney, with whom they had worked with on a cbs radio show, for a part in a role in the first reggie van gleason skit, the article notes. gleason and carney went on to star in the 1950s comedy \"the honeymooners .\" in 1956, jacoby and rosen were tapped to write for \"you'll never get rich,\" a comedy starring phil silvers as sergeant ernie bilko, which was later known as \"the phil silvers show .\" following that, they wrote for \"the <mark>garry moore</mark> show\" for five years, and split when rosen left to produce \"the carol burnett show\" in 1967. jacoby went on to form jacoby-monet productions, which made television specials. he is survived by his daughter, catherine loria parker. how much larry hagman can viewers expect in tnt's new version of \"dallas'?\" enough,' says one of the show's other returning stars chuck ross, november 8, 2010 at 7:51 am with conan debuting on tbs, here's the real reason he's no longer on nbc right after stations' late news. and what conan should really be doing chuck ross, november 3, 2010 at 9:13 am the puzzling failure of obama and the democrats: how we suffered for our sanity. how we tried to set them free. they would not listen. they did not know how. perhaps they'll listen now. (but don't count on it) chuck ross, october 28, 2010 at 7:01 am reality check: life is not fair. nowhere is that more true than in hollywood, where values depend upon your value to hollywood hillary atkin, october 26, 2010 at 4:55 am leo burnett, one of the great ad men, said, \"make it simple. make it memorable. make it inviting to look at. make it fun to read .' burnett would have been in love with this season's startling, surprising\" mad men .' an appreciation report: two gosselin sextuplets expelled from private school work for disney and like to text and drive? if if doesn't kill you, it could get you fired americans continue to dump cable tv service tori spelling finds co-host for daytime talk show she's developing with abc \"dexter' actress tapped for recurring\" true blood' role the last laugh? comedies actually bucking trend of lower ratings this season kanye west says he's canceling his upcoming \"today' show performance\" for obvious reasons' following his interview this week with matt lauer deja vu all over again: brett favre says he's retiring most interesting non-tv story of the day: scientists have figured out how cats drink water without getting wet (no, they don't use tiny straws) panelist from \"the view' lands spot on scripted show kanye west accuses matt lauer of ambushing him with a\" brutal' interview. plus the video interview itself, which contains lauer's response do you own an ipad? survey says you're more likely to cut pay tv service"}, {"articleID": "2017113000_00015598_W", "names": {"Stanley Johnson": ["Q16239572", "Q28580377", "Q29643064", "Q45736371", "Q7599711"]}, "date": "2017-11-29", "url": "http://www.dailystar.co.uk/showbiz-tv/im-a-celebrity-get-me-out-of-here/663622/Im-A-Celebrity-2017-Declan-Donnelly-replaced-Ant-McPartlin-Bob-the-medic-emergency", "content": "Following the news that I'm A Celebrity contestant Rebekah Vardy was ruled out of the latest Bushtucker trial due to having low blood pressure. I'm A Celeb host Dec was hosting alongside Ant McPartlin when Bob the medic was suddenly called in to check him over. Bob ruled him unfit to do the link and he was told sit out before taking an emergency oxygen mask. ITV MEDICAL WORRIES: A medic was called over for Dec live on TV ITV MEDICAL CHECK: Bob the medic ruled Dec too ill to present the link Sexiest I'm a Celebrity shower scenes We've rounded up the sexiest EVER shower scenes from I'm a celebrity...get me out of here. From THAT Myleene Klass bikini to Jordan's cornrows in the shower here are our favourites. 1 / 76 ITV/REX Vanessa White puts on the hottest shower scene in the history of I'm a Celebrity The medical expert then took over Dec's role and delivered Dec's next line. Ant was so impressed with Bob's efforts that he sacked Dec and renamed their show Ant and Bob's Saturday Night Takeaway. Poor Dec looked devastated as he suddenly jumped up to share his outrage. ITV OXYGEN MASK: Dec had to sit at the back of the set to get some oxygen I'm A Celebrity Kings & Queens Look back through all the celebrities crowned Kings and Queens of the jungle. 1 / 17 ITV Fans took to social media to laugh at the funny moment. One said: \"The look of utter betrayal on Dec's face .\" Another added: \"I think Dec should pair up with Kiosk Keith! Dec and Kiosk Keith does it for me .\" A third chipped in: \"Can we rule Dec out of presenting on medical grounds so that we get to see more of Ant & Medic Bob?\" ITV REPLACED: Ant asked Bob to present Saturday Night Takeaway with him Jorgie Porter hottest pictures I'm a Celeb Jorgie Porter shows off her curves in these sexy pictures. 1 / 66 Instagram Jorgie Porter hottest pictures A fourth wrote: \"I will miss Dec.. but will get used to the Ant n Bob Saturday Night Takeaway .\" Meanwhile, <mark>Stanley Johnson</mark> and Kezia Dugdale failed to impress viewers with their attempt at the trial. The pair only managed to bring home 5 meals for the team. I'm A Celeb continues tomorrow at 9pm on ITV. Related articles Holby City accused of copying Emmerdale in major faux pas I'm A Celebrity's Ant and Dec forced to apologise for \"rude' comments to Iain Lee Coronation Street to bring iconic character back from the dead in epic resurrection"}, {"articleID": "2011030117_00114311_W", "names": {"Chris Mullin": ["Q289398", "Q5107532"], "James Worthy": ["Q13735171", "Q27038737", "Q362872"], "Bob Knight": ["Q16538199", "Q4933049", "Q888594"]}, "date": "2011-03-01", "url": "http://Michigan.rivals.com/content.asp?CID=1194831", "content": "<mark>chris</mark> balas thewolverine.com senior editor the fort michigan freshman tim hardaway jr. earned his third straight big ten freshman of the week award after leading michigan to a key road win over minnesota, but yahoo.com gave its conference freshman of the year honor to another frosh - and not ohio state's jared sullinger. sullinger earned yahoo.com's conference player of the year award after averaging 17.4 points and 9.8 rebounds per game for the no. 1 buckeyes (27-2), with u-m sophomore darius morris earning second-team honors. instead of awarding the freshman of the year to sullinger, as well, yahoo gave it to ohio state point guard aaron craft. craft has been, without question, a key player on ohio state's run to the top of the ncaa heap, averaging 7.1 points and 4.6 points per game while shooting 38.6 percent from three-point range. in addition to winning freshman of the week honors four times, though, hardaway has:? averaged 13.6 points per game overall and 14.6 in big ten play (a remarkable 20.8 in his last five).? shot 44.9 percent from three-point range in big ten play, 46.4 percent overall, and grabbed 3.9 rebounds per game .? shot 60 percent from long range in his last five games to help keep the wolverines in the hunt for an ncaa tournament berth when most picked them among the league's bottom two teams. hardaway averaged 19.0 points. 3.5 rebounds, 2.0 assists and 1.0 steals per game, shooting 54.2 percent from the field (13-for-24) and 60.0 percent from three-point range (9-for-15) against wisconsin and minnesota to earn player of the week honors. he knocked down five triples in the first half of a 70-63 win at minnesota, and his putback with less than three minutes to go and three big free throws in the closing seconds helped u-m seal its fourth road win in the big ten hardaway has scored in double figures in his last 11 games - leading u-m in seven of those games - and has 22 double-digit games overall this season, and there's still a game to play saturday vs. michigan state (begging the question - why release an all-big ten team now, anyway?). **** will michigan make the field of 68? the wolverines are only listed on 10 of 28 brackets at this point, but that's likely to change if the wolverines beat michigan state saturday (in a contest that's sold out and, the athletic department has declared, a maize out, meaning u-m fans are expected to wear their maize to the 2:00 (cbs tv) game). a victory means the wolverines will likely finish in a three - or four-way tie for fourth place in the big ten depending on what happens with the following teams: illinois: the illini seem headed for a 9-9 finish, standing 8-8 with games on tap at purdue (tuesday) and home to indiana saturday. michigan state: the spartans (8-8) host iowa for senior night wednesday before traveling to ann arbor saturday. penn state: psu (8-8) has been good at home but gets a huge test tonight against ohio state before traveling to minnesota sunday. if all four teams finish 9-9, the wolverines earn the no. 4 seed by virtue of the tiebreaker (overall record against the others tied with them). u-m would hold a 4-1 record against the other three. if penn state were to lose two, illinois would be the four seed and u-m five. either way, a victory (and at least one psu loss) assures the wolverines of a first-round bye and a friday big ten tournament game the following week. a loss to the spartans and u-m would be playing on thursday, but bracketology 101 believes michigan can secure a bid. \"michigan made the cut, despite their loss at home to wisconsin on wednesday, because we think they have a decent chance to beat michigan state at home this weekend and then win their first big ten tourney game,\" they wrote. **** in other basketball news, former michigan great cazzie russell (1964-66) earned a place in the national collegiate basketball hall of fame, the national association of basketball coaches (nabc) foundation announced monday. the class of 2011 also includes ralph sampson (virginia), <mark>james worthy</mark> (north carolina) and <mark>chris mullin</mark> (st. john's), coaches <mark>bob knight</mark> and eddie sutton and contributors joe vancisin and eddie einhorn. the honorees will be inducted into the national collegiate basketball hall of fame on sunday, nov. 20, at the midland theatre in kansas city as part of a three-day celebration of college basketball. a three-time all-american and two-time big ten player of the year, russell led the wolverines to the ncaa final four as a sophomore and again as a junior, when u-m finished as national runner-up to ucla. russell was named national player of the year as a senior, when he averaged 30.8 points per game, and helped michigan to the elite eight. \"i stayed up the night before [my last game] thinking i've been here four years, all this is about to end and then i'm going to have to face the world,\" russell told the wolverine back in 2006. \"it was a great, great opportunity for me as a young man to have gone to a great institution like michigan. no matter what anybody says, nobody will ever take that away from me? it's not because of what i did or that my name is always brought up, but because of the group of guys i played with, the atmosphere there, the people i met .\" russell completed his collegiate career with 2,164 points while leading the wolverines to a three-year mark of 65-17 and three consecutive big ten titles. he played for 12 seasons in the nba with the new york knicks, golden state warriors, los angeles lakers and chicago bulls and later coached for a number of seasons in the continental basketball association, was an nba assistant and the head coach at savannah college of art and design. **** a must-see for michigan basketball fans: the latest all-access offering from johnbeilein.com, this one behind the scenes from u-m's overtime win at iowa in which several players stepped up down the stretch. after stepping up with two, key free throws to send the game into overtime. **** finally, who to root against if you're a michigan fan watching other bubble teams this week? here are a few teams of interest and who they play: baylor: tuesday at oklahoma state, saturday vs. texas memphis: wednesday at ecu, saturday vs. tulane colorado: wednesday at iowa state, saturday vs. nebraska alabama: tuesday at florida, saturday vs. georgia clemson: wednesday at duke, saturday vs. va. tech maryland: wednesday at miami, saturday vs. virginia richmond: wednesday at st. joe's, saturday vs. duquesne boston college: wednesday at va. tech, saturday vs. wake forest"}, {"articleID": "2008112611_00015150_W", "names": {"Heather Jones": ["Q14159639", "Q5693910"]}, "date": "2008-11-26", "url": "http://journalgazette.net/apps/pbcs.dll/article?AID=/20081126/LOCAL/811260319/1044/LOCAL08", "content": "published: november 26, 2008 6:00 a.m. diabetes group trims staffer, area presence michael schroeder the journal gazette advertisement an area diabetes outreach position has been eliminated and some people fear that could leave local parents of children with diabetes in the cold. nicole hansen has been employed by the indiana chapter of the juvenile diabetes research foundation international since 2003, working out of her home in auburn as a special events coordinator. that will end dec. 4, as the state chapter seeks to centralize its efforts in indianapolis. \"this is a model that we use throughout the state...(and) country,\" said linda gann, executive director for the organization's state chapter, said of centralization. gann points out that the chapter has never had a physical office in the area and says volunteers will continue to provide services for area parents and raise money for research. but <mark>heather jones</mark>, the mother of a 13-year-old girl with diabetes, thinks local efforts will suffer in hansen's absence. she lauded hansen's outreach work and said her experience as a parent of a child with diabetes made her a good fit for the job. the foundation provides free backpacks with informational materials about type 1 diabetes, which usually strikes in childhood through early adulthood; helps parents get connected with other parents in the same situation; and holds fundraising events. \"you're not going to have that personal connection\" with someone in indianapolis, said <mark>jones</mark>, who lives between auburn and butler. another parent also said hansen will be missed, a sentiment <mark>jones</mark> said many parents share. <mark>jones</mark> is worried connections between local families helped along by hansen will be fractured without a paid staffer positioned in northeast indiana. <mark>jones</mark> says it's particularly hard to endure a child's diabetes diagnosis without the support of other families that have been through it - there's a lot to learn and it can be an emotional rollercoaster. she also thinks local fundraising efforts will suffer. hansen said the foundation has raised more than $1 million - most going to research - through six local fundraising walks during her tenure. for her part, hansen said she believes in the organization and its mission, but questions the decision to eliminate her position. she says it is going to be a challenge for people to get connected if they have to go through the indianapolis office. gann says the foundation isn't alone in its effort to centralize efforts, pointing to the american diabetes association. she doesn't anticipate the drop-off in services others fear, reiterating the organization's reliance on volunteers."}]