[{"date": "2014-02-11", "url": "http://www.timesofmalta.com/articles/view/20140211/world/uk-mps-vote-to-ban-smoking-in-cars.506271", "content": "Press Association Commons votes to ban smoking in cars carrying children Campaigners have welcomed plans backed by MPs which could save hundreds of thousands of children from being exposed to second-hand smoke in cars. Leading medical charities said they were \"delighted\" that the House of Commons had voted in favour of paving the way for for legislation which could outlaw smoking in vehicles carrying children. The Commons gave the Health Secretary the power to impose a ban despite the opposition of some MPs, including leading members of the Cabinet. Ministers were granted a free vote on the measure - successfully introduced by Labour in a House of Lords amendment to the Children and Families Bill - meaning they were not tied to a party line. The British Medical Association (BMA), which has campaigned for a ban since 2011, said the vote was an \"important step forward in reducing tobacco harm\". Dr Penny Woods, chief executive of the British Lung Foundation, said: \"Having campaigned on this issue for many years, we're absolutely delighted that MPs have backed the ban on smoking in cars carrying children .\" This could prove a great leap forward for the health of our nation's children. \"The introduction of a law that would help prevent hundreds of thousands of children from being exposed to second-hand smoke in the car is now within reach .\" With both Houses of Parliament having made their support for the ban clear, the onus is now on the Government to act accordingly and make this crucial child protection measure law at the earliest opportunity. \"The charity estimates that in England more than 430,000 children aged 11 to 15 are exposed to second-hand smoke in cars every week. Research published by the organisation last year concluded that 185,000 children of the same age are exposed to smoke while in the family car on\" most days \", if not every day. Deborah Arnott, chief executive of health charity Ash (Action on Smoking and Health) described the vote as\" an historic victory for Parliament and for children's health \". Tory and Liberal Democrat MPs joined forces with Labour MPs to approve the ban by 376 votes to 107, majority 269. Prime Minister <mark>David Cameron</mark> missed the vote while visiting flood-stricken areas in the south west. Mr <mark>Cameron</mark>'s official spokesman declined to say which way the Prime Minister would have voted had he been able to attend Parliament. But he told a regular Westminster media briefing:\" While he understands the concerns that some have expressed, his view is that the time for this kind of approach has come. \"Health Secretary <mark>Jeremy Hunt</mark> was in favour of the move, together with Chancellor <mark>George Osborne</mark>, Chief Secretary Danny Alexander, Defence Secretary <mark>Philip Hammond</mark> and Education Secretary Michael Gove, International Development Secretary Justine Greening, Scotland Secretary Alistair Carmichael and Energy Secretary Ed Davey. Justice Secretary Chris Grayling was in the\" no \"camp of those who said it was unenforceable. Home Secretary <mark>Theresa May</mark>, Work and Pensions Secretary Iain Duncan Smith and Northern Ireland Secretary Theresa Villiers also opposed the ban. Deputy Prime Minister Nick Clegg missed the vote but has spoken out against attempts to\" sub-contract responsible parenting to the state \". Also missing were Foreign Secretary <mark>William Hague</mark>, Business Secretary Vince Cable, Communities Secretary Eric Pickles, Environment Secretary <mark>Owen Paterson</mark>, who is out recovering from eye surgery, Transport Secretary <mark>Patrick McLoughlin</mark>, Culture Secretary <mark>Maria Miller</mark> and Wales Secretary <mark>David Jones</mark>. Shadow public health minister Luciana Berger welcomed the result as a\" great victory for child health \"but warned ministers not to\" kick this into the long grass \". But pro-smoking groups branded the move as an\" unnecessary intrusion \". <mark>Simon Clark</mark>, director of the smokers' group Forest, said he was\" disappointed but not surprised \"by the decision and accused the Government of being\" spineless \". He added:\" Legislation will have very little impact because so few adults still smoke in cars carrying children. Those that do will carry on because it will be very difficult to enforce. \"Government has banned smoking in public places. Now they're going to ban it in a private place. The home will be next .\" Health Minister Jane Ellison told MPs the success of a smoking ban in cars carrying children will not be measured by the number of times the police enforce it. Instead, she said, its success would be gauged by the reduction in exposure to second-hand smoke. AA president Edmund King said: \"As has been the case with enforcing the ban on hand-held phones while driving, campaigns and legislation have been shown to reduce illegal behaviour afterwards. If a new law manages to make more adults think twice before lighting up with the kids on board, it will have helped .\" Comments are submitted under the express understanding and condition that the editor <mark>may</mark>, and is authorised to, disclose any/all of the above personal information to any person or entity requesting the information for the purposes of legal action on grounds that such person or entity is aggrieved by any comment so submitted. A subscription is required to access Times of Malta content from overseas.", "articleID": "2014021114_00015779_W", "names": {"Theresa May": ["Q264766", "Q30161835"], "William Hague": ["Q19596830", "Q58282"]}}, {"date": "2014-02-14", "url": "http://www.wsoctv.com/feed/entertainment/american-idol-welcomes-its-first-openly-gay/fX3R3/", "content": "Posted: 7:45 p.m. Thursday, Feb. 13, 2014 RumorFix.com Of course there have always been gay contestants on American Idol. But the singing contest has never had a competitor openly discuss their sexual preference until now. 20-year-old MK Nobilette on Wednesday became the show's first gay competitor. While talking to the judges about whether or not she'd advance to the final 30, she said \"I'm very obviously gay, and there are always gonna be people in America and everywhere else who will definitely hate me. But I think that in the last two years there have been a lot of things that have really changed that, and have made it a positive thing .\" To which judge Harry Connick Jr. responded \"thank goodness .\" Past finalists <mark>Adam Lambert</mark> and Clay Aiken are both gay, but neither publicly came out until after they completed their time on Cox Media Group. By using this website, you accept the terms of our Sign in with your existing account {* loginWidget *} Sign in with your email {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Select a display name and password {* #socialRegistrationForm *} {* socialRegistration_displayName *} {* socialRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* backButton *} {* socialRegistration_signInButton *} Select a display name and password Already have an account? Sign In {* #registrationForm *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} Tell us about yourself {* registration_firstName *} {* registration_lastName *} {* registration_postalZip *} {* registration_birthday *} {* registration_gender *} {* createAccountButton *} {* / registrationForm *} Sign In {* #registrationFormBlank *} {* registration_firstName *} {* registration_lastName *} {* traditionalRegistration_displayName *} {* traditionalRegistration_emailAddressBlank *} {* registration_birthday *} {* registration_gender *} {* registration_postalZip *} {* traditionalRegistration_passwordBlank *} {* traditionalRegistration_passwordConfirmBlank *} {* backButton *} {* createAccountButton *} We have sent you a confirmation email. Please check your email and click on the link to activate your account. We look forward to seeing you frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Don't worry, it happens. We'll send you a link to create a new password. {* #forgotPasswordForm *} {* forgotPassword_emailAddress *} We have sent you an email with a link to change your password. We've sent an email with instructions to create a new password. Your existing password has not been changed. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} {* traditionalSignIn_signInButton *} To sign in you must verify your email address. Fill out the form below and we'll send you an email to verify. {* #resendVerificationForm *} {* resendVerification_emailAddress *} Your Verification Email Has Been Sent", "articleID": "2014021409_00013986_W", "names": {"Adam Lambert": ["Q190231", "Q30310741"]}}, {"date": "2014-02-14", "url": "http://wboc.com/story/24722133/thousands-in-dark-in-ga-sc-days-after-ice-storm", "content": "(AP Photo/Springfield Republican, <mark>Michael</mark> S. Gordon). Shoppers make their way through heavy snow after shopping at the Big Y supermarket on Memorial Drive in Chicopee, Mass., Thursday, Feb. 13, 2014. (AP Photo/The Charlotte Observer, Robert Lahser). <mark>Michael Robinson</mark> of Charlotte catches air on his snow board while his dog Charlie chases after him at Cordelia Park in the Villa Heights neighborhood in Charlotte, NC, Thursday, Feb. 13, 2014. (AP Photo/Springfield Republican, <mark>Mark</mark> M. Murray). A motorist slowly make their way up Sumner Ave Thursday, Feb. 13, 2014, as the heavy snow started to hit the area. (AP Photo/The Herald-Mail, Ric Dugan). Jennifer Grizzard digs her car out along S. meta itemprop = \"datePublished\" content = \"2014-02-14 07:38:20\" > Thousands in dark in Ga., SC days after ice storm Commuters face a messy morning of travel a day after a winter storm brought snow and ice to many states, leaving at least 21 dead, including a pregnant woman struck by a mini-plow in New York City whose baby was...Ben Ziegler frowned grimly as he used borrowed equipment to cut firewood for his home on the third day without power to keep his family of five warm, including his 14-month-old daughter. meta itemprop = \"datePublished\" content = \"2014-02-14 08:18:06\" > Native American site leaves Miami in quandary Native American site leaves Miami in quandary As more Native American archaeological sites are being uncovered around the nation, the findings are posing difficult questions for the cities where they are found. In a vacant lot between gleaming hotels in downtown Miami, a series of holes carved into the bedrock form eight circles. meta itemprop = \"datePublished\" content = \"2014-02-14 21:58:25\" > Deal is announced in landmark pension case in RI Deal is announced in landmark pension case in RI Rhode Island would roll back some provisions of its landmark 2011 pension overhaul - but maintain billions of dollars of pension savings - under a settlement proposed to end legal wrangling over the sweeping...Rhode Island state leaders and union officials have reached a deal to end legal wrangling over a landmark pension overhaul that's been a model for other states seeking to rein in runaway pension costs. meta itemprop = \"datePublished\" content = \"2014-02-14 21:58:26\" > Mystery of \"jelly doughnut' Martian rock solved Mystery of\" jelly doughnut' Martian rock solved Scientists have solved the mystery of the \"jelly doughnut\" rock on Mars that appeared to come out of nowhere. Another messy morning in winter-weary Northeast Another messy, snowy morning in winter-weary Northeast; many in South still waiting for power Health plans don't cover weight loss surgery 1 percent of eligible patients get weight loss surgery; majority of health plans don't cover Huge thermal plant opens as solar industry grows World's largest thermal solar power plant rises in Mojave Desert, but it comes with a cost Christensen leads US sweep in slopestyle skiing Clean sweep for Team USA as Joss Christensen leads US trifecta in men's slopestyle skiing Associated Press WILLISTON, S.C. (AP) - Ben Ziegler frowned grimly as he used borrowed equipment to cut firewood for his home on the third day without power to keep his family of five warm, including his 14-month-old daughter. \"I got tired of this about five minutes after the lights went out,\" the 33-year-old U.S. Army veteran said at a firewood stand near his Evans, Ga., neighborhood. Despite their weariness, Ziegler and thousands of others in east Georgia and western and southern South Carolina may be without power for several more days. The nasty winter storm that blew through the South and eventually barreled up the East Coast dumped a tree-splitting, utility-pole-snapping inch of ice on the area and many, including South Carolina Gov. Nikki Haley, compared the damage to the aftermath of a hurricane. \"I didn't know this was going to be in the same realm as Hugo,\" Haley, who toured damaged areas Friday, said of the hurricane that struck in 1989. \"To look at these neighborhoods and see the trees down and on houses - to see all of the devastation that's happened to this community - is terrible .\" The same system dumped more than a foot or two of snow on parts of several states and was blamed for more than two dozen deaths, closed schools, snarled air traffic, caused countless crashed and delayed thousands of flower deliveries on Valentine's Day. The longest-lasting effect, however, was power. About 1.2 million utility customers from the South to Northeast lost power at some point during from the South through the Northeast. That dramatically dropped to about 465,000 outages by Friday morning, mostly in South Carolina and Georgia. The numbers did keep dropping, but life without electricity after a third day was becoming a hassle. With roads finally thawed out, many in the hardest hit areas were able to finally leave their homes. But there weren't too many places to go. Few stores were open because they didn't have power either. Dollar General stores across the region let people shop by flashlight, but were only taking cash because they had no way of scanning credit cards. Intersections became risky games of chicken because traffic lights were out and deputies were elsewhere trying to help clear trees and limbs off roads and checking on older people and the sick. Losing power in a rural area often means losing water, too. Many residents are on wells with pumps that need electricity to operate. Some people had buckets out to catch the melting ice so they could use the water to flush their toilets. Tedda and Stan Howard were ready to wait a long time to get their power back from Aiken Electric Cooperative. During the day, they cut down broken branches and repaired fences so their goats wouldn't escape from their 56 acres near Williston. At night, they huddle around the propane heater and played chess by candlelight. They had a neighbor who had power and offered them a warm shower. \"That ought to be enough. Hopefully they'll have it back on by the weekend,\" Tedda Howard said. That seemed doubtful. Power lines were sagging to the ground or snapped in more than a dozen places on the two-lane highway by their home. One coastal South Carolina electric cooperative lost 50 poles in the ice storm, compared to 21 in the last hurricane, officials said. \"With a hurricane, the storm blows through, does its damage and it's gone. An ice storm is like a hurricane followed by a series of mini-hurricanes. You restore power to an area, but then the ice comes back and the same area goes down again,\" said Bob Paulling, CEO of Mid-Carolina Electric Cooperative in Lexington. Rural areas were hit the hardest and their geography means it will be much more difficult to get power restored, said <mark>Mark Quinn</mark>, spokesman for the South Carolina co-ops. In urban areas, one fix of a power line often turns electric back on for thousands of customers. \"Not only do you have less customers per line, but the terrain is also much tougher,\" <mark>Quinn</mark> said. \"We're exposed more than any other utility .\" But for most folks, being without power was more of an annoyance. People told about learning that their tablet computer wouldn't recharge with their car charger or were upset their DVR was missing recording their favorite shows. Ziegler says he lives in the South in part so he doesn't have to deal with winter weather that has been particularly harsh this season all over the country. Two storms in two weeks have been too much. The frown returned when he was told the Farmer's Almanac predicted one final Southern winter storm for the end of the month. \"One storm was too much,\" Ziegler said. \"I'm ready to wear my shorts again .\" ___ Associated Press writers Seanna Adcox in Aiken, S.C., Kate Brumback in Atlanta and Meg Kinnard in Columbia contributed to this report. Goodbye snowy New York, hello gusty London! After a week battling frigid temperatures and sleet in the U.S., the fashion crowd found little solace in the British capital as London Fashion Week kicked off Friday in...Goodbye snowy New York, hello gusty London! After a week battling frigid temperatures and sleet in the U.S., the fashion crowd found little solace in the British capital as London Fashion Week kicked off Friday in sweeping...meta itemprop = \"datePublished\" content = \"2014-02-14 12:08:14\" > Thousands of Muslims try to flee CAR capital Thousands of Muslims try to flee CAR capital Thousands of Muslims tried to flee the capital of Central African Republic in a convoy of trucks and cars stretched as far as the eye can see before it turned back amid taunts from Christian onlookers. Thousands of Muslims who tried to flee the violence in Central African Republic's capital were turned back by peacekeepers Friday, as crowds of angry Christians shouted \"we're going to kill you all .\" meta itemprop = \"datePublished\" content = \"2014-02-14 17:08:30\" > Mali ex-defense minister charged in soldier deaths Mali ex-defense minister charged in soldier deaths A Malian government spokesman says the country's former defense minister has been criminally charged in connection with the slayings of 21 soldiers who had opposed a coup leader's rise to power. Authorities have charged Mali's former defense minister and two other top ex-officials in connection with the slayings of 21 soldiers who had opposed a coup leader's rise to power, government officials said Friday. meta itemprop = \"datePublished\" content = \"2014-02-14 14:48:25\" > Princes William, Harry sandbag against UK floods Prince William and Prince Harry are helping flood-hit U.K. villagers protect their homes, unloading sandbags alongside soldiers in the River Thames village of Datchet.", "articleID": "2014021507_00001543_W", "names": {"Mark Quinn": ["Q27530213", "Q6769359"], "Michael Robinson": ["Q1929070", "Q27922521", "Q28659824", "Q3856249", "Q6833916", "Q6833917", "Q6833918"]}}, {"date": "2014-02-14", "url": "http://betting.betfair.com/golf/the-punter/the-punters-in-play-blog-walker-in-the-mix-yet-again-140214-167.html", "content": "The Punter' The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London <mark>David Horsey</mark> - in-contention in Africa \"Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway .\" Steve takes a look at the state of play at the Africa Open. Can pre-event pick, <mark>David Horsey</mark>, gallop on to the winning line? After the morning's rain delay, a few groups are yet to finish round two of the It looked highly likely that <mark>Ricardo Santos</mark> would lead at halfway but then young American Tour School graduate, <mark>John Hahn</mark>, played his second nine holes, the easier front-nine, in 28! pre-event selection, <mark>David Horsey</mark>, in the thick of things but I've added two more now also. Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway. So with poor weather forecast tomorrow we could see much change and I've added South African duo, Garth Mulroy and Dawie Van Der Walt. I can see defending champ, Darren Fichardt, and course specialist, Jaco Van Zyl, getting into the argument too but I'm not as keen about their prices. Northern Trust Open is well underway and that will be live on Sky Sports 4 at 22.00. I'll be back in the morning with a look at the state of play at halfway. I've not had the best of weeks so far and could do with my selections doing a bit better than they are just to cheer me up a bit! The week started with both kids off school ill so I was more than happy to escape the sick bay and make my way to the Manchester City - Sunderland match on Wednesday but that descended into farce. High winds meant the game was called off and so home I trudged eventually on a badly delayed and crammed train. And by the time I got home, the bug had kicked in and I've felt pants ever since. Africa Open but didn't see a single stroke at the At the Africa Open, <mark>Ricardo Santos</mark> is setting the early pace and currently 14-under-par, having just completed round two. He leads by three over <mark>Fabrizio Zanotti</mark> but the afternoon starters are yet to start. Hopefully we'll get the second round completed today but it might be touch-and-go as we lost an hour or so because of rain this morning and it didn't do my main fancy, <mark>Michael Hoey</mark>, any good at all. I was getting quite excited when he played the first five holes in three-under-par to get within five of the lead but he then failed to birdie the par 5 15th or the easy 16th and when he came back after the rain delay, he double-bogeyed the 17th and that was that. I'll return to this event at the close of play - if I haven't gone back to bed that is! Northern Trust Open, pre-event favourite, <mark>Dustin Johnson</mark>, leads after round one following a five-under-par 66 but with 11 players tied for second on -4, it's bunched to say the least. <mark>Francesco Molinari</mark>, is one of those tied for second, as is the bang-in-form Northern Trust Open: Schwartzel can build on last year's debut, says The Punter Our man runs the rule over the field in California this week for the Northern Trust Open. Read his comprehensive Africa Open: <mark>Hoey</mark> can go one better at East London, says The Punter Parental supervision (e.g. using ICRA, NetNanny, CyberPatrol) is advised and encouraged. Please Gamble Responsibly BETFAIR? and the BETFAIR LOGO are registered trade marks of The Sporting Exchange Limited. Data on Betfair website (s) (including pricing data) is protected by? and database rights. It may not be used for any purpose without a licence .? The Sporting Exchange Limited. All rights reserved. TSE (Gibraltar) LP is licensed by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner under the Gambling Act 2005. RGL No. 049. Address: Units 2/4 and 2/5 Waterport Place, Gibraltar. Betfair Pty Ltd is licensed and regulated to offer Australian Markets by the Tasmanian Gaming Commission.", "articleID": "2014021508_00053086_W", "names": {"David Horsey": ["Q1174765", "Q3018085", "Q3018088"], "Dustin Johnson": ["Q1002293", "Q30015838"], "Fabrizio Zanotti": ["Q3738138", "Q590399"], "Francesco Molinari": ["Q1363419", "Q15791396", "Q55965506"], "John Hahn": ["Q15877095", "Q20631164"]}}]