[{"date": "2014-02-14", "url": "http://betting.betfair.com/golf/the-punter/the-punters-in-play-blog-walker-in-the-mix-yet-again-140214-167.html", "content": "The Punter' The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London The Punter's In-Play Blog: Off the pace South Africans could be worth siding with at East London <mark>David Horsey</mark> - in-contention in Africa \"Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway .\" Steve takes a look at the state of play at the Africa Open. Can pre-event pick, <mark>David Horsey</mark>, gallop on to the winning line? After the morning's rain delay, a few groups are yet to finish round two of the It looked highly likely that <mark>Ricardo Santos</mark> would lead at halfway but then young American Tour School graduate, <mark>John Hahn</mark>, played his second nine holes, the easier front-nine, in 28! pre-event selection, <mark>David Horsey</mark>, in the thick of things but I've added two more now also. Every Africa Open so far has gone to one of the home contingency and two winners have come from six back and one from five off the pace at halfway. So with poor weather forecast tomorrow we could see much change and I've added South African duo, Garth Mulroy and Dawie Van Der Walt. I can see defending champ, Darren Fichardt, and course specialist, Jaco Van Zyl, getting into the argument too but I'm not as keen about their prices. Northern Trust Open is well underway and that will be live on Sky Sports 4 at 22.00. I'll be back in the morning with a look at the state of play at halfway. I've not had the best of weeks so far and could do with my selections doing a bit better than they are just to cheer me up a bit! The week started with both kids off school ill so I was more than happy to escape the sick bay and make my way to the Manchester City - Sunderland match on Wednesday but that descended into farce. High winds meant the game was called off and so home I trudged eventually on a badly delayed and crammed train. And by the time I got home, the bug had kicked in and I've felt pants ever since. Africa Open but didn't see a single stroke at the At the Africa Open, <mark>Ricardo Santos</mark> is setting the early pace and currently 14-under-par, having just completed round two. He leads by three over <mark>Fabrizio Zanotti</mark> but the afternoon starters are yet to start. Hopefully we'll get the second round completed today but it might be touch-and-go as we lost an hour or so because of rain this morning and it didn't do my main fancy, <mark>Michael Hoey</mark>, any good at all. I was getting quite excited when he played the first five holes in three-under-par to get within five of the lead but he then failed to birdie the par 5 15th or the easy 16th and when he came back after the rain delay, he double-bogeyed the 17th and that was that. I'll return to this event at the close of play - if I haven't gone back to bed that is! Northern Trust Open, pre-event favourite, <mark>Dustin Johnson</mark>, leads after round one following a five-under-par 66 but with 11 players tied for second on -4, it's bunched to say the least. <mark>Francesco Molinari</mark>, is one of those tied for second, as is the bang-in-form Northern Trust Open: Schwartzel can build on last year's debut, says The Punter Our man runs the rule over the field in California this week for the Northern Trust Open. Read his comprehensive Africa Open: <mark>Hoey</mark> can go one better at East London, says The Punter Parental supervision (e.g. using ICRA, NetNanny, CyberPatrol) is advised and encouraged. Please Gamble Responsibly BETFAIR? and the BETFAIR LOGO are registered trade marks of The Sporting Exchange Limited. Data on Betfair website (s) (including pricing data) is protected by? and database rights. It may not be used for any purpose without a licence .? The Sporting Exchange Limited. All rights reserved. TSE (Gibraltar) LP is licensed by the Government of Gibraltar and regulated by the Gibraltar Gambling Commissioner under the Gambling Act 2005. RGL No. 049. Address: Units 2/4 and 2/5 Waterport Place, Gibraltar. Betfair Pty Ltd is licensed and regulated to offer Australian Markets by the Tasmanian Gaming Commission.", "articleID": "2014021508_00053086_W", "names": {"Michael Hoey": ["Q15994517", "Q2846845", "Q43380468"], "Ricardo Santos": ["Q10361246", "Q16849445", "Q25190224", "Q2794023", "Q464911", "Q53705451", "Q716813"]}}, {"date": "2014-02-17", "url": "http://kvoa.com/news/genius-3-year-old-arizona-girl-youngest-member-of-mensa/", "content": "The Pac-12 acknowledged Sunday night that \"the officials missed the call\" and should have handed...4,5 & 6-Year Olds Dazzle Crowd At Fiesta De Los Vaqueros Tucson Rodeo: Paul Cicala Reports 4,5 & 6-Year Olds Dazzle Crowd At Fiesta De Los Vaqueros Tucson Rodeo: Paul Cicala...Some of the best golf players are checking in at the Dove Mountain Ritz Carlton...Google Plus 7 minutes 33 seconds ago Genius 3-year-old Arizona girl youngest member of Mensa QUEEN CREEK, AZ - Three-year-old <mark>Alexis Martin</mark> is currently the youngest person in Arizona's chapter of Mensa. Mensa is the international club with one criterion - an IQ in the top two percent of the world. The average person has an IQ of 100. <mark>Alexis</mark>' is above 160. The doctors who tested <mark>Alexis</mark> said she tested so high, they couldn't even calculate her IQ score. <mark>Alexis</mark> started reading when she was two-years-old. Her father, <mark>Ian Martin</mark>, said she showed signs of her capabilities when she was just a year old, ABC15 reported. \"From 12-18 months old, we'd be driving around in the car and she would recite her bedtime story from the night before,\" he said. \"She didn't just recite them, she recited them exactly .\" It's not just her 5th grade reading level that's shocking, <mark>Alexis</mark> also taught herself Spanish via her parents' iPad. <mark>Alexis</mark>' parents know their daughter's gift is amazing but they are also discovering new challenges. \"Does she go into kindergarten early? We are kind of hesitant because we do want her to get that social aspect,\" said <mark>Ian Martin</mark>. <mark>Alexis</mark> will never be able to go to a normal school, according to the doctor who helped test her. One of the reasons, often times, kids this brilliant have high anxiety and it's easier for them to be around similar children.", "articleID": "2014021805_00002387_W", "names": {"Alexis Martin": ["Q17395837", "Q27819359", "Q2834584", "Q55069621"], "Ian Martin": ["Q15069750", "Q18640488", "Q41805425", "Q532124"]}}, {"date": "2014-02-17", "url": "http://www.pri.org/stories/2014-02-17/un-report-details-atrocities-north-korea-are-painful-even-imagine", "content": "<mark>Michael Kirby</mark>, chairperson of the Commission of Inquiry on Human Rights in North Korea holds a copy of his report during a news conference at the United Nations in Geneva February 17, 2014. \"The gravity, scale and nature of these violations reveal a state that does not have any parallel in the contemporary world,\" the UN document states. The report is the result of a year-long Commission of Inquiry, organized by the United Nations Human Rights Council. Its purpose was to document what it calls the \"unspeakable atrocities\" committed in North Korea, with a view to holding the perpetrators accountable. Investigators accuse North Korea's government of systematic murder, torture, rape, forced abortions and deliberate starvation, as well as infanticide. The Commission heard from hundreds of witnesses. On Monday, it released the recordings of the public hearings. Witness Jee Heon A was jailed for attempting to flee across the North Korean border to China during a famine. gave her evidence through a translator before the Commission last year. She recalled how joy turned to terror one night, when a fellow inmate gave birth: \"Suddenly we heard these footsteps, and a security agent came in. And this agent said that - usually when a baby is born we would wash the baby in a bowl of water - but this agent told us to put the baby in the water upside down .\" Despite protests, the mother was beaten till she drowned her newborn baby. Witness Jee said she saw this multiple times. Most of the witnesses were refugees from North Korea. But the chair of the Commission, Australian jurist <mark>Michael Kirby</mark>, says he found them credible. \"If people are uncertain,\" he said, \"they can look at the public hearings, because it's on the Internet. It's accessible to people all around the world. They don't have to accept our word for it. They can look at these witnesses and make a judgment for themselves. Are they telling the truth or are they - as the North Korean government has said -\" human scum' who are fabricating these stories? \"<mark>Kirby</mark> said the North Korean witnesses who provided testimony were overwhelmingly brave and determined people who had suffered greatly and wanted to do something to make sure the next generation of North Koreans didn't have to suffer in the same way. The UN Commission had two objectives. First, it aimed to ascertain whether crimes against humanity were taking place in North Korea. And second, it sought to propose ways to make the perpetrators accountable. The Commission has recommended that prosecutors take these cases before the International Criminal Court in The Hague.", "articleID": "2014021806_00030562_W", "names": {"Michael Kirby": ["Q57496340", "Q6831890", "Q6831895"]}}, {"date": "2014-02-18", "url": "http://wbal.com/article/105512/21/workers-business-owners-debate-sick-leave-mandate", "content": "Workers, Business Owners Debate Sick Leave Mandate WBAL's <mark>Robert Lang</mark> reports on some of the workers and business owners who appeared at Tuesday's hearing. Baltimore County Democratic Delegate John A. Olszewski Jr. says many of the workers who need sick leave the most, such as low-wage employees who can't afford to miss a day's pay, are the ones who can't earn it in their jobs. More than 700,000 Maryland workers don't have access to sick leave, Olszewski said Tuesday to the House Economic Matters Committee. Olszewski has introduced a bill requiring employees to give one hour of sick leave for every 30 hours worked, capping the number at seven a year. In general, businesses that give other forms of paid time off would be exempt. The bill would apply to businesses with at least ten employees. Committee members heard horror stories Tuesday from restaurant cooks who have worked through severe illnesses. Mark Sine, a restaurant worker from Baltimore told the committee that he worked through a cold, which later progressed to mononucleosis, causing him to miss work for two weeks. \"If I had paid sick days, I wouldn't have had to feel this way. It would have given me a safety net, so I wouldn't have had to push myself so hard, and made myself even sicker,\" Sine told the committee. Matt Quinlan, a restaurant worker from Baltimore, also told the committee that in a number of the restaurants where he worked, if workers all had the flu, the cooks would place large buckets in the kitchen in case anyone got nauseous. \"If you're physically ill, you can be sick, and we'll share these buckets, do what you need to do, and then get back to work,\" Quinlan told the committee. Business owners and pro-business groups testified that the bill would hurt small employers and Maryland's economic climate. Lobbyist Bruce Bereano, who testified on behalf of Safeway and a number of other businesses and associations read part of the bill aloud during his testimony, and criticized the measure as \"exceedingly broad\" in its scope. He noted that the sick leave is not just provided for workers to care for themselves or their immediate family members, but also their relatives. \"It is grossly unfair to employers. It presumes that they are wrong and that they are not fair to their employees and treating their employees correctly,\" Bereano added. The owner of a temporary employment agency in Timonium told the committee that many of the workers she places often miss work not because of illness, but because they must deal with government agencies that provide them with benefits such as transportation or child care assistance. Wanda Smith, president and CEO of Symphony Placements notes many of those government agencies are only open from 9-5, which is often working hours for her employees. She suggested lawmakers order those agencies to expand their hours. \"Why can't we say that we will look at all of the social programs, and increase the hours, so that people don't have to miss work, so they can stay gainfully employed,\" Smith told lawmakers. A Senate version of this bill will be the subject of a hearing on Thursday. VIDEO: First Night A Hit For \"Tonight Show' Host Jimmy Fallon Craig Proposes Flat Tax, Then Ending Income Tax; House Republicans Propose Cuts", "articleID": "2014021907_00064418_W", "names": {"Robert Lang": ["Q16731223", "Q2157973", "Q56433508", "Q914398"]}}, {"date": "2014-02-19", "url": "http://www.wetpaint.com/celebrity-moms-babies/articles/2014-02-18-teresa-palmer-gives-birth-boy", "content": "Photo: Teresa Palmer and new baby Bodhi Rain Palmer Teresa Palmer is officially a mommy! The Warm Bodies star and her husband, actor <mark>Mark Webber</mark>, welcomed a baby boy to the world Monday, February 17. The Instagram with a first look at her bundle of joy...well, a first look at his hand, anyway. His tiny fingers wrapped around his mother's ring finger (which bears her stunning wedding ring), we can't tell much about this little man yet other than the fact that he's tiny! According to Teresa, it was natural birth. \"Thank you God for blessing us with the most divine gift of our baby son,\" she writes in her birth announcement, along with his full name: Bodhi Rain Palmer. Explaining the significance of each name, Teresa says \"Bodhi\" means \"Enlightened One\" while \"Rain\" stands for \"Abundant Blessings From Above .\" As for Bodhi's last name, the new mom says that's something of a tradition now: <mark>Mark</mark>'s first son Isaac, born to actress Frankie Shaw, carries his mother's last name rather than <mark>Webber</mark>.", "articleID": "2014021910_00059812_W", "names": {"Mark Webber": ["Q1378842", "Q6770266", "Q82667"]}}, {"date": "2014-02-22", "url": "http://www.nbcmiami.com/news/local/Mixed-Martial-Arts-Fighter-Thiago-Silva-to-Remain-in-Broward-Jail-as-Bond-Hearing-Is-Delayed-246618911.html", "content": "Mixed Martial Arts Fighter <mark>Thiago Silva</mark> to Remain in Broward Jail as Bond Hearing Is Delayed <mark>Thiago Silva</mark> lost a round in court Friday. \"Nobody's deliberately doing it, but he's definitely falling through the cracks,\" said attorney Scott Saul in a Broward County courtroom, speaking at what was supposed to be a bond hearing for <mark>Silva</mark>, 31. The mixed martial arts fighter sat in his jailhouse scrubs, watching his lawyer do the fighting. Saul argued that <mark>Silva</mark> should be out on bond, since he is no longer being charged with a non-bondable crime. \"And here we are two weeks later, my client is sitting in jail, not on the felonies, on bondable offenses, and he has no bond,\" Saul told the judge. Broward Sheriff's Office deputies arrested <mark>Silva</mark> on Feb. 6, saying he pulled a gun on his estranged wife in the parking lot of a gym, put the gun in her mouth, threatened to kill her, and then locked himself into a townhouse until SWAT team deputies talked him into surrendering peacefully. He was booked into the Broward County Main Jail, and there he stays. On Friday the state moved his case to the domestic violence court, delaying a bond hearing by about a week. \"We're gonna get him out of prison, this is (expletive), honestly, the state has known for a week this hearing was scheduled for today and did nothing,\" said <mark>Silva</mark>'s manager, <mark>Glenn Robinson</mark>. More than a dozen friends showed up in the courtroom to be in <mark>Silva</mark>'s corner. \"He has a tremendous amount of support, he's a very beloved person,\" Saul said. <mark>Silva</mark>'s lawyer says this case is an aberration, and that <mark>Silva</mark> has no criminal record. His manager doesn't believe the charges. \"It's not true, and the truth will come out,\" <mark>Robinson</mark> said. This much is definitely true: the criminal case has knocked out <mark>Silva</mark>'s career. The UFC fired him, and assuming he eventually bonds out of jail, he still faces a trial, and prison time if convicted. Get Our New iPad App Now optimized for iPad, NBC 6 ...", "articleID": "2014022208_00056902_W", "names": {"Glenn Robinson": ["Q16150182", "Q18151664", "Q5569076", "Q926311"], "Thiago Silva": ["Q210453", "Q59245327", "Q604996", "Q7783822"]}}, {"date": "2014-02-22", "url": "http://www.graziadaily.co.uk/fashion/news/milan-fashion-week-diary-3", "content": "Grazia's Katherine talks through the street style trends in Milano Next stop: the 2014 International Woolmark Prize. Let the contest begin! Alexa Chung wears a Valentino cape dress to take her seat on the judging panel Some wonderful wool creations hit the catwalk for the Woolmark Prize The judges, including Frida Giannini and Franca Sozzani, reveal the winner of the Woolmark Prize Digital Editor Jessica Vince chats to Alexa Chung about channelling Cheryl Cole on the Woolmark Prize judging panel And the winner is...Rahul Mishra! Name to know: Mauro Grifoni. Definitely for the Grazia girl We loved the Western influence at Gianvito Rossi The divine Paula Cademartori showcases her new Piaggi bag More luxe bags from Paula Cademartori Adoring these pretty floral pouches from Furla A parka and a polar bear at Woolrich People. Perfect. Snuggly parkas all in a row from Woolrich People Anna Dello Russo causes a paparazzi scrum outside the Armani show. And yes, that's the <mark>Jeremy Scott</mark> for Moschino outfit she's wearing ADR takes a selfie outside the Emporio Armani show - whilst sitting on a Vespa This little lady is causing paparazzi carnage outside the Emporio Armani show. Maybe they think it's JLo (it's not) Look who's backstage at Emporio Armani: it's only Calvin Harris! The DJ says he's here for his girlfriend. Yep, that's Rita Ora MTV's Laura Whitmore FROW'd at her first Emporio Armani show today. \"It was so exciting!' she told us We meet Chiara Ferragni kitted out in Burberry at the Emporio Armani show .\" Wear something comfortable' is her FROW tip We loved the mushroom-style hats at the Emporio Armani show Aw! Mummy and baby fluffy bags from Moncler Brian Atwood fringe-tastic creations are not for shrinking violets Georgia May Jagger in a buttoned white mini at Versace The day begins with me organising tickets for today's shows Look who we've bumped into: ADR herself! A sweet gift of roses from shoe genius Gianvito Rossi inviting me to his presentation tomorrow Can we have this Gucci biker too please? It was all about the gold biker with fringing at Just Cavalli. Bowie-fabulous! Check out the murals at Fendi's show space It's the street style queen! Anna Dello Russo arrives at Prada in her brilliant coat Alexa Chung makes a super-chic enterance at Prada A scarlet shaggy dress hits the catwalk at Prada A trio of Prada coats for the grand finale Model Hanne Gaby brings her metallic magic to MFW Now this IS exciting: <mark>Jeremy Scott</mark>'s first catwalk show for Moschino - and chocolate! A <mark>Jeremy Scott</mark> x Moschino phone case for everyone at the show. Hurrah! We had a gorgeous dinner with our friends from Matches to celebrate Paula Cademartori and her amazing bags It was an early start at Heathrow this morning, I am SO not a light packer Anna Dello Russo, chocolates and chic shoes at Gucci - MFW has begun! What a welcome! Gucci opens Milan Fashion Week How gorgeous is this short, sweet and crystallised frock at Gucci? Gucci reminds us it's all about the pastel outwear Champers o'clock! Now we're fashion week ready. Hello Joan Smalls! We want your beanie I'm loving the embellished coats and socks with sandals at Alberta Ferretti Dresses were tinged with gold at Alberta Ferretti We're obsessed with these monochrome majors in Raoul's Autumn Winter 2014 collection There's nothing quite like a goodbye gift from Raoul Well this makes up for missing lunch #roomserviceheaven On the third day of our Milan Fashion Week experience, we found some new designers to love, took in the Emporio Armani show and hung out with Alexa Chung. Here are our highlights...1. FROW & TELL at the Emporio Armani show The Emporio Armani show is always a larger-than-life affair. Forget being on the second row, there are TEN rows of seats here, each one individually numbered like a super-chic cinema with a gigantic catwalk running down the middle. When we arrived at the venue, we spotted the likes of Laura Whitmore and even Calvin Harris (sans Rita, boo) hanging out backstage waiting for the man himself. We grabbed a chat with Laura about her first time at Milan Fashion Week...\"The collection was unbelievable and just so elegant and graceful,' she told us after the show .\" You know when you go to fashion shows and a lot of the things you may not wear yourself? Well, this time I was like, \"I want that, I want that!\". Armani is all about the female figure and the dress I'm wearing today makes me feel good so that's what fashion should be about .' We also met Chiara Ferragni of The Blonde Salad who looked resplendent in a Burberry ensemble. As a top-notch fashion blogger, we wanted to know her tip for our fashion week wardrobes. \"Try to wear something that is comfortable and although this isn't the most comfortable outfit, it makes me feel self confident .' 2. What We're Wearing The sun came out today here in Milan (hurrah!) so it was time to pack away our oversized coats and tights for something a little lighter. Here's <mark>Charlie Miller</mark>, Grazia's Executive Fashion and Beauty Director, wearing a black Cos sweater with a Victoria Beckham skirt topped off with Philosophy di Alberta Ferretti boots, Chanel aviators and a tasselled Gucci bag. Meanwhile, our Editor In Chief, Jane Bruton, is looking MFW-tastic in a Prada coat over a Jonathan Saunders sweater and MiH jeans. She's finished off the look with a Fendi bag and Sophia Webster shoes. The perfect combo of Brit meets Italiano chic! 3. Meeting the names-to-know As well as the high-profile catwalk shows the Fashion team enjoy, there's many smaller appointments on the agenda too. Today <mark>Charlie</mark> met Paula Cademartori, the lady behind a selection of luxury handbags designed in Milan, who talked us through the bags and clutches in multiple colours and leather combinations. We've also fallen in love with Mauro Grifoni and his super furry stripes and the Darlin' sweater is definitely for the 4. Anna Dello Russo's fash-tastic selfie ADR is always guaranteed to brighten up the streets of fashion week so it was no surprise to see she was the first lady to get her mitts on <mark>Jeremy Scott</mark>'s brilliantly bonkers debut for Moschino. Approximatley 12 hours after it had hit the catwalk, Anna was showcasing the Macdonalds-inspired sweater dress at the Emporio Armani show, complete with matching bag and iPhone case. She even found a vespa to strike a pose on. Well worth a selfie, we're sure you'll agree. Latest Tweet See Rihanna's latest bulk upload of holiday pictures: Please enter this information so that Bauer Media Group (the publisher of Grazia) can keep you up-to-date by email with fantastic offers and promotions. We promise that you can unsubscribe at any time if you don't find them interesting and you'll only get messages about things that we've chosen especially for you from ourselves and our network of great partners whose products and services we think you'll enjoy. women's fashion, beauty and news!", "articleID": "2014022304_00061853_W", "names": {"Charlie Miller": ["Q1066958", "Q5085245"]}}]