[{"articleID": "2015020519_00072500_W", "names": {"Peter Robinson": ["Q15990258", "Q21229743", "Q27922659", "Q29575386", "Q333036", "Q37266874", "Q41787245", "Q41935087", "Q637306", "Q7176623", "Q7176625", "Q7176626", "Q7176627", "Q7176628", "Q7176629", "Q7176630", "Q7176634"], "Walter Smith": ["Q18821916", "Q30600441", "Q359387", "Q54110903", "Q7966162"]}, "date": "2015-02-05", "url": "http://liverpoolecho.co.uk/sport/sport-opinion/dave-prentice-integration-not-segregation-8590115", "content": "Anfield rape: Police describe appalling attack after 14-year-old boy arrested on suspicion of assaulting woman in her 40s Liverpool FC fan left scarred after he was bottled and robbed during street attack Heartbroken Wallasey mum went from \"expectant mother to a bereaved parent in the space of minutes' Liverpool FC comment: Damien Comolli making\" massive mistake \"by carrying on talking Dividing Everton and Liverpool fans is not a solution\" data-type = \"fb-share\" data-action = \"article:8590115\" > Dividing Everton and Liverpool fans is not a solution \"data-type =\" tw-share \"data-action =\" article:8590115 \"> Liverpool and Everton in the 223rd Merseyside Derby, 2014 Merseyside police have reluctantly allowed tomorrow's derby match to kick-off at 5.30 pm - provided that Everton\" improve segregation. \"It is a surprising compromise. Because it was segregation which got us into this mess in the first place. The Merseyside derby was never the dewy-eyed love-in of sentimental folklore, but rival fans did, at the very least, put up with each other. And they policed each other too. Fans mixed at Merseyside derbies throughout the era of standing terraces, without one single, publicised problem. They mixed famously at Wembley in 1984, 1986 and 1989. But it wasn't just on the big occasions that they behaved themselves. They mixed on each other's turf, too. When Bruce Grobbelaar flopped over a Kevin Ratcliffe pea-roller in 1986, in a match billed as a title decider, you could clearly hear a mini-Kop choir gleefully bellowing:\" You're a clown, you're a clown! \"Hundreds of Evertonians, unable to get tickets anywhere else in the stadium, had bought tickets for the home end - as they regularly did - and expressed their feelings without censure. When Kenny Dalglish struck after 20 seconds of the same season's Goodison derby, you can clearly see much of the lower central section of the Gwladys Street End celebrating wildly - red bobble hats, the must-have fashion accessory of the day - visible everywhere. Everton and Liverpool fans mixed at matches. Why wouldn't they? There's no religious divide between Everton and Liverpool, no geographical split, every Everton and Liverpool fan reading this article has got brothers or sisters, wives or husbands, friends or work-mates who support the other side. It's a unique situation which once gave rise to the\" friendly derby \"tag. But that friendliness disappeared in the 1990s. And it's no coincidence that fans stopped mixing at matches in that decade. <mark>Peter Robinson</mark>, was an outstanding Anfield administrator, and a man who possessed one of the sharpest brains in football. And he once told me how the mixing at matches ended .\" After Heysel and Hillsborough, ground capacities were reduced dramatically as all-seater stadia were introduced, \"he recalled .\" I think Anfield came down from 48,000 to 42,000. We were the first club to host a derby match after the changes and in order to satisfy our season ticket holders I think the only section remaining for visiting fans was a small standing area of 1,500. \"We reduced the allocation for away fans, but Everton did exactly the same .\" All-seater stadia meant smaller capacities - smaller capacities meant smaller away allocations - and smaller away sections led to a small-minded mentality towards the now isolated away fans creeping in. A more partisan atmosphere was perhaps inevitable as soon as both clubs started creating small, easily identifiable ghettos of away support. Segregation adds to a sense of isolation amongst away fans, a bullying mentality is fostered amongst the majority - and idiots are emboldened without anyone to keep them in check or challenge them. Integration, not segregation, is the way forward. And it's an ideal we seem to be moving away from. On a wing and a prayer...wide men can thrill and spill Terry Curran hasn't been mentioned around Goodison Park for years. But there was a time once when the flamboyant winger was the name on every Evertonian's lips. Curran was a loan signing who in an awful autumn of 1982 injected a much needed spark into a talented but chronically under-achieving side (Sound familiar?) Such was his impact that Blues fans were quickly campaigning for their cash-light board to find the money to sign him on permanently. Everton were still reeling from the trauma of a 5-0 Goodison derby demolition and a run of just one goal scored in four games when Curran arrived on-loan from Sheffield United. The flowing D'Artagnan style locks were totally appropriate for a cavalier footballer (although his team-mates claimed he resembled Roland Rat even more) and his impact was swift. Everton won 2-0 at Ipswich in his second appearance, then ran riot against Luton when Curran was on the scoresheet in a 5-0 victory that had the Gwladys Street roaring his name. He ran, he dribbled, he took players on, he set up chances and helped inject that invaluable but elusive quality into the Everton squad - confidence. After a magnificent seven appearances he returned to Sheffield United, the Blues unable to stump up the money to sign him permanently until the following season, when his impact was significantly reduced. But he had briefly provided a spark for a struggling side - in a manner which would be repeated several times in Everton's future. Wingers, with their licence to run at defenders, have the ability to rouse a crowd and lift their team-mates. Landon Donovan did it in 2010, despite swapping California sunshine for a snowstorm at the Emirates on his debut. He played 13 games, scored twice and was named the club's Player of the Month for his performances in January. When he returned to the US he proudly told his 1.1 million Twitter followers that he was a \"Proud American, Angelino & Evertonian'. He returned by popular demand in 2012 and in a marvellous month took his tally of assists to seven when he set-up Denis Stracqualursi's goal in a 2-0 victory over Chelsea .\" For an autograph signing, Donovan's presence coaxed a line that zigzagged through the merchandise store, snaked out the door and hogged about 300 yards of sidewalk. \"wrote Chuck Culpepper in a New York Times article. Donovan wasn't the only winger to arrive on-loan that transfer window. Steven Pienaar returned from Spurs, created three goals in a 4-0 rout of Fulham and left David Moyes purring:\" All around, he looks as if he enjoys his football here, where he can be appreciated. \"Wingers can lift football clubs, which is what Everton will be hoping Aaron Lennon's direct running and incendiary pace can do between now and the end of the season. Of course signing wingers on-loan does not guarantee an upturn in fortunes. I still remember the nonplussed reaction of my Evertonian editor when I informed him on transfer deadline day 1998 that Everton had\" swoop-ed' to bring back Peter Beagrie to Goodison. Despite his dismay I kept my job. Howard Kendall didn't, after Beagrie got a half-time hook in two of his four starts. <mark>Walter Smith</mark> survived just seven matches following David Ginola's signing in 2002, proving that wingers can either thrill...or spill. Everton FC's Ross Barkley on the Merseyside derby:' I live for big games like this' Everton FC to unveil tribute to Hillsborough 96 ahead of Merseyside derby Memorial plaque to be revealed at Goodison Park ahead of the Merseyside derby between Everton and Liverpool FA Cup draw comment: Trip back to Palace won't have been high up on Liverpool fans' lists Liverpool FC comment: Damien Comolli making \"massive mistake\" by carrying on talking Contact us Want to get in touch? Our full contacts can be found on The Liverpool Echo, PO Box 48, Old Hall Street, L69 3EB Tel: 0151 472 2488 / 0151 472 2529 Fax: 0151 472 2474 Jamie McLoughlin Tel: 0151 472 2498 0151 472 2589 TRAINING Jayne Middlebrook 0870 701 0090 ECHO DIRECT DELIVERY 0845 304 0639 FAMILY ANNOUNCEMENTS here, alternatively send your story via this form. Trinity Mirror Merseyside, the Echo's parent company, is one of the North West's largest multimedia providers reaching more than 900,000 adults every month. The Liverpool Echo, Trinity Mirror Merseyside's flagship brand, is the area's best-read newspaper including national newspapers. The Liverpool Echo reaches 1 in 3 people in the area with a daily readership of more than 256,000 * people. The Liverpool Echo website reaches 1.5 million unique users each month who look at around 8.5 million pages **. for full details. * ABC January-June 2012 ** JICREG Omniture average figures Editor, The Liverpool Echo Editor-in-Chief, Trinity Mirror Merseyside, Cheshire and North Wales Alastair Machray was appointed editor of The Liverpool Echo in 2005 and is also editor-in-chief of Trinity Mirror Merseyside, Cheshire and North Wales. He is a former editor of The Daily Post (Wales and England) and editor-in-chief of the company's Welsh operations. Married dad-of-two and keen golfer Alastair is one of the longest-serving newspaper editors in the country. His titles have won numerous awards and spearheaded numerous successful campaigns."}, {"articleID": "2014102717_00055645_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"]}, "date": "2014-10-27", "url": "http://www.nola.com/movies/index.ssf/2014/10/chris_rocks_top_five_movie_tra.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to Chris Rock's \"Top Five\" started getting noticed from the moment it premiered in September at the Toronto Film Festival, but not just because it's funny. We already knew Chris Rock is funny. Rather, it's because he doesn't just act in \"Top Five .\" He wrote and directed it, too--making its warm reception that much more impressive. It's actually Rock's third time in the director's chair. (You can be forgiven for forgetting 2003's \"Head of State\" and 2007's \"I Think I Love My Wife,\" both of which he also wrote .) But the third time appears to be the charm, at least if early reviews are any indication: In his review, Variety film critic Scott Foundas said he saw shades of classic Woody Allen in \"Top Five .\" Granted, Foundas also saw some vintage Farrelly brothers at work there, too, which suggests a bit of a stylistic mishmash--but one that boasts an early 92 percent approval rating on movie-review aggregator RottenTomatoes.com. Fans will get to see for themselves on Dec. 5, which is when Paramount Pictures is scheduled to release \"Top Five\" into theaters. In the meantime, check out the recently released trailer for Rock's film in the embedded video above. It gets the nod as today's Movie Trailer of the Day. Below, find the description of the film--which also includes appearances by such Rock pals as Adam Sandler, <mark>Tracy Morgan</mark> and Jerry Seinfeld--that accompanied its Toronto Film Festival run. h1> Now Playing Get the latest news, reviews, trailers and up-to-date listings for movies playing in local theaters. Delivered Friday afternoons. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 NOLA Media Group. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of NOLA Media Group."}, {"articleID": "2009110211_00035902_W", "names": {"Stephen Robertson": ["Q55127221", "Q7610386", "Q7610387", "Q7610388"]}, "date": "2009-11-02", "url": "http://drapersonline.com/news/multiples/news/consumer-confidence-at-18-month-high/5007646.article", "content": "consumer confidence at 18-month high consumer confidence is at its highest level for 18 months, despite people remaining anxious about the prospect of unemployment. the british retail consortium's monthly consumer confidence index, published with market research company nielsen, is at 75 - some 10 points higher than the all-time low of 65 recorded in april. the survey reveals that confidence lags behind the levels reported two or three years ago, but the brc said that the improvement would encourage retailers. brc director general <mark>stephen robertson</mark> said: \"these figures suggest it will be a long, slow climb out of recession for many customers but some do now have their feet on the first rung of the ladder .\" there's no question the general mood of customers is better than a year ago, when conditions were dire, but improvement has been slow so far. \"more than three-quarters of consumers, some 77%, believe that job prospects are\" bad \"or\" not so good \", the main sentiment holding back confidence. a fifth of people believe job prospects will be\" good \"or\" excellent \"over the next 12 months compared with just 14% in june. the survey suggests that worries unemployment mean people still in employment are working harder and there has been an increase in people feeling their work/life balance is their biggest concern, to 9% now compared with 4% a year ago. justin sargent, managing director at nielsen, said:\" this latest poll shows that the confidence of the nation continues to improve, though consumers remain very guarded and we are still a long way from the confidence levels we saw prior to the economic meltdown. \"advertise with the leading uk website for fashion professionals and reach 107,000 key decisions makers within the industry. we provide a range of targeted solutions to help your business reach a phenomenal audience of global, national and independent retailers, brands and manufacturers. your front row seat awaits. want to rub shoulders with the leading names in the fashion business? find out what they think, what they do and how it affects your business. drapers is your key to the uk fashion business. every week drapers features the finest news, trends, catwalks, top fashion jobs, exclusive sales data and insightful viewpoints."}, {"articleID": "2009052202_00002640_W", "names": {"Matt Bonner": ["Q523646", "Q55592876"]}, "date": "2009-05-22", "url": "http://statesman.com/sports/content/sports/stories/longhorns/05/22/0522atchley.html", "content": "former longhorn connor atchley had a disappointing senior season that included an ankle injury and a split tongue, but he is practicing in hopes that he might still enter the pros. (enlarge photo) former nba coach john lucas is working with atchley. man critically injured at domain parking garage; new blood bank opens in south austin developer unveils first two proposals for ut's brackenridge tract longhorns basketball atchley working to regain form that got him noticed mark rosner american-statesman staff turns out that connor atchley's disappointing senior season for the longhorns wasn't a ticket out of basketball. atchley has been working in houston with former nba coach john lucas, playing pickup games with a few pros, regaining the form that put him on the league's radar screen a year ago. \"he's looking tougher and more aggressive than i've ever seen him,\" said b.j. johnson, a scout for the houston rockets. \"it's like he's on a mission .\" atchley, a 6-foot-10-inch, 226-pound forward, has worked out twice for the rockets. he said that representatives from the minnesota timberwolves and memphis grizzlies attended one of the workouts. johnson said atchley impressed while matched up against jeff adrien, a 6-7, 243-pound forward from connecticut. \"connor shot the ball well,\" johnson said. \"he blocked shots, he grabbed rebounds over adrien, who is a tough kid .\" atchley has never been accused of being a tough guy, but he caught the attention of nba scouts as a longhorn junior, when he hit 41.3 percent of his three-point shots and led the big 12 with 2.1 blocks a game. suddenly, atchley was viewed as a european style big man who could stretch defenses with three-point shooting. then he suffered an ankle injury last december and a split tongue in early january that required more than 20 stitches to repair. unable to eat solid food for a week, atchley lost more than 10 pounds. atchley said the ankle injury had little impact on his performance. though he missed only one game with the split tongue, he said he never fully regained his bearings. \"that really messed everything up,\" he said. atchley also suffered with the loss of former longhorn point guard d.j. augustin to the nba. augustin created three-point shots for him with pick-and-pop plays when atchley was a junior. this past season, atchley's scoring average dipped to 4.6 points a game, five fewer than during his junior season. his three-point accuracy plunged to 27.8 percent. \"losing d.j. hurt,\" atchley said. \"it helps to have a playmaker who also is a threat to score .\" lucas agreed with that assessment, adding that atchley also scored less as a senior because, without augustin, the longhorns struggled to produce fast-break points. atchley, hoping to restore his reputation in time for the june 25 draft, began working with lucas in april. he plays twice a day against the likes of othella harrington, chris wilcox and deandre jordan. he lifts weights, as well. he has tried to improve his rebounding, never a strength. \"he needs to get stronger,\" lucas said, \"but he's picked up some (rebounding) tips from playing with the guys down here .\" lucas envisions atchley some day in a perimeter big man role similar to <mark>matt bonner</mark>'s with the spurs. scouts for toronto, milwaukee, washington, atlanta and indiana have watched atchley play at lucas' gym. \"connor can put the ball on the floor,\" lucas said. \"not like dirk nowitzki, but he can do it .\" atchley's name appeared in nba mock drafts a year ago. it is not there now. but he is back in play. \"i feel like my normal self,\" atchley said. \"i have energy. i don't feel winded. if i don't get drafted, i'll try to get a spot on somebody's summer league team. the next step would probably be to go overseas .\" your comments austinites love to be heard, and we're giving you a bullhorn. we just ask that you keep things civil. leave out the personal attacks. do not use profanity, ethnic or racial slurs, or take shots at anyone's sexual orientation or religion. if you can't be nice, we reserve the right to remove your material and ban users who violate our"}, {"articleID": "2018022109_00124299_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-02-21", "url": "http://www.local10.com/news/politics/hhs-official-promoted-conspiracy-theories-on-social-media", "content": "HHS official promoted conspiracy theories on social media Cordova placed on leave By ANDREW KACZYNSKI AND NATHAN MCDERMOTT, CNN Posted: 4:17 AM, February 21, 2018Updated: 4:17 AM, February 21, 2018 HHS. gov via CNN Senate confirms HHS secretary nominee Alex Azar (CNN) - A top official at the Department of Health and Human Services has been placed on administrative leave after a CNN KFile inquiry while the agency investigates social media postings in which he pushed unfounded smears on social media. Jon Cordova serves as the principal deputy assistant secretary for administration at HHS. A KFile review of Cordova's social media accounts found that he pushed stories filled with baseless claims and conspiracy theories, including stories that claimed Gold Star father Khizr Khan is a \"Muslim Brotherhood agent\" and made baseless claims about Sen. Ted Cruz's personal life. Related content \"Mr. Cordova is currently on administrative leave while we look into this issue further,\" a HHS spokesperson said in a statement. Cordova did not respond to a request for comment. Cordova joined HHS in February of 2017, initially as part of the Office of the White House Liaison. In his current role, Cordova oversees day-to-day operations for the Office of Human Relations, Office of the Chief Information Officer, Office of Security and Strategic Information, Equal Employment Opportunity Compliance and Operations Office and the Program Support Center, according to his biography posted on the HHS website. Prior to joining HHS, Cordova served as a Trump delegate from California to the Republican National Convention and worked in communications for <mark>Donald Trump</mark>'s campaign in California. During the 2016 presidential campaign, Cordova routinely promoted stories on social media that pushed fringe claims about Trump's opponents that have no basis in fact. In July 2016, Cordova shared a story that asserted without evidence that Khan, who spoke out against Trump at the 2016 Democratic National Convention, was a \"Muslim Brotherhood agent\" and \"a Muslim plant working with the Hillary Clinton campaign .\" He also shared another story that falsely claimed the Clinton Foundation paid Khan. Cordova also shared unfounded and false stories that claimed Cruz, a Texas Republican frequented prostitutes, was involved in a sex scandal and was hiding various public records related to his birth and education. In a post in 2013, Cordova called Democrats \"the real racists\" and said that 95% of blacks would not have voted for President Barack Obama if he were white. In a December 2016 comment on Facebook on an article about a nonprofit selling access to President Trump during the inauguration, Cordova called Clinton \"a slimy trailer trash huckster .\" Cordova also repeatedly shared fake or conspiratorial stories, including one that claimed that Clinton was photoshopping her rallies to make them look bigger, one with a fake quote from Clinton about Democratic voters, one that claimed NBA star Dwyane Wade endorsed Trump and one with a photoshopped picture of a black man holding a sign that read, \"No mother should have to fear for her son's life every time he robs a store .\" Cordova also struck a conspiratorial tone on his since-scrubbed Twitter account, of which only a few tweets are archived on several websites. In one tweet, Cordova called for a boycott of Budweiser because the company supported \"jihadis\" over white immigration. In another tweet, Cordova speculated the reason the identity of the shooter at Umpqua Community College in 2015 hadn't been made public was because he was a Muslim. The shooter was not a Muslim. In another tweet, Cordova compared MoveOn.org and the Black Lives Matter movement to Nazis. Copyright 2018 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2014013113_00039500_W", "names": {"Henrik Larsson": ["Q15695043", "Q179334", "Q37384205", "Q47506015", "Q47506078", "Q5937630", "Q5937640", "Q5937649", "Q5937657"], "Zheng Chang": ["Q45408829", "Q45486719", "Q45502031", "Q45502099", "Q45504465", "Q45521819", "Q45528163", "Q45535644", "Q45536920", "Q45549832", "Q45555842", "Q45556765", "Q45586671", "Q45622185", "Q45634960", "Q45636824", "Q50790722", "Q8070709"], "Paul Lichtenstein": ["Q27527282", "Q56460588"]}, "date": "2014-01-31", "url": "http://feeds.sciencedaily.com/~r/sciencedaily/health_medicine/~3/_BquMTCmMTk/140129165409.htm", "content": "New research from Karolinska Institutet in Sweden shows that medication used to treat ADHD in adult men can save lives on the road. According to a large registry study, which is now being published in the scientific journal JAMA Psychiatry, up to half of the transport accidents involving men with ADHD could be avoided if the men were taking medication for their condition. The researchers have studied 17,000 individuals with ADHD over a period of four years (2006-2009) using various population health' registers. They were then able to analyse the risk of transport accidents for individuals diagnosed with ADHD and how ADHD medication influence this risk. In line with previous research in this area, the results from the current study demonstrate that individuals with ADHD have an approximately 45 per cent increased risk of being involved in serious transport accidents, such as car or motorcycle accidents, compared to individuals without ADHD. \"Even though many people with ADHD are doing well, our results indicate that the disorder may have very serious consequences,\" says <mark>Henrik Larsson</mark>, associate professor at the Department of Medical Epidemiology and Biostatistics. Our study also demonstrates in several different ways that the risk of transport accidents in adult men with ADHD decreases markedly if their condition is treated with medication. \"To begin with, the incidence of transport accidents was lower among men with ADHD who received medication than among men with ADHD who did not. When the men were compared to themselves, i.e. during periods with and without ADHD medication, the researchers were able to establish that pharmaceutical treatment involved a significantly lower risk of transport accidents; during the periods of ADHD medication the risk was 58 per cent lower. Comparing the individuals to themselves is one of the study's strengths as it demonstrates that the connection between medication and decreased accident risk is probably not due to differences between individuals. Further statistical calculations showed that 41 per cent of the transport accidents involving men with ADHD could have been avoided if they had received medication for the entire follow-up period. This study, which has now been published, does not explain the specific mechanisms behind the effect of ADHD medication on accident risk. However, the researchers believe that the results may be explained by ADHD medication having an effect on the core symptoms of ADHD such as impulsiveness and distractibility, which in turn reduces the risk of getting into trouble on the road .\" Despite having shown that medication for ADHD very likely reduces men's risk of transport accidents, we could not establish a similar reduction in women's accident risk, \"says <mark>Henrik Larsson</mark>.\" We need further data to be able to comment about the effect on women with statistical certainty. It is also important to point out that most pharmaceutical treatments carry a risk of side effects. The risks must be weighed against the benefits for every individual prescription, taking into account the individual patient's situation. \"About five per cent of all school children and half as many adults suffer from ADHD, which is characterised by lack of attention, concentration difficulties and impulsiveness. Research has shown that ADHD is a relatively stable disorder and many of those who have been diagnosed with ADHD as children also meet the diagnostic criteria as adults. People with ADHD can be treated with medications such as central nervous system stimulants that affects the brain and thereby improve attention and impulse control. Story Source: The above story is based on: <mark>Zheng Chang</mark> Z, <mark>Paul Lichtenstein</mark>, Brian M. D'Onofrio, Arvid Sj? lander and <mark>Henrik Larsson</mark>. Karolinska Institutet .\" ADHD medication saves lives on the road. \"ScienceDaily. ScienceDaily, 29 January 2014. Karolinska Institutet. (2014, January 29). ADHD medication saves lives on the road. ScienceDaily. Retrieved January 30, 2014 from www.sciencedaily.com/releases/2014/01/140129165409.htm Detailed Look at HIV in Action: Researchers Gain a Better Understanding of the Virus Through Electron Microscopy Up Close and 3-Dimensional: HIV Caught in the Act Inside the Gut Childhood Depression May Increase Risk of Heart Disease by Teen Years Researcher Turns Sights on Prostate Cancer, Tissue Engineering, Blood Vessel Repair Sex-Specific Patterns of Recovery from Newborn Brain Injury Revealed by Animal Study More Than One-Third of Women Have Hot Flashes 10 Years After Menopause Does Caregiving Cause Psychological Stress? It Depends, Says Study of Female Twins Reuters - Innovations Video Online (Jan. 30, 2014) - Infant Warmer Created to Save Lives in Developing Countries Nov. 22, 2013 - New study reports that half of U.S. children diagnosed with ADHD received that diagnosis by age 6. The study found that an estimated two million more children in the United States (U.S.) have been Apr. 9, 2013 - Teachers in the Republic of Ireland consistently view medication treatment for Attention deficit hyperactivity disorder (ADHD) as a last resort, even when they view the disorder as biologically Nov. 22, 2012 - Criminal behaviour in people with ADHD (attention deficit hyperactivity disorder) dropped sharply during periods when they were on medication, according to a new extensive registry Study Evaluates Treating Mothers With ADHD to Improve Outcomes in Kids Oct. 17, 2012 - Researchers are conducting a study to determine if treating mothers with Attention Deficit Hyperactivity Disorder--either with medication or parent training--will help children at risk for Synergy Between Behavioral and Pharmacologic Interventions for ADHD Exclusive: Bloomberg tapped to be U.N. cities, climate change envoy - sources Terms of Use Copyright 2013 by ScienceDaily, LLC or by third-party sources, where indicated. All rights controlled by their respective owners. Content on this website is for informational purposes only. It is not intended to provide medical or other professional advice."}, {"articleID": "2009060523_00026327_W", "names": {"Brian Noble": ["Q2924967", "Q4964882", "Q610644"], "Tim Smith": ["Q19519946", "Q29568415", "Q3528691", "Q56853916", "Q59492194", "Q5994238", "Q7804295", "Q7804296", "Q7804300", "Q7804301", "Q7804302", "Q7804303", "Q7804304", "Q7804306", "Q7804307"], "Sean O'Loughlin": ["Q2070688", "Q3476769"], "Mark Henry": ["Q310073", "Q38915344", "Q6768003", "Q6768004"]}, "date": "2009-06-05", "url": "http://sportal.com.au/default.aspx/news-display/noble-pleased-with-blitz-71752", "content": "wigan coach <mark>brian noble</mark> hailed his side's ruthlessness after an early blitz saw off salford at the jjb stadium on friday night. the warriors set themselves up for a convincing 38-12 engage super league win with 22 unanswered points in a stunning opening 16 minutes. <mark>noble</mark> said: \"i thought our execution, the level of our skill and the quality of our passing was pretty special in that first 20-25 minutes .\" we got a little scruffy after that, but the discipline of our play in that period was good and something we can take into the rest of the season. \"george carmont, <mark>tim smith</mark>, pat richards and mark riddell all crossed in that purple patch. richards, who kicked six goals, later added a second and harrison hansen also went over for <mark>noble</mark>'s men. it was a second convincing win over salford in the space of seven days following last week's challenge cup success and <mark>noble</mark> felt his players' attitude had been excellent .\" it was a little bit like after the lord mayor's parade, \"he added .\" it can be a dangerous fixture and mentally you've got to be ready. \"i'm delighted we've come up with two points because we need to start getting the points in this competition .\" <mark>noble</mark> also praised the efforts of captain <mark>sean o'loughlin</mark> while explaining the reasons for leaving out sam tomkins in a week the young star was called up by england. <mark>noble</mark> said: \"<mark>sean o'loughlin</mark> has got to be in line for man of steel, he has been outstanding for us every game .\" it's brilliant sam's going with england. my only concern is we don't put him in the universe team before his feet have landed. \"we know we haven't got him next week so it was important we had a look at <mark>smith</mark>.\" salford coach shaun mcrae admitted his side was outplayed in the opening spell but believed it could still take positives from the game. luke swain, <mark>mark henry</mark> and malcolm alker all scored while scrum-half richie myler had another positive game. mcrae said: \"we were clearly blown away at the start of the game .\" we had 12 sets in the first half and that is not going to put you in a winning position. that is the difference, compared to their 23 sets. \"in the second half we had 24 sets, wigan had 17 and we had twice as much ball. then we showed what we can do and i am encouraged that we won the second half 12-6. copyright © 1999-2009 sportal. © 2009 all rights reserved."}, {"articleID": "2020032505_00015003_W", "names": {"Ross Duncan": ["Q57312464", "Q7369298"]}, "date": "2020-03-25", "url": "http://www.winsfordguardian.co.uk/sport/national/18331858.golf-clubs-need-members-more-ever-coronavirus-crisis/", "content": "Sport National Sport Golf clubs need members \"more than ever' in coronavirus crisis By Nick Rodger Golf Correspondent Golf in lockdown Peebles Golf Club, like facilities throughout Scotland, is facing up to the harsh realities brought on by the coronavirus 0 comment It wasn't that long ago that health experts were championing golf as a soothing, morale-boosting haven away from the ravaging rigours of the coronavirus. Things move quickly amid this wretched situation we find ourselves in, though. The inevitable Government announcement of more stringent social distancing measures the other night shuddered round the golfing community like the appalling judder that rattles up the shaft after a violent shank. The shutters are coming down everywhere and for some already toiling clubs, they may never re-open again. The rearguard action begins. With the kind of call to arms that should come with a finger-jabbing Kitchener poster, it's a case of\" your club needs you \"as far as members are concerned .\" Now more than ever, members need to stick by their club, \"said <mark>Ross Duncan</mark>, a past captain at Peebles and a former development director at Scottish Golf, as he echoed sentiments that will be ringing round the game's cradle and beyond .\" A lot of clubs were clinging on to the idea that golf was this safe sport amid all this but that's been brought to an abrupt halt and it's back to the drawing board. \"It's about emergency planning now and how clubs can survive. Here at Peebles, like most clubs presumably, we're making a rallying call to members to keep paying their fees so that we still have a club to come back to when we get through this .\" There is no other income and large and small clubs will be severely hit. It's a huge concern for everybody. The likes of Dornoch, for instance, well rely massively on overseas income. \"We will maybe get £ 60,000 from visitor income but that will mainly get wiped out now while we'll have about £ 250,000 worth of membership income which we clearly need to keep ticking over .\" The latest guidelines allows greenkeepers to at least go and maintain the course. We won't be needing greens running at 10 on the stimp but at least we can do basic maintenance .?? | The message to all of us is clear, we must stay home and play our part in containing the spread of COVID-19. With this in mind, Scottish Golf asks that all golfers in Scotland refrain from golfing until further notice. Read more?? https: //t.co/OjacNedNMQ pic.twitter.com/R5PXuCXxrS--Scottish Golf (@ ScottishGolf) March 23, 2020 \"We can apply to the Government schemes and get 80 per cent of various wages paid to staff. Our pro is on a retainer but he's self-employed too. We need to look after all our staff as best we can .\" We'll also have to be creative about how we give members the best value for money when we do return. Hopefully it's short term pain for long term gain. \"While golfers were encouraged to keep playing last week as long as they adhered to the social distancing measures, <mark>Duncan</mark> could see that the writing was on the wall .\" You could see a complete closure coming, \"he said .\" We had 100 people playing at the weekend in a stableford. I went up by myself for nine holes but you saw pockets of people playing but playing as they normally would. You started to get concerned. \"I have a friend who is a club manager in Spain and they all closed very quickly. It was coming .\" Like most clubs, Peebles has its fair share of hardy perennials; those habitual creatures of great golfing routine and longevity. The onset of enforced isolation is a concerning reality, not just for golfers, but for all walks of life. \"We have a group we call the TAMS, the Thursday AM Seniors, who play every week and they've been going for years,\" said <mark>Duncan</mark>. \"One is 93 and plays three or four times a week. There are a couple in that age group .\" They play nine holes, then have two or three coffees. That kind of business keeps clubs going. The social interaction with their peers is a big thing for them. \"They keep each other company. They will really miss that routine. That's happening across great swathes of society .\" During his stint as club captain, <mark>Duncan</mark> was given plenty of food for thought. Nothing as seismic as this, though. \"We had catering issues and I seemed to spend two years interviewing caterers,\" he recalled. \"Now I think\" christ, I thought I had a tough time then?'. There will be plenty of tough times ahead. 0 comment"}, {"articleID": "2015121216_00331591_W", "names": {"Ray Moore": ["Q30605431", "Q59201669"], "Tim Davis": ["Q27688782", "Q7803411", "Q7803412", "Q7803413"], "Mike James": ["Q14918262", "Q3313377", "Q6847383", "Q6847384", "Q948453"], "Ronnie Brown": ["Q3441777", "Q7365811"]}, "date": "2015-12-12", "url": "http://www.dddnews.com/story/2258709.html", "content": "BRPEDC meeting leads to a new \"kettle of fish' Saturday, December 12, 2015LAURA FORD Daily Dunklin Democrat What started out as a regular monthly Bootheel Regional Planning and Economic Development Commission meeting in October, later turned into a political fish fry in November for Hornersville Mayor William\" Bub \"Foresythe and a real catch for his community. According to Foresythe, the group originally met on Oct. 19 for its regular meeting in Dexter .\" At that time we talked with Caroline Yielding, who is out of Roy Blunt's office in Cape Girardeau, \"said Foresythe .\" She came down because we didn't qualify for the U.S.D.A. grant that we applied for, so she wanted to come and look at our streets, our equipment, our fire truck, and look at our town to see what shape we were in. \"Yielding said she would be in Hornersville around 11:30 on Monday, Nov. 9 .\" That was when I asked her if she liked barbeque or fish, \"he said and smiled .\" She said that she liked American made fish. \"Several individuals from MoDOT were standing nearby and overheard the conversation, and said they liked fish and asked if they could come .\" That's when David Blaylock, the new guy from Bootheel Regional said he liked fish as well and asked if he could come too. \"Foresythe told them that they were all invited to a good old fashioned fish fry at the Hornersville Community Building. On the day that Yielding came to Hornersville, an entourage of area committee representatives and politicians followed her. Among those at the fish fry were State Rep. Andrew McDaniel, along with his wife and their son; David Blaylock; Dustin Boatwright with Little River Drainage; Max <mark>Ray Moore</mark>, Hornersville resident and liaison for the city's drainage; State Rep. Don Rone; Jake Fisher; <mark>Tim Davis</mark>, general manager of Pemiscot-Dunklin Electric Cooperative; Karen Vandiver, Dunklin County assessor; Kent Hampton, Dunklin County clerk; and Senator Doug Libla. City Aldermen <mark>Mike James</mark> and <mark>Ronnie Brown</mark>, who had both been to the meeting in Dexter, cooked the fish for the group .\" <mark>Mike</mark> and <mark>Ronnie</mark> were excited about going to the meetings in Dexter, \"said Foresythe .\" They were especially excited about what was talked about at the meetings and what programs we could pursue in order to help our community. \"Dustin was going to talk to the group that day about what Little River Drainage has done on the river, but during the middle of the talk, he received a call that his wife had been in a wreck in Cape Girardeau, so he had to leave,\" he said. \"But, Max <mark>Ray</mark> took over and spoke about the drainage work and about what we have accomplished .\" Libla commented on the good relationship that the city had with both the Corp of Engineers and Little River Drainage. Foresythe said that from the meeting, he found that the ability to improve a community has a lot to do with not only the people you know within the community, but it also has a lot to do with the contacts you have outside the community as well. \"Everyone had a chance to talk, and as a result of that meeting, we are now receiving emails from Caroline about our earlier meeting with MoDOT regarding getting the airport sealed and recoated,\" he said. \"It looks like we will be getting that done soon. We are looking at another grant that we were not even aware of that could help us in getting a new fire truck and fire equipment .\" The mayor also said that since the $500,000 grant that the Bootheel Regional Planning Commission wrote did not work out for the city, the commission was now looking at other options that could help the town. Other needed improvements are fire equipment and a new police car, as well as tearing down some old buildings, including the old city hall. \"We had a really good turnout, and we were really pleased with the results,\" he said. \"All of this stemmed from that one Bootheel Regional meeting in Dexter, and we are just trying to put Hornersville on the map. All these years we just didn't believe in asking for help when we could do it ourselves. It may have put us a little behind the eight ball at times, but we still have one of the safest little towns in the area, and we have people from Kennett who want to move here .\" He added that if the meeting could get even one of the improvements needed on their list completed, then it was well worth it. \"It would be nice to be able to bring more politicians into the community to visit,\" he said. \"I have met a lot of people since I've been working with the coop (Pemiscot-Dunklin Electric Cooperative), and I thought it would be good to ask them to Hornersville .\" Foresythe would like to make the fish fry an annual event with Bootheel Regional. Foresythe explained that the Bootheel Regional Planning Commission is an association of local governments like Kennett, Dexter, Hayti that meets once a month to discuss issues and problem solving projects. Foresythe said that the city wants to become more involved with the commission, and since they now have some aldermen who want to be more involved, they are \"going to stay on it and see what they can offer other towns as well as other towns offer them .\" According to Foresythe, city officials also want to work more with conservation and restoring the park and the road that leads to it. \"Max <mark>Ray</mark> is concerned about one area near the bridge being lower than everything else,\" he said. \"After the meeting, Dustin said that they would be partnering with the Corp (of Engineers) to fix that area, so that will be taken care of .\" He added that it may take awhile for the park restoration, but at least the town will not have to worry about the flooding. \"In time, I believe Hornersville has a chance to grow, but we are going to have to make it to where our children will want to stay and be city leaders here,\" he said. \"We need to make it a safe and beautiful place to raise your kids .\" "}, {"articleID": "2016050310_00556799_W", "names": {"Nick Webb": ["Q10436294", "Q7028126"]}, "date": "2016-05-03", "url": "http://www.fightnews.com/Boxing/briggs-dimitrenko-is-official-336073", "content": "Hayemaker Promotions today confirmed that former WBO Heavyweight World Champion Shannon Briggs will face 6' 7 former European heavyweight champion Alexander Dimitrenko (38-2, 24 KOs) at Haye Day on May 21 at the O2, London. Briggs (59-6-1, 52 KOs) needs a victory to set-up a much anticipated fight with David \"The Hayemaker' Haye later this year. Shannon Briggs said,\" I don't care if this guy is tipped for a future world title, I am going to take him down in London. I don't care if this guy is younger than me, taller than me or hits harder than me. I'm in the best shape of my life and have the experience to take this guy down. I was beating George Foreman when this guy was still learning to read! Once I've knocked him out, I'll focus on taking David Haye down in his home town! \"I'm excited to put on a show for all my fans in the UK. It will be my first time fighting in this great country and the fans really embraced me when I was here earlier this month. This fight is just the warm up. I'll finish Dimitrenko and I'll celebrate, but then I'll be back to finish the Hayemaker! He won't be able to duck me any longer. Let's go champ!\" Dimitrenko stated, \"Brigg's is a loud fool, I will do my talking in the ring and he won't know what's hit him. The fight will see a former world champion lose in epic style to a future world champion. He is now the champ of Instagram but that's where his reign ends. Brigg's is going to learn first-hand what a hard hitter I am!\" Haye, who will fight undefeated Arnold \"The Cobra' Gjerjaj (29-0, 21 KOs) said,\" I'm thrilled to say that we've got another quality fighter appearing on the Haye Day undercard. Alexander Dimitrenko is a big guy and a heavy puncher and a real challenger for a world title--I think he'll cause Briggs some serious problems. If The Cannon does managed to walk away victorious, I'll be surprised, but at the same time he'll have proved his worth. It just means I get to be the one to knock him out--which is even better. \"The fans are in for a treat on May 21. We've put together a really strong card that I'm sure will get people pumped for the main event of the evening--my knockout win against\" The Cobra'. Entertainment and excitement is guaranteed. \"Also fighting on the night is Sheikh Fahad Bin Khalid Al Thani, a member of the ruling family of Qatar. He is the country's first ever professional boxer and he will make his debut on the undercard at The O2. He joins an undercard with\" Smokin' Joe Mullender taking on Lee \"Banjo' Markham for the English middleweight title as chief support, with a host of young Brits also in action including; lightweight Floyd Moore, light welterweight Kay Prospere, light heavyweight Ollie Patterson and heavyweight <mark>Nick Webb</mark> all set to fight on the night. Tickets to Haye Day at The O2 on May 21 are available on general sale now via www.theo2.co.uk"}]