[{"articleID": "2017050421_00025580_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"], "Glenn Beck": ["Q21213245", "Q310618"]}, "date": "2017-05-04", "url": "http://wtam.com/onair/glenn-beck-56047/paul-ryan-and-the-gop-make-15802479/", "content": "<mark>Paul Ryan</mark> and the GOP Make Lindsey Graham Look Like Benjamin Franklin posted by The <mark>Glenn Beck</mark> Program - 1 hour ago share Well, it looks like Republicans are going to pull a Nancy Pelosi with the Obamacare replacement bill. We'll have to pass it to see exactly what's in it. If only we'd elected someone who promised to drain the swamp, destroy the GOP, tear the system down and get the weasels out. Oh wait, we did. Unfortunately, Trump has failed to deliver on many of his promises--and it won't be <mark>Paul Ryan</mark> and the GOP holding his feet to the fire. \"I mean, at first, we liked <mark>Paul Ryan</mark>. Then we're like,\" Oh, he's a dirtbag, but at least he's not Lindsey Graham .' Lindsey Graham looks like Ben Franklin compared to the GOP now...Lindsey Graham hasn't gotten better. The GOP has gotten worse, \"<mark>Glenn</mark> said Thursday on radio. Listen to this segment beginning at mark 4:10 from The <mark>Glenn Beck</mark> Program: Known for his quick wit, candid opinions and engaging personality, <mark>Glenn Beck</mark> has attracted millions of viewers and listeners throughout the United States with The <mark>Glenn Beck</mark> Program. His radio show is now heard on over 400 stations and is nationally syndicated by Premiere Networks. It is the third highest-rated national radio talk program in America. <mark>Glenn</mark> is also the founder and owner of The Blaze, a 24/7 news, information and opinion network that is available on television and online. He also has multiple #1 New York Times bestsellers in both fiction and non-fiction along with hosting acclaimed live-events, overseeing the fashion brand 1791, and previously hosted a phenomenally successful show on Fox News and CNN's Headline News. Across all of these mediums, <mark>Beck</mark> connects with his fans in a whole new way, inspiring and entertaining them with his humor, hard-hitting interviews and honest tales about his life. Contact"}, {"articleID": "2015041409_00057982_W", "names": {"David Coates": ["Q25675757", "Q5232435", "Q55996234"]}, "date": "2015-04-14", "url": "http://news.asiaone.com/news/world/clinton-taking-different-tack-new-campaign", "content": "Former secretary of state Hillary Clinton may have been just confirming the worst-kept secret in American politics by announcing her White House run, but the brief video she used to launch her campaign still made a splash when it was unveiled on Sunday. The clip, just over two minutes long, was notable for several reasons - its large and diverse cast, its sole emphasis on middle-class Americans and just how little it focused on the candidate. None of the 38 other people in the video - which included single mothers, same-sex couples, Asian Americans and Hispanics - talked about Mrs Clinton. They spoke only about themselves, offering no praise for the former first lady. In fact, the name \"Hillary Clinton\" is not uttered a single time. Mrs Clinton makes an appearance only towards the end to announce that she is running for president again and wants to fight for the American middle class. \"Everyday Americans need a champion and I want to be that champion, so you can do more than just get by - you can get ahead and stay ahead,\" she said. And that was the sum total of policy mentioned in the clip. There was no talk of her track record in government as secretary of state or senator. If anything, she appeared to be secondary to the video. It was a stark contrast not just to the launch videos of the two Republicans who have begun their campaigns, but also to the one she used to announce her first shot at the White House in 2007. Then, her video had consisted entirely of her seated in her Washington, DC, home laying out her priorities and vision. In style and substance, it is clear Mrs Clinton is trying to avoid the mistakes of the 2007 campaign that appeared to position her as an inevitable candidate and failed to latch onto the mood for change in the country. Sunday's video, which quickly racked up 1.5 million views, also took pains to make clear that Mrs Clinton does not have next year's election sewn up, despite her domination of current polls. \"I'm hitting the road to earn your vote, because it's your time, and I'm hoping you'll join me on this journey,\" she said. The video marks a further step in her campaign team's attempt to dispel her reputation of being aloof and out of touch. In the lead-up to the announcement, the team had also sought to try to bring out her softer side, emphasising her experiences as a mother and new grandmother. Just days earlier, she released an epilogue to her 2014 memoir that was dominated by how she felt when her daughter Chelsea gave birth to Charlotte Clinton Mezvinsky last September. She wrote: \"When Chelsea was born, I was full of nerves...As a new grandmother, however, there is nothing but joy. It's probably the world's best job .\" You get all the happiness of doting on a tiny child as she begins exploring the world but without the responsibilities or anxieties of being a parent. \"While analysts agree that pushing her softer side is a worthwhile strategy for a figure who has struggled to be relatable, it is not yet clear if the rebranding will work. Professor <mark>David Coates</mark>, from the department of politics and international affairs at Wake Forest University, said:\" Hillary looks unbeatable in her pursuit of the Democratic nomination, but all the Democrats I know are worried - they are not enthusiastic. \"They think she is too centrist, and that she comes with too much baggage. They worry the baggage might let a Republican in when we move from the primaries to the election, and that even if she wins, she will prove too moderate at home and too hawkish abroad .\" The entry of the highest-profile candidate has raised the temperature for a presidential race that is just beginning. A handful of Mrs Clinton's possible opponents wasted no time in attacking the Democratic front runner. Texas Senator Ted Cruz, who announced his candidacy three weeks ago, released a video saying Mrs Clinton \"represents the failed policies of the past\". Former Florida governor Jeb Bush, a Republican and the biggest name yet to officially declare his bid, similarly attacked her foreign policy track record in a new video. \"We must do better than the Obama-Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies,\" he said. Other candidates in the race Other candidates who have officially declared, all Republican: Texas Senator Ted Cruz, 44 According to an average of polls done by RealClear - Politics, he trails Mrs Clinton by 10 percentage points. Among Republicans, he stands in third place, with just 10.5 per cent support. Kentucky Senator Rand Paul, 52 Polls show Dr Paul trailing Mrs Clinton by about 7 percentage points. He is just behind Mr Cruz in the Republican Party, with support of 9.8 per cent Florida Senator Marco Rubio, 43 Announced his candidacy yesterday. He is 7.8 percentage points behind Mrs Clinton. This article was first published on April 14, 2015. Caught on camera: Airport employees steal from tourists' luggage \"Slicing and dicing\" : How some US firms could win big in 2016 elections Veterans to attend Taiwan military parade marking defeat of Japan"}, {"articleID": "2017031716_00644680_W", "names": {"Lin Chuan": ["Q45542575", "Q45649697", "Q8997373"]}, "date": "2017-03-18", "url": "http://www.taipeitimes.com/News/taiwan/archives/2017/03/18/2003666993", "content": "<mark>Lin</mark> vexed by complaints over labor changes By Alison Hsiao / Staff reporter Premier <mark>Lin Chuan</mark> gestures during a question-and-answer session at the Legislative Yuan in Taipei yesterday. Photo: Peter Lo, Taipei Times Employers would not have had any problems implementing the \"one fixed day off and one flexible rest day\" policy if they had been complying with the Labor Standards Act (勞動基準法) all along, Premier <mark>Lin Chuan</mark> (林全) said yesterday. The Chinese Nationalist Party (KMT) caucus and Nantou County Commissioner <mark>Lin</mark> Ming-chen (林明溱) on Thursday said that the central government should take responsibility for the public's complaints about the new labor policy and asked for more \"flexibility\" for employers. The policy has significantly increased costs in the ready-mixed concrete industry, while relations between workers and employers have deteriorated, Taiwan Ready-Mixed Concrete Association chairperson Chu Jui-lu (朱瑞爐) said. \"Many businesses might fold this year. We might witness a wave of bankruptcies,\" Chu told the Chinese-language Economic Daily News. <mark>Lin</mark> said that many businesses have been stoking tensions by mentioning problems related to general management, many of which were not caused by the policy, \"but due to that [the businesses] did not closely follow the Labor Standards Act in the past .\" The government's follow-up to the act's implementation and its examination of the problems reportedly caused by the policy has shown that the problems mostly arose from lax execution of the labor law prior to its amendment, the premier said, adding that the government would continue to monitor the effects of the policy and communicate with the public. The Ministry of Labor yesterday announced that the logistics industry will be allowed flexibility when applying Article 30, Paragraph 3 of the act, which stipulates that employers, with prior consent from the relevant unions, can distribute the regular working hours over eight weeks, provided that the regular working time does not exceed eight hours per day and the total number of working hours do not exceed 48 hours per week. It would collect opinions regarding the measure, it said. Asked about the proposed relaxation and whether other industries would be given similar flexibility, the premier said he would respect the ministry's decision. However, Chinese Nationalist Party (KMT) Legislator Alicia Wang (王育敏) said the government should set \"a final tone\" instead of using executive orders to relax prohibitions that it established, \"which leaves everyone baffled .\" This story has been viewed 89 times. Comments will be moderated. Remarks containing abusive and obscene language, personal attacks of any kind or promotion will be removed and the user banned. Listing from 2017-03-11 to 2017-03-18 Most read"}, {"articleID": "2014040823_00020317_W", "names": {"Robert Lewandowski": ["Q151269", "Q16596664"]}, "date": "2014-04-08", "url": "http://news.lalate.com/2014/04/08/borussia-dortmund-vs-real-madrid-2014-score-prompts-uefa-champions-league-battle/", "content": "LALATE: The Latest Celebrity News, Entertainment News, Soccer, Football, World Cup, Scores! NCAA Men's College Basketball Tournament | March Madness Final Four Printable Brackets EPL Table 2014 English Premier League Standings Rankings | Soccer En Vivo Live Score Results Today Dancing with the Stars 2014 Results Tonight Prompts Elimination Powerball Winning Numbers Results Tonight | Mega Millions Numbers ST LOUIS (LALATE) - Borussia Dortmund vs. Real Madrid 2014 (en vivo live score results below) heads to the field today April 8, 2014 for UEFA Champions League results. The soccer game is the second leg of a two leg quarterfinals futbol round. Previous score between these two teams was 0-3. So can Borussia overcome a three goal deficit to win today? Today's Borussia Dortmund vs. Real Madrid 2014 soccer game for 4/8/14 (start time 11:45 am PST) features a Bundesliga Table team taking on a Primera Division squad. Real is currently third in the Primera holding seventy-six points, roughly three points out of first. Borussia earned fifty-eight, to put them second in the Bundesliga. Overall however, Borussia has three wins, one draw and one loss in their last five matches. Real in turn has three wins, and two losses in their last five games. But can Borussia Dortmund win today, and overcome a three goal deficit? Striker <mark>Robert Lewandowski</mark> thinks so. <mark>Lewandowski</mark> tells his team's news site that a Borussia win could change history. \"We need to write history again. If we can get an early goal, then there's a small chance. We mustn't be afraid .\" But what if the first early goal is not achieved? <mark>Lewandowski</mark> tells news \"We have a minimal chance. It would be crazy to think that I could score four goals again, but we are always dangerous in Dortmund .\" "}, {"articleID": "2016071206_00343171_W", "names": {"Jonathan Tremblay": ["Q3183483", "Q3183486"]}, "date": "2016-07-12", "url": "http://blackburnnews.com/bri-national/2016/07/12/deluge-leaves-saskatchewan-city-awash-with-runoff/", "content": "Southern Saskatchewan warned of soggy week By The Canadian Press July 12, 2016 1:54 am ESTEVAN, Sask .--Parts of southern Saskatchewan have been warned that heavy rain--possibly as much as 100 millimetres--could bring flooding. A rainfall warning was in place Monday from Prince Albert, south to the U.S. border. Environment Canada said heavy downpours could cause flash floods, water pooling on roads and flooding in low-lying areas. And even parts of northern Saskatchewan have been hit, with a secondary highway near La Ronge being washed out, and a state of emergency being declared in Carrot River. Saskatchewan emergency management commissioner Duane McKay said communities should be prepared. \"Obviously, some of these issues will impact individuals, so we've notified our provincial disaster assistance team and they are ready to go with any help that municipalities might require there as well,\" McKay said Monday in Saskatoon. McKay also said there's a large cache of flood equipment, such as barriers and pumps, in southern Saskatchewan from flood responses in 2011, 2012 and 2014. \"The province is well provisioned in terms of making sure that, in the event of a flood in any community that requires equipment, the entire equipment from start to finish would be available. And it's on trailers, so it could be rapidly deployed to particular areas .\" Humboldt saw flooding on Sunday and a state of emergency was declared in Estevan when roads and basements were left under water by storm sewers unable to handle at least 130 millimetres of rain that fell in just over two hours. McKay said he hopes the worst is over for Estevan. \"All of the infrastructure, although it was overwhelmed, seems to be keeping up with the removal of the water through lift stations and so on,\" he said. \"So although it's very dramatic when you see the photos of rivers where streets should be, the systems are working and are beginning to clear that water out of that area. Most of the water in those low-lying areas will cause some damages .\" On Monday morning, the sky was blue as friends of Brooke White, who lives in an Estevan trailer court that was badly flooded, ferried in supplies for her in an inflatable dinghy. But by supper time, storm clouds started moving in again, and people were nervously watching the sky. The Red Cross has provided 300 cleanup kits to Estevan, which includes a mop, sponges, brooms, gloves and supplies to safely clean flood-damaged homes and property. Estevan resident Janet Foord, who was returning home when she was caught driving in the storm, said intersections were flooded and vehicles had water up to their mirrors. \"It took me about 20 minutes to get from the highway to my house, which usually takes about four minutes, just because I couldn't find a dry spot or a high spot to go down without stalling our vehicle,\" said Foord. Foord said her neighbours' homes are flooded and the underground parking garage in a condo behind her house is filled with water. \"You could see stuff floating as I walked by .\" People trying to get water out of their basements also faced a challenge when the power went out Sunday, because they needed generators to run their sump pumps, Foord said. SaskPower spokesman <mark>Jonathan Tremblay</mark> said the storm took out a transformer for about half the city's 11,000 residents. Most of the power was restored in about 4 1/2 hours, <mark>Tremblay</mark> said. But as of Monday there were still outages \"here and there\" because poles were in water or lines were knocked down by branches. \"It's slow going to send crews out and safely repair those things, especially with all the water on the ground,\" said <mark>Tremblay</mark>. Some roads also flooded in several other communities, including Lloydminster and Yorkton. Alan Cayford, Lloydminster's director of public works, says the official amount recorded at the airport weather station was 63 millimetres. \"It was a pretty intense and tight-web system that did this to us,\" said Cayford. Yorkton Mayor Bob Maloney said his city got about 51 millimetres of rain Sunday night and water pooled on some streets. Yorkton isn't covered by the rainfall warning, but Maloney was apprehensive. \"If we get more rain on top of what we had yesterday, we could have issues,\" said Maloney. Yorkton improved drainage from downtown after some 1,000 homes damaged when heavy rain floods basements and turns streets into canals in 2010. Maloney says since 2010, there have been three or four storms \"where it just doesn't stop raining\" and residents are leery. \"We have bad memories. When it rains at night, I swear to God everybody in Yorkton gets up and looks out the window. We're scarred .\" --By Jennifer Graham in Regina, with files from CTV Saskatoon"}, {"articleID": "2009091423_00054536_W", "names": {"Shimon Peres": ["Q55277572", "Q57410"]}, "date": "2009-09-14", "url": "http://montrealgazette.com/news/Columbia+astronaut+killed+crash/1991579/story.html", "content": "columbia astronaut's son killed in f-16 crash israeli lieutenant assaf ramon (right) is congratulated by israeli president <mark>shimon peres</mark> on his graduation day from pilot academy at the hatzerim base on june 25. photograph by: afp, getty images, agence france-presse an f-16 fighter plane crash in the west bank yesterday killed its pilot, uniting israel in grief for the son of israeli astronaut ilan ramon, who died in the 2003 columbia space shuttle disaster. the single-seat warplane crashed in a remote hilly region south of the city of hebron, the military said, adding that it was not immediately clear what had caused the accident. military officials named the pilot as lieutenant assaf ramon, 21, the eldest son of colonel ilan ramon, an israeli fighter pilot who became the jewish state's first and only astronaut. news of the crash rocked the jewish state, where ilan ramon is regarded as a national hero. \"today, we are plunged into grief ....assaf ramon has died the same way as his father. it's a terrible tragedy, which has struck all the people of israel,\" prime minister benjamin netanyahu said in a statement. a military spokeswoman said an inquiry had been launched and that all of the air force's f-16s were grounded until further notice. air and ground forces were mobilized for several hours after the crash to recover debris. astronaut ilan ramon was killed along with six others when the space shuttle columbia disintegrated during re-entry over the texas on feb. 1, 2003. israeli lieutenant assaf ramon (right) is congratulated by israeli president <mark>shimon peres</mark> on his graduation day from pilot academy at the hatzerim base on june 25. stm bus driver refuses to speak english, calls police lifeguards \"didn't do anything' to save hila, family says thousands return home following toronto explosives scare government to get tough with white-collar criminals"}, {"articleID": "2009122523_00059305_W", "names": {"David Anderson": ["Q1175128", "Q16150074", "Q18572352", "Q20921979", "Q21004823", "Q21403068", "Q27909642", "Q3017380", "Q3017389", "Q3409354", "Q45496094", "Q5230766", "Q5230767", "Q5230768", "Q5230769", "Q5230773", "Q5233911", "Q5235389", "Q5237813", "Q5238291", "Q5240683", "Q57431545", "Q58652056", "Q59150007"]}, "date": "2009-12-25", "url": "http://triplepundit.com/2009/04/virgance-and-the-business-of-activism/", "content": "has managed to do something completely unusual: attach a business model to activism. how? by starting anti-boycotts. by fostering collective bargaining for alternative energy buys. by letting ordinary citizens dip into huge corporate philanthropy funds. what started last year as one novel idea - that maybe consumers should try to buy their way into making a business more sustainable - has grown into a venture-funded startup that calls itself a platform supporting activism 2.0. if the web 2.0 movement showed that the internet could be monetized, activism 2.0 might prove that do-gooders can turn a profit. brent schulkin is an energetic 28-year-old who always seems to have a group of people around him. he certainly did when i met him at the k & d market in san francisco's mission district one saturday morning in late march last year. in fact, there were hundreds of people, lined up nearly around the block waiting to get into a completely unremarkable bodega. schulkin, by using email, facebook and bevy of other social media tools, had managed to entice the crowd to arrive and shop en masse, forming what he called a carrotmob (oh, that's carrotmob ™ now). to earn such patronage, k & d agreed to use a 22 percent cut of sales made during the buying frenzy to make efficiency improvements in the store. an incredible $9400 in wine, soap, cheerios and other corner-store fare was rung up that day, and after subtracting all the taxes and crv (california refund value), the store put $1,840 toward green renovations. but the bigger success was the buzz this carrotmob generated. consumers are drawn to the notion that they can influence a business to become more sustainable, and not by boycotting the business but by patronizing it - essentially giving it the funds to make sustainability improvements. after that first mob, schulkin hoped he'd parlay the effort into a thriving non-profit that stages carrotmobs regularly and at all kinds of businesses. instead, he co-founded virgance with steve newcomb, a 39-year-old entrepreneur and political advisor who has been involved in nine other startups, which collectively generated more than $3 billion in market value (he founded powerset and loudfire). the two of them have pulled together a growing team of other fresh-faced upstarts and added a number of other campaigns to the agenda. last fall, virgance acquired 1 block off the grid (1bog), an effort that was started by a san francisco couple who decided that if they banded together, homeowners could make the process of installing solar panels cheaper and less arduous. 1bog forms groups of potential solar buyers within cities - it's up to four now (sf, san diego, la and new orleans) - and then uses collective bargaining to get discounts on the panels and installation costs. in exchange for generating so much new business for the solar installer, 1bog gets a cut of the profits. partnered with sunrun, a well-funded solar purchasing program that installs panels on homes but retains ownership of the panels and in return the homeowner pays a reduced rate for power. other projects are in the works, including a facebook campaign called lend me some sugar, wherein virgance will act as an agent for managing and distributing a company's corporate social responsibility funds (a process for which it will be paid) and then facebook members will get to choose how the funds are spent. another project to come is a green investment portfolio in which facebook members will invest small amounts ($100 range) and virgance will get a cut of investment profits. schulkin says the next carrotmob in san francisco is in the making, and that this time he'll be crowdsourcing the business selection process - look for video pitches by three bay area business owners to appear on the carrotmob site and you'll be able to vote for the one most deserving of a mob. green options media. its founder <mark>david anderson</mark> says that what attracted him to the virgance platform is the scalability it offers the green options sites (it published blogs aimed at a number of sustainability-related topics, from transportation to food). \"before, whenever yahoo would pick up one of our stories, the traffic would crash our servers,\" he says. indeed, it's the bandwidth and web development power that virgance offers that adds the real business power to the projects it supports. raised $750,000 in funding and has noted that it's already seen profits through the 1bog venture. \"we are excited about any idea that causes positive social change,\" schulkin told me last fall, \"and we are really excited that 1bog is the first sign that this will work .\" great story - totally inspirational and another good example that folks can do good and do well at the same time. i hadn't heard about virgance, but will certainly spread the word, and would love to see them in the boston area. blog comments powered by disqus"}, {"articleID": "2014012012_00024605_W", "names": {"Jerry Brown": ["Q152451", "Q717620"]}, "date": "2014-01-20", "url": "http://www.eastcountymagazine.org/node/14764", "content": "By Miriam Raftery January 19, 2014 (Sacramento) - Governor <mark>Jerry Brown</mark> has issued an emergency declaration due to the third straight year of drought in California. \"We're facing perhaps the worst drought that California has ever seen since records began being kept about 100 years ago,\" the Governor said. He asked all Californians to cut water use by 20 percent. Water conservation is voluntary for now, but could become mandatory if conditions worsen. The Governor also directed state agencies to hire more seasonal firefighters. The State Water Agency offers these tips to reduce your water usage. Find and repair leaks. Take shorter showers or switch to a low-flow showerhead. Turn off faucets when not in use. Cut lawn watering to the minimum and fix broken irrigation systems, since residential irrigation accounts for a third of all urban water use. If possible, replace old toilets and clothes washers with new, more water efficient models. Agriculture is also being hard-hit by the drought, and conditions are expected to worsen over the next few months with no significant rain forecast. Up to 200,000 acres of farmland could be fallowed statewide. Governnor <mark>Brown</mark> said he hopes to receive help from the federal government after issuing the emergency drought declaration. The U.S. Department of Agriculture has designated portions of 11 states as natural disaster areas due to the drought, including portions of California, making farmers eligible for low-interest emergency loans to cover their losses. San Diego is not on the list of areas eligible for such help, however. Despite the Governor's emergency declaration, the San Diego County Water Authority issued a press release Friday stating that it has adequate supplies for 2014 because of local investments in diverse and reliable water supplies over the past two decades, along with a decline in demand for water in our region. San Diego's County Water Authority is not predicting a need for countywide water use restrictions beyond the Governor's request for voluntary 20% cuts. But local officials are encouraging residents and businesses to use water as efficiently as possible to avoid water waste. The San Diego region imports about 85 percent of its water supplies, and this year's imports are expected to be very low. Fortunately the Metropolitan Water District of Southern California, the largest provider of water to our region, says it has adequate stored water reserves for this year since the San Diego region's water users have made great strides in water-use efficiency. Per capita water use has decreased about 27 percent since 2007, and local cities and water districts are on pace to meet their state-mandated water-efficiency targets for 2020. The Water Authority and its 24 member agencies offer rebates, tools and educational programs to improve water-use efficiency at homes, businesses and institutions. For more information, go to the WaterSmart link at www.sdcwa.org. In addition, the Water Authority and its member agencies have made significant investments to diversify San Diego County's water supply sources. Conservation-and-transfer programs that are part of the Colorado River Quantification Settlement Agreement of 2003 provide a significant hedge against drought for our region. Another major piece of the Water Authority's supply strategy is the Carlsbad Desalination Plant, which is under construction. The Water Authority signed an agreement to buy up to 56,000 acre-feet of water annually from desalination project, which is expected to start commercial production in early 2016. It will produce enough locally controlled, drought-proof water to serve approximately 112,000 homes. The Water Authority also is assessing proposed solutions to water supply challenges in the Sacramento-San Joaquin Bay-Delta, which is the source of about 20 percent of the San Diego region's water supplies. It has become less reliable as a supply source in recent years and its habitat has deteriorated. The Water Authority's Board is analyzing potential strategies for restoring the Bay-Delta through a conservation plan."}, {"articleID": "2013053000_00092604_W", "names": {"Peter Knowles": ["Q2076364", "Q473272"], "Roberto Carlos": ["Q10363269", "Q429039", "Q465191", "Q59205376", "Q7351627"], "Darren Lewis": ["Q5225019", "Q5225021"]}, "date": "2013-05-29", "url": "http://bleacherreport.com/articles/1655313-tottenham-hotspur-the-constant-tinkering-of-gareth-bales-identity", "content": "Gareth Bale's career, but by tinkering with his identity, he's now their MVP. Santos and Kevin-Prince Boateng didn' t do-fight on in spite of adversity to become a star at White Hart Lane. \"C' mon Gareth, stop messing about with your hair,\" pleaded then-Spurs manager Harry \"Bale realised he had to be tougher if he was going to make it in the Premier League and he has done that,\" said Redknapp as he reflected on the Welshman persevering through hardship. Paul Gilham/Getty Images The signing of Benoit Assou - Ekotto from Lens-the club that later produced Raphael Despite hopes that he would become a Premier League ace, Bale's tenuous status as a squad player was further exacerbated by playing in 25 winless games for the club, a statistical anomaly. With constant lapses in concentration when he was afforded an opportunity at left-back, Redknapp's patience was growing thin as he lamented (via Tribalfootball. com): \"Bale has to learn how to defend, learn how not to let people play balls inside him, learn to recover, just learn parts of his game .\" Jol: \"I tried to sign Bale on loan at Hamburg. He'd played 20 games without winning but Spurs knew he was exciting\" The Daily Mail's headline on October 21, 2009 was \"Spurs flop Gareth could Bale out in January as Birmingham boss Alex McLeish eyes? 3m defender .\" \"I'm not looking for a left-back because you won't get a better one than Gareth Bale,\" stated The Belfast Telegraph) when queried on the possibility of the Welshman leaving. Inter Milan, cue the taxi for Maicon chants, Redknapp stuck to his gut-instinct (via The National's Rob Shepherd): \"In the long-term I eventually see Gareth dropping back and playing at left-back where he can be one of the best, if not the best .\" Redknapp was a friend of <mark>Peter Knowles</mark>, whose brother, Cyril, was one of Spurs' greatest ever players (via Everyone knows the phrase \"Nice One Cyril' - renowned after the pop record-and every Spurs fan knows that Cyril <mark>Knowles</mark> is one of the best left-backs to grace White Hart Lane. <mark>Knowles</mark> soon developed the style of the overlapping full-back, using all his natural ability from his days as a winger to great effect. envisioned Bale being a modern-day Cyril <mark>Knowles</mark>. Either way, the idea of Bale being a world-class left-back #Spurs left. Imagine writing those words last January - Oliver Kay (@ OliverKayTimes) November 2, 2010\" I remember coming back from scouting him and thinking \"I've seen the new Paolo Maldini',\" recalled former Spurs director of football Damien, the poster boy for de - facto wide forwards masquerading as full-backs, explained his reasoning for starting Bale at left-back (via Sid Lowe at The Guardian): In my team he'd always be a full-back. People get scared and play attacking full-backs as wingers. They think they will attack more, but often they attack less and less well. It happened with <mark>Roberto Carlos</mark>: as a winger, he was less effective, he needs to start his run sooner. skilful and good as a winger, but at Barcelona he would be a full-back. Bale's sudden rise from struggling left-back to world-class winger perpetuated the misconception that Redknapp, never one to shy away from tooting his own horn, always wanted to change the Welshman into a winger from the get-go, when that Jol, who managed Tottenham from 2004-07, was closer to being correct with his initial analysis of Bale's best position than ESPN FC): \"He can play as a wide player but Bale's best position would be as a wing-back in a 3-5-2, what he does with Wales, but we play 4-4-2 .\" \"Was he a left-back or a winger?\" pondered former teammate The Daily Mail). Neither. \"He's turned into a player who is very similar to Manchester United in the way he progressed and started picking up the ball in central positions and scoring goals,\" Shaun Botterill/Getty Images The manager that deserves to receive the most credit for Bale's transformation is Andre Villas-Boas. \"Bale is extremely comfortable playing as a striker and the more he plays there the more he is likely to help the team,\" said Villas-Boas (via <mark>Darren Lewis</mark> at The Mirror). Demanding Bale to be Spurs' deep-lying forward with the ability to roam (talk about a bold tactical move) has Villas-Boas stamped all over it. Gif via The Guardian When Sir Alex Ferguson afforded Ronaldo more freedom, the Portuguese forward's goal tally spiked from 26 to 42 ., he's now scored 50 + goals or more in three successive seasons. By transitioning so quickly from an assist-first mentality to a shoot-first approach, something Villas-Boas encourages, it's understandable why Bale's shots per league goal is a wasteful 7.8, compared to Ronaldo's 6.9 (inefficient) and Lionel Messi's 3.5 (what Bale should aspire to). If Bale stays with Spurs instead of moving to Real Madrid, What is the duplicate article? Why is this article offensive? Where is this article plagiarized from? This comment and all replies have been deleted This comment has been deleted We'd like to send you the most entertaining"}, {"articleID": "2010101001_00328855_W", "names": {"Liu Xiaobo": ["Q41617", "Q704986"]}, "date": "2010-10-09", "url": "http://un.org/apps/news/story.asp?NewsID=36380&Cr=china&Cr1=", "content": "email this article ban hopes nobel peace award to china's <mark>liu</mark> will not detract from global rights agenda nobel peace prize winner <mark>liu xiaobo</mark> of china secretary-general ban ki-moon voiced the hope today that any differences over the awarding of this year's nobel peace prize to <mark>liu xiaobo</mark> of china, which beijing has opposed, would not detract from promoting the human rights agenda globally or from the prize's prestige. \"the award of the nobel peace prize to <mark>liu xiaobo</mark> of china is a recognition of the growing international consensus for improving human rights practices and culture around the world,\" a statement issued by mr. ban's spokesman said. \"the secretary-general has consistently emphasised the importance of human rights along with development and peace and security as the three main pillars of the work of the united nations .\" over the past years, china has achieved remarkable economic advances, lifted millions out of poverty, broadened political participation and steadily joined the international mainstream in its adherence to recognized human rights instruments and practices. \"the secretary-general expresses his sincere hope that any differences on this decision will not detract from advancement of the human rights agenda globally or the high prestige and inspirational power of the award,\" it concluded. un high commissioner for human rights navi pillay called mr. <mark>liu</mark> a \"very prominent human rights defender\" and said advocates like him make an important contribution to china's development. \"we welcome this recognition of the very important role human rights defenders play in china, and in many other countries, as well as the challenges they face - also the courage they so often show in speaking up for what they believe in,\" she added. countries agree on next steps for upcoming un climate change negotiations sea cow, origin of mythical mermaid, threatened with extinction, un warns un trust fund makes grants to initiatives against gender-based violence secretary-general, at group of 77 and china ministerial meeting, spells out priorities for five-year push to 2015 secretary-general saddened by devastation caused by severe flooding in china; reaffirms un commitment to assist, if needed, government relief efforts"}]