[{"date": "2014-02-22", "url": "http://www.graziadaily.co.uk/fashion/news/milan-fashion-week-diary-3", "content": "Grazia's Katherine talks through the street style trends in Milano Next stop: the 2014 International Woolmark Prize. Let the contest begin! Alexa Chung wears a Valentino cape dress to take her seat on the judging panel Some wonderful wool creations hit the catwalk for the Woolmark Prize The judges, including Frida Giannini and Franca Sozzani, reveal the winner of the Woolmark Prize Digital Editor Jessica Vince chats to Alexa Chung about channelling Cheryl Cole on the Woolmark Prize judging panel And the winner is...Rahul Mishra! Name to know: Mauro Grifoni. Definitely for the Grazia girl We loved the Western influence at Gianvito Rossi The divine Paula Cademartori showcases her new Piaggi bag More luxe bags from Paula Cademartori Adoring these pretty floral pouches from Furla A parka and a polar bear at Woolrich People. Perfect. Snuggly parkas all in a row from Woolrich People Anna Dello Russo causes a paparazzi scrum outside the Armani show. And yes, that's the <mark>Jeremy Scott</mark> for Moschino outfit she's wearing ADR takes a selfie outside the Emporio Armani show - whilst sitting on a Vespa This little lady is causing paparazzi carnage outside the Emporio Armani show. Maybe they think it's JLo (it's not) Look who's backstage at Emporio Armani: it's only Calvin Harris! The DJ says he's here for his girlfriend. Yep, that's Rita Ora MTV's Laura Whitmore FROW'd at her first Emporio Armani show today. \"It was so exciting!' she told us We meet Chiara Ferragni kitted out in Burberry at the Emporio Armani show .\" Wear something comfortable' is her FROW tip We loved the mushroom-style hats at the Emporio Armani show Aw! Mummy and baby fluffy bags from Moncler Brian Atwood fringe-tastic creations are not for shrinking violets Georgia May Jagger in a buttoned white mini at Versace The day begins with me organising tickets for today's shows Look who we've bumped into: ADR herself! A sweet gift of roses from shoe genius Gianvito Rossi inviting me to his presentation tomorrow Can we have this Gucci biker too please? It was all about the gold biker with fringing at Just Cavalli. Bowie-fabulous! Check out the murals at Fendi's show space It's the street style queen! Anna Dello Russo arrives at Prada in her brilliant coat Alexa Chung makes a super-chic enterance at Prada A scarlet shaggy dress hits the catwalk at Prada A trio of Prada coats for the grand finale Model Hanne Gaby brings her metallic magic to MFW Now this IS exciting: <mark>Jeremy Scott</mark>'s first catwalk show for Moschino - and chocolate! A <mark>Jeremy Scott</mark> x Moschino phone case for everyone at the show. Hurrah! We had a gorgeous dinner with our friends from Matches to celebrate Paula Cademartori and her amazing bags It was an early start at Heathrow this morning, I am SO not a light packer Anna Dello Russo, chocolates and chic shoes at Gucci - MFW has begun! What a welcome! Gucci opens Milan Fashion Week How gorgeous is this short, sweet and crystallised frock at Gucci? Gucci reminds us it's all about the pastel outwear Champers o'clock! Now we're fashion week ready. Hello Joan Smalls! We want your beanie I'm loving the embellished coats and socks with sandals at Alberta Ferretti Dresses were tinged with gold at Alberta Ferretti We're obsessed with these monochrome majors in Raoul's Autumn Winter 2014 collection There's nothing quite like a goodbye gift from Raoul Well this makes up for missing lunch #roomserviceheaven On the third day of our Milan Fashion Week experience, we found some new designers to love, took in the Emporio Armani show and hung out with Alexa Chung. Here are our highlights...1. FROW & TELL at the Emporio Armani show The Emporio Armani show is always a larger-than-life affair. Forget being on the second row, there are TEN rows of seats here, each one individually numbered like a super-chic cinema with a gigantic catwalk running down the middle. When we arrived at the venue, we spotted the likes of Laura Whitmore and even Calvin Harris (sans Rita, boo) hanging out backstage waiting for the man himself. We grabbed a chat with Laura about her first time at Milan Fashion Week...\"The collection was unbelievable and just so elegant and graceful,' she told us after the show .\" You know when you go to fashion shows and a lot of the things you may not wear yourself? Well, this time I was like, \"I want that, I want that!\". Armani is all about the female figure and the dress I'm wearing today makes me feel good so that's what fashion should be about .' We also met Chiara Ferragni of The Blonde Salad who looked resplendent in a Burberry ensemble. As a top-notch fashion blogger, we wanted to know her tip for our fashion week wardrobes. \"Try to wear something that is comfortable and although this isn't the most comfortable outfit, it makes me feel self confident .' 2. What We're Wearing The sun came out today here in Milan (hurrah!) so it was time to pack away our oversized coats and tights for something a little lighter. Here's <mark>Charlie Miller</mark>, Grazia's Executive Fashion and Beauty Director, wearing a black Cos sweater with a Victoria Beckham skirt topped off with Philosophy di Alberta Ferretti boots, Chanel aviators and a tasselled Gucci bag. Meanwhile, our Editor In Chief, Jane Bruton, is looking MFW-tastic in a Prada coat over a Jonathan Saunders sweater and MiH jeans. She's finished off the look with a Fendi bag and Sophia Webster shoes. The perfect combo of Brit meets Italiano chic! 3. Meeting the names-to-know As well as the high-profile catwalk shows the Fashion team enjoy, there's many smaller appointments on the agenda too. Today <mark>Charlie</mark> met Paula Cademartori, the lady behind a selection of luxury handbags designed in Milan, who talked us through the bags and clutches in multiple colours and leather combinations. We've also fallen in love with Mauro Grifoni and his super furry stripes and the Darlin' sweater is definitely for the 4. Anna Dello Russo's fash-tastic selfie ADR is always guaranteed to brighten up the streets of fashion week so it was no surprise to see she was the first lady to get her mitts on <mark>Jeremy Scott</mark>'s brilliantly bonkers debut for Moschino. Approximatley 12 hours after it had hit the catwalk, Anna was showcasing the Macdonalds-inspired sweater dress at the Emporio Armani show, complete with matching bag and iPhone case. She even found a vespa to strike a pose on. Well worth a selfie, we're sure you'll agree. Latest Tweet See Rihanna's latest bulk upload of holiday pictures: Please enter this information so that Bauer Media Group (the publisher of Grazia) can keep you up-to-date by email with fantastic offers and promotions. We promise that you can unsubscribe at any time if you don't find them interesting and you'll only get messages about things that we've chosen especially for you from ourselves and our network of great partners whose products and services we think you'll enjoy. women's fashion, beauty and news!", "articleID": "2014022304_00061853_W", "names": {"Jeremy Scott": ["Q14484510", "Q781789"]}}, {"date": "2014-02-23", "url": "http://www.newkerala.com/news/2014/fullnews-16476.html", "content": "Congress has been making false promises to people for the past 60 years: Modi in Assam Silchar, (Assam), Feb. 22: Bharatiya Janata Party (BJP) prime ministerial candidate Narendra Modi on Saturday criticized the Chief Minister Tarun Gogoi-led Congress Government in Assam for making false promises to the people, and added that he <mark>will</mark> help the people in fulfilling their dreams. \"This Congress Government in Assam cannot do any good to you all. I heard that when your Chief Minister heard that Modi is coming to his state, he started losing his sleep. I heard that he visited you two days ago. The projects that were not even started yet, he has again announced those projects,\" Modi said while addressing a rally here today. \"He (Gogoi) thought that someone <mark>will</mark> come and ask for an explanation. These Congress people have been making false promises for the past 60 years,\" he added. He urged people to vote for the BJP in the Lok Sabha elections, and said, \"I <mark>will</mark> standby you all and <mark>will</mark> help in fulfilling your dreams. You can trust me .\" Describing the whole Northeast region as \"lakshmi', Modi said,\" You find wealth in those places where there is \"lakshmi'. We want\" saraswati' as well as \"lakshmi'. Lakshmi needs a place to sit, and that's why it rests on a lotus. If there is no lotus, then\" lakshmi' <mark>will</mark> come and go after taking a round. \"He also took a jibe at Prime Minister <mark>Manmohan Singh</mark> saying,\" The country's PM is your MP. He hasn't travelled Assam like me, who is not even an MLA in your state. There is no district in Assam, where I haven't spent a night. \"Criticizing Gogoi for poor management during the floods that rocked Assam in 2012, Modi said,\" Your CM does not even know that Modi used to stay in Assam. Where was your CM when there were floods in 2012? Many people died in during those days. He was in USA and after that went to Japan, \"Drop guns and join mainstream, Home Ministry tells NE insurgents Congress has been making false promises to people for the past 60 years: Modi in Assam Disruptions created by Congress MPs in last session of Parliament disappointing: Sushma Swaraj PHE staff stages protest against Omar government, demands regularization of jobs Jennifer Aniston celebrates 45th b\" day sans fiance Justin Theroux <mark>Will Smith</mark> in talks for film adaptation of best-seller novel \"Brilliance' Kendall Jenner advised to quit\" KUWTK' show to focus on modeling career Cara Delevingne admits to \"being in love' with girlfriend <mark>Michelle Rodriguez</mark> Vehicles on NH 31A as traffic is disrupted due to agitation by Gorkha Janmukti Morcha A model walks the ramp during the India International Jewellery Week in Mumbai", "articleID": "2014022314_00025703_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"], "Michelle Rodriguez": ["Q184219", "Q3311458"], "Will Smith": ["Q16981006", "Q20727796", "Q24678701", "Q3568301", "Q3568303", "Q40096", "Q51226643", "Q56528891", "Q8003105", "Q8003106", "Q8003108"]}}, {"date": "2014-02-27", "url": "http://ca.sports.yahoo.com/blogs/mlb-big-league-stew/j-pierzynski-rod-took-over-most-hated-major-163544778--mlb.html", "content": "(Getty) Finally, some shade for A.J. Pierzynski, long-reputed to be the most-hated player in Major League Baseball: It's A-Rod's turn now. Even though he's sitting out the 2014 season because of his Biogenesis suspension, slugger <mark>Alex Rodriguez</mark> has eclipsed Pierzynski as the least-liked guy in MLB. At least that's Pierzynski's view, judging by an interview with columnist <mark>Dan Shaughnessy</mark> in the Boston Globe: According to a 2012 Men's Journal poll, Pierzynski is the Most Hated Player in Baseball. \"I just laugh at it,\" he said. \"I think it's cool. I've won it a bunch of years in a row. They just change the title around. They change a couple of words .\" True. In various other polls, Pierzynski has been cited as \"Player You Would Most Like To See Beaned\" and \"Meanest Player\" in baseball. \"I think I've won it before so it's just an easy answer,\" he added. \"But I think A-Rod took over for me this year .\" Is there a trophy that comes with the coveted \"most hated\" distinction - something that gets passed along from year to year like the Stanley Cup? \"No,\" said Pierzynski. \"You just get awkward questions by media people every day .\" Awkward, my Aunt Fannie. Pierzynski has loved the attention, he's sought it, he's cultivated his image to reflect it. He even plays into it on the baseball field. If he could bring a folding chair onto the field and whack somebody with it, like a pro wrestler, he would. He's a professional irritant, as <mark>Shaughnessy</mark> notes Tom Verducci having said. Pierzynski is an adult Dennis the Menace, but with a mean streak. And yet, it does ring true that A-Rod is more hated now. Heck, the some of his colleagues practically expressed how much they wanted to beat him up after <mark>Rodriguez</mark> sued the players union. Remember when <mark>Michael Barrett</mark> actually did punch Pierzynski in the face? He was living many an opponent's and fan's dream. Still, with A-Rod being sidelined for the season, Pierzynski still might be the most hated active player in the majors. He's still got that going for him, which is nice. Overall, <mark>Shaughnessy</mark>'s column is entertaining. He compares Pierzynski to Danny Ainge, which really is sort of perfect - even though everything doesn't have to do with Boston, you know? But it's also dead-on. He's the guy you least want to lose to. - - - - - - - <mark>David Brown</mark> edits Big League Stew on Yahoo Sports. Have a tip? Email him at rdbrown @ yahoo-inc.com and follow him on Twitter! Follow @ AnswerDave", "articleID": "2014022800_00086728_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "Dan Shaughnessy": ["Q27891420", "Q5214372"], "David Brown": ["Q1173842", "Q1173844", "Q16105866", "Q16196848", "Q18350546", "Q19596609", "Q21005198", "Q25412997", "Q26760987", "Q27830823", "Q3529051", "Q369175", "Q43910707", "Q5231797", "Q5231801", "Q5231803", "Q5231808", "Q5231809", "Q5231810", "Q5231811", "Q5231813", "Q5231814", "Q5231816", "Q5231817", "Q5231820", "Q5231821", "Q5231822", "Q5231996", "Q55854088", "Q55946414", "Q56253122", "Q56558031", "Q57850670", "Q58271225", "Q58481949"], "Michael Barrett": ["Q16028043", "Q17093945", "Q19876367", "Q55594034", "Q56762153", "Q6828461"]}}, {"date": "2014-02-27", "url": "http://www.tylerpaper.com/TP-News", "content": "Local / Second Upshur County capital murder defendant sentenced to life without parole in emotion-charged courtroom Second Upshur County capital murder defendant sentenced to life without parole in emotion-charged courtroom GILMER--Sarah Haslam became the second of three co-defendants in a capital murder case to be sentenced to life without parole Thursday after she pled guilty during an emotion-charged proceeding in which the victim's mother said she hoped the Longview woman would be attacked in prison and burn in hell. Ms. Haslam, 21, of Longview, showed no emotion as three of Ronnie Joe Gammage Jr.'s relatives denounced her in victim impact statements for the Dec. 5, 2012, murder of the 27-year-old disabled Longview man. Judge Lauren Parish of 115th District Court pronounced the sentence, approving a plea bargain between the prosecution and defense. Gammage was abducted, purportedly in Gregg County, before his throat was cut and his dead body was set afire, according to Upshur County District Attorney Billy Byrd. The remains were found Dec. 19, 2012, in a rural Upshur County pasture. Ms. Haslam's plea came 24 days after Byrd had filed intent to seek the death penalty against her. During Thursday's 29-minute proceeding, he said the defense (represented by Mt. Pleasant attorney Charles Mac Cobb and Longview attorney Lance Larison) had since approached him about a plea bargain, and that Gammage's family approved it. Another defendant in the case, Daniel Paul Jones, now 21, of Longview, also received a sentence of life without parole last Oct. 30 after pleading guilty. Byrd told the Tyler Paper on Thursday that he has no idea yet when the case of the third co-defendant, 22-year-old <mark>Andrew Conrad</mark> Norwine of Arlington, will go to court, but \"we'll start working on him today .\" Byrd said he could not yet discuss the motive for Gammage's killing since Norwine's case is still pending. The capital murder indictment against Ms. Haslam alleged she killed Gammage \"by cutting or slicing his throat or neck with a knife or sharp force object\" while kidnapping him or attempting to. Under Texas law, a person is guilty of capital murder if he or she kills someone while committing another felony, such as kidnapping or attempted kidnapping. Capital murder in Texas is punishable only by lethal injection, or life imprisonment without parole. In statements at Thursday's sentencing, Gammage's brother, Jeff Ramsey, and sister, Angela Ramsey Dees, joined the victim's mother, Frankie Gammage, in harshly denouncing Ms. Haslam as the handcuffed and shackled defendant sat with her attorneys several feet away at the defense table. Ms. Gammage, referring to a nearby large color photo of the victim displayed on an easel, told Ms. Haslam to \"Look at him. . That's who you arranged to kill...(but) you sit there and look at me with hatred .\" \"You have no remorse,\" said Ms. Gammage, who was emotional during her 3-minute statement. Accusing the defendant of being a \"demon,\" she added \"I want you to go straight to hell and burn and burn and burn .\" ", "articleID": "2014022803_00022579_W", "names": {"Andrew Conrad": ["Q23664152", "Q4756660"]}}, {"date": "2014-03-02", "url": "http://www.depauw.edu/news-media/latest-news/details/30808/", "content": "Contact Office of Media Relations 101 E. Seminary St. Greencastle, IN, 46135-0037 Prof. John Dittmer to Address Racial Reconciliation Conference in Mississippi Friday's appearance by <mark>Brad Stevens</mark>, head coach of the NBA's Boson Celtics, at the MIT Sloan Sports Analytics Conference, \"the top gathering of analytic-minded sports figures in the country,\" warrants a Boston Globe column in which Baxter Holmes calls upon several of the 1999 DePauw University graduates former professors and friends. Known as a \"numbers guy\" among some observers for his ability to use analytics to better understand his players, opponents and the game itself, <mark>Stevens</mark> tells the newspaper, \"I value the numbers, but I do think that culture is the most important thing .\" Later in the piece, Holmes writes, \"Gary Lemon, an economics professor at DePauw University, remembered that his former pupil excelled at data analysis and in finding correlations between variables that helped explain, for example, why the housing market fluctuated .\" <mark>Brad</mark> was always really good at that,' Lemon said. (at left: <mark>Stevens</mark> and Dr. Lemon as the coach \"Josh Burch, a close friend and fellow DePauw economics student, said that he and <mark>Stevens</mark> worked on a senior year project that involved studying the stock market. <mark>Stevens</mark> excelled at that, too .\" He's able to wrap his head around numbers and understand theory and principles of why things move and behave the way they do,' Burch said. Said Matt Broughton, who shared classes with <mark>Stevens</mark> at DePauw: \"He always computes in his head pretty quickly. He's a pretty quick, clear thinker .'\" Mary Dixon, professor of economics at DePauw, simply states, \"<mark>Brad</mark> is wicked smart .\" The newspaper reports, \"<mark>Stevens</mark> made the Dean's List at DePauw and was a Management Fellow in its honors economics program. He earned an internship at Eli Lilly, a global pharmaceutical giant based in Indianapolis that hired him upon graduating. There, <mark>Stevens</mark>'s analytical mind helped him shine .\" Globe's website. The 36-year-old <mark>Stevens</mark> led Butler University to a 166-49 record, including a 12-5 record in the NCAA Men's Basketball Championship and two consecutive trips to the national championship game (in 2010 and 2011). His 166 wins are the most for any NCAA Division I basketball coach over the first six years to start a career. He was named the head coach of the Boston Celtics in July, becoming the youngest current head coach in the NBA. My experience at DePauw was about as beneficial as any experience I've had, \"<mark>Brad Stevens</mark>", "articleID": "2014030213_00026750_W", "names": {"Brad Stevens": ["Q18164413", "Q4954288"]}}]