[{"date": "2014-03-06", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/ceraweek-epa-chief-tells-energy-210147702.html", "content": "By Ernest Scheyder HOUSTON, March 6 (Reuters) - Carbon regulations can be crafted to help offset climate change without \"shutting down business in its tracks,\" U.S. Environmental Protection Agency Administrator Gina McCarthy said at a major energy conference on Thursday. \"We don't have to choose between a healthy environment and a healthy economy,\" McCarthy, who has run the EPA for nearly a year, said about new rules she said would be proposed by June. McCarthy's speech to IHS CERAWeek, the largest meeting of energy executives in the world, was the first by an EPA administrator since the conference began 33 years ago. Her presence was seen as an acknowledgement by the Obama administration that the onshore U.S. energy boom over the past five years has been one of the economy's bright spots. \"We know conventional fuels like coal and natural gas are going to continue to play a critical role in a diverse U.S. energy mix,\" McCarthy said. The Houston visit came about a week after McCarthy toured North Dakota, trying to convince the state's coal, oil and ethanol producers that her agency was not trying to burden their industries with onerous regulations. The fuels, McCarthy said in North Dakota, should be part of an \"all-of-the-above strategy\" that runs from solar to coal. She reiterated that theme to CERAWeek's more than 2,000 attendees. It was a marked shift from McCarthy's predecessor, <mark>Lisa Jackson</mark>, viewed warily by energy companies that perceived her as indifferent to how regulations affected their operations. \"Administrator McCarthy understands the EPA has to protect the environment while doing all it can to protect jobs,\" said Larry Nettles, an environmental lawyer at Vinson & Elkins LLP, a prominent law firm in the energy sector. REGULATION AND INNOVATION Energy and environmental issues are \"two sides of the same coin\" that can be accomplished in tandem, McCarthy said. For instance, she credited new fuel efficiency standards for automobiles with encouraging automakers to build cars that get more miles per gallon, boosting appeal to consumers. \"Go figure: an environmental rule helped fuel a resurgent American auto industry,\" McCarthy said. Energy executives said they were encouraged by the EPA's new tone but are eager to see it reflected in concrete regulation. Utilities are awaiting final rules on new and existing coal plants. Some say rules that are too restrictive could end coal-powered electricity generation in the United States. \"In order not to impact the economy or the reliability of the grid, we need to ensure this is done in a responsible way,\" Nick Akins, CEO of American Electric Power, said at CERAWeek. McCarthy said she will work to recognize each state's unique energy and regulatory needs. Texas, for instance, has the most oil refineries, and may have different concerns than Maine, which produces a large amount of pellet fuel for wood stoves. McCarthy said her first priority is stopping climate change, which she said would cost U.S. businesses more in total than the expense of complying with regulations. \"The real, scary cost we need to worry about is the cost of climate inaction,\" she said. Lynn Good, chief executive officer of Duke Energy, the largest American utility, said she is \"encouraged\" by McCarthy's new approach but has already decided building new coal plants are not worth the regulatory risk. \"I don't see new coal in the mix for Duke,\" Lynn said. She said she believes opponents of EPA regulations have often been wrong before and may be again when they cry \"the sky is falling\" when new rules are enacted. \"We've heard this tired argument again and again before,\" she said. \"And every single time, it's fallen flat on its face .\" Nature & Environment Politics & Government EPA", "articleID": "2014030705_00086002_W", "names": {"Lisa Jackson": ["Q16218554", "Q27469861", "Q445734", "Q476660", "Q6557964", "Q8927305"]}}, {"date": "2014-03-12", "url": "http://www.gmanetwork.com/news/story/352238/scitech/science/australia-hatches-first-ivf-shark", "content": "AUSTRALIA, Melbourne: This picture released on March 12, 2014, by the SEA LIFE Melbourne Aquarium shows the first shark pup born in Australia via Artificial Insemination at SEA LIFE Melbourne Aquarium. Australia has successfully hatched its first shark born via artificial insemination with hopes that the development can ultimately be used to help breed threatened species, an aquarium said. AFP PHOTO / HO / SEA LIFE Melbourne Aquarium MELBOURNE - Australia has successfully hatched its first shark born via artificial insemination with hopes that the development can ultimately be used to help breed threatened species, an aquarium said Wednesday. Sea Life Melbourne Aquarium said the brown banded bamboo shark pup was born on March 3, ending a process which began in September when aquarists collected a semen sample from a shark in Mooloolaba in northeastern Australia. This was flown to the southern city of Melbourne and inseminated into the mother the same day-making the pup the first shark to be born globally via a live semen sample transported from one facility to another, Sea Life said. Melbourne Aquarium vet <mark>Rob Jones</mark> said the birth of the shark-which is expected to grow from its initial length of 16 centimeters (6.3 inches) to an adult size of 1.2 to 1.5 meters-was a milestone in using assisted reproductive technologies. \"This is a big leap,\" he told AFP. The hatching is part of a nine-year project into understanding the reproductive behaviors of sharks, animals which are common in Australia but are little understood. The team hope their research will help with plans to manage threatened species in the wild, in particular the critically endangered grey nurse shark. The egg, one of several laid by the shark in November but the only viable one, was monitored weekly during its incubation period of 112 days. \"With each insemination attempt, we continue to learn about the reproductive behaviours of Australian shark species,\" said Melbourne Aquarium research consultant <mark>Jon Daly</mark>. \"Hopefully we can use this technology as a basis for breeding grey nurse sharks in captivity and, in years to come, boost the species' dwindling numbers in the wild .\" Grey nurse sharks are considered critically endangered, with estimates that there could be as few as 1,500 left on Australia's east coast. Sharks are a known danger for those swimming, diving and surfing around the country and are currently subject to a controversial cull in Western Australia state after a series of fatal attacks in recent years. Unang Balita: Close encounter sa mga pating, pwede nang gawin sa isang amusement park sa Maynila Saksi: Basketball team mula sa China, nasa Pilipinas para sa ilang friendly game Kape at Balita: Mangingisda, sugatan matapos atakihin ng mga pating; kasamang pumalaot, patay GMA News Online All Rights Reserved 2014", "articleID": "2014031215_00085634_W", "names": {"Jon Daly": ["Q15634765", "Q3433083"], "Rob Jones": ["Q1179039", "Q27443340", "Q374688", "Q47140919", "Q59549874", "Q7340256", "Q9310669"]}}, {"date": "2014-03-13", "url": "http://www.gpb.org/news/2014/03/13/why-for-profit-prisons-house-more-inmates-of-color", "content": "Why For-Profit Prisons House More Inmates Of Color An inmate walks through the yard at the North Central Correctional Institution in Marion, Ohio, which recently switched to private management. new study by an UC-Berkeley graduate student has surprised a number of experts in the criminology field. Its main finding: private prisons are packed with young people of color. The concept of racial disparities behind bars is not exactly a new one. Study after report after working group has found a version of the same conclusion. The Sentencing Project estimates one in three black men will spend time behind bars during their lifetime, compared to one in six Latino men and one in seventeen white men. These reports and thousands of others have the cumulative effect of portraying a criminal justice system that disproportionately incarcerates black Americans and people of color in general. Sociology Ph. D student Christopher Petrella's finding in \"The Color of Corporate Corrections,\" however, tackles a different beast. Beyond the historical over-representation of people of color in county jails and federal and state prisons, Petrella found, people of color \"are further overrepresented in private prisons contracted by departments of correction in Arizona, California, and Texas .\" This would mean that the racial disparities in private prisons housing state inmates are even greater than in publicly-run prisons. His paper sets out to explain why a question that starts with race, but takes him down a surprising path. Age, race and money First, a bit of background. Private prisons house 128,195 inmates on behalf of the federal government and state governments (or at least they did as of 2010). There's a continual debate among legislators and administrators as to which is more cost effective: running a government-operated prison, with its government workers (and unions); or hiring a private company (like GEO or Corrections Corporation of America) to house your prisoners for you. States like California, Arizona, and Texas use a combination of both. In the nine states Petrella examined, private facilities housed higher percentages of people of color than public facilities did. Looking back at the contracts the private companies signed with the states, Petrella figured out the reason behind the racial disparity: private prisons deliberately exclude people with high medical care costs from their contracts. Younger, healthier inmates, he found who've come into the system since the War on Drugs went into effect are disproportionately people of color. Older inmates, who generally come with a slew of health problems, skew more white. <mark>Steve Owens</mark>, Senior Director of Public Affairs for Corrections Corporation of America, one of the largest private prison companies in the nation, calls the study \"deeply flawed .\" In an email, <mark>Owens</mark> says, \"CCA's government partners determine which inmates are sent to our facilities; our company has no role in their selection .\" Furthermore, he says, \"the contracts we have with our government partners are mutually agreed upon, and as the customer, our government partners have significant leverage regarding provisions .\" It's up to the contracting agency, he says, to decide how it wants to distribute inmates and manage healthcare costs. <mark>Owens</mark> does not, however, dispute Petrella's numbers. Gloria Browne-Marshall, an associate professor of Constitutional Law at John Jay College of Criminal Justice and former civil rights attorney, says \"it's a very interesting study .\" \"What I take away from it is how prisoners are looked at as commodities,\" she says. \"It's all about how the private prisons can make the most money .\" Petrella says he used data compiled by state correctional departments, which are divided by census-designated categories, and included African-Americans, Asian-Americans and Pacific Islanders, non-white Hispanics and Latinos, and essentially anyone except those defined by the census as white. \"I know these categories are fungible, but this is the data we have to work with,\" Petrella says. Browne-Marshall points out that Petrella's findings don't necessarily point to a racial motivation on behalf of private prison companies, and Petrella agrees. \"Profit is the clear motivation,\" he says. The racial component is more incidental. However, he says, \"the study shows that policies that omit race continue to have negative impacts .\" He says there's a larger dialogue to be had about what contemporary racial discrimination actually looks like. Barry Krisberg, director of the Chief Justice Earl Warren Institute at UC-Berkeley, says the findings surprised him. \"I had assumed private prisons were taking a lot of low-risk inmates,\" he says. \"That if you went to a private prison, you'd find a lot of old, Anglo prisoners. That's not the case .\" Prison conditions This raises questions about prison conditions for different kinds of prisoners. \"The rate of violence is higher at private prisons and recidivism is either worse or the same than in public prisons,\" says Alex Friedmann, managing editor of Prison Legal News and the associate director of the Human Rights Defense Center, a group that opposes private prisons. Friedmann says that part of the trouble is attributable to lower-paid, lesser-trained staff used in private prisons. But some of it, he adds, may be due to this higher-risk, younger population in private prisons. So, Browne-Marshall asks, what are private prisons doing for their age-specific populations? \"Public prisons are devoting a lot of resources to the age-specific needs of their prisoners,\" she says, such as building medical facilities, bringing in highly paid medical staff, and providing expensive mental health care services. \"What about the specific needs of the private prison population?\" Younger, higher-risk private prisoners need different kinds of services especially since they're likely to get out of prison, back into society. And historically, younger prisoners are more likely to re-offend, which Browne-Marshall suggests addressing with education, drug counseling, anger management, and other social services. The trouble: while courts have intervened to require prisons to have good medical and mental health care as constitutional necessities things that benefit older and sicker prisoners programs that mainly benefit younger prisoners aren't usually required. (Another reason why they're cheaper to house .) \"How do we get corporations to do what the incarcerated person needs when the government's not dictating it?\" Browne-Marshall says. That she says, is the next question for study. <mark>Owens</mark> says CCA offers \"safe, secure housing and quality rehabilitation and re-entry programming at a cost savings to taxpayers. Our programming includes education, vocational, faith-based and substance abuse treatment opportunities .\" Each year, he says, CCA inmates acquire \"more than 3,000\" GEDs. A footnote In compiling his data, Petrelle deliberately excludes private prisons with federal contracts from the study. He does so because a large portion of federal prisoners in private facilities are there as immigration detainees, not sentenced criminals. Were he to include federally contracted prisons, the disparities would surely be greater. Federally contracted facilities also come with their own baggage and civil rights questions. Federal prisoners in public facilities, as well as state prisoners in private and public facilities, have the right to bring lawsuits based on alleged civil rights violations. This means state inmates in California could sue the state prison system for providing inadequate health care. Arizona inmates in a private facility could do the same against the private corporation that owns their prison and the State of Arizona. However, federal prisoners in private prisons cannot bring such lawsuits, according to a recent U.S. Supreme Court ruling. A prisoner of this status could sue for actual damages, but not bring a civil rights suit against a private prison the kind of suit that usually forces major changes in how prisons operate in the public sphere. \"We've gotten to the point where courts intervene in public prisons, but only under extraordinary circumstances,\" Krisberg says. For federal prisoners in private facilities, there's even less legal recourse, he says.", "articleID": "2014031318_00080681_W", "names": {"Steve Owens": ["Q16187251", "Q16196201", "Q7613529", "Q7613530"]}}, {"date": "2014-03-14", "url": "http://thenewcivilrightsmovement.com/1-police-accused-of-pepper-spraying-handcuffing-and-beating-to-death-unarmed-non-violent-man/news/2014/03/14/84362", "content": "One month ago today was Valentine's Day. In Moore, Oklahoma, the <mark>Rodriguez</mark> family, <mark>Luis</mark>, 44, his wife Nair, and their 19-year old daughter went to the movies, but after a family fight, they left the movie and headed for the family car in the parking lot. What happened at that point is unclear, but what seems certain is that the mother and daughter had a minor altercation, and three police officers aided by two Oklahoma state game wardens moonlighting as security guards, pepper-sprayed <mark>Luis Rodriguez</mark>, took him down to the ground, handcuffed him, and beat him. \"Papa! Is he OK? He doesn't move!,\" Nair <mark>Rodriguez</mark> in the video she recorded can be heard saying. \"He doesn't move! You killed him! You killed him! You killed my husband!\" By the time the assault was over, <mark>Rodriguez</mark>, bloody and battered, was not moving. Police say he died after being taken to the hospital, although his wife insisted he was dead at the scene. Why were the cops so intent on beating <mark>Rodriguez</mark>, possibly to death? \"He refused to give his ID,\" one of the officers said, according to CNN. UPI reports that \"Moore Police Chief Jerry Stillings has said the use of force was appropriate .\" \"We're obligated to detain and investigate,\" Stillings said at a press conference. \"If someone does not cooperate with that investigation, we have to do what we have to do to get that information .\" The three police officers have been suspended, but with pay. NewsOK notes that \"the family's attorney, Michael Brooks-Jimenez, made public the six-minute video shot by Nair <mark>Rodriguez</mark>. In it, <mark>Luis Rodriguez</mark> doesn't appear to struggle or move while the officers detain him .\" Nair <mark>Rodriguez</mark> can be heard asking her husband if he's OK while officers attempt to calm her down and repeatedly ask for her and her daughter's ID. Officers appear to prop him up into a seated position partway through the video. \"I'm recording because this is too much,\" Nair <mark>Rodriguez</mark> tells them. The results of the autopsy, one month later, have not been released. Watch Nair <mark>Rodriguez</mark>'s video, but be warned, it is heartbreaking and extremely disturbing: More Digg Print Share on Tumblr Email Pin It Tagged as: excessive force, killed, <mark>Luis Rodriguez</mark>, Moore, Oklahoma, police brutality Friends: We invite you to sign up for our new mailing list, and subscribe to The New Civil Rights Movement via email or RSS. Also, please like us on Facebook, and follow us on Twitter!", "articleID": "2014031421_00026151_W", "names": {"Luis Rodriguez": ["Q1232924", "Q3266810", "Q3840413", "Q55092359", "Q6701065"]}}, {"date": "2014-03-14", "url": "http://thegazette.com/2014/03/14/iowa-gop-senate-hopefuls-not-committed-to-mcconnell-leadership/", "content": "It's not only in Kentucky where Mitch McConnell is facing a challenge. The U.S. Senate minority leader, who has to get past a tea party challenger to get to the general election where the Democratic opponent is gaining traction, isn't getting much love from Iowa Republicans who hope to help the GOP to win back control of the Senate in this fall's mid-term elections. Sam Clovis, a retired Air Force colonel and college professor, doesn't mince words when asked whether he'll support McConnell, a five-term senator who has been minority leader since 2007. \"I think we need a change in leadership in the United States Senate,\" he said at a Republican forum in Ida Grove back in November. \"I'm going to go onto the floor of the Senate and make sure that vote goes to a leader other than the one we have right now. That's the first thing .\" Sen. Mitch McConnell of Kentucky If that wasn't clear enough, Clovis told a tea party gathering in December that \"If Mitch McConnell still wants to be the leader, he's not going to have my vote .\" Former U.S. Attorney Matt Whitaker has been a bit more nuanced. When asked about the Affordable Care Act, aka Obamacare, during a Tea Party Express interview, Whitaker said he favors repeal. \"But who the leader is in the Senate is going to make a big difference,\" Whitaker said, \"and if it's someone like Sen. McConnell from Kentucky I'm not sure we're going to have the same opportunities to advance a conservative agenda including repealing Obamacare that we would with a true conservative leader .\" While it might seem rash to be disrespecting the man who could have a say in which races the GOP senatorial campaign committee commits resources and who will make committee assignments after the election, neither Whitaker nor Clovis see it that way. \"Matt has never met Mitch McConnell and hasn't committed to voting for anyone,\" Whitaker spokesman Jason Klindt said. \"He wants to meet and talk with any candidate for leadership. He will be looking for a conservative leader who can get things done .\" \"I don't know that there's any danger\" in Clovis distancing himself from McConnell said campaign manager Chuck Laudner. \"Mitch McConnell doesn't have a vote in Iowa,\" he said. \"The base of this party, by and large, wants change. What's going on inside the party is not working. So you can't say\" I'll vote for McConnell' because that says more of the same. \"They may be right that there's little danger in being critical of the Senate GOP caucus leader, said Tim Hagle, a University of Iowa associate professor of political science. McConnell, said Hagle, who worked in the Bush administration, has taken a lot of heat from the more tea party-oriented candidates over a variety of actions he has taken .\" I don't know if risky is the right word, but it's probably not the wisest choice of action, \"Hagle said .\" Of course, \"he added,\" you don't have to worry about bad committee assignments if you don't get yourself elected and you can't get elected if you don't get the nomination. \"Clovis and Whitaker may see their anti-McConnell comments as increasing their chances of getting then nomination .\" It's not just political posturing if they see that McConnell has been a problem advancing the agenda they are running on, \"Hagle said. That's the strategy, according to Laudner, who said Clovis repudiation of McConnell is an applause line .\" People instinctively get it - what kind of a Republican, conservative you are, \"he said. It's one of the top three questions Clovis gets asked, Laudner said. The answer says everything about the candidate .\" It tells the Republican voter what kind of senator you will be, whether you are someone they can trust to go in there and do the right thing, \"Laudner said .\" You can't dodge it. If you dodge this one, the rest is a dodge. \"Clovis leans toward Texas Sen. Ted Cruz, who he will campaign with later this month, Kentucky Sen. Rand Paul or Utah Sen. <mark>Mike Lee</mark>. Whitaker hasn't committed to supporting anyone for the top GOP post, Klindt said .\" He wants to meet and talk with any candidate for leadership, \"Klindt said .\" He will be looking for a conservative leader who can get things done. \"GOP candidates <mark>Mark Jacobs</mark> and Scott Schaben say it's too early to make a decision whether to support McConnell .\" <mark>Mark</mark> is focused on his June primary and then winning the November general election, as is Sen. McConnell, \"said <mark>Jacobs</mark> spokeswoman Alissa Ohl said .\" Senate Republican leadership is a question for after the elections. \"While he didn't commit to voting for McConnell, <mark>Jacobs</mark> did show some respect .\" <mark>Mark</mark> has great respect for Sen. McConnell leading the united Republican charge on repealing Obamacare and <mark>Harry Reid</mark>'s job-killing agenda, \"Ohl added. Schaben says he's focused on his own race .\" If (McConnell) is still there when I arrive in D.C., I'll address it at that time, \"Schaben said .\" I hope this doesn't sound coy; just being honest. \"", "articleID": "2014031500_00003233_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Mark Jacobs": ["Q6768224", "Q6768225", "Q6768226"], "Mike Lee": ["Q21064126", "Q30122331", "Q55622025", "Q627098", "Q6847648", "Q6847650", "Q6847651", "Q6847652", "Q6847653"]}}, {"date": "2014-03-14", "url": "http://sports.yahoo.com/news/john-daly-shoots-12-way-90-183418203--spt.html", "content": "PALM HARBOR, Fla. (AP) - <mark>John Daly</mark> has gone 17 straight years on the PGA Tour with at least one round in the 80s. He didn't even manage that Friday in the Valspar Championship. He missed a 4-foot putt on the last hole at Innisbrook and shot a career-high 90. \"I didn't give up,\" <mark>Daly</mark> said. \"I tried .\" He used up 12 of those shots on the 16th hole - tied for his fourth-highest score on any one hole - but was more concerned with the putting yips. <mark>Daly</mark> said the yips began last Sunday in Puerto Rico and reached a low point at Innisbrook. He took 70 putts over two days, including a four-putt on the second hole of Friday's round. \"You're going to have big scores on holes. That's just the way golf is,\" <mark>Daly</mark> said. \"But when you've got the yips, that's no fun .\" For <mark>Daly</mark>, there was nothing fun about Friday, especially the 16th hole. He started with a tee shot into the water. He had about 270 yards to cover the lake after his penalty drop and failed twice. From there, he hit a smother-hook well to the left of the water, only to hit what he described as a shank with his 7-iron well right of the green. He took three chips to reach the green and one-putted for a 12. <mark>Daly</mark>'s highest score ever was an 18 on the sixth hole of the 1998 Bay Hill Invitational. This wasn't anything like that. For one thing, he hit only three balls in the water. \"I got two good drops and hit a heel-cut 3-wood into the water,\" he said. \"Then I shanked a 7-iron, chili-dipped a chip, it was buried, didn't get that out ....It was a good 12. I got up-and-down for 12 .\" It was the 16th time on the PGA Tour that <mark>Daly</mark> has made at least a 10 on a hole. Friday was the one-year anniversary of his most recent when he took a 10 on the third hole after twice hitting a tree while trying to get out of a forest. <mark>Daly</mark> said he needed to find help with the yips after what already has been a bad week. The 47-year-old with two majors said he was treated for plantar fasciitis in his left heel on Wednesday, and he was walking with a slight limp toward the parking lot. \"I'm falling apart,\" he said. The putting is what unnerved him. <mark>Daly</mark> had some of the softest hands in golf when he won the 1991 PGA Championship and the 1995 British Open at St. Andrews. But his putting stroke, even more than elbow surgery last year, has hurt him. His last good chance to win a tournament was the 2005 American Express Championship at Harding Park, where he three-putted from 15 feet in a playoff against Tiger Woods. \"It's my head, my hands, and I can't stop it,\" <mark>Daly</mark> said. \"On a short stroke, I get quick. On my normal, long stroke, I come up. Even my legs are moving. I should just go put myself in a straitjacket and try that. I've always been a quick putter, so I should never get the yips. But I got 'em. I got 'em bad. <mark>Daly</mark>, who has been playing on sponsor exemptions for the last eight years, was not sure where he would play next. He said he was supposed to play in Indonesia in a few weeks for the start of the OneAsia circuit, but the missing Malaysian Airlines flight shook him up .\" I was going to Indonesia, but since they can't find a 777, \"he said, shaking his head as his voice trailed off .\" I ain't about to fly on a plane right now. It's a sick feeling. I'd have to go right there. I canceled it. I said, \"No way I'm getting on a plane to fly overseas .' A 777? One of the nicest planes in existence?\" It's scary, \"he said .\" There are more important things in life than a round of golf. I'm scared to fly. Our world, it's scary what's going on. (Buildings) blowing up in New York. A guy running over people in Austin, Texas? What the hell is going on? It's frightening. \"In his eyes, a 90 didn't seem so bad. Sports & Recreation Golf <mark>John Daly</mark> PGA Tour", "articleID": "2014031503_00006830_W", "names": {"John Daly": ["Q203831", "Q25190176", "Q382487", "Q389438", "Q50557115", "Q6228468", "Q6228481"]}}, {"date": "2014-03-18", "url": "http://www.supersport.com/rugby/article.aspx?Id=2363534", "content": "Please enter your email address / username. Please enter a valid email address / username. Please enter a valid email address. Please enter a valid email address. Tweet With 92 Vodacom Super Rugby caps and nearly 850 points behind his name, the return of <mark>Peter Grant</mark> has been a big plus for the DHL Stormers on their tour of Australasia. The 29-year-old flew straight from Japan earlier this month to join up with his teammates for the start of their tour and he has played off the bench twice this season - against the Crusaders and the Chiefs. While his second-half cameos were not able to help the Stormers to victories over the past fortnight, the man himself is looking forward to more game time against the Brumbies in Brisbane this Saturday (kick-off 10h40 SA time) and the next weekend against the Reds. \"I was buzzing when I came off the field against the Chiefs,\" <mark>Grant</mark> told www.iamastormer.com from his team's base in Coogee on Tuesday, \"it was great wearing the Stormers jersey again after a year away .\" Just to be part of this team again...it's always a great honour to be involved with the Stormers and I'm really looking forward to more game time in the coming weeks. \"His on-field abilities aside, as a no-nonsense defender and accurate goalkicker, <mark>Grant</mark> knows that he also has a big role to play off the field as a long-time and experienced member of this squad .\" The young guys seem to have some respect for me, \"said <mark>Grant</mark>, half-chuckling at the notion .\" But I don't think it's about me arriving here and just barking orders. It's about backing up someone like Jean de Villiers, who does a lot of the talking, and also (backline coach) Robbie Fleck who I have a good relationship with. \"In the past we had myself, Jean, Bryan Habana, Jaque Fourie and Dewaldt Duvenage all being able to contribute as experienced players - now it's myself, Jean and Gio Aplon who the younger guys are leaning on and we have a responsibility to help them where we can .\" Last weekend, against the Chiefs, I was actually a bit too frantic at times - probably because I was overly excited to be out there playing again! It's something I admitted when speaking to (coach) Allister Coetzee earlier this week. We must remain calm and it's up to us more experienced players to lead by example in that department. \"I think I will find my voice more as the season progresses, so for me game time will be key. I didn't play a lot in this recent stint in Japan, between my early-season injuries and (later on) with the two-foreigners-per-team rule, but I'm hungry to play more and to contribute on any level for the Stormers .\" <mark>Grant</mark> made his Super Rugby debut back in 2006 - against the (then) Cats - and he toured Australasia for the first time as a Stormers player later that season. The team won two from four on that tour (two wins in Australia and two defeats in New Zealand) and the experienced Stormers No 10 sees a lot of similarities between then and now. \"My first two tours as a Super Rugby player, 2006 and 2007, were tough for us as a team but I remember that the older players around us simply kept telling us younger guys to remain calm on the field, no matter what .\" We still have two games left on this tour and our aim is to pick up two wins, which would mean we could return home from a tough tour with another nine/ten points to go with our home win over the Hurricanes, which would be a huge boost ahead of seven home games between then and July. Great moments in Currie Cup history Steeped in history and tradition, the Currie Cup dates back to 1891 and is one of the oldest rugby competitions in the world. Rugby in our blood Read about Oscar Pistorius' first love and Joost van der Westhuizen's one love. Plus, true stories from Smit, Skinstad, Kallis, Holomisa, Schuster & more. More expert analysis and opinion from Sport24 Why the Sharks are razor sharp While New Zealand franchises have traditionally proved Super Rugby powerhouses - most recently...No need to get carried away Sometimes as a commentator your instincts take over, and you make a call based on what you think is...The rocket-launching option The strong performance that <mark>Frans Steyn</mark> turned in at flyhalf for the Sharks against the Lions at ...", "articleID": "2014031900_00021548_W", "names": {"Frans Steyn": ["Q181263", "Q3752066"]}}]