[{"articleID": "2015012216_00016592_W", "names": {"Martin Lewis": ["Q16151827", "Q3850102", "Q6775999", "Q6776002", "Q6776003"], "Mark Lewis": ["Q14950646", "Q16189365", "Q16218259", "Q23925347", "Q6768582", "Q6768584", "Q6768585", "Q6768586", "Q6768587", "Q6768589", "Q6768591", "Q6768593", "Q6768594"]}, "date": "2015-01-22", "url": "http://www.thejc.com/news/uk-news/128731/money-mensch-martin-lewis-victim-commuter-rage", "content": "<mark>Martin Lewis</mark> Journalist <mark>Martin Lewis</mark> was a victim of \"commuter outrage\" on his way to work on Wednesday, he has revealed on his Facebook page. Mr <mark>Lewis</mark>, who writes a money-saving tips Money Mensch column in the JC, was attacked by the entrance of Waterloo station. He wrote: \"Feeling slightly shaken having just been a victim of commuter rage .\" A 50ish, grey haired, heavy set, white man, professionally dressed, carrying a bag, shoved me hard out of the way from the back. \"I said (not shouted) quite simply -\" the word is excuse me'. \"He turned around gripped me at the neck, by my coat, shoved me hard Mr <mark>Lewis</mark> later complained that the incident was blown out of proportion, after it was picked up by the national media. He wrote on his Facebook page:\" That'll teach me to vent on here as if it were a private page. Talk about turning a molehill into a mountain. \"<mark>Mark Lewis</mark>: Hacking's like speeding. You know it's wrong, but you do it <mark>Mark Lewis</mark>: Hacking's like speeding. You know it's wrong, but you do it"}, {"articleID": "2019050318_00074075_W", "names": {"Angela Davis": ["Q160456", "Q16979885"], "Dominique Jones": ["Q427428", "Q5291144"], "Eric Paul": ["Q5387251", "Q5387252"]}, "date": "2019-05-03", "url": "https://www.star-telegram.com/news/nation-world/national/article229643264.html#storylink=rss", "content": "Can hairstyle lead to discrimination? Listen as Raynita Nebeker and Dennis Horn relate their experiences of discrimination just because of hair style. By Up Next × SHARE COPY LINK Listen as Raynita Nebeker and Dennis Horn relate their experiences of discrimination just because of hair style. By Dennis Horn has endured numerous uncomfortable moments in the workplace, based on the natural hairstyles he's sported in the past. A Fresno resident, Horn said the dreadlocks, cornrows, braids and afros he's worn over the years often spurred unwanted attention. His hair sometimes became a topic of discussion by his peers and supervisors in his corporate job. On top of that were the numerous questions by his co-workers: Is it natural? What did you do to it? Is it extensions? Can you wash it? While the 33 - year-old said he welcomed questions of genuine curiosity, those inquires sometimes had a hint of disdain--whether it was racially motivated or just plain ignorance. \"I remember once, when I actually cut my hair, a comment was made that I was\" ready to be mature' and \"go places,\" ' he recalled. \"That was never my intention in cutting my hair .\" Horn said he knows he's not alone in those feelings. A bill is being discussed in Sacramento that would ban schools and workplaces from discriminating against people based on their natural hairstyles. Proposed by Sen. Holly J. Mitchell, D-Los Angeles, Senate Bill 188 is being referred to as the CROWN Act (Create a Respectful and Open Workplace for Natural Hair). Fresno resident Dennis Horn, shown with his dreadlocks hair style. Courtesy Dennis Horn Hair discrimination is a problem Mitchell and SB 188's supporters said is commonplace. For example, in December, the story of a 16-year-old New Jersey high school varsity wrestler made headlines after he was asked by a referee to cut his dreadlocks on the spot or forfeit his match. There was outrage after the story went viral. A toddler in Fresno was sent home on his first day of school last year because he had a fade haircut with a design on his scalp. The teacher allegedly told his parents the child couldn't return to class until his hair was \"fixed\" because it was \"distracting,\" said Raynita Nebeker, a local special education teacher. In 2016, prior to the Clovis Unified School District revising its controversial dress code, 17-year-old William Pleasant's hair was initially the reasoning behind the teen not being able to enroll at Buchanan High School for his senior year. Boys couldn't have their hair longer than their shirt collar. More recently in 2018, a 14-year-old at Tenaya Middle School was pulled out of class and sent to the vice principal's office due to his hair. The student had lines shaved in a design on his hair, and was told to get it \"fixed .\" The American Civil Liberties Union of Northern California has been involved in a few local hair discrimination cases. \"It's unfortunate that in 2019, black people are being punished for their hair, and that it is so widespread,\" said ACLU staff attorney Abre' Conner, who has helped intervene in some of the local cases. Conner said there are already protections within the schools, but explicitly adding language about \"protective hairstyles\" will help close a chapter in California of discipline that has been \"rooted in a legacy of racism and gender bias .\" State Sen. Holly Mitchell (D-Los Angeles) speaks to the media in Sacramento, Calif. on Jan. 24, 2017. (Gary Coronado/Los Angeles Times/TNS) Gary Coronado TNS Mitchell told The Bee that through the years, there have been court rulings favoring employers against employees who felt they were being discriminated against based on their ethnic hair. She called that system \"racist, antiquated or ill-informed,\" saying there \"should be protections from discrimination in the workplaces and schools .\" Additionally, SB 188 points out there historically has been a double standard in the workplace, in terms of how black employees are expected to wear their hair, compared to their white colleagues. The bill states the idea of \"professionalism\" in the American workplace has typically been tied to European looks, often forcing non-whites to conform to a Euro-centric aesthetic. Consequently, many black women for decades felt they had to chemically process or straighten their hair in order to be accepted in a predominantly white workplace. Meanwhile, black men have often cut their hair short. \"(Hair texture) does not dictate my ability to do my job well,\" Mitchell said. \"I have been shocked by the outpouring of support from people who have told me about their horror stories for wearing natural hair in the workplace .\" If the bill passes both houses and gets signed by Gov. Gavin Newsom, Mitchell said it would put \"employers and schools on notice .\" Horn said he did eventually cut his hair in 2016, although, it wasn't in response to any negative comments or discrimination. \"As of recently, I've never had to deal with anything like that,\" he said of the discomfort and comments he faced prior to cutting his hair. Nebeker said that in many schools, the type of hairstyles allowed often go along with student dress codes. \"They have certain restrictions on what they can and can't do, and their hair is one of the big ones that they have restrictions on, as well,\" she said. \"So, I know, it's (the discrimination) also in the schools .\" She said SB 188 would make an impact, if it becomes law. \"I feel that a lot of students express themselves through their hair...because that's where you are finding your identity, and your real self and being comfortable with yourself .\" A history with deep roots Beyond its aesthetic appeal, black hair has a history and significance that many Americans are unaware of. Many black hairstyles--like various kinds of braids--have been worn on the African continent for thousands of years. During the late 1960s and 1970s, human rights activists like <mark>Angela Davis</mark> wore afros as a political symbol of black pride. Many black Americans have recently adopted natural hairstyles as an alternative to harsh chemicals which can cause permanent damage. <mark>Dominique Jones</mark> has faced discrimination for her hairstyle. Photographed Friday, April 26, 2019 in Fresno. <mark>ERIC PAUL</mark> ZAMORA ezamora @ fresnobee.com Devoya Mayo and <mark>Dominique Jones</mark> of Fresno have held workshops locally about black hair, focusing in particular on headwraps, teaching participants how to wrap their hair. Mayo and <mark>Jones</mark> said that every time a member in a black household is considering a new hairstyle, there's much more to consider aside from the hairdo--including the societal implications. Mayo said she supports the proposed legislation because she hopes there will eventually become a time when those kind of discussions or concerns are no longer necessary. \"I have always worked in the nonprofit industry, no one has advertently or blatantly (been) racist about hairstyles, but there have been spaces that I've been in where, I think all of us have been in, where I know for a fact we're uncomfortable because of our hair, and it shouldn't be that way,\" Mayo said. <mark>Jones</mark> said the workshops were \"to help black women embrace our culture and it helped us connect to our roots, and just express ourselves in a way that is not normalized in our community .\" SB 188 has cleared the Senate, and is now in the Assembly. Related stories from Fort Worth Star Telegram education Does Fresno Unified's 15-year-old dress code need a fix? The superintendent thinks so March 19, 2018 05:00 PM education In face of criticism, Clovis Unified adopts gender-neutral dress code April 06, 2016 10:25 PM education A Fresno honor student got a popular haircut, but school officials didn't like it March 08, 2018 06:56 PM Comments"}, {"articleID": "2017050820_00063839_W", "names": {"Mike Richards": ["Q575019", "Q6833845", "Q6848560", "Q6848562", "Q6848563"]}, "date": "2017-05-08", "url": "http://www.echonews.com.au/news/hydro-power-not-a-pipe-dream-for-gladstone/3175517/", "content": "OPTIONS: The hinterland mountains west of Gladstone would be the perfect place for a pumped-storage hydroelectricity facility. <mark>Mike Richards</mark> GLA080417HYDRO Popular Stories BBC's bizarre Madeleine McCann documentary intro Luxury outback paradise built in western Queensland Man wed to screwdriver killer says he can't divorce Local Real Estate Cars For Sale AS POWER prices continue to rise and the threat of global warming lingers, the need for cheap, clean and reliable energy grows. While the Gladstone Regional Council pushes for another coal-fired power station to be built in the region, business owner and aviator Hugh Bridge believes our mountainous surrounds out west are the perfect location to build dams for pumped-storage hydroelectricity in order to store excess energy. Pumped-storage hydroelectricity is a type of hydroelectric energy storage used by electric power systems for load balancing - like a big battery. It's a method which stores energy in the form of gravitational potential energy of water, pumped from a lower elevation reservoir to a higher elevation. At times of low electrical demand, excess generation capacity is used to pump water into the upper reservoir. When there's higher demand, water is released back into the lower reservoir through a turbine, therefore generating electricity. The amount of megawatts produced by such a facility would depend on various factors including the falling distance of water and the rate at which water spills per litre every second. Mr Bridge, a Cessna plane owner, doesn't believe these ideas are pie in the sky. The 69-year-old has flown over one million kilometres of land and has seen plenty of mountains along the Great Dividing Range with potential to base a pumped-storage facility. OPTIONS: The mountains west of Gladstone would be the perfect place for a pumped-storage hydroelectricity facility. <mark>Mike Richards</mark> GLA080417HYDRO \"We've reached the stage where a lot of our power stations are reaching the end of their useful life and they're talking about replacing them,\" Mr Bridge said. \"If we're going to replace them it would be nonsense to build more coal-powered ones - we should be building clean power stations .\" Providing it was practical to do so, I would be building wind turbines in suitable places along the Great Dividing Range, solar farms on the other side of the range where it is drier and also building the high and low dams to do the pumped-storage hydroelectricity. \"Mr Bridge says he's not against mining, but believes alternatives must be found to replace coal mining .\" I would like to see all tiers of government start taking the carbon dioxide pollution of the atmosphere seriously, \"he said .\" They seem to think because (Australia) only contributes a small percentage it doesn't matter too much. \"They should keep in mind we are amongst the highest polluters per head of population in the world .\" Global warming could be a runaway effect; once it starts it could be nearly impossible to stop its effects. \"These renewable projects would lower energy prices, lower carbon emissions and lower unemployment, Mr Bridge said. carbon emissions Read More Login to follow clean energy Read More Login to follow gladstone region Read More Login to follow hydro electricity Read More Login to follow hydro power Read More Login to follow renewable energy Read More Login to follow Topics: carbon emissions clean energy gladstone region hydro electricity hydro power renewable energy 0 PRINT Have your say Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}, {"articleID": "2018080606_00146848_W", "names": {"Ross Martin": ["Q25189950", "Q7369492"]}, "date": "2018-08-05", "url": "http://www.standard.net.au/story/5569554/lakes-appear-to-be-on-road-to-recovery-after-fires/?cs=72", "content": "Work to extinguish the Cobrico peat fire in April. Picture: Rob Gunstone Water quality in two south-west lakes affected in the St Patrick's Day fires appear to be improving, new testing shows. Testing at Lake Elingamite and Lake Cobrico by the Department of Environment, Land, Water and Planning (DELWP) shows that while nutrient levels remain high, early results indicate that levels are trending downward and do not currently pose a risk to the community or the environment. DELWP Barwon South West fire recovery co-ordinator <mark>Ross Martin</mark> said water quality testing was ongoing. \"The samples have been analysed and results compared to the EPA's results from samples taken during the fires, which provided a comparison to evaluate how the lakes are responding post-fires,\" he said. \"Results indicate that nutrient levels are relatively high for the two lakes, however, this is not unusual for a waterway that's recently been impacted by fire or any inland lake of this kind .\" Mr <mark>Martin</mark> said limited water quality data prior to the fires made it impossible to determine whether the high nutrient levels in the lakes was caused by the fires. \"High nutrient levels are common in these types of inland lakes and can vary seasonally and with changes in rainfall,\" he said. \"DELWP will continue to test water quality at both lakes to monitor changes against early sampling results and ensure any risks or impacts are identified and addressed as quickly as possible .\" facebook SHARE twitter TWEET email whatsapp comment Comments"}, {"articleID": "2018042504_00032934_W", "names": {"David Hogg": ["Q29642981", "Q49712061", "Q53843732"]}, "date": "2018-04-24", "url": "http://en.canoe.ca/news/world/parkland-kid-questioned-by-school-officials-officers-for-shooting-ar-15-at-gun-range", "content": "PARKLAND, Fla.--A Marjory Stoneman Douglas student alleges he was aggressively questioned by school administrators and local law enforcement after posting on social media that he fired an assault weapon at a gun range with his dad. Junior Kyle Kashuv said he was brought in for questioning Monday by a school security officer and a Broward County deputy in what he says was an attempt to intimidate him. It was great learning about our inalienable right of #2A and how to properly use a gun. This was my first time ever touching a gun and it made me appreciate the #Constitution even more. My instructor was very informative; I learnt a lot. #2A is important and we need 2 preserve 2A pic.twitter.com/4rcOZbpl88--Kyle Kashuv (@ KyleKashuv) April 21, 2018 \"I can now check off being wrongfully questioned by law enforcement off my bucket list,\" tweeted Kashuv, adding \"school will be interesting for the remainder of my tenure at MSD. I am not looking forward to it .\" On Tuesday, Kashuv told Fox News host Tucker Carlson that the meeting with officials was an interrogation. \"It was a clear attempt to intimidate me, and they used very, very, very harsh intimidation tactics,\" Kashuv said. After first being questioned by a school security officer, a Broward County deputy entered the room and sat behind the teen, Kashuv said. The deputy began asking Kashuv who the rifle belonged to and who he went shooting with. Kashuv said he asked if he could record the interview and was told that he couldn't. The teen said he felt like the deputy was trying to get him to incriminate his father. Kashuv said the gun debate has become so prominent since the Valentine's Day massacre that killed 17 that he \"felt it was important to learn about the physical mechanics of it,\" Kashuv said in a text to The Associated Press. \"I made sure to post about it because I wanted to show people it's people that are the issue, not guns .\" Kashuv also tweeted \"Apparently using my constitutional rights to learn how to defend myself is wrong? Sorry, I thought this was still the United States of America .\" On Friday, Kashuv posted videos on Twitter showing him firing an AR-15 rifle at a target, saying it \"strengthened my love for 2A\" and taught him \"America is the greatest country ever, where freedom intensifies and liberty is required to be a real American .\" His posts came as thousands of students around the country walked out of school for gun reform in honour of the 19th anniversary of the Columbine shooting. Kashuv has been a vocal supporter of gun rights and garnered heavy support from conservative pro-gun groups. The teen has drawn criticism from the core #NeverAgain students, including Emma Gonzalez and <mark>David Hogg</mark>, who have repeatedly called for a ban on assault rifles. A Broward Sheriff's Office incident report confirmed the meeting, but didn't provide any specific response to Kashuv's claim that the deputy used interrogation techniques against him. A school security supervisor told the deputy several students had expressed concern about the social media post, even though no threats were on the video, the report said. When asked about the post, Kashuv said he had borrowed the rifle from a friend and went shooting with his father, the report said. Officials contacted Kashuv's mother, who stated she knew about the video and the trip to the gun range. U.S. lawmaker calls school shooting survivor Emma Gonzalez a'd ummy' TV host resigns after \"hot poker' tweet directed at Parkland student"}, {"articleID": "2009122116_00127368_W", "names": {"Ben Smith": ["Q21622916", "Q21622918", "Q2895559", "Q31193", "Q3637951", "Q4886477", "Q4886478", "Q4886480", "Q4886481", "Q4886482", "Q4886483", "Q4886484", "Q4886490", "Q56144844"]}, "date": "2009-12-21", "url": "http://aviation.ca/content/view/8297/117/", "content": "please log in to view the metar/taf reports aviation.ca - your number one source for canadian aviation news, jobs and information! air canada bolsters toronto hub with service to copenhagen air canada bolsters toronto hub with service to copenhagen air canada announced today it will launch daily service between toronto and copenhagen next summer as it further expands international flying at its major hub to offer customers more choice of destinations and routes. \"air canada is building its toronto hub and this year has now announced long-haul service to four new, major international destinations. the addition of copenhagen next summer is strategically important as passengers will be able to conveniently connect with our star alliance partner scandinavian airlines to reach such cities as oslo, helsinki, warsaw, stockholm and gothenburg,\" said <mark>ben smith</mark>, executive vice president and chief commercial officer. \"we will continue to look for opportunities to grow our hub after earlier announcing flights starting next summer to athens, barcelona and, via montreal, brussels. toronto's geographic position and the consolidation of our operations under one roof are enabling us to establish lester b. pearson international airport as a major north american and global hub for the star alliance .\" air canada bolsters toronto hub with service to copenhagen route opens connections for customers flying to scandinavia'> route opens connections for customers flying to scandinavia iwg delivers its 2000th unit to dassault falcon'> iwg delivers its 2000th unit to dassault falcon two injured in media helicopter crash in montreal'> two injured in media helicopter crash in montreal sick children find santa claus in the sky - air transat gives $850,000 to the children's wish founda'> sick children find santa claus in the sky - air transat gives $850,000 to the children's wish founda jazz customer services and aircraft services divisions ratify labour agreement'> jazz customer services and aircraft services divisions ratify labour agreement libraries get an early gift for christmas to mark the centennial of flight from the canada aviation'> libraries get an early gift for christmas to mark the centennial of flight from the canada aviation alberta aviation museum celebrates the70th anniversary of the british commonwealth air training plan'> alberta aviation museum celebrates the70th anniversary of the british commonwealth air training plan norad fosters the magic of christmas'> norad fosters the magic of christmas football fans set to have a ball with emirates' fan-tastic 2010 fifa world cup (tm) packages'> football fans set to have a ball with emirates' fan-tastic 2010 fifa world cup (tm) packages airline unveils new schedule for the summer of 2010'> airline unveils new schedule for the summer of 2010 pratt & whitney canada signs fmp ® agreement with falcon aviation services'> pratt & whitney canada signs fmp ® agreement with falcon aviation services irish air corps takes delivery of mechtronix full flight trainer (tm)'> irish air corps takes delivery of mechtronix full flight trainer (tm) hartzell propeller signs long-term deal with hawker beechcraft'>"}, {"articleID": "2011070314_00100373_W", "names": {"Mike Richards": ["Q575019", "Q6833845", "Q6848560", "Q6848562", "Q6848563"], "Johan Hedberg": ["Q10540378", "Q1344583"], "Joel Ward": ["Q17198215", "Q2621755", "Q937742"], "Sean O'Donnell": ["Q2259109", "Q720559"], "Jussi Jokinen": ["Q11868014", "Q537505"], "Chris Drury": ["Q2495654", "Q471491"], "Marc-Andre Bergeron": ["Q20090281", "Q979965"], "Pascal Dupuis": ["Q28497112", "Q569331"], "Eric Brewer": ["Q1342539", "Q4354667"], "Jeff Carter": ["Q6173518", "Q6173521", "Q6173523", "Q943565"], "Nick Johnson": ["Q1062406", "Q16227648", "Q16234670", "Q22110186", "Q45346097", "Q504351", "Q7027369"], "Ryan Jones": ["Q1386825", "Q19968641", "Q21170662", "Q435159", "Q57234911", "Q7384192", "Q7384193", "Q7384195"], "Anders Nilsson": ["Q18709371", "Q20065313", "Q4753880", "Q48816311", "Q491193", "Q491200", "Q491204", "Q54396863", "Q6009573", "Q6009605", "Q6011417"], "Darnell Mcdonald": ["Q3016418", "Q5224127"]}, "date": "2011-07-03", "url": "http://aol.sportingnews.com/nhl/feed/2011-06/nhl-free-agency/story/if-he-can-stand-the-pressure-brad-richards-a-great-fit-for-new-york-rangers", "content": "for a guy like brad richards, who doesn't have the ego of many star athletes, the attention and spotlight that came with being the no. 1 target in free agency wasn't something he necessarily embraced. with his deal done with the new york rangers--a nine-year, $60 million contract--he's free to do something he probably wanted to do a week ago. \"the phone will probably get thrown in a lake,\" he said, joking. brad richards signed with the new york rangers on saturday afternoon--and he was happy to get the deal done. (ap photo) free agency is over for <mark>richards</mark>, but if he thought this process was tough, wait until he sees what's next. he's now been identified as the variable that takes the rangers from an early-round exit to a championship team. now, it's on him to make it happen. when the rangers were eliminated from the playoffs, coach john tortorella sat down and identified a few needs to get over the hump. an elite center. someone to run the power play. a mentor for the rangers' young developing forwards. <mark>richards</mark> addresses all three, and that's why the rangers and <mark>richards</mark> were the ideal fit compared to the other finalists like the toronto maple leafs, los angeles kings, calgary flames and tampa bay lightning. he can take the rangers from good to great. he addresses real needs, which wasn't necessarily the case in tampa bay or los angeles. it's the perfect fit--assuming he's able to withstand the responsibility. he's playing in a market unlike any other he's played in his career with a pressure he's never faced. this isn't dallas or tampa. this is new york, and the expectation has now become a stanley cup. \"it's going to be a challenge for sure. it's going to be something different, i haven't experienced it,\" he said of the move to a market like new york. \"you want to be a great player, that's something you should relish .\" read: how much does brad richards help the rangers? nhl free agency: my open letter to brad richards after signing with the rangers kings making big push for free agent brad richards gm glen sather deserves credit for landing the best player in free agency, at a time his young, developing team is ready for it. he also gets points for the way he did it. he passed on going to the newport offices in mississauga, ont., with a convoy of people to try and win over the <mark>richards</mark> camp. instead, he made a phone call at 12:01 p.m. et on friday where he made his pitch and first offer. then he watched on television as other teams paraded through the newport office. it couldn't have been easy waiting and knowing convincing pros like kings gm dean lombardi and lightning gm steve yzerman were making a pitch. but the laid-back approach worked. \"i just didn't want it to turn into some kind of scene,\" sather said. \"i just didn't want to get involved in that kind of circus arrangement? we made our presentation and we were straight up .\" on paper, it's perfect. <mark>richards</mark> fills multiple needs. he knows and likes the coach. he says he feels great and fully recovered from his concussion and has been training for six weeks. new york needed an elite center, and he was the only one available. the free agency circus is over for <mark>richards</mark> but the spotlight doesn't disappear because his name is on a contract. he chose new york, and he'd better be prepared for what that means. \"what better place to try to perform than madison square garden every night,\" he said. \"that's a dream come true .\" if he can stand the pressure, brad richards a great fit for new york rangers saturday jul 2 for brad richards, the free agency circus is over, but the scrutiny has only just begun. if he holds up his end of the bargain, he can take the rangers from good to great, craig custance says. for now, top free agent <mark>richards</mark> goes unsigned friday jul 1 brad richards' suitors made their pitches to the top available free agent on friday but the centerman has yet to make a decision. tallon's panthers make day's biggest splash-now what? friday jul 1 after finishing with the worst point total in the eastern conference last season, panthers gm dale tallon hopes that nine new players can jumpstart a turnaround, writes craig custance. ville leino, capitals top list of winners from opening day of free agency friday jul 1 newly signed buffalo sabres winger ville leino tops the list of craig custance's winners from day 1 of nhl free agency. where does jaromir jagr fall? new jersey devils re-sign defenseman andy greene and goalie <mark>johan hedberg</mark> friday jul 1 the devils open free agency by re-signing defenseman andy greene and backup goaltender <mark>johan hedberg</mark>. friday jul 1 tomas fleischmann is the latest beneficiary of the dale tallon spending spree, signing a four-year, $18 million deal with the florida panthers. edmonton oilers sign ben eager, darcy hordichuk, cam barker friday jul 1 the edmonton oilers picked up an enforce, a depth forward and a former top prospect on the first day of free agency. buffalo sabres sign ville leino to six-year deal friday jul 1 ville leino, one of the best available forwards in the 2011 class, signs a six-year, $27 million deal with the buffalo sabres. st. louis blues, matt d'agostini agree to two-year deal friday jul 1 st. louis and matt d'agostini set career highs in goals (21), assists (25) and points (46) in 82 games with the blues last season. jeff halpern returns to capitals, signs 1-yr deal for $825k friday jul 1 the washington capitals bring back a familiar face, signing former captain jeff halpern to a one-year deal worth $825,000. washington capitals sign <mark>joel ward</mark>, roman hamrlik friday jul 1 the washington capitals got tougher on friday, signing forward <mark>joel ward</mark> and defenseman roman hamrlik to multiyear deals. chicago blackhawks sign andrew brunette, three others friday jul 1 the chicago blackhawks agreed on one-year contracts with forwards andrew brunette, jamal mayers and brett mclean along with defenseman <mark>sean o'donnell</mark>. friday jul 1 the philadelphia flyers sign their second former pittsburgh penguin of the day, in former stanley cup hero max talbot. penguins sign tyler kennedy to two-year, $4 million deal friday jul 1 the pittsburgh penguins have signed forward tyler kennedy to a two-year deal with $2 million annually. jaromir jagr signs with philadelphia flyers friday jul 1 the flyers come out of nowhere to land veteran forward jaromir jagr on the opening day of free agency in the nhl. florida panthers sign forward scottie upshall friday jul 1 the florida panthers, trying to reach the salary cap floor and continuing to add toughness and talent, have signed forward scottie upshall, the team announced on friday. pittsburgh penguins, detroit red wings withdraw offers to jaromir jagr friday jul 1 the pittsburgh penguins and the detroit red wings were long viewed as preferred destinations for jaromir jagr. unwilling to wait, they pulled their offers, and in came the flyers. columbus blue jackets sign defenseman james wisniewski friday jul 1 the columbus blue jackets have signed defenseman james wisniewski to a six-year, $33 million deal, an nhl source confirms with sporting news' craig custance. nhl free agent central: news and analysis of the july 1 frenzy friday jul 1 free agents are flying off the board in the opening day of nhl free agency but brad richards still remains unsigned. track the status of sn's top free agent and catch up on the rest. free agents, teams at the starting line ahead of nhl free agency friday jul 1 deals are done, but big questions remain as the nhl free-agent market heads toward its opening bell. here's a look at contracts completed, players on the market and deals in the making. flyers gm: we're not going after steven stamkos friday jul 1 there will be no offer sheet going from philadelphia to tampa bay's steven stamkos. flyers brass weighs the idea and finds it too expensive to entertain. sabres trade gamble pays off with d ehrhoff signed friday jul 1 christian ehrhoff leaves a golf game to talk contract with buffalo brass and comes away with a 10-year, $40 million agreement. the sabres had acquired his rights from the islanders for a fourth-round pick. d james wisniewski meets with blue jackets; no deal yet friday jul 1 three hours of talk thursday yields no accord, and conversation is expected to continue before defenseman james wisniewski becomes an unrestricted free agent. tomas vokoun top option in thin free-agent goalie market thursday jun 30 a return to the florida panthers is becoming more unlikely for top free-agent goalie tomas vokoun, craig custance says. where's jaro? nhl awaits jagr decision as free agency nears thursday jun 30 thursday evening arrived without a decision; friday brings a noon et start of free agency. and jaromir jagr remains the nhl's biggest soap opera. which suitor will prevail? buffalo sabres sign christian ehrhoff; 10 years, $40 million thursday jun 30 christian ehrhoff has agreed to terms with the buffalo sabres, an nhl source confirms with sporting news' craig custance. thursday jun 30 mike modano, 41, tells the dallas morning news that he'll once again see what free agency offers before deciding on retirement. colorado avalanche re-sign defensemen ryan o'byrne, matt hunwick thursday jun 30 the colorado avalanche agree to a two-year deal with defenseman ryan o'byrne worth a reported $3.6 million. carolina hurricanes re-sign <mark>jussi jokinen</mark>; three-year contract thursday jun 30 the carolina hurricanes re-signed forward <mark>jussi jokinen</mark> on thursday to a three-year contract worth $9 million. st. louis blues re-sign t.j. oshie; one-year deal thursday jun 30 the st. louis blues have signed forward t.j. oshie to a one-year deal, that's worth $2.35 million, an nhl source told sporting news. chicago blackhawks sign d steve montador; four-year deal thursday jun 30 the chicago blackhawks acquire the rights to defenseman steve montador from the buffalo sabres and sign him to a four-year contract. wednesday jun 29 when wednesday began, jaromir jagr was widely assumed to be on the verge of choosing a team for the 2011-12 nhl season. by the time wednesday ended, his agent didn't know where he was. \"jagr watch' continues: jaromir jagr doesn't decide on pittsburgh penguins or detroit red wings, disappears wednesday jun 29 on wednesday, jaromir jagr hopped a transatlantic flight, kicked the rumor mill into overdrive and managed to disappear--but he didn't decide on an nhl team. dwayne roloson, tampa bay lightning working to finalize contract wednesday jun 29 dwayne roloson, acquired from the new york islanders on jan. 1, went 18-12-4 in helping tampa bay earn its first postseason berth in four years. islanders ship christian ehrhoff's rights to buffalo sabres wednesday jun 29 the new york islanders, who acquired christian ehrhoff from vancouver on tuesday for a 2012 fourth-round pick, sent his negotiation rights to the sabres for another fourth-round pick on wednesday, according to a sabres team release. ryan callahan, keith yandle among attractive, realistic restricted free agents wednesday jun 29 steven stamkos? probably not, but teams looking to sign a restricted free agent could find circumstances, and players like ryan callahan, that make the offer-sheet scenario a realistic one, craig custance says. agent: penguins still hold max talbot's negotiation rights wednesday jun 29 contrary to one published report, the toronto maple leafs have not traded for the negotiation rights of pittsburgh penguins forward max talbot, agent pat brisson tells the pittsburgh tribune-review. kopecky signs; panthers working on vokoun contract wednesday jun 29 after getting forward tomas kopecky into a four-year deal, panthers gm dale tallon is negotiating a contract to keep goalie tomas vokoun from becoming an unrestricted free agent. columbus blue jackets acquire james wisniewski's negotiating rights wednesday jun 29 in a shallow pool of unrestricted free agents, james wisniewski is the nhl's most-wanted defensemen, craig custance is told. the canadiens are out of the picture; wisniewski's right are traded to the blue jackets. nhl:\" not aware' of issues with predators' free agents wednesday jun 29 amid reports that the nhlpa is investigating irregularities with the qualifying offers the predators sent to their restricted free agents, the nhl released a statement saying that it was \"not aware of any defects .\" james wisniewski likely to reach july 1 without deal from canadiens wednesday jun 29 james wisniewski, coming off a career year split between the islanders and canadiens, could become the nhl's most-wanted free-agent defenseman on friday, a source tells sn's craig custance. buffalo sabres agree on new deal with nathan gerbe wednesday jun 29 the buffalo sabres and nathan gerbe (16 points, 15 assists in 2010-11) agree on a multiyear deal. carolina hurricanes, chad larose agree on new deal wednesday jun 29 chad larose, who scored 16 goals last season, and the hurricanes agree on a two-year deal with a $1.7 million cap hit. wednesday jun 29 rangers captain <mark>chris drury</mark> will accept the buyout of his contract and become an unrestricted free agent on july 1, according to a media report. canucks trade ehrhoff's rights to islanders tuesday jun 28 the canucks have dealt defenseman christian ehrhoff's rights to the new york islanders for a 2012 draft pick. tuesday jun 28 the pittsburgh penguins have offered jaromir jagr a one-year deal, according to the team's general manager ray shero. lightning re-sign defenseman <mark>marc-andre bergeron</mark> tuesday jun 28 the tampa bay lightning have re-signed defenseman <mark>marc-andre bergeron</mark> to a two-year contract. carolina hurricanes, joni pitkanen agree on new deal tuesday jun 28 the carolina hurricanes re-sign defenseman joni pitkanen to a three-year contract that will pay him $4.5 million per season. top 25 nhl free agents: brad richards, christian ehrhoff lead weak class tuesday jun 28 the unrestricted free-agent class is weak, and deals leading up to noon et friday haven't helped. that's good news for tomas fleischmann and the rest of craig custance's top 25 players. maple leafs clear decks ahead of free agency, brad richards pursuit tuesday jun 28 defenseman luke schenn, winger clarke macarthur and center tyler bozak are sticking with the maple leafs, having received qualifying offers. pittsburgh penguins sign <mark>pascal dupuis</mark> to two-year deal tuesday jun 28 the pittsburgh penguins sign forward <mark>pascal dupuis</mark> to a two-year deal worth a total of $3 million, an nhl source confirms with sporting news. capitals sign brooks laich to six-year, $27 million deal tuesday jun 28 a chance to potentially finish his career in washington trumps brooks laich's desire to max out a contract in free agency. he signs a healthy six-year deal worth $27 million. canucks, bieksa agree to five-year deal; lapierre gets two-year deal monday jun 27 the canucks and defenseman kevin bieksa agreed to a five-year deal worth $23 million and forward maxim lapierre agrees to a two-year deal worth $2 million. red wings, penguins coaches both ok with jaromir jagr discussions saturday jun 25 red wings coach mike babcock isn't worried about adding another aging star like jaromir jagr, while penguins coach dan bylsma says he \"absolutely\" is interested. tampa bay lightning gm steve yzerman's work is not done friday jun 24 tampa bay gm steve yzerman signed <mark>eric brewer</mark> on thursday, but he has work to do with stars like steven stamkos and dwayne roloson, craig custance says. tampa bay lightning sign defenseman <mark>eric brewer</mark> to four-year deal friday jun 24 tampa bay and defenseman <mark>eric brewer</mark> agree on a four-year deal worth nearly $16 million, according to reports. penguins gm ray shero: max talbot likely to hit free agency friday jun 24 pittsburgh penguins center max talbot turns down a three-year deal and is likely to hit unrestricted free agency on july 1, gm ray shero tells multiple media outlets. report: brad richards seeking eight-year, $50 million-55 million deal friday jun 24 if the philadelphia flyers want to make a run at brad richards, who is reportedly seeking an eight-year deal worth $50 million - $55 million, they'd conceivably have the necessary cap space. nhl sets salary cap at $64.3 million, floor of $48.3 million thursday jun 23 the nhl salary cap for the 2011-12 season will be $64.3 million, the league announces, with a lower limit, or \"floor,\" of $48.3 million. ilya bryzgalov, philadelphia flyers agree on contract thursday jun 23 on the same day they sent captain <mark>mike richards</mark> to the kings and <mark>jeff carter</mark> to the blue jackets, the flyers agree on a nine-year, $51 million deal with goalie ilya bryzgalov, according to tsn.ca. winnipeg gm cheveldayoff to discuss deal with andrew ladd wednesday jun 22 winnipeg gm kevin cheveldayoff is looking to \"spend some meaningful time\" with captain andrew ladd's representatives. ladd can become a restricted free agent on july 1. steven stamkos on new deal with lightning:' i think it's close' wednesday jun 22 tampa bay lightning sniper steven stamkos is confident he'll have a new deal \"well before\" he would reach restricted free agency on july 1. winnipeg captain andrew ladd shooting for long-term deal friday jun 10 captain andrew ladd may not re-sign with the winnipeg franchise, but he is certainly looking for some measure of stability. montreal canadiens re-sign andrei kostitsyn thursday jun 9 the montreal canadiens announce their one-year deal with andrei kostitsyn, which comes with a reported $3.25 million price tag. calgary flames sign brett carson to 2-year deal thursday jun 9 the calgary flames sign defenseman brett carson, 25, to a $1.15 million, two-year deal. bryzgalov wants big contract; flyers want cup-worthy goalie wednesday jun 8 acquiring the rights to ilya brzygalov is a step the flyers promised to make in their stanley cup plan. now comes the hard part--cutting him a deal that doesn't gut their roster. gms seek to broaden ban on shots to the head wednesday jun 8 in the wake of more high-profile incidents, nhl gms--including tampa bay's steve yzerman--seek to broaden and clarify a ban on hits to the head. pittsburgh penguins, <mark>nick johnson</mark> agree on deal saturday jun 4 the pittsburgh penguins agree on a one-year, two-way deal with <mark>nick johnson</mark> worth $550,000 at the nhl level. unsigned and recovering from surgery, giguere faces long summer thursday jun 2 jean-sebastien giguere hopes to play again--possibly in toronto--but his chance for a 2011-12 contract depends on how he recovers from sports hernia surgery. blues defenseman roman polak gets five-year contract thursday jun 2 offseason deals continue for the blues. days after patrick berglund's new two-year deal is announced, the team cuts a five-year, $13.75 million contract with rising defenseman roman polak. and a deal with forward vladimir sobotka is in the offing. rangers acquire defense prospect tim erixon from flames wednesday jun 1 the new york rangers acquire tim erixon, a 2009 first-round pick, from the calgary flames. edmonton oilers re-sign lw <mark>ryan jones</mark> to 2-year deal monday may 30 the oilers re-sign forward <mark>ryan jones</mark> to a two-year deal, keeping him away from free agency. new york islanders sign swedish goalie <mark>anders nilsson</mark> friday may 27 the islanders sign <mark>anders nilsson</mark>, a 21-year-old swedish goaltender, to a three-year entry level deal. islanders sign kyle okposo to five-year deal wednesday may 25 the new york islanders and 23-year-old forward kyle okposo agree on a five-year contract worth a reported $14 million. red wings join group of teams with money to burn in challenging free-agent market wednesday may 25 with brian rafalski out of the picture, gm ken holland and the red wings have money to burn, but they-and teams in their position-should spend wisely, craig custance says. predators' trotz: we'll match any offer for shea weber wednesday may 25 nashville predators coach barry trotz tells sporting news' craig custance that his team will match any offer for defenseman shea weber. rangers pick up brad richards for $60 million worcester telegram & gazette: sunday jul 3. any commercial use or distribution without the express written consent of. any commercial use or distribution without the express written consent of use of and/or registration on any portion of this site constitutes acceptance of our .? 2011 sportingnews.com and its licensors. all rights reserved. the material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of sportingnews.com. nfl: robert mathis reportedly prepared to holdout once there's a settlement get amazing deals on kizashi and all 2011 suzukis. learn more at suzukiauto.com mlb: giants hit 3 home runs in 15-3, rain-delayed victory over tigers ncaab: new mexico st. hires tony delk as assistant coach mlb: <mark>darnell mcdonald</mark> helps boston red sox awaken offense mlb: ramirez homers twice to lead marlins past rangers nfl: nfl rookies anxious to collect 1st paycheck nascar: david ragan wins coke zero 400 at daytona"}, {"articleID": "2012120414_00029237_W", "names": {"Barry Sanders": ["Q809092", "Q809097"], "Scott Mitchell": ["Q7436881", "Q7436882", "Q7436884", "Q7436886", "Q8992456"]}, "date": "2012-12-03", "url": "http://deadspin.com/5965261/charlie-batch-used-to-hand-off-to-barry-sanders-thats-how-damned-old-he-is", "content": "please check your inbox for a confirmation email. threw some shade at charlie batch, who was far from elite but at least outplayed joe flacco in the steelers' win in baltimore. but no one was expecting greatness. batch just gave more of what he's offered these past 10 years as pittsburgh's backup (or third-string) quarterback: a steady, capable option under center, who'll give you a chance to win at least some of the games he's forced into starting. you can't ask for much more. he's really old, though. batch turns 38 on wednesday, making him the same age as long-gone signal callers like jake plummer, danny wuerffel, and jake delhomme. for a sense of perspective, batch's main safety valve as a rookie was throwing dump passes to a running back named <mark>barry sanders</mark>. 1998 was <mark>sanders</mark>'s last year in the league, and batch's first. after setting nearly every passing record at eastern michigan, he became an instant local favorite when he was drafted by the lions in the second round. after two games, <mark>scott mitchell</mark> couldn't get it done, so the lions turned the reins over to batch. and in his second career start-a monday night game against the buccaneers-batch recorded his first win, thanks in large part to <mark>sanders</mark>. this, despite tampa bay explicitly promising they were going to force batch to beat them. \"i think we're going to have to [focus on <mark>sanders</mark>],\" tony dungy said. \"the focus is always <mark>barry sanders</mark> when you play them, and we've got to really do a good job on him and not let him get going. if we can get ahead of them, get in a mode like minnesota was, where once they got up now you're just turning everything you've got loose at the quarterback, it's going to be tough on a rookie quarterback - whether it's charlie batch or ryan leaf. peyton manning, the same thing .\" so we've really got to concentrate on <mark>barry</mark> and make sure that we don't let him get going, and then make the quarterback throw. \"it didn't matter. watch some of the batch-to-sanders highlights above (all taken from this youtube video); even an inexperienced qb and a prepared defense couldn't stop <mark>sanders</mark> from doing his thing. <mark>sanders</mark> rushed 27 times and put up 175 all-purpose yards, while batch went 14-for-23 for 115 yards. batch added his first career score, running for a one-yard touchdown, as the lions won 27-6. <mark>sanders</mark> would unexpectedly retire after the season, and detroit's run game went in the tank. in response, batch was asked to become more of a running quarterback than he was comfortable being, and that led directly to a series of injuries. he missed multiple games each of his remaining three years in detroit, and wasn't re-signed after the 2001 season. the hybrid style he had adopted served him well-he was signed to the steelers by gm kevin colbert, who had scouted and drafted him for the lions. he was the ideal backup to then-pittsburgh qb kordell stewart-if\" slash \"went down, batch could enter as a scrambling qb without the team missing a beat. stewart's gone, as are tommy maddox and dennis dixon, but batch remains. ben roethlisberger's stand-up style of play is different, but he's just as prone to injury-in 2005, when roethlisberger went down midseason, batch stepped in and went 2-0. in a year in which 10-6 wasn't good enough to make the afc playoffs, the steelers finished 11-5 and went on to win super bowl xl."}, {"articleID": "2011120917_00078243_W", "names": {"Robert Jensen": ["Q48743679", "Q512738", "Q7346093"]}, "date": "2011-12-09", "url": "http://boston.com/business/technology/articles/2011/12/09/governor_seeks_to_double_fund_to_land_tech_firms?rss_id=Boston+Globe+--+Technology+stories", "content": "governor seeks to double fund to land tech firms by bob moen associated press / december 9, 2011 e-mail | print | text size - + e-mail e-mail this article to: invalid e-mail address add a personal message: (80 character limit) your e-mail: invalid e-mail address sending your article your article has been sent. cheyenne, wyo. - gov. matt mead wants to up the ante in trying to entice technology jobs to wyoming by proposing to double the money the state makes available to help build data centers and other digital facilities and broaden the types of firms eligible to tap the funds. mead said thursday he wants wyoming to be as \"attractive as possible to these companies\" to bring in jobs and new tax revenue. wyoming established a $15 million fund last year to help pay for infrastructure, such as water service, for new mega data centers after verizon communications inc. looked at locating a $4 billion data center near laramie. the company decided against building one for now after it acquired a separate company that already had data centers, and the state fund remained unused. mead's budget proposal released last week seeks to expand the fund to $30 million and broaden it to include other types of tech-related facilities. \"in doubling the funding there's more opportunity for big projects and also a pool of money for other technology projects,\" mead said through his spokesman renny mackay. <mark>robert jensen</mark>, ceo of the wyoming business council, said that while the fund hasn't been tapped yet these types of complicated projects take time and it's important the state has the money available. \"to have some funding in the governor's office that he has the ability to put toward infrastructure that supports their location here, that's good news and the industry will take note of that,\" <mark>jensen</mark> said. he said his office is actively talking with several data center operators about locating in wyoming. the discussion involved projects not as large as what verizon was looking at, but they are still \"significant,\" he said. \"anything can happen,\" <mark>jensen</mark> said. \"the point is that the industry is still viable. it's still growing. we still have a compelling package for them, and people are listening to us .\" he added broadening the fund could attract other types of technology firms, such as those that produce software .? copyright 2011 associated press. all rights reserved. this material may not be published, broadcast, rewritten, or redistributed. e-mail e-mail this article to: invalid e-mail address add a personal message: (80 character limit) your e-mail: invalid e-mail address sending your article your article has been sent. more articles in technology"}, {"articleID": "2019072820_00048916_W", "names": {"Amy Jones": ["Q16224496", "Q43273890"], "Mark Robinson": ["Q10379723", "Q16193334", "Q16232884", "Q18166002", "Q21547424", "Q21553547", "Q21553558", "Q21553677", "Q28974364", "Q3294225", "Q6769469", "Q6769470", "Q6769471", "Q6769473", "Q6769474", "Q6769476", "Q6769479", "Q6769480"], "Heather Knight": ["Q23797061", "Q39065853", "Q5693931", "Q5693932"], "David Warner": ["Q3018962", "Q363271", "Q57408725"]}, "date": "2019-07-29", "url": "http://www.gympietimes.com.au/news/aussie-superheroes-skittle-england/3791607/", "content": "Meg Lanning of Australia. Picture: Getty Cricket Aussie superheroes skittle England by Selina Steele in Hove 29th Jul 2019 6:10 AM premium_icon Subscriber only 0 WHAT'S better than one superhero? Two of course. Which is exactly what the Southern Stars have in Meg Lanning and Ellyse Perry. Meg Lanning of Australia dives to make her ground as <mark>Amy Jones</mark> of England takes the bails off during the 2nd Vitality Women's IT20 in Hove, England. Picture: Getty Australia was experiencing a little wobble at 3-35 until Perry joined Lanning for an unbeaten 87-run partnership to claim victory in the second Ashes T20 international. While Lanning's T20 World record of 133 not out was all muscle and force, her knock today at County Ground, Hove was calculated grit. The seven wicket win came with 2.1 overs to spare, Perry finishing on 47 not out and Lanning on 43 not out. But England had its chance with Lanning. If only stand-in keeper <mark>Amy Jones</mark> had the forethought to backhand the ball at the stumps a-la Alyssa Healy. Natalie Sciver of England is bowled out by Georgia Wareham of Australia during the T20 in Hove. Picture: Getty Instead, Lanning survived a run-out scare without having faced a ball. It would have been a diamond duck but Lanning's full body dive, Kate Cross's wide throw and <mark>Jones</mark>'s reach for the stumps were enough to save the Aussie skipper. At that stage Austalia was 1/23. At first it seemed far fetched when England coach <mark>Mark Robinson</mark> said Australia was just a side that were gifted \"God given physical attributes\". Perhaps he was right and this dominance was delivered on divine intervention. Perhaps he was wrong and it was the years of training, preparation and strong domestic competition. Georgia Wareham of Australia celebrates with her teammates. Picture: Getty Either way, Australia continued its summer of dominance with Ellyse Perry becoming the first player, male or female, to reach 1000 runs and 100 wickets in T20 internationals. \"I guess it's lovely, but I wasn't aware of it,\" Perry said. \"I actually think in T20 cricket at international level, we probably play it as much as the men, so I have played a pretty big volume of games now - over 100, so I suppose when you have played 100 games you might get close to it. Ellyse Perry became the first player to reach 1000 runs and 100 wickets in T20 internationals. Picture: Henry Browne/Getty Images\" That's probably the only reason I'm there - because I've played a lot of games. \"It has just been really nice to turn up every game and for us to perform and to find a way to win and win dominantly .\" It was really cool to be out there with Meg. I really enjoy batting with her and she's incredible when she's going. To be at the other end is quite easy really. \"Here's how the game unfolded: IN A SNAPSHOT: England won the toss and perhaps fearing another Meg Lanning masterclass, and the game being over in six overs, decide to bat. On the back of Tammy Beaumont, they bat through the 20 overs finishing 8-121. A six in the final over from Sophie Ecclestone sets Australia a run rate of 6.10. Meg Lanning strikes good form during the first game of the T20 series against England. Picture: Getty After a shaky start, Lanning and Perry to put together a chanceless partnership of 87 to guide Australia to victory. BUNNY BAIT: Australia's Ellyse Perry, opening the bowling, bewitched <mark>Amy Jones</mark> for the fourth time this series. With zero footwork, <mark>Jones</mark> spooned a catch to Georgia Wareham at cover point and England was 1/1 after the first over. THE HEROES: Lanning and Perry. Ridiculously talented, ridiculously smart, ridiculously patient. The composed pair happily waited for the bad ball, which inevitably would come, and easily ticked off the run a ball needed. Beth Mooney has been another star for Australia in the T20 series against England. Picture: Getty A six in the 15th over from Perry saw Australia needing 18 off 28 and it was all over bar a Pimm's to celebrate. SUPPORT ACTS: * Jess Jonassen's wicket in her first over, getting rid of Danni Wyatt, was due to the hot hands of Beth Mooney. Mooney running back with flight of the ball judged the catch perfectly. But ouch - this is where we don't mention her dropping Tammy Beaumont when Beaumont was on 35. But we do have to mention Mooney dropping Beaumont again on 39. Both chances were not as difficult as the one she held. Jonassen takes matters into her own hands and bowls Beaumont for 43 in the 12th over. * Warm up? What warm up! Georgia Wareham snared the dangerous Nat Sciver first ball. The England all rounder went across her stumps to glance the ball down fine leg but completely missed the ball. The leggie then backs this up by snaring England captain <mark>Heather Knight</mark>. Easy as you like, Wareham takes a gentle return catch after <mark>Knight</mark> came at her down the pitch. THE RECORD That player again - Perry. Ellyse Perry received player of the match for Australia in the recent Test against England and is setting records in the T20 arena. Picture: Getty Perry is the first player, either male or female, to complete the double of 100 wickets and 1000 STATE OF PLAY The post-mortem has already begun for England - records have fallen all series and all in favour of the Australians. England's domestic structure is being questioned while Australia's lauded. In comparison, The Southern Stars have set themselves up for a dynasty. Headlined by superstars Meg Lanning and Ellyse Perry, and with the likes of Sophie Molineux and Georgia Wareham coming through it's hard to see other nations catching them. NEXT UP: 3rd T20 International at Bristol on July 31. More green and gold dominance. Can't see where England will find any improvement. Australia to go through the series undefeated. More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England More Stories premium_icon Wade's reluctant Ashes sacrifice rewarded premium_icon Pattinson back and ready to fire in Ashes premium_icon Outcast to Ashes: the reinvention of <mark>David Warner</mark> premium_icon Pattinson delivers a warning to England Show More 0 australia Read More Login to follow cricket Read More Login to follow england Read More Login to follow sport Read More Login to follow t20 Read More Login to follow australia cricket england sport t20"}]