[{"date": "2014-03-18", "url": "http://www.supersport.com/rugby/article.aspx?Id=2363534", "content": "Please enter your email address / username. Please enter a valid email address / username. Please enter a valid email address. Please enter a valid email address. Tweet With 92 Vodacom Super Rugby caps and nearly 850 points behind his name, the return of <mark>Peter Grant</mark> has been a big plus for the DHL Stormers on their tour of Australasia. The 29-year-old flew straight from Japan earlier this month to join up with his teammates for the start of their tour and he has played off the bench twice this season - against the Crusaders and the Chiefs. While his second-half cameos were not able to help the Stormers to victories over the past fortnight, the man himself is looking forward to more game time against the Brumbies in Brisbane this Saturday (kick-off 10h40 SA time) and the next weekend against the Reds. \"I was buzzing when I came off the field against the Chiefs,\" <mark>Grant</mark> told www.iamastormer.com from his team's base in Coogee on Tuesday, \"it was great wearing the Stormers jersey again after a year away .\" Just to be part of this team again...it's always a great honour to be involved with the Stormers and I'm really looking forward to more game time in the coming weeks. \"His on-field abilities aside, as a no-nonsense defender and accurate goalkicker, <mark>Grant</mark> knows that he also has a big role to play off the field as a long-time and experienced member of this squad .\" The young guys seem to have some respect for me, \"said <mark>Grant</mark>, half-chuckling at the notion .\" But I don't think it's about me arriving here and just barking orders. It's about backing up someone like Jean de Villiers, who does a lot of the talking, and also (backline coach) Robbie Fleck who I have a good relationship with. \"In the past we had myself, Jean, Bryan Habana, Jaque Fourie and Dewaldt Duvenage all being able to contribute as experienced players - now it's myself, Jean and Gio Aplon who the younger guys are leaning on and we have a responsibility to help them where we can .\" Last weekend, against the Chiefs, I was actually a bit too frantic at times - probably because I was overly excited to be out there playing again! It's something I admitted when speaking to (coach) Allister Coetzee earlier this week. We must remain calm and it's up to us more experienced players to lead by example in that department. \"I think I will find my voice more as the season progresses, so for me game time will be key. I didn't play a lot in this recent stint in Japan, between my early-season injuries and (later on) with the two-foreigners-per-team rule, but I'm hungry to play more and to contribute on any level for the Stormers .\" <mark>Grant</mark> made his Super Rugby debut back in 2006 - against the (then) Cats - and he toured Australasia for the first time as a Stormers player later that season. The team won two from four on that tour (two wins in Australia and two defeats in New Zealand) and the experienced Stormers No 10 sees a lot of similarities between then and now. \"My first two tours as a Super Rugby player, 2006 and 2007, were tough for us as a team but I remember that the older players around us simply kept telling us younger guys to remain calm on the field, no matter what .\" We still have two games left on this tour and our aim is to pick up two wins, which would mean we could return home from a tough tour with another nine/ten points to go with our home win over the Hurricanes, which would be a huge boost ahead of seven home games between then and July. Great moments in Currie Cup history Steeped in history and tradition, the Currie Cup dates back to 1891 and is one of the oldest rugby competitions in the world. Rugby in our blood Read about Oscar Pistorius' first love and Joost van der Westhuizen's one love. Plus, true stories from Smit, Skinstad, Kallis, Holomisa, Schuster & more. More expert analysis and opinion from Sport24 Why the Sharks are razor sharp While New Zealand franchises have traditionally proved Super Rugby powerhouses - most recently...No need to get carried away Sometimes as a commentator your instincts take over, and you make a call based on what you think is...The rocket-launching option The strong performance that <mark>Frans Steyn</mark> turned in at flyhalf for the Sharks against the Lions at ...", "articleID": "2014031900_00021548_W", "names": {"Peter Grant": ["Q19882721", "Q20027846", "Q27486091", "Q3067879", "Q3376624", "Q7174337"]}}, {"date": "2014-03-20", "url": "http://www.theepochtimes.com/n3/573449-vladimir-putin-commentary-thanks-for-being-so-cool-about-everything-is-satire/", "content": "Justin Casquejo Photos: NJ Teen Climbed to Top of 1 World Trade Center Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds Jodi Arias Retrial: Sentencing Phase Set to Start Sept 8, Months Off Original Schedule Justin Casquejo Reaches Top of Freedom Tower, Eluding Guard Janet Lim Napoles Should Have to Pay For Her Stay in Jail, Senator Says Zaharie Ahmad Shah, Fariq <mark>Abdul Hamid</mark> Probe: Pilot Suicide a Taboo Topic in Previous Investigations Malaysia Airlines Conspiracy Theories: UFOs, Aliens, AWACS Hijacking; but Here's 7 Leading Ones on Missing Flight 370 Vladimir Putin Commentary \"Thanks For Being So Cool About Everything' is Satire Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds WhatsApp: Founder Jan Koum Says Your Data Won't be Sold Off After Facebook Deal Spring 2014: Vernal Equinox Facts, Daylight Hours, Change of Seasons Reign Season 2: CW Show Renewed as Season 1 Passes Midway Point The Walking Dead Spoilers: Beth Isn't Dead, Rick Isn't\" Safe,' Season 4 Finale is \"Savage' Once Upon a Time in Wonderland Season 2: Will ABC Show Be Canceled or Renewed? Vernal Equinox 2014 Day: Broom Stand, Balancing an Egg\" Planetary Alignment' are Myths Tech News Vladimir Putin Commentary \"Thanks For Being So Cool About Everything' is Satire Russia's President Vladimir Putin addresses the Federation Council in Moscow's Kremlin on Tuesday, March 18, 2014. President Vladimir Putin defended Russia's move to annex Crimea, saying that the rights of ethnic Russians have been abused by the Ukrainian government. He pointed at the example of Kosovo's independence bid supported by the West, and said that Crimea's secession from Ukraine repeated Ukraine's own secession from the Soviet Union in 1991. (AP Photo/Sergei Ilnitsky, pool) Ad Endorsing da Vinci Robot Violated U of Illinois Policies, Review Finds WhatsApp: Founder Jan Koum Says Your Data Won't be Sold Off After Facebook Deal World Star Hip Hop:\" Father Whoops on His 13-Year-Old Daughter' Goes Viral; Gone Too Far? An article from preeminent satire website The Onion has a fake editorial from Russian President Vladimir Putin, titled \"A number of people believed the article was a real editorial from Putin after it was published on The Onion on Thursday afternoon .\" It's certainly no easy task to forcefully annex an entire province against another country's will, so I just wanted to thank you-the government of the United States, the nations of western Europe, and really the entire world population as a whole-for being super cool about all of this, \"the fake opinion piece says .\" Seriously, you guys have been amazing. All of you. I really appreciate it. \"disclaimer, which reads:\" The Onion is a satirical weekly publication published 52 times a year on Thursdays. \"\"The Onion uses invented names in all its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental,\" it continues. The article seems to follow a similar theme explored by The Onion in previous fake opinion pieces by Syrian President Bashar al-Assad, which are titled \"Hi, In The Past 2 Years, You Have Allowed Me To Kill 70,000 People\" Bracketology 2014 Matrix: The Saddest NCAA Pool in America, and Other Bracket News The Walking Dead Season 4 Finale Spoilers: Who Dies, What Happens in Episodes 15, 16? Flappy Bird Game to Return to App Store? Creator <mark>Dong Nguyen</mark> Says Yes, But Not Soon", "articleID": "2014032105_00008534_W", "names": {"Abdul Hamid": ["Q3246667", "Q4665391", "Q46996242", "Q47118441", "Q938136"], "Dong Nguyen": ["Q15726354", "Q57421759"]}}, {"date": "2014-03-21", "url": "http://www.mitchellrepublic.com/content/no-12-ndsu-shocks-sooners", "content": "Tweet SPOKANE, Wash. - Trending on Twitter. Another No. 12 seed in the NCAA men's basketball tournament with upset hopes. North Dakota State pulled it off Thursday night. Freshman Carlin Dupree, in the game only because Bison star Taylor Braun fouled out, hit two free throws and a key basket in overtime and the Bison won an NCAA Division I men's basketball tournament game in the round of 64 for the Summit League for the first time since 1998. The 80-75 win over No. 5 seed Oklahoma in the West Region second round was stunning in its theatre. \"The atmosphere was 100 times greater than what I expected,\" Braun said. \"The intensity, everything about the game, was unbelievable. We stuck together as a team .\" Earlier in the day in this building, No. 12 seed Harvard knocked off No. 5 Cincinnati in an East Region game that had the local Spokane crowd generally rooting for the Crimson. They really got on the Bison bandwagon a few hours later. \"It was kind of cool to see the whole arena behind us,\" said center Marshall Bjorklund. \"It was pretty nuts .\" With Braun having fouled out in overtime, Dupree hit two free throws with 1 minute, 14 seconds left and NDSU led 74-72. His shot in traffic with 40 seconds left made it a four-point advantage. After another OU miss, Lawrence Alexander capped his monster 28-point night with two free throws for a 78-72 advantage with 32 seconds remaining. \"It was a tough game not to win,\" said Oklahoma head coach Lon Kruger. \"Credit North Dakota State. They did what they needed to do down the stretch. I thought our guys fought like crazy the last 25 minutes in regulation to get in position to win the game .\" The game was tight the entire way. The Bison led 61-57 when <mark>Cameron Clark</mark> went to work for Oklahoma. His 3-pointer with 2:03 remaining started eight straight OU points. Braun stopped it with two free throws with 32 seconds left to bring NDSU within 65-63. Isaiah Cousins made 1 of 2 free throws for OU, giving NDSU a chance. It cashed in. Alexander's 3-pointer with 11 seconds left ignited the arena crowd and tied it. The play, Alexander said, was drawn up to go to Braun. But the Bison senior instead got the assists to Alexander. \"Coming out of the huddle, I told him if you don't have anything, I'll be out there on the right wing,\" Alexander said. After the game, Braun said he could hear Alexander yell \"buckets\" before it went in. \"L.A. hit a game winner his freshman year at Oakland, and I've kind of always trusted him when it came down to it,\" Phillips said. OU had three shots to win it with Buddy Hield having the best look from the corner, but NDSU survived the flurry. \"It was upsetting to miss those three shots, but we were still pumped up to get to overtime,\" said OU forward Ryan Spangler. But NDSU hit 4 of 6 field goals in overtime and all six of its free throws. For the game, the Bison were 20 of 22.", "articleID": "2014032112_00054338_W", "names": {"Cameron Clark": ["Q17452418", "Q18637254", "Q5026208"]}}, {"date": "2014-03-23", "url": "http://historiccity.com/2014/staugustine/news/florida/editorial-free-nation-without-free-press-43639", "content": "MICHAEL GOLD Editorial: No free nation without a free press HISTORIC CITY NEWS St Augustine FL Historic City News readers who know me, are not surprised to learn that I have written a \"harsh\" article, probably half sarcastic and half tongue-in-cheek, about government transparency, fraud, waste and abuse in government, or elected officials who think they are privileged, or show a sense of entitlement above the people. But, if you are close enough to really know me, you know that although I may write jokingly about politicians or bureaucrats and their behavior, I really don't think it's a joke and I am a strong advocate for government and public integrity. One of my strongest issues is the right to a free press. I often write, and believe, that news should be free and freely available to readers. But, a free press, in the Constitutional sense from which I draw the expression, refers to the freedom of press reporters to gather news and freely publish it, as they see fit, un-edited by self-serving forces - especially the government. I was a little ticked this week, actually I was pissed off, after St Augustine City Manager <mark>John Regan</mark> told a Historic City News reader on facebook that I was trying to \"sucker\" her with a harmless news article, from third party sources, informing the public about a proposal to offer a trolley service between the Visitor Information Center and Riberia Pointe. Although the defamation of me and Historic City News, that occurred between the City Manager and the reader, was likely seen by hundreds of citizens, that wasn't what had upset me. It was the written comment he made to me, publicly, saying, \"I would appreciate you calling me to discuss before you write articles about the city .\" Of course, after the news broke on historiccity.com, it was picked up by other news reporters, including former mayor, George Gardner, but not the local newspaper - which did not surprise me, given the history of their reporting on local government. Perhaps I should infer from <mark>Regan</mark>'s remarks and the Record's past (non) reporting on local politics and government, that they check with him before they do \"write articles about the city\". Our readers may rest assured that Historic City News will always be the ones asking questions. We will never put publication of an article on hold merely because the reporter has not discussed the article with the City Manager, beforehand. I maintain a collegial relation with <mark>John Regan</mark>; I like his personality, I think he is well educated, and, I voiced my support for his appointment even before Bill Harriss retired. That hasn't changed.", "articleID": "2014032401_00008252_W", "names": {"John Regan": ["Q10470735", "Q58938074", "Q6066150", "Q6254507"]}}, {"date": "2014-03-25", "url": "http://www.witn.com/sports/headlines/Mr-Basketball-Luke-Kennard-Says-Hell-Attend-Duke-252083621.html", "content": "COLUMBUS, Ohio (AP) - <mark>Luke Kennard</mark>, the 27th annual winner of Ohio's AP Mr. Basketball award, has announced he'll play college ball at Duke. The 6-foot-6 junior averaged 41 points, 10.4 rebounds, 4.0 assists and 2 steals per game in the regular season for Franklin High School. His final five college choices - he said at the time \"in no particular order\" - were Duke, Ohio State, Kentucky, North Carolina and Michigan. <mark>Kennard</mark>, also an all-state quarterback in football, said last week that he was looking forward to announcing his choice so he could \"enjoy my next year and kind of get the pressure off .\" He is also has a grade-point average of 4.3 and is among the top students in his school. Copyright 2014 by The Associated Press. All Rights Reserved. Williams' Tar Heels Close Turmoil-Filled Season WITN 275 E. Arlington Blvd.. Greenville, NC 27858 252-439-7777", "articleID": "2014032508_00060075_W", "names": {"Luke Kennard": ["Q28935925", "Q6702089"]}}, {"date": "2014-03-27", "url": "http://www.people.com/people/article/0,,20800929,00.html?xid=rss-topheadlines", "content": "Nicole Richie's House of Harlow 1960 Debuts Clothing Line (PHOTOS) Still America's Sweetheart: Inside Our Girl Talk Gab Fest with Jennifer Aniston Lindsay Lohan is exercising her comedic chops with a guest-starring role on 2 Broke Girls, and PEOPLE has the first look. The actress, 27, plays Claire Guinness, a bride-to-be who asks Max (Kat Dennings) and Caroline (Beth Behrs) to make her wedding cake, then struggles with decisions throughout the process. \"Lindsay was fantastic. It was so much fun,\" Behrs told PEOPLE Wednesday at the Night at Sardi's event benefiting the Alzheimer??? s Association. \"I can't wait for everyone to see it. It's going to be a really funny episode!\" Lohan has also guest-starred on Eastbound & Down, Anger Management and Glee. Her documentary series <mark>Josh Charles</mark>: His Shocking Good Wife Exit", "articleID": "2014032804_00020537_W", "names": {"Josh Charles": ["Q472282", "Q6288750"]}}, {"date": "2014-03-28", "url": "http://www.thebull.com.au/articles/a/45046-qantas-ff-changes-anger-customers.html", "content": "Qantas has drawn the ire of frequent flyers by cutting the number of points passengers can earn on cheaper fares as part of an overhaul of its loyalty program. Hundreds of customers have taken to Twitter or Qantas's Facebook page to voice their anger over the changes, with many calling on the airline to rethink the move and threatening to take their business to other carriers. Under the new program, effective from July, customers will earn points based on their ticket class, rather than the distance they fly. Those on sale fares will receive fewer points than those booking flexible tickets. For instance, a customer flying from Australian to London on a discount economy fare, which includes sale tickets, will receive 6,200 points, while those travelling on a more expensive flexi-saver will receive 12,400 points. Meanwhile, the airline will cut its minimum points guarantee for members flying on economy and discount economy fares from 1,000 to 800, which applies to short-haul routes like Sydney to Melbourne. The airline will also reduce the number of status credits customers earn with partner airlines, which will make it harder for some to achieve the Silver, Gold, or Platinum level within the frequent flyer program. Qantas announced the changes in an email to its nine million frequent flyer members on Thursday night, branding it a simpler and fairer system that rewards customers on higher ticket classes. \"It's all about creating a fairer, more simplified program, designed to align the number of Qantas points and status credits you earn more closely with the fare you pay, where you fly and the airline you choose,\" it said in its letter to Frequent Flyer members. CMC Markets chief market strategist <mark>Michael McCarthy</mark> said the changes were not surprising in the wake of the airline's record $252 million half year loss. \"With Qantas under pressure on all fronts, it was very likely they'd take back some of the more generous aspects of the scheme,\" he said. Mr <mark>McCarthy</mark> said the move would help lift Qantas's profit margins, which would be a welcomed by investors hurt by the airline's loss-making strategy of increasing passenger capacity to protect its market share against Virgin. \"We expect to see more moves like this as Qantas looks to build its margins,\" he said. He said that while the move had upset many leisure travellers, it was unlikely to affect Qantas's standing in the important corporate travel market. Woodside misses Israeli gas deadline Woodside Petroleum is still in talks to secure a stake in the Leviathan gas field in Israel after missing the proposed deadline for a deal. Qantas FF changes anger customers Qantas customers have taken to social media to vent their anger at changes to the airline's frequent flyer program. $A pushes towards 93 US cents A stable interest rate outlook continues to drive the Australian dollar up towards 93 US cents. TheBull's free daily and weekly newsletters Click here to receive TheBull's free weekly newsletters on stocks, trading, investing and more", "articleID": "2014032809_00060879_W", "names": {"Michael Mccarthy": ["Q1933317", "Q20010903", "Q20642389", "Q3308368", "Q6832627", "Q6832630", "Q6832633"]}}, {"date": "2014-03-28", "url": "http://www.deseretnews.com/article/765650720/US-recognizes-Michigan-same-sex-couple-marriages.html", "content": "Innovative journalism of tomorrow still looking for funding today, study says Christian leaders defend \"Noah' in special featurette The secrets of building vs buying - 5 questions to ask yourself 5 ways to get ready for the spring golf season FILE - In this March 22, 2014 file photo Kat White, left, and Sue Walton hug after being married in a group ceremony by the Oakland County Clerk in Pontiac, Mich., after a federal judge has struck down Michigan's ban on gay marriage. Attorney General <mark>Eric Holder</mark> on Friday, March 28, 2014 extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. Attorney General <mark>Eric Holder</mark> on Friday extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. DETROIT - Attorney General <mark>Eric Holder</mark> on Friday extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. <mark>Holder</mark>'s action will enable the government to extend eligibility for federal benefits to the Michigan couples who married Saturday, which means they can file federal taxes jointly, get Social Security benefits for spouses and request legal immigration status for partners, among other benefits. The attorney general said the families should not be asked to endure uncertainty regarding their benefits while courts decide the issue of same-sex marriage in Michigan. <mark>Holder</mark> did the same thing in Utah, where more than 1,000 same-sex couples got married before the U.S. Supreme Court put those unions on hold in January after a federal judge overturned the conservative state's same-sex marriage ban in December. <mark>Holder</mark>'s decision came a week after U.S. District Judge Bernard Friedman struck down the gay marriage ban and two days after Michigan Gov. Rick Snyder called last weekend's marriages legal but said Michigan won't recognize them. Donna DeMarco and Lisa Ulrey were among the dozens of couples who married Saturday in Oakland County, northwest of Detroit. DeMarco's reaction to Friday's federal recognition:\" Cool. \"\"That's a major step,\" DeMarco said. \"The federal government is making great strides with recognizing same-sex marriage. It's time for Michigan to get out of its prehistoric age and get with the times. When you have a state government that's full of hate and straddles political lines and doesn't recognize that people are people, it affects a lot of people .\" DeMarco said she and Ulrey have not yet applied for joint Social Security benefits. \"I guess we can now,\" she said, adding that the couple will jointly file federal taxes next year. Oakland County was one of four that took the extraordinary step of granting licenses Saturday just hours before the 6th U.S. Circuit Court of Appeals in Cincinnati ordered a temporary halt. The stay was extended indefinitely Tuesday. Snyder, a Republican, acknowledged that same-sex couples \"had a legal marriage .\" But because of the court's stay, he added, the gay marriage ban has been restored. That closed the door, at least for now, to certain state benefits reserved solely for married couples. The American Civil Liberties Union has said more than 1,000 Michigan laws are tied to marriage. <mark>Bill Freeman</mark>, pastor of Harbor Unitarian Universalist Congregation church in western Michigan's Muskegon, responded to Friday's news with a loud \"Yeah!\" \"I think it's great. I think it's wonderful. I think it's glorious,\" he said. \"Even the governor of Michigan says the marriages are legal, but is not going to let them be enforceable in Michigan - and that's crazy .\" These guys ought to be able to get their Social Security cards and have the same benefits just like any other heterosexually married couple. \"<mark>Freeman</mark> officiated dozen of weddings Saturday after marriage licenses were issued by the Muskegon County clerk's office. Parenting from prison: The collateral damage of harsh mandatory sentences How raising kids within routines boosts social and emotional health", "articleID": "2014032900_00044580_W", "names": {"Bill Freeman": ["Q17466026", "Q4909052"], "Eric Holder": ["Q312644", "Q3591180"]}}]