[{"articleID": "2012062707_00097834_W", "names": {"William Patrick": ["Q47124147", "Q51216460", "Q8016631", "Q8016632"], "Mark Grant": ["Q5231419", "Q6767797"]}, "date": "2012-06-27", "url": "http://kirkintilloch-herald.co.uk/award-winning-author-is-staging-book-protest-at-library-1-2377402", "content": "published on wednesday 27 june 2012 08:24 write here, write now - concerned author is staging a personal protest outside a \"closed' library this week. campaigners are fighting to stop council plans to create a community hub within <mark>william patrick</mark> library in kirkintilloch. work is currently taking place at the library. the ground floor was closed for 12 weeks on june 3 and the books have been temporarily taken away. lenzie author theresa breslin, who is part of the campaign group, has raised concerns about the impact the hub plans will have on the library's children's section and youngsters during the summer holidays. she intends to give away 100 free signed copies of her books to primary pupils outside the library at 1.30 pm today (wednesday) - the first day of the school holidays - to raise awareness of her concerns and encourage reading amongst youngsters. theresa said:\" it's a protest - the building should not be closed during the school holidays. \"traditionally children would rush off to the library on the first day of the school holidays to get books, but the library is closed.\" reading is one of the great pleasures of the summer holidays and i just want to make sure the kids get books to read. \"library services for children are currently operating from the barony chambers while work is carried out on the hub. <mark>mark grant</mark>, general manager of east dunbartonshire leisure and culture trust, said:\" during the temporary closure children can continue to borrow books in kirkintilloch and develop their love of literature. \"as we have previously stated, we are fully committed to continuing the programme of children's activities within <mark>william patrick</mark> library in what will be a fantastic new resource for children and families in kirkintilloch when the new library and community hub opens at the end of august.\" that said, it is generous of mrs breslin to give out free books and i'm sure parents will be pleased to take them for their children. \"kirkyherald @ jnscotland.co.uk alternatively you can call the newsdesk 0141 775 0040, find us on temperature: 14 c to 18 c wind speed: 10 mph this website and its associated newspaper adheres to the press complaints commission's code of practice. if you have a complaint about editorial content which relates to inaccuracy or intrusion, then contact the editor by clicking here. if you remain dissatisfied with the response provided then you can contact the pcc by clicking here. kirkintilloch herald provides news, events and sport features from the kirkintilloch area. for the best up to date information relating to kirkintilloch and the surrounding areas visit us at temperature: 12 c to 19 c wind speed: 15 mph temperature: 11 c to 16 c wind speed: 17 mph temperature: 10 c to 15 c wind speed: 16 mph temperature: 10 c to 15 c wind speed: 13 mph"}, {"articleID": "2009111207_00138022_W", "names": {"Mike Rogers": ["Q1933467", "Q970515"]}, "date": "2009-11-12", "url": "http://metroweekly.com/gauge/commentary.php?ak=4638", "content": "gauge> commentary allies before animosity center field by richard j. rosendall the no on 1 campaign lost despite a strong effort because too many maine voters were persuaded that marriage equality would require teaching schoolchildren about gay sex. to overcome that, we need to be more aggressive and imaginative in combating the lies and illustrating the harm of discrimination. but improved messaging is not enough. turning the tables requires better cooperation with others, including minority populations demonized by the nativists on the right. mutual mistrust is one of the greatest barriers to coalition building. trust requires a relationship built over time. lacking that, we often simply tell people what they want to hear. but real families argue. the surest sign of fake multiculturalism is avoidance of any disagreement with members of other groups. strong alliances are tested, and require us to venture outside our comfort zones. in dealing with people of different backgrounds, you can't just talk about equality; you have to speak their language. activist leaders preparing for the next ballot fight can start by venturing outside their boardrooms. if you cannot engage dissenting voices within the lgbt community, you can hardly expect to reach more intractable voters. this point is evidently missed by human rights campaign president joe solmonese, who appeared willfully obtuse in a post-election message rejecting any \"if\" questions on how such a campaign might be run differently. he thus dismisses not just recrimination but the analysis and war-gaming essential to any effective campaign. to be fair, hrc doesn't run the statewide campaigns, and its support wins praise; but when we spend millions and still come up short, the post-mortems need to be opened up. as long as demonizing entire groups can lead to power and profit, unscrupulous people will keep doing it. right-wing blogger michelle malkin responded to the fort hood massacre by waving the red flag of group blame, reprising a 2003 piece on \"muslim soldiers with attitude.\" her message: the real culprits are multiculturalism, open borders, tolerance and diversity. in addition to the offensiveness of exploiting a tragedy, and the incongruity of a person of filipino ancestry talking as if america belongs to anglo saxons, malkin's attempt to scapegoat multiculturalism points to the right's long-term vulnerability. aside from most of america's mass killers having been white - theodore kaczynski, eric robert rudolph, timothy mcveigh - multiculturalism is not merely a philosophy but a fact of modern life. instead of seeking ways to promote mutual respect in a diverse society, the right stokes divisions by race, religion and sexual orientation for partisan gain. this cynical scavenging poses a greater threat to the social order than the demons conjured by the malkins of the right. when more moderate voters are disillusioned and stay home on election day, as appears to have happened in new jersey and virginia, they concede the race. unfortunately, an angry mob holds an advantage on motivation. maybe it's time to try something different to mobilize our base, and show some righteous indignation in defense of our lives and families. one minister of my acquaintance urges other clergy not to be distracted by the closet cases who all too often lead the anti-gay charge. the conflicted homosexuality of many anti-gay crusaders is an open secret, and those wise to it can dissuade others from enabling it without a public confrontation. but i would love to see someone like <mark>mike rogers</mark> of blogactive.com expose these ministers, whether we call their poison hypocrisy or something else. it is important that we aim our salvos accurately, as <mark>rogers</mark> has a record of doing. we cannot defeat right-wing recklessness with more recklessness. similarly, a \"damn them all\" attitude towards foot-dragging democrats can help elect even worse candidates. (for example, john aravosis has just launched an effort calling for a halt in donations to the democratic national committee, the obama campaign and organizing for america until enda is passed, and both \"don't ask, don't tell\" and doma are repealed .) in pressuring purported friends in office, we have more tools besides threats of withdrawal. to defeat right-wing wedge tactics, we must persuade prospective coalition partners of our mutual interests, which requires listening as well as talking. we should not allow setbacks to dishearten or unnerve us. time, as <mark>rogers</mark> observed last week, is on our side. there is not a single strategy, battlefield or organization for all of us to join. we have work to do in our legislatures and courts and families and communities - something to suit every person's talents and passions. if our campaigns have become too staid, we should try making them dance a bit more. but even dancing requires practice and discipline, if you want to do it well."}, {"articleID": "2016090723_00250915_W", "names": {"James Cameron": ["Q42574", "Q56928032", "Q6130910", "Q6130912"]}, "date": "2016-09-07", "url": "http://www.slashfilm.com/avatar-sequels-family-saga/", "content": "The \"Avatar' Sequels Will Be A Family Saga About Jake, Neytiri And Their Children Posted on Wednesday, September 7th, 2016 by Peter Sciretta We have four sequels coming over the next seven years, with the first movie hitting theaters in 2017. Writer/Director <mark>James Cameron</mark> has revealed new details about Avatar 2 and the other Avatar sequels. Find out the details, after the jump. Avatar In a new interview with Variety, Avatar series writer/director <mark>James Cameron</mark> reveals that the Avatar sequels will actually be a family saga:\" The storyline in the sequels really follows Jake and Neytiri and their children. It's more of a family saga about the struggle with the humans. \"We had heard earlier rumors (which we did not report) that suggested that Jake Sully (Sam Worthington) would marry Neytiri (Zoe Saldana) and become the new chief of the tribe and that the story would partly follow the struggle of the war with the humans which threatens to tear their family apart. It seems like those rumors might have been on the money with the Sully family being set-up to be the Skywalkers of the Avatar franchise. And is still scheduled to hit theaters in Christmas 2018, but <mark>Cameron</mark> warns that could change (again): Avatar 2\" We haven't moved that target yet, but we will if we need to. The important thing for me is not when the first one comes out but the cadence of the release pattern. I want them to be released as close together as possible. If it's an annual appointment to show up at Christmas, I want to make sure that we're able to fulfill on that promise. \"The new interview with <mark>Cameron</mark> it to promote Cirque du Soleil's stadium show that opened in Montreal in November of last year and is now touring North America. I have tickets to see the production when it comes to Los Angeles later this year. Toruk--The First Flight <mark>Cameron</mark> admits that while doesn't directly connect with the upcoming Avatar sequels, thematically the show\" manages to land very very closely to the feeling of where the sequel stories are going. \"He says that\" some of the costumes and hairstyles \"might\" create a resonance \"so that\" you actually see some of the things that you see in Toruk come into the design of the films, \"whatever that means. <mark>Cameron</mark> gave Cirque\" full rein to just riff on what they had seen in the Avatar world from the first film \"but he\" chimed in to make sure the project didn't steer too far afield from his central vision for the films,' giving the example: Toruk \"There's a tendency sometimes to go a little beyond the spiritual mysticism in the movie into actual magic. They can't have any actual magic, because it's not a universe that allows for true magic. But it definitely exists in a kind of a mystical, spiritual realm. The films do, and the show definitely does as well. It was that kind of creative conversation.\" This statement is interesting especially since the world of Pandora contains shamans. This gives us an idea of where the Avatar sequels won't be headed. Previously we have been told that all of the films will be stand-alone movies that continue the ongoing story of this world (in other words sequels that have a beginning middle and end). The story will have both bad and good humans, and bad and good Na' vi, and will give us a look at Pandora's other environments, most notably the world we have yet to see under the water. The films will feature many of the original cast reprising their roles, including Stephen Lang as Colonel Quaritch and Sigourney Weaver as Dr. Grace Augustine."}, {"articleID": "2017091221_00176994_W", "names": {"John Wall": ["Q14945536", "Q17400794", "Q337370", "Q47452330", "Q6262752", "Q6262757", "Q6262759"], "Jason Jordan": ["Q2649346", "Q3162955"]}, "date": "2017-09-12", "url": "http://usatodayhss.com/2017/zion-williamson-loved-recent-advice-from-nba-all-star-john-wall-washington-wizards", "content": "Long before <mark>John Wall</mark> was making Lil' Duval do frontward dives as a result of trying to guard him and long before he was making multiple NBA All-Star games, <mark>Wall</mark> was racking up millions of views on his high school highlight videos. That's why it's easy for him to relate to high school basketball's multi-million views man Zion Williamson. RELATED: <mark>John Wall</mark> mesmerized the competition in high school In a recent episode of his No Offseason documentary with BallIsLife.com, <mark>Wall</mark> said Williamson is \"probably one of the top two or three most athletic players I've ever seen in life, period.\" Makes sense for a guy whose highlight vids have made fans out of everyone from Shaq to Dez Bryant to Drake, who famously posted a pic of him wearing Williamson's Spartanburg Day (Spartanburg, S.C.) jersey on Instagram. Still, when a fellow athletic freak of nature like <mark>Wall</mark> takes notice it means even more. \"Coming from a guy like <mark>John</mark> (<mark>Wall</mark>), that's just a great honor,\" said Williamson, who is ranked No. 2 overall in the ESPN 100. \"People think that because I get a lot of attention that I don't get fazed by things like that, but I do. I'm still a fan of guys like <mark>John</mark> so that was exciting for me.\" NBA All-Star point guard <mark>John Wall</mark> had high praise for Zion Williamson. <mark>Wall</mark>, a former ALL-USA first teamer in 2009, went on to offer Williamson advice on how to maximize his time on the floor during his final high school season. \"I would tell him just to work on different things,\" <mark>Wall</mark> said. \"The game is so easy and boring at times for him you can tell; work on things that you're gonna need for the next level. That's how I played in high school. When the game got serious I played the way I wanted to play get what I wanted to get done, but, other than that, I was just trying stuff and trying to improve my game.\" Williamson conceded that <mark>Wall</mark>'s advice made \"a lot of sense,\" and said it was something he would \"definitely\" implement more going forward. \"I do try and work on things that will benefit me at the level I want to get to but I don't go overboard with it,\" said Williamson, who made the ALL-USA first team last season. \"I never want to be too extra. When the situation calls for it I definitely will try and work on things that I'll need to improve for the ultimate level. That's something that I'll keep in mind. I appreciate that advice. That helps me a lot.\" Follow <mark>Jason Jordan</mark> on Twitter: @ JayJayUSATODAY <p> Photo: Bart Boatwright, Greenville News </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p> <p> Photo: Jeff Blake, USA TODAY Sports Images </ p>"}, {"articleID": "2013061111_00047936_W", "names": {"Robert Williams": ["Q1193089", "Q17249329", "Q18917399", "Q1897911", "Q19595690", "Q21062888", "Q21165673", "Q2159205", "Q22019626", "Q24191102", "Q28151848", "Q33699032", "Q3436573", "Q42638026", "Q4470093", "Q45374718", "Q50391378", "Q55363277", "Q7341311", "Q7341617", "Q7345132", "Q7345678", "Q7349522", "Q7350633", "Q7351124", "Q7351126", "Q7351127", "Q7351130", "Q7351131", "Q7352629", "Q888323"]}, "date": "2013-06-11", "url": "http://inforum.com/event/article/id/402710/group/homepage/", "content": "E-mail Published June 10, 2013, 10:38 PM Yellowjackets have sights set on a chance to play at Target Field Perham baseball players celebrate after the Yellowjackets won the Minnesota Class 2A, Section 8 baseball tournament. <mark>Robert Williams</mark> / Forum News Service PERHAM, Minn. - Eric Brauch's father doesn't have any interest in watching the Twins play at Target Field, but if his son can make it to the Minnesota Class 2A state baseball championship game, he'll be the first in line to buy tickets. Brauch's stellar season at the plate and on the mound has led Perham to its first state tournament in nine years. Its last appearance was in 2004, when the Yellowjackets took third place. \"I was talking to my dad and he has never been to Target Field,\" Brauch said. \"He was just saying how cool it would be (for me) to get there and play. It would be crazy.\" Over the course of the season, Brauch has pitched 37 innings and given up 22 hits. He leads the team in strikeouts with 51, and has a 4-1 record. He also has a team-high 19 RBIs and has two of the team's four home runs. Catcher Cameron Mulcahy is second in RBIs with 14, but leads the team with 30 hits. Brauch is just one of three potential threats the Yellowjackets have on the mound. Mulcahy and Austin Erickson each hold 4-0 records and Josh Still is undefeated with one win. Erickson is second on the team in strikeouts with 34 and has one save. A struggling offense early on paved the way to an 11-5 regular-season record. But as the playoffs drew closer, the Yellowjackets found out their best was yet to come. \"If I had anything to complain about during the regular season, it is the lack of competitiveness and our lack of having fun,\" Perham head coach Hans Hanson said. \"We didn't see a whole lot of consistency, but we hit the playoffs playing our best baseball of the season.\" The only thing that we couldn't really do was pick up our bats. But ever since the playoffs, we've been hitting the ball really well. Hopefully we can continue it into the state tournament. \"The Yellowjackets won the Class 2A, Section 8 tourney with a 5-2 win over Roseau and finished fourth in the conference after a three-way tie for first. Perham will face Delano in the first round of the state tournament Thursday at 5:30 p.m. and from that moment on, Target Field will be fixated on Brauch's mind.\" We have our whole community rooting for us, so if we ended up getting to that final game, and ending up on top, I'd be speechless, \"Brauch said.\" There's nothing more I want to do my senior year than win this state title. \"UPDATE: Police say NDSU's Beck left man unconscious following fight outside Sports Bar UPDATE: Police say NDSU's Beck left man unconscious following fight outside Sports Bar Ex-Fargo investment broker Medhus pleads guilty to 16 felony charges in\" Ponzi' scheme"}, {"articleID": "2009042814_00093015_W", "names": {"Manoj Joshi": ["Q12445334", "Q58098812", "Q6751165"]}, "date": "2009-04-28", "url": "http://accidentalblogger.typepad.com/accidental_blogger/animal_world/", "content": "leiter reports philosophy, politics, current events, academia <mark>manoj joshi</mark>'s blog archival site of an indian journalist the huffington post politics, current events pharyngula science, politics, education, society amardeep singh literature, culture, south asian affairs abstract nonsense political, social and mathematical thoughts and commentary majikthise lindsay beyerstein: political and social commentary lester hunt philosophy, nature, social commentary legal history blog scholarship, news and new ideas in legal history trackback (0) december 23, 2008 season's greetings to our readers and my co-bloggers. hope everyone returns to a.b. refreshed and cheered after the holiday festivities are over and done with for the year. i am going on a short trip and won't be blogging for some time. unless someone else finds the time to post, the front page will remain static for a few days. i will leave you with a potpourri of unrelated but interesting links to muse over if you find time to visit during the holiday rush. trackback (0) september 08, 2008 taking a bit of a break from the faintly sinister and patently ludicrous political theater surrounding the us presidential campaign, i am happy to bring you news of a different kind. stories that lift our spirits very often describe the triumph of the utterly vulnerable - the miserable underdog beating incredible odds. in this particular case, the underdogs happen to be real dogs and this is the heartwarming story of their rescue from debauched cruelty and certain death. little over a year ago, we learnt about the criminal activities of ex-nfl star who was caught and later sentenced to jail for the brutal torture of several pit bulls that he used in illegal dog fighting. vick is currently in jail serving a sentence of 23 months (too lenient, in my opinion). but what about the abused dogs, some of whom were bred to be vicious killers and others as terrified bait animals? at the time of the court case, the conventional wisdom (including that of various animal welfare organizations) was that the dogs had been so severely abused that they were beyond rehabilitation and needed to be euthanized. but an animal rescue agency in utah thought otherwise. volunteers from best friends pleaded with the court for a chance to return vick's dogs to normalcy through patient and humane care. luckily for the dogs, the judge agreed to give the animals a second chance after the hell hole to which vick and his cronies had condemned them from puppyhood. the tragic story now has a happy ending. read about the loving rehabilitation and amazing transformation of the dogs on the: (i have added best friends to the list of animal charities i plan to support regularly) national geographic filmed the progress of the vicious, suspicious or coweringly nervous dogs to trusting, playful animals some of whom have already been adopted by dog lovers. the documentary aired on september 5 on the ng channel in their series dog town. (unfortunately i missed the full documentary but saw a few incredibly touching and gratifying scenes from the film on a news show. i hope to watch the episode on september 12 when it will air again .) more about dog town and the best friends animal society in the l.a. times. it has been a summer of awe-inspiring, thought-provoking spectacle on television. first the summer olympics, then the democratic and republican national conventions and now the return of \"dogtown.\" if that sounds sarcastic or snarky, it isn't meant to. the two-hour season premiere of the popular is titled \"saving the michael vick dogs,\" and if there were such a thing as an olympics for animal rescue and rehabilitation, this would be it. last december, the atlanta falcons' star quarterback michael vick was sentenced to 23 months in prison for operating an illegal dog fighting venture on his virginia property. forty-seven pit bulls in various states of physical and psychological damage were found at vick's bad newz kennels; eight more corpses were discovered buried nearby. it has been a summer of awe-inspiring, thought-provoking spectacle on television. first the summer olympics, then the democratic and republican national conventions and now the return of \"dogtown.\" if that sounds sarcastic or snarky, it isn't meant to. the two-hour season premiere of the popular is titled \"saving the michael vick dogs,\" and if there were such a thing as an olympics for animal rescue and rehabilitation, this would be it. last december, the atlanta falcons' star quarterback michael vick was sentenced to 23 months in prison for operating an illegal dog fighting venture on his virginia property. forty-seven pit bulls in various states of physical and psychological damage were found at vick's bad newz kennels; eight more corpses were discovered buried nearby. at the time, many animal rescue experts recommended that the dogs be put down; so traumatic had the abuse been, so long had been their imprisonment that rehabilitation seemed impossible. others, including the veterinarians and trainers at utah's best friends animal society, argued that the dogs could be saved. a judge finally agreed, and more than half were turned over to various shelters and rescues; the 22 most troubled dogs were sent to dogtown. located on 3,000 acres of canyon country in southern utah, the best friends sanctuary is one of the largest and no doubt the most beautifully located no-kill animal facilities; dogtown is its canine program. for the past two years, \"dogtown\" the show has chronicled the staff as it healed and trained various ill, hurt, abused, abandoned and behavior-issue-plagued dogs. in other words, it's a hard-core dog-lovers kind of show. trackback (0) september 02, 2008 although the tabloid-style argument over the family shenanigans of the palins has brought mccain's vp pick into sharp focus, there's another side to the much-vaunted abilities of gov. palin that you may not know of yet. this is who mccain has nominated for vp: \"on march 27, the state house passed house bill 256, gov. sarah palin's bill, which allows for no science-based, same-day airborne hunting of wolves and bears and opens the doors to game-farming in alaska. it also allows the lieutenant governor to remove alaska's ballot measure to vote again on aerial hunting, thus taking alaskans' right to vote away.\" this is what airborne hunting of wolves looks like: one of the saddest things i've seen, akin to the cow mistreatment videos that we as the companion of a geriatric cat, i am acutely conscious of the changes in nutritional, psychological and medical care that must be afforded to aging animals. with advancements in veterinary science and safer environments, just as domestic pets in affluent nations are experiencing unprecedented increase in their longevity, so are the inmates of modern, better designed zoos. as a result, zoo animals sometimes survive much longer than they might in their natural habitats. offer up new challenges to their care takers who must learn to adapt to the changing and sometimes unexpected needs of their aging wards. even as a youngster, rollie looked older and wiser than his years. his white mustache sprouted longer by the month, until it flamed from his cheeks like a german kaiser's. in the past few years, though, the tribulations of age - not just the appearance of it - have begun catching up with rollie. his keepers are reminded each time they get a look past the emperor tamarin's flowing whiskers and into his jaws. the monkey, used to crunching on raw sweet potato, has surrendered all but six of his 32 teeth to the toll of time. at 17, rollie - a resident of chicago's lincoln park zoo - is a senior citizen of his species. in the amazon he almost certainly would never have made it this long. in captivity, he's got plenty of company. the golden years have arrived at the nation's zoos and aquariums, taking veterinarians and keepers, along with their animals, into a zone of unknowns. do female gorillas, living in to their 40s and 50s, experience menopause? how do you weigh the most difficult choice - between prolonging pain and ending life - when the patient is a venerable jaguar who feels like a member of the family? all those questions hang on a larger one that, until recent years, has been left to educated guesswork. \"how old do animals really live?\" says sharon dewar, a spokeswoman for the lincoln park zoo, whose keepers adjusted to rollie's toothlessness by serving him soft-cooked veggies. \"that's the million-dollar question.\" about a japanese train company which turned its fortune around by appointing a cat as the station master, my co-blogger dean informed me that us libraries have for long known the advantages of employing feline friends to add pizazz to their premises. the memorial day weekend at the paul household was tv and internet free. early saturday morning our cable service went out of commission and so did the two amenities dependent on it. our cable provider comcast blithely informed us that no technician could come out to restore connection any earlier than next friday, the 30th of may. my extremely internet dependent husband took matters in his own hands. after hours on the phone setting up service with new providers and firing comcast, he managed to get everything up and running by monday afternoon .--characterize the climate of mars--characterize the geology of mars washington (ap)--the international space station's lone toilet is broken, leaving the crew with almost nowhere to go. so nasa may order an in-orbit plumbing service call when space shuttle discovery visits next week. until then, the three-man crew will have to make do with a jury-rigged system when they need to urinate. while one of the crew was using the russian-made toilet last week, the toilet motor fan stopped working, according to nasa. since then, the liquid waste gathering part of the toilet has been working on-and-off. fortunately, the solid waste collecting part is functioning normally. russian officials don't know the cause of the problem, and the crew has been unable to fix it. the crew has used the toilet on the soyuz return capsule, but it has a limited capacity. they now are using a backup bag-like collection system that can be connected to the broken toilet, according to nasa public affairs officials. \"like any home anywhere, the importance of having a working bathroom is obvious,\" nasa spokesman allard beutel said. a financially beleaguered japanese train company has managed to turn its profits ledger from red to black by appointing a cat as the tokyo (ap)--a money-losing japanese train company has found the purr-fect pet mascot to draw crowds and bring back business - tabby tama. all the 9-year-old female cat does is sit by the entrance of kishi station in western japan, wearing a black uniform cap and posing for photos for the tourists who are now flocking in droves from across the nation. tama has been doing such a good job of raising revenue for the troubled kishikawa train line that she was recently promoted to \"super-station-master.\" \"she never complains, even though passengers touch her all over the place. she is an amazing cat. she has patience and charisma,\" wakayama electric railway co. spokeswoman yoshiko yamaki told the associated press monday. \"she is the perfect station master.\" appointing a cat to turn around fortunes makes cultural sense in japan, where cats are considered good luck and are believed to bring in business. she wrote at her blog. responding to an internet game of tag among bloggers, she revealed a few hitherto unknown (to me) talents and proclivities. the two that caught my eye particularly are: 3. languages known: english (best of all), tamil (really well, but unfortunately i never did learn any swear words in it, even though it's my mother tongue), hindi (enough to sing along with bollywood songs and understand the dialog), malayalam (enough to pass for a tamilian speaking malayalam badly), sanskrit (enough to be dangerous trying to figure out when the priest at the local temple has bumbled in his rendition), french (parisien accent, rolled \"rr's and all ...) plus, i can read cyrillic and urdu scripts, though i am rather rusty with the lack of practice. i'm aiming to learn telugu, bengali, arabic and chinese as well, if i can get hold of enough online material. 8. i love creepy-crawlies and spend an inordinate amount of time trying to save spiders, centipedes and the like from the attacks of the\" bug squad' (m & s armed with fly-swatters and bug vacuums). i knew that sujatha knows several languages well. but that she can read cyrillic and urdu scripts came as a complete surprise to me and i am properly impressed. the second revelation impressed me even more - her love for creepy-crawlies and the time she spends trying to save them. i am wondering if sujatha ever goes as far as by a mad poet - all of them apt! my favorites: 19. for having consider'd god and himself he will consider his neighbour. 42. for he is a mixture of gravity and waggery. 70. for, tho he cannot fly, he is an excellent clamberer. the scene of this chronicle is the town of dawson's landing, on the missouri side of the mississippi, half a day's journey, per steamboat, below st. louis. in 1830 it was a snug collection of modest one - and two - story frame dwellings, whose whitewashed exteriors were almost concealed from sight by climbing tangles of rose vines, honeysuckles, and morning glories. each of these pretty homes had a garden in front fenced with white palings and opulently stocked with hollyhocks, marigolds, touch-me-nots, prince's - feathers, and other old-fashioned flowers; while on the windowsills of the houses stood wooden boxes containing moss rose plants and terra-cotta pots in which grew a breed of geranium whose spread of intensely red blossoms accented the prevailing pink tint of the rose-clad house-front like an explosion of flame. when there was room on the ledge outside of the pots and boxes for a cat, the cat was there--in sunny weather--stretched at full length, asleep and blissful, with her furry belly to the sun and a paw curved over her nose. then that house was complete, and its contentment and peace were made manifest to the world by this symbol, whose testimony is infallible. recall of 143 million pounds of beef, one of the largest in u.s. history was made recently, affecting thousands of school districts supplied by a california plant under the national school lunch program. this stemmed from an undercover investigation of practices at the plant, complete with a disturbing video shot of animals being forced into the chutes, even when they were sick and unable to walk in. wrangler isn't an ordinary slaughterhouse worker. he is an undercover investigator for the humane society of the united states, who got a job at the westland plant and filmed the abuses with a hidden camera. \"there wasn't a formal strategy or anything like that,\" he says. \"you're there just doing the job, and this stuff is just happening all around you.\" on jan. 30, the humane society broadcast excerpts of the video on its web site. the next day, the united stated department of agriculture suspended westland meat co. as a supplier to the national school lunch program. a few days later, usda pulled its inspectors from the plant and shut down the plant, pending further investigation. the acts of animal cruelty have led to the arrest of two meatpacking workers by chino police. more than two weeks after wrangler's video caused a sensation online, the usda issued the largest beef recall in the history of the united states: 143 million pounds of beef products, most of which has already been consumed. about 40 percent of that meat went to the national school lunch program and other federal nutrition programs. amazingly, all of the abuses occurred with usda inspectors on the premises. secretary of agriculture ed schafer said he was \"dismayed at the inhumane handling of cattle\" at the plant. the school district my children attend was among the many listed as having received the recalled meat cases, and while the authorities assure us that the recalled meat has been off the lunch menus since the start of february, there are still anecdotes of some kid or the other having stomach problems after eating meat at lunch. who knows whether the un-recalled products are any safer or more humanely harvested than the recalled batch? we will probably never find out. temple grandin, who is autistic, brought fascinating insights into the behavior of animals, as \"autistic savants' of sorts. she is also an industry expert on the design of humane slaughter house facilities, and is even invoked in a feb 3, 2008 westland letter promising more investigation into the cattle abuse: during 2007, we had 17 third party audits of our operation to confirm that we meet the statutorily mandated humane handling and food safety standards. in addition we have conducted 12 internal audits by our own personnel to ensure that such standards are met. we also, conduct weekly humane handling audits based on standards set forth in the american meat institute's (ami), recommended animal handling guidelines and audit guide 2007 edition, which was authored by dr. temple grandin, a world renowned expert of humane handling practices. complete documentation of this activity has been made available to the usda investigation team currently at our plant. what problems have been rectified by the recall of meat that have been largely consumed by now? will it really save unwary consumers from eating problem meat? it seems more like a case of bolting the stables after the horses have run away, similar to the above is an excerpt from pablo neruda's poem trackback (0) february 02, 2008 he who dislikes the cat, was in his former life, a rat. dying--you wouldn't do that to a cat. for what is a cat to do in an empty apartment? climb up the walls? brush up against the furniture? nothing here seems changed, and yet something has changed. nothing has been moved, and yet there's more room. and in the evenings the lamp is not on. one hears footsteps on the stairs, debate in south carolina had more than its share of fireworks. senators hillary clinton and barack obama went at each other with passion and fury. the bitter exchange continued beyond the debate stage when both candidates addressed reporters to harp on the weaknesses and dirty tactics of their main rival. yesterday morning sujatha and i had a short e-mail exchange about a new york times article on politics in the hillary) challenging the newcomer (obama) to the group, while edwards was like a side-lined silverback, trying to recapture the attention of the audience in between the slugfest between obama and clinton. we're not that far off from our proto-monkey ancestors!\" i agree. but both of us forgot the other when the memory of a beloved and very loving pet's death was painfully fresh in my mind. the article was linked to a newsweek essay by jonathan cooperman who had just gone through the wrenching experience of putting his playful doberman to sleep. i argued that those of us who love our animal companions deeply, relate to them at some level as persons. in doing so, we unashamedly accord them the dignity and worth that we normally reserve for our human family members. while some find the notion bewildering and even preposterous, others like me, find nothing unusual about the sentiment. 3 quarks daily, recently went through the ordeal of dealing with the near fatal sickness of his much loved cat, freddy. he was distraught and disconsolate and was surprised by the depth of his own sorrow. in a heartfelt article, abbas examines his emotions and his deep attachment to his feline companion. he concludes that freddy had long ago ceased being a \"cat\" in his mind and had been transformed into a very interesting and endearing \"person\" whose company is now an essential source of joy for him. there are two kinds of people: there are the kooky kind who will spend $4,000 on dialysis for their cat whose kidneys are failing (substitute some significant expenditure of resources for individuals in differing financial circumstances - you know what i mean), even if only to extend its life briefly; and then there are the kind who will make fun of the former (or even regard them with moral disapproval - that money could have been used for better purposes, etcetera). recent events surprised me by showing that i belong in the first category. and now that i know i belong there, i am going to attempt an explanation or at least hazard a conjecture, a speculation, a plain guess, at what puts some people there. i have thought a bit about my own reactions which, as i mentioned above, surprised and even embarrassed me ....here's what i think: while you can have various degrees of affection for pets, there is a quantum leap that you can make (and this is a rubicon that cannot be uncrossed): if in your own psychological representation of your pet, you habitually grant them personhood, then there is no choice but to treat them as you would a person because different parts of your mind which specialize in generating the emotions which allow you to interact with (and love) other humans come into play, and these are irresistible impulses. you might as well try to not care about your children. i believe that some animals, like cats and dogs, have through their long histories of living in people's homes as pets (more than 10,000 years in the case of cats), been naturally selected to encourage human empathy. imagine what a survival advantage it is to the household cat that its young behave in such ways and make such tiny, vulnerable (to the human ear) sounds that it takes a particularly monstrous human to harm a kitten. similarly, they have, i think \"learned\" (even if they do not have the equivalent emotion--after all, just as i don't know two animal posts in a row - no it's not going to be a pattern. having written a story yesterday about cruelty to animals, i hope to cheer things up a bit with a heart warming and curious tale of peaceful animal-human co-existence. \"books. cats. life is sweet.\" the following story may well inspire t-shirts and other parphernelia with the logo, \"family. friends. purring cat. death is peaceful.\" ..... in a nursing home for the elderly in providence, rhode island, lives oscar, a two year old cat adopted by the staff who literally \"sniffs\" out death. oscar unerringly picks out patients who are about to die - very soon. he gets in the bed with them and waits until they are gone - purring all the while. his record is so impressive that doctors and the medical staff at the steere house nursing and rehabilitation center have begun to depend on oscar to alert them to the impending deaths of patients, so they can notify family and loved ones. when families cannot make it to the bedside in time, oscar also provides companionship to those who would otherwise have died alone. oscar's amazing ability prompted dr. david dosa, geriatrician at rhode island hospital and an assistant professor of medicine at the warren alpert medical school of brown university, to dedicate an essay to him in the current issue of the. (the nejm link is subscription only. i am copying most of the essay below). oscar the cat awakens from his nap, opening a single eye to survey his kingdom. from atop the desk in the doctor's charting area, the cat peers down the two wings of the nursing home's advanced dementia unit. all quiet on the western and eastern fronts. slowly, he rises and extravagantly stretches his 2-year-old frame, first backward and then forward. he sits up and considers he takes a few moments to drink from his water bowl and grab a quick bite. satisfied, he enjoys another stretch and sets out on his rounds. oscar decides to head down the west wing first, along the way sidestepping mr. s., who is slumped over on a couch in the hallway. with lips slightly pursed, he snores peacefully - perhaps blissfully unaware of where he is now living. oscar continues down the hallway until he reaches its end and room 310. the door is closed, so oscar sits and waits. he has important business here. twenty-five minutes later, the door finally opens, and out walks a nurse's aide carrying dirty linens. \"hello, oscar,\" she says. \"are you going inside?\" oscar lets her pass, then makes his way into the room, where there are two people. lying in a corner bed and facing the wall, mrs. t. is asleep in a fetal position. her body is thin and wasted from the breast cancer that has been eating away at her organs. she is mildly jaundiced and has not spoken in several days. sitting next to her is her daughter, who glances up from her novel to warmly greet the visitor. \"hello, oscar takes no notice of the woman and leaps up onto the bed. he surveys mrs. t. she is clearly in the terminal phase of illness, and her breathing is labored. oscar's examination is interrupted by a nurse, who walks in to ask the daughter whether mrs. t. is uncomfortable and needs more morphine. the daughter shakes her head, and the nurse retreats. oscar returns to his work. he sniffs the air, gives mrs. t. one final look, then jumps"}, {"articleID": "2008092514_00025880_W", "names": {"Erik Solheim": ["Q1354155", "Q17107965"]}, "date": "2008-09-25", "url": "http://canadianbusiness.com/markets/market_news/article.jsp?content=D93DPH001", "content": "backing new un forest program, leaders wary of obstacles to climate treaty in 2009 backing new un forest program, leaders wary of obstacles to climate treaty in 2009 john heilprin september 25, 2008 - 09:52 a.m. united nations (ap) - leaders from poland, norway, denmark and indonesia on wednesday pressed for a global climate treaty to replace the kyoto protocol next year but said prospects were extremely unfavorable. some said replacing the 1997 global warming accord depends largely on the united states dropping its opposition to participating, and whether wealthy and poorer nations can bridge their differences over technology-sharing and cutting emissions. the u.s. rejected the kyoto protocol, arguing it would harm american business and didn't require similar cuts by china, india and other emerging economies. but those developing countries have refused to accept a binding arrangement that would limit their development. \"without the united states, we can never succeed,\" said norwegian environment minister <mark>erik solheim</mark>. \"if the americans are not moving, anyone else who does not want to move will hide behind the americans.\" the new accord is expected to aim for global cuts of 50 percent by 2050, below the 1990 levels of carbon emissions. \"there is very little progress and there is reason to be concerned about the progress of the negotiations aiming at reaching an agreement in 2009,\" norwegian prime minister jens stoltenberg said at one of several climate-related gatherings wednesday held on the sidelines of the u.n. general assembly's annual ministerial session. \"the main reason why there is too little progress is distrust, is the lack of confidence between the rich world and the developing world,\" he said. \"and that's because the rich world promised in kyoto, in 1997, to transfer knowledge, capital to assist the developing world with creating sustainable development. that hasn't happened - at least to a very limited amount or scale.\" that's also why, he said, norway agreed to donate $35 million in startup money for a new u.n. program announced wednesday aimed at curbing deforestation. the program will pay for more monitoring and verification of tropical rainforests, as part of an effort to persuade rich nations to reward developing countries for conserving and expanding their remaining forest cover. chopping down trees contributes to climate warming by eliminating plant material that absorbs carbon dioxide, and by releasing the dead wood into the atmosphere as more carbon. by helping reverse the rapid pace of deforestation in the tropics, proponents envision the possibility of cutting greenhouse gas emission globally by up to 20 percent."}, {"articleID": "2017030409_00878426_W", "names": {"Ross Taylor": ["Q19325418", "Q26820844", "Q7369657", "Q7369663"], "David Miller": ["Q1175688", "Q12899557", "Q15455696", "Q16185473", "Q19875639", "Q20656547", "Q28870727", "Q3018511", "Q30607124", "Q404333", "Q404779", "Q5237563", "Q5237568", "Q5237569", "Q5237573", "Q5237574", "Q5237576", "Q55196713", "Q56458216", "Q57729525", "Q57832355", "Q6828449", "Q92986"]}, "date": "2017-03-04", "url": "http://www.aol.co.uk/living/2017/03/04/williamson-demands-improvements-from-misfiring-black-caps/", "content": "Williamson demands improvements from misfiring Black Caps By Omnisport 4 Mar 2017, 9:45 - New Zealand must improve with the bat if they are to be competitive in one-day cricket, said Kane Williamson after their six-wicket defeat to South Africa on Saturday. The Proteas wrapped up the ODI series 3-2 in Auckland with a comfortable victory after winning the toss and bowling the hosts out for 149 - Kagiso Rabada the pick of the bowlers with 3-25. Only four batsmen got themselves into double figures for the Black Caps, and key men Martin Guptill (4), <mark>Ross Taylor</mark> (8) and Williamson (9) all failed to deliver. A 150-run target was never enough to put South Africa under pressure. Even the loss of early wickets could not hinder their progress, as Faf du Plessis and <mark>David Miller</mark> eased them home. Williamson acknowledged New Zealand's batsmen had not fired, and that it is something that they must work on ahead of the Champions Trophy in June. \"We were out played today. They were very good with the ball and gave us nothing.\" - Kane Williamson #NZvSA ^ WN pic.twitter.com/XC9PuEmjSe"}, {"articleID": "2013081222_00018306_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}, "date": "2013-08-12", "url": "http://wboc.com/story/23110524/qa-on-anti-gay-legislation-in-russia", "content": "meta itemprop = \"datePublished\" content = \"2013-08-12 13:41:57\" > US judge says NYPD stop-frisk violates rights US judge says NYPD stop-frisk violates rights A federal judge appointed an independent monitor Monday to oversee changes to the New York Police Department's contentious policy known as stop, question and frisk, a significant judicial rebuke for what the...The New York Police Department deliberately violated the civil rights of tens of thousands of New Yorkers with its contentious stop-and-frisk policy, and an independent monitor is needed to oversee major changes, a federal...meta itemprop = \"datePublished\" content = \"2013-08-12 12:01:55\" > Most NY voters embarrassed by Weiner, Spitzer Most NY voters embarrassed by Weiner, Spitzer Even most New Yorkers watching Anthony Weiner (WEE' - nur) and Eliot Spitzer in political races dominated by sex scandals want to forget about them. New York voters, despite their tradition of rooting for comebacks and supporting eccentric candidates, have had it with Anthony Weiner and Eliot Spitzer and their sex scandals. meta itemprop = \"datePublished\" content = \"2013-08-12 06:31:42\" > Bulger jury begins 5th day of deliberations Bulger jury begins 5th day of deliberations meta itemprop = \"datePublished\" content = \"2013-08-12 14:22:05\" > NH AG: No metal detector used before YWCA shooting NH AG: No metal detector used before YWCA shooting New Hampshire's attorney general says a YWCA where a father shot his 9-year-old son to death during a supervised weekend visit had used a metal detector on the man in the past but did not use it Sunday. Usher to keep custody of his 2 young sons Usher to keep custody of 2 young sons; ex-wife asked for them after Atlanta pool accident FCC votes to cap, slash prison phone rates FCC votes 2-1 on decade-old petition to limit charges for inmate phone calls Wildfire spreads, threatening hundreds of homes Southern California wildfire growing amid hot, dry conditions, threatening hundreds of homes Minn. dad claims third of $448M Powerball jackpot Minn. dad claims third of $448M Powerball jackpot; 2 other winning tickets sold in NJ Associated Press MOSCOW (AP) - The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public expression of support for nontraditional relationships. Russian lawmakers say the law doesn't outlaw homosexuality but merely discourages discussion of it among people younger than 18. However, the law has outraged Russian liberals and some sectors of the international community just six months before the start of the Winter Olympic Games in the Russian city of Sochi. WHAT IS PROPAGANDA? The definition of \"propaganda\" is vague and hinges on intent. Anyone who distributes information with the \"intention\" of persuading minors that nontraditional sexual relationships are \"attractive\" or \"interesting,\" or even \"socially equivalent to traditional relationships\" could be accused of breaking the law. The law does not outlaw gay sex, which was legalized in Russia in 1993. It does not explicitly ban participation in gay pride parades or promotion of LGBT equality online, but anyone wearing a rainbow flag on the street or writing about gay relationships on Facebook, for instance, could be accused of propagandizing. WHAT ARE \"NONTRADITIONAL RELATIONS\" ? They are not defined by law. However, in an interview with the channel REN-TV, Yelena Mizulina, one of the bill's authors, said there were four kinds: \"men with men, women with women, bisexuality and being transgender.\" WHAT ARE THE PENALTIES FOR VIOLATING THE LAW? The law sets fines of up to 5,000 rubles ($150) for individuals and 1 million rubles ($30,000) for organizations convicted of violating the law. Punishments are more severe for propaganda on the web or in the media - up to 100,000 rubles ($3,000) for individuals and up to 1 million rubles for organizations. Foreign citizens are subject to fines of up to 100,000 rubles, up to 15 days in prison, and deportation and denial of reentry into Russia. HAS THE LAW BEEN ENFORCED? No one has yet gone to court under the federal law. Six LGBT activists were detained after one of unfurled a banner reading \"Being gay is normal\" near a children's library in Moscow, but so far the participants have not been brought to trial. Four Dutch citizens working on a documentary film about gay rights in the northern Russian town of Murmansk were the first foreigners to be detained under the new law. They were fined and forced to leave the country, but weren't put on trial. There have been six cases in which individuals have been tried for \"propaganda\" under regional legislation. HOW WILL THE LAW IMPACT LGBT RIGHTS? While most activists believe that the law will not be widely enforced, it effectively gives any local government a carte blanche to ban gay pride events and will discourage people from discussing LGBT rights publicly and online. HOW HAVE RUSSIANS REACTED TO THE LAW? While the legislation outraged Russian liberals and activists, a poll by the independent Levada Center in Russia found that 73 percent of respondents supported any government efforts to curb homosexual propaganda. Four out of five Russians say that they do not have a single LGBT acquaintance. HOW HAS THE REST OF THE WORLD REACTED TO THE LAW? The law sparked a boycott of Russian vodka in gay bars across North America and vodka dumps in front of Russian embassies and consulates. There have been scattered calls for a boycott of the 2014 Winter Olympics in the Russian city of Sochi, but no country or athlete has yet declined to attend. Most officials, including President Barack Obama, have called a boycott unnecessary. WHAT ABOUT THE OLYMPICS? That's unclear. Russian Sports Minister Vitaly Mutko said foreign athletes would be expected \"to respect the laws of the country,\" but some lawmakers and the Russian Olympic Committee said the law would be suspended during the Games. Last week the International Olympic Committee called for Russia to clarify its stance. The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public...The law on \"propaganda of nontraditional sexual relations among minors\" was signed into law by President Vladimir Putin on July 29. Originally titled the law on \"homosexual propaganda,\" the bill criminalizes public...meta itemprop = \"datePublished\" content = \"2013-08-12 14:42:08\" > Nigeria: Flood destroys homes in northern Kano Nigeria: Flood destroys homes in northern Kano Officials say floods from heavy rains destroyed up to 400 homes in Nigeria's biggest northern city of Kano. Officials say floods from heavy rains destroyed up to 400 homes in Nigeria's biggest northern city of Kano. meta itemprop = \"datePublished\" content = \"2013-08-12 10:31:53\" > Hard-liners challenge Iran's proposed Cabinet Hard-liners challenge Iran's proposed Cabinet Hard-line Iranian lawmakers have challenged the new president's proposed Cabinet makeup, accusing him of nominating pro-Western figures and opposition supporters to ministerial posts. Hard-line parliamentarians challenged Monday the Cabinet proposed by Iran's new president, accusing him of nominating ministers who are friendly to the West or who back \"sedition\" against the country's clerically...meta itemprop = \"datePublished\" content = \"2013-08-12 07:22:04\" > <mark>Kerry</mark> trip to Brazil, Colombia could be chilly U.S. Secretary of State <mark>John Kerry</mark>'s attempts to build warmer relations with two American allies in Latin America could be complicated by reports that a U.S. spy program widely targeted data in emails and ..."}, {"articleID": "2019021311_00116955_W", "names": {"Pablo Martinez": ["Q1757794", "Q19896089", "Q7121684"], "Michael Peterson": ["Q15492344", "Q1927978", "Q6833500", "Q6833502", "Q6833503", "Q6833504"]}, "date": "2019-02-12", "url": "http://www.nbcconnecticut.com/news/politics/National-Debt-505741901.html", "content": "National Debt Hits New Milestone, Topping $22 Trillion \"Our growing national debt matters because it threatens the economic future of every American\" By Martin Crutsinger Published Feb 12, 2019 at 6:09 PM | Updated at 9:07 PM EST on Feb 12, 2019 NEWSLETTERS Receive the latest politics updates in your inbox Email Privacy policy | More Newsletters <mark>Pablo Martinez</mark> Monsivais/AP This June 8, 2017, file photo shows the U.S. Treasury Department building in Washington. The national debt has passed a new milestone, topping $22 trillion for the first time. The Treasury Department's daily statement shows that total outstanding public debt stands at $22.01 trillion. It stood at $19.95 trillion when President Donald Trump took office on Jan. 20, 2017. The national debt has passed a new milestone, topping $22 trillion for the first time. The Treasury Department's daily statement showed Tuesday that total outstanding public debt stands at $22.01 trillion. It stood at $19.95 trillion when President Donald Trump took office on Jan. 20, 2017. The debt figure has been accelerating since the passage of Trump's $1.5 trillion tax cut in December 2017 and action by Congress last year to increase spending on domestic and military programs. The national debt is the total of the annual budget deficits. The Congressional Budget Office projects that this year's deficit will be $897 billion--a 15.1 percent increase over last year's imbalance of $779 billion. In the coming years, the CBO forecasts that the deficit will keep rising, top $1 trillion annually beginning in 2022 and never drop below $1 trillion through 2029. Much of the increase will come from mounting costs to fund Social Security and Medicare as the vast generation of baby boomers continue to retire. Trump Supporter Storms Media Pen at Texas Rally A Trump supporter stormed the media pen and attacked a BBC cameraman during Trump's first rally for 2019 in El Paso, Texas, shortly after the president criticized the media. (Published Tuesday, Feb. 12, 2019) The Trump administration contends that its tax cuts will eventually pay for themselves by generating faster economic growth. That projection is disputed by many economists. Despite the rising levels of federal debt, many economists say they think the risks remain slight and point to current interest rates, which remain unusually low by historical standards. Still, some budget experts warn that ever-rising federal debt poses substantial risks for the government because it could make it harder to respond to a financial crisis through tax cuts or spending increases. <mark>Michael Peterson</mark>, head of the Peter G. Peterson Foundation, says \"our growing national debt matters because it threatens the economic future of every American.\" Trump Not \"Thrilled' With Border Deal, But Leaning Toward It Copyright Associated Press"}]