[{"date": "2014-03-29", "url": "http://ohio.com/sports/motorsports/nascar-kyle-busch-wins-pole-at-martinsville-speedway-1.476821", "content": "MARTINSVILLE, Va.: Kyle Busch has seen it time and again at Martinsville Speedway. Driving down pit road, heading back onto the track and in contention for the lead, Busch is used to seeing the pole-sitter gun the engine just off the jack and reassume the race lead. Busch hopes to finally get to experience that for himself at Martinsville Speedway on Sunday after earning the pole on NASCAR's smallest, tightest track for the first time in 19 career starts. \"I think that's a great thing for us,\" Busch said after winning the pole with a lap at 99.674 mph. \"We get to pit there and of course drop the jack and just lunge across the line and be good .\" You need to still run up front all day. I think that it's a great opportunity for us to pick up some spots say if we're second, third, fourth, whatever, but you definitely always want to stay as close to the front as you can and try not to use that box as much as some guys have in the past. \"The pole is the 14th of Busch's career. In an interesting twist under NASCAR's new knockout qualifying system, Busch won it while Joey Logano set a track record. That came at 100.201 mph during the first phase of two-session qualifying. All 44 cars competed in the 30-minute first session, and the top 12 moved into the 10-minute phase two. Denny Hamlin earned the No. 2 starting spot with a lap at 99.548 mph, and will be followed on the starting grid by Logano and Hendrick Motorsports teammates <mark>Jimmie Johnson</mark> and Jeff Gordon. That puts Busch in some pretty accomplished company because Hamlin (4), <mark>Johnson</mark> and Gordon (8 each) have won a lot. Busch, though, is coming off a victory last week at Auto Club Speedway in Fontana, Calif., and while he said it wasn't dominating, it gave him hope that the <mark>Joe Gibbs</mark> Racing teams are coming together .\" It just seems to be working well right now, whatever is working, \"he said. Hamlin, who promised earlier in the day that he would win on Sunday, wasn't in love with the outside starting spot because it can be tricky to get down to the bottom on restarts from the outside. He said nothing that happened in practice or qualifying made him change his view of how it can all unfold .\" I knew, even going into this weekend, I knew we were going to be really good contenders and be in the mix anyway, \"he said .\" I feel like after running a couple laps of practice I felt like this was a car that was capable of winning. I think with tire management being more of a factor than it's ever been, it kind of lends itself to my driving style even more. For that reason I think we'll be tough on Sunday. \"Logano has two top-10 finishes on the 0.526-mile oval, but none since 2010 .\" So we've got a track record, but we don't have a pole. How does that work? \"he asked. A solid pit position, he said, could help turns things around on Sunday .\" Obviously, the pit stall is very important, especially here. It's a dangerous pit road, so you want to get a nice spot you can get in and out of, but obviously here it's a slow pit road and you can make up a lot with timing lines on pit road, \"he said. Danica Patrick qualified 10th, her best starting spot in a race not held at Daytona. Her previous best starting position was 21st, accomplished twice last season. Hamlin returns Being told he couldn't race last weekend because of an eye and vision problem will not make Hamlin less likely to seek the help of medical staffs available at NASCAR tracks every weekend, he said Friday. Hamlin let Sam Hornish Jr. drive his car last weekend at Auto Club Speedway after he sought the assistance of the on-site medical team when his face swelled up and his vision blurred. Initially thought to be a sinus infection, it turned out to be a small piece of metal in his eye, Hamlin said at Martinsville Speedway. Hamlin said he doesn't blame the two doctors who examined him for failing to see the rusting metal, and it wasn't until he saw an optometrist that it was discovered, removed, and he started feeling better .\" It took someone who was in the business of eyes to find it, \"he said. Hamlin was cleared to return this weekend and he took umbrage at the notion that his reputation might have been tarnished when he missed the race .\" People who think negatively of me or think that we side-stepped some sort of drug test or something is ridiculous, \"he said, adding that he was making an effort not to get angry at the suggestion that something untoward was afoot .\" I'm in one of the top-three cars in NASCAR. I would have to be an absolute moron - moron - to risk that. \"Dale Earnhardt Jr., who originally said he was concerned about Hamlin's point of view about how he wound up being told he couldn't race, said his concern wasn't for the medical team's competency, but for his fellow driver .\" I feel great about the process and what NASCAR has had in place for years, \"Earnhardt said.", "articleID": "2014032909_00035534_W", "names": {"Jimmie Johnson": ["Q217238", "Q6199355"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"]}}, {"date": "2014-03-31", "url": "http://www.npr.org/2014/03/31/297261905/greyhound-racing-may-be-headed-for-the-finish-line?ft=1&f=2", "content": "hide caption Greyhound racing has been on a downward trend for decades. Greyhound racing has been on a downward trend for decades. On a weekday afternoon at the Mardi Gras Casino near Fort Lauderdale, Fla., most guests are inside at the relatively new card tables and slot machines. Outside, at the 5 p.m. post time, only about a dozen people are in the grandstand. This is what they're waiting for: The handlers lead out the greyhounds. The dogs are loaded into their starting boxes. Then eight greyhounds run in the first of 18 races. hide caption Concerned over animal treatment, the Humane Society of the United States and others support a Florida bill that would reduce the number of tracks racing greyhounds. Others say abuse is rare, and even hurts the owners' chances of winning a race. Concerned over animal treatment, the Humane Society of the United States and others support a Florida bill that would reduce the number of tracks racing greyhounds. Others say abuse is rare, and even hurts the owners' chances of winning a race. Greyhound racing, a sport in decline, is still hanging on, mostly in Florida. But a bill gathering steam in the Legislature may hasten its demise. Sponsored by Democratic state Sen. Maria Sachs, the bill has been gaining momentum, in part, because of support by groups such as the Humane Society of the United States, who are concerned about how greyhounds are treated. Between last May and February, 95 greyhounds died at tracks in Florida as a result of illness or injuries. \"The attendance has gone down,\" Sachs says of the sport. \"The treatment of the dogs, of course, has gone down as well because they're not making any money anymore .\" For most of the 80 years it's been in existence, the Mardi Gras Casino was known as the Hollywood Kennel Club, later as the Hollywood Greyhound Track. As a sport, greyhound racing's best days were probably 50 years ago, when, in most areas, horse and dog tracks were the only legal gambling outside of Las Vegas. In recent decades, many tracks have closed as states have banned greyhound racing over concerns about treatment of the dogs. Today, 13 of the remaining 24 tracks are located in Florida. Sachs' bill may soon reduce that number. For several years now, Florida has allowed most of the dog tracks to also run poker rooms. A few, like the Mardi Gras Casino and other tracks near Miami, also have slot machines. Sachs' bill would allow them to keep the slots and the card games even if they eliminate greyhounds. She says it just recognizes a fact that greyhound racing is a dying industry. \"I'd like to see the state of Florida come into the 21st century,\" Sachs says. There's not much dispute about the economic facts. In Florida, the amount bet on dog races is a third of what it was just a decade ago. Only a few tracks still make money on greyhounds, according to a consultant's report to the Legislature. For the rest, the dogs are a loss leader that allows them to continue operating their profitable card rooms and slot machines. At the Mardi Gras track, the first race has just run. Trainer <mark>Alan Murray</mark> is walking one of the racers. He's a brindled black and tan greyhound named Musical Chairs who is still panting from the race. \"He did well,\" <mark>Murray</mark> says. \"He ran third .\" That means he made money for his owners. <mark>Murray</mark> has a law license and an economics degree. He and his wife, a veterinary assistant, raise greyhounds. Like most in the industry, he angrily rejects charges that his dogs aren't treated well. Yes, as in any industry, there are bad apples, he says. But even with declining purses, <mark>Murray</mark> says there's no incentive for owners and trainers to cut corners when it comes to taking care of their greyhounds. \"If you're cutting corners, you're not making money,\" <mark>Murray</mark> says. \"You don't get paid unless your dog runs fourth or better. If you cut corners, then that guy next to you is going to whip your butt .\" Jack Cory, a lobbyist for the Florida Greyhound Association, believes the real issue is that some greyhound tracks want to become casinos. \"They think if they do away with live racing, then the Legislature will chip away and give them slot machines this year, table games next year,\" Cory says. \"And you will have 13 casinos operating in the state of Florida .\" At the Palm Beach Kennel Club, Vice President Joe Rooney says concerns that the bill may kill dog racing aren't warranted. Some tracks will close, he says, but his is one of three or four that will keep racing. \"I think actually you would just end up with better dogs, better kennels, better operators,\" Rooney says. \"We would still have plenty of dogs to meet our requirements .\" However, Rooney concedes that the days of greyhound racing appear to be numbered. In Florida, the Legislature is considering an overhaul of the state's gaming code, one that may open the way for big resort casinos in South Florida. Sports Freshmen Wildcats Step Easily Into Storied Tradition Hobie Alter, The <mark>Henry Ford</mark> Of Surboards, Dies At 80 Sports Greyhound Racing May Be Headed For The Finish Line Sign In / Register Please keep your community civil. All comments must follow the", "articleID": "2014040104_00009579_W", "names": {"Alan Murray": ["Q3242508", "Q4707398", "Q58854651"], "Henry Ford": ["Q19865736", "Q52439758", "Q5721389"]}}, {"date": "2014-04-01", "url": "http://www.cnsnews.com/news/article/patrick-goodenough/kerry-nato-s-door-remains-open-he-does-not-mention-ukraine-georgia", "content": "Flags flutter in the wind in front of NATO headquarters in Brussels on Wednesday, Feb. 26, 2014. (AP Photo/Virginia Mayo) (CNSNews.com) - Marking the anniversaries of three previous rounds of NATO enlargement, Secretary of State <mark>John Kerry</mark> on Monday reaffirmed that \"NATO's door remains open\" to European aspirants that meet criteria for new members. \"The United States joins our allies in reaffirming that NATO's door remains open to any European country in a position to undertake the commitments and obligations of membership, and that can contribute to security in the Euro-Atlantic area,\" he said. statement did not include the words \"Georgia\" or \"Ukraine,\" however. Past efforts by the two former Soviet states to get on a path for NATO membership were stymied by European members unwilling to anger Russia, which firmly opposes further expansion of the alliance near its borders. It was the second time in five days that the administration has sidestepped a clear opportunity to voice direct support for future NATO membership for Georgia and Ukraine told a press conference in Brussels last Wednesday that neither country was \"currently on a path to NATO membership,\" and added that \"there has not been any immediate plans for expansion of NATO's membership .\" Georgia and Ukraine both applied for a NATO \"membership action plan\" (MAP) years ago, but despite strong support from Washington were turned down at a NATO summit in 2008, with opposition led by Western European members. They were told that they \"will become members\" at some future, unspecified date. Under its recently-ousted pro-Moscow president Viktor Yanukovich, Ukraine in 2010 withdrew from the process although a Western-leaning future government in Kiev may consider reviving the application. (While a crucial step, being awarded a MAP does not mean actual accession is imminent. Montenegro received one five years ago and has yet to join. Macedonia got a MAP a full 15 years ago, but Greece continues to block accession due to a drawn-out bilateral dispute over the country's name. NATO operates by consensus; objections from just member are sufficient to block an aspirant .) Obama's comment in Brussels came as a particular blow to Georgia, which has striven to prove itself a loyal ally and is among the largest non-NATO contributors to the International Security Assistance Force mission in Afghanistan (Georgia currently has more troops deployed in Afghanistan than 22 of NATO's 28 members .) One of the main hurdles to Georgia's NATO's aspirations is the existence of two breakaway regions, backed by Moscow - which virtually alone in the international community recognizes them as independent - South Ossetia and Abkhazia. Many NATO members are reluctant to accept a new member that has unresolved territorial disputes or hostile ties with a neighbor. Regional security analysts point out that that stance effectively gives Russia a veto over the process: Why would it resolve the territorial disputes if that would ease Georgia's entry into NATO - a move it strongly opposes? The NATO-Russia Council is currently suspended as a response to Russia's actions in Crimea, but the last time it met, in December, Foreign Minister Sergei Lavrov made clear the Kremlin's ongoing opposition to any further NATO enlargement. \"As to the extension of NATO, we are convinced that it is a continuation of the old inertia logic of the Cold War era,\" he said. \"This is not only preservation of dividing lines, which we are all obliged to remove, but also moving them further to the east...nobody should undertake steps that create risks for the security of their partners .\" Since the end of the Cold War NATO has undergone three rounds of expansion in areas formerly under communist domination. The alliance this week will mark the three anniversaries: Poland, Hungary and the Czech Republic joined on March 12, 1999; Romania, Bulgaria, Estonia, Latvia, Lithuania, Slovenia and Slovakia became members on March 29, 2004; and Albania and Croatia joined on April 1, 2009. In the face of varying levels of Russian objections, American leadership drove the expansion each time. \"No European democratic country whose admission would fulfill the objectives of the [North Atlantic] Treaty will be excluded from consideration, regardless of its geographic location, each being considered on its own merits,\" NATO declared at a U.S.-hosted summit in 1999. <mark>Kerry</mark> and other NATO foreign members will meet in Brussels on Tuesday and Wednesday for a meeting overshadowed by the Ukraine crisis. The agenda includes ways to support Ukraine - possibly by providing training and other help for its armed forces - and a review of the alliance's relations with Russia following its annexation of Crimea. The foreign ministers of Ukraine and Georgia will take part in sessions looking at the partnerships between their respective countries and NATO.", "articleID": "2014040116_00007913_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2014-04-03", "url": "http://www.sciencedaily.com/releases/2014/04/140403132207.htm", "content": "from universities, journals, and other organizations The first comprehensive map of hummingbirds' 22-million-year-old family tree--reconstructed based on careful analysis of 284 of the world's 338 known species--tells a story of rapid and ongoing diversification. The decade-long study reported in the Cell Press journal Current Biology on April 3 also helps to explain how today's hummingbirds came to live where they do. Part of the secret to the birds' remarkable success lies in the formation of nine principal groups or clades, hummingbirds' unique relationship to flowering plants, and the birds' continued spread into new geographic areas, the researchers say. \"Hummingbirds have essentially been reinventing themselves throughout their 22-million-year history,\" says Jim McGuire of the University of California, Berkeley. While all hummingbirds depend on flower nectar to fuel their high metabolisms and hovering flight, coordinated changes in flower and bill shape have helped to drive the formation of new species of both hummingbirds and plants. Remarkably, as many as 25 hummingbird species are able to coexist in some places. \"One of the really cool features of hummingbird evolution is that they all eat the same thing yet have diversified dramatically,\" McGuire says. \"It really is a big surprise that hummingbirds have divided the nectarivore niche so extensively .\" The new, time-calibrated evolutionary tree shows that ancestral hummingbirds split from the swifts and treeswifts about 42 million years ago, probably in Eurasia. By about 22 million years ago, the ancestral species of all modern hummingbirds had made its way to South America, and that's when things really took off. The Andes Mountains are a particular hotspot for hummingbird evolution, because diversification occurred along with the uplift of those peaks over the past 10 million years. About 140 hummingbird species live in the Andes today. The availability of new land areas in North America and the Caribbean has also played an important role in the evolution of new hummingbird species. For example, McGuire says, the bee hummingbirds colonized North America about 5 million years ago and consequently experienced rates of speciation that rival textbook examples of adaptive radiation. The new picture of the birds' past is an important step toward understanding how they have adapted to novel environments, like those found at low-oxygen, high-altitude mountain peaks. It also points to an exciting future. \"Our findings strongly indicate that hummingbirds remain engaged in a dynamic diversification process, filling available ecological and spatial niches across North America, South America, and the Caribbean,\" the researchers write. \"Thus, the dramatic radiation of this unique avian lineage is far from complete .\" Story Source: The above story is based on: Jimmy A. McGuire, <mark>Christopher C. Witt</mark>, J.V. Remsen, Ammon Corl, Daniel L. Rabosky, <mark>Douglas L. Altshuler</mark>, <mark>Robert Dudley</mark>. Cell Press. \"Hummingbirds' 22-million-year-old history of remarkable change is far from complete .\" ScienceDaily. ScienceDaily, 3 April 2014. Cell Press. (2014, April 3). Hummingbirds' 22-million-year-old history of remarkable change is far from complete. ScienceDaily. Retrieved April 3, 2014 from www.sciencedaily.com/releases/2014/04/140403132207.htm Computer Models Soybean Crop With 8.5 Percent More Productivity, Using 13 Percent Less Water Sage Grouse Losing Habitat to Fire as Endangered Species Decision Looms Cave-Dwelling Fish Examination Finds Possible Genetic Link to Human Disorders Hummingbirds' 22-Million-Year-Old History of Remarkable Change Is Far from Complete WebMD Survey Says Most Doctors Believe Medicinal Weed Works Hummingbird Metabolism Unique in Burning Glucose, Fructose Equally Bird Fossil Sheds Light on How Swift and Hummingbird Flight Came to Be High-Speed Video and Artificial Flowers Shed Light on Mysteries of Hummingbird-Pollinated Flowers June 1, 2012 - The glacier lily as it's called, is a tall, willowy plant that graces mountain meadows throughout western North America. It flowers early in spring, when the first bumblebees and hummingbirds Obama's NSA overhaul may require phone carriers to store more data Terms of Use Copyright 2014 by ScienceDaily, LLC or by third-party sources, where indicated. All rights controlled by their respective owners. Content on this website is for informational purposes only. It is not intended to provide medical or other professional advice.", "articleID": "2014040408_00056784_W", "names": {"Christopher C. Witt": ["Q28735318", "Q53953377"], "Douglas L. Altshuler": ["Q28735315", "Q46352885"], "Robert Dudley": ["Q21453070", "Q22109978", "Q421864", "Q57408339", "Q57548145"]}}, {"date": "2014-04-04", "url": "http://www.mcclatchydc.com/2014/04/04/223525/miami-woman-arrested-in-connection.html#storylink=rss", "content": "Unlike other spy matters, Senate's probe of CIA's harsh interrogations raises partisan hackles Court rejects claims by family members of U.S. drone strike victims Senate's findings on CIA interrogations likely to become roadmap for litigation China's tiger parks under fire from conservationists, animal cruelty experts For Crimea's residents, a difficult choice: Become Russian or leave Syria ordnance disarming effort will be bigger job than Afghanistan, UN says MIAMI - MIAMI_A Miami woman took fetish pornography to a disturbing extreme, police say - repeatedly decapitating live chickens and killing rabbits while engaging in sex acts during the filming of an animal torture video. Sara Zamora, 28, was arrested Friday on eight felony counts of animal cruelty for her feature role in a video called \"SOS Barn\" that a Miami-Dade police arrest report described in gory, stomach-turning detail. \"The chicken is enduring extreme pain and suffering during this process,\" according to the arrest report. The video clips - filmed for a twisted animal torture genre called \"crush\" - depicted her and other porn actresses \"torturing and killing a wide variety of animals, including chickens, rabbits and more for the sexual gratification of its viewers,\" according to police. The barnyard snuff video was filmed at the South Miami-Dade home of Adam Redford, according to the police report, who is listed as a co-defendant. He is already on probation for a similar animal cruelty case in Lee County last year but had not been charged in the Miami-Dade case as of Friday night. Redford, a boat captain who claims on his web site to be have filmed a variety of videos \"related to South Florida fishing,\" said he knew nothing about Zamora's case. \"I haven't seen or talked to her in close to a year,\" Redford said. Detectives from Miami-Dade's agricultural unit learned of the video clips from the People for the Ethical Treatment of Animals, a prominent animal rights group. <mark>Stephanie Bell</mark>, director of cruelty cases for PETA, called the arrest \"excellent news. We have been waiting for this .\" <mark>Bell</mark> said the group also had tipped off authorities in Redford's case in Lee County, where she said he had moved. <mark>Bell</mark> said such videos, graphically depicting animal torture and death, are illegal under state and federal laws. \"These videos are unfortunately in demand and it's hard to fathom that anyone would produce or enjoy them,\" she said. In one clip of \"SOS Barn,\" Miami-Dade police say, Zamora gropes a man's genitals with her left hand while \"repeatedly cutting a chicken's neck using hedge clippers with her right .\" In others, she posed \"in a sexy outfit\" after hacking off the head of another screaming bird or beat chickens to death with a wooden stick. Chickens weren't the only victims. She also karate-chopped the necks of several rabbits as they howled in pain, according to the report, then admitted to killing them. On the Internet, Zamora goes by the moniker Gloria Shynez. On a web site called Model Mayhem, Zamora claims she has been \"modeling\" since age 19. Her rates are flexible. \"My middle-eastern look distinguishes from many models and I am so excited to see what fun, beautiful shots we create together!\" she writes. Zamora was arrested while already in jail. She had been on probation on two separate cases, on charges including grand-theft with a firearm, credit card fraud, possession of a fictitious drivers license and cocaine possession. If convicted on the animal cruelty charges, she could face up to five years in prison on each count. She had been in jail for the past month after failing a probation drug test but would likely have been released Friday \"if not for the fickle finger of fate,\" said defense attorney Theodore Mastos. On Friday, Miami-Dade prosecutor Jason Pizzo informed the court and Mastos of the new charges. Mastos, while questioning whether the state could mount a \"viable prosecution,\" told The Miami Herald he was shown portions of the video outside court during a brief hearing. \"I'm glad I didn't have breakfast because I would have puked all over the place,\" said Mastos, who used to prosecute pornography cases in the 1970s. \"It was disgusting .\" As for Redford, he is on probation in a 2013 case on charges of causing the cruel death and torturing animals in Lee County. On Friday, he acknowledged the earlier arrest was a matter of public record but that \"it had been resolved .\" So-called \"crush\" animal torture videos aren't new and have been the target of past legal crackdowns. In 2010, the U.S. Supreme Court struck down a law that outlawed depictions of \"intentionally maimed, mutilated, tortured, wounded, or killed,\" saying it was too broad and violated the right to free speech. The federal law had been aimed at videos that often depict women slowly crushing animals to death \"with their bare feet or while wearing high heeled shoes,\" sometimes while \"talking to the animals in a kind of dominatrix patter,\" the opinion read. But the 2010 decision did not apply to the actual acts themselves of extreme cruelty to animals - and did not preclude the passing of future laws that narrowly applied to crush videos .> Apps and services for tablet devices> Apps and services for your mobile phone", "articleID": "2014040508_00014126_W", "names": {"Stephanie Bell": ["Q11341858", "Q19802802"]}}, {"date": "2014-04-04", "url": "http://www.sunshinecoastdaily.com.au/news/callan-marvels-at-break-captain-america-winter-sol/2219064/", "content": "Callan Mulvey could be the next Lex Luthor. ACTOR Callan Mulvey relishes every day he's on a film set, even when he's getting his \"arse kicked\". The Auckland-born actor, who moved to Australia at the age of eight and is best known locally for his starring roles in Heartbreak High, Rush and Bikie Wars: Brothers in Arms, has found success in Hollywood since moving to the US last year. The 39-year-old made his international feature film debut as a member of the US Navy's famed SEAL Team 6 in Zero Dark Thirty alongside Aussies Nash and Joel Edgerton. Now the film roles are, well, rolling in. Just last month he was shirtless, and bulked up, in the release of Greek action drama 300: Rise of an Empire. And now he's getting his butt served to him by none other than Captain America himself in the latest Marvel film, Captain America: The Winter Soldier. Callan Mulvey, left, and <mark>Jack O'Connell</mark> in 300: Rise of an Empire. \"I've been working pretty solidly, which is great,\" Mulvey told APN from his home in LA. \"It certainly helps having 300 and Captain America coming out and having a presence in this market. It has really sped things along .\" Mulvey has the rare honour of signing on for a sequel which fans and critics have hailed as being better than its predecessor. Directors Anthony and <mark>Joe Russo</mark> have clearly hit on a winning formula and have already signed on to direct a third Captain America film. \"Apart from Joss Whedon, they were the only directors Marvel invited to come back,\" Mulvey said. Mulvey's character Jack Rollins is a S.H.I.E.L.D. agent who goes into the field with Captain America, but ultimately answers to Alexander Pierce (Robert Redford). He features prominently in a scene where some of the S.H.I.E.L.D. agents turn on Captain America in a fight sequence in a lift. \"I certainly had a few fight scenes where I got my arse kicked by other people, which was fun,\" he said. Mulvey's bruised and beaten character can be seen top right. \"I had probably two or three lines (in the film), one of which made the trailer. I was very happy about that .\" It's just cool being on any set, let alone a Marvel set. You're just standing around with Robert Redford. \"While he's yet to share any scenes with another Marvel superhero, Chris Hemsworth as Thor, the two actors do catch up when they can in Los Angeles. Mulvey has worked with Hemsworth's older brother Luke twice, including the upcoming Aussie indie film Kill Me Three Times. But Mulvey's career will really take off if he lands the role of Lex Luthor in next year's Batman vs Superman movie, which already stars Ben Affleck, <mark>Amy Adams</mark> and Henry Cavill. Buy a Photo Search and buy photos online now .? Sunshine Coast Newspaper Company Pty Ltd 2014. Unauthorised reproduction is prohibited under the laws of Australia and by international treaty.", "articleID": "2014040509_00029856_W", "names": {"Amy Adams": ["Q4451142", "Q4749062", "Q481832"]}}]