[{"articleID": "2019011703_00151932_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Leslie Marshall": ["Q27996208", "Q6531003"]}, "date": "2019-01-17", "url": "http://feeds.inquisitr.com/~r/google/yDYq/~3/kiwmalcB6ro/", "content": "Nathan Francis Public sentiment has turned sharply against Trump as the shutdown drags on. Public sentiment has been turning sharply against <mark>Donald Trump</mark> as the government shutdown stretched on beyond its third week, and even one of the most Trump-friendly cable news outlets is no longer giving the president any cover. This week, Fox News published an op-ed on the front page of its website claiming that Democratic leaders Chuck Schumer and Nancy Pelosi are schooling Trump when it comes to the shutdown and that the public has turned against the president. Written by <mark>Leslie Marshall</mark>, the story noted that most Americas seem to agree with the Democrats that Trump's border wall would be an ineffective way to combat illegal immigration and address border security. <mark>Marshall</mark> needled Trump even more by pointing out that Pelosi, one of his main adversaries, is more popular with voters than he is at this point. \"While most voters believe there is a border crisis, they don't feel Trump's border wall will solve the problem, echoing the sentiments of the Democratic leadership,\" she wrote. \"Add in that Trump's approval ratings stand at 41 percent, the lowest since September, while his disapproval rating is 54 percent, the highest it's been since September. Plus the fact that for the first time in his presidency, he is less popular than Nancy Pelosi, his main adversary.\" The shutdown began just before Christmas after Trump rejected a bipartisan funding measure and insisted that Congress provide funding for the border wall. Democrats have remained steadfast in their stance not to offer any funding, and the shutdown has become the longest in American history. With the shutdown keeping more than 800,000 federal employees out of work and out of a paycheck, public opinion polls show that the majority of Americans blame Trump, and that number is growing. A recent poll from the Washington Post/ABC News found that 53 percent of respondents blamed Trump and Republicans, while another from CBS News / YouGov poll found that 47 percent blamed Trump, and a CNN poll found that 55 percent blamed <mark>Donald Trump</mark> for the shutdown. President Trump has insisted that he is not going to compromise with Democrats to end the government shutdown, and that he is comfortable in his unbendable position. But privately, it's sometimes a different story. https: //t.co/v4dLdtLwxm--Khashoggi's Ghost (@ UROCKlive1) January 17, 2019 <mark>Donald Trump</mark> may have himself to blame for the public sentiment. In the days before the shutdown began, he said during a televised meeting with Democratic leaders that he would \"proudly\" shut down the government in his demand for border wall funding and that he alone would take the blame. Trump quickly shifted away from that position, taking to Twitter to lay blame at the feet of Democrats, but the majority of Americans do not agree."}, {"articleID": "2016042904_00597002_W", "names": {"Matt Murray": ["Q1367644", "Q19663237", "Q28434558", "Q54917992", "Q6789111", "Q6789112"], "Tom Wilson": ["Q17859713", "Q25352557", "Q30121988", "Q542781", "Q56462160", "Q7818076", "Q7818077", "Q7818079", "Q7818080", "Q7818081", "Q7818083"]}, "date": "2016-04-28", "url": "http://www.ottawasun.com/2016/04/28/capitals-need-overtime-to-beat-penguins-in-game-1?channelColor=sports", "content": "Capitals need overtime to beat Penguins in Game 1 By Mike Zeisberger, Toronto Sun First posted: Thursday, April 28, 2016 11:33 PM EDT | Updated: Friday, April 29, 2016 12:41 AM EDT Article WASHINGTON - Upon further review, the puck was over the goal line by the width of a stick blade. That's what differentiated these victorious Washington Capitals and the downtrodden Pittsburgh Penguins on this night. Mere centimetres. A sliver of white ice between the red goal line and the black puck that needed to be reviewed via video to be acknowledged as a goal. The winning goal. The overtime goal. T.J. Oshie's hat trick goal. The goal that gave the host Capitals a 4-3 victory over the Penguins in Game 1 of this best-of-seven second round playoff series that has all the makings of a classic. Coming into this matchup, there was little to choose from between these star studded teams. To that end, they didn't disappoint. On this drizzly Thursday evening, the only thing that separated the Penguins and Capitals was an Oshie wraparound that barely squeezed between the post and the pad of Penguins goalie <mark>Matt Murray</mark>. \"The way their\" tender plays, he's a big guy and plays aggressive, we thought we might have a chance if we tried to go to the far post, \"Oshie said, referring to <mark>Murray</mark>. For his part, <mark>Murray</mark> initially protested that the puck had not gone in. Asked if he thought he had stopped it, <mark>Murray</mark> replied:\" Yeah I did, to be honest. The ref called it a goal on the ice. I don't know how he could have possibly seen it from his angle. But I thought I had it, to be honest. \"I knew it was close but I thought it never fully crossed the line. I thought it was close enough that it would be inconclusive. But I'm not going to go any further than that.\" This series has been billed as Crosby-Ovechkin II with good reason, given that the NHL's two poster boys are clashing in the playoffs for only the second time in their post-season careers. Of course, when an event is hyped up like this, it often does not live up to expectations, instead disappointing with a resounding plop. Think many heavyweight fights. Think many Super Bowl blowouts. That wasn't the case on Thursday night in Washington, however. On a drama-filled evening full of storylines, it was one of Ovechkin's understudies--Oshie--who stole the show. In a script right off the pages of a Hollywood screenwriter, Oshie completed his three goal perforamnce with the winner at 9:33 of overtime. Game 2, which goes Saturday night here in Washington with the Capitals leading the series 1-0, will be shown to a national TV audience south of the border on NBC. And if it proves to be anywhere near as riveting as the opener, it will be an outstanding selling point for the league of just how exceptional the product can be at this level. While Ovechkin was a force, Crosby certainly could have been better. In fact, the Penguins best player was Nick Bonino, who had a goal and an assist. Andre Burakovsky scored the other Capitals goal while Bonino, Ben Lovejoy and Evgeni Malkin replied for the Penguins. <mark>Murray</mark> appeared to favour his right leg after stopping an Ovechkin breakaway in the third period but was able to continue. Meanwhile, count on the league to review a knee-on-knee hit delivered by the Caps' <mark>Tom Wilson</mark> on the Pens' Conor Sheary in the third period. As bad as the play looked, no penalty was called, leaving the Penguins livid. In the first 10:37 of this series, the teams combined for 17 shots, an Burakovsky goal, a Chris Kunitz effort that pinballed off the post and a partial Ovie breakaway. Other than that...And so, the Caps hold the upper hand. So, what can we expect for an encore in Game 2? \"Games like that with teams with that amount of skill, anytime you give them time and space, it seems that they can make some plays,\" Capitals goalie Braden Holtby said. \"We did a pretty good job most of the game taking it away, but it happened once or twice and they can burn you.\" You have to be ready to focus on every single play and execute it. That's one thing we're going to get better at. \"One thing is for sure: this series is going to be fun. It already is. By Mike Zeisberger, Toronto Sun First posted: Thursday, April 28, 2016 11:33 PM EDT | Updated: Friday, April 29, 2016 12:41 AM EDT Upon further review, the puck was over the goal line by the width of a stick blade. That's what differentiated these victorious Washington Capitals and the downtrodden Pittsburgh Penguins on this night. Mere centimetres. A sliver of white ice between the red goal line and the black puck that needed to be reviewed via video to be acknowledged as a goal. The winning goal. The overtime goal. T.J. Oshie's hat trick goal. The goal that gave the host Capitals a 4-3 victory over the Penguins in Game 1 of this best-of-seven second round playoff series that has all the makings of a classic. Also in this article"}, {"articleID": "2010032600_00009318_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}, "date": "2010-03-26", "url": "http://news.com.au/adelaidenow/story/0,22606,26901522-5006301,00.html?from=public_rss", "content": "slim and fit - but is this really the look we want from an alternative pm people like to see their politicians, but not too much of them. that seems to be the conclusion backers and critics of opposition leader <mark>tony abbott</mark>'s lycra and \"budgie smuggler\" obsession are reaching after he said he again will appear in them in public. mr <mark>abbott</mark> will take part in an ironman triathlon, raising money for breast cancer research, and a 10-day \"pollie pedal\" charity ride between sydney and melbourne. what image should a pm project? tell us in the comments box below. they will be the ninth and tenth times mr <mark>abbott</mark> has stripped to body-hugging costumes since he was elected opposition leader last december - once a fortnight. senior liberals reportedly have questioned the behaviour and finance minister lindsay tanner pilloried mr <mark>abbott</mark> in parliament, saying: \"there is one part of his body that does not get much exercise and that is the brain. and it is long overdue that it got a workout.\" start of sidebar. skip to end of sidebar."}, {"articleID": "2014021907_00064418_W", "names": {"Robert Lang": ["Q16731223", "Q2157973", "Q56433508", "Q914398"]}, "date": "2014-02-18", "url": "http://wbal.com/article/105512/21/workers-business-owners-debate-sick-leave-mandate", "content": "Workers, Business Owners Debate Sick Leave Mandate WBAL's <mark>Robert Lang</mark> reports on some of the workers and business owners who appeared at Tuesday's hearing. Baltimore County Democratic Delegate John A. Olszewski Jr. says many of the workers who need sick leave the most, such as low-wage employees who can't afford to miss a day's pay, are the ones who can't earn it in their jobs. More than 700,000 Maryland workers don't have access to sick leave, Olszewski said Tuesday to the House Economic Matters Committee. Olszewski has introduced a bill requiring employees to give one hour of sick leave for every 30 hours worked, capping the number at seven a year. In general, businesses that give other forms of paid time off would be exempt. The bill would apply to businesses with at least ten employees. Committee members heard horror stories Tuesday from restaurant cooks who have worked through severe illnesses. Mark Sine, a restaurant worker from Baltimore told the committee that he worked through a cold, which later progressed to mononucleosis, causing him to miss work for two weeks. \"If I had paid sick days, I wouldn't have had to feel this way. It would have given me a safety net, so I wouldn't have had to push myself so hard, and made myself even sicker,\" Sine told the committee. Matt Quinlan, a restaurant worker from Baltimore, also told the committee that in a number of the restaurants where he worked, if workers all had the flu, the cooks would place large buckets in the kitchen in case anyone got nauseous. \"If you're physically ill, you can be sick, and we'll share these buckets, do what you need to do, and then get back to work,\" Quinlan told the committee. Business owners and pro-business groups testified that the bill would hurt small employers and Maryland's economic climate. Lobbyist Bruce Bereano, who testified on behalf of Safeway and a number of other businesses and associations read part of the bill aloud during his testimony, and criticized the measure as \"exceedingly broad\" in its scope. He noted that the sick leave is not just provided for workers to care for themselves or their immediate family members, but also their relatives. \"It is grossly unfair to employers. It presumes that they are wrong and that they are not fair to their employees and treating their employees correctly,\" Bereano added. The owner of a temporary employment agency in Timonium told the committee that many of the workers she places often miss work not because of illness, but because they must deal with government agencies that provide them with benefits such as transportation or child care assistance. Wanda Smith, president and CEO of Symphony Placements notes many of those government agencies are only open from 9-5, which is often working hours for her employees. She suggested lawmakers order those agencies to expand their hours. \"Why can't we say that we will look at all of the social programs, and increase the hours, so that people don't have to miss work, so they can stay gainfully employed,\" Smith told lawmakers. A Senate version of this bill will be the subject of a hearing on Thursday. VIDEO: First Night A Hit For \"Tonight Show' Host Jimmy Fallon Craig Proposes Flat Tax, Then Ending Income Tax; House Republicans Propose Cuts"}, {"articleID": "2010092509_00053487_W", "names": {"Graham Smith": ["Q17388770", "Q18737089", "Q20685584", "Q20873054", "Q28600236", "Q42575935", "Q43380296", "Q47498831", "Q55362421", "Q5593246", "Q5593247", "Q5593248", "Q5593249", "Q5593251", "Q5593252", "Q5593253", "Q5593254", "Q59478591", "Q640289"]}, "date": "2010-09-25", "url": "http://denverpost.com/nationworld/ci_16167828?source=rss", "content": "london - even a monarch needs a little help from time to time - especially when the cost of heating those drafty old palaces spirals past $1.5 million a year. but a request for assistance from a government fund that provides subsidized heating to low-income britons has caused a spot of bother for queen elizabeth ii, long one of the world's wealthiest women. her majesty's application in 2004 was politely turned down by the government - in part because of fear of adverse publicity - and quietly forgotten until the independent newspaper published the correspondence friday after getting it via a freedom of information request. the documents quote an unidentified functionary as gently reminding the royal household that the program was meant for people in need, not the upper crust, and he noted the potential public-relations disaster. \"i also feel a bit uneasy about the probable adverse press coverage if the palace were given a grant at the expense of, say, a hospital,\" the official said. \"sorry this doesn't sound more positive.\" chagrined palace officials confirmed the account friday. a buckingham palace spokeswoman said royal officials explored the possibility of getting money under the program as a way to reduce the monarchy's cost to taxpayers by making the palace more energy-efficient. she said the royal household did not know at the time that the government money was targeted for low-income britons. she spoke anonymously in line with royal policy. the revelation touched a nerve at a time when britain is facing severe budget cuts in the midst of a prolonged recession. <mark>graham smith</mark>, spokesman for the anti-monarchy group republic, said the queen's attempt to access low-income funds was shameful. \"it is clear evidence of the contempt the palace has for ordinary people in this country,\" he said. the 84-year-old queen's finances have been controversial in the past, with occasional debates about whether britain's head of state - whose role is largely ceremonial - costs taxpayers too much. taxpayers fund the royal household to the tune of $60 million, or 38.2 million pounds, a year. the monarch's official website points out it costs britain's 62 million people less than a dollar (62 pence) each. royally cold buckingham palace has been in royal hands since king george iii bought it in 1761 and has been the official london residence of britain's monarchs since 1837. although it has magnificent gardens and grand state rooms with priceless paintings and furniture, large parts of the 775-room palace have not been modernized and are cold and drafty. use the \"report abuse\" link when necessary (you don't have to be a member, or be logged in to use it) british queen taking heat for 2004 attempt to tap poverty fund to warm palace obama blasts iranian president for saying world blames u.s. for 9/11 attacks all contents copyright 2010 the denver post or other copyright holders. all rights reserved."}, {"articleID": "2008121710_00027401_W", "names": {"David Paterson": ["Q11674", "Q58331852"]}, "date": "2008-12-17", "url": "http://daytondailynews.com/n/content/shared-gen/ap/National/New_York_Taxes.html?cxtype=rss&cxsvc=1&cxcat=0", "content": "arts and entertainment: britney spears announces ohio concert date chick ludwig at large: hobson cut; blair on practice squad dayton local music: make your christmas mix cd local springfield schools news and issues: obama taps chicago schools chief for top ed job on campus: lumina foundation selects ohio to receive higher...ny gov proposes tax on drinks, downloaded music albany, n.y. - gov. <mark>david paterson</mark>'s first state budget threatens to affect just about every new yorker. even those online. <mark>paterson</mark> proposed tuesday a 2009-10 budget that would increase spending by 1.1 percent, or $1.3 billion, to create a $121.1 billion spending plan. much of the growth is revenue from 88 new or higher fees and will hit new yorkers in many areas, from downloading music to sipping drinks to fishing. one of the proposed hikes is a so-called \"ipod tax,\" which would tax the sale of downloaded music and other \"digitally delivered entertainment services\" by 4 percent. there also would be higher taxes on gas, taxi rides, cable and satellite tv service, cigars, beer, movie and sports tickets, and health spa visits, to name a few items. <mark>paterson</mark> seems to be fighting both obesity and budget deficits with a proposal for an 18 percent tax on soda and other sugary drinks containing less than 70 percent real fruit juice. \"people don't really realize the amount of calories they're ingesting through liquids,\" said joe baker acting deputy secretary for health and human services to the governor. \"they say,\" oh, it's just a drink .' \"the idea is to discourage consumption of high-caloric beverages - health officials estimate a 5 percent drop - and to raise $404 million in fiscal year 2009-2010 toward the state's multibillion dollar budget gap. <mark>paterson</mark> said the proposal would raise $539 million in 2010-2011. the american beverage association opposes the tax, saying it would most harm the middle class. the group also argued that it doesn't make sense to single out a single food product as the cause for obesity.\" there is no science or logic that justifies it, \"the association's statement said.\" rather, we need to focus on promoting balanced eating habits and more physical activity. until we get our kids exercising more the scales will be tipped against our next generation. \"according to state officials, almost one in four new yorkers under age 18 are obese, and at higher risk for dangerous, expensive illnesses like diabetes and heart disease. copyright © 2008 cox ohio publishing, dayton, ohio, usa. all rights reserved."}, {"articleID": "2015090919_00059872_W", "names": {"Mike Allen": ["Q3307988", "Q6845851", "Q6845854"]}, "date": "2015-09-09", "url": "http://willcoxrangenews.com/news/article_018a4a60-5682-11e5-af77-2b3ce6c756f9.html", "content": "Community Briefing - Arizona Range News: News Carol Broeder carol.broeder @ willcoxrangenews.com Third Annual Willcox Flyer Bike Ride Willcox's own Olympian, <mark>Mike Allen</mark>, led the family friendly eight-mile fun run during Saturday's \"Third Annual Willcox Flyer Bike Ride.\" <mark>Allen</mark> competed as part of the U.S. Olympic Road Cycling Team in the 1964 Olympics in Tokyo. Posted: Wednesday, September 9, 2015 12:00 pm Community Briefing 0 comments Willcox ADOC TRAINING EXERCISE: The Arizona Department of Corrections will be conducting training exercises in and around the community of Willcox using trailing hounds on Monday, Sept. 28 through Friday, Oct. 2. Trailing hounds and horses have been in use by the Department of Corrections for more than 20 years with great success. The trailing hounds are trained to detect human scent and provide a direction of travel for teams to follow. Trailing hounds are a vital resource to law enforcement used to trail and apprehend escapees and fugitives. They have also proven to be an invaluable resource to the community to locate lost and missing persons. As the training progresses you may see Arizona Department of Corrections Officers in the community using the trailing hounds for this training exercise. COWBOY HALL OF FAME TICKETS: Cowboy Hall Fame Dinner will be held Thursday, Oct. 1, 6--8 p.m. and is sponsored by the Willcox Chamber of Commerce & Agriculture. Tickets are $25 per person. Call the Chamber at 520-384-2272 or visiti 1500 N Circle I Rd.. Or visit Maid Rite Feeds, 225 S. Railroad Ave. for tickets. BOOTS \"N' BLING, the third annual fundraiser sponsored by Northern Cochise Community Hospital Foundation will be held Saturday, Sept. 12. Silent auction and no host bar begin at 6 p.m. and a prime rib dinner is at 7 p.m., followed by dancing. It will be held at the Elks Lodge, 247 E. Stewart St. For more information, call Kathy Cook, President at 520-384-3278 or Carol Dunagan at 520-374-4646 or Betty Thompson at 520-507-2576."}, {"articleID": "2015121023_00051578_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}, "date": "2015-12-10", "url": "http://hawaiinewsnow.com/story/30712814/the-latest-new-climate-draft-shows-headway-on-key-issues", "content": "The Latest: New climate draft shows headway on key issues - Hawaii News Now - KGMB and KHNL The Latest: New climate draft shows headway on key issues - Hawaii News Now - KGMB and KHNL Member Center: EEO Public File Reports 2015 The Latest: New climate draft shows headway on key issues (AP Photo/Francois Mori). A participant holds a poster amid NGO representatives staging a sit-in protest closed to the plenary session to denounce the first draft COP21 Climate Conference agreement, and put pressure to reach an international agreement...LE BOURGET, France (AP) - The latest news related to the U.N. climate conference outside Paris, which runs through Dec. 11. All times local: 10:30 p.m. French Foreign Minister Laurent Fabius has presented a new draft of a global climate accord showing governments have made progress on some crunch issues but still disagree on others. The 27-page draft released late Thursday - two pages shorter than a previous version - suggested negotiators have settled on a long-term goal of keeping global warming \"well below\" 2 degrees Celsius (3.6 degrees F), while pursuing efforts to limit the temperature rise to 1.5 degrees C. The draft says governments \"aim to reach the peaking of greenhouse gas emissions as soon as possible.\" Previous drafts included stronger options with more specific timeframes. The draft still contained competing options on the key issue of transparency - making sure countries follow through on their emissions targets. The text included an option asking for different rules for rich and poor countries, which the former have said is unacceptable. Negotiators were given two hours to review the draft and then to come back and continue the talks. \"I think, I hope that by the end of this night we'll have a draft of the final text,\" Fabius said. \"We are much closer.\" 9:10 p.m. President Barack Obama and French President Francois Hollande (frahn-SWAH' oh-LAWND') are reviewing what progress has been made toward completing a global climate agreement. Obama and Hollande spoke by phone on Thursday about the status of the talks. The White House says both leaders underscored their \"firm commitment\" to cooperating to reach an ambitious and sustainable pact. Negotiators have been struggling to narrow down a 29-page draft of the sweeping deal to try to slow global warming. But countries remain at odds on critical issues. The deadline to finish the deal is Friday, although the talks could be extended beyond the deadline. The White House says Obama also thanked Hollande for sending France's aircraft carrier to the Persian Gulf to help in the fight against the Islamic State group. 4:45 p.m. International migration officials want a global climate accord under discussion to address the growing risk of migration because of extreme weather. The director of the International Organization for Migration, William Lacy Swing, said the planet is seeing more forced migration today than any time since World War II, and seeing what he called \"unprecedented anti-immigration sentiment.\" \"If we add the effect of climate change...you really have the elements of a perfect storm,\" he said on the sidelines of the Paris climate talks \"We are here...to find out how to weather that storm.\" Jan Egeland, head of the Norwegian Refugee Council, said \"every second, a person is forced to flee because of an extreme weather event.\" At least 19.3 million people worldwide were driven from their homes by natural disasters last year, most related to weather events, according to the Geneva-based Internal Displacement Monitoring Center. 4:30 p.m.. The chief United Nations environment officer is still optimistic that a deal will be hammered out soon. \"We're now down to some of the so-called red line issues, some of the defining issues in the convention that have to do with principles,\" said Achim Steiner, United Nations Environment Program director. \"I think the fact that we are now essentially left with maybe 3 or 4 issues that need to have a political compromise negotiated and formulated should give us courage and hope that we are actually moving to an agreement.\" Steiner said he thinks the final issue will be differentiation between rich and poor nations, calling it \"one of the defining principles of where the convention began its journey.\" Steiner said he is still hoping to end talks Friday night as the French have promised. 3:35 p.m. Europe's top representative at U.N. climate talks has accused China of blocking proposals for countries to update their carbon pollution targets every five years, which he called critical for a deal in Paris. EU Climate Commissioner Miguel Arias Canete told reporters Thursday \"without the five-year cycles, the agreement is meaningless.\" Canete said Chinese negotiators are opposed to making five-yearly updates a requirement in the agreement even though they agreed to such reviews before the Paris talks. More than 180 countries have presented emissions targets for after 2020, when the envisioned deal is supposed to take effect. Scientific analyses show those targets won't be enough to limit global warming to 2 degrees Celsius compared with pre-industrial times, the overarching goal of the climate talks. Canete says \"unless you come back every five years to update your targets, you can never reach the long-term goal.\" China, the world's biggest carbon polluter, has pledged to peak its emissions \"by approximately 2030 or sooner.\" 3:05 p.m. U.N. Secretary-General Ban Ki-moon says he is \"reasonably optimistic\" that countries will reach a strong agreement to slow global warming at Paris talks scheduled to finish Friday. Ban met Thursday at the climate conference with former U.S. Vice President Al Gore and non-governmental organizations seeking a robust deal. Calling this a \"a very critical moment,\" Ban said \"I am hopeful and I'm reasonably optimistic that we will be able to have for the first in the history of the United Nations a universal and very ambitious climate change agreement, which will make our human beings lives healthier and more prosperous.\" The last global accord on global warming, the 1997 Kyoto Protocol, only required rich countries to cut emissions. The climate change accord currently under negotiation would require all countries to pitch in. 2:10 p.m. Activists have a new way of trying to increase pressure on negotiators at the Paris climate talks - with caricatures of big-headed world leaders and piped-in voices from people around the world who want a robust agreement to fight global warming. Advocacy group Oxfam performed a skit Thursday at the talks with protesters wearing oversized \"big head\" masks representing world leaders. The big heads slept as an alarm clock rang, trying to rouse them to act to slow down climate change - but the heads stayed asleep. Nearby, a pyramid of boxes and speakers broadcast voices recorded by activist group Avaaz. A cacophony of languages and pleas resonated in an effort to remind negotiators of concerns of people from countries vulnerable to rising seas and increasingly extreme weather caused in part by man-made carbon emissions. Many activist groups want the Paris accord to call for an end to fossil fuel use in the long term and to back firm pledges by rich countries to help poor countries pay for future damages caused by climate change. 2 p.m. U.S. Secretary of State <mark>John Kerry</mark> says Paris climate talks are \"getting down to the critical stage,\" as he meets negotiators from developing countries at the high-stakes conference. Meeting Indian Environment Minister Prakash Javadekar, <mark>Kerry</mark> said \"we need to work on language and that's what most of today and tonight will be.\" He and Javadekar didn't elaborate on differences in their positions. Many sticking points remain among delegations over which countries should take the most responsibility for fighting man-made global warming. Javadekar said, \"We have discussed all issues and whatever the differing views on different positions and we are working toward...because we want Paris to succeed. We want future generations to get a right and good deal from Paris and to that end we work, and I think today's meeting was a productive meeting.\" <mark>Kerry</mark> is also meeting negotiators from Brazil and Malaysia on Thursday, and will meet later with talks host, French Foreign Minister Laurent Fabius. 11:30 a.m. U.S. Secretary of State <mark>John Kerry</mark> is meeting with the environment ministers of two of the largest developing nations as negotiators try to hammer out details of a global accord on climate change by the end of the week. <mark>Kerry</mark> was holding talks at the Le Bourget conference site outside of Paris on Thursday with the environment ministers of Brazil and India, according to the State Department. No details of the meetings were immediately available but Brazil and India are among the biggest nations demanding that richer countries pay and do more to reduce carbon emissions. <mark>Kerry</mark> is expected to meet with numerous other negotiators who produced a 29-page draft agreement on Wednesday. Much more remains to be resolved to get a final deal by Friday's self-imposed deadline. 11:05 a.m. Diplomats and climate negotiators worked almost until dawn and have now resumed talks, narrowing down options in a 29-page draft of a global accord to tackle climate change a day before a self-imposed deadline for the unprecedented agreement. A French diplomat said talks outside Paris continued until about 5 a.m. Thursday (0400 GMT, 11 p.m. EST Wednesday) before resuming midmorning. The diplomat said a new draft of the accord is expected to be released sometime Thursday. He spoke on condition of anonymity because he wasn't authorized to speak publicly about the negotiations. The French organizers of the two-week talks want a final agreement by Friday night, though U.N. climate conferences rarely end on time. The draft released Wednesday left major issues unresolved. By Angela Charlton Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2018112015_00009244_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"], "Quincy Jones": ["Q193645", "Q25190073"], "Martha Stewart": ["Q234606", "Q523013"]}, "date": "2018-11-20", "url": "https://hiphopwired.com/784409/snoop-dogg-thinks-deez-nuts-should-be-next-to-get-hollywood-walk-of-fame-star/", "content": "Source: Albert L. Ortega / Getty Snoop Dogg is now one of over 2,000 stars to have their names immortalized by way of the Hollywood Walk Of Fame. After the ceremony, the D-O Double G informed the masses of who he believes should be the next recipient of a Walk Of Fame star. TMZ reports: The rapper was joined by Dr. Dre, <mark>Jimmy Kimmel</mark> and record producer <mark>Quincy Jones</mark> for the ceremony in front of the El Capitan Theater on Hollywood Boulevard. The Doggfather's star is No. 2,651 in the history of the Walk, which has been around since 1960. We got Snoop after the ceremony and he didn't have a whole lot to say about getting the plaque...but had an interesting suggestion on who should get a star next...and they come in a pair. Without a doubt, Snoop Dogg has enjoyed one of Hip-Hop's most interesting career arcs. With 16 studio albums, over two dozen mixtapes, and a handful of collaborative projects, Uncle Snoop has cemented his place in the annals of Hip-Hop and music in general. Beyond his usual fare, he's also become something of a media and content maverick by way of hosting game shows, his cookbook, and hosting a show alongside his unlikely co-host, <mark>Martha Stewart</mark>. Snoop also returned to the charts as a featured artist on Lil Duval's smash hit \"Smile (Living My Best Life)\" as well. Check out the clip below where Snoop Dogg hits TMZ with one of the oldest hood jokes in the world .--Photo: Getty Hollywood Walk of Fame, newsletter, snoop dogg"}, {"articleID": "2019081908_00193726_W", "names": {"Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"], "Svetlana Kuznetsova": ["Q192064", "Q21063641", "Q3978501", "Q4245117"], "Robert Wickens": ["Q113936", "Q39385430"]}, "date": "2019-08-19", "url": "https://www.washingtontimes.com/news/2019/aug/19/weekend-sports-in-brief/?utm_source=RSS_Feed&utm_medium=RSS", "content": "Weekend Sports in Brief Is \"gun control' a winning issue for Democrats? Question of the Day By The Associated Press - Associated Press - Monday, August 19, 2019 GOLF MEDINAH, Ill. (AP) - Staked to a six-shot lead, <mark>Justin Thomas</mark> spent more time Sunday worrying about what could go wrong than ending 12 months without winning. And right when it started to go wrong, <mark>Thomas</mark> delivered his biggest shots in the BMW Championship. In a span of three holes around the turn at Medinah, his six-shot lead shrunk to two. <mark>Thomas</mark> answered with two clutch wedge shots, two big putts and sailed to a 4-under 68 to secure a three-shot victory over Patrick Cantlay, who gave him a battle to the end with a 65.\" Patrick played unbelievably, put a lot of heat on me, \"<mark>Thomas</mark> said.\" In the end, it could have been good for me. It kept me focused, kept my head down ....I was really nervous going into today. I remembered that it's really hard to win a golf tournament, and I'm glad that I was able to do so. \"The timing was ideal. His first victory since the World Golf Championship at Firestone last year moved him to the top of the FedEx Cup going into the Tour Championship, where he will start the tournament at 10-under par with a two-shot lead under the new scoring format as the final 30 players chase a $15 million first prize.\" I can certainly say I never slept on a Wednesday lead, \"<mark>Thomas</mark> said. Cantlay, who made four straight birdies around the turn, secured the No. 2 position and will start at 8 under. Brooks Koepka will be 7 under, a staggered start all the way down to even par for the final five players. TENNIS MASON, Ohio (AP) - Two unexpected champions embraced their first Rookwood championship trophies, concluding a week that brought more questions than clarity to the upcoming U.S. Open. Who's going to be healthy on the women's side? Will stumbles in the men's bracket at the Western & Southern Open carry over to New York? And are Madison Keys and Daniil Medvedev capable of carrying their newfound momentum into a Grand Slam event? After winning the biggest tournament title of their careers, they were already getting asked about how it might transfer to the bigger stage. Keys rallied late in both sets and beat <mark>Svetlana Kuznetsova</mark> 7-5, 7-6 (5) for her second title of the season and easily the biggest of her career. After flameouts in her last three tournaments and a tough draw for the week, she couldn't imagine the outcome. Back on the court to receive the trophy, she told the crowd:\" If you told me this is where I would be a week ago, I would have laughed in your face! \"Medvedev beat David Goffin 7-6 (3), 6-4 for his first Masters 1000 title. It was his third straight final, but the first time he had won. Medvedev lost to Rafael Nadal on Montreal a week earlier, then went on to reach his sixth final of this season, most on the ATP tour. He's won twice.\" To finally lift the trophy this week is an amazing feeling, \"Medvedev said. NFL EAST RUTHERFORD, N.J. (AP) - Le’Veon Bell will have to wait a little longer for his debut with the New York Jets. Coach Adam Gase announced that the star running back will be held out of the team's final two preseason games.\" I was about 99% sure heading into the preseason, \"Gase said after the Jets' practice at MetLife Stadium.\" It was all based off of how he practiced, conditioning and all those types of things. \"Gase and Bell spoke about the plan when training camp started, and Bell's snaps increased in practice last week. Bell has looked good in training camp after sitting out all last season in a contract dispute with Pittsburgh. Gase and the Jets don't want to take any unnecessary risks with Bell.\" We'll just get him as game ready as possible, \"Gase said.\" He's not really going to know until we get into a real game, but I feel like he's in great shape and he's been contacting about as good as anybody on the practice field. \"So, I feel confident he'll be ready to go (in) Week 1.\" That would be the regular-season opener against Buffalo on Sept. 8. It will mark the first time Bell will play in a game since the Steelers' playoff loss to Jacksonville on Jan. 14, 2018 - a span of nearly 20 months. \"I'll see y' all in September,\" Bell wrote on Twitter about an hour after Gase's announcement. AUTO RACING LONG POND, Pa. (AP) - The black clouds that enveloped Pocono and officially brought the IndyCar race to a premature end didn't appear until the halfway point. But they've really been hanging over the track since the series returned to the mountains in 2013. A fatal crash. A promising career wrecked by paralysis. And again Sunday, a first-lap demolition derby that sent another driver to the hospital and stirred an angry mob howling for IndyCar to get the heck out of town once and for all. It may be a moot point, IndyCar and Pocono don't have a deal for a 2020 race. But for <mark>Robert Wickens</mark>, the Canadian confined to a wheelchair after last year's accident, IndyCar has no place on the 2 1/2 - mile superspeedway. \"How many times do we have to go through the same situation before we can all accept that an IndyCar should not race at Pocono,\" he tweeted. The counter argument was posed from the Australian snapping victory lane photos inside a cramped Pocono media center as rain pounded the track outside. Will Power was in the right position Sunday to claim the win when lightning struck in the area to not only win the race, he ended the potential for his first winless season since 2006 and he took the checkered flag at Pocono for the third time in four years. \"I really hope we come back, I do,\" Power said. \"It's hard for us to find good ovals that suit our cars.\" IndyCar at Pocono has turned into perhaps the scariest race day in auto racing, 500 miles of danger for drivers on the 2 1/2 - mile track and white knuckles and clasped hands for anyone watching the event. The green flag had barely been dropped when 2017 Indianapolis 500 winner Takuma Sato used an aggressive - arguably foolish - move to trigger a wreck that sent Felix Rosenqvist to the hospital. Sato tried to shoot a gap on the first lap, cut off Alexander Rossi and connected with Ryan Hunter-Reay in a crash that left cars and debris strewn across the track. Sato's car landed upside down on Hunter-Reay's Honda. \"I can't even begin to understand how after last year Takuma thinks that's acceptable,\" Rossi said. \"It's disgraceful.\" Rosenqvist hit the fence nose first and his car slammed back on the track. Rosenqvist did not suffer life-threatening injuries and was cleared. \"Definitely feel lucky escaping without any serious injuries after visiting the catch fence there,\" he tweeted. ___"}]