[{"articleID": "2017120621_00117709_W", "names": {"Daniel Benjamin": ["Q1160048", "Q5216534"]}, "date": "2017-12-06", "url": "http://www.dailysabah.com/mideast/2017/12/07/majority-of-americans-oppose-moving-embassy-to-jerusalem-poll-suggests", "content": "Majority of Americans oppose moving embassy to Jerusalem, poll suggests DAILY SABAH WITH AGENCIES YOUR E-MAIL VERIFICATION CODE U.S. President Donald Trump's controversial move on Jerusalem has received strong opposition from the U.S. public, including Republicans, a survey has revealed. According to a new poll conducted by the University of Maryland, The Middle East and Russia: American attitudes on Trump's foreign policy, found that a strong majority of Americans (63 percent), including 44 percent of Republicans oppose moving the U.S. embassy in Israel from Tel Aviv to Jerusalem. Interestingly, the poll, which was conducted last month, suggests that an overwhelming majority of Americans, 81 percent, including 71 percent of Republicans, favor President Trump relying on experts for Middle East diplomacy instead of his son in law and former lawyer. \"Among Democrats, those who want the U.S. to take neither side of the conflict have grown to 77 percent from 69 percent last year, while the number of those who want to take Israel's side outright has dropped to only 13 percent, from 17 percent. In contrast, a majority of Republicans, 58 percent want the U.S. to take Israel's side,\" the report said. The poll also revealed that 57 percent of Democrats want to see sanctions or \"more serious action\" over Israeli settlement construction, while 43 percent of Americans support imposing sanctions or more serious actions. The competing claims to East Jerusalem, the section of the city captured by Israel in 1967, have frequently boiled over into deadly violence over the years. East Jerusalem is home to the city's most sensitive Jewish, Muslim and Christian holy sites, as well as its 330,000 Palestinian residents. The U.S. has never endorsed Israel's claim of sovereignty over any part of Jerusalem and has insisted its status be resolved through Israeli-Palestinian negotiation. The mere consideration of Trump changing the status quo sparked a renewed U.S. security warning Tuesday. America's consulate in Jerusalem ordered U.S. personnel and their families to avoid visiting Jerusalem's Old City or the West Bank and urged American citizens, in general, to avoid places with increased police or military presence. Trump, as a presidential candidate, repeatedly promised to move the U.S. Embassy. However, U.S. leaders have routinely and unceremoniously delayed such a move since President Bill Clinton signed a law in 1995 stipulating that the U.S. must relocate its diplomatic presence to Jerusalem unless the commander in chief issues a waiver on national security grounds. Key national security advisers, including Secretary of State Rex Tillerson and Defense Secretary Jim Mattis, have urged caution, according to officials, who said Trump has been receptive to some of their concerns. According to a Reuters report on Tuesday, several U.S. officials had said on condition of anonymity that news of the plan to recognize Jerusalem as Israel's capital had kicked up resistance from the State Department's Near Eastern Affairs Bureau (NEA), which deals with the region. \"Senior [officials] in the NEA and a number of ambassadors from the region expressed their deep concern about doing this,\" said one official, saying that the concerns focused on \"security .\" Another U.S. official said the consensus the U.S. intelligence estimates on the U.S. recognition of Jerusalem as Israel's capital was that it would risk triggering a backlash against Israel and also potentially against U.S. interests in the Middle East, the Reuters report added. Also quoted in the same report, <mark>Daniel Benjamin</mark>, a former U.S. counterterrorism official now at Dartmouth University, had a simple message: \"This is playing with fire .\" "}, {"articleID": "2020010814_00048406_W", "names": {"Marco Silva": ["Q20118419", "Q57025699", "Q6757714"], "Frank Lampard": ["Q41533", "Q461633"]}, "date": "2020-01-08", "url": "https://www.westsussextoday.co.uk/sport/football/how-the-carlo-ancelotti-factor-will-impact-brighton-and-hove-albion-at-everton-this-saturday-1-9194981", "content": "How the Carlo Ancelotti factor will impact Brighton and Hove Albion at Everton this Saturday The arrival of new manager Carlo Ancelotti has given all at Everton at huge boost Published: 12:50 Wednesday 08 January 2020 Share this article By Jacob Panons Brighton and Hove Albion will face an Everton team on a high this Saturday at Goodison Park thanks to the recent appointment of Carlo Ancelotti. The Italian has won two of his four games in charge and has helped rejuvenate the Toffees after a sticky spell under <mark>Marco Silva</mark>. Ancelotti is a man who needs little introducing. The manager has worked at Juventus, AC Milan, Chelsea, Paris Saint-Germain, Real Madrid, Bayern Munich, and Napoli to name a few and during his exceptional career has won three Champions Leagues, four domestic league trophies, seven domestic cups, and 20 trophies overall. Ancelotti has been praised in the past for his versatility in choosing formations and the personal relationships he builds with his players. The Italian is known to be fond of playing two up front and this has been evident in his start at Everton with Dominic Calvert-Lewin featuring alongside either Richarlison or Moise Kean in three of the manager's four games in charge. Life at Goodison Park has begun relatively well for Ancelloti as he won his first two games in charge 1-0 at home to Burnley and 2-1 away at Newcastle. His first defeat came in a 2-1 loss away against current champions Manchester City but the club's most recent loss against Liverpool in the FA Cup has drawn the most criticism. An almost full-strength Everton side lost 1-0 at Anfield against a youthful Liverpool team with seven players featuring under the age of 23. Following the game Ancelotti said he spoke to his players about what they must do to find a solution and labelled their second-half performance \"not good enough .' Throughout Ancelotti's 25-year managerial career his focus has been to sustain European and domestic success which he achieved winning a plethora of silverware. Everton is a new challenge for Ancelloti as his new role is to help revitalise an underperforming Everton-side with the long term aim of breaking into the top-6. Dawson strike proves Horsham is the place to see incredible goals He had a similar objective at Napoli as the side looked to threaten Juventus' recent dominance in Italy. He somewhat achieved this with Napoli finishing second in his first season but the club were still 11-points behind Juventus. Ancelloti eventually ended up getting sacked last month after a 4-0 win against Belgian-side Genk as Napoli secured their place in the knockout stages of the Champions League. Some saw Ancelloti's sacking as harsh but Everton fans won't be complaining as they have appointed arguably one of the greatest managers in world football. The Italian is no stranger to praise with Chelsea manager <mark>Frank Lampard</mark> complimenting his former manager following Ancelotti's dismissal at Napoli. <mark>Lampard</mark> said:\" I have huge respect for him...I think he can work anywhere in the world at the top level. \"Pep Guardiola is another Premier League manager who also admires the Italian. He said:\" Carlo is one of the smartest guys. He is always able, it doesn't matter the team, to make them work. I think it is incredible news for English football (that) he is back and I think he can make an incredible job there. \"Bringing in the Italian as manager has shown real ambition from the Toffees and after years of investment it looks as if their dream of consistent European football may be on the horizon. Brighton can expect organised, direct football from Everton on Saturday but the team comes alive in the final third. This has been Ancelloti's philosophy for many years and it has been evident in Everton's start under him. Calvert-Lewin is a player who will be on Brighton's radar going into the game as the striker has scored three goals in his four games under Ancelotti. The striker also scored at the Amex back in October so Graham Potter and his side already know the damage he can cause. Calvert-Lewin has also praised Ancelotti since his arrival telling Match of the Day:\" He has a presence about him. That is just from the man he is and what he has done in football. To be working with him on a daily basis is a privilege. \"Brighton could jump up to tenth on Saturday if results go their way and Potter will be focused on getting back-to-back wins against the Toffees whereas Ancelloti will be looking to get his team back to winning ways. Trending Chelsea and Manchester City still in title race, Liverpool's miserable run continues - Five talking points from the Women's Super League weekend BBC pundit gives a thrilling prediction for Brighton and Hove Albion's FA Cup tie against Sheffield Wednesday Plans for 460 homes north of Burgess Hill given thumbs up Eighty arrests made by Sussex Police on New Year's Emergency works to shore up rail embankment near Haywards Heath The Essentials"}, {"articleID": "2009092307_00021898_W", "names": {"David Wilson": ["Q11320682", "Q167028", "Q16849502", "Q19594138", "Q21453228", "Q26329468", "Q2642471", "Q27683615", "Q28914261", "Q29033812", "Q29643806", "Q30122994", "Q3018168", "Q3019005", "Q3703375", "Q39071263", "Q39073912", "Q42841755", "Q5234991", "Q5241195", "Q5241198", "Q5241199", "Q5241202", "Q5241203", "Q5241205", "Q5241209", "Q57025576", "Q676969"]}, "date": "2009-09-23", "url": "http://maldonandburnhamstandard.co.uk/uk_national_entertainment/4643307.Mobo_award_for_children_s_charity/?ref=rss", "content": "mobo award for children's charity (from maldon and burnham standard) charity war child is to be honoured at the mobo music awards for its work in helping children in war-torn regions of the world. the organisation, founded in 1993 by british film-makers bill leeson and <mark>david wilson</mark>, has helped thousands of vulnerable youngsters affected by war and will be given this year's bemobo award. the event, which takes place in glasgow on wednesday september 30, will also feature the first performance of the charity's first single, i got soul, featuring an array of the uk's emerging music stars - including tinchy stryder - collectively known as the young soul rebels. stryder, 22, said he was delighted to perform the track live at the mobo awards with n-dubz, chipmunk, vv brown, ironik, bashy, frankmusic, mpho, mclean, kid british and egypt. he said: \"it's our first time performing together and singing the track, so i'm excited. i'm going to take it in my stride .\" as soon as i was asked to be involved with war child, i immediately said yes as i believe forcing children to fight in wars with no choice is completely wrong. it's a good cause because it's all positive, there's nothing negative about it. \"search for hundreds of jobs in essex and beyond dating bring love into your life! find a date in essex homes for sale, and to let, in essex"}, {"articleID": "2015072812_00020766_W", "names": {"Ian Mcallister": ["Q16145493", "Q21455040", "Q5982242", "Q5982243"]}, "date": "2015-07-28", "url": "http://timescolonist.com/business/province-shutters-mine-over-spills-1.2013568", "content": "Province shutters mine over spills Gordon Hoekstra / Vancouver Sun Previous Next The province has shut down the small Yellow Giant underground gold mine on Banks Island in northwest B.C. for spilling pollution on land and into creeks, lakes and a wetland. The B.C. environment ministry said the discharge reached the ocean through a creek, several beaver-dam-created wetlands and Banks Lake before entering the ocean at Surrey Bay, but it is not believed it will harm humans or animals. The Yellow Giant incident is the latest of several mine-waste spills--although much smaller in magnitude--since the catastrophic dam failure at Imperial Metals' Mount Polley gold and copper mine in August 2014. There have been small spills at the Myra Falls and Copper Mountain mines in the past year. First Nations and conservationists are concerned about the effect of this latest spill on animals and aquatic life, including salmon, at the island about 100 kilometres south of Prince Rupert. Pacific Wild executive director <mark>Ian McAllister</mark>, who lives in the area, visited the island on Sunday to get a first-hand look. Although he was blocked from the mine site by company personnel, a drone flight he carried out showed migrating salmon splashing in Banks Creek on their way to Banks Lake. There were also salmon jumping in the ocean at the mouth of the river, six to nine metres wide, he said, noting the area is rich in biodiversity, home to herring, a unique population of sandhill cranes and genetically distinct wolves. \"Whatever discharged into the system has gone into what appears to be a very productive salmon river,\" <mark>McAllister</mark> said. Gitxaala First Nation chief Clarence Innis said they will be launching legal action against Banks Island Gold and the province to ensure environmental damage caused by the spill is cleaned up. The area is an important salmon area for the Gitxaala, as well as for other foods such as seaweed gathering, he said. \"B.C. has to stop letting this industry essentially self-regulate themselves and start holding them accountable,\" Innis said Sunday, adding they plan to carry out their own assessment of the spill. Toxicity testing by a third-party laboratory on undiluted tailings effluent showed 100 per cent survival for rainbow trout and Daphnia magna (sometimes called a water flea), according to the environment ministry. \"Based on the toxicity test results, the distance to the ocean, the tendency for suspended sediments to settle out in wetlands, and dilution capacity of Surrey Bay, there is no reason to believe that there would be any risk to humans or animals,\" ministry spokesman David Karn said in a written statement. The environment ministry has ordered the company to clean up the spill, monitor its effects and come up with a long-term plan to ensure it does not happen again. The Yellow Giant mine, owned by Vancouver-based Banks Island Gold, went into commercial production in January. On July 15, the Ministry of Energy of Mines issued a shutdown order to the mine that did not become public until late last week. \"[The mine] is shut down until an updated water management plan (including all water sources from exploration sites), tailings management plan, and erosion and sediment control plans are provided and accepted by the chief inspector of mines,\" ministry spokesman Dan Gilmore said in a written statement Sunday. That shutdown order followed a July 10 order from the environment ministry for Yellow Giant to stop releasing pollution into the environment. The province said the company had \"unauthorized\" discharges of effluent in March and also effluent and tailings discharges in June and again in July. & copy; Copyright Times Colonist \"This should be not an election issue,...Jul 25, 2015 Get the day's top Times Colonist headlines emailed to you every day at 9 a.m. Markets The Times Colonist is looking for people to deliver flyers every Thursday...Your timescolonist.com"}, {"articleID": "2012100920_00070920_W", "names": {"Mike Miller": ["Q16185439", "Q16213405", "Q19667639", "Q2064643", "Q25190524", "Q380541", "Q6848025", "Q6848026", "Q6848027", "Q6848031"]}, "date": "2012-10-09", "url": "http://wgnradio.com/sports/breaking/sfl-miami-heat-nba-china-s100912,0,6892922.story?track=rss", "content": "with his players' internal clocks turned upside down by the 12-hour time difference between south florida and beijing, legs right. the heat held a short workout at the mastercard center before moving on to some sightseeing at the summer palace and great wall in advance of thursday's exhibition against the los angeles clippers in beijing. after sitting out sunday's preseason-opening road loss to the for wade, a thursday appearance is particularly significant, with his new li-ning line of sneakers to formally be unveiled wednesday in beijing. \"i hope so,\" wade told heat tv in beijing, when asked if thursday would mark his return from july arthroscopic surgery on his left knee. he also sat out last wednesday's intra-squad scrimmage at americanairlines arena. \"if i continue to respond the way it is, and my trainers and doctors give me a go-ahead to play, i would love to get out there and at least play at least some minutes, try to get my conditioning .\" the biggest thing is to get my legs back and my conditioning back. hopefully i can be at the start of that journey soon. \"spoelstra would not commit yet to a thursday appearance by wade, sunday having started <mark>mike miller</mark> in place of wade\" we want to be patient, \"spoelstra said,\" we want to be smart, but we want to be aggressive, as well. so we start working a little more each day. but we're still at a point where we're reading it day to day. \"the heat arrived shortly before 10 p.m. beijing time monday, after a 14 1/2 - hour flight from atlanta, then reported for tuesday's practice at 9 a.m. lebron james said,\" which should happen at this point. but we worked through a lot of it today. \"spoelstra said it was important to get back on the court .\" we wanted to get 'em out of bed, get up 'em up and running, and sweat and get some conditioning in, \"he said .\" but, at the same time, we didn't want them to just come in here and run lines. we wanted to get some thinking. \"so we worked on some of our execution, details of our offense, moving the ball, those habits that will ring true the entire year. we had a productive day. it's only about an hour and 20 minutes, but it is fast-paced without a break .\" spoelstra said to expect more at wednesday's practice. \"we didn't go contact today. we'll get to that tomorrow,\" he said. \"but after being on an airplane for 16 hours and then going to bed last night, sleeping for another four, five, six, whatever it was, the guys were anxious to get in here and run .\" wade said the sessions are beneficial. \"everything is coming along well,\" he said. \"i'm happy with the way i've been able to progress since camp started .\" bill leff busts the top ten food myths, and discusses an unbelievable food truth bill leff talks with actor kevin sorbo about his battle back from a medical condition that nearly killed him"}, {"articleID": "2015042112_00018389_W", "names": {"Jon Gilbert": ["Q6270757", "Q6270762"]}, "date": "2015-04-20", "url": "http://dunstabletoday.co.uk/cracking-down-on-stalkers-1-6698741", "content": "Use another account with your email account Almost Done! {* #socialRegistrationForm *} {* socialRegistration_firstName *} {* socialRegistration_lastName *} {* socialRegistration_emailAddress *} {* socialRegistration_displayName *} We have sent a confirmation email to {* traditionalRegistration_firstName *} {* traditionalRegistration_lastName *} {* traditionalRegistration_emailAddress *} {* traditionalRegistration_password *} {* traditionalRegistration_passwordConfirm *} {* traditionalRegistration_displayName *} Enter your email and we'll send you a link to reset your password. {* traditionalSignIn_emailAddress *} We didn't recognise that password reset code. Enter your email address to get a new one. {* traditionalSignIn_emailAddress *} {| existing_displayName |} {| existing_provider_emailAddress |} {* traditionalSignIn_emailAddress *} {* mergePassword *} Where do you live? Enter your postcode so we can keep you up-to-date with the latest local news and exciting deals. Verification link has expired, please sign in and click on resend verification email from your profile page. Beds Police is supporting a stalking awareness initiative taking place this week. Stalking and harassment affects millions of people in the UK and can have a devastating impact on victims, in some cases forcing them to change their daily routines and behaviours. Bedfordshire Police's investigations relating to stalking and harassment can sometimes be linked to some of the most serious crimes the force deals with, but it is keen to help residents spot the signs and ensure any suspicious activity is reported at an early stage. Stalking can be defined as persistent and unwanted attention causing a victim to feel pestered and harassed, and can affect people of all ages, ethnic origins and genders. Figures suggest 80 per cent of stalking victims are women, while one fifth (20 per cent) are men. In more than 80 per cent of cases, the victims are stalked by someone they know - whether it be a former partner, work colleague, family member or acquaintance. In addition, the threat posed by advances in technology has allowed for stalking to translate from the real world into cyberspace. As well as physical stalking behaviours such as following and watching victims, the crime now also takes place in the virtual world, with offenders targeting victims through persistent calls, disturbing emails and text messages and social media abuse, sometimes referred to as \"trolling'. Detective Superintendent <mark>Jon Gilbert</mark>, leading Bedfordshire Police's Cybercrime team, said:\" Stalking has become a cyber-enabled crime, allowing offenders to seek out their victims using social media and various technological means. \"Many of us now live our lives through Facebook and Twitter, but for those who have been a victim of trolling or persistent messaging, these social networks are a platform for distressing and often terrifying harassment .\" My message to stalkers - whether you are acting in real life or online - is that if you follow this threatening course of conduct, beware that this issue will be reported to us and we will take action against you. \"Bedfordshire Police will be posting information and advice relating to stalking throughout this week, using its Facebook page www.facebook.com/bedspolice and Twitter account @ BedsPolice. To follow all the tweets surrounding the initiative, follow the hashtag #NSAW 2015. The posts will feature facts and tips to encourage victims to come forward and report crimes, as well as personal safety messages for all Bedfordshire residents to help them spot the signs of stalking. If you think you are being stalked, seek advice from Bedfordshire Police or report an incident by calling 101. Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Create your own advertisement or send someone a special message. Media House, 39 Upper George Street, Luton clicking here. If you remain dissatisfied with the response provided then you can contact the IPSO by clicking here. Dunstable Today provides news, events and sport features from the Luton area. For the best up to date information relating to Luton and the surrounding areas visit us at Dunstable Today regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Digital Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2012030916_00050713_W", "names": {"Jimmy Allen": ["Q30122330", "Q5999007"], "Mark Richards": ["Q1470097", "Q18127532", "Q27036453", "Q29033995", "Q6769416"]}, "date": "2012-03-09", "url": "http://daytondailynews.com/business/appleton-layoffs-to-start-in-may-company-confirms-1341141.html?cxtype=rss_business", "content": "thomas gnau, staff writer updated 11:09 am friday, march 9, 2012 layoffs of 330 employees at appleton papers' west carrollton plant will begin in may, the company confirmed friday. appleton is implementing its recently announced paper supply agreement with domtar and is no longer referring to that agreement as \"tentative,\" bill van den brandt, a spokesman for the appleton, wisc.-based company, said. \"that adjective is being removed,\" van den brandt said. he could not give a more precise timeframe for when layoffs will start, but he said that will be the subject of talks set to start monday between appleton and the united steelworkers. on feb. 23, appleton first announced that it will lay off 330 workers at its 1030 w. alex bell road mill as it agrees to take base paper from domtar, a canadian producer that has supplied appleton for decades. about 100 workers will remain at the plant, pending an agreement with local 266 of the steelworkers, which represents local appleton workers, the company has said. the local plant would become a thermal paper coating facility. while there have been discussions so far between appleton and the union, talks on the \"effects\" of the company's decision will begin in earnest on monday, the company said. those talks will turn to worker severance packages, timeframes and more. \"it's really all about respecting the people involved,\" van den brandt said. <mark>jimmy allen</mark>, president of steelworkers local 266, agreed that company-union talks will now turn to how workers will be impacted. \"we're set to begin our effects bargaining this coming monday,\" he said. \"you can probably imagine,\" <mark>allen</mark> added when asked about the mood of workers at the plant. this week in a conference call with industry analysts, <mark>mark richards</mark>, appleton chairman, president and chief executive, said the steelworkers will not have \"veto power\" over the company's supply agreement with domtar or its decision to cut 330 jobs from the west carrollton plant. \"we intend to help all affected west carrollton mill employees make a smooth transition and we look forward to completing the effects bargaining process in a productive and timely fashion,\" kerry arent, appleton human resources vice president, said in the company's statement friday. user comments are not being accepted on this article."}, {"articleID": "2019021517_00295002_W", "names": {"James Jordan": ["Q10305089", "Q6136966", "Q6136968", "Q6136972"], "Ola Jordan": ["Q5892333", "Q7082861"], "Alex Jones": ["Q16235485", "Q19559933", "Q20666729", "Q26330355", "Q2641401", "Q319121", "Q47113851", "Q4717247", "Q4717250", "Q4717251", "Q4717252", "Q4717253", "Q4717255", "Q50365540", "Q5665987"]}, "date": "2019-02-15", "url": "https://www.radiotimes.com/news/tv/2019-02-15/james-jordan-dancing-on-ice-contestant-profile/", "content": "Dancing on Ice contestants: Who is former Strictly pro <mark>James Jordan</mark>? The former Strictly dancer denies he'll have an \"unfair advantage\" on the ice Share on Facebook Share on Twitter Share on Pinterest Share on Google Plus Share on Reddit Email to a friend Friday, 15th February 2019 at 4:17 pm Dancing on Ice 2019 contestants: <mark>James Jordan</mark> Age: 40 Advertisement Known for: Being a former Strictly Come Dancing professional dancer, during which time his partners included Denise Van Outen and Vanessa Feltz. He also came third in the 14th series of Celebrity Big Brother back in 2014. Instagram: @ jamesjordan1978 Twitter: @ the_jamesjordan Professional dance partner: Alexandra Schauman Dancing on Ice 2019 contestants: who has joined the celebrity line-up? Dancing on Ice 2019: pairings revealed Stay up to date with the RadioTimes.com newsletter Why is <mark>James Jordan</mark> famous? <mark>Jordan</mark> spent eight years as a Strictly pro until 2013--he first reached the finals with his partner Dr. Pamela Stephenson back in 2010, and then again with Denise van Outen in 2012. Along the way he also coached Gabby Logan, Vanessa Feltz, <mark>Alex Jones</mark>, Zoe Lucker, Cherie Lunghi and Georgina Bouzova. <mark>Jordan</mark> is married to another fellow Strictly dancer, <mark>Ola Jordan</mark>, with whom he first turned professional. View this post on Instagram Great night last night with @ olajordan at the \"Millies' Recognition to the amazing people in the Armed forces who help make this country a better place for us. A post shared by <mark>James Jordan</mark> (@ jamesjordan1978) on Dec 14, 2018 at 9:21 am PST <mark>Jordan</mark>, a\" bad boy \"of Strictly Come Dancing, nowadays frequently offers critiques on the show--and isn't one to shy away from controversy...He recently criticised Stacey Dooley's Showdance routine to Land of a Thousand Dances from the Strictly finale:\" It was a complete mess and didn't understand the beginning AT ALL. NOT GOOD EVEN FOR A NON DANCER. \"Stacey mmmmm I normally love Kevin's Choreography but I just didn't get this at all. A show dance for me should be full of lifts and an exciting and a mix of dances It was a complete mess and didn't understand the beginning AT ALL NOT GOOD EVEN FOR A NON DANCER #Strictly--<mark>James Jordan</mark> (@ The_JamesJordan) December 15, 2018 His Celebrity Big Brother appearance in 2014 saw him invited back for the All-Star series in 2017, finishing in 13th place. He and <mark>Ola</mark> have also cropped up on Your Face or Mine, Through the Keyhole and a celebrity edition of Total Wipeout. <mark>Jordan</mark> was the third contestant to be announced for Dancing on Ice 2019, and he told Radio 5 Live that his dance background wouldn't give him any\" unfair advantage \".\" People are going to probably say I've got an unfair advantage but when I got on the ice, I actually shocked myself how bad I was, \"he said. View this post on Instagram Having fun today on the ice with one of the coaches Mark.... And I have no idea what my partner @ alex_lukasz was trying to say but it sounded like a mating call from a bird of prey?? I think she was eating AGAIN!!! A post shared by <mark>James Jordan</mark> (@ jamesjordan1978) on Dec 14, 2018 at 9:06 am PST Advertisement\" I can dance but I'm a lot older than I used to be, \"he continued .\" I want to be able to impress Torvill and Dean more than anyone else, but I'm a lot worse than I thought I'd be. \"Sign up for the free RadioTimes.com newsletter Share on Facebook Share on Twitter Share on Pinterest Share on Google Plus Share on Reddit Email to a friend Tags Entertainment <mark>James Jordan</mark> Dancing on Ice"}, {"articleID": "2014103121_00005633_W", "names": {"Sean Maloney": ["Q50909122", "Q7441191", "Q7441192", "Q7441194"]}, "date": "2014-10-31", "url": "http://www.hvpress.net/news/130/ARTICLE/14340/2014-10-31.html", "content": "October 31st, 2014 <mark>Sean Maloney</mark> is Your Man for Congress If you are looking for a Congressional representative that has demonstrated he is focused on helping his constituents, then search no further. <mark>Sean Maloney</mark> has been doing that for two years. If you want someone who has demonstrated he is willing to work \"across the aisle' to get something done in Congress, then <mark>Sean Maloney</mark> is your man. Congressman <mark>Maloney</mark> was instrumental in getting the EPA to complete the cleanup process for a contaminated site on the Hudson River. He and his team were key drivers to getting the EDA grant which saved 180 jobs in Newburgh and New Windsor and created the opportunity for more new jobs. <mark>Sean</mark> is a strong advocate for\" equal pay for equal work \"and for\" a woman's right to choose. \"He has authored and shepherded the Disabled Veterans Red Tape Reduction Act which shortens the wait time for veterans with disability claims. Additionally, he has been a partner in helping veterans with many other issues. Voters in the Hudson valley can expect leadership in Congress with <mark>Sean</mark>, not some silly phony baloney rhetoric from someone whose chief claim to fame is creating more polarization in Congress. Stars - Excellent Stars - Good Stars - Average Stars - Fair Stars - Poor Copyright 2006-2014 The Hudson Valley Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Copyright © 2006-2014 Hudson Valley Press."}, {"articleID": "2012041212_00114511_W", "names": {"Eric Carle": ["Q52834975", "Q606557"]}, "date": "2012-04-12", "url": "http://postbulletin.com/news/stories/display.php?id=1492878", "content": "what: ellis middle school and first-grade student artwork honoring <mark>eric carle</mark>. where: austin public library. when: through april 30. library hours: 10 a.m.-9 p.m. mondays-thursdays; 10 a.m.-6 p.m. fridays and saturdays; 1 p.m.-5 p.m. sundays. the interior of the austin public library is a little more colorful than usual this month. it's filled with 3-d artwork, including seahorses, penguins and snakes. the art from ellis middle school sixth-graders and first-graders from austin public schools is displayed on the windows and bookshelves near the children's area. paintings by the first-graders and 3-d papier mache sculptures by middle-schoolers were completed for a collaborative art show as a tribute to children's author and illustrator <mark>eric carle</mark>. art teacher erin mikels teaches at both the elementary and middle school levels. younger students had a lesson on <mark>carle</mark> and the older ones created papier mache sculptures; the idea for an art show together was born. \"it just kind of worked out,\" mikels said. \"<mark>eric carle</mark>'s such a well-known illustrator .\" ellis students worked in small groups to make their papier mache animals. they chose a character that stood out to them from one of <mark>carle</mark>'s dozens of books. students also painted sculptures using <mark>carle</mark>'s style of texturing. the choice of characters varied, but both mikels and ellis art teacher karie covert agreed that \"mister seahorse\" was a popular one, probably because of its neon colors. first-graders made collages by painting papers and using texture tiles to create patterns. a lot of their paintings are hanging on the window at the library. also on one of the windows is a large-scale collage butterfly scene by students from covert's class. though it was a little daunting to come up with a project to collaborate with more than one grade, covert said, it seemed to fit in well and it was exciting. \"it's fun when we all get together and put something up like this,\" covert said. the older students watched a video of <mark>carle</mark> to get a better understanding of his art and his technique. they liked the characters and the freedom to be able to choose which one they would make, covert said. they have fun with it, even though the process could get chaotic and crazy, she said. \"but the end result is what makes it worth it,\" covert said. \"i just like how this came together .\" students were excited to have their art out in the community, she said, and the library is a great space for it. library director ann hokanson said she's already gotten positive comments about the display from a variety of people. families are coming in specifically to see the artwork. appraisers will return for another round of meetings with owners"}]