[{"date": "2014-04-11", "url": "http://www.brightsideofthesun.com/2014/4/11/5604800/western-conference-playoff-report-april-11th", "content": "In the comments of yesterday's playoff report an exchange with NateSuns86 led me to prepare a breakdown of all scenarios where the Suns went 2-1 over their next 3 and also 1-2 over their next 3. One of the assumptions I made in those scenarios was that Dallas would defeat San Antonio last night. So I threw it on the ground. Because I'm an adult and not a part of your system I had almost a fully flushed out word document with the new scenarios which took into account the Dallas loss - then Golden State lost to the Nuggets. That loss brought all sorts of other tiebreaker scenarios to the forefront and broke my brain entirely. But since I'm nice - here's roughly where we are tiebreaker wise: Suns/Mavericks - head to head even at 1-1, winner of Saturday's game wins the tiebreaker. Suns/Grizzlies - Grizzlies are up 3-0 on head to head and have already won the tiebreaker. Grizzlies/Mavericks - Mavericks are up 3-0 head to head and have already won the tiebreaker. Suns/Warriors - head to head is even at 2-2 so we move to the next tiebreaker for teams in the same division - division record, which is clinched by GSW already (10-5 to 7-8). Suns/Mavs/Grizz - the tiebreaker is record in games among the three teams, Dallas is 4-1, Memphis is 3-3, and Phoenix is 1-4. Each team has 2 to play. The only way this goes well for the Suns is if Memphis loses their last 2 and the Suns win their last 2 but if that happens there won't be a 3 way tie anyway. Suns/Grizz/Warriors - same three way tiebreaker. Memphis is 5-2 (2-2 against GSW, 3-0 against Phoenix), Golden State is 4-4 (2-2 against Phoenix/Memphis), and Phoenix is 2-5 (0-3 against Memphis, 2-2 against GSW). Suns would be dead here. Suns/Mavs/Warriors - same three way tiebreaker. Golden State is 5-3 (2-2 against Phoenix, 3-1 against Dallas), Phoenix is 3-3 (2-2 against Golden State, 1-1 against Dallas), and Dallas is 2-4 (1-1 against Phoenix, 1-3 against Golden State). In the highly unlikely (and potentially impossible event the Suns lose to Dallas and tie these teams, they're done. If any of that is wrong feel free to correct me - I'm sitting in a staff meeting at the moment. Thursday April 10th Key Western Conference Results: Recap) - <mark>Tony Parker</mark> didn't play for the Spurs but it didn't matter. Hell Patty Mills took 25 shots and only scored 26 points and it still didn't matter (although it helped he shot 6/11 from three). The Spurs are really good at winning games. Monta Ellis led the Mavericks with 24 points and you're not reading this part so I'm just going to go into a shopping list - I need cereal and milk. I like cereals with cartoon mascots on the box. Recap) - I'll admit I barely even bothered to watch this game because I thought the Full Squad would take care of business. The Nuggets trailed this game by as many as 12 in the 3rd quarter but the heavenly ascension of Timofey Mosgov (23 points and 29 - yes 29 - rebounds) allowed them to keep it close. It looked like Golden State was going to survive when Steph Curry hit a floater with 5 seconds left but Denver got the ball into Kenneth Faried who hit a shot in the lane to take the game. Steph Curry led Golden State with 24 points and Klay Thompson added 21. LOST 1 - Memphis 46 Friday April 11th Western Conference Games of Significance: Suns @ Spurs - At this point of the morning we don't really even know who's going to play for either team. Coro reported that Dragic is questionable with an ankle injury (roughly his 10 millionth) while other reports suggest both <mark>Tony Parker</mark> and <mark>Tim Duncan</mark> are going to sit out tonight. <mark>Parker</mark> has sat the last two games while <mark>Duncan</mark> suffered a bit of a knee scare in the 1st half last night but still played 39 minutes. I don't think there's any shame in saying we have no clue what's going to happen tonight, so I'll say Spurs by 10. 76ers @ Grizzlies - I hear a lot of you say things like \"anything can happen any night in the NBA\" and \"they're all NBA players\" - but when your team has won 2 games since February started I don't think any of that applies. The Sixers are bad and they should feel bad. Memphis will win this game by 73. Need a morning laugh? Go check out the Philly roster. Warriors @ Lakers - Won't some other playoff contender sleepwalk through a game with a bad Lakers team and take a horrible loss? If so I'd really appreciate it. The odds are against Golden State suffering a second consecutive bad loss but at least the Lakers are sort of an NBA team - unlike Philly. Phoenix Suns playing better than Dallas Mavericks and Memphis Grizzlies, by the? numbers Phoenix Suns Channing Frye nominated for NBA Sportsmanship? Award Forgot password? We'll email you a reset link.", "articleID": "2014041123_00080590_W", "names": {"Tony Parker": ["Q193108", "Q19588477", "Q52151028", "Q52899347"]}}, {"date": "2014-04-15", "url": "http://www.edie.net/news/news_story.asp?id=26156", "content": "IKEA announces largest renewable energy investment with US wind farm In 2013, IKEA produced 1,425 GWh of energy from renewable sources, equivalent to 37% of the company's total energy needs IKEA has announced its largest global renewable energy investment to date, purchasing a 98 megawatt wind farm in Illinois, US. Government's new solar strategy aims to turn \"rooftops into power stations' The wind farm is expected to generate up to 380GWh of renewable energy each year - the equivalent amount of electricity to meet the needs of 34,000 average American households. IKEA's chief sustainability officer <mark>Steve Howard</mark> said:\" The US has amazing wind and sun resources that will never run out. We are delighted to make this investment - it is great for jobs, great for energy security, and great for our business. Importantly, it's great for the future of our climate \". The announcement is the most recent in a series of renewable energy investments, seeing the company now committing to own 206 wind turbines worldwide. IKEA has also installed 550,000 solar panels on its buildings in nine countries. In the US, these investments include solar installations completed on 90% of IKEA locations across 20 states, with a total of 165,000 solar panels providing 38MW installed capacity. According to the company, it produced 1,425 GWh of energy from renewable sources, including wind and solar, in 2013 - the equivalent to 37% of the company's total energy needs. As part of its sustainability strategy, the company has allocated $2bn to invest in wind and solar until 2015 to get closer to its goal of producing 100% as much renewable energy as the total energy it consumes by 2020. IKEA also reports that since 2010, the company has saved nearly $55m through energy efficiency efforts in its stores and warehouses. IKEA's forest management certificate was suspended for its operations in Karelia, Russia Simply copy and paste the HTML below to link to this story Energy efficiency - tips for better measurement, control and efficiency We use cookies to make this site as useful as possible. They are small text files we put in your browser to track and assist usage of our site but, with the exception of cookies that help you log in, they don't tell us who you are. Our site also serves third party cookies, including Google Analytics cookies which are used to produce traffic reports and may be used to serve advertising through Google Adwords or another network, after you have left our site.", "articleID": "2014041518_00057267_W", "names": {"Steve Howard": ["Q23670647", "Q2457386", "Q7612886"]}}, {"date": "2014-04-15", "url": "http://www.independent.com/news/2014/apr/15/morua-pleads-guilty-dui-and-fatal-hit-and-run-char/", "content": "Morua Pleads Guilty to DUI and Fatal Hit-and-Run Charges Will Be Sentenced to 20 Years to Life in Prison Judge James Voysey (center) accepts guilty pleas from Raymond Morua (right) with attorney Darryl Genis Morua appeared in court dressed in a dark suit and shed silent tears as he pleaded guilty to felony charges of gross vehicular manslaughter while intoxicated (which carries a sentence of 15 years to life) and fleeing the scene (which carries a sentence of 5 years). The terms will be served consecutively, and the crimes count as a strike on his record. Morua also admitted to two prior DUI convictions. He will be formally sentenced on May 28, and has agreed to issue a formal apology to the Dies family, pay restitution, and participate in an anti-drunk driving video. You're right John. We should all just kill ourselves and let nature take back the earth and it will be like we were...Bottom Line: <mark>Bill Brown</mark> blew it badly by NOT closing down the streets as authorized by the Supes. His excuse that it could...Draxor on \"Teams Retrieve Body of Man Swept out to Sea During Baptism\" blahblahmoreblah on \"Man Accused of Assaulting Officer Competent to Stand Trial?\" Either Atascadero or Patterson for this guy, but DO NOT DISMISS CHARGES AGAINST HIM. The guy is one of those people whom \"trouble...Small water price to pay for the dam totally effing up the Santa Ynez river and its steelhead habitat. The fish were here...How could such a high-density utopia flounder so badly. Perhaps we need an\" I.V. Injunction \"where no one under 25 can go to...AZ2SB on\" Man Accused of Assaulting Officer Competent to Stand Trial? \"The man has issues, which our mental health system will probably never be able to resolve.", "articleID": "2014041602_00014782_W", "names": {"Bill Brown": ["Q16188871", "Q2667644", "Q27147689", "Q4908278", "Q4908280", "Q4908282", "Q4908284", "Q4908288", "Q4908289", "Q4908293", "Q861987"]}}, {"date": "2014-04-16", "url": "http://www.hindustantimes.com/elections2014/state-of-the-states/mulayam-slams-ec-for-ban-on-azam-khan-speeches/article1-1208876.aspx", "content": "Mulayam slams EC for ban on <mark>Azam Khan</mark> speeches Samajwadi Party chief Mulayam Singh Yadav on Wednesday condemned the Election Commission for banning election campaign speeches by prominent Muslim leader of the state <mark>Azam Khan</mark>, saying the poll watchdog was \"taking impractical decisions sitting indoors\". <mark>Khan</mark> had told an election rally in Ghaziabad on April 4 that the Indian soldiers who won back Kargil were Muslims. Narendra Modi aide <mark>Amit Shah</mark> from making poll speeches in the state. <mark>Shah</mark> had exhorted a gathering of Hindus in Muzaffarnagar, which was hit by religious riots last year, to take revenge for the riots through voting. Addressing a rally in Agra, Yadav accused the commission of being unaware of the ground realities of politics. He said there was nothing wrong in <mark>Khan</mark>'s speeches. \"Muslims have made supreme sacrifices for the nation. One such example is that of Abdul Hameed (martyred in the 1965 India-Pak war),\" he said. Yadav also slammed the National Commission for Women (NCW) on serving a notice on him for a controversial remark on rape. He described the notice as an insult to him. \"I am being painted as anti-woman when, in fact, I have gone to prison to safeguard women's rights. Yet, notices are being served on me by the Women's Commission,\" he said. In Moradabad last week, he had said death penalty was too harsh for those found guilty of rape. Referring to the Shakti Mills rape cases in Mumbai, where death penalty was awarded to the three accused youths who were repeat offenders, Yadav had reportedly said \"boys err at times\". \"I had only talked against fake cases,\" he clarified in Agra on Wednesday. He called for action against those lodging fake cases of sexual assault. \"I have given the reply to the notice served on me. It is a strong one. A counter is awaited,\" he informed the gathering at CTO ground in Agra. Happening in 2014 LS elections: Priyanka Gandhi hits headlines more than ever before Priyanka Gandhi targets Varun, says Lok Sabha elections not a family tea party Varun Gandhi says Priyanka has crossed lakshman rekha of decency", "articleID": "2014041621_00037279_W", "names": {"Amit Shah": ["Q19946588", "Q4746875", "Q4746876"], "Azam Khan": ["Q3202243", "Q4832169", "Q50948327", "Q946921"]}}, {"date": "2014-04-16", "url": "http://www.texastribune.org/2014/04/16/texas-could-get-millions-active-shooter-training/?utm_source=texastribune.org&utm_medium=rss&utm_campaign=Tribune", "content": "Gov. Rick Perry and other officials brief the media at Fort Hood on April 4, 2014. WASHINGTON - A law enforcement training center based at Texas State University in San Marcos may receive $15 million in federal money to support programs that train officers how to handle situations like the recent Fort Hood shooting. on Tuesday cited the recent tragedy at Fort Hood as he asked Congress to authorize the money for these training programs, called \"active shooter response training .\" \"In the face of this urgent and growing threat - when the lives of innocent people are at stake - those who stand on the front lines need our full and unwavering support,\" Holder said. Advanced Law Enforcement Rapid Response Training (ALERRT) Center is the national leader for active shooter training programs funded by the Department of Justice. It has trained more than 50,000 officers nationwide in the past decade, using more than $30 million in state and federal grant money, according to the center. Active shooter training teaches law enforcement how to isolate, distract and neutralize an active shooter. It also shows officers how to effectively enter and move around a room when they're handling a situation alone. \"The additional funds would allow us to reach more people,\" said Pete Blair, director of research at ALERRT. \"Obviously, we'd like to roll out the training to every officer we can reach - the more funding, the more officers we can reach .\" Blair said that ALERRT has a waitlist with more than 300 requests for training from 42 states. If the center receives the $15 million, ALERRT could train about 60,000 officers in 12 months, he said. In Woodway, Texas, outside of Waco, the current president of the said the potential cash influx would be a boon for first responders. \"We're very much in favor of additional support for active shooter training,\" said Yousry Zakhary, who is also director of the Woodway public safety department. \"We must be prepared for the worst .\" Zakhary said he hopes that active shooter training becomes standard for officers, \"just like learning how to drive a car or shoot a weapon .\" He said that he has visited many officers who would appreciate additional training. \"ALERRT at Texas State has been on the job for years, through these recurrent tragedies, preparing law enforcement and educators in responding to active shooters,\" said U.S. Rep. Lloyd Doggett, D-Austin, whose district includes San Marcos. \"Approving the attorney general's recommendation for more federal funding would help ALERRT to do more and protect more by giving first responders the tools they need to react as effectively and efficiently as possible .\" Holder said the average number of annual active shooter incidents has roughly tripled since 2009. \"Each of these tragic events is a heartbreaking reminder that mass shootings are all too common,\" he said. Four people were killed and 16 injured earlier this month at Fort Hood when Spc. <mark>Ivan Lopez</mark> opened fire on the base. <mark>Lopez</mark> was among the dead. In 2009, 13 people were killed and 32 were wounded in a similar mass shooting on base. The $15 million for active shooter training is part of the $27 billion Justice Department budget for the fiscal year beginning Oct. 1. It is currently being debated by Congress, with subcommittee hearings set for later this month. Disclosure: The Texas State University System is a corporate sponsor of The Texas Tribune. A complete list of Texas Tribune donors and", "articleID": "2014041704_00025424_W", "names": {"Ivan Lopez": ["Q37377397", "Q3804960", "Q5923485", "Q6100103"]}}, {"date": "2014-04-17", "url": "http://gulfnews.com/sport/football/pellegrini-blames-liverpool-hangover-for-poor-show-1.1320926", "content": "Pellegrini blames Liverpool hangover for poor show Manchester City's Belgian midfielder Vincent Kompany (C) leaves the pitch at the final whistle with Manchester City's Montenegrin forward Stevan Jovetic (L) and Manchester City's Argentinian defender Mart? n Demichelis during the English Premier League football match between Manchester City and Sunderland at the Etihad Stadium in Manchester on April 16, 2014. The match ended in a 2-2 draw. AFP PHOTO/Andrew YATES - RESTRICTED TO EDITORIAL USE. NO USE WITH UNAUTHORIZED AUDIO, VIDEO, DATA, FIXTURE LISTS, CLUB/LEAGUE LOGOS OR \"LIVE\" SERVICES. ONLINE IN-MATCH USE LIMITED TO 45 IMAGES, NO VIDEO EMULATION. NO USE IN BETTING, GAMES OR SINGLE CLUB/LEAGUE/PLAYER PUBLICATIONS Manchester: Manchester City manager Manuel Pellegrini blamed the hangover from defeat by Liverpool for his side's damaging 2-2 draw at home to the Premier League's bottom club Sunderland. City needed to win the first of their two games in hand on Liverpool to keep the pressure on the league leaders and second-placed Chelsea. But Wednesday's draw with Sunderland, in which they needed a late equaliser from Samir Nasri just to avoid defeat, means that they are still six points behind Liverpool with just one extra game to play. Pellegrini hopes that wins in City's five remaining fixtures will still give them a chance, but he admitted that his team had been unable to recover from the mental strain of losing 3-2 at Anfield last weekend. \"Of course our chances are less than before the match,\" he said. \"It was very important for us to win this match. We could not, but we will continue fighting until the end .\" I don't think we could take out of our minds the game against Liverpool. That's why the team did not play well today (Wednesday). \"It was difficult for the players to get Liverpool out of their minds. We needed more intensity, but maybe it wasn't in their minds to do it .\" They were mentally tired. It was difficult to play this game after Liverpool. \"Before the match I was very worried, because when you play against a team that might be relegated at the end of the season, they come and fight for every ball like it's the last .\" The injury suffered by Yaya Toure at Liverpool also had an impact as his absence was clearly felt in City's midfield, along with that of <mark>David Silva</mark>. <mark>Silva</mark> was ruled out with an ankle problem, but Pellegrini hopes the playmaker will be fit to face West Bromwich Albion next Monday. And despite this setback, which looked like being a defeat after Connor Wickham scored twice to put Sunderland ahead, the Chilean is not writing off City's chances of an unlikely title success He added: \"There are five more games to play and we must try and win them and see where that takes us at the end of the season, and which team has the most points .\" Maybe Liverpool and Chelsea have a better chance than our team, but we will continue fighting until the last game. It's difficult, but this wasn't the last game played today. \"Sunderland's concerns are at the other end of the table and despite a heroic effort, they are now without a win in 10 games. Goalkeeper Vito Mannone's late fumble of Nasri's shot cost them dear, but manager Gus Poyet was delighted by his players, who hit back through Wickham's brace after Fernandinho had given City a 2nd-minute lead .\" We played a great game and deserved something. I thought for a few minutes it was going to be all three points, \"said Poyet .\" The situation we are in, bottom of the table and we concede a goal after two minutes. Everyone would have expected us to collapse, but we didn't. \"The players showed how important it is, for the club and the fans, to go to the end, whatever the result is .\" I am proud of the players. They kept going and it was not easy. It's going to give us a bit more of that word I hate - confidence - and will give us a different approach on Saturday [at Chelsea]. \"The result did little to help Sunderland's plight at the foot of the table as they remain six points away from safety. But Poyet admitted that his fellow Uruguayan, Liverpool striker Luiz Suarez, will have been delighted by the outcome.", "articleID": "2014041720_00009780_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}}, {"date": "2014-04-18", "url": "http://www.3news.co.nz/Call-for-sanctions-against-North-Korea/tabid/417/articleID/340650/Default.aspx", "content": "Call for sanctions against North Korea The United Nations Security Council should slap targeted sanctions on North Korean officials responsible for grave human rights abuses, the head of a special UN inquiry says. <mark>Michael Kirby</mark> told an informal meeting of the Security Council convened by Australia, France and the US that he also wanted the reclusive regime hauled before the International Criminal Court (ICC) for prosecution. \"More monitoring and engagement alone cannot suffice in the face of crimes that shock the conscience of humanity,\" said <mark>Kirby</mark>, a former Australian High Court justice. \"Perpetrators must be held accountable, it is necessary to deter further crimes .\" North Korea did not send a representative and the meeting was snubbed by China, Pyongyang's sole major ally, and Russia. \"A new generation of senior officials now surround the supreme leader <mark>Kim Jong-Un</mark>,\" <mark>Kirby</mark> said. \"They must be made to understand that they will themselves face personal accountability if they join in the commission of crimes against humanity or fail to prevent them where they could .\" The commission of inquiry therefore recommends to the Security Council the adoption of targeted sanctions against those individuals most responsible for crimes against humanity. \"<mark>Kirby</mark> said the proposal to refer North Koreans to the ICC had found favour with most countries present, but UN diplomats said any move would likely face fierce opposition from China, the North's economic lifeline. In March, the UN's top rights body also called on the Security Council to act against officials responsible for a litany of crimes against humanity in North Korea. <mark>Kirby</mark>'s commission of inquiry on North Korea released a hard-hitting report on the nuclear-armed totalitarian state in February that documented a range of gross human rights abuses, including extermination, enslavement and sexual violence. North Korea refused to co-operate with the probe and said the evidence was\" fabricated \"by\" forces hostile \"to the country. After the meeting, US ambassador to the UN Samantha Power praised council members for joining other countries for the first time to discuss the North's\" tragic human rights situation in North Korea \".\" We heard directly from the authors of a thorough, objective and credible UN report, and from victims of North Korean atrocities themselves, \"she said.", "articleID": "2014041808_00036883_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"], "Michael Kirby": ["Q57496340", "Q6831890", "Q6831895"]}}, {"date": "2014-04-20", "url": "http://wabi.tv/2014/04/19/record-store-day-popular-bangor/?utm_source=rss&utm_medium=rss&utm_campaign=record-store-day-popular-bangor", "content": "Record Store Day Popular in Bangor Posted Saturday, April 19th, 2014 at 10:35 pm. It was 7 years ago today that Record Store Day came to life. The event was an idea from a Bull Moose employee, <mark>Chris Brown</mark>. He networked with independent record stores to start the day. Record Store Day is mean to celebrate records, record stores, and their loyal customers. Employees at the Bangor Bull Moose say it's a busy day for their store. \"It's basically like our Spring kickoff. You know, kinda like opening day in baseball...Opening day of Spring for records sort of deal,\" said Freeman Saunders, Bull Moose Employee.", "articleID": "2014042009_00036209_W", "names": {"Chris Brown": ["Q14951440", "Q155700", "Q240686", "Q2964666", "Q3022478", "Q5105666", "Q5105993", "Q5105995", "Q5105996", "Q5105998", "Q5105999", "Q5106001", "Q5106002", "Q5106003", "Q5106004", "Q5106005", "Q5106007", "Q5106008", "Q5106009", "Q5111994", "Q5112603", "Q51543886", "Q58314139"]}}]