[{"articleID": "2019090503_00125053_W", "names": {"Steve Smith": ["Q11894442", "Q16885757", "Q23418614", "Q2347298", "Q23978380", "Q28675476", "Q3499110", "Q3499112", "Q3499118", "Q3499120", "Q3499123", "Q376304", "Q463200", "Q51546050", "Q5368718", "Q7613961", "Q7613962", "Q7613964", "Q7613965", "Q7613967", "Q7613968", "Q7613969", "Q7613970", "Q7613971", "Q7613972", "Q7613974", "Q7613975", "Q7613977", "Q7613978", "Q7613979", "Q7613980", "Q7613981", "Q7613982", "Q7613983", "Q9345803", "Q943448"]}, "date": "2019-09-05", "url": "http://www.halesowennews.co.uk/sport/national/17882311.craig-overton-confident-england-can-fight-back-fourth-test/", "content": "Craig Overton confident England can fight back in fourth Test By Press Association 2019 Craig Overton 0 comment Craig Overton is confident England can seize control of the fourth Ashes Test on Thursday. Australia ended a windswept and rain-interrupted first day at Old Trafford on 170 for three with the returning <mark>Steve Smith</mark> once again frustrating them on 60 not out. Overton made his mark in the game--his first Test appearance for 18 months--by bowling the in-form Marnus Labuscahgne for a well-made 67. A jaffa @ craigoverton12!?? Scorecard/Videos: https: //t.co/rDgrysSBQA #Ashes pic.twitter.com/Yn6HnnDNat--England Cricket (@ englandcricket) September 4, 2019 Now he hopes the hosts can up their levels to put themselves in charge on day two. The 25-year-old said: \"We're probably slightly behind but we felt the conditions weren't quite with us, with the rain and wind. We can come back tomorrow, get a couple of early ones and we'll be right back in the game.\" Removing <mark>Smith</mark> will obviously be key to England's hopes. <mark>Steve Smith</mark> again proved key for Australia (Mike Egerton/PA) The former Australia captain, who scored twin centuries in the Test at Edgbaston and 92 at Lord's but missed Headingley, took his run tally for the series to 438 in four innings. Overton said: \"<mark>Smith</mark> is obviously a world-class player, and he's back as Test number one. He's always going to be difficult but we've got our plans so we'll try to keep going to them and hope to get him out.\" <mark>Smith</mark>'s battle with Jofra Archer, who bounced him at Lord's, was one of the most eagerly-anticipated aspects of the game. However, in difficult bowling conditions, <mark>Smith</mark> dealt with the England paceman comfortably. Craig Overton is hoping for better conditions on Thursday (Mike Egerton/PA) Overton said: \"We all tended to struggle with the wind. I wouldn't look too much into it. He'll be raring to go tomorrow, firing in and bowling as quick as he can. Hopefully taking a few wickets as well.\" England came into the match on a high after their remarkable Ben Stokes-inspired win at Leeds but Australia are hoping to quell their momentum by batting on. Labuschagne, who has scored four successive half-centuries, said: \"We've talked about (England's momentum) not being an issue for us at all.\" We're just focused on the process of winning a Test match. It's about taking it a ball at a time, day at a time--and trying to make sure we're doing things right. \"I think that's what we have been doing the whole series. We haven't been getting too far ahead when we've done well, and haven't been getting too far down when we've done poorly.\" 0 comment"}, {"articleID": "2009061716_00094114_W", "names": {"Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"]}, "date": "2009-06-17", "url": "http://wvmetronews.com/index.cfm?func=displayfullstory&storyid=30906", "content": "a lot of uncertainty. the president of the united mine workers of america says that's the result of a new strategy to regulate mountaintop removal mining the environmental protection agency, the department of interior and the u.s. army corps of engineers announced last week. \"the worst thing with any industry is not being able to predict the future,\" cecil roberts said on wednesday's metronews talkline. \"whenever you have these undetermined regulations that will be coming into the industry through this memorandum of understanding, no one really knows for sure where that's going to lead.\" the memorandum of understanding says the goal of the agencies is to \"reduce the impacts\" of mountaintop removal. white house council on environmental quality chair nancy sutley said the obama administration has \"serious concerns about the impact of mountaintop coal mining on our natural resources and health and welfare of appalachian communities.\" more scrutiny is promised. \"what does that mean?\" asked roberts. \"does that mean that you can't get a permit? it's going to take longer to get a permit? or you're not going to get a permit? none of us knows, right now, exactly what this means.\" roberts says this new process will most impact the project permits that are in the process of being filed now. \"it could mean that people might lose their jobs and not be able to work in the future or it could mean that it's just going to be more difficult to get a permit or it could mean that permits will be issued and they'll just be taken a harder look at.\" as the process moves forward, roberts says all of the groups involved in the coal industry, including those in the environmental community, need to be able to weigh in on any changes made at the federal level. staff members for u.s. senator <mark>robert byrd</mark> are on a fact finding tour of mountaintop mining sites in west virginia this week. click here to login! registering for wvmetronews.com is free and easy! breaking news alerts take part in online discussions"}, {"articleID": "2014040904_00052518_W", "names": {"Mark Hatfield": ["Q6767961", "Q879921"]}, "date": "2014-04-08", "url": "http://www.factcheck.org/2014/04/abortion-distortion-in-mississippi-primary/", "content": "Sen. Thad Cochran's latest TV ad says he is the \"only\" candidate with a \"100 percent pro-life voting record from National Right to Life.\" Not so. He has voted against the NRLC five times since 1997 - notably on stem cell research - for a 92 percent score, not 100 percent. The claim is also misleading, because Cochran is the incumbent in the race, so of course he is the \"only one\" included in the NRLC congressional scorecard. Chris McDaniel's campaign responded to the ad by claiming Cochran has supported \"taxpayer funding for abortions.\" That's a stretch. Cochran has a long record - reflected in the NRLC scorecard and elsewhere - of opposing taxpayer-funded abortions. The McDaniel campaign rests its case on three votes in the 1980s, and there's more to those votes than meets the eye. Not the \"Only One' The Mississippi Senate primary has attracted national attention as a test of the tea party and its ability to challenge a six-term senator, has the support of the state's top party leaders - including former Gov. Haley Barbour. Barbour was chairman of the Republican National Committee and is now FreedomWorks. Cochran's campaign went on the air April 2 with a 30-second TV spot called\" Only One. \"The ad stresses Cochran's conservative voting record on three issues: guns, abortion and the Affordable Care Act. The ad says\" only one candidate has a 100 percent pro-life voting record from National Right to Life. That conservative candidate is Thad Cochran. \"On the screen, voters see these words,\" 100% Pro-Life Voting Record, \"with the URL for the National Right to Life homepage in small print. current Congress - and the two prior congressional sessions that ended in 2010 - but that has not always been the case. The ad does not provide a time frame, so a viewer may come away with the mistaken impression that Cochran voted with the NRLC on every issue. Jordan Russell, a spokesman for the Cochran campaign, said the ad was referring to the current Congress. But, for example, the senator also scored 85 percent in the 110th - so the campaign does some cherry-picking with the record. 59 times with the NRLC and five times against it since 1997, according to the NRLC website cited by the TV ad. (That's as far back as the website goes, even though Cochran has been in the Senate for 36 years and served almost six years in the House before that .) That's a 92 percent score during the last 17 years, from 1997 to 2013 - which indicates strong support of the organization's legislative agenda, but not 100 percent. He has voted multiple times for a ban on so-called partial-birth abortions, voted against repealing a ban on abortions at military facilities, and he has His votes against the National Right to Life have come on stem cell research and campaign finance legislation. Cochran voted for the voted against an amendment offered by Sen. Dan Coats of Indiana in 1997 that would have banned federal funding for research that uses embryonic tissue, cells or organs from induced abortions. Cochran was also one of 14 Republicans who As the National Journal put it in 2012:\" As former head of the GOP caucus, Cochran is usually a reliable Republican vote, but he has crossed party lines, such as when he opposed restrictions on stem cell research. \"other votes against the National Right to Life, Cochran voted in 2001 and 2002 to give final approval to campaign finance bills that the NRLC said would restrict the group's freedom of speech. In a spirited exchange with a Cochran critic on its Facebook webpage, the Mississippi Right to Life defends Cochran and refers to his votes against the NRLC as\" in the far distant past. \"\"We have two really good pro-life candidates here whose candidate questionnaires and records we will be publishing as we get closer to election time but we will NOT allow this page to be used by either side to spread hate and discontent,\" the Mississippi Right to Life says. That leads us to our second point: Both candidates are anti-abortion, but Cochran is the \"only one\" scored by the National Right to Life, because it is a congressional scorecard based on votes in Congress. The ad omits that. The fact is that McDaniel has a strong record opposing abortion, too, and his supporters, not surprisingly, argue it is stronger. McDaniel, for example, supported the state's failed \"personhood amendment\" in 2011 that would have defined \"person\" from the moment of fertilization. The ballot initiative was defeated, but it sparked a heated debate among opponents who believed it was unconstitutional and supporters who believed it was a moral imperative. (We could find no record of Cochran taking a position on the statewide ballot initiative, and neither could his campaign spokesman Jordan Russell. \"As far as I can tell, Senator Cochran has never weighed in on a state ballot initiative,\" Russell told us .) Statewide Initiative Measure No. 26 - at an event sponsored by the Center for Pregnancy Choices of South Central Mississippi, Laurel Leader-Call, June 4, 2011: McDaniel said he favors the Personhood Amendment and anything else that promotes the pro-life message. \"It's important to discuss it so everyone can understand it,\" he said. McDaniel's record in the Mississippi Senate also includes co-sponsoring a bill in 2013 that would require a doctor's prescription for an \"abortion inducing drug,\" and sponsoring a bill in 2012 that would have prohibited abortions without \"informed written consent\" if the fetal heartbeat can be detected. In 2010, he co-sponsored a bill that would have outlawed all abortions in Mississippi except in cases of rape, incest or to save the life of the mother. Cochran and Taxpayer-Funded Abortions In response to the Cochran \"Only One\" ad, McDaniel spokesman Noel Fritsch says in an April 1 press release that Cochran has supported \"taxpayer funding for abortions.\" It's a claim that the campaign has made than once, and it's an exaggeration. When we asked for evidence, the McDaniel campaign cited three votes in the 1980s restricting the use of taxpayer funds for abortions through Medicaid. Cochran has a decades-long history of supporting such restrictions. Nevertheless, the McDaniel campaign cited two votes on the so-called Hyde amendment, which restricts federal funding of certain abortions through Medicaid, and a third vote on an amendment restricting the District of Columbia from spending its own money on abortions. Let's take the Hyde amendment votes first - starting with a little background on the amendment, Cochran's early voting record on it, and the legislative skirmishes over exceptions to it that form the basis of McDaniel's claim. Rep. Henry Hyde of Illinois, was enacted in 1976 as an amendment to the appropriations bill that funds Medicaid and has been added to annual spending bills ever since. But from the beginning there have been fights over the wording of the amendment and whether it should allow exceptions for cases of rape, incest or endangerment of the life of the mother. On June 24, 1976, the House took two votes on the Hyde amendment. The language said, \"None of the funds appropriated under this Act shall be used to pay for abortions or to promote or encourage abortions.\" No exceptions. The House passed it both times that day. First it passed 207 to 167 with 57 members, including Cochran, not voting (pages 20413 in the Congressional Record). Later that day it passed again 199 to 165, with 67 members not voting (page 20425). Cochran voted for it the second time, and the bill went to the Senate. The Senate insisted on exceptions to the Hyde amendment and, in a compromise, the House voted 256 to 114 on Sept. 16, 1976, (page 30901) to provide an exception \"where the life of the mother would be endangered if the fetus were carried to term.\" Cochran voted for that, too, and that became the law. A year later, there was an attempt by the Senate again to broaden the exceptions. On Dec. 7, 1977, Cochran voted (then-Rep. George Mahon of Texas to accept a Senate amendment that would expand the exceptions to include rape and incest. The motion failed, by a 171-178 tally, but that same day the House voted 181 to 167 to pass compromise language that added the new exceptions \"when such rape or incest has been reported promptly to a law enforcement agency or public health service.\" Cochran also voted (law for fiscal year 1978. So, over the course of two years, Cochran voted for three versions of the Hyde amendment: one without exceptions; one with only an exception for the endangerment of the mother; and one with exceptions for rape, incest and the endangerment of the mother. But in every case he voted for a ban on federal funding of abortions through Medicaid. The McDaniel campaign cites two of Cochran's votes during similar skirmishes in 1981 and 1989. We'll take them in chronological order. In 1981, then-Sen. Jesse Helms sponsored an amendment to a supplemental appropriations bill that would have dropped the rape and incest exceptions added to the Hyde amendment in fiscal 1978. Russell, of the Cochran campaign, tells us the senator's vote against the amendment was on procedural grounds, not because he opposed the amendment. Russell says Cochran, a member of the House Appropriations Committee, supported then-chairman <mark>Mark Hatfield</mark>'s position that the abortion provision should be taken up separately and not as part of the appropriations bill. <mark>Hatfield</mark> said during the debate that it was time for the abortion issue to be taken up in separate legislation because the Associated Press wrote of the disputed roll call vote: \"Some Senators who supported Helms in principle voted against him on procedural grounds.\" We cannot independently confirm that Cochran cast his vote on procedural grounds, because the senator did not speak on the bill during the floor debate. But as a member of the appropriations committee he would have been likely to support the committee process and the chairman. Plus, his voting history to this point shows his support for the Hyde amendment - and the same is true for <mark>Hatfield</mark> and some others who voted against the Helms amendment. Finally, Cochran did vote for the final bill, which included the Helms amendment and became law. The spending bill Cochran's vote in the Senate on Oct. 19, 1989, for an appropriations bill that included House language that would have restored the exceptions for rape and incest that were stripped out by Helms in 1981. Fritsch, McDaniel's spokesman, says in an email to us that Cochran's vote in 1989 expanded federal funding for abortion, so that justifies the campaign's claim that Cochran voted for taxpayer-funded abortions. But in this case, there was no direct vote on the abortion language. The Senate agreed to it in a voice vote a few weeks before the final vote on the $156.7 billion appropriations bill, so we don't know how he would have voted on the abortion language. It's possible he would have voted for it, given his votes in 1977 to allow exceptions in cases of rape and incest. But, even though Cochran voted for exceptions to the Hyde amendment, he still supported the funding ban - which is not the action of someone who supports taxpayer-funded abortions. It turned out to be a moot point, anyway. President George H.W. Bush vetoed the bill because of the abortion language and Congress failed to override it. The House language was removed - until 1993. The third vote cited by the McDaniel campaign came Nov. 7, 1985, on an amendment offered by Congressional Research Service, annual spending bills for the District from fiscal 1980 to 1988 included language prohibiting the use of federal funds for abortion services except in cases of rape, incest or endangerment of the mother's life. In 1985, Humphrey offered an amendment that would have barred the District from spending federal and local funds for abortion services, except when the life of the mother is in danger. Critics of the amendment cited home rule and claimed it would set a bad precedent by dictating how the District could spend its own money. The Washington Post, reporting on the amendment, said that \"15 states use their own funds to pay for abortions.\" By a 54-41 vote, the Senate voted to table the Humphrey amendment - which blocked the amendment from even coming up for a vote. Cochran and 17 other Republicans joined 36 Democrats to table the amendment. It wasn't until fiscal 1989 that Congress imposed a ban on the use of locally raised funds to pay for abortions, except if the mother's life is in danger. Under the threat of a presidential veto, the Senate voted 45-44 on Sept. 30, 1988, to add abortion language to the District appropriations bill. Cochran voted for it, so his position had changed since the 1985 vote. And his vote was critical in passing the legislation. McDaniel doesn't mention that vote. The ban on using local funds for abortion remained in place through fiscal 1993. Some type of ban - either on the use of federal funds or federal and local funds - has been in place every year since fiscal 1980, depending on party control of the White House and Congress. Cochran's abortion record isn't perfect, as the NRLC scorecard shows and we noted in the section on Cochran's TV ad. But the scorecard also shows the senator has repeatedly sided with the group on issues it considers to be federal funding of abortion: Planned Parenthood, which provides family planning, abortion services and other women's health services. supported the so-called Mexico City Policy, which at one time barred federal funding for family planning services to groups that provide abortion services overseas. (The policy dates to the Reagan administration and has been periodically enforced, depending on the president prohibit federal employee health insurance plans from paying for abortion services except to save the life of the mother, or in cases of rape or incest. (That ban was first instituted in 1984, which is outside the scope of the NRLC scorecard. But we found in the Congressional Record, page 31947, that Cochran supported the ban at the outset, voting on Nov. 10, 1983, against an amendment to strip the House bill of the anti-abortion language .) supported the NRLC's position against U.S. funding for the United Nations Population Fund. ban funding of abortion services in American Indian health care programs. Cochran has cast multiple votes against the Affordable Care Act that were in line with NRLC's position on the use of federal funds. When someone has been in office as long as Cochran has - 41 years - there will be votes that his opponents can use against him. Some establish a track record and point to legitimate differences between candidates. Cochran did, after all, repeatedly support federal funding for stem cell research, and it hurt his perfect score that he falsely touts. Other votes are cherry-picked and used to build a false narrative about the incumbent. That's the case with McDaniel's exaggerated claim that Cochran supports \"taxpayer funding for abortions.\" Does the Affordable Care Act require Medicare beneficiaries over age 75 to be admitted to the hospital by their primary care physician?"}, {"articleID": "2010103110_00306153_W", "names": {"Mohammad Aamer": ["Q23007606", "Q23020672", "Q23409605", "Q23542533"]}, "date": "2010-10-31", "url": "http://timesofindia.indiatimes.com/sports/cricket/top-stories/ICC-upholds-spot-fixing-suspension-on-Pakistani-duo/articleshow/6846306.cms", "content": "dubai: pakistani cricketers salman butt and <mark>mohammad aamer</mark> had their provisional suspensions over allegations of spot-fixing upheld by the international cricket council (icc) on sunday. \"i have decided to dismiss the application...all three players accordingly are still for the time being unable to participate in cricketing activities\" michael beloff, the head of the icc's code of conduct commission told reporters in dubai on sunday after a two-day hearing. the innocence or guilt of the players, who have denied any wrongdoing, will be judged at an independent tribunal, the date of which has yet to be set."}, {"articleID": "2013032819_00045164_W", "names": {"Bradley Cooper": ["Q205707", "Q4954898"]}, "date": "2013-03-28", "url": "http://entertainment.msn.com/movies/article.aspx?news=798885&affid=100055", "content": "\"place beyond the pines' review: ryan gosling + <mark>bradley cooper</mark> = overwrought daddy issues thewrap better to have a film with a reach that exceeds its grasp than a movie with no ambition in its pretty little empty head beyond regurgitating the same tired old pabulum.\" the place beyond the pines, \"director-cowriter derek cianfrance's follow-up to his 2010 corrosive marital drama,\" blue valentine, \"is plenty ambitious. if, in the end, it collapses on itself from trying to carry too heavy a symbolic load, one can still admire its attempted reach and several of the performances. the focus of\" pines \"is fathers and sons and how the relationship between the two, or lack of, leaves a lasting legacy. the film is essentially a trilogy, focusing sequentially on two men and two youths whose stories intersect. the new movie stars: how jennifer lawrence, jessica chastain and ryan gosling are redefining stardom the first part of the film, easily the strongest, concerns luke (cianfrance's\" blue valentine \"star ryan gosling, in yet another mesmerizing performance), a daredevil motorcycle rider in a traveling carnival. he's covered in tattoos and is your classic sensitive bad boy. during luke's star turn under a tent, he vrooms about in circles inside a spherical metal cage, an elegant metaphor for the fact that his life is going nowhere. while performing on night in schenectady, n.y., he is visited by romina (eva mendez, in a strong turn), a waitress with whom he hooked up briefly the last time he was in town. upon learning that she has given birth to his son, luke decides to stick around town and try being a father, despite the fact that romina now lives with a decent and dependable man. ryan gosling to direct christina hendricks in\" how to catch a monster' partnering with a lowlife associate (ben mendelsohn), luke soon turns to robbing banks, putting his motorcycle riding skills to use by executing daring, two-wheeled getaways. his new profession leads to his path crossing with that of avery (<mark>bradley cooper</mark>), a lawyer turned idealistic rookie cop whose father is a powerful judge in town. without giving away too much plot, the movie moves on from luke's story to avery's--hailed as a hero cop, he suffers from self-doubt--and then, in its final section, to what happens when the teenage sons (dane dehaan and emory cohen) of the two men meet. the boys both bear the scars of having been raised, for differing reasons, with absent fathers, and an antagonism develops between them. only the luke portion of the film succeeds in feeling most of the time as if the characters are more than literary and symbolic conceits. in the second and third parts of the movie, about avery and the two teenage boys, a viewer is too aware of the puppeteer behind the camera pulling the strings in an attempt to keep the characters dancing to the heavy-handed father-son theme. that said, there's much to appreciate in \"pines.\" there's a verisimilitude to the film's settings (it was shot in and around schenectady) and the performances, especially in the first third, are raw and exciting. maybe if the story was told chronologically in reverse, as harold pinter did in his 1978 play, \"betrayal,\" and director gaspar no? did in 2002's \"irreversible,\" it would have accumulated greater poignancy and power. hey, just throwing out an idea here for an alternative version to be included on the dvd. the new movie stars: how jennifer lawrence, jessica chastain and ryan gosling are redefining stardom"}, {"articleID": "2017041216_00231505_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "James Thompson": ["Q16324360", "Q19666426", "Q2031218", "Q21457741", "Q25413093", "Q2740371", "Q3806742", "Q41446776", "Q51587826", "Q54833499", "Q55863509", "Q55937953", "Q58323221", "Q58332042", "Q6133231", "Q6144184", "Q6144186", "Q6144196", "Q780129"], "Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2017-04-12", "url": "http://nymag.com/daily/intelligencer/2017/04/republicans-almost-lost-ks-because-no-one-likes-their-agenda.html", "content": "A worse way. Photo: Melina Mara/The Washington Post/Getty Images Last night, a pro-choice Democrat--who proudly aligned himself with a self-avowed socialist--almost won the House district where Koch Industries is headquartered. Back in November, Kansas's fourth district backed <mark>Donald Trump</mark> by 27 points, and then-GOP congressman (now, CIA Director) Mike Pompeo by 31. Five months later, Republican Ron Estes needed a visit from Ted Cruz, a robocall from the president, and an infusion of national money to secure a seven-point victory over the aforementioned Democrat, <mark>James Thompson</mark>, a Wichita civil rights lawyer who'd never held public office. That 24-point swing wasn't enough to shake the red off Kansas. But if Democrats can swing every congressional district by half that sum, they'll take back the House in 2018. Naturally, Republicans are eager to paint last night's vote as an anomaly--one that says less about their party's national liabilities than its local ones. Kansas's GOP governor Sam Brownback boasts a woeful 27 percent approval rating, thanks, in large part, to gaping holes in the state's budget. Ron Estes was Brownback's state treasurer. In other words: Estes wasn't just running as a member of an unpopular governor's cabinet, but as the one most closely tied to Brownback's biggest failure. If anything, the fact that the treasurer of a state with wrenching budget problems won at all is a testament to the Republican Party's vitality! This is fine! America is already great again! There are a couple problems with that story. To name the most obvious: The past three months have been replete with evidence that the Democratic base is highly mobilized. You can see it in the record-setting marches, town hall protests, massive traffic enjoyed by leftwing Facebook pages, the tight special election race in Georgia's sixth district, and in the $150,000 that the liberal blog, Daily Kos, convinced its readers to pony up for <mark>James Thompson</mark>'s long-shot campaign. But okay: Let's ignore all that. Let's stipulate that last night was all about Brownback. That would certainly offer vulnerable House Republicans short-term comfort. But in the long run, a repudiation of Brownback is just as--if not more threatening--to the Republican Party than a repudiation of Trump. Sam Brownback isn't unpopular for idiosyncratic, personal reasons. The governor didn't decimate his state's finances by spending public funds on sex workers; he did it by implementing the conservative movement's blueprint for utopia. Some readers may be familiar with the legend of the \"red state model,\" but for those who aren't, here are the Cliff Notes: The 2010 tea-party wave delivered Brownback to the Sunflower State's governor's mansion and Republican majorities to both houses of its legislature. Together, they passed massive tax breaks for the wealthy and repealed all income taxes on more than 100,000 businesses. They tightened welfare requirements, privatized the delivery of Medicaid, cut $200 million from the education budget, eliminated four state agencies and 2,000 government employees. In 2012, Brownback helped replace the few remaining moderate Republicans in the legislature with conservative true believers. The following January, after signing the largest tax cut in Kansas history, Brownback told the Wall Street Journal, \"My focus is to create a red-state model that allows the Republican ticket to say,\" See, we've got a different way, and it works. \"' The GOP's national leadership agreed: Voters should look to Kansas to see the Republican vision for the nation's future.\" This is exactly the sort of thing we [Republicans] want to do here, in Washington, but can't, at least for now, \"Senate Majority Leader Mitch McConnell said of Brownback's Kansas. And the supply-side nostrum undergirding the governor's economic model--that massive tax cuts for the rich will pay for themselves, via heightened economic growth (provided that you kick the undeserving poor out of their welfare hammocks)--is the same one on which all of <mark>Paul Ryan</mark>'s celebrated budgets are based. Of course, the GOP's\" different way \"didn't work. Instead of providing national Republicans with a winning advertisement for fiscal conservatism, it provided Kansas's government with giant revenue shortfalls, its economy with weaker job growth than neighboring states, and Brownback himself with one of the lowest approval ratings of any governor in America. For decades now, Republicans have been asking voters to trade pieces of their social safety net for stronger economic growth. Kansas took them up on that offer. It allowed its government to throw more than a thousand disabled Kansans off of Medicaid, cut millions from the state's university system, and, in some of its districts, shorten the K-through-12 school year. Here was their reward. No state economy has done worse over the last 5 years than right-wing paradise Kansas. https: //t.co/rWPjwqo17r pic.twitter.com/3AYsgQHMqZ--Bruce Bartlett (@ BruceBartlett) October 26, 2016 To say that Kansas didn't swing against the GOP because of Trump--but only because of Brownback--is to say that red America isn't souring on one particular Republican, but only on their party's entire economic philosophy. Last year, the Republican Party nominated a man who campaigned on a promise to deliver universal health-care, preserve Social Security and Medicare, and intervene in the free market to protect American jobs. Last month, Republicans in the Kansas legislature passed a bill to expand Medicaid in their state. President Trump has never been popular. But his approval rating began sliding in early March, right after <mark>Paul Ryan</mark> unveiled his plan to finance a large tax cut for the rich by throwing millions of low-income people off of their health insurance--an idea that enjoyed the backing of 17 percent of the electorate. Turns out Tea Party voters want more government healthcare spending, yet support <mark>Ryan</mark>'s healthcare bill. Go figure. https: //t.co/y77gXZHn6j pic.twitter.com/VT7W2FqDPC--Guy Kawasaki (@ GuyKawasaki) March 23, 2017 Path to Trump's base? Trump should NOT lower taxes on the wealthy--College whites: 74% Non-college whites: 69% https: //t.co/wPGAFETKBM pic.twitter.com/FWbVGxldRt--Will Jordan (@ williamjordann) March 8, 2017 These are not coincidences. They are testaments to the GOP's fundamental weakness, the one that they need gerrymandered districts, voting restrictions, fraudulent promises, defamatory conspiracy theories, and increasingly garish appeals to white racial resentment to compensate for: Republican voters no longer want to buy what misanthropic billionaires pay their leaders to sell them. Not even in the Koch brothers' backyard."}, {"articleID": "2013101108_00057448_W", "names": {"Dick Cole": ["Q521537", "Q5272775"], "Robert Hite": ["Q1747703", "Q7345524"]}, "date": "2013-10-10", "url": "http://www.nwfdailynews.com/military/top-story/a-final-goodbye-to-revered-wwii-heroes-galleries-1.216621", "content": "The remaining Doolittle Raiders will gather in Dayton, Ohio, for a final time next month. The revered World War II heroes will lift their goblets, sip their 117-year-old cognac and say good-bye to a decades-old tradition of gathering with their comrades to reflect on their contribution to American history. \"It's bittersweet,\" said Wes Fields, who lives in Destin and has served as the Raiders' security guard and escort for decades. He will attend the toast at the National Museum of the Air Force on Nov. 9. \"You want to be involved in it, but in a sense you don't because you dread it. It's coming to an end,\" Fields said. Photos from Doolittle Raiders' April visit: Autograph session .>> Photos from Doolittle Raiders' April visit: Exhibit .>> Photos from Doolittle Raiders' April visit: Family and veteran lunch .>> Photos from Doolittle Raiders' April visit: Parade .>> On April 18, 1942, 80 men led by Lt. Col. Jimmy Doolittle took off in B-25s from an aircraft carrier to bomb Japan. It was the first retaliation after Pearl Harbor, and while the physical damage to Japan was minimal the raid was a tremendous boost for morale back home. Nearly every year since the raid, the men had gathering for a reunion - the last of which was held in Fort Walton Beach earlier this year. As part of the tradition, they hold a toast before a set of 80 goblets engraved with each Raider's name. After the toast, they overturn the goblet of any Raider who passed on that year. Three of the remaining four Raiders - 98-year-old Lt. Col. <mark>Dick Cole</mark>, 93-year-old Lt. Col. Ed Saylor and 92-year-old Staff Sgt. David Thatcher - will attend their final toast. They will open the famed bottle of Hennessy Very Special cognac from 1896, the year Jimmy Doolittle was born. Lt. Col. <mark>Robert Hite</mark>, 93, likely will not attend because of his health. Only about 1,000 people have been invited. Fields, Ted Corcoran and Lyn Dominique will be among them. \"It's kind of like getting to go backstage with the Rolling Stones,\" Corcoran, president and CEO of the Greater Fort Walton Beach Chamber of Commerce, said as he sat in his office adorned with Doolittle memorabilia. He's organized hundreds of events in his career, but his work on two local Raider visits were his favorite, he said. Lynn Dominique of Shalimar also will be on hand. He has been a Doolittle Raider escort for years, including one time when he hopped over a barrier to push the wheelchair of a Raider who was getting left behind the group. They've become like family, sharing stories, and plenty of jokes, he said. \"Getting to know these men has been one of the highlights of my life,\" he said. Contact Daily News Staff Writer Lauren Sage Reinlie at 850-315-4443 or lreinlie @ nwfdailynews.com. Follow her on Twitter @ LaurenRnwfdn."}, {"articleID": "2009081200_00055383_W", "names": {"Mike Day": ["Q18685653", "Q19519901", "Q2534659", "Q26884362"]}, "date": "2009-08-12", "url": "http://KAALtv.com/article/stories/S1079284.shtml?cat=10151", "content": "in its opening weekend, bodies: the exhibition proved to be a hit in a vacant space on the mall of america's fourth floor. it's a good sign for the bloomington mall, which doesn't traditionally host educational exhibits. \"it's a great marriage between an attraction and a destination, so it's been a good fit for the mall of america,\" said mall spokesman dan jasper. \"we're constantly looking for what are the best ways to drive traffic to the mall because we want consumers and guests to come to the moa whether its to eat at our great restaurants to shop or see our great attractions,\" jasper explained. <mark>mike day</mark> with the science museum in st. paul isn't worried about the competition. so far the bodies exhibit hasn't had any negative impact on their titanic feature attraction. \"they're doing a great deal of advertising on behalf of the science museum for titanic,\" he said. <mark>day</mark> also noted that the same company that's promoting the bodies exhibit is also the same one promoting titanic. in fact, titanic opened in june and has already exceeded expectations when it comes to visitors. <mark>day</mark> says the more educational opportunities for minnesotans, the better."}, {"articleID": "2019031322_00812107_W", "names": {"Chris Jones": ["Q1189011", "Q16197020", "Q20858019", "Q21170661", "Q22005681", "Q22278433", "Q24450139", "Q26706864", "Q28378502", "Q2964749", "Q2964754", "Q39070812", "Q4160420", "Q43103067", "Q5107027", "Q5107028", "Q5107029", "Q5107030", "Q5107032", "Q5107033", "Q5107034", "Q5107035", "Q5107036", "Q5107037", "Q5107038", "Q5107040", "Q5107042", "Q613150", "Q6476599", "Q784026"], "Gary Kelly": ["Q27830945", "Q455972", "Q5524807", "Q5525352"], "Matt Kelly": ["Q1909208", "Q41886658"]}, "date": "2019-03-13", "url": "https://www.reviewjournal.com/life/travel/mccarran-airport-to-see-minimal-effects-of-boeing-737-max-jet-grounding-1617243/", "content": "Travel McCarran to see minimal effects of Boeing 737 MAX jet grounding The Federal Aviation Administration's ordered grounding of all Boeing 737 MAX aircrafts in the U.S won't have much impact on Las Vegas. By Mick Akers / Las Vegas Review-Journal March 13, 2019 - 3:23 pm A Southwest Airlines plane takes off from McCarran International Airport in Las Vegas Thursday, Oct. 25, 2018. K.M. Cannon Las Vegas Review-Journal @ KMCannonPhoto The Federal Aviation Administration's ordered grounding of all Boeing 737 MAX aircrafts in the U.S won't have much impact on Las Vegas. The decision to halt the MAX flights comes after the collection of new data and evidence at the Ethiopian crash site of Flight 302, which killed all 157 people on board, was analyzed, coupled with newly refined satellite data available to the FAA, according to a statement released by the administration. The impact at McCarran International Airport is expected to be light, as only 2 percent of the roughly 15,500 flights scheduled for March feature the MAX 8 jets, according to airport spokesman <mark>Chris Jones</mark>. \"It's not a massive piece of the day-to-day, in-and-out at McCarran, but obviously we want everybody to be safe and we want the situation to be resolved,\" he said Tuesday. Three North American carriers serving McCarran operate MAX planes: Southwest Airlines, United Airlines and WestJet, according to Christine Crews, McCarran spokeswoman. Three McCarran flights involved the MAX 8 jets Wednesday, all departing flights, with the last one taking off for Chicago at 11:23 a.m., according to flight tracking website Flight Aware. No MAX 9 flights operated in or out of McCarran Wednesday, according to Flight Aware. None of the MAX jets were at McCarran following the FAA grounding orders, Crews said. Any changes to the flight schedules associated with those planes is at the discretion of the individual airlines. \"They may choose to cancel flights, they might be able to switch out equipment and continue as scheduled,\" Crews said. Southwest plans to operate its flight schedule with every available aircraft in its fleet. Southwest is offering flexible rebooking policies, allowing for customers to rebook on alternate flights without any additional fees or fare differences within 14 days of their original date of travel between the original city pairs. United said in a statement about 40 flights feature the MAX 9 plane a day, and through a combination of spare aircraft and rebooking customers, they do not anticipate a significant operational impact. WestJet was rebooking customers slated for MAX 8 jets onto other flights, according to its website. The grounding will remain in effect pending further investigation of the crash in Ethiopia, which will include examining the flight data recorders and cockpit voice recorders, The FAA said. A separate crash involving a MAX 8 jet occurred in Indonesia in October, killing all 189 people on board. Canada also ordered the grounding of the MAX planes Wednesday. Contact Mick Akers at makers @ reviewjournal.com or 702-387-2920. Follow @ mickakers on Twitter. Business Videos El Cortez owner Kenny Epstein on running the iconic property Kenny Epstein, owner of the El Cortez Hotel in downtown Las Vegas, talks about Jackie Gaughan mentorship and answers rumors about bodies in the basement at the mob-era casino. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto LVCVA recommends construction of underground people mover The Las Vegas Convention and Visitors Authority announced the recommendation for an underground people mover for the convention center. The system would have the potential to expand and connect Downtown and the resort corridor all the way to McCarran. (Michael Quine / Las Vegas Review-Journal) LVCVA/Boring Company Press Conference The Las Vegas Convention and Visitors Authority announced a collaboration with Elon Musk's The Boring Company to develop and operate an autonomous people mover system for the Las Vegas Convention Center District. International Pizza Expo includes green and gluten free The International Pizza Expo at Las Vegas Convention Center included companies focused on vegan and gluten free, and plant-based pizza boxes. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto International Pizza Expo kicks off in Las Vegas The first day of the International Pizza Expo at Las Vegas Convention Center is everything Pizza. (K.M. Cannon/Las Vegas Review-Journal) @ KMCannonPhoto T-Mobile program aids guests with sensory needs A program at T-Mobile Arena is designed to provide a more sensory friendly experience for guests. Photo Booth Expo Danielle May talks about how Simple Booth transformed her Volkswagen bus into a business. Nevada Gaming Commission's highest fines The highest fines assessed by the Nevada Gaming Commission, according to commission Chairman Tony Alamo: 1) Wynn Resorts Ltd., $20 million, 2019 2) CG Technology (then known as Cantor G & W Holdings), $5.5 million, 2014 3) The Mirage, $5 million ($3 million fine, $2 million compensatory payment), 2003 4) Stardust, $3 million, 1985 5) Santa Fe Station, $2.2 million ($1.5 million fine, $700,000 compensatory payment), 2005 6) Las Vegas Sands, $2 million, 2016 7) CG Technology, $1.75 million, 2018 8) CG Technology, $1.5 million (also $25,000 in escrow for underpaid patrons), 2016 9) Caesars Entertainment, $1.5 million, 2015 10) Imperial Palace, $1.5 million, 1989 11) Peppermill Casinos, $1 million, 2014 Tiny Pipe Home vs Shipping Crate A Tiny pipe home was displayed at the International Builders Show this week in Las Vegas. Auto repair shortage affects Las Vegas The auto repair industry is facing a national shortage of workers. Franchising industry booming Experts say Las Vegas is a hotbed for the franchise industry. Africa Love owner talks about his store in Las Vegas Mara Diakhate, owner of Africa Love, gift and decor store, talks about his store in Las Vegas. (Bizuayehu Tesfaye / Las Vegas Review-Journal) @ bizutesfaye Developer gets approval to build homes at Bonnie Springs The Clark County Planning Commission has approved a plan to build 20 homes on the site of Bonnie Springs Ranch. (Michael Quine/Las Vegas Review-Journal) Dig This opens new location In Las Vegas Remember when you were a kid and played with construction toys in the sand box? Dig This Las Vegas has the same idea, except instead of toy bulldozers, you get to play with the real thing. (Mat Luschek/Review-Journal) Town Square developer Jim Stuart building again in Las Vegas Las Vegas' real estate bubble took developers on a wild ride, something Jim Stuart knows all too well. (Las Vegas Review-Journal) Salon opens at Veterans Village T.H.E. Salon, owned by Nicole Christie, celebrated their opening at the Veterans Village with a ribbon cutting ceremony. Southwest Airlines considering Las Vegas-Hawaii flights Southwest Airlines CEO <mark>Gary Kelly</mark> says the airline is \"very focused\" on Hawaii. Hawaiians have a strong presence in Las Vegas. The city's unofficial status is \"Hawaii's ninth island.\" In 2018, at least 2,958 people from Hawaii moved to Nevada. Of those, 88.7 percent moved into Clark County, according to driver license surrender data. According to the Las Vegas Convention and Visitors Authority, 310,249 people came to Las Vegas from Hawaii in 2018. Fewer Nevadans are celebrating Valentine's Day Fewer Nevadans are celebrating Valentine's Day. About 1.2 million Nevadans are expected to celebrate this year, a 5 percent drop from 2018. A growing number of people consider Valentine's Day over-commercialized. Others weren't interested in the holiday or had nobody to celebrate with. But spending is expected to rise. Those who do celebrate are buying for more people. The average American is expected to spend about $162 this year for Valentine's Day, a 57 percent jump from a decade prior. Katherine Cullen, director of industry and consumer insights at NRF Foreclosures of mansions in Las Vegas Las Vegas was ground zero for America's foreclosure crisis after the housing bubble burst. (Eli Segall/Las Vegas Review-Journal) Rick Helfenbein talks about the impact of tariffs on the clothing industry MAGIC fashion convention showcases men's clothing trends The MAGIC fashion convention has come to Las Vegas at the Mandalay Bay Convention Center to showcase some of the hottest clothing trends for men. (Nathan Asselin/Las Vegas Review-Journal) Allegiant Air flight attendants learn how to handle a water landing Field instructor Ashleigh Markel talks about training prospective flight attendants for Allegiant Air getting live training with a raft for a water landing at the Heritage Park Aquatic Complex in Henderson on Monday. (John Hornberg/Las Vegas Review-Journal) Smith & Wollensky CEO Michael Feighery speaks Smith & Wollensky CEO Michael Feighery speaks about the new Smith & Wollensky restaurant coming to the Grand Canal Shoppes at The Venetian in Las Vegas. Smith & Wollensky CEO Michael Feighery speaks Smith & Wollensky CEO Michael Feighery speaks about the new Smith & Wollensky restaurant coming to the Grand Canal Shoppes at The Venetian in Las Vegas. Smith & Wollensky CEO Michael Feighery talks about Las Vegas return Michael Feighery, CEO of Smith & Wollensky Restaurant Group, discusses the restaurant's upcoming return to the Las Vegas Strip. Apartments to Come to Hughes Center Developer Eric Cohen discusses his current building project at the Hughes Center office park in Las Vegas, Thursday, Jan. 31, 2019. Caroline Brehman/Las Vegas Review-Journal Stratosphere to rebrand to The STRAT The Stratosphere, a 1,150-foot-tall property in Las Vegas will be renamed The STRAT Hotel, Casino and Skypod. Local designers' picks for the Las Vegas Market The trends that local interior designers are noticing at the Las Vegas Market this year. (Rachel Aston/Las Vegas Review-Journal) Trends in bath products at Las Vegas Market Camille Herd, the showroom manager for European Bath Kitchen Tile & Stone, talks about the popularity of free-standing bath tubs. (Rachel Aston/Las Vegas Review-Journal) @ rookie__rae Kitchen trends at Las Vegas Winter Market Las Vegas Winter Market displayed kitchen trends that mirror common dining accessories at Strip eateries. (Rachel Aston/Las Vegas Review-Journal) @ rookie__rae Life Videos MAGIC fashion convention showcases men's clothing trends The MAGIC fashion convention has come to Las Vegas at the Mandalay Bay Convention Center to showcase some of the hottest clothing trends for men. (Nathan Asselin/Las Vegas Review-Journal) Former Army medic's Afghanistan story told in new book The graphic novel \"Machete Squad\" is based on journals written by Las Vegan Brent Dulak. Las Vegas man talks about losing his wife Dwayne Murray, 37, lost his wife, LaQuinta while she was at Centennial Hills Hospital. A jury awarded him $43 million last week after it said the hospital failed to perform the standard of care in administering a drug for her sickle cell disease. Barber sets up shop in grandfather's old shop Andres Dominguez's new barber shop is filled with memories of his grandfather, who ran the El Cortez landmark for more than 30 years. (John Przybys/Las Vegas Review-Journal) Life and times of a 90-year-old horse player Leo Polito of Las Vegas describes meeting legendary jockey and trainer Johnny Longden on the beach at Del Mar.. Mike Brunker/Las Vegas Review-Journal. Learning the history of singing bowls Presentation at Summerlin Library teaches residents about the history of singing bowls (Mia Sims/Las Vegas Review-Journal) Learning live-saving techniques in Stop the Bleed class Leslie Shaffer, an AMR paramedic, shows how to control bleeding during a Stop the Bleed course at the Summerlin Library. The class is designed to teach anyone how to control and stop life-threatening bleeding. (Mia Sims/Las Vegas Review-Journal) Vicki Richardson speaks about on the power of art Artist and arts advocate Vicki Richardson talks about the power of art to inspire and challenge. (John Przybys/Las Vegas Review-Journal) DressCoders pairs tech with haute couture DressCoders is a startup focused on haute couture garments. The company uses illuminated thread that is washable and can be sewn right into the fabric. (Mat Luschek/Las Vegas Review-Journal) CES 2019: Brava infrared oven In cooking with the Brava infrared oven, there's no preheating. the bulbs can reach 500 degrees in less than a second. (Heidi Knapp Rinella/Las Vegas Review-Journal) Sinks Merge Style And Utility Study could determine cause of Alzheimer's, Parkinson's diseases Dr. Aaron Ritter, director of clinical trials at the Cleveland Clinic Lou Ruvo Center for Brain Health, discusses his research on how inflammation in the brain impacts Alzheimer's and Parkinson's diseases. (Jessie Bekker/Las Vegas Review-Journal) Holocaust survivors talk about tragedy and friendship Janos Strauss and Alexander Kuechel share their perspectives on life. (John Przybys/Las Vegas Review-Journal) \"Siegel Cares' Santa delivers toys to kids at Siegel Suites in Las Vegas Siegel Cares, the charitable wing of The Siegel Group, delivered toys to families at their apartment complexes in Las Vegas. (K.M. Cannon/Las Vegas Review-Journal) Revisiting\" Christ the King \"sculpture A longtime admirer of the sculpture at Christ the King Catholic Community in Las Vegas shares her perspective. (Bizuayehu Tesfaye/Las Vegas Review-Journal @ bizutesfaye) Henderson couple adds another school to their generosity Bob and Sandy Ellis of Henderson, who donate to several Clark County School District schools, have added <mark>Matt Kelly</mark> Elementary in Las Vegas to their list of schools where every student gets new shoes, socks and a toy. (K.M. Cannon/Las Vegas Review-Journal) Terry Fator Christmas House Arguably better than a hotel holiday display, is Terry and Angie Fator's home located in southwest Las Vegas. UNLV Winter Graduation Packs Thomas & Mack UNLV's 55th winter commencement ceremony included approximately 2,146 undergraduate and graduate students who recently completed their studies. (Benjamin Hager/Las Vegas Review-Journal) Build-A-Bear comes to Reed Elementary School Students participated in a Build-A-Bear-Workshop at Doris Reed Elementary School in Las Vegas, Thursday, Dec. 13, 2018. Rev. Father Seraphim Ramos talks about Greek Orthodox icons during an interview with the LVRJ Rev. Father Seraphim Ramos talks about Greek Orthodox icons during an interview with the Las Vegas Review-Journal at St. John the Baptist Greek Orthodox Church. Bizuayehu Tesfaye/Las Vegas Review-Journal @ bizutesfaye Masjid Ibrahim Islamic Center art depicts names of God Masjid Ibrahim Islamic Center founder Sharaf Haseebullah talks about new diamond-shaped art panels featuring some of the 99 names of Allah at the main entrance the Las Vegas mosque. (K.M. Cannon/Las Vegas Review-Journal) Holiday poultry with Tim and Chemaine Jensen of Village Meat & Wine Tim and Chemaine Jensen of Village Meat & Wine explain the different types of poultry available for the holidays. (Heidi Knapp Rinella/Las Vegas Review-Journal) Catholic Charities hosts early Christmas meal Students from the Bishop Gorman High School football and cheerleader team helped to serve food at the Christmas meal sponsored by the Frank and Victoria Fertitta Foundation at Catholic Charities of Southern Nevada on Sunday. (Rachel Aston/Las Vegas Review-Journal) Incarcerated Christmas This is the fourth year HOPE for Prisoners has worked with the Nevada Department of Corrections to create a Christmas for prisoners to visit their families. (Rachel Aston/Las Vegas Review-Journal) 2018 Homeless Vigil Straight From The Streets holds its 23rd annual vigil to remember the 179 homeless individuals who died in Clark County this year. Getting through the Holiday blues Psychologist Whitney Owens offers advice on keeping your mental health in check during the Holiday season in Henderson, Thursday, Dec. 13, 2018. (Caroline Brehman/Las Vegas Review-Journal) ad-high_impact_4"}, {"articleID": "2015062906_00001153_W", "names": {"Ben Griffin": ["Q4885745", "Q4885747"]}, "date": "2015-06-29", "url": "http://www.msn.com/en-gb/news/uknews/war-vets-call-for-end-to-16-year-old-recruits/ar-AAccq4e?srcref=rss", "content": "Three disturbing videos about the impact of war have been made by a veterans' charity to campaign against the recruitment of young teenagers to the armed forces. The advert-style films use Action Man figures to represent one soldier suffering from post-traumatic stress disorder (PTSD), another who has been paralysed and a third who is seen being buried. \"For PTSD Action Man, danger lies at every turn. He never feels safe...not even in his own home...,\" says the voice-over in the first of the videos by Veterans for Peace UK. Another states: \"Here lies paralysed Action Man...Legs really don't work!\" The campaign has been launched to coincide with Armed Forces Day to highlight what the charity says is the reality of military service rather than the glossy image portrayed in recruitment videos. \"We are trying to show the public that it's not all about marching bands and flypasts...that there is a dirty, ugly, painful reality to conflict,\" said co-ordinator <mark>Ben Griffin</mark>, who served in the SAS and the Parachute Regiment in Northern Ireland, Iraq and Afghanistan. \"If you join the army at 16 you are twice as likely to be killed as someone who joined at 18 and the reason for that is because the army is funnelling its youngest, least educated recruits into the infantry which is the most dangerous job in the army.\" If you were an infantry soldier in Afghanistan you are seven times more likely to be killed than if you weren't in the infantry. \"Teenagers can begin the application process to join up when they are only 15, ready to start their training on their next birthday. But the Ministry of Defence says anyone under 18 must have written consent from a parent or guardian and recruits will not be sent on any operations until they are an adult. A statement from the MOD said:\" We take pride in the fact that our Armed Forces provide challenging and constructive education, training, and employment opportunities for young people equipping them with valuable and transferable skills. \"In no way do the Armed Forces shy away from the challenges that may be faced in a military career.\" But Kieran Devlin, who was 16 when he began training, said he lost interest in school once he knew he was going to join up and ended leaving the army after serving in the First Gulf War and Northern Ireland without an education. \"They take an immature child like I was and within a 14-week period they turn them into somebody who will kill on command,\" he said. \"Really the only thing I took away from the army was an alcohol and violence problem that continued in my life and hit a pinnacle where I ended up in jail.\" The UK is the only state in Europe to recruit 16 year olds. Other countries include Iran and North Korea. Around one in six UK recruits was under 18 last year. But the former head of the army, General the Lord Dannatt, said young recruits can leave. \"A youngster who might be 15, filling in the application form, going to the Army Foundation College at Harrogate when he is 16, is not then locked into four years of service. There are break points,\" said the former Chief of the General Staff. \"At the time they become 18 they then have the choice as to whether they want to go into adult service.\" Ginger Pride festival to take place next summer Document leak reveals PM's strategy to keep Britain in EU Defiant demonstrators reclaim massacre beach Tunisia: Gunman pictured on Sousse beach Man found dead at Olympic Stadium New footage emerges of killer sprinting along beach"}]