[{"articleID": "2010021914_00122013_W", "names": {"Joe Carr": ["Q10514943", "Q16240985", "Q17612171", "Q19949576"]}, "date": "2010-02-19", "url": "http://webwpmu.ume.maine.edu/news/blog/2010/02/19/winter-road-clearing-costs-in-maine-total-98-million-annually-umaine-report-summarizes-findings-and-recommends-goals/", "content": "winter road clearing costs in maine total $98 million annually; umaine report summarizes findings and recommends goals february 19th, 2010 contact: jonathan rubin at (207) 581-1528 <mark>joe carr</mark> at (207) 581-3571 orono - an exhaustive year-long study of economic, safety and environmental issues related to clearing maine's roads has yielded a report from the university of maine's margaret chase smith policy center. the report, developed in cooperation with the maine department of transportation (mainedot), involved university experts in economics, engineering, public administration and environmental sciences. it shows improvements in managing winter storm transportation issues over the past decade and recommends a series of steps aimed at reducing costs, limiting the negative environmental impact of chloride-based chemicals and improving public safety. prof. jonathan rubin of the umaine school of economics and margaret chase smith policy center is the report's lead author. he says that the implications for long-term state and municipal planning are significant. \"because of its rural nature and vast territory, maine must address some particularly difficult issues when dealing with transportation during the winter months,\" rubin says. \"by bringing together stakeholder groups and carefully examining available data, we've determined that our state and municipalities do an excellent job managing these issues and we've developed a road map for even more effective processes and procedures in the future.\" some of the report's key findings: • in the aggregate, maine spends an estimated $98 million annually on winter road snow and ice control ($76 per resident); this includes some sidewalks and school parking lots and funding sources include the state, municipalities and the maine turnpike authority • the estimated 490,000 pounds of rock salt purchased in maine during 2008-2009 represent 750 pounds per resident or 21 tons per road mile • maine has 23,450 miles of public road, the most in new england; mainedot maintains 18 percent of that total • all chloride salts contribute to vehicle and infrastructure corrosion; none is shown to cause more corrosion than another • between 1989 and 2008, there has been a significant reduction on the number of fatalities on state highways; at the same time, the number of vehicle miles traveled in maine has been increasing (except during the past two years) • drivers ages 16 and 17 are involved in nine percent more winter-condition crashes than their share of crashes under other road conditions; drivers ages 18-34 are also involved in more winter crashes, but not to the degree of 16 - and 17-year-olds • long-term environmental effects of road chemicals are apparent along maine roadways; new policies are needed to encourage the use of chemicals and technologies with less environmental impact the report notes that chloride salts are currently the best and most affordable tool maine has to use for winter road maintenance but that they take a toll on the environment, infrastructure and vehicles. while the variability of conditions around maine makes it impossible to apply one solution in all instances, the report says that there are \"advances in technology and practice which can lead to reduced costs and reduced salt use.\" one recommended focus area relates to a move from deicing to anti-icing. the former involves spreading sand and salt after snow has accumulated, the latter is a preventative process currently used effectively by mainedot, the maine turnpike authority and some maine municipalities. \"anti-icing and pre-wetting policies,\" the report says, \"have been shown to result in reduced plowing time, a reduction in abrasives us, a decrease in total chemical use, and decreased maintenance costs.\" those processes can help the state address cost issues, corrosion and environmental impact. in addition to its key findings, the report contains a series of goals that the state and municipalities should address: • maintain safety while reducing salt and sand use • identify efficiencies to maximize the budgetary impact of improvements • reduce salt use • increase public awareness of preventative measures • increase driver safety education • increase public awareness of winter practices, costs and environmental impact rubin also notes that the study involved an extensive review of current practices in other northern states and in canadian provinces. here. the university of maine, founded in 1865, is the state's premier public university, located in the town of orono. it is among the most comprehensive higher education institutions in the northeast and attracts students from across the u.s. and more than 60 countries. it currently enrolls 12,000 total undergraduate and graduate students who can directly participate in groundbreaking research working with world-class scholars. students are offered 88 bachelor's degree programs, 64 master's degree programs, 25 doctoral programs and one of the oldest and most prestigious honors programs in the u.s. the university promotes enviornmental stewardship on its campus, with substantial efforts aimed at conserving energy, recycling and adhering to green building standards in new construction. for more information about the university of maine visit you can follow any responses to this entry through the"}, {"articleID": "2016052807_00072750_W", "names": {"El Toro": ["Q5428175", "Q767616"]}, "date": "2016-05-28", "url": "http://northjersey.com/arts-and-entertainment/how-big-is-too-big-some-theme-park-riders-fear-small-seats-and-the-walk-of-shame-1.1606731", "content": "& copy; 2016 North Jersey Media Group May 28, 2016, 3:00 AM How big is too big? Some theme park riders fear small seats and' the walk of shame' STAFF AND WIRE REPORTS | Wire Service It's an uncomfortable scene familiar to anybody who has ever visited a theme park, including North Jersey-area amusement parks: The overweight rider becomes increasingly embarrassed as the ride attendant pushes and shoves with all his might on the over-the-shoulder restraint that stubbornly refuses to click closed. Everybody waiting in line knows what comes next: the \"walk of shame.\" Mark Boster/Los Angeles Times Buckling in on the Harry Potter and the Forbidden Journey ride at Universal Studios, Hollywood. \"The walk of shame is an embarrassing experience,\" said Mike Galvan, who penned the \"Big Boy's Guide to Roller Coasters.\" \"I've been there many times. It's disheartening.\" For instance, Galvan likens the straight back and flat seat on Universal's new Harry Potter and the Forbidden Journey attraction in Hollywood to an \"old wooden chair\" that provides little wiggle room for larger riders. \"When the over-the-shoulder restraint comes down, if part of you is hanging over, whether it be your gut, your thighs or your shoulders, you're going to be very uncomfortable,\" Galvan said. While there are no height or weight maximums for Forbidden Journey, the safety restraints must be able to close properly for guests to ride, Universal officials said. Like many theme park attractions, Forbidden Journey has a tester seat near the entrance for visitors who might be worried they won't fit on the ride. But as big and tall riders will tell you, those tester seats often can be misleading. \"I do not trust the accuracy of the test seats, no matter the park,\" Galvan said. \"I can only suspect that the seat belts on the test seats are intentionally short to minimize the potential of riders getting the\" walk of shame' at the station. I've also had the opposite happen, where I made the test seats but was rejected from the actual ride. \"Galvan, 31, is a regular contributor to SFGAmWorld, a fan site for Six Flags Great America outside Chicago. In 2007, he was so overweight that he stopped going to theme parks because he no longer could fit on the rides. Over the next three years, he lost more than 130 pounds so he could return to his passion: roller coasters. Anybody who has ever been kicked off a ride because he or she was too big will tell you that theme park attractions are not designed for people who are heavier or taller than average. All theme parks have euphemistic names for those who are too fat or too tall to fit safely in an attraction seat--\"exceptional sized riders\" or \"guests of larger size,\" for example. Some ride makers even try to make accommodations with \"big boy seats.\" So how big is too big? At Six Flags Great Adventure & Safari in Jackson, there are no set maximum measurements for riders, as each ride has different types of restraints, a spokeswoman said. But the Safety & Accessibility Guide on the park's website also warns, \"Due to the design of the seating safety device on this ride, exceptionally large or tall people may not be able to ride\" for a number of popular \"high thrill\" rides such as Batman: The Ride, El Diablo, <mark>El Toro</mark>, Green Lantern, Kingda Ka, Nitro, Runaway Mine Train, Superman: Ultimate Flight, The Dark Knight and The Twister, though most of these have test seats in front of the ride's entrance for guests to see if they will fit before attempting to get on the ride. The Bizarro coaster also has \"a special seat in Row 5 of each train to accommodate guests with larger body proportions,\" the site says. Similarly, at Hersheypark in Hershey, Pa., each ride has different height and weight limitations. However, guests approaching 300 pounds may have difficulty on a number of roller coasters, aerial and swinging rides, according to Laura Woodburn, director of ride operations. As at Six Flags, many of these rides have a test seat at the front of the lines and a sign at the entrance reading: \"This ride may not accommodate guests of a larger size (height and/or weight) due to the configuration of the safety system.\" The signs allow guests to make a decision about whether to ride prior to waiting on line and, Hersheypark hopes, prevents guests from being \"embarrassed or disappointed,\" Woodburn said. Cedar Fair, the parent company of Knott's Berry Farm in Buena Park, Calif., and 10 other amusement parks, offers very specific size requirements for \"guests of larger size.\" Cedar Fair warns that men over 6 foot 2 inches or 225 pounds with a 40-inch waistline or 52-inch chest \"may not be accommodated on some of our rides.\" The park operator says women over 200 pounds who wear a size 18 or larger could have trouble fitting on some rides. At Ohio's Cedar Point, some coasters such as Millennium Force, Top Thrill Dragster and GateKeeper have a 6-foot-6-inch height maximum. Ohio's Kings Island institutes height maximums for a number of rides, including Firehawk (6-foot-9), Invertigo (6-foot-6) and Delirium (6-foot-4). Tennessee's Dollywood has 6-foot-6-inch height maximums on a number of rides, including the Wild Eagle wing coaster. The Green Lantern: First Flight at Six Flags Magic Mountain in Valencia, Calif., has a height maximum of 6 foot 5 inches. Busch Gardens Williamsburg in Virginia sets aside two rows of seats on the Alpengeist and Griffon coasters for riders with \"chest measurements exceeding 52 inches.\" Splashin' Safari water park at Holiday World in Indiana uses a walk-on scale to ensure the maximum weight on the six-passenger Mammoth rafts doesn't exceed 1,050 pounds. Disney parks have no height or weight maximums on any attractions, according to officials. Disneyland famously replaced the 1964 boats on It's a Small World because the increasing waistlines of Americans were causing them to run aground--an assertion reported by MiceChat and vigorously denied by Disney officials. Theme park officials typically respond with prepared statements when asked about making accommodations for \"riders with unique physical attributes\" (such as this one from Six Flags): \"We work closely with ride manufacturers to incorporate safety systems that are designed to accommodate people of average physical stature and body proportions. We require that all seat belts, lap bars and shoulder harnesses be positioned and fastened properly. Because of the rider restraint system, guests of a larger size may not be accommodated on some rides.\" As has been well documented, Americans are getting fatter. The average weight for adult men has risen from 166 pounds in 1960 to 195 pounds in 2012, according to the Centers for Disease Control and Prevention. The average weight for women increased from 140 to 166 pounds during the same period. Addressing the issue is complicated for ride makers in part because every rider carries weight differently--with problem areas ranging from the hips, waist and stomach to the chest and shoulders. For big riders, coaster \"rideability\" varies from park to park. One of the biggest concerns for larger riders is what Galvan calls the \"seat belt lottery.\" \"It's absolutely amazing how from one row to another, the length of the seat belt will vary,\" he said. \"The only reason I can think for this irregularity would be off-season maintenance. Some rides are more egregious than others in this department.\" Older coasters by Arrow Dynamics and Schwarzkopf tend to be the easiest to ride for larger riders, according to Galvan's \"Big Boy's Guide to Roller Coasters.\" Some Bolliger & Mabillard rides can be tight fits, while others offer rows with larger seats, Galvan said. Vekoma, Gerstlauer and Mack Rides typically present few problems, while Premier and Intamin often prove difficult for bigger riders, he said. Intamin's suspended launch coasters such as Wicked Twister at Cedar Point and Volcano at Virginia's Kings Dominion cause the most problems for big riders, he said. \"The issue with these rides is the seat belt and the lack of an audible\" click' when pulling the restraint down, \"Galvan said.\" Not to mention that you have the seat several feet off the ground, so you have to tippy-toe or jump up to get into the seat. Depending on your body dimensions, you might not be able to maneuver yourself to get into the seat properly. \"There are no industry standards among ride makers and amusement parks when it comes to accommodating bigger riders. Some parks require two locking clicks to secure a lap bar or over-the-shoulder restraint on a ride, while others insist on three clicks. Seat belt lengths can vary from ride to ride and row to row.\" Most manufacturers, if not all, hoping to do business in the U.S. are now offering optional \"jumbo' seats to buyers to fit larger adults,\" said Bob Dean of Florida-based Leisure Labs, which represents Mack Rides, Great Coasters International and Mondial. Los Angeles Times writer Brady MacDonald and Record staff writer Sophia F. Gottfried contributed to this report."}, {"articleID": "2018112414_00428919_W", "names": {"Brent Taylor": ["Q4961560", "Q4961561", "Q4961563"], "Michael Hayden": ["Q1226020", "Q449604", "Q6831016"], "Roger Stone": ["Q19653753", "Q7358961"]}, "date": "2018-11-24", "url": "https://www.washingtonexaminer.com/news/us-soldier-dies-in-afghanistan", "content": "US soldier dies in Afghanistan Print this article A U.S. service member was killed in Afghanistan Saturday, according to the NATO-led Resolute Support mission, the second soldier to die in the country in November and the 10th in 2018. The identity of the service member and details about how they were killed would be shared \"at a later stage,\" Sgt. 1st Class Debra Richardson, a spokeswoman for Resolute Support, said in a brief statement. The soldier's death follows that of Maj. <mark>Brent Taylor</mark>, a member of the U.S. Army National Guard and mayor of the Utah city of North Ogden, who was killed earlier this month in an apparent \"insider attack\" in Kabul, Afghanistan. The NATO-led mission in Afghanistan began in 2015 and involves about 14,000 U.S. troops advising and supporting Afghan security forces in their efforts against the Taliban, which was toppled in 2001. More than 2,400 service members have died in the country over the course of the 17-year conflict, making it America's longest. In 2018, the Pentagon has announced the deaths of 25 soldiers, including seven in \"non-combat incidents,\" including nine American troops who have died in Iraq, and one each in Syria, Somalia, Kosovo, Djibouti, United Arab Emirates, and Germany. Share your thoughts with friends. More Washington Examiner Associated Press Saturday November 24, 2018 DUBAI, United Arab Emirates (AP)--A prominent Saudi royal said Saturday that whether or not heads of state gathered in Argentina next week for the Group of 20 summit warmly engage with Crown Prince Mohammed bin Salman, he is someone \"that they have to deal with.\" Susan Ferrechio Saturday November 24, 2018 Senate Republicans next week will kick off an end-of-year push to confirm President Trump's judicial nominations, one that could be thwarted by outgoing Sen. Jeff Flake, R-Ariz. Daniel Chaitin Friday November 23, 2018 Rep. Adam Schiff, D-Calif ., has some big plans next year when he takes the chairmanship of the House Intelligence Committee from Devin Nunes. Naomi Lim Friday November 23, 2018 President Trump shot down a report that indicated Treasury Secretary Steven Mnuchin's time in his administration may be coming to an end over his role in the appointment of Federal Reserve Chairman Jerome Powell. Naomi Lim Friday November 23, 2018 New York's highest court has refused to dismiss the state attorney general's lawsuit against the Trump Foundation alleging President Trump and his three eldest children illegally used the charitable organization for their own private and political benefit. Naomi Lim Friday November 23, 2018 White House deputy chief of staff for communications Bill Shine reportedly received $8.4 million in severance pay from 21st Century Fox when he resigned from Fox News in May 2017 amid criticism over how he handled sexual misconduct complaints leveled at some of the cable news network's top talent. Vaishnavee Sharma Friday November 23, 2018 The Trump administration made a move to bypass the appeals court system Friday by asking the Supreme Court to take up three lawsuits challenging restrictions on transgender military service. Naomi Lim Friday November 23, 2018 A handful of House Democrats signaled Friday that they will withhold their support for House Minority Leader Nancy Pelosi's speakership bid in a pressure effort to convince the California Democrat to agree to a rules reform package that would weaken her control on the lower chamber. Daniel Chaitin Friday November 23, 2018 Former Vice President Al Gore accused President Trump of trying to \"hide the truth\" of a government climate report by having it released during a holiday weekend. Associated Press Friday November 23, 2018 As California's catastrophic wildfires recede and people rebuild after two hurricanes, a massive new federal report warns that these types of extreme weather disasters are worsening in the United States. The White House report quietly issued Friday also frequently contradicts President Donald Trump. Naomi Lim Friday November 23, 2018 Hillary Clinton has blasted Fox News for becoming a \"superb propaganda\" tool for President Trump and the GOP, arguing that the cable news network distorts reality for its viewers in a way that is politically helpful for the White House and administration. Naomi Lim Friday November 23, 2018 <mark>Michael Hayden</mark>, a former CIA and National Security Agency director, was rushed to hospital this week after suffering from a stroke, according to his namesake think tank. Naomi Lim Friday November 23, 2018 Jerome Corsi, a far-right writer linked to President Trump and <mark>Roger Stone</mark>, is in talks with special counsel Robert Mueller over a possible plea deal. Daniel Chaitin Friday November 23, 2018 Former FBI Director James Comey is taking some heat after announcing on Thanksgiving that he would \"resist\" a subpoena to appear for a closed-door deposition with a joint congressional task force for fear of Republicans selectively leaking his testimony to the public. Naomi Lim Friday November 23, 2018 The mayor of Tijuana, Mexico, declared an international humanitarian crisis Thursday for his city after about 5,000 Central American migrants traveling in a caravan descended on the U.S. border. Daniel Chaitin Friday November 23, 2018 The Food and Drug Administration said Friday that efforts are underway to remove romaine lettuce from California from the supply chain, as they believe an E. coli outbreak likely originated from the Golden State."}, {"articleID": "2009033112_00061734_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"]}, "date": "2009-03-31", "url": "http://aei.org/publications/pubID.29627,filter.all/pub_detail.asp", "content": "and now for a riddle: what is big, loud, unnecessary and costs $75 million? no, not a retired elephant in a diamond-studded dress: the answer is, of course, a group of 20 summit. these g-20 meetings--younger, chubbier cousins of the equally pointless g-7 and g-8 summits--have been going on since 1999, in an under-the-radar kind of way, but lately they have taken on a new urgency. indeed, the next one, in london on thursday, is being widely billed as the one that will rescue the international economic system, provoke a stock market rally, create lasting prosperity and save the politicians present from the disgruntled voters protesting outside. and all of this in a single day! yet the truth is that nothing that will be discussed at the summit, and nothing that will be discussed at any of the follow-up summits, could not also have been discussed on the telephone. or by e-mail. or on a skype conference call. indeed, one british writer suggests that \"the world's leaders should have followed their usual platitudes about looking to the future and engaging the young by holding the whole thing on facebook.\" the purpose of this summit, like all such summits, is not really discussion. it is politics. but then, the purpose of this summit, like all such summits, is not really discussion. it is politics. from the hosts' perspective, the primary purpose is to rescue <mark>gordon brown</mark>, the british prime minister, whose popularity is at record lows. <mark>brown</mark> spent the years between 1997 and 2007 serving as britain's chancellor of the exchequer--the equivalent of america's treasury secretary--and thus cannot, like his american counterparts, blame britain's financial crisis on the mistakes of the previous administration. he took credit for britain's booming economy during those years and is being held responsible for britain's unusually deep recession: for weeks now, the british press has been howling for him to \"apologize.\" if nothing else, those official summit photographs--<mark>brown</mark> surrounded by the leaders of america, china, russia, argentina, against the grim, industrial background of london's isle of dogs--will make him feel important again. others have different agendas, none of which entail much real discussion either. the obama administration, for example, hopes to use the summit as a tool to bludgeon the germans and others into spending more money: they want each country present to commit 2 percent of its gross domestic product to a stimulus package, creating a sort of family support structure for the gazillion-dollar american stimulus package. this would, in theory, allow our president, too, to go home and declare victory. and if it doesn't happen, at least he'll have a culprit when the international economy does not fix itself within a month or two: it will all be the fault of the europeans, who--typical continentals!--dither, dissemble and squabble among themselves instead of rallying to the american call. while i am usually the first to accuse the europeans of dithering and dissembling, i actually have some sympathy for the germans on this point. the reason they, the french and many others in europe--the british are an exception--have avoided spending large amounts of money on their economy is not that they are incompetent continentals. it is because they do not think it will work. strange though it may sound, angela merkel, the german chancellor, and nicolas sarkozy, the french president, are leaders who, for better or for worse, came to have some respect for what used to be called anglo-american capitalism, with what used to be its reputation for fiscal conservatism. more to the point, they are also running up against the limits of what they can borrow and are worried about inflation as well. this latter worry is even more acute in many smaller european countries, some of which are actually cutting their budgets and introducing financial austerity packages as a result. though these policies aren't popular now, their advocates might well be proved right in the end. there is an analogy, here, albeit an unfortunate one, to the recent past. after sept. 11, 2001, the bush administration, instead of fixing al-qaeda, afghanistan and pakistan for good, decided to invade iraq. the europeans balked--and those who didn't, such as the british, are now sorry. after the banking crisis, the obama administration, instead of regulating the banking system and the mortgage market, decided to devise a massive stimulus package, build a lot of bridges, expand educational spending and maybe fix health care, too. the europeans are balking again. will those who aren't, such as the british, be sorry a few years from now, too? at least if that happens, this week's g-20 summit will take on genuine importance. it won't be just another summit, producing another pile of documents, containing another bunch of euphemisms but, rather, will be a turning point. it will be remembered forever as the moment some of the rich world headed off in one direction and the rest headed off somewhere else. which might mean it has been worth at least a portion of that $75 million. related article on capitalism and trust by applebaum related article on protectionism in global trade by applebaum how to fix medicare: let's pay patients, not physicians should medicare pay for patient expenses the way automobile insurers pay for car-repair bills? in"}, {"articleID": "2010041806_00028390_W", "names": {"Rafael Ramirez": ["Q2127006", "Q5442567", "Q7282286"]}, "date": "2010-04-18", "url": "http://althistory.wikia.com/index.php?title=Eastern_Texas_(1983:_Doomsday)&diff=163763&oldid=prev", "content": ". no known expeditions had been taken into the area from doomsday through 2009 except for a world census and reclamation bureau team that scouted former galveston, corpus christi and houston in the summer of 2009 and a west texas army-led team that made contact with survivors in the nacogdoches area in november 2009 was established in 1989 by delegates from several eastern towns who met at stephen f. austin university nacogdoches; other important towns include tyler and college station the destruction caused by doomsday led to an influx of refugees not only from texarkana, longview and other military targets, but from the destroyed cities of dallas and fort worth in the north and houston and galveston from the south. effects from fallout, starvation and fighting over scarce resources led to a reduction in population to a mere the surviving city-states, notably tyler, college station and nacogdoches, alternately fought each other for remaining resources and worked with each other to secure said resources. it became clear to everyone that cooperation, not fighting, provided the region's best chance of survival. the surviving city-states, notably tyler, college station and nacogdoches, alternately fought each other for remaining resources and worked with each other to secure said resources. it became clear to everyone that cooperation, not fighting, provided the region's best chance of survival. on may 8, 1989, the 13 remaining city-states agreed to join as the \"republic of texas\" . their standard of living had reverted back to a 19th-century level, as people were unable to restart power plants damaged on doomsday or in subsequent fighting. efforts continued at restarting the power plants, eventually paying off in 2007, when what is now called the central nacogdoches power plant was restarted on may 8, 1989, the 13 remaining city-states agreed to join as the \"republic of texas\" . their standard of living had reverted back to a 19th-century level, as people were unable to restart power plants damaged on doomsday or in subsequent fighting. from 1989 to 1992, scouts were sent into the dallas, texarkana, houston and waco regions to see if anyone else had survived. scouts returned from the houston and texarkana areas reporting no signs of life and \"massive\" devastation; scouts assigned to dallas and waco never returned. when houston scouts died of radiation-related causes, the political leaders called off all subsequent expeditions. from 1989 to 1992, scouts were sent into the dallas, texarkana, houston and waco regions to see if anyone else had survived. scouts returned from the houston and texarkana areas reporting no signs of life and \"massive\" devastation; scouts assigned to dallas and waco never returned. when houston scouts died of radiation-related causes, the political leaders called off all subsequent expeditions. one unauthorized attempt into western texas was made in 1995; the scout's written records was found amongst his remains west of waco by the first west texas army-led expedition into eastern texas (the army has said it will release the records to the public, but has yet to do so). one unauthorized attempt into western texas was made in 1995; the scout's written records was found amongst his remains west of waco by the first west texas army-led expedition into eastern texas (the army has said it will release the records to the public, but has yet to do so)., and society had stabilized into the equivalent of a late 19th-century state the central nacogdoches power plant was restarted. engineers at texas a & m and stephen f. austin universities were able the region to monitor radio stations out of mexico on may 8, engineers got a transmitter for one of the nacogdoches radio stations working, nearly 13 years after doomsday. further tests saw the station's reception gradually increase from a 1,000-foot radius from the transmitter to covering nacogdoches, then reaching into tyler and college station. the republic of superior and billings, montana, listening for any news they could get of the outside world. in june, another, from midland in western texas. this led government leaders to put top priority on getting the transmitter working, as it would be the region's first contact with western it was heard loud and clear not only throughout west up a faint signal on 860 am in his home at 10:21 a.m. the expedition left for nacogdoches on june 23. july 1, the nacogdoches signal broke its established format. an announcer acknowledged the republic as \"western texas\" and indicated those texas and other survivor states through radio, and was anticipating the army expedition's voice was heard, stating \"this is kvrt 860 am, nacogdoches, texas, the voice texas.\" the song then played a dozen more times before going off the air, 860 am out of nacogdoches began broadcasting three times a day, at 10 am, 3pm and 9 pm, carrying a question and answer format with local leaders regarding a welcoming party made up of local law enforcement texas senate on october 19 asking for republic explorers to be sent into nacogdoches \"immediately\" to explore the region and find the source of the transmission, and see if there is anyone alive in the area that meeting indeed occurred at 11:17 a.m. local time on july 9 just west of palestine a similar expedition from eastern texas. a radio report described the sequence was heard again at its previous strength at 10 a.m., and then again at 9 p.m., but this time loud and clear throughout the [[republic of west texas (1983: doomsday) | republic]]. what was broadcast was no different the signal was much, much stronger. not only was it heard through west texas, but also as far north and west as billings, [[north american union (1983: doomsday) | n.a.u.]] and provo, [[utah (1983: doomsday) | deseret]]; as far north as the {{1983dd | republic of superior}}; and even heard, faintly, as far east as charleston, [[virginian republic (1983: doomsday) | virginia]]. it also was heard in several towns in the [[mexico (1983: doomsday) | mexican]] states of durango, zacatecas and president mike conaway met that night with his cabinet, he was said to be taking phone calls from other national leaders as 860 am again went on the air, this time with the same signal strength it had the previous night ., the radio signal believed to be coming from the nacogdoches broke its established pattern from the city of nacogdoches in the state of texas, now the republic of texas. we acknowledge the nation of western texas, and also that our broadcast must have surprised all of you out west. we are in nacogdoches, the capital of our region, which also includes 12 other towns: tyler, bryan, college station, hemphill, san augustine, madisonville, crockett, lufkin, appleby, rusk, palestine, and huntsville. we have been able to monitor radio stations out of western texas and other states in the area at night, and are overjoyed that others have survived the cataclysm that destroyed our country in 1983. we are eager to meet representatives from the republic of western texas in the coming days and will extend every courtesy on august 6, 860 am began broadcasting three times a day, at 10 am, 3pm and 9 pm, carrying a question and answer format with local leaders regarding the history of the region and its society, as well as stating that a welcoming party made up of local law enforcement and the republic's secretary of state would meet the president craddick west texas army in palestine, for an escort into nacogdoches. that meeting indeed occurred at 11:17 a.m. local time on august 9 just west of palestine, between the west texas expedition and members of a similar expedition from eastern texas. a radio report described the meeting as \"20th-century army meets sheriffs from the old west\" . craddick travelled on nonstop to nacogdoches, and was escorted by military caravan nonstop to the eastern texas capital. . hopefully they come back having made friends. but this for all contingencies as they can be. we have complete trust in them, and anticipate the morning of august 11, a press conference with conaway and republic of texas governor bertis matlock was held at the main theater in downtown nacogdoches was spent detailing the histories of the two republics, but it was announced that the two countries had signed a treaty including provisions for medical and infrastructure aid from west texas and its allies, as well as talks to determine the future \"political\" relationship between the two parties. the conference was briefly interrupted by a heckler - a locally known comedian - who yelled twice from the back of the theatre \"where the hell were you west texans all this time?\" the heckler was led away by local sheriff no, he has a point. we should have been out here sooner. we had our own issues. we're committed now to working, and with other nations in the former united states and other areas of the region. said he had appointed tyler sheriff roger fergersen to work with west texas colonel <mark>rafael ramirez</mark> in \"regards to law enforcement matters here and in west texas helping us to set up an army.\" craddick also said that <mark>ramirez</mark> would oversee a on october 29, when colonel peter gonzales told reporters that was establishing a \"network\" of outposts and temporary radio towers, the military would be able to quickly render aid on november 2, the army-led expedition had advanced to the outskirts of old waco. meanwhile, that morning, the radio signal believed to be coming from the nacogdoches broke its established pattern. a one-minute announcement beginning at 10am local time (4pm gmt) was repeated over the next hour and 15 minutes. the announcer first identified the station as \"kvrt, the voice of the republic of texas\" , then paused for five seconds before making the following statement: \"over the past month we have been broadcasting twice each day over this frequency, from the city of nacogdoches in the state of texas, now the republic of texas. we acknowledge the nation of western texas, and also that our broadcast must have surprised all of you out west. we are in nacogdoches, the capital of our region, which also includes 12 other towns: tyler, bryan, college station, hemphill, san augustine, madisonville, crockett, lufkin, appleby, rusk, palestine, and huntsville to monitor radio stations out of western texas and other states in the area at night the 20 years after the 13 cities formed their republic of texas were highlighted by survival and building a viable society in the wake of their circumstances. the population increased to an estimated 80,000 due to\" baby booms \"in the 1990s and the 2000s, and society had stabilized into the equivalent of a late 19th-century state. on november 6, 860 am began broadcasting three times a day, at 10 am, 3pm and 9 pm, carrying a question and answer format with local leaders regarding the history of the region and its society, as well as stating that a welcoming party made up of local law enforcement and the republic's secretary of state would meet the west texas army in palestine, for an escort into nacogdoches. [[file:800 px-cowboy_18872. jpg | thumb | a sheriff's deputy from palestine in east texas .]] [[file:800 px-cowboy_18872. jpg | thumb | a sheriff's deputy from palestine in east texas .]] that meeting indeed occurred at 11:17 a.m. local time on november 9 just west of palestine, between the west texas expedition and members of a similar expedition from eastern texas. a radio report described the meeting as\" 20th-century army meets sheriffs from the old west \". west texas president mike conaway decided to travel to nacogdoches that evening, and was escorted by military caravan nonstop to the eastern texas capital. - [[file: nacogdochestheatre.jpg | thumb | the main theatre in downtown nacogdoches, where the historic press conference with governor roger van horn and west texas president mike conaway was held on nov. 11, 2009]] on february 15, 2010, representative mark mcdaniel (r-tyler), the primary challenger to incumbent roger van horn in the gubernatorial election, held a press conference in front of the main theater. mcdaniel challenged van horn to\" stop waffling \"on the issue of unification between eastern texas and west texas, then promised to\" pursue the inevitable \"and work for unification of the two countries if he is elected in november. the only nations eastern texas has an official relationship with so far are west texas and mexico. unofficially, diplomats have also met their counterparts from dinetah, the east caribbean federation and the city-states of hattiesburg, broken bow and natchez. rumors continue to circulate that eastern texas will formally unite with west texas into one republic of texas. no official word of such a union from either nation has ever been hinted, much less confirmed, but the rumors nevertheless persist. eastern texas currently is not a member of the league of nations, although it has sent an observer to lon regional headquarters in hattiesburg, former mississippi. eastern texas currently is not a member of the league of nations, although it has sent an observer to lon regional headquarters in hattiesburg, former mississippi. current revision as of 05:13, april 18, 2010 flag of republic of texas coat of arms of eastern texas, east texas location of eastern texas, east texas nacogdoches largest city: nacogdoches other cities: tyler, bryan, college station, hemphill, san augustine, madisonville, crockett, lufkin, appleby, rusk, palestine, huntsville english other languages: spanish west texas dollar; mexican peso; barter eastern texas got its share of strikes on doomsday. the largest concentration of strikes came in and around houston. some other regions, including texarkana, were also hit. the destruction caused by doomsday led to an influx of refugees not only from texarkana, longview and other military targets, but from the destroyed cities of dallas and fort worth in the north and houston and galveston from the south. effects from fallout, starvation and fighting over scarce resources led to a reduction in population to a mere 360,000 people bythe fall of 1984. the surviving city-states, notably tyler, college station and nacogdoches, alternately fought each other for remaining resources and worked with each other to secure said resources. it became clear to everyone that cooperation, not fighting, provided the region's best chance of survival. on may 8, 1989, the 13 remaining city-states agreed to join as the\" republic of texas \". their standard of living had reverted back to a 19th-century level, as people were unable to restart power plants damaged on doomsday or in subsequent fighting. from 1989 to 1992, scouts were sent into the dallas, texarkana, houston and waco regions to see if anyone else had survived. scouts returned from the houston and texarkana areas reporting no signs of life and\" massive \"devastation; scouts assigned to dallas and waco never returned. when houston scouts died of radiation-related causes, the political leaders called off all subsequent expeditions. one unauthorized attempt into western texas was made in 1995; the scout's written records was found amongst his remains west of waco by the first west texas army-led expedition into eastern texas (the army has said it will release the records to the public, but has yet to do so). efforts continued at restarting the power plants, eventually paying off in january 1996, when what is now called the central nacogdoches power plant was restarted. engineers at texas a & m and stephen f. austin universities were able to build working radios, enabling the region to monitor radio stations out of mexico, puerto rico, cuba...and west texas. once the situation in western texas was ascertained from radio monitoring, eastern texas officials debated on whether to send scouts into the region. mindful of the earlier failed expeditions into the dallas and houston areas, officials eventually called off scouts, and instead debated, and agreed, upon an unorthodox strategy: announce the nation's existence to the known world via radio. on may 8, engineers got a transmitter for one of the nacogdoches radio stations working, nearly 13 years after doomsday. further tests saw the station's reception gradually increase from a 1,000-foot radius from the transmitter to covering nacogdoches, then reaching into tyler and college station. edit] contact with eastern texas on june 4, weak am radio signals coming from eastern texas were heard in sweetwater for a brief time before the signal went dark. the morning of june 5, the signal returned, strong enough to be weakly heard in odessa; an announcer briefly identified the station as\" kvrt am 860, in nacogdoches, the official voice of the republic of texas \". the signal went dark again, but has reappeared each day at the frequency at 10 a.m. local time, before going dark at 11:13 a.m. the evening of june 20, at 9 p.m. central time, the signal returned, and this time it was heard loud and clear not only throughout west texas, but also in deseret and as far south as monterrey, nuevo leon in mexico. the morning of june 21, craddick told his military leaders to prepare for a trip to nacogdoches. the expedition left for nacogdoches on june 23. july 1, as the expedition was setting up camp outside old waco, the nacogdoches signal broke its established format. an announcer acknowledged the republic as\" western texas \"and indicated those in the region had knowledge of west texas and other survivor states through radio, and was anticipating the army expedition's soon-arrival in the region. the afternoon of july 1, the army affirmed to west texas radio that it would seek to control news about the expedition for\" security reasons and the safety of the expedition, but it would not hamper the feeding of information to the public regarding discoveries in and enroute to the region. \"on july 6, 860 am out of nacogdoches began broadcasting three times a day, at 10 am, 3pm and 9 pm, carrying a question and answer format with local leaders regarding the history of the region and its society, as well as stating that a welcoming party made up of local law enforcement and the republic's secretary of state would meet the west texas army in palestine, for an escort into nacogdoches. that meeting indeed occurred at 11:17 a.m. local time on july 9 just west of palestine, between the west texas expedition and members of a similar expedition from eastern texas. a radio report described the meeting as\" 20th-century army meets sheriffs from the old west \". at the same time, west texas military made formal contact with explorers from the state of south texas at yarbrough lake, about 70 miles south of former san antonio. that morning, the radio signal believed to be coming from the nacogdoches broke its established pattern. a one-minute announcement beginning at 10am local time (4pm gmt) was repeated over the next hour and 15 minutes. the announcer first identified the station as\" kvrt, the voice of the republic of texas \", then paused for five seconds before making the following statement: over the past month we have been broadcasting twice each day over this frequency, from the city of nacogdoches in the state of texas, now the republic of texas. we acknowledge the nation of western texas, and also that our broadcast must have surprised all of you out west. we are in nacogdoches, the capital of our region, which also includes 12 other towns: tyler, bryan, college station, hemphill, san augustine, madisonville, crockett, lufkin, appleby, rusk, palestine, and huntsville. we have been able to monitor radio stations out of western texas and other states in the area at night, and are overjoyed that others have survived the cataclysm that destroyed our country in 1983. we are eager to meet representatives from the republic of western texas in the coming days and will extend every courtesy. we look forward to further communications, and to learning more about you, as you learn more about us. thank you, and god bless texas. on august 6, 860 am began broadcasting three times a day, at 10 am, 3pm and 9 pm, carrying a question and answer format with local leaders regarding the history of the region and its society, as well as stating that a welcoming party made up of local law enforcement and the republic's secretary of state would meet the president craddick west texas army in palestine, for an escort into nacogdoches. that meeting indeed occurred at 11:17 a.m. local time on august 9 just west of palestine, between the west texas expedition and members of a similar expedition from eastern texas. a radio report described the meeting as\" 20th-century army meets sheriffs from the old west \". craddick travelled on nonstop to nacogdoches, and was escorted by military caravan nonstop to the eastern texas capital. the morning of august 11, a press conference with conaway and republic of texas governor bertis matlock was held at the main theater in downtown nacogdoches. much of the press conference was spent detailing the histories of the two republics, but it was announced that the two countries had signed a treaty including provisions for medical and infrastructure aid from west texas and its allies, as well as talks to determine the future\" political \"relationship between the two parties. the conference was briefly interrupted by a heckler - a locally known comedian - who yelled twice from the back of the theatre\" where the hell were you west texans all this time? \"the heckler was led away by local sheriff's deputies, but conaway replied\" no, he has a point. we should have been out here sooner. we had our own issues. we're committed now to working with your republic, and with other nations in the former united states and other areas of the region. \"matlock said he had appointed tyler sheriff roger fergersen to work with west texas colonel <mark>rafael ramirez</mark> in\" regards to law enforcement matters here and in west texas helping us to set up an army. \"craddick also said that <mark>ramirez</mark> would oversee a group of 600 west texas army personnel assigned to eastern texas for a six-month period. homesteaders about to set up camp outside van horn, 1987 a sheriff's deputy from palestine in east texas. the texas state constitution was adopted as is when the towns confederated, and the governmental structure was initially established on as much of the pre-doomsday state model as possible. the governor's mansion is a private residence near the stephen f. austin university campus in nacogdoches donated to the republic after confederation. the legislature meets on the sfa campus, as officials decided there was not enough manpower nor material to build a new state capitol building. other state agencies have their offices either in downtown nacogdoches, or on the sfa campus. politics are dominated by the successors to the pre-doomsday democratic and republican parties. the republicans tend to be conservatives appealing to the large southern baptist base in the region and make up roughly 60 percent of registered voters. democrats, making up 34 percent of voters, are found mainly in the capital of nacogdoches and in college station and have a more liberal, progressive view of social issues. abortion and homosexuality are two issues the democrats have pushed in recent years. independents make up the other 6 percent of voters, and tend to reject both the perceived (and real) far-right and far-left extremes of both parties. farming, ranching and cotton have been the biggest industries in the nation since confederation. though they will continue to play a big role in the local economy, it is anticipated that oil and natural gas production will ramp up significantly in the next couple of years. the east texas oil field, one of the biggest such fields in the pre-doomsday united states, has been dormant since 1983. tests by mexican and west texas petroleum companies are ongoing to see how much oil is there, and how many barrels of oil the basin could export over the next 25-50 years. west texas and mexico also hope to develop the abundant natural gas fields in the region. in 2010, west texan and mexican economists and officials are looking for ways to pour money into the region. they recognize that most people will need job training in the new, 21st-century economy that the two countries are trying to develop in eastern texas, and they will need to be able to earn money. the challenge is how to develop a strong middle class, and not have a third-world nation perpetually dependent on heavy government aid and private charity assistance. it is hoped that oil, natural gas, cotton, farming and ranching, along with lesser industries like the rose-growing industry being redeveloped in tyler, will provide a solid base for a strong eastern texas economy. barter became the de facto system right after doomsday and, until the reunion with west texas, persisted as the only way to trade and obtain goods and services. over the years, there were various attempts to establish a monetary-based economy. the longest-lasting was from 1994 to 2000, when the government pushed the u.s. dollar, and then the texas dollar, as the monetary standard. even then, nearly everyone used barter in some form or another. the texas dollar was abandoned in 2000. currently, the west texas dollar and mexican peso are the two currencies in use in the region. there had been no organized military in the country until its reunion with west texas. the biggest threats to the republic came from criminals and roving gangs of bandits, and those were dealt with by local law enforcement. the police departments for all 13 towns had an agreement to work together when necessary, and there was a provision in the eastern texas constitution for a draft of all able-bodied men in case of invasion. west texas military has a presence in east texas and is currently working to establish some sort of army for the nation. some observers believe the east texas army will be, if not in name, then in practice part of the west texas military. local law enforcement in each town is led by a sheriff, voted in by citizens, and responsible for appointing, oversight and training of deputies and other officers. in nacogdoches, college station and tyler, a police chief oversees the department, and regional deputies handle the duties a sheriff would in smaller towns. the texas rangers of eastern texas were responsible primarily for the protection of the governor and his family. their duties are currently being expanded to be more reflective of their west texas counterparts. the texas baptist convention, headquartered in nacogdoches, has by far the largest religious presence in the nation. an estimated 58 percent of citizens belong to tbc churches, and the tbc has long been active in national politics. the roman catholic diocese of eastern texas is the second-largest religious body in the nation, making up an estimated 28 percent of citizens. the diocese takes a neutral stance in regards to politics, but members have been known to side with the tbc-led\" conservative movement \"or with progressives. many hispanics are catholic, as the church has been part of their families for several generations. other protestant denominations and sects - pentecostalism in particular - make up 8 percent of citizens. 2.5 percent profess to be atheistic or agnostic, 1 percent have\" no religion \"and .5 profess other religions, specifically judaism, taoism and buddhism. sports in the so-called republic of texas (a group of small city states in the eastern portion of former texas) was described by a west texas military soldier as\" what might be if you took modern sports and transported them back to the old west. \"american football is played as it was pre-doomsday, although the type of ball the locals have been able to manufacture have forced the sport to become more of a running game than a passing game. helmets are a hybrid of leather with facemasks made out of copper, iron or other metals. baseball also is played as it was pre-doomsday, although the ball is more\" dead \"(which has cut down on home runs); home plate is made out of wood; and batting helmets are made out of cast iron, with primitive, cotton-based padding inside. association football, known as soccer in the region, is the third most popular sport. observers from west texas and mexico were surprised at the high level of play in the primary amateur league, and especially by the talent of midfielder clint dempsey, a nacogdoches native. the famous radio station at 860 am, with the call letters kvrt (ksfa pre-doomsday), now operates seven days a week, from 5 a.m. to 11 p.m. local time. it broadcasts a mix of news, sports, talk shows, religious programming, music (primarily country), as well as comedies, dramatic programs and soap operas. west texas radio is working to establish three more stations in the region by spring 2010, and up to ten by summer 2011. telephone service has been established between midland and the governor's mansion in nacogdoches; west texan and mexican companies aim to have all government agencies wired by the end of 2009 and service to all 13 towns restored by fall 2010. the daily sentinel, based in nacogdoches, is the nation's newspaper of record. two universities reopened in the years after doomsday: stephen f. austin university in nacogdoches, and texas a & m university in college station."}, {"articleID": "2019071011_00071124_W", "names": {"Tyrell Johnson": ["Q56556763", "Q7861487"], "Paul James": ["Q1558855", "Q3898091", "Q503399", "Q53997267", "Q5827750", "Q7151541", "Q7151542", "Q7151543", "Q7151544", "Q7151545"]}, "date": "2019-07-10", "url": "https://neconnected.co.uk/news-from-british-basketball-league-raiders-offer-tyrell-johnson-professional-start/", "content": "News from British Basketball League: Raiders offer <mark>Tyrell Johnson</mark> Professional Start Posted by Dave Stopher | Jul 10, 2019 | Sports | 0 | Rookie <mark>Tyrell Johnson</mark> is Coach <mark>James</mark>' fourth signing and eighth addition for the 19/20 season, he will begin his professional career in Plymouth after graduating from Appalachian State University. Standing at 6' 8 <mark>Tyrell</mark> had an impressive senior year at App State with 9 points and 4.1 rebounds per game, finishing with a shooting percentage of 48.4% from the field. The American forward had a season high 20 points against Howard in April 2018 also picking up 8 rebounds and shooting 8 from 12 from the field in the game. Across the season his defensive effort also showed with 28 blocks,11 steals and 91 defensive rebounds in 31 games. <mark>Tyrell</mark> will join Raiders from his hometown in Atlanta, Georgia and will pull on the green jersey for the 19/20 season, ahead of the start of his professional career <mark>Tyrell</mark> said: \"I am excited about being a part of the Plymouth Raiders Team.\" After speaking with Coach <mark>Paul James</mark>, it brought even more excitement for the upcoming season. \"It is a great opportunity to showcase my talent on the basketball court at a professional level.\" I look forward to continuing to improve upon Coach <mark>James</mark> resume with another successful season. \"Since his time with Raiders, Coach <mark>James</mark> has given opportunities to a series of rookies, trusting in their talents and allowing them to perform on a big stage. With <mark>Tyrell</mark> the first rookie to join the ranks this season he said:\" I'm pleased with the signing of <mark>Tyrell Johnson</mark> for the coming season. \"He is a talented player who has great athletic ability and can score in many different ways as well as rebound the ball efficiently.\" I'm excited about seeing <mark>Tyrell</mark> play in multiple positions for us at both ends of the court. \"I think his game is very well suited to the BBL and I'm looking forward to him joining up with the rest of the team and getting down to the business of starting his pro career.\" Share:"}, {"articleID": "2013080103_00060730_W", "names": {"Emily Bell": ["Q15934723", "Q57691495"]}, "date": "2013-07-31", "url": "http://feeds.gawker.com/~r/jezebel/full/~3/xGmi9nTTe-Y/jill-abramson-cried-get-over-it-977624085", "content": "The formidable Jill Abramson was named executive editor of The New York Times in June 2011. Since she's taken the helm, The Times whopping four in 2013 alone - and oversaw the prestigious newspaper's breathless coverage of the Boston Marathon bombings, all points that his in-depth profile of Abramson. But amidst the 3,000-word longread, one point stuck with readers and other new sources: Jill Abramson admitted to crying after receiving bad press. Turbulence at The Times, \"a scathing account of Abramson's\" stubborn \"and\" condescending \"temperament, bolstered by the comments of one anonymous Times employee who described her as\" impossible, \"listing example after example of her abrasive, take-no-prisoners attitude. The article prompted backlash from media elite like <mark>Emily Bell</mark>, who criticized the sexist undertones of the Politico article: For every anonymous source anxious to talk about Abramson's mood swings, and absences, there could have been a counterbalancing one to talk about how Abramson is more present on the news floor than a number of her predecessors. For every person who talks about the exhausting nature of her management style, there is another who might point out that the news operation is the strongest it has been for a long time. You might even find people who think there is more than a whiff of sexism apparent in the building, and the critiques. None of this, however, feeds the story of a woman in charge who tells people what to do in a manner they don't like. In The Daily Beas t in-depth, Abramson admits she cried after reading the article:\" I cried, \"Abramson tells me.\" I should say it went right off me, but I'm just being honest. I did cry. But by the next morning, I wasn't completely preoccupied by it anymore. I had my cry and that was that. \"For Abramson to admit she cried is bold. She was lucky that her brief show of emotion wasn't in front of a crew of cameras, as was the case for Hillary Clinton in 2008. Her reaction, in the privacy of her own home, to an article that amounted to a personal attack is more than appropriate. And her admitting some tears after the accusation that she was an ineffective leader was a minor point in an article that otherwise examined Abramson's leadership style from a holistic point of view. But you can trust that the public won't let an example of a woman in the position of power shedding some tears go without mention. Dr. Kim Elsbach of the University of California has studied the repercussions of crying in the workplace, and found that\" The worst offenses...are crying in a public meeting or because of work stress, like a looming deadline or coworker disagreement, because it is considered disruptive and weak. Crying in a private performance evaluation is also considered unprofessional and often manipulative. \"New York Magazine in particular has ran with the Jill Abramson Cries and It's News story: read,\" New York Times executive editor Jill Abramson is not going to pretend she doesn't feel feelings, if only for a moment. \"Another highlight of the profile? An anecdote of Abramson curtly informing a maintenance worker to wait for her to finish her interview with The Daily Beast before carrying away tables and chairs for an event.\" It's a balancing act, and she appears to be pulling it off, \"finished the NYMag piece. A balancing act between what? Being a bitch on one hand and a sensitive woman on the other? The only thing worse than The Bitchy Corporate Woman trope is The Bitchy Corporate Woman Also Cries trope. From The Daily Beast profile, it's clear that Abramson falls into neither. She's an effective editor with certain aggressive personality traits necessary to be at the helm of one of the world's most respected news sources. She led her staff through layoffs, additional replies submitted and awaiting review"}, {"articleID": "2018111216_00464894_W", "names": {"Steve Russell": ["Q16195304", "Q2634274", "Q30122065", "Q42277880", "Q43388452"]}, "date": "2018-11-11", "url": "http://newsok.com/politics-monday-voters-send-more-women-to-state-capitol/article/5614727?custom_click=rss", "content": "Politics Monday: Voters send more women to state Capitol by Ben Felder Published: Sun, November 11, 2018 3:47 PM Updated: Mon, November 12, 2018 10:35 AM shares email Advertisement Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman Female lawmakers will still make up less than one-fifth of House and Senate members when the state Legislature convenes in February, but their numbers are growing. There will be 31 women serving in the state Legislature, up from 21 during the 2018 session. There are 149 seats in the House and Senate. The Oklahoman's Dale Denwalt has more on the increase in women elected to office. Kendra Horn will become the only female (and only Democrat) member of Oklahoma's congressional delegation after she beat incumbent Rep. <mark>Steve Russell</mark>. Horn was a guest on last Friday's episode of Political State, which you can watch here. During her appearance on the show, Horn said she is still considering potential committee assignments and determining which will best help her Oklahoma City-based district. \"I worked in the space industry for a number of years,\" Horn said. \"So, the idea of Science, Space and Technology (Committee) is pretty exciting. I think there are a number of others.\" Horn also said she hasn't committed to voting for Nancy Pelosi for speaker of the House. \"I don't know who all's thrown their hat in the ring so I can't say who I'm going to vote for but I do think the Democratic Party and Democratic leadership, they need new leaders to step in and fresh blood,\" Horn said. Oklahoma City council: Nikki Nice lost her job in radio one day after winning her race to be the next Ward 7 representative on the Oklahoma City Council. An on-air personality at Heart & Soul 92.1 and Power 103.5, Nice had been handling off-air duties since filing for office. Asked Thursday whether letting Nice go was related to her being elected, Russell Perry, chairman and owner of Perry Publishing & Broadcasting, said, \"No, it's just that we've taken a different direction.\" Commutation requests headed to governor's desk Gov. Mary Fallin now will decide whether to reduce the prison sentences of 22 individuals who received favorable recommendations from the Oklahoma Pardon and Parole Board last week. Michael McNutt, a spokesman for Fallin, said the commutations likely will reach the governor's office in the next two weeks. (Story continued below ...) Asked whether Fallin plans to act on those 22 cases before leaving office in January, McNutt said: \"It is a priority of Governor Fallin to act on pardons, paroles, and commutations to get them processed as expeditiously as possible so that a backlog is not left for the next administration.\" Rural vote helps get Stitt to governor's office Gov.-elect Kevin Stitt won the election for Oklahoma governor last week by 12 percentage points, a wide margin of victory that surpassed most expectations and indicated the enthusiasm behind Stitt, especially in rural communities, was greater than expected. \"Right now, that sea of red is still outweighing the islands of blue,\" said Bill Shapard, CEO of Shapard Research, speaking about the concentration of Democratic votes in the state's two largest cities, surrounded by Republican support across rural Oklahoma. Democrat Drew Edmondson's largest vote totals came from Oklahoma City and Tulsa, and he even made some headway in the Oklahoma City suburbs, winning dozens of precincts in Edmond that had long been Republican strongholds. But the urban vote wasn't enough as rural Oklahoma showed its continued relevancy in statewide races. On Sunday, I had a story in The Oklahoman that took a closer look at Stitt's rural support and why both campaigns thought he did so well. Related Photos Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman <figure> <img src = \"/ / cdn2. newsok. biz/cache/r960 -311 ea56a7ee51655d695b84f152f8d39. jpg\" alt = \"Photo - Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman\" title = \"Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman\" > <figcaption> Kendra Horn, D, Congresswoman-elect for the House, district 5, Friday, November, 9, 2018. Photo by Doug Hoke, The Oklahoman </ figcaption> </ figure> Ben Felder Ben Felder is an investigative reporter for The Oklahoman. A native of Kansas City, Ben has lived in Oklahoma City since 2010 and covered politics, education and local government for the...Read more' Comments Comments Politics Monday: Voters send more women to state Capitol × Commenting on NewsOK requires a NewsOK Pro or Oklahoman subscription. Log in or subscribe to read and leave comments."}, {"articleID": "2015101619_00151767_W", "names": {"Erik Johnson": ["Q14874320", "Q16196083", "Q5388659", "Q58750433", "Q960577"], "Robin Walker": ["Q19668306", "Q263076", "Q57008521"]}, "date": "2015-10-16", "url": "http://www.gameranx.com/updates/id/31033/article/valve-refuses-to-put-ads-on-steam/#disqus_thread", "content": "Why Valve Refuses to Put Ads on Steam Valve does not see any value in advertising commercial products in Steam's PC storefront. by Olga Lexell on 16th Oct, 2015 Follow @ gameranx Be it online, in-game, or somewhere inbetween, ads are a hot topic in the games community, particularly how much they are not wanted. One place you won't be seeing them any time in the future, though, is Steam. In fact, Valve's <mark>Erik Johnson</mark> believes that while it would boost revenue, implementing ads in the Steam PC storefront would be detrimental to the whole platform. \"We don't see a case for that ever getting user value,\" <mark>Johnson</mark> said in a GameSpot interview. \"I don't think that those ever work, either.\" <mark>Johnson</mark> went on to say that \"it would be a bad business decision, let alone just dumb\" to introduce ads to the storefront, believing it would ruin their customers' experience. This customer-oriented approach seems in-line with other recent company moves, such as Valve's promise to refund any games purchased on Steam. According to <mark>Johnson</mark>, the company would rather \"focus on long-term relationships.\" Valve's <mark>Robin Walker</mark> agreed, and re-iterated that one of the company's primary goals is to help users searching for games amidst all of the releases in their massive library. Indeed, Valve did prove their commitment to long-term relationships when they announced their partnership with GameStop and other retailers who plan to sell their hardware, which goes on sale in November. Stories from around the web"}, {"articleID": "2019101802_00185478_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Philipp Weber": ["Q15840414", "Q2087278", "Q2087282"]}, "date": "2019-10-18", "url": "http://www.gamereactor.eu/cyberpunk-2077/?sid=70b8dc0beb6382aa856f0983b5ebddee", "content": "CYBERPUNK 2077 NEWS. Written by <mark>Sam Bishop</mark> on the 14th of October 2019 at 12:06 Nothing is set in stone, but with Cyberpunk 2077 also having multiplayer in the works, it's not too far-fetched. NEWS. Written by Lisa Dahlgren on the 1st of October 2019 at 19:23 The polish actor who portrayed Geralt in the original Polish Witcher TV-series will play Johnny Silverhand in the Polish version of Cyberpunk 2077 NEWS. Written by <mark>Sam Bishop</mark> on the 13th of September 2019 at 11:49 \"We really want to make sure players get the representation that they want,\" says level designer Max Pears. NEWS. Written by <mark>Sam Bishop</mark> on the 12th of September 2019 at 12:42 Goodbye Kansas and CDPR release a behind-the-scenes video on the trailer, showing us life in Night City. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of September 2019 at 15:00 CD Projekt Red's lead quest designer <mark>Philipp Weber</mark> spoke in a Q & A recently about the various stories available in the RPG. NEWS. Written by <mark>Sam Bishop</mark> on the 4th of September 2019 at 09:24 This hasn't been set in stone before, but after R & D they've decided to work on it, and they need more staff to do so."}]