[{"date": "2014-04-20", "url": "http://www.duluthnewstribune.com/content/cost-cold", "content": "Family, friends recall rise and fall of Minnesota fugitive minister Canopy of Greysolon Plaza in Duluth to be replaced with history in mind Reader's view: Support bill to make foster care homes smoke-free Reader's view: Letter omitted loopholes in gun sale background checks RedBlueAmerica: Should gun policy halt choice for surgeon general? Tweet Even if the snow and cold finally subside this Easter Sunday, the winter of 2013-14 will go down as one of the toughest in recent memory - and one of the most expensive. The Minnesota Department of Transportation reports that its spending on plowing and maintenance of state roads in Northeastern Minnesota already had reached record levels by the end of March. But, of course, those expenses have continued to mount, thanks in part to the snow and freezing rain that descended on the Northland this past week. Today, we reflect on some of the headaches of the season, including brutal heating bills, frozen pipes, failed roofs and the physical toll the battle between human and winter has taken on many of us. But amid the misery, this winter also has delivered rewards to snow enthusiasts, including the spectacle of the Apostle Islands' Ice Caves and the dramatic resurgence of the John Beargrease Sled Dog marathon. These, too, we will visit. For our disconcerting first stop, we hit the pavement. ROUGH RIDE Last winter was no cakewalk for people charged with road maintenance in the region. MnDOT spent a record-breaking $14.78 million during the winter of 2012-13 clearing winter roads in what it calls District No. 1 - an area that stretches from Canada on south to Pine County, west to Mille Lacs and back north, clear to International Falls. This winter, little respite could be found. Keeping state roads in the district clear had set MnDOT back $14.84 million by the end of March, ensuring that it would handily surpass last year's record. And, of course, winter has continued to exert its hold on the region in April, tacking more onto the season's mounting bill. Cities, too, have struggled to shoulder the costs of a harsh winter. To date this calendar year, the city is running about $230,000 over budget on its snow - and ice-removal costs, according to Peg Spehar, Duluth's chief financial officer. She cited the key drivers as increased use of salt, sand and fuel, combined with higher overtime and equipment maintenance costs. Yet Spehar remains confident the city can absorb the overruns without any special budget appropriations if more normal weather patterns return for the remainder of the calendar year. If the next winter arrives as early and fiercely as this one did, however, all bets will be off. Spehar hopes the city won't see a repeat of calendar year 2013, when back-to-back tough winters forced it to blow through its snow - and ice-removal budget, leaving it $1.1 million in the red. The city was able to make up about $600,000 of the shortfall with savings from other operations, but nevertheless a special allocation of an additional $500,000 was required to cover the difference at the end of 2013. SAND-BAGGED Particularly frigid weather rendered salt an ineffective tool much of this winter, forcing road crews to lean more heavily on sand to help motorists get a grip on Duluth's often icy hillside streets, said Kelly Fleissner, Duluth's maintenance operations manager. Patrick Huston, a MnDOT district engineer headquartered in Duluth, said this winter's unusually cold weather played a large role in driving up costs. \"Even though we had less snow than last winter, we had more cold and persistent ice conditions,\" he said, noting that salt is far less effective at low temperatures. \"We had to use more sand, and sand doesn't stay put. So we had to continually apply it, and that meant our people spent a lot more time on the road this winter,\" Huston said. Through March of this year, MnDOT workers had logged about 25,500 hours of overtime in District 1 - just 100 hours fewer than they did in all of the previous winter. While April numbers have not yet been added to the equation, Huston expressed certainty the current winter will set a new all-time high for the amount of overtime MnDOT road crews worked in the region. Spehar said the overtime hours for city road crews have surpassed expectations, too. While Duluth had budgeted for 34,000 hours of overtime during the early months of this year, she said road workers have already logged about 88,000 so far. SPRING AFTERMATH All the sand applied this winter will mean a lot of work for street cleaning crews this spring. Fleissner said he and his team are eager to remove the grit before it washes into Duluth's streams and rivers. But that work was put on hold by the return of snow last week. Fleissner said crews also would be hard at work filling potholes by now were it not for the latest dose of winter. The winter has done a number on many sections of pavement, and Duluth Mayor Don Ness announced earlier this month that the city will double its budget, spending another $400,000, to fill potholes and seal cracks in local streets. Fleissner welcomes the additional resources. He just wishes for a break in the weather that will allow street repairs to begin at last. In his understated manner, Fleissner said: \"It's going to be a busy spring for us .\" IN HOUR OF NEED No matter how bad the road conditions, emergency calls demand a rapid response. Firefighters and ambulance service providers alike know that they must find a way through whenever and wherever they're needed. But winter weather makes that job much more challenging. \"Access can be a problem, because many of the streets get so narrow during a winter like this one, and the cars tend to stick out further and further because of the snowbanks even if they're parked correctly,\" Duluth Fire Chief Eric Strongitharm said. \"It can be especially tough for us, because some of our rigs are pretty big,\" he said. But Strongitharm said local firefighters have received valuable help from plow drivers and others this winter. He says he knows of no situation where firefighters have failed to reach a fire or emergency scene this winter. <mark>Robert Kennedy</mark>, a paramedic and field training officer for Gold Cross Ambulance in Duluth, made the same claim, pointing to the importance of inter-agency cooperation. \"Every year brings some challenging situations, but this year has been exceptional in the number of days with difficult conditions,\" he said. \"What's most important is being prepared and being able to adapt on the fly .\" <mark>Kennedy</mark> said most winters bring a lull in activity, but this year has been consistently busy. To ensure that service hasn't suffered in adverse weather conditions, he said Gold Cross repeatedly has brought extra units online this winter. Strongitharm said call volumes during this winter were up about 50 percent from the norm when he last checked. He speculated that the increased number of emergencies may be related to the greater number of people holed up their homes, where kitchen mishaps and other household accidents can occur. <mark>Kennedy</mark> noted that calls for falls on ice or injuries related to snow removal from roofs and sidewalks were relatively common this winter, too. FROZEN SKIN The unrelenting cold during much of the winter chilled us to our bones - and out to our skin. \"In 20 years, I've never seen as many frostbite cases as I have this year,\" said Dr. Chris Delp, an emergency physician at St. Luke's Regional Trauma Center. Delp attributed the early onset of cold conditions and recent mild winters for some people not being as protected outdoors as they should have been. Frostbite patients included people who visited the Ice Caves in the Apostle Islands area and competitors in the American Birkebeiner cross-country ski race from Cable, Wis., to Hayward, Delp said. \"Even some very experienced people got frostbite this year because of the unanticipated cold,\" Delp said of the Birkie skiers. The same cold kept people inside so much that the emergency room saw fewer than usual injuries from skiing, snowmobiling and other outdoor activities, he said. But being cooped up indoors may have taken a toll on our mental health. People who already have depressive disorders may have experienced their symptoms to a greater degree this winter, said Dr. David Baldes, a psychiatrist with St. Luke's Psychiatry Associates. \"What I've been seeing in my office is people saying that they've been really stuck indoors,\" Baldes said. \"\"Doc, it's too cold to snowmobile .'\" People who would normally be outside may have been deprived of the physical exercise that is in itself an antidepressant, Baldes said. They also may have been more likely to turn to less healthy behaviors, such as drinking and overeating. But the weather conditions have little to do with Seasonal Affective Disorder, Baldes said. That is triggered solely by the length of the day. And it wanes in spring, even if winter weather lingers. To some degree, almost all of us are affected by the effect of increased light, Baldes said, which makes April and May \"a wonderful time to be a psychiatrist .\" \"People are getting better, and it's probably just because of the lengthening of the day, but they want to give me the credit,\" Baldes joked. SLIPPERY SLOPE Spirit Mountain had been rooting for the return of a good, old-fashioned Minnesota winter, but it may have gotten a bit more than it bargained for this year. The hill got the snow that the ski operation wanted, but they also were saddled with subzero temperatures that repeatedly forced Spirit Mountain to close during what would normally be prime time business hours. While Spirit Mountain opened early and closed late this year, logging what likely was its longest season ever, according to executive director Renee Mattson, she said the hill still will likely finish the ski season in unprofitable territory. The dreaded \"polar vortex\" first took aim at Spirit Mountain when it most depended on business, over the the Christmas holiday season. \"That put a huge crimp in our revenues that we couldn't get back,\" Mattson said. It's like having a guest room that goes unused. You can't make up for it. \"PROBLEM PIPES A harsh winter has taken a toll on pipes, too. Whereas, the city of Duluth typically receives reports of five to 10 buildings per year with frozen water lines, that number soared to about 350 this winter, according to Jim Benning, director of public works and utilities. Within the past couple weeks, the number of calls has diminished, but Benning said the extra work has put a dent in the city's utility budget, which likely will exceed $200,000. That's not including the additional expense the city will swallow for encouraging more than 400 customers to leave water running this winter to avoid repeat freeze-ups. These customers who were asked to bleed their pipes throughout the winter, will not be charged for the extra water they used and sent to the treatment plant, leaving the city to shoulder the cost. Yet this winter has not proven as punishing on the backbones of Duluth's water system as past years. Benning reports that the city's 75 water main breaks so far this winter is down slightly from previous years. He suspects much of the credit goes to the insulating properties of the blanket of snow that covered the ground here in the Northland early and has been slow to lift. TOO MUCH TO BEAR Heavy snows wreaked structural havoc in the Northland this year. Northland homeowners can attest to the difficulties of ice dams and roof damage. But winter also delivered some very public failures, too. Greysolon Plaza's canopy collapsed in December with a large amount of snow on top, though an official cause has not yet been determined. In February, a portion of Miller Hill Mall was closed after a steel roof joist bent below roof-top snow drifts as tall as 15 feet. On April 8, Duluth firefighters were called to a 20-foot hole that had surfaced in the roof of the Duluth armory building. THERMOSTAT ANXIETY Northland residents also felt the financial slap of an unusually cold winter. Between November 2013 and March 2014, local temperatures averaged 18 percent lower than last winter, according to Eric Schlacks, gas and energy coordinator for the Duluth Public Works and Utilities Department. But that's only half the story. Fuel costs jumped this winter as well. People heating with natural gas in Duluth saw their rates climb 28 percent compared with last year, Schlacks said. Households heating with other forms of fossil fuel fared no better. If you burn No. 2 fuel oil, your average cost per gallon rose 97 percent this season. And if you rely on propane heat, your fuel price more than doubled, increasing an average of 146 percent this winter. ON THE PLUS SIDE BEARGREASE: FROM FINISHED TO FLOURISH In 2012, the John Beargrease Sled Dog Marathon was canceled because of a lack of snow. In 2013, the storied race along the North Shore was postponed for six weeks because of unfavorable weather and poor trail conditions. In 2014, thanks to a winter much colder and snowier than average, there were no doubts that the 30th Beargrease would be a go. If anything, there was too much snow; wind-stacked drifts along the trail challenged mushers and their dogs for much of the race in late January. But those challenges aside, the frigid winter aided a remarkable turnaround for the race. After the troubles of the previous two years, race officials in October 2013 had announced they would be canceling the 2014 edition for lack of money. New leadership stepped up, stepped in and revived the race - and were fortunate to avoid the lack-of-snow concerns that had dogged the previous organizers. The 2014 race drew big crowds at the start and finish, and the bitterly cold temperatures - which closed schools and canceled events statewide while the race was underway - left people at home tracking the mushers' progress online .\" Here we are standing at the finish line after no one thought this race was going to happen, \"race director Jason Rice said as musher Nathan Schroeder of Chisholm won his second-straight Beargrease title .\" We went from saving it to slingshotting it into the future. \"ICE CAVES: A BEAUTIFUL BEACON OF WINTER For two months, along a portion of the Lake Superior shore near Cornucopia, the bitterly cold winter that brought so much misery elsewhere in the Northland created an awe-inspiring icy spectacle that drew tens thousands of visitors. Access to the ice-bedecked mainland sea caves in the Apostle Islands National Lakeshore opened in mid-January, the first time in five years that the caves were accessible in winter. By the time ice conditions deteriorated and access was closed in mid-March, an estimated 125,000 people had traveled to Bayfield County to make the hike along the shore to the caves. The News Tribune was among the first media outlets to carry photos from the ice caves. After that, stories and photos spread rapidly around the region and around the world, thanks in large part to social media. Sunday's weather for Duluth and the Northland: The weather we've been waiting for Family, friends recall rise and fall of Minnesota fugitive minister", "articleID": "2014042011_00021620_W", "names": {"Robert Kennedy": ["Q27835047", "Q4935237", "Q7346313", "Q7346314", "Q7346315"]}}, {"date": "2014-04-21", "url": "http://eww.golocalprov.com/politics/Top-Natl-Regional-Progressives-and-Conservatives-Debate-at-URI/", "content": "State Report: Marijuana Tax + Bill Targets Prostitutes and Pimps RI Beauty Insider: Pedi Nation - Get the Best Pedicure Ever Fit for Life: Fail to Plan? Plan to Fail - Plan and prioritize, and you will prevail Arthur Schaper: Grand Theft Auto Cicilline - MINDSETTER Arthur Schaper examine's Cicilline's role in Prov's...Five Live Music Musts - April 18, 2014 - Great vibes await Report: Preston Murphy Leaving URI for Boston College EXCLUSIVE: Bryant Tells Grads No Selfies with President at Grad Top progressives and conservatives from the region--as well as national organizations--will be debating the future of Rhode Island in an event on Saturday titled, What's Really in Our Best Interest? The debate will be held on April 26 at the University of Rhode Island, featuring nationally prominent and local political experts who will discuss both the economic and moral implications of public policy in Rhode Island. The RI Center for Freedom & Prosperity, a nonpartisan local think tank organizing the event that, today named the debate moderator and the full slate of panelists. Registration is free and is now open to the public, but seats are limited and pre-registration is required. For event registration, go HERE. The event will be moderated by Josh Fenton, founder and CEO of GoLocalProv.com, the official media partner for the event. Giving the debate a unique angle and optic, students from local colleges were selected to debate alongside professional policy experts. Leading conservative and progressive panelists participating are: <mark>Stephen Moore</mark>, chief economist at the Heritage Foundation and frequent analyst on FOX News and CNN Rich Benjamin, senior fellow at Demos, and frequent analyst on MSNBC and NPR Don Watkins, fellow at the Ayn Rand Institute, published in Forbes and USA Today Tom Sgouros, local public policy expert and writer for RI Future and a former Mindsetter (TM) to GoLocalProv.com Justin Braga, chair of RI College Republicans, studying political science at Brown University <mark>Samuel Bell</mark>, RI coordinator for Progressive Democrats of America, and Amherst College grad \"I anticipate a rigorous debate of issues that most politicians are not bold enough to discuss publicly,\" said Mike Stenhouse, CEO for the Center. \"If you'd like to hear dramatically opposed viewpoints, this is the place to be .\" The debate is presented by the Center in association with the 2014 RI Student Political Empowerment Conference, an annual non-partisan gathering of area college student to discuss public policy issues and advocacy. The debate will take place Saturday, April 26 at Swan Hall on the University of Rhode Island Campus. Doors open at 8:30 am, with refreshments by Dunkin Donuts. The debate begins at 9:30 am. The debate is structured to be a free-wheeling forum where widely divergent public policy approaches will be argued as to which actually helps people the most. The first segment will deal with economic philosophies as they pertains to issues currently under consideration in the Ocean State, such as the minimum wage and sales tax or other tax reforms. The second segment will deal with the moral questions surrounding public policy about whether or not individuals are responsible for the well-being of others and whether some public assistance programs are immoral. A live, streaming webcast of the debate is also being planned, as well as an archived online version. The Rhode Island Center for Freedom and Prosperity, a nonpartisan public policy think tank, is the state's leading free-enterprise research and advocacy organization. The Center works to make a profound, positive impact on the lives of every family and business in the state through the rigorous exchange of market-based ideas and reform solutions aimed at restoring economic competitiveness, educational opportunities and - ultimately - hope for a brighter future. www.RIFreedom.org. Related Slideshow: 7 Strategies for Rhode Island Economic Development in 2014 What will it take to move the Rhode Island economy forward in 2014? GoLocal talked with elected officials, candidates, and leaders for their economic development plans in the coming year. Below are key elements of the economic priorities for Governor Lincoln Chafee, Speaker of the House Gordon Fox, Senate President M. Teresa Paiva-Weed, House Minority Leader Brian Newberry, gubernatorial hopefuls General Treasurer Gina Raimondo and <mark>Ken Block</mark>, and RI Center for Freedom and Prosperity's Mike Stenhouse. Governor Lincoln Chafee \"My goal is to have the state continue to focus on the fundamentals. We will invest in education, workforce development and infrastructure, and provide aid to cities and towns to lessen the burden on property taxpayers. I'm confident that these investments and our focus on the basics will allow Rhode Island to exceed Moody's predictions .\" Speaker Gordon Fox \"Among the many pieces of legislation the House will address will be issues of higher education affordability, expanding apprenticeship opportunities, and offering help to our manufacturers. We will also look closely at our tax structure to make sure we are competitive with our neighboring states, including the corporate tax and the estate tax, and I will carefully review the recommendations of the commission studying our sales tax .\" Senate Pres. Paiva-Weed Greg Pare, spokesperson for the Senate President, said that the Senate is planning to issue recommendations soon on workforce development initiatives to address the skills gap among Rhode Island job seekers. \"An example of a proposal anticipated in that report is the elimination of state's Indirect Cost Recovery on the Job Development Fund, which is about $1.2 million this year. Those funds would be directed towards job training and skills development programs to provide immediate impact and help workers gain the skills necessary to succeed in today's economy .\" Gen. Treasurer Raimondo \"To grow our economy, we need to make Rhode Island a leader in manufacturing again. Great things can happen at the intersection of government, higher education, and the private sector. Rhode Island is lucky to have thriving institutions in each of these three sectors, and we need to foster collaboration among them to find solutions to our challenges, and spark our economy. By promoting partnerships in high-growth areas, [Rhode Island Innovation Institute] will help grow our manufacturing base, and create new, high-quality jobs .\" <mark>Ken Block</mark> \"First, we need to fix Rhode Island's broken Unemployment Insurance program. The state's Unemployment Insurance tax, paid by employers, is ranked worst in the country by the Tax Foundation. It is one of the factors that makes Rhode Island an uncompetitive place to do business. Also, it is inherently unfair that a large group of businesses are effectively subsidizing the payrolls of a small group of businesses who misuse the system. There is a simple change to state law that can fix this problem .\" \"Rhode Island's temporary disability tax (TDI) is broken, and places an unnecessarily high tax burden on Rhode Islanders. This tax, paid for by employees, will be reduced by changing the way we manage the program. As Governor, I will substantially reduce the cost of purchasing this insurance by requiring that Rhode Island's program adhere to national norms .\" \"To best encourage new job creation, I propose the following tax incentive: exempt from future capital gains taxes any new investments in Rhode Island-based businesses. This change would create a powerful incentive for investors who are deciding where to locate a new business, or where they relocate an existing one. This proposal has the potential change the economic playing field for Rhode Island .\" Minority Leader Newberry \"It would be overly ambitious to set being #1 as a goal right now, but we think 25, the middle of the pack, is a reasonable goal to set, one we think we should pursue, and one we can achieve,\" said Newberry. \"One of the initiatives is a requirement that every bill receive a fiscal evaluation before it can be heard by committee, better insuring that legislators know the real cost of the legislation they are acting on .\" \"Another proposal would exempt social security income from RI state income tax, making Rhode Island more tax-friendly for our seniors and keeping them here rather than migrating to more tax-friendly states .\" RI Could Become First State to Legalize Pot Without Voter Approval", "articleID": "2014042114_00037233_W", "names": {"Ken Block": ["Q16195907", "Q16196378", "Q438382", "Q47361851", "Q6387341"], "Samuel Bell": ["Q47163071", "Q7410897"], "Stephen Moore": ["Q1410667", "Q15849215", "Q2344985", "Q28168026", "Q28871848", "Q57688178", "Q7610021", "Q7610023", "Q7610033"]}}, {"date": "2014-04-22", "url": "http://www.tuscaloosanews.com/article/20140422/news/140429924", "content": "SEC Commissioner Mike Slive: Leagues, union advocates have common ground Supreme Court upholds Michigan ban on using race as factor in college admissions Indiana Gov. Mike Pence to rally Alabama Republicans at June convention Borrowers told they must immediately repay student loans in full if relative who co-signed dies Supreme Court hears streaming TV case; decision could affect broadcast industry, cloud computing Auburn opts not to appeal Bruce Pearl's show-cause order VIDEO & PHOTOS: Tour new environmental services building West Alabama Food and Wine Festival returns for a second tasting Food and Wine Festival Patrick Sizemore, of Grassroots Wine, pours a sample for <mark>Robin Harris</mark> during the first annual West Alabama Food and Wine Festival hosted at Hotel Capstone Saturday, Mar. 30, 2013. All proceeds from the event go to the West Alabama chapter of the Red Cross. About 10 local restaurants and three different wineries were at the event which was open to the public. (Michelle Lepianka Carter / Tuscaloosa News) Published: Tuesday, April 22, 2014 at 5:00 p.m.. Last Modified: Tuesday, April 22, 2014 at 5:15 p.m.. The event, in its second year, showcases a variety of wines to complement samplings from local restaurants. All proceeds will benefit the American Red Cross West Alabama Chapter's disaster relief services. \"We are excited to bring back the festival for a second year,\" said <mark>Peter Schmidt</mark>, Hotel Capstone director of food and beverage, who spearheaded the development of the festival. \"We got great feedback about last year's event and will have even more restaurants for guests to try .\" Where else in Tuscaloosa can you sample specialties from multiple area restaurants, taste local beer, and try new wines all in one evening? \"Last year's festival attracted about 300 patrons. Tickets are $55 each or $100 per couple and must be purchased in advance. Admission includes a 2014 souvenir wine glass. A limited number of tickets are now available from the American Red Cross West Alabama Chapter, 1622 Lurleen Wallace Blvd., Hudson-Poole Fine Jewelers, 1111 Greensboro Ave., and Spirits Wine Cellar, 4851 Rice Mine Road NE No. 110 at the Shops of Lake Tuscaloosa. online by clicking here. Guests will be able to taste food from Cypress Inn, DePalma's Italian Caf?, Jim 'N Nick's, Epiphany, Evangeline's, Hotel Capstone, Kozy's Restaurant, La Casa Crimson, Mary's Cakes and Pastries, Taziki's Mediterranean Caf?, Tin Top Restaurant and Oyster Bar, Walnut Hill Designs and Wintzell's Oyster House. Spirits Wine Cellar will provide wine pairings from Alabama Crown, Grassroots Wines, International Wines, MBC United/Johnson Brothers and Pinnacle Imports. Druid City Brewery will offer beer. Festival sponsors include BF Goodrich Tires, Townsend Automotive Group and The Tuscaloosa News, Cypress Inn Pavilion, Hudson-Poole Fine Jewelers, Sanford Restaurant Equipment, Special Events: A Game Day Tents Co. and Spirits Wine Cellar. Entomologist Dr. E.O. Wilson donates awards to University of Alabama Future of Alabama-Tennessee game and other rivalries up for vote Navy OKs sleep schedule changes for sailors serving on submarines Entomologist Dr. E.O. Wilson donates awards to University of Alabama Supreme Court hears streaming TV case; decision could affect broadcast industry, cloud computing Borrowers told they must immediately repay student loans in full if relative who co-signed dies Indiana Gov. Mike Pence to rally Alabama Republicans at June convention", "articleID": "2014042305_00054389_W", "names": {"Peter Schmidt": ["Q12331719", "Q1293254", "Q13381961", "Q1665907", "Q2078137", "Q2078139", "Q2078141", "Q2078142", "Q2078146", "Q2078148", "Q27531670", "Q2913063", "Q30066237", "Q47452555", "Q52829079", "Q55741220", "Q57631064", "Q87690"], "Robin Harris": ["Q21454128", "Q7352456"]}}, {"date": "2014-04-25", "url": "http://www.npr.org/blogs/metropolis/2014/04/25/306770987/metropolis-4-19-14?ft=1&f=1039", "content": "hide caption Factory Floor appears on this week's show. Factory Floor appears on this week's show. Porter Robinson, \"Sea Of Voices (Rac Mix)\" (Astralwerks) Gui Boratto, \"Beautiful Life (Sascha Funke Remix)\" (Kompakt) London Grammar, \"Hey Now (Arty Remix)\" (Columbia) Tensnake, \"First Song\" (Astralwerks) Little Dragon, \"Paris\" (Loma Vista/Republic) Blood Orange, \"Uncle Ace (Kindness Remix Featuring <mark>Robert Owens</mark>)\" (Domino) Blamma Blamma, \"<mark>Zsa Zsa</mark> Feat Kristina Train (Andy Cato Remix)\" (Eskimo) Jagwar Ma, \"Uncertainty (Ewan Pearson Remix)\" (Mom & Pop) Blackbird Blackbird, \"There Is Nowhere (Phages Remix)\" (Lavish Habits) Odesza, \"Sun Models (Feat Madelyn Grant)\" (Souncloud.Com / Odesza) Rufus Du Sol, \"Desert Night\" (Sweat It Out!) John Tejada, \"Farther And Fainter\" (Plug Research) Factory Floor, \"How You Say (Daniel Avery Remix)\" (Dfa) Plastic Plates, \"Sweat\" (Plastic Plates) Static Revenger, \"Colors At The Night Feat Kay (Deep Mix)\" (D-Dub) <mark>Storm Queen</mark>, \"Look Right Through (MK Dub Iii)\" (Defected) Flight Facilities, \"I Didn't Believe\" (Future Classic) Maceo Plex, \"Love Somebody Else\" (Visionquest) Maceo Plex, \"Conjure Balearia\" (Crosstown Rebels) Pink Floyd Vs. Prydz, \"Proper Education\" (Ministry Of Sound) Flume, \"The Greatest View (Feat Isabella Manfredi)\" (Mom & Pop) Sign In / Register Please keep your community civil. All comments must follow the", "articleID": "2014042521_00022211_W", "names": {"Robert Owens": ["Q3436023", "Q40499677"], "Storm Queen": ["Q12337388", "Q15131554"], "Zsa Zsa": ["Q509446", "Q52585329"]}}, {"date": "2014-04-28", "url": "http://news.yahoo.com/mh370-undersea-search-may-extend-entire-probable-impact-042835835.html", "content": "Sydney (AFP) - Australia on Monday said it would intensify the underwater hunt for missing Malaysia Airlines Flight MH370 as it conducts as thorough a search as \"humanely possible\". \"If necessary, of the entire probable impact zone which is roughly 700 kilometres by 80 kilometres,\" Prime Minister <mark>Tony Abbott</mark> told reporters, when asked about the size of the search area. <mark>Abbott</mark> also admitted it was \"highly unlikely\" that any surface wreckage will be found from MH370. \"I am now required to say to you that it is highly unlikely at this stage that we will find any aircraft debris on the ocean surface,\" he said following the disappearance of the Malaysian Airlines plane on March 8. Malaysia Airlines", "articleID": "2014042814_00043225_W", "names": {"Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}]