[{"articleID": "2019111603_00021523_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Roger Stone": ["Q19653753", "Q7358961"], "Katie Hill": ["Q58416634", "Q6377460"], "Stephen Miller": ["Q11894443", "Q15707390", "Q27996060", "Q42884001", "Q7609994"], "Jimmy Carter": ["Q23685", "Q6199776"], "Andrew Yang": ["Q11118258", "Q28723576"], "Larry Brown": ["Q11347478", "Q22277186", "Q380013", "Q6490003", "Q6490006", "Q6490009", "Q7232858", "Q944485", "Q962238"], "Bill Russell": ["Q242185", "Q4910727", "Q862419"], "Bill Murray": ["Q29250", "Q4910295"]}, "date": "2019-11-16", "url": "http://news.msn.com/en-us/news/other/on-gps-inside-trumps-state-department/vi-BBWPPZ0", "content": "AdChoices Latest Stories Analysis: With a Tweet, <mark>Trump</mark> Upends GOP Strategy on Yovanovitch The New York Times 20 mins ago Teen gunman who killed two in shooting at Calif.. HS dies in hospital USA TODAY AdChoices Witness overheard US ambassador tell <mark>Trump</mark> that Ukraine would investigate Biden CNN <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News Analysis: 4 takeaways from Marie Yovanovitch's testimony The Washington Post Browns' Garrett suspended for rest of season by NFL Associated Press Prince Andrew says he let the Royal Family down in his relationship with Jeffrey Epstein NBC News <mark>Roger Stone</mark> Is Found Guilty in Trial That Revived Trump-Russia Saga The New York Times Off-duty cops rushed to HS after hearing shots: \"Actions saved lives' USA TODAY Sources: Epstein jail guards had been offered plea deal Associated Press <mark>Trump</mark> defends Yovanovitch attack:' I have freedom of speech' The <mark>Hill</mark> Ex-Envoy to Ukraine\" Devastated' as <mark>Trump</mark> Vilified Her The New York Times Did <mark>Trump</mark> just commit witness tampering? 7 legal experts weigh in Vox.com Dems call for <mark>Stephen Miller</mark> to resign after leak of emails ABC News Court puts hold on Rodney Reed's scheduled execution NBC News Dow tops 28,000 for first time, capping 4-week win streak CNBC Federal Prosecutors Probe Giuliani's Links to Ukrainian Energy Projects The Wall Street Journal. Audience applauds, GOP mic turned off at end of Yovanovitch hearing The <mark>Hill</mark> Impeachment Updates: Envoy Was \"Obstacle' to <mark>Trump</mark>, Schiff Says Bloomberg WH record of <mark>Trump</mark>'s 1st Ukraine call differs from earlier description ABC News Arizona sheriff's deputy tackles 15-year-old boy with no arms or legs NBC News Study: The secret of living to 110 FOX News Australia's fragile koala colonies are being ravaged by brush fires:\" It's a national tragedy' The Washington Post US <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News 2 hrs ago Off-duty cops rushed to HS after hearing shots: \"Actions saved lives' USA TODAY Teen gunman who killed two in shooting at Calif.. HS dies in hospital USA TODAY Unregistered guns found in home of Calif. shooting suspect, sheriff says Los Angeles Times States sue <mark>Trump</mark> admin for right to require more fuel-efficient cars The Washington Post 1 hr ago <mark>Trump</mark>'s Doral resort was a last-minute addition in search for G-7 site, newly released email shows The Washington Post Flight attendants have begged not to work on the Boeing 737 Max, union says Business Insider Planned Parenthood Wins Lawsuit Against Anti-Abortion Activists Newsweek Surviving Santa Clarita school shooting victims on road to recovery ABC News Ohio GOP want to charge doctors who perform abortions with murder USA TODAY New <mark>Trump</mark> rule to make more health care rates public The Washington Post Why did Santa Clarita shooting happen? Detectives search for motive Los Angeles Times Alabama company refuses to print university's LGBTQ-inclusive magazine NBC News <mark>Jimmy Carter</mark>'s neighbors know they'll say goodbye one day, but not yet USA TODAY Border Patrol agent shoots Russian allegedly trying to sneak into US FOX News 3 hrs ago' I Need A Kidney:' Indiana Man's Bears Game Sign Prompts Search Patch 3 Indiana judges suspended after a night of drinking turned into a brawl CNN Last survivor of the Hindenburg disaster dies at age 90 Associated Press Politics White House: NSC Ukraine expert wrote summary of April Trump-Zelensky call that conflicts with rough transcript Washington Examiner 2 hrs ago Analysis: With a Tweet, <mark>Trump</mark> Upends GOP Strategy on Yovanovitch The New York Times <mark>Trump</mark> grants clemency to 2 Army officers accused of war crimes FOX News Obama Says Average American Doesn't Want to\" Tear Down System' The New York Times Jordan Brings Pugnacious Style to Impeachment Defense of <mark>Trump</mark> The New York Times 3 hrs ago Who's scheduled to publicly testify next in impeachment hearings Business Insider Analysis: 4 takeaways from Marie Yovanovitch's testimony The Washington Post Ex-Envoy to Ukraine \"Devastated' as <mark>Trump</mark> Vilified Her The New York Times Impeachment Updates: Envoy Was\" Obstacle' to <mark>Trump</mark>, Schiff Says Bloomberg Pelosi: <mark>Trump</mark> Insults Officials Because of \"His Own Insecurity' Mediaite Witness overheard US ambassador tell <mark>Trump</mark> that Ukraine would investigate Biden CNN Audience applauds, GOP mic turned off at end of Yovanovitch hearing The <mark>Hill</mark> Did <mark>Trump</mark> just commit witness tampering? 7 legal experts weigh in Vox.com Poll: Support for <mark>Trump</mark>'s impeachment unchanged after hearings begin Reuters Democrats vow court fight to block new N.C. congressional map POLITICO 4 hrs ago 6 <mark>Trump</mark> associates have now been convicted in Mueller-related probes CNN Dems call for <mark>Stephen Miller</mark> to resign after leak of emails ABC News <mark>Trump</mark> asks Supreme Court to block House subpoena of finances Associated Press Election 2020 Obama Says Average American Doesn't Want to\" Tear Down System' The New York Times 16 mins ago Louisiana governor's race is the latest test of <mark>Trump</mark>'s clout CBS News Bloomberg to skip his own China forum as he mulls presidential run Reuters Progressive media company founder joins race to fill <mark>Katie Hill</mark>'s seat ABC News How Deval Patrick and Michael Bloomberg Could Alter the 2020 Race The New York Times \"I am running for president': Senators brush off delinquent voting records POLITICO Inside <mark>Andrew Yang</mark>'s plan to give every American $1,000 CBS News Warren lays out ambitious timeline to transition to Medicare for All The Boston Globe Democrats vow court fight to block new N.C. congressional map POLITICO 4 hrs ago Wisconsin voters with disabilities face a variety of barriers Milwaukee Journal-Sentinel Elizabeth Warren releases plan to implement Medicare for All CNN Opinion I'm Sorry, Is Impeachment Not Entertaining Enough for You? The New York Times Speaker Pelosi, from one Dem to another, please stop the impeachment bandwagon FOX News House GOP Treats Yovanovich With Respect As <mark>Trump</mark> Calls Her\" Bad News' Intelligencer <mark>Stephen Miller</mark>'s Sinister Syllabus The New York Times Impeachment hearings confirm <mark>Trump</mark>'s misconduct, despite denials FOX News The News In Cartoons Photos Yes, <mark>Trump</mark> released the aid to Ukraine. But the damage was already done. The Washington Post For Democrats, It's Mission: Impeachment U.S. News & World Report Executive Privilege Should Have No Power When It Comes to an Impeachment The Atlantic <mark>Donald Trump</mark> is the one blocking firsthand witnesses USA TODAY One of the defenses of <mark>Trump</mark> is--literally--a TV-cartoon joke The Washington Post World U.S. \"flexible' on military exercises with South Korea as North demands cancellation The Washington Post 2 hrs ago Prince Andrew says he let the Royal Family down in his relationship with Jeffrey Epstein NBC News U.S. troops will die if they remain in Syria, Bashar Al-Assad warns Newsweek Ukraine\" invisible' as impeachment hearings focus on Washington drama NBC News Ethnic Rifts in Bolivia Burst Into View With Fall of Evo Morales The New York Times Widow of ex-KGB agent plans legal action on UK's Russia report Reuters 5 hrs ago Last survivor of the Hindenburg disaster dies at age 90 Associated Press Venice is underwater--and a preview of what climate change will bring to coastal cities The Washington Post Chileans to vote on new constitution in response to protests AFP 1 hr ago US teacher killed in Dominican Republic had dream to retire there, says family ABC News Australia's fragile koala colonies are being ravaged by brush fires: \"It's a national tragedy' The Washington Post AdChoices Crime Court puts hold on Rodney Reed's scheduled execution NBC News 2 hrs ago Parole rejected for Charles Manson follower after 50 years Associated Press Police find 26 children behind false wall at Colorado day care FOX News Sources: Epstein jail guards had been offered plea deal Associated Press Missing woman's husband arrested; carpet found soaked with blood, bleach NBC News Texas parole board recommends delaying Rodney Reed execution Associated Press Kentucky woman charged in death of woman missing since May Associated Press Man suspected of fatal shooting said he was man from\" Joker' Associated Press 5 arrested in connection with deadly shooting at Airbnb Halloween party ABC News California man convicted of torture-murder dies on death row Associated Press In Photos: Santa Clarita school shooting 19-year-old driver faces charges in Forsyth County school bus accident WXIA-TV Atlanta Kratz found guilty of first-degree murder, voluntary manslaughter CBS Philadelphia Teen girl accused in violent Orange Mound carjacking WREG-TV Memphis 2-year-old to leave hospital after shooting himself with father's gun WZZM-TV Grand Rapids-Kalamazoo-Battle Creek Coroner identifies 1 of 2 teens killed by classmate in Santa Clarita ABC 7 Los Angeles Victims wounded in Saugus High shooting \"held their composure' ABC 7 Los Angeles McDaniel student arrested on assault, gun charges WBAL TV Baltimore Local news from the web Curtea De Arges, Romania Places Search for Location / City Search RECENT SEARCHES Curtea De Arges, Romania Make this place my home Sign in to add favorites Detect my location Add to my favorites Detect my location Technology Twitter rolls out total ban on ads from political figures POLITICO Inventor breaks record zooming at 85 mph in jet-powered suit CNET How Google interferes to change your search results The Wall Street Journal. Apple bans vaping apps from the App Store CNBC AirFly Pro can stream Bluetooth audio to and from any 3.5 mm jack Engadget NYT: <mark>Trump</mark> admin set to extend Huawei license again Engadget Disney + will fix its\" Simpsons' widescreen problem in 2020 Engadget Google scales back town hall meetings following leaks Engadget iFixit examines the 16-inch MacBook Pro's \"throwback' keyboard design Engadget TikTok begins testing links in bios The Verge Google's Files app now streams local media to your Chromecast Engadget Pre-installed apps on low-end Android phones are full of security holes Engadget Twitter's political ad ban provides little oversight for fossil fuel companies The Verge Twitter exempts some 'cause - based' messages from political ad ban Relaxnews (AFP) AT & T's latest smartphone plans offer new ways to limit\" unlimited' data USA TODAY Which AT & T wireless unlimited data plan is best for you? You need to consider these three factors first. MacBook Pro first look: Apple fixes the keyboard on powerful pricey new 16-inch laptop USA TODAY Apple could be forced to let Apple Pay competitors access NFC under German law The Verge Fears grow on digital surveillance: US survey Relaxnews (AFP) Good News GoFundMe Honors Good Samaritans at First Heroes Celebration People Woman donates nearly 600 Barbies with prosthetic legs to children at St. Louis hospital KSDK-TV St. Louis \"Dream-Maker' Man Wants to Grant Wishes Through Social Media People Texas Dad Says Apple Watch Changed the Life of His Son with Autism:\" We Had Tried Everything' People Woman living in SUV with dogs gets apartment with community's help ABC News Amari gets heroic birthday surprise Stitch Liver transplant leads to unbreakable bond between strangers TODAY 14-year-old baker gives cupcakes to homeless CBS News Boy uses his Make-A-Wish to get special space that other children can use Stitch Female Thunderbird pilot inspiring others to chase their dreams CBS News Wisconsin bus driver saves children wandering in snow FOX News On a frigid night, man who used to be homeless ushered people to shelter WFAA-TV Dallas-Ft. Worth Pittsburgh Wears Red Cardigans to Honor Mister Rogers CBS Pittsburgh High schoolers build prosthetic arm for student to play the cello People Hero off-duty police officer saves driver from fiery crash Patch Helping vets launch startups: \"There's a level of resilience' Chicago Tribune Sisters raise thousands to buy Thanksgiving meals for families in need WPTZ Plattsburgh-Burlington Money How Google interferes to change your search results The Wall Street Journal. How to save $1 million on a $45K salary, broken down by age CNBC In Japan's vanishing rural towns, newcomers are wanted CityLab GNI per capita: $1,665> 2018 GDP: $9.7 billion (144th out of 208 countries)> Population (2018): 11.1 million> Life expectancy at birth in 2017: 63.3 years Located on the island of Hispaniola in the Carribbean, Haiti is one of the few places outside of Africa to rank among the poorest countries in the world. The country was hamstrung economically since gaining independence from France in the early 19th century, as it was forced to pay reparations to its former European master to compensate former slave owners. The debt was repaid in full by the mid-20th century, but there have been recent calls for France to return the money. In recent years, economic development has been hindered by political instability and devastating natural disasters. Haiti's $1,665 GNI per capita is the lowest in North America and 12th lowest in the world. ALSO READ: The Most Productive Countries in the World\" src = \"http: //static-entertainment-neu-s-msn-com.akamaized.net/sc/9b/e151e5.gif\" title = \"12. Haiti - La_Corivo / Getty Images\" > The world's poorest countries 24/7 Wall St. Dow tops 28,000 for first time, capping 4-week win streak CNBC The stock market warning that everyone is overlooking The Motley Fool 5 hrs ago Bill Gates tops Bezos as world's richest person with Amazon slide Bloomberg How Amazon has become a flea market of fakes The Washington Post The world's most profitable company is about to go public Vox.com Nurses face an epidemic of workplace violence CBS News Smart tax moves to make before the end of the year Cheapism Sports Garrett isn't only athlete to use equipment to fight in game The Boston Globe Report: Rudolph won't take legal action against Garrett Sportsnaut GM wants Luhnow \"banned for life' if he knew of Astros' sign-stealing <mark>Larry Brown</mark> Sports Steelers' Rudolph on\" TNF' incident:' I thought it was pretty cowardly' NFL Browns' Garrett suspended for rest of season by NFL Associated Press Report: At least 24 teams to attend Kaepernick's workout Sportsnaut <mark>Bill Russell</mark> finally accepts Basketball HOF ring Associated Press Carmelo reportedly won't debut before Tuesday Yahoo! Sports Dest makes quick impact as US rebounds to beat Canada 4-1 Associated Press Jones scores 31, No. 2 Duke edges Georgia State, 74-63 Associated Press Judge dismisses lawsuit to overturn Maximum Security's Kentucky Derby DQ USA TODAY SPORTS Opinion: NFL should also discipline Rudolph USA TODAY SPORTS Hardaway: Swift resolution from NCAA on Wiseman \"would be ideal' Commercial Appeal Memphis Opinion: Pouncey is a folk hero but deserved 3 games Yahoo! Sports Yelich slams Darvish after pitcher discussed at-bat <mark>Larry Brown</mark> Sports The Best Photos of College Basketball imagn Warriors on pace for worst winning percentage drop ever Dunk Wire More in News Video Video <mark>Trump</mark> impeachment hearing key moments: Day 2 ABC News Are sanctuary cities doing more harm than good? FOX News On GPS: Inside <mark>Trump</mark>'s State Department CNN The most revealing moments from Marie Yovanovitch's impeachment inquiry testimony CBS News How Ukraine is perceiving the impeachment inquiry NBC News\" This is worse than Nixon:' Neal Katyal on the impeachment latest MSNBC Entertainment Entertainment <mark>Bill Murray</mark> to star in Peter Farrelly comedy series at Quibi Variety Kanye West and his Sunday Service choir perform for inmates at Texas jail E! Tinsley Mortimer confirms she and Scott Kluth are back together US Weekly Bieber shows support for Big Machine Records, Braun amid Swift feud ETOnline Reese Witherspoon reveals she turned down another \"Friends' appearance E! Lizzo sued by Postmates driver she claimed stole her food Billboard Weather Weather Unseasonably early Arctic cold to retreat from much of central, eastern US AccuWeather Venice is underwater--and a preview of what climate change will bring to coastal cities The Washington Post There's a place in the US where its been over 80 degrees since March CNN Australia's fragile koala colonies are being ravaged by brush fires The Washington Post The Outer Banks prepares for yet another storm AccuWeather Ski season begins at Squaw Valley Alpine Meadows AccuWeather Microsoft News Microsoft News About Us Learn what we do in the Microsoft News Blog MSN is worldwide Sign up for newsletters from MSN Get help for questions about MSN and Microsoft News Lifestyle Lifestyle 60 animal photos that will make you say\" awww \"Reader's Digest I'm a queer woman dating a trans man and it's a secret Refinery29 My city was named the\" worst place for black women to live .' Should I leave? HuffPost Archie's photo album: Prince Harry and Duchess Meghan's royal baby US Weekly I confessed to my partner that I cheated for all the wrong reasons Women's Health Never eating dinner together could be a sign that you're headed for divorce Women's Health Health Health I was overeating at dinner until I started doing this on Sundays PopSugar How to get rid of skin tags, according to a dermatologist Reader's Digest Ex-FDA adviser: LASIK surgery should be taken off market CBS News He was a member of a boy band in the 90s. Now he's an ER doctor in Dallas WFAA-TV Dallas-Ft. Worth Will you get dementia? Many may not understand their risk Associated Press Halle Berry shares a photo of 6-pack abs--and her fans are freaking out Health.com Autos Autos Ferrari to launch fewer cars next year after a busy 2019 motor1 Hummer electric pickup truck scheduled to kick off brand's rebirth in 2021 Roadshow Electric Hummer, Escalade to be built at Detroit-Hamtramck? motor1 Tesla applies to trademark \"Cybertruck' and\" CYBRTRK' Autoblog End of an era: Chevy has built the last front-engined Corvette motor1 Ford and Chevy are losing buyers after discontinuing compact cars Car and Driver Travel Travel Therapy dogs help de-stress travelers at Long Beach Airport ABC 7 Los Angeles Delta's new long-haul service is a game-changer for economy class fliers Condé Nast Traveler United is the latest airline to push the Boeing 737 Max's return back, despite Boeing's increasing confidence about the plane's recertification Business Insider On board the world's longest flight CNN Horse yoga and cow cuddling: The world's wackiest hotel activities Travel + Leisure Greek donkeys are still being abused as \"tourist taxis,' PETA claims FOX News"}, {"articleID": "2013111421_00057505_W", "names": {"Matt Clark": ["Q1768022", "Q22277379", "Q3180807", "Q6788489", "Q6788491"], "Carmen Gonzalez": ["Q5043478", "Q9697469"]}, "date": "2013-11-14", "url": "http://www.sys-con.com/node/2873444", "content": "CareView Communications, Inc. (\"CareView\" or the \"Company\" ) (OTCQB: CRVW), an information technology provider to the healthcare industry, announced today the success of its products and services in reducing patient falls, reducing sitter costs and increasing patient satisfaction at hospitals owned and operated by IASIS Healthcare, a leading owner and operator of acute care hospitals in high-growth urban and suburban markets (\"IASIS\" ). CareView and IASIS will host a free Webinar on Tuesday, November 19, 2013 at 2:00 pm CST to present relevant product information and details of the implementation of CareView's services which yielded the positive results. https: //careview.webex.com/careview/onstage/g.php? t=a & d=662451196. For those unable to attend the Webinar, an on-demand recording will be available at the Company's website: www.care-view.com. The Webinar will be hosted by Tedd Adair, IASIS' Chief Clinical Officer, Brennan Howes, CareView's VP Business Development, and <mark>Matt Clark</mark>, CareView's VP Software Development. <mark>Matt Clark</mark> stated, \"CareView's Fall Management Program uses advanced, patented video analytics to detect potential falls through our Virtual Bed Rails? and Virtual Chair Rails? modules. These fall management tools have consistently proven to reduce patient falls and have provided nurses with invaluable time to reach patients before an injury occurs. Additionally, our SitterView? module, our GuestView? patient entertainment and satisfaction module, our BedView? bed control module, and our handheld communication tools can assist hospitals in controlling the climbing costs of providing quality healthcare .\" ? Which problems IASIS was trying to solve and why they chose to partner with CareView;? How IASIS handled patient consent and educated patients on the benefits of CareView's products; and? Lessons learned by IASIS during the implementation of CareView's products. Sandra McRee, CareView's Chief Operating Officer, formerly of IASIS where she served as Vice Chair of its Board of Directors, Chief Operating Officer and President, stated: \"After having worked in the healthcare industry for 35 years, CareView is the only company that I have found that improves patient safety and patient satisfaction while reducing cost as evidenced by the results of IASIS Healthcare .\" About CareView Communications, Inc.. CareView's mission is to be the leading provider of products and on-demand application services for the healthcare industry by specializing in bedside video monitoring, archiving and patient care documentation systems and patient entertainment services. Through the use of telecommunications technology and the Internet, our products and on-demand services will greatly increase the access to quality medical care and education for both consumers and healthcare professionals. We offer the next generation of patient care through our unique data and patient monitoring system that connects patients, families and healthcare professionals (the \"CareView System?\" ). Our proprietary, high-speed data network system may be deployed throughout a healthcare facility to provide the facility with recurring revenue and infrastructure for future applications. Real-time bedside and point-of-care video monitoring and recording improve efficiency while limiting liability, and entertainment packages and patient education enhance the patient's quality of stay. Through continued investment in patient care technology, we are helping hospitals and assisted living facilities build a safe, high quality healthcare delivery system that best serves the patient, while striving for the highest level of patient satisfaction and comfort. CareView is dedicated to working with all types of hospitals, nursing homes, adult living centers and selected outpatient care facilities domestically and internationally. Corporate offices are located at 405 State Highway 121 Bypass, Suite B-240, Lewisville, TX 75067. More information about the Company is available on the Company's website at www.care-view.com. About IASIS HealthCare IASIS, located in Franklin, Tennessee, is a leading owner and operator of medium-sized acute care hospitals in high-growth urban and suburban markets. The Company operates its hospitals with a strong community focus by offering and developing healthcare services targeted to the needs of the markets it serves, promoting strong relationships with physicians and working with local managed care plans. IASIS owns or leases 18 acute care hospital facilities and one behavioral health hospital facility with a total of 4,362 licensed beds and has total annual net revenue of approximately $2.8 billion. These hospital facilities are located in seven regions: Salt Lake City, Utah; Phoenix, Arizona; Tampa-St. Petersburg, Florida; five cities in Texas, including Houston and San Antonio; Las Vegas, Nevada; West Monroe, Louisiana; and Woodland Park, Colorado. IASIS also owns and operates a Medicaid and Medicare managed health plan in Phoenix that serves more than 197,000 members. More information about IASIS is available on its website at www.iasishealthcare.com. Questions about this release may be directed to Sandra McRee, CareView's Chief Operating Officer, at (972)? 943-6050. This press release shall not constitute an offer to sell or a solicitation of an offer to buy securities of CareView Communications, Inc.. Certain statements in this release and other written or oral statements made by or on behalf of the Company are \"forward-looking statements\" within the meaning of the federal securities laws. Statements regarding future events and developments and our future performance, as well as management's expectations, beliefs, plans, estimates or projections relating to the future are forward-looking statements within the meaning of these laws. The forward-looking statements are subject to a number of risks and uncertainties including market acceptance of the Company's services and projects and the Company's continued access to capital and other risks and uncertainties. The actual results the Company achieves may differ materially from any forward-looking statements due to such risks and uncertainties. These statements are based on our current expectations and speak only as of the date of such statements. The Company undertakes no obligation to publicly update or revise any forward-looking statement, whether as a result of future events, new information or otherwise. Copyright? 2013 SYS-CON Media, Inc. - All Rights Reserved. More Stories By Business Wire Copyright? 2009 Business Wire. All rights reserved. Republication or redistribution of Business Wire content is expressly prohibited without the prior written consent of Business Wire. Business Wire shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon. New Release of Quest Toad for Oracle Offers Enhancements to Reduce Risk yourfanat wrote: I am using another tool for Oracle developers - dbForge Studio for Oracle. This IDE has lots of usefull features, among them: oracle designer, code competion and formatter, query builder, debugger, profiler, erxport/import, reports and many others. The latest version supports Oracle 12C. More information Is Your Business 100% Ready for the New Era of Cloud Computing and Big Data? The Only Enterprise IT Event in 2013 Covering the Entire Scope of both Cloud & Big Data Come to New York and get yourself up to date with the Big Data revolution! As advanced data storage, access and analytics technologies aimed at handling high-volume and/or fast moving data all move center stage, aided by the Cloud Computing boom, Cloud Expo is the single most effective event for you to learn how to use you own enterprise data - processed in the Cloud - most effectively to drive value for your business. There is little doubt that Big Data solutions will have an increasing role in the Enterprise IT mainstream over time. Get a jump on that rapidly evolving trend at Big Data Expo, which we are introducing in November at Cloud Expo New York. \"Cloud\" has become synonymous with \"computing\" and \"software\" in two short years. Cloud Expo is the new PC Expo, Comdex, and InternetWorld of our decade. By 2012, more than 50,000 delegates per year will participate in Cloud Expo worldwide. The cloud is certainly a compelling alternative to running all applications within a traditional corporate data center. But moving from theory into practice is where things get complicated, and this is where attending a top industry event like Cloud Expo comes in. No one can take full advantage of cloud computing without first becoming familiar with the latest issues and trends, which is why the organizing principle of the 10th International Cloud Expo on June 10-12, 2014 - is to ensure - through an intensive three-day schedule of keynotes, general and breakout sessions, and our bustling Expo Floor - that attending delegates leave the Javits Center with abundant resources, ideas and examples they can apply immediately to leveraging the Cloud, helping them to maximize performance, minimize cost and improve the scalability of their Enterprise IT endeavors. Delegates will leave Cloud Expo with dramatically increased understanding the entire scope of the entire cloud computing spectrum from storage to security. Whether you're an enterprise or small to medium business, you'll soon be benefiting from the Cloud. Join your peers in New York June 10-12, and maximize those benefits already in 2014. See you in New York! Register Now! Save $500 on your \"Golden Pass\" ! Call 201.802.3020 or click here to Register Early Bird Expires Friday. Submit your speaking proposal for the upcoming Cloud Expo in New York Please Call 201.802.3021 events (at) sys-con. com. <mark>Carmen Gonzalez</mark>, <mark>carmen</mark> (at) sys-con. com. . Copyright? 1994-2013 Ulitzer, Inc.. All Rights Reserved. All marks are trademarks of Ulitzer, Inc. ."}, {"articleID": "2014080308_00034834_W", "names": {"Brian Banks": ["Q16240818", "Q22079589", "Q4963038", "Q4963043"]}, "date": "2014-08-03", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/xsczhXU-rnA", "content": "meta itemprop = \"alternativeHeadline\" content = \"One-time NFL hopeful gets second shot at league\" > Derailed NFL hopeful gets new chance at football life media/2014/08 \\ / 02/314596931636/EN _ EVANS_080214_260181_796. mp4 \",\" firstmediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_740. mp4 \",\" firstmediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_240. mp4 \",\" firstmediaHlsURI \":\" http: \\ / \\ / ipad-streaming. cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260199_tablet. m3u8 \",\" firstmpxRefId \":\" iJQ74i0ubtfI_r_zmVeaF00_XYqTfFmt \",\" firstDuration \":136,\" playerWidth \":\" 620 \",\" playerHeight \":\" 387 \"}' data-component =' [\"genericPlaylist\" ]'> media/2014/08 \\ / 03/314601539945/EN _ DAGATAPETERSENv2_080214_260203_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314601539945 \\ / EN_DAGATAPETERSENv2_080214_260203_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314601539945 \\ / EN_DAGATAPETERSENv2_080214_260203_240. mp4 \"}}' data-pid =\" dWcgmMn45fe _ \"> Israeli PM: Expect no let-up in tunnel-clearing mi...media/2014/08 \\ / 03/314603075572/EN _ ARENAS_080214_260201_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314603075572 \\ / EN_ARENAS_080214_260201_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314603075572 \\ / EN_ARENAS_080214_260201_240. mp4\" }}' data-pid = \"Pg1JzBHDq_Pr\" > Ebola patient brought to U.S. for medical treatmen...media/2014/08 \\ / 02/314596419688/EN _ FISCHER_080214_260180_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419688 \\ / EN_FISCHER_080214_260180_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419688 \\ / EN_FISCHER_080214_260180_240. mp4 \"}}' data-pid =\" xbUvrdKVfY2L \"> Potentially dangerous thunderstorms move through N.. . media/2014/08 \\ / 02/314596419686/EN _ NAIR_800214_260179_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419686 \\ / EN_NAIR_800214_260179_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419686 \\ / EN_NAIR_800214_260179_240. mp4\" }}' data-pid = \"jC6Yhmb7gYb7\" > Was ex-Virginia first family's relationship with b.. . media/2014/08 \\ / 02/314596931636/EN _ EVANS_080214_260181_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_240. mp4 \"}}' data-pid =\" 74wf6Lma52eC \"> Wrongfully convicted standout linebacker gets work...media/2014/08 \\ / 01/314469955560/EN _ 080114_Mason_259943_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314469955560 \\ / EN_080114_Mason_259943_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314469955560 \\ / EN_080114_Mason_259943_240. mp4\" }}' data-pid = \"ggFodsWp9Zrp\" > Economy adds 209,000 jobs, unemployment at 6.2 per...media/2014/08 \\ / 01/314468931791/EN _ 080114_Blackstone_259947_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314468931791 \\ / EN_080114_Blackstone_259947_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314468931791 \\ / EN_080114_Blackstone_259947_240. mp4 \"}}' data-pid =\" nuYOBrjKwQoS \"> Colo. working to keep edible marijuana away from c.. . media/2014/08 \\ / 01/314466371534/en _ 0801_lapook_259914_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314466371534 \\ / en_0801_lapook_259914_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314466371534 \\ / en_0801_lapook_259914_240. mp4\" }}' data-pid = \"dfVhAk2MAZM8\" > <mark>Brian Banks</mark> was an NFL hopeful several years back, but his career was derailed by a wrongful criminal conviction. On Saturday, his long search for vindication turned an important corner. CBS News correspondent Carter Evans spoke with him. \"I am honored to say I've taken an amazing position with the front office of the NFL,\" <mark>Banks</mark> wrote on his Facebook page. He'll be a manager in the football operations department. He says it's just now sinking in. It's an opportunity of a lifetime, it's something that at one point in my life, I would have never [thought] of happening. <mark>Banks</mark> had been accused by a high school classmate of a rape that never happened. He was just 16, a star linebacker at Long Beach Poly High, with a full-ride scholarship waiting for him at USC and a dream to play in the NFL. \"All I had to do was play my senior year,\" he said. \"The biggest year of my life .\" But it never happened. He spent five years in prison and another four on probation before his alleged victim admitted she made it all up. When <mark>Banks</mark> was exonerated in 2012, his story gained national attention, including a profile on 60 minutes. Even though he'd lost 10 years, he hoped--against all odds--that he could still make it in the NFL. He tried out for the Seattle Seahawks and finally took the field in a pre-season game last year with the Atlanta Falcons. \"It's a dream come true,\" he said. \"And if it all ended today, you know: Mom, I did it. <mark>Banks</mark> was always realistic about his chances of making it in the NFL and his career on the field, ended with that game .\" I chased the dream and I will continue to chase it as long as I can, but when it's over, that means it's just new beginnings in other places of my life. \"That included motivational speaking, where he caught the attention of NFL commissioner Roger Goodell, and a new job .\" I just cannot wait to be in New York, working with the NFL, \"said <mark>Banks</mark>.\" Just continuing to use success as a response to everything I've been though in my life. \"In the end, his success off the field led him back to pro football."}, {"articleID": "2019050720_00377352_W", "names": {"Jessica Anderson": ["Q29950503", "Q458240", "Q6187084"]}, "date": "2019-05-07", "url": "https://www.heart.co.uk/news/uk-world/nurses-london-marathon-record-reinstated-as-o/", "content": "Nurse's London marathon record reinstated as \"outdated' uniform rule axed 7 May 2019, 15:21 | Updated: 7 May 2019, 15:56 An NHS nurse has had her marathon world record attempt reinstated after officials admitted rules over her uniform were\" outdated \"and\" incorrect \". <mark>Jessica Anderson</mark>, who ran the London Marathon in her scrubs with trousers, was initially told her bid would only count if she completed the race wearing a skirt. The decision had sparked outrage online. Guinness World Records (GWR) rules had stipulated that a nurse's uniform must include: a blue or white dress, a pinafore apron, and a traditional nurse's cap. A spokesman confirmed the change of heart:\" Over the weekend it has become quite clear our guidelines for the fastest marathon wearing a nurse's uniform were outdated, incorrect and reflected a stereotype we do not in any way wish to perpetuate. \"I want to take this opportunity to reassure everybody concerned that Guinness World Records is absolutely committed to ensuring we uphold the highest standards of equality and inclusiveness .\" Therefore, we unreservedly apologise and accept full responsibility for the mishandling of <mark>Jessica Anderson</mark>'s application. \"The initial decision sparked a passionate response on social media, where many nurses shared images of themselves in their uniform under the hashtag #WhatNursesWear. Ms <mark>Anderson</mark>'s time of 3.08:22 on 28 April has been confirmed as the record and GWR guidelines will now be reviewed. Ms <mark>Anderson</mark>, who works at the Royal London Hospital and raised more than £ 2,200 for Barts Health NHS Trust, has officially beaten the previous record of 3:08:54 set by Sarah Dudgeon in 2015. Before the latest decision, Ms <mark>Anderson</mark> told magazine Runner's World the rules were\" outdated \", and said:\" I was quite taken aback when I read that they'd rejected my application. \"Some of the nurses I work with do wear dresses, but mostly we wear scrubs or a tunic and trousers .\" (c) Sky News 2019: Nurse's London marathon record reinstated as \"outdated' uniform rule axed"}, {"articleID": "2017112717_00427508_W", "names": {"Roy Moore": ["Q17466511", "Q27924997", "Q5302905"], "David Jackson": ["Q1174850", "Q16215837", "Q18706415", "Q19560836", "Q25171864", "Q3018141", "Q42889647", "Q46585740", "Q5235533", "Q5235534", "Q5235535", "Q53104720", "Q8354128", "Q9202628", "Q9202630"], "Doug Jones": ["Q1251779", "Q16142774", "Q30122825", "Q461309", "Q5300612", "Q5300613"]}, "date": "2017-11-27", "url": "http://11alive.com/article/news/nation-now/trump-has-no-plans-to-campaign-for-roy-moore-white-house-says/465-5625d69e-cdd5-4c6f-9c81-cfe6665c7aee", "content": "Trump has no plans to campaign for <mark>Roy Moore</mark>, White House says WH: Trump has no plans to campaign for <mark>Moore</mark> Author: <mark>David Jackson</mark>, USA TODAY Published: 12:17 PM EST November 27, 2017 WASHINGTON--President Trump does not plan to travel to Alabama to campaign for embattled Senate candidate <mark>Roy Moore</mark>, a White House official said Monday. \"There is nothing on the schedule at this time,\" White House spokeswoman Lindsay Walters said. Trump, who has all but endorsed <mark>Moore</mark> despite multiple sexual assault and harassment accusations against him, told reporters last week he would decide soon whether to campaign for the Alabama Republican in person ahead of the Dec. 12 election. Trump has defended <mark>Moore</mark>, who has denied the allegations that he assaulted or pursued relationships with teenage girls while he was in his 30s. Trump has cited <mark>Moore</mark>'s denials--and repeatedly bashed <mark>Moore</mark>'s opponent, Democratic nominee <mark>Doug Jones</mark>. Over the weekend, Trump said <mark>Jones</mark> would be a \"puppet\" of national Democrats such as Sen. Chuck Schumer of New York and Rep. Nancy Pelosi of California. \"The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY,\" Trump wrote from during his Thanksgiving weekend at his Mar-a-Lago estate in Palm Beach, Fla. ."}, {"articleID": "2018103021_00132151_W", "names": {"Brian Williams": ["Q10498110", "Q11688807", "Q16106138", "Q20273975", "Q22636441", "Q28777337", "Q39185757", "Q43162643", "Q459695", "Q4965638", "Q4965639", "Q4965640", "Q4965642", "Q4965643", "Q4965645"]}, "date": "2018-10-30", "url": "https://lasentinel.net/los-angeles-urban-league-and-omniworks-promote-entrepreneurship-as-a-path-to-success-for-minorities-and-women.html", "content": "Los Angeles Urban League and OmniWorks ™ Promote Entrepreneurship as a Path to Success for Minorities and Women By Sentinel News Service Published October 30, 2018 Sponsored in part by CIT/OneWest Bank and the Los Angeles Department of Water & Power. Los Angeles Urban League and OmniWorks ™ create entrepreneurship workshops to provide small business owners with real-world, practical information to help take their business to the next level. Los Angeles Urban League and OmniWorks ™ are proud to announce the launch of their Entrepreneurship Workshop, a free two-day workshop that will give aspiring and existing small business owners a chance to get their questions answered and learn best-practices for starting and growing successful businesses. The first workshop will start November 2 nd from 1:00 PM-6:00 PM at Los Angeles Trade Tech College, and with more than 150 participants already registered, more workshops are being planned for early 2019. \"There's obviously a demand for quality entrepreneurial education\" said <mark>Brian Williams</mark>, Vice president and COO of Los Angeles Urban League. \"One of the main reasons small businesses fail is due to a lack of business and management education. This workshop is a great way for business owners to get a lot of practical information in a short period of time .\" The Entrepreneurship Workshops will focus on Principles of Lean Startup Methodology Being A Successful Entrepreneur Creating A Powerful Fast Pitch Creating Your Own SWOT Analysis Creating Generational Wealth Funding Panel: VC, Loans, Crowdfunding and Women & Minority Business Owner Certification Taking Your Business to the Next Level \"At OmniWorks our goal is to provide underserved communities democratized access to business education, markets and capital,\" said Quentin Strode, co-founder of OmniWorks. \"Entrepreneurship is a tough, but worthwhile path for individuals to create long-term wealth for their families and jobs in their communities .\" According to the U.S. Small Business Administration (SBA), small businesses have accounted for creating two out of every three net new jobs in the United States since 1995. In Los Angeles, small businesses are especially important to communities of color. In fact, a 2015 study by the U.S. Census Bureau reported that Los Angeles County is a \"microcosm of [the] nation's diverse collection of business owners .\" The report reflected that \"Collectively, Los Angeles County was home to 631,218 minority-owned firms including 81,563 Black-owned businesses .\" However, the SBA reports that 30 percent of small businesses fail within the first two years. Often the deciding factor between stumbling and success can be as simple as having access to basic information and resources."}, {"articleID": "2015052115_00029493_W", "names": {"John Hannah": ["Q1377462", "Q18044018", "Q298243"], "Alan Cox": ["Q28764566", "Q4706432", "Q4706436", "Q55123"], "Dave King": ["Q1173256", "Q15509384", "Q19118748", "Q20645742", "Q20645771", "Q5229102", "Q729093", "Q936186"], "Owais Shah": ["Q23664755", "Q6831317"], "Luke Wright": ["Q3529926", "Q6702480"], "Gary Caldwell": ["Q3098523", "Q334628", "Q42789154"], "Adam Murray": ["Q3604998", "Q43914471"]}, "date": "2015-05-19", "url": "http://www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911", "content": "T in the Park is voted UK's best value music festival ahead of rivals including Reading/Leeds, Glastonbury and V Edinburgh Fringe: <mark>John Hannah</mark>, <mark>Alan Cox</mark> and Jeffrey Holland among big names set to perform at festival BBC weather presenter Judith Ralston cries tears of relief after police help her escape car park drama Man \"sneaks into women's loos to eat FAECES - and has done for EIGHT YEARS' See cop KARATE KICK handcuffed suspect in the head TWICE as fellow police officers stand by and watch Ex-Apprentice star jailed for\" flagrant contempts of court' in tug-of-love legal battle with former partner Horrifying moment hit-and-run cyclist riding on pavement smashes into three-year-old girl and drags her 12ft Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million <mark>Dave King</mark>: It will cost Rangers £ 30million to catch Celtic and become a force in Europe again Rangers 2 Hibernian 0: Rangers fans set the standard and the players deliver in first leg play off victory Celtic scrap move for Jonathan Mensah: FIFA ban rules out bid Scottish champions' bid for Ghana World Cup star Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million <mark>Dave King</mark>: It will cost Rangers £ 30million to catch Celtic and become a force in Europe again Watch as two lovers find out they're BROTHERS after most intense Jeremy Kyle DNA result yet Paolo Nutini's dad says singer is \"wee bit upset' his old man met up with Godfather actor Al Pacino at Scots gig Jeremy Clarkson returns to BBC for first interview since Top Gear controversy and insists: I was NOT sacked DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club .\" data-type = \"fb-share\" data-action = \"article:5723911\" > DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \"data-type =\" tw-share \"data-action =\" article:5723911 \"> DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. Sean Dillon in action for Dundee United DUNDEE UNITED captain Sean Dillon has signed a new deal with Jackie McNamara's side that will see him remain at Tannadice until May 2017. The 31-year-old defender - who has made 293 appearances since signing in January 2007, has agreed a two-year extension to add to the eight years he has already spent on Tayside. Manager McNamara was delighted to secure Dillon on a new deal and told United's official website:\" I am happy to secure Sean for a further two seasons. He is immensely valuable to the club both on and off the field. \"On field, Sean has a versatility which means I can call on him to cover a number of positions and in the dressing room and as an ambassador for the club he is the model professional and the ideal role model for our younger players. Sean Dillon is delighted to have committed to Dundee United for a further two years\" It is very rare in today's football world that a player commits ten years to one club and by signing this contract, Sean has ensured he will be a United player for that length of time. \"His commitment to Dundee United is amazing and I believe he will continue to prove a valuable part of the squad for the foreseeable future .\" Dillon was ecstatic to have his future at Tannadice secured and said: \"I love playing for Dundee United .\" This Club is obviously a massive part of my life and the Dundee area is my family home. I have had many happy days here and have enjoyed success. I am delighted to get the contract signed and can now look forward to helping the Club achieve even more success. \"The support I receive from the United fans has always been excellent and I am proud to continue to wear the tangerine top for another two years .\" Record FC Dundee United: Jackie McNamara has lost the fans. . it's best for everyone he goes now Djokovic will be the eighth man to achieve a career Grand Slam if he wins the French Open. \",\" isResultYoutube \": false,\" answeroptions \": [{\"answerletter\" : \"A\" , \"answertext\" : \"Win a career Grand Slam\" , \"correctanswer\" : true}, {\"answerletter\" : \"B\" , \"answertext\" : \"Win the French Open three times\" , \"correctanswer\" : false}, {\"answerletter\" : \"C\" , \"answertext\" : \"Remain undefeated for a year\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i4.dailyrecord.co.uk/incoming/article5465383.ece/ALTERNATES/s318/JS60665765.png\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"If Novak Djokovic wins the French Open, he will become the eighth man to achieve what career milestone?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"2\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"<mark>Owais Shah</mark> holds the record with 5128 runs .\" , \"isResultYoutube\" : false, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"<mark>Luke Wright</mark>\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"<mark>Owais Shah</mark>\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Ravi Bopara\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i2.dailyrecord.co.uk/incoming/article5721778.ece/ALTERNATES/s318/CD30124327.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Who holds the record for the most runs by an English batsman in all Twenty20 cricket?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"3\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Wigan manager <mark>Gary Caldwell</mark> is the youngest manager at 33 years old .\" , \"isResultYoutube\" : false, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"<mark>Adam Murray</mark>\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"<mark>Gary Caldwell</mark>\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Karl Robinson\" , \"correctanswer\" : false}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i4.dailyrecord.co.uk/incoming/article2123398.ece/ALTERNATES/s318/Gary-Caldwell.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Garry Monk is the youngest manager in the Premier League but who is the youngest in the whole of the Football League?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"4\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Hermann Hreidarsson and Nathan Blake hold the record for most Premier League relegations .\" , \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"Ashley Ward and Nigel Quashie\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"Hermann Hreidarsson and Nathan Blake\" , \"correctanswer\" : true}, {\"answerletter\" : \"C\" , \"answertext\" : \"Marcus Bent and Nathan Blake\" , \"correctanswer\" : false}], \"description\" : \"\",\" questiontext \":\" Which two players hold the record for most Premier League relegations? \"},\" totalquestions \":\" 5 \"}}}, {\"summaryFields\" : {\"article\" : {\"questionnumber\" : \"5\" , \"widgetId\" :1551127, \"type\" : \"question\" , \"fields\" : {\"resultText\" : \"Sir Bradley Wiggins is the only British cyclist to have won the Tour of California .\" , \"isResultYoutube\" : false, \"isLastQuestion\" : true, \"answeroptions\" : [{\"answerletter\" : \"A\" , \"answertext\" : \"Chris Froome\" , \"correctanswer\" : false}, {\"answerletter\" : \"B\" , \"answertext\" : \"Mark Cavendish\" , \"correctanswer\" : false}, {\"answerletter\" : \"C\" , \"answertext\" : \"Sir Bradley Wiggins\" , \"correctanswer\" : true}], \"description\" : \"\",\" hasResultContent \": true,\" isResultImage \": true,\" resultArticle \": {\"resultImageUrl\" : \"http: //i1.dailyrecord.co.uk/incoming/article5722074.ece/ALTERNATES/s318/CS62213266.jpg\" }, \"handlebarsTemplateUrl\" : \"http: //s.dailyrecord.co.uk/template/\" , \"questiontext\" : \"Who is the only British cyclist to have won the Tour of California?\" , \"isResultBrightcove\" : false}, \"totalquestions\" : \"5\" }}}]}], \"quizContentTitleFriendly\" : \"quick-quiz-sport-19515\" } \"data-share =\" [{\"ico\" : \"facebook\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \\ n\" , \"omnitureAction\" : \"article:5723911\" , \"name\" : \"Share\" , \"styleclass\" : \"fbShare\" , \"label\" : \"Facebook\" , \"title\" : \"Dundee United captain Sean Dillon signs two-year contract extension at Tannadice\" , \"url\" : \"http: //www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911 #ICID=sharebar_facebook\" , \"omnitureType\" : \"fb-share\" }, {\"ico\" : \"twitter\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. \\ n\" , \"omnitureAction\" : \"article:5723911\" , \"name\" : \"Tweet\" , \"styleclass\" : \"twShare\" , \"label\" : \"Twitter\" , \"title\" : \"Dundee United captain Sean Dillon signs two-year contract extension at Tannadice\" , \"url\" : \"http: //www.dailyrecord.co.uk/sport/football/football-news/dundee-united-captain-sean-dillon-5723911 #ICID=sharebar_twitter\" , \"omnitureType\" : \"tw-share\" }, {\"ico\" : \"googleplus\" , \"intro\" : \"\\ n DEFENDER hailed as the model professional by Jackie McNamara as he commits future to Tayside club. In Pictures: Dundee United launch their new home kit for 2015/16 Scottish Premiership season CAPTAIN Sean Dillon modelled the latest take on the famous tangerine jersey as he announced signing a two-year contract extension at Tannadice. Sean Dillon hell-bent on clinching Euro spot after signing new two-year Dundee United deal Dundee United boss Jackie McNamara defends his decision to pick blundering rookie keeper Michal Szromnik in Tayside derby POLISH goalie looked suspect as St Johnstone eased to a 2-0 win but Tannadice gaffer says starting with Szromnik was the right call. Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I don't know how much of my own money I will invest in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 million Rangers 2 Hibernian 0: Rangers fans set the standard and the players deliver in first leg play off victory Celtic scrap move for Jonathan Mensah: FIFA ban rules out bid Scottish champions' bid for Ghana World Cup star BBC weather presenter Judith Ralston cries tears of relief after police help her escape car park drama Video: <mark>Dave King</mark> says funding gap has to be bridged to bankroll Rangers revolution I'll invest more than £ 20million in Rangers says <mark>Dave King</mark> as Three Bears loan club another £ 1.5 m Man\" sneaks into women's loos to eat FAECES - and has done for EIGHT YEARS '"}, {"articleID": "2016051020_01682626_W", "names": {"Ken Berry": ["Q1609903", "Q1738578", "Q6387317"]}, "date": "2016-05-10", "url": "http://cpapracticeadvisor.com/news/12206097/the-irs-is-hiring-agency-wants-700-more-agents-for-tax-enforcement", "content": "The IRS Is Hiring: Agency Wants 700 More Agents For Tax Enforcement <mark>Ken Berry</mark>, J.D. - CPA Practice Advisor Tax Correspondent On May 10, 2016 | Share | Share | Share Taxpayers may want to tread a little more carefully. After years of cutbacks, the IRS plans to add as many as 700 new staffers this year to chase after tax cheats. \"As we continue to operate with a constrained budget, an area of concern for all of us remains the significant decline in the number of employees across the IRS,\" said IRS Commissioner John on May 4 in an internal memo initially reported by the Wall Street Journal. \"With our budget down more than $900 million since 2010, there are unmet needs across the IRS and there have been few opportunities to hire new employees during the last six years .\" The numbers bear him out. Going back to Fiscal Year 2010 (FY2010), the number of revenue officers responsible for placing liens on taxpayer properties and forcing them to pay up has been slashed by 15 percent. Similarly, the workforce including revenue agents, who conducts audits of individual and business taxpayers, suffered a 16 percent reduction during the same time period. Furthermore, the audit rate for individuals dropped to 0.84 percent last year, its lowest level in more than a decade last year. This was the third consecutive year showing an audit rate of less than one percent. It's not like Congress hasn't been giving the IRS any money to operate, but the agency is constantly being pulled in different directions. Following five years of budget cuts, Congress upped the ante for FY2016 by $290 million, providing a total budget of $11.23 billion. However, most of those extra funds were earmarked for other uses, including improving taxpayer services and ID theft and security measures. Also, the IRS was recently tasked with enforcing penalties under the Affordable Care Act (ACA). In the memo, Koskinen said that the IRS reassessed its resources halfway through this fiscal year. It found that it had enough left in the coffers to hire between 600 and 700 new employees in the enforcement areas. \"Our first priority for hiring this year was to address taxpayer service,\" he noted. \"We were able to add more than 1,000 W & I employees to our taxpayer phone lines after Congress provided $290 million specifically for taxpayer service, identity theft and cybersecurity .\" The decision to hire many revenue officers and agents also factored in other aspects, including retirements and other employee departures. \"In previous years, job losses across the agency have helped us absorb the funding cuts we have received, but left us with large gaps in various areas across the agency,\" said Koskinen. \"This year, we've determined that we have the resources available to hire these employees as a result of the rate of attrition in enforcement and your continuing dedication to find efficiencies to help us with the budget .\" The IRS Commissioner claims that every dollar invested in the IRS returns at least $4 to the Treasury. He says the number is even higher when it involves enforcement. The first group of new-hires is expected to be announced in several weeks. The employees will be assigned to the department with oversight of self-employed taxpayers and small business owners. Other high-level enforcement positions will be filed later in the year. The news about the IRS hiring was met with mixed reactions. Some of our nation's lawmakers even questioned how the IRS was able to suddenly come up with the cash. \"It was only weeks ago that they were saying they did not have the money [to hire more employees] and today they do have the money?\" said House Oversight Committee Chairman Jason Chaffetz (R-UT) in an interview with FoxNews.com. Chaffetz said he will be sending a letter to Koskinen requesting a complete accounting of the matter."}, {"articleID": "2011072815_00014974_W", "names": {"Charles Allen": ["Q1063538", "Q16150468", "Q19038456", "Q5075079", "Q5075081"]}, "date": "2011-07-28", "url": "http://khou.com/news/4M-Trinity-River-attraction-too-dangerous-to-use-126322603.html", "content": "gallery see all 15 photos? dallas - a multimillion dollar whitewater course along the trinity river in dallas is complete, but the park isn't open. and it won't open until a major problem is fixed. kayaker justin blake is one of the few who dares ride the rough water at the dallas waves park. officially, it's closed; too dangerous, city leaders say. blake now understands why after riding it for the first time this week. \"you could get seriously injured if you're not careful,\" he said. the city spent millions of dollars adding concrete dams to create the whitewater rapids. in march, construction was completed on the dallas wave and city leaders showed it off to the public. but it wasn't long before many realized that something was wrong. these rapids are far more powerful than expected, especially on a \"safety channel\" where waters should be calm, allowing even canoes to pass. \"it was very vicious,\" said teresa patterson, who was thrown out of her kayak by the water's force. it held her underwater even though she was wearing a life vest. patterson said she nearly drowned. \"i was getting really, really tired,\" she said. \"i think if i had to be there another minute, i might not have been able to fight to the surface, even with the life preserver .\" dallas soon quietly shut down the course. after spending $4 million on the project, city leaders now admit at least another $100,000 of work is needed to fix the channel and calm the waters. \"it's just been a big mess,\" said trinity river guide <mark>charles allen</mark>. \"it's had a really negative impact on my business. i've lost a lot of money myself .\" the whitewater project stranded <mark>allen</mark>, who used to give tours along the river. \"when they're closing recreation centers and libraries and laying off city employees, we really can't afford to be wasting millions of dollars that way,\" he said. \"they should have just left it alone!\" city leaders refused on-camera interviews, only sending a statement to news 8 that says safety is their highest priority. but directors of the project plan to hire an outside engineer to make sure - this time - the repairs work. that is likely at least a year away. critics say the timing couldn't be worse, coming just as the state tries to encourage more people to enjoy the rivers of north texas. instead, paddlers like eric neilsen now avoid the trinity. \"i think it's a boondoggle,\" he said. \"we have an unfinished project that may or may not ever get finished .\" that leaves many to worry that the only thing going downriver is taxpayers' money. e-mail jbetz @ wfaa.com print print email email this article share tweet facebook share share! x digg delicious myspace google buzz linkedin stumbleupon newsvine reddit previous article boy tried to save friend who drowned at north texas lake next article cowboys file lawsuits over luxury suites"}, {"articleID": "2018042200_00121500_W", "names": {"Bill James": ["Q18378575", "Q18687984", "Q2037014", "Q2903257", "Q4909587", "Q4909589"]}, "date": "2018-04-22", "url": "http://www.goupstate.com/news/20180421/charlie-boone-who-led-spartanburg-hostpital-for-30-years-dies-at-90", "content": "Charlie Boone, who led Spartanburg hostpital for 30 years, dies at 90 Saturday Apr 21, 2018 at 8:23 PM Apr 21, 2018 at 8:25 PM Chris Lavender Staff Writer @ LavenderSHJ Former Spartanburg General Hospital President and CEO Charlie Boone, a beloved leader who guided the local hospital through medical and technological advancements over three decades, died Saturday at Spartanburg Regional Hospice Home. He was 90. Boone led the Spartanburg Regional Healthcare System from 1965 to 1995. Before coming to Spartanburg, Boone served as the chief operating officer for Duke University Medical Center. He also helped build the first hospital in Barnwell when he was 25. After leaving the Spartanburg Regional, Boone remained active in the community and kept an office at Spartanburg Medical Center where he would continue to visit, eating in the cafeteria and socializing with hospital staff. Mark Aycock, Spartanburg Regional Healthcare System executive vice president and chief operating officer, said he visited with Boone on Monday. The pair talked about all that's been accomplished in the healthcare system over the past few decades. While Aycock didn't work for Boone when he was CEO, the two did find time in recent years to get to know one another. \"We would talk about Duke basketball and current events,\" Aycock said. He said Boone was a source of wisdom who rarely offered unsolicited advice. Boone will be missed, he said. In November, an honorary sign was unveiled for Boone on a street near the hospital campus that connects Aimee Street to North Church Street. The Charles C. Boone Drive sign still stands in his honor. Boone received numerous awards in his lifetime, including the Distinguished Citizen Award from the Wofford College Alumni Association in 1980 and Citizen of the Year from the Spartanburg Kiwanis Club in 1982. <mark>Bill James</mark> was the healthcare system's chief of staff in 1994 and worked directly with Boone at the time. <mark>James</mark> serves as a member of the Spartanburg Regional board of trustees. Boone helped broaden the healthcare system's service, paving the way for it to expand into Cherokee and Union counties and parts of North Carolina, <mark>James</mark> said. \"People enjoyed working with Charlie because they knew he was there to support them and be nurtured by him,\" he said. \"Charlie Boone was also the best at public relations. He talked to people at all levels .\" Spartanburg County Councilman David Britt said Boone was someone that could be trusted. The county worked closely with Boone as the hospital expanded. Boone oversaw construction of new buildings, including the Montgomery Tower and the medical center parking garage. He also led efforts to improve access to care for the community, starting in 1966 when Spartanburg General began accepting Medicare. \"He could get anything done,\" Britt said. \"He was always visible to everyone at the hospital and put the hospital on the path to growth .\" State Rep. Rita Allison's husband Ron served on the hospital board for 16 years during Boone's time as president and CEO. \"It's a real loss for our community,\" Allison said. \"He did a fine job for Spartanburg Regional Healthcare System .\" A service honoring Boone will be held at 11 a.m. Friday at Central United Methodist Church at 233 N. Church St., Spartanburg. Visitation will be held in the church fellowship hall immediately following the service. A private graveside service will be held at a later date."}]