[{"articleID": "2011122113_00025504_W", "names": {"Peter Quinn": ["Q18217890", "Q2077669", "Q23022649", "Q7176491", "Q7176492"]}, "date": "2011-12-21", "url": "http://lfpress.com/news/canada/2011/12/21/19151801.html", "content": "man found guilty of murdering t.o. philanthropist philanthropist glen davis was shot in a midtown toronto parking garage on may 18, 2007. (file photo) toronto - ivgeny \"eugene\" vorobiov closed his eyes and clasped his hands in prayer moments before a jury convicted him of first-degree murder in the execution-style shooting of philanthropist glen davis. a jury found vorobiov, 33, was the triggerman who killed one of canada's most generous supporters of environmental causes and amateur sports. but the jury couldn't come up with an unanimous verdict against his co-accused, dmitri kossyrine, also 33, after four days of deliberations. justice ian nordheimer declared a mistrial after the jury announced it was deadlocked in reaching a decision on kossyrine, who employed vorobiov at his home renovation company. kossyrine will return to superior court on jan. 18 when a new trial date could be set. vorobiov was automatically sentenced to life imprisonment with no chance of parole for 25 years for the may 18, 2007 slaying of the 66-year-old davis in a midtown parking garage. vorobiov and his boss, kossyrine - whom the crown alleged was the middleman - were recruited by marshall ross, 41, davis' godson and cousin, to murder davis. ross wanted his benefactor killed so that he could extricate himself from the more than $2 million in business loans owed to davis. two weeks before this trial began in late october, ross, 41, pleaded guilty to first-degree murder and received the same life sentence as vorobiov. ross first tried to have him executed just four days before christmas 2005, but davis survived the baseball-bat attack, suffering lacerations to his head and a shattered left arm and elbow. <mark>peter quinn</mark>, executor of glen's estate, described the murder victim as one of the most generous men he has met. \"(wednesday marks) the sixth anniversary of the first attempt on glen's life. glen never knew and never suspected who was behind it,\" said <mark>quinn</mark>. \"it's a huge loss to the community. glen was one of the principal funders of environmental work in this country .\" aids vaccine approved for human tests"}, {"articleID": "2010092218_00144806_W", "names": {"Susan Collins": ["Q22279", "Q7647692"]}, "date": "2010-09-22", "url": "http://us.rd.yahoo.com/dailynews/rss/terrorism/*http://news.yahoo.com/s/cq/20100922/pl_cq_politics/politics000003737324", "content": "total seats: 100, 37 open | majority needed: 51 total seats: 435, 435 open | majority needed: 218 total seats: 50, 37 open | majority needed: 26 local content headlines for sunnyvale schwarzenegger, whitman, brown to hold on-stage conversation about running ca at first lady's women's conference elections - y! news original content clinton says powell \"sold' him on more lenient\" don't ask' policy barack obama video: health reform goes into effect, obama touts law barack obama video: obama's top economic adviser leaving 39 mins ago terrorism threats are emerging far more frequently these days from within the united states and focusing less on grand, dramatic strikes, obama administration officials and leaders of the senate homeland security panel said wednesday. that makes it harder to prevent attacks, the officials said. and it poses problems for congress that lawmakers haven't yet resolved, such as debates over the treatment and prosecution of u.s. citizens involved in terror plots. michael e. leiter, director of the national counterterrorism center, told the committee that al qaeda in pakistan \"is weaker today than at any time since the late 2001 onset\" of the war on terror. but at the same time, he warned, the terrorism threat at home has grown \"more complex,\" and the \"number and pace of attacks\" has been greater over the past year than in any other since sept. 11. committee chairman joseph i. lieberman, i-conn., said at least 63 u.s. citizens have been charged with or convicted of terrorism or terrorism-related crimes since last year, an \"astoundingly high number of people who have attacked or planned to attack their own country .\" <mark>susan collins</mark> of maine, the senate panel's top republican, said that since may of last year, there were 19 plots uncovered involving u.s. citizens, almost as many as the 21 such plots uncovered in the entire period between the sept. 11, 2001, attacks and last may. \"i am convinced that terrorists are beginning to focus their efforts on smaller-scale attacks with small arms and explosives such as we saw at fort hood...and in india,\" she said. homeland security secretary janet napolitano told the committee that terrorists were diversifying tactics and targets, which translates into \"fewer opportunities to detect and prevent plots .\" mortgage rates hit 3.25% if you owe less than $729k you probably qualify for obamas refi program"}, {"articleID": "2015031709_00028693_W", "names": {"David Silva": ["Q161069", "Q2513023", "Q27580161", "Q5239792", "Q58454602"]}, "date": "2015-03-17", "url": "http://www1.skysports.com/football/news/11679/9763187/david-silva-believes-manchester-city-have-nothing-to-lose-in-barcelona", "content": "<mark>David Silva</mark>: Manchester City playmaker remains optimistic <mark>David Silva</mark> believes Manchester City have nothing to lose as they head into Wednesday's crunch Champions League game at Barcelona. City travel to the Nou Camp needing to overturn a 2-1 deficit to reach the quarter-finals but Spain international <mark>Silva</mark> is taking succour from recent history. Not many thought PSG could beat Chelsea, especially with only 10 men for so long, so I know that everything can happen, not only in the Champions League but in every game. \"Not many thought PSG could beat Chelsea, especially with only 10 men for so long, so I know that everything can happen, not only in the Champions League but in every game. Get Sky Sports City - beaten by Barcelona at the same stage last season - needed victories over Bayern Munich and Roma to progress from their group, successes which give <mark>Silva</mark> more cause for optimism. He said:\" We need this kind of mentality we showed in those games. \"The most important thing is not to concede a goal because obviously things then become more difficult. We played well in the second leg against Barca last season and played with freedom so we will see .\" "}, {"articleID": "2015042610_00019536_W", "names": {"Alison Wright": ["Q19663904", "Q19757742", "Q4727224", "Q4727225"]}, "date": "2015-04-24", "url": "http://primetime.unrealitytv.co.uk/the-americans-spoilers-finale-sets-up-propulsive-fourth-season-as-boss-talks-paiges-decision/", "content": "The third season of \"The Americans' came to a shocking conclusion earlier this week, and now, as we wait for season four, it's almost got that\" anything could happen' feel to it. If you're still not caught up with the season finale, then we'd advise you don't read any further as we're going to discuss various moments that could potentially spoil it for you. Spoilers are ahead. Philip (Matthew Rhys) closes the episode, apparently about to tell Elizabeth (Keri Russell) that he's done with the spy life, while their daughter Paige (Holly Taylor) is having a moment of confession with her pastor while explaining that her parents are Russian. There's also a scene at the end (which gives the episode its title) of President Reagan denouncing the Soviet Union as being an \"evil empire\" , and as this speech took place on \"March 8, 1983 ′, as mentioned above, that became the episode's title. Keri Russell as Elizabeth Jennings, Matthew Rhys as Philip Jennings - (CR: Patrick Harbron/FX) Speaking about this moment with Zap2it, executive producer Joel Fields reveals that he and Joe Weisberg knew they had to have Reagan's speech to end on as it gives the next season a whole other world of possibilities to pick up from .\" Here we have Paige in pain, trying to reach out to her parents but unable [to] and reaching out elsewhere...\"We have Martha [<mark>Alison Wright</mark>] ready to go home - both because she's convinced she's about to be exposed and because she doesn't feel truly accepted in her marriage .\" Philip, instead of doing something drastic to her, does something drastic for her. \"He continued by remarking that Elizabeth is\" trying to hold all of them together \"and added:\" Seeing Ronald Reagan beating the war drum as loud as he can about her people. For us, that's all propulsive character journey stuff. \"What did you think about the season three finale? Fields also spoke about when they knew that Paige was going to tell Pastor Tim about her parents and he confessed that it was almost a last minute decision .\" We really planned to end on the \"evil empire' speech. Even as that final montage came together, I think it was maybe two-thirds through the season that we realized that that was going to be the moment .\" Of Paige, he concluded: \"She says to her mother,' I don't think I can spend my life lying to the people in my life' - but what will be the fallout from this confession?\" No doubt we'll find out soon! The Americans Spoilers: Finale sets up \"propulsive' fourth season as boss talks Paige's decision 0.00 / 5 5 1 / 5 2 / 5 3 / 5 4 / 5 5 / 5 0 votes, 0.00 avg. rating (0% score)"}, {"articleID": "2016022220_00788262_W", "names": {"Michael Gregory": ["Q1927588", "Q57077977", "Q6830787", "Q6830789"]}, "date": "2016-02-22", "url": "http://insidehalton.com/news-story/6328378-alton-village-residents-anticipate-traffic-woes-from-proposed-development/", "content": "Alton Village residents anticipate traffic woes...| 31 minutes ago | Vote0 0 Alton Village residents anticipate traffic woes from proposed development Adi Development Group will take city, community feedback into consideration, lawyer says 4853 Thomas Alton Blvd Alton Village residents already frustrated with vehicular traffic are struggling to understand how a developer's proposal, which includes two 19-storey condo towers, will benefit their community. Related Stories Burlington builder's \"modernistic'...Adi Development Group is seeking to amend the city's official plan and zoning bylaw for a residential high-density site at 4853 Thomas Alton Blvd., just off Appleby Line. A statutory public meeting was held at city hall last week where staff presented an information report on the application. Those from the affected Ward 6 neighbourhood, as well as Adi's solicitor Denise Baker of Weir Folds LLP, delegated the community and corporate services committee .' I think we need to look at this with open eyes and consider the fact that we do have people who are aging in place, and we do have needs for affordable housing, and there may be opportunities for transit' Ward 6 Councillor Blair Lancaster\" They (the builder) need to take into consideration our concerns around parking, concerns around schooling and concerns around safety when it comes down to (emergency) evacuations, \"said resident Dhruv Koch .\" We understand that there needs to be development, and development is good, but what we do not understand is why is there a need for high density and creating these buildings out in our Alton village. \"Much like Adi's proposal to build a 26-storey tower at 374 Martha Street, plans for two 19-storey condominiums, 498 units in total, on Thomas Alton is nearly double the maximum permitted building height of 10 storeys. The 4.96-acre property purchased from Emery Homes also includes 160 stacked townhouse units, 21 stacked towns and 12 back-to-backs. Adi is seeking amendments to allow an overall density on the site of 344 units per hectare, among other site-specific changes. Maximum residential density is set currently at 185 units per hectare. Mayor Rick Goldring asked Baker what community residents stand to gain from a development being built with this proposed density .\" The benefits to the community, to the city, are of course intensification, which is a provincial objective, \"she said .\" There are benefits...in terms of compatibility as it abuts the adjacent properties to the east. \"Similarly in tone, several councillors questioned if Adi would work to address some of the concerns raised regarding traffic. Baker said only preliminarily comments had been received from the city's planning staff but that her client was open to working with the city .\" The planning process is always an iterative process, \"Baker said .\" We have those discussions in consultation with planning staff, and planning staff as well as my client take into consideration all of the comments of the community. \"Adi's application was sent to the city on Oct. 21, 2015, and about 40 residents attended a neighbourhood meeting at Corpus Christi Secondary School in early December. Many of the same people were at city hall to plead their case to city councillors. Ward 6 Councillor Blair Lancaster said in her view it is clear the proposal is\" overdeveloped \"but that any solution must also consider the fact that the demographics in Alton are changing .\" I think we need to look at this with open eyes and consider the fact that we do have people who are aging in place, and we do have needs for affordable housing, and there may be opportunities for transit, \"Lancaster said .\" We have to find a way to make this work for the community. \"Part of the proposal is predicated on the zoning bylaw amendment to allow road access off Thomas Alton Boulevard and Palladium Way. Alton resident, and local real estate agent, Andrea Florian said she was already concerned about traffic safety issues in her community that aren't being addressed .\" Palladium Way's a racetrack right now, \"she said, questioning the two access points to the proposed development .\" It's extremely dangerous and I'm surprised more cops haven't advantage of the drag racing that goes on there on the weekends. \"City staff had already raised concerns about a traffic study that was completed at off-peak times during March Break as well as last summer. Baker noted her client had already made adjustments to parking allotments in response conversations with city planners and the community .\" A number of concerns were raised with respect to the traffic study in terms of the parking counts that were done, \"Baker said .\" That has been revised to include additional parking counts and a copy of that study has been or is about to be resubmitted to the (city) for their consideration...\"According to the previously submitted traffic study, consultants for Adi accounted for a 15 per cent reduction in trip generation to account for\" non-auto oriented trips. \"Burlington Transit also operates Route 15 in the area, and Adi has told the Post it is considering a car-share program on site .\" We wouldn't be able to put in a proposal for this density if it wasn't able to be justified by traffic studies without appropriate mitigation, \"Baker said. Commercial amenities, such as grocery stores, shopping and restaurants are still a world away across a busy Appleby Line .\" We have to get into our car to access any kind of shopping, any kind of amenity, \"Florian said .\" We can't even buy a bag of milk without having to get into our car right now. \"It also remains to be seen what solutions could be found for accommodating more families in the local public and Catholic schools. Burlington's director of planning and building, Mary Lou Tanner, said there is a balance to be struck between enrolment projections and new developments .\" I think the dynamic we're seeing in Alton is there's multiple families living in some of the homes, \"she said .\" We want to be mindful that as children age, we want to have a sustained population base so the school does remain open and active. \"Tanner said there is value in having a mix of housing in a neighbourhood, and not everyone can afford a single-detached home .\" We want to be able to provide that range of housing. It is an important point because there are so few apartment buildings, and apartment sites in Alton, \"she said .\" I think it's also important to remember as family members age that we want them to age in neighbourhood. We don't want people having to move to other parts of any city, or this city, just because they can't find their chosen housing type. \"The question is size, scale, massing and quality of design and that's what we're going to focus on because when we get that right we can manage the traffic .\" <mark>Michael Gregory</mark> is a reporter with the Burlington Post. He can be reached at. Follow him on and mgregory @ burlingtonpost.com Twitter the Burlington Post on Facebook |"}, {"articleID": "2009112316_00081044_W", "names": {"Viggo Mortensen": ["Q12343940", "Q171363"]}, "date": "2009-11-23", "url": "http://savanvleck.wordpress.com/2009/11/23/to-all-you-stalkers-out-there/", "content": "there are two people in our family who are just so funny that you love to be around them and often the comment is heard, \"if we could get sharon and carol together one day, we would die from laughter .\" sharon lives in indiana and carol in wisconsin, so it has not happened yet, but sharon has begun blogging. she was shamed into it really by a couple of bloggers, okay, me and her friend. she tried her hand, just who are you people? \"braindebris's weblog, and was (as we suspected) hysterical. she is one of\" those' people, who if she wrote regularly enough would be publishing a book. she is that funny, just check out the she took a long break from blogging, much to our disgust, and is back now on a weekly blog schedule. you would think she has a life or something! she also mentioned it takes a good hour to put a blog post together. who knew! so, this morning, i checked how her weekend was and she brought up the often mysterious workings of the blogosphere and the people who take the time to read your blog but rarely write comments. my readership is not huge, it has dropped since i have gotten less regular in posting. however, in the beginning, when my readership would hit 1,000 for the month, i never had commenters, other than one. there were 999 people out there lurking. pollyanna rainbow sunshine and the needles of doom often commented, but i have been really remiss commenting on their blog lately. don't you love that name though! i have also been blogging a bit less lately myself, as i work on my eternal update to my website. i feel like one of those people on the commercial, staring wide eyes, pupils dilated from staring at the screen, mind numb...anyway, you get the not pretty picture. i only have one section left to go on the website and am soooo look forward to it being done. this morning, here is a copy my monthly stats. notice the slow decline. so, i checked search terms. \"no blood for oil <mark>viggo</mark>\" - as in <mark>viggo mortensen</mark>, no surprise there. half of my readership is searching for \"<mark>viggo</mark>\" - talk about stalkers! \"worms...\"- euwww! especially when in the house .\" actor with low ears \"- okay, is this person casting a movie? i have written about actors, and i have written a post due to the lovely commercial based on the old song\" do your ears hang low. \"but, i have never written about an actor with low ears. i am not even sure why you would want to find an actor with low ears. in an effort to raise my stats, i realize that i have three sure winners: <mark>viggo mortensen</mark> photography movie reviews okay, <mark>viggo mortensen</mark> is hot and i do understand the fascination. he keeps his private life mysterious and he's hot and he likes dark chocolate and he's hot. what more could you want? the only thing is, i do not actually know mr. <mark>mortensen</mark> (i love his name by the way - <mark>viggo mortensen</mark>--it's lyrical. this is coming from someone named vanvleck. not so lyrical. so, i shall now vow to make more of an effort to review movies about <mark>viggo mortensen</mark> and you, my kind readers (numbers 13 to 30 and occasionally 1,000) shall occasionally drop me a line to let me know what you like, or do not like, on my blog. notify me of follow-up comments via email. the reluctant twitterer central indiana - 1 1/2 hour wait for h1n1 vacine, then home to watch project runway. need sleep!!! ********************* congratulations on placing orchard with delacorte ********************* gregpincus - will i ever get twitter mastered? *********************"}, {"articleID": "2012091902_00018372_W", "names": {"Paul Ryan": ["Q15610524", "Q16194779", "Q16196240", "Q19849048", "Q203966", "Q2062095", "Q2363728", "Q7153372", "Q7153373", "Q7153374"]}, "date": "2012-09-19", "url": "http://cbs2iowa.com/shared/newsroom/top_stories/videos/kgan_cbs-2-hero-nate-collins-shelter-inspiration-12674.shtml?wap=0", "content": "a school internship brought nate collins to the willis dady homeless shelter. a business major, he wanted to know more about running a non-profit organization. the internship over, nate is still there, now as a volunteer. tragedy in his own life, he says pushes him to do good things. last april, his 2-year old daughter, mikaela, was tragically killed; hit by a car in the family's apartment parking lot. he says, \"it took me awhile to get my head back on straight. anything like that will set you back. you think\" why must i go on?' \"but nate continues his volunteer work, crediting his daughter's memory and what he says, she would want .\" she was my world. i'm using her as fuel to do what i need to do on a daily basis. it's who i am. \"cbs 2 hero: nate collins; shelter inspiration cbs 2 local news ann romney holding\" women for mitt' event in clive september 18, 2012 23:44 gmt clive, iowa (ap)--the campaign for republican presidential nominee mitt romney says his wife, ann romney, will hold a women for mitt rally at furniture store in the des moines suburb of clive. ann romney is scheduled to speak at the rally at 5 p.m. thursday at by design, a high-end furniture retailer. her visit follows a monday event in des moines by gop vice presidential nominee <mark>paul ryan</mark>. mitt romney was last in iowa on sept. 7, when he held an event in orange city. iowa city groups push to prevent eye problems in youngest generation inventors and investors gather in coralville for innovation expo cedar rapids police urge city to consider active shooter training university of iowa students looking forward to presidential visit decision tuesday on whether libertarian party presidential candidate appears on november ballot west branch wind power plant acciona speaks on wind energy future corridor voters react to romney's pick for vice presidential running mate 5:00 pm: cbs-2 news at five 5:30 pm: cbs evening news 6:00 pm: cbs-2 news at six 6:30 pm: entertainment tonight 7:00 pm: ncis 8:00 pm: ncis: los angeles 10:00 pm: cbs-2 news at ten stocks open lower, churn through midday new york (ap)--volatility has been in short supply so far this session on wall street. consumer info copper surges on hopes that demand will improve the price of copper is pushing higher on a bet that it may be one of the first commodities to benefit if the u.s., europe and china prove successful in building up their economies ....science/tech news in the news: complaints about \"do-not-call\" registry increase washington (ap)--for a while, it seemed to be working--people signed up for the \"do not call\" registry--and people stopped getting calls day and night about commercial offers."}, {"articleID": "2012042718_00046378_W", "names": {"Simon Cowell": ["Q162629", "Q7518530"]}, "date": "2012-04-27", "url": "http://independent.co.uk/arts-entertainment/films/news/video-sundance-film-festival-opens-in-london-7685096.html", "content": "\"egypt's al pacino' sentenced to three months in jail for insulting islam on screen to echo the wise words of ann peebles,\" i can't stand the rain \"- but this weekend plans won't be a...as <mark>simon cowell</mark>'s first non-talent show signing to label syco in six years, labrinth (timothy mckenz...the sundance film festival opened in london last night, marking the first overseas outing of the festival since it's inception in 1978. billed as a film and music festival, presumably to distinguish it from the original event, the weekend promises to host a\" scaled down version of what happens in the mountains in utah'. sundance has become synonymous with discovering classic, independently produced, hollywood films over the years including the coen brothers' blood simple, steven soderbergh's sex, lies and videotapes and quentin tarantino's reservoir dogs to name a handful. louis theroux: \"i'm not out to take advantage of anyone. i'm just being me' preview the season's hottest tickets take command of your vintage fiat 500 and prepare yourself for some excitement in sicily the lonely planet's stuart butler explores a nation of glorious antiquity. new flights and spring blooms make the south korean capital an enticing prospect. abandoned and afraid, the parents of iraq's suffering children wait in vain for help suffer in silence in iraq? as the cultural olympiad line-up is confirmed, nick clark reports on the wonderful and weird events - and the rifts behind the scenes a traditional muslim farming community is turning to the local radio station for advice on everything from sowing crops to health after announcing its first public loss, is this game over for the console giant - or will its new wii come to the rescue? bar brawl\" over a girl' shames new york's most exclusive sports club after fists fly and three members are arrested, management tries to cover up the incident will coldwell visits the japanese knife company to get a slice of the action cheffing may be a male domain - but not where elena arzak comes from \"mindful eating' is gaining followers among those who want to give deeper thought to their food united manager changes his tune and moves away from taunts and barbs to offer begrudging respect the bolton defender has achieved his childhood ambition of playing in england. but the move from the us has been anything but easy - especially as it ruined his honeymoon"}, {"articleID": "2019082004_00029175_W", "names": {"Mike Hulme": ["Q1933216", "Q51637895"], "Richard Black": ["Q16749701", "Q30310011", "Q58127436"]}, "date": "2019-08-20", "url": "https://www.ozy.com/provocateurs/greta-thunberg-sets-sail-for-america-amid-rising-tide-of-criticism/96175", "content": "Greta Thunberg Sets Sail for America Amid Rising Tide of Criticism Caption The teenager is an inspiration for climate movement but also a lightning rod for criticism. Source BEN STANSALL/AFP/Getty Provocateurs Provocateurs People shaking up their fields, old dogs doing new tricks, and those who like to bring the ruckus. Read more Facebook Twitter Love this? Share Email article Copy link Copy link to share with friends Copy link Why you should care Because she's becoming the face of the climate movement. OZY takes you to the nations and individuals leading the fight to save the planet. This OZY series takes you to the nations and individuals driving innovative solutions at the New Climate Change Frontiers. By Leslie Hook, Victor Mallet and Yasemin Craggs Mersinoglu The Daily Dose AUG 20 2019 When Greta Thunberg started a solo climate protest outside Sweden's parliament building last year, no one imagined it would spark a global movement that led to her being nominated for a Nobel Peace Prize. But as she sailed for the U.S. last Wednesday, having quit flying for environmental reasons, the 16-year-old has become the figurehead for European climate activism as the continent experiences a groundswell in support for Green parties. Thunberg's prominence has grown during 2019 as she has crisscrossed the continent to lobby political leaders and rally her young supporters as part of the weekly #FridaysForFuture school strikes. Yet the number and vehemence of her detractors have grown with her. Over the past 12 months, I suspect she has got a lot more airtime than the polar bear. <mark>Mike Hulme</mark>, a professor at Cambridge University The teenager--whose fame can be measured by the fact that she is almost always referred to by her first name only--has become a lightning rod for criticisms that are likely to intensify when she arrives in the more politically charged U.S. for next month's U.N. climate summit in New York. \"You can think of Greta as the new icon of climate change,\" said <mark>Mike Hulme</mark>, a professor at Cambridge University. \"Over the past 12 months, I suspect she has got a lot more airtime than the polar bear .\" The most vociferous attacks on Thunberg have come from far-right politicians and conservative writers. During a visit last month to France, when she addressed legislators, one lawmaker dismissed Thunberg as a \"prophetess in short trousers\" who would win a \"Nobel Prize for fear,\" while another called her an \"apocalyptic guru .\" Days later, an Australian columnist called her the \"deeply disturbed messiah of the global warming movement,\" prompting Thunberg to hit back. \"I am indeed\" deeply disturbed' about the fact that these hate and conspiracy campaigns are allowed to go on and on, \"the teenage activist wrote in a Twitter post .\" Where are the adults? \"And yet Thunberg's message has resonated across much of Europe, striking a chord with young people and a public that is increasingly concerned about climate breakdown and environmental issues. This summer, the U.K. and France adopted targets to cut carbon emissions to net-zero by 2050, and the Greens in Germany now have more political support than any other party. Thunberg's journey to New York on board the 60-foot carbon-fiber racing yacht Malizia II, with a small crew including skipper Boris Herrmann and Pierre Casiraghi, nephew of Prince Albert of Monaco, is expected to take two weeks .\" It will be quite an adventure, \"she said on Wednesday as she began her journey in Plymouth on England's south coast .\" I expect it will be challenging, maybe seasickness, \"she said, before adding:\" There are people in the world suffering more than that. \"Thunberg is far from a household name in the U.S., where opinion polls show growing concern about climate change but a wide gap between Republicans and Democrats on the issue. <mark>Richard Black</mark>, director at the Energy and Climate Intelligence Unit and author of Denied: The Rise and Fall of Climate Contrarianism, said the U.S.'s more polarized political discourse could result in her being targeted for criticism .\" It will be interesting to see whether there is any paid-for anti-Greta advocacy, \"he said, pointing to the funding for anti-climate action lobbying in the U.S.\" There will be one tranche that absolutely does not welcome her. \"While almost all of her critics are on the right, occasional voices from other parts of the political spectrum have also questioned her influence .\" When you consume Greta, you do not help the planet, \"Raphaël Enthoven, a liberal French philosopher, wrote on Twitter a few days ago .\" You play the game of the system that destroys it. \"<mark>Black</mark> said of such reproval:\" She is also an intellectual threat, in that there is a kind of model of the political commentariat, that is used to being taken seriously, and she does not take them seriously. \"Others have asked whether Thunberg has gained excessive prominence. No one could argue about her significant influence: German Chancellor Angela Merkel credited the student protesters as she instructed her Cabinet to examine a carbon net-zero goal .\" It is quite interesting how rapidly she has gained this iconic power--almost mesmerizing power--given how partial and limited her political antenna and skills actually are, \"said <mark>Hulme</mark>.\" She is a legitimate representative, but should not be a hegemonic one. \"Within the youth movement that she inspired--school strikes have taken place in more than 100 countries--fellow activists insist Thunberg has always eschewed a leadership role, even if her speeches, viral tweets and social media posts ensure she remains in the public eye. Last week, Thunberg was among 400 young campaigners who gathered in Switzerland for the first Europe-wide meeting of her school strike movement .\" Everyone here obviously knows [that] Greta was the founder of the movement. But she has always been very specific that she is not the leader, \"said Mai Sheehan, a 16-year-old activist from Ireland .\" All our decisions are made on a consensus basis. \"As if to back this up, Thunberg was nowhere to be seen at the press conference on the final day of the gathering. But the movement she inspired continues to grow, with major global demonstrations planned for Sept. 20 and 27 .\" What often happens with Greta, is that the media frames her role as \"Jesus' and us as\" the disciples, \"' said Leonard Ganz, 21, from Germany .\" This is really a problem. \"He continued:\" She obviously is an inspiration for the movement...[but we] do not have that hierarchy. \"Timeline: Greta's rise to prominence August 2018 Greta Thunberg, 15, begins her protest against government inaction on climate change in front of Sweden's parliament building. She continues to protest each Friday, gaining worldwide attention and launching the #FridaysForFuture school strike movement. December 2018 Addresses leaders at the U.N.'s COP24 climate summit in Poland in a speech that becomes her first viral video. The following month she gives a talk at the World Economic Forum in Davos after a 32-hour train journey. March 2019 An estimated 1 million students take part in school strike protests across 125 countries, as Thunberg is nominated for a Nobel Peace Prize. April 2019 Time magazine names her one of the 100 most influential people of 2019. July 2019 OPEC Chief Mohammed Barkindo declares Thunberg and other activists the\" greatest threat \"to the fossil fuel industry. August 2019 Prepares to sail to the U.S. on board an environmentally friendly yacht to attend the U.N. climate summit in New York and a series of protests. Clara Hernanz + By Leslie Hook, Victor Mallet and Yasemin Craggs Mersinoglu OZY partners with the U.K.'s Financial Times to bring you premium analysis and features. © The Financial Times Limited 2019. Topics: Climate Change Environment EUROPE SCIENCE Sweden United Nations Facebook Twitter Love this? Share Copied Copy link Email"}, {"articleID": "2018031414_00041549_W", "names": {"Tim Murphy": ["Q2434181", "Q7804022", "Q7804024", "Q7804025"]}, "date": "2018-03-14", "url": "https://www.upi.com/Top_News/US/2018/03/14/Lamb-holds-slight-edge-over-Saccone-as-votes-counted-in-Pennsylvania-race/1071520998384/?utm_source=fp&utm_campaign=ls&utm_medium=2", "content": "Lamb holds slight edge over Saccone as votes counted in Pennsylvania race By Ray Downs | Updated March 14, 2018 at 9:26 AM 1 of 6 | License Photo March 14 (UPI)--A key congressional race in Pennsylvania's 18th District was too close to call Wednesday morning, with absentee ballots waiting to be counted to determine the winner. Democrat Conor Lamb led Republican Rick Saccone by 641 votes as of 9 a.m.. He had claimed victory just before 1 a.m. \"It took a little longer than we thought, but we did it. You did it,\" Lamb told supporters in Canonsburg, Pa.. Saccone said late Tuesday that there are also provisional and military absentee ballots that still need to be counted. And if those fail to bring victory, he said, his campaign could seek a recount due to the razor-thin margin of the vote tally. \"We are still fighting the fight. It's not over yet,\" he said. Absentee ballots in Washington County were being counted Wednesday morning. The race--in which a Lamb victory would flip the Republican seat--is considered a bellwether for the November midterms. President Donald Trump handily won the district in 2016 over Democratic nominee Hillary Clinton. Rep. <mark>Tim Murphy</mark> vacated the seat in October after a scandal involving a staffer. The winner of the race will serve out the remaining 10 months of <mark>Murphy</mark>'s term, but will have to win a new district to continue in November--after an anti-gerrymandering decision last month by the Pennsylvania Supreme Court that realigned congressional boundaries. Jakob Lazzaro of Medill News Service contribute to this report. Related UPI Stories"}]