[{"date": "2014-05-10", "url": "http://www.cagesideseats.com/wwe-smackdown/2014/5/10/5702626/wwe-smackdown-results-recap-reactions-may-9-2014-fight-on-friday-night", "content": "Share Share with Professional Wrestling friends WWE? Friday Night SmackDown hit the SyFy airwaves last night (May 9, 2014) from Buffalo, New York, with a taped show featuring continued fallout from Extreme Rules this past Sunday night in New Jersey as well as initial hype to the upcoming here for full results and the live blog from the show if you missed it. Let's get to reacting to the show. We fight on Friday night! Sometimes pro wrestling doesn't need angles to be fun. Sometimes the story doesn't even really matter and you get swept up in a match between two guys you didn't expect to sweep you up and you end up entertaining. Not that you weren't expecting it or anything, but did the idea of a Sheamus vs. Dean Ambrose program make anyone light up with glee? No; no it didn't. It's clear now, however, that it should have. William Regal once said of Ambrose \"he is everyone's best opponent for the next 10 years\" and this match may have proved our favorite Man's Man correct. Sheamus is in the process of becoming a heel WWE hopes will compete with Randy Orton at the top to carry the summer. I'm not sure how he'll do it with the U.S. title weighing him down, but perhaps a unification program with Bad News Barrett can help catapult him there. Either way, this was just a fun match that featured zero interference and a clean ending. Ambrose put up a hell of a fight against a guy you can call a HOSS, needing two Brogue Kicks to put him away, and this felt like a meaningful title match on what appeared to be a meaningless episode of SmackDown. More of this, please. Segment grade: A - __________________________________ Strength beyond strength At some point in the past eight months or so, <mark>Mark Henry</mark> became the really big guy slightly less bigger guys toss around so they can look impressive. And while I mourn for the loss of the Hall of Pain, seemingly forevermore, I celebrate the fact that hot young acts like Roman Reigns can be made to look like hot young stars. I mean look at that Samoan drop. That is one strong man relocating about 450 L-B-S (what up). This match also highlighted an attribute we've been needing to see from Reigns but weren't sure he would possess: his ability to sell injury to the point that he's vulnerable but not so much that he ever looks weak because of it. That's an incredibly difficult balancing act, but as you can see in the video above, he's already shockingly proficient at it. There are very big things in store for this man, beyond matches against big men like <mark>Henry</mark>. He is the push that makes you move On Cageside Live reviewing Raw this week, I boldly proclaimed Seth Rollins to be the next Shawn Michaels. Watching this match only solidified that viewpoint. Seriously, watch this match and pay close attention to everything Rollins does. Like Michaels, he's always in the right position. Like Michaels, his timing is impeccable. Like Michaels, his movement is flawless. And, like Michaels, he can be in the ring with a guy like Batista as the smaller man but never make you feel like he shouldn't be there. He's always believable and because of that, he'll always be credible. He'll need booking help later when he's on his own but tell me you wouldn't want to work a feud with that guy. He bumps like crazy, he's business, and, what's more, he elevates. How much better did Batista look in this match than he has since coming back? Who else has been able to make Batista look this good? Daniel Bryan, and that's the end of the list. Until last night when Seth Rollins actually made it one. All the best to all the rest: I think we may fast be approaching a point where Rusev isn't winning squash matches over jobbers but committing hate crimes against black wrestlers. We'll know if that's a joke or not if WWE trots JTG out as the next victim. Bray Wyatt's promos have started making a lot more sense and thankfully someone told the creative team that it's better to get to the point quickly because it doesn't matter how smooth your tongue is, if you're rambling on for 30 minutes, I'm checking out at 10. The beauty of pro wrestling is in the details. When Luke Harper tagged in to the main event match to stand opposite John Cena, he stopped with a crooked grin and leaned down next to Bray Wyatt to get some tactical advice on how to handle the situation. I surely liked this more than you, but it adds a wrinkle to the otherwise boring \"overwhelming monster charges Cena and gets overwhelmed himself\" booking. Here's my hope for future booking with Cesaro: He realizes that Paul Heyman is in this for himself and he needed a way to stay on television to continue harping on about <mark>Brock Lesnar</mark> breaking Undertaker's streak at WrestleMania. This is also why he's stuck in a mid-card program with the likes of <mark>Rob Van Dam</mark>, and he turns on Heyman just in time for <mark>Lesnar</mark> to come back to set up a match between the two at SummerSlam. Because wouldn't Cesaro vs. <mark>Lesnar</mark> be the best damn match at this point? And wouldn't that we a great explanation for how awful Cesaro has been booked since winning the Andre the Giant Memorial Battle Royal and aligning with Heyman? And wouldn't it be a great way to re-introduce <mark>Lesnar</mark> leading to a match that would undoubtedly rule? The sooner Bad News Barrett moves away from Big E the better. As mentioned previously, let's hope for a Barrett-Sheamus program on the European tour where they unify the titles. Say, that's a good match for Payback. Why were Emma and Santino Marella so shocked and appalled at Fandango and Layla kissing? If I have to watch even one more Los Matadores vs. 3MB match I might just complain even more on the Internet. This was a pretty damn good episode of SmackDown. Overall grade: B That's it from me, Cagesiders. Now it's your turn to sound off in the comments section below with all your thoughts on last night's show. How did you like it, if you liked it at all? WWE wrestlers feel the McMahons are stealing from their pockets to fund the? Network Rumor Roundup (May 9, 2014): Daniel Bryan and Batista update, John Cena movie, AJ Lee return,? more! Forgot password? We'll email you a reset link.", "articleID": "2014051014_00040232_W", "names": {"Mark Henry": ["Q310073", "Q38915344", "Q6768003", "Q6768004"], "Rob Van Dam": ["Q3360580", "Q44628"]}}, {"date": "2014-05-13", "url": "http://www.newkerala.com/news/2014/fullnews-52343.html", "content": "hollywood-news Mary-Kate Olsen likely to design own wedding dress Los Angeles, May 13: Actress-turned-fashion designer Mary-Kate Olsen might be mum on her engagement to Olivier Sarkozy, but she has hinted that she may create her own wedding gown. In an interview with WWD, the 27-year-old actress and designer opened up about her plans, reports eonline.com. \"I'm, like, not even there yet,\" she said of deciding on a wedding dress. <mark>David Cameron</mark> says Gary Barlow deserves to keep OBE despite tax avoidance", "articleID": "2014051323_00047585_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}}, {"date": "2014-05-14", "url": "http://techcrunch.com/2014/05/14/sift-science-raises-18m/?ncid=rss", "content": "Rebtel Spins Out Sinch, With $12M In Funding, To Offer Communications Tools To Developers Flipps, Metrekare, Tjobs Are The First To Get Backing From Earlybird's New CEE Fund Qriously Raises $3.5 Million Led By Spark Capital For Its Question-Based Mobile Ad Network Boston-Based VC Firm And Early Twitter Investor Spark Capital Raises $450M For Fourth Fund Electric Cruisebeast Creator Elon Musk Tells The Oatmeal He's \"Happy To Help\" Fund Tesla Museum Sift Science, a credit card fraud prevention company, has closed an $18 million Series B round of funding led by Spark Capital, with participation from Union Square Ventures, Max Levchin, and First Round Capital. But what exactly is Sift Science? If you own a credit card, you probably understand the pains of having your credit card information stolen and used fraudulently. But, if possible, put yourself in the shoes of the vendor or merchant making that sale. When someone fraudulently buys a television from Bestbuy.com, the company not only loses a television, but they lose the $1,000 that was paid for the television, as it's eventually returned to your account from their own account. And to top it all off, if more than one percent of a merchant's online transactions are considered fraudulent, they're added to a penalty box list by the credit card companies which could threaten their very ability to process transactions online. It's a lose-lose-lose. Sift Science can help, though. The company pairs a smart UI with machine learning to detect fraudulent charges as they're happening. The industry standard currently is around 50-80 percent false positives, meaning that whomever is in charge of fraud detection is wasting 50 to 80 percent of their time on false alarms. Through machine learning and the ability to see fraudulent activity across a whole network of merchants, Sift Science is able to bring that number down to seven percent or less. \"Most fraud detection systems are based around rules,\" said founder Jason Tan. \"If the charge is more than $5,000, and from a Nigerian IP address, and the card has been rejected three times before, then the company won't process the transaction. But we say\" no rules, all data .' \"By forgetting about rules to detect fraud, Sift Science can simply use the speed of machine learning and the intuition of the human brain to provide the clearest data possible around fraudulent transactions in real time. charges nothing for the first 10,000 transactions per month, for every client, and then the price rounds out to about one cent per transaction after that. There are no annual contracts. Qriously Raises $3.5 Million Led By Spark Boston-Based VC Firm And Early Twitter Linkwell Lands $11M From WellPoint, Spark <mark>David Lee</mark> From SV Angel:\" Foursquare Is One Rebtel Spins Out Sinch, With $12M In Funding, Flipps, Metrekare, Tjobs Are The First To Get To Battle Yammer, Slack And Hipchat, Convo Heroku And Salesforce Make Powerful Customer Senior Software Engineer GrubHub, Inc.. Full Stack Software Engineers Meetup Senior Systems Engineer Nickelodeon Marketing Technologist Freed Associates", "articleID": "2014051423_00051141_W", "names": {"David Lee": ["Q138121", "Q16194155", "Q18233288", "Q19831925", "Q19948577", "Q201853", "Q21095541", "Q22077814", "Q22670605", "Q2812455", "Q28417343", "Q463212", "Q5229168", "Q5236417", "Q5236418", "Q5236419", "Q5236420", "Q5236421", "Q5236424", "Q5236425", "Q5236426", "Q5236427", "Q5236428", "Q5236431", "Q5236432", "Q5236433", "Q5236434", "Q5236436", "Q5236437", "Q5236438", "Q57056433", "Q57439723", "Q8995743"]}}, {"date": "2014-05-15", "url": "http://www.newsday.com/sports/baseball/high-incidence-of-pitchers-having-tommy-john-surgery-concerns-mlb-1.8025893", "content": "15 m ago In Nassau road construction. right lane closed on Meadowbrook Pkwy SB between The Northern State Pkwy and Old Country Rd/M1 In Nassau road construction. right lane closed on Meadowbrook Pkwy SB between The Northern State Pkwy and Old Country Rd/M1 16 m ago Closed due to road construction on Seaford-Oyster Bay Expwy/Rt -135 SB between Powell Ave/X8 and Merrick Rd/X1 in Nassau Pin It High incidence of pitchers having Tommy John surgery concerns MLB Published: May 14, 2014 8:04 PM By Major League Baseball has been discussing the high incidence of pitchers undergoing Tommy John surgery, a person familiar with the issue said Wednesday, and it has become Topic A for Dr. <mark>Gary Green</mark>, baseball's medical director. Miami Marlins ace <mark>Jose Fernandez</mark> could become the 18th player this season--17 are pitchers--requiring reconstruction of his elbow because of a tear in the ulnar collateral ligament. The Yankees' Ivan Nova recently had the procedure and Mets righthander <mark>Matt Harvey</mark> is recovering from the surgery performed last November. \"It's certainly something that is happening with increasing frequency and [has] much more focus on it by clubs, media, fans,\" said a participant at the quarterly meetings at MLB headquarters in Manhattan. \"How this impacts drafts, signings, use of pitchers in player development and major leagues are issues every club now looks at differently than in the past .\" <mark>Green</mark>, an internist at Ronald Reagan UCLA Medical Center, said, \"This has been a research priority for us. We certainly recognize that something is happening to a quarter of our pitchers. It's something that we've had our attention on for several years. And we're actively researching this and we're going to continue doing that regardless of whether or not this is a spike this year .\" It's clearly a problem. This is a research priority and the commissioner has talked to me and conveyed his concern. And they said whatever resources you need to bring for people to bring in to look at this, you have whatever you need. \"There is a theory that the damage is the result of over-usage and that it largely affects hard throwers .\" It's a little premature, but overall I would probably agree with that, \"<mark>Green</mark> said .\" That's why we are researching this because we don't have a good answer. The thing that I would caution against is that while everybody maybe has a torn ligament, how they get there may differ. We may be saying the ulnar collateral tear is [the] end point--it could be from multiple problems. \"Joe Torre, MLB's executive vice president of baseball operations, believes the problem lies beyond merely saying it is endemic to power pitchers .\" Tommy John didn't throw hard, \"he said of the first pitcher to have the surgery in 1974. <mark>Green</mark> said,\" Even though we know that there are now more pitchers throwing at a higher velocity that they used to, that could be an association, not a causation. That's why we're doing research to find the causation rather than just things that could be associated with it. Everyone can speculate. Until we get some better answers, everybody has different opinions. \"<mark>Green</mark> could not put a time frame on finding a solution, saying,\" I've been asked that a lot. That's not how research works. You can have a breakthrough and then you find something and sometimes that raises three more questions. I really couldn't put a timetable on it. I would love to be able to, but you have complex problems that have complex answers. \"", "articleID": "2014051509_00012859_W", "names": {"Gary Green": ["Q1348874", "Q42422013", "Q5525162", "Q5525163", "Q5525164", "Q5525165", "Q5525167", "Q58756268"], "Jose Fernandez": ["Q2052820", "Q21006773", "Q57192176", "Q6292174", "Q705656"], "Matt Harvey": ["Q3299470", "Q6788770"]}}, {"date": "2014-05-15", "url": "http://www.politico.com/story/2014/05/scott-brown-2014-romneycare-obamacare-106669.html", "content": "He has called Obamacare a \"disaster,' a\" fiasco' and a \"government takeover .' | Getty CONCORD, N.H. - <mark>Scott Brown</mark> is on an\" Obamacare isn't working \"tour. Yet for all the vitriol, <mark>Brown</mark> may not be the purest critic. Obamacare is an offshoot of Romneycare, which <mark>Brown</mark> supported as a Republican state lawmaker in Massachusetts. That gives <mark>Brown</mark> the same problem Mitt Romney had while running for president in 2012: explaining why he likes and still defends a health reform law packed with mandates in Massachusetts while declaring its central elements unfit for the nation. <mark>Brown</mark> insisted in an interview that although Obamacare is\" the biggest issue in New Hampshire \"he is not taking health care cues from Romney .\" He's not told me anything, \"he said .\" I haven't talked to anybody about it. I understand the issues and do my own research. \"Yet <mark>Brown</mark> is not reticent about enlisting Romney to make his case, including a fundraising appeal highlighting the very topic that confounded Romney's own candidacy .\" The only way to get rid of Obamacare once and for all is to get rid of the Obamacare Democrats who forced it upon the American people in the first place...starting with Sen. Jeanne Shaheen, \"Romney wrote on <mark>Brown</mark>'s behalf. No candidate's political identity is more intertwined with Obamacare than <mark>Scott Brown</mark>'s. His ongoing praise for Romneycare and condemnation of Obamacare is the conundrum of his unusual bid to unseat Democrat Shaheen and become the first person to represent two states in the Senate since 1879. Also on POLITICO: Massachusetts ditches RomneyCare health exchange) Opposition to President Barack Obama's health law worked for <mark>Brown</mark> - once. It propelled him from the backbenches of the Massachusetts State Senate to Washington in 2010. Less than three years later, he was voted out. It was arguably easier to attack the federal version of the law when Massachusetts already had a state-based program to cover its own people. It may be harder to finesse as <mark>Brown</mark> transplants himself to New Hampshire, where enrollment in Obamacare exceeded goals. More than 40,000 people signed up, including 31,000 with subsidies, and the GOP-led state Senate recently joined Democrats to expand Medicaid, covering more low-income people in the state by embracing a key piece of the federal health law. Shaheen, like many of the vulnerable Democrats up for reelection in November, has been reticent about Obamacare. But she said in an interview outside the Senate chamber this week that\" successes \"are emerging .\" I think people are beginning to see the changes the health care law has made, \"she said, while again pledging to keep addressing its flaws. CARTOONS: Matt Wuerker on Obamacare) There are, of course, plenty of voters in New Hampshire who oppose the president's health law fiercely, and <mark>Brown</mark> barreled into the state promising to be their champion. One health insurer dominates the exchange, he notes, and there's been a particular outcry here from people who can't see the doctor they are used to, or go to the nearest hospital without incurring extra costs. And there were those politically toxic canceled health plans. <mark>Brown</mark> hammers on those points on his tour, and he spends most of his stump speech slamming the law and the ills he says it has wrought on New Hampshire. He makes passing mentions of high energy costs and emphasizes his\" long and strong ties \"to New Hampshire. But he repeatedly returns to the harm of Obamacare - and he lays the blame in Shaheen's lap .\" She's the deciding vote on Obamacare, along with all the other Democrats that rammed it through Congress, \"<mark>Brown</mark> said on his tour stop .\" Since when does the federal government tell us what to do and how to do it? That's not what we believe in here, that's not what I believe in. \") Shaheen has been talking about small businesses, jobs and veterans more than the Affordable Care Act. Her campaign notes her support for the health law but emphasizes her efforts to\" improve \"it, a staple for embattled Democrats. Lately though, she's beginning to describe more bright spots, including robust enrollment numbers. She also said as many as five insurers are thinking about joining New Hampshire's exchange next year, undercutting <mark>Brown</mark>'s argument about a lack of competition. She also pounced on <mark>Brown</mark>'s role in passing Massachusetts's health care law, accusing him of having\" changed his mind \"on policies he supported as a state senator .\" I don't know where <mark>Scott Brown</mark>'s been, \"she said .\" There are fixes that we need to make but the answer is not to repeal the law. \"For his part, <mark>Brown</mark> says he's not conflicted about his health record .\" I have no challenge. I'm very clear. I know what I did. I know how I voted, \"he said in the interview .\" We addressed a situation in Massachusetts that everybody worked on together...That's not what the federal plan did. And we didn't raise taxes, and we didn't cut Medicare. \"Polls show Shaheen leading by a few points, but it's early and lots of voters are undecided. Americans for Prosperity recently announced a\" six-figure \"ad buy here, hammering Shaheen on Obamacare and helping <mark>Brown</mark>. Republicans need to pick up six seats to take control of the Senate. They want New Hampshire to be one of them.", "articleID": "2014051607_00013606_W", "names": {"Scott Brown": ["Q15047261", "Q155125", "Q314160", "Q47233855", "Q7436044", "Q7436045", "Q7436046", "Q7436047", "Q7436048", "Q7436049", "Q7436050", "Q7436051", "Q7436052", "Q933673"]}}, {"date": "2014-05-16", "url": "http://www.nba.com/2014/news/05/16/cavs-coaching-search.ap/index.html?rss=true", "content": "Cavs have no timetable for hiring new coach <mark>Griffin</mark> says they \"don't have a real specific timetable\" and doesn't \"anticipate anything happening anytime soon .\" There had been reports that the Cavaliers might meet with candidates during the NBA draft combine this week. But <mark>Griffin</mark> says \"nothing along those lines\" has happened. Combine: <mark>David Griffin</mark> Scott Howard-Cooper talks with Cavaliers new general manager <mark>David Griffin</mark>.", "articleID": "2014051703_00031081_W", "names": {"David Griffin": ["Q16198682", "Q23769550", "Q2746775", "Q29572809", "Q5234408", "Q5234409"]}}, {"date": "2014-05-18", "url": "http://www.miamiherald.com/2014/05/17/4123198/cards-miller-drop-braves-4-1.html", "content": "ST. LOUIS--ST. LOUIS_There was more to his reboot at Class AAA Memphis for speedy infielder Kolten Wong than just getting regular playing time and relocating his swing. He had a chance to reacquaint himself with his feet. On Saturday, he introduced them to the St. Louis Cardinals. Sparks flew. Wong led the Cardinals' fast-forward offense with two bunts for base hits, a stolen base, a forced error, two runs, and a key run on a sacrifice fly. The rookie second baseman's footprint was all over the Cardinals' first three runs as they cruised to a 4-1 victory against Atlanta at Busch Stadium. Starter Shelby Miller authored seven innings and his sharpest start of the season to compel the Cardinals to their fourth consecutive victory, tying the longest winning streak of the season. \"Going back down I realized I wasn't doing much with my feet,\" Wong said. \"When I came back I wanted to make sure that speed was a main element to work with. Even though my swing is coming around I still have to make sure that people know I can run, that I can do things with my feet. That's what I'm here for .\" As the Cardinals look for the offense they expect to have, an injection of footspeed gives them the chance to push for runs until the lineup revs to life. With Wong and Peter Bourjos, the two fleetest of Redbirds, getting more regular playing time this weekend against the Braves, they've had the chance to show another way to provide runs for a team lacking in power. The only Cardinals to have multiple hits in the game, Wong and Bourjos combined for four bunt singles. The Cards are the first team since Detroit in September 2003 to have four bunt base hits in a single game, according to the Elias Sports Bureau. The win \"was one of the best representations of what speed can do for us,\" manager Mike Matheny said. \"How guys made things happen and then getting on base and creating havoc ....I think it just gives us more weapons. Days when we can sit back there and slug, I'd like to see us slug. Days when we've got a tough pitcher like (Atlanta's Aaron) Harang that's not giving us a lot, we have to figure out a way to manufacture and that's what we did. It was fun to watch the guys use their gifts .\" Hours before first pitch, Matheny sat in his office and described how the club's frustration stemmed not from an inability to play individual games at their best but \"to replicate that on a consistent basis or a semi-consistent basis .\" The unsteady start to the season has been a long tease for the Cards, who have been unable to build winning streaks because of ragged play - at the plate, on defense, or, more recently, on the mound. The Cardinals go for a sweep of the Braves Sunday, with Jaime Garcia making his first start in a year, because of two of their cleanest and best games of the season. While Wong's speed provided the runs and embroidery on the second win in as many days against first-place Atlanta, it was another teammate finding his pace that was the core of the Cardinals' more-complete game. Miller (6-2) has scuffled in recent starts because his mechanics falter or fail him in the middle innings. After consultation the past week with pitching coach Derek Lilliquist, Miller increased his tempo on the mound Saturday and had his best variety of pitches. During one at-bat against Braves slugger Evan Gattis, Miller flipped four breaking balls. He had downward movement of his fastball and maintained the horsepower to elevate for three consecutive strikeouts on 93-mph fastballs in the fourth inning. Miller struck out seven and completed seven innings for only the second time in his past 29 starts. \"Most of our guys work quickly,\" Miller said. \"That was one of the main focuses. Try to stay in the zone and throw strikes and everything works out. The biggest thing is trying to get outs as quick as possible .\" The only run Miller allowed was unearned because of an error from Wong. He threw wild to third base as the Cardinals pressed for an out in the second inning on a single to left field. Rather than lament the outcome, Matheny lauded the idea, calling it \"an aggressive play .\" In the fifth inning, Yadier Molina jumped on a bunted ball that appeared to be foul and spun a double play that unplugged the Braves' rally. Atlanta manager Fredi Gonzalez was ejected for arguing the call, though he came out two more times after the ejection to keep fuming. \"Aggressive plays\" are the type of things Matheny has urged to jar the Cardinals from their funk. The Cardinals entered Saturday as one of the lowest-scoring teams in the majors, complete with the fourth-lowest slugging percentage (.362) and second-fewest homers (23). Speed offers them a way to rewire the offense. Behold the power of the right bunt. \"When I'm not feeling that great at the plate, you drop a bunt down and get a hit out of it,\" Bourjos said. \"It can affect a lot of games. It's not always there, but when it is, take advantage of it. And then, sure enough, you get your swing going and I don't feel like bunting. It can hold you over for a little bit .\" Wong led off the fourth with a drag bunt against Harang (4-4). He scored from third when second baseman Tyler Pastornicky faded to shallow right and caught Yadier Molina's fly ball instead of right fielder and better arm Jason Heyward. Wong said he likely wouldn't have tried to score and tie the game had Heyward caught the ball. In the sixth, Wong meant to bunt <mark>Matt Carpenter</mark> into scoring position, but ran it out for a base hit. He tried to steal second and Gattis' throw went to center. <mark>Carpenter</mark> scored to break the 1-1 tie, and Wong followed on Allen Craig's RBI single. The only Cardinals run Wong didn't influence came in the seventh, again on a bunt. <mark>Matt Adams</mark> tripled and then scored on a safety squeeze bunt by Bourjos. Trevor Rosenthal collected his 13th save with a flawless ninth. Now, the Cardinals can see how far they can run with their best stretch of baseball. \"That starts things. That's how baseball is - one little thing can start a rally,\" Wong said. \"When you get two bunts for hits in one game, you know things are going right .\" ", "articleID": "2014051811_00026594_W", "names": {"Matt Adams": ["Q3299390", "Q48797070"]}}]