[{"articleID": "2018032820_00132873_W", "names": {"Jon Lewis": ["Q22104913", "Q3526972", "Q42320078"], "Emily Cook": ["Q436390", "Q5372116"]}, "date": "2018-03-28", "url": "https://www.plymouthherald.co.uk/news/plymouth-news/former-drag-racer-panicked-sped-1396835", "content": "News Former drag racer panicked and sped off when he was caught speeding \"The next time the probation service says:\" Jump' you don't ask why, you say: \"How high?' .\" Share Comments By <mark>Jon Lewis</mark> Head of social media 21:28, 28 MAR 2018 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Share Comments Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email A former drag racer caught speeding during a police crackdown on bad driving has swerved jail. Unlicensed Liam Fitzgerald, aged 18, panicked when he saw officers and tried to drive away. He put other road users and moorland livestock at risk as he sped at about 60mph, Plymouth Crown Court heard in January. He was banned from the road and given unpaid work as part of a community order. Liam Fitzgerald outside court (Image: Stuart Abel) But Fitzgerald admitted breaching the order by missing his first probation meetings. He also failed to turn up for a court hearing--but has since attended Plymouth Crown Court. <mark>Emily Cook</mark>, for the probation service, said that he had also started attending his unpaid work. She said he had officers were worried about his attitude and he had said he thought his hours were a \"waste of time\". Judge Paul Darlow asked him: \"Do you think it is a waste of time? If so, tell it to my face .\" Fitzgerald replied: \"No .\" Read More Burglar raided pawnbrokers before getting mates to sell his loot Judge Darlow allowed the community order to continue, adding another 30 hours of unpaid work for the breach. He added: \"The next time the probation service says:\" Jump' you don't ask why, you say: \"How high?' .\" Fitzgerald, of no fixed address, had pleaded guilty to dangerous driving in Wootter on June 24 last year. He also admitted that he was driving otherwise than in accordance with a licence and without insurance. The Citroen was owned by his then girlfriend, who was a passenger. The court heard that police were carrying out an operation on speeding on Dartmoor that Saturday afternoon. The Citroen was recorded as going at 47mph in a 30mph zone. Read More Puppy walkers wanted to help train the cutest police dogs in the world An officer tried to flag the car down but it sped away through Wootter. The court heard that his speed could not be recorded but Fitzgerald admitted he was going at 60mph in 30mph and 40mph zones. Other road users, including guests at the Moorland Hotel, and livestock were put at risk for about 10 minutes. Moorland Garden Hotel Fitzgerald's barrister said his client had \"panicked and put his foot down\" when he saw the police. The court heard Fitzgerald had taken part in drag racing on private land in Cornwall, for which he did not need to be licensed. The defendant was handed 180 hours unpaid as part of a 12-month community order. He was banned from the road for a year and ordered to pay £ 650 prosecution costs and £ 85 victim surcharge. Download The Herald app We have launched our very own app for Android and Apple devices which can be tailored to deliver the news and sport that you're interested in. It means you can get the news which matters to you faster than ever before. Discover breaking news online from the area including the latest on Argyle, sport, business, news where you live, weather and what's on. Just one quick download and you can read our content on the move without being online. To download the iOS app click here. To download the Android app click here. Find out more about the app here. Like us on Facebook Follow us on Twitter Daily Newsletter theplymouthherald Follow @ plymouthherald Subscribe to our Daily newsletter Enter email Subscribe Comments Show more comments More On Courts"}, {"articleID": "2018020613_00028406_W", "names": {"Bill Walker": ["Q18159074", "Q25473882", "Q4911260", "Q4911261", "Q4911262", "Q4911263", "Q4911264", "Q4911267", "Q547758", "Q862635"]}, "date": "2018-02-06", "url": "http://daytondailynews.com/news/national-govt--politics/the-latest-pence-japan-boost-pressure-north-korea/OHy4iBUOLphsN65DRzzueM/", "content": "0 Nation & World View Caption Hide Caption Vice President Mike Pence addresses the media before a briefing on missile defense with Alaska Gov. <mark>Bill Walker</mark> and Gen. Lori J. Robinson, Commander, United States Northern Command and North American Aerospace Defense Command, at Joint Base Elemendord-Richardson, Alaska, Monday, Feb. 5, 2018. (AP Photo/Zeke Miller TOKYO The Latest on Vice President Mike Pence (all times local): 9:35 p.m. U.S. Vice President Mike Pence has arrived in Japan on the second stop of his Asia swing that he says will boost pressure on North Korea over its nuclear program during the Winter Olympic games in the South. In Japan, Pence says he will meet with Prime Minister Shinzo Abe to show \"solidarity,\" in the face of the North Korean threat and with U.S. service members who would be among the first to respond to a crisis. Pence departs for South Korea Thursday, where he will meet with President Moon Jae-in and attend the opening of the games Friday night. Pence says he wants to help \"make sure that North Korea doesn't use the powerful symbolism and the backdrop of the Winter Olympics to paper over the truth about their regime .\" ___ 8:30 p.m. U.S. Vice President Mike Pence has not ruled out the possibility of meeting with North Korean officials at the upcoming Olympics in South Korea. Pence spoke before departing Monday for a six-day swing through Asia that will be highlighted by his stop at the Pyeongchang Games. He says no plans have been made for him to meet with any members of the North Korean delegation. North Korea is sending its nominal head of state, Kim Jong Nam--the highest-level visitor to the South from the North in recent memory. Pence says he hasn't requested any meeting \"but we'll see what happens .\" View Comments 0"}, {"articleID": "2015103112_00080995_W", "names": {"Saurabh Srivastava": ["Q27975219", "Q30668231"]}, "date": "2015-10-31", "url": "http://www.freepressjournal.in/jabong-ropes-in-benettons-sanjeev-mohanty-as-ceo/", "content": "Home / Business / Headlines / Latest News / Jabong ropes in Benetton's Sanjeev Mohanty as CEO Jabong ropes in Benetton's Sanjeev Mohanty as CEO--By | Oct 31, 2015 05:29 pm PTI New Delhi: Online fashion marketplace Jabong today said it has appointed Sanjeev Mohanty as its CEO and Managing Director. Mohanty, whose appointment is effective early December this year, has over 20 years of experience in the fashion industry, the company said in a statement. Prior to this, he has worked with Benetton India for over 11 years, including 8 years as Managing Director. Mohanty will play a crucial role in reviving the company's business that has lost ground to rivals like Flipkart, Myntra and Amazon India. Prior to Benetton India, Mohanty was associated with Madura Garments as General Manager and Brand Head for SF Jeans. He has also worked at Levi Strauss as Product Manager for the top wear category. \"His strong leadership skills and deep understanding of fashion and the Indian consumer, coupled with the continued commitment from GFG's shareholders, will allow Jabong to further strengthen its position as the leading online fashion destination in India,\" Global Fashion Group (parent company of Jabong) CEO Romain Voog said. While Jabong has faced issues like senior-level exits, erosion in market share, mounting losses as well as speculations of a possible sell-out over the past few months, the new team under Nils Chrestin (CFO at GFG) has been working on turning around the company. The company recently appointed <mark>Saurabh Srivastava</mark> as its chief marketing officer (CMO). Last year, Jabong investors--Investment AB Kinnevik and Rocket Internet AG--had merged the Indian online fashion retailer with four other firms to create a new global fashion e-commerce group, GFG. GFG has raised about USD 1.5 billion in capital since 2011. \"There could be no better opportunity than Jabong given its scale and consumer brand recognition...we have identified a number of growth drivers that will allow us to deliver an unparallelled experience to delight our customers and suppliers,\" Mohanty said. Lorenzo Grabau, Chairman of GFG and CEO of Investment AB Kinnevik said India is a hugely exciting market. \"GFG's shareholders and management remain committed to building Jabong to the benefit of its customers, employees and partners. We look forward to supporting Sanjeev as the company starts a new chapter this Diwali,\" he added. Share this Post:"}, {"articleID": "2016080423_00334695_W", "names": {"Paul Mcgregor": ["Q7152359", "Q7152360"]}, "date": "2016-08-04", "url": "http://au.sports.yahoo.com/league/a/32241906/benji-marshalls-contract-hopes-suffer-blow/", "content": "Matt Encarnacion - AAP on August 5, 2016, 8:02 am Replay Video will begin in STOP UP NEXT Video Broncos hold out Dragons in the wet Share Tweet Whatsapp Email Share Benji Marshall s contract hopes suffer blow - Yahoo7 Pinterest Tumblr Benji Marshall's chances of earning a new NRL contract took another blow after suffering a rough outing with the ball in St George Illawarra's loss to Brisbane on Thursday. While the veteran playmaker tried hard to spark his team's spluttering attack, he committed five of his team's nine errors, including two fumbles in attacking opportunities and one kick out on the full. Summing up his night was a crucial turnover late in the game, when he was caught on the sixth tackle with the Dragons searching for a game-winning play. Marshall opted not to talk following the match, while Dragons coach <mark>Paul McGregor</mark> declined to comment on Marshall's performance post-game. \"I'm not here to talk about individuals. It's a team sport and it's no good sitting in front of anyone talking about individual players,\" he said. However <mark>McGregor</mark> did concede that the Broncos' kicking game was a major factor in the Dragons falling to their fifth straight defeat, all but ending their finals ambitions. Marshall took 14 of the Dragons' kicks, while halves partner Gareth Widdop hit nine. \"You have a look at the game, where we started play one and where they started play one...Our kick placement wasn't where it needed to be,\" he said. <mark>McGregor</mark> also admitted he has grown tired of the constant speculation surrounding his off-contract players, particularly Marshall and hooker Mitch Rein. \"Since November there's been a lot of talk about contracts at the club and it's been a real unstable environment because of that,\" he said. \"I've just been answering every media session all year and every time about certain players .\" They know my feelings, the players. So now it's time for the recruitment guys to do their job and step up and answer the questions that you write about who's here and who's not here next year. \"Share Tweet Whatsapp Email Share Benji Marshall s contract hopes suffer blow - Yahoo7 Pinterest Tumblr"}, {"articleID": "2017071411_00681241_W", "names": {"Gareth Jones": ["Q15990091", "Q16194126", "Q25189125", "Q28766870", "Q304629", "Q30505322", "Q5522881", "Q5522882", "Q5522883", "Q5522885", "Q5522889", "Q57245256"]}, "date": "2017-07-14", "url": "http://www.msn.com/en-us/news/world/five-hurt-in-acid-attack-robberies-in-london-teenager-arrested/ar-BBEofJG?li=BBnbfcL", "content": "© REUTERS Emergency response following acid attack on the junction of Hackney Road junction with Queensbridge Road, London British police arrested a teenager on Friday after five acid attacks in less than 90 minutes across east London left several people with facial burns, including one with horrific injuries. 2 cards charging 0% Interest until 2019 See The 0% APR Cards Sponsored by NextAdvisor Two assailants on a moped pulled up alongside a 32-year-old man in the Hackney area of east London at 2125 GMT on Thursday and threw acid in his face before one of the pair made off with the victim's moped. In the next hour and a half, three other men across Hackney and one in the neighboring borough of Islington had corrosive substances hurled at them, police said. After one of the robberies in Hackney, a man was left with facial injuries described by police as life-changing. \"A male in his teens has been arrested on suspicion of grievous bodily harm and robbery,\" the London police service said. \"He is currently in custody at an east London police station .\" Metropolitan Police Commissioner Cressida Dick said that while still relatively rare, the number of acid attacks appeared to have risen in the capital. \"I don't want people to think that this is happening all over London all of the time - it's really not, but we are concerned because the numbers appear to be going up,\" Dick told the LBC radio station in an interview. \"Acid attacks are completely barbaric,\" Dick said. \"The acid can cause horrendous injuries. The ones last night involved a series of robberies we believe are linked .\" (Editing by Guy Faulconbridge and <mark>Gareth Jones</mark>)"}, {"articleID": "2012020504_00046103_W", "names": {"David Small": ["Q5239868", "Q56811270"]}, "date": "2012-02-05", "url": "http://kansas.com/2012/02/04/2203399/childrens-books-how-much-mischief.html", "content": "what do you say when your dog misbehaves? \"eli, no!\" words and pictures by katie kirk (abrams books, ages 3-8, $14.95) gives a pretty good answer. eli is a good dog who sometimes gets into bad trouble. whether it is eating too much, making a mess, or hogging the bed, the owner's response is the same: \"eli, no!\" kirk writes an engaging story that explores the many ways a dog be a bother. most two-page spreads are a simple five-word sentence followed by \"eli, no!\" her full-color block illustrations, however, greatly expand the story, giving ample detail. with all the mischievous things a dog can get in to, they have to wonder, \"do they still love me?\" the answer is \"of course, eli, yes!\" ? \"ellen's broom\" written by kelly starling lyons and illustrated by daniel minter (g. p. putnam's sons, ages 5-8, $16.99) is a great choice for black history month. ellen has always known the broom above the hearth was special, but she didn't know why. then one day their preacher announces that all former slaves can now have their marriages legally recognized. as slaves, her parents were only able to be married by \"jumping the broom,\" but that didn't mean a husband wouldn't be sold away from his wife or children. lyons writes a rare reconstruction tale. not only is a grave injustice thoughtfully explored, but \"ellen's broom\" is a touching story of love and family devotion. minter's linoleum-block prints are quite realistic with a historical feel. since the broom had been there from the start, her mother suggests they take it with them to the courthouse. ellen decorates the broom with flowers so that mother has a bouquet. after their marriage is legally registered, \"papa kissed mama and twirled her in the air like a new bride .\" ? guess who is 100 years old this year? \"here come the girl scouts!\" written by shana corey and illustrated by hadley hooper (scholastic press, ages 5-9, $17.99) tells it all. juliette \"daisy\" gordon low grew up in a time when \"young ladies were supposed to be dainty and delicate .\" but daisy wanted adventure! she learned to forge iron from a blacksmith and flew in a monoplane. one day she discovered a group called the boy scouts and decided girls needed the same opportunities. corey's writing brims with the excitement daisy must have felt. extensive end notes give additional history and resources. the illustrations by hadley hooper are charming, feature a lot of green, and include more than 20 quotes from daisy herself. \"here come the girl scouts!\" is a wonderful choice for any library or home .? \"so you want to be president?\" by judith st. george and illustrated by <mark>david small</mark> (philomel books, ages 8-12, $17.99) won the 2000 caldecott medal. this revised and updated edition is perfect for presidents' day and all through the election season. st. george writes about the great variety of presidents in humorous fashion. from skinny-dipping in the potomac river to having enough pets for a zoo, presidents have done it all. <mark>small</mark>'s hilarious illustrations are done in a political cartoon style. our 44 presidencies to date are briefly detailed on four pages at the back. this book will not only serve as an inspiration to young people, it also highlights the humanity of those who have served in one of the most powerful positions in the world."}, {"articleID": "2018020620_00245659_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Gonzalo Curiel": ["Q26467337", "Q5582231"]}, "date": "2018-02-06", "url": "http://www.cachevalleydaily.com/news/national/article_370b2162-8c03-54e2-a624-da56e46a118c.html#user-comment-area", "content": "SAN FRANCISCO (AP)--A federal appeals court on Tuesday upheld an agreement requiring President <mark>Donald Trump</mark> to pay $25 million to settle lawsuits accusing his now-defunct <mark>Trump</mark> University of fraud. The 9th U.S. Circuit Court of Appeals rejected an effort by student Sherri Simpson to opt out of the deal and pursue her own lawsuit. The move would have derailed the settlement resolving lawsuits that claimed the university pressured students to spend tens of thousands of dollars but then failed to deliver on promises to teach them how to be successful in real estate. Simpson didn't drop out of the agreement initially and claimed she had the right to do so before it was finalized. A three-judge panel of the court unanimously disagreed, saying neither a notice to affected students nor due process gave her a second chance to opt out. The court also said U.S. District Judge <mark>Gonzalo Curiel</mark> had ample reason to approve the deal. \"Both classes of plaintiffs would have faced significant hurdles had they proceeded to trial, including the difficulty of prevailing in a jury trial against either the president-elect (if the trial had proceeded as scheduled) or the sitting president,\" Judge Jacqueline Nguyen wrote for the panel. An attorney for Simpson referred comment to another attorney, who did not immediately respond. The two class-action lawsuits and a civil lawsuit by New York Attorney General Eric Schneiderman followed <mark>Trump</mark> throughout the presidential campaign. <mark>Trump</mark> fueled the controversy by repeatedly insinuating that <mark>Curiel</mark>'s Mexican heritage made him biased against <mark>Trump</mark>. <mark>Trump</mark> had vowed never to settle but said after the election that he didn't have time for a trial. The president did not acknowledge any wrongdoing under the terms of the settlement. In a statement Tuesday, Scheiderman said the 9th Circuit ruling \"means that victims of <mark>Donald Trump</mark>'s fraudulent university will soon receive the $25 million in relief they deserve .\" Plaintiffs' attorneys have said about 3,730 people will get at least 90 percent of their money back under the deal. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. © 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2012020904_00010449_W", "names": {"Bill Johnson": ["Q16204402", "Q17385655", "Q17626755", "Q21585452", "Q24817767", "Q2903258", "Q30717048", "Q3366808", "Q339036", "Q48645040", "Q4909622", "Q4909623", "Q4909624", "Q4909626", "Q56558077", "Q720797", "Q862215", "Q862229"], "Beverly Hills": ["Q4899544", "Q923258"], "Robert Gillespie": ["Q5864965", "Q7344774"]}, "date": "2012-02-09", "url": "http://brownsvilleherald.com/sports/johnson-136742-made-skier.html", "content": "international capsules: former u.s. olympic skier's spirit shines through the daredevil downhill skier in him still craves going fast even if his body no longer permits it. once helped into his motorized scooter, former olympic champion <mark>bill johnson</mark> races through the halls of an assisted living facility in gresham, ore., hardly ever backing off the accelerator. well, until he's ordered to slow down by the nursing staff. a series of strokes have all but immobilized the skier who once lived life on the edge, whose brash confidence, movie-star charisma and rebellious attitude made him a fan favorite at the 1984 sarajevo olympics, where he became the first american to capture the downhill crown. in 2001, johnson attempted to regain his glory and made a comeback at the u.s. championships at age 40, with grand visions of earning a spot on the squad for the 2002 salt lake city games. only, johnson wiped out during a practice run, suffering a traumatic brain injury that erased nearly a decade of memories. he also had to learn how to walk, talk and eat again. he had made steady improvement over the years, even returning to the slopes for recreation. but johnson's health has been slowly on the decline because of mini strokes. then, nearly two years ago, he had a major stroke that stole the rest of his body. now, his speech is slurred, he can't sit up on his own, his left eyelid doesn't open and only his left hand is operational. that's his steering hand for his powered chair, enabling him to make those mad dashes down to the cafeteria for coffee. he definitely misses the thrill of speed - any kind of speed. there are no reminders of his past hanging on the walls in his room, nor any trophies on the shelf. he prefers it that way. most of those trinkets are neatly boxed up at his mom's house - waiting to be passed along to his children - along with his gold medal, which is tucked away in a safe. johnson still eagerly watches downhill races on television, perking up when bode miller flies out of the starting gate. johnson will follow along, his eyes visualizing the moves as miller carves his way through the course. johnson used to ski a lot like miller - with a gambler's mentality and a resolve to take risks that few others would. indeed, his mind still races, even if his body can't. these days, johnson, who turns 52 at the end of march, spends most of his time confined to his wheelchair or his bed, playing video games or watching game shows. his mom, d.b., frequently drops by to check on him. she used to care for her son at the family home, but his current health has made that impractical. johnson has stopped going to physical therapy, because he doesn't see any reason for it. \"he knows he's not improving,\" his mom said. \"he doesn't like to be fussed over .\" communicating for johnson has become a labored task. so much so that his mom frequently serves as his translator, especially when he can't vocalize his needs - like wanting a peanut butter and jelly sandwich from the kitchen - to the staff. that's been frustrating. the personable johnson has always enjoyed chatting, especially about skiing. does watching ski racing take him back to his glory days? \"yes,\" he whispered in the background as his mother held the phone. enjoy watching lindsey vonn and miller race? \"yes,\" he softly said. were you the pioneer that opened up downhill skiing for the americans? a pause. then a chuckle. \"yep,\" he answered. that olympic downhill run in sarajevo nearly 28 years ago was electric as he effortlessly glided through the course, holding off the austrians whom he had infuriated with his bravado leading up to the race. \"what he did that day was amazing at the time,\" said bill marolt, president and ceo of the u.s. ski and snowboard association. \"in retrospect, it's still amazing .\" same with his story. always a gifted skier, johnson had a wild streak that had him careening down the wrong path. caught stealing cars as a teenager, the judge gave him a choice: attend ski school or head to jail. so he went to mission ridge ski academy in washington, where he discovered that, when dedicated, he had potential. lots of it, even, as he earned a europa cup crown. johnson made his first world cup start in february 1983, taking sixth at a downhill in st. anton, austria. a year later in wengen, switzerland, he captured his first big-league race. despite his short time on the circuit, johnson was one of the favorites heading into the olympics - and he let everyone know it. he had a knack for getting under the skin of european skiers, maybe even a few coaches along the way, too. winning that day in sarajevo was the pinnacle of his career. johnson won twice more that season, but wouldn't step on the world cup podium again. and three years after his debut on the scene, he made his last world cup appearance, finishing seventh in the downhill at whistler. still, he became an iconic figure to many americans. \"they related to billy - that brash, throw-it-in-your-face type attitude,\" said phil mahre, who won the olympic slalom in' 84. \"when you tell people you're going to go do something and then you go out and back it up like in sarajevo, it's pretty impressive .\" johnson went through knee and back injuries that curtailed his career and prevented him from defending his title at the 1988 calgary olympics. \"it would've been great if he would've kept the charge going,\" mahre said. \"i think it all came too quickly, it all came too easily. then it left just as quickly and just as easily .\" soon after, johnson's life began to unravel. he lost his first son, ryan, at 13 months old in a hot tub accident and went through a divorce a few years later. he drifted, not really sure what to do next. then, inspiration hit. a way to get his life back on track the only way he knew how - make the olympic team. \"he loved the downhill,\" his mom said. \"that was his life. that's the reason he went back. he was going to try to do it again. he could've done it .\" at the u.s. championships near whitefish, mont., johnson was speeding down the course at close to 60 mph when he entered a twisting section. he lost his balance, did the splits and slammed face first into the snow, biting off a chunk of his tongue as he flew through two sets of safety netting. he needed a breathing tube at the mountain and then was quickly transported to a hospital by helicopter. \"the doctors didn't think he was going to make it,\" said attorney and good friend harold burbank, who oversees the <mark>bill johnson</mark> special needs trust project which raise money for his care. he did, bucking long odds. but he sustained permanent brain damage. for three years after the accident, johnson stayed with his mom as he recovered. then, he moved into a trailer home to regain some of his independence. he even returned to the slopes - for fun. in january 2008, he slowly started losing the use of his right side. he was having mini strokes, the doctors eventually concluded. then, he had an even more debilitating stroke, all but immobilizing him. \"some days are really good days,\" his mom said. \"some days are not so good .\" the good days are when his sons, nick, 19, and tyler, 17, stop by for a visit. \"that lights him up,\" his mom said. so does conversing about skiing, his mom close by to relay his words. you had a unique way of attacking a course, huh? \"yes,\" he said. what do you want people to remember about <mark>bill johnson</mark>? \"best american skier,\" he said. anything people can do for you? a pause. then a chuckle. \"send candy,\" he said. sochi olympics downhill course gets high marks krasnaya polyana, russia (ap) - didier cuche called it \"magnificent .\" bode miller was highly critical. aksel lund svindal said the course for the 2014 sochi olympics was \"what downhill is all about .\" racers mainly gave high marks to the rosa khutor slope after the opening world cup training session was held under clear sunshine and good snow conditions. \"it's a magnificent course,\" said cuche, the four-time winner of the world cup downhill title, who finished second to austria's hannes reichelt on wednesday. \"perhaps a little bit too turning, it could be adapted a little bit to change that. the first 40 seconds or so it resembles more a super-g than a downhill, albeit a very fast super-g .\" it's not like any other run on the circuit, \"said cuche, who plans to retire after this season .\" it's a really interesting run. they have managed to shape the course around the mountain in a really nice way. \"however, miller said the constant turns on the upper section are too much like super-g .\" i don't really believe it embodies anything that a true world cup downhill should be, \"said the 34-year-old american, who would compete in his fifth olympics. training sessions are scheduled for thursday and friday before a world cup downhill on saturday and a super-combined race on sunday - the first major test events for the sochi games. at 2.2 miles, the course is one of the longer layouts that skiers have faced, although the constant turns mean little time in the tuck position. therefore, it's not one of the most physically demanding tests .\" if they ran that as the olympic super-g it would be an epic super-g, because it's not that tiring, even for the amount of time that you're on the course, \"said miller, who cruised down in 32nd place .\" it's just cranking turns the whole way on that good, hard snow. \"miller lamented the lack of gliding sections, where he usually excels .\" there's not one place where you're not going hard edge-to-edge except for this road just before this second-to-last jump into the finish, \"he said .\" because you're so tall and you're legs are long, you're not tucking at all. \"the upper half of the course contains a series of technical, narrow and steep turns before easing out toward the end, although there are large jumps all the way down, including one into the finish .\" it's a tough course, \"said svindal, the two-time overall world cup winner from norway .\" i think a lot of guys were surprised at inspection this morning. \"it's kind of what downhill is all about - the mountain kind of sets the pace,\" svindal added. \"if this was gliding from the top then we would kill ourselves after 20 seconds, so i'm glad they put some turns in there .\" svindal thought organizers injected too much water to make the upper portion of the course harder. \"it's a tough course - that's the bottom line - but the course preparation really makes a (difference),\" said the norwegian, who placed 21st. \"i think they overdid it with the water this time. they'll probably use less water for the olympics .\" svindal's biggest complaint was about the poorly organized charter planes that the international ski federation (fis) used to transport athletes to russia. he and other skiers said they were given no food or water for six hours from the time they began their trip from zurich on tuesday. \"if we knew, we would have brought something, but information was limited,\" svindal said. the u.s. ski team avoided the charter route and flew from europe by private jet, part of a training arrangement with the russian ski federation. \"it was cool to be able to fly here in style,\" said giant slalom world champion ted ligety. construction is everywhere, all the way up to the ski course finish area, which is located halfway up the mountain and requires two gondolas and a windy chairlift for fans and media. the skiers and the fis officials seem pleased, so far. \"this is the training of the test event, so this is round 1, day 1 - we're as green as green gets,\" said men's world cup finish area director mike kertesz. \"i don't mean to pat our own backs, but with all the work we've done so far, things are running according to the way they should, or even better than i've seen a brand new organizer do before .\" --andrew dampf reichelt tops first dh training on sochi 2014 course krasnaya polyana, russia (ap) - hannes reichelt of austria led the opening world cup training session on the 2014 sochi olympics downhill course on wednesday. with bright sunshine and good, hard snow conditions, reichelt clocked 2 minutes, 12.91 seconds down the steep and technical rosa khutor slope. skiers said the course requires allaround skills because it was so technical, with few gliding sections. that fits reichelt, who has won four world cup super-gs and one giant slalom, plus posted three podium results in downhill. swiss standout didier cuche, who has announced he will retire at the end of this season, was second, 0.25 seconds behind, and benjamin thomsen of canada was third, 0.69 behind. more training sessions are scheduled before before racing begins on saturday. olympics rio 2016 adds nissan as local olympic sponsor sao paulo (ap) - rio olympic organizers added nissan as the fifth top-tier sponsor for the 2016 games. organizers didn't disclose financial details, but said wednesday the deal with the car maker for the olympic and paralympic games exceeded \"the requirements from rio 2016 for the category .\" the committee said nissan will provide 4,500 vehicles to transport athletes, officials and journalists during the games. nissan is the sixth domestic sponsor for the games. the others are bradesco, bradesco seguros, claro and embratel. the sole tier-two sponsor is ernst & young terco. rio 2016 olympic committee president carlos nuzman said during a news conference in rio that the games have surpassed the initial goal of $570 million in sponsors. the mark had already been surpassed before the nissan deal, according to the committee. the current worldwide olympic partners for the 2016 games are coca-cola, atos, dow, ge, mcdonald's, omega, panasonic, procter & gamble, samsung and visa. \"this partnership demonstrates the value of the rio 2016 brand and the strength and attractiveness of the brazilian consumer market,\" nuzman said. \"after six months of negotiations that also involved other applicants, nissan submitted a proposal that ensures a consistent mix of products, services and financial backing, proving to be the ideal automotive partner .\" nissan said it has a plan to support local organizers' goals, including a program to support young athletes, promote the games' legacy and marketing ideas \"to spread the olympic experience .\" \"our multiple connections with brazil are deep,\" nissan president and chief executive carlos ghosn said in a statement. \"as a showcase for the energy and vision of brazil, the olympic games are a natural fit for nissan .\" organizing committee ceo leonardo gryner said the deal with nissan will help the city \"tackle operational challenges in a vital area such as transport .\" the 2016 games in rio will be the first in south america .--tales azzoni chair of olympics legacy company to step down london (ap) - the chair of olympic park legacy company says she'll be stepping down after the games. margaret ford, who is in charge of securing the economic future of the olympic park, says the next phase of development will require much attention to detail, and that she won't have enough time. she says she'll step down after the july 27-aug. 12 event. her decision comes only weeks before the company will be transformed into a development corporation, which will answer directly to mayor boris johnson. ford will act as interim chair of the new body, and oversee the transition. cycling officials: longo's husband arrested over epo buy paris (ap) - french police raided the home of cycling great jeannie longo on wednesday and arrested her husband on suspicion that he bought doses of the banned performance-enhancer epo. the 53-year-old longo was expected to be questioned following the arrest of her husband and coach, patrice ciprelli, at their home in saint-martin-le-vinoux in the french alps, said police officials who spoke on condition of anonymity because they were not authorized to publicly discuss the case. another french official, also speaking on condition of anonymity, said ciprelli was suspected of buying epo over the internet in the past two years. his arrest came three months after the french cycling federation cleared longo of breaching anti-doping rules in an embarrassing blow for france's anti-doping agency. prosecutors in the alpine city of grenoble are handling the case. france's police agency responsible for anti-doping investigations, oclaesp, also was involved. calls to longo's home went unanswered. ciprelli was suspended by the french cycling federation last september over allegations he bought epo. that prompted longo to pull out of last year's road world championships in holte, denmark. longo's list of titles covers nine pages in \"jeannie by longo,\" her biography. longo won gold at her fourth olympics, at atlanta in 1996. she also has two olympic silvers and one bronze, 13 world titles, 58 french titles and world records. in an ap interview in february 2011, longo's response was ambiguous when asked whether doping might be part of her longevity in cycling. she explained that there are no level playing fields in sports \"because we all do what we can to be better .\" --jamey keaten horner expected to compete in tour of california los angeles (ap) - defending champion chris horner and three-time winner levi leipheimer are expected to be in the field for the 2012 amgen tour of california, which will include a 130-mile fourth stage that will make for the race's longest day. the seventh annual race, scheduled may 13-20, is expected to include about 140 of cycling's top riders. the roughly 800-mile route, which was announced wednesday, will begin in santa rosa, calif., and take riders into the rolling <mark>hills</mark> of sonoma county. the fourth stage will take riders from sonora to clovis during the race's longest day. the concluding eighth stage begins on rodeo drive in <mark>beverly hills</mark> and finishes in downtown los angeles. participating teams and individual riders will be announced in the weeks just prior to the race. boonen wins fourth stage, closer to fourth qatar title doha, qatar (ap) - tom boonen edged closer to winning his fourth tour of qatar title when he grabbed the fourth stage ahead of tom veelers and fabian cancellara on wednesday. riding under clear skies unlike the previous day, boonen timed his sprint to perfection, winning the 90-mile stage at madinat al shamal in the northern tip of qatar. boonen also won the second stage this week and has won 20 overall in qatar. rowing women, men share billing in boat race on thames london (ap) - women will be given equal billing with men in the annual boat race between english universities oxford and cambridge, staging the women's race on the same day and the same course as the men's event starting in 2015. organizers said the races on the river thames in london will give the women's race a higher profile and some much-needed funding. the 4? - mile men's race from putney to mortlake, which was first staged in 1829, is broadcast to 200 countries. the 1.2-mile women's race gets little media attention and has been held further down the thames in nearby henley for the past 35 years. the decision to grant parity between the sexes in funding and coverage follows the path set by tennis, where equal prize money is offered at the grand slam tournaments. \"i'm thrilled that the women's boat race will be given equal parity with the men's,\" said annabel vernon, a rower with britain's national team. \"this provides a massive opportunity to grow women's rowing in this country .\" four-time olympic gold medalist matthew pinsent said its a major advance for equality in the sport. \"we have had women's events at the henley royal regatta for 10 years or so now, but this is an important step for what is one of the pre-eminent rowing races in the world and pre-eminent sporting fixtures in the world,\" pinsent said. female rowers have struggled in the shadows of the men for years, and were only allowed to race in olympics starting in 1976. \"the women's boat club doesn't have nearly the same coaching or logistical infrastructure behind them - they cycle to training, they have to run their own cars to drive to a race, they have to buy their own kit and pay for their own entry fees,\" pinsent said. \"this comes at a good time because there has been all this discussion about women in sport - it's a good moment to be welcoming them .\" female crews will be asked to row a course nearly four times the length of their usual race, providing them with a huge challenge. \"we thought about - and quickly rejected - whether it should be in any way different from the men's race,\" said <mark>robert gillespie</mark>, chairman of the boat race company. \"it's everybody's intention that it should be exactly the same .\" helena morrissey, the chief executive of women's race sponsor newton investment management group, has been the driving force behind gaining equality in the event. \"it is exciting to have the opportunity to fund a program which is making a real difference to university and women's rowing, as well as women's sport more generally,\" said morrissey, who was a cox when she studied at cambridge. this year's men's race will be held on april 7 .--steve douglas swimming phelps using hyperbaric chamber to aid recovery new york (ap) - michael phelps is the latest athlete to use a hyperbaric chamber to aid his recovery from training. the 16-time olympic medalist said wednesday he had been sleeping \"at 8,000 feet every night\" for almost a year. the 26-year-old swimmer noticed he bounced back from workouts better when he trained at altitude, so he's trying a device that simulates that. \"we've been able to realize after going to colorado springs so many times that it is something that helps me recover,\" phelps said. \"that's something that is so important to me now being older. i don't recover as fast as i used to .\" he said the chamber looked like a fish tank: \"imagine, like, a bed with a box around it .\" \"it's kind of strange, but it's good,\" phelps said during an appearance for sponsor head & shoulders. \"i don't mind it. there's a giant door at the end of my bed. the worst thing is trying to watch tv in it. i've got to watch it through plexiglas - it's blurry .\" phelps is preparing for what he says will be his final olympics this summer in london. he won a record eight gold medals in beijing in 2008. hypoxic or hyperbaric tents and chambers are used by many athletes to replicate high-altitude conditions and boost levels of oxygen-rich red blood cells. they have become popular with nfl players trying to speed their recovery from injuries. copyright? 2008. the contents of this website may not be reproduced without written"}, {"articleID": "2012031517_00008566_W", "names": {"Dan Carlson": ["Q1159022", "Q5213235"]}, "date": "2012-03-15", "url": "http://abclocal.go.com/kfsn/story?section=news/business&id=8581783&rss=rss-kfsn-article-8581783", "content": "pittsburgh--shell oil co. has chosen a site near pittsburgh for a major new petrochemical refinery that could provide a huge economic boost to the region. <mark>dan carlson</mark>, shell's general manager of new business development, said thursday that the company signed a land option agreement with monaca, about 35 miles northwest of pittsburgh. ohio, west virginia and pennsylvania had all sought the plant and offered shell major tax incentives. monaca is just 20 miles from both the ohio and west virginia borders, so workers in all three states are likely to benefit. but shell said the monaca site, currently home to horsehead's zinc factory, had the mix of resource and transportation attributes \"to accommodate facilities for a world scale petrochemical complex and potential future expansions .\" ethylene cracker plant would convert natural gas liquids into other, more profitable chemicals, which then go into everything from plastics to tires to antifreeze. shell has said that it could spend several billion dollars to build the plant, and that the complex would attract a wide range of industry and suppliers to nearby locations. but actual construction is still years away. the company said the next steps are environmental and design studies and further economic analysis, then permitting. shell's choice may ultimately represent an indication of just how strongly the industry feels about the vast gas reserves in nearby underground shale rock formations. <mark>carlson</mark> told the associated press that any plant must be economically competitive with existing plants in louisiana and texas, and even with international plants. the marcellus shale, which lies thousands of feet underground, has attracted a rush of major oil companies, who have drilled almost 5,000 new wells in the last five years. the marcellus covers large parts of pennsylvania, new york, ohio and west virginia, and drillers have also started to tap the adjacent utica shale formation. it's also an unexpected turn for the horsehead zinc smelter, the largest in the country. in september the company announced plans to shut the monaca smelter plant by 2013, and relocate to north carolina, along with most of its 600 workers. ohio and west virginia officials had made all-out efforts to attract the plant. last year west virginia commerce secretary keith burdette said, \"we intend to compete with the last breath in our body to attract one or more crackers,\" and ohio's governor reportedly flew to houston to meet with shell officials. wls: blagojevich leaves chicago for prison photos: state dinner at the white house abcnews: meat under fire for causing cancer, death"}, {"articleID": "2011061812_00007076_W", "names": {"Bill Hamilton": ["Q16145222", "Q4909286"]}, "date": "2011-06-18", "url": "http://nj.com/entertainment/music/index.ssf/2011/06/pier_sessions_in_hoboken_offer.html", "content": "joe proudman/the star-ledger singer danielle patoir of the prettiest meltdown performs during the pier sessions on the hoboken waterfront on thursday. a cool breeze wafts across the hudson river as a breathtaking view of the manhattan skyline looms in the background. the sizzle of burgers and franks on a grill fills the air with inviting aromas as bartenders serve inexpensive beer, wine and mixed drinks. throw in free live performances by some of the most talented local bands in the area, and you have the recipe for a perfect hoboken summer evening. welcome to another year of the pier sessions. the biweekly thursday night concerts started in 2010, when then-bartender lea simone and folksinger marc giannotti felt a void in hoboken after the demise of the goldhawk, one of the only venues for acoustic music in town. the series quickly became a highlight of hoboken's summer season. now in its second season, it features not only original live music but also food and crafts vendors and a full-service bar. shipyard marina, at the foot of 13th street at sinatra drive, hosts the events on a long, grass-covered pier that stretches out into the hudson. on thursday, the popular montclair-based folk-rock combo bern and the brights headlined, along with new york noise-pop quartet the prettiest meltdown and hoboken singer-songwriter marc giannotti. about 200 locals - many toting lawn chairs, blankets and small children - turned out for the event, which offers a cozy, community-oriented vibe. most of the crowd lingered after the music ended around 9:30 p.m. to socialize and enjoy the balmy weather of the early summer evening. bern and the brights' breezy, female-fronted indie pop proved an ideal match for the laid-back, communal spirit of the evening. effortlessly segueing from beguiling caribbean melodies to rootsy country-flavored folk, guitarists bernadette malavarca and catherine mcgowan took turns on lead vocals as bassist shawn fafara and drummer jose ulloa provided a flawless rhythmic underpinning. \"we had a few noise complaints at the first show we did this year,\" said emcee <mark>bill hamilton</mark>, best known as the frontman of the hoboken southern-rock band nipsey. \"i think that was mostly because it was just so windy that night. so we swung the stage around so that the band faces the river. now the people in weehawken can complain about the noise .\" he was just kidding, although, with the band facing south instead of toward the condos that line the hoboken waterfront, most of the sound dissipates over the water. and the volume was perfect - loud enough to hear all the vocals and instruments clearly, but not blaring. listeners could enjoy the performance from just a few feet away without earplugs. simone, eight months pregnant and expecting a girl around july 4, padded around the pier throughout the night, greeting fans and friends, while well-wishers implored her to get off her feet. but this is her baby, too, so to speak, and she was determined to make sure everybody was having a good time. she also ensures that the series does some good for the community; this year, volunteers are collecting donations to benefit the hoboken shelter, which provides counseling, job training, transitional housing and 300 meals daily for the homeless and underprivileged. this year's schedule includes performances by the fave, nico blues and black water on june 30; shayfer james, the porchistas and billy alpha on july 7; those mockingbirds, bern and the brights and the amboys on july 21; no pasaran, the neutron drivers and the everymen on aug. 4; and wj and the sweet sacrifice, holmes and jody raffoul on aug. 18. simone said there may be some additional shows, as well."}]