[{"articleID": "2018110210_00450644_W", "names": {"Stephen Kelly": ["Q331908", "Q7609663", "Q7609664", "Q7609665"]}, "date": "2018-11-02", "url": "http://invezz.com/news/equities/32912-Sage-share-price-outperforms-as-group-appoints-finance-chief-as-CEO-", "content": "Sage share price outperforms as group appoints finance chief as CEO Sage share price outperforms as group appoints finance chief as CEO Steve Hare to take top job at software specialist with immediate effect by Alice Young Friday, 02 Nov 2018, 10:34 GMT Shares in The Sage Group (LON: SGE) have climbed higher in today's session as the software specialist appointed its finance chief and interim chief operating officer as its new chief executive. The move came after <mark>Stephen Kelly</mark> stood down from the top job in August. As of 10:22 GMT, Sage's share price had added 3.02 percent to 566.60 p, outperforming the broader UK market, with the benchmark FTSE 100 index currently standing 0.67 percent higher at 7,162.02 points. The group's shares have given up just under 24 percent of their value over the past year, as compared with about a five-percent drop in the Footsie. Sage appoints new CEO The Sage Group announced in a statement this morning that it had appointed Steve Hare to the role of Chief Executive Officer with immediate effect. Hare joined the board in January 2014 as the group's finance chief, and was subsequently appointed to the additional post of interim chief executive officer on August 31, following the departure of outgoing CEO <mark>Stephen Kelly</mark>. The software group's chairman Donald Brydon commented that Hare had \"impressed the Board with the momentum, focus and clarity he has brought to the organisation over the last few months as COO but also throughout his tenure as CFO\". The Sage Group said that it had started a process to find new finance chief, with Hare to combine his CEO and CFO duties until an appointment was made. Analysts weigh in on move \"We welcome Mr. Hare's appointment as CEO and believe the shares will react positively to the news,\" analysts at Shore Capital commented in a note, as quoted by Proactive Investors, adding that in their view, the group was \"now unlikely to make any radical departures from the current strategy, as some had speculated, as Mr. Hare has been central to the current direction of travel\" ."}, {"articleID": "2016091511_00063250_W", "names": {"Colin Powell": ["Q150851", "Q5145485"]}, "date": "2016-09-15", "url": "http://4029tv.com/national/urgent-russia-says-us-not-fulfilling-syria-ceasefire-obligations/41676220", "content": "Text Size: ASmall Text AMedium Text ALarge Text (CNN)--Russia's Defense Ministry said Thursday that the US is not fulfilling its obligations under the Syrian ceasefire agreement, while denying accusations that its own forces have violated the pause in the conflict. In a statement, the Ministry said that US-led \"moderate opposition forces\" had increased the \"number of attacks on residential neighborhoods .\" Related The woman who saved her country from...Russian hackers release data on 25...<mark>Colin Powell</mark>: Trump is' a national...Will refugees bring Europe's terror...Typhoon Meranti makes landfall in China Tweet Tweet Copyright 2016 by CNN NewSource. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags International Comments () Print Recommended Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. Please enable JavaScript to view the comments powered by Disqus. blog comments powered by Disqus"}, {"articleID": "2013091507_00002086_W", "names": {"Richard Hammond": ["Q297265", "Q7326237"]}, "date": "2013-09-14", "url": "http://www.standard.net/stories/2013/09/14/sons-career-choice-influenced-fathers-ms-diagnosis", "content": "OGDEN - Dr. Chris Hammond's life took a new direction when his father, <mark>Richard</mark>, was diagnosed with multiple sclerosis. <mark>Hammond</mark> was serving as a missionary for The Church of Jesus Christ of Latter-day Saints when he got an urgent call from home. It was his mother telling him of his father's diagnosis. \"I had no idea what MS was, but from there on I developed an interest and decided to go into the medical side of things when I got home,\" <mark>Hammond</mark> said. <mark>Hammond</mark> went to medical school and became a neurologist so he could help his dad and many other MS sufferers. He specializes in MS and sleep disorders. \"This was the profession for me,\" he said. \"I had a lot of background and a real passion for it and because my father had MS I could relate to my patients with MS.\" <mark>Richard Hammond</mark>, 67, and a retired restaurant owner, said he is proud of his son's accomplishments. <mark>Richard</mark> began having symptoms in 1990 when his feet had the sensation of going to sleep and he was unable to move his legs. \"I was diagnosed in 1992,\" he said. \"I had an MRI done and the doctor called me on the phone and told me that he believed I had MS. He wished me good luck and told me there was nothing he could do for me .\" Things have changed since then. Today, there are 10 disease-modifying treatments that include oral drugs, intravenous medications and injections. <mark>Richard</mark> is on an oral medication that has helped keep the disease from progressing too much. \"We've made a lot of progress in understanding the disease and the immune system in regard to MS,\" said Dr. Bruce Bebo in a telephone interview from New York City. Bebo is associate vice president of Discovery Research at the National MS Society. \"The lives of people living with MS have been greatly improved through these treatments .\" MS is a chronic disease that attacks the body's central nervous system, Chris Hammond said. Approximately 400,000 Americans suffer from the disease. Symptoms vary and can be as individual as the person who has the illness, but there are some commonalities. \"Most people with MS have fatigue, heat intolerance and cognitive concerns,\" <mark>Hammond</mark> said. \"Some people have numbness and tingling, balance problems, ataxia (loss of muscle coordination) and vision, sleep and bladder problems .\" A lot of research is being done on the disease. Last week, researchers at Rutgers New Jersey Medical School said they now suspect much of the investigation into MS has focused on the wrong part of the brain and say until now, research has been done on the brain's white matter. But the new study found gray matter is far more affected by the disease. <mark>Hammond</mark> said he is confident there will one day either be a complete cure for MS or a highly effective way to manage it even better. \"We've had some early success with T-cell vaccination and there's a lot of work being done in stem cell research, he said. You Caption Cal: Which caption is best for this cartoon?\" Isn't it ironic that all you teachers receiving Fs are the ones who have been giving me As? \"- Daniel Braithwaite, Layton\" Don't worry--F is the new C. \"- Debbie Johnson, Ogden Teachers should be more aggressive if gunman in school, new theory says"}, {"articleID": "2018021814_00242777_W", "names": {"Marie Johnston": ["Q21264355", "Q48211537"], "Louise Walsh": ["Q38077351", "Q52613030"], "Brian Johnson": ["Q16194125", "Q16970531", "Q18233338", "Q18603560", "Q20639270", "Q21075786", "Q21598224", "Q28766669", "Q2924932", "Q295948", "Q4963696", "Q4964217", "Q4964218", "Q4964219", "Q4964221", "Q4964222", "Q4964224", "Q4964225", "Q4964226", "Q912414"]}, "date": "2018-02-18", "url": "https://www.irishmirror.ie/news/irish-news/health-news/irish-kids-young-10-seeking-12046585", "content": "News Irish kids as young as 10 seeking help for anxiety and self-harming <mark>Marie Johnston</mark>, who runs a mental health clinic, says the situation is \"shocking' Share By <mark>Louise Walsh</mark> 14:35, 18 FEB 2018 News <mark>Marie</mark> <mark>Johnson</mark> from SOSAD Navan (Image: Seamus Farrelly) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email A mother who runs a mental health support clinic says children as young as 10 are seeking help for anxiety and self-harming. Seven kids, aged between 10 and 15 contacted SOSAD's Navan centre in Co Meath in four months last year, many already self-harming. Previously, the centre may have experienced calls from one or two children for the entire year, according to SOSAD co-ordinator <mark>Marie Johnston</mark>. <mark>Marie</mark>, who became involved in the voluntary organisation SOSAD after her own son <mark>Brian</mark> died by suicide ten years ago, at the age of 17, believes existing resources are over-stretched and under-staffed. Read More Tipperary soccer team hopes its fight against suicide is supported by EVERY club in Ireland Describing the situation as\" shocking,' she is now appealing to the Government for more funding and resources on the matter. \"It is shocking and distressing to see children - who should be out playing and enjoying life - actually feel so down that they are thinking of dying by suicide,\" she said. \"We have seen seven children come to our office looking for support from October until Christmas last year .\" In previous years, we might have been contacted by at most one or two children for the entire year and that's still far too many. \"<mark>Brian Johnson</mark> Read More Mum of Irish teen bullied to death warns politicians they will have\" more blood on their hands' <mark>Marie</mark> said that many of the children were self-harming and suffering because of a multitude of reasons. \"Unfortunately, one size doesn't fit all. Children are stressed because of bullying or social media, bereavement or problems at home,\" she added. \"We are finding that many kids are self-harming and anxiety is a huge issue now among children and young people .\" Kids often blame themselves for fights between parents or their parents splitting up. \"Sometimes it's hard for parents to understand how their actions can have huge effects on their children .\" We need to take more responsibility to make sure that children are allowed just to be children. \"<mark>Marie</mark> went on:\" I used to wish that I had someone who would listen to me when I was trying to help <mark>Brian</mark>. Read More Heartbroken Dublin mum calls for laws on cyber-bullying after son's suicide \"I thought if I could talk to someone, then it would free up my head to think about how I could help my son more .\" Now I am that person ready to listen but I am only one of hundreds in the sector who would like to do more but can't because of funding constraints. \"Parents often can't afford the high costs of getting their child psychological help and the waiting lists at funded services can be lengthy .\" SOSAD Navan provides aid to over 90 people who walk through their doors at Cannon Row each week and they gave 4,500 hours of counselling last year. Read More Irish mum who lost two daughters and husband in murder suicide blasts mental health regulations Like us on Facebook Follow us on Twitter Daily Newsletter irishmirror Follow @ irishmirror Subscribe to our Daily newsletter Enter email Subscribe More On Meath Navan Mental health"}, {"articleID": "2009021900_00005661_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Chris Davis": ["Q1046188", "Q16233084", "Q27832670", "Q3675473", "Q42029773", "Q50658732", "Q5106363", "Q5106364", "Q5106366", "Q5106367", "Q5106368", "Q55127593"]}, "date": "2009-02-19", "url": "http://sportingnews.com/blog/FantasySourceFastball/184379?rss=1", "content": "report abuse] by bill bender experts mock draft is up for your viewing pleasure. as you can see, yours truly had the first pick. there are three top candidates for the top spot. that would be albert pujols, hanley ramirez and <mark>alex rodriguez</mark>. a rogue owner or three might take <mark>david wright</mark>, but he's the graham harrell of this group, if you know what i mean. will you take albert pujols with the no. 1 pick? most owners are in the ramirez corner, especially in light of <mark>rodriguez</mark>'s bilingual admission of using performance-enhancing drugs tuesday. i like ramirez, too. and <mark>rodriguez</mark>. having the third pick in a draft this season would be the cheap way out. all that said, i'm stick with pujols. he's always treated my teams well. he had the best numbers in three of the 5x5 categories over ramirez and <mark>rodriguez</mark>. despite the offseason elbow surgery, pujols is in the best situation right now. let me explain. ramirez doesn't have enough punch around him. dan uggla is fantastic-and-all, but how do you explain ramirez's grand total of 67 rbis in 2008? florida didn't exactly make any game-changing moves in the off-season either. (fantasy confessional: i drafted ramirez in the three-spot last season and finished near the basement of our experts league). perhaps that's clouding my judgment a bit. <mark>rodriguez</mark> no doubt is in the best lineup, but he's in the highest pressure situation of his career, possibly of all time. imagine how hard the new york press will dog a-rod if he goes 2-for-21 in the first week of april...i.e., \"<mark>alex</mark>, do you think the ball goes over the fence if you get another injection from your cousin? can madonna help?\" i'm just not in love with <mark>rodriguez</mark> as the top pick. in fact, i want to go out on a limb and say <mark>rodriguez</mark> could have his string of 11 straight 30-homer seasons snapped in' 09. i'm not comfortable with that assessment just yet. comfort comes with pujols. he has heavy hitters around him in ryan ludwick and rick ankiel. those two players averaged 31 homers and 92 rbis last season. pujols will hit 30 homers for the ninth straight season. that i can say with near-100 percent confidence. there's only one minor pang of guilt with drafting pujols. that is, you can plainly see i was able to scoop up san diego's adrian gonzalez three rounds later. having two sweet-swinging first basemen is cool. having <mark>rodriguez</mark> and gonzalez and perhaps <mark>chris davis</mark> as a corner infielder might have been the better strategy, however. but i'm not that worried. having pujols 30 seconds into the draft tends to alleviate a lot of those concerns. fantasy source fastball, written by fantasy source editors, provide timely and quick-hitting analysis of the day's news."}, {"articleID": "2012040307_00044186_W", "names": {"Richard Hamilton": ["Q159465", "Q239904", "Q313510", "Q47482457", "Q48802080"]}, "date": "2012-04-03", "url": "http://examiner.com/chicago-bulls-in-chicago/bulls-drop-two-a-row-first-time-over-a-year", "content": "the fact that the bulls (42-12) hadn't lost consecutive games since feb. 5-7, 2011 - a span of 86 games, falling 9 short of utah's record - was impressive and shouldn't be taken lightly, but the way they've dropped the past two to start the month of april is a little bit cause for concern by their standards. just one day after a humiliating nationally-televised 92-78 romping at the hands of the oklahoma, the bulls suffered a 99-93 loss to the houston rockets. in a game where they led by as much as 15 in the first half, the bulls were outplayed in the second half by a team fighting for their playoff lives. luol deng led the bulls with a game-high 24 points. carlos boozer contributed 16 points, seven assists and pulled down 13 boards, and joakim noah finished with 15 points to go along with 9 rebounds. <mark>richard hamilton</mark> returned after a 14-game absence and scored six points and turned the ball over five times in just under 20 minutes of action. advertisement bulls coach tom thibodeau said that's it's the worst two-game stretch he has seen from the team. \"i felt like we let go of the rope,\" said a frustrated thibodeau. \"usually, we're a team that has shown great fight. all year, great resolve. get down, fight back and never let go of the rope. these last two games, i felt we let go of the rope. we have to get that fight back. we have to get that edge back. right now, we're not playing well and we have to work our way out of it .\" the rockets (29-25) are one of four teams fighting for the last two playoff seeds in the western conference. after leading 51-40 at halftime, the bulls were outscored 59-42 in the second half while committing 10 of their 19 turnovers - rockets converted those into 25 points - also in the half. \"we just have to get back to the way we play, just find ways to win,\" said deng. \"we're not doing that right now .\" it's a lot of things throughout the game that we have to look at, \"he continued .\" the first thing is always defense, but it's a lot of stuff, it's a lot of things. we have to go back and see what we're not doing and try to get back to what we do. \"after being down 26-22 after the first quarter, the bulls were sparked by the\" bench mob \"as they went on a 21-6 run to start the second quarter to grab their biggest lead of the night, a 49-34 lead with 1:43 remaining, before the rockets closed the half on a 6-1 run .\" i thought we played with a great rhythm in the second quarter, \"said kyle korver .\" the ball was moving and there was a lot of energy. in the second half, we didn't have that same sense of urgency, i guess. we made some bad decision, missed some shots and tried to make plays. it was a tough half, frustrating. \"they had a couple guys really step up for them. earl boykins came in and gave them a big lift and [chase] budinger hit some three's that really got them going. they have a real balanced team and we didn't do a good enough job in the second half on them .\" the rockets used a 16-3 run in the third period to tie the score at 62 with 3:03 remaining in the period. they would outscore the bulls 31-19 in the period and lead 71-70 heading into the fourth. houston would begin the fourth on a 15-4 run, powered by three-straight three-pointers by budinger that would essentially end the game as the bulls couldn't sustain any offensive momentum. \"when you turn the ball over and you put them in the open floor and they get easy baskets, they're going to get confidence,\" said thibodeau. \"when you do that, you're making your job twice as hard and that's what we did. we beat ourselves .\" the one thing i know about this league is things change quickly, \"he continued .\" good to bad, bad to good. we have a boston team that's coming in that's playing great basketball. right now, at this time of the year, you have teams that are playing with great urgency. houston played a great game. they played hard, they fought and they're fighting for a playoff spot. every night that you come in, you have to be ready to fight. people are playing for things. you relax, let your guard down, you're going to get knocked on your ass. that's the way it is. \""}, {"articleID": "2011021002_00048827_W", "names": {"Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}, "date": "2011-02-10", "url": "http://Health-Information.advanceweb.com/Features/Articles/Leadership-vs-Power.aspx", "content": "king george iii asked benjamin west, his american painter, what george washington would do if he prevailed in the revolutionary war. west replied, \"he will return to his farm .\" the british monarch incredulously said, \"if he does that, he will be the greatest man in the world .\" on dec. 23, 1783, washington did just that and retired to mount vernon - despite the encouragement of many to stay in power. despite the willingness of americans to crown him king. in 1787, washington was coaxed back to philadelphia to attend the constitutional convention. while there he provided the leadership necessary to get the fractious delegates to settle down and complete the work of designing a new constitution. afterwards, in 1789, he was elected the first president of the united states. he reluctantly ran for a second term in 1792. he refused to run for a third term, setting a precedent that lasted 150 years, and retired once again to his farm. abraham lincoln said, \"if you want to test a man's character - give him power .\" george washington passed that test. twice in his life he walked away from power and proved that he was indeed the greatest man in the world. he demonstrated that leadership is something that you give - not take - and that power should be used responsibly. washington died in 1799, the year that napoleon bonaparte became the ruler of france. in contrast to washington, napoleon could not acquire enough power. his legendary lust for command drove him to take over much of europe. \"power is my mistress,\" he once claimed. \"i have worked too hard at her conquest to allow anyone to take her away from me .\" history is rife with stories of people who abused their power. abuse of power, however, is not just reserved for politicians and tyrants. it can be abused by managers, spouses, parents, peers and the list goes on. it is the lure of dominance over others, when it motivates people toward leadership roles, that is revealing. it reveals uncertainty, lack of confidence and fear. it is said that power corrupts, but more often than not, it is a corrupted individual who is attracted to power. it is a feeling of inferiority, sometimes called a napoleon complex, that drives someone to control other people and to micro-manage their surroundings. today we call such a person a \"control freak .\" science fiction author robert heinlein noted, \"anyone who wants to be a politician shouldn't be allowed to be one .\" when we look at abraham maslow's hierarchy of human motivation (survival, safety, social, esteem, fulfillment), we see that someone who hungers for power is stuck in the second to bottom level, which is safety. a true leader has self-esteem and self-confidence and does not seek power to bolster his or her feeling of self worth. <mark>thomas jefferson</mark> observed that, \"an honest man can feel no pleasure in the exercise of power over his fellow citizens .\" a true leader is motivated by a goal-a goal common to his group whether that group is a company or a country. if you find yourself attracted to leadership, stop and check your motivation. are you driven to share your gift of understanding in the endeavor of achieving a goal, or are you motivated by perquisites of position and the power you have over others? as john quincy adams said, \"if your actions inspire others to dream more, learn more, do more and become more, you are a leader .\" to prevent comment spam, please type the code you see below into the code field before submitting your comment. if you cannot read the numbers in the below image, reload the page to generate a new one."}, {"articleID": "2016021821_00726288_W", "names": {"David Johns": ["Q1174880", "Q20746766", "Q5235686", "Q56107493"], "Sandro Galea": ["Q18062123", "Q55471743"]}, "date": "2016-02-18", "url": "http://www.atlasobscura.com/articles/why-the-science-of-salt-is-as-polarized-as-politics", "content": "Why the Science of Salt is as Polarized as Politics Close your eyes and spin the globe. what: (Photo: Dubravko Sorić / Flickr) To salt or not to salt is a question most humans think about at least a few times a day, even if we remain puzzled over the health effects. And if you think you've seen conflicting studies on whether salt is killing you, you're not imagining things. Researchers reviewing over 35 years of academic reports and studies said Thursday that the community of scientists studying salt intake among humans is sharply divided, and unlikely to come to any definitive conclusions soon. While the scientific literature is slightly in favor of people reducing salt intake--around 54 percent of reports said humans would probably be healthier if we did--another third said it may not matter, while a handful more were inconclusive, researchers said. Worse, they found that the scientists who disagree hardly ever collaborate, instead citing papers that tend to square with their point of view. Much of the research also had a strong bias toward the status quo. \"There are two almost distinct bodies of scholarship--one supporting and one opposing the claim that salt reduction in populations will improve clinical outcomes,\" says <mark>David Johns</mark>, who co-authored an article outlining the findings in the International Journal of Epidemiology. \"Each is driven by a few prolific authors who tend to cite other researchers who share their point of view, with little apparent collaboration between the two sides .\" Scientists also can't agree on what counts as evidence, while a number of the observational studies were hurt by methodological defects. In other words, the jury's still out on salt, and we probably shouldn't expect a definitive answer anytime soon. \"We pay quite a bit of attention to financial bias in our work,\" says <mark>Sandro Galea</mark>, another article co-author. \"We seldom pay attention, however, to how long-held beliefs bias the questions we ask and the results we publish, even as new data become available .\" "}, {"articleID": "2014032909_00035534_W", "names": {"Jimmie Johnson": ["Q217238", "Q6199355"], "Joe Gibbs": ["Q1254455", "Q22959236", "Q2331580", "Q25713948"]}, "date": "2014-03-29", "url": "http://ohio.com/sports/motorsports/nascar-kyle-busch-wins-pole-at-martinsville-speedway-1.476821", "content": "MARTINSVILLE, Va.: Kyle Busch has seen it time and again at Martinsville Speedway. Driving down pit road, heading back onto the track and in contention for the lead, Busch is used to seeing the pole-sitter gun the engine just off the jack and reassume the race lead. Busch hopes to finally get to experience that for himself at Martinsville Speedway on Sunday after earning the pole on NASCAR's smallest, tightest track for the first time in 19 career starts. \"I think that's a great thing for us,\" Busch said after winning the pole with a lap at 99.674 mph. \"We get to pit there and of course drop the jack and just lunge across the line and be good .\" You need to still run up front all day. I think that it's a great opportunity for us to pick up some spots say if we're second, third, fourth, whatever, but you definitely always want to stay as close to the front as you can and try not to use that box as much as some guys have in the past. \"The pole is the 14th of Busch's career. In an interesting twist under NASCAR's new knockout qualifying system, Busch won it while Joey Logano set a track record. That came at 100.201 mph during the first phase of two-session qualifying. All 44 cars competed in the 30-minute first session, and the top 12 moved into the 10-minute phase two. Denny Hamlin earned the No. 2 starting spot with a lap at 99.548 mph, and will be followed on the starting grid by Logano and Hendrick Motorsports teammates <mark>Jimmie Johnson</mark> and Jeff Gordon. That puts Busch in some pretty accomplished company because Hamlin (4), <mark>Johnson</mark> and Gordon (8 each) have won a lot. Busch, though, is coming off a victory last week at Auto Club Speedway in Fontana, Calif., and while he said it wasn't dominating, it gave him hope that the <mark>Joe Gibbs</mark> Racing teams are coming together .\" It just seems to be working well right now, whatever is working, \"he said. Hamlin, who promised earlier in the day that he would win on Sunday, wasn't in love with the outside starting spot because it can be tricky to get down to the bottom on restarts from the outside. He said nothing that happened in practice or qualifying made him change his view of how it can all unfold .\" I knew, even going into this weekend, I knew we were going to be really good contenders and be in the mix anyway, \"he said .\" I feel like after running a couple laps of practice I felt like this was a car that was capable of winning. I think with tire management being more of a factor than it's ever been, it kind of lends itself to my driving style even more. For that reason I think we'll be tough on Sunday. \"Logano has two top-10 finishes on the 0.526-mile oval, but none since 2010 .\" So we've got a track record, but we don't have a pole. How does that work? \"he asked. A solid pit position, he said, could help turns things around on Sunday .\" Obviously, the pit stall is very important, especially here. It's a dangerous pit road, so you want to get a nice spot you can get in and out of, but obviously here it's a slow pit road and you can make up a lot with timing lines on pit road, \"he said. Danica Patrick qualified 10th, her best starting spot in a race not held at Daytona. Her previous best starting position was 21st, accomplished twice last season. Hamlin returns Being told he couldn't race last weekend because of an eye and vision problem will not make Hamlin less likely to seek the help of medical staffs available at NASCAR tracks every weekend, he said Friday. Hamlin let Sam Hornish Jr. drive his car last weekend at Auto Club Speedway after he sought the assistance of the on-site medical team when his face swelled up and his vision blurred. Initially thought to be a sinus infection, it turned out to be a small piece of metal in his eye, Hamlin said at Martinsville Speedway. Hamlin said he doesn't blame the two doctors who examined him for failing to see the rusting metal, and it wasn't until he saw an optometrist that it was discovered, removed, and he started feeling better .\" It took someone who was in the business of eyes to find it, \"he said. Hamlin was cleared to return this weekend and he took umbrage at the notion that his reputation might have been tarnished when he missed the race .\" People who think negatively of me or think that we side-stepped some sort of drug test or something is ridiculous, \"he said, adding that he was making an effort not to get angry at the suggestion that something untoward was afoot .\" I'm in one of the top-three cars in NASCAR. I would have to be an absolute moron - moron - to risk that. \"Dale Earnhardt Jr., who originally said he was concerned about Hamlin's point of view about how he wound up being told he couldn't race, said his concern wasn't for the medical team's competency, but for his fellow driver .\" I feel great about the process and what NASCAR has had in place for years, \"Earnhardt said."}, {"articleID": "2015021318_00015677_W", "names": {"Todd Richards": ["Q2438502", "Q7812590"]}, "date": "2015-02-13", "url": "http://bluejackets.nhl.com/club/news.htm?id=753226&cmpid=rss-mixer", "content": "Notebook: Wisniewski returns, top line reunited vs. Flyers With both teams in similar situations, Blue Jackets coach <mark>Todd Richards</mark> said it's not hard to predict what type of game will be played tonight against the Philadelphia Flyers. will be honored with a pre-game ceremony celebrating his 1,000 th career game, which was Monday night against the Los Angeles Kings. The NHL will present Hartnell with a silver stick to commemorate the milestone, and the Blue Jackets will have a presentation, as well - but <mark>Richards</mark> said once the ceremony is over, his team must be ready to play against a team that's also desperate for points. \"We can't get caught up in the ceremony and what's going on,\" <mark>Richards</mark> said. \"It's great to honor (Hartnell), but once that ends, we have a job to do and we have to be ready for the start of the game. There's lots of former teammates (on both sides), the trades, ceremony, both teams desperate for points and they're Philadelphia, too. The Blue Jackets are about to embark on a stretch in which they play 11 games in 19 days, including a five-game trip through the Eastern Conference that includes four games against teams in the Metropolitan Division. But regardless of who they're playing and what the situation is, the Blue Jackets don't have a choice but to approach each game the same way and try to rack up points .\" Nothing changes from what I've said a week, two weeks, three weeks ago - it doesn't matter who we're playing, it's two points and we have to go out and get two points, \"<mark>Richards</mark> said .\" We have to win as many games as we possibly can; it doesn't matter if we're playing the LA Kings, Philadelphia, the Islanders...we're going to face some really good teams in tough environments because we're going on the road. To me, every game is just as critical as any other game. \"RETURN OF THE WIZ After missing the previous two games with a lower body injury, will return to the lineup tonight and give the Blue Jackets a boost on the back end. It's been a freakish stretch for Columbus on the blue line, going from having nine healthy defensemen when the sun came up last Friday to then having only six on Sunday morning. and Wisniewski to injuries a week ago against St. Louis, and then, suffered an upper body injury Saturday in Ottawa. Prout won't play tonight but he's not far off, and Wisniewski will certainly aid the Blue Jackets' power play which has scored one goal in its last 19 chances, but has only had five man advantage opportunities in the last four games. gets the call in goal tonight, his 50th appearance as a Blue Jacket after signing as a free agent two seasons ago. McElhinney is 6-3-0 in his last nine starts and is coming off a 40-save performance in defeat Monday night against the Kings, but prior to that, he was very strong in back-to-back wins over the Blues and Senators .\" Sometimes you're thrust into that role and that's just the circumstances, \"<mark>Richards</mark> said .\" He's done a good job for us, and he had a tough stretch (earlier in the season) just like everyone has tough stretches as players. I think he's responded, he's rebounded and he's back at that level where he's winning games or he's giving us a chance to win games. \"It was no different against LA on Monday - I know we gave up four goals but a couple of them were just slam-dunks or tap-in goals into empty nets because we didn't do the job around him .\" NHL.COM NEWS Friday, 02.13.2015 / 12:30 PM By Kinsey Janke Friday, 02.13.2015 / 3:00 AM"}]