[{"date": "2014-05-18", "url": "http://www.miamiherald.com/2014/05/17/4123198/cards-miller-drop-braves-4-1.html", "content": "ST. LOUIS--ST. LOUIS_There was more to his reboot at Class AAA Memphis for speedy infielder Kolten Wong than just getting regular playing time and relocating his swing. He had a chance to reacquaint himself with his feet. On Saturday, he introduced them to the St. Louis Cardinals. Sparks flew. Wong led the Cardinals' fast-forward offense with two bunts for base hits, a stolen base, a forced error, two runs, and a key run on a sacrifice fly. The rookie second baseman's footprint was all over the Cardinals' first three runs as they cruised to a 4-1 victory against Atlanta at Busch Stadium. Starter Shelby Miller authored seven innings and his sharpest start of the season to compel the Cardinals to their fourth consecutive victory, tying the longest winning streak of the season. \"Going back down I realized I wasn't doing much with my feet,\" Wong said. \"When I came back I wanted to make sure that speed was a main element to work with. Even though my swing is coming around I still have to make sure that people know I can run, that I can do things with my feet. That's what I'm here for .\" As the Cardinals look for the offense they expect to have, an injection of footspeed gives them the chance to push for runs until the lineup revs to life. With Wong and Peter Bourjos, the two fleetest of Redbirds, getting more regular playing time this weekend against the Braves, they've had the chance to show another way to provide runs for a team lacking in power. The only Cardinals to have multiple hits in the game, Wong and Bourjos combined for four bunt singles. The Cards are the first team since Detroit in September 2003 to have four bunt base hits in a single game, according to the Elias Sports Bureau. The win \"was one of the best representations of what speed can do for us,\" manager Mike Matheny said. \"How guys made things happen and then getting on base and creating havoc ....I think it just gives us more weapons. Days when we can sit back there and slug, I'd like to see us slug. Days when we've got a tough pitcher like (Atlanta's Aaron) Harang that's not giving us a lot, we have to figure out a way to manufacture and that's what we did. It was fun to watch the guys use their gifts .\" Hours before first pitch, Matheny sat in his office and described how the club's frustration stemmed not from an inability to play individual games at their best but \"to replicate that on a consistent basis or a semi-consistent basis .\" The unsteady start to the season has been a long tease for the Cards, who have been unable to build winning streaks because of ragged play - at the plate, on defense, or, more recently, on the mound. The Cardinals go for a sweep of the Braves Sunday, with Jaime Garcia making his first start in a year, because of two of their cleanest and best games of the season. While Wong's speed provided the runs and embroidery on the second win in as many days against first-place Atlanta, it was another teammate finding his pace that was the core of the Cardinals' more-complete game. Miller (6-2) has scuffled in recent starts because his mechanics falter or fail him in the middle innings. After consultation the past week with pitching coach Derek Lilliquist, Miller increased his tempo on the mound Saturday and had his best variety of pitches. During one at-bat against Braves slugger Evan Gattis, Miller flipped four breaking balls. He had downward movement of his fastball and maintained the horsepower to elevate for three consecutive strikeouts on 93-mph fastballs in the fourth inning. Miller struck out seven and completed seven innings for only the second time in his past 29 starts. \"Most of our guys work quickly,\" Miller said. \"That was one of the main focuses. Try to stay in the zone and throw strikes and everything works out. The biggest thing is trying to get outs as quick as possible .\" The only run Miller allowed was unearned because of an error from Wong. He threw wild to third base as the Cardinals pressed for an out in the second inning on a single to left field. Rather than lament the outcome, Matheny lauded the idea, calling it \"an aggressive play .\" In the fifth inning, Yadier Molina jumped on a bunted ball that appeared to be foul and spun a double play that unplugged the Braves' rally. Atlanta manager Fredi Gonzalez was ejected for arguing the call, though he came out two more times after the ejection to keep fuming. \"Aggressive plays\" are the type of things Matheny has urged to jar the Cardinals from their funk. The Cardinals entered Saturday as one of the lowest-scoring teams in the majors, complete with the fourth-lowest slugging percentage (.362) and second-fewest homers (23). Speed offers them a way to rewire the offense. Behold the power of the right bunt. \"When I'm not feeling that great at the plate, you drop a bunt down and get a hit out of it,\" Bourjos said. \"It can affect a lot of games. It's not always there, but when it is, take advantage of it. And then, sure enough, you get your swing going and I don't feel like bunting. It can hold you over for a little bit .\" Wong led off the fourth with a drag bunt against Harang (4-4). He scored from third when second baseman Tyler Pastornicky faded to shallow right and caught Yadier Molina's fly ball instead of right fielder and better arm Jason Heyward. Wong said he likely wouldn't have tried to score and tie the game had Heyward caught the ball. In the sixth, Wong meant to bunt <mark>Matt Carpenter</mark> into scoring position, but ran it out for a base hit. He tried to steal second and Gattis' throw went to center. <mark>Carpenter</mark> scored to break the 1-1 tie, and Wong followed on Allen Craig's RBI single. The only Cardinals run Wong didn't influence came in the seventh, again on a bunt. <mark>Matt Adams</mark> tripled and then scored on a safety squeeze bunt by Bourjos. Trevor Rosenthal collected his 13th save with a flawless ninth. Now, the Cardinals can see how far they can run with their best stretch of baseball. \"That starts things. That's how baseball is - one little thing can start a rally,\" Wong said. \"When you get two bunts for hits in one game, you know things are going right .\" ", "articleID": "2014051811_00026594_W", "names": {"Matt Carpenter": ["Q2351564", "Q6788447"]}}, {"date": "2014-05-18", "url": "http://www.freep.com/article/20140518/COL06/305180076/1081/col", "content": "U.S. House candidate David Trott made millions in mortgage crisis Farmington Hills attorney David Trott has made a fortune on foreclosures in Michigan by buying up,...U.P. community wonders if land sale to mining giant is worth the price The Michigan Department of Natural Resources is considering the largest sale of state-managed...Nominations for Shining Light service awards accepted until June 27 Nominations for the 2014 Shining Light Awards, sponsored by the Detroit Free Press and the...Rochester Hills group sues to block drilling for oil, gas under city parks The minimum wage debate is the equivalent of stretch pants. It takes on the shape of the user. Jeff Seidel: New Pistons boss Van Gundy fascinating, funny, honest to a fault Self-deprecating. Funny. Genuine. Personable. Honest to a fault. That's Van Gundy. Detroit 6, Boston 1: Porcello wins sixth straight as Tigers roll Right-hander Rick Porcello made perhaps the most impressive road start of his career and put the...Yoga, once viewed as a counterculture practice, has gone mainstream and everyone from celebrities...<mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust <mark>Tom Walsh</mark> talked with Ziebart CEO <mark>Dan Baker</mark> about rebranding of the old Troy-based franchising...Wells Castle, survivor of Detroit's elegant age, seeks new tenant Only a handful of these sumptuous residences are still around. Metro Detroit's 2014 summer music season is marked by some monster stadium shows and big-time...Lady Gaga brings hits, inspiration for long-waiting Detroit fans It had been nearly four years since we'd seen Lady Gaga on a metro Detroit stage. Creative costumes: Guests bring Motor City Comic Con characters to life Day two the 25th Motor City Comic Con saw thousands of anxious comic fans of all ages converge on...Civil rights leader Myrlie Evers-Williams recognized for her own work as a leader, not just as...At 20, Kelly Rothe is one of countless metro Detroit women who are fighting or fending off cancer...Springtime brings two words to mind: light and refreshing. Fresh rolls embody both. Kristen Jordan Shamus: Prom dreams come true for teens with life-threatening illness Reimagining Detroit: Fixing our roads means more than patching potholes As the city prepares to deal with its vacancy problem of tens of thousands of empty lots, we could...As a pastoral minister to the Hispanic community in metro Detroit, I know people who have...Raw Data: Michigan is dead last for highway expenditures per capita Michigan ranks last among the 50 states in per capita road expenditures, with spending of $135 per...Business leaders: It's time for Michigan to stop discriminating against gay people (guest column) Ziebart rustproofing back in vogue The longevity of vehicles and car ownership has reinvigorated demand for rustproofing from Ziebart, a company forced to reinvent itself in the late 1980s after automakers improved factory undercoating process and started offering 100,000 mile anticorrosion warranties .? Headquarters: Troy? Founded: 1959? Employees: 100 corporate employees; independent franchisees own and operate all but 12 of 400 Ziebart locations worldwide? Famous slogan: \"It's us or rust\" ? Main products and services Folks at Ziebart International headquarters in Troy, like most Michigan residents, don't enjoy dodging potholes or flying road debris in the aftermath of the state's harshest winter in memory. But if you want to protect your car or truck from salt pellets and crumbling chunks of pavement, Ziebart would love to help. In fact, the 55-year-old Ziebart franchising firm just happens to be launching a new paint protection clear film called Z-Shield, the latest in a growing line of products and technologies devised to protect a vehicle inside and out. The Z-Shield launch, under way now at Michigan locations, is something of a kickoff for a global rebranding of Ziebart, a name still best-known for the automobile rustproofing invented by Kurt Ziebart in the late 1950s, which morphed into a franchise network in the 1960s. Today Ziebart has 400 locations in 32 countries, offering dozens of products and services ranging from antibacterial treatments for car interiors to spray-on truck bed liners, automotive glass repair, window tint and scratch and scuff repair services. Like many companies where the initial products later become commoditized or outdated by advancing technologies, Ziebart - whose memorable slogan was \"It's Us or Rust\" - has wrestled with its legacy as a rustproofing outfit. Today, said President <mark>Dan Baker</mark>, only about 20% of Ziebart's $135 million in worldwide sales come from rustproofing, compared with more than 70% a couple decades ago. Ziebart rustproofing was a popular aftermarket service for car owners in the 1960s and '70s, but auto manufacturers improved their undercoating at the factories - and in 1987 General Motors, Ford and Chrysler all began offering 100,000-mile anti-corrosion warranties. <mark>Baker</mark>, who joined the company in 1988, is proud of Ziebart's longevity - the average franchisor lasts only seven years, he said - but admits the firm wrestled with a midlife identity crisis for awhile. \"We went through a period of trying to be everything but rustproofing,\" he said, but the eventual lesson learned was \"to embrace who we are, a trusted brand .\" In a nutshell, the message is still a simple one about protection: Come to Ziebart to keep your car looking, and even smelling, like new. Along with coatings and films to protect the vehicle's exterior, Ziebart shops offer interior detailing packages that include cleaning, stain removal and Germ Defender antibacterial coatings. Touting the virtues of a changing array of new technologies and products is the job of Lisa Walega, Ziebart's marketing director whose team has grown from two to eight people in recent years. This summer, she said, a new website is planned, along with an expanded social media presence. All in all, Ziebart has about 100 corporate employees who are all part-owners; an employee stock ownership plan (ESOP) structure was adopted in 1994. All but 12 of its retail stores are franchisee-owned. The company-owned stores, including three in the Detroit area, are used for technology research and testing of new products and tweaks to the business model. Interestingly, amid a steady rollout of new technologies, <mark>Baker</mark> said Ziebart stores have experienced an uptick in orders the past few years for the company's original staple product, rustproofing. What's driving that? Cars and trucks are lasting longer. People are keeping them longer. And car-loan terms have stretched to 84 months. It's a good thing, apparently, that Ziebart didn't abandon its roots in rust. Detroit 6, Boston 1: Rick Porcello wins sixth straight as Tigers roll U.S. House candidate David Trott made millions in mortgage crisis Detroit Lions rookie Larry Webster looks promising with his raw ability at defensive end <mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust Jeff Seidel: New Pistons boss Van Gundy fascinating, funny, honest to a fault Lady Gaga brings hits, inspiration for long-waiting Detroit fans <mark>Tom Walsh</mark>: Ziebart rebrands but doesn't abandon its roots in rust <mark>Tom Walsh</mark> talked with Ziebart CEO <mark>Dan Baker</mark> about rebranding of the old Troy-based franchising company best known for rustproofing car underbodies (\"It's Us or Rust') - until all the carmakers did Detroit 6, Boston 1: Rick Porcello wins sixth straight as Tigers roll U.S. House candidate David Trott made millions in mortgage crisis Detroit Lions rookie Larry Webster looks promising with his raw ability at defensive end Scientists in Argentina unearth the biggest dinosaur ever discovered U.P. community wonders if land sale to mining giant is worth the price U.S. House candidate David Trott made millions in mortgage crisis U.P. community wonders if land sale to mining giant is worth the price NBA draft: Kentucky prepared Rochester's <mark>James Young</mark> for jump to pros May 17 roundup: L'Anse Creuse North, SH Stevenson baseball wins a pair State rules could cut down on concession options for high school boosters", "articleID": "2014051818_00017991_W", "names": {"Dan Baker": ["Q16146280", "Q17305661"], "James Young": ["Q18985605", "Q43915246", "Q51589165", "Q57193449", "Q6145950", "Q6145951", "Q6145960", "Q6145967", "Q6145972"], "Tom Walsh": ["Q16886418", "Q19586386", "Q19664158", "Q20984602", "Q21061744", "Q2440190", "Q37380700", "Q55362473", "Q7817978", "Q7817979", "Q7817980"]}}, {"date": "2014-05-18", "url": "http://wunc.org/post/american-story-it-was-reported-rest-nation", "content": "Judge: Law Repealing Teacher Tenure Is Unconstitutional Political Junkie Ken Rudin Talks NC Congressional Races, Legislature's Short Session Fletcher Fellow for Education Policy Reporting <mark>Jorge Valencia</mark> Capitol Reporter A display of America's first ethnic newspapers at the Newseum's new exhibit, \"One Nation With News For All .\" The exhibit opened on May 16 and runs through Jan. 5, 2015. Puck magazine mocked immigrants and minorities. \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477599.jpg \"class =\" noexit lightbox \"> In the late 19th century, editorial cartoons such as this one from These press passes were used by leading ethnic journalists, including Korean American reporter K.W. Lee and Spanish-language news anchors Mar? a Elena Salinas and <mark>Jorge Ramos</mark>. The Chicago Defender, a leading black newspaper, throughout the South, helping to promote the Great Migration of blacks to the North .\" href = \"http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477607.jpg\" class = \"noexit lightbox\" > This stepstool was used by Pullman porters, black railroad sleeping car attendants in the early 20th century. The porters spread copies of A display of America's first ethnic newspapers at the Newseum's new exhibit, \"One Nation With News For All .\" The exhibit opened on May 16 and runs through Jan. 5, 2015. powerful photo essay on racial segregation in the United States was published in this Sept. 24, 1956, issue of Life magazine \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477613.jpg \"class =\" noexit lightbox \"> On display in the exhibit, Gordon Parks' Ethnic newspapers became advocates for their communities by fighting biases that stereotyped them as second-class Americans. Pensylvanische Berichte aimed at the growing immigrant population, was founded in 1746 and became one of America's first successful ethnic newspapers. This 1751 issue reported on the death of Frederick, Prince of Wales .\" href = \"http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477619.jpg\" class = \"noexit lightbox\" > The German-language newspaper Pensylvanische Berichte aimed at the growing immigrant population, was founded in 1746 and became one of America's first successful ethnic newspapers. This 1751 issue reported on the death of Frederick, Prince of Wales. The North Star, founded in 1847. \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477578.jpg \"class =\" noexit lightbox \"> The first draft of American history has many authors. And they include journalists from ethnic media: newspapers, websites, radio and TV stations dedicated to reporting news for immigrant and ethnic communities. A new exhibit called\" One Nation With News For All \"opening this weekend at the Newseum in Washington, D.C., explores the role ethnic media has played since the country's founding. Sharon Shahid is the lead writer of the exhibit, which features some unexpected icons of American history. Like Abraham Lincoln, who owned a German-language newspaper. Shahid says Lincoln bought the paper to court German-American voters in Springfield, Ill.. More than a century earlier, the country's first German-language newspaper was founded in Philadelphia by Benjamin Franklin. A video in the exhibit shows journalists and artists reading excerpts from some of the country's oldest Latino, Native American and Asian-American publications. They often served as the main outlets for the unique perspectives of each community. Shahid says that's especially true for new immigrant groups .\" What they did in establishing their newspapers and their radio stations, it was a very American thing, \"she says .\" They served as a bridge between the old country and the new country, and that's what helped them become American. \"Within the African-American community, ethnic media gave voice to the long struggle to be recognized as equal citizens .\" If it was in Jet, it was correct! \"says visitor Chester McCoy, a social worker whose family lived in St. Louis. The exhibit nods to this history with displays of Frederick Douglass' pocket-watch and the diary of Ida B. Wells, another early civil rights pioneer who published an African-American newspaper. But it was a photo of a chubby-cheeked teenager that caught McCoy's eye. It was in Jet that many African-American readers saw the mutilated body of 14-year-old Emmett Till. His murder in 1955 helped galvanize the civil rights movement .\" So I was a little kid, and I'm looking at it, not understanding it cause I'm not reading at that age, \"McCoy says .\" But I look at the pictures and I make this connection: He's black. I'm black. \"Beverly Cumbo, a retired tour guide from Brooklyn, N.Y., also recalled seeing Till's murder in the media .\" It's very emotional, and I have very vivid memories of Emmett Till and the newspaper clippings at that time, \"she says. African-American magazines and newspapers have always been a staple in Cumbo's media diet. Since the Internet age, Shahid says the growth of ethnic media means even more choices .\" They've multiplied, \"she says .\" You can't even keep up with them anymore. They've got a worldwide audience now. \"An audience for the diverse voices that make up the American story .\" One Nation With News For All \"is on display through Jan. 4, 2015.", "articleID": "2014051900_00020842_W", "names": {"Jorge Ramos": ["Q1981462", "Q56808142", "Q6278531"], "Jorge Valencia": ["Q10517881", "Q59157499"]}}, {"date": "2014-05-20", "url": "http://www.guitarworld.com/acoustic-nation-watch-mutual-benefits-lets-play-statue-of-man-video", "content": "Nikki Sixx Discusses M? tley Cr? e's Future and Past, When \"Debauchery was King - and We Embraced It\" <mark>Jimmy Page</mark> Discusses \"Evil Sounds\" Heard on New Led Zeppelin Re-Issues Interview: Billy Duffy of The Cult Answers Readers' Questions on Gear, Songwriting and More In Deep with Andy Aledort: Unraveling the Mysteries of Chicago and Texas Blues Shuffles, Part 1 Video Lesson: Slash Shows You How to Play Guns N' Roses' \"Paradise City\" Chop Shop with John 5: A Country-Influenced Application of Hybrid Picking for Blues and Rock Mutual Benefit Announces 2014 Tour and New Album, \"Love's Crushing Diamond' <mark>Jordan Lee</mark>'s Mutual Benefit has debuted a new video for\" Let's Play / Statue of a Man. \"Directed by Stefan Grabrowski, the video was shot over the span of 6 months in and around Boston using mostly analog equipment and some experimental developing techniques. The resulting images have a frenetic, but also organic quality to them evoking the very personal and soul-searching nature of the song. As described by <mark>Jordan</mark>,\" I think Stefan really captured the spirit of the song by finding the beauty of rusted train tracks and flooded ponds and mashing it all together into a colorful mess. \"You can catch Mutual Benefit throughout the UK and North America this summer. They'll be touring the Northeast with Wild Beasts and playing a bunch of festivals, including the Pitchfork Music Festival, NXNE, Hopscotch, Pygmalion, Way Out West, Green Man, amongst others. Tour Dates: Mon.. May 19 - Dublin, IE @ Workmans Club Tue.. May 20 - Manchester, UK @ Deaf Institute Wed.. May 21 - Glasgow, UK @ Mono Thu.. May 22 - Leeds, UK @ Brudenell Social Club w / Hospitality Fri.. May 23 - London, UK @ Union Chapel Sat. May 24 - Utrecht, NE @ Le Guess Who? Festival Sun. May 25 - Diksmuide, BE @ 4AD Sat. June 14 - Rehoboth Beach, DE @ Dogfish Head Mon.. June 16 - Rochester, NY @ Water Street Music Hall Wed.. June 18 - Toronto, ON @ NXNE @ Legendary Horseshoe Tavern Thu.. June 19 - Buffalo, NY @ Iron Works Sat. June 21 - Northampton, MA @ Iron Horse Sun. June 22 - Providence, RI @ Columbus Theatre Thu.. July 10 - New York, NY @ Pier 84 w / Wild Beasts Fri.. July 11 - Philadelphia, PA @ Union Transfer w / Wild Beasts Sat. July 12 - Washington, DC @ 9:30 Club w / Wild Beasts Mon.. July 14 - Cambridge, MA @ The Sinclair w / Wild Beasts Tue.. July 15 - Montreal, QC @ Corona Theatre w / Wild Beasts Sun. July 20 - Chicago, IL @ Pitchfork Music Festival Thu.. Aug. 7 - Oslo, NO @? ya Nights - Caf? Mono Fri.. Aug. 8 - Gothenburg, SE @ Way Out West Wed.. Aug. 13 - Birmingham, UK @ Hare and Hounds Fri.. Aug. 15 - London, UK @ Jabberwocky Festival Sat. Aug. 16 - Brecon Beacons, UK @ Green Man Festival Sun. Aug. 17 - Brighton, UK @ Proud Cabaret Thu.. Sep. 4 - Sat. Sep. 6 - Raleigh, NC @ Hopscotch Festival Thu.. Sep. 25 - Sat. Sep. 27 - Cincinnati, OH @ MidPoint Music Festival Guitar World's Paul Riario Demos Ernie Ball Aluminum Bronze Strings - Video Fingerstyle Arrangement of Pink Floyd's\" Comfortably Numb, \"Filmed with Guitar-Mounted Camera - Video Exclusive Stream: Sevendust\" Time Travelers & Bonfires' Premiere", "articleID": "2014052021_00129225_W", "names": {"Jimmy Page": ["Q10426092", "Q165467"], "Jordan Lee": ["Q15624487", "Q27983275", "Q30602316"]}}, {"date": "2014-05-21", "url": "http://www.pr.com/press-release/559229", "content": "LeaderOne Financial Announces Hire of Patti Dieu, Sr.. Mortgage Banker)--LeaderOne Financial, one of the nation's fastest growing mortgage companies, is proud to announce the hiring of Patti Dieu, who will serve as a Senior Mortgage Executive within the organization. Ms. Dieu will be located in the organization's O'Fallon, Illinois office. \"My mission is to provide comprehensive mortgage solutions to all of my customers, with the highest degree of trust, knowledge, respect and convenience,\" says Ms. Dieu. The opportunity to work for a quickly growing national leader in the field, combined with the ability to continue serving the community she's help build, has Ms. Dieu feeling optimistic. \"I have been in the business for a long time. I have seen lots of changes, and I feel it's only going to get better from here .\" Ms. Dieu's long history in the mortgage banking and finance industry, along with her longstanding community ties, make her an ideal fit for LeaderOne, which originated nearly one billion dollars in loans throughout 2013. \"I was born and raised in St. Louis,\" says Ms. Dieu, \"and attended Southern Illinois University Edwardsville, as well as Wichita State. After I married, I moved to the Illinois area and have been here ever since .\" And taking care of her community has been a priority for Ms. Dieu for nearly thirty years. \"I started in the business in 1985 as a loan processor. Back then, you had to submit your loans to the agencies, VA/FHA, directly by mail. It could take months to get loans closed. In order to be successful you had to be top of the game. Rates are very important to our customers, but without knowledge and trust, you will not gain their confidence or respect. A good loan officer knows how to get the job done! There is nothing I hate more than hearing a loan officer say to a customer,' I am not sure why we need this, but my underwriter is asking for it .' Yikes!\" With LeaderOne recently having been named one of the top one hundred mortgage companies in America by Mortgage Executive Magazine, Ms. Dieu is ready to \"hit the ground running\" with one of the fastest growing leaders in the industry. \"The future for this industry is bright,\" she states. During her time off, Ms. Dieu and her husband have a small plane and are building another one. \"We hang out with a group of pilots with their own planes, and we like to take mini getaway trips over the weekends. We fly around to hear musicians, attend concerts and hit up the wineries .\" About LeaderOne: LeaderOne is a full service mortgage banking operation with over twenty years of experience. Located in Overland Park, Kansas, LeaderOne has seen incredible growth during recent years due to its insistence on fair and honest business practices. Contact: <mark>Brett Butler</mark> National Marketing Manager", "articleID": "2014052114_00038561_W", "names": {"Brett Butler": ["Q292073", "Q4962098", "Q4962101", "Q4962106"]}}, {"date": "2014-05-21", "url": "http://www.standard.net.au/story/2298439/denningtons-st-johns-primary-school-gets-the-finishing-touches/?src=rss", "content": "h1 itemprop = \"name\" > Dennington's St John's Primary School gets the finishing touches THE final classrooms are ready for pupils at St John's Primary School in Dennington after seven years of planning and millions of dollars in work. THE final classrooms are ready for pupils at St John's Primary School in Dennington after seven years of planning and millions of dollars in work. Principal Kathy Dalton, who has led the school for 21 years, couldn't hide her happiness yesterday as pupils, politicians and parents filed in. \"It's a great school, we're very lucky. Not everyone gets the chance to build a new school,\" she said. \"It's a once in a lifetime thing .\" Even though pupils moved into the newest building last year, the final touches were only added on Tuesday. The principal pointed to two new classrooms, freshly carpeted with blank walls - yet to be wallpapered with student art and posters. \"They were finished just last night. Grade five and six will move into those classrooms in the coming weeks,\" Ms Dalton said. \"We purchased the land in 2007 and the building began in 2008 and we moved into the first stage in 2011 .\" The building has been something that we've been doing on a journey. \"The long-serving principal may need to take up gardening with the major project behind her. But she didn't rule out bigger plans as the school undergoes a\" rapid \"increase in enrolments. There are 220 youngsters enrolled at the Catholic school .\" We're a school with an increasing enrolment - rapidly, so who knows, \"Ms Dalton said. The school left its former site on Raglan Parade in 2011, with the vacant site sold to a Geelong-based church this week. A delay in the flight of special guest, Senator <mark>Scott Ryan</mark>, also caused a few laughs as Wannon MP Dan Tehan decided to take over the assembly. Dr Hook's Dennis Locorriere to tell his story in concert in Warrnambool Dr Hook's Dennis Locorriere to tell his story in concert in Warrnambool", "articleID": "2014052201_00039166_W", "names": {"Scott Ryan": ["Q19519728", "Q7437179", "Q7437180"]}}]