[{"articleID": "2012042721_00029165_W", "names": {"Andre Brown": ["Q3615433", "Q41617079", "Q4754745", "Q4754746"]}, "date": "2012-04-27", "url": "http://rotoworld.com/content/playerpages/player_main.aspx?sport=NFL&id=3616", "content": "beyond the arc college hoops news and rumors giants signed slb mathias kiwanuka to a three-year extension through 2015. without the new deal, kiwanuka would have entered a contract year in 2012. the 29-year-old pass rusher has settled in as largely a strong-side linebacker in the giants' 3-4. per rotoworld offseason acquisition mike clay, kiwi played 69 percent of his 2011 snaps at linebacker, 21 percent at end, and 8 percent as an interior tackle. kiwanuka finished with a career high 84 tackles, 3.5 of them good for sacks. he's now under contract through his age-32 season. giants dc perry fewell plans to use mathias kiwanuka as the team's starting strong-side linebacker on first and second downs. \"he's going to play linebacker this year,\" said lbs coach jim herrmann. \"in our base package he's a linebacker. when we go to third down, all bets are off .\" playing linebacker puts a cap on kiwi's ceiling in idp leagues, unless you can still use him at defensive end. he should have more tackles than most ends. giants agreed to terms with de/olb mathias kiwanuka on a two-year contract. there goes osi umenyiora's holdout leverage. kiwi is a high-risk investment because of his neck injuries, but his versatility and pass-rushing ability also made him one of the most intriguing defenders on the market. the giants may now be open to offers for umenyiora, though kiwanuck also figures to see plenty of time at outside linebacker with the position in flux. espn new york's ohm youngmisuk has a \"gut feeling\" the giants will re-sign free agent de mathias kiwanuka. nfl suspended giants rb <mark>andre brown</mark> four games for violating the league's policy against performance enhancers. giants te jake ballard (microfracture, acl surgery) concedes his best chance to return in 2012 is by mid-season, \"if at all .\" ballard will start training camp as well as the regular season on the pup list. having signed martellus bennett to a one-year contract, the giants aren't going to count on a contribution from ballard until the 2013 season. giants te travis beckum is \"further along\" in his recovery from a torn acl than teammate jake ballard, who also underwent microfracture surgery."}, {"articleID": "2014052305_00013131_W", "names": {"Steven Jackson": ["Q2062417", "Q3499240", "Q3973436", "Q7614873"], "Jay Cutler": ["Q312811", "Q937778"], "Andy Dalton": ["Q129605", "Q2849092"], "Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"], "Sammy Watkins": ["Q7409856", "Q7409857"], "Mike Evans": ["Q14951064", "Q1621683", "Q25189874", "Q6846717", "Q6846719"], "Cam Newton": ["Q5024850", "Q5024852", "Q591678"], "Jimmy Graham": ["Q3808423", "Q6200226"], "Jeremy Hill": ["Q42422137", "Q57833877", "Q6181474", "Q6181476"], "Andre Williams": ["Q16235162", "Q2846286"]}, "date": "2014-05-22", "url": "http://kissingsuzykolber.uproxx.com/2014/05/french-weddings-suck-dog-balls.html", "content": "Getty Image Bonjour! We'll get to your questions in a bit, but first we gotta talk about France. Now, France is great. Paris is one of the greatest cities in the world. But if you're an American who's moved there and prefers the French lifestyle, do your home nation a favor and DON'T write about why you prefer French culture. Please don't. Pretty please. Because I guarantee that you will sound completely insufferable. Of course, the most famous example of this is Pamela Druckerman's Bringing Up B? b?, in which the Paris-based American author presents a step-by-step accounting of how French parents are better than American ones because they put their own happiness first and inoculate their children to secondhand smoke at an early age. French Weddings Are More Fun, featured in NY Mag's The Cut. It's all terrible, but I've selected a few choice passages to share with you: I'm an American who has lived in Paris for seven years. Of course you are! (The sentence above is the universal sign for rational people to X out of a browser window .)... \"Dating\" as we know it in the U.S. doesn't really exist in Paris. The second you sit down to a drink with someone, you're in a relationship. There's no playing the field, and there's no \"Wait, are we dating?\" conversation. People break up or get serious. That sounds...awful. \"Sorry, I can't have coffee with you. I had coffee with someone on Tuesday, and we haven't broken up yet .\" Like, American dating is depressing and enervating, but the best way to meet the right partner for you is to meet a lot of people. And while relationships might progress quickly, engagements often last for years. If you decide to get married, then plan a wedding and get married and start getting your tax breaks. Long engagements are pointless and shitty. Need proof? Watch The Five-Year Engagement. That movie blew ass. In France, the very act of getting engaged takes forever. The man asks the woman's father for her hand, and he then proposes with a ring. In America, this would be followed by phone calls and a Facebook post, but here the couple keeps the engagement secret until they can tell their families in person. Yeah, that makes tons of sense in France, which is approximately the size of Texas. And a place the size of Texas, though inarguably large, is comfortably navigable by car or train to share the best possible news with your closest loved ones. This isn't the case in the United States, where parents and their grown children on opposite coasts are often separated by an expensive 5-hour flight. SORRY FOR USING MODERN TECHNOLOGY TO BRIDGE IMPOSSIBLE DISTANCES, YOU JUDGMENTAL ASS. The men and women do split up for the bachelor and bachelorette parties. The tradition is to kidnap the bride, whisk her away for the weekend, and make her dress up and perform embarrassing dares in public. Oh, so EXACTLY THE SAME as American bachelorette parties? The weddings themselves are weekend-long affairs. That's in part because in France, only civil marriages are legally binding. So lots of couples have two ceremonies: one legal, one religious. Fabien and Virginie's wedding, for instance, consisted of a Friday-night civil wedding; a religious ceremony, cocktail party, dinner, and reception on Saturday; and a big lunch on Sunday. Once again, this is essentially the EXACT format of most American weddings I've been to: Friday night rehearsal/welcome dinner, Saturday wedding and reception, and Sunday farewell brunch. WEEKEND-LONG AFFAIR. SAME AS FRANCE. The weekend was completely beautiful, with festivities revolving around an old farmhouse overlooking a vineyard on Virginie's family ch? teau in Bordeaux. About 300 people attended, which is average; a 100-person wedding is considered very small. Anyone who's been to a 300-person wedding can tell you that 300-person weddings are fucking TERRIBLE. Fuck you. All of the best weddings I've been to have been about 100 people or less, which (a) gives you a chance to actually hang out with the bride and groom, (b) keeps dinner from taking eight years, and (c) ensures that the quality (and freeness) of food and booze isn't capped by the preposterous number of guests. All of us witnesses went a week early and helped the bride and groom ready the farmhouse. We took down cobwebs, repainted all the shutters, and laid gravel in the driveway...It's traditional for the bride and groom to make gifts for every guest, so we helped them prepare jam and homemade rum punch, and then tied little tickets on each of the 600 jars and bottles. \"French weddings are way more fun for bridesmaids! They require a week of unpaid labor and mindless tasks! I'm a fucking simpleton!\" American weddings might be more ornate, but French weddings have better food and last longer. I'd say they cost about the same, Sounds like rigorous fucking research you did there. because while American-wedding budgets include things like chair covers, French couples spend money on food and drink for hundreds of guests - and on keeping the DJ going until 7 a.m. I recently went to a wedding in California that ended at midnight. I was shocked! The dancing doesn't even start until after midnight in France. That's not a typical American wedding. That's YOUR fault for having shitty American friends. Other Americans are smart enough to rent wooden chairs that don't need covers. I think Americans would also be surprised by the irreverence of French weddings; they defy cultural stereotypes. When the couple makes their entrance at dinner, everyone stands on their chairs and throws their napkins in the air. You've got to be a special kind of dipshit to be impressed by stupid shit just because it doesn't fit into your expected stereotype. \"France: they've got stupid wedding traditions, too!\" Dinner can last for hours as families and witnesses poke fun at the bride and groom through dozens of silly videos, speeches, slideshows, and sketch-comedy routines. Almost exactly like America. (Although if you see a sketch-comedy routine break out at a wedding, please do the right thing and set the venue on fire immediately .) When the dancing finally starts, the music ranges from traditional to cheesy (think: \"It's Raining Men\" ). French weddings: we have the same shitty songs as America's worst weddings! When I get married I think I'll go the French route. I like the sound of a Parisian wedding, one that would be less about my dress and hair and more about family and friends coming together over lots and lots of Champagne. That's not a French wedding. That's just a good wedding. You're terrible. I hope you marry a Frenchman and never write in English again. And now, finally, the mailbag gets to your questions. Hi Cavey, FFL: My football question has to do with offseason research: I'm always looking for better ways to figure out who's going to make a good late draft pickup, so I'm wondering if you have any tidbits you can toss our way. I take a look at 2nd/3rd year receivers, kick the tires on RBs to look into things like #of carries last year and age, and try to think about what QB/WR pairings are looking promising for the next year. Any non-trademarked secrets you can cast off to us? Seems like you're in the right ballpark. I won't draft a running back in his 30s (<mark>Steven Jackson</mark> was the easiest bust to avoid last year), and a heavy load of touches is cause for concern. LeSean McCoy and Marshawn Lynch were the only backs with 300 + carries in 2013, and while that's not a dealbreaker, I will probably bump them down my draft board a spot or two because of it. Elsewhere, seek out offensive-minded coaches and talented quarterbacks. Take the second wideout in a great offense before the first wideout in a mediocre one. And don't sleep on boring QBs surrounded by great assets - <mark>Jay Cutler</mark>, <mark>Andy Dalton</mark>, and Josh McCown are all going to be perfectly serviceable if you miss out on Brees and Manning. Relationships: My girlfriend's best friend just recently got into in a whirlwind romance with a new guy, and, quite against the best friend's type, has let things progress quite quickly and has now moved in with him after just a few months. Also against type is that when they're in public, they're the couple who cuddles all the fuck over each other all the damn time (this despite her anger when single about any other couple showing intimacy; fuck that). This dramatic change, of course, is of concern to my girlfriend, me, and the rest of the social circle that is close with the best friend. Prior to dating this guy, the best friend agreed to come join the rest of our social circle in our annual long weekend trip out to the coast (Pacific NW, so you can't really say \"beach'), where we rent a nice place, eat richly, drink heartily, and have fun. Once the best friend got with new guy, she asked to bring him along and we all said that's cool. Well, now it's become rather annoying because despite knowing months ahead of time the dates (memorial weekend), he's now apparently hosting some friends for a night and attending his friend's improv comedy gig at the circus-themed bar in town (jeebus asshole christ; trust me, it's even worse than it sounds), so they're now coming for a little bit on Saturday before heading back into town and then coming back to the coast on Sunday, which, hey, their choice, but it's just stupid. I should mention that we are all in our mid thirties or older. So the guy you don't like is going to spend LESS time hanging out with you? What's the problem? So, to the questions: 1 .) when am I allowed to kick him in the dick? and 2 .) how do I best restrain myself from yelling\" I TOLD YOU SO \"when this relationship goes south? Actually, no, the real convoluted question is: at what point and how do we talk to the best friend and tell her that while we're happy for her new relationship, this sudden high-school level PDA and flakiness on the rest of her friends needs to be dialed way the hell back? Thank you and keep up the good work, Obviously Someone Zesty Step 1 is chill out a little bit. Not everyone in your perfect little circle of friends is going to select sexual partners that mesh with the rest of the group. Your social circle is not fixed, and best friends aren't always forever. Friendships have ebbs and flows, and the ebbs are never more likely than when one of the friends gets into drugs or dates someone who's into improv. So don't be upset about one friend missing part of a weekend because of her stupid boyfriend. Focus on enjoying your time on the coast - and, of course, talk MAD shit about them with everyone else while they're at the improv show. Of course, this doesn't solve the PDA issue when they're in your presence. I think that some gentle teasing would help here: I've always enjoyed\" GET A ROOM! \", but\" Hey, knock it off, you two. I'd like to have an appetite for dinner \"could also work. They'll either get the point or stop wanting to hang out with you, so win-win. Or you could do something REALLY out of the box and just be glad that your girlfriend's best friend is happy instead of her usual M.O. of bitching about couples making out ....yeah, probably not. ********** It's wedding season again, which reminded me that I need to thank you for the excellent advice you gave me last year (Sex: I've been dating a great girl since last July. I'm going to a slew of weddings this summer that I'd like her to attend with me. What's the protocol for out-of-town weddings for my friends? Should I take care of the travel costs (including her airfare)? Or is it reasonable to ask her to pay for some/all of those costs? If it matters, we have roughly similar income. Sincerely, Mile High Club Hopeful Talk it out with her. If she doesn't know your friends who are getting married, then the onus is on you to pick up the bulk of the expenses. However, given the cost of flying across the country, that makes for an awfully expensive date. Since you're on equal financial footing and will be approaching the year-mark of the relationship, I think it's reasonable for her to pay for her own airfare, but you pick up the cost of the hotel. Hotel sex is the best! As you suggested, we talked about it and agreed to split the costs along those lines (she paid her own airfares, and because they were my friends, I paid for most or all of the hotels/rental cars/gifts). Traveling with her made each trip and each wedding so much better, and though it sounds corny, I think we felt more in love after each one. We're traveling to 3 more weddings this summer and using the same arrangement (including her paying for the larger share when it's a wedding of her family/friends). And yeah, hotel sex is awesome. I copied and pasted this into the mailbag without realizing there was no question. The responsible and professional thing to do here would be to cut this out and send an email thanking the reader, but fuck that. If <mark>Peter King</mark> doesn't have to edit his shit, why should I? SAVOR MY BLOATED WORD COUNT. ********** Captain, Sex: I love reading the mailbag each week and really appreciate your insights. My boyfriend of a few months broke up with me this week and I was blindsided. Looking back, I realize I shouldn't have been. We weren't getting along very well recently. We were friends for a while and we started dating soon after my previous, emotionally draining relationship ended. I realized too late that I probably need more time to recover from that but didn't really know what to do. I let jealousy and stress of other things in my life (new job, moving) impact the way I was treating him (getting upset over little things, not letting shit go, being a bitch, etc.) I was taking him for granted and I went too far. I really do care about him and I love spending time with him. I'm kicking myself for acting this way. Hey, that's really mature of you. Circumspection and self-awareness aren't easy, especially in the wake of a break-up. I love your Post Breakup Guide and recommend it to anyone who is going through a tough breakup, but my question is what is your advice on winning someone back? I have a new perspective on my actions and it's definitely out of character for me to act this way, but I'm not sure how to go about showing him this is the case. The breakup was amicable and I agree with all the points he made. I just want an opportunity to show that things can and will be better. I suggested we try to take a break for a couple weeks and see what happens, but he said a break and breakup are one and the same to him. He wants to stay friends, still talk and see what happens from there. We have a lot of mutual friends so we will see each other at social events, etc.. How should I approach this? - Idiot Girlfriend I think you can tell him everything you wrote in your first paragraph (assuming you haven't already), and that will go a long way to validating his feelings leading up to the break-up. Never underestimate the power of a heartfelt apology. That said, you don't have to cheat on someone to wreck a relationship beyond repair. Bitchiness and jealousy can have a lasting impact on a person's psyche, and - regardless of your friendship or mutual friends - his impulse on seeing you might be\" I'm so glad I'm not dealing with her shit any more. \"Recognize and respect his feelings and need for distance. Shorter answer: cleavage, a tight skirt, and a couple drinks. He's not made of stone. Fantasy: besides the obvious <mark>Sammy Watkins</mark> type rookies to take in fantasy drafts this summer, are there any sleeper rookies that you would recommend taking a look at? <mark>Watkins</mark> will be a key piece of the Bills offense, but he's also not flying under anyone's radar, which means he'll probably come off the board a round earlier than he should. I'd rather turn my sights on Bishop Sankey, running behind a solid Titans line (Shonn Greene and Jackie Battle are in the picture, of course, but are also Shonn Greene and Jackie Battle). <mark>Mike Evans</mark> shows a ton of upside in the Lovie Smith\" Josh McCown throwing to two gigantic wideouts \"offense. Also, Kelvin Benjamin should be a great red zone target for <mark>Cam Newton</mark>, and Eric Ebron is an exciting prospect for the Lions offense. Those are the guys with the most buzz right now. As training camps start and depth charts start to take shape, you'll probably see these guys creeping into the discussion: Jordan Matthews, Eagles. BUY on all Eagles offensive players. Tre Mason, Rams. I think it's still Zac Stacy's job to lose, but Mason has too much talent not to get carries. Brandin Cooks, Saints. Looks like the next boom-or-bust Saints receiver to drive you insane, but could break out with an injury to <mark>Jimmy Graham</mark> or the declining Marques Colston. Carlos Hyde, 49ers. With Frank Gore aging and Marcus Lattimore a question mark, Hyde could become the workhorse for San Francisco. <mark>Jeremy Hill</mark>, Bengals & <mark>Andre Williams</mark>, Giants. Both are incredibly talented backs with good size that may end up as the goal-line backs. Anyway, we'll get more into that as the season gets closer. Only 15 weeks until Seahawks-Packers! Sex: I am engaged and have the wedding set for this fall. Everything in our relationship up until now has been amazing, we've been together for about 2 and a half years and she's the girl of my dreams. However, right now I'm in the middle of a fight between my future wife and my best man, who is also my best friend. He wants to bring his on again / off again girlfriend of about 18 months as his plus one to the wedding, who my fianc? e absolutely hates and does not want there. The girlfriend has treated my best man pretty poorly, she has dumped him multiple times, said she has no feelings for him, uses him when there are no other better options around, etc., but he's always there and takes her back. The best man says he's in love with her and is adamant that he be able to bring her, but my fianc? e is adamant that she is not coming. If I tell my best man that sorry, she can't come, I fear it could ruin/end our friendship. If I put my foot down with the fianc? e and say the girlfriend can come, it could cause a giant rift in our relationship, and would probably be an awful way to start married life together. How should I handle this? I see no good way out of this situation. Wow, okay. That's a lot to unpack. Here are my thoughts, in order: 1. Marriage is a legally binding contract to your life partner. Translation: when in doubt, you side with your wife. 2. Your best friend is pussy-blind. It's regrettable, but it happens to perfectly intelligent people all the time. Eventually, he'll either come to his senses...or he'll marry her. Is your wedding the bridge your wife wants to fight this battle on? 3. The best man is entitled to bring a date. If he and his girlfriend are in\" on-again \"mode, then it only makes sense that he would bring her. 4. Real talk: dictating who the best man can or can't bring as his date is a straight-up Bridezilla move. So, there are some conflicting points there. I have no doubt that your best man's girlfriend is a useless tramp. But you can't do anything about his lack of judgment or self-worth, can you? Marriage is compromise, and it begins with the wedding. EVERY wedding has a guest (or guests) that either the bride or groom doesn't like, but is obligated to include. You invite them as a favor to your partner, or to your parents. On those grounds alone, it would seem that your bride needs to relent and allow Slutty McCunterson to attend. HOWEVER, if your best man and his viper-lady are prone to public fights or any kind of drama that would detract from your celebration or distract him from his duties, then you need to side with your wife, put on your big-boy pants, and explain to your best man why you can't risk your wedding on his penchant for flaky bitches. (And maybe be prepared to get a new best man .) There's not a right answer that makes everyone happy, and that's life for you. It kinda sucks most the time."}, {"articleID": "2015123016_00411490_W", "names": {"John Liu": ["Q43380304", "Q6244999"], "Robert Wagner": ["Q18710901", "Q2920078", "Q310493", "Q37382596", "Q4102226", "Q43139753", "Q471707", "Q48688879", "Q57119081", "Q698868"]}, "date": "2015-12-30", "url": "http://queenstribune.com/a-lifetime-of-public-service-from-a-young-age-katz-heard-the-call-to-serve/#comments", "content": "By Domenick Rafter Editor in Chief Melinda Katz was first elected to office in a special election in 1994 at the age of 28. Running on the Liberal Party line, she defeated both a Democrat and a Republican to be elected to the State Assembly representing a district centered in her native Forest Hills that also included Rego Park and parts of Glendale and Middle Village. She won the Assembly seat vacated by Alan Hevesi, who had been elected City Comptroller several months earlier. In the Assembly, Katz--as the youngest woman in the body at the time--had a special focus on women's issues, authorizing legislation that required HMOs to provide gynecological care to women without forcing them to see a primary care physician first--a law that later went national. Katz sat in the Democratic caucus and was reelected in November 1994 to a full term and again in 1996. But she gave up her seat in 1998 to run for higher office. She set her eyes on Congress, seeking the sprawling Brooklyn and Queens seat vacated by Chuck Schumer for his successful run for Senate. Then-Assemblywoman Melinda Katz with then-First Lady Hillary Clinton. In a district that included heavily Jewish neighborhoods of Brooklyn, such as Brighton Beach, Midwood, Sheepshead Bay and Mill Basin, as well as the Rockaways, Howard Beach, Woodhaven, Middle Village, Corona and Forest Hills in Queens, Katz was one of four Democrats who faced off for the nomination in the very Democratic district. She was the only candidate from Queens and the only woman. Though her three Brooklyn opponents did split the vote, Katz fell less than 500 votes short of then-Councilman Anthony Weiner, a protégé of Schumer's. Katz remained on the Liberal Party's line in November of that year, but only garnered just over five percent of the vote. After her defeat, Katz went to work for Borough President Clare Shulman in Borough Hall as director of community boards. In addition, she assisted the Borough President in proposing sites for city facilities and creating a strategic plan for the economic development of Queens. \"I took a lot from her administration,\" Katz said. \"It was my first view of city government and my first view of an executive, and someone who can call all the players to the table, and I took that from her .\" In 2001, Katz sought elected office again, running for the City Council seat vacated by Karen Koslowitz, again based in Forest Hills, but also including Kew Gardens, Rego Park and parts of Elmhurst, Maspeth and Richmond Hill. She won the primary and general election handily and served eight years in City Hall. In the Council, Katz chaired the powerful Land Use Committee, where she was the council's point person in many of the Bloomberg-era zoning proposals, including Hudson Yards on the West Side of Manhattan and numerous neighborhood rezoning plans in Queens including Forest Hills, Rego Park, Middle Village, Glendale, Woodhaven, Richmond Hill and Cambria Heights. Term limited in 2009, Katz decided to seek citywide office, running for City Comptroller in a four-way Democratic primary that included two other candidates from Queens; her Council colleagues <mark>John Liu</mark> and David Weprin. Though she won her own former Assembly district--as well as one in Staten Island--and finished second in Queens, she failed to make the runoff, which was eventually won by <mark>Liu</mark>. Katz getting sworn in for her first elected office, State Assembly, in 1994. Katz then went back to private practice, as a lawyer, for several years, but opted to make a second political comeback in 2013, running for Queens Borough President. Facing a crowded Democratic primary that dwindled to three candidates, Katz won a 44 percent plurality and went on to defeat her Republican opponents with 80 percent of toe vote to be elected Queens' 19th borough president, and third consecutive woman. As far as her political future, Katz isn't ruling anything out. Political pundits and historians will be quick to point out the borough presidency has not necessarily been a road to higher officer for others. Of the 90 people who have served at the helm of the five boroughs since 1898, only four: Manhattanites <mark>Robert Wagner</mark>, David Dinkins, Scott Stringer and Bronx's Robert Abrams have won election to citywide or statewide office. Nevertheless, at age 50, Katz is still young and has a resume that has led to her name being thrown around for various higher positions, including mayor and governor. But for now, Katz said she's content in her current job, where she would be term limited in 2021 providing she runs and wins a second term in 2017."}, {"articleID": "2017042622_00256984_W", "names": {"Eric Paul": ["Q5387251", "Q5387252"], "Ben Bishop": ["Q12956342", "Q816445"], "Jimmy Carter": ["Q23685", "Q6199776"]}, "date": "2017-04-26", "url": "http://www.voiceofalexandria.com/news/national/ap-explains-trump-order-sets-up-legal-clash-over-vast/article_ad1246a4-55fb-53c2-8b37-7435196d3c3d.html", "content": "1 of 14 Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) AP AP Explains: Trump order sets up legal clash over vast lands By JOHN FLESHER AP Environmental Writer Apr 26, 20178 min ago Carolyn Kaster President Donald Trump signs an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. President Donald Trump is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" (AP Photo/Carolyn Kaster) <mark>Eric Paul</mark> Zamora File-In this Oct. 3, 2016, file photo, Kyle Palmer, left, of Idaho waits as his son Lance Palmer of San Francisco, takes a photograph of the scene looking south from Beetle Rock at Giant Forest in Sequoia National Park, Calif.. President Donald Trump will sign executive orders this week aimed at expanding offshore oil drilling and reviewing national monument designations made by his predecessors, continuing the Republican's assault on Democratic President Barack Obama's environmental legacy. (<mark>Eric Paul</mark> Zamora/The Fresno Bee vi AP, File) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, a reporter walks through the trunk of a 2,000-year-old giant Sequoia inside the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, File) Rick Bowmer FILE - In this June 22, 2016 file photo, the \"Bears Ears\" buttes are shown near Blanding, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Rick Bowmer, File) Carolyn Kaster President Donald Trump acknowledge applause after signing an Antiquities Executive Order during a ceremony at the Interior Department in Washington, Wednesday, April, 26, 2017. Th president is asking for a review of the designation of tens of millions of acres of land as \"national monuments .\" Front row, from left are, Rep. <mark>Ben Bishop</mark>, R-Utah, the president and Sen. Orrin Hatch, R-Utah. (AP Photo/Carolyn Kaster) Douglas C. Pizac FILE - This May 30, 1997, file photo, shows the varied terrain of Grand Staircase-Escalante National Monument near Boulder, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Douglas C. Pizac, File) NOAA Office of Ocean Exploration and Research FILE - This undated file photo released by the National Oceanic and Atmospheric Administration made during the Northeast U.S. Canyons Expedition 2013, shows corals on Mytilus Seamount off the coast of New England in the North Atlantic Ocean. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (NOAA Office of Ocean Exploration and Research via AP, File) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, a portion of Midway Atoll in the Papahanaumokuakea Marine National Monument is seen from Air Force One, with President Barack Obama aboard, as it comes in for a landing at Henderson Field. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Carolyn Kaster, file) KEVORK DJANSEZIAN FILE - In this July 24, 2002, file photo, Forest Service Engine Captain Jim Bauer waters down the historic Speas Meadow cabin, once used by sheep herders in late 1800s, near Packsaddle Grove in the Giant Sequoia National Monument, Calif.. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Kevork Djansezian, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama pauses at the Battle of Midway Navy Memorial as he tours on Midway Atoll in thePapahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) Francisco Kjolseth FILE - This May 23, 2016, file photo, shows the northernmost boundary of the proposed Bears Ears region, along the Colorado River, in southeastern Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (Francisco Kjolseth/The Salt Lake Tribune via AP file, File) Jacquelyn Martin FILE - In this July 10, 2015 file photo, President Barack Obama, signs designations for three new national monuments; Berryessa Snow Mountain in California, Waco Mammoth in Texas, and the Basin and Range in Nevada, in the Oval Office of the White House, in Washington. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. . (AP Photo/Jacquelyn Martin, File) Rick Egan FILE--In this Dec. 29, 2016, file photo, a young protester demonstrates with others against the new Bears Ear National Monument in Montecello, Utah. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. Rick Egan/The Salt Lake Tribune via AP, file) Carolyn Kaster FILE - In this Sept. 1, 2016, file photo, President Barack Obama looks out over Turtle Beach as he tours Midway Atoll in the Papahanaumokuakea Marine National Monument, Northwestern Hawaiian Islands. President Donald Trump signed an executive order Wednesday, April 26, 2017, directing his interior secretary to review the designation of dozens of national monuments on federal lands, as he singled out \"a massive federal land grab\" by the Obama administration. (AP Photo/Carolyn Kaster, file) President Donald Trump's order for the government to review national monuments created by several of his predecessors sets up a legal showdown over whether one chief executive has the power to undo another's decisions. At stake are federal lands revered for their natural beauty and historical significance. The review goes well beyond a few declarations made in the waning months of Barack Obama's term. It covers 24 monuments established by three former presidents over more than two decades. A closer look at the issues: ___ WHAT IS A NATIONAL MONUMENT? The 1908 Antiquities Act, enacted under President Theodore Roosevelt, empowers the president to declare as national monuments any landmarks, structures and other \"objects of historic or scientific interest\" on land owned or controlled by the federal government. Roosevelt established 18 monuments, including the Grand Canyon in Arizona and Devil's Tower in Wyoming. Most presidents since then have designated additional monuments. Congress has created others. Most monuments are overseen by the National Park Service. Some are cared for by the federal Bureau of Land Management, the Fish and Wildlife Service or the Forest Service. Each agency has policies for protecting the land while also allowing some public use. For instance, some policies include limits on mining, timber cutting and recreational activities such as riding off-road vehicles. ___ A CONTENTIOUS HISTORY Many national monument proclamations have enjoyed broad support. Others have been fiercely contested in Congress and the courts, including designations by Franklin D. Roosevelt (Jackson Hole National Monument, now Grand Teton National Park); <mark>Jimmy Carter</mark> (vast lands in Alaska); and George W. Bush (Papahanaumokuakea Marine National Monument northwest of Hawaii). Trump's choice of Jan. 1, 1996, as the starting date for his review was prompted by lingering resentment among Utah conservatives of Bill Clinton's designation of the Grand Staircase-Escalante National Monument that year. Critics say presidents increasingly are protecting areas that are too large and do not fit the law's original purpose of shielding particular historical or archaeological sites. Designating millions of acres for scientific observation or sheltering rare species, they contend, is a \"federal land grab\" that ignores the wishes of local residents, although the lands already belonged to the government or were under federal control. Interior Secretary Ryan Zinke says the pendulum has swung too far toward protecting public lands and away from the \"multiple-use\" concept advanced by Gifford Pinchot, the first chief of the Forest Service and an early leader in the conservation movement. Supporters say the designations are essential to protect sensitive areas from looting and damage. Complaints about people getting kicked off the land are exaggerated, they say, and opposition fades as nearby communities benefit from tourism the monuments attract. A 2014 study by the nonprofit research group Headwaters Economics found that indicators such as employment, population and per-capita income held steady or improved in sections of the West where monuments larger than 10,000 acres had been established since 1981. ___ LEGAL PRINCIPLES Some monuments have been reduced in size over the years, either by presidential order or by Congress, while others have been enlarged. But no president has tried to eliminate a predecessor's monument. If Trump does so, his move will almost certainly be challenged in court. The Antiquities Act does not explicitly say whether a president can nullify a monument proclamation. A legal analysis commissioned by the National Parks Conservation Association says no, pointing to a 1938 opinion by then-Attorney General Homer Cummings that a monument designation has the force of law and can be reversed only by Congress. A House report accompanying the Federal Land Policy and Management Act of 1976 agrees. But a study for the conservative American Enterprise Institute released in March argues that when Congress authorizes the executive branch to write regulations, the power to repeal them generally can be assumed. That's especially so, it says, when a president is correcting a predecessor's act that exceeded what a law intended--such as creating vast monuments when the Antiquities Act says they should consist of \"the smallest area compatible with the proper care and management of the objects to be protected .\" ___ WHAT'S NEXT? Trump's order directs Zinke to review monument designations involving 100,000 acres or more. The interior secretary will submit an interim report within 45 days focusing on the Bears Ears National Monument in Utah, which Obama established last year. A final report is due in 120 days. Zinke says the report will recommend whether any monuments should be abolished or resized. He promises an open-minded approach and says he remains opposed to selling any federal land or transferring it to state or local control. Congress might weigh in as well. Numerous bills on the issue were introduced in the previous session, including measures to prevent the president from establishing or expanding monuments in particular states and to require consent of Congress or state legislatures. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Tags"}, {"articleID": "2018020822_00243183_W", "names": {"Dan Green": ["Q19282196", "Q4119907", "Q5213603"], "Chris Crocker": ["Q5106307", "Q734039"]}, "date": "2018-02-08", "url": "http://smashtasm.wikia.com/wiki/Super64?diff=8310&oldid=8292", "content": "Revision as of 00:05, December 27, 2016 (view source) Matheus Leonardo (Talk | contribs) m (Vandalism) ← Older edit Latest revision as of 22:05, February 8, 2018 (view source) PoisonMon09 (Talk | contribs) Line 16: Line 16: = = Personality = = = = Personality = = − Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at [[Killa7]], and in the crossover \"\"Beans\" \"he reveals he's bad at making insults in the song\" We Will Fuck You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE:\" Beans \"cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). + Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at [[Killa7]], and in the crossover\" \"Beans\" \"he reveals he's bad at making insults in the song\" We Will F--You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE:\" Beans \"cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). = = Character Biography = = = = Character Biography = = Latest revision as of 22:05, February 8, 2018 Contents [show] Super64 Plumber Style! Vital statistics Title The Plumber Gender Male Character Mario Status Moderator Super64 is the main protagonist in Smashtasm, both in Season One and Season Two. He plays as Mario in default costume. He is considered a\" n00b \"by other players because of his lack of skill in the game and that he was tricked by Killa7's Tournament Scheme. Super64 likes using items. He often makes long speeches, causing other players to leave out of boredom, or just because they want to be mean (or sometimes both). As of the second season, he has apparently been promoted to mod for defeating Greg. He is voiced by the creator of the series, Shippiddge. Physical Description Edit Super64 introduces himself. Because the Melee in Smashtasm is an online multiplayer fighting game, we never learn what the real Super64 looks like. Being a Mario player however, he looks just like the famous plumber in his normal clothing when logged in. We randomly assume he looks like Pierce\" Shippiddge \"Shipp. Personality Edit Super64 is a naive newbie with a tendency to believe in clichés, but he means well. He is a quick learner, a good listener, and is very good at making new friends, though he usually gets beat up by them in the process of befriending them. His belief in clichés causes him to give generic speeches about friendship and heroism, which often bores people to the point where they either refuse to listen or just leave altogether. He is a very vengeful person as well, as seen when he goes on a journey to get back at Killa7, and in the crossover\" Beans \"he reveals he's bad at making insults in the song\" We Will F--You \", a parody of\" We Will Rock You \"by Queen. He also seems to have changed slightly, stating that he doesn't do clichés (NOTE: Beans cannot be taken as canon, as none of the creators have said anything about the matter). He will always take on anyone, though he doesn't try to start fights (especially when he's trying to do something). Character Biography Edit The Tournament Scheme and 1337f0x Edit\" Hyrule Temple. This must be the place. \"- Super64, Season 1, Episode 1 Super64 meets 1337f0x. Super64 started his adventure at Hyrule Temple in a server called\" Ultimate Smash Tournament \", run by Killa7. He was there for a tournament, which was just a ruse by Killa7 Super64's first appearance in scene one. (A Bowser player) to raise his own ranking. Upon arriving at the server, Super64 was knocked out by Killa7, which sent him flying. He later landed on the Corneria stage where he met and briefly fought 1337f0x (A Fox Player who speaks primarily in 1337). After managing to knock him out once, 1337f0x befriended him and informed him that tournaments do not exist in the game and that Super64 fell for what is called\" Tournament Scheme \". 1337f0x then shows Super64 the way to get back to Hyrule Temple. Hyrule Temple Battles Edit\" Plumber Style! \"- Super64, Season 1, Episode 2 Upon arriving at Hyrule Temple, 1337f0x leaves, and Super64 meets Link, a Link player who genuinely believes he is the protagonist from the Legend of Zelda games. Link teaches Super64 how to set match rules, saying if he doesn't agree to them,\" You \"ze-a gettin' banned\". Super64 tricks him into a 1-Stock match and quickly defeats him by hitting him off the edge of the stage when they're right next to it, at which point Link attacks him for the cheap move. Luckily for Super64, a player controlling Ganondorf appears, and when Link rushes off to fight his \"nemesis,\" he is beaten swiftly and easily. Upon talking to the Ganondorf player, Super64 learns she is a female player named BlakBerri, certified Smash Professional. When accidentally insulting BlakBerri, (\"Hey Link, you just got OWNED by a CHICK!\" ) she attacks him, and Super64 calls in 1337f0x to help. 1337f0x and BlackBerri have a battle shown offscreen, during which an intermission where trophies are shown off plays, and the battle results in a draw. BlakBerri gives them information on where to find Killa7, telling them he's in the same server as where he was before. Greg Edit \"He got away!\" - Super64, Season 1, Episode 4 Super64 and 1337f0x track down Killa7 to Great Bay, but while Super64 is giving a speech about how Killa7 will not get away, Killa7 gets away. At this point, a <mark>green</mark> Falco player shows up, who is then revealed to be 1337f0x's old friend and partner, Greg. After speaking in 1337, which Super64 doesn't understand a \"word\" of, 1337f0x explains. Speaking normally for the first time, 1337f0x (after being interrupted by Super64 and Greg) tells the story about how Greg turned evil by wanting to use hacks to cheat at Melee and defeat all the pros, and 1337f0x stopped him after the Admins failed to do so. Greg and 1337f0x decide to have a battle then and there, so 1337f0x smashes Super64 out of the bay before they clash, as three characters fighting with hacks in a server will crash the server. The Rap Sheet Edit \"Don't say fine! Say Word!\" \"Ugh...Word\" - Pimpachu and Super64, Season 1, Episode 7 Super64 lands in the Fountain of Dreams stage, where he meets PrinceRok, a white Marth player from Scotland who calls Super64 \"Lassie .\" After accidentally insulting him by calling him Irish, PrinceRok fights and horribly defeats Super64. When PrinceRok comments on how terrible he is at fighting and asks if anyone had ever told him that, an inaccurate flashback takes place of Super64 and 1337f0x on Corneria, where 1337f0x tells Super64 that he sucks, and it is revealed that Super64 only knocked out 1337f0x at the beginning because 1337f0x wasn't trying. After the flashback, Super64 responds that he didn't even want to fight PrinceRok in the first place. PrinceRok then asks why he came to his server in the first place, and Super64 recalls everything that's happened to him thus far on his journey. At this point, PrinceRok offers to take Super64 to a friend who can help him find Killa7, which Super64 gladly accepts. PrinceRok takes Super64 to Mushroom Castle, where Super64 meets Pimpachu, a red Pikachu player who speaks like a gangsta. Pimpachu agrees to give Super64 Killa7's rap sheet if he can beat him in a fight. After failing to even touch Pimpachu because he keeps spamming his Down B, Pimpachu allows Super64 to fight somebody else for the Rap Sheet. A shot of Super64's bomb throw right before it knocks Lamp off of the stage. Later at Hyrule Temple, Pimpachu introduces Super64 to his \"main man\" Lamp, a purple Samus player who comes off as very slow witted and childish. If Super64 can beat Lamp, he can have Killa7's rap sheet. If not, Pimpachu gets Super64's password. An unnamed Zelda player then asks Pimpachu to go easy on Super64, which prompts Pimpachu to hit her. At this point, Super64 calls Pimpachu a poser, which angers him and starts the battle. After knocking each other out a few times, Lamp is about to beat Super64 for good, when a surprise intervention from Link, being chased by a horde of Kirbys causes Lamp to lose. Not one to go back on his word, Pimpachu gives Super64 the promised Rap Sheet, and Super64 goes off to hunt Killa7. The Bet and Training Edit \"Yes! Yes! I'm doing it!\" - Super64, Season 1, Episode 9 Super64 messes with Killa7's head by showing up everywhere he is. Just when he's about to take his revenge, 1337f0x shows up and stops Super64, while Greg runs off with Killa7. 1337f0x then explains that he and Greg have made a bet to see who the better hacker is, not being able to hack themselves simultaneously without crashing the server, and that they'll give the two bigest n00bs they know their hacks to see who's best. 1337f0x chose Super64, Greg chose Killa7. 1337f0x then explains that Super64 will need training, and takes him to a Target Smash course. At the target Smash course, Super64 is introduced to MewZero, a Mewtwo player who acts like a stereotypical Asian sensei, to train him with the hacks. But to fight with hacks, Super64 must first learn to fight without them. After a training montage including a valuable lesson on how the cape propels you forward, Super64 fights \"himself,\" really another Mario player named Daniel. Upon succeeding, he is ready to fight Killa7. The Awaited Match Edit \"Let this be...our final battle!\" - Super64, Season 1, Episode 10 Super64 and 1337f0x meet Greg and Killa7 at Final Destination, ready to fight. But then 1337f0x realizes that even if Super64 wins, Greg will still be evil. So, he raises the stakes: The loser of the match and the person they got hacks from is banned from Melee forever. Greg uses hacks to turn Killa7 into Giga Bowser, while 1337f0x turns Super64 in Super Super64, who looks the same, but with artificially enhanced abilities, including the cape and fireball. After a long battle, Killa7 and Super64 are both down to 1 Stock, when Killa7 sends Super64 flying off the stage. In what appears to be a loss, 1337f0x cries in despair. Greg is about to ban him when, suddenly, Super64 reappears from the other side of the stage and knocks out Killa7, winning the match. He reveals to 1337f0x that he remembered MewZero's advice about the cape's propulsion capabilities. Greg, having lost the bet, refuses to agree to be banned, but is forced into it with the sudden arrival and attack of MewZero, who brought along BlakBerri, PrinceRok, Pimpachu, Lamp, and Link (the last of which didn't fight, and had no clue why he was there) saying \"All have helped you on your journey. Now all will help you finish it\". Super64 decides to end with a speech about friendship and talent, but 1337f0x questions it, and ends the season with \"Lulz .\" Setting Out Once Again Edit \"You don't want to mess with me! I'm a mod!\" - Super64, Season 2, Episode 1 Super64 after a mysterious unnamed Snake player comes in and snaps his neck. After the events of Melee, Super64 is now a moderator. He is first seen telling his story to a Ness player, which quickly leaves as soon as possible. Then, Pakkery appears and tells him of a hacker in Skyworld. After talking about Pakkery's fake accent, he leaves to Skyworld. He soon learns 1337f0x is the hacker, and they exchange insane laughter. Then, they are kidnapped by a Dark Fox and Dark Falco duo named Gront and Grant. He then awakens in their hideout, boxed in. Despite \"help\" from Lamp he is still trapped. Then, a Snake player comes, frees him, (Which is probably a joke from Shipp's other videos which Snake snaps Sonic's and others neck) and snaps his neck. He is then able to escape, interrogate the kidnappers, (which Grant tries to cover it up but Gront tells all the right information) and dispose of them. Then, Super64 and Lamp set off to find 1337f0x. A New Ally...Or Not...Edit \"Are you coming on to me? In an online game?\" - Super64, Season 2, Episode 2 After traveling through various stages, Super64 and Lamp get lost in New Pork City. Super64 is flirted with by a Zero Suit Samus, but Lamp is able to tell that it's a Spam-Bot, and disposes of it. After Lamp tells a story about how he knew that it was a Bot (which really has nothing to do with what just happened), Meta-Dark comes, who accidentally spills information about knowing 1337f0x's location, and keeps teleporting back and forth in an attempt to escape, until Super64 KO's him, Lamp asks why Super64 did that, as since Meta-Dark knew where 1337f0x was, they should have questioned him. Super64 is about to follow Meta-Dark, when Lamp is KO'ed by a Dark Sheik player working for Girem6, who offers to \"help' Super64 find 1337f0x. Meeting Princess H Edit The Dark Sheik player leads Super64 to a Trap Portal, and she supposedly tricks him into going in by saying there is candy at the bottom, but it is revealed that it was just in her imagination. In real life, she's about to trick Super64 into going in, but Super64's kind and trusting personality cause her to turn good. She reveals her true form, Princess H. Princess H tells Super64 that there may be a way to stop Girem6, which she'll tell him\" right after I finish pausing dramatically. \"Executing The Plan Edit Princess H tells Super64 her plan: collect several items that will destroy all of Girem6's hacks when combined. It gets off to a shaky start, with Super64 angering Princess H by pretending not to hear her. Once the plan is in motion, they collect the first one with ease, with Grant and Gront supposed to be guarding it, but really goofing off. The second is also collected fine, despite being guarded by a world-famous security system. The third one is guarded by someone who demands to hear a racial joke, but Princess H deals with him. They encounter Meta-Dark, but they get out while Meta-Dark is talking about how they won't get out. The last item is collected by knocking out another guard who asks a riddle. Multi-Dimensional Madness Edit NOTE: These events are from the crossover\" Beans \", which combined GuitarmasterX7's series Brawlgasm with Smashtasm and DexterBoy's series Wolf's Retarded Mission. It is currently unknown if these events are canon to the main story of Smashtasm .\" Wait, he was named Blackimar now? \"- Super64, Beans Sometime after all the events of Smashtasm Season 1, Brawl is released, and Super64 and all of the others get it. One day, Super64 is talking to 1337Fox asking why they aren't fighting in a game called\" Brawl \", when he gets forced into a portal to another dimension. In this dimension, he meets Link from the Brawlgasm universe, the Link from the Wolf's Retarded Mission/Peach's Slutty Adventure universe, and Captain Blackimar. The four are asked by a mysterious voice to fight to the death, which they all refuse to do, and Captain Blackimar seemingly dies when they try to escape through a plot hole. Later, the two Links dub Super64\" Skippy \", and after interrogating a demon, they learn where the voice that has captured them is located. The voice is coming from the Lord of All Things With Nipples, who looks like Ganondorf and sounds like <mark>Dan Green</mark>. Upon twisting Captain Blackimar's nipples, officially killing him, Super64 and the two Links attack the Lord. The Lord then turns into his final form, a cross between a dragon and <mark>Chris Crocker</mark>, which proceeds to damage Brawlgasm Link and Super64 with its nipple beam, causing them horrible agony, which makes absolutely no sense on Shippiddge's part as Super64 is still on his computer. WRM/PSA Link has cut off his nipples before, so he attacks the dragon with an arrow, reversing its nipple beam. Super64 and Brawlgasm Link then attack it with their Final Smashes, saying that their nipples are\" Infused with firey energy! \", and destroy the foe. At this point, the three return to their home dimensions, and Super64 is immediately greeted by 1337Fox, who leaves while he's making a speech. He is then confronted by RaustBlackDragon, creator of the Brawl machinima Dairantou Gaiden, as to why he wasn't in the crossover. Super64 states he has no idea who he is or what he's talking about, and ironically, RaustBlackDragon makes a long speech about why he should be included in the collab, but Super64 leaves during his speech, this is like when Super64 makes long speeches, he causes others to leave out of boredom, and the crossover ends. Mega32 Edit This is a spoiler to the people who have not seen BS64 Being the older brother of Super64, Mega32 is also a total n00b in the game and only won his first match through continual jumping, eventually winning the match because his opponent, VixxenHaxxors, dropped the controller. Where he last left off, he's in a Team Battle with Zelda against KingKirb and Bubbles, an admin. More info as the series progresses. Other Appearances Edit Aside from Smashtasm and its collaborations, Super64 makes cameos in other videos. So far, these include: Super64 makes a cameo in an announcement by TomKitsune, creator of the series\" Smash Fighter, \"where TomKitsune announces voice auditions for Season 2 of Smash Fighter. In this video, Tom thinks Super64 is one of the voice actors auditioning, when he really just wants directions to get to his studio to film Smashtasm. Tom helps him leave by having him yell\" I'M RUNNING ACROSS THE STREET WITHOUT LOOKING BOTH WAYS! \", which causes him to get sent flying away via hammer to the face from Judge Dedede. Name origin Edit Super64's username comes from Mario's first 3d platformer, Super Mario 64, without the word\" Mario' in between. Trivia Edit Had Super64 fallen for Princess H's trap, he could have easily wall-jumped out. The reason Super64 plays as Mario may be to reflect the fact that Mario is a prominent protaganist in many Nintedo games. Smashtasm characters Super64 - 1337f0x - Killa7 - Link - Lamp - Pimpachu - BlakBerri - Greg - PrinceRok - MewZERO/LuZERIO - KingKirb - Narrator - Pakkery - Grant - Gront - Girem6 - Meta-Dark - Princess H - Spead - Extra Characters Retrieved from \"http: //smashtasm.wikia.com/wiki/Super64? oldid=8310\" Categories: Season 1 Characters Season 2 Characters Characters"}, {"articleID": "2019091508_00122158_W", "names": {"Frank Warren": ["Q1444412", "Q23657144", "Q5490233"]}, "date": "2019-09-15", "url": "http://iwcp.co.uk/sport/national/17903695.tyson-fury-beats-otto-wallin-unanimous-decision-despite-deep-cuts/", "content": "Tyson Fury beats Otto Wallin by unanimous decision despite deep cuts By Press Association 2019 Tyson Fury 0 comment Tyson Fury had planned to celebrate his victory over Otto Wallin with a night out on the famous Las Vegas Strip but instead spent it in hospital after coming through a bloody 12-round battle. The 31-year-old former world heavyweight champion was taken to the University Medical Center of South Nevada with a gaping gash over his right eye and another smaller one on the eyelid immediately after his unanimous points decision win. It was not the end to the night--or the fight--Fury envisaged against the relatively-unknown Wallin, making a significant step up after 20 previous unbeaten bouts. Tyson Fury arrives in the arena before fighting Otto Wallin (Isaac Brekken/AP) The Mancunian, wearing a sombrero and poncho, played to the \"home' crowd on Mexican Independence Day weekend by making his way to the ring on a wheeled platform accompanied by a mariachi band and stilt walkers waving red, white and green flags. It was virtually the best the T-Mobile Arena saw of Fury as he was hampered by blood running into his eye for nine rounds, boxing with the fear he could be stopped at any moment and with it would go his 30-fight unbeaten record as the cut was not caused by a clash of heads .\" I got caught on the eye and that changed the fight. For the majority I could not see out of the eye. Then there was a clash of heads and I got cut again, \"Fury, who finished the fight with his white shorts stained pink, said just before he was taken away to be stitched up, missing his post-fight press conference .\" I haven't seen the cut, it feels quite bad, but I'm the Gypsy Warrior. It's all heart and determination. If I can keep going, I will keep going. \"The fight was a stop-gap before an expected rematch against Deontay Wilder after the pair's controversial draw last December. Tyson Fury was badly cut in the third round (Isaac Brekken/AP) And although it did not go exactly to plan Fury is confident there will be plenty of recovery time ahead of an anticipated February meeting .\" Deontay Wilder, I want you next, bum. That's put me in good stead for the big dosser, February 22nd, \"he added. Asked about his immediate plans he said:\" Let the cut heal, have some time to relax with the family. \"Referee Tony Week called in the doctor towards the end of the sixth round and made several trips to Fury's corner to ask them to deal with the cut, their response being to smear it in huge blobs of Vaseline and hope for the best. It was a tactic which did not appear to have any sustainability as the grease immediately dropped off and Fury was forced to continually wipe away the blood. Well that was overblown--and suitably @ Tyson_Fury - esque pic.twitter.com/gNHPCq7aJ4--Carl Markham (@ carlmarkham) September 15, 2019 Fury knew he had to try to finish it quickly and landed two big right-handers in the seventh, one which rocked Wallin back onto the ropes, and more punches found their target in the next two rounds as his opponent looked to be tiring. Wallin gave it one final shot, connecting with one swinging left early in the last round, but it was not enough to prevent Fury claiming a unanimous 116-112, 117-111, 118-110 victory .\" Tyson is OK. We all know Tyson has the boxing ability and skill set but sometimes you have to be able to fight as well and Tyson was able to show he could do that, \"said Fury's trainer Ben Davison in the fighter's absence for media duties. . @ Tyson_Fury showed true grit to dig deep and win after a terrible cut to the eye. Heart of a Champion. Fair play to Otto Wallin who came to win. The Tyson Fury Roadshow rolls on! pic.twitter.com/tJXus6BLeZ--<mark>Frank Warren</mark> (@ frankwarren_tv) September 15, 2019 Wallin admits he targeted Fury's eye but could not find the decisive blow .\" I tried to stay on it and I wish I could have capitalised more, \"said the Swede, who lost his father to a heart attack in May .\" Earlier in the evening Morecambe's Isaac Lowe successfully defended his WBC international featherweight title, extending his unbeaten record, after a hard-fought points win over Ruben Garcia Hernandez. 0 comment"}, {"articleID": "2010093008_00290085_W", "names": {"Steve Evans": ["Q16213945", "Q3498920", "Q43239745", "Q7612499", "Q7612500", "Q7612502", "Q7612503"]}, "date": "2010-09-30", "url": "http://worcesternews.co.uk/sport/khfc/news/8423468.Money_isn_t_everything_for_Harriers_boss/?ref=rss", "content": "money isn't everything for harriers boss (from worcester news) believes his side can match moneybags crawley town in saturday's blue square bet premier clash. <mark>steve evans</mark>' side have splashed the cash this summer and assembled a squad with the aim of winning promotion to the football league. in contrast, harriers' manager has had a smaller budget to rebuild his team. \"money isn't everything, it can buy players but it can't buy effort and desire and we'll certainly make sure we put plenty of that in at crawley,\" commented burr. \"it's going to be a very difficult but we'll want to be going there and pulling off a surprise .\" burr's boys proved they can beat the top sides, defeating afc wimbledon on sunday, but will also be aiming to bounce back after tuesday's loss to bath. harriers, who entertain gateshead in the league on tuesday night (7.45 pm kick-off), have also moved quickly to secure the services of defender ollie thorne for the rest of the season. the 21-year-old had joined harriers on a non-contract deal from newport on the final day of the transfer window, but was attracting interest from a host of clubs after some impressive displays. burr said: \"we're pleased to have ollie signed for the rest of the season, he's done a fantastic job since coming in .\" it's important now he keeps that level of performance up for the rest of the campaign. \"even thorne's presence could not prevent harriers' 2-0 loss to bath on tuesday night at twerton park. defeat was their first in seven conference premier games. burr said:\" i'm bitterly disappointed because i felt we played quite well and i think the goal just before half-time has killed us a little bit, because it meant we were chasing the game. find your next job now in worcestershire and beyond worcestershire homes for sale and to let"}, {"articleID": "2018072000_00137230_W", "names": {"Sarah Sanders": ["Q24698460", "Q27986907", "Q30961180", "Q3473414"]}, "date": "2018-07-19", "url": "https://www.theepochtimes.com/trump-rejects-putins-offer-asks-for-extradition-of-indicted-officers_2598502.html", "content": "Trump Presidency Politics Related Rand Paul Defends Trump Amid Backlash Over Summit With Putin Trump Rejects Putin's Offer, Asks for Extradition of Indicted Officers By Ivan Pentchoukov July 19, 2018 6:35 pm Last Updated: July 19, 2018 7:39 pm President Donald Trump and the Russian President Vladimir Putin hold a joint press conference at the Presidential Palace in Helsinki, Finland, on June 16, 2018. (Samira Bouaou/The Epoch Times) Share Tweet Share Email LINKEDIN PINTEREST REDDIT TUMBLR STUMBLEUPON President Donald Trump has declined Russian President Vladimir Putin's offer to interrogate the 12 Russian intelligence officers indicted on charges linked to attempted interference in the 2016 U.S. presidential election. At the July 16 summit in Helsinki, Putin offered to submit a request for Russian law enforcement to interrogate the 12 officers, who were charged days before the meeting. The Russian leader further offered to allow members of special counsel Robert Mueller's team travel to Russia and observe the interrogation, under the condition that the United States reciprocate the concession. \"It is a proposal that was made in sincerity by President Putin, but President Trump disagrees with it,\" White House press secretary <mark>Sarah Sanders</mark> said in a statement on July 19. \"Hopefully, President Putin will have the 12 identified Russians come to the United States to prove their innocence or guilt .\" Mueller filed the indictment against the Russian officers on July 13 at the U.S. Court for the District of Columbia. The indictment charges that the Russians hacked into Democratic computer systems, stole emails and files, and disseminated the loot with the intention of interfering in the 2016 election. The United States does not have a standing extradition treaty with Russia. Complicating matters further, since 2014, members of Russia's active military, intelligence, and law enforcement are prohibited by an internal directorate from traveling outside Russia, except to a few countries including China and Vietnam. All 12 of the Russian nationals named in the indictment are members of the Russian military intelligence agency formerly known as the GRU. In addition, the Russian constitution shields its citizens from extradition and deportation. As a result, extradition of nationals from Russia is extremely difficult and rare. The United States has succeeded in extraditing several Russian nationals for computer crimes in recent years, but in all cases, they were not in Russia at the time of the extradition. During the summit, Putin referenced a treaty between the United States and Russia that allows for cooperation between the two nations on criminal investigations. Signed in 1999 by President Bill Clinton and approved by the Senate in 2001, the treaty establishes a process for law enforcement agencies to carry out criminal investigations at the request of their counterparts. Trump's rejection of the offer comes after a nearly four-day media onslaught following the summit. Major news outlets with a track record of anti-Trump coverage seized on his remarks at the summit to paint a picture of American surrender. Despite measured statements by both leaders and signals of a warming relationship, commentators compared the summit to Pearl Harbor and 9/11. \"The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media,\" Trump wrote on Twitter on July 19. The Summit with Russia was a great success, except with the real enemy of the people, the Fake News Media. I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear....... .--Donald J. Trump (@ realDonaldTrump) July 19, 2018.... proliferation, cyber attacks, trade, Ukraine, Middle East peace, North Korea and more. There are many answers, some easy and some hard, to these problems...but they can ALL be solved!--Donald J. Trump (@ realDonaldTrump) July 19, 2018 \"I look forward to our second meeting so that we can start implementing some of the many things discussed, including stopping terrorism, security for Israel, nuclear proliferation, cyber attacks, trade, Ukraine, Middle East peace, North Korea and more,\" he wrote. \"There are many answers, some easy and some hard, to these problems...but they can ALL be solved!\" At the summit, Putin said that Russia didn't meddle in the 2016 election. Standing alongside Putin, Trump told reporters that he has confidence in American intelligence agencies and that Putin offered him a \"powerful\" denial when they met in private. After the summit, and with the media in overdrive about his comments, Trump corrected a single word from his statement in Helsinki and again affirmed his support of the U.S. intelligence agencies. \"It should have been obvious. I thought it would be obvious, but I would like to clarify, just in case it wasn't. In a key sentence in my remarks, I said the word\" would' instead of \"wouldn't,'\" Trump said on July 18. \"The sentence should have been,\" I don't see any reason why it wouldn't be Russia .' \"Trump's request for the Russian officers to stand trial mimics Putin's own take on how the meddling allegations can be resolved. When discussing the allegations at the summit, Putin told a reporter that only a court of law could have the final say on the issue .\" Do you believe the United States is a democracy? \"Putin said .\" And if so, if it is a democratic state, then the final conclusion in this kind of dispute can only be delivered by a trial by the court, not by the executive--by the law enforcement. \"In announcing the charges against the Russian officers, Deputy Attorney General Rod Rosenstein said that the indictment contains no allegation of a crime by an American citizen. Rosenstein noted that Trump was briefed on the charges ahead of the announcement. Watch Next: US Leaves UN Human Rights Council\" If the righteous many do not confront the wicked few, then evil will triumph. \"Share Tweet Share Email ❯ See more Trump Presidency Democrats' Lack of Support for ICE Could Hurt in Midterms July 19, 2018 Trump Thanks Novartis, Pfizer for Putting Off Drug Price Hikes July 19, 2018 Kavanaugh's Former Students Send Letter to Senate July 19, 2018 Editor's Picks In Photos: President Trump and the First Lady's Trip to Europe Read more President Trump:\" Where Is the Server?' President Donald Trump, during a joint press conference with Russian President Vladimir Putin, questioned what happened to three...Read more Barclays Leads European Banks' Pursuit of Risky US Debt When an indebted infant health-care company in Atlanta wanted to borrow hundreds of millions of dollars to buy...Read more Trump and Putin Finish Meetings on a High Note Update at 7:25 p.m. local time / 12:25 a.m. EDT Trump and Putin finished their time together with...Read more"}, {"articleID": "2009111210_00217924_W", "names": {"Robert White": ["Q1726234", "Q173845", "Q2125056", "Q21598417", "Q25190359", "Q51585369", "Q53837056", "Q54556503", "Q58150224", "Q7351007", "Q7351012"], "John Mcnulty": ["Q16136844", "Q16200339"], "Helen Bennett": ["Q21070480", "Q6807968"]}, "date": "2009-11-12", "url": "http://nhregister.com/articles/2009/11/12/news/milford/b4-miveterans.txt", "content": "by brian mccready, milford bureau chief milford - veterans day has special meaning for donna lasella. lasella's husband, lt. col. patrick lasella, a pilot with the new york air national guard, is deployed overseas. lasella and her son, justin, 8, attended the city's annual wreath laying ceremony wednesday morning. the ceremony began in front of city hall at the world war i monument, and then moved to the green and other war monuments located there. the crowd of about 100 people featured a mix of veterans, officials, children and parents. \"it's nice that my husband is helping his country,\" lasella said. \"veterans day means more to my son because my husband is serving his country .\" justin lasella said it's \"cool\" to be a part of the ceremony honoring veterans, and thanked the veterans for \"fighting for us .\" donna lasella, who is den leader of cub scouts pack 721 at st. mary's school, said she wanted to attend the ceremony because it's important youths know veterans day is more than just a day off from school. frank bromley, 87, who spent 33 days at iwo jima in world war ii and was a member of the marine corps, said he was thankful to god to still be alive. \"we saved a lot of american lives...and that is why we are here today,\" bromley said. <mark>robert white</mark> said he attended the ceremony to \"pay respects on veterans day .\" \"people have to remember it's not just a shopping day. there is a reason for having today off,\" <mark>white</mark> said. peter seaholm, who was in the navy from 1958 to 1961, said he attended the ceremony because veterans day is very important to him. \"we have to support (our veterans) and defend (the country),\" seaholm said. eileen and <mark>john mcnulty</mark> said they attended to pay tribute to the veterans. \"we always need to remember the sacrifices they made for their country,\" said eileen mcnulty. the mcnultys brought their grandson, christopher kiley, 7, and said it's vital that the youth remember the sacrifices made for their benefit. mayor james l. richetelli jr. thanked all of the veterans groups for their attendance, and their service to the country. \"we thank all of you who are here to remember the real meaning of veterans day,\" richetelli said. \"milford is a great town and every year we go above and beyond the call of duty for those who have given their lives for our country. we make sure milford never forgets. we always remember why we are here. america is a great place to live .\" the following are comments from the readers. in no way do they represent the view of nhregister.com. we encourage your feedback and dialog and ask you to follow a few simple guidelines when commenting on stories on nhregister.com. 1) please post responsibly. 2) be polite. 3) don't hate. 4) if you object to someone's post, use the \"report abuse\" button and we'll review it. 5) users who don't play by the rules will be blocked and won't be allowed to participate. 6) self-promotion of businesses or advertisements of anything for sale are not permitted. ex-teacher sent to prison for sex with students blumenthal may have eye on u.s. senate tv/radio editor joe amarante offers his take on all things media. cinematic for the people the register's cinemaphile nick r. scalia goes beyond the previews with his movie match column and more. register entertainment editor pat ferrucci talks music, entertainment and the boston red sox. vegging out <mark>helen bennett</mark> harvey promises that no animals were harmed in the making of this blog. columnist randall beach's rambling ruminations on the issues and characters of new haven and other connecticut towns, with occasional deviations across the state line. kid you not believes in the wizard of oz style of parenting: all you need is a brain, some courage and a heart. oh, and some jager."}, {"articleID": "2012080317_00043289_W", "names": {"Ramon Ramirez": ["Q1141282", "Q7290548", "Q903686", "Q956482"], "David Wright": ["Q1173399", "Q16217703", "Q21288738", "Q21453256", "Q22122541", "Q260844", "Q2631275", "Q29643824", "Q42323023", "Q45305146", "Q47353608", "Q5241306", "Q5241307", "Q5241308", "Q5241312", "Q5241313", "Q5241314", "Q54675733", "Q57697274", "Q57893530", "Q684849"], "Matt Harvey": ["Q3299470", "Q6788770"], "Jeff Stevens": ["Q3176591", "Q6175055"], "Josh Johnson": ["Q1057295", "Q14950210", "Q22005668", "Q3810314", "Q47540935", "Q6289028"], "John Buck": ["Q14944060", "Q3181146", "Q51585769", "Q6223748"], "Carlos Santana": ["Q2367902", "Q5042623", "Q819016"]}, "date": "2012-08-03", "url": "http://amazinavenue.com/2012/8/3/3216893/this-week-in-mets-quotes", "content": "view full size photo? \"> lots of interesting, funny, idiotic, and insightful things were said by the mets - and about them - over the past week. here are some of our favorites .--warthen continued\" i'm not the fielding coach, amirite?' <mark>ramon ramirez</mark>'] era should be in the high twos right now, with plays that should have been made and things that happened in the course of the game. overall, we take about 11 or 12 of those runs off the board that should be off, and we get the guy that we bargained for. \"- dan warthen [wall street journal] and the mets are kind of still in the playoff race espn] right, because who would want to a piece that is genuinely going to make them better\" i'm really hoping [scott hairston's] in my uniform [tonight], and i have no reason to believe he won't be. i know that if he is moved it's for a piece that is genuinely going to make us get better, so i hope he's still here. \"- terry collins [i don't think\" spin knows how family is treated in the mets clubhouse \"at the time you get mad, but what can i do? i'm not going to fight with anybody in here. we're a family in here. sometimes they do it to be happy, have fun .\" - jordany valdespin regarding his teammates cutting the sleeves of his t-shirt and writing \"el hombre\" on the back as well as other markings. [espn] is <mark>wright</mark> the captain or the godfather? \"no, no, no, no. i'd never do that [regarding damaging someone's personal belongings .] you know why? you've got to respect everybody. the example here is this guy, <mark>david wright</mark>. he's the captain of the team and he respects everybody ....the respect is very important on this team .\". \"- jordany valdespin [espn] not sure why thole would be his first pick? espn]? my money might be on ike though\" they did a good job, though. \"- espn] but why would you want to start dickey on short rest nj.com] that's some good trolling but please go on\" i guess there could be a lot of reasons from [dickey's] personal standpoint. from our standpoint, it's possible the more often we get him out there, the better we're going to do won-loss wise. but we've got to take into account what effect that would have not just this year on r.a. and on the rest of the pitching staff, but what effect that would have on r.a. going into next season. so that's very much just in a discussion stage at this point. \"- sandy alderson [nj.com] but did everybody know that you knew that everybody knows? pretty sure that's the difference between aa and the majors .\" i was doing what i want to do, throwing my splitter. i knew everybody knows what i'm going to do. everybody knows what i was working with. they were seeing the ball, but they weren't hitting the ball in the air. it was more like a groundball or low line drive where we got a good chance. i can live with that. \"- pressconnects] call me muscles\" hey, me 1-0. \"- espn] eh a good attempt but stick to slick fielding and hrs, ruben\" look, i need you to step up tonight. \"- terry collins speaking to tejada pregame\" i'll try. \"- tejada\" well, i can get a truck driver to try. \"- collins\" [ruben after hitting his first hr] just came in my office [afterward] and asked me if i can drive a truck. \"- terry collins [espn] there is no book\" we probably don't want [zack wheeler] to go much past 150 this year. so if you look at what he has left--i think he's got 115 or 116 innings right now--he's probably got enough left to get him through august in buffalo. but i'm not sure there are going to be any innings left at the end of august. so i think it's unlikely we'll see him. <mark>matt harvey</mark> is in a similar situation. he threw, i think, 135 innings last year. we're looking at 165, 170 for him. i'm not saying that's the magic number--just in terms of where we should end up at the end of the season, far short of 200. that may get him through the middle of september. it may get him through a little bit longer than that. but we certainly have to keep an eye on that. \"- sandy alderson [espn] nitkowski is 39\" man, i was the oldest player until you got here [binghamton .] \"- <mark>jeff stevens</mark> to chris nitkowski .\" how old are you? \"- nitkowski espn] and fast\" things happened real quick out there. this game is real fast, and it can humble you quick. \"- jonathon niese [new york times] i think ike is blaming the babip dragon\" i feel confident enough at the plate now that if i see a pitch i can handle, i can do some damage with it, \"he said .\" it'd be nice to find some holes occasionally, which hasn't happened all year. i haven't gotten that bleeder in the hole or the normal ground ball that gets through somewhere. \"- ike davis [new york times] sitebot facepalm of the week marlins are in firesale mode should the mets trade <mark>harvey</mark> and wheeler for <mark>josh johnson</mark> i mean i know everyone loves prospects but we'll be lucky if both those guys combined turn out to be as valuable as <mark>johnson</mark> is now? think about it. we need a legit ace / horse and <mark>johnson</mark> is under contract through 2013\" - nite cap: niese leads mets past giants, tejada hits second career home run this week in sny, featuring terry collins' bad habit, sny's spelling issues, and ike davis' fan club mets trade rumor: jason bay to the marlins for heath bell and <mark>john buck</mark> ronny cedeno can hit applesauce: cedeno leads mets to victory, wheeler unlikely to see the majors in 2012 <mark>carlos santana</mark> was surprised to learn his ground-rule double was actually a homer the juice: rangers gladly take split against angels, oakland stays hot with win over jays"}]