[{"date": "2014-05-22", "url": "http://triblive.com/news/fayette/6152652-74/stolen-allen-railroad", "content": "A Bullskin scrap yard operator who was sentenced this month to probation and fined $2,000 after admitting his role in a Fayette County chop shop operation was charged on Wednesday with accepting large amounts of stolen railroad equipment for scrap. Rodney <mark>Francis Allen</mark>, 64, the owner of B & R Recycling at 145 Bellview Drive, and his wife, Linda, 59, who co-owns the business, were arraigned on Wednesday on a charge of receiving stolen property for allegedly possessing large, steel railroad tie plates that were stolen in April from CSX Corp.. Trooper James Pierce said investigators recovered 795 steel tie plates that were stolen from the railroad inside a Dumpster at the couple's business. He said the steel scrap is valued at more than $7,000. The Allens were released on signature bond after the arraignment before District Judge Richard Kasunic II, pending a preliminary hearing on May 29 before Connellsville District Judge Ronald Haggerty. The Allens did not return telephone calls seeking comment. On May 9, Rodney <mark>Allen</mark> pleaded no contest to receiving stolen property for his role in the theft of a 2005 Ford F-150 truck from Davies Ford in Connellsville Township in 2011 and allegedly using parts to repair another truck. Under the plea agreement, <mark>Allen</mark> was sentenced by Judge <mark>Joseph George</mark> to serve one year of probation and pay $2,000 in restitution, plus court costs. He originally was charged with owning, operating and conducting a chop shop; conspiracy for operating a chop shop; disposing of an illegally obtained vehicle; and theft, but those charges were dropped as part of the plea agreement. The charges stem from a case in March 2011 when <mark>Allen</mark>; his nephew, Joshua DeWitt, 28, of Connellsville, and Dale Robert Naugle, 30, of Tidioute in Warren County, a former employee of <mark>Allen</mark>'s, were accused of stealing a truck from Davies Ford and dismantling it to use for parts for one of <mark>Allen</mark>'s trucks. After executing a search warrant at <mark>Allen</mark>'s garage at 169 Bellview Road in Bullskin, police located the stolen truck, which had been stripped of parts. Charges against DeWitt were dismissed. Naugle pleaded guilty to conspiracy for operation of a chop shop and was sentenced earlier this year to serve six to 23 months in jail. Pierce said criminal charges of theft and conspiracy are pending before District Judge Wendy Dennis against Justin A. Pirl, 26, of Normalville and <mark>Joseph</mark> E. Miller, 30, of White, who also allegedly were involved in the thefts of the CSX materials. \"Investigation revealed that most of the tie plates were stolen by Pirl and Miller from CSX railroad tracks near Confluence on the Fayette County side,\" Pierce said. TribLive commenting policy You are solely responsible for your comments and by using TribLive.com you agree to our Terms of Service. We moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where readers can share intelligent and informed commentary that enhances the quality of our news and information. While most comments will be posted if they are on-topic and not abusive, moderating decisions are subjective. We will make them as carefully and consistently as we can. Because of the volume of reader comments, we cannot review individual moderation decisions with readers. We value thoughtful comments representing a range of views that make their point quickly and politely. We make an effort to protect discussions from repeated comments - either by the same reader or different readers. We follow the same standards for taste as the daily newspaper. A few things we won't tolerate: personal attacks, obscenity, vulgarity, profanity (including expletives and letters followed by dashes), commercial promotion, impersonations, incoherence, proselytizing and SHOUTING. Don't include URLs to Web sites. We do not edit comments. They are either approved or deleted. We reserve the right to edit a comment that is quoted or excerpted in an article. In this case, we may fix spelling and punctuation. We welcome strong opinions and criticism of our work, but we don't want comments to become bogged down with discussions of our policies and we will moderate accordingly. We appreciate it when readers and people quoted in articles or blog posts point out errors of fact or emphasis and will investigate all assertions. But these suggestions should be sent via e-mail. To avoid distracting other readers, we won't publish comments that suggest a correction. Instead, corrections will be made in a blog post or in an article. Fayette scrap yard owner, wife charged with receiving stolen goods eTrib The eTRIB is an electronic version of your favorite daily Trib Total Media newspaper edition. You can read the Trib-or any of our other daily newspapers-anywhere, anytime! Read the eTRIB on your tablet, smartphone, iPad or iPhone. Available eTRIB editions include the Pittsburgh Trib, Greensburg Trib, Valley News Dispatch, Valley Independent, Daily News, Daily Courier and Leader Times. Print Source Welcome to PrintSource, a division of Trib Total Media. We have established a veteran team that provides daily and weekly newspaper companies with a comprehensive set of services that include design, print, packaging and delivery of their products, all from one source and location. Gone are the days when each facet of newspaper printing and delivery had to be outsourced to different companies and venues. Now, PrintSource provides a viable solution with just one phone call. Digital Sales We offer a wide variety of traditional and new digital advertising options customized to fit your needs! Whether you're just starting out, or you've been a keystone in the community for years, our knowledgeable staff can provide you with a customized package including online banners/advertisements, Social Media Marketing (Facebook / Twitter), Website development, Search Engine Optimization, Email Marketing solutions and much more! Images and text copyright? 2014 - Trib Total Media, Inc. .", "articleID": "2014052211_00027477_W", "names": {"Francis Allen": ["Q23302652", "Q52637531", "Q5479982"], "Joseph George": ["Q2405425", "Q56561702"]}}, {"date": "2014-05-22", "url": "http://92moose.fm/destinys-child-reunite-michelle-williams-say-yes-listen/", "content": "Destiny's Child Reunite on <mark>Michelle Williams</mark>' New Song \"Say Yes!' [LISTEN] <mark>Michelle Williams</mark>' new song\" Say Yes!' The uplifting tune, which takes lyrics from a traditional Nigerian gospel hymn, features Spin reports. <mark>Williams</mark>, who currently stars on Broadway in \"Jesus Christ Superstar' alongside JC Chasez, is in a bit of a religious mode, as\" Say Yes!' is all about glorifying God and letting him guide the way. It will be featured on her upcoming gospel record, \"Journey to Freedom .'\" When Jesus say yes, nobody can say no, \"<mark>Williams</mark> sings on the chorus of the gospel song. And the verses are equally as praise-worthy .\" Where you lead me, Lord, I will go, \"Beyonce croons on one line .\" I have no fear 'cause I know who's in control. \"While the new song was met with praise by the fans, <mark>Williams</mark> took to Twitter to reveal that the leaked track was unfinished: Time Out for Sports Talk: Spring Cleaning Before Unofficial Start of Summer Lady Gaga, Hot Chelle Rae + One Direction Rule Top 10 Video Countdown - Vote for Next Week's Countdown! Destiny's Child Reunite on <mark>Michelle Williams</mark>' New Song\" Say Yes!' [LISTEN] Is \"Edge Of Tomorrow' The\" Groundhog Day' Of Alien Movies? (And 24 Other Urgent Questions) David Krumholtz Brings You the Weather From a Very Funny Old Jewish Lady Epic Games Created a Flappy Bird Clone with Unreal Engine 4 Mojang Digs Up Details On New Minecraft Editions? Jake Owen Fan Says He's Her \"Second Favorite' [Video]? It appears that you already have an account created within our VIP network of sites on YES, Activate My Account Now! * Please note that your points, prizes and activities will not be shared between programs within our VIP network. It appears that you already have an account on this site associated with. To connect your existing account with your Facebook account, just click on the account activation button below. You will maintain your existing profile and VIP program points. After you do this, you will be able to always log in to http: //92moose.fm using your Facebook account. * Please note that your points, prizes and activities will not be shared between programs within our VIP network.", "articleID": "2014052304_00069314_W", "names": {"Michelle Williams": ["Q156796", "Q229153", "Q23893381"]}}, {"date": "2014-05-22", "url": "http://kissingsuzykolber.uproxx.com/2014/05/french-weddings-suck-dog-balls.html", "content": "Getty Image Bonjour! We'll get to your questions in a bit, but first we gotta talk about France. Now, France is great. Paris is one of the greatest cities in the world. But if you're an American who's moved there and prefers the French lifestyle, do your home nation a favor and DON'T write about why you prefer French culture. Please don't. Pretty please. Because I guarantee that you will sound completely insufferable. Of course, the most famous example of this is Pamela Druckerman's Bringing Up B? b?, in which the Paris-based American author presents a step-by-step accounting of how French parents are better than American ones because they put their own happiness first and inoculate their children to secondhand smoke at an early age. French Weddings Are More Fun, featured in NY Mag's The Cut. It's all terrible, but I've selected a few choice passages to share with you: I'm an American who has lived in Paris for seven years. Of course you are! (The sentence above is the universal sign for rational people to X out of a browser window .)... \"Dating\" as we know it in the U.S. doesn't really exist in Paris. The second you sit down to a drink with someone, you're in a relationship. There's no playing the field, and there's no \"Wait, are we dating?\" conversation. People break up or get serious. That sounds...awful. \"Sorry, I can't have coffee with you. I had coffee with someone on Tuesday, and we haven't broken up yet .\" Like, American dating is depressing and enervating, but the best way to meet the right partner for you is to meet a lot of people. And while relationships might progress quickly, engagements often last for years. If you decide to get married, then plan a wedding and get married and start getting your tax breaks. Long engagements are pointless and shitty. Need proof? Watch The Five-Year Engagement. That movie blew ass. In France, the very act of getting engaged takes forever. The man asks the woman's father for her hand, and he then proposes with a ring. In America, this would be followed by phone calls and a Facebook post, but here the couple keeps the engagement secret until they can tell their families in person. Yeah, that makes tons of sense in France, which is approximately the size of Texas. And a place the size of Texas, though inarguably large, is comfortably navigable by car or train to share the best possible news with your closest loved ones. This isn't the case in the United States, where parents and their grown children on opposite coasts are often separated by an expensive 5-hour flight. SORRY FOR USING MODERN TECHNOLOGY TO BRIDGE IMPOSSIBLE DISTANCES, YOU JUDGMENTAL ASS. The men and women do split up for the bachelor and bachelorette parties. The tradition is to kidnap the bride, whisk her away for the weekend, and make her dress up and perform embarrassing dares in public. Oh, so EXACTLY THE SAME as American bachelorette parties? The weddings themselves are weekend-long affairs. That's in part because in France, only civil marriages are legally binding. So lots of couples have two ceremonies: one legal, one religious. Fabien and Virginie's wedding, for instance, consisted of a Friday-night civil wedding; a religious ceremony, cocktail party, dinner, and reception on Saturday; and a big lunch on Sunday. Once again, this is essentially the EXACT format of most American weddings I've been to: Friday night rehearsal/welcome dinner, Saturday wedding and reception, and Sunday farewell brunch. WEEKEND-LONG AFFAIR. SAME AS FRANCE. The weekend was completely beautiful, with festivities revolving around an old farmhouse overlooking a vineyard on Virginie's family ch? teau in Bordeaux. About 300 people attended, which is average; a 100-person wedding is considered very small. Anyone who's been to a 300-person wedding can tell you that 300-person weddings are fucking TERRIBLE. Fuck you. All of the best weddings I've been to have been about 100 people or less, which (a) gives you a chance to actually hang out with the bride and groom, (b) keeps dinner from taking eight years, and (c) ensures that the quality (and freeness) of food and booze isn't capped by the preposterous number of guests. All of us witnesses went a week early and helped the bride and groom ready the farmhouse. We took down cobwebs, repainted all the shutters, and laid gravel in the driveway...It's traditional for the bride and groom to make gifts for every guest, so we helped them prepare jam and homemade rum punch, and then tied little tickets on each of the 600 jars and bottles. \"French weddings are way more fun for bridesmaids! They require a week of unpaid labor and mindless tasks! I'm a fucking simpleton!\" American weddings might be more ornate, but French weddings have better food and last longer. I'd say they cost about the same, Sounds like rigorous fucking research you did there. because while American-wedding budgets include things like chair covers, French couples spend money on food and drink for hundreds of guests - and on keeping the DJ going until 7 a.m. I recently went to a wedding in California that ended at midnight. I was shocked! The dancing doesn't even start until after midnight in France. That's not a typical American wedding. That's YOUR fault for having shitty American friends. Other Americans are smart enough to rent wooden chairs that don't need covers. I think Americans would also be surprised by the irreverence of French weddings; they defy cultural stereotypes. When the couple makes their entrance at dinner, everyone stands on their chairs and throws their napkins in the air. You've got to be a special kind of dipshit to be impressed by stupid shit just because it doesn't fit into your expected stereotype. \"France: they've got stupid wedding traditions, too!\" Dinner can last for hours as families and witnesses poke fun at the bride and groom through dozens of silly videos, speeches, slideshows, and sketch-comedy routines. Almost exactly like America. (Although if you see a sketch-comedy routine break out at a wedding, please do the right thing and set the venue on fire immediately .) When the dancing finally starts, the music ranges from traditional to cheesy (think: \"It's Raining Men\" ). French weddings: we have the same shitty songs as America's worst weddings! When I get married I think I'll go the French route. I like the sound of a Parisian wedding, one that would be less about my dress and hair and more about family and friends coming together over lots and lots of Champagne. That's not a French wedding. That's just a good wedding. You're terrible. I hope you marry a Frenchman and never write in English again. And now, finally, the mailbag gets to your questions. Hi Cavey, FFL: My football question has to do with offseason research: I'm always looking for better ways to figure out who's going to make a good late draft pickup, so I'm wondering if you have any tidbits you can toss our way. I take a look at 2nd/3rd year receivers, kick the tires on RBs to look into things like #of carries last year and age, and try to think about what QB/WR pairings are looking promising for the next year. Any non-trademarked secrets you can cast off to us? Seems like you're in the right ballpark. I won't draft a running back in his 30s (<mark>Steven Jackson</mark> was the easiest bust to avoid last year), and a heavy load of touches is cause for concern. LeSean McCoy and Marshawn Lynch were the only backs with 300 + carries in 2013, and while that's not a dealbreaker, I will probably bump them down my draft board a spot or two because of it. Elsewhere, seek out offensive-minded coaches and talented quarterbacks. Take the second wideout in a great offense before the first wideout in a mediocre one. And don't sleep on boring QBs surrounded by great assets - <mark>Jay Cutler</mark>, <mark>Andy Dalton</mark>, and Josh McCown are all going to be perfectly serviceable if you miss out on Brees and Manning. Relationships: My girlfriend's best friend just recently got into in a whirlwind romance with a new guy, and, quite against the best friend's type, has let things progress quite quickly and has now moved in with him after just a few months. Also against type is that when they're in public, they're the couple who cuddles all the fuck over each other all the damn time (this despite her anger when single about any other couple showing intimacy; fuck that). This dramatic change, of course, is of concern to my girlfriend, me, and the rest of the social circle that is close with the best friend. Prior to dating this guy, the best friend agreed to come join the rest of our social circle in our annual long weekend trip out to the coast (Pacific NW, so you can't really say \"beach'), where we rent a nice place, eat richly, drink heartily, and have fun. Once the best friend got with new guy, she asked to bring him along and we all said that's cool. Well, now it's become rather annoying because despite knowing months ahead of time the dates (memorial weekend), he's now apparently hosting some friends for a night and attending his friend's improv comedy gig at the circus-themed bar in town (jeebus asshole christ; trust me, it's even worse than it sounds), so they're now coming for a little bit on Saturday before heading back into town and then coming back to the coast on Sunday, which, hey, their choice, but it's just stupid. I should mention that we are all in our mid thirties or older. So the guy you don't like is going to spend LESS time hanging out with you? What's the problem? So, to the questions: 1 .) when am I allowed to kick him in the dick? and 2 .) how do I best restrain myself from yelling\" I TOLD YOU SO \"when this relationship goes south? Actually, no, the real convoluted question is: at what point and how do we talk to the best friend and tell her that while we're happy for her new relationship, this sudden high-school level PDA and flakiness on the rest of her friends needs to be dialed way the hell back? Thank you and keep up the good work, Obviously Someone Zesty Step 1 is chill out a little bit. Not everyone in your perfect little circle of friends is going to select sexual partners that mesh with the rest of the group. Your social circle is not fixed, and best friends aren't always forever. Friendships have ebbs and flows, and the ebbs are never more likely than when one of the friends gets into drugs or dates someone who's into improv. So don't be upset about one friend missing part of a weekend because of her stupid boyfriend. Focus on enjoying your time on the coast - and, of course, talk MAD shit about them with everyone else while they're at the improv show. Of course, this doesn't solve the PDA issue when they're in your presence. I think that some gentle teasing would help here: I've always enjoyed\" GET A ROOM! \", but\" Hey, knock it off, you two. I'd like to have an appetite for dinner \"could also work. They'll either get the point or stop wanting to hang out with you, so win-win. Or you could do something REALLY out of the box and just be glad that your girlfriend's best friend is happy instead of her usual M.O. of bitching about couples making out ....yeah, probably not. ********** It's wedding season again, which reminded me that I need to thank you for the excellent advice you gave me last year (Sex: I've been dating a great girl since last July. I'm going to a slew of weddings this summer that I'd like her to attend with me. What's the protocol for out-of-town weddings for my friends? Should I take care of the travel costs (including her airfare)? Or is it reasonable to ask her to pay for some/all of those costs? If it matters, we have roughly similar income. Sincerely, Mile High Club Hopeful Talk it out with her. If she doesn't know your friends who are getting married, then the onus is on you to pick up the bulk of the expenses. However, given the cost of flying across the country, that makes for an awfully expensive date. Since you're on equal financial footing and will be approaching the year-mark of the relationship, I think it's reasonable for her to pay for her own airfare, but you pick up the cost of the hotel. Hotel sex is the best! As you suggested, we talked about it and agreed to split the costs along those lines (she paid her own airfares, and because they were my friends, I paid for most or all of the hotels/rental cars/gifts). Traveling with her made each trip and each wedding so much better, and though it sounds corny, I think we felt more in love after each one. We're traveling to 3 more weddings this summer and using the same arrangement (including her paying for the larger share when it's a wedding of her family/friends). And yeah, hotel sex is awesome. I copied and pasted this into the mailbag without realizing there was no question. The responsible and professional thing to do here would be to cut this out and send an email thanking the reader, but fuck that. If <mark>Peter King</mark> doesn't have to edit his shit, why should I? SAVOR MY BLOATED WORD COUNT. ********** Captain, Sex: I love reading the mailbag each week and really appreciate your insights. My boyfriend of a few months broke up with me this week and I was blindsided. Looking back, I realize I shouldn't have been. We weren't getting along very well recently. We were friends for a while and we started dating soon after my previous, emotionally draining relationship ended. I realized too late that I probably need more time to recover from that but didn't really know what to do. I let jealousy and stress of other things in my life (new job, moving) impact the way I was treating him (getting upset over little things, not letting shit go, being a bitch, etc.) I was taking him for granted and I went too far. I really do care about him and I love spending time with him. I'm kicking myself for acting this way. Hey, that's really mature of you. Circumspection and self-awareness aren't easy, especially in the wake of a break-up. I love your Post Breakup Guide and recommend it to anyone who is going through a tough breakup, but my question is what is your advice on winning someone back? I have a new perspective on my actions and it's definitely out of character for me to act this way, but I'm not sure how to go about showing him this is the case. The breakup was amicable and I agree with all the points he made. I just want an opportunity to show that things can and will be better. I suggested we try to take a break for a couple weeks and see what happens, but he said a break and breakup are one and the same to him. He wants to stay friends, still talk and see what happens from there. We have a lot of mutual friends so we will see each other at social events, etc.. How should I approach this? - Idiot Girlfriend I think you can tell him everything you wrote in your first paragraph (assuming you haven't already), and that will go a long way to validating his feelings leading up to the break-up. Never underestimate the power of a heartfelt apology. That said, you don't have to cheat on someone to wreck a relationship beyond repair. Bitchiness and jealousy can have a lasting impact on a person's psyche, and - regardless of your friendship or mutual friends - his impulse on seeing you might be\" I'm so glad I'm not dealing with her shit any more. \"Recognize and respect his feelings and need for distance. Shorter answer: cleavage, a tight skirt, and a couple drinks. He's not made of stone. Fantasy: besides the obvious <mark>Sammy Watkins</mark> type rookies to take in fantasy drafts this summer, are there any sleeper rookies that you would recommend taking a look at? <mark>Watkins</mark> will be a key piece of the Bills offense, but he's also not flying under anyone's radar, which means he'll probably come off the board a round earlier than he should. I'd rather turn my sights on Bishop Sankey, running behind a solid Titans line (Shonn Greene and Jackie Battle are in the picture, of course, but are also Shonn Greene and Jackie Battle). <mark>Mike Evans</mark> shows a ton of upside in the Lovie Smith\" Josh McCown throwing to two gigantic wideouts \"offense. Also, Kelvin Benjamin should be a great red zone target for <mark>Cam Newton</mark>, and Eric Ebron is an exciting prospect for the Lions offense. Those are the guys with the most buzz right now. As training camps start and depth charts start to take shape, you'll probably see these guys creeping into the discussion: Jordan Matthews, Eagles. BUY on all Eagles offensive players. Tre Mason, Rams. I think it's still Zac Stacy's job to lose, but Mason has too much talent not to get carries. Brandin Cooks, Saints. Looks like the next boom-or-bust Saints receiver to drive you insane, but could break out with an injury to <mark>Jimmy Graham</mark> or the declining Marques Colston. Carlos Hyde, 49ers. With Frank Gore aging and Marcus Lattimore a question mark, Hyde could become the workhorse for San Francisco. <mark>Jeremy Hill</mark>, Bengals & <mark>Andre Williams</mark>, Giants. Both are incredibly talented backs with good size that may end up as the goal-line backs. Anyway, we'll get more into that as the season gets closer. Only 15 weeks until Seahawks-Packers! Sex: I am engaged and have the wedding set for this fall. Everything in our relationship up until now has been amazing, we've been together for about 2 and a half years and she's the girl of my dreams. However, right now I'm in the middle of a fight between my future wife and my best man, who is also my best friend. He wants to bring his on again / off again girlfriend of about 18 months as his plus one to the wedding, who my fianc? e absolutely hates and does not want there. The girlfriend has treated my best man pretty poorly, she has dumped him multiple times, said she has no feelings for him, uses him when there are no other better options around, etc., but he's always there and takes her back. The best man says he's in love with her and is adamant that he be able to bring her, but my fianc? e is adamant that she is not coming. If I tell my best man that sorry, she can't come, I fear it could ruin/end our friendship. If I put my foot down with the fianc? e and say the girlfriend can come, it could cause a giant rift in our relationship, and would probably be an awful way to start married life together. How should I handle this? I see no good way out of this situation. Wow, okay. That's a lot to unpack. Here are my thoughts, in order: 1. Marriage is a legally binding contract to your life partner. Translation: when in doubt, you side with your wife. 2. Your best friend is pussy-blind. It's regrettable, but it happens to perfectly intelligent people all the time. Eventually, he'll either come to his senses...or he'll marry her. Is your wedding the bridge your wife wants to fight this battle on? 3. The best man is entitled to bring a date. If he and his girlfriend are in\" on-again \"mode, then it only makes sense that he would bring her. 4. Real talk: dictating who the best man can or can't bring as his date is a straight-up Bridezilla move. So, there are some conflicting points there. I have no doubt that your best man's girlfriend is a useless tramp. But you can't do anything about his lack of judgment or self-worth, can you? Marriage is compromise, and it begins with the wedding. EVERY wedding has a guest (or guests) that either the bride or groom doesn't like, but is obligated to include. You invite them as a favor to your partner, or to your parents. On those grounds alone, it would seem that your bride needs to relent and allow Slutty McCunterson to attend. HOWEVER, if your best man and his viper-lady are prone to public fights or any kind of drama that would detract from your celebration or distract him from his duties, then you need to side with your wife, put on your big-boy pants, and explain to your best man why you can't risk your wedding on his penchant for flaky bitches. (And maybe be prepared to get a new best man .) There's not a right answer that makes everyone happy, and that's life for you. It kinda sucks most the time.", "articleID": "2014052305_00013131_W", "names": {"Andre Williams": ["Q16235162", "Q2846286"], "Andy Dalton": ["Q129605", "Q2849092"], "Cam Newton": ["Q5024850", "Q5024852", "Q591678"], "Jay Cutler": ["Q312811", "Q937778"], "Jeremy Hill": ["Q42422137", "Q57833877", "Q6181474", "Q6181476"], "Jimmy Graham": ["Q3808423", "Q6200226"], "Mike Evans": ["Q14951064", "Q1621683", "Q25189874", "Q6846717", "Q6846719"]}}]