[{"date": "2014-05-22", "url": "http://kissingsuzykolber.uproxx.com/2014/05/french-weddings-suck-dog-balls.html", "content": "Getty Image Bonjour! We'll get to your questions in a bit, but first we gotta talk about France. Now, France is great. Paris is one of the greatest cities in the world. But if you're an American who's moved there and prefers the French lifestyle, do your home nation a favor and DON'T write about why you prefer French culture. Please don't. Pretty please. Because I guarantee that you will sound completely insufferable. Of course, the most famous example of this is Pamela Druckerman's Bringing Up B? b?, in which the Paris-based American author presents a step-by-step accounting of how French parents are better than American ones because they put their own happiness first and inoculate their children to secondhand smoke at an early age. French Weddings Are More Fun, featured in NY Mag's The Cut. It's all terrible, but I've selected a few choice passages to share with you: I'm an American who has lived in Paris for seven years. Of course you are! (The sentence above is the universal sign for rational people to X out of a browser window .)... \"Dating\" as we know it in the U.S. doesn't really exist in Paris. The second you sit down to a drink with someone, you're in a relationship. There's no playing the field, and there's no \"Wait, are we dating?\" conversation. People break up or get serious. That sounds...awful. \"Sorry, I can't have coffee with you. I had coffee with someone on Tuesday, and we haven't broken up yet .\" Like, American dating is depressing and enervating, but the best way to meet the right partner for you is to meet a lot of people. And while relationships might progress quickly, engagements often last for years. If you decide to get married, then plan a wedding and get married and start getting your tax breaks. Long engagements are pointless and shitty. Need proof? Watch The Five-Year Engagement. That movie blew ass. In France, the very act of getting engaged takes forever. The man asks the woman's father for her hand, and he then proposes with a ring. In America, this would be followed by phone calls and a Facebook post, but here the couple keeps the engagement secret until they can tell their families in person. Yeah, that makes tons of sense in France, which is approximately the size of Texas. And a place the size of Texas, though inarguably large, is comfortably navigable by car or train to share the best possible news with your closest loved ones. This isn't the case in the United States, where parents and their grown children on opposite coasts are often separated by an expensive 5-hour flight. SORRY FOR USING MODERN TECHNOLOGY TO BRIDGE IMPOSSIBLE DISTANCES, YOU JUDGMENTAL ASS. The men and women do split up for the bachelor and bachelorette parties. The tradition is to kidnap the bride, whisk her away for the weekend, and make her dress up and perform embarrassing dares in public. Oh, so EXACTLY THE SAME as American bachelorette parties? The weddings themselves are weekend-long affairs. That's in part because in France, only civil marriages are legally binding. So lots of couples have two ceremonies: one legal, one religious. Fabien and Virginie's wedding, for instance, consisted of a Friday-night civil wedding; a religious ceremony, cocktail party, dinner, and reception on Saturday; and a big lunch on Sunday. Once again, this is essentially the EXACT format of most American weddings I've been to: Friday night rehearsal/welcome dinner, Saturday wedding and reception, and Sunday farewell brunch. WEEKEND-LONG AFFAIR. SAME AS FRANCE. The weekend was completely beautiful, with festivities revolving around an old farmhouse overlooking a vineyard on Virginie's family ch? teau in Bordeaux. About 300 people attended, which is average; a 100-person wedding is considered very small. Anyone who's been to a 300-person wedding can tell you that 300-person weddings are fucking TERRIBLE. Fuck you. All of the best weddings I've been to have been about 100 people or less, which (a) gives you a chance to actually hang out with the bride and groom, (b) keeps dinner from taking eight years, and (c) ensures that the quality (and freeness) of food and booze isn't capped by the preposterous number of guests. All of us witnesses went a week early and helped the bride and groom ready the farmhouse. We took down cobwebs, repainted all the shutters, and laid gravel in the driveway...It's traditional for the bride and groom to make gifts for every guest, so we helped them prepare jam and homemade rum punch, and then tied little tickets on each of the 600 jars and bottles. \"French weddings are way more fun for bridesmaids! They require a week of unpaid labor and mindless tasks! I'm a fucking simpleton!\" American weddings might be more ornate, but French weddings have better food and last longer. I'd say they cost about the same, Sounds like rigorous fucking research you did there. because while American-wedding budgets include things like chair covers, French couples spend money on food and drink for hundreds of guests - and on keeping the DJ going until 7 a.m. I recently went to a wedding in California that ended at midnight. I was shocked! The dancing doesn't even start until after midnight in France. That's not a typical American wedding. That's YOUR fault for having shitty American friends. Other Americans are smart enough to rent wooden chairs that don't need covers. I think Americans would also be surprised by the irreverence of French weddings; they defy cultural stereotypes. When the couple makes their entrance at dinner, everyone stands on their chairs and throws their napkins in the air. You've got to be a special kind of dipshit to be impressed by stupid shit just because it doesn't fit into your expected stereotype. \"France: they've got stupid wedding traditions, too!\" Dinner can last for hours as families and witnesses poke fun at the bride and groom through dozens of silly videos, speeches, slideshows, and sketch-comedy routines. Almost exactly like America. (Although if you see a sketch-comedy routine break out at a wedding, please do the right thing and set the venue on fire immediately .) When the dancing finally starts, the music ranges from traditional to cheesy (think: \"It's Raining Men\" ). French weddings: we have the same shitty songs as America's worst weddings! When I get married I think I'll go the French route. I like the sound of a Parisian wedding, one that would be less about my dress and hair and more about family and friends coming together over lots and lots of Champagne. That's not a French wedding. That's just a good wedding. You're terrible. I hope you marry a Frenchman and never write in English again. And now, finally, the mailbag gets to your questions. Hi Cavey, FFL: My football question has to do with offseason research: I'm always looking for better ways to figure out who's going to make a good late draft pickup, so I'm wondering if you have any tidbits you can toss our way. I take a look at 2nd/3rd year receivers, kick the tires on RBs to look into things like #of carries last year and age, and try to think about what QB/WR pairings are looking promising for the next year. Any non-trademarked secrets you can cast off to us? Seems like you're in the right ballpark. I won't draft a running back in his 30s (<mark>Steven Jackson</mark> was the easiest bust to avoid last year), and a heavy load of touches is cause for concern. LeSean McCoy and Marshawn Lynch were the only backs with 300 + carries in 2013, and while that's not a dealbreaker, I will probably bump them down my draft board a spot or two because of it. Elsewhere, seek out offensive-minded coaches and talented quarterbacks. Take the second wideout in a great offense before the first wideout in a mediocre one. And don't sleep on boring QBs surrounded by great assets - <mark>Jay Cutler</mark>, <mark>Andy Dalton</mark>, and Josh McCown are all going to be perfectly serviceable if you miss out on Brees and Manning. Relationships: My girlfriend's best friend just recently got into in a whirlwind romance with a new guy, and, quite against the best friend's type, has let things progress quite quickly and has now moved in with him after just a few months. Also against type is that when they're in public, they're the couple who cuddles all the fuck over each other all the damn time (this despite her anger when single about any other couple showing intimacy; fuck that). This dramatic change, of course, is of concern to my girlfriend, me, and the rest of the social circle that is close with the best friend. Prior to dating this guy, the best friend agreed to come join the rest of our social circle in our annual long weekend trip out to the coast (Pacific NW, so you can't really say \"beach'), where we rent a nice place, eat richly, drink heartily, and have fun. Once the best friend got with new guy, she asked to bring him along and we all said that's cool. Well, now it's become rather annoying because despite knowing months ahead of time the dates (memorial weekend), he's now apparently hosting some friends for a night and attending his friend's improv comedy gig at the circus-themed bar in town (jeebus asshole christ; trust me, it's even worse than it sounds), so they're now coming for a little bit on Saturday before heading back into town and then coming back to the coast on Sunday, which, hey, their choice, but it's just stupid. I should mention that we are all in our mid thirties or older. So the guy you don't like is going to spend LESS time hanging out with you? What's the problem? So, to the questions: 1 .) when am I allowed to kick him in the dick? and 2 .) how do I best restrain myself from yelling\" I TOLD YOU SO \"when this relationship goes south? Actually, no, the real convoluted question is: at what point and how do we talk to the best friend and tell her that while we're happy for her new relationship, this sudden high-school level PDA and flakiness on the rest of her friends needs to be dialed way the hell back? Thank you and keep up the good work, Obviously Someone Zesty Step 1 is chill out a little bit. Not everyone in your perfect little circle of friends is going to select sexual partners that mesh with the rest of the group. Your social circle is not fixed, and best friends aren't always forever. Friendships have ebbs and flows, and the ebbs are never more likely than when one of the friends gets into drugs or dates someone who's into improv. So don't be upset about one friend missing part of a weekend because of her stupid boyfriend. Focus on enjoying your time on the coast - and, of course, talk MAD shit about them with everyone else while they're at the improv show. Of course, this doesn't solve the PDA issue when they're in your presence. I think that some gentle teasing would help here: I've always enjoyed\" GET A ROOM! \", but\" Hey, knock it off, you two. I'd like to have an appetite for dinner \"could also work. They'll either get the point or stop wanting to hang out with you, so win-win. Or you could do something REALLY out of the box and just be glad that your girlfriend's best friend is happy instead of her usual M.O. of bitching about couples making out ....yeah, probably not. ********** It's wedding season again, which reminded me that I need to thank you for the excellent advice you gave me last year (Sex: I've been dating a great girl since last July. I'm going to a slew of weddings this summer that I'd like her to attend with me. What's the protocol for out-of-town weddings for my friends? Should I take care of the travel costs (including her airfare)? Or is it reasonable to ask her to pay for some/all of those costs? If it matters, we have roughly similar income. Sincerely, Mile High Club Hopeful Talk it out with her. If she doesn't know your friends who are getting married, then the onus is on you to pick up the bulk of the expenses. However, given the cost of flying across the country, that makes for an awfully expensive date. Since you're on equal financial footing and will be approaching the year-mark of the relationship, I think it's reasonable for her to pay for her own airfare, but you pick up the cost of the hotel. Hotel sex is the best! As you suggested, we talked about it and agreed to split the costs along those lines (she paid her own airfares, and because they were my friends, I paid for most or all of the hotels/rental cars/gifts). Traveling with her made each trip and each wedding so much better, and though it sounds corny, I think we felt more in love after each one. We're traveling to 3 more weddings this summer and using the same arrangement (including her paying for the larger share when it's a wedding of her family/friends). And yeah, hotel sex is awesome. I copied and pasted this into the mailbag without realizing there was no question. The responsible and professional thing to do here would be to cut this out and send an email thanking the reader, but fuck that. If <mark>Peter King</mark> doesn't have to edit his shit, why should I? SAVOR MY BLOATED WORD COUNT. ********** Captain, Sex: I love reading the mailbag each week and really appreciate your insights. My boyfriend of a few months broke up with me this week and I was blindsided. Looking back, I realize I shouldn't have been. We weren't getting along very well recently. We were friends for a while and we started dating soon after my previous, emotionally draining relationship ended. I realized too late that I probably need more time to recover from that but didn't really know what to do. I let jealousy and stress of other things in my life (new job, moving) impact the way I was treating him (getting upset over little things, not letting shit go, being a bitch, etc.) I was taking him for granted and I went too far. I really do care about him and I love spending time with him. I'm kicking myself for acting this way. Hey, that's really mature of you. Circumspection and self-awareness aren't easy, especially in the wake of a break-up. I love your Post Breakup Guide and recommend it to anyone who is going through a tough breakup, but my question is what is your advice on winning someone back? I have a new perspective on my actions and it's definitely out of character for me to act this way, but I'm not sure how to go about showing him this is the case. The breakup was amicable and I agree with all the points he made. I just want an opportunity to show that things can and will be better. I suggested we try to take a break for a couple weeks and see what happens, but he said a break and breakup are one and the same to him. He wants to stay friends, still talk and see what happens from there. We have a lot of mutual friends so we will see each other at social events, etc.. How should I approach this? - Idiot Girlfriend I think you can tell him everything you wrote in your first paragraph (assuming you haven't already), and that will go a long way to validating his feelings leading up to the break-up. Never underestimate the power of a heartfelt apology. That said, you don't have to cheat on someone to wreck a relationship beyond repair. Bitchiness and jealousy can have a lasting impact on a person's psyche, and - regardless of your friendship or mutual friends - his impulse on seeing you might be\" I'm so glad I'm not dealing with her shit any more. \"Recognize and respect his feelings and need for distance. Shorter answer: cleavage, a tight skirt, and a couple drinks. He's not made of stone. Fantasy: besides the obvious <mark>Sammy Watkins</mark> type rookies to take in fantasy drafts this summer, are there any sleeper rookies that you would recommend taking a look at? <mark>Watkins</mark> will be a key piece of the Bills offense, but he's also not flying under anyone's radar, which means he'll probably come off the board a round earlier than he should. I'd rather turn my sights on Bishop Sankey, running behind a solid Titans line (Shonn Greene and Jackie Battle are in the picture, of course, but are also Shonn Greene and Jackie Battle). <mark>Mike Evans</mark> shows a ton of upside in the Lovie Smith\" Josh McCown throwing to two gigantic wideouts \"offense. Also, Kelvin Benjamin should be a great red zone target for <mark>Cam Newton</mark>, and Eric Ebron is an exciting prospect for the Lions offense. Those are the guys with the most buzz right now. As training camps start and depth charts start to take shape, you'll probably see these guys creeping into the discussion: Jordan Matthews, Eagles. BUY on all Eagles offensive players. Tre Mason, Rams. I think it's still Zac Stacy's job to lose, but Mason has too much talent not to get carries. Brandin Cooks, Saints. Looks like the next boom-or-bust Saints receiver to drive you insane, but could break out with an injury to <mark>Jimmy Graham</mark> or the declining Marques Colston. Carlos Hyde, 49ers. With Frank Gore aging and Marcus Lattimore a question mark, Hyde could become the workhorse for San Francisco. <mark>Jeremy Hill</mark>, Bengals & <mark>Andre Williams</mark>, Giants. Both are incredibly talented backs with good size that may end up as the goal-line backs. Anyway, we'll get more into that as the season gets closer. Only 15 weeks until Seahawks-Packers! Sex: I am engaged and have the wedding set for this fall. Everything in our relationship up until now has been amazing, we've been together for about 2 and a half years and she's the girl of my dreams. However, right now I'm in the middle of a fight between my future wife and my best man, who is also my best friend. He wants to bring his on again / off again girlfriend of about 18 months as his plus one to the wedding, who my fianc? e absolutely hates and does not want there. The girlfriend has treated my best man pretty poorly, she has dumped him multiple times, said she has no feelings for him, uses him when there are no other better options around, etc., but he's always there and takes her back. The best man says he's in love with her and is adamant that he be able to bring her, but my fianc? e is adamant that she is not coming. If I tell my best man that sorry, she can't come, I fear it could ruin/end our friendship. If I put my foot down with the fianc? e and say the girlfriend can come, it could cause a giant rift in our relationship, and would probably be an awful way to start married life together. How should I handle this? I see no good way out of this situation. Wow, okay. That's a lot to unpack. Here are my thoughts, in order: 1. Marriage is a legally binding contract to your life partner. Translation: when in doubt, you side with your wife. 2. Your best friend is pussy-blind. It's regrettable, but it happens to perfectly intelligent people all the time. Eventually, he'll either come to his senses...or he'll marry her. Is your wedding the bridge your wife wants to fight this battle on? 3. The best man is entitled to bring a date. If he and his girlfriend are in\" on-again \"mode, then it only makes sense that he would bring her. 4. Real talk: dictating who the best man can or can't bring as his date is a straight-up Bridezilla move. So, there are some conflicting points there. I have no doubt that your best man's girlfriend is a useless tramp. But you can't do anything about his lack of judgment or self-worth, can you? Marriage is compromise, and it begins with the wedding. EVERY wedding has a guest (or guests) that either the bride or groom doesn't like, but is obligated to include. You invite them as a favor to your partner, or to your parents. On those grounds alone, it would seem that your bride needs to relent and allow Slutty McCunterson to attend. HOWEVER, if your best man and his viper-lady are prone to public fights or any kind of drama that would detract from your celebration or distract him from his duties, then you need to side with your wife, put on your big-boy pants, and explain to your best man why you can't risk your wedding on his penchant for flaky bitches. (And maybe be prepared to get a new best man .) There's not a right answer that makes everyone happy, and that's life for you. It kinda sucks most the time.", "articleID": "2014052305_00013131_W", "names": {"Peter King": ["Q15840165", "Q16104898", "Q2076274", "Q21063831", "Q22005836", "Q52534076", "Q52892721", "Q7175195", "Q7175199", "Q7175200", "Q7175201", "Q7175202", "Q7175203", "Q953554"], "Sammy Watkins": ["Q7409856", "Q7409857"], "Steven Jackson": ["Q2062417", "Q3499240", "Q3973436", "Q7614873"]}}, {"date": "2014-05-24", "url": "http://kionrightnow.com/news/Gunman-among-7-dead-in-Calif-rampage/26153616", "content": "Gunman among 7 dead in Calif. rampage Deputies believes shootings were \"premeditated mass murder' The gunman also died from a gunshot wound after his car crashed Friday night, police said. It was unclear if the fatal head wound was self-inflicted or the result of a firefight with police. Seven people also were being treated in a hospital for gunshot wounds or traumatic injuries, including at least one who was in surgery, said sheriff's office spokeswoman Kelly Hoover .\" The sheriff's office has obtained and is currently analyzing written and video evidence that suggests this was a premeditated mass murder, \"Hoover said. Hoover apparently was referring to a YouTube video titled\" Retribution \"posted by a young man. In the nearly seven-minute video, the young man rants about women who ignored or rejected him over the past eight years and warns that he will\" punish you all for it. \"\"Tomorrow is the day of retribution, the day in which I will have my revenge,\" the man says on the video. The shootings occurred in Isla Vista near the University of California, Santa Barbara, in a crowded area bustling with activity on Memorial Day weekend. \"I don't recall hearing any screaming,\" witness <mark>Robert Johnson</mark> told CNN, describing the moment the gunman opened fire on people outside a deli. \"It was at that point where I turned and ran in the opposite direction ....There's a lot of confusion. Even shortly after this whole ordeal had ended, I think a lot of people didn't realize the magnitude of the situation .\" The violence began and ended within minutes, from 9:27 p.m. when shots were reported to around 10 minutes later when police discovered the body of the suspected gunman, CNN affiliate KEYT-TV said. Authorities said there were nine separate crime scenes. \"Sheriff's deputies responded and found several victims suffering from gunshot wounds. As sheriff's deputies were attending to the victims and performing first aid, they were also receiving suspect information. Only minutes later, there were additional reports of shots fired in several other areas of Isla Vista,\" Hoover said. U.S. law enforcement officials said the Bureau of Alcohol, Tobacco, Firearms and Explosives and FBI were assisting local police in the investigation, including trying to trace the handgun used and where the possible suspect obtained it. <mark>Johnson</mark> told CNN he was standing on a corner when he heard what he thought were fireworks. Then a black BMW with tinted windows drove by and either slowed down or stopped outside a deli where as many as eight people were eating outside. Someone in the car opened fire. \"It all happened very quickly, but I think this happened to be the largest group on the street,\" he said. \"It think it was just targeted because it was the largest group in the area .\" People jumped up and ran, <mark>Johnson</mark> recalled. KEYT reporter John Palminteri told CNN that some witnesses reported hearing the gunman talk to some of his victims as he fired. Outside a 7-Eleven convenience store, he said, workers came out amid the gunfire to pull to safety a girl who had been shot in the leg. Another victim, a bicyclist, apparently sustained massive head injuries after being struck by the gunman's car. One woman told the station that a driver of a car flashed a gun at her and asked, \"Hey, what's up?\" before opening fire. She escaped unharmed. \"I heard some pops, but I just assumed they were fireworks,\" said Daniel Slovinsky, who was eating at a restaurant. \"Contrary to what you might expect, there wasn't a whole lot of chaos immediately. I didn't hear any screaming. A few people were running ....It wasn't really until police started yelling at people to get inside that we realized something big went down. But even then people didn't know what .\" KEYT reported that \"witnesses described seeing a black BMW speeding through the streets, spraying bullets at people and various targets .\" Six minutes after the first emergency call, the suspected gunman traded fire with sheriff's deputies, and the vehicle plowed into a parked vehicle, said Hoover, the sheriff's office spokeswoman. In a statement on its website Saturday, UC Santa Barbara said several students were taken to local hospitals after the shooting. \"Our hearts and prayers go out to the family and friends of those affected,\" the statement said. The suspected gunman was found dead from an apparent gunshot wound, she said. A semiautomatic handgun was recovered. It appears the suspect acted alone, Hoover said. Santa Barbara Sheriff <mark>Bill Brown</mark> called the suspect \"severely mentally disturbed,\" according to KEYT. Authorities searching for a motive were looking into a video posted on social media that contains a man's tirade against women who supposedly rebuffed him, <mark>Brown</mark> told the station. Hoover said the suspect has been preliminarily identified but his name won't be released until \"a positive identification is made .\" The views expressed are not those of this company or its affiliated companies. Please note by clicking on \"Post\" you acknowledge that you have read the Terms Of Service and the comment you are posting is in compliance with such terms. There are currently no severe weather alerts.", "articleID": "2014052501_00016036_W", "names": {"Bill Brown": ["Q16188871", "Q2667644", "Q27147689", "Q4908278", "Q4908280", "Q4908282", "Q4908284", "Q4908288", "Q4908289", "Q4908293", "Q861987"], "Robert Johnson": ["Q16215328", "Q18630840", "Q18672192", "Q21665589", "Q23795774", "Q25522930", "Q30678501", "Q47546079", "Q4932943", "Q57208493", "Q5889205", "Q7346149", "Q7346150", "Q7346152", "Q7346153"]}}, {"date": "2014-05-24", "url": "http://accesshollywood.com/kim-kardashian-and-kanye-west-wed_article_94653", "content": "It's official - Kim Kardashian and Kanye West have tied the knot! The reality TV superstar and the rapper said \"I do\" on Saturday in front of friends and family at Forte di Belvedere in Florence, Italy. The 33-year-old bride and her 36-year-old groom were married by Miami pastor Rich Wilkerson Jr., according to PHOTOS: The Many Men Of Kim Kardashian Sharon Sacks served as wedding planner for the event, according to the mag. (She also planned Kim's baby shower and wedding to Kris Humphries .) Andrea Bocelli sang while Kim's stepdad, Bruce Jenner, walked her down the aisle, the mag reported. PHOTOS: Stars Who Tied The Knot In 2014 The nuptials come on the heels of a Kardashian invasion of the City of Light, which saw Kim joined by the entire Kardashian-Jenner family in Paris, in the days leading up to the big event. On Thursday night, it was ladies night out, as Kim was joined by seven of her closest girlfriends as they posed in front of the Louvre, the Eiffel Tower - and even a reported trip to famed burlesque club Crazy Horse, where sisters Khloe and Kendall also joined in on the festivities. PHOTOS: Kim Kardashian & Kanye West On Friday, Kim, Kanye, North and the family enjoyed a lunch at designer Valentino Garavani's home outside Paris. sharing a photo on Instagram of the gorgeous grounds with lights showing through the clouds - something she took as a celestial sign of approval. \"Little angels in the sky blessing us #TheyDidntShowUpInAnyoneElsesPicture #Valentino,\" she captioned the pic. The rehearsal dinner took place on Friday night at the famed Palace of Versailles. 600 guests were on hand for the bash, which included a performance by Lana Del Rey (one of Kim's favorite singers), and a 7-minute fireworks show. The marriage marks the first for Kanye, whose most famous relationship before Kim was with model Amber Rose, who Kanye dated until 2010. However, his longest relationship was with designer Alexis Phifer, who he dated on and off from 2002 - 2008. The couple even got engaged in 2006 before calling things off. For Kim, it's her third trip down the aisle. In 2000, at age 19, Kim married R & B producer <mark>Damon Thomas</mark>. The marriage lasted four years before they split in 2004. In October 2010, Kim began dating NBA star Kris Humphries. They became Kim filed for divorce on October 31, 2011. The divorce wasn't officially finalized until June 2013 .--<mark>Eric Anderson</mark> & Erin O'Sullivan Copyright? 2013 by NBC Universal, Inc.. All Rights Reserved. Part of NBCU Digital Entertainment.", "articleID": "2014052501_00044793_W", "names": {"Damon Thomas": ["Q21013519", "Q44702022", "Q5212888", "Q5212889"], "Eric Anderson": ["Q10468648", "Q17437673", "Q3731452", "Q5386020", "Q5386021", "Q5386024", "Q5386025", "Q58338151"]}}, {"date": "2014-05-25", "url": "http://www.torontosun.com/2014/05/23/travelling-the-world-on-high-flying-egos", "content": "Anyone feel like gallivanting off to Paris for a day? Eh? Too much jet lag to be useful the first day? And too expensive? Well, you'd make a lousy politician. Consider a recent Ottawa Citizen story about federal cabinet ministers zooming about in VIP Challenger jets, operated by the RCAF at a bargain-basement $3,300 per hour. Including then-natural resources minister <mark>Joe Oliver</mark>, with a mere three aides, going from Ottawa to Paris and back on Oct. 19 and 20, 2011. Supposedly he promoted our international energy interests not only in Paris meetings but in a side-trip to London for a speech to the LSE and a meeting with British government people. He must be superhuman...or self-deluding. So is <mark>Oliver</mark>, now finance minister, also a high-living jet-setter? Not by the standard of finance ministers. Jim Flaherty once zoomed down to Mexico City with six aides for a December 2011 overnighter to discuss G20 priorities with Mexico's president and assorted hangers-on. Not to seem cheap but what benefits did they derive from meeting face-to-face, rather than via Skype or conference call, to offset the $33,179 price tag? For that matter, why not just exchange a few e-mails full of nebulous generalities then decide the technical people will sort it all out and give you something to sign in front of the cameras wearing colourful local garb? After all, Flaherty spent another 30 grand flying back to Mexico City for a brief G20 finance minister's meeting two months later. If you ask me, G20 financial matters are too complex for 20 giant egos and umpteen aides to settle quickly face-to-face in some posh resort. Which might be why they don't ask me. Don't even mention Peter MacKay's August 2011, $17,411 overnighter the manifest listed as \"Ottawa, Ottawa, Ottawa .\" I'm already clutching my head going \"Ottawa, Ottawa, Ottawa .\" You see, the issue is ego inside the bubble. These people start to get the idea, fed by an atmosphere of constant crisis, obsequious aides and a panting press, that they really are special. Take <mark>John Baird</mark>, who flew commercial to Africa in December 2012 for a Friends of the Syrian People meeting in Marrakech then hopped the Challenger for a same-day \"G8 Broader Middle East and North Africa\" meeting in Tunis. The official explanation was there was no other way to attend both meetings. The problem is, there was no reason to. Nothing actually gets done in these gatherings that's worth a dime. Would the Syrian People, or their Friends, be one whit worse off if <mark>Baird</mark> had just sent a nice note, on engraved stationary, saying we feel your pain and Obama should send troops? Last Wednesday the \"Office of the Minister of State (Foreign Affairs and Consular),\" which shouldn't even exist, teamed up with the \"Media Relations Office, Foreign Affairs, Trade and Development Canada\" to assure me \"The Honourable Lynne Yelich, Minister of State (Foreign Affairs and Consular), today wrapped up a successful visit to the Kyrgyz Republic, where she advanced Canada's social, political and economic interests, as well as religious freedom, in the region .\" Phooey. Her visit did nothing for Canada, Kyrgyz religious minorities or Orozbek Moldaliev personally (the press release boasts that she met with him). And every such press release calls every such visit successful because they are vacuously smug. Indeed, the real reason they keep flying around is they think they're so special their mere presence, even jet-lagged, harried and extravagant, has a transformative effect on problems they couldn't solve through hard work in a decade. And while the cost is a drop in the bucket of federal spending, it's still a high price to pay for them to stagger around foreign countries, pontificating on autopilot, bleary with fatigue, inflating their egos. Anyone feel like gallivanting off to Paris for a day? Eh? Too much jet lag to be useful the first day? And too expensive? Well, you'd make a lousy politician. Consider a recent Ottawa Citizen story about federal cabinet ministers zooming about in VIP Challenger jets, operated by the RCAF at a bargain-basement $3,300 per hour. Including then-natural resources minister <mark>Joe Oliver</mark>, with a mere three aides, going from Ottawa to Paris and back on Oct. 19 and 20, 2011. Supposedly he promoted our international energy interests not only in Paris meetings but in a side-trip to London for a speech to the LSE and a meeting with British government people. He must be superhuman...or self-deluding. Where have all Ontario's ridings gone? They seem as disposable as our sense of community.", "articleID": "2014052605_00009230_W", "names": {"Joe Oliver": ["Q16107458", "Q6211624", "Q6211627"], "John Baird": ["Q16154590", "Q19043052", "Q27831227", "Q365736", "Q43911239", "Q6220326", "Q6220331", "Q6220342"]}}, {"date": "2014-05-27", "url": "http://www.huffingtonpost.ca/nathan-dautovich/buying-a-house-in-toronto_b_5397648.html", "content": "Canada Has No Interest In Annexing This Paradise Tories Omit Survey Questions That Often Lead To Negative Answers Official: Nigeria's Military Knows Where Kidnapped Girls Are Being Held Ukraine Launches Air Strikes Against Pro-Russia Rebels SURPRISE! <mark>Steve Perry</mark>'s First Live Stage Performance In Nearly 20 Years Saw-Wielding Man Reportedly Slashes 2 Members Of Japanese Pop Group Striking Photos Of Mexico City's Retired Sex Workers Photographer Who Helped Launch Bettie Page's Career Dies Striking Photos Of Muay Thai Boxers Capture The Softer Side Of Masculinity 13 Music Festivals You Should Actually Attend This Summer Nathan Dautovich PropertyGuys.com Franchise Owner With prices of single family homes already up over 13 per cent year over year, the dream of owning a home in a desirable neighbourhood is quickly fading for many would-be Toronto home owners. In popular areas along the Yonge subway line, even semi-detached homes are now selling for over $1 million, which is out of reach for most buyers. The reason that prices have risen so fast is that more and more people want to stay in Toronto to raise their families instead of moving to the suburbs. Toronto has become a world class city with great restaurants, unique cultural events, and neighbourhood festivals all over the city. Also, with commute times at a record high, many people who work in the city would rather live close to their work so they don't have to spend hours every day in a car or on a train. So what options are there for people with a budget under $1 million who still want a home in a desirable neighbourhood? I posed this question to former city councillor <mark>Adam Vaughan</mark>, who has long believed that an important part of Toronto's growth as a city includes families living near the downtown core. <mark>Vaughan</mark> cites a regulation for new condos mandating that at least 10 per cent of all units in new buildings have three bedrooms or more. \"10 years ago, people were calling me crazy for pushing this regulation, saying that families would never want to live downtown,\" says <mark>Vaughan</mark>. \"In hindsight, I think we will probably look back and think that the 10 per cent requirement was too low .\" The facts seem to back up <mark>Vaughan</mark>'s statement, as three bedroom condos and townhouses close to the downtown core are now selling faster than ever before. There are schools and daycares opening up in the bottom of large condo buildings, and lots of new parks and playgrounds are being built. Another option that many home owners are not aware of that many newer condo buildings have knockdown walls between units. This means that two or more suites could easily be combined into a larger suite by removing a non-structural mutual wall built in a way that makes it easy to remove. While this is a rare occurrence right now, it is a fascinating example of a policy that allows the market to dictate what type of properties exist in Toronto's downtown core. If families continue to choose to live in the city, then there will be more demand for larger units, and savvy investors will combine two smaller suites into a larger suite to meet demand. It could also be a great investment for buyers to purchase two units side by side and rent one out for several years until their lifestyle requires a larger property. Then they can combine the units together and have a space just as large as a single family home. These options may seem unconventional right now, but if house prices continue to grow anywhere near the current rate, we could see the location of knockdown walls become essential information in every property listing. All of this is good news for home buyers. As the popularity of these larger suites closer to downtown increases, it could make detached homes more affordable, creating more of a balanced market. These changes could be years away, but Toronto is well positioned to offer a variety of options for families wanting to live close to the downtown core. Leaside/Thorncliffe Park - up 23% Median house price 2012: $1,213,000 Median house price 2014: $1,486,000 Prices for stand-alone houses, excluding condos/townhomes. * Note: Statistics for neighbourhoods are based on relatively small total sales figures, and thus can change rapidly. Source: Toronto Real Estate Board data via BuzzBuzzHome Lawrence Park/Forest Hill North - up 24% Median house price 2012: $993,000 Median house price 2014: $1,235,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Oakridge/Birchmount/Kennedy Park - up 28% Median house price 2012: $396,000 Median house price 2014: $505,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Riverdale - up 33% Median house price 2012: $568,000 Median house price 2014: $756,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Danforth/East York - up 34% Median house price 2012: $485,000 Median house price 2014: $650,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Church-Yonge Corridor/Cabbagetown - up 38% Median house price 2012: $1,300,000 Median house price 2014: $1,800,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome York Heights/Jane Heights/Black Creek - up 40% Median house price 2012: $475,000 Median house price 2014: $666,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rockcliffe-Smythe/Keelesdale-Eglinton West - up 41% Median house price 2012: $343,000 Median house price 2014: $483,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Junction/High Park North - up 52% Median house price 2012: $534,000 Median house price 2014: $810,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Trinity-Bellwoods/Little Italy - up 54% Median house price 2012: $635,000 Median house price 2014: $978,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Annex/Yonge-St. Clair - up 71% Median house price 2012: $782,500 Median house price 2014: $1,340,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rosedale/Moore Park - up 116% Median house price 2012: $1,175,000 Median house price 2014: $2,533,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome ALSO ON HUFFPOST: COOLEST HOUSES FOR SALE IN CANADA Calgary - $4 million This newly-built home just northwest of downtown Calgary not only looks cool and has excellent views of the city, it features some pretty slick amenities, such as built-in kitchen appliances, a 1,500-bottle wine cellar and five bedrooms across 5,300 square feet of living space. Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Montreal - $3.25 million This house in Montreal's old-money Westmount area was built in 1857 and, with its awesome wrap-around porch, may be the coolest heritage residential building for sale in Canada right now. It's actually three units--a main house, a townhouse in the back and what's referred to as the \"well house .\" Three bedrooms and two baths in the main house. Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million West Vancouver - $7 million Can you say house with a view? This four-bedroom property features not only one of the best views out of anyone's living room window in the country, it also has an outdoor pool, sunk slightly below house level, with views all its own. Four bedrooms and an elevator in this house the realtor describes as an \"amazing entertainment home .\" West Vancouver - $7 million West Vancouver - $7 million", "articleID": "2014052723_00083330_W", "names": {"Adam Vaughan": ["Q4679921", "Q58065366"]}}]