[{"articleID": "2019040319_00396488_W", "names": {"Tom Wright": ["Q1335131", "Q14949657", "Q1647937", "Q23418836", "Q5192198", "Q7818105", "Q7818107", "Q7818108", "Q7818109"]}, "date": "2019-04-03", "url": "https://thecourier.com/national-news-latest/2019/04/03/killing-police-k-9s-in-florida-could-earn-longer-prison-term/", "content": "Advertisement TALLAHASSEE, Fla. (AP)--People who kill or seriously injure police dogs in Florida soon could face tougher penalties after the Senate unanimously passed a bill inspired by the shooting death of a canine named Fang. \"This bill has been a roller coaster of emotions,\" said Sen. Aaron Bean. \"Fang was executed .\" Fang was a 3-year-old German shepherd at the Jacksonville Sheriff's Office. He was fatally shot as officers chased a 17-year-old carjacking suspect. Bean said he decided to sponsor the bill after learning the penalty for killing the dog was a maximum of five years in prison. The bill would make the crime a second-degree felony punishable by up to 15 years in prison. \"The double hurt came not only in losing the animal, but we discovered the penalty for harming an animal...was only a third degree felony,\" Bean said. \"It was just sad .\" Bean noted that just last weekend a police K-9 was shot in Pinellas County after a traffic stop, though the dog is expected to survive. In making his case for the bill, he turned to Republican Sen. <mark>Tom Wright</mark>, a former Rochester, Minnesota, police officer who was assigned a K-9. He told stories about two incidents when his K-9, Officer Denver, stopped an armed suspect he was pursuing. \"Just two examples of I probably wouldn't be here today if it wasn't for this dog,\" <mark>Wright</mark> said. \"These are officers, they just happen to have four legs .\" The increased penalties would also apply to anyone who seriously injures or kills a police horse or canines used by fire departments and search and rescue teams. A companion House bill is ready to be considered by the full chamber after unanimous approval in each of its committee stops. Comments RELATED ARTICLES MORE FROM AUTHOR National News Latest 6 more excused from jury in trial of cop who shot 911 caller National News Latest Trump signs memorandum to stem counterfeit goods trafficking National News Latest The Latest: Huffman, Loughlin shows at court in college scam SPONSORED LINKS Daily Polls TRENDING WITH VIDEO: Guitar lessons help vets work through their frets April 3, 2019 WITH VIDEO: Findlay High students host event to teach sexual assault...April 3, 2019 Findlay street resurfacing plans advancing April 3, 2019 CIRCULARS Brinkman's April 3, 2019 Kroger Weekly Ad April 3, 2019 Lowe's Home Improvement April 3, 2019 Letters to the Editor The Docket Obituaries Classifieds"}, {"articleID": "2017101617_00036348_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2017-10-16", "url": "http://tantrume.wordpress.com/2017/10/16/the-death-of-hollywood-and-the-echo-of-the-silence/", "content": "\"Lying is done with words, and also with silence .\" Adrienne Rich \"We can easily forgive a child who is afraid of the dark; the real tragedy of life is when men are afraid of the light .\" Plato Hollywood has erupted with a number of actresses coming forward to speak out regarding the abuse they suffered at the hands of American Producer Harvey Weinstein. Weinstein and his brother founded Miramax which has been responsible for successful films such as Pulp Fiction and Good Will Hunting. He has received numerous awards for his work and has been active in issues such as AIDS and Juvenile Diabetes. He was, undoubtedly, a Hollywood powerhouse who had the connections to make or break careers. Sexual assault is rampant around the world and I have long been an active voice speaking out against it and advocating for the victims. I am in no way minimizing what any woman suffers in my comments regarding this particular case but I have some serious concerns and I think they are concerns that should be shared. Lately, there has been a whole stream of public figures who stand accused of various sexual assaults. Some are hopeful that this signals a new willingness to expose these atrocities and that they represent our commitment to draw a line in the sand and say \"No more .\" We seem to circumvent the who legal process meant to determine guilt and jump straight to judgement. Guilt appears to be amplified by the public lives of the accused. Is it easier for us to comment on a life that we already feel we have a right to because we see them in our own homes on our media devices and on the news? It appears to at least polarize the accusers as legitimate and the accused as guilty. No-one seems to worry about questioning what we read and hear. A trial and its outcome are irrelevant. As long as you have Gloria Allred on one side of the microphone, the truth is irrelevant. The story never dies and the accused, even if innocent, will never completely recover. Take away the celebrity cases and looking to regular court in your own cities and communities and you will find a whole slew of sexual abuse allegations being made against, mainly men. In family court, those allegations are too frequently proven to be wrong or without substance. The man stands accused and those who are willing to lie in order to punish or hurt, or even sometimes to gain financial reward, are suddenly in the driver's seat. They have a story with elaborately made up facts. The accused now has to prove a negative. They have to prove that they did not abuse the \"pretend victim .\" These pretend victims are believed and supported BECAUSE there are real victims somewhere and their suffering is real. These false accusers, who themselves should be punished to the full extent of the law, use the very real stories of legitimate victims to further their lies. No-one should be championing these women. No-one should be supporting them. THEY make it harder for the real victims because once these liars are found out, they make it harder for real victims to come forward. They make it harder for people to believe them and they make it less likely that they will ever find justice, safety or peace. Isn't this the real foundation of all women's rights? We will no longer allow ourselves to be abused? We will stand up and speak out and we demand justice? Violence against women, especially sexual violence MUST end? Then WHY are women using the abuse of women as a weapon to \"get even\" or to \"make someone pay?\" Now amplify the accusation to the public arena and you have people possibly motivated for the same reasons but more. Now there is a quality of blackmail in taking it public. You and I probably do not care what is happening in a city on the other side of our countries where \"John Citizen\" has just been accused but we are possibly going to weigh in on \"John Celebrity .\" These people also are involved in issues, they speak out. They can expose people and their business practices. They may know about political issues and personalities. They may have done something to anger the wrong people or not done what they were supposed to do. The accusations made against <mark>Donald Trump</mark> during the last election are a perfect example. All of a sudden the man is accused of several instances of sexual abuse and yet none of them seem to have followed through and he was never found guilty or even charged. It seems like it all might just have been part of an attempt to keep him from being elected. Despite there being no real proof, many people still believe it as if there had been a conviction. All I am saying is there are plenty of reasons for people to stand up and make accusations without them ever being true. The \"pretend victims\" are using the accusation of sexual abuse for personal gain. I have heard some people insist there are too many women coming forward for Weinstein's charges to not be true. I hear people swayed by the star quality of some of the accusers. The bigger the star the more we seem willing to believe in their moral integrity, even when there is no evidence of a star having any morals or integrity. Is Weinstein guilty? I have no idea. Just because I state that I am not loading up my own supply of stones to throw does not mean I am supporting him or that I believe he is innocent. It means I don't know. None of us can say that we do. But here is where I am most uneasy. I see these women, huge stars such as Gwyneth Paltrow and Angelina Jolie and well-known stars like Rose McGowan and Ashely Judd, coming forward. According to Entertainment Weekly, there are more than 40 women to date. There are others who have not claimed abuse but who say they knew, like Jane Fonda. Many of these women are role models, active in various Women's groups. Some of them are considered role models for the other actresses. None of them spoke out? None of them. Not the abused, not the ones who heard about it, not the ones who saw it. This is reported to have been going on for years. They were abused and then they were silent. They did not seek help. They did not seek justice. They did not stand up and use their positions of leadership among women to speak the truth of their own experience and lead by example. I find myself asking why. The only answer is that ultimately, they all chose their careers overcoming forward. If they said anything, they would never work again because Weinstein was that powerful. I accept that it might have been incredibly painful. I accept that they may have been that damaged. But then, I have to ask, why did they stay? Why continue to work in an industry that operates on that level, with people who see and know and say nothing? Why risk further abuse in an industry with a man so powerful that he had great influence over their careers? They stayed and continued to work and accept the money, and uphold the image and the façade of Hollywood. They played the game. They were part of it. In making their choice they spit in the face of all the other victims which many of them heard about and talked with over the years. They did not protect them. They spit in the face of all the women who struggle to come forward in their own lives because the very real consequences of doing that might mean the loss of their families, and even worse violence, possibly death. The fame of many of these women offered them a protection that the average woman does not have. Their fame offered them a voice that could have saved many by identifying their abuser who, by their accounts, was growing bolder, but also by setting an example for other women to follow. Instead, Ashley Judd stood and insisted she was a \"nasty woman\" and assured all women they should be like her and fight against all these injustices. She was happy to hurl accusations at <mark>Trump</mark> when again, she had no personal knowledge as to whether any of those accusations were true, but the one truth she could have spoken with complete confidence went unspoken. She was willing to destroy someone else's life based on a possible lie but she was not willing to stand up for her own truth. I am sure there are many sexual predators in Hollywood, of course, there are, they are a group of people like any other group of people. Our world is filled with both violence and sexual depravity. Predators exist in practically every group you can name. The disregard for one another, the disrespect, the hate, is not about being black, or Muslim, or a woman, it is just the way many people now see the world. We are so bolstered in our sense of entitlement, our \"rights,\" that we now see other people as just tools that we can use and abuse as our whims and appetites might direct us. And while the predators should be exposed and stand to face their crimes, there are many other who should stand with them. In order for them to continue and to feed the appetites of the predator, there has to be a huge crowd of the people that know what is going on and do nothing. Sadly, in this case, that crowd included his victims. Hollywood has no-one to blame for the decay that I believe is going to destroy all of them, but themselves. \"Some people think they can find satisfaction in good food, fine clothes, lively music, and sexual pleasure. However, when they have all these things, they are not satisfied. They realize happiness is not simply having their material needs met. Thus, society has set up a system of rewards that go beyond material goods. These include titles, social recognition, status, and political power, all wrapped up in a package called self-fulfilment. Attracted by these prizes and goaded on by social pressure, people spend their short lives tiring body and mind to chase after these goals. Perhaps this gives them the feeling that they have achieved something in their lives, but in reality, they have sacrificed a lot in life. They can no longer see, hear, act, feel, or think from their hearts. Everything they do is dictated by whether it can get them social gains. In the end, they've spent their lives following other people's demands and never lived a life of their own. How different is this from the life of a slave or a prisoner?\" Liezi Advertisements Like this: Like Loading...Related"}, {"articleID": "2017100923_00432604_W", "names": {"Cam Newton": ["Q5024850", "Q5024852", "Q591678"], "Rick Williams": ["Q16152041", "Q19518930", "Q28421787", "Q42321991", "Q7331860"]}, "date": "2017-10-09", "url": "http://6abc.com/sports/second-grader-calls-out-cam-newton-on-twitter-/2513356/", "content": "BREAKING NEWS Fatal crash in Northeast closes major thoroughfare Full Story Email share share tweet email BREAKING NEWS ESPN: Joel Embiid OKs five-year, $148M deal with Sixers Full Story Email share share tweet email BREAKING NEWS Suspect in custody for murder of Philly activist Full Story Email share share tweet email BREAKING NEWS Names released of 4 killed in Gloucester Twp. crash Full Story Email share share tweet email SPORTS Local second grader creates stir calling out <mark>Cam Newton</mark> on twitter Email share share tweet email EMBED </> More Videos <iframe width = \"476\" height = \"267\" src = \"http: //6abc.com/video/embed/? pid=2513362\" frameborder = \"0\" allowfullscreen> </ iframe> Local second grader creates social media stir calling out <mark>Cam Newton</mark>: Jamie Apody reports on Action News at 6 p.m., October 9, 2017 (WPVI) WPVI By Jamie Apody Monday, October 09, 2017 07:27 PM PHILADELPHIA (WPVI)--It was the off-the-cuff comment heard round the world. \"It's funny to hear a female talk about routes,\" said <mark>Cam Newton</mark>, during an interview on October 4. But it was not seen as funny to millions of football fans who happen to be female. One of these fans, 7-year-old Reese Emanuele took <mark>Newton</mark> to task on twitter. Reese created a video explaining routes, which her dad posted to his twitter account on Friday. Since it has been posted, Reese's video has been retweeted almost 4000 times. On Monday, the second grader from Clinton, N.J. paid a visit to Action News, talking a little football with <mark>Rick Williams</mark>. She even sat down to speak with someone who knows a thing or two about pass routes, former Eagles Quarterback Ron Jaworski. She said she hopes the takeaway from her video is that people realize girls can know a thing or two about sports, just like boys. Reese's dad Eric said he learned the game of football from his mother and that is what drove him to post the video .------Send a breaking news alert to Action News Report a correction or typo Learn more about the 6abc family of apps Related Topics: sports Action News Sports Email share share tweet email (Copyright © 2017 WPVI-TV. All Rights Reserved .) Load Comments Please enable JavaScript to view comments. SPORTS Sources: Joel Embiid OKs five-year, $148M deal with Sixers ESPN: Joel Embiid OKs five-year, $148M deal with Sixers Three and Out - Ducis and Jaws on fan excitement around 4-1 Eagles Doug Pederson: Will be \"tough' for Lane Johnson to play Thursday More Sports Top Stories Fatal crash in Northeast closes major thoroughfare Names released of 4 killed in Gloucester Twp. crash Suspect in custody for murder of Philly activist ESPN: Joel Embiid OKs five-year, $148M deal with Sixers All Monroe Twp. schools closed for rest of week amid mold concerns AccuWeather: Clearing Skies Tonight Woman, 84, hit by car in Fox Chase; in critical condition Man arrested after gun pointed at driver in Del.. Show More No charges after incident at Toomey town hall Missing toddler left near coyote-infested alley as punishment, police say Child burned after falling into bonfire in Monto, police say Hall of Fame quarterback Y.A. Tittle dies at age 90 Firefighter injured battling Port Richmond fire More News Top Video Names released of 4 killed in Gloucester Twp. crash Suspect in custody for murder of Philly activist Watch NJ Gubernatorial Debate Tuesday on 6abc Action News Update More Video"}, {"articleID": "2019100101_00302441_W", "names": {"Tan Wei": ["Q45607787", "Q45607851", "Q45667480", "Q45668260", "Q45668345", "Q45668496", "Q45705539"], "Ling Feng": ["Q21502945", "Q28970771"]}, "date": "2019-10-01", "url": "http://nst.com.my/world/2019/10/525976/sleepy-driving-medical-student-jailed-knocking-down-elderly-pedestrian", "content": "By Today Online - October 1, 2019 @ 9:20 am SINGAPORE: A 25-year-old aspiring medical student, who knocked down a 78-year-old pedestrian while driving when he was \"sleepy\" , was sentenced to five days' jail and banned from driving for 18 months yesterday. <mark>Tan Wei</mark> Ren, who is applying to medical schools for his postgraduate studies, was exhausted because he had been studying till late into the night after completing a research course the night before the accident took place, his lawyer told the court. It was not stated exactly how late <mark>Tan</mark> had been studying. His lawyer also declined to reveal <mark>Tan</mark>'s occupation when asked by reporters, although he was described as a \"hardworking academic\" in court. On July 8 last year, at about 9am, <mark>Tan</mark> was driving along Lavender Street towards Republic Avenue when he collided into Chua Boon Huat who was crossing the road more than 50m from a pedestrian crossing. <mark>Tan</mark>, however, had a clear view straight ahead and the victim was in plain sight from some distance away, Deputy Public Prosecutor (DPP) Charis Low noted, adding that he should have had ample time to see Chua. He failed to do so because he did not keep a proper lookout. DPP Low also pointed out that <mark>Tan</mark> was driving at a speed of 63km/h at the point of impact, having increased his speed from 59km/h to 63km/h in the immediate five seconds before the impact. The speed limit for the stretch of road was 60km/h. Chua suffered head and collarbone injuries as a result of the crash and had to be warded in <mark>Tan</mark> Tock Seng Hospital for 19 days. In view of the \"grievous harm\" caused, DPP Low had asked the court to impose a one-week jail sentence, arguing that <mark>Tan</mark>'s \"sleepy driving\" increased his culpability, since he posed an increased danger to other road users. If he had been alert, he would have noticed the victim crossing the road, she reiterated. While <mark>Tan</mark>'s lawyer, Pang Khin Wee, agreed that a custodial sentence is warranted, he sought to get a \"discount\" on the one-week sentence the prosecution wanted, pointing out that his client had refrained from driving since the accident and is \"unlikely to reoffend\". \"He is full of potential for rehabilitation and will do a lot of good to society as a doctor in the future,\" he told District Judge Carol <mark>Ling Feng</mark> Yeng. Pang also said that <mark>Tan</mark>--who had been driving for four to five years before the accident--took responsibility for his actions and emerged from his vehicle \"in a split second\" to get help for the victim. A passing ambulance at the site of the accident attended to Chua. <mark>Tan</mark> had written an apology letter to Chua, Pang said, noting that it took care of the victim's \"mental well-being\" as it accorded the victim \"closure\" to what had transpired. The lawyer added that the man's medical expenses were covered by <mark>Tan</mark>'s insurance firm. These proved <mark>Tan</mark>'s \"genuine remorse\" , Pang said. The lawyer questioned DPP Low's \"sleepy driving\" characterisation of <mark>Tan</mark>, adding that he knows of people who can function with two to three hours of sleep. \"(My client) is a hardworking academic,\" he stressed. In response, DPP Low said that she was referring to Pang's mitigation plea, which stated that the accident was caused by a \"momentary lapse\" , partially caused by a lack of sleep. <mark>Tan</mark> pleaded guilty to one charge of a negligent act endangering human life and causing grievous hurt to Chua. He could have been sentenced to up to two years in jail, or fined up to S $5,000, or both."}, {"articleID": "2017061123_00653842_W", "names": {"Tom King": ["Q23664009", "Q27139397", "Q3530763", "Q3992491", "Q52892734", "Q55635982", "Q58316386", "Q7816471", "Q7816473"], "Jim Gordon": ["Q1334162", "Q6195271"], "Paul Dini": ["Q3371079", "Q636303"]}, "date": "2017-06-11", "url": "http://www.cbr.com/catwoman-batman-team-ups/", "content": "Share On Facebook Tweet Pint It Email Comment SPOILER WARNING: The following story contains spoilers for Batman #24, on sale now. Catwoman and Batman's love affair has filled decades of comic book pages with both romance and butt-kicking. No matter what DC timeline the two have tangled in, they always end up teaming - up in cowl and claws to overcome the enemies of Gotham City. The two haven't always seen eye to eye over the years, but Catwoman has consistently been one of the most important and reliable members of the Bat-Family. Despite the majority of their time together spent hiding behind masks as they flirt and fight across Gotham's rooftops, Selina Kyle is one of the few people who truly understands Bruce Wayn e and vice versa. RELATED: 15 CRAZIEST Things From Batman: Knightfall After Catwoman first clawed her way into Batman's life in 1940's Batman #1, their relationship has been a vehicle in which to discover new and surprising elements of both Bruce Wayne and Selina Kyle's character. On the surface, the crusading vigilante and the thrill-seeking burglar couldn't be more different. But as their feelings grew through countless adventures, the Bat and the Cat learned how perfect for one another they actually were. Writer <mark>Tom King</mark> has been exploring still newer facets of their complex relationship throughout Batman \"Rebirth .\" In honor of Batman finally popping \"the question\" to Catwoman in Batman #24, CBR has collected some of the very best Catwoman/Batman team-ups! 15. REBIRTH Catwoman has been a major player in <mark>Tom King</mark>'s \"Rebirth\" Batman title since 2016. In \"I Am Suicide,\" Batman assembles a crack suicide squad of his own, including Catwoman, to break into Santa Prisca prison and steal the Psycho Pirate from Bane in order to help heal Gotham Girl's damaged psyche. Catwoman, who is on death row for killing 237 people, pretends to betray Batman for Bane, but that ploy turns out to be a double blind and the Cat breaks Bane's back just as Bane is about to crush Batman. When Bane returns to Gotham for revenge in \"I Am Bane,\" Catwoman once again proves herself to be Batman's most unpredictable ally, as she pretends to be kidnapped by Bane only to escape and free Bane's other Bat-Family hostages. 14. ROOFTOPS In Batman #14's \"Rooftops\" arc, Batman reveals to Catwoman as they smooch it out along Gotham's harbor that due to Bruce's deal with Amanda Waller, Catwoman will only receive a lifetime sentence without parole instead of the death penalty. How romantic! Batman needs to take Catwoman, in but instead, Selina convinces him to let them have one more night together. The two lovers take down a sling of minor villains like Clock <mark>King</mark> and Kite Man before passionately making love and fondly reminiscing of the first time they met one another. In a quaint and emotional callback to their storied history, Bruce references Batman #1 while Selina recalls their encounter in Frank Miller's \"Year One .\" Catwoman being Catwoman, she tells Bruce to chase her one last time and escapes in the early morning hours. She later saves Batman's life and the ensuing events help clear Catwoman's name as she actually took the fall for her friend and fellow orphan, Holly. 13. HUSH 2002's \"Hush\" written by Jeph Loeb saw a mysterious enemy from Bruce Wayne's past return to haunt the Dark Knight while also featuring an onslaught of classic Batman villains. Batman and Catwoman get hot and heavy pretty quickly after Bruce frees Selina from Poison Ivy's control. Bruce finally decides he should fully trust Selina and even reveals his secret identity to Catwoman in Batman #615! The two would team-up to fight not only Ivy, but also Harley Quinn, the Joker, and Superman as well throughout \"Hush .\" After defeating a faux Jason Todd reveals the arc's true mastermind, Bruce's childhood friend, Hush (a.k.a. Thomas Eliot) Batman's trust in himself is shaken. Was their love just a form of Ivy's control? Scarecrow's fear toxin? Can Bruce keep Selina safe? The Bat and the Cat end things. For now. 12. THE LONG HALLOWEEN Jeph Loeb and Tim Sale's iconic noir masterpiece \"The Long Halloween\" tells the story of Harvey Dent's fall as Batman, <mark>Gordon</mark>, and Dent attempt to take down the Falcone crime family early in Batman's career. Catwoman has her own reasons for wanting to bring down Falcone and her information leads to the destruction of the mob's secret stash of dough worth tens of millions of dollars. Throughout the story, Batman attempts to not only end Falcone, but also to understand Catwoman's seemingly personal connection to the crime family. Two-Face, a.k.a. Harvey Dent, finally murders Falcone at his estate flanked by the \"freaks\" and villains of Gotham, including Catwoman. The Cat attempts to fend off his daughter Sofia, but the enraged mob heiress is horribly injured after she plummets out the window. \"The Long Halloween\" and its sequels also imply that Selina is Carmine's illegitimate child. 11. FOREVER EVIL The 2013 DC crossover event \"Forever Evil\" saw the heroes and villains of Earth Prime attacked and brought low by the machinations of the Crime Syndicate and their allies. After the Justice League gets thoroughly owned by the Syndicate and imprisoned by Deathstorm within the Firestorm Matrix, Batman takes Catwoman to the Batcave as they prepare a counterattack in Forever Evil #4. Catwoman and Batman soon find themselves in for the fight of their lives after running into Lex Luthor's own team of villains as well as Power Ring's gang of baddies. Luthor teams-up with the Cat and the Bat and this new \"Injustice League\" confronts the Syndicate and the \"Mazahs\" - shouting Alexander Luthor at the Watchtower in a bloody final battle, defeating the Crime Syndicate for the time being. 10. HEART OF HUSH Written by <mark>Paul Dini</mark> and illustrated by Dustin Nguyen, Hush makes a horrific return in \"Heart of Hush\" by kidnapping Catwoman and surgically removing her heart. Selina Kyle is kept alive on a series of machines while Batman pursues Hush to defeat his childhood friend and secure Catwoman's heart. Their battle spills over to the Batcave and, in a shocking twist, Elliot reveals that he's performed plastic surgery on his face in order to resemble Bruce Wayne. Fortunately, Batman, Robin, and Nightwing overcome Hush and are able to save Selina's life. In Detective Comics #850, Bruce visits Selina in the hospital and tells her that he'll always love her. Catwoman takes her revenge on Hush by stealing his entire fortune and enjoys a well-deserved vacation on Thomas Elliot's dime. 9. BATMAN: PREY \"Prey,\" which consisted of Legends of the Dark Knight #11 through #15, explored more of the characters' early history. At the story's start, Batman is still a very controversial figure in Gotham and is distrusted by the police force and the public. Dr. Hugo Strange becomes a G.C.P.D. consultant and begins to unravel the mystery behind Batman's identity. However, while chatting with a female mannequin, Strange quickly reveals that he's actually a highly intelligent, but extremely weird, wacko who is obsessed with Batman. Meanwhile, Catwoman is accused by the media of being Batman's partner in crime, so the two do not meet on the best of terms. Catwoman bashes Batman with a pipe after being attacked by Strange's hypnotized, faux-Batman replacement. That's what qualifies as a fun date on the streets of Gotham. 8. BATMAN: TERROR A sequel to \"Prey,\" Legends of the Dark Knight #137 begins the \"Terror\" arc which sees Hugo Strange return from the dead to torment Batman with the help of Scarecrow. It also tries really, really hard to make every single part of the story burst with sex appeal. Strange becomes the chief psychiatrist at Arkham Asylum and breaks Jonathan Crane, a.k.a. the Scarecrow, out while Batman is thoroughly schooled by Catwoman after attempting to bring her in for robbery. When Bruce returns home, he finds Alfred taken hostage by Strange and that the good doctor believes Bruce Wayne is Batman! Unfortunately, the reinvigorated Scarecrow has other plans and blackmails Selina into luring Bruce back to the place it all began: the Monarch Theater. Catwoman decides she'd rather bet on Batman to take Scarecrow down and her carefully placed homing device leads the Dark Knight to the fear-mongering psychopath. 7. ONLY TAKES A NIGHT Writer Ed Brubaker's Catwoman #32 opens with Selina Kyle's return to Gotham City. Almost immediately upon her arrival Batman shows up to once again confess his feelings for her. Selina convinces Bruce to take a \"night off\" and they share dinner and a movie like a normal couple for once. Bruce is so happy to find Selina alive after all this time that he actually almost breaks down in tears. #32 focuses on exploring a time when Bruce and Selina are able to have a healthy and happy relationship. It shows how their feelings for one another help to mitigate the pain from the challenges from the war against crime in Gotham City. Selina has, for a moment at least, balance and fulfillment in her life and relationship with Bruce, both in and out of the mask. 6. A TOWN ON THE NIGHT After the conclusion of \"Crisis on Infinite Earths,\" Batman #392 opens with Catwoman and Batman teaming-up to stop some run-of-the-mill baddies as Selina is still convincing the G.C.P.D. that she's reformed since her jewel-snatching days. To celebrate, Batman takes Catwoman for a bite at his favorite late-night spot: the back alley of an Italian restaurant. But since it's Gotham City and no one can get through a meal without a crime being committed, Catwoman and Batman apprehend an assassin who whacks someone at the restaurant. A pattern begins to form after this, as everywhere they go there's crime to be stopped! Finally, they show up at <mark>Jim Gordon</mark>'s office and present the apprehended criminals--and a mountain of pizza--as a gift to the police commissioner. 5. THE BRAVE AND THE BOLD \"The Autobiography of Bruce Wayne!\" tells the tale of when Bruce first fell in love with Selina Kyle back in The Brave and the Bold #197. In Bruce's memoirs, he even refers to Selina as \"his wife!\" Plagued by the haunting memories of all the loves lost in his crusade as Batman and unable to contact any of his crime-fighting allies in a pinch, Bruce seeks out the help of Catwoman in order to apprehend Scarecrow. Batman and Catwoman prove themselves a spectacular crime-fighting duo as they overcome a series of challenges set forth by Scarecrow all the while realizing how powerful their connection really is, and how they can escape their pain and loneliness together. After suffering a blast of fear toxin that causes Batman to be afraid of cats and Catwoman of bats, Selina breaks the poison's grip by revealing her face, which prompts Bruce to do the same. 4. SECRET ORIGINS DC Superstars #17 threw some new secret origins at readers including the Huntress, daughter of Earth-2's Batman and Catwoman! In this universe, Catwoman had willingly surrendered to the G.C.P.D. and served out a prison sentence as punishment for her crimes. When she was finally freed and totally not scarred by prison, Bruce Wayne was waiting with open arms. Bruce's marriage to Selina was a happy and fulfilling one and his crusade as the Batman even took a backseat once their daughter, Helena, was born. The fairy tale ends when a criminal from Selina's past blackmails her after revealing evidence that she murdered someone as Catwoman. Knowing that Bruce would never forgive her, she agrees to take on one last job. Selina's accidental death during Bruce's fight with the criminal inspires Helena to become the Huntress. 3. HEAT A cat-costumed serial killer with Wolverine-like claws stalks the streets of Gotham during a heat wave in Legends of the Dark Knight #46, so Batman reluctantly teams up with Catwoman to stop him. Selina springs into action once she hears that the media is suggesting a connection to her own alter-ego, and soon the cat-killer begins targeting young women. If that isn't enough, <mark>Jim Gordon</mark> punches the racist mayor in the face and race riots start to rage across the city because of the serial killer. Selina, wearing revealing civilian clothes, lures the killer to attack her in the park where she and Batman send him scampering to the Gotham City Zoo and finally take him down at the Miss Gotham Beauty Pageant. Afterwards, Batman makes a big to-do about their partnership officially being over forever, but everyone knows how serious he was about that! 2. BATMAN INC.. After Batman and Catwoman steal a weapon called Project X from a Leviathan compound they travel to Japan (Selina under a pseudonym) to train Mr. Unknown as a Japanese Batman. But after finding Mr. Unknown murdered, Bruce takes on Unknown's protege to stop Lord Death Man from killing his way through Japan's superhero population. Catwoman is instrumental in Lord Death Man's defeat...by running him over in a truck. Thanks to their teamwork, Bruce's mission to spread his vision of Batman Inc. to Japan in issues #1 and #2 is a success. Selina's side mission in Japan--stealing the Crown Jewels of Poseidon--is foiled when Bruce reveals that the jewels have liquefied, as they cannot survive above a pressure of 1,000 atmospheres. Sure. Makes sense, Brucie. 1. DETECTIVE COMICS In Detective Comics #569 Catwoman is still trying to convince Batman that she's reformed, even turning in the members of her former gang when they continue to commit crimes. The Joker lures Batman, Catwoman, and Jason Todd, a.k.a. Robin, into a trap before capturing and torturing Selina Kyle. She's no damsel in distress, however. \"Recalibrated\" and suffering from amnesia due to the Joker's torture device, Catwoman attacks Batman. This \"new\" Selina turns on the Joker too and seems to have completely forgotten her feelings for the Dark Knight. Joker gets a few nasty cracks to the jaw from Batman for that, as the infuriated Bruce laments about how the likes of the Joker have cost him every woman he's ever loved. Doubtful, Dark Knight, because although Selina returns to her criminal ways, she won't be out of your love-life for long! Let us know in the comments which Batman and Catwoman pairing is your favorite! Share On Facebook Tweet Pint It Email Comment"}, {"articleID": "2020011005_00137782_W", "names": {"Francis Drake": ["Q52636398", "Q5480773"], "Joe Montana": ["Q348011", "Q6211408"]}, "date": "2020-01-10", "url": "https://www.ksl.com/article/46702584/san-franciscos-beefeater-doorman-retires-after-43-years", "content": "SAN FRANCISCO (AP)--Another bit of old, quirky San Francisco will be no more when Tom Sweeney finally hangs up his white pressed collar and signature Beefeater jacket this weekend after more than four decades of opening doors at the Sir <mark>Francis Drake</mark> Hotel downtown. Sweeney has taken the luggage of movie stars and shaken hands with every U.S. president from Gerald Ford to Barack Obama. Visitors from around the world have had their photos taken with him, often after he's told them where to catch the cable car and how to get to Fisherman's Wharf. \"It's one of the best jobs in San Francisco,\" says Sweeney, 62, as a cable car clanks by. \"Working outside a landmark hotel, cable cars come by every nine minutes, it doesn't get much better than that .\" The man known as a \"San Francisco original\" and \"living landmark\" retires Sunday after 43 years in a changed city. San Francisco continues to grapple with homelessness, aggressive panhandling and vehicle break-ins even as some residents have become wealthier amid a tech boom. The hospitality industry has also changed dramatically, making Sweeney a throwback to an era when doormen hailed cabs and wrangled wheel-less suitcases. Today, most people hail rides via smartphone, and hardly anyone carries cash for tips. <mark>Joe</mark> D’Alessandro, president and CEO of the San Francisco Travel Association, said Sweeney \"has been not just an ambassador but the embodiment of San Francisco's spirit--cheerful, helpful, upbeat, welcoming. He made visitors from around the world feel like instant friends .\" This week, Sweeney stood guard outside the Sir <mark>Francis Drake</mark>, near Union Square, in his elaborate British-style Beefeater jacket and knickers, red socks pulled to the knees and black hat decorated with red and white flowers. The 1928 hotel, named for the Elizabethan-era English explorer, has the costumes for its doormen custom-made. Sweeney's latest gold - and black-trimmed suit cost $3,000 and weighs about 40 pounds (18 kilograms). He tags luggage, waves to cable car passengers and grins for photos. Every now and then, Sweeney shoots his signature move: a finger snap accompanied by an \"Oh, yeah .\" \"I love your hat,\" says a boy checking into the hotel with his family. \"I love the flowers around it,\" says his sister, carrying a glittery pink backpack and a doll. Jennifer Emperador, a 39-year-old hotel concierge at Fisherman's Wharf, stopped by after her shift, determined to take a photo with Sweeney before he's gone. She lamented the loss of another fixture in a city where beloved businesses have shut down because of rising rents and changing consumer tastes. Luxury retailer Gump's, for example, closed its downtown doors in 2018, although new ownership may revive the store. \"It's almost like,\" What else is leaving in San Francisco?' \"she said .\" It's just not the same. \"Sweeney is not the hotel's only Beefeater doorman, although he is the best-known and the longest-lasting doorman in a city with about 100 of them. The San Francisco Chronicle toasted his 40th year on the job on its front page; he has his own plaque on the sidewalk in front of the hotel. The third-generation San Franciscan never dreamed he'd make such a mark impersonating a British guard when he took the job at 19 because his mother knew the hotel's general manager and they needed a doorman for the summer. He fell in love with the job, and San Francisco treated him like royalty. Then-Mayor Dianne Feinstein honored him with a special award in 1982 after he tackled--in full costume--two robbers fleeing with stolen suitcases. The other\" Nick of Time \"award winners that year were San Francisco 49ers quarterback <mark>Joe Montana</mark> and nimble-fingered receiver Dwight Clark for their role in\" The Catch, \"which led to the team's first Super Bowl win. Sweeney was frequently mentioned in the columns of Chronicle journalist and humorist Herb Caen, who memorialized San Francisco for decades. Getting a call from Caen, who died in 1997, was like getting a call from God, Sweeney said. At his San Francisco home, Sweeney stores news clippings, Beefeater memorabilia from fans, and previous costumes--he's had 46, one for every year plus some spares. The term\" Beefeater \"may refer to the guards who taste-tested food for French kings, or to the Beefeaters who still stand guard at the Tower of London, allegedly paid in beef chunks at one point. Sweeney is an avid marathoner who regularly runs San Francisco's annual\" Bay to Breakers \"race in costume. He has photos of himself with former British Prime Minister Tony Blair, actress Sharon Stone and U.S. House Speaker Nancy Pelosi. Dolly Parton was\" really cool, \"he recalls, and Prince had purple suitcases. And it's not just the famous he remembers. Sweeney still cracks up over the guest from Texas who double-parked outside the hotel and waved at a cable car--which runs on fixed rails--\"to go around\" her. \"As a doorman, you're a greeter, a porter, a guide, a ringmaster, a constable, a valet and a concierge all in one gig,\" he said. \"I'll miss it, the people. You're dealing with positive people all day .\" He marvels at how San Francisco has grown, from 11,000 hotel rooms when he started to more than three times that today. He's not as enchanted, however, with the panhandlers who trail after tourists. \"The homeless problem is out of control, car break-ins, we never saw that growing up here,\" he said. \"It's just so sad to see this happening .\" Sweeney has been working since he was 14, selling soda alongside Tom Hanks at the Oakland Coliseum. He's up for spending more time with his wife, Cindy, a hospitality executive whom he chatted up at a cable car stop about a quarter-century ago, and their four grandchildren. Outside the hotel, cable car training instructor Tsombe Wolfe hopped off for his own photo with Sweeney. \"Tom's the guy. Man, he's the staple,\" he says. \"He's an ambassador to the city, just like the cable cars .\" Copyright © The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. × Photos Janie Har"}, {"articleID": "2010012515_00136523_W", "names": {"Chris Armstrong": ["Q1076945", "Q3675448", "Q5105753", "Q5105754", "Q5105755", "Q55076124", "Q55101699"]}, "date": "2010-01-25", "url": "http://gratefultothedead.wordpress.com/2010/01/23/tangling-with-wolves-why-we-still-need-heresy-trials/", "content": "tangling with wolves: why we still need heresy trials i suspect this post will make some readers mad. good! respond to the post, and let's talk about it! my own parents disagree with it too. but today's world of gentle, neighborly, non-doctrinal churchmanship (sorry, churchpersonship), in which you can believe almost anything and still be considered a member in good standing of most churches, has missed a very important point: in matters of belief, souls are at stake. if we don't believe that, then we may as well pack it in. because as paul said, if the resurrection (to take one important example) hasn't happened, then we christians are of all people most to be pitied. we're just fooling ourselves. there's no logical reason we shouldn't stay home every sunday, crack open a cold one (or a case of cold ones) and enjoy ourselves in front of the tv set: why we still need heresy trials <mark>chris armstrong</mark> originally published in christianity today, summer 2003. u nited methodist bishop joseph sprague publicly denies that jesus rose bodily, that he is eternally divine, and that he is the only way to salvation. he has been charged four times with teaching heresies, and four times denominational representatives have acquitted him. this is not a lone incident. for decades before his retirement, episcopal bishop jack spong publicly repudiated nearly every line in the nicene creed and yet was never disciplined by his denomination. examples could be pulled from congregational, presbyterian, and lutheran churches. mainline leaders seem to perceive heresy as somehow an outmoded concept. or, at least, they see the heresy trial as an inappropriate venue for addressing such teachings. whatever their reasons, we are mistaken if we think modern objections to the prosecution of heretics come from sloppy thinking. to put the best face on it, such extreme leniency arises, rather, because many people are repulsed by the ways orthodox christian belief has been defended-in particular, how heretics have been prosecuted and punished. much more has been at work in historical heresy trials, george h. shriver insists in his dictionary of heresy trials in american christianity, than a simple desire to protect the faithful from bad doctrine. \"politics, jealousies, power struggles, anti-intellectualism, miscommunication, limits of knowing, grudges, personal animosities, confusion of ethics with doctrine\" have all entered into the picture, coloring not only the motivations of would-be defenders of the faith, but their actions as well. indeed. one need only think of the closed, secret trials and torture implements of the inquisition. shriver's conclusion: \"the heresy hunters have...often allowed themselves to pervert christian ethics in their pursuit of their goal of discrediting persons they have labeled\" heretics .' \"the truth of this objection to\" heresy hunting \"is only too clear from church history. but those who would use this historical evidence to attack all forms of heresy prosecution find it convenient to ignore one small fact: apart from jesus, no one has ever been exempt from mixed motives and unsavory methods. this means that the process of defining orthodox belief has always been mediated by, as historian r. scott appleby puts it in a u.s. catholic article,\" human agents who have a tendency to let their own passions, misunderstandings, and political rivalries intervene. \"so? so, read the old testament. or review the squabble between peter and paul over circumcision. the holy spirit has always found it necessary to work with the human materials at hand. and those materials have always been the same-not pretty. there was metaphorical (and sometimes real) blood on the floor of every one of the early church councils at which orthodox christian doctrine was defined and embodied in creeds. yes, it does take faith to believe that the decisions of these councils actually reflect belief as god would have it. it is the same act of faith that allows the christian to look around a church, see the assortment of annoying and downright unsavory characters occupying the pews, and affirm that the church is still, somehow, the\" body of christ. \"romancing the heretic the popular image presents the heretic as a courageous, powerless loner, exploring what fellow christians refuse to explore and paying the price at the hands of unprincipled church leaders motivated by entrenched prejudice. this holds no more water than the picture of the heretic as a black-hearted subversive and orthodox leaders as saints riding in on white horses. to take just one example, think of arius. this was the man whose teaching that jesus christ is less than fully divine (for a modern version, talk to a jehovah's witness) rocked the early church and led to the first ecumenical council. he and his followers were far from a weak, oppressed minority beset by power-hungry orthodox leaders. as tom oden puts it in his rebirth of orthodoxy, they\" lived by collusion with political oppressors. they had plenty of intellectuals and power manipulators on their side, while orthodoxy had to be defended largely by nonscholars and laypeople, by modest men and women of no means, by lowly persons who had no training or special expertise but understood their lives in christ. \"on the other hand, arius's opponent athanasius, the bold christian thinker whose leadership helped move the council of nicea to condemn arius, was no triumphant political manipulator. he was\" exiled a half-dozen times and chased all over the mediterranean world during the arian times. \"the example can be multiplied on both sides. to be sure, the inquisitorial practices of some past heresy hunts have left a permanent stain on the church-although the scale of what we might dub\" heresy abuse \"is often overblown. (contrary to popular fiction, being charged before one of the spanish inquisitions was not a guarantee of an auto-da-fé. statistical studies show that fewer than 2 percent of those charged were condemned to death .) still, we must not deny or defend travesties that did occur. at the same time, we must recognize the depth of the problem heresy trials have attempted to address. in most cases, not political but pastoral concerns have driven the church to prosecute teachers of aberrant doctrines. potent misdirection the problem is that the preached word has power-one way or the other. every sunday, unsuspecting people enter churches shepherded by those whose theological openness leads them to teach things we used to call heresies. what they hear in such teachings is not just divergent opinion. it is potent misdirection, capable of turning the sheep away from salvation. and this is the nub. as a teacher of mine once put it, if jack the ripper is abroad in your town, killing people and mutilating their bodies, the city's leaders must track him down and render him unable to inflict further harm. and if, as the historic church has always-until today-agreed, a person insists on teaching beliefs that threaten the eternal lives of all who hear them, that person must be disciplined and his harmful teaching rendered null within the church. it is easy for a comfortable\" christian \"society to demonize the mechanisms the historic church has developed to deal with heresy. but to wink at heresy is to suck the life from faith. heresies are worth fighting against, through the same kinds of mechanisms that the church has always used. yes, these mechanisms are tainted by politics and pride. but somehow still, we must believe, they have been used and will continue to be used by the holy spirit for the health of his church. in appleby's words,\" what we hold devoutly to be true, what we identify as the very core of our christian identity, has come to us through the imperfect channel of human history. \"<mark>chris armstrong</mark> is managing editor of christian history re-rooting spirituality in theology: a book worth reading: 31 minutes ago tangling with wolves: why we still need heresy trials: 1 day ago those odd, brilliant men and their scientific schemes: the religious back-story of the royal society: 3 days ago monks too heavenly minded to be any earthly good? hardly. meet the globe-trotting, pagan-busting boniface: 4 days ago christian history corner: no sex (before marriage), please...we're christian: sasquatches, unicorns, and...the history assignment that works"}, {"articleID": "2012111114_00084778_W", "names": {"Brendan Foley": ["Q27840129", "Q4960887"], "Mel Gibson": ["Q3854066", "Q42229"], "James Harvey": ["Q19560705", "Q3806599", "Q56887968", "Q590624", "Q6195480"], "Andrew Gordon": ["Q4757127", "Q4757131", "Q504876", "Q9151102"]}, "date": "2012-11-11", "url": "http://deadlinenews.co.uk/2012/11/11/war-bear-wojtek-to-hit-the-big-screen/", "content": "sunday, november 11th, 2012 | posted by a bear renowned for its help in some of the most significant battles of the second world war is to have a hollywood film made about him. wojtek, a syrian brown bear who drank two bottles of beer a day, fought alongside polish soldiers during the war before spending his final years at edinburgh zoo. he was adopted by soldiers of the 22 nd artillery supply company of the polish ii corps in 1942 and helped move ammunition during the battle of monte cassino. wojtek is reported to have carried shells at the battle of monte cassino <mark>brendan foley</mark>, a writer and director from belfast, has bought the film rights for wojtek the bear and plans to bring his story to the big screen with ned dowd, who worked as the producer on <mark>mel gibson</mark>'s apocalypto. mr <mark>foley</mark> said: \"it is an amazing story - a bit like war horse but with humour and pathos alongside the action, and the bear is a real character .\" one of the studios believed to be interested is steven spielberg's dreamworks, which made war horse. mr <mark>foley</mark> said: \"making a major film is always a long process, but we very much hope that some of the work and the locations will be in scotland, where the bear and his soldier minders ended up after the war .\" wojtek was an orphaned cub found by a boy in hamadan in iran who sold him for two tins of meat to polish soldiers stationed nearby. these soldiers had been held in russian internment camps but were released after hitler began his invasion of russia in june 1941. they were now heading for north africa with the allied forces opposing rommel's tanks in the desert. wojtek grew up among the men who fed him condensed milk from an empty vodka bottle and later honey, marmalade and syrup. the large bear lived in a tent with the men, drank two bottles of ale a day and used to swallow lit cigarette and exhale smoke as his party trick. he was taught how to salute when greeted and was enlisted as a private soldier with an official rank and number. wojtek became known as a legend when he helped in the battle of monte cassino in italy where he used his giant paws to carry heavy boxes of mortar shells from trucks to gun emplacements. the image of him carrying a shell became the regiment's official emblem. when the war ended in 1945, wojtek was dispatched to berwickshire with some of his polish comrades-in-arms. he was then taken into the care of edinburgh zoo in 1947 when the soldiers were demobbed as an attraction until he died there in 1963. it is believed that soldiers would continue to visit him and occasionally enter his enclosure to hug him. aileen orr, the author of wojtek the bear who sold the rights to mr <mark>foley</mark>, discovered the story growing up in berwickshire and by visiting edinburgh zoo. she is part of a trust that is raising funds to create a statue of wojtek with a polish soldier that was his minder. they want the statue to be placed on a plinth made from stone quarried from the polish soldiers' former camp in berwickshire and displayed in the scottish capital. she said: \"i knew after speaking to one of the poles who was in the camp that i wanted this statue to be a moment in time reflecting what the bear did hear in the scottish borders .\" he was free to run around; he was humanised and had no idea he was a bear; he thought he was a soldier, and so he could wander down the road with one of the men and just as villagers stopped to speak, he would stop and listen to the exchange. \"after a while, this was not deemed to be a remarkable thing as everyone got used to seeing him. top stories. you can follow any responses to this entry through the <mark>james harvey</mark>: i refer to the\" picking up son \"story and experienced the same situation when i travelled...benno: no wonder europeans have screwed the planet! benno: which one is the indigenous species, the harrier or the dog? the bird has more rights than the dog! its such a.. . <mark>andrew gordon</mark>: this piece confuses apparently blanket criticism of arts spending from the (wholly unelected and ..."}, {"articleID": "2017052500_00150984_W", "names": {"Gary Wagner": ["Q16934994", "Q5526099"], "Andrea Ross": ["Q18421096", "Q1997233"]}, "date": "2017-05-25", "url": "http://www.davisenterprise.com/arts/wagners-photos-of-the-redwood-coast-area-on-display/", "content": "<mark>Wagner</mark>'s photos of the Redwood Coast on display Share Tweet \"Redwood Coast: Sea and Land\" will feature the black-and-white photography of <mark>Gary Wagner</mark>. The show opens Friday, June 2, at YoloArts' Gallery 625 in Woodland. <mark>Wagner</mark>'s career spans more than three decades. His love of the photographic image began in Kokomo, Ind., as his high school newspaper's photographer. He attended the University of Bloomington, then earned a master's degree in photography from Brooks Institute of Photography in Santa Barbara. His professional career includes fine art, portrait and commercial photography. <mark>Wagner</mark> has taught theory and technique at colleges in Europe, focusing on the English country landscape. His latest book, \"Digital Black and White Landscape Photography, Fine Art Techniques from Camera to Print,\" was published recently and copies will be available for sale at the reception. \"The coastal landscape is an exciting and challenging environment to work in, as it is constantly changing with the light of the day and the interplay of tides, sand, and rocks,\" <mark>Wagner</mark> said in his artist statement. \"I find freedom, and inspiration to create my interpretations of the natural elements and scenic vistas that come to my view at these locations .\" On working exclusively in black and white, <mark>Wagner</mark> says \"color imagery for me is too close to reality and more of a visual record, than an artistic interpretation ....I find the magic of light on the sea to best be conveyed in black and white .\" The artist will attend the opening reception 5:30 to 8 p.m. Friday, June 2, during the downtown Woodland First Friday Art Walk. In the upstairs gallery of Gallery 625, the culminating exhibition for the almost year-long \"I SEE YOU\" project will open. Participants in this special collaboration and arts engagement for people experiencing homelessness in Yolo County are from Woodland, West Sacramento and Davis. YoloArts, the Yolo County Library, Fourth & Hope, Yolo County Social Services, the Woodland Library and other agencies worked together to provide art exploration and access to a variety of social services. \"The\" I SEE YOU' art program connected those needing a helping hand to some vital services with compassion, understanding and empathy. I got to know some very talented folks who touched my heart, and I expect that time spent listening to them will help them be successful in the future, \"said Kristen Cline, homeless program clinical supervisor for the Yolo County Department of Health & Human Services. Beginning at the Stephens Branch Library in Davis and moving to the West Sacramento Branch Library last year, the program recently concluded at the Fourth & Hope homeless shelter in Woodland .\" The clients have shared with me the excitement and joy the art class has brought to them over these weeks, and some of them will have their art in the show--it was a great opportunity to reach out to the community and share a fun activity, \"said Charlotte Baur, Fourth & Hope lead case manager. The artwork in the show includes pastel drawings, prints, 3-D work, masks, watercolor and painting. Teaching artists Melissa Uroff, Mary Anne Kirsch, <mark>Andrea Ross</mark> and Jim Vetter are expected to attend the reception along with those who created the artwork. All of the artwork will be for sale (cash only) with proceeds going to the artists and the program. Pianist Julie Dachtler will play during the reception Friday, June 2, until 7:30 p.m. Matchbook Winery will provide the wine for tasting. YoloArts board member Susan Lord Bovey will be the reception's host. Gallery 625 is at 625 Court St. in Woodland, in the Yolo County Administration Building, and is open from 8 a.m. to 5 p.m. Mondays through Fridays, and by appointment. For more information, call YoloArts at 530-309-6464."}, {"articleID": "2010091013_00281764_W", "names": {"Mark Bennett": ["Q16212765", "Q20022443", "Q4083831"]}, "date": "2010-09-10", "url": "http://staradvertiser.com/editorials/20100910_Furlough_ruling_a_narrow_win.html", "content": "a state judge halted gov. linda lingle's initial plan to furlough state employees last year before labor unions agreed to a tapered version. though now moot, the judge's ruling nevertheless was appealed, and the hawaii supreme court's overturning of it this week hopefully will have the effect of accelerating labor talks from both sides during the next fiscal crisis. in june of last year, lingle ordered that state employees other than those in the school system take 72 workdays off without pay for two years because of what she accurately declared to be \"an immediate fiscal emergency of unparalleled magnitude,\" since the state is constitutionally required to balance its budget. state law gives the governor power \"to carry out missions of the employer in cases of emergencies .\" instead of challenging the furloughs before the hawaii labor relations board, which is assigned to decide disputes over state labor law, the white-collar hawaii government employees association called the furloughs a violation of the state constitution, which broadly gives public employees the right of collective bargaining. the labor board is not authorized to decide constitutional issues. circuit judge karl sakamoto blocked lingle's furlough declaration on those constitutional grounds because it infringed on wages, one of the \"core subjects of collective bargaining .\" the lingle administration and hgea then agreed on 42 furlough days, resulting in layoffs that had not been foreseen in the 72-day plan. the supreme court ruled this week that hgea should have challenged the initial furlough declaration to the labor board instead of in circuit court, even though the labor board cannot consider constitutional issues. if the union had not prevailed before the labor board, it then could have appealed through the court system and argued that furloughs ordered by the governor without union consent would be unconstitutional. essentially, the high court's decision was confined to process: hgea shouldn't have skipped the labor board. in any similar situation in the future, the justices pointed out that once the labor board \"reaches a decision on the issues presented, that decision is subject to appeal\" through the courts. however, state attorney general <mark>mark bennett</mark> said he is \"extremely pleased\" with the supreme court's ruling because, he concluded, it makes furloughs a \"legally available\" option in the future. that is not so clear. the supreme court did not rule on whether the state should have prevailed in the dispute over its furlough plan. what is clearer is that the hgea overreached for a remedy even as it rooted itself against the governor's emergency furlough plan, as both sides felt the time pressure imposed by the budget crisis. clarifying parameters, as the high court's ruling does, is always good. but the fundamental lesson in this whole episode is this: prevent such a deteriorated situation from occurring in the first place. ideally, that will be realized as hawaii's economy improves, making public employee furloughs unnecessary. a state judge halted gov. linda lingle's initial plan to furlough state employees last year before labor unions agreed to a tapered version. though now moot, the judge's ruling nevertheless was appealed, and the hawaii supreme court's overturning of it this week hopefully will have the effect of accelerating labor talks from both sides during the next fiscal crisis. in june of last year, lingle ordered that state employees other than those in the school system take 72 workdays off without pay for two years because of what she accurately declared to be \"an immediate fiscal emergency of unparalleled magnitude,\" since the state is constitutionally required to balance its budget. state law gives the governor power \"to carry out missions of the employer in cases of emergencies .\" instead of challenging the furloughs before the hawaii labor relations board, which is assigned to decide disputes over state labor law, the white-collar hawaii government employees association called the furloughs a violation of the state constitution, which broadly gives public employees the right of collective bargaining. the labor board is not authorized to decide constitutional issues. circuit judge karl sakamoto blocked lingle's furlough declaration on those constitutional grounds because it infringed on wages, one of the \"core subjects of collective bargaining .\" the lingle administration and hgea then agreed on 42 furlough days, resulting in layoffs that had not been foreseen in the 72-day plan. the supreme court ruled this week that hgea should have challenged the initial furlough declaration to the labor board instead of in circuit court, even though the labor board cannot consider constitutional issues. if the union had not prevailed before the labor board, it then could have appealed through the court system and argued that furloughs ordered by the governor without union consent would be unconstitutional. essentially, the high court's decision was confined to process: hgea shouldn't have skipped the labor board. in any similar situation in the future, the justices pointed out that once the labor board \"reaches a decision on the issues presented, that decision is subject to appeal\" through the courts. however, state attorney general <mark>mark bennett</mark> said he is \"extremely pleased\" with the supreme court's ruling because, he concluded, it makes furloughs a \"legally available\" option in the future. that is not so clear. the supreme court did not rule on whether the state should have prevailed in the dispute over its furlough plan. what is clearer is that the hgea overreached for a remedy even as it rooted itself against the governor's emergency furlough plan, as both sides felt the time pressure imposed by the budget crisis. clarifying parameters, as the high court's ruling does, is always good. but the fundamental lesson in this whole episode is this: prevent such a deteriorated situation from occurring in the first place. subscribe now home delivery prices for oahu only. please call customer service at (808) 538-6397 for neighbor island and mail subscriptions. for weekend subscription rates commenting etiquette: to encourage open exchange of ideas in the staradvertiser.com community, we ask that you post with aloha, follow our guidelines and respect your fellow posters. don't say anything you wouldn't want your mother to read. civil. smart. on-topic. free from profanity. register an account with disqus. it's simple, takes seconds and will keep the comments free of trolls, cranks, and drive-by commenters. as a community site, we ask that the community help by using the \"flag\" link on each post if they feel a comment has violated these rules. you can also use the \"like\" button to indicate your approval of a particular comment. federal funds to help low-income farm workers in human trafficking case copyright? 2010 staradvertiser.com. all rights reserved."}]