[{"date": "2014-05-27", "url": "http://www.huffingtonpost.ca/nathan-dautovich/buying-a-house-in-toronto_b_5397648.html", "content": "Canada Has No Interest In Annexing This Paradise Tories Omit Survey Questions That Often Lead To Negative Answers Official: Nigeria's Military Knows Where Kidnapped Girls Are Being Held Ukraine Launches Air Strikes Against Pro-Russia Rebels SURPRISE! <mark>Steve Perry</mark>'s First Live Stage Performance In Nearly 20 Years Saw-Wielding Man Reportedly Slashes 2 Members Of Japanese Pop Group Striking Photos Of Mexico City's Retired Sex Workers Photographer Who Helped Launch Bettie Page's Career Dies Striking Photos Of Muay Thai Boxers Capture The Softer Side Of Masculinity 13 Music Festivals You Should Actually Attend This Summer Nathan Dautovich PropertyGuys.com Franchise Owner With prices of single family homes already up over 13 per cent year over year, the dream of owning a home in a desirable neighbourhood is quickly fading for many would-be Toronto home owners. In popular areas along the Yonge subway line, even semi-detached homes are now selling for over $1 million, which is out of reach for most buyers. The reason that prices have risen so fast is that more and more people want to stay in Toronto to raise their families instead of moving to the suburbs. Toronto has become a world class city with great restaurants, unique cultural events, and neighbourhood festivals all over the city. Also, with commute times at a record high, many people who work in the city would rather live close to their work so they don't have to spend hours every day in a car or on a train. So what options are there for people with a budget under $1 million who still want a home in a desirable neighbourhood? I posed this question to former city councillor <mark>Adam Vaughan</mark>, who has long believed that an important part of Toronto's growth as a city includes families living near the downtown core. <mark>Vaughan</mark> cites a regulation for new condos mandating that at least 10 per cent of all units in new buildings have three bedrooms or more. \"10 years ago, people were calling me crazy for pushing this regulation, saying that families would never want to live downtown,\" says <mark>Vaughan</mark>. \"In hindsight, I think we will probably look back and think that the 10 per cent requirement was too low .\" The facts seem to back up <mark>Vaughan</mark>'s statement, as three bedroom condos and townhouses close to the downtown core are now selling faster than ever before. There are schools and daycares opening up in the bottom of large condo buildings, and lots of new parks and playgrounds are being built. Another option that many home owners are not aware of that many newer condo buildings have knockdown walls between units. This means that two or more suites could easily be combined into a larger suite by removing a non-structural mutual wall built in a way that makes it easy to remove. While this is a rare occurrence right now, it is a fascinating example of a policy that allows the market to dictate what type of properties exist in Toronto's downtown core. If families continue to choose to live in the city, then there will be more demand for larger units, and savvy investors will combine two smaller suites into a larger suite to meet demand. It could also be a great investment for buyers to purchase two units side by side and rent one out for several years until their lifestyle requires a larger property. Then they can combine the units together and have a space just as large as a single family home. These options may seem unconventional right now, but if house prices continue to grow anywhere near the current rate, we could see the location of knockdown walls become essential information in every property listing. All of this is good news for home buyers. As the popularity of these larger suites closer to downtown increases, it could make detached homes more affordable, creating more of a balanced market. These changes could be years away, but Toronto is well positioned to offer a variety of options for families wanting to live close to the downtown core. Leaside/Thorncliffe Park - up 23% Median house price 2012: $1,213,000 Median house price 2014: $1,486,000 Prices for stand-alone houses, excluding condos/townhomes. * Note: Statistics for neighbourhoods are based on relatively small total sales figures, and thus can change rapidly. Source: Toronto Real Estate Board data via BuzzBuzzHome Lawrence Park/Forest Hill North - up 24% Median house price 2012: $993,000 Median house price 2014: $1,235,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Oakridge/Birchmount/Kennedy Park - up 28% Median house price 2012: $396,000 Median house price 2014: $505,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Riverdale - up 33% Median house price 2012: $568,000 Median house price 2014: $756,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Danforth/East York - up 34% Median house price 2012: $485,000 Median house price 2014: $650,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Church-Yonge Corridor/Cabbagetown - up 38% Median house price 2012: $1,300,000 Median house price 2014: $1,800,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome York Heights/Jane Heights/Black Creek - up 40% Median house price 2012: $475,000 Median house price 2014: $666,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rockcliffe-Smythe/Keelesdale-Eglinton West - up 41% Median house price 2012: $343,000 Median house price 2014: $483,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome The Junction/High Park North - up 52% Median house price 2012: $534,000 Median house price 2014: $810,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Trinity-Bellwoods/Little Italy - up 54% Median house price 2012: $635,000 Median house price 2014: $978,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Annex/Yonge-St. Clair - up 71% Median house price 2012: $782,500 Median house price 2014: $1,340,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome Rosedale/Moore Park - up 116% Median house price 2012: $1,175,000 Median house price 2014: $2,533,000 Prices for stand-alone houses, excluding condos/townhomes. Source: Toronto Real Estate Board data via BuzzBuzzHome ALSO ON HUFFPOST: COOLEST HOUSES FOR SALE IN CANADA Calgary - $4 million This newly-built home just northwest of downtown Calgary not only looks cool and has excellent views of the city, it features some pretty slick amenities, such as built-in kitchen appliances, a 1,500-bottle wine cellar and five bedrooms across 5,300 square feet of living space. Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Calgary - $4 million Montreal - $3.25 million This house in Montreal's old-money Westmount area was built in 1857 and, with its awesome wrap-around porch, may be the coolest heritage residential building for sale in Canada right now. It's actually three units--a main house, a townhouse in the back and what's referred to as the \"well house .\" Three bedrooms and two baths in the main house. Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million Montreal - $3.25 million West Vancouver - $7 million Can you say house with a view? This four-bedroom property features not only one of the best views out of anyone's living room window in the country, it also has an outdoor pool, sunk slightly below house level, with views all its own. Four bedrooms and an elevator in this house the realtor describes as an \"amazing entertainment home .\" West Vancouver - $7 million West Vancouver - $7 million", "articleID": "2014052723_00083330_W", "names": {"Steve Perry": ["Q1368134", "Q175857", "Q21401092", "Q7613592"]}}, {"date": "2014-05-29", "url": "http://www.abc.net.au/local/photos/2014/05/29/4014918.htm", "content": "Running from death's door as dialysis patient aims for a triathlon Jervis Bay's <mark>Clint Eastwood</mark> is training to become Australia's first triathlete on dialysis. (ABC: Justin Huntsdale) <mark>Clint Eastwood</mark> has heard all the jokes about his movie star namesake, but you probably haven't heard about how he hauled himself out of a darkness that was set to claim his life, and started training to be Australia's first triathlete on dialysis. \"At Christmas time, things were bad health-wise - I was living on pain killers, my conditions were flaring up and I couldn't walk so I was sleeping all the time and in a wheelchair .\" I decided after going through [over 30 years of] this horrible stuff, I'd finally had enough and it had just become too much. \"So he drove to Melbourne to tell his family that he was throwing in the towel after a long and difficult fight with kidney failure. Just one week away from his blood cleaning dialysis machine would've been enough to end his life .\" I got to Melbourne and no one wants to deal with stuff like that, I mean, how do you tell your own mother you don't want to be here anymore? \"On the cusp having that conversation, he says he had a\" light bulb moment' and realised that instead of quitting on life, he would seize what he calls his last throw of the dice. He chose to become a triathlete, inspired by reading the story of American dialysis patient Shad Ireland who did the same thing. \"Reading his story ignited a spark in me, then seeing stuff on Facebook of kids with no legs, blind athletes, and paralympians, I wondered what the hell am I whinging about?\" To be fair, he has a right to whinge. Diagnosed with kidney failure at age three, he's had three failed kidney transplants, was told a fourth would kill him, and was also told he wouldn't make 40 years of age. He has trouble finding employment because his dialysis treatment forces him to be connected to a machine that cleans his blood in a hospital, three days a week for five hours per session. \"I do it myself - it's like part time work but without the pay .\" But remarkably he still has a sense of humour about it all, and that's probably been enhanced with his fitness kick. He left Melbourne early and drove back to the Shoalhaven of southern New South Wales and signed up at a gym before he went home. \"I've lost 17.5 kilograms since January and people have noticed a physical and mental change in me,\" he says. \"You only live once and whether you have a long time or a short time, it's about making the most of the time you have .\" Stop wasting time and sitting there thinking woe is me and enjoy what you've got, particularly up here [in Wollongong]. \"He's at the gym several times a week (around his dialysis treatment), has started surfing and has received sponsorship from local businesses to help pay for his fitness equipment .\" All I'm trying to do is be proud of something I've done.", "articleID": "2014052913_00074808_W", "names": {"Clint Eastwood": ["Q2979323", "Q43203"]}}, {"date": "2014-05-29", "url": "http://www.oregonlive.com/blazers/index.ssf/2014/05/you_be_the_gm_trail_blazers_center_victor_claver.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to Portland Trail Blazers season wrapped, we evaluate the roster player-by-player, giving the fans the power of who should stay and who should go. Height/Weight: 6-10/235 NBA experience: Two seasons 2013-14 salary: $1,330,000 Contract status: Claver will enter the third year of his rookie deal, worth $1.37 million next season. 2013-14 season notables: Grabbed four rebounds in his first career playoff game on May 10 vs. San Antonio...Recorded 12 points, six rebounds and four assists on April 16 vs. L.A. Clippers...Scored a career high 13 points on 5-for-7 shooting on Feb. 26 vs. Brooklyn...Recorded five points and five rebounds in 24 minutes on Feb. 24 against Minnesota. Victor Claver's second NBA season will likely be paired - fair or not - with the dreaded \"sophomore slump\" label. One of six second-year players on the 2013-14 Trail Blazers, Claver saw the least action (184 minutes total) of his fellow sophomores--the byproduct of an upgraded roster. He appeared in just 21 games this season, spending 45 of the other 61 games on the inactive list. Despite seeing limited playing time, the 25-year-old Claver said being a member of a playoff team provided him with plenty of learning experience to take forward. \"It has been a tough season for me, being inactive most of the games,\" Claver said in his exit interview with the media. \"I'm lucky that that team was doing so well and I was in the routine with everybody, working out every day with the coaches, and that's what I'm going to take from this season .\" The heady Claver, while naturally a small forward, will also take away the experience of playing both at three and stretch-four this year. \"I know that's something good for me, playing both positions,\" Claver said. \"I think as a three I can do a lot of things, not only shoot. As a four it's easier for my body, because I don't have to (chase around faster small forwards). I know how I need to improve and I know what I need to improve and I know what kind of player I want to be .\" Trail Blazers forward Victor Claver talks about a frustrating season, the summer and the future. \"I want to rest and work out on the things I need to improve and get ready for the national team this summer, because it's very important for me for the team to play well this summer,\" he said. With a year left on his current contract, Claver remains committed to playing in the NBA - whether in Portland or somewhere more minutes may be available. \"I have one more year on my contract,\" Claver said. \"I want to play one more year (in the NBA).\" I need to play. I don't know where. I don't know if they're gonna give me the opportunity here or I'll have to go to another team but I need to play because it's my last year and it's very important for me. \"Trail Blazers' Hall of Fame coach dies at 89 <mark>Jack Ramsay</mark>, the legendary coach who led the Portland Trail Blazers to the NBA championship in 1977, died Monday in Naples, Florida, after a 15-year battle with cancer. He was 89. Covering <mark>Jack Ramsay</mark>'s Trail Blazers was a daunting, educational dream: <mark>Steve Kelley</mark> column Registration on or use of this site constitutes acceptance of our Privacy Policy? 2014 Oregon Live LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Oregon Live LLC.", "articleID": "2014053000_00034626_W", "names": {"Jack Ramsay": ["Q1677183", "Q6114740"], "Steve Kelley": ["Q7613000", "Q7613003"]}}, {"date": "2014-06-02", "url": "http://www.idigitaltimes.com/articles/23280/20140602/ea-sports-ncaa-likeness-lawsuit-40-milliom-settlement.htm", "content": "EA Sports, NCAA Likeness Lawsuit: Proposed $40 Million Settlement, Current Student Athletes Eligible For Payouts [REPORT] Kahlil Thomas on June 2, 2014 11:38 AM EDT EA, along with the CLC, agreed to pay $40 million to current and former NCAA student athletes to resolve their end of the NCAA likeness lawsuit. The agreement has to be approved by the presiding judge in case. (Photo: Twitter/EA Sports) For the last four and a half years Electronic Arts, the NCAA and the Collegiate Licensing Company has been engaged in a lawsuit with Ed O'Bannon, <mark>Sam Keller</mark> and other current and former student athletes. At issue is the NCAA, along with EA and the CLC, using the likeness of the NCAA athletes without any type of reimbursement for the student-athletes themselves. While the NCAA continues to fight the claims of O'Bannon and <mark>Keller</mark>, EA and the CLC announced that the two companies and the student-athletes agreed in principle to a settlement in the lawsuit last year. In documents filed Friday night, the lawyers representing the players asked for the court to finally approve the settlement. With the settlement, over 100,000 current and former NCAA football and men's basketball players are included for possible payment from the $40 million deal made between the players, Electronic Arts and the CLC. This means that for the first time in history, current NCAA athletes could receive payment for using their likeness in a video game. Now while this settlement has been agreed to, this only represents the EA-CLC portion of the lawsuit. The O'Bannon suit against the NCAA is set to begin its trial on June 9 Now while NCAA rules makes it illegal for a current student athlete to profit off of their name and likeness while a student, something that happened to a very famous ex-college football player while he was still in school may have changed that rule and made this settlement possible. \"While in college, former Texas A & M quarterback Johnny Manziel sued a man who sold shirts using the football player's trademarked\" Johnny Football \"nickname. The NCAA said then it would allow Manziel to collect damages if his corporation's lawsuit won,\" wrote CBS Sports' Jon Solomon. \"That's one of the most interesting things is what's the NCAA going to say about eligible players?\" said Leonard Aragon, an attorney for the <mark>Sam Keller</mark> plaintiffs in the video game settlement. \"It's our opinion that it's the same thing here as Manziel. If someone stole your laptop, you'd be able to get payment and still be considered an amateur. Here, right of publicity is a property right .\" Back in September, EA cancelled their NCAA Football franchise while the lawsuit was still pending. This was after the SEC conference pulling out of the game also. \"Today I am sad to announce that we will not be publishing a new college football game next year, and we are evaluating our plan for the future of the franchise,\" said Cam Weber, GM of American Football from EA Sports on the company's site. \"This is as profoundly disappointing to the people who make this game as I expect it will be for millions who enjoy playing it ach year .\" \"We have been struck in the middle of a dispute between the NCAA and student-athletes who seek compensation for playing college football. Just like companies that broadcasts college games and those that provide equipment and apparel, we follow rules that are set by the NCAA - but those rules are being challenged by some student-athletes. The ongoing legal issues combined with increased questions surround schools and conference have left us in a difficult position - one that challenges our ability to deliver an authentic sports experience, which is the very foundation of EA Sports games .\" Rod Carey, another of <mark>Sam Keller</mark>'s lawyers, estimates that 7,000 players, or 20% of current college athletes in Division 1-A, are eligible for a payment from settlement. The payouts could range from $96 and $517 per roster year appearance, depending on the amount of claims made by players. A player who claims who appeared in four consecutive editions of EA Sports' NCAA Football games could receive thousands of dollars due the settlement. As of press time, the NCAA themselves are reviewing the terms of the agreement, which is the first time that a NCAA partner will reimburse student athletes for using their likeness. Here is what the named plaintiffs in the EA-CLC case will receive. - $15,000 to former Arizona State/Nebraska football player <mark>Sam Keller</mark> - $15,000 to former UCLA basketball player Ed O'Bannon - $15,000 to former Rutgers football player Ryan Hart - $5,000 to former West Virginia football player Shawne Alston - $5,000 to the remaining plaintiffs who were deposed - $2,500 for all other named plaintiffs In March, Judge Claudia Wilken ordered the NCAA and O'Bannon's lawyers to set June 9 th as the date that the case would go to trial. With EA and the CLC out of the lawsuit, pending Judge Wilken's approval, it seems that the NCAA are on an island by themselves in a case that could change the way things are done in college athletics...and it's about time. EA Is The Worst? NCAA Football Cancellation Not Court Ordered But Right Thing To Do NCAA Football 14 Review: EA Sports' New College Football Game May Be The Best Ever In The Series State Of Decay: Lifeline Solidifies Undead Labs Current Dominance Over Zombie-Survival Genre [REVIEW] Pokémon X And Y News: Delta Emerald Could Join Omega Ruby, Pokémon Alpha Sapphire According To Nintendo Trademark State Of Decay: Lifeline Solidifies Undead Labs Current Dominance Over Zombie-Survival Genre [REVIEW] Xbox One Vs PS4: Sony Might Not Exist By End Of Console War - International Digital Times Watch Dogs Wii U Release Date: So, Um, When IS Watch Dogs Coming To Nintendo? - International Digital Times Metroid Prime 4: Will Nintendo Announce A New Metroid Wii U Game From Retro At E3? - International Digital Times", "articleID": "2014060222_00094347_W", "names": {"Sam Keller": ["Q15438098", "Q7407734"]}}, {"date": "2014-06-02", "url": "http://newswise.com/articles/view/618738/?sc=rsmn&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "Breaking News Channels provide a rapid response to major news events. Novel NextGen Sequencing Test Developed for Retinoblastoma Test identifies germline mutations of gene responsible for childhood eye cancer 6/2/2014 5:10 PM EDT Source Newsroom: Contact Information Available for logged-in reporters only Newswise - Researchers at Children's Hospital Los Angeles (CHLA) have developed a unique next-generation sequencing test for the gene linked to retinoblastoma. The new approach is both more comprehensive and can be conducted in less time than existing tests - enabling early detection of the cancer's genetic cause, which is critical for optimal treatment outcomes. The test was developed to serve the needs of the Retinoblastoma program at CHLA's Vision Center, one of the largest clinical programs in the U.S., caring for approximately 20% of the nation's retinoblastoma cases and seeing as many as 50 new patients each year. Retinoblastoma - a malignant cancer of early childhood that arises from immature retinal cells in one or both eyes - can start growing at any time before birth up until about seven years of age. Among infants and children, common signs of this cancer include having a white \"glow\" or \"glint\" in the pupil of one or both eyes, the presence of a white pupil in a color photo, or crossed or misaligned eyes. Early detection is vital because, when left untreated, retinoblastoma can result in blindness or death. In germline cases, the disease causing mutation is present in cells throughout the body resulting in tumors in both eyes, as well as in other locations throughout the body. Therefore, early detection and accurate diagnosis are critical for determining the best course of treatment. A team of physicians and scientists from the Department of Pathology and Laboratory Medicine's Center for Personalized Medicine, working with clinicians and surgeons from the Vision Center, developed the CHLA retinoblastoma next generation (RB1 NextGen) sequencing panel based on deep DNA sequencing technology, using novel technical and bioinformatics methodology to sequence the entire RB1 gene. Conventional genetic testing for retinoblastoma typically involves sequencing of specific hot spots within the gene where there are known to be numerous mutations. When CHLA researchers set out to develop their own laboratory-derived test, they took a very different approach in order to sequence the entire gene from end to end. \"Typically, we have used NextGen sequencing capability to sequence many genes at a relatively low depth of coverage\" explained Alexander Judkins, MD, FRCP, head of the Department of Pathology and Laboratory Medicine. \"Our team took a very different approach by deciding to look at a high depth of coverage of a single gene, sequencing through the entire gene, which is technically very difficult to do .\" With the existing NextGen sequencing approach for retinoblastoma, there are regions of genes that do not get examined at all, potentially allowing significant data to be missed, added Timothy Triche, MD, PhD, Director of the Center for Personalized Medicine at CHLA. \"New data tells us that the non-coding DNA is extremely important. And one of the strengths of our approach is in examining those non-coding areas .\" By sequencing the whole gene, researchers are able to see more frequent occurrences of germline mutations of the RB gene. Because germline mutations can be passed on, this knowledge can better inform the correct treatment approach for patients when these mutations are identified. \"We used to think that if a child had a tumor in one eye and not in the other eye, it was a result of a somatic mutation. And because somatic carriers don't pass on mutated genes, we believed removal of the tumor stopped the cancer,\" says <mark>Tom Lee</mark>, MD, Director of the Vision Center at CHLA. \"But now we know that there is a percentage - on the order of 10 to 15% of those children who had an apparent somatic mutation - who are actually carrying a germline mutation, putting them at risk of developing subsequent tumors during adolescence or early adulthood .\" <mark>Lee</mark> said that the ability to determine the existence of RB1 germline mutations early has significant implications - not only for the prognosis of a new patient with retinoblastoma, but for siblings who could also be at risk and eventually for a patient's own children, if a germline mutation is detected in a retinoblastoma survivor that could be passed on to future generations. With a legacy of treating hundreds of children with retinoblastoma, CHLA now has the ability to also offer this unique and comprehensive screening test to survivors of the disease or their family members, as well as to patients at other cancer centers. \"We believe that siblings and children of carriers of the germline should be tested immediately after birth because by detecting the gene mutations early can save a patient's vision,\" says <mark>Lee</mark>. Approximately two-thirds of retinoblastoma patients at CHLA have unilateral cases of RB, or cancer in just one eye. While only 15% of cases will test positive for a germline mutation, physicians must treat all patients as though the cancer could potentially be bilaterial, or present in both eyes, a condition commonly associated with having a germline mutation. \"Historically, genetic testing can take up to three or four months-which is a very long time when a child's health is at stake,\" said Jonathan Kim, MD, director of the Retinoblastoma Program at CHLA. \"Doing our tests faster and on site has the potential to significantly improve treatments outcomes for all of our patients .\" \"This test enables our researchers to look at the RB1 gene more comprehensively,\" says Judkins. The collection of new genomic data on RB1 will hopefully enable basic researchers to translate this material into biologically meaningful insights, leading to earlier detection and new treatments for both primary and recurrent disease. \"Heath care providers interested in the new RB1 NextGen Sequencing test may contact the Laboratory Service Center of the Department of Pathology and Laboratory Medicine at Children's Hospital Los Angeles by calling KIDZ LAB (877-543-9522) or 323 361 2423. About Children's Hospital Los Angeles Children's Hospital Los Angeles has been named the best children's hospital on the West Coast and among the top five in the nation for clinical excellence with its selection to the prestigious U.S. News & World Report Honor Roll. Children's Hospital is home to The Saban Research Institute, one of the largest and most productive pediatric research facilities in the United States. Children's Hospital is also one of America's premier teaching hospitals through its affiliation since 1932 with the Keck School of Medicine of the University of Southern California. For more information, visit CHLA.org. Follow us on Twitter, Facebook, YouTube and LinkedIn, or visit our blog: WeTreatKidsBetter.org.", "articleID": "2014060313_00064907_W", "names": {"Tom Lee": ["Q16233960", "Q29425405", "Q7816555"]}}, {"date": "2014-06-03", "url": "http://insiderlouisville.com/lifestyle_culture/kentucky-mans-comic-book-bonanza/", "content": "Public perception of Churchill Downs is anything but rosy these days Kentucky man's comic-book bonanza up for auction; sale ends tonight! Superman features prominently in the <mark>John Wise</mark> collection. Paducah, Ky. insurance exec <mark>John Wise</mark> is about to see a lot of green from the sale of his astonishing!) collection of comic books. And we ain't talking about Kryptonite. We're talking cash, obvs, and Murray State-grad <mark>Wise</mark>, 62, may soon see $1 million, if not more, from the online auction of his great collection of Golden Age comics, says Vincent Zurzolo, the chief operating officer of Comicconnect.com, the online site auctioning <mark>Wise</mark>'s collection. The online auction is ongoing, and concludes thisÂ evening at 7 p.m. <mark>Wise</mark>'s collection of 175 choice books includes Action Comics No. 1, the first Superman, Detective Comics No. 27, the first Batman, Marvel Comics No. 1, the first Sub-Mariner and Human Torch, and Flash Comics No. 1, the first, wait for it, Flash. You could say he's got pretty much a murderers' row of the greatest hits of the greatest comic book heroes of all time. And the Flash. \"What makes his collection special is not only the value but the breadth,\" says Zurzolo. <mark>Wise</mark> really focused on high-quality books from the late '30s through the '50s, when many of the key heroes listed above were introduced. Few good quality copies of these books survive today, Zurzolo says. <mark>Wise</mark>'s Action No. 1, for example, is in very good shape for a book that was introduced in 1938, Zurzulo says. Only 100 of these books survive today, from the half-million or so that were originally printed. A great quality copy of Action No. 1 was sold, by Comicconnect.com, for $2.16 Â millionÂ the record. <mark>Wise</mark>'s book is not in that kind of condition, and condition is everything with comics, but even now it's got an $80,000 bid with time left on the auction clock. Zurzolo believes it will likely fetch close to $100,000, as should the first Batman. <mark>Wise</mark> bought many of his books in the 1990s, when they traded for a fraction of what they go for now. Even after Comicconnect.com takes its 10 percent auction commission he should still do quite well, Zurzolo says. The books' values have been boosted in recent years by the success of all the various comics-related movies that have set cinemas ablaze over the past decade.", "articleID": "2014060322_00012365_W", "names": {"John Wise": ["Q1702197", "Q18385590", "Q21988583", "Q6218000", "Q6264668"]}}, {"date": "2014-06-04", "url": "http://www.telegraph.co.uk/news/uknews/queen-elizabeth-II/10873294/Queens-Speech-a-timeless-new-coach-only-eight-years-too-late.html", "content": "Queen's Speech: a timeless new coach, only eight years too late Tom Rowley, and Jonathan Pearlman in Sydney 7:00 AM BST 04 Jun 2014 div class = \"bylineSocialButtons\" > Weighing three tons and at a cost of millions of pounds, it is Queen's latest 80th birthday present. But when she steps into her new state coach for the first time on Wednesday, for the procession to the state opening of Parliament, she could be forgiven for raising an eyebrow at its arrival, eight years too late. The coach, now named after the Diamond Jubilee only two years ago, is an extraordinary gift from a 64-year-old Australian craftsman who once spent three years looking after the Queen's horses. Jim Frecklington, an ardent royalist who grew up on an outback sheep farm, has spent the last nine years building the coach, mortgaging his house to finance the $5M (£ 2.7 m) project. Gold inlaid carriage which may carry Prince William to wedding completed for the Queen At 18ft (5m) long and 11ft (3m) high, it is only the second coach to be built for the royal family in the last century. And Mr Frecklington has not wasted the opportunity, creating a \"time capsule of British history\" on wheels. More than 100 fragments from historic British buildings have been incorporated into the bodywork, including wood from the Mary Rose, Henry VIII's flagship, and a piece of a doorway from 10 Downing Street that dates back to 1760. The armrests were crafted from the Royal Yacht Britannia's handrails and the crown that sits atop the roof was carved using oak from HMS Victory, Admiral Nelson's ship. There is apple wood from Woolsthorpe Manor, the birthplace of Sir Isaac Newton, and timber from Sir Ernest Shackleton's Antarctic base. Mr Frecklington built his first cart at the age of eight when a stubborn Shetland pony refused to be ridden on the family farm. Building carriages quickly grew to become an obsession. Interior view of the Diamond Jubilee State Coach (© HM QUEEN ELIZABETH II) In 1972, he moved to Britain and joined the Royal Household, initially looking after the Duke of Edinburgh's horses at Windsor Castle. Later, he tended to the Queen's show horses at Buckingham Palace, driving carriages on ceremonial occasions and serving as an outrider at Royal Ascot. Three years later, he moved back to Australia, but maintained his royal connections. He took two royal coaches across the country during the Queen's Silver Jubilee exhibition in 1977. \"People would often ask\" does anyone make coaches any more?' \"he said .\" The art of making coaches was lost as the men who made them had all gone into making bodies for motor vehicles. \"Mr Frecklington was determined to change that. So, in 1988, the Queen gave him his blessing to make his first royal carriage, the Australian State Coach. It was given by Australia to mark the country's bicentenary and has been used by the Queen for previous state openings of Parliament. As a token of her gratitude, Mr Frecklington was awarded the Medal of the Order of Australia. That first coach took just 11 months to finish, but this one has taken rather longer. Because it is his own\" private initiative \"rather than a palace commission, Mr Frecklington has found it difficult to finance the coach's construction. The Australian government gave him a $250,000 (£ 138,000) grant, but turned down a subsequent request for a further $5m. Mr Frecklington was undeterred, and instead mortgaged his house and persuaded some of the 50 craftsmen to work on the project as a favour. Brass plaques commemorate famous people, events, and feats of engineering accross the ages (© HM QUEEN ELIZABETH II) David Flint, a friend and fellow Australian monarchist, said Mr Frecklington had taken a\" substantial risk \", but was\" driven \"to complete the coach by his\" tremendous respect for the monarchy \".\" This has been a monumental project that he has undertaken, \"said Prof Flint .\" He took a risk, which involved a considerable amount of money. I think it was several million [Australian dollars]. I understand he did mortgage his place for it. \"He has a very fine sense of what is beautiful and appropriate, and a spectacular way of bringing together craftsmen. He has a tremendous respect for the monarchy .\" He likes the sense that there is something tangible which represents history and tradition and is also something that is practical and beautiful. \"The coach has now been purchased by the Royal Collection Trust, which will put it on public display in the Royal Mews at Buckingham Palace from Sunday. A spokesman refused to disclose how much they paid for it, and whether Mr Frecklington remains out of pocket. But Mr Frecklington has said he regards his endeavours as\" money well spent \"and\" good value \". He has travelled to London and will watch his coach take to a public road for the first time on Wednesday. For the past nine years, it has sat in his workshop, a former army barracks in a Sydney suburb. From his workshop, he arranged for the four lamps, with crystal panels, to be hand-blown and cut in Edinburgh and for 260 sapphires and 48 diamonds to be fitted into the door handles. The door panels are inlaid with timber from dozens of historically significant buildings, including St Paul's Cathedral, the Tower of London, Eton, and Oxford and Cambridge universities. There is also timber from Althorp, the final resting place of Diana, the Princess of Wales, the old royal box at Ascot, and from the Ferriby Boat, which dates back 3,800 years. The bodywork features a calibration penny used to fine-tune <mark>Big Ben</mark>, a lead musket ball from the Battle of Waterloo and a piece of metal from the casting of the Victoria Cross. A\" tribute case \"contains a fragment from the stone of destiny, used in the coronation ceremony, which was stolen from Westminster Abbey by Scottish nationalists in 1950 and is now kept in Edinburgh Castle. Mr Frecklington sent out hundreds of letters requesting the samples, and he was supported by English Heritage and the royal household's surveyors of the fabric. Aside from a discreet engraving on the wheel, there is no nod to the coach's designer. He is happy instead to celebrate\" one of the greatest monarchs that has ever lived \". British constitutional historians say Spanish king's abdication will have no effect on the Queen People diary: how the Duke of Edinburgh lightened the mood at disability event Malaysia Airlines plane search: British yachtswoman\" saw MH370 on fire' Two 12-year-old girls charged with trying to murder friend to please Internet demon Queen's Speech set to outline pensions reform as Coalition bids to prove it is \"no zombie government' Newark by-election descends into class warfare over candidates' fortunes Sudanese woman sentenced to death gave birth with her legs chained Bowe Bergdahl: a darker story behind the release of America's last prisoner of war Indian court asked to rule on whether Hindu guru dead or meditating Elliot Rodger may have used machetes to murder house-mates in\" killing chamber' Sudanese woman sentenced to death gave birth with her legs chained California drive by shooting: Suspect reportedly \"son of Hunger Games assistant director' Islamic court permits pregnant woman to give birth before she is hanged", "articleID": "2014060414_00051858_W", "names": {"Big Ben": ["Q2902145", "Q295364", "Q537679", "Q599161", "Q657876"]}}, {"date": "2014-06-04", "url": "http://crushable.com/2014/06/04/entertainment/cameron-diaz-dating-benji-madden-weird-couple/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:", "content": "The Inspiration Behind Kate McKinnon's Justin Bieber Impression Is Hilariously Perfect Jonah Hill Apologizes Again For His Homophobic Slur, Continues To Seem Sincere There's Another Video Of Justin Bieber Using The N-Word, So It's A Good Thing He Isn't Racist Here's That Video You Wanted Of Jill Duggar Getting Proposed To By Derick Dillard Shailene Woodley Tried To Clarify Her Feminism Comments, Just Confused Us Further Cameron Diaz and Benji Madden are apparently dating, and if it's true, this is one of the most promising entries in the \"Weirdest Couple Ever' competition I've seen in a long time. Honestly, these two are gonna be tough to catch, people. We'd have to do something drastic like get Paris Hilton together if we want even a hope of passing them up. I know it's a big sacrifice to make for you Cumberbitches, but we have to keep our collective eyes on the prize! There have been rumors for a couple weeks that Benji and Cameron were dating when they were seen together at a gym in LA, but Benji refused to confirm the rumors when he was asked during an interview on an Australian radio show. But now Star Magazine is able to confirm that even if the two aren't officially dating, they're at least making out, because they up and got some pictures of it. And in addition, another source says they saw Benji and Cameron having breakfast with a group of six people at ABC Kitchen in Manhattan:\" Throughout the entire meal, Cameron and Benji couldn't keep their hands off each other. They were whispering to each other and laughing, just having the best time together. \"Well this sounds pretty cute, actually. And for anyone who's wondering how they met, it was apparently through Cameron's friend Nicole Richie, who as you may recall is married to Benji's brother and Good Charlotte bandmate, Joel Madden .\" Everyone else at the table was talking and catching up, but Benji and Cameron were completely removed from the conversation. They were totally consumed with each other. Benji kept his arm around her, and she'd just rest her head on his shoulder and stare at him, grinning. It was obvious that she's crazy about him. \", and <mark>Alex Rodriguez</mark>, so Benji isn't someone I'd expect to be her type. What are they feeding those Madden boys that they're able to pull dime pieces like Cameron and Nicole? Good for them .\" I wouldn't be surprised is they are together for a very, very long time. \"Cameron Diaz Pranked Jimmy Fallon's Baby, And They Have The Adorable Photo To Prove It In Defense Of Kooky Cameron Diaz And Her Apparent Quest To Become A Wise Old Crone", "articleID": "2014060422_00038977_W", "names": {"Alex Rodriguez": ["Q17620655", "Q2576780", "Q2641483", "Q558664"]}}, {"date": "2014-06-06", "url": "http://www.latimes.com/entertainment/la-et-mg-casey-kasem-hospitalized-critical-condition-20140606-story.html?track=rss", "content": "Casey Kasem makes an audition tape in 1971. Casey Kasem broadcasts on radio station KIQQ in 1981. Casey Kasem receives the Radio Icon award during the 2003 Radio Music Awards in Las Vegas. Caption Kasems at tribute to Barbara Walters Casey Kasem and his wife, Jean, arrive at the Museum of Television and Radio's gala tribute to Barbara Walters at the <mark>Beverly Hills</mark> Hotel in 2004. Casey Kasem's health has continued to falter during the radio host's stay in a Washington State hospital, according to several reports. Related story: Raw meat, King David latest in bizarre Casey Kasem family drama Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. (Nardine Saad) \"Mr. Kasem is alert and appears comfortable at this time,\" said hospital spokesman <mark>Scott Thompson</mark>. \"Any further updates on Mr. Kasem's condition will be at the discretion and approval of his children .\" The ailing radio icon, who suffers from Lewy body dementia, is said to be receiving antibiotics through IVs, medicine for blood pressure support and care for his bed sores, <mark>Thompson</mark> told CNN. Kasem has been bedridden for some time now. CNN noted that a patient could be in both critical and stable condition if his or her health is not deteriorating further. People reported, and his two daughters were already there when he suffered a sharp drop in blood pressure. His son was said to be en route. \"His health is worse. We're just not sure how bad at this point,\" a rep for the radio icon's daughter Kerri Kasem told the mag on Thursday. taken to the hospital on Sunday by his daughter, whom he had from his first marriage. Kerri Kasem was embroiled in a dramatic scene outside a Washington home where Kasem and his wife of 34 years, Jean Kasem, were staying with friends. In a bizarre turn of events, his wife hurled a package of raw hamburger meat at her stepdaughter after a dispute broke out following the radio host's removal at his daughter's discretion. \"I believe in the power of prayer. I believe in the power of intention. I believe that when a person or group of people focus on what is needed they can create a certain outcome,\" she wrote. \"Whatever it is you believe in, I ask that you take a moment and pray, or focus on sending love and healing energy to my father. He needs it right now .\" Jean Kasem and her three stepchildren--Kerri Kasem; her sister, Julie; and their brother, Mike Kasem--have been feuding over the radio host's care since last year. The family drama was highlighted last month when his children filed a missing person's report when his wife removed him from a Santa Monica facility to Washington state without the family's knowledge. judge turned the radio host's primary care back to his children Casey Kasem's daughter gets expanded power over dad's health care Edie Falco loves playing the lying, seriously flawed \"Nurse Jackie' Datebook: Boxing painters, teen idols and John Altoon's short career Vincent van Gogh ear replica made from relative's DNA goes on display Holding even-year L.A. city elections to boost turnout gets second nod\" The Fault in Our Stars' elevates sad story by cutting the sap GM fires 15 at top levels; report on ignition switches \"brutally tough' GM fires 15 at top levels; report on ignition switches\" brutally tough '", "articleID": "2014060703_00019929_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}]