[{"articleID": "2012072509_00068954_W", "names": {"Tim Cook": ["Q1404825", "Q265852", "Q7803347", "Q7803348"]}, "date": "2012-07-25", "url": "http://thebookseller.com/news/apple-ipad-sales-84-third-quarter.html", "content": "apple ipad sales up 84% in third quarter unit sales of the ipad rose 84% year-on-year in the third quarter ending 30th june 2012, to a total of 17m, apple has reported. the technology giant also sold 26m iphones, a 28% unit increase year-on-year. apple c.e.o. <mark>tim cook</mark> declared himself \"thrilled\" with the \"record\" ipad sales, and said: \"we are also really looking forward to the amazing new products we've got in the pipeline.\" the ipad sales helped apple to a quarterly revenue of $35bn ($28.6 bn in same quarter 2011) and quarterly net profit of $8.8 bn ($7.3 bn in 2011). other apple products saw a decline in sales, with macs down 2% on the year-ago quarter to four million, and ipods down 10% at 6.8 m. by posting on this website you agree to the bookseller comments policy. comments go direct to live please be relevant, brief and definitely not abusive. report any \"unsuitable comments by clicking the links\" due to persistent spam problems we are now asking users to register before submitting comments. if you have already registered or are a subscriber then please log in now. otherwise you can use the simple form below to register when you submit your comment. your comment will go live once you click the validation link in the email. comments still go live without moderation. you should use this name when logging into your account. this name will be displayed when you comment on the site."}, {"articleID": "2018121114_00191736_W", "names": {"Liz Smith": ["Q27517406", "Q291438", "Q644208", "Q6660303"]}, "date": "2018-12-11", "url": "http://www.swindonadvertiser.co.uk/news/national/17290478.children-from-deprived-areas-struggling-to-meet-literacy-and-numeracy-targets/", "content": "School pupils in a classroom 0 comments Fewer than three out of five youngsters leaving primary school in Scotland's most deprived areas achieve the expected standards in literacy. Just two-thirds of these pupils are meeting the expected level in terms of numeracy. New data on pupil achievement was published at the same time as union leaders complained about the \"growing teacher recruitment and retention crisis\" in Scotland's classrooms. Scottish Government statistics showed schools employed the full-time equivalent (FTE) of 51,138 teachers The total of 24,899 FTE primary teachers is the highest since 1980, the government said. Overall teacher numbers, including those working in early learning and childcare centres, are the largest they have been since 2010 at 51,959. As a result, the teacher workforce in 2018 is 447 higher than it was the previous year. Teacher levels are high and our schools have never been in better condition. Find out more -> https: //t.co/ZBDC6gAB0G pic.twitter.com/UpjhVhSnfa--ScotGov Education (@ ScotGovEdu) December 11, 2018 But EIS general secretary Larry Flanagan said: \"We also have a large increase in the number of pupils in our schools which means that pupil-teacher ratios remain at an absolute standstill compared to last year.\" Scotland's schools had 693,251 pupils in 2018, an increase of 4,611 from the 2017 total. The pupil-teacher ratio in schools was unchanged from 2017 at 13.6 with the average primary school class size also remaining the same at 23.5 children. Separate figures showed 70% of P7 pupils across Scotland in 2017-18 were meeting the expected standard in literacy, with 75% achieving this for numeracy. In the most deprived parts of Scotland in 2017-18, just 59% of P7 pupils met the expected standards in literacy, compared to 83% in the most affluent communities. Meanwhile, two-thirds (66%) of P7 pupils in the poorest areas achieved the expected standards for numeracy, 20 points lower than the 86% who did so in the least deprived areas. NEW: the attainment gap for literacy, numeracy, and writing grows at every stage of Primary school in Scotland. pic.twitter.com/3NWavg1GLN--Kieron Higgins (@ HigginsKieron) December 11, 2018 \"Pupils from the least deprived areas performed better than pupils from the most deprived areas at all stages,\" the report noted. While 85% of P1 children met the expected standards for numeracy, this fell to 76% for P4 pupils and 75% for those in P7. Three-quarters (75%) of P1 pupils were at the expected level in terms of literacy but this fell to 69% for P4 before increasing slightly to 70% for P7 youngsters. In S3, 95% of students from the least deprived areas met the expected standards under Curriculum for Education for literacy, compared to 81% of youngsters from the most deprived areas. The situation for numeracy was similar, with 96% of those from the least deprived areas reaching the expected standards, compared to 82% of those from the poorest areas. Some encouraging signs in the latest CfE statistics--and important to acknowledge them--but there are some big worries too, the persistence of the attainment gap being one .--<mark>Liz Smith</mark> (@ MspLiz) December 11, 2018 Education Secretary John Swinney said he was \"encouraged to see the attainment gap has also narrowed slightly\" . He said: \"There is an increased proportion of primary pupils assessed as achieving the expected levels of Curriculum for Excellence by up to four percentage points.\" This coincides with the first year of our £ 120 million Pupil Equity Fund. \"While it is too early to draw direct conclusions from this data, I am encouraged to see the attainment gap has also narrowed slightly.\" He added: \"Teacher levels are the highest this decade and the number of primary teachers is the highest since 1980.\" The average size of primary one classes has been dropping consistently in recent years, which is particularly important as helping children in the early years is crucial if we are to close the attainment gap between the most and least deprived. \"The figures also show 86.6% of school buildings were in a good or satisfactory condition in April 2018, up from 81.7% in April 2012.\" For the first time, more than 600,000 pupils are educated in schools classed as good or satisfactory condition, \"Mr Swinney said. Our investment in school facilities is benefitting more pupils than ever. https: //t.co/ZBDC6gAB0G pic.twitter.com/0Hfuq2HOpQ--ScotGov Education (@ ScotGovEdu) December 11, 2018 Tory education spokeswoman <mark>Liz Smith</mark> said:\" Notwithstanding a very welcome rise in teacher numbers, there remain some grim statistics which will make worrying reading for parents and teachers right across Scotland. \"The fact that one in three pupils is leaving primary school without reaching basic standards in literacy is the main worry.\" These literacy figures aren't just bad news for the prospects of youngsters, but bad for the future economy too. \"Labour's Iain Gray was also critical over the\" utter failure of the SNP government to tackle attainment \". He said:\" This is a consequence of 3,000 fewer teachers under the SNP and £ 400 million slashed from schools since 2010. \"SNP ministers claim that education is the top priority--these figures show that the poorest young people are being failed badly.\" While the SNP pledged children in the first three years of primary would be taught in classes of 18 students or less, Liberal Democrat education spokesman Tavish Scott said this was being achieved for just 12% of youngsters \"These figures show that the SNP Government deserves an F for the delivery of its flagship class size policies,\" said. \"It is symbolic of their failures in education. This won't be turned around so long as teachers receive a rotten deal.\" 0 comments"}, {"articleID": "2017092801_00285226_W", "names": {"Richard Adams": ["Q21207257", "Q22022410", "Q26251073", "Q28007169", "Q313289", "Q3431521", "Q56426072", "Q57177983", "Q57242376", "Q6108680", "Q7323633", "Q7323634", "Q7323635", "Q7323636", "Q7323640"]}, "date": "2017-09-28", "url": "http://www.postregister.com/articles/featured-news-daily-email/2017/09/27/fishing-good-old-times", "content": "<mark>Richard Adams</mark>, 89, casts as he floats along the Snake River near Swan Valley on Wednesday. <mark>Adams</mark> learned to fish on the river when he was four-years-old. & ldquo; I lived here all my life; my daddy before me and my grandpa before him, & rdquo; said <mark>Adams</mark> & ldquo; so we & rsquo; ve fished on this generation for three generations. & rdquo; \"> <mark>Richard Adams</mark>, 89, casts as he floats along the Snake River near Swan Valley on Wednesday. <mark>Adams</mark> learned to fish on the river when he was four-years-old.\" I lived here all my life; my daddy before me and my grandpa before him, \"said <mark>Adams</mark>\" so we've fished on this generation for three generations. \"Full text available to premium subscribers only. Please click here to read the entire story. Get today's digital edition for 99 cents. Read more about Fishing for the good old times"}, {"articleID": "2018071407_00528850_W", "names": {"Marcus Junius Brutus": ["Q11033721", "Q5996354"], "Lucius Septimius": ["Q11934160", "Q6697612"]}, "date": "2018-07-14", "url": "http://assassinscreed.wikia.com/wiki/Khaliset?diff=743249&oldid=743225", "content": "Revision as of 00:44, July 14, 2018 (view source) The Cat Master (Talk | contribs) (Undo revision 743221 by JohnAlexander23 (talk)) ← Older edit Latest revision as of 07:03, July 14, 2018 (view source) Sadelyrate (Talk | contribs) m (→ Equipment and Skills) Line 23: Line 23: = = = Equipment and Skills = = = = = = Equipment and Skills = = = − Khaliset was able to tame [[hyenas]] to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a [[bow]] as well as matters of stealth which she used to her advantage in combat during a sandstorm. <ref name = \"The Hyena\" /> + Khaliset was able to tame [[hyena]] s to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a [[bow]] as well as matters of stealth which she used to her advantage in combat during a sandstorm. <ref name = \"The Hyena\" /> = = Trivia = = = = Trivia = = Latest revision as of 07:03, July 14, 2018 \"I just want my daughter back...Please?!\" --Khaliset's final words, begging the gods for reunion with her deceased daughter Khaliset Khaliset (c. 80s BCE--48 BCE), also known as The Hyena, was a member of the Order of the Ancients during the reign of Ptolemy XIII. Contents [show] Biography Edit Khaliset served the Order by gathering silica for them in the ancient tombs of Giza, as silica had special properties and could be used to power the Isu technology the Order sought. [1] Eventually, however, she went rogue and began keeping the silica for herself, prompting Taharqa, a fellow member known as The Scarab, to write her a letter questioning her lack of contact with them. At some point, she had begun to study the ancient symbols in the Isu vault beneath Khufu's Pyramid and began to learn how to use the technology for her ultimate purpose of resurrecting her deceased daughter Eshe. [2] [3] In 48 BCE, the Medjay, Bayek, tracked Khaliset to the Great Pyramid of Giza, where he found the Isu Temple, Eshe's sarcophagus, and evidence of Khaliset's attempts to resurrect her, before Khaliset herself appeared, furious that Bayek had disturbed her daughter's \"tomb\" . He chased her through the pyramid's tunnels, eventually succeeding in killing her after a dramatic confrontation in the middle of a sandstorm outside the pyramid. [2] Personality and traits Edit Unlike most of the other members of the Order who sought power and dominance over Egypt, Khaliset was only determined to use the Order's resources to resurrect her daughter who died by unknown means. To that end, she was willing to commit many atrocities and sacrifice many innocents in deadly rituals that she believed would aid in her daughter's resurrection. She expressed remorse as she died, lamenting the fact she had been unable to protect her child in life or in death. [2] [3] Equipment and Skills Edit Khaliset was able to tame hyenas to do her bidding, and had several accompanying her wherever she went. Khaliset was also skilled with a bow as well as matters of stealth which she used to her advantage in combat during a sandstorm. [2] Trivia Edit Khaliset's place of origin and ethnicity was never mentioned in the game. Instead, they are listed in the Official Game Guide. Gallery Edit Khaliset's symbol Character model's of Khaliset Add a photo to this gallery Appearance Edit Assassin's Creed: Origins References Edit ↑ Assassin's Creed: Origins ↑ 2.0 2.1 2.2 2.3 Assassin's Creed: Origins--The Hyena ↑ 3.0 3.1 Assassin's Creed Origins: Official Game Guide Assassin's Creed: Origins Characters Hidden Ones William Miles | Bayek (Senu) • Aya • Phanos the Younger • Pasherenptah • Tahira • Phoxidas • <mark>Marcus Junius Brutus</mark> • Gaius Cassius Longinus | Kashta • Kawab • Maqwat • Osorkon • Paanchi • Shaqilat Order of the Ancients Juhani Otso Berg • Sofia Rikkin • Simon Hathaway | Actaeon • Berenike • Eudoros • Flavius Metellus • Hetepi • Julius Caesar • Khaliset • Ktesos • Livius • <mark>Lucius Septimius</mark> • Medunamun • Pothinus • Rudjek • Taharqa | Ampelius • Ptahmose • Rufio • Tacito Gladiators The Axes • The Brothers (Diovicos • Viridovix) • The Duelist • The Guardians of Siwa (Bayek • Kensa) • The Hammer • Hilarus Maximus • The Hoplite • Kosey • Polymestor • The Seleucid • The Slaver • Wamukota Mythical Beings Egyptian Deities (Anubis • Sobek • Sekhmet • Apep) • Undead Pharaohs (Akhenaten • Ramesses II • Nefertiti • Tutankhamun) • Afterlife Guardians (Faithless One • Relentless One) • Lost Army of Cambyses Others Layla Hassan • Deanna Geary | Alexander the Great | Apate • Apollodorus • Aristo of Alexandria • Benipe • Caesarion • Claridas • Cleopatra • Chenzira • Damastes • Diocles • Esiocles • Fenuku • Gennadios • Ghupa • Harkhuf • Hepzefa • Hotephres • Jeska • Khemu • Khenut • Menehet • Melitta • Phoebe • Pompey • Praxilla • Ptolemy XIII • Rabiah • Venator • Vitruvius • Zahra | Gamilat | Sutekh • Isidora • Merti • Tahemet Factions Hidden Ones (Egyptian Brotherhood) • Templars (Abstergo Industries | Sigma Team | Order of the Ancients) | Gabiniani • Medjay • Phylakes • Ptolemaic dynasty Locations Egypt (Alexandria • Bakchias • Euhemeria • Dionysias • Faiyum • Great Sphinx of Giza • Giza • Herakleion • Kanopos • Karanis • Kerkasoros • Krokodilopolis • Lake Moeris • Letopolis • Memphis • Natho • Per Ousir • Philadelphia • Pr-Hapi-n-Iwnw • Remetch Ra • Sais • Sau Village • Siwa • Soknopaiou Nesos • Udjat Apiary • Yamu • Yw Huts) • Kyrenaika (Apollonia • Cyrene • Balagrae) • Rome • Sinai (Arsinoe • Klysma Quarry) • Valley of the Kings (Set-Ma \"at • Swenett • Thebes) • Afterlife (Aaru • Aten • Heb Sed • Duat) Events Alexandrine Civil War (Siege of Alexandria • Battle of the Nile) • Assassination of Julius Caesar Terms and gameplay Achievements • Crafting • Customization • Discovery Tour • Eagle Vision • Genetic memory • Horde Mode • Leap of Faith • Animus Pulse • Memories • Outfits • Photo Mode • Pieces of Eden (Apple of Eden • Flickering Daggers • Glowing Mace • Isu Armor • Lightning's Strike • Moonlit Shield • Midnight Sun • Staff of Eden) • Skills • Treasure chests • Hunting • Viewpoints Weapons Hidden Blade • Bow • Swords • Spear • Shield DLC Ambush At Sea • The Curse of the Pharaohs • Discovery Tour • The Hidden Ones • Secrets of the First Pyramids • Trial of the Gods Retrieved from\" http: //assassinscreed.wikia.com/wiki/Khaliset? oldid=743249 \"Categories: 80s BCE births 48 BCE deaths Individuals Nubians Thieves Marksmen Order of the Ancients Languages: Polski Русский"}, {"articleID": "2019092015_00004973_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Daniel Mcmahon": ["Q41706481", "Q5218123"]}, "date": "2019-09-20", "url": "http://www.democracynow.org/2019/9/20/headlines", "content": "Students Across the World Walk Out of Classes in Global Climate Strike Sep 20, 2019 Students across the world are walking out of class today in a global climate strike. Some of the first strikes occurred in Australia, where an estimated 300,000 people took part in rallies across the country. Participants include Gina Hale, a student in Brisbane. Gina Hale: \"In school, I am learning about the effects of climate change, and I'm learning that we need to do something. Yet I'm seeing that the people in charge and the people who are running our country aren't doing anything. To me, this is confusing. So I'm here today to step up and say,\" No more .' \"In Thailand, hundreds of young people staged a die-in at the environmental ministry, demanding government action on climate change. Here in New York, the 16-year-old Swedish climate activist Greta Thunberg, who inspired the movement, will take part in a large march this afternoon. Meanwhile, workers at Amazon, Microsoft and other large firms have also pledged to take part in today's strike. On Thursday, facing pressure from his own staff, Amazon CEO Jeff Bezos vowed to make the world's largest retailer carbon-neutral by 2040 and to purchase 100,000 electric delivery vans. Two Die in Texas as Storm Dumps 40 Inches of Rain on Houston Area Sep 20, 2019 At least two people have died in Texas after Tropical Depression Imelda dumped more than 40 inches of rain on the Houston area over three days. It's being described as one of the worst freshwater floods in U.S. history. More than 1,000 people had to be rescued on Thursday from the fast-rising waters. The storm also forced Exxon to shut down its massive oil refinery in Beaumont. In some areas, the floodwaters rose higher than during Hurricane Harvey two years ago. Red Cross: 2 Million Need Humanitarian Aid Every Week Due to Climate Crisis Sep 20, 2019 The Red Cross has shed new light on the escalating climate crisis. The Red Cross says an average of 2 million people need humanitarian aid every week due to storms, droughts and floods, and the figure is expected to double in coming decades if governments fail to cut emissions. Bird Population in U.S. & Canada Dropped by Nearly 3 Billion Since 1970 Sep 20, 2019 A shocking new study has found the United States and Canada have lost nearly 3 billion birds since 1970, a 29% population drop. Researchers blamed numerous factors, including widespread habitat loss and the use of agricultural chemicals. Peter Marra of Georgetown University co-authored the report. Peter Marra:\" Birds are the quintessential ecosystem indicators. They are the canaries in the coal mine. When something's going wrong with birds, something's going wrong with the environment. It's just not healthy. And so, in this study, because we've seen so many declines across so many different types of birds, from warblers to thrushes to even house sparrows--these non-native species in urban areas are declining--that's not a good sign. That's an indication that something is really wrong with the environment. \"Benny Gantz Declares Victory, Rejects Overture from Netanyahu Sep 20, 2019 In news from the Middle East, Israel's former army chief Benny Gantz has declared victory over Israeli Prime Minister Benjamin Netanyahu after Monday's election. With 99% of the vote counted, Gantz's Blue and White party has two more parliamentary seats than Netanyahu's Likud party. Gantz has vowed to form what he called\" a broad liberal, unity government, \"and has rejected Netanyahu's call for a power-sharing agreement. Trudeau Apologizes Again as New Blackface Photos Emerge Sep 20, 2019 Canadian Prime Minister Justin Trudeau has apologized again for wearing black and brownface on a number of occasions. Over the past 48 hours, two photos and one video emerged of him wearing racist makeup as recently as 2001. The scandal is breaking just days after Trudeau launched his re-election bid ahead of next month's election. On Thursday, Trudeau said he could not rule out more photos coming to light. Prime Minister Justin Trudeau:\" The fact is, I didn't understand how hurtful this is to people who live with discrimination every single day. I have always acknowledged that I come from a place of privilege, but I now need to acknowledge that that comes with a massive blind spot. \"Canadian New Democratic leader Jagmeet Singh responded to the growing scandal. Jagmeet Singh:\" I can tell you that I am deeply troubled by what this means to Canada, that young kids are going to see not just one or two, but multiple images of the prime minister mocking their lived reality. This is so hurtful to so many Canadians. \"Funeral Held in Afghanistan After U.S. Drone Strike Killed 30 Civilians, Mostly Farmers Sep 20, 2019 In Afghanistan, funeral services were held Thursday after a U.S. drone strike killed at least 30 civilians. Many of the dead were farmers who were resting in the fields after harvesting pine nuts. At least 40 civilians were also injured in the drone strike. Local Afghan residents questioned why the U.S. would target innocent farmers. Ezatullah:\" These people had gone to the fields to work, and their wages were very low. Don't they, the Americans, see that these people are working and gathering pine nuts? Why do they attack workers? \"Kashmiris Sue Modi in U.S. Court as <mark>Trump</mark> Prepares to Appear with Indian PM at Texas Rally Sep 20, 2019 A pair of Kashmiri citizens have filed a lawsuit in the United States against Indian Prime Minister Narendra Modi for carrying out extrajudicial killings and other crimes in occupied Kashmir. The lawsuit was filed just days before Modi is scheduled to speak at a major rally called\" Howdy, Modi! \"in Houston, Texas, where he will be joined by President <mark>Trump</mark>. In other news on India, as many as 10 mass detention centers are being built in the northeast state of Assam. This comes just weeks after India stripped nearly 2 million residents of Assam of their citizenship. Report: Whistleblower Complaint Against <mark>Trump</mark> Focused on Phone Call with Ukrainian President Sep 20, 2019 More details are coming to light about a whistleblower complaint filed against President <mark>Trump</mark> by a U.S. intelligence official. The Washington Post reports the complaint centered on a conversation <mark>Trump</mark> had with the new president of Ukraine on July 25. <mark>Trump</mark>'s interaction with him reportedly included a\" promise \"that was regarded as so troubling that it prompted the unnamed official to file a complaint. The acting director of national intelligence has refused to provide the contents of the whistleblower complaint to the House Intelligence Committee despite being subpoenaed to do so. This comes as House Democrats are investigating whether <mark>Trump</mark> had urged Ukraine to reopen a probe of a Ukrainian company with ties to Joe Biden's son, Hunter. On Thursday night, <mark>Trump</mark>'s personal attorney Rudy Giuliani acknowledged on CNN that he had asked top Ukrainian officials to investigate Joe Biden. Colt to Stop Manufacturing Sporting Rifles, Including AR-15 Sep 20, 2019 The gun maker Colt has announced it is suspending the manufacturing of sporting rifles, including the AR-15, for the consumer market. Pressure has been growing on the Connecticut-based company for years, as AR-15-style guns have been used in numerous mass shootings, including Newtown, Connecticut; Orlando, Florida; and Parkland, Florida. Meanwhile, on Capitol Hill, Senate Majority Leader Mitch McConnell has said he is awaiting guidance from the White House as to what President <mark>Trump</mark> thinks he's comfortable signing regarding new gun control. Self-Described\" Antifa Hunter \"Arrested for Threatening Black Lives Matter Activist in Charlottesville Sep 20, 2019 A prominent white supremacist from Florida has been arrested for making racist and violent threats to the co-founder of Black Lives Matter in Charlottesville, Virginia, who was considering a run for Charlottesville City Council. The threats forced the activist, Don Gathers, to drop out of the race. The white supremacist, <mark>Daniel McMahon</mark>, has a long record of threatening violence against antiracists and anti-fascists. He once dubbed himself the\" antifa hunter. \"Several of his online posts were shared by the man who attacked the Tree of Life synagogue in Pittsburgh, killing 11 Jewish worshipers. Amnesty & HRW Urge Rejection of Torture Backer to Top State Dept.. Human Rights Post Sep 20, 2019 Amnesty International, Human Rights Watch and dozens of other groups are urging the U.S. Senate to reject the nomination of Marshall Billingslea for a top State Department post overseeing U.S. human rights policy. Billingslea openly supported the use of torture and harsh interrogation methods while working in the Pentagon during George W. Bush's administration. Betsy DeVos Threatens to Cut Funding to UNC & Duke for Middle East Studies Program Sep 20, 2019 The <mark>Trump</mark> administration is threatening to cut federal funding to a Middle East studies program run jointly by Duke University and the University of North Carolina at Chapel Hill. The U.S. Education Department recently wrote to the schools claiming its classes are unfairly promoting\" the positive aspects of Islam \"but not Christianity or Judaism. Education Secretary Betsy DeVos ordered a probe into the Middle East studies department after North Carolina Republican Congressmember George Holding accused the program of having a\" severe anti-Israeli bias and anti-Semitic rhetoric. \"Academic freedom advocates have criticized the <mark>Trump</mark> administration's actions. U.S. Expels Two Cuban Diplomats; Cuban Fuel Shortage Continues Sep 20, 2019 The United States has expelled two Cuban diplomats and placed tighter restrictions on everyone working at Cuba's United Nations mission. The State Department accused the diplomats of conducting\" activities harmful to U.S. national security, \"but provided no details on what they did. Cuban Foreign Minister Bruno Rodríguez said the move was\" categorically unjustified. \"Meanwhile, a severe fuel shortage in Cuba has entered its second week. The Cuban government says the crisis is a result of U.S. sanctions against Cuba and Venezuela. Former Tunisian Dictator Zine El Abidine Ben Ali Dies Sep 20, 2019 Former Tunisian dictator Zine El Abidine Ben Ali has died at the age of 83. He ruled Tunisia for 23 years before being ousted in 2011 during the protests that sparked the Arab Spring. New York Mayor Bill de Blasio Drops Out of 2020 Race Sep 20, 2019 New York Mayor Bill de Blasio has dropped out of the 2020 presidential race. De Blasio had campaigned to fight for working families, combat climate change and take on <mark>Donald Trump</mark>, but his campaign never gained steam. The original content of this program is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License. Please attribute legal copies of this work to democracynow.org. Some of the work (s) that this program incorporates, however, may be separately licensed. For further information or additional permissions, contact us. Daily News Digest"}, {"articleID": "2018012617_00854720_W", "names": {"James Rodriguez": ["Q368441", "Q37946987"]}, "date": "2018-01-26", "url": "http://www.espn.in/football/real-madrid/story/3360556/zinedine-zidanes-real-madrid-future-set-to-be-decided-at-end-of-season", "content": "Zinedine Zidane's Real Madrid future set to be decided at end of season play WATCH: If the transfer window was breakfast (2:31) While Premier League clubs wheel and deal, the guys at Exploding Heads imagine if the transfer window was breakfast. (2:31) comment Under-pressure Real Madrid coach Zinedine Zidane has said any changes at the club will come in the summer. Zidane, whose side are 19 points behind La Liga leaders Barcelona and have crashed out of the Copa del Rey, said he and his players were fully focused on improving their situation. On Wednesday, Madrid's campaign hit a new low with their Copa exit to Leganes, after which Zidane admitted his job was on the line over the next few weeks. The situation has brought speculation that Madrid president Florentino Perez may feel forced into a change before the team take on Paris Saint-Germain in the Champions League. But Zidane told a news conference: \"I talk all the time with the president, but I am continuing with the same motivation as ever.\" Tomorrow, we have a game to win three points [at Valencia]. Then we will see at the end [of the season] what will happen, whether things need to change, but not now. \"I feel the support of the club, the president, the squad, and we will keep going to turn things around.\" Zidane said he realised the success he enjoyed during his first two years in the job was now irrelevant and added: \"If I thought I could not [turn things around], I would leave tomorrow.\" In football, there are good and bad moments. I feel strong and able to resolve this. \"What I have won before...this is about today, I do not think about [the past]. I was very disappointed with the game the other day, I did not expect that. But that is part of football, we must accept it.\" Nobody can take from me the motivation to keep going, working, until the last day. \"Denis Doyle/Getty Images Zidane said that although the slump in form\" is not a typical situation for Madrid, \"it had happened before.\" It is not always nice moments all year, \"he added.\" We want to keep working hard and this will improve. We have played good games, we must do that more consistently. \"I am speaking of this for weeks now, that is true, but I am convinced we will turn it around and the players are convinced too, which is the most important.\" Asked whether he had regrets over last summer's transfer business, when experienced players such as Alvaro Morata, <mark>James Rodriguez</mark> and Pepe left, Zidane said he had faith in his youngsters. \"I would not change anything now,\" he added. \"This squad is what I have. I was happy with the squad before the season started. It is a younger squad, with future, which has to learn. But I am with them completely.\" Zidane confirmed that Cristiano Ronaldo was available for Saturday's game despite a facial injury suffered while scoring his second goal in last weekend's 7-1 win over Deportivo La Coruna. \"We are ready to play a great game, and we will do that,\" he said. \"We know it is a difficult ground to visit, a very good team who have had a good season until now.\" But we like to play against the best teams, and we will play a good game tomorrow. \"The only thing that counts in football is to win. The only thing that will bring calm here is to win games, and we are all here to do that.\" "}, {"articleID": "2010021405_00026102_W", "names": {"Patrick Casey": ["Q19877723", "Q7146214", "Q7146216"], "John Law": ["Q16731294", "Q16866581", "Q16866744", "Q29643115", "Q6244134", "Q6244136", "Q6244142", "Q6244146", "Q645685"]}, "date": "2010-02-14", "url": "http://theintelligencer.net/page/content.detail/id/534399.html", "content": "wheeling - officials with northwood health systems now have the option to file their lawsuit against gov. joe manchin for alleged political retaliation because the required 30-day notice has passed. northwood chairman of the board <mark>patrick casey</mark>, however, said the company would like to resolve the matter without going to trial in federal court. manchin's general counsel, jonathan deem, said the governor also wants to reach an agreement with northwood outside of court. northwood continues operating on its original license - it expired sept. 30 - because the office of health facility licensure and certification, a division of the west virginia department of health and human resources, has declined to renew the company's license. \"we will wait (to file the lawsuit), as long as we are making progress,\" <mark>casey</mark> said of the company's ongoing negotiations with state officials to acquire a new license. \"it is a long process and there are many issues to work through. but i am cautiously optimistic.\" <mark>casey</mark>, however, added, \"we are fully prepared to proceed with the suit\" when discussing northwood's options in the event the negotiations do not yield the company a new operating license. deem said manchin \"is hopeful that northwood reconsiders filing a lawsuit.\" \"the lawsuit is frivolous and would not advance the interests of northwood or its patients ....northwood has options outside of spurious litigation to address the health and safety issues that led to the loss of its provider's license,\" he said. northwood - an organization with about 450 employees serving more than 3,000 mental health patients in ohio, marshall and wetzel counties - in january filed its intention to sue manchin in wheeling's u.s. district court for the northern district of west virginia. the company alleges in its complaint that ohflac targeted the company because northwood supported a bill manchin opposed during the regular 2009 legislative session. ohflac found only five total violations at the 27 northwood facilities in all of 2007 and 2008, combined, but cited northwood for 175 deficiencies from february to november 2009. <mark>casey</mark> cites this increase as evidence manchin wants to shut down the company. northwood acknowledges ohflac's findings that three patients died in the company's care during a two month period last year. <mark>casey</mark>, however, believes those patients died from natural causes. manchin has flatly denied any involvement in the proceedings regarding northwood's license renewal. \"this is an absolutely irresponsible action by northwood and its attorneys. northwood should focus on what is truly important: the health, safety and welfare of its patients. their allegations against me are completely false and this lawsuit is an obvious attempt to divert attention from the serious health and safety concerns identified at some of northwood's facilities,\" the governor said in a statement. <mark>casey</mark>, however, believes the company's claims have merit. \"as a lawyer, i would never sign a document without believing i could support it,\" he said. northwood alleges manchin targeted them for supporting west virginia senate bill 672 - which would have provided more money for behavioral health care - during the 2009 legislative session. though the bill passed unanimously in both the senate and house of delegates, manchin vetoed the legislation. manchin, however, disputes such notions. \"northwood's suggestion that i would abuse government services to settle a political score is irresponsible,\" he said. while northwood continues negotiating with state officials to gain a new license, the company continues to operate. if ohflac does not renew northwood's license, the company's 3,000 mental health patients and 450 employees will need somewhere to go. \"if any center like northwood shuts down, the dhhr is responsible for working with the center on finding placement for their clients,\" dhhr spokesman <mark>john law</mark> said. <mark>law</mark>, however, declined to say if he believed the state could find placements for all of the clients, citing the fact that the matter is \"in litigation.\" <mark>casey</mark> hopes ohflac will grant the company a new license. \"it would be devastating for the northern panhandle,\" <mark>casey</mark> said of a possible northwood shutdown in the event the company cannot acquire a new license. west virginia delegate orphy klempa, d-ohio, said that he and other northern panhandle legislators \"have spoken to the governor about northwood.\" \"it is a huge concern for us, not only because of the service that northwood provides, but because of the 450 people who work there,\" klempa said. \"we need to hold onto all of these jobs.\" regarding how he believed the negotiations with state officials would go, <mark>casey</mark> said, \"i will have a better feel for it in two weeks.\" according to its \"prayer for relief\" in the court complaint, northwood wants to have its licenses fully restored; to ensure that \"retaliatory behavior by government officials\" stops; and to ensure that northwood is held to the same standards as those of similar health care providers. the intelligencer / wheeling news-register 1500 main st. | wheeling, wv 26003"}, {"articleID": "2017063015_00214817_W", "names": {"Martin Fowler": ["Q58417927", "Q6775467", "Q74894"], "Billy Mitchell": ["Q16732684", "Q18001525", "Q466532", "Q530431"]}, "date": "2017-06-30", "url": "http://eastenders.wikia.com/wiki/29_May_2017?diff=71796&oldid=0", "content": "Revision as of 14:13, June 30, 2017 (view source) Sonalsall (wall | contribs) (Created page with \"{{eastenders edit box information for episodes | title1 = 29 May 2017 | image1 = 29. jpg | caption1 = Whitney on the train, leaving Walford | air_date: = 29 May 2017 | writer = Gillian R.. .\" ) Newer edit → Revision as of 14:13, June 30, 2017 29 May 2017 Whitney on the train, leaving Walford Air Date: 29 May 2017 Writer Gillian Richmond Director John Dower \"Two residents are forced to face the reality of their actions. Denise gets a welcome surprise\" . Plot Synopsis In the opening scene Whitney is in the Carter Kitchen, Mick enters and they talk about the previous series of events and agree that it was a mistake, Shirley interrupts them and tells Mick to go downstairs to take care of a vending machine rep. Johnny walks into the kitchen hungover and looking for food. Shirley looks at troubled Whitney. In the next scene, Denise is walking through the market on the phone with her sister Kim, who is worried about how Denise fainted. Kim is in the cafe and offers to get coffee with Denise, she rejects the offer and tells Kim she is staying home preparing for Patrick's return. Once Kim gets off the phone with her sister she and Sharon talk about the community centre, Cathy has the information but Kim looks disappointed with their work. Johnny and Whitney are sitting in the cafe and Johnny confesses to Whitney that he is worried about his father and asks Whitney if he has said anything to her. She looks worried but tells him Mick hasn't said anything. Meanwhile, in the market Denise bumps into Honey who then asks her how she is after she fainted, Denise tells honey she is alright and it was \"just stress from the exam\" , Honey tells her to look after herself. Denise catches up on local gossip, honey gets a call from Jack and rushes off. Stacey, <mark>Martin</mark> and baby Arthur walk through the market, Stacey asks Denise how she is, annoyed Denise then says that she wishes her sister would not spread the news about her all over the square. Denise then leaves and <mark>Billy</mark> talks to Stacey and <mark>Martin</mark>. The new couple in Walford walk through the market admiring the <mark>Fowler</mark> family, Kim attempts to get as many signatures as she can to save the community centre, she then approaches the new couple. Steven comes out of the house looking worried as <mark>Martin</mark> and Stacey make a remark regarding Lauren and her relationship with her boss. Denise's tutor comes to visit her and manages to convince her to leave the house and go for a walk as she has been couped up in the house studying for the exam she took the previous week. Back in the cafe Whitney and Johnny are still talking, Johnny is concerned for Whitney and ensures her that if anything is worrying her then she can talk to him, he then leaves. In the Park, Honey is looking after the kids when she gets a call from her husband, <mark>Billy</mark>, they both share concern over their son as he is having a hard time. She then ends the call, Charlie is hiding in the trees in the park, watching honey and the children, including his son, Mathew. Shirley is concerned for Mick and wants to know why he is acting so sketchy, she tells him to tell her whatever he is hiding, she ensures him that she will not judge as she is his mother. Mick then confesses to her that he and Whitney kissed, he tells her he is not a good man and walks out. Back in the cafe, Cathy asks Whitney if she is okay, Whitney tells her that Bianca, Morgan and Tiffany are having a hard time. Cathy reminds her that they are her family so she should go see them. Abi comes into the cafe and sees Steven, Abi is looking after Louis because Lauren is working. Abi tries to stir up trouble between Steven and Lauren. Steven asks if Abi is jealous of Lauren and she walks away. As she walks towards the door Cathy asks her about her birthday plans, Steven watches as they talk. After Abi leaves Steven looks at his laptop and searches \"Track your partner\" , he then opens a website and takes out his phone. Back in the Queen Vic Shirley is keeping a close eye on Mick and Whitney, Patrick returns and Mick tells him he is sorry about Denise, however, Patrick doesn't know what Mick is talking about. While in the park, Denise and Jorgen talk, Denise then tells him that she thinks she failed the exam, Jorgen tries to boost her confidence and buys her ice cream. As Honey is walking back to the square with all of the kids Charlie approaches them, she then takes him aside and tells him that Jack is the best father that the kids could ever have, she then walks away and takes the kids to get sweets. Back at the Pub Shirley warns Whitney to stay away from Mick and to leave, Whitney tells her that Shirley is the mother Mick never knew and that questions her about what kind of mother she is as she forged her son's signature and sold half of the pub. Shirley then tells her to pack her bags and leave. Meanwhile, downstairs, Mick begins to Wallow again. Back in the park, Denise and Jorgen continue to talk about the exam, she tells him that she has to go and prepare for Patrick's arrival, she says she would have like to cook him a meal but she forgot her purse at home. Jorgen offers to lend her 20 quid, she first refuses and then asks for a tenner. The scene then jumps back to Mick wallowing, Whitney is then shown upstairs pulling out a suitcase from under her bed and walking over to her cupboard. Honey is outside Jacks house, they are talking, she tells him that the kids had a nice time at the park. Charlie is watching from behind a tree. Outside Sharon's house, Michelle returns home after work, Sharon gives Michelle a package that was left for her. Honey then tells Jack that Charlie approached her and the kids, they talk and then she walks away. Charlie comes out from behind the tree and tells Jack that he has informed social services that he intends to apply for residence. Denise returns home to see Patrick waiting, she begins to worry as she got his time of arrival confused. Denise panics and starts preparing dinner, she begins to cry but blames it on the onions. Patrick is worried about her and she begins to tell him how bad it has been. Back at the pub, Mick is upstairs trying to talk to Whitney through the door of her room, he apologises to her and asks if she can hear him. When he gets no response he enters to see an empty room with an empty cupboard. The scene then cuts to Whitney on the train and the episode ends. Appearances Edit Whitney Carter Mick Carter Shirley Carter Johnny Carter Denise Fox Kimberly Fox-Hubbard Sharon Mitchell Cathy Beale Honey <mark>Mitchell</mark> Stacey <mark>Fowler</mark> <mark>Martin Fowler</mark> <mark>Billy Mitchell</mark> Ted Murray Joyce Murray Steven Beale Jorgen Christensen Ricky <mark>Mitchell</mark> Amy <mark>Mitchell</mark> Abi Branning Michelle <mark>Fowler</mark> Charlie Cotton Patrick Trueman Retrieved from \"http: //eastenders.wikia.com/wiki/May_29, _2017? oldid=71796\" Ad blocker interference detected! Wikia is a free-to-use site that makes money from advertising. We have a modified experience for viewers using ad blockers Wikia is not accessible if you've made further modifications. Remove the custom ad blocker rule (s) and the page will load as expected."}, {"articleID": "2010011511_00079319_W", "names": {"Dr. John": ["Q511074", "Q54593093"]}, "date": "2010-01-15", "url": "http://kappahi.wordpress.com/2009/12/05/183/", "content": "hawaii fishing news aii fishing news is the official state record-keeper of the biggest fish caught in the state-regardless of the method of capture. to take a look at some of the enormous and unique fish taken from our state waters, click on \"state records.\" marketing tools for industry publishing custom magazines, media programs and other publicity pieces builds trends and creates new markets. learn more. cutting edge hawaii film project gb hajim's animated feature film strange frame: love & sax. watch the trailers about the making of the film! log in to leave a comment tags: hawaii tuna size limits saltwater fishing license tuna size limits and bring your saltwate...tuna size limits and bring your saltwater fishing license it smelled like a vicious fish rumor. word on the docks was that the division of aquatic resources (dar) at its oahu public meeting, \"statewide public meetings size limits and other regulations for marine species,\" tossed an explosive bobber into the crowd. was dar really trying to bait a 45 pound size limit on yellowfin and bigeye tuna? nosing around, it's clear that size limits will be landed. that's not all. in 2010 national mandatory saltwater sportfishing reporting will begin. put your fingers to block your nostrils. this is the water on ice in creating the briny hawaii saltwater fishing license. hfn contacted the tuna tagging project's david itano, research associate at uh school of ocean and earth science and technology. itano confirmed the dar tuna limit talk: \"i attended a dar meeting last friday night on catch limits and bag limits. concentrating on weke, uhu and papio/ulua species. however, they did raise the ahi question.... basically there seems to be interest in raising the minimum size from many sectors but to what and how is the question.\" tuna size limits for hawaii is loudly controversial and as wanted as a poorly maintained 130 penn screaming with a tight drag ready to freeze up on a gorilla ahi. pounding against limits are kau kau sport fishermen and the near shore commercial guys. even with threats of maiming and misfortune neither throw back 45 pound tuna. traditionally, local fishermen are the apex predators for ahi. local politicians understand the food chain and until now dare not separate sashimi from chop sticks. this time it's different. enter the feds and they eat fish with fork and knives. noaa, the department of commerce agency charged with fish management, is changing the local fish politics playing field. noaa's marine recreational information program (mrip) is \"being phased in to.... provide a reliable, transparent, collaborative set of tools that managers, anglers and others can use to ensure sustainable fisheries and healthy oceans for generations to come.\" mrip is an expanded national marine creel survey. creel survey? you remember those awkward questions at the wash down ramps. lest we forget the lolo malihini telephone interviews from new hampshire about what's a \"marhee marhee?\" noaa realizes the dilemma of bureaucrats with fighting chairs behind desks. it wants better fishy field samples answers. who fishes? what's being caught? how many fish are caught? where and when are people fishing? it's fish catch data collection 101. mrips will \"fill survey data gaps, bias, consistency, accuracy, and timeliness.\" how prey tell? enter the national saltwater angler registry, \"providing a much more efficient and effective route for collecting data.\" all ocean states must register. but states that have a salt water fishing licensing program can be exempted. states without saltwater fishing licenses include connecticut, new hampshire, new jersey, new york, maine, massachusetts, rhode island, the western pacific, caribbean territories and hawaii. acceptable licensing or data collection programs get a memorandum of agreement with noaa. the memorandum allows states to share angler information required by the noaa's mrip registry. registry of what? noaa says that the national saltwater angler registry \"will be a\" phone book' of sport fishermen. \"beginning in 2010, people who live in states without such a program will have to sign up with the registry each year, and\" perhaps \"pay a fee. and\" perhaps \"postage stamps will go down in price? hawaii commercial fishermen already are exempted. they pay a mrip's qualifying license fee of $50 dollars to dar. hawaii commercial fishers face newly implemented stiff fines if they do not report fish catches monthly within 2 weeks of the month's end. having a hawaii commercial license signs you up to give up all rights against illegal search and seizure. by law a fee of $25 dollars can be charged by noaa for hawaii sport fishermen to register in the\" phone book. \"noaa doesn't want to get in the saltwater fishing license business. the state of hawaii has repeatedly proposed a fishing license only to be shot down by local politicians. this time for saltwater fishing licenses it's different. the state\" wen broke \"and local politicians can say:\" the feds made me do it. \"the only question left is where do i sign up? how about the question of whether fish size limits matter? we contacted <mark>dr.</mark> randy kochevar, science communications, at stanford's hopkins marine station. <mark>dr.</mark> kochevar, who is helping coordinate hibt's\" great marlin race, \"wrote hfn:\" i found.... some references you might find pertinent and useful to this topic. here you go: \"a j. bohnsack published in 2000, an article entitled\" a comparison of the short-term impacts of no-take marine reserves and minimum size limits. \"here's an exerpt:\" despite higher natural mortality for younger age classes, fishing mortality on juveniles can be particularly harmful to a fish population since the fish have not yet reproduced. this effect is compounded when quotas are based on weight since a larger number of fish are taken. \"similar size limit findings are found in the 2006\" bulletin of marine science \"article\" evolutionary regime shifts in age and size at maturation of exploited fish stocks. proceedings of the royal society b 273: 1873-1880. \"it was written by authors am de roos, ds boukal and l persson. <mark>dr.</mark> kochevar says of that article:\" there is ample evidence that fisheries management can affect the genetic composition, life history characteristics, and general biology of a population. these changes can quickly become irreversible (de roos et al. 2006). \"kochevar further writes that\" multiple studies suggest that minimum sizes in fisheries should be set at the age of maturation (smith and abramson 1990, purves et al. 2003, foster and vincent 2005). increased mortality of juveniles has been shown to select for later maturation and decreased reproductive potential (reznick et al. 1990, gardmark and dieckmann 2006). \"so there is a case for fish management size limits. will noaa implement them? noaa says that mrips\" will give saltwater anglers better representation in the policy-making process. \"looking to what has happened on the atlantic coast we see that the policy making process likes limits, permits and reports. according to the noaa office of sustainable fisheries, the recreational minimum size limit for atlantic bluefin, bigeye and yellowfin is 27 inches. size limits beget bag limits:\" regardless of the length of the trip, no more than 3 yellowfin tuna per person may be possessed on board a vessel. \"what about reporting? besides the fish license mandated reporting, for the atlantic there's recreational hotline reporting:\" within 24 hours of landing (killing and bringing to shore) any bluefin tuna, blue marlin, white marlin, swordfish, or sailfish that were caught in federal waters, recreational vessel owners must report the landing to noaa fisheries. call 1-800-894-5528. \"don't forget the highly migratory species permit.\" recreational vessel owners fishing for atlantic hms must hold a valid atlantic hms angling category permit for their vessel. \"how do you get a permit? just call the atlantic tunas information line at (888) 872-8862 or visit. all hawaii tunas, sharks, marlin, mahi mahi, ono, spearfish, sailfish are highly migratory species. in the atlantic skipjack tuna are not limited or permitted. mahi and ono will likely not be restricted in hawaii. it is only a matter of time before marlin and bigeye are restricted and likely yellowfin to follow. are you catching more or less aku? ask yourself if aku will ever have a size limit, bag limit or permit? don't have an aku answer? purse seine one up. one caveat for noaa is that hawaii's sportfishing tuna are easy to target and easier to manage than the world's biggest tuna catchers, the purse seiners. in 2007 224,000 tons of bigeye were caught, mostly by purse, in the pacific. hfn contacted <mark>dr. john</mark> hampton a tuna expert with the spc tuna program located in noumea, new caledonia. hampton and his agency are keepers of all commercial tuna data for the western and central pacific. he explained why purse seiner size limits won't work:\" a strict minimum size limit on bigeye (or other tunas) is unlikely to work because of the difficulty in separating the small bigeye from skipjack of the same size caught by purse seine (which is the main source of small bigeye tuna catch in the western and central pacific). even if they could be separated, it would be impossible to return them to the water alive after being caught by purse seine. thus far, there have been efforts to reduce the catch of juvenile bigeye by other means, such as reducing the reliance of the purse seine fishery on fads (which is how most of the bigeye is caught). there may also be other operational measures that could be effective. \"limits, permits and reports are nothing compared to tuna fishery closures brought on by purse seine over harvesting. tuna fishing in the eastern pacific, all nations on the entire pacific coast of latin america, will be banned for 59 days in 2009, 62 days in 2010 and 73 days in 2011. the closure is a directive of the inter-american tropical tuna commission (iattc). iattc is made up of 10 latin american nations and the united states, japan, spain, south korea, france and vanuatu. the united states means noaa. the eastern pacific tuna ban is\" to avoid the catastrophic collapse of valuable stocks of yellowfin (thunnus albacares), bigeye (thunnus obesus) and skipjack (katsuwonus pelamis) tuna. \"calls are already out for drastic measures for central and western pacific tuna including closures. noaa will license hawaii fishermen to collect the data to enforce the policy restrictions that follow worldwide collapsing tuna schools. what will the tuna size limit be in hawaii. david itano sheds some light:\" you probably know that dar has taken on l50 as their mantra in managing coral reef and bottomfish species and even have a big poster listing the l50 sizes of weke, omilu, paka, etc. \"what is l50? l50 is the measure, usually in terms of length in centimeters, at which half of the the estimated fish population sampled are sexually mature. the state is assuming that the l50 for tuna is 45 pounds. according to experts, l50 has some fish management problems like sexually maturity varies between males and females. l50 also varies from one one bio-region to another. yellowfin tuna have a different l50 when compared to eastern pacific, atlantic or australian yellowfin. itano relates this can be from different migration paths, local productivity and feed. in sum itano says:\" due to the population dynamics of tuna, l50 has never been used as a minimum size guideline for tuna species.... \"ahi will be likely regulated like atlantic tuna are. an example is the international commission for the conservation of atlantic tunas that states:\" contracting parties and co-operating non-contracting parties, entities or fishing entities (cpcs) shall take the necessary measures to prohibit the catch, the retaining on board, landing and/or transshipment of any bluefin tuna (thunnus thynnus) weighing less than 10 kg in the mediterranean sea. \"this is 22 pounds in the mediterranean and 14 pounds in east atlantic and european waters. since noaa, not dar, rules pelagics and therefore tuna conservation in hawaii, they will mimic the atlantic regulations. the hawaii tuna size limit will be at 27 inches. this is an ahi weighing 14.7 pounds. this in from kona's joe dettling...tuna researcher and commercial fisherman.... j next post/next comment k previous post/previous comment"}, {"articleID": "2009080818_00028646_W", "names": {"Alexander Graham": ["Q27837152", "Q39072712", "Q43912899"]}, "date": "2009-08-08", "url": "http://redrabbitslife.wordpress.com/2009/08/08/i-heart-tommy-douglas/", "content": "red rabbit's life international health, life in the boonies, family doc stuff...musings of a resident in rural canada | 2009 august 8 i * heart * tommy douglas tommy douglas is widely hailed as the founder of public health in canada. premier of saskatchewan for more than 20 years, he was voted \"greatest canadian\" of all time by the canadian tv-viewing public, beating out <mark>alexander graham</mark> bell (inventor of the telephone), banting and best (discoverers of insulin), and of course jim carrey (vaccine-fearing nutjob and actor). canadian physicians were initially unimpressed and downright mistrustful of the overarching changes douglas proposed, and indeed, in his own province launched a campaign of misinformation and scare tactics to discredit the proposed programme. tommy douglas was surely no paragon, being a bible-thumping nazi sympathiser. but he did help bring about something of which the vast majority of canadians and canadian physicians are exceedingly proud. we are a nation which believes that a child getting appendicitis should not mean a family becoming homeless. we are a nation which believes that hospitals trump highways (and it shows). we value this about ourselves and about our country. obama is facing a massive amount of criticism from the right wing for trying to introduce universal medical insurance. the canadian example isn't the only way: the dutch are universally covered, as are the british, the australians, the french.... no system is perfect. but i like ours. to mr. obama: keep pushing. history will remember you well. \"no dress rehearsal, this is our life.\" sidney crosby is celebrating his 22nd birthday by bringing the stanley cup home to nova scotia. 2009 august 8 theoren fleury will attempt a comeback to the nhl, tsn reported on its website friday. 2009 august 7 immigration and wide-ranging entertainment choices are to blame for a waning interest in professional hockey by canadian teens, suggests research done in alberta. jeremy roenick officially ended a 20-year nhl playing career thursday, announcing his retirement in san jose. rabbit philosophy the only possible reason to turn 30 is so that you can do the things you weren't allowed to do when you were 8 \"when you hear hoofbeats, you really will need to think my human is making a cat toy with cat nip and it is not for me! it smells so good...i keep trying...my human is sitting in my chair and i want it back. ..."}]