[{"articleID": "2018062816_00312810_W", "names": {"Liam Bradley": ["Q6539495", "Q6539496"]}, "date": "2018-06-28", "url": "http://www.shropshirestar.com/news/uk-news/2018/06/28/british-second-world-war-pilots-family-visit-scene-of-spitfire-crash-in-ireland/", "content": "British Second World War pilot's family visit scene of Spitfire crash in Ireland UK News | Published: Less than an hour ago The Spitfire crashed because of massive engine failure during a flight across Northern Ireland on September 20 1942. Subscribe to our daily newsletter Sign UpSarah Tysoe with her son George Tysoe, right, and aviation historian Jonny McNee The family of a British war pilot have visited the spot where a Spitfire aircraft crash-landed in a field in Ireland. Second World War pilot Lieutenant Gordon Hayter Proctor bailed out of the plane moments before it plummeted into the field in Co Monaghan. The Spitfire crashed because of massive engine failure during a flight across Northern Ireland on September 20 1942. The pilot's niece Sarah Tysoe travelled from England on Thursday after local archaeologists uncovered parts of the Spitfire last year which remained buried in the field since WWII. The aircraft's engine are among some of the parts exhibited at Monaghan County Museum. This summer, Monaghan County Museum hosts a fascinating new exhibition: The Monaghan Spitfire--Life on the Border with a World at War. Opening on 28th June 2018 and includes a real Spitfire and an anticraft gun outside Monaghan County Museum #MyMonaghan pic.twitter.com/eNNn31roqs <mark>Liam Bradley</mark>, the museum creator, and aviation historian Jonny McNee were instrumental in locating and recovering parts of the RAF Spitfire. Mr <mark>Bradley</mark> said: \"The Spitfire suffered massive engine failure and the pilot bailed out. Advertising\" As the engine is so front heavy it flew on for a few minutes but once it lost power it dipped down almost at an 80-degree angle at 400 miles an hour. \"Most of the plane disintegrated on impact but the engine was buried some three metres below the surface. The pilot parachuted out and landed a few miles across the border in Co Tyrone. Mr McNee said:\" The Spitfire crash is part of the local history. Advertising \"Everybody heard about it, lots of people went to the area and stole a bit of the plane before the Irish Army arrived. Sarah Tysoe views the crank shaft of the Spitfire plane (Brian Lawless/PA)\" Proctor was flying with a meteorological flight that were based at RAF Aldergrove (Belfast). He would go up and take the temperature, humidity and air pressure. \"He did that two or three times a day and feed information back to the base.\" The first thing he did when he landed was bury his parachute as he didn't know if he was in the North or South. \"The locals approached him, politely, with pitchforks. But they welcomed him and he had a bath and a meal and was able to ring his base.\" Some hours later he was back flying. He was an exceptional pilot. \"However, the pilot went missing in Burma in October 1944 and was never found. Ms Tysoe described the visit as\" surreal \".\" It's amazing to actually see the spot, it's indescribable, \"she said. Sarah Tysoe is shown the site were the plane came down by Josie McCusker, who witnessed the crash first-hand as a schoolgirl (Brian Lawless/PA)\" I've only known about this since February as when I watched Dunkirk I decided to search his name. So it was by pure chance that I came across all the articles. \"I got in touch with the museum and it's been an amazing story for the whole family.\" It's lovely for us to have him remembered in Ireland rather than his name on a memorial stone in Singapore. \"I had all the documentation from when he died and a few of his personal items but that's all I knew.\" This has filled in many of the gaps of his life. \"Josie McCusker, who witnessed the crash as a five-year-old girl, said:\" The noise was like thunder, it was very close to my house. \"The whole family rushed out to see what happened, it was very exciting.\" There were so many people who came to the field from near and far and loads of soldiers were about too. \"A life-size Spitfire, similar to the one that crashed some 15 miles outside Monaghan, went on display in the town on Thursday."}, {"articleID": "2013012522_00047797_W", "names": {"William Hill": ["Q16209612", "Q18719475", "Q22667358", "Q39070895", "Q8009538", "Q8012338"]}, "date": "2013-01-25", "url": "http://us.rd.yahoo.com/sports/rss/nfl/SIG=12kod2hjl/*http%3A//sports.yahoo.com/news/vegas-likes-49ers-qb-kaepernick-220005752--nfl.html", "content": "bettors are putting a lot of money on san francisco 49ers quarterback colin kaepernick in super bowl xlvii. in fact, it's a good bet that kaepernick could wind up as the player with with the most money wagered on him in prop bets in super bowl history, according to an espn.com report. jimmy vaccaro of <mark>william hill</mark> said the money is pouring in on kaepernick, who took over as the starter in november and helped lead the 49ers to a super bowl matchup on feb. 3 against the baltimore ravens. part of kaepernick's popularity in las vegas has to do with his tie to the state as a former university of nevada standout. \"we put 10 props on him last week and generated more than $100,000 in bets,\" vaccaro told espn. \"to put that in perspective, a good prop is when you can draw $2,500 to $5,000 in bets.\" prop bets on kaepernick so far include whether he will have 100 yards rushing and 300 yards passing, and if he'll throw a touchdown pass or an interception first. vaccaro said kaepernick could surpass quarterback peyton manning with the amount of money wagered on a player since prop bets began in super bowl xx. baltimore ravens vs san francisco 49ers odds: super bowl betting preview, pick super bowl 2013 odds: 49ers open as 5-point favorites over ravens"}, {"articleID": "2020041201_00090997_W", "names": {"Ron Howard": ["Q103646", "Q19874445", "Q3940969", "Q4883"], "Ed Harris": ["Q104791", "Q16729663"], "Bill Paxton": ["Q110374", "Q42426634"], "Kevin Bacon": ["Q23823432", "Q3454165", "Q6395762", "Q6395763", "Q6395764"]}, "date": "2020-04-12", "url": "http://www.times-series.co.uk/news/national/18374841.hollywood-problem-apollo-13-movie-quotes-fiction-not-fact/", "content": "News National News Hollywood, we have a problem! Some Apollo 13 movie quotes were fiction not fact By Press Association 2020 Apollo 13 Anniversary Quotes 0 comment Apollo 13 ′ s best known quotes originated not in space or Mission Control, but in Hollywood. Their moon-bound spacecraft wrecked by an oxygen tank explosion on April 13 1970, the astronauts urgently radioed: \"Houston, we've had a problem here.\" Screenwriters for the 1995 film Apollo 13 wanted to improve it. Thus was born: \"Houston, we have a problem.\" Even more artistic license was taken with Nasa flight director Gene Kranz's mobilising speech to his team in Houston. Mr Kranz never declared: \"Failure is not an option.\" Asked what he actually told flight controllers, Mr Kranz rattled it off without a moment's hesitation a half-century later. \"I have never lost an American in space, sure as hell aren't going to lose one now.\" This crew is coming home. You got to believe it. \"Your team must believe it. And we must make it happen.\" Fred Haise, Jack Swigert and Jim Lovell gather for a photo on the day before launch (Nasa/AP) Mr Kranz said the filmmakers came up with: \"Failure is not an option.\" He does not regret not saying it, saying: \"No--I'm satisfied with what I said.\" Mr Kranz constantly finds himself setting the record straight, \"in fact, every time I speak\" . \"I try not to plagiarise,\" he said with a laugh. He did borrow the phrase for the title of his 2000 autobiography. Jim Lovell is winched from the sea after the successful splashdown (AP) Director <mark>Ron Howard</mark>'s film starring <mark>Ed Harris</mark> as Mr Kranz and Tom Hanks as mission commander Jim Lovell was based on Lovell's 1994 autobiography, Lost Moon. Actors <mark>Bill Paxton</mark> and <mark>Kevin Bacon</mark> portrayed Apollo 13 astronauts Fred Haise and Jack Swigert. 0 comment"}, {"articleID": "2009112012_00181223_W", "names": {"Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Ben Nelson": ["Q4886211", "Q4886212", "Q4886215", "Q58257672", "Q718542"], "Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2009-11-20", "url": "http://dnaindia.com/world/report_us-senate-nears-first-healthcare-vote_1314162", "content": "senate democratic leader <mark>harry reid</mark>'s 2,074-page blueprint for overhauling the $2.5 trillion healthcare system sparked what promises to be a long and bitter debate over president barack obama's top domestic priority. the senate will vote on saturday night on whether to move to debate on the legislation--the first key procedural hurdle for the senate plan and one that requires 60 votes from the 100-member body. \"the finish line is in sight,\" <mark>reid</mark> said. \"i'm confident we'll cross it soon.\" whether democrats succeed depends on <mark>reid</mark>'s ability to keep his party's caucus intact. there is no room for error--democrats control exactly 60 votes, and republicans so far are united in opposition. <mark>reid</mark> dodged questions about whether he had the votes to move forward, telling reporters, \"we'll find out.\" if the senate agrees to take up the bill, the debate would begin on november 30, after next week's us thanksgiving holiday. it would last at least three weeks, making it unlikely obama can sign a final bill by the end of the year. any differences between a senate bill and the house of representatives version passed on november 7 would have to be reconciled before a final bill can be voted on again in both houses and sent to obama to sign. the nonpartisan congressional budget office estimated <mark>reid</mark>'s bill would cost $849 billion over 10 years--below obama's $900 billion target--reduce the budget deficit by $130 billion in the same period and extend insurance coverage to 31 million more people. the rosy report card from budget analysts could ease doubts about the bill among wavering moderate democrats, but republicans were not impressed. \"we've been warning the american people of the democrats\" plans to raise premiums, raise taxes, and slash medicare in order to fund more government, \"republican leader mitch mcconnell said. cheaper than house the senate bill is less expensive than a more than $1 trillion healthcare measure passed in the house, which would have covered at least 5 million more uninsured. like the house bill, the senate measure would require all americans to buy insurance and would set up exchanges where they could choose among various options. it also would offer subsidies to help low-income workers pay for the coverage. the senate bill includes a government-run insurance option that lets states choose whether to participate, and would halt industry practices like denying coverage to individuals with pre-existing conditions. some business trade groups were unhappy about the proposal, including america's health insurance plans, which represents the insurance industry, and the national federation of independent business, which represents small businesses.\" the new healthcare taxes and fees will raise the cost of coverage for individuals, families, and employers, \"said karen ignagni, president of america's health insurance plans. healthcare investors were mostly unconcerned about the senate bill as most provisions were expected, but a surprise proposal for a 5% tax on cosmetic treatments hurt companies such as allergan inc and medicis pharmaceutical corp. republicans criticised tax increases in the bill to help pay for the expanded insurance coverage, including the new tax on elective cosmetic surgery they dubbed a\" botox tax. \"the bill would also raise the medicare payroll tax on high-income workers, which is used to finance the government health program for the elderly, and impose a tax on high-cost\" cadillac \"insurance plans. mcconnell noted some of the bill's deficit reduction was possible because many of its provisions would not kick in until 2014, a year later than in the house bill.\" that's a little bit like being asked to pay your mortgage four years before you \"re allowed to move into your house,\" he said. three democratic senators--<mark>ben nelson</mark>, blanche lincoln and mary landrieu--are uncommitted on saturday's vote, although <mark>nelson</mark> and landrieu said they were encouraged by <mark>reid</mark>'s approach. <mark>nelson</mark> played down the vote's significance. \"it's a simple vote--to go forward with debate or not to go forward with debate,\" he said. \"even if you don't like the legislation, it's arguable you should go ahead. if you don't get it on the floor, you don't have any opportunity to amend it.\" world food programme asks billion people for 1 euro to beat hunger the launch of the mumbai arm of the delhi wine club saw many of the city's glitterati come out for an evening under the stars. chirag patel's exhibition-cum-installation based on <mark>michael jackson</mark>'s life and career, showcased the artist's mania for the late pop prince."}, {"articleID": "2015080509_00122108_W", "names": {"Bill Winters": ["Q19663112", "Q27958920"], "Mark Potter": ["Q6769304", "Q6769305"]}, "date": "2015-08-05", "url": "http://feeds.reuters.com/~r/reuters/INbusinessNews/~3/tJR9wI-q2m4/story01.htm", "content": "Standard Chartered halves dividend, new CEO says could raise capital LONDON A man walks past the head office of Standard Chartered bank in the City of London February 27, 2015. Reuters/Eddie Keogh/Files LONDON Standard Chartered (STAN. L) halved its dividend and said it would raise capital from investors if needed, as new chief Executive <mark>Bill Winters</mark> outlined his thoughts on reviving a bank hit by a 44 percent slump in first-half profit. Shares in the Asia-focused lender rose 4.5 percent to 994.9 pence on Wednesday as investors welcomed <mark>Winters</mark>' move to set a target to double return on equity to a minimum of 10 percent. That helped offset disappointment over the cut to the dividend for the first half of the year to 14.4 cents a share from 28.8 cents a year ago. The bank said it had \"rebased\" the payout to reflect its \"current earnings expectation and outlook\" . As a result of the cut, StanChart said its common tier 1 equity position, a key measure of capital strength, had risen 80 basis points to 11.5 percent, six months ahead of target. <mark>Winters</mark>, who became CEO in June, did not rule out raising capital in future. \"If we decide we need capital for the long-term benefit of the group, we will raise capital,\" he said. The bank said its pretax profit in the first six months of the year fell to $1.82 billion, down 44 percent from a year ago. StanChart has suffered a troubled three years, hurt by problems including fines from U.S. regulators for misconduct, strained relations with top shareholders, plunging commodities prices and a weakened trading environment. On his first day in charge, <mark>Winters</mark> told investors the bank needed to strengthen its finances and simplify operations to increase shareholder returns. The lender has struggled to shake off concerns it will need to raise additional capital to bolster its balance sheet, especially if Asian economies that have traditionally served as the biggest drivers for its revenue growth continue to falter. The lender is aiming for cost savings of $1.8 billion by the end of 2018. Some analysts have said <mark>Winters</mark> needs to raise at least $5 billion from a rights issue and a dividend cut to strengthen the balance sheet and generate cash to grow lending and kick-start revenue growth. <mark>Winters</mark> has already shaken up the bank's management structure, streamlining its eight geographical regions into four units that will report directly to him. (Reporting by Steve Slater and Sinead Cruise; Editing by <mark>Mark Potter</mark>) Trending On Reuters"}, {"articleID": "2018060221_00209318_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2018-06-02", "url": "http://asia.eurosport.com/boxing/tyson-fury-labels-himself-greatest-heavyweight-of-all-time-ahead-of-comeback_sto6787922/story.shtml", "content": "Tyson Fury labels himself \"greatest heavyweight of all time' ahead of comeback By PA Sport 2 hours ago Updated 3 minutes ago 0 0 The 29-year-old will fight little-known Albanian Sefer Seferi on June 9. Tyson Fury proclaimed himself\" the greatest heavyweight of all time \"and is making a beeline for Anthony Joshua and Deontay Wilder in an effort to become top dog in the division once again. Fury established himself as the number one in boxing's blue riband weight class in November 2015 when he wrenched the WBA, IBF and WBO crowns from the long-reigning Wladimir Klitschko in a stunning upset. Well-publicised personal issues and an anti-doping case have kept Fury out of the ring since then but he resumes his professional career next Saturday against little-known Albanian Sefer Seferi at the Manchester Arena. The 29-year-old (25-0, 18KOs) remains the lineal heavyweight champion although Joshua has risen to prominence in his British rival's absence and holds his old belts while Wilder is the WBC titlist. Fury, though, is supremely confident in his own abilities to the extent that he believes there is no man alive who is able to defeat him, and that he can handle Joshua and Wilder with ease. He said:\" There's been plenty of come forward aggressors throwing big bombs, there's been plenty of boxers on the back foot, but when has there ever been a 6ft 9in switch-hitter with the confidence of <mark>Muhammad Ali</mark> and Floyd Mayweather rolled into one? \"There has never, ever, ever been anybody like me. I'm unbeaten, I'm fast, I'm brash, I'm young, I'm good looking, I can dance, I've even got white teeth. What more can I have as a fighter, as a boxer, as a sportsman, as a showman?\" I am the greatest heavyweight of all time, I'm not even going to be modest. I already beat the legendary Wladimir Klitschko and I did it easy, it was an easy fight. \"So put me in the ring with these bums and I'll tell you how to put them down: easy peasy lemon squeezy!\" I am the best that there's going to be and I don't believe there's a man born yet that can beat me. \"Nobody has seen what I can do yet because I've not had an opponent take me to that level that I need to go to. The better the opponent you put in front of me, the better I become.\" Seferi has spent the majority of his career at cruiserweight although he has only lost once in 24 contests in the paid ranks and never before been stopped. Ahead of his highly-anticipated comeback, Fury insists he feels better than ever following his lengthy lay-off. He said: \"You're going to see the best Tyson Fury there's ever been. I know a lot of people talk a good game when they've been (inactive for a long period), they always say they've done everything correctly.\" But when I say I've never, ever, ever been better or stronger or fitter or faster, I mean it. I've sparred hundreds and hundreds of rounds in the gym, I'm doing very, very well. \"Fury intends to box up to four more times in 2018 and thinks he could be challenging for world honours before the year is out. He added:\" It's 100 per cent possible this year. Don't rule it out that I don't take over the world this year and win a world title back. \"0 Read and react"}, {"articleID": "2015042623_00001739_W", "names": {"Jim Prentice": ["Q19877246", "Q364303"]}, "date": "2015-04-24", "url": "http://lethbridgeherald.com/news/national-news/2015/04/24/premier-jim-prentice-says-alberta-is-not-an-ndp-province/", "content": "Alberta NDP leader Notley says <mark>Prentice</mark>, Wildrose leader aren't that...Alberta premier tips hat to NDP Leader Rachel Notley's debating...NDP: Paramedics asked to pay out of pocket for medical equipment NDP: Broad consensus emerging from debate: NDP's Rachel Notley shines Alberta Party: Gordon Dirks conveniently forgets his role in overpriced...Wildrose: Jean presents clear vision for low taxes and balanced budget in...CALGARY - Premier <mark>Jim Prentice</mark> is dismissing the possibility of the political left surging to power in the May 5 election, saying Alberta is \"not an NDP province.\" The Progressive Conservative leader had his guns firmly trained on NDP Leader Rachel Notley on Friday, one day after a televised leaders debate that many political pundits say she won. <mark>Prentice</mark> said he likes Notley and considers her a \"skilled\" debater, but there are questions about how her party could afford its election promises. \"This is not an NDP province,\" <mark>Prentice</mark> said after touring a Calgary bakery. \"I don't believe that the voters of Alberta want to see an NDP coalition or an NDP government. I think they take pride in our province as the economic engine of this country.\" The election was supposed to be a coronation for <mark>Prentice</mark> when he called it a year earlier than required, with the opposition parties in disarray. But opinion polls have suggested there is a tight three-way race among the Tories, the NDP and the Opposition Wildrose under leader Brian Jean, and some of the most recent surveys put the NDP in front. The Tories have been in power in Alberta since 1971. The NDP has never held more than 16 seats. The debate tussle between <mark>Prentice</mark> and Notley reached a climax in an exchange over corporate taxes, with <mark>Prentice</mark> mocking Notley with the quip \"I know math is difficult.\" The hashtag \"#mathishard\" instantly became popular on Twitter, with many users labelling the remark as patriarchal and even sexist. <mark>Prentice</mark> said he wasn't trying to be mean-spirited and was referring to a math error by the NDP earlier in the campaign. \"I did not mean any disrespect to Rachel Notley and I'm sure she knows that.\" Asked if she considered <mark>Prentice</mark>'s comments sexist or condescending, Notley said: \"Not at all.\" Doug Griffiths, a former PC cabinet minister who isn't running in this election, said the math comment is a disappointing distraction. \"If <mark>Jim</mark> had turned and said that to Brian Jean, I don't think anyone would have said anything,\" Griffiths said. \"But he said it to Rachel and it sounded patronizing and belittling...I know <mark>Jim</mark> and I don't think he intended it that way at all.\" Griffiths said there was no doubt that Notley \"did exceptionally well.\" \"<mark>Jim</mark> really needed to tie and I think he was a very close second.\" Duane Bratt, political scientist at Mount Royal University, said the math comment shows <mark>Prentice</mark> is on the razor's edge as far as his image goes. \"It ties into the reputation that <mark>Prentice</mark> has of this arrogant elitist mansplaining to Rachel how arithmetic works.\" While Notley and <mark>Prentice</mark> duked it out, the premier often turned his back to Jean. <mark>Prentice</mark> shrugged off suggestions he was dismissive, citing his frustration with how specific Jean was being about proposed Wildrose spending cuts. Jean said he had no concerns with it. \"I'm not going to comment on the professionalism of other people in that particular debate,\" he told reporters at an event in Edmonton. \"I'll let people decide for themselves if they see what took place if that's the person they want for their premier, then that's the person they want for their premier.\" Notley urged Albertans Friday not to look to the Wildrose as an alternative to the Tories. She said the two parties have plenty of things in common and the Wildrose is quickly becoming a non-factor. 504 - 7th Street South Lethbridge, AB T1J 3Z7 (403) 328-4536 Print Advertising: (403) 328-4410 National Advertising: (403) 380-7585 Online Advertising: (403) 380-7585"}, {"articleID": "2014020501_00037762_W", "names": {"Alex Jones": ["Q16235485", "Q19559933", "Q20666729", "Q26330355", "Q2641401", "Q319121", "Q47113851", "Q4717247", "Q4717250", "Q4717251", "Q4717252", "Q4717253", "Q4717255", "Q50365540", "Q5665987"], "James O'Keefe": ["Q6140497", "Q6140500"]}, "date": "2014-02-04", "url": "http://www.prisonplanet.com/soros-corporate-group-predicts-terrorism-at-winter-olympics.html", "content": "Internationalist group believes threat may not come from Muslim North Caucasus region February 4, 2014 The International Crisis Group (IGC) is predicting a terrorist attack in Sochi during the Winter Olympics. The NGO has issued a report, \"Too Far, Too Fast: Sochi, Tourism and Conflict in the Caucasus,\" analyzing the potential for violence at the games. CIA mouthpiece Voice of America predicts terror at games. \"We hope that everything will be fine and safe, but the possibility of a terrorist attack remains,\" said Sokiryanskaya said Russian authorities believe a threat may come from the Muslim North Caucasus republic of Dagestan where an insurgency is currently underway against Russian control of the region. The IGC, however, believes threats against the games may arise elsewhere in the region from Muslims more difficult to distinguish among non-Muslim natives. \"Radicals can come from any region of Russia,\" Sokiryanskaya said. Although Russian officials have introduced what is described as unprecedented security following a terrorist attack in the southern city of Volgograd in December, The Boston Globe reported on Tuesday security is lax in Sochi. Despite questions about Russian security, Thomas Bach, the president of the International Olympic Committee, said at a briefing that \"we have confidence with the Russian authorities.\" The IGC, a non-government organization that supported the so-called \"humanitarian intervention\" in Kosovo, was founded by members of the internationalist Carnegie Endowment for International Peace and the World Bank. It is funded by governments and corporate foundations. Its advisory board is dominated by Chevron, Shell and other transnational corporations. George Soros, chairman of the Open Society Institute, sits on the IGC board of trustees. Soros has established foundations in Czechoslovakia, Poland, Yugoslavia, and Russia and is directly implicated in U.S. Identifies Terror Group Threatening Attacks on the Olympics Russia planning \"near-total surveillance' of visitors, athletes at Sochi Winter Olympics Terror\" Surprise' for Sochi Olympics? Purported Suicide Bombers' New Threat Volgograd Bombings: CIA's Chechen Assets Attack Russia Ahead of Winter Olympics Christian Singer Walks Out on Grammys After \"Satanic' Performances Black students ask University to stop using racial descriptions in crime alerts Police Fail to Stop Violent Attack Just Outside Police Station Chief of Police Harassed by Feds, Fired After Signing Pledge to Uphold Constitution Monday: The Nightly News. Epic Fails Of The Super Bowl Police State. Media Infiltration With Super Bowl Truther Matthew Mills. Monday: The <mark>Alex Jones</mark> Show. Let Freedom Of Speech Ring! Man Infiltrates The Super Bowl With 9/11 Truth. Plus, Jesse Ventura: The Eyes Of The World Are Upon Us. Sunday: The <mark>Alex Jones</mark> Show. Super Bowl: The Largest Media Event In The World, The Super Bowl Is A Super-Distraction. Plus, Tax Exempt NFL Robs The American People. Friday: The Infowars Nightly News. Confessions Of A Disillusioned TSA Agent Hit The Pages Of New York Times & Politico. Plus, Mass Transit Seen As Largest National Security Risk During Super Bowl Frenzy. Friday: The <mark>Alex Jones</mark> Show. Super Bowl Fans Want TSA Administered Proctology Exams. Plus, The Roots Of Communism & America's Descent Into Tyranny With Joel Skousen. Thursday: The Infowars Nightly News. Chief of Police Harassed by Feds, Put On Administrative Leave After Signing Pledge to Uphold Constitution. Plus, Kelly Thomas Aftermath: Cops Laughed About Having License to Kill. Thursday: The <mark>Alex Jones</mark> Show. Immigration Reform Bill Spells The End Of The Republican Party As It Exists. Plus, Infowars Reporter Jakari Jackson Touches Down At Superbowl Stadium Ahead Of The Gladatorial Spectacle. Wenesday: The Infowars Nightly News. Obama Promises To Enact Gun Control Laws\" With Or Without Congress \"Plus, CNN Poll: 67% Oppose Obama's Executive Agenda. Wednesday: The <mark>Alex Jones</mark> Show. The End Of Pure Humans By The Hand Of The Globalist Technocratic Take Over. Plus, Economic Takedown With Trends Forecaster Gerald Celente. Tuesday: The Infowars Nightly News. Obama Using Executive Orders With Increasing Frequency During His\" Year Of Action. \"Plus, Our Live Round Table Session As We Simulcast Tonight's State Of The Union Address. Monday: The Infowars Nightly News. Obama to Assert Unilateral Agenda. Plus, CFR Calls On Obama to\" Befriend' Al-Qaeda Terrorist Group. Monday: The <mark>Alex Jones</mark> Show. Obama Quiets Dissent By All Means Necessary. Plus, Project Veritas Founder and Author of \"Breakthrough\" <mark>James O'Keefe</mark> discusses deeply offensive comments made by members of Battleground Texas. Sunday: The <mark>Alex Jones</mark> Show. Political Dissent Crackdown. Plus, Obama Openly Usurps The United States Congress While Single Handedly Destroying The Economic System Of The United States. Friday: The <mark>Alex Jones</mark> Show. Rebroadcast - Obama Furthers Military-Industrial Complex on the 53rd Anniversary of Eisenhower's Warning To The Nation. Thursday: The Infowars Nightly News. Harvard Professor Warns of \"Devastating\" China-Japan War. Plus, Al-Qaeda: The Best Enemy Money Can Buy. Thursday: The <mark>Alex Jones</mark> Show. History Does Not Repeat Itself, But It Does Rhyme. The Parallels Between Pre WWI 1914 and Today. Monday: The Nightly News. Epic Fails Of The Super Bowl Police State. Media Infiltration With Super Bowl Truther Matthew Mills. Monday: The <mark>Alex Jones</mark> Show. Let Freedom Of Speech Ring! Man Infiltrates The Super Bowl With 9/11 Truth. Plus, Jesse Ventura: The Eyes Of The World Are Upon Us. Sunday: The <mark>Alex Jones</mark> Show. Super Bowl: The Largest Media Event In The World, The Super Bowl Is A Super-Distraction. Plus, Tax Exempt NFL Robs The American People."}, {"articleID": "2011111914_00082552_W", "names": {"Scott Walker": ["Q13502385", "Q2035840", "Q20712628", "Q28835721", "Q48799183", "Q488603", "Q553254", "Q55362601", "Q7437461"], "Scott Fitzgerald": ["Q17489814", "Q462128", "Q7436328", "Q7436329"]}, "date": "2011-11-19", "url": "http://wausaudailyherald.com/article/20111119/WDH0101/311190076&located=rss", "content": "wausau-area bus fares could increase by as much as 25 cents for most riders next year as transit...births greenlee, heather, wausau, daughter, tanith isabella greenlee, wednesday, nov. 16, 2011. tomahawk--as a setter, anna sudbury assumes a leadership role on the volleyball court. prep football: tomahawk's sudbury, pfannerstill lead team to new heights this year marks the first thanksgiving jarrod caze will spend away from his family in milwaukee. kao lor, co-owner of the video game shop gaming generations in rib mountain, has ways to stay...this week, we asked four more packers what famous actors would play their roles in a blockbuster...new york--\"arrested development\" is coming back to life on the netflix video streaming service. gov. <mark>scott walker</mark> recall efforts to cost state $650k madison - at least $650,000 will be needed by state election officials to cover the costs of handling petitions for wisconsin's upcoming wave of recalls, according to a memo from the government accountability board. but that estimate doesn't include costs for local governments, which are expected to be in the millions statewide. the election watchdog agency said it will need an additional $652,699 to cover recall expenses, including personnel costs, mainly from hiring and supervising about 50 temporary workers to review as many as 1.5 million signatures, renting additional office space, buying supplies and equipment and doing public outreach about the state's new voter id law. there are recall efforts under way targeting gov. <mark>scott walker</mark>, lt. gov. rebecca kleefisch and four republican state senators: senate majority leader <mark>scott fitzgerald</mark> of juneau, pam galloway of wausau, van wanggaard of racine and terry moulton of chippewa falls. the more than $650,000 in costs the gab expects to incur from handling recall petitions would be needed in addition to money the agency already is receiving, including about $950,000 for the year in base funding and another $1.8 million in one-time money to implement voter id. the preliminary estimate, sent thursday to the co-chairs of the legislature's finance committee, would cover those recalls and presumes efforts will be launched against two more state senators. it does not include any costs for local officials, gab spokesman reid magney said. \"that's something that we're developing now, and we expect to have that estimate by the end of the month,\" magney said. spokespeople for the finance committee co-chairs, state sens. alberta darling, r-river hills, and robin vos, r-rochester, declined to comment pending gab's full cost estimate. the combined local and state cost for nine state senate recall elections held earlier this year, targeting six republicans and three democrats, was about $2.1 million, the board's memo said. those recall elections were held in nine state senate districts, which involved 40 counties, 594 municipalities and 1,674 polling places. statewide recall elections would be much broader, involving all 72 counties and thousands of polling places. ben sparks, spokesman for the republican party of wisconsin, warned of skyrocketing costs linked to the recalls. \"the bill wisconsin families will receive for the democrats' baseless recall effort is without precedent,\" he said. \"while governor <mark>walker</mark> and the state legislature instituted bold reforms to cut wasteful spending, the democrats and their liberal special interests simply want to increase it in their selfish pursuit to regain political power.\" but the group leading the recall effort said the expense is worth it. gov. <mark>scott walker</mark> recall efforts to cost state $650k madison - at least $650,000 will be needed by state election officials to cover the costs of handling petitions for wisconsin's upcoming wave of recalls, according to a memo from the government foreclosure fraud: first criminal charges filed in nevada over robo-signing. that's a start! 14 replies | posted by jd4020 in"}, {"articleID": "2015041904_00022970_W", "names": {"Sam Collins": ["Q20853588", "Q24663875", "Q30603377", "Q47005452", "Q7407331"]}, "date": "2015-04-19", "url": "http://www.wkyt.com/wymt/home/headlines/Annual-soap-box-derby-held-in-Hazard-on-Saturday-300561171.html", "content": "HAZARD, Ky. (WYMT) - Memorial drive in Hazard was closed this afternoon, but cars still zoomed down the steep hill. People gathered for the 16th annual Bud Combs Soap Box Derby in downtown Hazard. There were 27 drivers, ages 8-17, racing for a chance to qualify for the international soap box derby in Akron, Ohio. The chance to compete at such a high level is all the fuel these racers need. <mark>Sam Collins</mark> the event coordinator says the kids really get into the races, \"It gets really competitive and the kids really wannawin. There's some big trophies up there, its all in good fun.\" Special Olympic Spring games held in Johnson County Today's Calendar Saturday April 18 No Community Events Scheduled for Today Sunday April 19 WYMT CONTACT INFO 199 Black Gold Blvd.. Hazard, KY 41701 606-436-5757 - switchboard 606-439-9968 - newsroom × Online Public Information File Viewers with disabilities can get assistance accessing this station's FCC Public Inspection File by contacting the station with the information listed below. Questions or concerns relating to the accessibility of the FCC's online public file system should be directed to the FCC at 888-225-5322, 888-835-5322 (TTY), or fccinfo @ fcc.gov. Public File Liaison: 859-299-0411 Station Contact Info: WYMT CONTACT INFO 199 Black Gold Blvd. ."}]