[{"date": "2014-06-06", "url": "http://www.latimes.com/entertainment/la-et-mg-casey-kasem-hospitalized-critical-condition-20140606-story.html?track=rss", "content": "Casey Kasem makes an audition tape in 1971. Casey Kasem broadcasts on radio station KIQQ in 1981. Casey Kasem receives the Radio Icon award during the 2003 Radio Music Awards in Las Vegas. Caption Kasems at tribute to Barbara Walters Casey Kasem and his wife, Jean, arrive at the Museum of Television and Radio's gala tribute to Barbara Walters at the <mark>Beverly Hills</mark> Hotel in 2004. Casey Kasem's health has continued to falter during the radio host's stay in a Washington State hospital, according to several reports. Related story: Raw meat, King David latest in bizarre Casey Kasem family drama Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. Casey Kasem's family saga has taken its most bizarre turn yet: Kasem's wife Jean tossed a package of hamburger meat at the sickly radio personality's daughter, Kerri, whom he had from his first marriage. (Nardine Saad) \"Mr. Kasem is alert and appears comfortable at this time,\" said hospital spokesman <mark>Scott Thompson</mark>. \"Any further updates on Mr. Kasem's condition will be at the discretion and approval of his children .\" The ailing radio icon, who suffers from Lewy body dementia, is said to be receiving antibiotics through IVs, medicine for blood pressure support and care for his bed sores, <mark>Thompson</mark> told CNN. Kasem has been bedridden for some time now. CNN noted that a patient could be in both critical and stable condition if his or her health is not deteriorating further. People reported, and his two daughters were already there when he suffered a sharp drop in blood pressure. His son was said to be en route. \"His health is worse. We're just not sure how bad at this point,\" a rep for the radio icon's daughter Kerri Kasem told the mag on Thursday. taken to the hospital on Sunday by his daughter, whom he had from his first marriage. Kerri Kasem was embroiled in a dramatic scene outside a Washington home where Kasem and his wife of 34 years, Jean Kasem, were staying with friends. In a bizarre turn of events, his wife hurled a package of raw hamburger meat at her stepdaughter after a dispute broke out following the radio host's removal at his daughter's discretion. \"I believe in the power of prayer. I believe in the power of intention. I believe that when a person or group of people focus on what is needed they can create a certain outcome,\" she wrote. \"Whatever it is you believe in, I ask that you take a moment and pray, or focus on sending love and healing energy to my father. He needs it right now .\" Jean Kasem and her three stepchildren--Kerri Kasem; her sister, Julie; and their brother, Mike Kasem--have been feuding over the radio host's care since last year. The family drama was highlighted last month when his children filed a missing person's report when his wife removed him from a Santa Monica facility to Washington state without the family's knowledge. judge turned the radio host's primary care back to his children Casey Kasem's daughter gets expanded power over dad's health care Edie Falco loves playing the lying, seriously flawed \"Nurse Jackie' Datebook: Boxing painters, teen idols and John Altoon's short career Vincent van Gogh ear replica made from relative's DNA goes on display Holding even-year L.A. city elections to boost turnout gets second nod\" The Fault in Our Stars' elevates sad story by cutting the sap GM fires 15 at top levels; report on ignition switches \"brutally tough' GM fires 15 at top levels; report on ignition switches\" brutally tough '", "articleID": "2014060703_00019929_W", "names": {"Scott Thompson": ["Q16214236", "Q2886450", "Q324114", "Q559081", "Q7437374", "Q7437375", "Q7437376", "Q7437377"]}}, {"date": "2014-06-08", "url": "http://iol.co.za:80/news/world/remains-recovered-in-australia-croc-attack-1.1700228", "content": "Sydney - Human remains were recovered on Sunday in the hunt for a man snatched by a crocodile in front of terrified relatives on a boat trip in northern Australia. The man, 62, was taken from his boat on the South Alligator River in northern Australia's Kakadu national park late Saturday afternoon as his wife, son and daughter-in-law looked on. Northern Territory police sergeant Andrew Hocking said two large crocodiles were shot and cut open by search crews Sunday at the waterhole where the man was last seen. \"One of those crocs was later examined and a quantity of human remains was recovered,\" Hocking told reporters, adding that the creature had been 4.7 metres long. The remains were yet to be formally identified, but Hocking said the animal was recovered just 1.5 kilometres from the attack site. \"The difficulty in this location is getting in large boats, we're only able to bring in small boats. But using the expertise of the Territory Parks and Wildlife staff, they managed to help us bring it to a conclusion,\" he said. \"Thankfully this was carried out and (the remains) recovered very, very quickly .\" Crocodile expert Graeme Webb said it was unusual for a crocodile to attack at this time of the year, when Australia experiences cooler weather. \"I don't know what has happened in this case but it just sounds horrific. It's just awful, you just can't begin to understand how (the man's family) must feel .\" While the man's wife and daughter-in-law drove two hours to the nearest lodge to raise the alarm his son remained in the area searching for his father, which Superintendent <mark>Bob Harrison</mark> earlier described as \"obviously traumatising\" \"Anyone's heart would go out to the family in that sort of incident,\" <mark>Harrison</mark> told ABC radio. Crocodiles are a common feature of Australia's tropical north, and their numbers have increased steadily since the introduction of protection laws in 1971, with government estimates putting the population at 75 000 - 100 000. Saltwater crocs can grow up to seven metres long and weigh more than a tonne. Saturday's attack is Australia's first fatality since January, when a 12-year-old boy was taken by a crocodile in the Kakadu national park, a sprawling World Heritage-listed nature and cultural reserve in Australia's Top End. Another boy suffered bite wounds in that incident as he fought the crocodile off. According to the international CrocBITE database of attacks set up at Australia's Charles Darwin University last year, there have been 66 fatalities globally so far in 2014. comment guidelines. Login and register, if you haven' t already. Write your comment in the block below and click (Post As) Has a comment offended you? Hover your mouse over the comment and wait until a small triangle appears on the right-hand side. Click triangle (© Copyright 1999 - 2014 Independent Online, a division of Independent Newspapers (Pty) Limited. The copyright in the literary and artistic works contained in this online news publication and its other related and connected websites, as well as in the published editions of group newspapers, their supplements and any other content or material, belongs exclusively to Independent Newspapers (Pty) Limited unless otherwise stated.", "articleID": "2014060822_00028924_W", "names": {"Bob Harrison": ["Q2329453", "Q2907695", "Q4932704", "Q4932705", "Q4932706"]}}, {"date": "2014-06-09", "url": "http://lasvegassun.com/news/2014/jun/08/two-officers-shot-cicis-nellis-suspects-run-wal-ma/?utm_source=mostpopular&utm_medium=banner&utm_campaign=mostRead", "content": "Two officers, three others dead in shootings at restaurant, Wal-Mart BREAKING: 5 Dead, Including 2 Officers In Vegas Two suspects declaring the start of \"a revolution\" shot and killed two police officers this morning at a pizza restaurant on Nellis Boulevard, then ran into a nearby Wal-Mart and shot at least one other person before killing themselves, according to Metro Police. Sheriff Douglas Gillespie, in an afternoon news conference, identified the dead officers as Alyn Beck, 41, and Igor Soldo, 31. The two were patrol officers in the area. \"What precipitated this event, we do not know,\" a subdued Gillespie said. \"My officers were simply having lunch when the shooting started .\" He did not identify the dead assailants or the victim shot in the Wal-Mart. A woman who said she witnessed the start of the bloodshed described an execution-style assault on two officers who were eating pizza and probably never saw the attack coming. Assistant Sheriff Kevin McMahill said the two suspects ambushed and shot the two officers shortly before 11:30 a.m. at the CiCi's Pizza at 309 N. Nellis Blvd., near Stewart Avenue. Officer Larry Hadfield, a Metro spokesman, said one of the suspects yelled, \"This is a revolution .\" Gillespie, however, said at the news conference he could not confirm the revolution comment. One of the officers was able to fire back during the ambush, Gillespie said. The assailants then took the officers' ammunition and reportedly ran inside the Wal-Mart on Nellis Boulevard between Charleston Boulevard and Stewart Avenue. A number of responding officers followed the suspects into the store, McMahill said. There, the assailants shot and killed at least one person inside the front door of the store. They exchanged gunfire with police inside the store before the female suspect shot the male suspect and then killed herself in an apparent suicide pact, according to Gillespie. McMahill described the assailants' lives ending an an \"apparent suicide pact .\" Sheree Burns, 48, said she left church early, lured by the all-you-can-eat pizza for $5.55 at CiCi's. She said she was seated just behind the two officers, who already were eating. A man came up to one of the officers - a balding man - and shot him in the head, Burns said. Instinctively, Burns ducked under her table but peeked up to see who she thought was a woman shoot the other officer in the head. Burns said she saw the male assailant - whom she described as tall with scruff on his face - hovering over the balding officer and remove his handgun from his holster. The two assailants then left CiCi's, en route to the Wal-Mart, Burns learned after talking to police. \"I'll never leave church early again,\" Burns said. McMahill said there were \"literally a thousand\" witnesses to the midday events at the busy shopping center. \"It is a very complex, very dynamic crime scene,\" he said. Inside the Wal-Mart, Mayra Calvillo, 19, was working near the front of the store when she heard someone yell, \"Get out of Wal-Mart!\" Calvillo said she turned around and saw a man with a handgun raised in the air. The man, whom Calvillo described as white and dressed in a navy blue shirt, jean shorts and a hat, fired at least one round. Calvillo described the unfolding scene as surreal. She said she started to run, then realized she needed to help direct the store's customers safely out of the store. Others described a pandemonium-filled scene. Jesus Bustamante, 26, said he was in the electronics section of the store when he heard a muzzled sound and people screaming, \"It's a shooting! It's a shooting!\" Bustamante said he wasn't sure whether to run out or take cover in the store, but he saw a Metro officer run past him saying, \"Get the (expletive) out of here!\" Bustamante said those trying to get out of the store was typical for a busy Wal-Mart: elderly, children, parents. A mother at the scene who asked not to be identified said she was in a dressing room with her 7-year-old daughter and 9-year-old son, who were looking for outfits for a relative's graduation. The mother said she heard two gunshots followed by pandemonium breaking out inside the store. Her first thought; How do we get out alive? She said she immediately grabbed her children and sprinted out a backdoor near the changing room. Once outside the store, she said she saw police officers swarming near the CiCi's and hear bystanders screaming that two officers had been shot. Alex Estrada, who was at an IHOP nearby, said he saw a crowd of about 30 to 40 people run out the back door of Wal-Mart around 11:30, and people on the streets and at nearby businesses were talking about the incident. Still dazed from the midday events, Burns stood outside Applebee's a few blocks away awaiting a ride home. When her friend arrived, Burns wept into her arms. \"I saw it all,\" Burns said. Residents of the area had mixed feelings about where they lived. A few employees at a nearby restaurant said it didn't surprise them. A schoolteacher who has lived here 13 years said, \"It can happen anywhere .\" Calvillo, who has worked for 11 months at the Wal-Mart, expressed similar sentiments. \"I'm still in shock. I feel like it hasn't hit me yet. I'm scared. I don't feel safe anymore,\" she said. Nell Jones and her daughter, JaNell, have lived here for two years. They are getting out in August. Almost nightly, Nell said, Metro helicopters, \"ghetto birds,\" pass overhead presumably on a suspect's tail. \"It's all these gang-bangers,\" Nell said angrily. Metro has doubled up its officers on patrol while officers gather more information about the shooting. Officers also are wearing badges shrouded with black ribbons in honor of their deceased colleagues. The media wasn't initially allowed into the entrance of University Medical Center Trauma, where some victims of the shooting had been rushed in. Metro put police tape around the entrance, just north of Charleston Boulevard, and large Command Center utility vehicle from the North Las Vegas Police Department was parked nearby, its telescopic antenna jutting into the air. The police tape came down around 5:30 p.m. Capt. <mark>William Scott</mark>, who oversees Bolden Area Command, which is just north of U.S. 95 and abuts the command area where the shootings took place, said tough times would be coming as officers ponder the senseless act. \"We'll talk a lot about this,\" he said of himself and his officers. \"We will always have each other's backs .\" NBA Finals in Vegas: Heat vs. Spurs Game 2 betting preview, odds and picks", "articleID": "2014060909_00001661_W", "names": {"William Scott": ["Q28853025", "Q43390409", "Q43912263"]}}, {"date": "2014-06-09", "url": "http://www.onenewspage.com/n/Technology/750hntmyc/Harrison-Ford-Wanted-Han-Solo-To-Be-Killed.htm", "content": "Harrison Ford Wanted Han Solo To Be Killed Off in \"Star Wars: The Empire Strikes Back\" Monday, 9 June 2014 (55 minutes ago) The Star Wars films have been a huge influence on pop culture ever since they originally hit the big screen. Even now, years later, their popularity shows no...It Looks Like The Millennium Falcon Will Be In \"Star Wars: Episode VII' It looks like the Millennium Falcon is going to be in\" Star Wars: Episode VII. \"After releasing more than 40 new photos yesterday, TMZ released a new group of...Business Insider 6 days ago - Business Google launching Android rival to APPLE's iBeacon technology As Apple, GOOGLE and Amazon Roll In, Who Will Be The Last Music Streaming Service Standing? Meet the company that is dangerously close to collecting 1% of Apple's The Critics Are Wrong: GOOGLE GLASS Is Going To Be Huge, And Most People Have No Idea Why (GOOG)\" Halo: The Master Chief Collection' brings all four Halo games to Cartoon HD App Taken Down From App Store; Users Upset Apk No Longer Available for AMAZON goes after PayPal by offering to handle payments for startups & online services <mark>David Noble</mark> Harrison Ford Wanted to Kill Han Solo: The Star Wars films have been a huge influence on pop culture ever sinc...http: //t.co/4ZCLOhFyEb celebrity news Star Wars: <mark>George Lucas</mark> reveals that Harrison Ford wanted Han Solo to die http: //t.co/HB2TmNMbg6 Harrison Gaunce Harrison Ford Wanted Han Solo To Be Killed Off in \"Star Wars: The Empire Strikes Back\" http: //t.co/a9atcVRoX3 Nathan Worthington Harrison Ford wanted Han Solo to be killed off - Waterford News and Star http: //t.co/ZX4XwijEpr @ StarWarsFans101: Star Wars shocker: Harrison Ford wanted Han Solo to die http: //t.co/h0bHo6SyW8 Germany launches criminal investigation of alleged US surveillance of Merkel's phone Queen's new state carriage marks hundreds of years of history as well as featuring 21st century technology", "articleID": "2014061001_00018970_W", "names": {"David Noble": ["Q1175923", "Q5238054", "Q5238056"], "George Lucas": ["Q1507803", "Q38222"]}}, {"date": "2014-06-10", "url": "http://nebraska.tv/story/25734803/militants-overrun-parts-of-key-iraqi-city-of-mosul", "content": "meta content = \"2014-06-10 07:09:45\" > Vegas police killer decried government on YouTube His face painted to look like the comic book villain the Joker, a man who would months later gun down two Las Vegas police officers and a good Samaritan punctuates his political rant with manic glares at the...His face painted to look like the comic book villain the Joker, a man who would months later gun down two police officers and a good Samaritan punctuates his political rant with manic glares at the camera. In another...meta content = \"2014-06-10 07:39:56\" > <mark>Morgan</mark> crash fuels debate over tired truckers A New Jersey highway crash that severely injured <mark>Tracy Morgan</mark> and killed another comedian is drawing attention to the dangers of tired truckers just as the industry and its allies in Congress are poised to roll...A New Jersey highway crash that severely injured <mark>Tracy Morgan</mark> and killed another comedian is drawing attention to the dangers of tired truckers just as the industry and its allies in Congress are poised to roll back safety...meta content = \"2014-06-10 05:59:44\" > Authorities: Trucker in <mark>Morgan</mark> crash hadn't slept A truck driver's lack of sleep is being blamed for the highway crash that injured <mark>Tracy Morgan</mark> and killed another comedian in New Jersey. A truck driver's lack of sleep is being blamed for the highway crash that injured <mark>Tracy Morgan</mark> and killed another comedian in New Jersey. meta content = \"2014-06-10 10:39:47\" > Startled carriage horse goes on Central Park run A startled carriage horse took a jaunt around Central Park without any passengers or its driver. A startled carriage horse took a jaunt around Central Park without any passengers or its driver. meta content = \"2014-06-10 09:29:48\" > Decade prison sentence for Utah's \"Mountain Man' Troy James Knapp lived for years in the wilderness of Utah, avoiding people and eating small game he shot with weapons stolen during cabin break-ins. Sometimes, he'd raid the pantry and rumple the bed sheets...Poet Maya Angelou remembered at memorial service Friends, family and famous admirers pay tribute to poet Maya Angelou at NC memorial service Friends, family and famous admirers pay tribute to poet Maya Angelou at NC memorial service D-Day anniversary events around US and abroad Events for the 70th anniversary of D-Day from around the US and abroad Events for the 70th anniversary of D-Day from around the US and abroad Obama honors WWII, 9/11 generations at Normandy Obama pays tribute to 9/11 generation while remembering WWII sacrifices 70 years after D-Day Obama pays tribute to 9/11 generation while remembering WWII sacrifices 70 years after D-Day Engineer's\" switch from hell' began GM recall woes How GM employees didn't view \"switch from hell' as a safety issue despite decade of clues No hero's welcome for Bergdahl: National uproar prompts cancellation of return home party Associated Press BAGHDAD (AP) - Islamic militants overran parts of Iraq's second-largest city of Mosul on Tuesday, driving security forces from their posts and seizing the provincial government headquarters, security bases and other key buildings. Prime Minister Nouri al-Maliki pressed parliament to declare a state of emergency. The fight for Mosul was a heavy defeat in Baghdad's battle against a widening insurgency by a breakaway al-Qaida group, the Islamic State of Iraq and the Levant, which has been trying - with some success - to seize territory both in Iraq and neighboring Syria. Earlier this year, the group captured another Iraqi city, Fallujah, in the west of the country, and government forces have been unable to take it back after months of fighting. The far larger Mosul is an even more strategic prize. The city and surrounding Ninevah province are a major export route for Iraqi oil and a gateway to Syria. Regaining Mosul poses a daunting challenge for al-Maliki. The city has a Sunni Muslim majority and many in the community are already deeply embittered against his Shiite-led government. During the nearly nine-year American presence in the country, Mosul was a major stronghold for al-Qaida and U.S. and Iraqi forces carried out repeated offensives there, regaining a semblance of control but never routing the insurgents entirely. Islamic militants and Iraqi troops have been fighting for days in Mosul. But Monday night and into early Tuesday, the government forces in the city appeared to collapse. Insurgents overran the Ninevah provincial government building in the city - a key symbol of state control - in the evening, and security forces fled many of their posts. The fighters stormed police stations, bases and prisons, capturing weapons and freeing prisoners. On Tuesday, Mosul residents said the militants appeared to be in control of several parts of the city, raising the black banners that are the emblem of the Islamic State. The residents spoke to The Associated Press by telephone on condition of anonymity, fearing for their safety. In a nationally televised press conference Tuesday, al-Maliki asked parliament to declare a state of emergency, acknowledging that militants had taken control of\" vital areas in Mosul. \"He said the public and government must unite\" to confront this vicious attack, which will spare no Iraqi. \"State TV said parliament would convene Thursday. Under the constitution, parliament can declare a 30-day state of emergency on a two-thirds vote by its members, granting the prime minister the necessary powers to run the country. Legal experts said that could include powers to impose curfews, restrict public movements and censor the media .\" What happened is a disaster by any standard, \"parliament speaker Osama al-Nujaifi - a Sunni from Mosul - said in a televised address .\" The presence of these terrorist groups in this vast province...threatens not just the security and the unity of Iraq, but the whole Middle East, \"he said. He said militants had seized helicopters at Mosul airport and captured weapons depots, and captured several villages and a military airbase further south in Salahuddin province, he said. Residents began fleeing Mosul - though the size of the flight was not yet clear. A government employee who lives about a mile from the provincial government building, Umm Karam, said she left with her family Tuesday morning .\" The situation is chaotic inside the city and there is nobody to help us, \"she said, speaking on condition she be identified by a nickname for fear of her safety .\" We are afraid...There is no police or army in Mosul. \"The assault in Mosul is also a sign of Iraq's reversals since American forces left the country in late 2011. Militants ramped their insurgency back up over the past two years. The Islamic State has presented itself as the Sunni community's champion against al-Maliki's Shiite-led government as the group fights on both sides of the border in what Iraqi officials have said is an attempt to carve out an enclave for itself in western Iraq and eastern Syria. The group, which was once al-Qaida's branch in Iraq, was thrown out of the terrorist network after it expanded its operations in Syria against the orders of al-Qaida leader Ayman al-Zawahri. It is considered one of the most ruthless rebel forces fighting to topple President Bashar Assad in Syria, where it has in seized a major city in the east and other territory. In Iraq, the group rose up earlier this year to take over Fallujah and parts of the nearby city of Ramadi, the capital of Anbar province. It has also been carrying out a campaign of bombings and other violence in Baghdad and other parts of the country. In the Mosul fighting, insurgents armed with machineguns and rocket-propelled grenade launchers stormed the provincial headquarters building late Monday, overpowering guards in a short firefight, according to Ali Mahmoud, the media official for Ninevah province. He confirmed accounts by Mosul residents that many of the police and army forces that had been stationed in the city had disappeared by Tuesday. Provincial governor Atheel al-Nujaifi, the parliament speaker's brother, was in a nearby guest house. He managed to escape the area and left the city, though he continues to monitor the situation, Mahmoud said. On Monday, the governor had urged residents to fend off the attackers .\" I call upon the men of Mosul to stand firm in their areas and to defend them against the strangers and to form public committees in their districts to help their people and to protect their areas, \"he said in a transcript of a speech posted online. ___ Schreck reported from Dubai, United Arab Emirates. ___ Follow Adam Schreck on Twitter at www.twitter.com/adamschreck Phone: 308-743-2494 News Fax: 308-743-2660", "articleID": "2014061021_00004222_W", "names": {"Tracy Morgan": ["Q14542", "Q27119857"]}}, {"date": "2014-06-11", "url": "http://www.latimes.com/sports/baseball/mlb/angels/la-sp-cespedes-throw-angels-20140612-story.html?track=rss", "content": "Oakland outfielder Yoenis Cespedes makes an incredible throw to the plate against the Angels on Tuesday. Oakland's Yoenis Cespedes armed and dangerous to Angels' runners / / Oakland's Yoenis Cespedes proves again he's got one of the best arms in the majors / / \"You don't see that kind of arm strength and accuracy from the foul pole. He just winged it' - Gary DiSarcina Collin Cowgill hits a walk-off home run in the 14th inning to lift Angels past Athletics. Angels Manager Mike Scioscia sounded as if he half-expected Yoenis Cespedes, the A's Paul Bunyan-like outfielder, to make a superhuman leap and pull it in .\" The way he was playing tonight, \"Scioscia said,\" it would not have shocked me if he caught it. \"During the second inning of a May 31 game at Oakland, Cespedes threw out two Angels at the plate. And on Tuesday he was at it again, unleashing a throw in the eighth inning that is being compared to some of baseball's best ever. With Howie Kendrick at first, Mike Trout's one-hop double toward the left-field line caromed off Cespedes' glove and into the corner. Angels third base coach Gary DiSarcina said he thought there might be a play at the plate but that Kendrick, who runs well, would score easily. Cespedes retrieved the ball near the foul pole and air-mailed a high-arcing throw of about 300 feet to catcher Derek Norris that nailed Kendrick at the plate and preserved a 1-1 tie .\" You don't see that kind of arm strength and accuracy from the foul pole, \"DiSarcina said .\" He just winged it. \"Said Scioscia:\" When the ball rolled into the corner, I thought Howie would score standing up. Cespedes picked the ball up and threw a guided missile that was right on the money. It was just an incredible throw from that distance, from that angle, everything. \"\"If you hadn't seen it,\" A's reliever <mark>Sean Doolittle</mark> said, \"you probably wouldn't have believed it .\" Which is why the Angels were holding their collective breath as Cespedes quickly retreated to the wall in tracking Cowgill's blast. Angels have confidence going into series against AL West-leading A's Darryl Sutter's decision to coach Kings changed franchise forever Cespedes' throw, Cowgill's homer highlight Angels' 14-inning win over A's Shelly Sterling to ask judge to expedite hearing on family trust <mark>Bob Welch</mark> dies at 57; faced <mark>Reggie Jackson</mark> in classic World Series duel Such a great Lakers team; it stings that <mark>Jackson</mark> and Fisher are Knicks Council members seek tighter state regulation of ride-sharing firms <mark>Bob Welch</mark> dies at 57; faced <mark>Reggie Jackson</mark> in classic World Series duel Pope Francis prays for peace with Israeli, Palestinian leaders GM fires 15 at top levels; report on ignition switches \"brutally tough' GM fires 15 at top levels; report on ignition switches\" brutally tough '", "articleID": "2014061205_00011080_W", "names": {"Bob Welch": ["Q2907864", "Q4934336", "Q494745"], "Reggie Jackson": ["Q2640578", "Q7308252", "Q959112"], "Sean Doolittle": ["Q7440950", "Q959451"]}}, {"date": "2014-06-12", "url": "http://therepublic.com/view/story/25f80e62a6d1412e9fbef344f945e71c/US--Missouri-Execution-Winfield", "content": "ST. LOUIS - A federal judge on Thursday granted a stay of execution for Missouri death row inmate <mark>John</mark> Winfield, less than a week before the convicted killer was scheduled to be put to death, citing concerns that a prison worker was intimidated into deciding against writing a clemency letter on Winfield's behalf. It wasn't immediately clear if the state planned to appeal the ruling by U.S. District Judge Catherine Perry in St. Louis. Messages seeking comment from the Missouri Attorney General's office and the Missouri Department of Corrections were not immediately returned. Winfield, 43, was scheduled to die at 12:01 a.m. Wednesday for killing two St. Louis County women in 1996. His execution would be among the first since late April, when the death of an Oklahoma inmate raised new concerns about lethal injection drugs and the secretive process many states use to obtain them. Clayton Lockett's vein collapsed on April 29 and he died 43 minutes later of a heart attack after he was injected with drugs obtained from a secret source. President Barack Obama called the botched execution \"deeply disturbing\" and called for a review of how the death penalty is applied in the United States. No one has been executed since. Marcus Wellons is scheduled to be put to death June 17 in Georgia, and three executions are scheduled for June 18: Winfield, Lewis Jordan in Pennsylvania and <mark>John Henry</mark> in Florida. Missouri is among several states that obtain execution drugs from unnamed compounding pharmacies. Other appeals by Winfield cited concerns that the unproven quality of the drug could cause pain and suffering for the inmate. But it was a different appeal that earned the stay from Perry. Court documents show that Terry Cole, the laundry director at the Potosi Correctional Center, which houses death row inmates in Missouri, told Winfield's attorneys he supported Winfield's clemency request and was willing to write a letter on Winfield's behalf. The judge wrote in her ruling that Cole was told by a prison administrator that there was no policy prohibiting such a letter, but workers must tell supervisors if they have contact with an inmate's attorney. But the judge said that on May 20, a corrections department investigator told Cole he was under investigation for alleged \"over-familiarity\" with Winfield. Cole eventually decided against writing the letter. Cole denied being threatened, but the judge said evidence indicated he feared for his job. \"The evidence presented to me shows that Winfield is likely to be able to prove at a later trial that prison officials took actions to intimidate Cole to keep him from providing support for Winfield's clemency petition,\" the judge wrote. Winfield attorney Joseph Luby said Cole supervised Winfield's work at the prison and spends eight hours a day with him. He said Cole has described Winfield as among the \"elite 1 percent of all inmates\" in terms of his behavior, and is an inmate who has served as a mentor for young prisoners. \"This 20-year corrections staff member was made to fear for his job when he wanted to tell the truth about Mr. Winfield's remarkable rehabilitation and the positive good he will continue to do if his life is spared,\" Luby said in a statement. In a separate case, a federal appeals court in St. Louis has set a September hearing regarding Russell Bucklew, whose late May execution was delayed by the U.S. Supreme Court hours before he was scheduled to die. Bucklew, 46, suffers from a rare congenital condition that causes weakened and malformed blood vessels as well as tumors in his nose and throat. The last-minute appeal cited those medical concerns as well as the secrecy surrounding the state's lethal injection drug and its supplier. The 8th U.S. Circuit Court of Appeals has scheduled a hearing on Bucklew's case for Sept. 9 All comments are moderated before posting. Your email address must be verified with Disqus in order for your comment to appear. Story copyright 2014 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Feedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to", "articleID": "2014061302_00023558_W", "names": {"John Henry": ["Q16193633", "Q3181733", "Q58744887", "Q6238703", "Q6238707", "Q6238712"]}}]