[{"date": "2014-06-13", "url": "http://news.smh.com.au/breaking-news-sport/postecoglou-not-weighing-in-on-ref-drama-20140613-3a0rx.html", "content": "Register Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Socceroos coach Ange Postecoglou refused to weigh in on the refereeing drama of the World Cup's opening game, despite it possibly becoming a big factor in Australia's clash with Chile on Friday. The showpiece kicked-off in controversy on Thursday after Japanese referee Yuichi Nishimura awarded a penalty that helped hosts Brazil start their campaign with a 3-1 win over Croatia in Sao Paulo. Nishimura ruled Fred had been brought down in the box however, replays showed there had been minimal contact. In the wake of the controversy there are suggestions referees may be gun shy when it comes to making similar decisions during the rest of the tournament. Advertisement Socceroos striker <mark>Tim Cahill</mark> said on Wednesday he was expecting there to be shirt-pulling and nudging by the Chileans in the box during their crucial first clash in Cuiaba on Friday (Saturday AEST). But Postecoglou wouldn't get drawn into the matter. \"All the teams have had a visit from the officials and they've told every country what they're looking for, so we're aware of what they're looking at,\" Postecoglou said. \"The referees have got their job, we've got ours so we won't sit there and try and preempt what may or may not happen .\" We've been told the things that are going to be highlighted at this World Cup and we'll deal with it accordingly. \"While the Chileans may look to nullify <mark>Cahill</mark>'s aerial advantage Postecoglou said he wasn't Australia's only threat .\" We've got somebody there who's very threatening and Timmy's looked very sharp. But I don't think that's our only avenue for goal, \"Postecoglou said .\" We're working on a few things and we certainly believe we can be a threat in other areas. \"But there's no doubt they're going to have to pay attention to Timmy because if he does get half a chance in the box, particularly in the air, he can head it in from any position. So we'll use that .\" Postecoglou emphasised there were no concerns over Mark Bresciano's fitness and indicated the veteran midfielder would start. The 34-year-old has been battling a back complaint in the lead up to the Socceroos' campaign opener. \"Absolutely (he's right to start),\" Postecoglou said. \"He's trained really well and more important he's recovered from training really well. So he's ready to go .\" I think he's really looking forward to it, he's got that steely look in his eye and he's ready to play. \"There's no doubt in my mind physically now he's right to go .\" Meanwhile, FIFA has ordered the Socceroos to change their strip for their opening match.", "articleID": "2014061311_00013403_W", "names": {"Tim Cahill": ["Q14946751", "Q15429744", "Q187238", "Q7803268"]}}, {"date": "2014-06-13", "url": "http://irishtimes.com/news/crime-and-law/courts/beautiful-game-of-democracy-suffers-as-government-embroiled-in-match-1.1830590", "content": "\"The Cup is ours! The ref is ours! Even the Croatian goal is ours!' People are left with no option but to beg or steal - isn't this what Dickens wrote about?\" Invented' process to appoint President of European Commission is damaging to democracy New accountability board and head of civil service could boost policy delivery Northern Ireland is the most successful country ever in World Cup finals Torture retold: how the \"Hooded Men' case has come back under the spotlight Seanad sketch: the Beautiful Game of democracy suffers as Government embroiled in match Fine Gael and Labour leaders yesterday showed they are quite prepared to win ugly if need be World Cup 2014, and before a ball was kicked or a beer cracked open we were already embroiled in a match-fixing scandal. And to think we once had such high hopes for the Beautiful Game. That was back in 2011, when starry-eyed Enda and high-minded Eamon took over as Ireland's management team and promised\" a democratic revolution \". They made a promise back then:\" This won't be politics as usual. \"It hasn't quite worked out that way. But at the end of the day, as our Coalition gaffers might say, a result is a result, Bill. Labour may spout about democracy being the beautiful game, but yesterday their leaders showed they are quite prepared to win ugly, if needs be. Following a Seanad vote at lunchtime, the Government got the result it wanted and retook control of their Fianna Fáil over the Banking Crisis. It wasn't a fair win. Even Fifa wouldn't get away with sticking two extra players onto a team in order to get their preferred selection through to the play-offs. But when Enda and Eamon realised at the end of normal time last week that they were not going to have a majority on this oh-so-independent committee, they readied up an extra period and changed the rules to suit themselves. Because, as Enda let slip to the Dáil on Tuesday, he has to be sure this non-partisan joint committee adopts the right terms of reference. Right for whom? The poor Taoiseach dreaded the havoc which two FFers on a committee of nine might cause. Particularly when independent thinkers How could Enda trust them to toe the Government line? Both men are quite right to be insulted by the Government's antics. Donnelly, disgusted by\" objectionable attempts to control what should be an independent inquiry \", is thinking of stepping down. And then there's those noted defenders of Fianna Fáil's role in the bank crisis, Sinn Féin, and their man on the committee, Pearse Doherty. So you see, Enda and Eamon had no choice but to nobble the Opposition .\" The Government has made a complete and utter balls of this; it's a mess, \"declared James Heffernan during an overwrought Order of Business in the Seanad. What made yesterday's carry-on all the more tawdry was the way in which Labour, in particular, sought to twist the facts around the circumstances leading to yesterday's match-fixing episode. Fianna Fáil was as surprised as everyone else when the sub-committee selecting the inquiry members voted their man onto the team. Denis O'Donovan, the FF Senator who chairs it, even offered an adjournment when three Government Senators - including their own nominee - didn't turn up for the vote. But this was refused. It appears there was a misplaced presumption that Banks write off over € 300m in three deals with <mark>Denis O'Brien</mark> People are left with no option but to beg or steal - isn't this what Dickens wrote about?\" The Cup is ours! The ref is ours! Even the Croatian goal is ours!' 13:00 Seanad sketch: the Beautiful Game of democracy suffers as Government embroiled in match 12:49 Ombudsman to investigate low levels of health complaints 12:07 Six men and one woman charged with murder of Dale Creighton 11:54 \"Religious ethos' victims need better redress mechanism - report 1 Banks write off over € 300m in three deals with <mark>Denis O'Brien</mark> 2 An Emergency wedding: war, rations and a 70-year love 3\" The Cup is ours! The ref is ours! Even the Croatian goal is ours!' 4 More questions than answers for Scolari and Brazil after opener Torture retold: how the \"Hooded Men' case has come back under the spotlight Opinion:\" Cover up is not containable. The past keeps pouring out' Policing the Garda in wake of Cooke report Problem with Cooke report is it has something for everyone", "articleID": "2014061319_00025163_W", "names": {"Denis O'Brien": ["Q18351161", "Q3022849", "Q5257430"]}}, {"date": "2014-06-14", "url": "http://suffolkfreepress.co.uk/fun-loving-woman-took-her-own-life-1-6119509", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online UPDATED WITH QUOTES: Lowestoft promotion-winning top scorer among AFC Sudbury signings Tragic accident was a \"complete fluke' Plan goes in for 80 new homes in village A Sudbury woman who suffered from depression was found hanged at her home, an inquest heard. The body of Mary Goddard, 62, was discovered in the garage of her house in Betty Cocker Grove on March 24. On Friday, an inquest in Bury St Edmunds was told that police quickly established there were no suspicious circumstances and the dead woman was identified by her sister. Suffolk coroner Dr <mark>Peter Dean</mark> said a police report on the incident showed that a note had been found at the scene. A post-mortem examination conducted by consultant pathologist Dr Karl Love at West Suffolk Hospital confirmed the cause of death as hanging with depression listed as a contributory factor. Dr <mark>Dean</mark> said that details provided by Mary Goddard's GP showed that she had been treated for the effects of depression. Recording a verdict that she took her own life, Dr <mark>Dean</mark> said:\" It does appear that, sadly, she understood and tragically intended the consequences of her actions. \"After the inquest, Mary Goddard's family paid tribute to her in a statement which said:\" Mary was truly a one-off. She was intelligent, generous and a reliable, caring friend to so many people. \"She was also passionate and fun-loving, with a fantastic sense of humour. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Contact us If you wish, you can contact us using any of the methods below. clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Suffolk Free Press provides news, events and sport features from the Sudbury area. For the best up to date information relating to Sudbury and the surrounding areas visit us at Suffolk Free Press regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend.", "articleID": "2014061416_00050738_W", "names": {"Peter Dean": ["Q7173604", "Q7173605", "Q7173607"]}}, {"date": "2014-06-16", "url": "http://www.kspr.com/sports/Seager-powers-Mariners-over-Rangers/21051914_26503544", "content": "Seager powers Mariners over Rangers Seager let his bat do the talking again on Sunday, when he went 4-for-4 with two doubles and three RBIs in the Mariners' 5-1 win over the Rangers. In 12 games against the Rangers this season, Seager is hitting .396 with 12 RBIs, five extra-base hits and a .646 slugging percentage. He is hitting .337 with a .667 slugging percentage against Texas over his four-year career. \"That's just one of those weird things,\" he said. \"That's baseball. I'd like to be able to do it against everybody .\" Seager drove in the Mariners' first three runs before scoring on left fielder Dustin Ackley's single in the eighth. Seattle starter Hisashi Iwakuma (5-3) allowed just one run off six hits over eight innings of work as the Mariners (34-35) snapped their five-game losing streak. In the hours before Sunday's game, Iwakuma didn't even think he'd be able to make the start. A sore neck hampered him throughout his pre-game stretch, so much so that a Seattle trainer had to be called in to loosen it up. \"I needed to pitch today,\" Iwakuma said after earning the win. \"I felt responsible, especially after (Seattle) losing five in a row, so I needed to go out there .\" Texas (34-35) got its lone run on a solo homer by <mark>Brad Snyder</mark> in the second inning, giving the Rangers a 1-0 lead. It was <mark>Snyder</mark>'s first career homer. \"I'm not going to lie: I've been working for that first big-league homer for a long time,\" said <mark>Snyder</mark>, the father of a young son whose own dad was watching the game on television back in Ohio. \"It is a big sigh of relief to get that first one out of the way. Especially on Father's Day, it's something I'll never forget .\" Seager, who already had a pair of singles, hit a two-out, two-run double in the fifth to put the Mariners ahead 2-1. He added another RBI double in the eighth for a 3-1 lead before scoring on Ackley's RBI single. Seattle scored its final run on shortstop <mark>Brad Miller</mark>'s sacrifice fly in the eighth. \"We certainly weren't trying to give him anything on the inside of the plate,\" Texas manager Ron Washington said, \"and when we did, he hit it .\" Seattle did most of its damage against Texas reliever <mark>Robbie Ross</mark> Jr., who gave up three runs off four hits before rookie Ben Rowen came on for him in the eighth. Rowen, making his major league debut, got three outs in the eighth to end Seattle's three-run inning. Texas starter Nick Martinez (1-4) went six innings, allowing two earned runs off nine hits. Seattle first baseman Logan Morrison did not finish the game after suffering a laceration to his forehead in the fifth inning. Morrison slammed his bat into a dugout wall in disgust after a popout with two runners on base and took a shard of the broken bat off his left eyebrow. He underwent five stitches after the game. \"I obviously acted like a 3-year-old,\" Morrison said after the game. \"I apologized to my teammates and to (manager Lloyd McClendon)....I'm embarrassed. No matter how bad I'm playing, I can't do that. You move on, and hopefully I can come back soon and start helping this team win games .\" NOTES: Mariners C <mark>John Buck</mark> made his first career appearance at first base in Sunday's sixth inning, when he replaced 1B Logan Morrison after an incident in the dugout. Morrison cut a gash over his left eye when the bat he slammed against a dugout wall cracked and bounced off his eyebrow. <mark>Buck</mark> played flawless defense for three innings before being lifted for a pinch runner in the bottom of the eighth ....Texas CF Leonys Martin was back in the leadoff spot Sunday, marking the second game in a row and the third time this season that he has batted first ....Mariners manager Lloyd McClendon said before Sunday's game that OF <mark>Michael Saunders</mark> (shoulder), 1B Justin Smoak (quad) and DH <mark>Corey Hart</mark> (hamstring) are getting closer to rehab assignments. All three players are currently on the 15-day disabled list, with <mark>Hart</mark> eligible to come off whenever he's healthy ....Rangers 3B Adrian Beltre was initially slated to serve as designated hitter Sunday, but about 30 minutes before the game he changed positions with Donnie Murphy ....McClendon said the team still has no timetable for calling up RHP Taijuan Walker, who threw six innings of no-hit ball before giving up his only hit allowed in a 6 2/3 - inning performance at Triple-A on Friday night. Walker struggled with shoulder problems throughout the spring and early part of the season but appears to be getting closer to a clean bill of health. Distributed by Internet Broadcasting and The Sports Xchange. This material may not be published, broadcast, rewritten or redistributed.", "articleID": "2014061607_00053649_W", "names": {"Brad Miller": ["Q15789609", "Q21288566", "Q21549841", "Q21553608", "Q386995", "Q4954126", "Q4954127", "Q4954129", "Q896845"], "Brad Snyder": ["Q2923437", "Q3643525", "Q4954275"], "Corey Hart": ["Q2997264", "Q709024"], "John Buck": ["Q14944060", "Q3181146", "Q51585769", "Q6223748"], "Michael Saunders": ["Q14492084", "Q25183901", "Q3091438"], "Robbie Ross": ["Q3077396", "Q7340988"]}}, {"date": "2014-06-16", "url": "http://thinkprogress.org/justice/2014/06/16/3449221/it-took-until-last-friday-for-an-alabama-court-to-strike-down-that-states-ban-on-gay-sex/", "content": "A law is still on the books in the state of Alabama which provides that a person is guilty of \"sexual misconduct\" if they engage in \"[a] ny act of sexual gratification between persons not married to each other involving the sex organs of one person and the mouth or anus of another\" - meaning that oral and anal sex of any kind is a crime under Alabama state law unless it is enjoyed with one's spouse. Because Alabama is also a marriage discrimination state, this law has obvious implications for gay people in that state. Indeed, the official commentary to the law explains that it was enacted to \"make all homosexual conduct criminal .\" \"Consent,\" under this Alabama sex ban, \"is no defense to a prosecution .\" handed down the state's first decision declaring this law unconstitutional. This isn't a particularly surprising decision. The Supreme Court held in its landmark 2003 opinion in Lawrence v. Texas that the Constitution forbids laws prohibiting consensual, private sexual activity between adults. If an Alabama court allowed the state's sex ban to stand, it would have done so in direct defiance of the Constitution and the Supreme Court of the United States. In fairness, the fact that it took nearly eleven years from the day Lawrence was decided for an Alabama court to strike down this law may be attributable to good behavior by the state's prosecutors (although that still Lawrence). Shortly after Lawrence, the state's attorney general conceded that the law is unconstitutional \"to the extent that it applies to private, legitimately consensual anal and oral sex between unmarried persons .\" So it is possible that the law has not been tested because prosecutors refrained from bringing unconstitutional prosecutions under this statute after Lawrence. Indeed, the defendant in the case that ultimately led the state appeals court to strike this law down was initially charged with \"sodomy in the first degree\" - a much more serious crime akin to rape. The jury, however, did not convict this defendant of a crime involving non-consensual sex. They convicted him of the lesser crime prohibiting consensual anal intercourse. This, the state appeals court held, is not allowed. Despite Lawrence, there is some risk that the state supreme court could try to reinstate the ban on oral and anal sex. The state's chief justice, <mark>Roy Moore</mark>, is compared a judge who struck down the military's anti-gay Don't Ask/Don' t Tell policy to al-Qaeda urging defiance of Supreme Court rulings. The bigger risk, however, will come if the United States Supreme Court adds just one more conservative justice. Although six justices agreed in Lawrence that the state of Texas' ban on gay sex was unconstitutional, one of those justices, Justice Sandra Day O'Connor, has since left the Court. Moreover, four of the Court's current members, Chief Justice <mark>John Roberts</mark> and Justices Antonin Scalia, Clarence Thomas and Samuel Alito, joined anti-gay opinions in the 2013 decision United States v. Windsor. If another conservative joins the Court, there may be enough votes to overrule U.S. Set To Execute First Inmate Since Bungled Oklahoma Execution", "articleID": "2014061620_00008254_W", "names": {"John Roberts": ["Q11153", "Q14949621", "Q16196671", "Q19325651", "Q20895752", "Q21542199", "Q2913257", "Q320178", "Q41805076", "Q44155502", "Q47430963", "Q54610143", "Q56187938", "Q56253587", "Q56597924", "Q6255164", "Q6255170", "Q6255174", "Q6255177", "Q6255184", "Q6255195", "Q6255202"]}}]