[{"articleID": "2008120118_00006590_W", "names": {"John Waters": ["Q314926", "Q363876", "Q6263167", "Q6263168"]}, "date": "2008-12-01", "url": "http://playbill.com/news/article/123828.html", "content": "you can't stop the beat: \"hairspray\" film sequel seeking screenwriters adam hetrick 01 dec 2008 \"hairspray\" film director-choreographer adam shankman recently revealed additional details about the movie musical sequel to entertainment weekly. original screenwriter <mark>john waters</mark>, according to shankman, has submitted an outline and ideas for the sequel, and writers are currently being sought for the film. the second film musical will follow zaftig dancer tracy turnblad and the corny collins gang into what shankman describes as the \"next era of music,\" the late 1960's. \"that period was superpolitical, it was a time of serious change,\" he explained. shankman also said that the character of link larkin, portrayed by zac efron in the film musical, will become steeped in the beatles-fueled british invasion. \"we're trying to track, in a comedic way, the historical elements,\" shankman commented. no casting been announced. as previously reported, shankman will direct and choreograph the \"hairspray\" sequel, which will be produced by neil meron and craig zadan and will feature new songs penned by newest discounts too much memory all my sons avenue q spring awakening white christmas speed the plow dust slava's snow show the funeralogues what's that smell my vaudeville man! also save on broadway's best a man for all seasons august: osage county kennedy center: graham and cunningham - two american profiles"}, {"articleID": "2014032900_00044580_W", "names": {"Eric Holder": ["Q312644", "Q3591180"], "Bill Freeman": ["Q17466026", "Q4909052"]}, "date": "2014-03-28", "url": "http://www.deseretnews.com/article/765650720/US-recognizes-Michigan-same-sex-couple-marriages.html", "content": "Innovative journalism of tomorrow still looking for funding today, study says Christian leaders defend \"Noah' in special featurette The secrets of building vs buying - 5 questions to ask yourself 5 ways to get ready for the spring golf season FILE - In this March 22, 2014 file photo Kat White, left, and Sue Walton hug after being married in a group ceremony by the Oakland County Clerk in Pontiac, Mich., after a federal judge has struck down Michigan's ban on gay marriage. Attorney General <mark>Eric Holder</mark> on Friday, March 28, 2014 extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. Attorney General <mark>Eric Holder</mark> on Friday extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. DETROIT - Attorney General <mark>Eric Holder</mark> on Friday extended federal recognition to the marriages of about 300 same-sex couples that took place in Michigan before a federal appeals court put those unions on hold. <mark>Holder</mark>'s action will enable the government to extend eligibility for federal benefits to the Michigan couples who married Saturday, which means they can file federal taxes jointly, get Social Security benefits for spouses and request legal immigration status for partners, among other benefits. The attorney general said the families should not be asked to endure uncertainty regarding their benefits while courts decide the issue of same-sex marriage in Michigan. <mark>Holder</mark> did the same thing in Utah, where more than 1,000 same-sex couples got married before the U.S. Supreme Court put those unions on hold in January after a federal judge overturned the conservative state's same-sex marriage ban in December. <mark>Holder</mark>'s decision came a week after U.S. District Judge Bernard Friedman struck down the gay marriage ban and two days after Michigan Gov. Rick Snyder called last weekend's marriages legal but said Michigan won't recognize them. Donna DeMarco and Lisa Ulrey were among the dozens of couples who married Saturday in Oakland County, northwest of Detroit. DeMarco's reaction to Friday's federal recognition:\" Cool. \"\"That's a major step,\" DeMarco said. \"The federal government is making great strides with recognizing same-sex marriage. It's time for Michigan to get out of its prehistoric age and get with the times. When you have a state government that's full of hate and straddles political lines and doesn't recognize that people are people, it affects a lot of people.\" DeMarco said she and Ulrey have not yet applied for joint Social Security benefits. \"I guess we can now,\" she said, adding that the couple will jointly file federal taxes next year. Oakland County was one of four that took the extraordinary step of granting licenses Saturday just hours before the 6th U.S. Circuit Court of Appeals in Cincinnati ordered a temporary halt. The stay was extended indefinitely Tuesday. Snyder, a Republican, acknowledged that same-sex couples \"had a legal marriage.\" But because of the court's stay, he added, the gay marriage ban has been restored. That closed the door, at least for now, to certain state benefits reserved solely for married couples. The American Civil Liberties Union has said more than 1,000 Michigan laws are tied to marriage. <mark>Bill Freeman</mark>, pastor of Harbor Unitarian Universalist Congregation church in western Michigan's Muskegon, responded to Friday's news with a loud \"Yeah!\" \"I think it's great. I think it's wonderful. I think it's glorious,\" he said. \"Even the governor of Michigan says the marriages are legal, but is not going to let them be enforceable in Michigan - and that's crazy.\" These guys ought to be able to get their Social Security cards and have the same benefits just like any other heterosexually married couple. \"<mark>Freeman</mark> officiated dozen of weddings Saturday after marriage licenses were issued by the Muskegon County clerk's office. Parenting from prison: The collateral damage of harsh mandatory sentences How raising kids within routines boosts social and emotional health"}, {"articleID": "2019102923_00077303_W", "names": {"Adrian Rodriguez": ["Q1240059", "Q4685319"], "Francis Drake": ["Q52636398", "Q5480773"], "Carlos Martinez": ["Q16864152", "Q2528896", "Q3660081", "Q5042342", "Q5042348", "Q5750873", "Q57524962", "Q9184701"]}, "date": "2019-10-29", "url": "http://www.marinij.com/2019/10/29/marin-hit-with-another-wave-of-pge-power-shutoffs/?fbclid=iwar35scskqohbyhpsbdtecovmz4lil-oqkdzokawd6rwm7pjvji2cjq-b8l0", "content": "By <mark>Adrian Rodriguez</mark> | arodriguez @ marinij.com | Marin Independent Journal PUBLISHED: October 29, 2019 at 8:26 am | UPDATED: October 29, 2019 at 4:12 pm Traffic lights in front of the Marin County Civic Center remained without power during a PSPS in San Rafael on Tuesday. (Alan Dep/Marin Independent Journal) People queue up in their car at the Shell station on Sir <mark>Francis Drake</mark> Boulevard in Greenbrae on Tuesday. After having power shutoff to almost all of Marin County, power to some areas was restored before another expected power shutoff Tuesday. (Alan Dep/Marin Independent Journal) Traffic lights on Fourth Street at A Street were dark during a PSPS in San Rafael on Sunday. (Alan Dep/Marin Independent Journal) Power lines stand along Highway 37 amid the smoky pall over Novato on Monday. (Alan Dep/Marin Independent Journal) A sign reading \"Sorry no ice cream - all melted\" hangs on the door of Celine's Sweets in Novato, Calif. during the power shutoff on Monday, Oct. 28, 2019. (Alan Dep/Marin Independent Journal) People have breakfast outside Grazie restaurant on Grant Avenue in Novato, Calif. during the power shutoff on Monday, Oct. 28, 2019. (Alan Dep/Marin Independent Journal) People charge devices at an outlet in front of Mollie Stone's market in Sausalito on Monday. From left are Sidney Tarlow, Carol Kavalaris, and Jacqueline Amrikhas of Sausalito, and Patty Alexander of Ross. (Alan Dep/Marin Independent Journal) Grazie cooks Alex Ruiz, left, and <mark>Carlos Martinez</mark> make breakfast for patrons in a candlelit kitchen in Novato on Monday. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Fourth Street in downtown San Rafael at sunset on Sunday. Most businesses remained closed as Marin entered its second day without power due to the Public Safety Power Shutoff. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Fourth Street in downtown San Rafael at sunset on Sunday. Most businesses remained closed as Marin entered its second day without power due to the Public Safety Power Shutoff. (Alan Dep/Marin Independent Journal) Shoppers, many with bags of ice, leave Costco in Novato on Monday. Costco was one of the Marin businesses that managed to stay open during the power shutoff affecting much of Northern California. (Alan Dep/Marin Independent Journal) A generator hums outside the Coa Chocolate shop on Bridgeway in Sausalito on Monday. It was one of the few shops open during the power shutoff on the part of Bridgeway popular with tourists. (Alan Dep/Marin Independent Journal) A long line of people line up to use the newly opened charging stations at San Rafael Community Center, 618 B St. in San Rafael during the PG & E public safety power shutdown. (Keri Brenner - Marin Independent Journal) Charol Morikawa of San Anselmo holds the fort at a charging tower in the San Anselmo Public Library Monday. (Keri Brenner/Marin Independent Journal) Jeanne Brophy of San Rafael is one of dozens charging phones and other appliances Sunday at San Anselmo Town Hall during the public safety power shutdown. (Keri Brenner/Marin Independent Journal) Tony Boyd, Mill Valley parks supervisor, takes a look at a downed tree on Seaver Drive in Mill Valley on Sunday. (Alan Dep/Marin Independent Journal) Tricia Henley of Santa Rosa sits with her pets and a friend's dog after getting the animals checked in with Marin Humane outside the Marin Exhibit Hall in San Rafael on Sunday. The building on the Marin County Fairgrounds has been set up as an evacuation center for evacuees from the Kincade fire near Healdsburg. (Alan Dep/Marin Independent Journal) Florina Antonio of Santa Rosa sits with her 7-year-old nephew Angel Osario and her cat Pancho as they wait to get checked in with Marin Humane outside a fire evacuation center at the Marin Exhibit Hall in San Rafael on Sunday. Antonio, who lives in the Coffey Park neighborhood, also evacuated here two years ago. (Alan Dep/Marin Independent Journal) Kincade fire evacuees wait in line to get animals checked in with Marin Humane outside the Marin Exhibit Hall in San Rafael on Sunday. The building on the Marin County Fairgrounds has been set up as an evacuation center for evacuees from the Kincade fire near Healdsburg. (Alan Dep/Marin Independent Journal) Motorists drive through a darkened Seventh Street and Grant Avenue intersection in downtown Novato on Saturday. (Alan Dep/Marin Independent Journal) The Shell gas station in Terra Linda was temporarily out of gas ahead of a planned power shutoff in San Rafael on Saturday. Lines were reported at many Marin gas stations after an alert warning of an impending power outage was sent. (Alan Dep/Marin Independent Journal) People line up at a Terra Linda gas station ahead of a planned power shutoff in San Rafael on Saturday. High fire danger prompted PG & E to shut off power to many customers in northern California. (Alan Dep/Marin Independent Journal) Temporary stop signs stand at DeLong and Reichert Avenues as traffic signal lights blink red in Novato on Saturday. A Public Safety Power Shutoff began to be implemented in Marin on Saturday afternoon. (Alan Dep/Marin Independent Journal) Show Caption of Expand Marin County has been crossed off the list for additional power shutoffs, at least for now, Pacific Gas & Electric announced Tuesday afternoon. For those Marin customers who still had no power from the weekend shutoff, the utility said it was continuing to make repairs. \"We've been able to find ways to minimize impact to Marin County customers by isolating areas of the grid,\" said PG & E spokeswoman Deanna Contreras. \"If you are currently out in Marin, we are working safely and as quickly as possible to restore power.\" \"With that being said, customers may experience other un-planned outages, not related to PSPS, due to weather impacts and normal service impacts,\" Contreras added, using the acronym for \"public safety power shutoff.\" As of about 3:45 p.m. Tuesday, nearly 61,000 meters remained without power in Marin, according to the county. That number was down from 78,000 earlier Tuesday. \"Marin County remains under a red flag warning because of extremely dry conditions and high winds forecast for the week,\" said Laine Hendricks, a spokeswoman for the county. \"In addition, the Kincade Fire is still actively burning in Sonoma County. Any wildfire activity in Marin or a change in the Kincade fire status could prompt additional protective outages.\" Lights began to flicker back on for some in Marin on Monday night. The utility re-energized approximately 40% of Marin customers, or about 50,000 of the 123,000 customers who were unplugged Saturday. Power was restored by 10 p.m. Monday for customers in parts of San Rafael, Greenbrae, Corte Madera and Larkspur, according to the Marin County Office of Emergency Services. In total, power was restored to 57%, or 556,400 customers, of the 970,000 affected systemwide before the new round of shutoffs hit, the utility said. A red-flag fire weather warning that is expected to bring high winds through Wednesday prompted another swell of shutoffs that began to sweep across the state at 5 a.m. Tuesday. The Marin County Board of Supervisors on Tuesday declared a countywide local general emergency to seek state and financial assistance for dealing with the power shutdowns. The supervisors also declared a local health emergency due to evacuees of the Kincade Fire overwhelming the Marin County healthcare system. Sonoma County officials evacuated Sutter Health and Kaiser Permanente hospitals causing a surge at Marin hospitals. Marin County Administrator Matthew Hymel said that 662 evacuees from Sonoma County were cared for in Marin, some of whom came from a skilled nursing facility and had special medical needs. The planned outages aim at preventing catastrophic wildfires that could be sparked by electrical equipment during extreme weather events. After the Oct. 9 power shutoffs there were 100 instances of damage and hazards on PG & E infrastructure. There have been seven weather-related instances of damage due to the Oct. 23 shutoffs and more than 50 as a result of the Oct. 26 shutoffs, the utility said. The red-flag warning went into effect at 8 a.m. Tuesday and was expected to last until 4 p.m. Wednesday. A wind advisory is also in effect from noon Tuesday through 11 a.m. Wednesday, with winds expected to range between 20 to 35 mph and peak gusts that could reach up to 65 mph, according to the National Weather Service. Meanwhile, the Kincade Fire grew to more than 75,000 acres Tuesday. Marin County Fire Battalion Chief Bret McTigue said 93 Marin firefighters have joined that North Bay firefight. The Governor's Office of Emergency Services and CalFire have added increased fire staffing in Marin County, including a strike team, a water tender, one fire dozer and additional dispatchers and chief officers. A quarter-acre vegetation near a residential Novato neighborhood was snuffed out early Tuesday. The fire was reported at 12:14 a.m. near the intersection of Center Road and Trish Drive, which is adjacent to 98-acre O’Hair Park. This is the second fire at this location this year, and the third fire there in the past two years, McTigue said. McTigue said thanks to the increased staffing and pre-positioned strike team the fire was quickly doused. \"It would have been a different story if that fire occurred tonight with the expected high winds.\" There were no injuries. The cause of the fire is under investigation, McTigue said. The risk for wildfire in Marin has also prompted officials to close several parks and open space lands across the county. The Marin Municipal Water District has closed Sky Oaks in the Mount Tamalpais Watershed, Natalie Coffin Green Park in Ross, and Leo Cronin Parking Lot at Lagunitas Creek. Mount Vision Road, Inverness and Stinson Beach parking lots were closed. All open burning and burn permits are suspended on public lands during the red-flag warning. In Mount Tamalpais State Park, roads north of Panoramic Highway are closed to motor vehicle traffic on Pantoll Road and Ridgecrest Boulevard. All park use permits north of Panoramic Highway are suspended, including filming. Sonoma-Marin Area Rail Transit canceled train service for a second day Tuesday due to the impacts that the power shutoffs have on traffic signals that cross train tracks. All Marin County public schools were scheduled to be closed Tuesday and Wednesday, according to the Marin County Office of Education. The Golden Gate Bridge District also announced service impacts to the Golden Gate Ferry and Golden Gate Transit. Updates on affected routes and departure times are available at goldengate.org. The Marin Municipal Water District and the North Marin Water District are running on backup generators and ask that customers conserve water during the outages The Bay Area Air Quality Management District has issued a third consecutive Spare the Air Alert for Wednesday, due to unhealthy, smoky air. The district issued similar alerts Monday and Tuesday. On Tuesday, sensors in Novato showed levels as high as 134 on the Air Quality Index, according to purpleair.com. Members of sensitive groups could experience health effects if they are exposed to AQI levels between 100 and 150 for 24 hours. Charging centers, community resource centers and the Red Cross evacuation center for fire evacuees were operational Tuesday. The evacuation center at The Marin Civic Center at 10 Avenue of the Flags in San Rafael is at capacity and is not accepting donations or volunteers. To help, contact the Center for Volunteer and Nonprofit Leadership at cvnl.org. Marin Humane has transferred adoption animals to shelters outside of the area and is offering shelter for evacuated pets and animals in need of urgent shelter. Its Novato shelter was without power from Saturday night to Monday night and is expected to lose power again Tuesday night. The nonprofit has been caring for more than 200 pets from fire evacuees free of charge at its Novato campus and at the Marin Civic Center evacuation center. Marin Humane asks that pet owners who need shelter for their animals provide veterinary records and medications or special food if possible. \"Our staff and volunteers are working tirelessly on behalf of these beloved pets and our Novato shelter is operating mostly without power,\" said Lisa Bloch, spokeswoman for Marin Humane. This story will be updated. Related Articles San Jose bans natural gas as mayor testifies to Congress about car emissions Dick Spotswood: Governor needs to appoint committee on future of PG & E Power shutdown: Do you have to pay PG & E, plus other questions answered PG & E kicks off next wave of power shutoffs Marin \"coming together' amid blackouts RESOURCES IN MARIN First responders urged residents to avoid calling 9-1-1 to keep the lines open for emergencies. For non-emergency information or questions about medical devices, community resource center locations or charging centers, text MARINSHUTOFF or MARINAPAGON (for Spanish speakers) to 898-211 or dial 2-1-1 Medically-vulnerable residents who need help during power shutoffs can call the new non-emergency hotline at 833-284-3473. Community resource centers: San Rafael: Al Boro Community Center: 50 Canal St. (Daily, 8 a.m. to 8 p.m.) Marin City/Sausalito: Marin City Health & Wellness Center, 630 <mark>Drake</mark> Ave. (Daily, 8 a.m. to 8 p.m.) Novato: Old Hamilton gym, 115 San Pablo Ave. (Daily, 8 a.m. to 8 p.m.) Charging stations: Bolinas: Bolinas Fire Department, 100 Mesa Road (9 a.m. to 5 p.m.) Corte Madera: Corte Madera Rec Center, 498 Tamalpais Drive (Monday-Thursday, 9 a.m. to 4 p.m.). Town Hall, 300 Tamalpais Drive (Monday-Thursday, 9 a.m. to 4 p.m.) Fairfax: Fairfax Police Station 114 Bolinas Road. (open 24 hours) Larkspur: Central Marin police station community room, 250 Doherty Drive (open 24 hours) Mill Valley: The Mill Valley Community Center, 180 Camino Alto (Monday-Friday, 8:30 a.m. to 5:30 p.m.) Novato: Margaret Todd Center 1560 Hill Road (Sunday, 9 a.m. to 7 p.m.) San Anselmo: San Anselmo library, 110 Tunstead (Monday-Wednesday 10 a.m. to 8 p.m., Thursday 10 a.m. to 5 p.m., Saturday and Sunday noon to 5 p.m.) San Rafael: San Rafael City Hall, 1400 Fifth Ave.; San Rafael Community Center, 618 B St. (8 a.m. to 8 p.m. for the duration of the shutoff) Sausalito: Sausalito City Hall, 420 Litho St. (7 a.m. to 9 p.m.) EV charging stations: San Rafael: (EV charging stations available as long as power is on) Marin Clean Energy, 1125 Tamalpais Avenue; Marin County Civic Center, 3501 Civic Center Drive. Marin officials are updating information on available resource centers and charging stations at marincounty.org/emergency. Sign up for email newsletters Subscribe Follow Us Facebook Twitter Instagram RSS"}, {"articleID": "2015120306_00345046_W", "names": {"Peter Grant": ["Q19882721", "Q20027846", "Q27486091", "Q3067879", "Q3376624", "Q7174337"]}, "date": "2015-12-03", "url": "http://au.news.yahoo.com/thewest/a/-/breaking/30262203/new-force-chief-ready-to-roll-up-sleeves/", "content": "New Force chief ready to roll up sleeves New Western Force chairman Tony Howarth says there is no room for complacency as the club rebuilds from the disastrous 2015 wooden spoon Super Rugby season. Coaches and players have plenty of work ahead and Howarth knows there are financial challenges to face in the RugbyWA boadroom. He is confident of returning a healthier balance sheet after posting three consecutive losses but warns there is no room for mediocrity on or off the field. \"The financial challenge is a strong one. There have been a couple of tough years,\" Howarth said. \"We want to make sure that we have a strong, healthy, financially viable club and we can't afford to be complacent.\" There are not a lot of discretionary funds about but with the renegotiation of the media rights (yet to be announced by the ARU), we are in a much better spot financially. \"A lot of money gets taken out of the town in terms of the two football teams (West Coast and Fremantle) and we want to make sure rugby has its fair share.\" At board level we can't afford to be complacent. We are always having to find ways of doing more with less without compromising the on field quality. \"For the third consecutive season the side will start without a major sponsor but naming rights for individual jumpers have again been sold.\" We would love to get a major sponsor. We're working with some people but in this environment major sponsors do not come easily, \"Howarth said.\" Rugby is a strong offer for sponsorship. It's a global game, it's a great product. It's just a little bit tougher in the west. \"Membership and season ticket sales are tracking towards last season's 16,230 but Howarth is realistic. He knows they are unlikely to ever again reach the heady first season when they signed up 21,000 members and averaged 28,000 a game. Last year's average gate was 11,000.\" The Force had such a strong momentum when it first set up, then we had difficulties with the (Patersons) stadium and our competitiveness, \"he said.\" The best way to make sure we have a competitive Western Force is to have a really strong support base. That's the challenge for us. \"There is a feeling of optimism, but we have to play an entertaining style, one that people feel proud of and are emotionally involved in.\" We are absolutely committed to turning last season around but we cannot afford to be complacent in the style of rugby that we play. \"That's our focus on the field. We want to score tries.\" Howarth is happy with the off-season recruitment that includes former Springbok <mark>Peter Grant</mark>, Wallaby Ben Tapuai, and fly-half Jono Lance. \"We are pretty happy with recruitment. We have a stronger side than last year, a side that can score,\" he said. \"We've always had a great forward back but now we've got some really good inside back combinations and some capacity to score tries out wide.\" Share Share New Force chief ready to roll up sleeves - The West Australian Email Facebook Twitter Pinterest Tumblr"}, {"articleID": "2019102811_00114122_W", "names": {"Robert Smith": ["Q16292920", "Q1632228", "Q19664222", "Q2158832", "Q23883691", "Q24006774", "Q25189961", "Q25189963", "Q27835064", "Q28803422", "Q29643608", "Q33996143", "Q3938426", "Q47127399", "Q491252", "Q54321482", "Q56528034", "Q59196504", "Q7348241", "Q7349869", "Q7349871", "Q7349872", "Q7349876", "Q7349878", "Q7349879", "Q7349881", "Q7349884", "Q7349886", "Q7349887", "Q7349888", "Q7349890"], "Nick Cave": ["Q192668", "Q24218"]}, "date": "2019-10-28", "url": "https://www.uncut.co.uk/news/little-feat-guitarist-paul-barrere-died-aged-71-112594", "content": "Little Feat guitarist Paul Barrere has died, aged 71. He passed away at UCLA Hospital on Saturday morning (October 26), according to a statement on the Little Feat website. A member of the band since the early 70s, he was forced to sit out their current tour due to side effects from his ongoing treatment for liver disease. Order the latest issue of Uncut online and have it sent to your home! Barrere initially auditioned for Little Feat as a bassist, before eventually joining the band on guitar (and occasional lead vocals) prior to the recording of 1973's Dixie Chicken. His songwriting credits for the band included \"Skin It Back\" , \"Hi Roller\" and \"Down On The Farm\" . Barrere was instrumental in putting the band back together in the 80s, following the death of original frontman Lowell George. \"As the song he sang so many times put it, he was always\" Willin', \"but it was not meant to be,\" said the band statement. \"Paul, sail on to the next place in your journey with our abiding love for a life always dedicated to the muse and the music. We are grateful for the time we have shared.\" Fellow musicians paid tribute on social media. Bonnie Raitt called Barrere, \"A brilliant guitarist, singer and songwriter - a cornerstone of one of the greatest bands of all time.\" \"Rest In Peace my friend,\" wrote Nils Lofgren. \"You've blessed us all with a lifetime of inspired, soulful music.\" (1/2) Oh my God. I just heard about the passing of another dear friend, Little Feat's Paul Barrere. A brilliant guitarist, singer and songwriter--a cornerstone of one of the greatest bands of all time. #PaulBarrere pic.twitter.com/vS4rqXhD4J--Bonnie Raitt (@ TheBonnieRaitt) October 27, 2019 Rest In Peace my friend. You've Blessed us all with a lifetime of inspired, soulful music. #Paul Barrere pic.twitter.com/5jHJxO9ge0--Nils Lofgren (@ nilslofgren) October 27, 2019 Subscribe to Uncut and make huge savings on the cover price--find out by clicking here! Like us on Facebook or follow us on Twitter to keep up to date with the latest news from Uncut. The December 2019 issue of Uncut is on sale from October 17, and available to order online now--with Bob Dylan on the cover and an exclusive unreleased Dylan track on our free CD. Elsewhere in the issue, there's <mark>Robert Smith</mark>, Bonnie \"Prince' Billy, Pink Floyd, <mark>Nick Cave</mark> & The Bad Seeds, Prince, Joni Mitchell, Bruce Springsteen, Jeff Lynne, Booker T, Tindersticks and much more. Uncut: the past, present and future of great music."}, {"articleID": "2015041209_00048920_W", "names": {"Stephen Harper": ["Q206", "Q7609425"]}, "date": "2015-04-12", "url": "http://www.castanet.net/news/Business/137334/Harper-to-engage-on-Cuba", "content": "Canadian Prime Minister <mark>Stephen Harper</mark> (and U.S. President Barack Obama chat at the Summit of the Americas. <mark>Stephen Harper</mark> emerged from a meeting with Cuba's Raul Castro with a call for more engagement with the island nation, signalling a change of heart for the prime minister when it comes to the communist regime. The leaders' conversation Saturday at the Summit of the Americas in Panama followed a brief greeting and handshake at a photo-op. \"I have become convinced that a different approach is appropriate at this point in time,\" <mark>Harper</mark> told reporters in Panama City shortly after meeting Castro. \"We're at a point where an engagement is more likely to lead us to where want to go than continued isolation.\" It's a different approach than the one <mark>Harper</mark> has taken with Cuba in the past. <mark>Harper</mark>, who has had strong words about the communist regime, initially opposed inviting Cuba to this year's summit because it was not a democracy. He has also been a vocal critic of communism. He revealed that his views changed, at least in part, after the United States began contemplating a different approach to its relationship with Cuba. <mark>Harper</mark>, however, was careful Saturday to point out that more work is necessary on the Caribbean island. \"We are not by any means unconcerned about the lack of democratic space and human-rights abuses in Cuba,\" he told reporters. \"We've always been clear on that and we will continue to be clear on that.\" During the their conversation, <mark>Harper</mark> said he and Castro discussed the long-running relationship between their countries - on political, tourism and commercial levels. The prime minister, who also noted how Canada helped facilitate the December deal between the U.S. and Cuba to work toward normalizing their diplomatic relations, gave little additional information about his own chat with Castro or how long it lasted. \"We had a good and long discussion with the president,\" said <mark>Harper</mark>, who had never met Castro. The Castro-Harper discussion was overshadowed by the Cuban leader's meeting earlier in the day with U.S. President Barack Obama. It was the first formal, face-to-face talks between American and Cuban leaders in more than half a century. Obama and Castro sat side by side in a conference room in a bid to inject fresh momentum into their effort to restore diplomatic ties. Castro told Obama he was ready discuss sensitive issues including human rights and freedom of the press, saying, \"everything can be on the table.\" But he also cautioned that the two countries have \"agreed to disagree.\" For years, the Cuba issue overtook discussions at the Summit of the Americas, which it had never been invited to since the gatherings first started in 1994. They are held every three years. In 2012, Canada and the U.S. were the only two member countries to oppose Cuba's invitation to this year's summit. They faced criticism from other hemispheric leaders for leaving the Cubans out. On Saturday, <mark>Harper</mark> reminded his counterparts in a speech how Canada's played a role facilitating negotiations between the U.S. and Cuba by providing venues for their high-level talks. \"We also are pleased that all the countries of the hemisphere are represented here,\" <mark>Harper</mark> said in his five-minute address to the summit. The remarks mark a shift for <mark>Harper</mark>, a man who has railed against communism. Last year, <mark>Harper</mark> called communism a \"poisonous ideology\" with \"ruthless practices that slowly bled into countries around the world, on almost every continent.\" He made the comments in a speech at a Toronto fundraiser for a controversial victims of communism memorial that will be erected in Ottawa. On Saturday, <mark>Harper</mark>'s address was mostly dedicated to outlining his government's goals for the hemisphere, including the promotion of human rights, security and prosperity. The prime minister told fellow political leaders that democracy is growing in the Americas as never before. <mark>Harper</mark> insisted, however, that more effort was needed to build on the progress. He also used the summit to build bridges â € \"or mend fences â €\" with regional leaders in one-on-one talks. On Saturday, <mark>Harper</mark> met with Obama, who has a strained relationship with Ottawa following his opposition to the Keystone XL pipeline. Canada has also had a chillier friendship with Mexico ever since it tightened visa requirements for Mexican visitors. Comments on this story are pre-moderated and approval times may vary. Before they appear, comments are reviewed by moderators to ensure they meet our Personal Tax Return Filings Many people assume that they don't have to file a personal tax return because they don't have a balance owing. This isn't the best rule of thumb to follow...Photo: Thinkstock.com It's a generally accepted notion that acquiring a new customer is more expensive than retaining an existing customer. Add to that fact a sluggish economy where businesses a.. ."}, {"articleID": "2018121109_00106056_W", "names": {"Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2018-12-11", "url": "http://www.gamereactor.eu/blogs/mike", "content": "Board games on GR Written by <mark>Mike Holmes</mark> on the 13th of September 2017 at 12:39 We love games here at Gamereactor (the clue's in the name, right?) and when it comes to the games we play we're looking to expand our scope a little. From here on in we're going to start writing about our experiences with board games too, specifically ones that have some sort of direct link to video games. If that goes down well with you lot, maybe we think about widening the range of games we talk about. Let us know what you think in the comments below. How Long is Too Short? Written by <mark>Mike Holmes</mark> on the 1st of August 2016 at 08:55 The recent news that No Man's Sky can apparently be completed in around 30 hours, and the reaction that this news has brought with it, certainly has caught my attention, and it has me pondering the question: what is the ideal length for a video game? As someone who plays them in less than ideal circumstances (having to rush through them for review) a complete but somewhat succinct experience can be quite a relief, but that doesn't mean that every now and then I don't like an extended love affair with a game (Crusader Kings 2, Destiny or The Witcher 3 in my case). 30 hours, with the option to get distracted and expand on that if required, seems like a perfectly reasonable period of time to play a game like No Man's Sky, but I also appreciate why some people might be disappointed that the scale of the galaxy built by Hello Games doesn't quite tally with the (prospective) length of the game. In this case we'll have to wait and see what the future brings, but it's still an interesting question and the answer will change depending on who you ask. As someone who loved the super-short Thirty Flights of Loving just as much as the timesink that is Destiny, I'm going to sit on the fence on this one and say \"how long is a piece of string?\" Who Won E3? Written by <mark>Mike Holmes</mark> on the 15th of June 2016 at 18:36 Two very different companies pitched us two very different shows during E3 this year. Sony and Microsoft, not for the first time, went head to head in unveiling their latest wares. Microsoft had an ace up their collective sleeve, but Sony were able to show a line-up of games that had the audience purring. Let's get it out of the way now and say there wasn't a clear winner, although if I was pushed into making a call, I might say that Sony edged it. The why is perhaps a little more complicated, and were it not for leaks and (potential) absentees, I might well have been singing a very different song. Let's face it, we knew practically everything about the Microsoft presser before it even happened. You can't help but think that maybe Sony knew too, and that their conference would have been ten minutes longer and would have included a hardware reveal of their own. Perhaps the power of Scorpio forced the PlayStation team to hold fire on their own announcement because they knew they were bested. Speculation on our part, fuelled by whispers, but certainly plausible. Either way, it was good work across the board, with Microsoft continuing the process of rebuilding their reputation, and Sony continuing to deliver great software for their all-conquering console. And while nobody is talking about Nintendo in the same breath as its rivals this time around, it's worth noting that a study shows that The Legend of Zelda: Breath of the Wild was the most talked about game at the show (so far). That's got to count for something. Finally, let's also shout out for the PC crowd (that includes me), who got another PC Gaming show, as well as a bunch of cross-buy and cross-platform announcements during Microsoft's event. It's a good time to do your gaming on PC. On top of all that, if you throw in a bunch of games on show at EA Play, Bethesda and Ubisoft, and everything else in between, and you've got a solid E3 all round. It might not have the stellar game that has everyone buzzing (perhaps, possibly, with the exception of Zelda), but we've still seen some big reveals and a few fascinating trailers. Covering it from here in the UK has been largely enjoyable (chaotic, but enjoyable) and, from where I'm sitting, nearly everyone has come out this year's show a bit better off. Parental Guidance Written by <mark>Mike Holmes</mark> on the 17th of April 2016 at 08:19 As the father of two young boys, games are on my radar in one more than one sense. Not only do I have my own gaming habits to consider, but I have to think about the games that my sons consume too. Given my profession, there's no getting away from this, and because I play and write about games all the time, it's only natural that the boys find them fascinating. Monkey see, monkey do. Given what I do for a living, as you might expect, other parents often talk to me about what they let their children play, and while I'll either agree or disagree with what they consider age appropriate, one thing is constant throughout each discussion, and that's a shared appreciation that kids today have it so good when it comes to games. They really are spoiled for choice. Whether we're talking about cleverly made tablet titles that take advantage of the intuitive touch screen controls (something that we now take for granted), or educational offerings on the desktop PC that test the grey matter, or even console games that develop coordination and reflexes (for example, my kids, like so many others, are partial to a bit of Lego-based gaming); there's so many great games for the younger generation to enjoy. Of course there's some total shite out there too, and with kids being easy to please and an impressionable audience, it's often parents like yours truly that are left to pick up the tab for questionable pieces of programming. However, once you ignore all the rubbish and start to seek out real quality, it becomes abundantly clear that there's plenty of decent stuff for them to play. The starting point for this blog came yesterday, Saturday, walking through town on the way to the local swimming pool, bumping into a friend and fellow parent, and talking about Disney Infinity and how impressed he was with the depth of the offering. It got me thinking about the difference in quality between what I played as a youngster, and what my children have to enjoy nowadays. Of course, back then, a lot more games were universal in terms of age appeal, and as a whole the game-consuming audience was less mature and it was less socially acceptable (remember when it wasn't really normal to play games?), but I still think it's fair to say that youngsters have never been served better than they are today. My kids enjoy Lego games (we're currently playing Lego Jurassic World at the moment), Steamworld Dig is another favourite, we're all partial to classic Sonic, and of course Nintendo makes great family friendly titles that we enjoy playing together. We've not got into full-on Minecraft mode just yet, but it's edging ever closer; I fear that addiction is just around the corner. There's a nice range of titles for the boys to choose from, and I know other parents think the same, even if we don't always agree on when it's suitable to let the little ones start playing games made for a slightly older audience. One thing we all agree on, though, is the online element, and I'm not alone in keeping my kids away from the interwebs and limiting (almost completely) their online interactions. Because while we can trust our kids to play nicely - most of the time - the same can't be said of everyone else, and I think it prudent parenting to be extremely careful about what, and who, they're exposed too. To sum up this rambling blog post: kids have never had it better. But like most parents, I think it pays to limit the time they can spend playing, as well as being extremely careful about what/who they're exposed to. There's a world of amazing digital experiences out there waiting to be discovered and enjoyed, but as a parent I personally think that we have a responsibility to our children, to expose them to certain games when they're ready for them, which isn't always when they might want to play them. My Private Army Written by <mark>Mike Holmes</mark> on the 4th of February 2016 at 09:46 Xcom 2 is here tomorrow, and I for one am looking forward to personalising my cadre of elite marines and taking on the alien scum. One of my favourite things about Xcom, and the reason I love the series so much, is the bond you form with your soldiers, this because of the permadeath feature, but equally because of the range of customisation options on offer. In particular, being able to name your soldiers makes such a difference. But who to name them after? My last play of the original game (well, the reboot) saw me name my soldiers after popular sci-fi movie characters, which worked better than my first play, where I named them after my friends. Watching your buddies die is less fun. So which way will I go this time? Name them after the players at my beloved Arsenal FC? No, they'd just bottle it and finish in fourth. Name them after musicians? I'd be worried they'd all check out aged 27. What about video game characters? That might work...Hmmmm. Decisions, decisions. What I don't want to do is spend too many hours of my initial play through customising my troopers, because you know, there's aliens to kill! Regardless of what I call the troopers in my private army, I can't wait to see how this next game plays out. Expect my thoughts on Xcom 2 in the nearish future."}, {"articleID": "2016051304_00120832_W", "names": {"Peter Cook": ["Q1249215", "Q18200544", "Q22996261", "Q30603187", "Q7173371", "Q7173373"]}, "date": "2016-05-13", "url": "http://www.post-gazette.com/news/world/2016/05/13/US-establishes-Libyan-outposts-with-eye-toward-offensive-against-Islamic-State/stories/201605130135", "content": "U.S. establishes Libyan outposts with eye toward offensive against Islamic State May 13, 2016 12:00 AM Abdullah Doma/AFP/Getty Images Col. Ahmed al-Masmari, spokesperson for the Libyan Armed Forces, gives a press conference in the eastern Libyan city of Benghazi on Wednesday. By Missy Ryan / The Washington Post American Special Operations troops have been stationed at two outposts in eastern and western Libya since late 2015, tasked with lining up local partners in advance of a possible offensive against the Islamic State group, U.S. officials said. Two teams totaling fewer than 25 troops are operating from around the cities of Misrata and Benghazi to identify potential allies among local armed factions and gather intelligence on threats, according to the officials, who spoke on the condition of anonymity. The insertion of a tiny group of U.S. personnel into a country rife with militant threats was viewed as reflecting the Obama administration's worries about IS's powerful Libyan branch and the widespread expectations of an expanded campaign against it. For months, the Pentagon has been developing plans for potential action against the group, which has at least several thousand fighters in the coastal city of Sirte and other areas. And the U.S. personnel, whose ongoing presence had not been previously reported, is a seen as sign of the acceleration toward another military campaign in Libya. The mission is also an illustration of President Barack Obama's reliance on elite units to advance counterterrorism goals in low-visibility operations. The activities of the American \"contact teams,\" as they are known, take place in parallel to those of elite allied forces from France and other European nations in the same areas, U.S. and Libyan officials said. Officials hope the special operators will ultimately have an outsize impact on the effectiveness of local forces. Special Operations forces in Syria, for instance, have been trying to guide opposition operations and help them capitalize on foreign air power as they advance on IS. \"These types of activities can be the difference between success and failure in what the administration refers to as areas outside of active hostilities,\" said William Wechsler, who was a senior Pentagon official overseeing Special Operations activities until last year. \"You're mapping local networks, both friendly and unfriendly.\" The U.S. troops, who began making visits to Libya last spring and established their twin outposts six months later, have been cultivating relationships among forces that are mobilizing for a possible assault against IS in its Sirte stronghold. Pentagon spokesman <mark>Peter Cook</mark> declined to provide specific information about the U.S. assessment teams. But he said that military personnel had been meeting periodically with a variety of Libyans \"in an effort to help them re-establish a safe and secure environment.\" The effort is part of a larger Obama administration strategy to bring Libya's feuding factions together behind a fragile new unity government, which officials believe is best positioned to combat IS. In Libya, a key element of the mission is identifying which factions will align themselves with the unity government. Since a civil conflict erupted in 2014, Libya has been dominated by two rival governments in the country's east and west. The Obama administration and its European allies are hoping the unity government, installed after U.N.-brokered peace talks, can end Libya's partition, which opened the door to extremists and plunged the oil-rich country into economic crisis. The troops also are assessing security conditions so that, if a broader mission takes place, the United States can move in additional personnel more safely. \"How do you avoid Libya becoming like Syria?\" said Paul Scharre, a former Army Ranger and Defense Department official who is now at the Center for a New American Security. \"This is one of the tools in your toolbox to stave that off.\" While IS is far smaller in Libya than its parent organization in Iraq and Syria, the group has used similar tactics to enforce its brutal version of Islam, including mass executions, and has launched attacks across the North African nation. \"We're obviously watching the threats very closely,\" a senior administration official said, also speaking on the condition of anonymity. If the White House does authorize a broader campaign in Libya, it is expected to be on a smaller scale than operations in Iraq and Syria. Apart from the ongoing air campaign against IS, the U.S. now has more than 5,000 troops on the ground in Iraq, and Mr. Obama recently expanded the Special Operations force in Syria. The U.S. has launched two airstrikes against IS targets in Libya since late 2015, but Pentagon officials have said they have identified dozens of other targets that might be hit if a more sustained operation takes place. An expanded mission in Libya will be forced to grapple with the same internal divisions that have undermined other foreign attempts to foster stability since 2011. In an illustration of those tribal and political fissures, the two forces preparing to advance on IS--militia forces loyal to Misrata and army troops under Gen. Khalifa Hifter--have clashed with each other. The Misratan forces recognize the unity government in Tripoli; those loyal to Gen. Hifter do not. Likewise, three separate factions have established separate command centers to oversee an offensive against IS in Sirte, including Gen. Hifter; the unity government; and an alternate prime minister in Tripoli, who continues to assert his authority. American officials fear that uncoordinated offensives will only afford IS an opportunity to grow stronger. At the same time, some officials privately complain that foreign support for eastern forces loyal to Gen. Hifter--including from U.S. allies France and Egypt--makes consolidation of the unity government's power more difficult. \"We have been working with our allies to urge focus on [IS] and not fueling rivalries across the country,\" a senior U.S. official said. Local factions are being asked to do the same, and \"as the [IS] threat becomes clearer and clearer, it becomes easier to find Libyans who are prepared to do that.\" The French Embassy in Washington, D.C., declined to comment on French military activity in Libya. \"Our priority in Libya is full support to the government and not support to a particular force,\" a French diplomatic official said. A spokeswoman for the Egyptian Embassy in Washington did not immediately respond to a request for comment. Military officials have sought to keep the ongoing presence of U.S. personnel quiet, in part because of Libyans' sensitivities about foreign troops and also because of the vulnerability of small teams operating in a country gripped by lawlessness. Benghazi was the site of the 2012 attacks that killed four Americans, including the U.S. ambassador. Last December, a visit by one team of special operators to far western Libya was made public when local militia forces took photos of the Americans with their assault rifles, grenade launchers and GPS devices. The U.S. personnel promptly departed. The Pentagon is seeking to enhance protection of its advance force from the sky. This year, Italy granted the U.S. permission to use Italian airfields to launch armed drone flights over Libya for defensive purposes. Mr. Wechsler said the Pentagon had been willing to accept the dangers faced by such teams because of the value they provided to subsequent military operations. \"When the military is dropping Hellfires from a drone, there is by design a zero percent chance of an American getting killed,\" Wechlser said. \"But when you're trying to do the important work to understand the human terrain and build up surrogates, the risk...can never be mitigated down to zero.\" "}, {"articleID": "2017071711_00349264_W", "names": {"King Kong": ["Q2171232", "Q22278621", "Q6411824"], "Peter Jackson": ["Q25521960", "Q3376667", "Q39073400", "Q4160117", "Q4465", "Q52743056", "Q54556363", "Q7174914", "Q7174916", "Q7174918", "Q7174919", "Q7174920", "Q7174922", "Q7174923"]}, "date": "2017-07-17", "url": "https://www.washingtonpost.com/news/comic-riffs/wp/2017/07/17/as-war-for-the-planet-of-the-apes-soars-is-andy-serkis-our-most-underrated-box-office-draw/", "content": "Comic Riffs Perspective Perspective Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events As \"War for the Planet of the Apes' soars, is Andy Serkis our most underrated box-office draw? The inside track on Washington politics. Be the first to know about new stories from PowerPost. Sign up to follow, and we'll e-mail you free updates as they're published. You'll receive free e-mail news updates each time a new story is published. You're all set! By Michael Cavna By Michael Cavna July 17 at 7:00 AM Follow @ comicriffs Andy Serkis, Terry Notary and Michael Adamthwaite in\" War for the Planet of the Apes. \"(Twentieth Century Fox) AS FOX's\" War for the Planet of the Apes \"scales a $102.5 million global opening, the question also rises: Is Andy Serkis, well-known as a motion-capture actor, still underrated as a reliable presence in so many box-office powerhouses? Consider: Serkis's films have grossed more than $1.8 billion simply when he's playing a simian--including his current\" Apes \"trilogy and 2005's\" <mark>King Kong</mark>. \"Throw in the London-born actor's presence in such franchises as Avengers (\"Age of Ultron\" ), Star Wars (\"The Force Awakens\" ) and the Lord of the Ring/Hobbit films, and Serkis's blockbuster movies have grossed more than $8 billion worldwide. And once you add his next two big films--December's \"Star Wars: The Last Jedi\" and next year's \"Black Panther\" --Serkis could become a $10 billion man in terms of what his franchise films have grossed worldwide. Actor Andy Serkis appears on the red carpet last week for a New York screening of \"War for the Planet of the Apes.\" (Bria Webb/Reuters) It helps enormously, of course, that the actor who got his start three decades ago on British TV comedies has become a go-to performer for CG-heavy roles, including motion capture. Ever since his iconic role as Gollum for <mark>Peter Jackson</mark>'s Tolkien movies, Serkis--suddenly a precious commodity--has been able to go where the money is. But most actors are fortunate to have just a single character that becomes fixed in the pop-culture firmament. Besides Gollum, filmgoers around the world now know such Serkis characters as Caesar (the \"Apes\" trilogy) and Supreme Leader Snoke (Star Wars), plus he will reprise his Marvel character Ulysses Klaue (aka Klaw) in February's \"Black Panther.\" Many fans are hopeful that he will return as Captain Haddock for a \"Tintin\" sequel. Then there is the matter of the Serkis-directed \"Jungle Book,\" a live-action adaptation with an A-list cast that's not to be confused with Disney's recent behemoth of a hit. If Serkis (who does double duty in his film as Baloo) can turn even a crowded-market \"Jungle Book\" into a hit next year, then his bag of cinematic mo-cap magic will seem bottomless. Till then, the Golden Globe-nominated actor should remain swimming in box-office success. The well-reviewed \"War for the Planet of the Apes\" grossed $56.5 million in its domestic debut to hold off Sony's \"Spider-Man: Homecoming\" ($45.2 million), which plummeted 61 percent in its second weekend. The current \"Apes\" trilogy has grossed nearly $1.3 billion worldwide--and come December, Serkis's \"Last Jedi\" should begin a $2 billion-plus launch. Now, if only the Academy could appropriately appreciate Serkis with an Oscar nod to honor inspired performance beneath the painted pixel. entertainment"}, {"articleID": "2019062102_00034742_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-21", "url": "http://www.gamereactor.eu/overwatch/?sid=14e75d26e5e2c3016656ee2a7bc43a45", "content": "OVERWATCH REVIEW. Written by Rasmus Lund-Hansen on the 26th of May 2016 at 16 \"Overwatch is, without a doubt, the best multiplayer-shooter I've ever had my hands on.\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 09 Mayhem are continuing to add to their team as the 2019 season progresses, including plenty of former Armament Esports talent. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 20th of June 2019 at 07 Overwatch League exhibition matches will be played, alongside music artists like Lil Yachty, Marshmello, and Snoop Dogg. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 10 The former Toronto Defiant player has a new home, and joins various other Korean players on the Chinese side. 0 ESPORTS. Written by Ben Lyons on the 18th of June 2019 at 10 The South Korean marks the latest addition to the ever-changing Overwatch League roster."}]