[{"date": "2014-06-16", "url": "http://thinkprogress.org/justice/2014/06/16/3449221/it-took-until-last-friday-for-an-alabama-court-to-strike-down-that-states-ban-on-gay-sex/", "content": "A law is still on the books in the state of Alabama which provides that a person is guilty of \"sexual misconduct\" if they engage in \"[a] ny act of sexual gratification between persons not married to each other involving the sex organs of one person and the mouth or anus of another\" - meaning that oral and anal sex of any kind is a crime under Alabama state law unless it is enjoyed with one's spouse. Because Alabama is also a marriage discrimination state, this law has obvious implications for gay people in that state. Indeed, the official commentary to the law explains that it was enacted to \"make all homosexual conduct criminal .\" \"Consent,\" under this Alabama sex ban, \"is no defense to a prosecution .\" handed down the state's first decision declaring this law unconstitutional. This isn't a particularly surprising decision. The Supreme Court held in its landmark 2003 opinion in Lawrence v. Texas that the Constitution forbids laws prohibiting consensual, private sexual activity between adults. If an Alabama court allowed the state's sex ban to stand, it would have done so in direct defiance of the Constitution and the Supreme Court of the United States. In fairness, the fact that it took nearly eleven years from the day Lawrence was decided for an Alabama court to strike down this law may be attributable to good behavior by the state's prosecutors (although that still Lawrence). Shortly after Lawrence, the state's attorney general conceded that the law is unconstitutional \"to the extent that it applies to private, legitimately consensual anal and oral sex between unmarried persons .\" So it is possible that the law has not been tested because prosecutors refrained from bringing unconstitutional prosecutions under this statute after Lawrence. Indeed, the defendant in the case that ultimately led the state appeals court to strike this law down was initially charged with \"sodomy in the first degree\" - a much more serious crime akin to rape. The jury, however, did not convict this defendant of a crime involving non-consensual sex. They convicted him of the lesser crime prohibiting consensual anal intercourse. This, the state appeals court held, is not allowed. Despite Lawrence, there is some risk that the state supreme court could try to reinstate the ban on oral and anal sex. The state's chief justice, <mark>Roy Moore</mark>, is compared a judge who struck down the military's anti-gay Don't Ask/Don' t Tell policy to al-Qaeda urging defiance of Supreme Court rulings. The bigger risk, however, will come if the United States Supreme Court adds just one more conservative justice. Although six justices agreed in Lawrence that the state of Texas' ban on gay sex was unconstitutional, one of those justices, Justice Sandra Day O'Connor, has since left the Court. Moreover, four of the Court's current members, Chief Justice <mark>John Roberts</mark> and Justices Antonin Scalia, Clarence Thomas and Samuel Alito, joined anti-gay opinions in the 2013 decision United States v. Windsor. If another conservative joins the Court, there may be enough votes to overrule U.S. Set To Execute First Inmate Since Bungled Oklahoma Execution", "articleID": "2014061620_00008254_W", "names": {"Roy Moore": ["Q17466511", "Q27924997", "Q5302905"]}}, {"date": "2014-06-17", "url": "http://theworldgame.sbs.com.au/article/2014/06/17/spain-aiming-spark-campaign-against-chile", "content": "Chile must be braced for a Spain backlash after the reigning champion was humiliated by Netherlands in its FIFA World Cup opener. Vicente del Bosque's men arrived in Brazil as one of the pre-tournament favourites having triumphed in South Africa four years ago, as well as retaining its UEFA European Championship title in 2012. However, Spain's World Cup defence began in a disastrous fashion as Louis van Gaal's side stormed to a shock 5-1 Group B victory in Salvador on Saturday (AEST). Xabi Alonso's 27th-minute penalty had appeared to put Spain in a strong position, but Robin van Persie's superb headed equaliser shortly before the break triggered a second-half demolition from the Dutch. Several Spain stars came in for heavy criticism after the crushing defeat, none more so than <mark>Iker Casillas</mark>, with some calling for the Real Madrid goalkeeper to be dropped from the starting XI. Del Bosque may retain faith in his captain, however, as David de Gea is struggling for fitness owing to a muscle injury, leaving Pepe Reina as the only alternative. Central defensive pair <mark>Sergio Ramos</mark> and Gerard Pique as well as Brazil-born striker Diego Costa also faced scrutiny for their performances, but it remains to be seen if Del Bosque will change his line-up or hand an opportunity to the side that failed so spectacularly last week. Regardless of who gets the nod at the Maracana in Rio de Janeiro on Thursday (AEST), the result will offer some indication as to whether Spain can mount a challenge to return to the iconic stadium for the final on 14 July (AEST). It is the second time in as many World Cups that the teams have faced off, Spain triumphing 2-1 in 2010, although both sides still progressed from Group H. A repeat victory could re-invigorate Spain - which lost its first match in South Africa before going all the way - and forward <mark>Juan Mata</mark> believes a strong team bond can help it overcome the poor start. \"We have strong faith in our football, in our ideas and we really believe we can overcome the situation,\" he said. \"This group is like a family since I arrived here .\" I think it's vital this kind of friendship between all of us, this familiar feelings which have made the Spain national team into a successful team. \"Chile started its campaign with a 3-1 victory over Australia, but that scoreline somewhat belied the difficulty that Jorge Sampaoli's side faced in Cuiaba. The South Americans were fluent in attack, with Barcelona forward Alexis Sanchez particularly lively, yet goalkeeper <mark>Claudio Bravo</mark> was required to make a series of saves to deny Australia at least a draw. Chile has failed to beat Spain in 10 meetings between the teams and even a point could prove crucial in its bid to qualify for the knockout stages. However, midfielder Arturo Vidal - who managed 60 minutes against Australia as he continues to recover from knee surgery and has declared himself fit to play Spain - insists Chile is only interested in a maximum haul.", "articleID": "2014061722_00102567_W", "names": {"Claudio Bravo": ["Q313161", "Q491787", "Q56239393", "Q58372288"], "Iker Casillas": ["Q11584", "Q1190369"], "Juan Mata": ["Q168740", "Q41839093"], "Sergio Ramos": ["Q483309", "Q514286"]}}, {"date": "2014-06-17", "url": "http://wtol.com/story/25800903/attorney-for-riverdale-families-releases-scathing-letter", "content": "Attorney for Riverdale families releases scathing letter A photo of <mark>Williams</mark> sent home with a Riverdale student (Source: Blanton family) The following are mugshots of individuals arrested on a variety of charges in June by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested on a variety of charges in June by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested in May by local authorities in Northeast Tennessee. The following are mugshots of individuals arrested in May by local authorities in Northeast Tennessee. meta content = \"2014-06-16 11:11:09\" > Teen tuba player alerts family to fire, helps everyone get out safely Firefighters are working to put out a house fire in the Lake Carolina area. Details are limited right now, but Columbia Fire Chief Aubrey Jenkins confirms that firefighters were working to put out a fire A teenage tuba player is being credited with alerting his family about a house fire and getting them out safely. meta content = \"2014-06-17 04:40:23\" > Mother: Energy drinks factors in daughter's heart attack Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. meta content = \"2014-06-17 01:04:11\" > Another allegation of abuse reported at Riverdale Schools involving same teacher A second family has come forward and has filed a report against Riverdale teacher Barb <mark>Williams</mark>. Tonight, WTOL's <mark>Jerry Anderson</mark> spoke with Bryce and April Blanton of Forest, OH. Mother says 16-year-old daughter died from energy drink heart attack Lanna Hamann, 16, was vacationing in Rocky Point, Mexico, when her mother received a call she never expected: Her daughter was dead from a heart attack. (6/16/2014) A house in Cheshire collapsed over the weekend, but the victim inside may have been buried under the rubble for days. A house in Cheshire collapsed over the weekend, but the victim inside may have been buried under the rubble for days. Sandusky County Jail and Dungeon open for spooky tours The historic Sandusky County Jail is open for tours. Monday June 16 many people had the chance to get a look inside the jail and dungeon. Two died on Monday when tornadoes struck Pilger, NE. (Source: Chad Cowan/CNN) Two died on Monday when tornadoes struck Pilger, NE. Two died on Monday when tornadoes struck Pilger, NE. Stormtrack Weather Forecast for Monday June 16: PM Edition A warm and humid setting moved in today and will stick through the work week. (Toledo News Now) - The attorney representing two Riverdale Elementary students who claim to have been abused by a teacher released a scathing letter he sent to the Hancock County Prosecutor on Tuesday. In the letter, attorney Daniel Margolis says \"the government entities that exist to investigate, charge and prosecute child abuse and crimes against children in both Hancock and Wyandot counties are hopelessly compromised .\" Margolis claims law enforcement never interviewed <mark>Ian Nelson</mark>, the first alleged victim to come forward. He also says there was \"no effort made to identify other victims of abuse as no law enforcement agency requested any other people to come forward if they have information .\" Margolis concludes the letter by requesting the investigation be turned over to the Ohio Bureau of Criminal Investigation. \"We are asking, demanding, on behalf of these two children, you request BCI take over these two cases, have an impartial special prosecutor appointed to investigate these cases. The special prosecutor would then direct a neutral law enforcement a agency not tainted by an overt conflict of interest, and allow the chips to fall where they may .\" On Monday, Bryce and April Blanton of Forest, OH came forward to say their son was also abused by <mark>Barbara Williams</mark>. <mark>Williams</mark> had already been caught on tape lifting up kindergartner <mark>Ian Nelson</mark> by the face. (Click here for video of that incident) Read the full letter here: Another allegation of abuse reported at Riverdale Schools involving same teacher Family's attorney requests special prosecutor in Riverdale teacher case Riverdale student's family attorney says case should have gone to grand jury Board meeting allows parents to speak about Riverdale teacher incident Police report on Riverdale School incident forwarded to prosecutor Riverdale Schools teacher hires lawyer after caught on video grabbing boy Attorney for Riverdale families releases scathing letter SLIDESHOW: Teacher under fire after grabbing kindergarten student Barb <mark>Williams</mark>, a teacher at Riverdale Schools, is under fire after she was caught on camera using what some say is excessive physical force with a student.", "articleID": "2014061806_00065710_W", "names": {"Barbara Williams": ["Q1844755", "Q4859413"], "Ian Nelson": ["Q16236937", "Q39078787", "Q984070"], "Jerry Anderson": ["Q14950481", "Q16096792", "Q6183201"]}}, {"date": "2014-06-18", "url": "http://www.channelnewsasia.com/news/world/schumacher-was-awake-for/1174538.html", "content": "Seven-time F1 world champion <mark>Michael Schumacher</mark>. (AFP/File/Giuseppe Cacace) GENEVA: Formula One champion <mark>Michael Schumacher</mark> was conscious and had his eyes open during his top-secret transfer from a French hospital to a facility in Switzerland, Swiss newspaper Blick reported. <mark>Schumacher</mark> was moved on Monday after emerging from a coma following his devastating ski accident in December. The paper said he had his eyes open for most of the journey by private ambulance, which was conducted like a secret service operation. <mark>Schumacher</mark> did not speak, but he communicated by nodding his head during the 200-kilometre (125-mile) journey, the paper said. The ambulance company was not told the identity of its world-famous passenger in advance, and staff had to give up their mobile phones when they came into contact with him. The paper said <mark>Schumacher</mark> had lost a lot of weight during his 170 days in hospital in the French city of Grenoble. It tracked down the Swiss ambulance company, whose head Mathias Volken confirmed its involvement, but refused to give further details. The seven-time world champion's spokeswoman Sabine Kehm on Monday thanked the doctors in Grenoble and asked for \"understanding that his further rehabilitation will take place away from the public eye\". The hospital where he is now being treated is one of Switzerland's best and has renowned neurology experts. It is in the city of Lausanne, near where <mark>Schumacher</mark>'s wife Corinna and their two children live.", "articleID": "2014061817_00054060_W", "names": {"Michael Schumacher": ["Q1929281", "Q19707089", "Q9671"]}}, {"date": "2014-06-19", "url": "http://feeds.washingtonpost.com/c/34656/f/636679/s/3ba4dcd8/sc/13/l/0L0Swashingtonpost0N0Csports0Cmystics0Elead0Eevaporates0Elate0Ein0E830E730Eloss0Eto0Edream0C20A140C0A60C180Cbe76be0Ac0Ef7320E11e30Ea60A60E946fd632f9f10Istory0Bhtml0Dwprss0Frss0Isports/story01.htm", "content": "ATLANTA - Angel McCoughtry matched her season high with 27 points, scoring 18 points in the second half in the Atlanta Dream's She was 7 for 12 from the field in the second half and keyed a 14-0 fourth-quarter run with six points and three rebounds to help the Dream (8-3) run their winning streak to five games. Mystics (5-7) led much of the first three quarters. Washington, the least effective three-point shooting team in the league, went 7 of 10 from long range en route to a 39-34 halftime lead. But the Mystics went cold for nearly six minutes in the fourth quarter under stiffer defensive pressure, and the Dream took advantage. \"We (made) them stop shooting, got in their faces,\" McCoughtry said. \"We would rather let them have 2s than 3s, so that kind of helped us .\" Atlanta held Washington to 1-of-7 shooting from three-point range in the second half. \"I think our defense just stepped up a little bit; we started getting up on the shooters,\" Dream Coach <mark>Michael Cooper</mark> said. \"We changed our pick-and-roll (defense) from one to another, and it really helped .\" Tiffany Hayes added 11 points for Atlanta, and Erika de Souza had 10 points and eight rebounds. Rookie point guard Bria Hartley led Washington with 16 points, and Emma Meesseman added 15. Mystics rookie Stefanie Dolson, who scored eight points on 4-of-5 shooting in 20 minutes, pushed the lead to 66-63 on a runner with 7 minutes 37 seconds left. But the visitors went scoreless over the next 5:49. McCoughtry's 11-foot fadeaway jumper from the left baseline with 6:39 left gave Atlanta the lead for good, 67-66. Washington went 3 for 4 at the free throw line, while Atlanta was 20 for 23, including 7 of 7 by McCoughtry. \"When the free throw difference is 23-4, it's hard to make up for it,\" said Washington Coach Mike Thibault, whose team lost for the fifth time in six games. \"They were aggressive, drove well SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SuperFan Badge SuperFan badge holders consistently post smart, timely comments about Washington area sports and teams. Culture Connoisseur Badge Culture Connoisseurs consistently offer thought-provoking, timely comments on the arts, lifestyle and entertainment. Washingtologist Badge Washingtologists consistently post thought-provoking, timely comments on events, communities, and trends in the Washington area. Post Writer Badge This commenter is a Washington Post editor, reporter or producer. Post Forum Badge Post Forum members consistently offer thought-provoking, timely comments on politics, national and international affairs. Weather Watcher Badge Weather Watchers consistently offer thought-provoking, timely comments on climates and forecasts. World Watcher Badge World Watchers consistently offer thought-provoking, timely comments on international affairs. Post Contributor Badge This commenter is a Washington Post contributor. Post contributors aren't staff, but may write articles or columns. In some cases, contributors are sources or experts quoted in a story. Post Recommended Washington Post reporters or editors recommend this comment or reader post. You must be logged in to recommend a comment. Sign in here Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges:. Replies to those posts appear here, as well as posts by staff writers. All comments are posted in the All Comments To pause and restart automatic updates, click\" Live \"or\" Paused \". If paused, you'll be notified of the number of additional comments that have come in. Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges: US Patent Office finds Redskins' name offensive Manaus celebrates its World Cup games in the Amazon rain forest, even as some wonder why Spain eliminated from World Cup contention with 2-0 loss to Chile <mark>John Brooks</mark> rises from obscurity to World Cup hero with winning goal for U.S. soccer", "articleID": "2014061914_00076164_W", "names": {"John Brooks": ["Q10498801", "Q28131666", "Q6223369", "Q6223372", "Q6223373", "Q6223375", "Q6223377", "Q6224304", "Q821211"]}}]