[{"articleID": "2012062423_00058142_W", "names": {"Ashley Young": ["Q10602", "Q4805646"]}, "date": "2012-06-24", "url": "http://theroar.com.au/2012/06/25/italy-beat-england-penalties-euro-2012/", "content": "we're hiring: online media sales + events manager (freelance).>> find out more italy dominated but needed a penalty shoot-out to overcome a humbled english side at the olympic stadium kiev on sunday after their euro 2012 quarter-final ended in a 0-0 draw. england's <mark>ashley young</mark> hit the crossbar and ashley cole had his effort saved by gianluigi buffon, as alessandro diamanti scored the final penalty to set the azzurri up for a classic semi-final with germany in warsaw on thursday. the other semi-final sees title holders spain take on portugal on wednesday. italy won the penalty shoot-out 4-2. it was a well-deserved win for italy, who squandered plenty of chances, most notably with daniele de rossi hitting the post in the third minute and mario balotelli missing at least three good opportunities during regular time. england rarely looked threatening and were lucky not to have conceded any goals, while andrea pirlo was the outstanding man for italy at midfield. \"we played a great game and had deserved to win before the penalties, then we kept our cool and were lucky,\" italy coach cesare prandelli said. \"they were a tough side to face, and that is why i say the boys did well to play with character and heart .\" germany are now the favourites, prandelli said, \"but for now let us enjoy this victory\". despite less than stellar performances, england coach roy hodgson did not make any changes to the team that defeated ukraine, with wayne rooney fielded behind danny welbeck. prandelli picked manchester city striker balotelli alongside antonio cassano up front and replaced defender giorgio chiellini and midfielder thiago motta, who are both injured, with leonardo bonucci and riccardo montolivo. the italians had not lost against england for 15 years, with their last encounter at a major tournament ending 2-1 for the azzurri at the 1990 world cup. england, on the other hand, had been growing in confidence after entering the tournament with low expectations. but those expecting a tactical match by two defensive-minded teams were soon disappointed, with both sides facing each other openly. late in the match and with the english players looking tired, italy continued to press ahead during extra time. an italy goal in the 114th by nocerino was ruled out for off-side, and the game went to penalties. balotelli, pirlo - with a classy chipped shot - and antonio nocerino were all on target for the italians, while montolivo sent the ball wide, before diamanti sealed the match. england had steven gerrard and wayne rooney on target, but had to give up following buffon's great save on cole. \"we can go out with our head held high but it does not help the heartbreak,\" gerrard said. \"i feel for the players as they have given absolutely everything today. please be sure to enter your name and email before submitting this comment. please also refer to our"}, {"articleID": "2018083017_00269243_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"], "David Maxwell": ["Q17155889", "Q21997859", "Q27909749", "Q51586019", "Q5237245", "Q5237246", "Q5237247"]}, "date": "2018-08-30", "url": "https://www.news24.com/World/News/trump-revisits-wargames-with-south-korea-as-north-korea-talks-stall-20180830", "content": "US President Donald Trump said that there's no reason to spend a lot of money on military wargames with South Korea, but he warned he could \"instantly\" relaunch the exercises again and they would be \"far bigger than ever before\". Trump made the comment on Wednesday in a series of tweets that primarily took aim at China, blaming it for lack of progress on getting North Korea to end its nuclear programme, following the president's landmark summit with <mark>Kim Jong Un</mark> in June. But there was also a loaded message for <mark>Kim</mark>: Mixing an expression of goodwill to the North Korean autocrat with an implicit military threat that will add to speculation over the direction of Trump's attempted rapprochement with a longtime adversary. \"The president believes that his relationship with <mark>Kim Jong Un</mark> is a very good and warm one, and there is no reason at this time to be spending large amounts of money on joint US-South Korea war games,\" Trump said, citing what was presented as a White House statement. \"Besides, the president can instantly start the joint exercises again with South Korea, and Japan, if he so chooses. If he does, they will be far bigger than ever before .\" Trump caught military leaders by surprise in June when he announced the suspension with the South, \"unless and until we see the future negotiation is not going along like it should\". He called the drills costly and provocative. The cancellation was an olive branch to Pyongyang, which has long complained that the exercises were invasion preparations. Often the North has reacted to the exercises with its own demonstrations of military might, including firing a new intermediate-range missile over Japan last year as a countermeasure to the drills. There was some hope that the gesture of shelving the fall exercises would foster goodwill and help nudge the North in the denuclearisation talks. But beyond returning the potential remains of about 55 US troops missing from the Korean War, and its continuing suspension in its missile and nuclear tests, there has been little movement from the North. As a result, the US last week shelved a planned trip to Pyongyang by Secretary of State Mike Pompeo, citing lack of progress on denuclearisation, but remaining open to future talks. As doubts grow in Washington and beyond over <mark>Kim</mark>'s willingness to relinquish his nukes, Trump has been heaping blame on China, which is North Korea's traditional ally and main trading partner. On Wednesday the president accused Beijing of pressuring the North because of current tensions in US-China trade relations, and also of providing North Korea money, fuel, fertiliser and other commodities, which he said was not helpful. China cooperated with the US last year in adopting tough international sanctions against North Korea and maintains it is still enforcing the restrictions adopted by the <mark>UN</mark> Security Council. But in his tweets, Trump also signalled that the US has its own military means of exerting pressure on Pyongyang. His remarks compounded confusing messages from the Pentagon over the past two days that have revived speculation over the drills. On Tuesday, Defence Secretary Jim Mattis told reporters the US might carry out drills with South Korea next spring after having cancelled a major exercise this summer. He said no decision has been made on when to resume military exercises, but his statements suggested the recent cancellation might not be repeated. Several US officials acknowledged on Wednesday that planning is going forward for the spring exercises, which require months of preparation. \"Routine planning continues for major US-ROK exercises on the peninsula in accordance with the normal exercise programme planning cycle,\" said Air Force Col. Patrick Ryder, spokesperson for the Joint Chiefs of Staff, referring to the acronym for South's official name, the Republic of Korea. Other US officials also said preliminary work on the drills has begun, noting that it is much easier to cancel an exercise than it is to slap one together quickly. The officials spoke on condition of anonymity to discuss internal conversations. <mark>David Maxwell</mark>, a senior fellow at the Washington-based Foundation for Defence of Democracies, said the initial planning for the exercises can begin a year in advance, including the funding, scheduling and movement of forces and units that will participate. As time goes on, planners would nail down the war game scenario and other details. \"We continue to plan for exercises, but we can stop them on a dime,\" said <mark>Maxwell</mark>, a retired Army colonel who served five tours in Korea. \"We can't restart them on a dime .\" He said the risk of a continued halt in the major drills would be a diminishing of skills and institutional memory between South Korean forces and the more than 28 000 US troops based there. \"The longer we go without exercises, the more risk there is that we will suffer significant challenges if there is a war,\" <mark>Maxwell</mark> said. US officials said Gen. Vincent Brooks, commander of US Forces in Korea, has taken steps to mitigate any loss of training by scheduling smaller exercises and staff drills. A key challenge in Korea is that the bulk of the US forces deploy for just a year, so they rely on the summer exercise to get familiar with the South Korean military and the ways allied troops coordinate and operate with them. The spring Foal Eagle drill is more expansive and includes fighter jets, maritime maneuvers, amphibious assault tactics and computer-simulated scenarios. KEEP UPDATED on the latest news by subscribing to our FREE newsletter. - FOLLOW News24 on Twitter"}, {"articleID": "2013020721_00017960_W", "names": {"Pat Cooper": ["Q55237028", "Q7143321"], "Edwin Edwards": ["Q18160058", "Q737491"], "Scott Edwards": ["Q44749733", "Q48815423", "Q7436284"], "Brian Jackson": ["Q16091880", "Q18276044", "Q19816341", "Q19948342", "Q2402879", "Q2924927", "Q4964166", "Q4964167", "Q4964169", "Q4964172", "Q4964173", "Q4964175", "Q4964177", "Q55163166"]}, "date": "2013-02-07", "url": "http://theadvertiser.com/article/20130207/NEWS01/130207026/-1/rss01", "content": "lafayette police responded to i-49 northbound between i-10 and pont de mouton regarding an...fracking debate rages albany - the state may miss a key deadline in its analysis of hydraulic fracturing if the...sugar cane farmers are closely watching the immigration reform debate unfold in the u.s. superintendent of schools <mark>pat cooper</mark> has indicated that he will do all he can to accommodate myrtle...polling that shows americans favor women in combat by a 2-to-1 margin is evidence only of the power...floyd willis is the working man's barista. thursday, i had the pleasure of trying out steve 'n' <mark>pat</mark>'s bon temps grill on verot school road. throw me something, mister! new orleans isn't the only place that does mardi gras big. mardi gras usually means a few things. - 2:36 pm baton rouge, la. (ap) - a federal judge has agreed to cut short former louisiana gov. <mark>edwin edwards</mark>' court supervision following his release from prison. <mark>edwards</mark> was sentenced to three years of supervised release. his supervision lasted about 18 months before u.s. district judge <mark>brian jackson</mark> agreed wednesday to end it early. <mark>edwards</mark> served eight years in federal prison and six months of home detention after he was convicted in 2000 of racketeering, extortion and conspiracy for his role in a riverboat casino licensing scandal. he was also fined $250,000 and ordered to forfeit $1.8 million. <mark>jackson</mark> said <mark>edwards</mark> fully complied with all of the terms of his supervision. prosecutors and probation officials didn't object to <mark>edwards</mark>' request to end it early. a reality television show about the 85-year-old <mark>edwards</mark> and his third wife, 34-year-old trina <mark>scott edwards</mark>, is scheduled to debut later this month on a & e. \"today is a happy day for the <mark>edwards</mark> family!\" trina <mark>edwards</mark> posted on her facebook page. \"thanks to his exemplary conduct and record while in prison <mark>edwin</mark> has been granted an early release from probation. it's officially over and my husband is free!!!\" judge cuts short <mark>edwin edwards</mark>' court supervision baton rouge, la. (ap) - a federal judge has agreed to cut short former louisiana gov. <mark>edwin edwards</mark>' court supervision following his release from prison. become a subscriber today to enjoy these benefits: ipad-optimized edition mobile site & iphone app are you currently a subscriber? set up your digital access now. you now have full access. thank you for subscribing. access the tablet-optimized site, mobile site and iphone app share your access with any friend or family member subscriber exclusive top 5 daily email newsletter create an account or if you have a digital profile to continue using your current web browser, adobe flash must be installed or upgraded:"}, {"articleID": "2019062117_00244981_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"]}, "date": "2019-06-21", "url": "http://www.gamereactor.eu/counterstrike-global-offensive/?sid=e027fbfaf709a73cc263b31a16f8fa06", "content": "COUNTER-STRIKE: GLOBAL OFFENSIVE REVIEW. Written by Rasmus Lund-Hansen on the 27th of August 2012 at 18 \"Like Americans going to Japan only to eat at McDonald's when they could have been eating the same burgers at home .\" 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 19th of June 2019 at 09 This September we'll see another Blast Pro Series event take place, with the VTB Arena hosting six CS: GO teams, including NaVi. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 6th of June 2019 at 09 Those holding a Premium Pass get access to new features, exclusive chat rooms and emojis, and much more. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 10 The HLTV rankings is the chart to go by, and after several competition wins Liquid is number one once again. 0 ESPORTS. Written by <mark>Sam Bishop</mark> on the 4th of June 2019 at 09 This is just in time for the ECS Season 7 finals in London, and Stanislaw has opened up about the decision to leave the side."}, {"articleID": "2017051210_00166579_W", "names": {"Michael Shields": ["Q15454888", "Q57923083"]}, "date": "2017-05-12", "url": "http://feeds.reuters.com/~r/Reuters/worldNews/~3/vJorMAsE6Ow/us-austria-politics-idUSKBN18814J", "content": "Austrian Foreign Minister Kurz calls for snap election World News | Fri May 12, 2017 | 6:00 am EDT Austrian Foreign Minister Kurz calls for snap election left right Austria's Foreign Minister Sebastian Kurz leaves a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 1/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 2/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 3/4 left right Austria's Foreign Minister Sebastian Kurz addresses a news conference in Vienna, Austria, May 12, 2017. REUTERS/Leonhard Foeger 4/4 VIENNA Austrian Foreign Minister Sebastian Kurz called on Friday for a snap parliamentary election but stopped short of saying he would take over as head of the conservative party in the coalition government and force that move. Kurz, 30, is widely favored within his People's Party (OVP) to succeed party leader Reinhold Mitterlehner, who said on Wednesday he was stepping down. Several polls suggest that Kurz's taking over would boost the OVP's support and leapfrog it into first place. Surveys have repeatedly shown the far-right Freedom Party to be the most popular in Austria, closely followed by Chancellor Christian Kern's center-left Social Democrats. \"I personally believe early elections would be the right path,\" Kurz told a news conference. The next elections are due by autumn 2018. Whether a snap election is called is likely to depend on whether Kurz takes on the job of party leader. He said he would do that only if he were given more powers, to avoid the kind of in-fighting that prompted Vice Chancellor Mitterlehner to quit. \"Whoever takes over the leadership must have the possibility to set a party line, and he must above all be able to make staffing decisions,\" Kurz said, in an apparent reference to the strong influence within the party of figures such as the governors of Austrian provinces. The party leadership is due to meet on Sunday to decide who should replace Mitterlehner. Kern, who on Wednesday urged his conservative partners to stay in the government, had no immediate comment. (Reporting by Francois Murphy and Kirsti Knolle; Editing by <mark>Michael Shields</mark>)"}, {"articleID": "2019120300_00005437_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"], "Andrew Surman": ["Q27906035", "Q507852"], "Ben Davies": ["Q41251646", "Q4885504", "Q4885507", "Q4885508", "Q4885509", "Q4885510", "Q4885511", "Q4888471", "Q53951851", "Q723161", "Q93555"], "Scott Dann": ["Q16214802", "Q448074"], "Gary Cahill": ["Q17305745", "Q223827"], "Simon Francis": ["Q7518777", "Q7518785"], "Charlie Daniels": ["Q5084755", "Q5084757", "Q551478"], "David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"], "Adam Smith": ["Q14950467", "Q16255210", "Q20023132", "Q22121229", "Q33035156", "Q350916", "Q350920", "Q42763651", "Q4679545", "Q4679802", "Q4679803", "Q4679807", "Q4679808", "Q48976986", "Q52116879", "Q5539790", "Q56997269", "Q57451408", "Q58051258", "Q58219052", "Q59065"], "Joshua King": ["Q436237", "Q57433295", "Q58137018"], "Charlie Taylor": ["Q30604150", "Q5085597", "Q5085599"], "Ashley Westwood": ["Q10857014", "Q59428"], "Oleksandr Zinchenko": ["Q1803666", "Q19636859"], "Roberto Pereyra": ["Q42398698", "Q55468620", "Q93504"], "Brandon Williams": ["Q16232032", "Q24007026", "Q2923793", "Q4957141", "Q4957142", "Q4957143", "Q4957144", "Q4957145"], "Marcos Rojo": ["Q27916806", "Q507890"], "Ryan Bennett": ["Q2053661", "Q57837483"], "David Martin": ["Q1175520", "Q132462", "Q16091915", "Q18155095", "Q18737171", "Q21452744", "Q219366", "Q23664213", "Q3018370", "Q3018377", "Q43912814", "Q47088209", "Q5237166", "Q5237168", "Q5237171", "Q5237172", "Q5237173", "Q5237185", "Q57968289", "Q5800158", "Q58423896", "Q715443"], "Winston Reid": ["Q150289", "Q8026119"], "Frank Lampard": ["Q41533", "Q461633"], "Dean Smith": ["Q1181130", "Q1181132", "Q18171697", "Q202584", "Q5246469", "Q5246470", "Q5246471", "Q5246472", "Q5246473", "Q5246474"], "Christoph Zimmermann": ["Q11855314", "Q17427517", "Q9191157"], "Marco Silva": ["Q20118419", "Q57025699", "Q6757714"], "André Gomes": ["Q16490302", "Q519008", "Q9614301"], "John Egan": ["Q150332", "Q1573482", "Q16243920", "Q58726511", "Q6231465", "Q6231467", "Q6231471", "Q6231474"], "Federico Fernandez": ["Q5440992", "Q713501"]}, "date": "2019-12-02", "url": "http://www.rotoworld.com/article/team-news/late-fitness-check-round-15", "content": "December 2, 2019, 6:39 pm ET Updated On: December 2, 2019, 6:51 pm ET Print Round 15 arrives quickly on the heels...but with games spread across three days, getting a handle on the team news is difficult ahead of the FPL deadline. Only five managers clocked in on Monday, those involved in fixtures on Tuesday, and <mark>Brendan Rodgers</mark> less than 24 hours after his sides last gasp win over Everton. Make sure you're following throughout the build-up for all the latest Premier League updates. Our Player News page contains breaking headlines while last-minute injury updates are added to the Injury Report. Good luck! Follow the entire Rotoworld Premier League team on Twitter: Neal | Steve | <mark>Andrew</mark> | Sean | Stag | <mark>Ben</mark> | Nik Crystal Palace--vs--AFC Bournemouth Mamadou Sakho is set for a possible recall to the starting XI as the Eagles defensive options become stretched. <mark>Scott Dann</mark> was sent for a scan on Monday after picking up an ankle injury at Turf Moor. \"We hope it's not a ligament issue. We hope it's a kick, but of course, it's far too soon, too close to the game for him to recover so he'll miss tomorrow's game .\" <mark>Gary Cahill</mark> (knee) is also sidelined. \"We hope to recover the pair of them for the game at the weekend [Watford].\" No fresh injury concerns from Saturday, the squad came through the defeat to Tottenham relatively unscathed. <mark>Simon Francis</mark> and Philip Billing are back in contention after serving a ban in week fourteen. Lloyd Kelly (thigh) is edging closer while Junior Stanislas (knee) is back on the training pitches, although after several months out, it may be next year before Eddie Howe considers the winger. <mark>Andrew Surman</mark> is working with the group, but <mark>Charlie Daniels</mark> and <mark>David Brooks</mark> remain sidelined. <mark>Adam Smith</mark> missed out on Saturday due to illness, and a decision on his availability could be made closer to kick-off. It's still a little too soon for <mark>Joshua King</mark> (hamstring). Burnley--vs--Manchester City <mark>Charlie Taylor</mark> continues to be assessed, but the early indications are that he did not suffer a serious hamstring injury against Crystal Palace. However, with the quick turnaround, Sean Dyche will look to make a late call. Erik Pieters is a ready-made replacement, and despite picking up a knock, he is expected to start at left-back. <mark>Ashley Westwood</mark> is available after suspension, although the midfielder is struggling with a slight groin problem and faces a late test. Tuesday will come too soon for Johann Berg Gudmundsson who is back on the grass and working with the physios. \"He is building up his power and sharpness, and that is the final bit to come .\" Danny Drinkwater is \"as close as you can get\" in terms of his fitness, and Matej Vydra is fit after recovering from a hip injury. Pep Guardiola reveals Sergio Agüero will miss the Manchester derby (GW16) after failing to recover from a muscular issue. Ilkay Gundogan is suspended for Tuesday, so expect a return for Rodri who was left out of the draw on Tyneside until the 84th minute. No other injury concerns - Aymeric Laporte and Leroy Sané remain out until early 2020 - while <mark>Oleksandr Zinchenko</mark> is back on the training pitches. Fernandinho will continue at centre-back as Pep prefers the Brazilian to be in his backline, which is why Stones/Otamendi have not been paired together. Leicester City--vs--Watford Demarai Gray is the only fitness concern for Wednesday; the winger has been ill over the weekend. \"Everyone else is fine,\" apart from long-term absentee Matty James (Achilles). Three months (or just 85 days). That was all the time afforded to Quique Sanchez Flores in his second spell at the club before results ultimately dictated the board's decision to sack the 54-year-old. Hayden Mullins will take temporary charge of the Hornets with an extensive injury list...Up to eight players are at risk of missing out, and with a press conference still to come, I'll focus on the definites, the maybes, and those almost there. Danny Welbeck is out until the new year, and it's difficult to see Sebastian Prodl or Tom Cleverley returning for this one given the game time they've missed. Daryl Janmaat and Christian Kabasele - knee and hamstring respectively--can't be ruled out entirely as the severity of their injuries remains unclear. Craig Dawson is best placed to return despite stitches in a head wound. Kiko Femenía suffered a knock at St Mary's and QSF had suggested that one of his substitutes was injured during the warm-up, and that was the reason Andre Gray came on to replace Gerard Deulofeu. That suggests Troy Deeney, Domingos Quina or <mark>Roberto Pereyra</mark> won't be ready. Manchester United--vs--Tottenham Hotspur Ole Gunnar Solskjaer is hopeful of having Scott McTominay or Paul Pogba back for the game on Wednesday as the pair step up their recovery. The former seems best placed as he had been touted for a return in week 14, but Pogba won't be too far away following a stint in the US to build fitness. Anthony Martial is one to watch; his withdrawal may have been enforced, although there was no mention of a problem post-match. Assessments will continue throughout the build-up to the game, and last-minute decisions are not uncommon with such a quick turnaround. Luke Shaw returned to the matchday squad but looks way off the pace after more than three months out, so <mark>Brandon Williams</mark> should keep his place. Eric Bailly, Timothy Fosu-Mensah, <mark>Marcos Rojo</mark>, Nemanja Matic and Diogo Dalot remain sidelined. Jose returns to his former stomping ground and Spurs will be looking to make it four straight wins, although they will need to be a bit more Mourinho-like after conceding twice in each of the last three. Jan Vertonghen and Tanguy Ndombele were back in the XI on Saturday, but unless Christian Eriksen commits his future to the club, then his game time looks to be very limited. No fresh concerns--Hugo Lloris, Michel Vorm, <mark>Ben Davies</mark> and Erik Lamela are out--although the Argentine is in the last phase of his conditioning before re-joining the group. Wolverhampton Wanderers--vs--West Ham United Romain Saiss comes back into contention with Max Kilman, who made his full Premier League debut on Sunday, being the player most likely to miss out. The status of <mark>Ryan Bennett</mark> (groin) and Morgan Gibbs-White is unknown, but both have been managing issues for a while now, and I wouldn't expect a great deal of change within 48-72 hrs. Willy Boly is progressing and is on schedule to return in January. Saturdays' coupon buster--a win at Stamford Bridge--ended a run of eight games (all comps) without victory and Manuel Pellegrini will be hoping for more of the same. Michail Antonio will need to be checked after his first start in over three months, and with Issa Diop back in the frame, Fabián Balbuena could make way. <mark>David Martin</mark>, 33, and son of former West Ham legend Alvin kept a clean sheet on his debut and looks set to continue with <mark>Roberto</mark> missing out. Jack Wilshere is training, alongside <mark>Winston Reid</mark>, but it's too soon, and neither will be considered. Chelsea--vs--Aston Villa <mark>Frank Lampard</mark> will give Tammy Abraham every chance to prove his fitness ahead of the game. \"We will find out more today and tomorrow. He needs to get outside and move a little bit over the next two days .\" If he fails to recover, then the Blues boss suggested that Christian Pulisic is an option. \"He does have an ability to run behind the line, and to be sharp in central areas which will naturally get him more goals .\" He also went onto add that the decision to play Olivier Giroud over Michy Batshuayi was just a \"choice for this game .\" No sign of Ross Barkley and Antonio Rüdiger needs to get \"properly fit\" following knee and muscle injuries which have kept him sidelined for the best part of seven months. El Mohamady could start his first league game since August after Frédéric Guilbert collected his fifth caution of the season at Old Trafford. And <mark>Dean Smith</mark> may be forced into a second change with El Ghazi a major doubt due to a knee injury, the Dutchman was replaced by Trézéguet after just 18 minutes, and the winger is expected to keep his place. Bjorn Engels has recovered from a hip issue, but the defender will struggle to displace Ezri Konsa who has grasped his opportunity with both hands. Jed Steer (Achilles) is out for around three months, and Jota is training after groin surgery, but he lacks conditioning and will build fitness behind-closed-doors. Southampton--vs--Norwich City The Saints staged a remarkable comeback to take an unlikely three-points in the late kick-off on Saturday, a victory which ultimately cost Sanchez Flores his job. Danny Ings started the ball rolling in the 78 th minute--his seventh of the campaign--before James Ward-Prowse capped his man-of-the-match performance with a stunning free-kick. The pair are responsible for the Saints' last ten league goals. Stuart Armstrong (hamstring) is the only confirmed injury doubt, and the Scot is pencilled in for a return in week seventeen. The Canaries almost made it back-to-back wins, but Arsenal came from behind for a share of the spoils. Pukki got the party underway, and Todd Cantwell followed up his goal at Goodison Park with his fourth of the season. The return of <mark>Christoph Zimmermann</mark> cannot be underestimated, and the big German has offered some solidity to the Norwich backline, something which they missed in his absence. There was no Alex Tettey on Sunday due to personal reasons, and the midfielder is the only one of those who were unavailable in week 14 who stands a realistic chance of returning. Liverpool--vs--Everton Adrián will start in the Merseyside derby following Alisson's dismissal against Brighton. Jurgen Klopp said the \"frozen\" goalkeeper was his man-of-the-match on Saturday after two \"really good saves .\" Ballon d’Or runner-up Virgil Van Dijk was the pundit's choice with two headed first-half goals which helped the Reds to another three-points. Fabinho (ankle) will probably not feature again this year, while there is no timeline for Joel Matip (knee) who was scheduled for a follow-up scan last Friday. <mark>Marco Silva</mark> is hanging on in there, but another defeat here could see the Portuguese boss relieved of his duties with Everton sitting in 17 th just two points above the drop zone. Theo Walcott and Fabian Delph will be checked, but even though Morgan Schneiderlin made the bench on Saturday, the midfielder was not 100 per cent. Jean-Philippe Gbamin, <mark>André Gomes</mark> and Seamus Coleman are already confirmed as out. Sheffield United--vs--Newcastle United Chris Wilder is expected to confirm that his squad have a clean bill of health following the return of <mark>John Egan</mark> (calf) on Sunday. Lys Mousset continued his rich vein of form at Molineux, and his 5-goals have helped the newly-promoted side climb to seventh in the table. Allan Saint-Maximin probably offers Newcastle's biggest attacking threat, so Steve Bruce will be hoping the Frenchman can shake off a minor knock. The additional recovery time for the Thursday night kick-off will undoubtedly help...Andy Carroll should be close after missing out on Saturday with a rib injury, and a decision on DeAndre Yedlin (groin) will be left until late - Javier Manquillo could deputise once again. Jamaal Lascelles (knee) is out while Fabian Schär must be patient after losing his place; the <mark>Federico Fernandez</mark> and Ciaran Clark partnership has worked well with Paul Dummett making up the central trio. Florian Lejeune can be called upon if required. Arsenal--vs--Brighton and Hove Albion Freddie Ljungberg suggested that the performances of Pepe in training meant that the big-money summer signing would not be considered for a starting berth. Indeed, the Ivorian was an unused substitute during the draw at Carrow Road. Shkodran Mustafi was back for the first time on Sunday, but it was the same old Arsenal who were lucky to leave Norwich with a point. There has been very little mention of Rob Holding--not listed on the site as injured--although he has been carrying a knee problem. Héctor Bellerín's hamstring will be tested after missing the last two. No Dani Ceballos until mid-December following his injury in the Europa League. Brighton were very unfortunate to leave Anfield with nothing, after a slow start the Seagulls steadily grew into the game, and following Alisson's sending off, Graham Potter's men took the game to the league leaders. However, the result means that they have now lost 4 of their last six away matches and the Emirates will be another tough test. Aaron Connolly was handed an immediate recall, but with Leandro Trossard and Neal Maupay both champing at the bit to be involved, Brighton have lots of attacking options. It may or may not include Solly March who is managing a slight groin problem. Bernardo returned for the U23s last week, and it remains to be seen whether the full-back is deemed fit enough for the first team after close to three months on the sidelines. <mark>Ben</mark> Dinnery"}, {"articleID": "2014081712_00018096_W", "names": {"Kevin Baker": ["Q3195652", "Q6395772"], "Kevin Thompson": ["Q15460072", "Q21062645", "Q3814856", "Q6397622", "Q6397624"]}, "date": "2014-08-17", "url": "http://seekingalpha.com/article/2429355-chapman-and-hempton-on-herbalife-the-blind-are-leading-the-blind?source=feed_sector_healthcare", "content": "Summary Bill Ackman has claimed, in PSQ's letter, that he will eat the premiums on a new set of options, if necessary, to continue his Herbalife short. Hey Bill, me too! Perry and Soros have trimmed their stakes, as reported by the NY Post a day after \"13/D day\". Bob Chapman has flown off the handle and, in the process of missing the entire point on HLF, misdirected his hostility for John Hempton's Herbalife comments towards Bill Ackman. Also, Bob Chapman appears to be wrong about everything. More on this below. A Small Note What would an early Saturday morning and coffee be without putting down my thoughts on the recent Herbalife developments that have taken place this week? As you'll notice, due to a growing work load on other projects with priority for me, you can expect to see less QTR than you're used to here on Seeking Alpha. This has nothing to do with Seeking Alpha themselves, they've been more than amazing to their contributors and they continue to be one of the best places for crowd sourced content on finance. It's an extremely strong and powerful platform, one that I'm gracious to note has landed me some projects that I'll likely be busy with for the foreseeable future. Because I'll also not likely have tons of time to pen articles and will be putting down a lot of my thoughts in short quips, rather than novellas, I'll also be posting a bit on my newly formed blog, which you can read and bookmark follow me on Twitter, where I'll still be active and will note where and when I'm posting new articles/blogs. Of course, you can always e-mail me, as well (quoththeravensa @ gmail.com). Some people will be saddened by this, others are already chugging champagne and ordering pyrotechnics for the party that will ensue this evening at their respective homes and hedge funds. Regardless of what you think about QTR, I thank you for being a part of it all thus far. We've got lot of beautiful work still to do in the future, I assure you. The Herbalife Soap Opera Continues Now, onto Herbalife. For those of you that missed it, Bill Ackman released his letter to shareholders earlier last week. As usual, Michelle Celarier was the first to summarize the important parts in her NY Post piece that was out Wednesday of this past week: Ackman, who has called Herbalife a pyramid scheme, said he is prepared to extend his $1 billion short bet against the nutritional products company - in the form of put options that expire next year - if necessary. The activist argued that not only is Herbalife's business \"deteriorating,\" but there is \"much greater risk of regulatory shutdown or reform along with further stock price declines,\" according to the letter. Ackman also acknowledged his recent Herbalife presentation flop, saying \"in light of the hype, investors and the media came to the event perhaps expecting recordings of the CEO acknowledging that he had been running a pyramid scheme .\" In a bid to put a positive spin on it, Ackman now claims the dense, three-hour presentation was \"designed for regulators,\" and went on to remake his case against Herbalife's nutrition clubs. \"As a result of our investigation, we are now able to explain and document to regulators that what Herbalife management has deemed\" daily consumption' at nutrition clubs, is in fact a low - income, pyramid scheme concealed within the larger pyramid scheme, \"he wrote. In addition to that, and earlier in the week, Herbalife (NYSE: released a letter to regulators entitled\" Bill Ackman's Attempt to Goad Regulators Into a Baseless, Unnecessary Legal Battle \". It's got a nice ring to it, doesn't it? In this letter - which QTR can only really describe as absurd and dripping with emotion - Mr. Chapman makes a couple of ridiculous assertions, like: Mr. Ackman\" did the wrong thing \"by playing a tape of John Hempton calling company executives\" scumbags \"on CNBC live national television. If you haven't seen the full video of Mr. Hempton defending Herbalife, you can watch it here. Try not to watch it within 3 hours of eating a meal. I've since unblocked Mr. Hempton on Twitter, as I'd like to have a beer with the man some day after this is all said and done. I'm extending an olive garden to him, some will say. That's how the expression goes, right? Unlimited soup, salad, and breadsticks? Whatever. I still contend Hempton has this trade all sorts of wrong. Remember kids, John Hempton was buying the stock\" even though he agrees with Ackman \", Herb Greenberg says to start this CNBC interview. So, he was either pushing his moral compass to the side or he was part and parcel with a group that was trying to orchestrate a short squeeze. Regardless, I'd argue Hempton knows exactly what kind of company this is and his\" unreserved apology \"for his statements he made on air is a product of either doubling down on a shaky case or simply throwing his moral compass to the wind and looking at Herbalife's cash flow and financials the same way that Huckleberry Hound used to look at a steak. I love the label CNBC puts up: Hempton agrees with Ackman, except on facts. No kidding. Hempton's rock solid defense in 2013, well before there was a massive regulatory presence on the scene, was made up of the following verbatim statements, all included in the above link: I short scumbags, I'm pretty familiar with scumbags. Multi-level marketing schemes are scumbags. This one's got 2.5 million people in their chain and Bill Ackman's case is that they rip them off. Well, you know, look at smoking companies. Tobacco companies kill 5 million people a year - twice as many people a year globally as Herbalife has in its network. They're scumbags, but they've returned cash to shareholders for decades and if you've shorted them you've been run over. It buys back stock regulatory, it has a fairly hefty dividend - they're scumbags, but they're the stock market's scumbags. All Herbalife needs to do is find somebody who was fat and is less fat because of Herbalife and somewhere in their 2.5 million distributors there'll be a few of those. And all they do is wheel them out in front of [the FTC]. A thesis that says I have to wait for the government is a bad thesis .\" Nailed it, \"Hempton likely thought to himself after this interview. But I'm calling nonsense here. When you say things like this on live national television, that's pretty much the international queue for asking for people to continue to disseminate it. Isn't that the whole point of going on TV to make your point? Thus, I'd suggest Mr. Chapman have words with Mr. Hempton about his statement, and not attack Mr. Ackman for replaying it. Mr. Ackman was simply dipping into the vault of media out there on Herbalife and it just so happened Mr. Hempton said something he likely regrets now. Next time, perhaps Mr. Hempton will be a bit more calculated with his words. I can only imagine the phone calls Mr. Hempton got from fellow longs after they saw this interview on CNBC. In contradictory fashion, later in his letter, Bob Chapman goes on Even John Hempton's careless choice of words in 2012 [sic] was intended to convey his view that the MLM industry has participants, including some distributers [sic] of Herbalife products, who are overly aggressive and opportunistic. Moreover, that singular statement, no matter how taken out of context by Bill Ackman, did not represent anyone but John Hempton's apparent view at that particular time. Taken out of context? He was calling the C-Level suite at the company\" scumbags \". There's nothing really to take out of context. Dry the\" taken out of context \"excuse out and you can fertilize the lawn of Michael O. Johnson's Malibu home. Bob Chapman's next complaint is as follows: He incorrectly asserts that Seeking Alpha\" articles \"(he puts this in quotes like I'm writing instruction manuals on how to eat frozen yogurt) are trying to shame the regulators into acting. He also asserts that shorts are trying to goad regulators into acting and infers that this is an\" order sent down from Pershing Square. \"With regard to this - who cares if people are trying to goad the regulators into acting? Of course they are. This company is a fraudulent enterprise at its most intrinsic levels. If people were trying to goad regulators into acting on Madoff, do you think history would be kind to them? Personally, I'm not trying this strategy - I already have what I want, and that's simply for these regulators to take a good, hard look. I'm convinced there is too much evidence for them to let this company slide - Alan Hoffman or no Alan Hoffman. Bill Keep and Vander Nat, I'd think, would side with me on this. I know that regulators must move slowly and in a calculated fashion and I accept that. I actually prefer that they do, in order to get things right. The people at these agencies aren't idiots - they're PhDs in business and people with law degrees from prestigious institutions that are critical, logical thinkers. Take note, Mr. Hempton; they don't care what the company's free cash flow is, they're not duped by the temporary circus act of a $1 billion stock buyback - they care whether or not the source of the success you tout is inherently fraudulent. Further, there's no point of goading now - the investigations are all underway. Mr. Chapman, as much as he wants, can't go back and stop the FTC et. al from investigating. The commission voted, the investigation is open. The ball is rolling now - and the facts are on the side of the shorts. We have concrete evidence and proof of how this scheme operates. Ackman has nailed the top distributors to the wall, we've got enough primary source evidence of false income claims, false medical claims, Universidad del Exito, predatory practices, potential mail/wire fraud, and flailing fundamentals to last us the next six lifetimes. It's like Fantasia, the evidence just keeps on coming and coming! On the heels of Mr. Ackman's last presentation and Herbalife's underwhelming earnings report, the short thesis is as rock solid as its ever been. This is the most blatant case of a predatory company (that now could be failing on its own) that I've seen - possibly since I've started investing. Also, to address more garbage claims from Mr. Chapman, my articles are my opinion only. I have never been asked by Pershing Square to write about anything specifically or Herbalife in general, nor do I have any working relationship with them. I'm short because of Pershing Square's original case and then doing tons of my own, furious due diligence. This isn't a case where I went out and got short, and then decided to check my facts. I'm short because I checked my facts first and saw more downside potential than upside potential. It's that simple. I'm not Pershing Square - or anyone's pawn. If Mr. Chapman doesn't like me pointing out things like the\" 24 Ways that Herbalife is Mocking the Regulators \", or he feels that's\" goading the regulators \", perhaps he needs to re-associate himself with the realistic truth behind this company. Additionally, he doesn't have to read me, and I'd encourage him not to. Chapman finishes his piece by speaking on behalf of regulators: That regulators refuse to be cajoled, bullied, prodded, goaded and\" shamed \"into pursuing Bill Ackman's profiteering and self - aggrandizing agenda does not come anywhere close to making them\" spineless. \"This is so obvious that any reasonable observer, Herbalife investor or otherwise, would have to agree. Thank you, Mr. Chapman. Those statements have been duly noted, but I doubt the FBI, FTC, SEC, DOJ, and Attorneys' General need you to stick up for them. They're the ones with the badges and the guns, remember? They're likely not intimidated by Bill Ackman. noted on Wednesday that TheStreet downgraded Herbalife due to the performance they posted in the last quarter: Embattled nutritional supplement firm Herbalife Ltd. (NYSE: HLF) has been downgraded from Buy to Hold NYSE: TST). <mark>Kevin Baker</mark> and colleagues cite\" deteriorating net income, weak operating cash flow and a generally disappointing performance in the stock itself \"as reasons for the downgrade in their report published Wednesday, August 13th. Which brings us to the topic of distributor confidence. Here's where I'd like Mr. Chapman, Mr. Hempton, and other bulls to perk up and listen. While everyone is bickering about regulators and Mr. Ackman, does anyone else get the impression from the company's last earnings report that distributor confidence may be waning? Suppose Mr. Ackman wanted to get the eyes on his last presentation not just for regulators and for the media, but also for all of those people that are currently in Universidad del Exito in South American countries. If you were viewing Ackman's presentation and were in the middle of a time and lifestyle sucking Club 100 endeavor, wouldn't you then start to think twice about what it was you were partaking in? Matt Stewart points out, in a past piece, that many people from countries where Herbalife is extremely popular had tuned into this last presentation. Mr. Ackman was right. It is an Enron style fraud when you look at how Club 100 works. I know why he was hyped up the day before - I know how he was looking at this evidence. It may not have been damning to the people like the nameless ditzy (major news organization) reporter in the room who embarrassed herself with a question during the Q & A, but to those paying extremely close attention to this scheme and how it works - that presentation was a gallon of jet fuel thrown onto an already burning fire of evidence. If Vander Nat, who is presumably working with regulators on this (no one can get in touch with him), had any holes in his thesis to pin this company to the wall, Mr. Ackman's last presentation just filled them like a compressed can of Herbalife\" Fix-A-Flat \". This is a confidence game. If distributor confidence begins to wane, the whole thing is going to be crumbling down from the inside out - even without the help of regulators. Perhaps some of the more\" on the ball \"fund managers are starting to notice this. Bloomberg reported last week that Perry Capital also cut its stake in the name: Perry Capital, the $10.9 billion hedge-fund firm run by ALLY) and Allergan Inc. and cut its holding in nutrition company HLF) during the second quarter. Perry, based in New York, acquired 14.3 million shares of Detroit-based Ally that were valued at $341.2 million as of June 30, according to a filing with the U.S. Securities and Exchange Commission today. Ally was the hedge-fund firm's second-largest U.S.-listed stock holding, after American International Group Inc.. Perry sold 800,000 shares of Herbalife, leaving it with 4 million shares worth about $258 million as of the end of the quarter, according to the filing. It sold out of its 5.2 million shares of the real estate investment trust Equity Commonwealth. reported that George Soros shaved off some of his stake in the company, as well. Headlines are also making their rounds that Mr. Soros believes the market is heading into bearish territory - I'm going to take a good guess and say that his remaining couple million shares are now boxed into a long squeeze. But, that's just a guess. To Conclude The mindset and mental gymnastics necessary for the small few that continue to stay brazenly long this name baffles me. You can tell by the way Mr. Hempton speaks in his CNBC interview that at one point he seemed to know the truth about those running the company and what they were up to. He even admits that the MLM industry as a whole are\" scumbags \". My guess is that Mr. Hempton knows exactly how this game is being played and has been lying to himself about his change of heart. Who knows why he's had his change of heart - perhaps he's been bought off, perhaps he feels he's too far in on the long thesis to turn around - perhaps he's trying to protect people like <mark>Kevin Thompson</mark>, MLM Attorney, whose entire livelihood likely depends on this industry surviving. For the shorts, this may be about the money; but for some of us, it's also about doing what's best for our country and our fellow people. This is a predatory company that should not be allowed to operate the way is currently does. For the bulls, this has always been about the money. If it's not trying to orchestrate a squeeze, it's looking at the cash flow or the buybacks. It's been about how to make a good buck, regardless of how this company is generating it's cash. I continue to contend that this is a global confidence game that will be shut down by regulators - the sooner, the better. Just remember - karma's a bitch. See you all soon, Chapman And Hempton On Herbalife: The Blind Are Leading The Blind Long/short equity, contrarian, special situations, wild cards We only use your contact details to reply to your request for more information. We do not sell the personal contact data you submit to anyone else. Thank you for your interest in Seeking Alpha PRO We look forward to contacting you shortly for a conversation. Our PRO subscription service was created for fund managers, and the cost of the product is prohibitive for most individual investors. At this time, we do not yet have a subscription product for individual investors. If you'd like us to contact you when it's ready, please click here. If you are an investment professional with over $1M AUM and received this message in error, click here and you will be contacted shortly. Thank you for your interest in Seeking Alpha PRO"}, {"articleID": "2016121422_00042750_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-12-14", "url": "http://www.newsmax.com/Politics/White-House-press-conference-access/2016/12/14/id/763993", "content": "Priebus Promises Change of White House Press Corps \"Tradition' (\"The Hugh Hewitt Show\" / YouTube) Wednesday, 14 Dec 2016 04:51 PM Close A A Incoming White House chief of staff Reince Priebus said Wednesday the new <mark>Trump</mark> administration intends to \"revisit\" some of White House press corp's traditional access, declaring \"change is going to happen .\" In an interview on \"\"the conservative host asked Priebus to comment on the White House press corps' reported concern <mark>Trump</mark> will either do away or radically change briefings and other aspects of reporters' access at the White House. The Hugh Hewitt Show,\" It just so happens that we're actually talking about those things right now, and what the new tradition, I guess you could say, should be in the <mark>Trump</mark> White House, \"Priebus said. Priebus offered the example of assigned seating at press briefings--suggesting that might be over .\" You know, this was the first front row assigned seat issue, as I understand it, started in the Obama administration, \"he said .\" In the Bush administration, you just took a seat, and I guess there were a couple of people that have had reserved spots. \"But for the most part, the more formalized reserved seating piece came in over the last eight years. That issue is being talked about .\" Change, he said, is a certainty. \"The traditions, while some of them are great, I think it's time to revisit a lot of these things that have been done in the White House, and I can assure you that change is going to happen, even on things that might seem boring like this topic,\" he said. President-elect <mark>Donald Trump</mark> has had a throughout his campaign and after his election. contentious relationship with the media Related Stories:"}, {"articleID": "2011030318_00038152_W", "names": {"James A. Miller": ["Q19661023", "Q42434306"]}, "date": "2011-03-03", "url": "http://gpb.org/news/2011/03/03/bp-no-bonuses-for-heads-of-gulf-operations", "content": "bp: no bonuses for heads of gulf operations updated: 2 minutes ago bp will not give bonuses to two executives who ran the oil giant's gulf of mexico operations last year: former ceo tony hayward, and the former head of exploration and production andy inglis. first annual report since the disastrous deepwater horizon explosion last april, which killed 11 rig workers and set off the worst offshore oil spill in u.s. history. it also coincides with new calls in america in a video introduction to the document, ceo bob dudley says the tragedy shocked and saddened the company. \"2010 stands as an inflexion point for bp and our industry,\" dudley said. \"we understand that a return to business as usual is not an option .\" dudley will not be getting a bonus for 2010, either. as for hayward, he's now working at tnk-bp, a joint venture between bp and russia's third-largest oil company. the ap reports that his annual salary there is almost $150,000. contacted some folks around the gulf to ask their reaction to bp's decision to withhold some bonuses: mississippi shrimper <mark>james a. miller</mark>, who estimates he lost up to $70,000 in revenue due to the oil spill, said the bp executives should be held accountable for the \"poor decisions they've made .\" \"taking money from them is the least they could do,\" <mark>miller</mark> said. anthony kennon, mayor of orange beach, ala., whose community was hard hit by the oil spill, said he was not surprised by the bp decision on bonuses. \"commonsense would dictate that bonuses are predicated on performance and the oil spill in the gulf is indicative of poor performance to me,\" kennon said. you can follow npr's coverage of the deepwater spill and its aftermath"}, {"articleID": "2009091809_00018627_W", "names": {"Peter Lawrence": ["Q21464120", "Q22278802", "Q42326026", "Q4893533", "Q7175383"]}, "date": "2009-09-18", "url": "http://chardandilminsternews.co.uk/uk_national_news/4636442.Plea_over_Claudia___six_months_on/?ref=rss", "content": "plea over claudia - six months on (from chard & ilminster news) the father of missing chef claudia lawrence has said he did not recognise \"the girl i've known for 35 years\" from accounts of her complex personal relationships. solicitor <mark>peter lawrence</mark> was making fresh appeals for help to mark six months since miss lawrence went missing in york. mr lawrence, who has mounted a relentless campaign to find his daughter, said he was hoping someone would come forward and \"put the family out of their misery\". but he told bbc breakfast: \"there are really no leads at all as to how and why claudia disappeared .\" north yorkshire police detectives previously confirmed they are focusing on miss lawrence's complicated personal life, saying she was involved in relationships of \"complexity and mystery\". in his tv interview, her father said it was difficult to read accounts of his daughter's alleged activities. he said: \"what i read and what i hear is not the girl that i've known for 35 years. she was open about relationships. i've met most of the people that i know she's had relationships with. but she's 35, she's single. but i don't recognise what i read in one sunday newspaper .\" mr lawrence made a tour of tv and radio studios to give fresh impetus to his campaign to track down his daughter and find someone who has \"the vital piece of the jigsaw\". he told bbc radio 5 live he knew about her relationships \"but certainly nothing like the number that at least one so-called friend told a sunday newspaper that he thought she'd had\". looking for a new job in somerset and beyond"}]