[{"articleID": "2019090621_00039004_W", "names": {"Jimmy Kimmel": ["Q20793563", "Q4914"]}, "date": "2019-09-06", "url": "http://ctpost.com/entertainment/article/President-Sharpie-14419977.php", "content": "https: //www.rollingstone.com/politics/political-commentary/trump-hurricane-dorian-sharpie-map-881285/ President Sharpie Trump's lies about Alabama and Hurricane Dorian are no laughing matter Jamil Smith, provided by Published 4:04 pm EDT, Friday, September 6, 2019 Photo: Chip Somodevilla/Getty Images Photo: Chip Somodevilla/Getty Images Image 1 of / 1 Caption Close Image 1 of 1 Photo: Chip Somodevilla/Getty Images President Sharpie 1 / 1 Back to Gallery It is understandable that people laugh at this. There is an inherent hilarity in the doctored map alone, its black Sharpie-d bubble emerging from just north of Jacksonville and curving around the Florida panhandle only to ensure that some slice of Alabama would be jeopardized by this newly enhanced path of Hurricane Dorian. Watching a sitting president display this, proudly and like a school project, on top of the Resolute Desk inside the Oval Office on Wednesday was one of the more surreal moments I've experienced observing American politics--and not just as a journalist. It is difficult to consider anything quite so ridiculous, in the literal sense of the word. After the online mockery commenced, the late-night hosts got to work. It is difficult to fault them for doing their jobs, especially since so much truth is found in comedy. \"Erratic, slow, powerful and destructive. It's like looking in a mirror,\" Stephen Colbert said, imitating Trump while also noting that his Sharpie stunt was actually a federal crime. \"He really must think we're a bunch of idiots,\" <mark>Jimmy Kimmel</mark> remarked. \"I bet he thinks,\" Hey, they let me be president. Let's see what other dumb crap they'll go for. \"' Trevor Noah asked a more existential question:\" Did he draw with a Sharpie? What is life right now? \"More from Rolling Stone Trump to Get Two More Judges On Court That Oversees Crucial Civil Rights Cases Report: Trump Administration Rejects 99% of Student Debt Forgiveness Applicants Colbert Suggests Trump Broke the Law by Drawing Sharpie on Hurricane Dorian Map Noah feigned surprise that Trump could even find Alabama on a map. But as we learned with George W. Bush, mocking the president's stupidity and intellectual laziness has a different resonance when the hurricane comes. This isn't Trump trying to get away with one of his personal fictions or bits of braggadocio. It is simply not funny when anyone, let alone the president, lies about something this serious. Dorian, now a Category 1 hurricane, had already hit the U.S. Virgin Islands last week and lashed Puerto Rico a bit as it went by. On Wednesday, it made landfall Thursday on North Carolina's Outer Banks. Winds of up to 100 miles per hour hit the tourist destination before Dorian moved back out to sea. South Carolina also had to contend with two tornadoes that spun off from the hurricane. As Charleston's streets flooded, its police department felt compelled to post on Twitter,\" Remember, TURN AROUND, DON'T DROWN. \"We have yet to get any confirmation on American casualties outside of the six Florida deaths already reported. But government officials in the Bahamas--which were hit when Dorian was a Category 5 hurricane, the strongest there is--are now reporting at least 30 deaths and expect the final totals will be\" staggering. \"People have died and remain under threat, here in the United States and in allied nations that need our help and resources. Yet this cretin of a president remains fixated not merely on having media battles with his enemies in the press and wherever else while lives are at stake. It may sound old-fashioned or even quaint, but Americans have to be able to believe what the president says. Yes, just about every politician traffics in fiction. But this is a time of national crisis for many Americans, when the water is flooding in or the winds threaten to blow them to kingdom come. And they cannot trust Trump to prioritize their lives over his lie. Related Stories Trump to Get Two More Judges On Court That Oversees Crucial Civil Rights Cases Report: Trump Administration Rejects 99% of Student Debt Forgiveness Applicants Colbert Suggests Trump Broke the Law by Drawing Sharpie on Hurricane Dorian Map This time, it's unclear whether this began with a deliberate lie or Trump merely getting it wrong. Perhaps Trump saw\" all of the Bahamas \"was in jeopardy on a briefing page and his brain read\" Alabama. \"Perhaps he saw an early map predicting lighter winds barely reaching the state and genuinely, idiotically thought that meant that the state would be hit with major damage and decided saying that out loud without any investigation was a good idea. Or perhaps he just wanted to take a tragic event and make it all about himself, even if it makes him look insane in the process. It wouldn't be the first time (this year). No matter why he is continuing to lie about this, it is evident that no one is willing to stop him. I understand Republicans don't seem to give much of a damn about governance. Well, at least they oppose heavy regulations on business or want laissez-faire approaches to everything government does that doesn't relate to civil rights for anyone who is marginalized in America. However, this has become a party that doesn't care whether or not people die. Because that's what it is when they sit idly by as their president whines and wails like a colicky child for a week, not only tweeting madly but inducing his White House to lie for him about Alabama supposedly being in danger when it never was. President Donald Trump speaks about Hurricane Dorian as he speaks to reporters in the Oval Office of the White House, in Washington Trump, Washington, USA--04 Sep 2019 The federal crime he committed in doctoring the map, as confirmed by a White House official to the Washington Post Thursday night, may have been one of his more minor offenses overall. But it was clear and unmistakable. Title 18 U.S. Code 2074 states that\" Whoever knowingly issues or publishes any counterfeit weather forecast or warning of weather conditions falsely representing such forecast or warning to have been issued or published by the Weather Bureau, United States Signal Service, or other branch of the Government service, shall be fined under this title or imprisoned not more than ninety days, or both. \"Trump did that, and proudly, on national television. But the more insidious offense is what Trump is evidencing in his actions. He has shown us previously, through his various authoritarian impulses, that he believes that he does not represent the state or govern the state so much that he is the state. This Alabama mess, contrary to what Al Roker insisted Thursday, is not a distraction. It is part of the whole. We see, in Trump's relentless focus on his own misbegotten truth, an unbreakable grip on a reality that does not exist. It stems from his strange idea of manhood, the idea that a lack of vulnerability and an unwillingness to admit error equals strength--when just the opposite is true. It may not feel as though we have a president right now, what with this one golfing all weekend in Florida as Dorian was bearing down on the nation. But we need one. This union has remained tethered together and functional these past few years in spite of his impulses, not because of them. It is in times of natural disaster, when hurricanes strike, that we see his most glaring weaknesses as a leader. I realize that writing what I am about to write is futile, which is why I haven't done it in a column before. But Trump should resign over this. If he doesn't do so willingly, he should be pressured to do so or impeached immediately. Over this, yes. But he won't leave, and House Speaker Nancy Pelosi likely won't act. Even if she did, Republicans have made clear they'll shield Trump regardless. So we rely upon the plentiful primary field. That is why we need someone who tells the truth unreservedly to oppose this president. It would befit the current frontrunner, Joe Biden, to remember that as he continues to cover up for his own lies and misstatements (about his past Iraq position, most notably). Insisting that the\" details are irrelevant in terms of decision-making, \"as the former vice-president asserted recently to NPR, is a curious approach for someone preparing to run against a serial fabricator. He argues that he is the most\" electable, \"but Biden is playing a game that Trump already knows how to win. I guess he truly is a Democrat. Sign up for Rolling Stone's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram. View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2013050505_00061620_W", "names": {"David Brooks": ["Q16105043", "Q19948555", "Q27909737", "Q28498255", "Q31151243", "Q5231788", "Q5231789", "Q5231790", "Q938475"], "John Hood": ["Q19325421", "Q30603484", "Q56597744", "Q6239743"]}, "date": "2013-05-04", "url": "http://www.rockymounttelegram.com/opinion/columnists/john-hood-unemployment-improvement-reflects-well-gop-1971655", "content": "Gail Collins: In South Carolina, the \"luv guv' makes his last stand Scott Mooneyham: A minor league system would address what ails college sports Maureen Dowd: The president has a responsibility to nudge Congress Thomas Friedman: Fayyad's transparent leadership a rarity among Palestinians <mark>David Brooks</mark>: Health care reform - and its frustrations - are here to stay <mark>John Hood</mark>: After 100 days in office, McCrory has become Gov. Fix-It\" People generally quarrel, \"G.K. Chesterton once wryly observed,\" because they cannot argue. \"To the extent North Carolina politics looks increasingly quarrelsome at the moment, it is because of a breakdown of argument - of constructive debate among people of good faith who happen to disagree on public policy. Instead, traditional and online media alike are filled with venom, personal attacks, conspiracy theories and overall boorishness. The Republicans now in power in Raleigh campaigned for and won their offices on the basis of specific policy promises. They promised to reform North Carolina's decrepit, anti-competitive tax code and regulatory process. They promised to reduce government spending on bloated transfer programs and pork-barrel schemes in order to free up resources for core public services and tax relief. They promised not to hasten the implementation of what they perceive as the disastrously counterproductive Affordable Care Act. And they promised to enact a voter identification bill. For the most part, GOP lawmakers and the new Pat McCrory administration have delivered on these promised policies, or are in the midst of doing so. They deserve no deference simply because they are currently in power. Our political system doesn't work that way. The public deserves a debate about these proposals (and Republicans ought to welcome it as a means of sharpening their own arguments). There's an important distinction, however, between spirited debate and character assassination. Republicans don't favor tax cuts, regulatory reform, energy exploration or school choice because some shadowy special interest group has paid them off. Republicans favor these ideas because they believe them to be good public policy. They believe cutting taxes and reforming regulations will improve the state's economy in the short run and that energy exploration and school choice will improve the state's economy in the long run by upgrading physical and human capital. Republicans have believed these things for a very long time - way before they were in the majority and showered by special interest cash and attention. The Republicans could be mistaken, of course. Their critics ought to construct valid arguments to that effect. Some do. But others have chosen to question the Republicans' intentions, honesty or sanity. Why? One reason is that such tactics get attention. They generate online traffic and checks from true believers (this dynamic is evident on both sides of the aisle). Another reason, however, is that consequentialist arguments against the GOP agenda are premature. On the top issue facing North Carolina, economic growth, it is difficult to argue that Republican policies have failed when they are, at most, two years old. Moreover, the state's economy is performing better today than it was when the GOP captured the legislature in 2010, creating an obvious rhetorical challenge for the party's critics. In December 2008, North Carolina's unemployment rate was 8.4 percent. Over the next two years, the jobless rate skyrocketed and then fell slightly, to 10.5 percent in December 2010. On the broader measure of unemployment and underemployment, North Carolina averaged 17.4 percent in 2010, up from 11.3 percent in 2008. During the same two-year period, the state's economy shed a net 158,000 jobs. Since the end of 2010, by contrast, the state's economy has added some 157,000 net new jobs. As of March 2013, the jobless rate has fallen to 9.2 percent and the broader rate to 16.2 percent - still high rates (partly because of continued migration of job seekers to North Carolina) but on a downward trajectory. It would be unwise for legislative Republicans to claim credit for this modest but welcome improvement in North Carolina's economic momentum. There are many factors at work. Still, it would be even more unwise - and unpersuasive - for their critics to try to construct an empirical argument against the state GOP's economic policies in light of these statistics. Look Up Opinion Now Define Words Quickly-Free Download!"}, {"articleID": "2010010812_00035121_W", "names": {"William Cole": ["Q18922393", "Q21464490", "Q21464495", "Q8006976"]}, "date": "2010-01-08", "url": "http://bulletin.aarp.org/states/md/2010/1/articles/opinion.html", "content": "thank you for submitting your comment or question to aarp bulletin today. your post is now on its way to the appropriate bulletin writer. due to the large volume of communications we receive, we regret that we cannot answer or acknowledge all correspondence. dan rodricks jan. 8, 2010 (mcclatchy-tribune regional news delivered by newstex)--in stephanie c. rawlings-blake, baltimoreans get a young, bright and serious new mayor who could bring some urgently needed stability to city government even as she faces one of the toughest fiscal challenges in municipal history. she's the no-drama queen, and that should suit everyone around here just fine. faced with a projected budget shortfall of $127 million or more in the coming fiscal year, the last thing baltimoreans need from city hall is more drama. i interviewed rawlings-blake, along with city councilman <mark>william cole</mark>, on tuesday for my \"midday\" radio show on wypr. i found the city council president conversant in the nuances of the city budget and drawn to the challenge to fix it. she reminded me of her father. until his death in 2003, howard \"pete\" rawlings was one of the most influential and principled legislators in annapolis, a delegate from baltimore who served many years as chairman of the house appropriations committee. he was a master of things fiscal. a math professor, pete rawlings probably understood the state's operating budget better than anyone, and the more vexing the challenges, the more he seemed to thrive. rawlings loved to work the numbers, and he liked to remind his colleagues that keeping maryland's fiscal house in order was their most important duty. pete rawlings would have been proud to hear his daughter talk budget on the radio the other day. on the $127 million shortfall in fiscal 2011, rawlings-blake said: \"it's a very serious prediction. i don't see a lot changing, but we have to stay focused on having diverse revenue streams for the city. we can't just depend on property taxes. we certainly can't depend on income tax when people are losing jobs, when people's salaries are being decreased. we have to look at diversifying our revenue and being smarter about our spending. we have to focus on our priorities, get rid of any frivolous spending and do what families are doing all over this city--do more with less.\" you know, \"she said,\" we're going to weather this storm, and when we get on the other side of it, we need to know that we're not losing ground in public safety and public education. \"i asked about the city's current policy of rotating firehouse closures as a way to save money.\" i have a lot of respect for chief [jim] clack because he was one of the only administration leaders who came into the budget hearing and was brutally honest about the impact the reduced budget would have on his department, \"she said.\" a lot of people want to paint a rosy picture and say, \"ok, cut my budget and it won't affect anything .' he was very clear--you cut my budget and this is what will happen. and the rotating closures, he made it clear, was making the best out of a bad situation.\" callers to the radio show offered ideas to fix baltimore's money problems. have an amnesty period for people who owe parking fines, said a man from ellicott city. \"a few years ago i had the same idea and was given a very interesting lesson by the finance department,\" rawlings-blake said. \"when we took a look at the money that comes in for an amnesty and the revenues lost, it's really not a great thing for the city. if people think every three years there's going to be amnesty, that affects behavior--people don't pay, they wait for the amnesty.\" another \"midday\" listener suggested that the city increase home ownership by renovating some of the thousands of vacant rowhouses here. rawlings-blake acknowledged that as a good idea but then added her own take, pushing for slot machine revenue--pete rawlings was a longtime advocate of legalizing slots--and finishing with the kind of upbeat, cheerleader-like flourish baltimoreans like in their mayors: \"there are other ways to increase home ownership. one of the things we're all hoping for is moving forward with slots, to get the revenue and start to bring down the property tax rate. if we can make our property tax more competitive, people will realize the possibilities for baltimore ....we're starting to see people from the surrounding jurisdictions come for our charter schools, come for our transformation schools, come for our top high schools. people want to be here, but they're facing these impediments, and if we can start to bring that property tax down, we'd turn it around and fill some of these vacant homes and build our tax base as well.\" for a lot of baltimoreans, the first and lasting impression of stephanie rawlings-blake was that of pete's daughter, the 24-year-old political novice and the youngest person ever elected to the city council."}, {"articleID": "2018042717_00193244_W", "names": {"Richard Drew": ["Q1531836", "Q53350768"]}, "date": "2018-04-27", "url": "http://ctvnews.ca/sci-tech/distracted-by-technology-microsoft-tries-to-help-1.3905375", "content": "Distracted by technology? Microsoft tries to help Windows 10 operating on a Microsoft Surface computer in New York. (<mark>Richard Drew</mark> / AP) Matt O'Brien, The Associated Press Published Friday, April 27, 2018 1:33 PM EDT Technology companies whose devices and constantly scrolling online services have driven us to distraction are beginning to acknowledge that their products can be a waste of time. Some of them now say they're trying to help. Microsoft is rolling out a free update to its Windows 10 computer operating system Monday with new features to keep people in a distraction-free zone. The \"Focus Assist\" feature enables workers to temporarily switch off email and social media notifications during times when they need to keep their heads down. They can allow messages from certain people to break through. Microsoft says the update is inspired by research showing office workers are being interrupted or having to switch tasks about every three minutes--and it takes 23 minutes to get back in focus. Microsoft is also adding a \"Timeline\" feature aimed at saving time by more easily retrieving documents or unfinished work from the past 30 days. \"Almost every application and web service is vying for your attention,\" said Aaron Woodman, a marketing general manager for Microsoft Windows. \"Increasingly, people are going to prefer environments where they can control and manage their distractions.\" It may be easier for Microsoft to create such limits, as its business is far less reliant on advertising than Google and Facebook. With advertising in the mix, more time spent means more revenue. Apple's iPhone and Google's Android phones have \"Do Not Disturb\" modes for muting notifications. Microsoft's biggest email rival, Gmail, began rolling out a redesign this week that includes time-saving measures. One uses artificial intelligence to allow Google to help respond to emails with quick answers such as \"Will do, thanks!\" or \"Sorry, I won't be able to attend.\" Facebook CEO Mark Zuckerberg surprised investors earlier this year when he said he welcomed the idea of fewer hours spent on his site, arguing that \"helping people connect is more important than maximizing the time people spend on Facebook.\" The social network also on Friday said it is adding a \"sleep\" mode to its Messenger Kids service to let parents limit when their kids can use it. Related Stories"}, {"articleID": "2011083114_00014838_W", "names": {"Albert Hall": ["Q1387383", "Q4710404"], "Hannah Jones": ["Q16207950", "Q28324967", "Q5648859"]}, "date": "2011-08-31", "url": "http://celebrity.uk.msn.com/news/gossip/articles.aspx?cp-documentid=159019656", "content": "leann rimes and giuliana rancic row over skinny jibe former spice girl mel c arriving at mikhail gorbachev 80th birthday gala at royal <mark>albert hall</mark> where she performed at the charity concert, in london. former spice girl mel c has joined peaches geldof in saying she regrets getting tattoos. the 37-year-old has about 10 inkings on her arms, back, legs and stomach, including tibetan symbols and the word \"angel' above her navel. but she sometimes regrets having them done as she is often forced to hide her inkings with cosmetics as they're in such prominent places on her body. the singer told british newspaper the observer:\" i feel quite confused about my tattoos; it's a love-hate relationship. \"the thing about tattoos like mine is that you have to cover them up if you're trying to go about your business quietly.\" naomi campbell gets tied up the supermodel gets all tied up for a very special photo shoot in spain's v magazine? the reality tv star has opened up about her body, and what her ex-fianc? really thought about it? celeb good week/bad week: 26 august another week, another seven dramatic days in celebland. find out which stars have had a good week and those who have had a week they would rather forget? <mark>hannah jones</mark> investigates. celebrity birthing secrets we uncover how celebrities choose to give birth? and it's not all epidurals and birthing pools! dermot: \"no one talks to gary!' dermot o'leary has claimed no one dares to talk back to new x factor judge gary barlow. from scoring long lashes, to a simple tip that makes foundation actually look real, here are the 10 make-up tricks that no girl should be without. twitter has been buzzing with people suggesting baby names for beyonce & jay-z's new addition! which of these possible names should they use?"}, {"articleID": "2019090915_00127704_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-09-09", "url": "http://www.times-series.co.uk/news/national/17889786.us-air-force-to-review-international-stays-trump-resort-bookings/", "content": "US Air Force \"to review international stays' after <mark>Trump</mark> resort bookings By Press Association 2019 <mark>Trump</mark> Turnberry 0 comment The US Air Force has reportedly ordered a review into how it chooses accommodation for international trips after it emerged that crew members had stayed at the <mark>Trump</mark> Turnberry resort. It comes as US President <mark>Donald Trump</mark> is being investigated over a potential conflict of interest involving increased US military spending at Glasgow Prestwick Airport and visits to the luxury resort at nearby Turnberry in Ayrshire. Air force chiefs have\" directed Air Mobility Command to review all guidance pertaining to selection of airports and lodging accommodations during international travel \", according to a statement published by Politico. Over the weekend it emerged that crew from a C-17 shared by the USAF and the Alaska Air National Guard stayed at <mark>Trump</mark> Turnberry when the aircraft stopped at Prestwick en route to Kuwait. I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME--<mark>Donald</mark> J. <mark>Trump</mark> (@ realDonaldTrump) September 9, 2019 Mr <mark>Trump</mark> tweeted on Monday afternoon that he knew\" nothing \"about the incident. He wrote:\" I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!). NOTHING TO DO WITH ME. \"In the statement published by Politico, the USAF said:\" While initial reviews indicate that aircrew transiting through Scotland adhered to all guidance and procedures, we understand that US Service members lodging at higher-end accommodations, even if within government rates, might be allowable but not advisable. \"Therefore, we are reviewing all associated guidance.\" Even when USAF aircrews follow all directives and guidance, we must still be considerate of perceptions of not being good stewards of taxpayer funds that might be created through the appearance of aircrew staying at such locations (review will include active duty, Guard Reserve). \"<mark>Donald Trump</mark> playing golf at <mark>Trump</mark> Turnberry (Andrew Milligan/PA) The USAF said its aircraft, primarily C-17s, have increasingly used Prestwick as a stopover location between 2015 and 2019 due to factors such as its 24-hour operations, its large parking area and its location on the route of flights to and from Europe and the Middle East. US congress has launched a probe into whether increasing expenditure at the airport and allegations of cut-price deals at Mr <mark>Trump</mark>'s Ayrshire golf resort offered to visiting US military personnel is a violation of the American constitution. Following reports of the airport offering\" cut-price rooms for select passengers and crew \"and free rounds of golf at Turnberry for US military staff and civilian air crews, Mr <mark>Trump</mark> has been warned his financial stake in the resort raises questions about the increase in airport spending. 0 comment"}, {"articleID": "2010100504_00047242_W", "names": {"Anita Alvarez": ["Q26329083", "Q4765491"], "Mark Carter": ["Q3294023", "Q6767021"]}, "date": "2010-10-05", "url": "http://chicagotribune.com/news/ct-met-stroger-aide-arrested-20101004,0,4512886.story?track=rss", "content": "ct-met-stroger-aide-arrested-20101004 cook county board president todd stroger faces felony charges stemming from an investigation into whether she steered hundreds of thousands of dollars in contracts to her own public relations firm and associates who might not have done any work. deputy chief of staff carla oglesby's arrest is the latest blow to stroger, who enters his final two months in office buffeted by political defeat and the growing scandal that followed. oglesby pushed through a series of so-called 24-9 contracts that fell just under the $25,000 threshold for county board approval, angering many commissioners. on monday, some commissioners suggested oglesby's arrest should be the tipping point for putting the stroger administration into a caretaker role until a new county board president is elected nov. 2 and takes office in early december. stroger did not respond to a message left on his cell phone, but his spokesmen said stroger would have no comment before learning more about the charges leveled against oglesby, the spokeswoman for his failed democratic primary re-election campaign. stroger put her on the county payroll after his loss .> oglesby was arrested on a warrant as she pulled her vehicle out of a downtown parking garage shortly before 4 p.m. monday, said sally daly, a spokeswoman for state's attorney <mark>anita alvarez</mark>. oglesby is expected in court tuesday morning for a bond hearing. \"(oglesby) left work early, and she was seen entering her car,\" daly said. \"our investigators moved in, and as she was exiting the garage, they blocked her car and she was arrested without incident.\" oglesby is charged with felony theft of government services, money laundering and official misconduct, daly said. the government services count carries a sentence of 6 to 30 years upon conviction. \"i can tell you that at the state's attorney's direction, our investigators arrested her this afternoon as the result of a long-term investigation generally about the 24-9 contracts and her involvement with them,\" said dan kirk, chief of staff to <mark>alvarez</mark>. \"(oglesby) is being processed at the chicago police facility at homan square and will appear in bond court tomorrow.\" an attempt to contact oglesby's attorney for comment was not successful. at least a dozen of the contracts, worth a total of nearly $250,000, are being looked at by county inspector general patrick blanchard, who has been working with <mark>alvarez</mark>'s office for months. part of the investigation focused on whether any work was actually done in exchange for the contract payments, which were made at the time of approval, rather than upon the completion of work, as is usual. one of the payments went to cgc communications, a firm owned by oglesby, and another went to a firm that didn't even register with the state until the tribune started asking questions about how it got the deal. stroger briefly suspended oglesby earlier this year from her $120,000-a-year county job after reports that she authorized a $24,975 contract to cgc, which was supposed to inform suburban residents about federal flood relief grants. oglesby, the one-time promoter of sports stars and hip-hop artists, sought approval for all of the contracts, records show. she also played a role in authorizing nearly $150,000 in payments for census outreach contracts, which were given to people recommended by oglesby and eugene mullins, stroger's spokesman and childhood friend. those payments were to be repaid with federal grant money, but the county ended up eating the costs after it was determined they were not eligible for the grant program. one of those contracts was the one with cgc. another went to arrei management inc. under a proposal by cgc's director of strategy and marketing. arrei's task was to \"build awareness of the (county's) composting and electronic collection programs.\" <mark>mark carter</mark>, arrei's owner, is a west side activist who helped circulate pro-stroger fliers during the campaign that referred to the eventual winner, chicago ald. toni preckwinkle, as \"aunt je\" mamie, \"documents reveal. two of the census contracts went to companies run by men who belong to the rap duo dude 'n nem, best known for the single\" we are going to mcdonald's. \"in another case, oglesby sought approval of a contract with alliance media and marketing to\" build awareness of (county) energy and conservation programs. \"alliance media was incorporated may 24, after the tribune asked why it was not listed as a corporation in state records. the county board meets tuesday, and oglesby's arrest will loom large. in may, commissioners voted to put new restrictions on stroger's authority over spending in the last months of his administration, including requiring him to report within three days all contracts not preapproved by the board.\" i think this should cause the stroger administration to basically end now and go into a caretaker role, \"said commissioner larry suffredin, d-evanston.\" the 24-9 contracts that were awarded behind the board's back were totally inappropriate, \"said commissioner timothy schneider, r-streamwood.\" i think a statement is being delivered with this arrest that waste and corruption cannot be tolerated in cook county. \"tribune reporter serena daniels contributed to this report"}, {"articleID": "2016121618_00284063_W", "names": {"Gareth Edwards": ["Q1381089", "Q21461670", "Q2451678", "Q5522829", "Q5522830", "Q5522832"]}, "date": "2016-12-16", "url": "http://dailyherald.com/article/20161216/entlife/312169897/", "content": "LOS ANGELES--\"Rogue One: A Star Wars Story\" blasted into theaters with a $29 million opening night, according to Friday estimates from Disney. It's the biggest Thursday preview of 2016, narrowly topping \"Batman v. Superman: Dawn of Justice's\" $27.7 million and \"Captain America: Civil War's\" $25 million. But it doesn't hold a candle to last year's Star Wars installment \"The Force Awakens,\" which brought in a record $57 million from Thursday night showings. Directed by <mark>Gareth Edwards</mark> and set before the events of the original 1977 \"Star Wars,\" \"Rogue One\" is the first in a series of planned spinoff films set in the Star Wars universe. It's expected to earn over $130 million this weekend, which would make it the second-biggest December debut ever behind \"The Force Awakens,\" which fetched $247.9 million."}, {"articleID": "2009102903_00043748_W", "names": {"Ron Smith": ["Q15429434", "Q16151519", "Q16214918", "Q20640642", "Q20732311", "Q21598352", "Q28455021", "Q30069157", "Q3441453", "Q7364400", "Q7364401", "Q7364402", "Q7364403", "Q7364404", "Q7364405", "Q7364406", "Q7364407", "Q7364409"]}, "date": "2009-10-29", "url": "http://recorder.ca/ArticleDisplay.aspx?e=2150934", "content": "posted by <mark>ron smith</mark>, sports editor this has been a great opportunity for local gymnasts. the brockville gymnastics academy has had the wonderful fortune to have former canadian olympic team gymnast heather purnell helping coach the club's young athletes for the past several months. the 22-year-old purnell, who will celebrate her 23rd birthday in the middle of next week, has been working with the club's pre-competitive gymnasts, preparing them for their provincial qualifiers that begin in december. \"i think it's been great to have someone with that resumé. she's brought a lot of experience and a lot of ideas to us,\" said brockville head coach kim charbonneau - speck. \"that's been good for our competitive kids.\" purnell was the captain of the canadian team when she was the 17-year-old member of the olympic team in 2004 in athens, greece. she competed at the pan - am games, finished in second place at the all-around category in the 2002 and 2003 canadian championships and was a former canadian junior all-around champion. the three-year member of the stanford university gymnastics team was looking for somewhere to help coach. with her parents now living in merrickville, it was closer to come to brockville than her native ottawa. plus, she knew charbonneau-speck previously. \"i feel it's good for the kids to see someone like heather, who competed in the 2004 olympics, who went on to stanford and then to cirque de soleil,\" said charbonneau - speck. \"that shows them the sport doesn't have to end at an early age. there are other opportunities to move forward.\" she contacted charbonneau - speck about a possible coaching opening and she who was only too happy to welcome purnell's expertise. \"it's really nice coming in, coaching in a good club like this,\" said purnell during a break in a four-hour practice session on sunday morning. \"it's really good to come in and have them soak up everything i can give them.\" with the young group, purnell has been concentrating on coaching the basics and fundamentals of the sport, working with conditioning. \"right now, we're working on a lot of basics and strengthening. you can't do the moves if you're not strong enough to do it,\" said purnell. \"if you're trying to do skills that are too much and you don't have the basics, it's too dangerous.\" she's enjoying the new coaching aspect of her life, even though she might have to leave in the next few weeks. \"the most important thing for them (the athletes) is to have fun at this age,\" said purnell. \"that's important. it's not doing all the tricks you see on television. it's training and working and you have to make sure they have fun at it.\" purnell was impressed with the quality of the coaching at the brockville club for the young gymnasts. \"it's nice to be here. it's important they (young kids) have something to keep them busy,\" said purnell. \"so often now, kids are watching tv. to be active and have a solid network with other young kids is really important.\" purnell is in limbo right now with her future up in the air. she's thinking about returning to school to do graduate work in clinical psychology along with waiting to hear from an audition for cirque de soleil. st. lawrence shakespeare festival - 2010 daily dollar lottery calendar"}, {"articleID": "2015092102_00054603_W", "names": {"Josh Morris": ["Q1354591", "Q19604839", "Q3185992"]}, "date": "2015-09-21", "url": "http://www.thecourier.com.au/story/3362433/legislative-council-condemns-ballarat-rrl/?cs=12", "content": "The Legislative Council of the Victorian Parliament has agreed to Ballarat MP <mark>Josh Morris</mark>' motion condemning Labor's failed roll out of the Regional Rail Link. Ballarat MP <mark>Josh Morris</mark> and Opposition leader Matthew Guy at the Ballarat Train Station. The Victorian Parliament's Legislative Council has agreed to Ballarat MP <mark>Josh Morris</mark>' motion condemning Labor's failed roll out of the Regional Rail Link. The motion called on Minister for Public Transport Jacinta Allan to return the Ballarat line to the pre-roll out timetable and was agreed to on September 16. \"I'm glad that Jacinta Allan is being held to account for her poor performance and for subjecting Ballarat commuters to months of delays, overcrowding and cancellations,\" Mr <mark>Morris</mark> said."}]