[{"articleID": "2018032915_00074857_W", "names": {"John Jackson": ["Q11978993", "Q14951093", "Q1700314", "Q19874601", "Q25171910", "Q27898568", "Q44476143", "Q51589313", "Q6241376", "Q6241393", "Q6241395"], "Bob Higgins": ["Q17155736", "Q25081814", "Q4932792"], "George Lang": ["Q129737", "Q48784746", "Q5541536"], "Scott King": ["Q2260899", "Q3952845", "Q58926388", "Q6379730", "Q7436621"]}, "date": "2018-03-29", "url": "http://www.whio.com/news/new-moraine-city-manager-get-145k-return-his-home-county/tFKqovosTxxWIMrzfYECtO/", "content": ">> Read more trending news TMZ reported that, according to unnamed sources, Emily B, 37, called police and told them Fabolous, 40, had hit her. Fabolous was with his attorney at the police station. According to TMZ, he was cited for the alleged assault and given a ticket for his court appearance. He did not go to jail. According to HipHopDX, Fabolous and Emily have been together for over 10 years. Although Fabolous has not commented directly on the report, HipHopDX reported he posted \"2018 tryna break my heart,\" in an Instagram story early Thursday. Billboard reported that the rapper, whose real name is <mark>John Jackson</mark>, has two kids with Emily, Jonas, 2, and Johan, 10. Trending - Most Read Stories Carpenter seeks to win 7th straight countywide election \"They saw that bicycle as a symbol of hard work,\" said the four-term township trustee. Now he campaigns for Butler County Commission, running against incumbent Commissioner Cindy Carpenter for the GOP nomination in the May 8 primary. He has since upgraded from his bike to a small Segway which allows him to go door-to-door faster. And that one-on-one contact with voters is at the heart of his campaign. \"People see this as shoe-leather politics, going door-to-door, and people see that you are hard-working and honest,\" said Wong. But being a politician, and in campaigning, Wong said he has developed a thick skin. \"I've been to some houses, they've slammed the door on me,\" he said. \"It's life; you have to have thick skin.\" This month, this news organization is profiling the two candidates vying for the Republican nomination in the Butler County Commission race. This is the second of those profiles. Wong came to America in 1971 as a student in Chicago, and never had an interest in becoming a politician or going into public office. That all changed after he was attacked. \"That changed the course of my career,\" he said. CAMPAIGN 2018: What candidates for notable Butler County officers can do to win in May He enlisted in the Army and spent 20 years there from 1975 to 1995, most of that time as a special agent in the Criminal Investigations Division. He later took a job with Butler County in the court's probation department. \"I want to make this a better community than how I found it,\" Wong said. \"This is why I am involved in civic matters.\" And now that he's fully retired, he said he has the time to do it. Wong was the first candidate <mark>Bob Higgins</mark> on Cherry Blossom Lane in Liberty Twp. saw as he went door-to-door a couple of weeks ago in the Four Bridges neighborhood. He appreciated Wong taking the time to hear from the public. \"We don't know about the people we're voting for if we just see a picture until we can come out, shake their hand and know about them as a person,\" said <mark>Higgins</mark>, who is undecided on who he'll support on May 8. While there are many issues the County Commission will have to deal with in the future--from population growth and infrastructure needs to jobs and the economy--Wong said the top issue he hears from voters is about property taxes. \"The property tax is too high. This area (in the Four Bridges neighborhood), they pay over $10,000 (a year).\" He said there needs to be some control on the levies because people are paying too much. \"In West Chester, we stretch the levies. Our police levy, we'll stretch a five-year levy for five or 10 more years,\" he said. \"You've got to stretch it.\" Some, including Carpenter, have questioned Wong for running for an office just months after winning an election. But Wong said as a probation officer with Butler County, he could not seek a partisan office. He's since retired, and also said, \"I have enough experience to do it for the larger office.\" But this is the largest office Wong said he intends to seek, saying, \"I want to stay local.\" \"This is where I would serve best,\" he said. \"I'm a people person. I get out and people know me. Most of the people have seen me before.\" Wong did unsuccessfully attempt to seek the Butler County GOP's recommendation to succeed former lawmaker Margy Conditt as the 52nd Ohio House District appointment this past September. The Ohio House appointed former West Chester Twp. Trustee <mark>George Lang</mark> to that seat. Trending - Most Read Stories PHOTOS: Check out this nearly $1M Beavercreek home with outdoor pool \"The memory of someone's birth is not important but the memory of someone's death is much more important because its about what they've done and who they are,\" said Daryl Ward, pastor at Omega Baptist Church. \"That's why April 4 is so important to me.\" Locally, Carillon Park, the University of Dayton, Wright State University and Omega Baptist Church are expected to participate and organizers said dozens of others will too. The commemoration is a \"fitting tribute\" to <mark>King</mark>, said Brady Kress, president and CEO of Dayton History which oversees Carillon Historical Park. The park has tolled its bells to mark just a few occasions, including the anniversary of the death of former president John F. Kennedy as well as the attacks on Pearl Harbor and Sept. 11, 2001, Kress said. \"This is one that we thought we'd do and was the right thing to do,\" said Brady Kress, president of Dayton History. \"We wanted to pay our respects.\" <mark>King</mark> visited the Dayton region several times and has dozens of connections to the area. He gave commencement speeches at Central State University, Wilberforce University and Antioch College. His wife, Coretta <mark>Scott King</mark>, was also an activist and graduate of Antioch, where a building now bares her name. In 1964 <mark>King</mark> spoke at UD and he was also presented the key to the city. RELATED: Ohio State says a high GPA works against young women job hunters Along with the bell toll, both Wright State and UD will host activities to honor <mark>King</mark>. At Wright State, students will be able to watch a live stream of programs taking place at the National Civil Rights Museum beginning at 11 a.m. and students and community members will gather at the campus ministry center at 7 p.m. to reflect on <mark>King</mark>'s death, according to the university. UD will host a viewing of the last speech <mark>King</mark> right before he was assassinated at 7 p.m. on Tuesday and the public is invited to gather at the university's memorial to <mark>King</mark> for a brief remembrance at noon on Wednesday followed by a procession to a 12:30 p.m. Mass.. Terri Freeman, a UD alumna who serves as president of the National Civil Rights Museum will speak at an event int he Kennedy Union ballroom at 7 p.m., April 12, according to the university. The year of <mark>King</mark>'s assassination--1968--was a challenging one for Americans, said said Roger Crum, a UD art history professor and member of the school's planning committee that helped organize the April events for <mark>King</mark>. In a lot of ways, the tensions of 1968 are similar to cultural and racial issues that erupted recently in response to police brutality and the violence in Charlottesville, Virginia, he said. \"These are not strictly historical issues. They remain contemporary issues,\" Crum said. Below we have listed a few recipes that are sure to be a hit: Peeps Make use of seasonal peeps to add extra decoration and make your dessert stand out. Hot cross buns Hot cross buns isn't just a song you had to play on that recorder in fifth grade, but a traditional treat this time of year. A 12th-century monk was the first to mark the buns with a cross when he was baking them on Good Friday. The buns gained in popularity in England until they became a symbol for the holiday weekend, according to Smithsonian.com. Easter Bunny No Easter is complete without a visit from the Easter Bunny. With these sweet treats, family members and children are sure to have a hoot. Rice Krispies nest Add some color to your dessert table with these festive colorful nests. Marshmallow bark For those who have a sweet tooth and love four-ingredient recipes, this is the one for you. Chocolate lasagna Any family get-together is not complete without having a little chocolate (or a lot). This dish is sure to have your family talking for years to come. Trending - Most Read Stories"}, {"articleID": "2013110219_00017170_W", "names": {"Michael Hooper": ["Q6831231", "Q6831232"]}, "date": "2013-11-02", "url": "http://www.DailyFinance.com/2013/11/02/food-stocks-provide-steady-dividends/", "content": "DailyFinance newsletters may offer personalized content or advertisements. Which Consumer Food Stocks Should Dividend Investors Consider? Dividends have historically made up a large percentage of overall gains made by investors. Picking long term dividend-paying winners is no easier than picking winning stocks but those looking for steady dividends may want to consider owning food stocks. This is because companies like J.M. Smucker Co.. profit from consumers' insatiable appetite for chocolate, peanut butter and jelly. It's hard to imagine any of these products going anywhere anytime soon. Chocolate and grape jam aren't the only products that are irreplaceable to consumers. Kellogg Co. owns a big bite of the cereal market, and ConAgra leads the frozen dinner market with its Healthy Choice meals. Hershey dominates the North American chocolate market and Smucker leads in jellies, jams and coffee with its Folgers brand. Dividend yields for these food companies range from 2% to 3%. An ETF in this space is PowerShares Dynamic Food & Beverage Portfolio ETF. One of the reasons Warren Buffett bought See's Candies was its ability to raise prices while maintaining and growing its customer base over time. Buffett bought See's Candies for $25 million in 1972 and later invested another $32 million into the business. Over the ensuing decades the company returned more than $1.3 billion to Buffetts' company. Buffett once called See's Candies the \"prototype of a dream business.\" We Fools may not be able to find another See's Candies, but there are some great food companies out there. The following chart compares investment data on four food companies and an ETF. Payout Ratio Net Margin Forward P/E YTD Return Dividend Growth Since 2009 Hershey 2% 49.04% 10.65% Smucker 2.1% 41.28% 9.52% 18.88 2.95% 65.91% 6.52% 16.55 3.15% 62.46% 3.94% 13.65 8.44% N/A N/A N/A 30.70% 26.92% PBJ is a non-leveraged ETF that tracks the Dynamic Food & Beverage IntellidexSM Index, which is about 30 U.S. food and beverage companies. The ETF's gross expense ratio is 0.63%. The ETF's top four holdings are Archer-Daniels Midland, 5.39%, General Mills, 4.82%, Flowers Foods, 3.03%, and Boston Beer Co, 2.97%. The ETF was up 30.70% through Oct. 31. Food and beverage stocks are sensitive to commodity prices. When pricing is fairly stable, it's easy to predict margins. Right now stable-to-falling commodity prices should benefit food companies. It goes without saying that Foolish investors should always be on the lookout for companies with high profit margins and steadily rising dividend. Hershey commands a 10.65% profit margin, the best of the group, and a dividend that is up 51.66% since 2009. Smucker isn't far behind with 9.52% margin, and a much higher dividend increase at 60.58%. Kellogg has a 6.52% margin and ConAgra's margin is only 3.94%. ConAgra's earnings were only $0.34 in first quarter 2014, down 44% from $0.61 earnings in the same quarter a year ago. Hershey reported third quarter earnings per share of $1.03, $0.03 better than the analyst estimate of $1.00. Revenue for the quarter came in at $1.85 billion versus the consensus estimate of $1.88 billion. Earnings for the quarter were up 33% from $0.77 per share a year ago. This compares with J.M. Smucker which earned $1.24 in the first quarter 2014, up 5.9% from $1.17 a year ago. Earnings for Kellogg were up 6% in the second quarter. The company plans to announce third quarter earnings on Monday November 4, 2013. A Word of Caution These companies face some headwinds. Consumer stocks as a group are up more than 20% year-to-date while some critics say the sector is overvalued. Consumer foods companies can also face possible increases in regulation. In Washington state, for example, voters will decide Nov. 5 whether to require labels on food containing genetically modified crops. Food companies are afraid of the additional expense in meeting labeling requirements. ConAgra is among the companies fighting the labeling initiative. Conclusion Food stocks are much loved for their reliability of dividends. They also increasingly benefit from stable commodity pricing. Most importantly for Foolish income investors, their dividends tend to increase over time. What's not to love? While high price-to-earnings ratios are cause for concern, particularly in the best stocks like Hershey, there are bargains to be had with other issues. J.M. Smucker, for one, is probably a better value for the money right now. Over time, these stocks should add value to a portfolio of dividend paying stocks. As always, Foolish investors should do their own research before making any investment decision. It's as simple as that. While they don't garner the notoriety of high-flying growth stocks, they're also less likely to crash and burn. And over the long term, the compounding effect of the quarterly payouts, as well as their growth, adds up faster than most investors imagine. With this in mind, our analysts sat down to identify the absolute best of the best when it comes to <mark>Michael Hooper</mark> owns shares of J.M. Smucker, ConAgra Foods, and The Hershey Company. The Motley Fool has no position in any of the stocks mentioned. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that Learn about investing from the comfort of your own home. Portfolio Basics Take the first steps to building your portfolio. safility The Safility Finance Daily is out! http: //t.co/bbR0j1cGs6 Stories via @ daily_finance @ Justin_Ching e401k RT @ daily_finance: If you love football, you hate NFL game blackouts. And finally, the FCC may be getting ready to end them. http: //t.co/tl? CooolStufff RT @ daily_finance: If you love football, you hate NFL game blackouts. And finally, the FCC may be getting ready to end them. http: //t.co/tl? Advertise With Us? Copyright 2013 AOL Inc.. All Rights Reserved"}, {"articleID": "2010121712_00125954_W", "names": {"Richard Jones": ["Q10441659", "Q16240149", "Q16657311", "Q16730413", "Q20733697", "Q21165389", "Q24548883", "Q27526204", "Q29643075", "Q3430918", "Q39073418", "Q51589381", "Q5358141", "Q55965900", "Q56598113", "Q56598126", "Q56604646", "Q57415949", "Q57416543", "Q59510267", "Q7326923", "Q7326924", "Q7326927", "Q7326932", "Q7326934", "Q7326936", "Q7326940", "Q7326941"]}, "date": "2010-12-17", "url": "http://theargus.co.uk/news/8742818.Loan_sharks_warning_in_Sussex/?ref=rss", "content": "loan sharks are preying on people who need money to get them through christmas. trading standards officers are warning people to use credit unions and avoid unlicensed lenders. staff at east sussex credit union, which is based at community base in queens road, brighton, said they regularly receive anecdotal reports of loan sharking. manager colin holden said: \"we always hear rumours that they are about but because of the nature of these guys, people are not prepared to talk about it.\" we know that there are loan sharks circulating in brighton, and also places like lewes and eastbourne, but it is anecdotal evidence. \"<mark>richard jones</mark>, general manager of west sussex credit union in crescent road, worthing, said he suspects illegal lending is taking place in worthing and crawley. he said:\" it is difficult to give any tangible evidence but you can make a lot of assumptions. \"there are a lot of legal and illegal companies that charge extortionate rates of interest.\" east sussex county council is also warning people to avoid loan sharks. anyone with information about illegal money-lending is asked to call trading standards on 0300 555 2222, or consumer direct on 08454 040506 to contact east sussex credit union, call 01273 234 858, or visit www.eastsussexcu.org.uk.to contact west sussex credit union, call 01903 237221, or visit www.westsussexcreditunion.co.uk. search for jobs in brighton, hove, lewes, worthing, crawley and more...find the right person in brighton, hove, lewes, worthing, crawley...search for homes in brighton, worthing, hove, lewes ..."}, {"articleID": "2017063005_00007325_W", "names": {"Andy Murray": ["Q10125", "Q526811"], "Jordan Thompson": ["Q16219277", "Q18385737", "Q6277054"]}, "date": "2017-06-30", "url": "http://timesofindia.indiatimes.com/sports/tennis/wimbledon-2017/lendl-confident-murray-will-be-fit-to-defend-wimbledon-title/articleshow/59381210.cms", "content": "Times of India Dream is to play World Cup alongside Hardik: Krunal Lendl confident <mark>Murray</mark> will be fit to defend Wimbledon title Reuters | Jun 30, 2017, 10.06 AM IST LONDON: <mark>Andy Murray</mark>'s coach Ivan Lendl is \"not at all\" concerned that injury would prevent the world number one from defending his Wimbledon title next week. <mark>Murray</mark> has twice pulled out of matches at a grasscourt exhibition tournament in London this week because of a hip problem but Lendl said the 30-year-old Scot was likely to resume practice at Wimbledon on Friday. \"We'll see what the weather is like,\" Lendl told the British media. \"If the weather is good, I am sure we will practise.\" Asked whether he was concerned about <mark>Murray</mark>'s Wimbledon campaign, the Czech said: \"Not at all. Unlike before Paris, he is hitting the ball really well. Practice has gone well.\" <mark>Murray</mark> was knocked out of the semi-finals of the French Open in Paris by Stan Wawrinka earlier this month but lost his only tour outing since that match to lowly-ranked Australian <mark>Jordan Thompson</mark> on the grasscourts of Queen's Club. \"I wasn't really surprised,\" Lendl added. \"The first match on grass is always tricky. The guys who beat Stan Wawrinka, Milos Raonic and <mark>Andy</mark> had played qualifying or the previous week at a tournament. We have seen that movie over and over.\" Guys play matches, feel a little bit more comfortable than the guys who didn't play. \"Roger Federer, seven times a champion at the All England Club, said he was convinced <mark>Murray</mark> would be on court for his first round match at Wimbledon on Monday.\" I expect him to play unless I have missed something completely, \"the Swiss told British newspapers.\" I would know more about it, I think, if it had been a really significant injury. The way I know <mark>Andy</mark>, he's tough as nails and I feel like he's going to be there on the opening Monday. \"He would need to be significantly injured not to play. For me, if he can get through that first round and feel better afterwards, absolutely he should play.\" Top seed <mark>Murray</mark> will discover his first round opponent when the draw is made later on Friday Get latest news & live updates on the go on your pc with News App. Download The Times of India news app for your device. RELATED"}, {"articleID": "2017110913_00473017_W", "names": {"George Walker": ["Q1425389", "Q16193922", "Q16886404", "Q24042094", "Q24050502", "Q25205065", "Q5545817", "Q5545820"], "Emily West": ["Q10272426", "Q58374888"]}, "date": "2017-11-09", "url": "http://www.tennessean.com/story/news/local/williamson/2017/11/09/church-shooting-prevention-security-antioch-tennessee-texas-williamson-county/844585001/", "content": "Share This Story! Let friends in your social network know what you are reading about Facebook Twitter Google + LinkedIn Pinterest \"Fine line' for Williamson congregations when it comes to church security Congregations are looking at how to deal with safety and security in light of church shootings in Antioch and Texas. Post to Facebook Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Subscribe Today Log In Subscribed, but don't have a login? Activate your digital access. CLOSE Engle, who was called a hero by the Nashville police chief,\" physically engaged \"with a masked shooter at the end of the Sept. 24 morning service at Burnette Chapel Church of Christ, Metro police said. Shelley Mays/The Tennessean CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Four weeks ago, Tim Orr said conversations around security started inside his Franklin church, after members saw the headlines on a shooting in an Antioch sanctuary. Franklin First United Methodist Church has more than 1,000 members that attend its newest facility at Mack Hatcher Parkway and Aldersgate Drive. The church also has services inside its historic location in downtown.\" Right now with our congregation, we are looking at different security aspects and what would be the best for our congregation, \"said Orr, who was hired as head of security when a committee formed a month ago to look at church safety. CLOSE What we know about the gunman's AR-556 rifle and the modifications you can make to those guns. Ramon Padilla, USA TODAY This thought only intensified in the wake of a church shooting at First Baptist Church of Sutherland Springs, outside San Antonio, Texas, on Sunday. The shooting left 26 people dead, according to authorities.\" We have a small team in place, but we don't have any type of protocol that we practice now, \"he said.\" That is what we are currently working on. \"Police checks in place Already conducting security assessments, Franklin Police Department officers regularly evaluate businesses, schools and places of worship. Department Public Information Officer Lt. Charles Warner said officers will provide recommendations to those locations for free.\" The disturbing increase is mass-shooting incidents at public places has prompted an increase in requests, especially from Franklin churches, \"Warner said. Facebook Twitter Google + LinkedIn Nashville church shooting: The emotional scene Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed. Buy Photo Ieshea White and Kimberly Stallworth embrace their uncle and brother Roger Bracey, who was at Burnette Chapel Church of Christ when shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. They were reunited at another nearby church. Shelley Mays / The Tennessean Fullscreen Buy Photo A member of a neighboring church left a memorial at the doorstep of Burnette Chapel Church of Christ where a mass shooting occurred during Sunday services. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Buy Photo A mass shooting happened during Sunday morning services at the Burnette Chapel Church of Christ. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Alleged church shooter Emanuel Kidega Samson is being transported to jail. MNPD Fullscreen Emanuel Kidega Samson, 25, has been charged with criminal homicide in the death of Burnette Chapel Church of Christ member Melanie Crow. Courtesy of Metro Nashville Police Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo Ethan Huffard, left, a teacher at Ezell-Harding, prays during a vigil at Ezell-Harding Christian School in Antioch, Tenn., Sunday, Sept. 24, 2017. The vigil was in response to a shooting at Burnette Chapel Church of Christ that left one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police officer conducts a search of a car where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kristy Mallory helps Phillip Reese carry his son Jeremiah from Beautiful Gate Church after the 10-year-old injured his ankle while barricading his Sunday School classroom during the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Emergency personnel investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles surround Burnette Chapel Church of Christ after the shooting Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape near the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo People attend a prayer vigil at Ezell-Harding Christian School for victims of the shooting earlier in the day at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Church members retrieve their cars later in the day after the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo A member of the Metro Nashville Police Department bomb squad exits the building following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate the parking lot at Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Jeremiah Reese, 10, and father Phillip wait at Beautiful Gate Church after Jeremiah was injured barricading his Sunday school classroom after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Investigators work the shooting scene at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police spokesman Don Aaron speaks to the media at the scene of the shooting at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police continue to investigate the suspect's vehicle after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Evidence markers are on the ground in the parking lot after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Ieshea White cries tears of joy after being reunited at a nearby church with her uncle Roger Bracey who was at Burnette Chapel Church of Christ when shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Police enter Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo People console each other at the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member investigates a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape near the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Joe Love, 68, lives across the street from the church. Members asked for his help after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Joe Love, 68, lives across the street from the church. Members asked for his help after multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Police use a rope and pulley to remove a case from a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member investigates a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police use a rope and pulley to remove a case from a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police bomb squad takes pictures of a car outside Burnette Chapel Church of Christ where shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo The scene at Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Broken glass on the door at the church where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police investigate outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member gets suited up outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Onlookers stand near the Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo A Nashville police bomb squad member gets suited up outside Burnette Chapel Church of Christ where multiple shots were fired Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Nashville police place yellow tape where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo ATF agents investigate following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired with people shot at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017 in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police use rope and pulleys to remove items from the suspect's car following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency personnel watch the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Metro Nashville Police investigate following a shooting at the Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. A gunman opened fire in the Nashville area church leaving one dead and seven wounded. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police tape lines at the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Police investigate the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Shelley Mays / The Tennessean Fullscreen Buy Photo Emergency vehicles line the scene where multiple shots were fired at Burnette Chapel Church of Christ Sunday, Sept. 24, 2017, in Antioch, Tenn.. Andrew Nelles / The Tennessean Fullscreen Buy Photo Kaitlyn Adams, rear, hugs Bridget Crow Polson, front, sister of victim Melanie Crow Smith, after a shooting at Burnette Chapel Church of Christ in Antioch, Tenn., Sunday, Sept. 24, 2017. Andrew Nelles / The Tennessean Fullscreen Buy Photo A mass shooting happened during Sunday morning services at the Burnette Chapel Church of Christ. photographed the day after Monday, Sept. 25, 2017 in Nashville, Tenn.. <mark>George Walker</mark> IV / The Tennessean Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 66 2 of 66 3 of 66 4 of 66 5 of 66 6 of 66 7 of 66 8 of 66 9 of 66 10 of 66 11 of 66 12 of 66 13 of 66 14 of 66 15 of 66 16 of 66 17 of 66 18 of 66 19 of 66 20 of 66 21 of 66 22 of 66 23 of 66 24 of 66 25 of 66 26 of 66 27 of 66 28 of 66 29 of 66 30 of 66 31 of 66 32 of 66 33 of 66 34 of 66 35 of 66 36 of 66 37 of 66 38 of 66 39 of 66 40 of 66 41 of 66 42 of 66 43 of 66 44 of 66 45 of 66 46 of 66 47 of 66 48 of 66 49 of 66 50 of 66 51 of 66 52 of 66 53 of 66 54 of 66 55 of 66 56 of 66 57 of 66 58 of 66 59 of 66 60 of 66 61 of 66 62 of 66 63 of 66 64 of 66 65 of 66 66 of 66 Autoplay Show Thumbnails Show Captions Last Slide Next Slide\" As their police department, we want to empower the members of our community with information on how to decrease their chances of becoming a victim of the unthinkable. We also want to teach them how to fight back in the midst of an attack, to save their life and the lives of others around them. \"More: What happens when violence invades sacred spaces More: How this Tennessee county is helping churches boost security in wake of shootings FPD hasn't been the only department approaching churches with this tactic. Wilson County Sheriff's Office and Lebanon Police Department have offered security support to churches for the last year. Safety a long-time concern With more than 8,000 members, Brentwood United Methodist Church officials have kept safety in mind for a few years.\" We have had a safety in security plan in place for awhile, \"executive director Leslie Hotzfield said.\" But one of the things we have done as direct result of what's happened elsewhere recently is we have increased security on Sunday mornings. The Brentwood Police Department already help manage parking lots and traffic. We also have a plain clothes officer to be inside the building. This is walking the line between safety and hospitality. \"More: Antioch church turns to forgiveness one week after deadly church shooting More: Personal turmoil weighed on Nashville church shooting suspect Emanuel K. Samson Down the road at Congregation Micah, Rabbi Philip Rice said the synagogue has always had a plan in place for its worshipers since its founding. Congregants also chip in to pay a security fee, and Rice said synagogue leadership had a wish list in mind for other safety procedures.\" The officer we have is not there directing traffic, \"he said.\" They are there in case of emergency. If you visit a synagogue anywhere outside of United States, they don't let you just walk right now. It's not that you're not allowed in but they have to take security seriously. It's an unfortunate thing. \"Doors kept open Even with a wave of new thinking toward safety in places of worship, Rector Rusty McCown said St. Paul's Episcopal Church had no plans to change. As Franklin's oldest church, McCown said its thick, wooden doors to the sanctuary have always been open, no matter the time of day. Among its four services on Sundays, the church will see around 1,000 people at worship.\" It's a difficult situation, and we walk a fine line between our parishioners feeling safe, \"McCowan said.\" But at the same time, we aren't a particular church going to put a lot of systems in place that are overtly toward safety. \"More: Franklin's oldest church continues open-door tradition McCowan said he's had one email in the last 24 hours asking the question: what will the church do about safety? And while McCowan said there were not any concrete plans in place, he hoped all houses of worship would stand with the united message of hope.\" There's not a completely safe library or even concert anymore, \"he said.\" We just hope and pray that people will find the church to be a place of comfort. We shouldn't have to worry about something like this. \"Reach <mark>Emily West</mark> at erwest @ tennessean.com or 615-613-1380 and on Twitter at @ emwest22. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http: //www.tennessean.com/story/news/local/williamson/2017/11/09/church-shooting-prevention-security-antioch-tennessee-texas-williamson-county/844585001/"}, {"articleID": "2019062803_00106447_W", "names": {"Steven Smith": ["Q1302695", "Q19794125", "Q3499273", "Q378949", "Q465812", "Q57733375", "Q57904651", "Q7613977", "Q7615281", "Q7615283", "Q925535"], "Mohammad Hafeez": ["Q21662941", "Q25189338", "Q3535271"]}, "date": "2019-06-28", "url": "https://www.firstpost.com/firstcricket/sports-news/india-vs-west-indies-icc-cricket-world-cup-2019-indian-pacers-mastering-the-art-of-asphyxiating-and-striking-when-it-matters-6895301.html", "content": "News India vs West Indies, ICC Cricket World Cup 2019: Indian pacers mastering the art of asphyxiating and striking when it matters In this World Cup, the Indian pacers have played a vital role. They have set the tone, suffocated the batsmen into frustration, kept striking when it mattered the most, at crucial stages and then delivered the knockout blow as well. Jigar Mehta, Jun 28, 2019 07:44:33 IST \"The last two games, things haven't gone the way that we thought. But we've found ways of winning.\" That's what a champion team does, isn't it? Even if you are under the pump with things not going your way, you find ways to win. The Australian teams of the yore mastered it when they were under pressure, even if rarely. That's what this current Indian side is doing at the 2019 World Cup. And that's the crucial fact Virat Kohli pointed out at the presentation ceremony after India's thumping win over West Indies. There have been times the Indian batsmen haven't really set the stage on fire, and doubts have crept into the minds as to whether they can defend it. But they have found a way. This is where the pacers have played a vital role, in helping Kohli find that way. They have set the tone, suffocated the batsmen into frustration, kept striking when it mattered the most, and then delivered the knockout blow as well. India's Mohammed Shami acknowledges the applause from the crowd after taking two wickets against West Indies. AP In this World Cup, the Indian pacers have had the best average--20.62, best economy rate--4.70 and best strike-rate--26.3, so far. Talk about bossing it. Against West Indies at Old Trafford, the lethality of Indian pacers was on full display. After opting to bat, India posted 268 runs. Kemar Roach, who finished with impressive figures of 3/28, thought it was a par score and \"we stand a chance.\" Many others thought that West Indies could chase it down. They had the Universe Boss Chris Gayle opening the batting and a supply line of attacking batsmen to come. The key was to build pressure from the start. You know that once you frustrate Chris Gayle, he will give you a chance. Jasprit Bumrah and Mohammed Shami did just that with accuracy and variations. They suffocated Gayle with tight lines and lengths. Bumrah played the holding role and bowled in that corridor or uncertainty while Shami varied his lengths to stay unpredictable and generated movement off the track. The two pacers aced the Powerplay and set the tone. West Indies were 29/2 in the first 10 overs, the lowest Powerplay score by any team in this World Cup. This was a team that had averaged 5.4 runs an over in the Powerplays prior to this. Gayle left alone five deliveries in the first over of the innings bowled by Shami. The one that touched the bat was a kiss off the inside edge, flying tantalisingly wide of the stumps and into the fine leg fence. In the next over, from Bumrah, he left alone four balls and a survived a close LBW shout. Shami beat the other opener Sunil Ambris' inside edge in the next over. Gayle was beaten in Bumrah's following over. The pressure was building. Shami again beat Gayle with a snorter that flew past the outside edge. West Indies had played out 21 dots from 28 balls now. The Universe Boss had had enough of it. He's not used to being cornered. He's used to bossing. So he clears his front leg the next ball and attempts the bludgeoning glory shot. Shami bangs it in short and into his body, and cramps Gayle for room. The glory shot lands straight into the hands of mid-on. The plan has worked. More dot balls follow, an edge falls short of the second slip. Shami is bowling beautifully. And then again, that variation of length does the trick. Shami delivers three short of good length deliveries in a row to Shai Hope and then dangles the carrot with a full one, sucking him into the drive and bringing it back in to disturb his furniture. The pacers bowled 41 dot balls in the first 10 overs. The pressure was built and so did the frustration, and West Indies could never really escape from this tangle, much like the other teams. A partnership started to build between Ambris and Nicholas Pooran but Pandya cut it short. The wrist-spinners then feasted on that frustration. Carlos Brathwaite showed he could change games single-handedly, against New Zealand. He arrives at the crease. Bumrah is called upon. He has figures of 5-0-9-0. He sends back Brathwaite first ball and then Fabian Allen. A double wicket maiden. West Indies are paralysed. 107/7. Shami returns to perform the wrap-up job with wickets of Shimron Hetmyer and Oshane Thomas. India have handed West Indies their third-biggest defeat. Shami finishes with figures of 6.2-0-16-4 and Bumrah with 6-1-9-2. The pacers together have bowled 70 dots in 17.2 overs, roughly 4 dots per over and taken seven of the 10 wickets. Against Afghanistan, on a slow Rose Bowl track, the Indian pacers were the difference between the two sides. While the Afghanistan pacers were targeted (16-1-105-3) with their spin applying the choke, Indian pacers offered no release and finished with figures of 29.5-3-130-8 at an economy rate of 4.41 compared to Afghanistan's 6.56. The package also included 9 brilliant yorkers off Bumrah's last 12 deliveries and a Shami hat-trick to seal a close game. It has all been about setting the tone and the platform. India's bowling figures in the Powerplays read: 34/2 (vs SA), 48/0 (vs Aus), 38/1 (vs Pak), 27/1 (vs Afg) and 29/1 (vs WI). Not a single match over five runs an over and just one over four an over. Overall, India have the second-best average--31 and best economy rate in the first 10 overs--3.72. They are the only team that have conceded less than 200 runs in the Powerplays combined. It all began with the spell of a lifetime by Bumrah against South Africa in Southampton and has carried on. It's not just the powerplay, the pacers have turned partnership breakers and the need of the hour at crucial junctures too. Against Australia, at The Oval, it was Bumrah's two wickets that of a set <mark>Steven Smith</mark> (69 off 70) and Marcus Stoinis in the 40th over that turned the tide. Bumrah applied the finishing touches. In Manchester, against Pakistan, Pandya maintained the stranglehold with wickets of the experienced <mark>Mohammad Hafeez</mark> and Shoaib Malik off consecutive deliveries. At the Rose Bowl, Bumrah sent back the set Rahmat Shah and Hashmatullah Shahidi in one over to break Afghanistan's spine when called upon to break the partnership that was beginning to threaten India's low total. It's not as if they have been receiving bowler-friendly pitches and conditions. They have conjured pace and movement on these non-pacer-friendly wickets with aggression and guile. Shami has stepped up in absence of the injured Bhuvneshwar and bowled with venom while Bumrah has stayed true to the No 1 bowler credentials with his control and yorkers at the death. In between, Pandya has operated like the bed bug to slowly and irritatingly suck opposition's blood with his clever slower ball variations including the effective bouncers. \"Over a period time it was a big challenge for him (Hardik Pandya) to bowl those 10 overs, and he realised that to be able to bowl those 10 overs I need to develop a certain armoury in my bowling,\" India's bowling coach Bharat Arun had explained in the build-up to the match. \"And that's what he's worked on. He's worked on his slow balls, his slow bounces also, and also he's worked on perfecting his bouncers. So all these, put together, have given him the confidence to go through those 10 overs.\" While Pandya's batting has gone one notch above, his bowling has sort of progressed to the \"improving' zone. For years India had craved for a pace attack that would leave the world envious. And an all-rounder who could genuinely create an impact and provide balance. They have found that package. Add Yuzvendra Chahal and Kuldeep Yadav's flight and guile to it and they have a proper world class bowling attack. That attack is in full flow right now. The fielding agile. Catching safe. Captaincy impressive. Now if only that batting unit clicks consistently! With stat inputs from Umang Pabari Updated Date: Jun 28, 2019 07:44:33 IST"}, {"articleID": "2014010707_00060757_W", "names": {"Greg Ballard": ["Q2340949", "Q5251212"]}, "date": "2014-01-06", "url": "http://www.witn.com/home/headlines/238939511.html", "content": "It's winter, right? So what's the big deal about an arctic blast? One meteorologist made it plain. \"When it gets this cold, people die,\" said CNN's Chad Myers. Even folks in cold climates are often not equipped to deal with the conditions they are experiencing, like a -50 degree wind chill in Chicago. Also, the dangerous cold is gripping much of the U.S. in a way that hasn't happened for decades. Records are being broken. Millions of people, including us here in Eastern Carolina, are impacted. NBC's Al Roker said think of this as a \"polar hurricane.\" It's called a polar vortex, a giant pool of cold air tens of thousands of feet above us. The vortex normally spins at the poles. This one is making headlines because it has moved so far south, causing freezing temperatures for so many of us. The lowest temperature ever recorded in our state was in 1985, according to the state climate office, which lists -32 degrees at Grandfather Mountain in Avery County on that date. That record is expected to stand, as the lowest temperature expected during this vortex assault at Grandfather Mountain is -7 or so. After Monday night, the high in Eastern Carolina isn't supposed to pop back up above freezing until Wednesday. So while frigid temps will grip our lives for a short while, it won't be too long before more normal conditions return. Even better, highs in the 60s are on tap for the weekend. Read the Associated Press story on the big vortex weather picture below. Frigid, dense air swirled across much of the U.S. on Monday, forcing some cities and their residents into hibernation while others layered up and carried on despite a dangerous cold that broke decades-old records. Wind chill warnings stretched from Montana to Alabama. For a big chunk of the Midwest, the subzero temperatures moved in behind another winter wallop: more than a foot of snow and high winds that made traveling treacherous. Officials closed schools in cities including Chicago, St. Louis and Milwaukee and warned residents to stay indoors and avoid the frigid cold altogether. The forecast is extreme: Wind chills were expected to drop as low as negative 55 Monday night in International Falls, Minn., and rebound to minus 25 to minus 35 on Tuesday. Farther south, the wind chill is expected to hit negative 50 in Chicago and minus 35 in Detroit. School systems and day cares shut down as a precaution from the Dakotas to Maryland. But whether residents chose to stay home or head outside appeared to have less to do with the mercury and more with conditioning. Emeric Dwyer of St. Paul wore only a London Fog trenchcoat and light scarf to protect himself from morning temperatures that got down to minus 20 in the Twin Cities. The 30-year-old was just glad his car started. \"It made a grinding noise I never heard before. But it started and got us here. Not too much to complain about,\" said Dwyer, who is originally from Duluth in the northern part of the state. \"In Duluth it's always cold,\" he said. But it hasn't been this cold for almost two decades in many parts of the country. The National Weather Service said the temperature sank to 16 degrees below zero at Chicago's O'Hare International Airport, two degrees lower than the record for Jan. 6. Weekend snowfall at the airport totaled more than 11 inches - the most since a February 2011 storm that shut down the city's famed Lake Shore Drive. In Indiana, where many roads were rendered impassable because of snow and wind, authorities had a simple message: stay home. \"I know the roads look clear, the sun's out and it all looks nice,\" Indianapolis Mayor <mark>Greg Ballard</mark> said Monday. \"But it's still minus 40 in wind chill - deadly temperatures. So we want to be very, very careful.\" <mark>Ballard</mark> issued a travel ban for the city, making it illegal for anyone to drive except for emergencies or to seek shelter, until noon Monday. But he wants schools and businesses to remain closed another day until the worst of the severe cold passes. Much of Indiana was blanketed in about a foot of snow Sunday, and many of the state's schools, businesses and municipal offices were closed Monday. Wind chills through Tuesday could reach 45 degrees below zero, according to the National Weather Service. The Legislature postponed the opening day of its 2014 session, and the state appellate courts, including the Indiana Supreme Court, said they would be closed. Many other cities came to a virtual standstill. In St. Louis, where more than 10 inches of snow fell, the Gateway Arch, St. Louis Art Museum and St. Louis Zoo were part of the seemingly endless list of closed facilities. Shopping malls and movie theaters closed, too. Even Hidden Valley Ski Resort, the region's only ski area, shut down. Further north, those more accustomed to extreme winter weather kept moving, even if just a bit slower than usual. Between a heater that barely works and the drafty windows that invite the cold air into his home, Jeffery Davis decided he'd be better off sitting in a downtown Chicago doughnut shop for three hours Monday until it was time to go to work. He threw on two pairs of pants, two t-shirts, \"at least three jackets,\" two hats, a pair of gloves, the \"thickest socks you'd probably ever find\" and boots, and trudged to the train stop in his South Side neighborhood that took him to within a few blocks of the library where he works. \"I never remember it ever being this cold,\" said Davis, 51. \"I'm flabbergasted.\" Elnur Toktombetov, a Chicago taxi driver, awoke at 2:30 a.m. Monday anticipating a busy day. By 3:25 a.m. he was on the road, armed with hot tea and doughnuts. An hour into his shift, his Toyota's windows were still coated with ice on the inside. \"People are really not comfortable with this weather,\" Toktombetov said. \"They're really happy to catch the cab. And I notice they really tip well.\" In downtown Chicago, a commuter train hit a \"bumping post\" as it pulled into a station, the second such accident of the day. Metra spokesman Michael Gillis said six passengers were taken to a hospital with minor injuries Monday after the train hit the post at the end of a platform. A less serious incident occurred at the same station around 6:15 a.m., but no passengers were injured. Continuing a decades-old practice, Chicago Transit Authority was handing out fare cards to social service agencies to be distributed to the homeless so they could ride buses and trains to stay out of the cold. More than 40,000 homes and businesses in Indiana, 16,000 in Illinois and 2,000 in Missouri were without power early Monday. Indianapolis spokesman Marc Lotter said emergency crews accompanied about 350 people to shelters around the city. Southern states were bracing for possible record temperatures too, with single-digit highs expected Tuesday in Georgia and Alabama. SHERIFF: Onslow County Shooting Ruled Self-Inflicted POLICE: 5-Kilos Cocaine Found In Car Battery, 2 Arrested For Trafficking In Pitt County WITN 275 E. Arlington Blvd.. Greenville, NC 27858 252-439-7777"}, {"articleID": "2014111105_00028183_W", "names": {"Danny Davis": ["Q5220272", "Q5220273"]}, "date": "2014-11-11", "url": "http://highschoolsports.nola.com/news/article/-9009810423852085887/chapelle-hands-on-for-dramatic-five-set-win-at-northshore/", "content": "If there was any doubt about the resolve of Chapelle and its ability to advance in the postseason, the Chipmunks erased them on multiple occasions, emerging with a five-set victory at Northshore. The Chipmunks were tested early, and were on the brink of elimination as the Panthers won the first two games, but that's when they rose to the occasion for a 23-25, 20-25, 25-21, 25-13, 15-13 win. There was no case of déjà vu even though it marked the second time in the past nine days the teams on the same court, resulting in a 3-1 Chapelle victory. \"We all wanted to pick up the intensity and win this game,\" Chapelle's Kayla Jones said. \"Now, we're going to get back to the gym and work hard, focusing on what we need to do to play the next game.\" Chapelle (27-17) will have their hands full in the Division I state tournament at the Pontchartrain Center as the take on Division I top seed St. Joseph's Academy, which advanced with a 25-4, 25-13, 25-7 win over 17 th seeded Zachary. After the Chipmunks fought back to tie the match at two games each, Northshore (26-13) appeared to have rediscovered the zeal to regain control, moving out to a 9-6 lead. However, no lead was safe with either squad, as Chappelle whittled away at the deficit, tying the match at 13-13. Sensing the moment, the Chipmunks captured the next two points, punching their ticket to the state tournament. Although there was very little distance between the two teams, Northshore was able to stay one step ahead and pull away from a 23-23 tie and close out the first game, taking the next two points. \"I'm so proud of our team and the way they fought in this match,\" Northshore coach <mark>Danny Davis</mark> said. \"The girls that were on the court left everything out there. They played with so much heart and intensity.\" In game two, the Panthers were trailing 15-12 but found their way back to tie it up at 20-20 with visions of a win and a 2-0 lead in games. The momentum Jones spoke about was evident as the team stayed within striking distance in game three and the Chipmunks were able stave off elimination for a 25-21 win. Chapelle takes on No. 1 seed St. Joseph's at the state tournament. (Pat Mashburn, NOLA.com | The Times-Picayune00 \"After that second game, we just came out with an all-or-nothing attitude,\" Chapelle coach Shannon Spafford said. \"We had nothing to lose at that point, and just left everything out on the floor. That's when we started fighting and brought the power back on our side.\" And, it didn't take long for Chapelle to assert itself in the fourth game, running out to an 11-3 lead before winning 25-13. Jones led Chapelle with 21 kills while Kaylee Madron paced the defense with 47 digs and Mallory Knudsen directed the offense with 45 assists. In her final home match of her career, Northshore's Haley Kirkpatrick had 28 kills and 28 digs while freshman Jenna Schmidt recorded 45 assists. Sabrina Buelle was the defensive leader with 33 digs."}, {"articleID": "2014030705_00086002_W", "names": {"Lisa Jackson": ["Q16218554", "Q27469861", "Q445734", "Q476660", "Q6557964", "Q8927305"]}, "date": "2014-03-06", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/ceraweek-epa-chief-tells-energy-210147702.html", "content": "By Ernest Scheyder HOUSTON, March 6 (Reuters) - Carbon regulations can be crafted to help offset climate change without \"shutting down business in its tracks,\" U.S. Environmental Protection Agency Administrator Gina McCarthy said at a major energy conference on Thursday. \"We don't have to choose between a healthy environment and a healthy economy,\" McCarthy, who has run the EPA for nearly a year, said about new rules she said would be proposed by June. McCarthy's speech to IHS CERAWeek, the largest meeting of energy executives in the world, was the first by an EPA administrator since the conference began 33 years ago. Her presence was seen as an acknowledgement by the Obama administration that the onshore U.S. energy boom over the past five years has been one of the economy's bright spots. \"We know conventional fuels like coal and natural gas are going to continue to play a critical role in a diverse U.S. energy mix,\" McCarthy said. The Houston visit came about a week after McCarthy toured North Dakota, trying to convince the state's coal, oil and ethanol producers that her agency was not trying to burden their industries with onerous regulations. The fuels, McCarthy said in North Dakota, should be part of an \"all-of-the-above strategy\" that runs from solar to coal. She reiterated that theme to CERAWeek's more than 2,000 attendees. It was a marked shift from McCarthy's predecessor, <mark>Lisa Jackson</mark>, viewed warily by energy companies that perceived her as indifferent to how regulations affected their operations. \"Administrator McCarthy understands the EPA has to protect the environment while doing all it can to protect jobs,\" said Larry Nettles, an environmental lawyer at Vinson & Elkins LLP, a prominent law firm in the energy sector. REGULATION AND INNOVATION Energy and environmental issues are \"two sides of the same coin\" that can be accomplished in tandem, McCarthy said. For instance, she credited new fuel efficiency standards for automobiles with encouraging automakers to build cars that get more miles per gallon, boosting appeal to consumers. \"Go figure: an environmental rule helped fuel a resurgent American auto industry,\" McCarthy said. Energy executives said they were encouraged by the EPA's new tone but are eager to see it reflected in concrete regulation. Utilities are awaiting final rules on new and existing coal plants. Some say rules that are too restrictive could end coal-powered electricity generation in the United States. \"In order not to impact the economy or the reliability of the grid, we need to ensure this is done in a responsible way,\" Nick Akins, CEO of American Electric Power, said at CERAWeek. McCarthy said she will work to recognize each state's unique energy and regulatory needs. Texas, for instance, has the most oil refineries, and may have different concerns than Maine, which produces a large amount of pellet fuel for wood stoves. McCarthy said her first priority is stopping climate change, which she said would cost U.S. businesses more in total than the expense of complying with regulations. \"The real, scary cost we need to worry about is the cost of climate inaction,\" she said. Lynn Good, chief executive officer of Duke Energy, the largest American utility, said she is \"encouraged\" by McCarthy's new approach but has already decided building new coal plants are not worth the regulatory risk. \"I don't see new coal in the mix for Duke,\" Lynn said. She said she believes opponents of EPA regulations have often been wrong before and may be again when they cry \"the sky is falling\" when new rules are enacted. \"We've heard this tired argument again and again before,\" she said. \"And every single time, it's fallen flat on its face.\" Nature & Environment Politics & Government EPA"}, {"articleID": "2012030916_00041111_W", "names": {"Dan Stewart": ["Q3013211", "Q5214447"]}, "date": "2012-03-09", "url": "http://annarbor.com/business-review/wild-side-smoke-shop-to-fill-ex-sole-sisters-on-east-liberty-street-in-downtown-ann-arbor/?cmpid=RSS_link_business_review", "content": "get free email newsletters to keep you connected to your interests. the lyndon township planning commission tabled a plan for a self-storage facility for a second time in two months thursday night, this time until the township planning consultant had a chance to review a revised...retail: knight's steakhouse owners want to expand prepared foods business on miller avenue community wall links: three award-winning authors hold workshops in chelsea; ann arbor students take top prizes in japanese quiz bowl the wild side smoke shop location in the courtyard shops on plymouth road in ann arbor. lizzy alfs | annarbor.com a new tenant is planning for an april opening in the former sole sisters space at 209 e. liberty st. in downtown ann arbor: the smoke shop, which has dozens of locations throughout michigan including one on plymouth road in ann arbor, carries items such as hand-blown glass tobacco accessories, hookah products, cigarette rolling papers and lighters. the 1,300-square-foot space was only on the market for about 30 days after moved her boutique around the corner from south fourth avenue to east liberty street in march 2010. wild side smoke shop plans to open soon in the former sole sisters space at 209 e. liberty st. photo from loopnet \"we had many, many inquiries, multiple showings, and in the end, had several [businesses] to choose from,\" said <mark>dan stewart</mark> of sperry van ness/stewart commercial group, who listed the building with mike lamb. they marketed the space as a \"nicely located retail space with excellent window exposure to pedestrian and vehicular traffic,\" according to the listing. building owner michael y i said he had inquiries from a national restaurant franchise, a hookah bar and skydive tecumseh. wild side smoke shop, he said, was the \"most eager and ready to go.\" he added: \"we talked to the landlord of their other [ann arbor] location and they told me [wild side] is a very good tenant. also, the fact that they have many outlets throughout the state persuaded me to go with them.\" the windows of the east liberty street storefront are currently covered in plastic, and yi said renovations should begin soon. the owner of the smoke shop could not be reached for comment, but yi said the store should open in april. bongz & thongz, which is located a few storefronts down at 119 e. liberty st. other downtown ann arbor smoke shops include wild side smoke shop to fill ex-sole sisters on east liberty street in downtown ann arbor the wild side smoke shop location in the courtyard shops on plymouth road in ann arbor.lizzy alfs | annarbor.coma new.... tim hardaway jr.'s new attitude key to michigan basketball team's postseason success concentrate: can live music pay the rent? concert series music under the arch brings michigan-based performers to downtown saline advertise with us? 2009-2012 annarbor.com llc and its licensors. all rights reserved."}]