[{"date": "2014-06-19", "url": "http://feeds.washingtonpost.com/c/34656/f/636679/s/3ba4dcd8/sc/13/l/0L0Swashingtonpost0N0Csports0Cmystics0Elead0Eevaporates0Elate0Ein0E830E730Eloss0Eto0Edream0C20A140C0A60C180Cbe76be0Ac0Ef7320E11e30Ea60A60E946fd632f9f10Istory0Bhtml0Dwprss0Frss0Isports/story01.htm", "content": "ATLANTA - Angel McCoughtry matched her season high with 27 points, scoring 18 points in the second half in the Atlanta Dream's She was 7 for 12 from the field in the second half and keyed a 14-0 fourth-quarter run with six points and three rebounds to help the Dream (8-3) run their winning streak to five games. Mystics (5-7) led much of the first three quarters. Washington, the least effective three-point shooting team in the league, went 7 of 10 from long range en route to a 39-34 halftime lead. But the Mystics went cold for nearly six minutes in the fourth quarter under stiffer defensive pressure, and the Dream took advantage. \"We (made) them stop shooting, got in their faces,\" McCoughtry said. \"We would rather let them have 2s than 3s, so that kind of helped us .\" Atlanta held Washington to 1-of-7 shooting from three-point range in the second half. \"I think our defense just stepped up a little bit; we started getting up on the shooters,\" Dream Coach <mark>Michael Cooper</mark> said. \"We changed our pick-and-roll (defense) from one to another, and it really helped .\" Tiffany Hayes added 11 points for Atlanta, and Erika de Souza had 10 points and eight rebounds. Rookie point guard Bria Hartley led Washington with 16 points, and Emma Meesseman added 15. Mystics rookie Stefanie Dolson, who scored eight points on 4-of-5 shooting in 20 minutes, pushed the lead to 66-63 on a runner with 7 minutes 37 seconds left. But the visitors went scoreless over the next 5:49. McCoughtry's 11-foot fadeaway jumper from the left baseline with 6:39 left gave Atlanta the lead for good, 67-66. Washington went 3 for 4 at the free throw line, while Atlanta was 20 for 23, including 7 of 7 by McCoughtry. \"When the free throw difference is 23-4, it's hard to make up for it,\" said Washington Coach Mike Thibault, whose team lost for the fifth time in six games. \"They were aggressive, drove well SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SECTION: {section = sports, subsection = null}!!! INITIAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!!! UGC FROM ARTICLE: {allow_comments = true, allow_photos = false, allow_videos = false, comments_period = 14, comments_source = washpost.com, default_sort =, default_tab =, display_comments = true, is_ugc_gallery = false, max_items_to_display = 15, max_items_to_display_top = 3, moderation_required = false, stream_id =}!!! FINAL commentConfig: {includereply = true, canvas_permalink_id = washpost.com/8bvh5zpd9k, allow_comments = true, commentmaxlength = 2000, includeshare = true, display_comments = true, canvas_permalink_app_instance = bg52e9xhqr, display_more = true, moderationrequired = false, includefeaturenotification = true, canvas_allcomments_id = washpost.com/km4ey0dajm, comments_period = 14, defaultsort = reverseChronological, includevoteofftopic = false, allow_videos = false, childrenitemsperpage = 3, markerdisplay = post_commenter: Post Commenter | staff: Post Writer | top_commenter: Post Forum | top_local: Washingtologist | top_sports: SuperFan | fact_checker: Fact Checker | post_recommended: Post Recommended | world_watcher: World Watcher | cultuer_connoisseur: Culture Connoisseur | weather_watcher: Capital Weather Watcher | post_contributor: Post Contributor, includesorts = true, includeheader = true, defaulttab = all, includeverifiedcommenters = true, includerecommend = true, maxitemstop = 3, includereport = true, source = washpost.com, allow_photos = false, maxitems = 15, display_ugc_photos = false, includepause = true, canvas_allcomments_app_instance = 6634zxcgfd, includepermalink = false}!! SuperFan Badge SuperFan badge holders consistently post smart, timely comments about Washington area sports and teams. Culture Connoisseur Badge Culture Connoisseurs consistently offer thought-provoking, timely comments on the arts, lifestyle and entertainment. Washingtologist Badge Washingtologists consistently post thought-provoking, timely comments on events, communities, and trends in the Washington area. Post Writer Badge This commenter is a Washington Post editor, reporter or producer. Post Forum Badge Post Forum members consistently offer thought-provoking, timely comments on politics, national and international affairs. Weather Watcher Badge Weather Watchers consistently offer thought-provoking, timely comments on climates and forecasts. World Watcher Badge World Watchers consistently offer thought-provoking, timely comments on international affairs. Post Contributor Badge This commenter is a Washington Post contributor. Post contributors aren't staff, but may write articles or columns. In some cases, contributors are sources or experts quoted in a story. Post Recommended Washington Post reporters or editors recommend this comment or reader post. You must be logged in to recommend a comment. Sign in here Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges:. Replies to those posts appear here, as well as posts by staff writers. All comments are posted in the All Comments To pause and restart automatic updates, click\" Live \"or\" Paused \". If paused, you'll be notified of the number of additional comments that have come in. Comments our editors find particularly useful or relevant are displayed in Top Comments, as are comments by users with these badges: US Patent Office finds Redskins' name offensive Manaus celebrates its World Cup games in the Amazon rain forest, even as some wonder why Spain eliminated from World Cup contention with 2-0 loss to Chile <mark>John Brooks</mark> rises from obscurity to World Cup hero with winning goal for U.S. soccer", "articleID": "2014061914_00076164_W", "names": {"Michael Cooper": ["Q15485508", "Q21642395", "Q42764969", "Q42887486", "Q47540919", "Q6829445", "Q6829446", "Q971538"]}}, {"date": "2014-06-19", "url": "http://foxnews.com/us/2014/06/19/pennsylvania-man-8-arrested-on-charges-nazi-atrocities/?intcmp=latestnews", "content": "This undated photo shows Johann \"Hans\" Breyer, arrested Tuesday on charges of aided and abetting Nazi crimes against humanity (MyFoxPhilly.com) An 89-year-old Philadelphia man has been ordered held without bail after his arrest on charges of aiding and abetting the deaths of 216,000 Jewish men, women, and children during his time as a guard at the notorious Nazi death camp Auschwitz. Johann \"Hans\" Breyer, a retired toolmaker, was arrested Tuesday outside his home in Northeast Philadelphia. He spent the night in custody and appeared frail during a detention hearing in federal court, wearing an olive green prison jumpsuit and carrying a cane. ADVERTISEMENT Legal filings unsealed Wednesday in the U.S. indicate the district court in Weiden, Germany, issued a warrant for Breyer's arrest the day before, charging him with 158 counts of complicity in the commission of murder. Each count represents a trainload of Nazi prisoners from Hungary, Germany and Czechoslovakia who were killed at Auschwitz-Birkenau between May 1944 and October 1944, the documents said. \"There was a heightened execution of Jewish deportees brought to the camp,\" Assistant U.S. Attorney Andrea Foulkes told WTXF. \"Most of them were women, children and people with illness .\" Prosecutors say that Breyer, 18 at the time, served in the so-called Death's Head Guard Battalion at the camp. Attorney Dennis Boyle argued his client is too infirm to be detained pending a hearing on his possible extradition to Germany. Breyer has mild dementia and heart issues and has previously suffered strokes, Boyle said. \"Mr. Breyer is not a threat to anyone,\" said Boyle. \"He's not a flight risk .\" But Magistrate Judge Timothy Rice ruled the detention center was equipped to care for Breyer, who appeared to comprehend questions about the nature of the hearing. Breyer has admitted he was a guard at Auschwitz in occupied Poland during World War II, but has told The Associated Press he was stationed outside of the Auschwitz-Birkenau death camp part of the complex and had nothing to do with the wholesale slaughter of about 1.5 million Jews and others behind the gates. <mark>Thomas Walther</mark>, a former federal prosecutor with the special office that investigates Nazi war crimes in Germany, now represents family members of some of Breyer's alleged victims as co-plaintiffs in the case. He called for a speedy extradition. \"The German court has to find late justice for the crimes of Breyer and for the victims and their sons and daughters as co-plaintiffs,\" <mark>Walther</mark> wrote in an email to the AP. \"It is late, but not too late .\" Prosecutors in Weiden could not be reached for comment Wednesday. Their investigation comes after years of failed U.S. efforts to have Breyer stripped of his American citizenship and deported. A court ruling in 2003 allowed him to stay in the United States, mainly on the grounds that he had joined the SS as a minor and could therefore not be held legally responsible for participation in it. His American citizenship stems from the fact his mother was born in the U.S.; she later moved to Europe, where Breyer was born. During Breyer's arrest Tuesday, he asked the marshals to retrieve papers in his home that document his right to stay in the U.S., Donnelly testified. Breyer's wife and two grandsons attended the hour-long hearing in Philadelphia on Wednesday. His extradition hearing was scheduled for Aug. 21. Efraim Zuroff, the head Nazi hunter at the Simon Wiesenthal Center in Jerusalem, said he hoped there would be no obstacles to Breyer's extradition and trial overseas. \"Germany deserves credit for doing this - for extending and expanding their efforts and, in a sense, making a final attempt to maximize the prosecution of Holocaust perpetrators,\" he said in a telephone interview from Jerusalem. 1 89-year-old man arrested on charges of aiding Nazi atrocities 2 Remains of 17 service members recovered from decades-old Alaska Globemaster crash 3 Sex offender apprehended with girl, 16, after high-speed chase 4 Oregon cat braves coyote country to make way to old home Should I Put My Vacation on a Credit Card? Refinance Into a 15-year Mortgage and Save", "articleID": "2014061923_00002848_W", "names": {"Thomas Walther": ["Q17127701", "Q30123161", "Q54900694", "Q55382753", "Q7794873"]}}, {"date": "2014-06-24", "url": "http://www.dailyherald.com/article/20140623/news/140629390/", "content": "Tracy Stellato of St. Charles points out fish to her son Dillon, 6, while children gather around a new aquarium tank Monday during the \"What's in the Aquarium?\" program at the St. Charles Public Library. The new aquarium was installed on Mother's Day, and children were invited to come and learn about the fish in the youth services area of the library. Brooke Herbert Hayes | Staff Photographer <mark>Martin Sullivan</mark>, 1 watches fish in the new aquarium after attending the \"What's in the Aquarium?\" program at the St. Charles Public Library on Monday. <mark>Martin</mark>'s mother Jill was excited to bring him to the library to hear a story about fish and learn about the new creatures in the tank. \"He loves the aquarium, this is his favorite thing to do at the library,\" she says. Brooke Herbert Hayes | Staff Photographer Lilly Hale, 7 and her mother, Amy of St. Charles hold a bag containing a fish during the \"What's in the Aquarium?\" program at the St. Charles Public Library on Monday. The program invited children to learn about the new aquarium that was installed on Mother's Day. On Monday afternoon, more than 25 children gathered with their parents at the St. Charles Public Library for the \"What's in the Aquarium?\" program, organized by the library's youth services director, A. Denise Farrugia. On Mother's Day, a new aquarium tank was installed at the library, replacing one installed in 1988. The new tank was a gift from the Junior Friends, a group of middle school student volunteers in St. Charles. During the program, Farrugia read the story, \"Memoirs of a Goldfish,\" as the children huddled around on the floor in their parents' laps. Afterward, Grant Bedow, who maintains the aquarium, talked to the children about the types of fish in the tank and let them hold bags filled with new fish that were to be placed in the tank later that day. On a wall was a gallery called \"Mail for Library Fish Friends,\" a collection of letters written from children during the aquarium renovation. After the program, children gathered around the aquarium as Bedow dropped the creatures into their new home in the tank. <mark>Martin Sullivan</mark>, 1, of St. Charles excitedly pointed out all the fish to his mother, Jill. \"He loves the aquarium,\" she said. \"This is his favorite thing to do at the library .\" ) We are now using Facebook comments to offer a more inclusive, social and constructive discussion. Guidelines: Keep it civil and on topic; no profanity, vulgarity, slurs or personal attacks. People who harass others or joke about tragedies will be blocked. If a comment violates these standards or our Interested in reusing this article? Custom reprints are a powerful and strategic way to share your article with customers, employees and prospects. The YGS Group provides digital and printed reprint services for Daily Herald. Complete the form to the right and a reprint consultant will contact you to discuss how you can reuse this article. EXPERIENCED DRIVER - Elgin metal company is hiring experienced CDL Class A tractor trailer drivers. Local and regional work around Chicago and an 800 mile radius. $21-hr. Call: 847-214-2800 for address to submit job application. (id:4377773) CLERICAL - Clerical-Must have good com-communication skills. General Office duties, AR & AP and high volume filing, fast paced environment. Email resume: custommfg237 @ gmail.com (id:4377824) AUTO TECHNICIAN - Auto - FT auto technician, must have own tools & scanners. Call Ernie 630-546-7773 after 4:30 p (id:4377434) INSTRUCTOR OF SOCIOLOGY - Education MORTON COLLEGE has the distinction of being the second oldest comprehensive community college in Illinois. Our pioneering spirit helped establish the learning community and continues today as a Hispanic Serving Institution to serve Cicero, IL and the surrounding communities. We currently have the following opportunity available: INSTRUCTOR OF SOCIOLOGY TENURE-TRACK/FULL-TIME FACULTY POSITION The seasoned faculty member we seek will be charged with teaching Sociology and Social Work courses to a diverse student population. Participating on faculty committees; performing other duties related to teaching at a community college; as well as staying abreast of ongoing developments, trends, and issues in instruction in the community college environment will also be involved. Qualified individuals must have a Master's degree in Sociology in addition to possessing 18 graduate credit hours in discipline. Excellent analytical, interpersonal, oral/written communication skills, as well as advanced PC proficiency. Academic preparation and teaching experience in all levels of Sociology, Social Work and Social Psychology as well as the ability to teach in an additional discipline desirable. Community college teaching experience preferred. Expertise working with culturally diverse students along with the ability to use technology to enhance teaching and learning are ideal. Morton College's Mission: To enhance the quality of life of our diverse community through exemplary teaching and learning opportunities, community service, and life-long learning. For more information and to apply for this position, go to www.morton.edu & click on Working @ Morton. Download application, authorization release form, and send cover letter, resume, copy of transcripts (required upon hire), & salary history via e-mail to: HumanResources @ morton.edu, fax: 708-656-0025, or mail to: HR Dept., Morton College, 3801 S. Central Ave., Cicero, IL 60804. EOE (id:4377215) RECEPTIONIST - RECEPTIONIST - PT needed - Naperville Dr - good skills w/people, computers, fast pace. Reply: drcrw717 @ gmail.com (id:4377849) CLEANING CREW - Help wanted to join cleaning crew that services rental properties in Des Plaines area. Duties include cleaning for vacant apartments and common hallways. Shift hours 7am-3pm-call 847-458-8886 or e-mail Pride.cleaning @ yahoo.com (id:4375473) AUTO TECH -? Auto tech with exp. / tools? possible advancement, paid vacation plus incentives Palatine/Crystal Lake locations 708-624-9612 (id:4377559) AUTOMOTIVE TECHNICIAN - Automotive Mechanic - Tech Wanted: Arlington Heights, IL, looking for full time Experience technician and full time apprentice, please call 847-788-0800 to set up interview. (id:4377387)", "articleID": "2014062413_00023028_W", "names": {"Martin Sullivan": ["Q51960321", "Q6776700"]}}, {"date": "2014-06-25", "url": "http://www.foxnews.com/us/2014/06/25/lawmakers-call-for-investigation-into-mass-graves-in-texas/", "content": "FILE: Members of the University of Indianapolis archeology & forensics laboratory, dig up a casket containing the remains of unidentified immigrants at the Sacred Heart Burial Park in Falfurrias, Texas. AP Photo/Corpus Christi Caller-Times, Todd Yates June 5: Forensic team members record measurements from an archeological dig at the Sacred Heart Burial Park in Falfurrias, Texas, where the graves of unidentified immigrants have been found. AP Photo/University of Indianapolis, Guy Housewright June 25: A marker with \"<mark>John Doe</mark>\" marked the grave of an unidentified immigrant at a cemetery in Falfurrias, Texas. The mass graves of suspected unidentified immigrants buried haphazardly in a South Texas cemetery and uncovered this month by anthropologists should be secured by state police until a criminal investigation can be carried out, a Texas lawmaker said Sunday. State Rep. Terry Canales, D-Edinburg, said he had asked the Department of Public Safety to secure the cemetery in Falfurrias following revelations of human remains buried in garbage bags and multiple remains put in a single body bag without proper records. DPS spokesman Tom Vinger said Sunday in an email that, \"the Texas Rangers plan to meet with local officials Monday to determine the proper course of action .\" ADVERTISEMENT Baylor University anthropologist Lori Baker and Krista Latham, a forensic anthropologist at the University of Indianapolis, worked with their students at the cemetery this month in an ongoing project to identify immigrant remains along the U.S.-Mexico border. The teams worked in Falfurrias last year as well and found similar practices. \"There's no question in one way or another that this is illegal, whether it violates the actual penal code or it if constitutes fraud,\" Canales said. The remains were buried by the Funeraria del Angel Howard-Williams, which has offices in Falfurrias and Hebbronville, Baker said Friday. Both Brooks and Jim Hogg counties contracted with the funeral home to bury unidentified remains there. \"This is not a respectful way of interring someone's remains,\" Baker said. \"And we had one, of course, with all of these bags on top of bags this year and not in a coffin. Most of these remains were not within a coffin, they were buried just in the body bags or whatever else they were recovered in .\" 52 graves this month, but will not know how many individuals they have until they are inventoried at the lab. A message left at Howard-Williams over the weekend was not returned. The funeral home's Houston-based parent company, Service Corp.. International, did not immediately respond to an email message Sunday. Service Corp.. International told the Caller-Times in a statement, \"No matter if this is one of our client families we serve on a traditional basis or a migrant family's loved one we're serving and we don't have any identification of the loved one, I do want to let you know it is our policy to treat the decedent with care, to treat them just like we would treat anyone else .\" State Sen. Chuy Hinojosa, D-Corpus Christi, told the Corpus Christi Caller-Times on Friday that he was calling for a criminal investigation. Hundreds of immigrants' have been recovered on the ranches in Brooks County in recent years. Smugglers guide immigrants through the brush trying to circumvent a Border Patrol highway checkpoint an hour's drive north of the border. There is little water and the walk can take two or three days in punishing temperatures. Canales said he had also submitted a public records request to the Brooks County auditor on Saturday for records that would show how many bodies the county had paid the funeral home to bury. 1 Electrical worker makes surprising discovery at substation 2 Man walks into NYC McDonald's with knife in back 3 Economy in freefall? 1Q revision shows shrinkage of 2.9% 4 Suspect in Mass. teacher killing \"foaming at the mouth' after attack on clinician, report says Money-Saving Budget Tips for the Summer General Mills Launches\" Formal Review' of Costs", "articleID": "2014062602_00038913_W", "names": {"John Doe": ["Q23727991", "Q3181360"]}}, {"date": "2014-06-25", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://finance.yahoo.com/news/mag-silver-reports-voting-results-203000187.html", "content": "VANCOUVER, BRITISH COLUMBIA--(Marketwired - Jun 25, 2014) - MAG Silver Corp. (MAG. TO) (NYSE MKT: MVG) (\"MAG\" or the \"Company\" ) announced today that at its annual general and special meeting (the \"AGSM\" ) held on June 24, 2014, MAG's shareholders approved by majority to decrease the size of the board to seven, elect all seven directors standing for re-election, re-appoint Deloitte LLP as the Company's auditor, and approve the Company's Equity Compensation Plans. The Board of Directors wish to extend their gratitude to Dr. Peter Megaw and Messrs. <mark>Eric Carlson</mark> and Frank Hallam, all of whom did not stand for re-election as directors for the ensuing year. Each of these directors has been instrumental in MAG's successes to date, and in particular, in the initial recognition of the value of property positions assembled at Juanicipio and elsewhere by the Company. Jonathan Rubenstein, Chairman of MAG, said, \"These individuals have been an integral part of the early and continued growth of the Company, and our shareholders have benefited greatly from their expertise, perseverance and commitment. The board thanks them for their dedicated years of service, and wishes each of them continued success in their future endeavours .\" The Company will maintain its close relationship with Dr. Megaw, who will continue to lead our exploration efforts, and Frank Hallam will remain accessible to the MAG Silver Finance Committee. Detailed results of the votes held by ballot at the AGSM are set out below. Nominee Total Votes Cast Votes For% For Votes Withheld% Withheld George N. Paspalas 35,831,724 35,659,529 99.52 172,195 0.48 Daniel T. MacInnis 35,831,724 35,561,749 99.25 269,975 0.75 Jonathan A. Rubenstein 35,831,724 35,538,010 99.18 293,714 0.82 Richard M. Colterjohn 35,831,724 35,716,871 99.68 114,853 0.32 Derek C. White 35,831,724 31,866,236 88.93 3,965,488 11.07 Richard P. Clark 35,831,724 29,940,359 83.56 5,891,365 16.44 Peter D. Barnes 35,831,724 35,643,406 99.47 188,318 0.53 Seconded Amended and Restated Stock Option Plan 45,577,917 32,481,187 71.27 13,096,730 28.73 Share Unit Plan 45,577,917 35,326,346 77.51 10,251,571 22.49 Directors' Deferred Share Unit Plan 45,577,917 35,340,665 77.54 10,237,252 22.46 George Paspalas, CEO and President of MAG Silver Corp., extends his thanks to the shareholders of the Company for their show of support. About MAG Silver Corp. (www.magsilver.com) MAG Silver Corp. (MAG. TO) (NYSE MKT: MVG) is focused on advancing two significant projects located within the Mexican Silver Belt. Our mission is to become one of the premier companies in the silver mining industry. Currently, we are advancing the underground decline towards the high grade Valdecañas Silver vein and delineating the Desprendido and Juanicipio discoveries in Zacatecas State, all within the joint venture between MAG Silver (44%) and Fresnillo PLC (56%). In addition, we are negotiating surface access in order to further delineate our district scale, 100% owned Cinco de Mayo property in Chihuahua state, where two new silver, lead, zinc discoveries are opening up further growth opportunities for MAG Silver Corp.. MAG is based in Vancouver, British Columbia, Canada. On behalf of the Board of MAG SILVER CORP.. George Paspalas CEO & Director Neither the Toronto Stock Exchange nor the NYSE MKT has reviewed or accepted responsibility for the accuracy or adequacy of this press release, which has been prepared by management. This release includes certain statements that may be deemed to be \"forward-looking statements\" within the meaning of the US Private Securities Litigation Reform Act of 1995. All statements in this release, other than statements of historical facts are forward looking statements, including statements that address future mineral production, reserve potential, exploration drilling, exploitation activities and events or developments. Forward-looking statements are often, but not always, identified by the use of words such as \"seek\" , \"anticipate\" , \"plan\" , \"continue\" , \"estimate\" , \"expect\" , \"may\" , \"will\" , \"project\" , \"predict\" , \"potential\" , \"targeting\" , \"intend\" , \"could\" , \"might\" , \"should\" , \"believe\" and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Although MAG believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include, but are not limited to, changes in commodities prices, changes in mineral production performance, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions, political risk, currency risk and capital cost inflation. In addition, forward-looking statements are subject to various risks, including that data is incomplete and considerable additional work will be required to complete further evaluation, including but not limited to drilling, engineering and socio-economic studies and investment. The reader is referred to the Company's filings with the SEC and Canadian securities regulators for disclosure regarding these and other risk factors. There is no certainty that any forward looking statement will come to pass and investors should not place undue reliance upon forward-looking statements. Please Note: Investors are urged to consider closely the disclosures in MAG's annual and quarterly reports and other public filings, accessible through the Internet at www.sedar.com and www.sec.gov/edgar/searchedgar/companysearch.html http: //www.sec.gov/EDGAR. Company Earnings Investment & Company Information NYSE Contact: MAG Silver Corp.. Michael Curlook VP Investor Relations and Communications (604) 630-1399 or Toll free (866) 630-1399 (604) 681-0894 info @ magsilver.com www.magsilver.com", "articleID": "2014062603_00091453_W", "names": {"Eric Carlson": ["Q5386239", "Q5386240"]}}, {"date": "2014-07-03", "url": "http://slate.com/blogs/the_spot/2014/07/03/patrick_battiston_harald_schumacher_what_happened_after_the_most_horrific.html", "content": "West German goalkeeper Harald Schumacher (right) jumps past the ball as he gets ready to collide with French defender Patrick Battiston during the 1982 World Cup semifinal match. Friday's World Cup quarterfinal between France and Germany is a repeat of one of the most iconic and dramatic games in World Cup history: the 1982 World Cup semifinal, notable for German goalkeeper Harald Schumacher's horrific challenge on Patrick Battiston, which left the French substitute unconscious, with two teeth knocked out and three cracked ribs. Schumacher was not booked and referee Charles Corver did not even award a foul ., Ben Lyttleton details how each of the key players in that game saw the Schumacher/Battiston episode, and how it affected their mindset going into the shootout. In this excerpt, he explains what happened after the final whistle. The game had finished at 23:41 local time, which goes some way to explaining why the Schumacher incident barely registered in the next day's analysis. \"Fabuleux!\" ran L'Equipe's headline, praising the France team for its attacking verve and coach Michel Hidalgo for fielding three playmakers in Alain Giresse, Michel Platini, and Bernard Genghini. \"One day later, the mood changed as the severity of Schumacher's challenge took top billing .\" Red-handed! \"was L'Equipe's front page, with an image of Schumacher's hip making contact with Battiston's jaw .\" A story of unpunished violence ....Schumacher was a brute. It's a morality tale which we will tell our children. \"Hidalgo changed his tone from valiant loser to angry victim .\" You say Corver is an international referee? I have my doubts, if he risks the safety of the players like that. \"L'Equipe's switchboard was jammed with anti-German calls and cars with German number-plates parked in French campsites had tires slashed and windows broken. To improve relations, Chancellor <mark>Helmut Schmidt</mark> sent an open letter of condolence to President Francois Mitterand .\" Our hearts go out to the French, who deserved to go through just as much as the Germans. \"French defender Patrick Battiston lies on the ground while waiting for the medical staff to come during the 1982 World Cup semifinal soccer match between West Germany and France. After Italy had beaten West Germany in the final -\" Justice! \"crowed L'Equipe - someone had the bright idea to send Schumacher on a diplomatic mission to France to apologize in person. Schumacher travelled to Metz on the day before Battiston's wedding and presented him with an FC Köln pennant and an apology. But the trip was not a success .\" Schumacher forgets himself, \"said German magazine Kicker .\" It was a gesture of reconciliation with unpleasant consequences. \"The pair were photographed sitting next to each other at a hastily arranged press conference, looking in opposite directions. Schumacher, objecting to questions from the French press, cut the conference short .\" This is something that concerns only Battiston and me, \"he said .\" If I had known, I would have brought my own German journalists with me. \"The peace offering had turned ugly .\" The bad guy just wanted to poke fun at the good guy, \"wrote One day after the failed reconciliation, Mitterand considered asking Hidalgo to get his players to state publicly that they had no problem with Schumacher. Hidalgo had his response ready:\" What, shall I ask them to take the Germans on holiday with them? \"That gave France Football magazine an idea: It asked the France team where they would take Schumacher on holiday. Here are the answers: Platini: To climb the Grandes Jorasses mountains [in Mont Blanc]. Maxime Bossis: To scale the heights of the Vallée Blanche [in Mont Blanc]. Dominique Rocheteau: To watch a sunset from the cliffs of étretat. Marius Trésor: To do a parachute jump with a delayed opening. Battiston: To help me pick mushrooms in the forest as I still can't bend down. It does not take a mastermind of psychology to spot the common theme. Platini, the French captain, believes that France needed to lose this game-which in French folklore is simply referred to as Sevilla 82-to help them win their first competitive trophy, the European Championship, two years later .\" The legend of this game comes from the fact that we lost it, \"said Platini .\" In losing it, we became a great team. It was the end, but also the beginning of something. In the history of French football, the two turning points were Sevilla 82 and the 1998 World Cup final. Sevilla marked a generation of football fans, gave them a collective state of mind: it's why books and plays have been written about the game. No movie in the world could have provided as much conflicting emotion as Sevila 82. It's certainly a beautiful moment in my career. It's the moment that makes you say afterwards, \"I'm glad I was there!' Even if you lose .\" The heroic failure inspired creativity. France's 1982 defeat indeed spawned books, documentaries, plays and music, all created by a generation for whom the game was a defining moment. In 2006, scenic-representation artist Massimo Furlan pretended to be Platini in his performance Number 10, in which he mimed the France midfielder's pass to Battiston, reaction to his injury, and his penalty kick, in an empty stadium save for one observer: the coach Hidalgo, watching from the sideline. Red, a French musician, played a concert he called Sevilla 82 against a visual backdrop of the game. France-Allemagne was a play examining the relationship between the two countries, set in a Frenchman's living room as he entertains a German guest with the game on in the background. French choreographer <mark>Pierre Rigal</mark>, who was nine in 1982, produced a dance piece, Injury Time, which he took to Potsdam in Germany. \"I remember it as a great injustice and frustration, an event that went beyond sport,\" he said, \"and my piece was a way of looking at how we treat childhood memories .\" Twenty-seven years after the game, totally out of the blue, Battiston received a package from his old teammate Platini. It was his full kit from the game-blue shirt, white shorts with the distinctive circled number three, and red socks-which had been left in the dressing room, kept in a Seville museum, and then presented to Platini on one of his UEFA presidential trips. Battiston was emotional when he opened it; the kit now hangs in his son's bedroom. Schumacher also gave Battiston his goalkeeping jersey before a friendly between the two sides in Strasbourg in April 1984. Battiston has no idea where it is now, or even if he still has it. by Ben Lyttleton, out now from Bantam Press. 1. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone 2. Help! I'm a Woman in My 50s, and if I Don't Have Sex Soon I'll Explode. 3. Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else 4. Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal 5. Doctors Are Examining Your Genitals for No Reason 1. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone 2. U.S. Goalkeeper <mark>Tim Howard</mark> Was the Man of This or Any Match 3. How Obama Can Save the Whales in the World's Largest Marine Reserve 4. What Happens When People Around the World Photoshop the Same Woman's Image July 2 2014 5:23 PM Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal It's music to the ears of Republicans and Obama aides alike. For Democrats in battleground states, not so much. July 2 2014 11:48 PM The Contradiction at the Heart of Road-Tripping Thirteen ways to minimize your nature-loving drive's cost to nature. These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone Help! I'm a Woman in My 50s, and if I Don't Have Sex Soon I'll Explode. Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal Doctors Are Examining Your Genitals for No Reason France, West Germany, and the Most Horrific Challenge in World Cup History House Arrest Isn't Keeping a Former Bitcoin CEO Grounded The Cannibal Cop Goes Free-but What About the Murderous Mechanic and Loathsome Librarian? Mississippi Senate Battle Descends Into Madness The Term Could Have Been a Lot Worse, but It Was Pretty Bad Obama's \"So Sue Me\" Taunt Has Bipartisan Appeal These Brilliant Women Figured Out How to Bike in a Skirt Without Flashing Everyone Iran's Modern Family Rip-Off Is Not So Modern <mark>Melissa McCarthy</mark> and Susan Sarandon Have Terrific Comic Chemistry in You Won't Be Able to Buy the TVs With the Best Picture Quality Anymore Facebook: \"We Never Meant to Upset You\" People in the Outer Banks Should Seriously Consider Evacuating Today Netizen Report: Researchers Uncover Mobile Phone Spyware in 60 Countries House Arrest Isn't Keeping a Former Bitcoin CEO Grounded The Man Who Won the Bitcoin Auction Would Also Make Silicon Valley Its Own State Census: One-Quarter of Americans Now Live in \"Poverty Areas\" Thirteen Ways to Minimize the Contradiction at the Heart of a Road Trip Nightmare Wasps Build Nests With Corpses NFL Cheerleaders Finally Have Something to Cheer About The First \"Men's Issues\" Conference Makes a Good Point. And a Lot of Bad Ones. What I Learned From Talking to Tinder's Justin Mateen About Women Monday's Other Supreme Court Decision That Attacked Female Workers France, West Germany, and the Most Horrific Challenge in World Cup History Lionel Messi Has Figured Out How to Win Matches by Moving Less Than Everyone Else Who Was Dent McSkimming, the Lone American Reporter at the 1950 World Cup? Help! My Dad Is Dating My High School Nemesis. Your Novelty Trip to Antarctica Is Threatening Its Ecosystem (Video) One of the World's Rarest Animals Spotted, but Experts Are Concerned (Video) Up to 1 in 10 U.S. Beaches Too Polluted for Swimming (Video) America's Vanishing Historic Movie Theaters Inside a Colorado Marijuana Dispensary Otherworldly Photos of Mysterious Megalithic Stones A Front-Row Seat for the War on Drugs The Gabbers Talk Click Bait. You Won't Believe What They Say. <mark>Tim Howard</mark> Was Everywhere, but It Wasn't Enough for the U.S.. When the Amish Get Rich, the Simple Life Stops Looking So Simple Podcast Extra: What's Hinky About Hobby Lobby? What Should You Be Listening to Right Now?", "articleID": "2014070319_00006825_W", "names": {"Helmut Schmidt": ["Q1287343", "Q15989591", "Q1604141", "Q1604142", "Q1604145", "Q22669764", "Q2516", "Q41048665"], "Melissa Mccarthy": ["Q229048", "Q50437115"], "Pierre Rigal": ["Q30126151", "Q3386797"], "Tim Howard": ["Q16226269", "Q200785", "Q7803679"]}}, {"date": "2014-07-04", "url": "http://newsobserver.com/2014/07/03/3983753/mint-hill-man-rides-out-hurricane.html?sp=/99/100/&ihp=1", "content": "Mint Hill man rides out Hurricane Arthur...in middle of ocean Related Links: Link Watch video of Hurricane Arthur from in-ocean B & B Frying Pan Station Link The storm: News, photos, video, stats, forecast and more Link Get the latest storm data and follow its path with ABC11's storm tracker Related Stories: Hurricane Arthur makes landfall on NC coast A Mint Hill man didn't have to chase Hurricane Arthur to experience the storm's fury. He just waited for the storm - in the middle of the Atlantic Ocean. <mark>Richard Neal</mark> is owner of Frying Pan Tower, an old U.S. Coast Guard tower anchored about 35 miles east of Wrightsville Beach, and on Thursday he provided play-by-play on his Facebook page as the hurricane roared almost directly over his station. \"This is quite a storm,\" <mark>Neal</mark> said at one point Thursday evening, after a weather station at his tower registered a wind gust of 99 mph. \"We just entered the eye of Arthur!\" he wrote in a Facebook post shortly before 6 p.m. <mark>Neal</mark> paid $85,000 for the rusting station in an auction in 2010, converting it into a bed-and-breakfast for people who love the ocean and those looking for an up-close fishing expedition. The station, which is 140 feet off the ocean surface, was abandoned by the Coast Guard in the late 1970s. <mark>Neal</mark>, a software sales engineer, decided to ride it out Thursday on his tower. As the center of Hurricane Arthur approached during the afternoon, <mark>Neal</mark> continued to provide updates on Facebook. He reported 24-foot waves about 4 p.m. and then the 99-mph gust nearly two hours later. About the same time, he said a government buoy apparently broke loose from its anchor and drifted by. \"NOAA Buoy No. 16 just slid past us, heading toward the Wrightsville beaches,\" he reported on Facebook. A short time later, he posted video of the buoy being carried away by huge waves. His reports quickly caught the fancy of weather followers and national media. ABC News showed the video on its evening news, and <mark>Neal</mark>'s video was the rage on weather Internet bulletin boards. \"This is like a getaway to me,\" Wood said in a 2012 Charlotte Observer story. \"I got up at 7:30 and worked until the sun went down. It's fun being out in the middle of the ocean, nothing but blue water all around, and doing restoration .\" Lyttle: 704-358-6107; Twitter: @ slyttle", "articleID": "2014070414_00028064_W", "names": {"Richard Neal": ["Q1464697", "Q7328011"]}}]