[{"articleID": "2011101911_00059993_W", "names": {"Ray Charles": ["Q7297319", "Q872846"], "Eric Holder": ["Q312644", "Q3591180"]}, "date": "2011-10-19", "url": "http://dispatch.com/content/stories/national_world/2011/10/19/iran-alleged-plotter-part-of-opposition.html", "content": "upcoming events from columbusalive.com road jack: the music of <mark>ray charles</mark> featuring roger hines and sarah morrow at the lincoln theatre. home delivery of the columbus dispatch, the dispatch e-readers or a combination of all three. for billing, call 1-866-790-7748. for other inquiries, use our staff directory. subscriptions subscribe to advertising for classified advertising, visit ohgetit.com or call 614-888-8888. for national advertising, call 614-461-5199. for retail advertising, visit our media kit or call 614-461-5143. for other inquiries, use our news tip form or call 614-461-5200. to contact a staff member, visit our iran: alleged plotter part of opposition iran: alleged plotter part of opposition greenslade, brady appointed to turnpike and lottery commissions. ohio attorney general mike dewine believes it will be difficult for one of his clients to build a case to withhold public records sought by the dispatch. the newspaper's request for records surrounding american electric power's potential rate-hike settlement before the public utilities commission of ohio led the utilty and others to petition the puco to shield the records from release as trade secrets. however, dewine said yesterday that it appears the records must be released and that any move to deny the records would have to be justified by strong legal arguments that do not appear at hand. iran injected a new twist yesterday into the week-old u.s. accusation of an iranian plot to assassinate the saudi ambassador to washington, asserting that one of the defendants actually belongs to an outlawed and exiled opposition group. the defendant, gholam shakuri, identified by the justice department as an operative of the elite quds force of iran's revolutionary guards corps, is a \"key member\" of the muhajedeen-khalq, iran's mehr news agency reported. the agency did not explain the group's possible motive but implied that the plot was a bogus scheme meant to ostracize iran. it said shakuri, who is at large, was last seen in washington and in camp ashraf, the group's enclave in iraq. \"the person in question has been traveling to different countries under the names of ali shakuri/gholam shakuri/gholam-hussein shakuri by using fake passports including forged iranian passports,\" mehr said. u.s. officials did not comment on the mehr report. mark toner, a state department spokesman, reiterated the u.s. view in washington that \"this was a serious breach of international law and that iran needs to be held accountable.\" the opposition group itself dismissed the mehr report as nonsense. shahin gobadi, a spokesman, wrote in an email that \"this is a well-known tactic that has been used by the mullahs in the past 30 years where they blame their crimes on their opposition for double gains.\" the group, also known as the national council of resistance of iran, is regarded by iran as a violent insurgent organization with a history of assassinations and sabotage aimed at overthrowing the islamic government that took power in 1979. although the group says it renounced violence a decade ago, it is still classified as a foreign terrorist organization by the state department, but not by britain or the european union. it maintains a headquarters in paris. mehr said it had learned what it called the new information about shakuri from interpol but gave no details. calls and emailed queries to interpol were not immediately returned. if shakuri were a member of the opposition group, it would embarrass the united states, which announced the suspected plot with some fanfare a week ago. in a televised news conference, attorney general <mark>eric holder</mark> said u.s. investigators thought that high-level officials in iran were responsible. the justice department has accused shakuri and mansour j. arbabsiar, a naturalized iranian-american citizen from corpus christi, texas, of conspiring to hire assassins from a mexican drug gang for $1.5 million. u.s. officials have acknowledged that the suspected plot sounds hard to believe but asserted they have the evidence to back it up. saudi arabia has accused iran of a \"dastardly\" scheme, and other u.s. allies say they take the accusation seriously. greenslade, brady appointed to turnpike and lottery commissions. lindner's death signals loss of one of ohio's most prolific political fundraisers"}, {"articleID": "2016072723_00048945_W", "names": {"Brad Watson": ["Q4954344", "Q4954347"], "David Goldblatt": ["Q16196023", "Q51053608", "Q569669"]}, "date": "2016-07-27", "url": "http://www.nytimes.com/2016/07/31/books/review/editors-choice.html", "content": "Book Review Editors' Choice JULY 27, 2016 Continue reading the main story Share This Page Nine new books recommended by the editors of The New York Times Book Review this week. Photo HEROES OF THE FRONTIER, by Dave Eggers. (Knopf, $28.95 .) In Eggers's funny, empathetic novel about learning to survive, a woman flees her crumbling life in Ohio and takes her two children on a road trip to a dystopian Alaska. BUSH, by Jean Edward Smith. (Simon & Schuster, $35 .) \"Rarely in the history of the United States has the nation been so ill-served,\" Smith writes in his readable critical biography of George W. Bush. CHRONICLE OF A LAST SUMMER, by Yasmine El Rashidi. (Tim Duggan, $22 .) A perceptive novel about the political coming-of-age of an Egyptian woman, ending with the 2011 revolution. WE ARE NOT SUCH THINGS: The Murder of a Young American, a South African Township, and the Search for Truth and Reconciliation, by Justine van der Leun. (Spiegel & Grau, $28 .) A 1993 killing sheds light on the complexities of modern South Africa. MISS JANE, by <mark>Brad Watson</mark>. (Norton, $25.95 .) <mark>Watson</mark> imagines the life of a relative with a genital birth defect in early-20th-century Mississippi in this ambitious, touching novel. Book Review Newsletter Sign up to receive a preview of each Sunday's Book Review, delivered to your inbox every Friday. BRAZILLIONAIRES: Wealth, Power, Decadence, and Hope in an American Country, by Alex Cuadros. (Spiegel & Grau, $28 .) A deeply reported account of Brazil's outsize collection of tycoons. THE GAMES: A Global History of the Olympics, by <mark>David Goldblatt</mark>. (Norton, $29.95 .) An exhaustively researched account of the modern Olympic movement, warts (there are many) and all. THE HEAVENLY TABLE, by Donald Ray Pollock. (Doubleday, $27.95 .) This old-fashioned yarn is also a rollicking satire on our faith in modernity. THE VEINS OF THE OCEAN, by Patricia Engel. (Grove, $25 .) A Colombian-American woman flees the demons of her past in this sumptuous novel. A version of this list appears in print on July 31, 2016, on page BR26 of the Sunday Book Review. Order Reprints | Today's Paper | Subscribe Continue reading the main story We're interested in your feedback on this page. Tell us what you think."}, {"articleID": "2018020903_00666379_W", "names": {"Chris White": ["Q1077846", "Q19560238", "Q264420", "Q2964892", "Q2964894", "Q42434048", "Q5108458", "Q5108459", "Q5108461", "Q5108462", "Q5108463", "Q5108464", "Q56422264", "Q727678"], "Kim Jong-Un": ["Q10855883", "Q56226"], "Donald Trump": ["Q22686", "Q27947481"]}, "date": "2018-02-09", "url": "http://nzherald.co.nz/travel/news/article.cfm?c_id=7&objectid=11991234", "content": "NZ Herald Whose side are you on? On the Korean border island divided by Winter Olympic rivalry 9 Feb, 2018 3:30 pm 6 minutes to read As Korea puts out the Olympic rings on Gyeongpo beach, not everyone is rooting for the host nation. Photo / Sergei Boby, Getty Daily Mail Share on Reddit reddit <mark>Chris White</mark> visits Gyodong Island and the tiny sliver of water between South and North Korea, for the Daily Mail When the Winter Olympics opening ceremony begins tonight in PyeongChang, there will be an area of the host nation South Korea cheering on their bitter rivals in the North. The people of Gyodong Island have more in common with <mark>Kim Jong-un</mark>'s side of the border than their own - it's the \"North Korea of the South\" . The tiny South Korean isle, situated right on the border with North Korea, has barely any military presence and the people on each side wave happily to each other. Advertisement Advertise with NZME. Residents don't need to set their alarm, as they've got a 7am wake up call from North Korea's propaganda radio. When the Korean War began in 1950, locals were told to swim down to the other side and \"in a few days\" , the island would be taken back by the North Koreans. It never happened, but the Gyodong residents, who speak with North Korean accents, have never forgotten which side they're on. No one is as close to the communist regime as they are. There's not millions of landmines, tanks and military, just a tiny sliver of the Yellow Sea and a fence. North Korean cheering squads arrive south, ahead of the Olympic opening ceremony. Photo / Ahn Young-joon-Pool, Getty Share on Reddit reddit Even the fence is fairly recent after so many people from the north were floating down to the south. It's that close, only 1.2 miles wide, that any potential North Korean defector was able to ride the tide down to the south's edge. A council official tells us \"at the right time and place, you can float your way here.\" Gyodong has been stuck in the past with propaganda posters lining the streets of the main town of Daeryong, and the retro market stalls are manned by first generation North Korean defectors, who are bitter sweet about the last sixty-odd years. Related articles: 2 minutes to read But now they're opening their arms to international tourism - especially English-speaking ones. A bridge was built connecting the island to the Korean mainland in 2014 and people are fast hearing about the island's charm, it's now becoming popular with expats living in Seoul, three hours away by car. Park Jang Ja has loaded her shop with British and American clothes and bags, she says she \"loves the English\" and, as we speak, she's got her face glued to the screen as <mark>Donald Trump</mark> is making a speech and she's holding a pillow with a Union Jack. She's wearing Bean Pole clothing, a trendy South Korean store with a Penny Farthing as its label. The brand claims it wants to \"emphasise the British-like style that they aim for\" , signing Mark Ronson and Cara Delevingne as models. \"I've been here for about 45 years. I was here before the bridge, when people had to come here according to the ebbs and flows of the day,\" says Park. \"And now that there is a bridge, people can finally buy stuff in my store, we want more tourists, I love all the visitor's gear!\" My parents are first generation descendants of North Korea. Of course, I feel a part of them. \"Those people on the north, in the Spring, when we replant the rice in our paddy fields, they too are on their paddy fields. Before the fence was there, you could hear them talk.\" Now, every morning the North Koreans have broadcasts and you can hear it. I'm not scared. It's part of my life. When you hear the announcement in the morning, you know it's 7am. \"Gyeongpodae Beach: life continues as normal within the divided Olympic host nation. Photo / GWoohae Cho, Getty Share on Reddit reddit Gyodong Island Council Officer <mark>Kim</mark> Joeng Seop is promoting tourism in the area, saying:\" North Korea is certainly missed in these parts. As people get older, they seem to miss their roots and value their heritage and lineage more. \"Some tourists even say that the people here speak with a North Korean accent. So in a figurative sense, we are very close with North Korea.\" The residents of this island have more in common and more interactions with their northern counterparts than South Koreans. In that sense, maybe the residents here feel a bond. \"Now <mark>Kim</mark> says that they want to open their doors to more international tourists like the Brits\" , adding: \"We are far out on the west, so development hasn't been so fast. However, what first was a flaw is now an idiosyncratic aspect of the island. Tourists have called the island\" the island that has been trapped in time. \"\"After the bridge was laid, there are many tourists coming, especially during the weekend, we are getting people who want to escape Seoul. Now we are one of Korea's\" Year of Tourism' areas, which has helped us get a head start in tourism. \"We are using this opportunity to increase tourism, but also increase awareness of our role in the unification and peace advocacy community.\" We have built a Peace Bicycle Trail all around the fence and an observatory, where people can see normal North Koreans on the fields, as opposed to the military images that they often see on the media. \"Every year, defectors in the island climb to the top of Manghyangdae Mount, at the northern end of Gyodong, which looks out onto the North Korean town of Yeonbaek, Hwanghae Province. They say a prayer, shed a tear and are homesick for the place across the water. <mark>Kim</mark> Yong-jin is 83 and has a store in Daeryong. He came to the south on a makeshift raft in 1951.\" I was still in school when the Soviets, the Chinese, and the North Korean People's Army came down, they told us to go, we made a raft and came down together, there were no motorboats or anything, \"he said.\" I mean now there is a fence and a seawall, but back then, it was easy, South Korea had nothing. \"Most of us [people of North Korean descent] left the mainland during the war and settled down here, expecting this island to be part of North Korea later. They said that this island would be absorbed by North Korea within a few days, but what rubbish, it's been sixty years now.\" You might have seen a black monolith next to the telescopes. That's where the defectors and people of North Korean descent who miss the north do a ceremony in remembrance of their ancestors every year. \"Those very people who came from the North made this traditional market back then. Now the people of North Korean descent are all scattered around, but on the day of the ceremony, they all come down here.\" 9 Feb, 2018 3:08 pm 2 minutes to read The Joker is getting an origin movie and Joaquin Phoenix is in talks to play the lead."}, {"articleID": "2020021123_00121536_W", "names": {"Muhammad Ali": ["Q10553031", "Q1951824", "Q20028158", "Q25413111", "Q36107", "Q47416612", "Q47541670", "Q55767447", "Q57548742", "Q57571851", "Q59197412", "Q6932369"]}, "date": "2020-02-11", "url": "http://www.irishnews.com/magazine/entertainment/2020/02/11/news/justin-bieber-gives-explicit-insight-into-marriage-to-hailey-baldwin-1840201/", "content": "Justin Bieber gives explicit insight into marriage to Hailey Baldwin The singer celebrated the imminent launch of his fifth album Changes with a performance in London. 11 February, 2020 22:51 Justin Bieber offered an explicit insight into his marriage to Hailey Baldwin during an intimate concert in London. The pop star, 25, told fans gathered inside the Indigo venue at the O2 Arena that he and his wife liked to \"Netflix and chill\" during their downtime. Asked by a fan what he did to relax, he said: \"It depends who I am with. When I am with my wife we...You guys can guess what we do all day. It gets pretty crazy sometimes, I can tell you that. Hailey Baldwin Bieber (Ian West/PA)\" Yeah, that's pretty much all we do, to be honest. We like to watch movies--to Netflix and chill. We do more of the chilling part. \"I play a lot of sports, as you guys know. I have been playing sports. Hockey and soccer. I have been playing a lot of hockey, which I really like.\" Justin and Hailey were first married in a secret ceremony in New York in September 2018, but exchanged vows for the second time in South Carolina in October. They have known each other for several years and started dating in 2016. They later split but rekindled their relationship in May 2018. Dressed in jeans, a black sweater and orange beanie, Bieber celebrated the imminent release of his fifth album Changes by performing a five-song set backed by two acoustic guitarists. Justin Bieber in London ahead of the concert (Yui Mok/PA) He paid tribute to Hailey, saying: \"I'm telling you, being married is so awesome. But don't get it twisted, marriage is not easy.\" It is something you have got to work for. If marriage was easy everybody would just do it really fast. \"If you guys want to be serious and get married just know it is not just something...It takes work.\" Every day you have to love that person, be kind to that person. It takes work because when you do it is powerful. It's just incredible. \"His set included the new tracks Yummy, Intention and Changes, as well as the 2015 song Love Yourself, during which he read lyrics from a phone. View this post on Instagram 3 days til #Changes A post shared by Justin Bieber (@ justinbieber) on Feb 11, 2020 at 8:59 am PST Bieber addressed how his experience of depression, drug use and Lyme disease had influenced the album. He said:\" The past couple of years have been, I'm not sure have you seen my new docu-series, but it has been a rough couple of years, just going through a lot of different changes. \"It has been interesting but I think this music really reflects the past few years--some of the hardships, some of challenges, some of the changes.\" I got married over the past few years to a beautiful beautiful lady, who I miss a lot. \"Asked which famous person he would like to meet, dead or alive, he replied:\" <mark>Muhammad Ali</mark>. \"Changes is released on February 14. Enjoy reading the Irish News? Subscribe from just £ 1 for the first month to get full access Subscribe Topics Showbiz Bieber UK Featured Hailey Baldwin Justin Bieber PA story composite Categories Entertainment 11 February, 2020 22:51 Entertainment"}, {"articleID": "2011042206_00063866_W", "names": {"Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2011-04-22", "url": "http://hindustantimes.com/A-Chinese-chat-on-incredible-India/H1-Article1-688152.aspx", "content": "while the leaders of india and china were in sanya negotiating how to improve cross-border ties, a 30-year-old chinese fan of prime minister <mark>manmohan singh</mark> described to me his travels in mumbai, delhi and agra. \"your country is incredible! magical!\" said woody, when we met at the airport of sanya ci ty, which is what goa could look like after a chinese highway makeover. our conversation moved on, as it usually does when the chinese discuss india, to corrupt babus. \"a post office employee gripped my envelope and demanded rs 50 to return it,\" woody said. \"i gave him rs 200.\" he had plenty of questions. why can't your government pay better salaries to stop bribery? why do people still live in slums? why do indians eat so much on trains? have you seen that billionaire's new house in mumbai? what! shilpa shetty got married? two recent headlines from india, on the anti-corruption campaign and the meeting between <mark>singh</mark> and president hu jintao, went nearly unnoticed in china. the anna hazare-led civil society movement stayed out of the state newspapers for obvious reasons, at a time when mass gatherings even of sections of churchgoers are being swiftly suppressed in beijing. the indication that the kashmir stapled visa dispute is being patched up was splashed only in india. china continues to maintain that its kashmir policy is unchanged and beijing insiders dismiss the visa issue as a technicality. \"it is wrong to play up the visa issue,\" beijing-based strategist rong ying told ht after the announcement in sanya. the big breakthroughs in bilateral relations are still decades away in the eyes of government insiders and even optimistic young chinese indophiles. the buzz among chinese thinkers from northern beijing to southern sanya is that major bilateral roadblocks like the border dispute should be shelved for the next generations of leaders to deal with."}, {"articleID": "2019021208_00407097_W", "names": {"Sophie Turner": ["Q240573", "Q735034"]}, "date": "2019-02-11", "url": "http://msn.com/en-xl/northamerica/northamerica-life-arts/ser-pounce-game-of-thrones-beloved-fan-favourite-cat-was-killed-off-screen/ar-BBTtyWO?li=BBKxJ6T", "content": "© HBO Spoilers for previous Game of Thrones seasons ahead. Game of Thrones' eighth season hasn't started yet, but showrunners David Benioff and D.B. Weiss recently confirmed in an interview with Entertainment Weekly that at least one fan-favorite character won't make it out of the final season alive: Ser Pounce, Tommen Baratheon's pet cat, who was introduced back in season 4. According to Benioff, \"Cersei hated the name\" Ser Pounce' so much she could not allow him to survive. So she came up with her most diabolical [execution]. Ser Pounce's death was so horrible we couldn't even put it on the air. \"© Shutterstock Kit Harington Ser Pounce's death may not come as much of a surprise, given that the cat only appeared in a single episode, back in season 4's\" Oathkeeper. \"Still, the recent reappearance of long-missing characters like Beric Dondarion and Gendry in season 7 left some fans hoping Ser Pounce might have a return in store, too, despite the death of his owner, Tommen Baratheon. Tommen committed suicide back in season 5, after his wife Margaery was killed in the explosion that destroyed the Great Sept of Baelor. Actor Dean-Charles Chapman, who portrayed Tommen, commented back in 2016 that he hoped Ser Pounce\" didn't get caught up in the blast, \"and that the cat would\" move on with his life and get a girlfriend maybe, \"in the wake of that tragedy. Alas, it seems such a return is not to be.\" That cat was really not fun to work with. \"Plot points aside, it's also possible that the two showrunners may have had other reasons for killing off the cat off-screen--simply, it seems that the cat that played Ser Pounce was kind of a diva.\" That cat was really not fun to work with, \"Benioff notes in the same interview.\" Dogs generally do what you ask them to do if they're smart and well trained, \"Weiss says.\" Cats have their own agenda. \"© Shutterstock <mark>Sophie Turner</mark> Chapman's similarly said working with Ser Pounce was difficult, telling the Huffington Post that when filming the scene,\" That cat that day would have none of it. He was just loving life. He just really wasn't on his game that day. \"Chapman went on to speculate,\" I think that was the reason why they didn't have him back because it's just hard work. Cats can't understand English, so you tell a cat, \"Come on. Jump on the bed,' and he just looks at you like,\" What are you talking about? \"' And Natalie Dormer--who shared the scene with Ser Pounce and Chapman--also confirmed the issue in a 2014 Reddit AMA, commenting that\" Ser Pounce was a bit of a diva that day, he didn't want to stay on the bed, he was very difficult to work with. \"© Shutterstock Kristofer Hivju It seems that inability to play well with others led to Ser Pounce ultimately being killed off-screen. Or possibly the showrunners are just joking around about their ability to be cruel to both the Game of Thrones characters and their audience. At time of publication, The Verge's managing editor, TC Sottek--whose 2016 Game of Game of Thrones team was named\" Ser Pounce's Feral Menagerie \"--was quoted as saying:\" I am very sad. \"Game of Thrones will return on April 14th with its eighth and final season. And if the past books and episodes are anything to go by, Ser Pounce certainly won't be the last character to meet an untimely, messy fate before the end."}, {"articleID": "2017070319_00128964_W", "names": {"Elizabeth Peters": ["Q451009", "Q47451301"]}, "date": "2017-07-03", "url": "https://almanacnews.com/news/show_story.php?id=22793", "content": "Uploaded: Mon, Jul 3, 2017, 11:10 am Renegade robot makers by Kate Bradshaw / Almanac Renegade Robotics Team Coach Leslie <mark>Peters</mark> addresses the team members at the beginning of long summer work day, on June 14, 2017. The team has been known to log in 14 hours in a single weekend building robots. Photo by Ana Sofia Amieva-Wang View All Photos (9) They wear purple capes. They decorate their gear with stick-on jewels, and carry a tote bag decorated with their team logo. They also program a robot to operate autonomously and with remote controls. And, in two years, they've gone from starting their own team to competing in the world championships at an activity known widely to be skewed male. They're Renegade Robotics, an all-girls robotics team made up of five high school students from Menlo Park and Portola Valley: Serena <mark>Peters</mark> (grade 9), Avani Anne (grade 10) and Navya Anne (grade 12) at Menlo-Atherton High School; Anna Beaver (grade 11) at Woodside High School; and <mark>Elizabeth Peters</mark> (grade 11) at Pinewood School. Coached by Leslie <mark>Peters</mark>, mother to <mark>Elizabeth</mark> and Serena, they compete in a league called VEX Robotics, run by the Robotics Education & Competition Foundation. Unlike other leagues, where there is a set amount of time that teams are given to work on their robots, the VEX league allows teams to work on iterations of their robots over the course of a year, as they develop robots that can complete a set of challenges during two-minute, two-on-two competitions. Of about 11,000 teams in 32 countries, about 700 are all-female, a VEX Robotics spokesperson says. At the California state championships, the Renegade team members were almost the only girls competing among 36 teams, Coach <mark>Peters</mark> says. \"VEX Robotics has a particularly bad male-to-female ratio,\" she says. Renegade is one of only two all-girls teams in Silicon Valley--\"the other one is the one we left,\" she says. The girls split from the other team because they wanted to spend more time building robots, Ms. <mark>Peters</mark> says. Team members interviewed by the Almanac say they typically meet for three-hour sessions twice a week in a teammate's garage. They have been known to log as many as 14 hours in a single weekend, but they find the work rewarding. \"It's the best way to spend your free time,\" Anna says. <mark>Elizabeth</mark>, who does a lot of the programming to make the robot move autonomously, says she loves the feeling when the robot starts working. \"It's all this work, but then (it starts) and you're like,\" Whoa! We built this! It's doing things. It's doing really cool things!'...and you feel so proud that you made this thing that can move on its own. \"The competition At the annual world championships, the next year's\" game, \"or set of challenges that the robots will have to complete, is announced. Then the work begins back home. After an intensive study of the rules, there are discussions of strategy and how to best score points. Then comes designing, prototyping, testing and practice driving the robot. Unlike many of the boys' robots, which are driven usually by one student, the girls say, the Renegade team has multiple drivers operating different parts of the robot. This year, after competing in local tournaments and the state championships, the girls' robot didn't perform well enough to qualify for the world championships the traditional way, by beating the tournament bracket. Instead, they got into the competition with a wild-card spot given for winning a video competition. Their video was about how to use an LCD display to calibrate the robot. They say they were motivated to win the competition after receiving an honorable mention the previous year for their tongue-in-cheek video about how handy it is to have a\" magic \"tote bag to carry extra supplies. At the 2017 VEX Worlds, a world competition, held April 19 to 22 in Louisville, Kentucky, they saw all-girls teams from other countries, and placed higher than they expected to, with a 5-5 record. Unsurprisingly, the level of robotics competition in Silicon Valley more than holds its own compared to other regions.\" The problem with being from Silicon Valley is that this is where all the good teams are, \"Anna explained. China and Singapore are also known to be highly competitive, the girls say. Mentor of the year The team also submitted an essay to the organization nominating Ms. <mark>Peters</mark> for the Mentor of the Year award, which she won and was presented with at the world championships. Though she has a STEM background--she studied mathematics at Princeton and was an actuary before she had kids--Ms. <mark>Peters</mark> says.\" I had to learn all of this stuff really quickly so I get to be just a bit ahead of the girls. \"She now blogs about strategies and problem-solving for VEX teams. Ms. <mark>Peters</mark> and Serena have also helped to mentor an upcoming robotics team at the Corte Madera School in Portola Valley. According to principal Cyndi Maijala and Jason Borgen, the school's director of innovation and learning, parents of Renegade Robotics team members have been involved in helping to launch a competitive robotics program at the school, and the girls have helped to mentor the co-ed middle school team. Success\" I think their success is self-reinforcing, \"Ms. <mark>Peters</mark> says about the team.\" They put in a lot and they have a lot to show for it, and that makes them want to keep going. \"She points to a shelf in the garage lined with trophies:\" This is two seasons of five girls in a garage. \"Because each team must join with another team to face off against two others during the competitions, and are matched up randomly during the tournaments, Ms. <mark>Peters</mark> says, the team has had to learn how to negotiate with other teams to discuss strategy and have confidence in their robot's performance. As middle - and high-school female engineers, they say they sometimes come up with fixes that are different than what boys would do. Using hair ties to help hold pieces in place is an example, Anna said. They also decorate their robots with stick-on jewels and stickers, and have a tradition of naming each year's robot after a secondary Disney character. Ms. <mark>Peters</mark> said the team is looking to add one or two more girls, but noted that there is a significant time commitment. Their next tournament is expected to be held in September.\" It really is fantastic preparation for the real world of engineering, \"she said.\" The girls are getting more confidence as they get older. \"Serena, who will start as a freshman at Menlo-Atherton High School in the fall, said the skills she's learned on the robotics team make problem-solving challenges in science class easier and more fun. Anna described how she felt when the team's robot performed well at a competition.\" You get this insane vibe--you just want to dance, \"she said. __"}, {"articleID": "2014032804_00020537_W", "names": {"Josh Charles": ["Q472282", "Q6288750"]}, "date": "2014-03-27", "url": "http://www.people.com/people/article/0,,20800929,00.html?xid=rss-topheadlines", "content": "Nicole Richie's House of Harlow 1960 Debuts Clothing Line (PHOTOS) Still America's Sweetheart: Inside Our Girl Talk Gab Fest with Jennifer Aniston Lindsay Lohan is exercising her comedic chops with a guest-starring role on 2 Broke Girls, and PEOPLE has the first look. The actress, 27, plays Claire Guinness, a bride-to-be who asks Max (Kat Dennings) and Caroline (Beth Behrs) to make her wedding cake, then struggles with decisions throughout the process. \"Lindsay was fantastic. It was so much fun,\" Behrs told PEOPLE Wednesday at the Night at Sardi's event benefiting the Alzheimer??? s Association. \"I can't wait for everyone to see it. It's going to be a really funny episode!\" Lohan has also guest-starred on Eastbound & Down, Anger Management and Glee. Her documentary series <mark>Josh Charles</mark>: His Shocking Good Wife Exit"}, {"articleID": "2014090123_00042792_W", "names": {"John Tully": ["Q57115306", "Q6261390"], "Brendan Boyle": ["Q18684945", "Q4960876"], "Winston Peters": ["Q1396178", "Q5625319"]}, "date": "2014-09-01", "url": "http://abcnews.go.com/International/wireStory/zealand-gunman-kills-suspect-faces-charges-25208215", "content": "New Zealand Gunman Kills 2; Suspect Faces Charges A man suspected of killing two unemployment-office workers and seriously wounding a third in a South Island town was charged Tuesday with murder. <mark>John Tully</mark> was arrested Monday evening following a seven-hour manhunt that kept a town on edge. <mark>Tully</mark> made his first court appearance Tuesday on two charges of murder and one of attempted murder. He did not enter a plea and remained in custody. Police spokeswoman Lisa-Marie Brooks said a police dog unit apprehended <mark>Tully</mark>, 48, near a lake shortly after 5 p.m. following an extensive manhunt in the South Island town of Ashburton. She said <mark>Tully</mark> was being treated for minor dog-bite injuries and police were still searching for the weapon used in the shootings. Earlier, police had urged residents to remain inside their homes as they searched an area near the town's river and stormed a house that turned out to be empty. <mark>Tully</mark> had been interviewed in recent weeks by the local newspaper about his struggles finding somewhere to live and had also written to lawmakers. The incident began about 10 a.m. when police said a man entered a Work and Income New Zealand office and started shooting. A witness said the man was wearing a black balaclava and shot at two women, according to the Ashburton Guardian newspaper. Other witnesses told the paper the man was carrying a shotgun that may have been sawed down and fled on a bicycle. Ministry of Social Development Chief Executive <mark>Brendan Boyle</mark> said all three victims worked for the agency. \"We are all devastated by the deaths of two of our colleagues in the shocking attack,\" <mark>Boyle</mark> said in a statement, adding \"our thoughts and prayers\" are also with the third victim who was being treated at an area hospital. Lawmaker <mark>Winston Peters</mark> said in a statement that <mark>Tully</mark> had emailed his political party on Aug. 14 about the difficulty of finding a house to live in. \"We replied immediately and also followed up,\" <mark>Peters</mark> said. \"However, the emails kept bouncing back.\" <mark>Tully</mark> last month told the Ashburton Guardian that he had previously worked in Australian mines, had returned to his hometown and had ended up living in a tent after being unable to secure government-assisted accommodation. Ashburton Mayor Angus McKay said the town was very community-minded and the tragedy would affect many lives: \"It just hits home real hard,\" he said, according to The New Zealand Herald newspaper. click here to upgrade your browser in order to comment."}, {"articleID": "2020011711_00128902_W", "names": {"Andy Murray": ["Q10125", "Q526811"]}, "date": "2020-01-17", "url": "http://www.asianimage.co.uk/sport/national/18168239.andy-murray-comeback-claims-leading-hip-specialist/", "content": "Sport National Sport <mark>Andy Murray</mark> comeback could be over, claims leading hip specialist By Press Association 2019 <mark>Andy Murray</mark> has been told his comeback could be over if he fails to recover from his latest injury 0 comment <mark>Andy Murray</mark>'s comeback will effectively be over if he fails to recover from his latest injury setback, a leading hip specialist has warned. <mark>Murray</mark>, 32, who has not played since November, announced on Thursday that he is withdrawing from two events next month with the pelvic problem which forced him out of the Australian Open. Giles Stafford, a consultant orthopaedic surgeon who has closely monitored <mark>Murray</mark>'s return, told the PA news agency: \"If it doesn't get better then it might be the end of what <mark>Andy</mark> is hoping to achieve. Grinding .???? #Work #Training #AMC pic.twitter.com/mn2ymLTaxw--<mark>Andy Murray</mark> (@ andy_murray) January 16, 2020\" It will limit his comeback. He might be able to play doubles but singles could be too much for him. So it is obviously a concern going forward. \"With regards as to how things develop, if the injury doesn't improve, or when he returns to playing and the problem comes back, then obviously he has to think about where he goes from there.\" It was first felt that <mark>Murray</mark>'s injury, which surfaced at November's Davis Cup finals, was only minor. But the three-time major winner sparked concern when he withdrew from the opening grand slam of the year before then revealing he would play no part in next month's tournaments in Montpellier and Rotterdam. <mark>Andy Murray</mark> has won three grand slams but his comeback is in doubt (Mike Egerton/PA) And Stafford believes the bone bruising is linked to <mark>Murray</mark>'s hip resurfacing surgery at the start of 2019. \"It is claimed that <mark>Andy</mark>'s hip implant has a better range of motion than a standard conventional replacement and it actually doesn't,\" said Stafford. \"One of the problems with it is that it has a reduced range of motion because you save the native neck of the femur just under the ball. That can dig into the prosthetic metal cup earlier than a normal hip replacement would.\" I am guessing the issue with <mark>Andy</mark> is that he is pushing a lot of force through the hip, and I imagine what is happening is that his native femoral neck is hitting up against the metal cup and causing a lot of bruising on the thigh bone. Sliding into the weekend like...⛸ #AMC pic.twitter.com/cOyC70POHd--<mark>Andy Murray</mark> (@ andy_murray) December 20, 2019 \"The problem is that over time the metal cup can carve a notch in the bone just under the ball, and if that carries on it can predispose the bone to breaking.\" If that is the case, he will have to change certain aspects of the way he moves, and getting down to the ball and things like that could become an issue. They are just waiting for the bruising to improve but that could take months. \"Speaking on Thursday, <mark>Murray</mark>, who won his first ATP title following hip surgery in Antwerp in October, said:\" The bone bruising is taking longer to heal than first thought, so I won't be playing in Montpellier or Rotterdam in February. \"I don't want to rush anything or put a timeline on my recovery. I'm going to listen to my body and step back on the court to compete when the time is right.\" 0 comment"}]