[{"date": "2014-07-05", "url": "http://bleacherreport.com/articles/2119868-nhl-rumors-latest-buzz-for-leagues-best-remaining-free-agents", "content": "NHL's top free agents have been signed, rumors continue to surround the select few who remain. Entering the fifth day of the league's free agency, here are the latest rumblings for the best unsigned talent on the open market. USA TODAY Sports G Martin Brodeur, New Jersey Devils The 42-year-old Brodeur has spent his entire NHL career, which began in 1991, with the Devils. But after leading them to three Stanley Cup Championships, their working relationship seems to be officially over. Brodeur had backed up Cory Schneider this past season, but instead of re-signing Brodeur this summer, New Jersey opted to sign Scott Clemmensen to fill the reserve role. The Devils aren't the only team to pass on the future Hall of Famer. Pierre LeBrun of ESPN reported that his representatives talked to the Tampa Bay Lightning and Pittsburgh Penguins. However, Pittsburgh decided to sign Thomas Greiss and Tampa Bay went for Evgeni Nabokov instead: Brodeur camp did talk to likes of TB and Pitt but obviously no deals there...Will be very patient...even if it takes all summer...July 2, 2014 Brodeur has struggled to find a home this offseason. But despite his age, he still has the ability to be a valuable contributor - and not just in the locker room. His 19 wins this season were 26th-best in the NHL, and his 2.51 goals against average and .901 save percentage are without a doubt still second-string worthy. Dan Rosen of NHL.com, the Boston Bruins and Toronto Maple Leafs are the most likely landing spots for Brodeur. Of course, Joe McDonald of ESPN reported otherwise on the Boston front. Bruins have no interest in Marty Brodeur, according to a league source. July 2, 2014 That leaves Toronto as Brodeur's top option right now. Tom Gulitti of The Record reported that the Maple Leafs' president of hockey operations, <mark>Brendan Shanahan</mark>, said, \"Why wouldn't there be interest in him?\" this summer. USA TODAY Sports C/LW Steve Ott, St. Louis Blues The Minnesota Wild already made a major splash this offseason by signing one of the top free agents, Thomas Vanek, and they may not be finished recruiting. LeBrun reported that the Wild are interested in Ott (h/t Star Tribune), who scored 23 points last season playing for the Blues and Buffalo Sabres. <mark>Michael Russo</mark> of the Star Tribune believes Ott would fill a hole in Minnesota that doesn't show up on the stat sheet, though. The Wild does lack toughness in my opinion (especially defensively), and when I say toughness, I'm not necessarily talking fighting. I just mean physicality, clearing bodies from the net...and some scare factor. There are times <mark>Mikael Granlund</mark> and Jared Spurgeon have been targeted. Heck, Nik Backstrom's health really began to derail last season after Nazem Kadri ran him AFTER running <mark>Granlund</mark> in the same game. <mark>Russo</mark> reported that the Maple Leafs are interested in Ott as well. Bill Hoppe of the Times Herald also reported that - despite signing Brian Gionta, Cody McCormick, Andrej Meszaros and Matt Moulson on the first day of free agency - Buffalo general manager <mark>Tim Murray</mark> \"wouldn't rule out\" an Ott return. <mark>Tim Murray</mark> wouldn't rule out signing Steve Ott, talked to his agent last night. Yesterday's moves could make it less likely. USA TODAY Sports C Derek Roy, St. Louis Blues <mark>Josh</mark> Rimer of Sportsnet reported Roy is close to signing a new contract. UFA Derek Roy is close to signing. It's down to two teams. One in the east and one in west. July 4, 2014 Roy finished with 37 points last season, 28 of which were assists. The Nashville Predators are one of the main teams he's linked to. And <mark>Josh Cooper</mark> of The Tennessean is a fan for a variety of reasons, one of which is because he'd help the recently acquired <mark>James Neal</mark> - who the Penguins traded to Nashville. New acquisition <mark>James Neal</mark> needs someone who can simply feed him the puck. Roy is an excellent distributor. He has had over 40 assists four times in his career. All he'll have to do is feed <mark>Neal</mark> the puck--something he did playing with sniping winger Thomas Vanek in Buffalo. If Rimer's report holds true, <mark>Neal</mark> will find out if Roy will be playing alongside him soon. How to Recover from a Devastating Sports Loss We'd like to send you the most entertaining", "articleID": "2014070521_00061504_W", "names": {"Brendan Shanahan": ["Q4961093", "Q739144"], "James Neal": ["Q24557998", "Q539743"], "Josh Cooper": ["Q6288775", "Q6288777"], "Michael Russo": ["Q6834031", "Q6834032"], "Mikael Granlund": ["Q16298348", "Q520141"], "Tim Murray": ["Q16215018", "Q3012564", "Q59194608", "Q7804026", "Q7804027", "Q7804029"]}}, {"date": "2014-07-07", "url": "http://www.prnewswire.com/news-releases/wanted-launches-canadian-talent-analytics-expanding-its-global-footprint-of-big-data-for-hr-266047171.html", "content": "Canada, extending the Company's coverage of the global talent marketplace WANTED Technologies (TSX-V: WAN), the leading supplier of \"big data\" analytics for the human capital marketplace, announced the launch of its talent supply and demand products for Canada. WANTED provides insight into supply and demand for talent using a data warehouse of more than one billion records describing continuous hiring activity since 2005. The Company's clients, which include corporate HR departments, staffing agencies, and government analysts, use these insights to make more intelligent decisions in areas such as recruiting, workforce planning, economic development, and educational policy. \"We currently are collecting and storing data on hiring activity in more than 150 countries,\" said <mark>Bruce Murray</mark>, President and CEO of WANTED Technologies. \"The launch of our talent analytics product for Canada is the beginning of a series of releases covering key talent marketplaces around the world .\" WANTED's products include both real-time measurements of hiring activity, as well as historical trends for more than 11,000 individual occupational categories. The real-time hiring activity will provide Canadian corporate HR departments and staffing firms with detailed competitive intelligence on hiring and how to overcome recruiting challenges. \"It allows them to make decisions on how to better manage human capital, quickly and easily with real, proven data,\" commented <mark>Murray</mark>. The historical trend data illustrates hiring behavior before, during, and after the recession of 2009, providing financial, economic, and policy analysts a complete measurement of the labor market through the most recent economic cycle. WANTED's cloud-based, global data warehouse is made up of more than one billion records, each containing 100 individual data elements, including the date of a job opening, the occupation, the employer, the location, and the industry of the hiring company. The complete job description with skills, certifications and other requirements for the position is also stored in the WANTED database. In total, the number of data elements in WANTED's database exceeds 100 billion. \"We aggregate hiring demand and talent supply, then make the results available to our clients through our online dashboard, WANTED Analytics ™,\" said <mark>Murray</mark>. \"Clients have access to the data to conduct their own analysis .\" WANTED captures information from online job sites and corporate career sites. In addition to providing its own analytic products, the Company partners with other organizations who access WANTED's data and analytics on an automated basis through Application Programming Interfaces, or APIs. For more information about WANTED ™ helps recruiting organizations make better decisions faster with real-time business intelligence on jobs, employers, and talent. Analytics brings together, for the first time, years of hiring demand and talent supply data to create a true talent intelligence platform for hard-to-fill positions. Clients in the staffing, HR, RPO, media, and government sectors use WANTED Analytics ™ to find sales leads, analyze employment trends, gather competitive intelligence, forecast economic conditions, and source hard-to-fill positions. About WANTED Technologies Corporation WANTED Technologies (TSX-V: WAN) provides real-time business intelligence for the talent marketplace. Founded in 1999, the company's headquarters are in, and it maintains a US-based subsidiary with primary offices in. WANTED began collecting detailed Hiring Demand data in June 2005, and currently maintains a database of more than one billion unique job listings. For more information or to sample WANTED's services, visit www.wantedanalytics.com. WANTED is also the exclusive data provider for The Conference Board Help Wanted OnLine Data Series ®, the monthly economic indicator of Hiring Demand in View fullscreen. More by this Source", "articleID": "2014070722_00024651_W", "names": {"Bruce Murray": ["Q4978050", "Q4978052", "Q4978054", "Q961130"]}}, {"date": "2014-07-07", "url": "http://www.baltimoresun.com/news/nation-world/sns-rt-us-britain-abuse-inquiry-20140707,0,3267653.story?track=rss", "content": "LONDON (Reuters) - The British government has ordered a wide-ranging inquiry into historical child sex allegations stretching over several decades, Home Secretary <mark>Theresa May</mark> said on Monday. A separate review will also be held into the handling of allegations of child abuse by politicians. \"In recent years we have seen appalling cases of organized and persistent child sex abuse,\" <mark>May</mark> told parliament. \"The government will establish an independent inquiry panel of experts in the law and child protection to consider whether public bodies and other non-state institutions have taken seriously their duty of care to protect children from sexual abuse .\" The broad inquiry, the chair of which is still to be appointed, will look into allegations of child abuse across organizations including the health service, political parties, the Church and the BBC. <mark>May</mark> said that given the scope of the inquiry it was unlikely to report back before a national election in <mark>May</mark> next year but would update parliament on its progress before the vote. Peter Wanless, the Chief Executive of anti child cruelty charity the NSPCC, has been appointed to hold a review of a 2013 investigation carried out by the interior ministry into the handling of allegations of abuse by politicians. Wanless will also look at how police and prosecutors handled information handed to them at the time, <mark>May</mark> said. The Baltimore Sun encourages civil dialogue related to our stories; you must register and log-in to our site in order to participate. We reserve the right to remove any user and to delete comments that violate our Buck Showalter responds Sunday to John Lackey's comments about <mark>Nelson Cruz</mark> Looking at the Orioles' next move with right-hander Kevin Gausman Randallstown woman killed by drunken driver in College Park, police say", "articleID": "2014070722_00091372_W", "names": {"Nelson Cruz": ["Q1133784", "Q11957344", "Q6990454"], "Theresa May": ["Q264766", "Q30161835"]}}, {"date": "2014-07-08", "url": "http://www.kezi.com/drive-less-save-more-in-corvallis/", "content": "CORVALLIS, Ore. - A new program in South Corvallis is encouraging residents to use alternative modes of transportation. The program is called Drive Less; Save More, and it promotes drivers to bike, walk, carpool, or take the bus. The Oregon Department of Transportation is piloting the program with help from the City of Corvallis and Cascades West Rideshare. The city is hosting several free events throughout the month in both English and Spanish. \"We're trying to encourage people to not drive alone,\" said <mark>Greg Wilson</mark>, Transportation Program Specialist with the City of Corvallis. \"To save energy, and to not pollute the environment by using a different transportation option. It's in everyone's best interest to save energy .\" The program is targeting South Corvallis because the Willamette River geographically isolates it from the rest of the city. <mark>Wilson</mark> says the program is informing residents about walking and biking paths in the area, as well as transit and ride share opportunities. On Tuesday from 7:30 - 8:00 p.m., the program is hosting a free bike repair class in English and Spanish at the Tunison Community Center. Child care and snacks will be provided. Residents can also get free bags with gear for biking and walking, including maps, water bottles, umbrellas, and bike lights. The city will also host a free ice cream walk later this month. For more information, click here. RELATED ARTICLES Corvallis Celebrates Independence Day (0) Concerns About Bailey Branch Corridor (1) Corvallis Police Hire More Officers (0) Benton County Jail Tours Start Saturday (0) \"Bee-Friendly\" Plants May Harm Bees (0) Groundbreaking For New Cancer Center (0)", "articleID": "2014070905_00043802_W", "names": {"Greg Wilson": ["Q18159211", "Q19880107", "Q27924954", "Q42363410", "Q51936191", "Q5606441", "Q5607217"]}}]