[{"articleID": "2015111200_00059302_W", "names": {"Steve Wilson": ["Q2347401", "Q26956113", "Q28543117", "Q7614324", "Q7614325", "Q7614326", "Q7614327", "Q7614329", "Q7614330", "Q7614332", "Q7614333"], "Dan Turner": ["Q18588465", "Q24006287", "Q24703003", "Q29001227", "Q5214516"], "Jack Nicholson": ["Q39792", "Q58917121"]}, "date": "2015-11-11", "url": "http://www.thestar.com/news/gta/2015/11/11/toronto-artists-creativity-flows-through-werkadaynov15.html", "content": "News / GTA Toronto artist's creativity flows through #werkadaynov 15 A group of Toronto artists are \"getting their creative juices going on a daily basis\" with the help of a hashtag, #werkadaynov 15. Share on Facebook With the added freedom of producing for herself, Janice Kun is experimenting with watercolours. By: Verity Stevenson Staff Reporter, Published on Wed Nov 11 2015 Photos View photos zoom When your hobby is your work, it can be tough to distinguish between the two. Some Toronto artists are \"getting their creative juices going on a daily basis\" with the help of a hashtag: #werkadaynov 15. The challenge is to submit a piece of \"werk\" a day on Instagram, for the illustrators to satisfy their own creativity aside from their commercial and editorial commissions. Clayton Hanmer--Fuzzy Rider @ claytonhanmer The Toronto illustrator says the inspiration for \"Fuzzy Rider' came to him on a visit to the petting zoo. Clayton Hanmer, a Toronto illustrator, says the inspiration for\" Fuzzy Rider \"came to him on a visit to the petting zoo at the annual Royal Winter Fair with his 8-month-old daughter. Janice Kun Janice Kun was at an art and tech conference when she attended a speech by a motion graphics designer who had been producing an illustration a day for the past 3,000 days.\" I figured if this guy can do 3,000, I can do a month, \"she said. With the added freedom of producing for herself, she's experimenting with watercolours. Her Nov. 7 #werkaday is loosely based on a photo from a past Halloween party. <mark>Steve Wilson</mark> @ 5_star_rating For #werkaday, Steven Wilson has been experimenting with watercolours. Like many illustrators, <mark>Steve Wilson</mark> devotes much of his time to making work for others. For #werkaday, he's been experimenting with watercolours, which he says are more\" instantaneous, \"which lends itself well to the equally instantaneous Instagram. <mark>Dan Turner</mark> - emojis @ 10th_degree_dan This is <mark>Dan Turner</mark>'s version of emoji: hand-drawn as opposed to digitally-rendered. Toronto illustrator <mark>Dan Turner</mark> is\" fascinated with our analogue lives before the digital revolution. \"This is his version of emoji: hand-drawn as opposed to digitally rendered, and objects or people that evoke what a thumbs-up could not. <mark>Dan Turner</mark>--<mark>Jack Nicholson</mark> @ 10th_degree_dan Illustrator <mark>Dan Turner</mark> said the 1974\" masterpiece of auteur cinema \"Chinatown with <mark>Jack Nicholson</mark> is one of his favourites.\" Forget it, Jake; it's Chinatown. \"Illustrator <mark>Dan Turner</mark> said the 1974\" masterpiece of auteur cinema, \"Chinatown with <mark>Jack Nicholson</mark>, is one of his favourites.\" In this case, his psychological wounds are manifested on the outside, \"he says of his Nov. 8 submission. Arv Slabosevicius--@ actionarv @ actionarv Arv Slabosevicius uses 3D software to model and render the illustrations, which take about six hours to make. Arv Slabosevicius creates animations and illustrations. He used 3D software to model and render the illustrations, for which he says he draws inspiration from Lithuanian art and Toronto. They take him about six hours to make. Hyein Lee - Wendigo @ hyeinpain Hyein Lee said her submissions have taken between three and eight hours to make, so she's tried to streamline them. Before coming to Canada from Korea 20 years ago, Hyein Lee explained, a tale in a book of horror stories stuck with her: the Algonquin legend of the Wendigo, which she later realized was born in Canada.\" I thought it was really scary, so I tried to imagine the Wendigo, \"Lee said of her Nov. 7 submission. She said the pieces take her between three and eight hours to make, so she's tried to streamline them by making a simpler one and working on a bigger one at the same time. Aaron Leighton--Nietzsche with Googly Eyes @ aal8n Aaron Leighton says he's a fan of philosophy and\" combining things that are ridiculous and sublime. \"Aaron Leighton says he's a fan of philosophy and\" combining things that are ridiculous and sublime. \"The natural result of those two affinities:\" Nietzsche with Googly Eyes, \"created with a marker and acryl gouache.\" Is nothing sacred? \"<mark>Steve Wilson</mark> (@ 5_star_rating) commented. Drew Shannon @ bonyfingers Drew Shannon is using the same three colours and follow supernatural and\" old fairytale \"themes. Though the project offered illustrators more creative freedom than they may be used to--save the time constraints--Drew Shannon gave himself parameters: He is to use the same three colours and follow supernatural and\" old fairytale \"themes, which match those of a book he is working on."}, {"articleID": "2017083113_00379284_W", "names": {"Scott Macleod": ["Q3476261", "Q7436750"], "Christopher Anderson": ["Q24042099", "Q5111850", "Q5111851"], "Brian Williams": ["Q10498110", "Q11688807", "Q16106138", "Q20273975", "Q22636441", "Q28777337", "Q39185757", "Q43162643", "Q459695", "Q4965638", "Q4965639", "Q4965640", "Q4965642", "Q4965643", "Q4965645"]}, "date": "2017-08-31", "url": "http://www.edmontonsun.com/2017/08/31/princess-dianas-final-hours-dodis-yacht-a-ritz-suite-a-diamond-ring-and-relentless-photographers", "content": "Princess Diana death photo to be shown at Cannes The last day of Princess Diana's life began on the top deck of her lover's yacht, with croissants and fresh jams. Diana and her beau, Dodi Al Fayed, sipped their coffee marveling at the breathtaking Emerald Coast in Sardinia. Diana took hers with milk. Fayed took his black. There were kiwis, too. \"They were in a good mood,\" his butler remembered later. \"They were always laughing, holding hands.\" Their romance was a whirlwind - passionate, thrilling, scandalous. Fayed, the son of Harrod's department store owner Mohamed Al-Fayed, was a rich playboy. Diana, divorced from Prince Charles after he cheated on her, was the mother of the future king of England and the most photographed woman in the world. That Saturday - Aug. 30, 1997 - promised to be a moment of change. The princess knew it. She snuck a call to Richard Kay, a friend who covered the Royals for the Daily Mail, and told him, as he later wrote, \"she had decided to radically change her life.\" \"She was going to complete her obligations to her charities,\" Kay continued, \"and then, around November, would completely withdraw from her formal public life.\" Diana had not told Kay why, but he had a hunch: \"They were, to use an old but priceless cliche, blissfully happy. I cannot say for certain that they would have married, but in my view it was likely.\" In the 20 years since she's been gone, there have been countless revisions to this love story. Her friends and relatives: They weren't in love! His friends and relatives: They were in love! Last week, in the Daily Mail, Kay published an article with this headline: \"Was Diana about to dump Dodi?\" In it, he quoted Diana's private secretary saying she'd planned to return home after becoming bored with Fayed. \"It's very much a personal view,\" the secretary said, \"but I don't think she would have seen Dodi again once she got back.\" Whatever the case, Fayed wanted to propose that fateful night. It was summer. As they were on holiday, Britain announced plans to invite the Irish Republican Army for peace talks. Conspiracies theories about the suicide of Vincent Foster, President Bill Clinton's lawyer, were spreading. Israel and Lebanon were sparring with one another. Fayed's primary concern was the six-figure diamond ring waiting in Paris. People close to Fayed said the couple picked it out a week earlier even though they had been dating less than a month. The danger of their relationship wasn't its brevity. To royal watchers, to Buckingham Palace, and no doubt to the British tabloids whose photographers were hounding them, the threat was something the couple apparently had not yet considered, even as rumors swirled that Diana was already pregnant. \"For the mother of the future king of England to bear the child of a Muslim Arab, a child who would be the half sibling of the heir to the throne, would be embarrassing in the eyes of the royal family and the ruling Establishment,\" former Time magazine reporters Tom Sancton and <mark>Scott MacLeod</mark> wrote in their book, \"Death of a Princess.\" Fayed's calendar that day had just one entry - at 6:30 p.m., he was to pick up the ring at a store near his father's hotel in Paris, The Ritz. They left the boat for Fayed's plane around 11:30 a.m., taking along the butler and a masseuse for Fayed's painful back. As soon as they landed in Paris, Fayed saw the paparazzi out his window. \"Dodi did not want this special occasion ruined by a bunch of a shutter-happy cowboys trying to corral them on motorcycles and shoving lenses in their faces,\" the ex-Time reporters wrote. \"As soon as the door opened, cameras started clicking.\" The aggressiveness of the photographers - and their sheer numbers - would increase as the day progressed. Diana and Fayed arrived at The Ritz in the late afternoon. She went to the salon for a hair appointment. He went to the jeweler. The couple then rested in the hotel's Imperial Suite before going to Fayed's apartment to get dressed for dinner. She checked in with her children, who were in Scotland with Prince Charles and the queen. \"On that Saturday evening, Diana was as happy as I have ever known her,\" her friend Kay wrote in the Daily Mail. \"For the first time in years, all was well with her world.\" They left for Fayed's apartment around 7 p.m., trailed by photographers. More were waiting at the building's front door when they arrived. Fayed fumed. There was an ugly shoving match. Once inside, Fayed pulled his butler aside, telling him about his plan to propose that night. \"The ring was on the nightstand in his bedroom,\" author <mark>Christopher Anderson</mark> wrote in \"The Day Diana Died.\" \"Dodi had checked to make sure they had several bottles of Dom Pérignon on ice for the big moment.\" But dinner was a bust. The first restaurant they tried - Chez Benoit, a cozy, casual bistro not far from the city center - was quickly overrun by photographers. They split and headed for The Ritz, ducking into the dining room hoping to be left alone. The princess ordered vegetable tempura. Fayed ordered grilled turbot. \"No sooner had they ordered,\" the ex-Time reporters wrote, \"they began to feel the indiscreet stares of other diners.\" The couple left and had the food delivered to the Imperial Suite. Fayed's plan was in shambles. They had to get back to the apartment. But how? The hotel was swarming with photographers. Fayed devised a plan: The couple's driver and bodyguards would make a big show out front, appearing to get their caravan of Mercedes sedans ready to leave. Meanwhile, the Princess and Fayed would slip out the back door, in a borrowed car driven by a hotel security officer. What happened next was the subject of lengthy investigations and conspiracy theories that live on today. The couple did get away. But the driver, it turned out, was drunk. As the couple sped off, the photographers out front got tipped off about the escape, quickly catching up on their motorcycles. Their driver darted in and out of traffic, wrecking spectacularly inside the Pont de l'Alma tunnel near the Eiffel Tower. Fayed died instantly. Diana died at the hospital. Her death startled the world. An up-and-coming anchor named <mark>Brian Williams</mark> broke into regular coverage on MSNBC to announce the news to Americans in the early morning hours of Aug. 31. \"I've just been handed from the Reuters news service what has been marked\" bulletin,' \"<mark>Williams</mark> said, speaking slowly.\" It says, \"Princess Diana has died .'\" She was 36."}, {"articleID": "2015080415_00075038_W", "names": {"Israel Hernandez": ["Q5802760", "Q6086976"]}, "date": "2015-08-04", "url": "http://juneauempire.com/sports/2015-08-04/weldon-wins-judo-medals", "content": "Weldon wins judo medals Photos COURTESY PHOTO Juneau-Douglas High School junior Cody Weldon is shown with his Silver and Bronze medals won during the Summer Nationals in Indianapolis, Indiana, and the Junior Nationals in Fort Lauderdale, Florida. By Klas Stolpe JUNEAU EMPIRE Incoming Juneau-Douglas High School student Cody Weldon has added another top sport to his wrestling, skiing and track resume. Weldon, 16, is a purple belt and has been a member of the Capital City Judo Club for seven years. \"I like judo because of the discipline,\" Weldon said. That discipline took Weldon through a medal-winning summer. He participated in the 2015 Summer Nationals in Indianapolis, Indiana, on July 11, winning a Silver medal in the tournament as a 90-kg Juvenile Division competitor. Weldon then went to a camp in Fort Lauderdale, Florida, from July 14-16, taught by Cuba Olympic Judo members <mark>Israel Hernandez</mark> and Amarilis Savon. After that camp, Weldon participated in the 2015 U.S. Junior Opens on July 18-19, also in Fort Lauderdale, taking a bronze medal in the 90 kg Juvenile Division. This was an international tournament in which 22 countries were represented. Weldon fought against judoka from Mexico, Puerto Rico and multiple judoka from the United States. \"It was a really good experience,\" Weldon said. \"It was interesting to see all the different styles from all the different areas that the judoka were from.\" Capital City Judo Club sensei Jay Watts appreciates Weldon's work ethic. \"Over the past two years, he has become a serious student in the sport of judo,\" Watts said. \"Not only does he practice 2-3 days per week but he does weight training, conditioning and wrestles with the JDHS team. Everyone at Capital City Judo is very proud of Cody for his recent accomplishments.\" "}, {"articleID": "2010011815_00035979_W", "names": {"Dixie Carter": ["Q240360", "Q378224"]}, "date": "2010-01-18", "url": "http://bleacherreport.com/articles/328145-bubba-the-love-sponge-crossed-the-line", "content": "2 articles written 1 comments written while tna were asking fans to join them in order to help donate cash to haiti following the devastating earthquake, bubba the love sponge, tna's newest announcer might have been publicly not in line with his employer. on his twitter page, bubba spoke of the crisis, saying: \"i say f--haiti [sic]. why do we have to take care of everybody our country is in shambles. bubba\" of course, this being the internet, the remark has quickly spread. a facebook page dedicated to bubba's firing has already been set up, and reports of tna fans tweeting tna chairman <mark>dixie carter</mark> about the remark have surfaced. further problems have ensued. online fans who tweeted <mark>dixie carter</mark> have claimed that members of bubba's audience, the \"bubba army\" have taken to harassing these fans. certain bubba fans have dismissed the claims, going on to insult those people. first off, i have never listened to bubba's show, nor do i plan to in the foreseeable future. as such, i will not purport to know the content and remarks that are regularly aired. also, many bubba fans and neutrals feel that reprimanding bubba for his remarks would be in direct contravention of the right to freedom of speech. let me say that they do have a valid point, however callous the remark in question may be. i do wish bubba and those who share his opinion would rethink their stance; usa received millions in aid from a plethora of countries during katrina, including kuwait, china, india, pakistan, and more. cuba and venezuela even offered aid. however, this is not the place for a political debate, so i will not engage in that. the question i ask of other wrestling fans is what do you think tna should do? we've heard claims that wwe have issued restrictions on the nature and timing of comments their stars can air through twitter. in tna itself, vince russo's facebook page has received perhaps too much attention from internet wrestling critics who are glad they can finally engaged in heated debates with. how does a wrestling company deal with this? this case makes for particular interest because while tna confirmed a fundraising campaign for those in haiti during this week's tna impact tapings in orlando, one of their own employees spoke out against helping haiti. so far, tna have remained mum on the issue. edits to bubba's wikipedia page claim he was suspended, but so far we have no proof of that statement. <mark>dixie carter</mark> has steadily increased her involvement of the promotion of tna wrestling on twitter over the past few months. she has been very receptive of fan feedback up to this point, now she might have to answer to those fans. continue reading the pro wrestling news & opinions channel rumor has it: <mark>dixie</mark> and hulk have \"exciting talks\" with spike tv check out another pro wrestling channel: the 10 greatest wrestlemania undercard matches of all-time wrestling's biggest \"wtf?!\" moments of the decade check out shaq's super hot swedish mistress, dominica wrestling! 68 pictures of hot chicks in football jerseys and very little else - any questions? copyright © 2009 bleacher report, inc. all rights reserved. certain photos copyright © 2009 by getty images. are you interested in covering your favorite teams and sports? as a member you can get the latest on your favorite teams, post comments, write your own articles, and much more. are you interested in covering your favorite teams and sports? follow your facebook friends on bleacher report i.e. san francisco giants, sec football, nfl, golf"}, {"articleID": "2010110523_00085482_W", "names": {"Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Lisa Miller": ["Q4293505", "Q55088547", "Q6558271", "Q6558273"]}, "date": "2010-11-05", "url": "http://lifesitenews.com/ldn/2010/nov/10110507.html", "content": "lifesitenews.com) - as the dust settles on the 2010 midterm elections, those pro-life lobby groups that helped win significant pro-life gains in congress are already gearing up to ensure that the fresh victories are converted into action on behalf of unborn americans. one of those groups, the susan b. anthony (sba) list, on thursday announced the launch of its \"stop abortion funding\" campaign, aimed at ending all federal funding of abortion in the upcoming 112th congress. the campaign includes a website designed to help pro-life activists lobby congress to defend the defenseless by defunding abortion. \"now is the time to translate tuesday's pro-life electoral gains into pro-life legislative victories,\" said sba list president marjorie dannenfelser. dannenfelser said that on tuesday a large number of those who voted for the abortion-funding health care law \"learned the consequences of their vote,\" and have been replaced \"by authentic pro-life voices supported by a strongly pro-life gop leadership.\" \"the gop leadership understands the urgency of addressing the tragedy of nearly 4,000 abortions a day and has pledged to defund abortion in its\" pledge to america,' \"said dannenfelser.\" now is the time to make good on that pledge to restore moral and fiscal responsibility in washington. congress must start by ending federal funding of abortion both here and abroad. \"dannenfelser said that sba list's petition and outreach efforts will include mobilization of its 280,000-member-strong grassroots network to encourage members to pass pro-life legislation and stop pro-abortion legislation in the 112th congress. to accomplish this, the sba list will urge members of congress to pass two priority pieces of pro-life legislation. the first bill is the no taxpayer funding for abortion act, sponsored by reps. <mark>chris smith</mark> (r-nj) and dan lipinski (d-il), which will create a government-wide statutory prohibition on taxpayer funding of abortion, which would repeal abortion funding in obamacare. the second bill is the title x abortion provider prohibition act, sponsored by rep. mike pence (r-in), which would ensure that tax dollars are not sent to abortion providers like planned parenthood under title x family planning funds. sba list challenges new u.s. pro-life lawmakers with\" stop abortion funding' campaign pro-life hero mike pence steps down from house republican conference ottawa-carleton school board to ask students their sexual orientation canadians worry about vulnerable people if euthanasia is legalized: poll panic: abortion is in \"extreme danger' says planned parenthood as election looms christine o'donnell sex slander hit piece erupts days before election 14-year-old lia mills at pro-life conference:\" i have learned to embrace conflict \"ex-lesbian <mark>lisa miller</mark> loses appeal to prevent transfer of daughter to former lesbian partner creative commons attribution-no derivatives license. you may republish this article or portions of it without request provided the content is not altered and it is clearly attributed to\" lifesitenews.com \". any website publishing of complete or large portions of original lifesitenews articles"}, {"articleID": "2020033000_00033385_W", "names": {"Han Guan": ["Q45384234", "Q45522833", "Q45642591"], "Jose Sanchez": ["Q25860481", "Q3186563", "Q3810586", "Q5548031"], "Pedro Sanchez": ["Q6070218", "Q742858"], "Brian Lee": ["Q16145430", "Q17661135", "Q2924919", "Q2924941", "Q4964464", "Q4964465", "Q4964466", "Q4964469", "Q515227", "Q56367581"], "Craig Smith": ["Q1138675", "Q16197253", "Q21285570", "Q22096890", "Q2565774", "Q3002061", "Q40198915", "Q5181461", "Q5181462"]}, "date": "2020-03-30", "url": "https://www.nevadaappeal.com/news/government/president-extends-social-distancing-guidelines-through-april/", "content": "President extends social distancing guidelines through April Government | March 29, 2020 0 MATT SEDENSKY and MICHAEL R. SISAK Associated Press 0 Travelers wearing face masks to help curb the spread of the coronavirus line up for their train at the station in Beijing on Sunday, March 29, 2020. As the coronavirus epicenter has shifted westward, the situation has calmed in China, with falling death rates and most new cases coming from abroad, restrictions on travel have been slowly lifted. (AP Photo/Ng <mark>Han Guan</mark>) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP People sit on benches at Primrose Hill, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A man walk alone on the promenade under the FDR drive in Lower Manhattan, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP People applaud from their houses in support of the medical staff that are working on the COVID-19 virus outbreak in Barcelona, Spain, Sunday, March 29, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A couple hugs as they walk down a boardwalk on a mostly deserted Santa Monica beach Sunday, March 29, 2020, in Los Angeles. With cases of coronavirus surging and the death toll increasing, lawmakers are pleading with cooped-up Californians to spend a second weekend at home to slow the spread of the infections. (AP Photo/Marcio <mark>Jose Sanchez</mark>) AP | AP A couple hugs as they walk down a boardwalk on a mostly deserted Santa Monica beach Sunday, March 29, 2020, in Los Angeles. With cases of coronavirus surging and the death toll increasing, lawmakers are pleading with cooped-up Californians to spend a second weekend at home to slow the spread of the infections. (AP Photo/Marcio <mark>Jose Sanchez</mark>) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A woman stands leaning against the window during a nationwide confinement to counter the new coronavirus in Barcelona, Spain, Sunday, March 29, 2020. Spanish Prime Minister <mark>Pedro Sanchez</mark> has announced that his government will order a two-week ban on commuting to all non-essential businesses starting on Monday. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Emilio Morenatti) AP | AP A paramedic transports a patient into the Trauma Center at the Elmhurst Hospital Center, Sunday, March 29, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A paramedic transports a patient into the Trauma Center at the Elmhurst Hospital Center, Sunday, March 29, 2020, in the Queens borough of New York. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Mary Altaffer) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP A red phone box stands in an empty street in Westminster, in London, Sunday, March 29, 2020. The public have been asked to self isolate, keeping distant from others to limit the spread of the contagious COVID-19 coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Alberto Pezzali) AP | AP Signs of support are shown on a window in Montreal, Sunday, March 29, 2020, as Coronavirus COVID-19 cases rise in Canada and around the world. (Graham Hughes/The Canadian Press via AP) AP | The Canadian Press Signs of support are shown on a window in Montreal, Sunday, March 29, 2020, as Coronavirus COVID-19 cases rise in Canada and around the world. (Graham Hughes/The Canadian Press via AP) AP | The Canadian Press Volunteers in a protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP Volunteers in protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP Volunteers in protective suits spray disinfectant on passing vehicles helping curb the spread of the coronavirus in Kabul, Afghanistan, Sunday, March 29, 2020. The government Friday ordered a three-week lock-down for Kabul to stem the spread of the new coronavirus. (AP Photo/Rahmat Gul) AP | AP A coronavirus patient from Metz in France is transported from a military helicopter for treatment at the University Hospital in Essen, Germany, in bad weather Sunday March 29, 2020. Two COVID-19 coronavirus victims are to be treated in Germany. The COVID-19 coronavirus causes less serious symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause severe illness and even death. (Marcel Kusch/dpa via AP) AP | dpa A coronavirus patient from Metz in France is transported from a military helicopter for treatment at the University Hospital in Essen, Germany, in bad weather Sunday March 29, 2020. Two COVID-19 coronavirus victims are to be treated in Germany. The COVID-19 coronavirus causes less serious symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause severe illness and even death. (Marcel Kusch/dpa via AP) AP | dpa An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP An Indian girl stands amid smoke as municipal workers fumigate an area spray disinfectants as a precautionary measure against COVID-19 in Ahmedabad, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Ajit Solanki) AP | AP Italian police cars patrol the area outside an empty St. Peter's Square with the Basilica in the background during Pope Francis' angelus prayer from his studio overlooking an empty square due to restrictions to contain the Covid-19 virus, at the Vatican, Sunday, March 29, 2020. Pope Francis is backing the U.N. chief's call for a cease-fire in all conflicts raging across the globe to help slow the spread of the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Andrew Medichini) AP | AP Italian police cars patrol the area outside an empty St. Peter's Square with the Basilica in the background during Pope Francis' angelus prayer from his studio overlooking an empty square due to restrictions to contain the Covid-19 virus, at the Vatican, Sunday, March 29, 2020. Pope Francis is backing the U.N. chief's call for a cease-fire in all conflicts raging across the globe to help slow the spread of the coronavirus. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Andrew Medichini) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP People wearing masks stand in a queue to receive food being distributed during lockdown in Mumbai, India, Sunday, March 29, 2020. Indian Prime Minister Narendra Modi apologized to the public on Sunday for imposing a three-week national lockdown, calling it harsh but \"needed to win\" the battle against the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Rafiq Maqbool) AP | AP Only occasionally do cars drive over the city's largest traffic junction, the Riebeckplatz in Halle, Germany, March 29, 2020. There are exit restrictions throughout Germany due to the coronavirus. (Jan Woitas/dpa via AP) AP | DPA Only occasionally do cars drive over the city's largest traffic junction, the Riebeckplatz in Halle, Germany, March 29, 2020. There are exit restrictions throughout Germany due to the coronavirus. (Jan Woitas/dpa via AP) AP | DPA Travelers wearing face masks to help curb the spread of the coronavirus line up for their train at the station in Beijing on Sunday, March 29, 2020. As the coronavirus epicenter has shifted westward, the situation has calmed in China, with falling death rates and most new cases coming from abroad, restrictions on travel have been slowly lifted. (AP Photo/Ng <mark>Han Guan</mark>) AP | AP Show Captions Hide Captions NEW YORK--The coronavirus outbreak could kill 100,000 to 200,000 Americans, the U.S. government's top infectious-disease expert warned on Sunday as smoldering hot spots in nursing homes and a growing list of stricken cities heightened the sense of dread across the country. Faced with that grim projection the possibility and that even more could die in the U.S. without measures to keep people away from each other, President Donald Trump extended federal guidelines recommending people stay home for another 30 days until the end of April to prevent spread of the virus. Trump's extension of the original 15-day guidelines was a stark reversal just days after he suggested restarting the economy in about two weeks and came after Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, made the dire prediction of fatalities, adding that millions in the U.S. could become infected. By evening, the U.S. had over 139,000 infections and 2,400 deaths, according to the running tally kept by Johns Hopkins University, though the true number of cases is thought to be considerably higher because of testing shortages and mild illnesses that have gone unreported. Worldwide, more than 710,000 infections were reported, and deaths topped 33,000, half of them in Italy and Spain, where hospitals are swamped and the health system is at the breaking point. New York state--where the death toll closed in on 1,000, up by more than 200 from the day before--remained the epicenter of the U.S. outbreak, with the vast majority of the deaths in New York City. But spikes in infections were recorded around the country, not only in metropolitan areas but in Midwestern towns and Rocky Mountain ski havens. \"This is not going to get better soon,\" New York Gov. Andrew Cuomo said. The virus is moving fast through nursing homes, assisted living facilities and other places that house elderly or otherwise vulnerable people, spreading \"like fire through dry grass,\" Cuomo said. New York City Mayor Bill De Blasio asked the federal government to deliver 400 more ventilators to city hospitals and warned that the city will run out of masks, gowns and other hospital supplies in a week if they don't get resupplies. Since the U.S. saw its first major outbreak of the coronavirus earlier this month--centered at a nursing home in Kirkland, Washington--a stream of facilities have battled infections among residents and staff. A week ago, the Centers for Disease Control and Prevention said 147 nursing homes in 27 states had patients with COVID-19. The problem has only worsened since. In Woodbridge, New Jersey, an entire nursing home relocated its residents after two dozen were confirmed infected and the rest were presumed to be. In Louisiana, at least 11 nursing homes, largely in the New Orleans area, have reported cases. In Mount Airy, Maryland, a death linked to the virus was recorded in a home where 66 people were confirmed infected. Residents' loved ones are being kept away to try to slow the spread of the virus. \"I have a feeling that I very likely may never see my mother again,\" said James Preller, whose 94-year-old mother, Ann Preller, is a resident at Peconic Landing, a retirement community near Greenport on New York's Long Island where seven have died in the past two weeks. <mark>Brian Lee</mark> of Families for Better Care, an advocacy group for those living in long-term care facilities, said in a nursing home, \"when we see an outbreak that's uncontrolled, it's practically a death sentence.\" But he also said the way residents are being walled off from the outside world is as much of a concern as the virus itself. In New York, the virus is overwhelming some of the city's poorest neighborhoods, with data showing high rates of infection in densely packed areas with big non-English-speaking populations. Dr. <mark>Craig Smith</mark>, who heads the surgery department at New York-Presbyterian/Columbia University Medical Center, said the hospital will probably be forced into \"apocalyptic scenarios\" in the coming weeks in which ventilators and intensive care unit beds will need to be rationed. \"Yesterday tried my soul,\" he wrote in an online posting. Worry for the poorest was being echoed around the world. In India, a lockdown covering the country's 1.3 billion people has put untold numbers out of work and left many families struggling to feed themselves. Tens of thousands in New Delhi were forced to flee their homes, with no way to pay the rent, journeying back to their native villages. Women in saris held babies on their hips. Others toted their belongings in bags normally used for cement. Prime Minister Narendra Modi apologized for the hardships that the lockdown brought but said, \"These tough measures were needed to win this battle.\" Though the U.S. leads the world in reported cases, five other countries have higher death tolls: Italy, Spain, China, Iran and France. Italy reported more than 750 new fatalities Sunday, bringing the country's total to nearly 10,800. But the number of new infections showed signs of easing, with officials expressing cautious optimism that the most severe shutdown in the industrialized West is showing results. Italy's civil protection agency said more than 5,200 new cases were recorded in the last 24 hours, the lowest number in four days, for a total of almost 98,000 infections. Spain moved to tighten its lockdown and ban all nonessential work as it hit another daily record of almost 840 dead. The country's overall official toll was more than 6,500. Spain's health emergencies chief, Fernando Simon, said the number of people in intensive care units keeps rising and hospitals are at their limits in several regions. \"That is why we have to strictly apply the control measures,\" he said. Egypt shut its beaches as cases in the Mideast surpassed 50,000. Police in the Philippines stepped up arrests of quarantine violators, and more tourists were evacuated from Mount Everest and the Indonesian island of Bali. Poland is considering delaying its May 10 presidential election. Russia ordered borders to close on Monday, Moscow all but confined its 12 million residents to their homes, and the head of the Russian Orthodox called on believers to stay away from churches and pray at home instead. A prominent French politician with the virus died, the country's first death of a senior official. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. But for others, especially older adults and people with existing health problems, the virus can cause more severe illness, including pneumonia, and lead to death. About 150,000 people have recovered, according to Johns Hopkins. Trump on Saturday backtracked on a proposal to quarantine New York and neighboring states amid criticism and questions about the legality of such a move. But the CDC issued a travel advisory urging all residents of New York City and others in New York state, New Jersey and Connecticut to avoid all nonessential travel for 14 days. Shocking as that is, it stopped short of the restrictions imposed in Europe or elsewhere. Parisians are fined if they try to leave the city, South Africans can't buy liquor, and Serbians are upset over a ban on walking their dogs. In Italy, burials are being held with only one family member. Some U.S. states began to try to limit exposure from visitors from harder-hit areas. Rhode Island National Guard troops went door to door in coastal communities to find New Yorkers. Florida is setting up checkpoints to screen visitors from Louisiana. Texas said it would require drivers from Louisiana to self-isolate for two weeks. Few areas of the country have escaped untouched: West Virginia reported the state's first death linked to the new coronavirus on Sunday, leaving Hawaii and Wyoming the only remaining states with no reported deaths linked to the outbreak. As others tightened controls, China continued to ease its restrictions, following the ruling Communist Party's declaration of victory over the coronavirus. Flights from Hubei province at the epicenter of the country's outbreak resumed Sunday. Government See more"}, {"articleID": "2016092823_00117905_W", "names": {"Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Gavin Miller": ["Q42849211", "Q5528223", "Q57980355"], "Gary Freeman": ["Q24809130", "Q3758488", "Q5525095", "Q5525096", "Q56274917"]}, "date": "2016-09-29", "url": "http://abc.net.au/news/2016-09-29/dally-m-winner-taumalolo-wants-to-be-a-rugby-league-great/7887060", "content": "Dally M winner Jason Taumalolo of the Cowboys wants to be a rugby league great Posted September 29, 2016 07:21:42 Map: Sydney 2000 The last time two players shared the Dally M stage in 2014, one left to pursue an American dream. But just days after reports of a similar interest in gridiron, as Jarryd Hayne did two years ago, newly-crowned Dally M medallist Jason Taumalolo has declared a desire to stay in the NRL and become one of the greats. Taumalolo and Melbourne star Cooper Cronk finished as joint winners of the most prestigious award in the game after a thrilling countdown at The Star on Wednesday night. Cronk became just the eighth player in the history of the medal to win the gong on multiple occasions, adding to his individual honour in 2013. Taumalolo became the first forward to claim the honour since <mark>Cameron Smith</mark> in 2006, and the first true forward since Cronulla's <mark>Gavin Miller</mark> took out back-to-back honours in 1989. 2016 Dally M Medal leaders Cooper Cronk (26) Sam Burgess (17) Matt Moylan (17) He is also the second Kiwi to win the prize after <mark>Gary Freeman</mark> in 1992 and comes just two weeks after winning the Players Champion award voted by opposition players. But it was the words he said after being bestowed the medal that would most send shivers down the spines of his rivals for the rest of the long summer. \"My plan is to retire playing rugby league and that hasn't changed over the last little while,\" he said. \"I want to be playing in the NRL for as long as I can and hopefully be recognised alongside (Cronk), (Johnathan Thurston) and (<mark>Cameron Smith</mark>) as one of the greats.\" Cronk, who will lead the Storm in Sunday's NRL decider against Cronulla, praised Taumalolo's efforts in becoming the first true forward to win the award in almost 30 years. \"To play the power game and the physicality that requires to do it for 26 weeks of the year is pretty impressive,\" he said. \"One, to be mentally strong. Two, physically. But you also need to be durable. He wouldn't have missed too many games this year. The way that he plays, that's pretty impressive.\" Johnathan Thurston gets a lot of raps at the Cowboys, and rightly so for what he does. But most of it is on the back of what Jason, (Matt) Scott and James Tamou do. \"Jason's been a wrecking ball all year and there's a reason why he's standing here as the best player in the game and that's because he deserves it.\" Cronk said the 2016 season had been the most enjoyable of his career. \"2013 was a good year in terms of my performance, but 2016 has been the most enjoyable year of my football career. There's no doubt about that,\" he said. \"There's a few contributing factors to that, but I've just really enjoyed both on and off the field and looking forward to what Sunday brings as well.\" "}, {"articleID": "2019092610_00149750_W", "names": {"Andres Ramos": ["Q58209591", "Q58830515"]}, "date": "2019-09-26", "url": "http://abs-cbnnews.com/spotlight/09/26/19/at-the-pma-a-thin-line-between-instilling-discipline-and-inflicting-abuse", "content": "Home> Spotlight At the PMA, a thin line between instilling discipline and inflicting abuse Christian V. Esguerra, ABS-CBN News Posted at Sep 26 2019 05:55 PM Share Save Facebook Twitter LinkedIn Retired AFP chief Dionisio Santiago recalls being hit by a senior cadet during his time at the PMA. \"Pagkatapos mo ng plebe years, parang superman ka,\" he says. Ramiltibayan, Wikimedia Commons MANILA--The death of a plebe allegedly tortured over a missing pair of boots has put a spotlight on the Philippines' top military school, where cadets tread a fine line between instilling discipline and committing outright physical abuse. Hazing and other forms of maltreatment are not tolerated by the Philippine Military Academy (PMA), its officials insisted, especially following the death of 20-year-old Darwin Dormitorio. But the practice takes place just the same involving plebes subject to different forms of punishment by older cadets, in a \"tradition\" supposedly intended to build character but can also be fatal in some cases. Police are investigating at least 5 cadets who allegedly electrocuted Domitorio in his private parts with a makeshift taser. The victim complained of stomach pain and later died. Taser flashlight used to electrocute PMA cadet, police says In 1981, scandal also hit the Baguio City-based academy founded in 1903, following the hazing death of <mark>Andres Ramos</mark> Jr., son of a Philippine Constabulary general. \"It's a system that only the cadet corps can correct,\" said retired armed forces chief Dionisio Santiago, who admitted also taking a beating as a freshman. Santiago pointed to an L-shaped scar behind his head, a painful remembrance of an \"accident\" in 1966. FLOOR WAX An upperclassman summoned the young Santiago, while another one instructed him to take the can of floor wax on his way out. \"Yes, sir,\" he said, sticking to what was supposed to a plebe's automatic response, but didn't know where it was. \"Yes ka nang yes, di mo pala nakita,\" the older cadet said before unleashing a right cross that dropped the freshman flat on his back. Santiago \"s head hit the concrete floor, requiring 7 and costing his attacker a year in the academy. Five others were also\" turned back \"or made to repeat the academic year, he said, for not stopping their peer under the PMA's\" honor \"system.\" Dapat you should stop them. Kung hindi, equally guilty ka, \"Santiago told ABS-CBN News.\" Nandu ’n sila nu ’n g ginulpi ako. \"SUPERMAN More than 5 decades later, Santiago, a member of PMA Class\" 70, made light of the incident and his difficult year as a plebe. Like him, his upperclassmen went on to hold important positions in the police and the military and later, the government following their retirement. \"Pagkatapos mo ng plebe years, parang superman ka. Di ka tatablan ng bala. Kaya mo lahat. Kaya mong makipagbakbakan sa mga kanto d’yan,\" he said, citing how the experience helped build his self-confidence. Sen. Ronald dela Rosa, a member of PMA Class \"86, earlier argued that cadets were being trained to become\" warriors, \"arguing that universities also had hazing. Bato on hazing: If universities have it, what more a military academy? Santiago said the PMA experience was different from fraternity hazing because it's intended to\" toughen your gut. \"Tasks given did not always involve inflicting physical harm, he said, recalling the time when he was made to copy by hand the entire front page of a broadsheet. ABUSIVE But while that exercise, squeezed within his tight academic schedule, taught him the value of\" compliance \"and time management, others did not necessarily involve any logical reason.\" May mga plebo d’yan, pagmumukha mo pa lang, malas na, \"he recalled in jest.\" Ako naman, ang malas ko,' yung kapatid ko nasa top 10. Kaya naiinggit sa kanya yung \"goat' na company-mate ko.\" Santiago rejected the idea that abusive practices victimizing first-year cadet was part of the PMA culture. But he said the academy should institute more regular physical and psychological examinations on cadets. Judging by his years in the PMA, he said a plebe's experience could turn one into a rather brutal upperclassman or one that opted never to inflict the same physical abuse on those who came after. \"Minsan kasi,' yung experience mo changes your attitude...maraming nagiging abusado,\" he said. Share Save Facebook Share on Twitter LinkedIn PMA, Philippine Military Academy, hazing, Darwin Dormitorio, <mark>Andres Ramos</mark>, Dionisio Santiago, Ronald dela Rosa Read More: PMA Philippine Military Academy hazing Darwin Dormitorio <mark>Andres Ramos</mark> Dionisio Santiago Ronald dela Rosa / news/09/26 / 19/2-officer-sugatan - sa-rambol-ng-mga-preso-sa-pasay-jail / news/09/26 / 19/39-trabahador-na - chinese-itinakbo-sa-ospital-dahil-sa-food-poisoning / overseas/09/26 / 19/embattled-hong-kong - leader-set-for-town-hall-meeting / overseas/09/26 / 19/two-children-beaten - to-death-in-india-for-defecating-in-open / overseas/09/26 / 19/heavy-rains-kill -17 - in-western-india"}, {"articleID": "2016052905_00058675_W", "names": {"George Rogers": ["Q16192904", "Q21166625", "Q3101881", "Q53794163", "Q5543996"]}, "date": "2016-05-29", "url": "http://www.statesman.com/news/news/national/marker-honors-revolutionary-war-soldier/nrWrg/", "content": "Explore SIGN UP FOR NEWSLETTERS Want more news? Sign up for free newsletters to get more of the Statesman delivered to your inbox. A Revolutionary War soldier's memory will endure with the dedication of a new gravestone. A special ceremony honoring William Henry Brandenburg, Jr. in New Carlisle Cemetery capped the annual New Carlisle Memorial Day parade and service Saturday. The ceremony included contributions from members of the New Carlisle Historical Society, <mark>George Rogers</mark> Clark Chapter of the Sons of the American Revolution, Lagonda Chapter of the Daughters of the American Revolution, New Carlisle Boy Scout Troop 27 and the American Legion/Veterans of Foreign Wars Honor Guard. Brett Turner Randy Young of the <mark>George Rogers</mark> Clark Chapter of the Sons of the American Revolution lays a wreath after the unveiling of the new gravestone of Revolutionary War soldier William Henry Brandenburg Jr. at New Carlisle Cemetery on Saturday, May 28. Contributed photo by Brett Turner Historical Society members Scott Suther, Dave McWhorter and Hugh Schiller collaborated to see Brandenburg's marker was restored. \"We like to keep track of the soldiers who served,\" Suther said. \"We needed to see what we could do for Brandenburg.\" They do readings of the various sections of the cemetery and keep track of the Revolutionary War soldiers. While markers for Adam McPherson, Thomas Wallace and John Boltenhouse are easily identifiable, Brandenburg's wasn't. The Brandenburg family's markers had fallen and were worn; the only one clearly marked was his son, Frederick. \"It's a process,\" McWhorter said. \"We want to acknowledge these soldiers and what they've done.\" Brandenburg was born Oct. 8, 1758 and joined the Continental Army in 1781, and served in several regiments. He pursued the Tories, those who remained loyal to the British during the war, and guarded British prisoners of war. Brandenburg and family moved to Montgomery County in 1816, then to Bethel Township. A cholera outbreak claimed Brandenburg and several family members in 1834. He died on Aug. 17 of that year. One of the things the new stone corrects is the year of the family's passing. Two of the remaining markers incorrectly indicate 1831 as the year of death. Suther was surprised how quickly the plan for the new marker happened. They worked with the Department of Veterans Affairs, which paid for the new marker and had it by December. In addition, Frederick's stone and another, possibly Brandenburg's wife, have been reset in new concrete flanking Brandenburg's new marker. The city of New Carlisle dedicated the new concrete to support the markers. The Memorial Day weekend seemed to be the perfect time for the ceremony. Brandenburg is the great-great-great-great uncle of Sharon Maingi of Tipp City, who attended the ceremony. \"I was so impressed with the turnout. It was above expectations,\" she said. Maingi described herself as a patriot and was inspired to join the Daughters of the American Revolution and awaiting her confirmation. \"It's part of who I am; he set an example for me,\" Maingi said. \"I'm hopeful the younger generation will realize what a wonderful heritage we have.\" Other Brandenburg descendants sent emails applauding the honor, which Suther shared at the ceremony. While there are currently four known Revolutionary War soldiers identified in New Carlisle Cemetery, a fifth's grave location is still undetermined. William Serviss is being sought next by the historical society. \"I live at the library on the weekend,\" Suther said, smiling. McWhorter had reassurance of the Brandeburg effort when he met a Vietnam veteran before Saturday's ceremony. \"He talked about how important it was for him to witness the ceremony, and as a combat veteran he had appreciation for what they went through and what an honor it was to be here,\" McWhorter said. \"It makes me feel good we can honor military heroes of all eras.\" "}, {"articleID": "2012082107_00048373_W", "names": {"Peter Kafka": ["Q2077213", "Q43964012"]}, "date": "2012-08-17", "url": "http://forbes.com/sites/ycharts/2012/08/17/watching-facebook-try-to-fashion-an-ad-strategy-to-justify-its-market-cap-priceless/", "content": "fb) socially-driven ads are supposed to be something special--a vast improvement over highway billboards or those things google (goog) buys in newspapers. on facebook, companies embracing \"social marketing\" can advertise directly to fans, and companies can use those fans to reach their friends. a press release about a comscore study called \"the power of like\" trumpeted the \"virtuous cycle of brand impact\" available on facebook--display ads attract fans, marketing communications in the news feed reach fans and their friends, and those are supplemented by sponsored stories and promoted posts \"to maximize reach and brand resonance.\" now facebook is experimenting with a new kind of advertising for mobile, reports allthingsd. the ads are called \"page posts,\" and as <mark>peter kafka</mark> explains, companies will be able to place posts in a user's news feed, even if those people aren't fans of the brand. in other words, facebook is experimenting with having companies run? normal ads. what a good idea! we admit that so far we have found facebook ads underwhelming. so has the market. fb data by ycharts but as <mark>kafka</mark> says of this new experiment, \"if facebook makes it a full-blown option, it will open up a lot more mobile ad inventory for facebook (ditto for regular desktop ads, which will work the same way).\" yes indeed. selling normal ads might bring in more money. it's hard to argue with that. ycharts.com covers over 5,000 u.s. companies and manages over 40 million investor trends in real-time. fundamental research and empirical data drives all portfolio strategies and stock ratings for ycharts pro. our team performs extensive studies of historical factors that tend to predict future returns for growth and value stocks. we provide investors with transparent information that has been proven to beat the markets. pro automates a lot of the research that professional analysts provide but we don't have the same potential conflicts of interest. our research and others have proven that equity analysts tend to be overly optimistic about stocks. pro is for investors looking for a trusted independent source based on empirical data and testing. our team is based in chicago and new york with experience at google, wall street journal, bear stearns, lehman brothers, tribune and wallstreetview. we are contributors to and syndicated to many of the top financial publications. the author is a forbes contributor. the opinions expressed are those of the writer. jamie dimon: buck stops somewhere below me--jpmorgan clawbacks aimed at lesser souls qualcomm vs. intel in mobile chips: somebody's about to get hurt"}]