[{"date": "2014-07-09", "url": "http://azcentral.com/story/entertainment/arts/2014/07/09/brelby-theatre-gets-geek-kills-monsters/12374789", "content": "Subscribe today for full access on your desktop, tablet, and mobile device. 7/11-23: Brelby geeks out with \"She Kills Monsters' The cast of the Brelby Theatre Company production of\" She Kills Monsters .' From left: Mia Passarella as Lilith, Melody Knudson as Kaliope, Kristiana Faddoul (back) as Tilly Evans, Shelby Maticic as Agnes Evans, David Magadan as Chuck. span class = \"credit\" > (Photo: Brelby Theatre Company) Story Highlights Glendale's Brelby Theatre Company is a mom-and-pop drama shop founded in 2009. \"She Kills Monsters\" is a bittersweet comedy inspired by the Dungeons & Dragons role-playing game. MORE Sure, a lot of people love \"Game of Thrones .\" But it wasn't that long ago that the whole swords-and-sorcery thing was a one-way ticket to social ostracism. Or maybe it was the only way out. Either way, it sure seems as though the geeks have inherited the earth. At the risk of making an epic overstatement, the redemptive power of geek culture is the heart of a new stage comedy called \"She Kills Monsters,\" which is getting its Arizona premiere from Glendale's Brelby Theatre Company. \"It's kind of about how nerds as a whole have gone on this journey from being underdogs to now being kind of cool,\" says company co-founder Shelby Maticic. Written by New York playwright and fight director <mark>Qui Nguyen</mark>, \"She Kills Monsters\" is inspired by Dungeons & Dragons, the role-playing game from the 1970s that has spawned countless imitators, from old-school dice-and-paper play to mega-popular online RPGs such as World of Warcraft. It's a bittersweet comedy about a schoolteacher named Agnes who loses her family but comes to know her kid sister through the fantastical world she created within the game. \"Obviously the show speaks to nerds and has this incredible quest and really intense battle sequences and monsters that we get to play with onstage,\" says Brian Maticic, the show's director (and Shelby's husband). \"But what it comes down to is the theme of escapism, the chance to live that fantasy that you can't have in real life, but also mixed with the personal growth of the main character. It follows her through the grieving process but also her own self-discovery as she learns about who her sister was and who she is as a person .\" Shelby Maticic, who is also the company's artistic director, will play Agnes. \"It's this beautiful journey of her getting to know a sister that she never paid attention to,\" Shelby says. \"She ends up kind of building a new family along the way out of the characters that she meets through the Dungeons & Dragons world, who all actually have real-world counterparts. They were all members of Tilly's gaming circle .\" It's a really sweet, kind of sad show, but it's perfectly balanced with some seriously epic fight sequences as they play out the quest onstage \"- including a climax involving a five-headed dragon puppet. Quite literally a mom-and-pop operation, Brelby doesn't have the resources for a lot of fancy special effects, but the company does what it can to add pizzazz to its productions, as when it did up Oscar Wilde's\" The Importance of Being Earnest \"in steampunk style, complete with giant working cogwheels as part of the stage .\" We have a really intimate studio, but I think we've gotten pretty creative about finding ways to surprise the audience with tech elements, \"Shelby says. Founded in 2009, Brelby Theatre has cultivated a younger audience - college age to young parents - with an eclectic mix that includes the occasional classic drama or Broadway musical but also less-known works by contemporary playwrights, including local writers. Reach the reporter at kerry.lengel @ arizona­republic.com or 602-444-4896. Brelby Theatre Company:\" She Kills Monsters' When: Friday, July 11, through Saturday, July 26. Where: Brelby Studio, 6835 N. 58th Ave., Glendale. Admission:", "articleID": "2014070922_00102662_W", "names": {"Qui Nguyen": ["Q27831085", "Q7271625"]}}, {"date": "2014-07-09", "url": "http://www.voxy.co.nz/sport/crusaders-name-team-play-highlanders/5/195851", "content": "Thursday, 10 July, 2014 - 11:07 Crusaders head coach Todd Blackadder has made just one change to his team to face the Highlanders this Saturday night. Lock Sam Whitelock, who was a late withdrawal from last week's team, has returned to the starting line-up, which means Jimmy Tupou is on the bench. The rest of the line-up is the same as that which beat the Blues last weekend. Eighteen weeks of competition culminate in this southern derby on Saturday night. It is the final round of pool play and will determine log placings and qualifiers for the play-off rounds. While the Crusaders are already guaranteed a play-off spot, they are also working towards a second place qualification that would see them proceed directly to a home semi-final. \"That will require us to beat the Highlanders and beat them well,\" Blackadder said. \"The Highlanders are also a gutsy side though and we know that they will be putting everything they've got into this encounter. We are going to have to put in the performance of the season to come out on top, and that is exactly what the team has committed to doing .\" Kick-off is at 7:35 pm Saturday at AMI Stadium (Addington). Crusaders team to play the Highlanders: 1. Wyatt Crockett 2. Ben Funnell 3. Owen Franks 4. Dominic Bird 5. Samuel Whitelock 6. Jordan Taufua 7. <mark>Matt Todd</mark> 8. Kieran Read (C) 9. <mark>Andy Ellis</mark> 10. Colin Slade 11. Nemani Nadolo 12. <mark>Dan Carter</mark> 13. Ryan Crotty (VC) 14. Kieron Fonotia 15. Israel Dagg RESERVES: 16. Corey Flynn 17. <mark>Joe Moody</mark> 18. Nepo Laulala", "articleID": "2014071006_00078363_W", "names": {"Andy Ellis": ["Q16264611", "Q4756893", "Q4760644", "Q504581", "Q525682"], "Dan Carter": ["Q18642089", "Q5213238", "Q59277840", "Q726199"], "Joe Moody": ["Q16732801", "Q6211415"], "Matt Todd": ["Q1909280", "Q29017168"]}}, {"date": "2014-07-13", "url": "http://blog.masslive.com/criesandwhispers/2014/07/westfields_lt_michael_ldeane_a.html", "content": "Set Your Location (Enter City and State or Zip Code) Congratulations! Your weather is set to <mark>Michael</mark> L. Deane, a Westfield High School graduate was killed in Vietnam on May 24, 1968, at age 23. He was an Army lieutenant and graduate of St. Lawrence University. Westfield, is now remembered on the Vietnam Veterans Memorial Fund's Wall of Faces virtual gallery. The fund is seeking photographs of all of the nearly 58,000 soldiers killed in Vietnam whose names are commemorated on the national memorial wall in Washington, D.C. Deane's Westfield HIgh School graduation photograph was submitted by classmate and friend Rich Girard in response to a \"We played on the Westfield football team, and he was on full scholarship at St. Lawrence (University),\" Girard recalled. \"We both were in ROTC, and Mike went immediately into the Army .\" Added Girard, \"Mike was a very special person. He could have been governor or anything else he wanted .\" Within days of the column's publication, a number of readers, including some family members, wrote to say they remembered Deane well from growing up with him in Westfield. Said former Mayor <mark>Michael</mark> E. O'Connell, also a classmate, \"Lt. <mark>Michael Lindsay</mark> Deane was supposed to be the politician, not (former mayor <mark>John Rhodes</mark>) or me. He was half\" Frank the Tank' from (the movie) \"Old School' and half Kramer (from\" Seinfeld'), an extraordinary prankster. \"When the big stories break, we'll send you an alert. Check here if you do not want to receive additional email offers and information. Registration on or use of this site constitutes acceptance of our Privacy Policy © 2014 MassLive LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of MassLive LLC.", "articleID": "2014071321_00062577_W", "names": {"John Rhodes": ["Q173566", "Q20830770", "Q21549083", "Q47545610", "Q48789261", "Q6254694", "Q6254696"], "Michael Lindsay": ["Q3856208", "Q6847677"]}}, {"date": "2014-07-15", "url": "http://whas11.com/news/crimetracker/Fegenbush-Lane-shooting-suspect-appears-in-court-bond-set-at-25K-267184411.html", "content": "Related: Coroner releases identity of man shot, killed on Fegenbush Lane add to reading list Shooting on Fegengush Lane View larger map LOUISVILLE, Ky. (WHAS11)--A Louisville man is behind bars Tuesday after a deadly dispute with his landlord. Anthony Jecker, 54, is suspected in the shooting death of 49-year-old <mark>James Scott</mark> Tolle inside his Manor Brook Apartment complex in the Norfolk neighborhood. Tolle's father told WHAS 11 News his son had been in a dispute with Jecker over his electric bill, totaling $58. When Jecker didn't pay it, Tolle cut off his electricity. Tensions only escalated from there. \"The neighborhood is just really shocked. Everybody around here is just freaking out,\" neighbor Mary Welch said. \"I'm just having a real hard time grasping that my friend, that I talk to everyday, on a daily basis killed somebody .\" Tolle died from a single gunshot wound to the chest. \"Sixty dollars ain't worth killing somebody for. Take them to court,\" Welch said. Instead, Jecker appeared before a judge Tuesday morning on charges of murder and tampering with evidence, after police said he attempted to dispose of the gun. The judge set his bond at $25,000 cash only, on the conditions he not speak to Tolle's family or carry a firearm. Print print Email Email this article | Tweet MORE MORE! X Digg Delicious Tumblr LinkedIn StumbleUpon Newsvine Reddit Pinterest Next article Couple arrested having sex on Chipotle roof in Deleware", "articleID": "2014071523_00083985_W", "names": {"James Scott": ["Q18224055", "Q18816109", "Q21165400", "Q21165402", "Q21457653", "Q21516445", "Q2165229", "Q22280379", "Q29643568", "Q3025403", "Q3161395", "Q32947138", "Q38361537", "Q43910857", "Q54312478", "Q6138548", "Q6142856", "Q6142862", "Q6142863"]}}, {"date": "2014-07-15", "url": "http://www.thejournal.ie/kathleen-lynch-older-people-1573303-Jul2014/", "content": "Tuesday 15 Jul, 2014 http: //jrnl.ie/1573303 <mark>Kathleen Lynch</mark> says she still has responsibility for older people Image: Sam Boal via Photocall Ireland THE MINISTER OF State for Primary and Social Care, <mark>Kathleen Lynch</mark> has said that she will retain responsibility for older people under the Social Care element of her portfolio. It comes after a change in her title earlier today. <mark>Lynch</mark> was appointed - Minister of State at the Department of Health with Special Responsibility for Primary Care, Mental Health and Disability. However, in 2011 the Minister of State's title was - Minister of State at the Department of Health with Special Responsibility for Disability, Older People, Equality & Mental Health. Minister <mark>Lynch</mark> has released a statement this evening saying that she \"retains responsibility under the Social Care element of her portfolio for Mental Health, Disability and Older People\". Concerns The charity for older people, Alone, said it is \"extremely concerned' about the change of title. CEO Sean Moynihan said,\" The removal of \"older people' from the Ministerial title strongly suggests a shift in priorities within the current Government. The number of people over the age of 65 is increasing by 20,000 a year. Monihan added,\" in such a climate the government should be prioritising the needs of older people and strategically planning for the future instead of removing them from sight. \"After seeing what my dad has gone through, I'm convinced we need an Ombudsman for the Elderly> Please select the reason for reporting this comment. Most viewed articles in the past 24 hours Most commented articles in the past 3 days Opinion: A fatal foetal diagnosis is nobody's fault - the deliberate lack of support by the State is. The newly-crowned Minister for Health's role could be the making or breaking for one of politics' rapidly rising stars. Opinion: The GAA and Samaritans both have an ethos of giving rather than taking So just how young is the country's youngest junior minister?...The Edge has hats that are older The Dublin Embassy of Israel says the country has a right to defend its citizens The Dublin city council chief talked about the Garth Brooks debacle Content copyright © Journal Media Ltd. 2014 Registered in Dublin, registration number: 483623. Registered office: 3rd floor, Latin Hall, Golden Lane, Dublin 8. TheJournal. ie is a full participating member of the Press Council of Ireland and supports the Office of the Press Ombudsman. This scheme in addition to defending the freedom of the press, offers readers a quick, fair and free method of dealing with complaints that they may have in relation to articles that appear on our pages. To contact the Office of the Press Ombudsman Lo-Call 1890 208 080 or go to Please note that TheJournal. ie uses cookies to improve your experience and to provide services and advertising. For more information on cookies please refer to our Photocall Ireland unless otherwise stated. Irish sport images provided by <mark>Kathleen Lynch</mark> says she still has responsibility for older people Comments", "articleID": "2014071604_00034261_W", "names": {"Kathleen Lynch": ["Q28740429", "Q3777461", "Q6376795"]}}, {"date": "2014-07-15", "url": "http://www.defense.gov/news/newsarticle.aspx?id=122678", "content": "DoD News, Defense Media Activity WASHINGTON, July 15, 2014 - Defense Secretary Chuck Hagel discussed the situation in Iraq by phone today with French Defense Minister Jean-Yves Le Drian. Pentagon Press Secretary Rear Adm. <mark>John Kirby</mark> issued a statement after the call saying Hagel \"provided an update on the situation in Iraq, to include the political dynamics in Baghdad and a general sense of the security environment .\" ", "articleID": "2014071606_00017317_W", "names": {"John Kirby": ["Q16136520", "Q1700713", "Q18601108", "Q58213283", "Q6243183", "Q6243189"]}}]