[{"articleID": "2008100305_00019408_W", "names": {"President Bush": ["Q207", "Q23505"]}, "date": "2008-10-03", "url": "http://invogue4.wordpress.com/?p=40", "content": "a tea time and i think a break from the heavyweights of wall street. . bailout. . and other economic policies. . so wat should suffice this holiday season. . ahh obviously the two dumb doods of us presidential elections. . the hillary-defeater & the wal-mart greeter. . so a view on some dumb quotes from em so far. . john mccain ~ \"well, it's common knowledge and has been reported in the media that al qaeda is going back into iran and receiving training and are coming back into iraq from iran. that's well known. and it's unfortunate.\" - before correcting himself by saying iran was training \"extremists,\" not al qaeda \"i will conduct a respectful debate. now, it will be dispirited - it will be spirited - because there are stark differences. i am a proud conservative, liberal republica - conservative republican...hello? easy there.\" \"i'm going to be honest: i know a lot less about economics than i do about military and foreign policy issues. i still need to be educated.\" \"make it a hundred...that would be fine with me.\" - to a questioner who asked if he supported president <mark>bush</mark>'s vision for keeping u.s. troops in iraq for 50 years \"you know that old beach boys song, bomb iran? bomb bomb bomb, bomb bomb iran.\" --barack obama ~ \"hold on one second, sweetie, we're going to do - we'll do a press avail.\" - to a female reporter for abc's detroit affiliate who asked about his plan to help american autoworkers \"i've now been in 57 states - i think one left to go.\" - at a campaign event in beaverton, oregon \"why can't i just eat my waffle?\" - after being asked a foreign policy question by a reporter while visiting a diner in pennsylvania \"come on! i just answered, like, eight questions.\" - exasperated by reporters after a news conference \"in case you missed it, this week, there was a tragedy in kansas. ten thousand people died - an entire town destroyed.\" - on a kansas tornado that killed 12 people \"the point i was making was not that grandmother harbors any racial animosity. she doesn't. but she is a typical white person, who, if she sees somebody on the street that she doesn't know, you know, there's a reaction that's been bred in our experiences that don't go away and that sometimes come out in the wrong way, and that's just the nature of race in our society.\" october 3, 2008 at 11:05 am category:"}, {"articleID": "2015072621_00025088_W", "names": {"Ben Rhodes": ["Q4886343", "Q4886346", "Q4886347", "Q4886348"]}, "date": "2015-07-26", "url": "http://www.odt.co.nz/news/world/350413/turkish-jets-hit-pkk-targets-iraq", "content": "Turkish jets hit PKK targets in Iraq News: World Turkey attacked Kurdish insurgent camps in Iraq for a second night on Sunday, security sources said, in a campaign that could end its peace process with the Kurdistan Workers Party (PKK). Ankara, which called for a special NATO meeting on Tuesday to discuss its security concerns, said two of soldiers were killed and four wounded in the latest attack by PKK militants. Long a reluctant member of the United States-led coalition against Islamic State, Turkey made a dramatic turnaround this week by granting the alliance access to its air bases and launching air raids against both the jihadist movement and the PKK. But the relapse into serious conflict between Turkey and the PKK has raised doubts about the future of NATO member Turkey's peace process with Kurdish foes that started in 2012, after 28 years of bloodshed, but has recently stalled. Four Turkish F-16 fighter jets deployed from the Diyarbakir air base in the country's mainly Kurdish southeast hit PKK targets in Hakurk in northern Iraq, the sources told Reuters. The strike came after a car bomb and roadside explosives hit a passing military vehicle on a highway near Diyarbakir overnight on Sunday, the army said. Kurdish militants then opened fire on the vehicle with rifle fire, it said. Four other soldiers were wounded. At least six people had been detained in connection with the attack, the Dogan news agency reported. The PKK, which Ankara and Washington deem a terrorist group, has also targeted police officers in the southeast and elsewhere, accusing the Islamist-rooted central government of covertly helping Islamic State to the detriment of Syrian Kurds. The outlawed PKK has waged an insurgency against Ankara for Kurdish autonomy since 1984. Opposition politicians and critics accuse President Tayyip Erdogan of taking up the campaign against Islamic State as political cover to clamp down on Kurds. Prime Minister Ahmet Davutoglu, who has said the operations will continue as long as Turkey faces a threat, discussed security with United Nations Secretary-General Ban Ki-moon in a telephone call overnight. NATO said ambassadors will meet on Tuesday to discuss security at Turkey's request. A senior US diplomat condemned recent PKK attacks but denied any link between Turkey's new strikes on Kurdish militants and its newfound boldness in tackling Islamic State, which has seized large expanses of neighbouring Syria and Iraq. \"There is no connection between these air strikes against PKK and recent understandings to intensify US-Turkey cooperation against ISIL,\" Brett McGurk, the deputy special presidential envoy for the coalition to counter Islamic State, said on Twitter, using one of Islamic State's acronyms. White House spokesman <mark>Ben Rhodes</mark>, on an official visit to Kenya with President Barack Obama, told a news conference in Nairobi: \"The US of course recognises the PKK specifically as a terrorist organisation. And so, again, Turkey has a right to take action related to terrorist targets. And we certainly appreciate their interest in accelerating efforts against ISIL.\" Turkey said on Saturday its decision to enter the battle against Islamic State, soon after an IS suicide bomber killed 32 people, mainly Kurds, in the Turkish town of Suruc, would help create \"a safe zone\" across the nearby border in northern Syria. Turkish opposition leaders say they are concerned that Erdogan wants the new attacks on the PKK to whip up anti-Kurdish sentiment before a possible early election later this year. The Islamist-based AK Party he founded has until late August to find a junior coalition partner or face an early election. The AKP lost its single-party majority last June for the first time in more than a decade, in part due to the success of the pro-Kurdish Peoples' Democratic Party (HDP), which entered parliament for the first time. \"One of the aims of the air, land and media operations carried out right now is to undermine the HDP in early elections,\" HDP head Selahattin Demirtas said on Twitter. & raquo;"}, {"articleID": "2019101417_00188421_W", "names": {"Derrick White": ["Q11320818", "Q30122669"]}, "date": "2019-10-14", "url": "http://mysanantonio.com/sports/spurs/article/Spurs-fans-don-t-know-if-they-should-panic-after-14520184.php", "content": "https: //www.mysanantonio.com/sports/spurs/article/Spurs-fans-don-t-know-if-they-should-panic-after-14520184.php Spurs fans don't know if they should panic after third preseason loss By Madalyn Mendoza, mySanAntonio.com Updated 12:07 pm CDT, Monday, October 14, 2019 @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not gonna be good for along time. We lost by +20 points to fricking mediocre teams less @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not...more Photo: Twitter Screengrab Photo: Twitter Screengrab Image 1 of / 83 Caption Close Image 1 of 83 @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not gonna be good for along time. We lost by +20 points to fricking mediocre teams less @ kellynohandle: Spurs are about to lose their three straight preseason games outer me: it's ok. Spurs are still good. We have tim and pop. And other guys are not bad. inner me: we are not good. we are not...more Photo: Twitter Screengrab Spurs fans don't know if they should panic after third preseason loss 1 / 83 Back to Gallery Reactions from Spurs fans to the team's 0-3 preseason record is a mixed bag. No. 1 draft pick Zion Williamson and the Pelicans were in town Sunday and handed the team their third preseason loss. While some fans are firm in their decision to remain calm, others took to Twitter to share early predictions, citing issues they say could be a red flag for the regular season. \"Folks, I know it's preseason, but this Spurs team does not look good so far. They've played three lower-rung playoff teams, 2 at home, and have looked outmatched every time,\" Twitter user @ yungpopovich chimed in on the conversation. RELATED: Popovich blasts Trump's \"cowardly' approach to dealing with authoritarian figures Another corner of Spurs Twitter combated the preseason jitters and dismal takeaways with memes or by focusing on brighter moments, such as when retired legend Manu Ginobili was featured on the AT & T Center's\" Simba cam, \"when fans hoist their kids in the air to reenact the Mufasa moment from\" Lion King. \"\"I forgot about this but Manu was at the game yesterday. They had the Simba cam, and halfway through it, they cut to Manu holding his youngest like Simba. That was my favorite moment of the game,\" @ astroalehcat tweeted. At this point last season, the Spurs were also on shaky ground as the injured list included Lonnie Walker IV, Dejounte Murray and <mark>Derrick White</mark>. The Spurs take on the Houston Rockets on Wednesday. The regular season tips off on Oct. 23 at home against the New York Knicks. See more of the chatter in the gallery above. Madalyn Mendoza is a breaking news reporter and general assignment writer. Read her on our breaking news site, mySA.com, and on our subscriber site, ExpressNews.com | mmendoza @ mysa.com | @ MaddySkye School Score Database Most Popular 1 Coach Pop again strikes out at President Trump 2 2019 Top Workplaces in San Antonio: Small employers 3 Texas cop fatally shoots woman during a welfare check 4 Police: New Northwest Side intersection to blame for Sunday night crash 5 Megan Thee Stallion is a no-show at ACL 6 2 S.A. resorts receive national nod 7 She began to talk, then fell silent. Months later mom learns why View Comments © 2019 Hearst Communications, Inc. ."}, {"articleID": "2019020307_00877837_W", "names": {"Ed Gillespie": ["Q18686352", "Q5334860"]}, "date": "2019-02-03", "url": "http://feeds.breakingnews.ie/~r/bntopstories/~3/kmVD3INSMJw/donald-trump-weighs-in-on-us-state-governor-controversy-901903.html", "content": "Donald Trump weighs in on US state governor controversy Sala and pilot David Ibbotson disappeared...Download our app 03/02/2019 - 07:01:00 Back to US Politics World Home US president Donald Trump has weighing in on the racist photo that appeared in the medical college yearbook of Virginia governor Ralph Northam. Democratic officials in Virginia and nationally urged Mr Northam to resign after news reports of the photo, which appeared in Mr Northam's 1984 medical school yearbook and showed a person in blackface and a person in Klan regalia. Mr Northam refused to resign, however, and said on Saturday that he was not either of the people pictured. In tweets on Saturday night, Mr Trump criticised Mr Northam over his recent comments on late-term abortion. Democrat Governor Ralph Northam of Virginia just stated, \"I believe that I am not either of the people in that photo.\" This was 24 hours after apologizing for appearing in the picture and after making the most horrible statement on \"super\" late term abortion. Unforgivable!--Donald J. Trump (@ realDonaldTrump) February 3, 2019 <mark>Ed Gillespie</mark>, who ran for Governor of the Great State of Virginia against Ralph Northam, must now be thinking Malpractice and Dereliction of Duty with regard to his Opposition Research Staff. If they find that terrible picture before the election, he wins by 20 points!--Donald J. Trump (@ realDonaldTrump) February 3, 2019 He also said that Mr Northam's Republican opponent in the 2017 governor election, <mark>Ed Gillespie</mark>, would have won had the photo turned up during their campaign. Earlier this week, abortion opponents accused Mr Northam of supporting infanticide. In a radio interview, the governor described a hypothetical situation in which an infant who is severely deformed or unable to survive after birth is left to die. Mr Trump tweeted after those comments that \"Democrats are becoming the Party of late term abortion\" . As calls mounted on Saturday for Mr Northam to resign because of the photo, Mr Trump tweeted: \"Democrat Governor Ralph Northam of Virginia just stated,\" I believe that I am not either of the people in that photo .' This was 24 hours after apologizing for appearing in the picture and after making the most horrible statement on \"super' late term abortion. Unforgivable!\" In a second tweet, Mr Trump wrote: \"<mark>Ed Gillespie</mark>, who ran for Governor of the Great State of Virginia against Ralph Northam, must now be thinking Malpractice and Dereliction of Duty with regard to his Opposition Research Staff. If they find that terrible picture before the election, he wins by 20 points!\" - Press Association"}, {"articleID": "2008111207_00014653_W", "names": {"Wang Yong": ["Q16195856", "Q2204373", "Q2548285", "Q27924942", "Q45365269", "Q45381074", "Q45430134", "Q45431515", "Q45431761", "Q45431855", "Q45440993", "Q45442089", "Q45444420", "Q45450114", "Q45459096", "Q45460038", "Q45462570", "Q45463900", "Q45470167", "Q45474599", "Q45476793", "Q45477325", "Q45482779", "Q45486547", "Q45486878", "Q45487324", "Q45491973", "Q45502107", "Q45509613", "Q45509697", "Q45511092", "Q45513695", "Q45520865", "Q45523197", "Q45524656", "Q45526088", "Q45528039", "Q45529048", "Q45531335", "Q45534472", "Q45536013", "Q45555525", "Q45556805", "Q45566643", "Q45575725", "Q45578366", "Q45584178", "Q45589220", "Q45591872", "Q45592737", "Q45592752", "Q45594492", "Q45595488", "Q45595939", "Q45597994", "Q45599258", "Q45599319", "Q45605668", "Q45613607", "Q45627748", "Q45627855", "Q45640320", "Q45647199", "Q45647319", "Q45650004", "Q45650365", "Q45655770", "Q45655829", "Q45655888", "Q45655948", "Q45656008", "Q45656070", "Q45659374", "Q45661743", "Q45667558", "Q45673472", "Q45674509", "Q45681756", "Q45691615", "Q45693985"]}, "date": "2008-11-12", "url": "http://channelnewsasia.com/stories/afp_asiapacific/view/389302/1/.html", "content": "> \"onclick =\" next (); \"src =\" / images/butt _ next.gif \"width =\" 18 \"height =\" 15 \"/> beijing: a strike involving hundreds of taxi drivers in south china entered its third day on wednesday, as they demanded the release of 21 colleagues who police detained for protesting, state media reported. there were no taxis in service in sanya, a city on hainan island, on wednesday, and dozens of cab drivers were still gathered at the government headquarters, the official xinhua news agency reported. sanya's acting mayor <mark>wang yong</mark> met with representatives of taxi companies and drivers on tuesday and apologised to the drivers who are protesting against high rental fees and competition from unlicensed cabs, xinhua said.\" lots of issues exist in our transport management, and i apologise for that to the city's taxi drivers, \"he told them, according to xinhua. the strike began on monday, turning violent when some people smashed up 15 cabs and attacked other drivers who would not join them in the strike. police detained 21 of the drivers for the violence, xinhua reported, adding that the striking drivers had now added their release to the list of demands. it was the third strike action by taxi drivers in china in 10 days, after cabbies in the southwestern city of chongqing and in the northwestern province of gansu also stopped work in protest at high fees and unlicensed cabs. state media has said taxi companies have agreed to lower the chongqing drivers' fees for leasing their vehicles. the local government in gansu has also promised to get rid of unlicensed taxis, the official china daily reported wednesday. in sanya, <mark>wang</mark> pledged to improve the city's transport industry and create a favourable environment for licensed drivers, xinhua reported. he also expressed support for the establishment of a cabbies' association, which is one of the other demands of the striking drivers, the news agency said. copyright © mediacorp pte ltd. all rights reserved. use of this site is subject to our"}, {"articleID": "2018041202_00067469_W", "names": {"James Franklin": ["Q14950689", "Q14950690", "Q3530165", "Q3895609", "Q56807312", "Q6134186"], "Nick Scott": ["Q21622776", "Q43388432"]}, "date": "2018-04-12", "url": "http://www.mystatesman.com/sports/college/penn-state-sloppy-full-teachable-moments-11th-spring-practice/JPbMle2KHTggCHy7ubkJOK/", "content": "sports By Audrey Snyder - Land of 10...Posted: 9:07 p.m. Wednesday, April 11, 2018 STATE COLLEGE, Pa.--Quarterback Trace McSorley raised his voice to a level that hadn't been heard before--at least not by reporters--as he pulled aside Danny Dalton for a teachable moment during Penn State's Wednesday night spring practice. Dalton, one of the Nittany Lions' many tight ends vying for an increased role this year, got an earful from Penn State's fiery quarterback after he was caught from behind and Cam Brown forced a fumble. The quarterback then tapped Dalton on the helmet after the exchange was over on the sideline as if to pick him up and say all is well. It was just one of those off nights for the Nittany Lions on the practice field, and McSorley wasn't the only one fired up following Penn State's practice inside Holuba Hall. \"I wasn't happy with today,\" <mark>James Franklin</mark> said after the 11th practice of the spring. \"We're a mature football team. You guys know we never run guys after practice, that's junior high stuff. I thought we were sloppy today. You guys know I'm a pretty positive guy, but I thought we were too sloppy, had too many penalties, balls on the ground, dropped balls, just a lack of discipline. I was not pleased today, but overall I thought we've had a damn good spring, but I was not pleased with today.\" <mark>Franklin</mark> had his players line the sideline for a series of wind sprints to conclude the workout, only to huddle them up and then send them back out for another sprint. He paced the field as they ran back and forth. The team's lack of focus was something that he said ultimately falls on him and on Penn State's leadership. \"Great teams, good teams don't do that,\" <mark>Franklin</mark> said of the sloppy practice. \"Obviously we've got a lot of growing up to do. It was unacceptable on every level. We'll never accept poor performances in the classroom, we'll never accept poor performances on the football field and we'll never accept poor behaviors in the community.\" Chemistry and leadership are often built during the offseason and <mark>Franklin</mark> was pleased that McSorley stepped up and displayed vocal leadership when getting on Dalton. While McSorley is the player teammates huddle around before games on Saturdays in the fall, his experience heading into his senior season should help the younger players understand what it takes in the spring to achieve success. <mark>Franklin</mark> hopes others continue to be more vocal, as well. If that means laying into a teammate for a lack of execution and then picking them right back up afterward, <mark>Franklin</mark> is all for it. \"I think he saw some things like I saw today that are unacceptable. Lack of focus, lack of finish, lack of mentality, lack of championship habits which is what we talk about all the time,\" <mark>Franklin</mark> said of McSorley. \"I would hope guys like Trace and <mark>Nick Scott</mark>, guys who've played a lot of football for us would speak up and hold themselves accountable and hold other guys accountable and call people out.\" I think that's one of our problems now in our society and especially specific to sports and specific to young people, everybody wants to be a leader by example and no one wants to be a vocal leader, \"<mark>Franklin</mark> continued.\" I don't care, in any organization, on any team you have to have some verbal leaders that are willing to speak up and tell people what they need to hear, not what they want to hear. \"<mark>Franklin</mark>'s message to the team after he huddled them after the second set of sprints didn't fall on deaf ears.\" We just need to pick it up, \"running back Miles Sanders said.\" We let this day slip away from us ....I think this is our 11th practice, so, yeah, we just let this day slip away from us. . \"Other observations from the 11th practice of the spring: • <mark>Franklin</mark> said defensive end Shane Simmons is now more than 250 pounds after being\" undersized \"last year during his redshirt freshman season. Shaka Toney's weight is also up as <mark>Franklin</mark> said Toney is\" finally getting bigger and stronger. \"<mark>Franklin</mark> said defensive end needs to be an area of strength while the defensive tackles mature. • Sanders spent extra time this offseason working on catching passes out of the backfield. How has Sanders looked this spring?\" The challenge is he'll make four people miss and go 80 [yards] and we're all like, \"Next play' because we've been spoiled with Saquon Barkley for the last couple years,\" <mark>Franklin</mark> said. \"I do think Miles is in that conversation in terms of what he's been able show and what he's been able to do so far.\" • Penn State worked a few scenarios toward the end of the practice, including one from late in the game with Ohio State. <mark>Franklin</mark> likes to go back and highlight different scenarios from crunch time from seasons past to reinforce why they're out there going through so many scenarios even on a dreary day in mid April. • Punter Blake Gillikin, whom <mark>Franklin</mark> said last week could also take on kickoff duties this season, did so Wednesday. Gillikin is also the team's No. 2 kicker for the spring and is also the holder. Realistically, punting, holding and kickoffs could all be on his plate this fall. • Redshirt freshman CJ Thorpe might be Penn State's top lineman in the run game, <mark>Franklin</mark> said. Thorpe's nastiness was praised last year on the scout team and has carried over to the spring. For a line that was criticized by <mark>Franklin</mark> for lacking that nasty streak at points last season, that's a development worth noting. However, Thorpe needs to improve in pass protection. \"I want us to play with that mentality, to play with that edge,\" <mark>Franklin</mark> said. • Fellow redshirt freshman O-lineman Des Holmes is excelling in pass protection and needs to continue improving in the run game, <mark>Franklin</mark> said. Both Homes and Thorpe are 315-plus pounds and got what <mark>Franklin</mark> called \"unbelievable\" reviews for their scout team work last season. • McSorley has been high on Dalton this spring, praising him just last week for his development. Penn State needs someone to step up at tight end, which perhaps was part of McSorley's momentary frustration. The post Penn State sloppy, full of teachable moments in 11th spring practice appeared first on Land of 10. Popular in Sports 1 2 3"}, {"articleID": "2018022614_00201182_W", "names": {"Antonio Conte": ["Q18621047", "Q26580", "Q30039019", "Q3700446"]}, "date": "2018-02-26", "url": "http://mufclatest.com/jose-mourinho-praises-manchester-united-for-the-team-effort-after-chelsea-victory-at-the-theatre-of-dreams/", "content": "Jose Mourinho praises Manchester United for the \"team effort' after Chelsea victory at the Theatre of Dreams February 26, 2018 Manchester United manager Jose Mourinho spoke about many aspects of the 2-1 victory over reigning Premier League champions, Chelsea at Old Trafford on Sunday. The defeat for the London club has seen them drop out of the top four in the league with Tottenham Hotspur beating Crystal Palace in the earlier kick-off on Sunday. United regained second place in the league after Liverpool took charge of the position for some 11 hours with United sitting level on goal difference but two points better off. United fell behind in the match after Willian broke behind United's defensive line and fired a shot diagonally past David De Gea. The lead for the visitors lasted just seven minutes after Romelu Lukaku scored the equaliser which was assisted by Anthony Martial. It was Lukaku's 22nd goal for Manchester United and his first against his former club. Perhaps those who operate Football Twitter will now be able to drop that\" Lukaku has not scored against a big club \"rubbish now? The match was won after Jesse Lingard replaced Martial in the 64th minute of the match and just 11 minutes later, the Academy graduate fired his 13th goal of the season, the eighth in the Premier League with a stunning header after Lukaku played the ball into the box. Lingard then celebrated by recognising the Black Panther, a recent release in the cinema. Mourinho spoke about the important result, his second victory over his former club at the Theatre of Dreams, speaking about how his side beat a very good team:\" I think we beat a fantastic team. For some reason, they were the champions last season. For some reason, they played the way they did against Barcelona. For some reason, they started the game so well as they started here. \"We beat a very good team and to beat a very good team, you need to be organised but you also need to have a humble spirit where everybody works, everybody fights, everybody tries to follow a game plan. I repeat, we beat a very good team.\" Mourinho then went into detail about how tight the match was. Last season, United won this fixture 2-0 after Ander Herrera man-marked Eden Hazard out of the game with both Herrera and Marcus Rashford scoring the goals. This game was not going to be like that, especially after Willian opened the scoring 13 minutes before the end of the first half. The equaliser scored by Lukaku opened the game up and United looked more likely to score again in the second half, which they did. Speaking about the tightness of the game, Mourinho said: \"They started very well, it's as simple as that. When Chelsea hit the posts, I was looking to my players and I was thinking\" what could we do?' or \"who can I blame?' but it was so beautifully played that I had nothing to say. They are a very good team--they have big routines of their football. They have a fantastic dynamic of the way they project the wing-backs.\" I was trying to find a way for my players to be dangerous in the interior football because through the sides Chelsea are very, very strong, so we found a way to play against them where we didn't concede much. \"I think we had a good control of Eden [Hazard], Willian, of course, is an amazing player and in that action [his goal] he killed us, but we took progression of the game, we had more and more control of the game without creating lots of chances because we didn't but they also didn't. That's the way I was expecting the game to be when I spoke with you before the game--a tight game.\" Scott McTominay started the match, his third in a row for United. Mourinho had tasked the 20-year-old to mark Hazard, which he did to the best of his abilities, also getting involved in other aspects of the game. Many criticise United's Academy players, even so-called United supporters, suggesting they are not good enough to play in the team. There seems to be an obsession with having world class players when that is not necessary for every position in the team. Manchester United are built on foundations of youth and that continues. Mourinho, speaking about McTominay, said: \"I think he's a fantastic player--a player that is what I call the modern midfield player, which in the end is a bit of what the top midfield players of the past were. They can do everything. The only thing he is not doing yet is scoring goals, which he can. But because I'm giving him different jobs, he's not yet free to do that.\" We are starting from the basics and the basics he's doing wonderfully well. I think he can also score goals--he has that talent. In pre-season, we understood that. But we are adapting him to his multi-functionality and he's doing fantastic jobs for us, like he did in Sevilla against Ever Banega and today against Eden, so I'm really happy with the player. \"Mourinho closed with the great team effort which was shown in the victory. The Portuguese manager singled out praise to Nemanja Matic for being phenomenal, Paul Pogba for playing a fantastic game in the midfield--yet the media will continue to talk about this rift and the fact Pogba will leave in the summer. He then stated that he could speak about his central defenders; Victor Lindelof, Chris Smalling, and Eric Bailly, who played the final nine minutes or so. Also talking about his attacking players and the mission Alexis Sanchez had. The United manager also mentioned McTominay again also talking about the big effort of the team as a collective. Mourinho, presumably after having been asked about the possibility of the match being a draw and Chelsea manager <mark>Antonio Conte</mark> suggesting a draw would have been a fair result, the Portuguese agreed that is was a possibility emphasising on the fact that United were much more confident in the second half of the game. Mourinho concluded by saying:\" I don't like to individualise--I think [Nemanja] Matic was phenomenal, I think [Paul] Pogba played a fantastic game in our midfield. I could speak about my central defenders too and the guys in attack--the mission Alexis had, to be the third attacking player but at the same time the fourth midfield player to try to cover the area in front of Scott. I think everyone made a big effort. \"Could the result have been a draw? Yes, it could. But I think in the second half we were more confident, we felt more confident with the defensive base and I think if somebody deserved a victory it was us. But, if you were to say a draw, I would accept that. The important thing for us is that we beat a fantastic team.\" United will have a break of a week before they play a match with the Premier League encounter with Crystal Palace at Selhurst Park being played on Monday 5th March 2018, which will kick-off at 20:00 GMT and will be shown live in the United Kingdom on Sky Sports Premier League HD. United will be seeking another win in the league to cement their standing in second place, which could see them fall to third again in the league by the end of the weekend with Liverpool just two points behind United, entertaining Newcastle United at Anfield. United will face their North West rivals in the Premier League at Old Trafford on Saturday 10th March 2018, kick-off 12:30 GMT--another big match they must win this season. The reverse fixture at Anfield earlier in the season resulted in a 0-0 draw. If United are intent on finished in second place this season, beating those around them is what will be needed. United have already been beaten by Spurs, so the victory over Chelsea is half-way there with just Liverpool to silence once again in the coming weeks. Advertisements First Team, Managers, Opinion 0 July 6, 2017 This upcoming season is crucial to both Manchester United staffers and players. Last season the squad showcased its ability, though it was fairly inconsistent. One of the...Read more First Team, Live Blog, Managers, News, Opinion, Transfer Rumours 0 July 26, 2016 Manchester United are days away from what would have been their fourth pre-season friendly this season, against Galatasaray in Gothenburg, Sweden. Zlatan Ibrahimovic has...Read more First Team, Managers, News, Opinion 0 March 16, 2017 Manchester United beat FC Rostov in the second leg of the round of 16 1-0 at Old Trafford in the UEFA Europa League, winning 2-1 on aggregate. United now find themselves...Read more Academy, First Team, Live Blog, Managers, News, Opinion 0 June 23, 2016 Manchester United have been linked to many players this summer, with Jose Mourinho looking to make his team his own this summer. Zlatan Ibrahimovic has been tipped to joi...Read more"}, {"articleID": "2012110715_00111796_W", "names": {"Mark Wagner": ["Q18159066", "Q23664922", "Q6770185"]}, "date": "2012-11-07", "url": "http://istockanalyst.com/article/viewarticle/articleid/6129360", "content": "veterans and active duty military to receive veterans day discount at walgreens on sunday, nov. 11 to honor and celebrate the service and commitment of the nation's military heroes, walgreens (nyse: wag) (nasdaq: wag) is offering a discount to all veterans and active duty military in support of veterans day. on sunday, nov. 11, they will receive 15 percent off eligible store items and 20 percent off walgreens and w brand products with a valid military id or proof of service at any walgreens and duane reade drugstore nationwide. \"to our employees who are veterans and veterans across this great nation, we want to thank you for your service, sacrifice and courage,\" said <mark>mark wagner</mark>, walgreens president of operations and community management. \"we are grateful for their contributions and want to offer our appreciation and respect to all who have served.\" about walgreens as the nation's largest drugstore chain with fiscal 2012 sales of $72 billion, walgreens (www.walgreens.com) vision is to become america's first choice for health and daily living. each day, walgreens provides more than 6 million customers the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice in communities across america. walgreens scope of pharmacy services includes retail, specialty, infusion, medical facility and mail service, along with respiratory services. these services improve health outcomes and lower costs for payers including employers, managed care organizations, health systems, pharmacy benefit managers and the public sector. the company operates 8,030 drugstores in all 50 states, the district of columbia and puerto rico. take care health systems is a walgreens subsidiary that is the largest and most comprehensive manager of worksite health and wellness centers and in-store convenient care clinics, with more than 700 locations throughout the country. insiders bought mead johnson nutrition company (mjn), should you? zillow (nyse: z): sometimes it's important to remember these guys are \"empire builders\" ? - paa research veterans and active duty military to receive veterans day discount at walgreens on sunday, nov. 11 walgreens collecting red cross donations at stores across all 50 states walgreens introduces the \"ology (tm)\" brand of healthy home products zacks investment research, and commentary, news and press releases provided by yellowbrix and quotemedia. all information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. istockanalyst.com is not an investment adviser and does not provide, endorse or review any information or data contained herein. the blog articles are opinions by respective blogger. by using this site you are agreeing to terms and conditions posted on respective bloggers' website. the postings/comments on the site may or may not be from reliable sources. neither istockanalyst nor any of its independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. you are solely responsible for the investment decisions made by you and the consequences resulting therefrom. by accessing the istockanalyst.com site, you agree not to redistribute the information found therein."}, {"articleID": "2019070415_00077712_W", "names": {"Frank Lampard": ["Q41533", "Q461633"]}, "date": "2019-07-04", "url": "https://www.stuff.co.nz/sport/football/world-game/114010566/chelsea-hires-former-midfielder-frank-lampard-as-manager.html", "content": "Chelsea hires former midfielder <mark>Frank Lampard</mark> as manager 23:02, Jul 04 2019 Facebook Twitter Whats App Reddit Email <mark>Frank Lampard</mark>, Chelsea's all-time record scorer and one of its greatest ever players, has returned to the club as its 12th manager in 16 years under Roman Abramovich's ownership. The former Chelsea midfielder left second-tier club Derby, where he came close to securing promotion to the Premier League in his first season in management. <mark>Lampard</mark>, who scored 211 goals for Chelsea from 2001-14, won every major honour at the club including three Premier League titles and the Champions League. AP <mark>Frank Lampard</mark> salutes during a lap of honour during the English Premier League soccer match between Chelsea and Swansea City at Stamford Bridge stadium in London two years ago. He now returns to Chelsea as manager. \"Everyone knows my love for this club and the history we have shared,\" <mark>Lampard</mark> said in a Chelsea statement announcing his arrival. \"However, my sole focus is on the job in hand and preparing for the season ahead. READ MORE: * Chelsea close in on <mark>Frank Lampard</mark> * All Whites to play Lithuania in rare outing * Talay brings Cameron Devlin over from Sydney\" I am here to work hard, bring further success to the club and I cannot wait to get started. \"<mark>Lampard</mark> is the first English coach to manage Chelsea on a full-time basis since Glenn Hoddle in 1996 - and the first Englishman hired by Abramovich to control the team since his takeover in 2003. MIKE HEWITT/GETTY IMAGES <mark>Frank Lampard</mark> celebrates after scoring for Chelsea during an FA Cup semifinal against Tottenham Hotspur in 2012. He replaces Maurizio Sarri, who lasted only one tumultuous year at Chelsea before returning to his homeland in Italy to coach Juventus. Sarri secured not only a third-place finish in the Premier League but also ended his reign by winning the Europa League in May. The 41-year-old <mark>Lampard</mark>, who has signed a three-year deal, will have to contend with an inability to strengthen the squad because Chelsea is subject to a transfer ban which covers the two trading periods across the upcoming season. United States winger Christian Pulisic and Croatia midfielder Mateo Kovacic have been signed up in advance but they will be the only arrivals at Stamford Bridge, meaning <mark>Lampard</mark> might have to call upon youth-team players during the early part of his tenure - something previous Chelsea managers have often been reluctant to do. If anyone knows about the highs and lows of Stamford Bridge, it is <mark>Lampard</mark>.\" <mark>Frank</mark> possesses fantastic knowledge and understanding of the club and last season he demonstrated he is one of the most talented young coaches in the game, \"said Chelsea director Marina Granovskaia.\" After 13 years with us as a player, where he became a club legend and our record goalscorer, we believe this is the perfect time for him to return and are delighted he has done so. \"In its statement, Chelsea praised <mark>Lampard</mark>'s\" dedication to improvement, versatility and reading of the game. \"The last former Chelsea player to take over as coach was Roberto di Matteo, who won the Champions League and FA Cup in 2012 with <mark>Lampard</mark> in his squad. He was fired after only eight months in charge. <mark>Lampard</mark>'s first two competitive games as Chelsea manager will be against Manchester United, on Aug. 11 in the opening weekend of the Premier League, and Liverpool, in the UEFA Super Cup on Aug. 14 in Istanbul. AP Facebook Twitter Whats App Reddit Email"}, {"articleID": "2010012710_00194816_W", "names": {"Jay Williams": ["Q1684380", "Q25189164", "Q6167344", "Q6167349", "Q6167354"], "Tim Ryan": ["Q10381179", "Q3528685", "Q513960", "Q7804212", "Q7804214", "Q7804215", "Q7804218", "Q7804221"]}, "date": "2010-01-27", "url": "http://amfix.blogs.cnn.com/2010/01/27/angry-voters-sound-off-on-stimulus/", "content": "carol costello - correspondent, cnn's american morning how angry are some voters in youngstown, ohio? ford to new york: drop dead \"? it was october of 1975. president ford was refusing to bail out financially struggling new york city. voters were furious when the president said he'd veto any bill that aimed to help out the city with its budget woes. he suggested bankruptcy as a better option for the nation's largest city. flash forward to 2010. youngstown, ohio, a much smaller city, is also struggling mightily with its economy. so we couldn't help but recall the daily news when we saw this headline recently from the online edition of the vindicator, a newspaper based in youngstown:\" youngstown's once thriving manufacturing base has disintegrated. the city has been in an economic black hole for decades. it's hard to miss the abandoned buildings and foreclosed homes. so, when the recovery act, also known as the stimulus bill, was signed by president obama, cities like youngstown were hopeful that they'd get a big enough piece of the pie to help them through their financial troubles. as stimulus funds were distributed to states and localities throughout the year, youngstown discovered that it had been turned down on one of its requests, funding through hud's (department of housing and urban development) \"neighborhood stabilization program.\" that $2 billion program is designed to dole out money to cities so that they can rehabilitate abandoned neighborhoods. the hud denial shocked the eastern ohio community. \"it literally defies belief and explanation,\" youngstown's mayor <mark>jay williams</mark> told vindy.com. u.s. rep. <mark>tim ryan</mark>, a democrat whose district includes youngstown, told vindy.com he was \"stunned...for us to be this blatantly shortchanged is outrageous.\" we decided to go to youngstown to find out more. voters there are angry. mickey wolf, jobless for a year, told us, \"they ask us for their votes and they come here with a lot of promises...it's just frustrating we are in this predicament.\" he's talking about barack obama's 14 campaign visits to ohio in 2008, and that includes a pair of stop-overs in youngstown. mayor <mark>williams</mark> was angry too: \"there is a frustration that washington just isn't getting it.\" but we also discovered there is more here than meets the eye. while youngstown was turned down for those rehabilitation funds, it did receive stimulus funding from other sources. jared bernstein, who is vice president biden's top economic adviser, says youngstown already has received $52 million in stimulus funds. comments are moderated by cnn, in accordance with the all week, cnn examines the stimulus and looks at one of the greatest areas of concern for americans: the economy. wednesday on american morning, can a $5.5 million resort town restoration project be a good use of stimulus aid? we find out why one woman is grateful the government is spending the money. authorities pushing to clear earthquake-relief bottlenecks in haiti continue to work friday to improve the flow of relief supplies at the south pier in port-au-prince. watch american morning tuesday for the latest reports live from the scene. learn more about the many organizations providing emergency aid and relief to victims of the devastating earthquake in haiti and find ways you can get involved by visiting impact your world. we're tracking three recruits from their final days as civilians through to deployment. it's an unprecedented look inside the life of a soldier. cnn's jason carroll reports. @ amfix: \"angry voters sound off on stimulus\" - @ christineromans: @ bcathey people who get very excited about numbers, facts and technology and can't stop talking about them, well, they are geeking out @ amfix: \"paying the cost to be your own boss\" - @ christineromans: just found out there is a hashtag #geekingout. i am, for the record, geeking out."}]