[{"date": "2014-07-16", "url": "http://www.talkingretail.com/products-news/alcohol/new-marketing-campaign-blossom-hill/", "content": "New marketing campaign from Blossom Hill Blossom Hill is launching a £ 2.1 m marketing campaign inviting consumers into the \"Wonderful World of [...] Wall's unveils two hour ice cream delivery service for London retailers Blossom Hill is launching a £ 2.1 m marketing campaign inviting consumers into the\" Wonderful World of Blossom Hill'. The activity, which will focus predominately on the new Blossom Hill Sun-Kissed Red & White range, includes TV, digital and cinema advertising, sampling in key cities nationwide and the launch of a new website. The campaign launched with a Blossom Hill TV ad on the 14th July 2014, designed to communicate the brand's new proposition, showcase its extensive range and highlight the new look packaging. A second TV ad the following week supports the new Blossom Hill Sun-Kissed Red & White range. The evocative creative features a series of strong, vibrant images of fresh fruit teamed with playful music to communicate the fun, fruity flavours of the brand and its new Sun-Kissed Red & White range. Digital support will come from the launch of the Blossom Hill's new website and activity on its popular Facebook page - www.facebook.com/blossomhill. Kevin Chinn, marketing director at Percy Fox & Co. said: \"We are incredibly excited to invite our loyal consumers in to experience the\" Wonderful World of Blossom Hill', whilst enticing new shoppers to try the innovative flavours and tastes that we know they will love. \"The campaign will showcase the vibrant new look and feel of the brand and is set to reach a substantial percentage of our target audience, delivering up to four opportunities for our consumers to view it through relevant mediums. Feedback from independent market research on the TV ad has been exceptional, with it hitting the top 10% of the best performing ads. The activity demonstrates our commitment to supporting our trade partners who will be able to capitalise on sales through the TV exposure and additional channel executions .\" Independent Retail News Retailer Newsletters Specially Selected Partner E-mails Sitemap © 2014 Copyright TalkingRetail.com. Metropolis Business Publishing, 6th Floor Davis House, 2 <mark>Robert Street</mark>, Croydon, CR0 1QQ", "articleID": "2014071618_00009174_W", "names": {"Robert Street": ["Q12718024", "Q15993540"]}}, {"date": "2014-07-16", "url": "http://www.newschannel9.com/news/top-stories/stories/cdc-mishaps-could-have-been-deadly-11604.shtml", "content": "Updated: Wednesday, July 16 2014, 08:08 AM EDT The government agency tasked with protecting the public from dangerous diseases has some explaining to do after an anthrax scare, a bird flu mix-up and an unprecedented smallpox discovery. The U.S. Centers for Disease Control and Prevention has shuttered two of its labs as officials step back to investigate recent incidents and review overall safety procedure for handling dangerous pathogens. None of the mistakes caused any illnesses or deaths, thankfully. But experts say the lapses could have been deadly - even if the viruses didn't fall into the wrong hands. Smallpox What happened: Earlier this month, researchers were surprised to discover six vials of variola--the virus that causes smallpox--when cleaning out a cold storage room at NIH headquarters in Bethesda, Maryland. Since smallpox is considered a bioterrorism threat, only two labs in the world have stockpiles: One at the CDC's Atlanta headquarters and another at the VECTOR Institute in Russia. In other words, the virus should not have turned up in an old box in Bethesda. No one at the facility knew the smallpox vials were there, and the building was not equipped to handle viruses that require the most stringent safety and security measures like smallpox, anthrax and Ebola. Officials have since learned that two of the six vials still contained samples of live, infectious virus, which may date back to the 1950s. No one was infected, but officials are investigating the matter. What could have happened: Since the virus was alive in two of the vials, there was a chance it could have spread, experts say. \"The smallpox vials caused no harm sitting in a box,\" said ABC News' chief health and medical editor Dr. Richard Besser. \"Had the box been crushed and the virus escaped, people in the immediate vicinity could have been infected .\" And since these people wouldn't have known that they were exposed to the virus, they might have spread it to others, said Dr. William Schaffner, chair of preventive medicine at Vanderbilt University Medical Center in Nashville, Tennessee, and past president of the National Foundation for Infectious Diseases. \"It would not have immediately been diagnosed,\" said Schaffner, explaining that most doctors have never seen smallpox, which was eradicated in 1979. \"So there would have been some opportunity for perhaps some limited spread around these people .\" People are no longer vaccinated for it and therefore don't have immunity, Besser said. Once health officials realized smallpox was at fault for the illnesses, however, they would begin vaccinating people who had been in contact with those who were infected. Another consequence of the lab blunder? Public panic. \"We would have immediately been worried about a bioterrorism event,\" said Schaffner. \"Given that this was in Washington, there would have been hullabaloo, eight-point headlines in The New York Times, The Washington Post .\" Anthrax What happened: At least 84 lab workers at the CDC headquarters in Atlanta were exposed to live anthrax spores in June, according to the CDC. The employees were not using proper safety guidelines for dealing with the lethal bacteria because the anthrax was supposed to have been \"inactivated\" and therefore not infectious, the agency said. It wasn't until the samples were gathered to be destroyed in an incinerator that researchers discovered the live bacteria. Since anthrax symptoms can take two months to appear, the exposed workers are being monitored and have been offered vaccines and antibiotics. The CDC is investigating the matter and the lab and hallways of the facility have been decontaminated. According to a congressional memo released last week, the anthrax was stored in an unlocked refrigerator in an unrestricted hallway. The memo also stated that disinfectants were expired, \"germ materials\" were transported between labs in Ziplock bags, and workers exposed to anthrax didn't get medical examinations until five days after knowledge of the exposure. What could have happened: The exposed workers could have inhaled the bacterium and become infected, Besser said. \"As many as 45 percent would have died, even if their illness had been recognized promptly and treated with the right antibiotics,\" he said. \"Untreated anthrax pneumonia is fatal in 85 percent of infected people .\" Since anthrax is not spread from person-to-person, it would not have caused a widespread outbreak. But the incident would have spread fear, according to Schaffner. Bird flu What happened: A CDC flu sample was accidentally contaminated with a deadly strain of bird flu and sent to a lab run by the U.S. Department of Agriculture. The USDA discovered the contamination in May, but it wasn't reported to top management until last week, according to the Associated Press. What could have happened: Avian flu doesn't spread as easily as other strains of the virus, but close contacts of exposed workers would have been at risk, according to Schaffner, who added that the infection can be fatal. Besser was also concerned about the bird population. \"The strain of bird flu mistakenly sent to the USDA is highly lethal in birds,\" he said. \"Release of this strain into American poultry flocks could have been devastating to that industry .\" Had that happened, people who had close contact with sick birds could also have become infected flu strain, Besser said. The Good Life Celebrating the events, adventures and activities that represent \"The Good Life\" in the NewsChannel 9 viewing area. Come Road Trippin' with us and see all the great sites in your area! These are the latest School and Business Closings reported to NewsChannel 9. If you see errors or need to add a school or business, call 423-757-7320. US retail sales tick up just 0.2 percent in June WASHINGTON (AP)--U.S. retail sales increased slightly in June, a sign that consumers remain cautious despite steady job gains this year. WEST PALM BEACH, FL--(Marketwired)--03/21/14--Companies that pride themselves on being eco-friendly may have conflicted ideas between marketing with ad specialties and maintaining their green LOS ANGELES (AP)--Sometimes people don't take stalking of Hollywood stars or musicians seriously--but the case in which a man got into Sandra Bullock's house indicates just how scary such incidents can be. HILLARY RODHAM CLINTON-JON <mark>STEWART</mark> NEW YORK (AP)--<mark>Jon Stewart</mark> jokes no one cares about Hillary Rodham Clinton's book, they just want to know if she's running for president. IN THE NEWS: HOUSE MOVES TO MAINTAIN BAN ON TAXING INTERNET ACCESS 7:30 Jeopardy 8:00 The Middle 8:30 The Goldbergs", "articleID": "2014071619_00054012_W", "names": {"Jon Stewart": ["Q17163472", "Q211987", "Q43392128", "Q6271634"]}}, {"date": "2014-07-17", "url": "http://texasgopvote.com/issues/restore-families/democrats-declare-war-catholic-church-006877", "content": "Palin And West Are Wrong Calling For Impeachment Before November We Will Not Conform LIVE: Making Common Core History-A <mark>Glenn Beck</mark> Event Sen. Cruz: Israel's fight against radical Islamic terrorism, and the Iranian regime that supports it, is our fight as well The Democrats have waged war on the religious liberty, particularly the Catholic Church. Forty-six Senate Democrats are cosponsoring legislation to reverse the Supreme Court's Burwell v. Hobby Lobby decision and force businesses and religious non-profits, such as the Little Sisters of the Poor, to authorize abortion-inducing drugs for employees or pay millions in faith fines. The bill that is being voted on this floor, if it were adopted, would fine the Little Sisters of the Poor millions of dollars unless these Catholic nuns are willing to pay for abortion-producing drugs for others. When did the Democratic Party declare war on the Catholic Church? Let me make a basic suggestion. If you're litigating against nuns, you have probably done something wrong, and the Obama Administration is doing so right now. Mr. President, drop your faith fines. Mr. Majority leader, drop your faith fines. To all of my Democratic colleagues, drop your faith fines. Get back to the shared values that stitch all of us together as Americans. Faith fines have no place in our democracy. President John F. Kennedy, in an historic speech to the nation said, \"I would not look with favor upon a president working to subvert the first amendment's guarantees of religious liberty .\" Where are the Kennedys today? Does any Democrat have the courage to stand up and speak for the First Amendment today? Does any Democrat have the courage to stand up and speak for the constitutional rights of practicing Catholics? Does any Democrat have the courage to stand up and speak for the Little Sisters of the Poor? Do any Democrats have the courage to listen to the Catholic Conference of Bishops and speak for religious liberty?", "articleID": "2014071803_00006764_W", "names": {"Glenn Beck": ["Q21213245", "Q310618"]}}, {"date": "2014-07-17", "url": "http://www.kspr.com/news/politics/hillary-clinton-says-growing-awareness-points-to-separatists-in-ukraine-air-disaster/21051736_27007430", "content": "\"If there is evidence pointing in that direction, the equipment had to have come from Russia,\" the former secretary of state and possible 2016 Democratic presidential candidate said. \"There is a great deal of concern that not only was a civilian plane shot down but what this means about the continuing conflict in eastern Ukraine and the role that Russia is playing,\" she added. Her comments came as part of a sweeping interview with <mark>Charlie Rose</mark> on PBS and Bloomberg. Malaysia Airlines Flight 17 was carrying nearly 300 passengers and crew when it crashed in a rebel-controlled area of eastern Ukraine. The disaster prompted swift accusations from Ukrainian officials that \"terrorists\" shot it down. U.S. intelligence has also concluded that the plane was shot down. But it hasn't pinpointed who was responsible. Clinton has made tough talk against Russian President Vladimir Putin a staple of her public remarks on foreign policy. She told <mark>Rose</mark> that if Russia is held culpable, Europe should look to toughen its own sanctions over its incursion into Ukraine this year and accelerate efforts to break away from its use of Russian energy. \"Europeans have to be the ones to take the lead on this,\" Clinton said. \"It was a flight from Amsterdam to Kuala Lumpur over European territory. There should be outrage in European capitals .\" Putin is blaming Ukraine's military campaign against the separatists for the disaster.", "articleID": "2014071807_00000869_W", "names": {"Charlie Rose": ["Q1064593", "Q715515"]}}, {"date": "2014-07-19", "url": "http://bostonherald.com/sports/red_sox_mlb/mlb_coverage/2014/07/burnett_cant_solve_braves_in_messy_start", "content": "ATLANTA - A.J. Burnett was visibly upset with himself as he walked to the dugout after the last out of the fifth inning. It was easy to see why. \"Six runs in five innings pretty much nails it on the head,\" Burnett said. \"I was in counts where I should have made pitches and I didn't. That's the bottom line .\" Burnett gave up nine straight two-out hits, and the Philadelphia Phillies failed to score after the sixth in a 6-4 loss to the Atlanta Braves on Friday night. Jason Heyward homered and drove in two runs, and Andrelton Simmons had two RBIs for the Braves, who won their third straight game to take a one-game lead over Washington in the NL East. Last-place Philadelphia dropped 11 games behind Atlanta after losing its third straight. \"Not the start we wanted for the second half,\" Phillies manager Ryne Sandberg said. \"We had some good at-bats, though. I felt good jumping out with the two runs early. They came right back with four runs .\" The game was played in a steady drizzle, but the rain had nearly stopped when Braves closer Craig Kimbrel earned his 30th save in 34 chances. He got Marlon Byrd on a groundout and struck out Grady Sizemore and Cody Asche. Ervin Santana (8-6) gave up six hits, three walks and four runs - three earned - in six innings to win for the third time in four starts. He struck out one. Burnett (6-9) allowed six runs, 10 hits - the last nine with two out - and one walk in five innings. He had five strikeouts. \"Everything was up, man, everything was up,\" Burnett said. \"I was off. Heyward hit a changeup, and the curveball was up. A few innings in the middle, I got it where I wanted to, but I was inconsistent, and you can't pitch against this club and be inconsistent .\" The Phillies led 2-0 in the second on Asche's sacrifice fly and Cameron Rupp's RBI single, but they trailed 4-2 in the bottom half after Heyward hit his ninth homer, B.J. Upton had an RBI single, and Simmons drove in two runs with a double. Atlanta made it 6-2 in the fifth on RBI singles by Heyward and Tommy La Stella. Philadelphia cut the lead to 6-4 in the sixth. <mark>Jimmy Rollins</mark> reached on first baseman Freddie Freeman's fielding error and moved to third on Chase Utley's double. Both runners scored on Ryan Howard's broken-bat, two-run bloop single. <mark>Rollins</mark> led off the eighth with a walk against Jordan Walden, the third Atlanta pitcher, but he was thrown out at second base on Utley's strikeout. Heyward, the right fielder, ended the inning by charging in to make a diving catch of Howard's liner. \"In that situation, it was only a two-run game,\" Heyward said. \"If they keep having (at-bats), maybe they put up another run or two. Defense is going to win the game at the end of the day, but it's good to score runs, and it got us going a little bit .\" $ave on Boston Herald Home Delivery For back copy and collectible issue information please call 617-619-6265. Click here for Celtics, Patriots and Red Sox, and Bruins back copies Mass Literacy © Copyright by the Boston Herald and Herald Media.", "articleID": "2014071911_00012341_W", "names": {"Jimmy Rollins": ["Q15059522", "Q601982"]}}, {"date": "2014-07-20", "url": "http://tvnz.co.nz/world-news/ukraine-rebels-likely-downed-passenger-jet-us-6033203", "content": "Ukraine rebels likely downed passenger jet - US The United States is putting the likely blame for the downed Malaysian passenger plane on Ukraine separatists who had Russian military help. Secretary of State <mark>John Kerry</mark> is citing a mix of US intelligence and social media reports as evidence that he says \"obviously points a very clear finger at the separatists .\" Mr <mark>Kerry</mark> says there's been a major flow of arms and weapons crossing the Russian border over the past month to help the Ukrainian rebels who are fighting to break away in the east from the central government. Facebook Join the debate and get the latest updates from ONE News. TwitterRolling Stories and updates from the ONE News team. Mobile Devices ONE News is available on iPhone, iPad, and as a mobile site. Email Newsletter Sign up to get the news delivered direct to your inbox.", "articleID": "2014072022_00043655_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2014-07-21", "url": "http://www.expressandstar.com/sport/wolverhampton-wanderers-fc/2014/07/21/sam-ricketts-targets-promotion-with-wolves/", "content": "Sam Ricketts targets promotion with Wolves Wolves kick off in 20 days' time hoping to use the momentum that saw them win 17 out of their last 21 games in League One to propel them to another promotion push under Kenny Jackett. But, while convinced Wolves can be among the frontrunners, Ricketts expects it to be a tougher ride in the coming season than last term. \"Promotion was the goal last year and it's the same again this year,\" said the skipper. \"It's a big ask but that's where our thoughts are and this is a big opportunity for a young side .\" Clearly I hope I'm wrong, but getting back into the Championship, it's unlikely we're going to go on such a long unbeaten run or winning streak. \"If you could do that in the Championship you could run away with the league. You have to be realistic and think we'll probably lose more games than last year .\" It's such a tight league - Reading got promoted one year having been bottom in October-November time. \"It's about broadening our horizons and realising if we lose a couple of games, we shouldn't get too down, and equally if we win two or three, we haven't\" made it'. \"Ricketts insists Wolves will continue to play stylish football in what is considered to be a more physically unforgiving league .\" We want to play football and we want to make it exciting to watch, \"he said .\" It's not going to be as easy for us to control games. \"Meanwhile, Wolves have been linked with out-of-favour Hull City striker Nick Proschwitz. Wolves captain Sam Ricketts today told fans to expect a Championship battle but believes promotion is a real target. Wolves boss Kenny Jackett today challenged Bakary Sako to hit double figures next season as he warned his wide men the pressure is on to find their scoring boots. Sam Ricketts today hailed Wolves' trip to Ireland and reckons it has brought the squad even closer together. Sheffield Wednedsday have been in touch with Wolves over <mark>Roger Johnson</mark> again - but any transfer remains up in the air.", "articleID": "2014072116_00019015_W", "names": {"Roger Johnson": ["Q372273", "Q54670967", "Q7358411", "Q7358413", "Q7358414"]}}, {"date": "2014-07-23", "url": "http://chicagotribune.com/news/nationworld/chi-israel-palestinian-conflict-20140723,0,4885387.story", "content": "International Committee of the Red Cross warns of critical water shortage facing thousands in Gaza within days. <mark>Paul Chapman</mark> reports Video: Gaza fires rockets towards Israel as world pleads for truce Astronaut tweets photo of Israel and Gaza rocket fire from space GAZA/JERUSALEM - Hamas leader Khaled Meshaal called on Wednesday for a temporary truce to allow humanitarian relief into Gaza, but said his group would keep fighting against an Israeli offensive and would not agree to a more lasting ceasefire without full negotiation of terms. \"We are very interested to have a humanitarian truce as we did last Thursday. We need the calm for a few hours to evacuate the wounded and assist in the relief...This means a real truce backed by a real relief program offered to the people of Gaza,\" he said at a news conference in Qatar. The leader of the Islamist group, which controls Gaza, asked for the international community to help bring medicine, fuel and other supplies into the territory. However, he said that any more permanent ceasefire could only come about after Israel ended its siege, and could only be implemented after it had been fully negotiated. \"Everyone wanted us to accept a ceasefire and then negotiate for our rights, we reject this and we reject it again today,\" he said. He said that despite efforts to broker a more lasting ceasefire, there had been no breakthrough. In a blow to Israel's economy and image, American aviation authorities extended a ban on U.S. flights to Tel Aviv for a second day, spooked by rocket salvoes out of the Strip, with many other global airlines also avoiding the Jewish state. Adding to the pressure on Israel, U.N. High Commissioner for Human Rights Navi Pillay said there was \"a strong possibility\" that it was committing war crimes in, where 687 Palestinians, mostly civilians, have died in the fighting. She also condemned indiscriminate Islamist rocket fire out of and the United Nations Human Rights Council said it would launch an international inquiry into alleged violations. Israel denied any wrongdoing. \"Get lost,\" Justice Minister Tzipi Livni said on her Facebook page in response to the probe. Kerry met Palestinian President <mark>Mahmoud Abbas</mark>, U.N. Secretary General Ban Ki-moon and a grim-faced Netanyahu on Wednesday. He was due to return later in the day to Egypt, which shares a border with and has mediated with Islamist Hamas. \"We have certainly made some steps forward. There is still work to be done,\" said Kerry, on one of his most intensive regional visits since the peace negotiations he had brokered between Netanyahu and <mark>Abbas</mark> broke down in April. Kerry has been working through <mark>Abbas</mark>, Egypt and other regional proxies because the United States, like Israel, shuns Hamas as a terrorist group. Hamas brushed off the U.S. diplomat's appeal, saying it would not hold fire without making gains. \"Our interest and that of our people is that no agreement should be made before the conditions of factions of resistance are met,\" Hamas spokesman Sami Abu Zuhri said. Israel launched its offensive on July 8 to halt rocket salvoes by Hamas and its allies, which have struggled under an Israeli-Egyptian economic blockade on and angered by a crackdown on their supporters in the nearby occupied West Bank. After aerial and naval bombardment failed to quell the outgunned guerrillas, Israel poured ground forces into the Strip last Thursday, looking to knock out Hamas's rocket stores and destroy a vast, underground network of tunnels. \"We are meeting resistance around the tunnels...they are constantly trying to attack us around and in the tunnels. That is the trend,\" Israeli military spokesman Lieutenant-Colonel Peter Lerner said on Wednesday. MILITARY LOSSES RISE Israel announced that three of its soldiers were killed by explosive devices on Wednesday, lifting thearmy death toll to 32. Three civilians have also died in rocket attacks out of, including a Thai laborer hit on Wednesday. The military says one of its soldiers is also missing and believes he might be dead. Hamas says it has captured him, but has not released a picture of him in their hands. register to participate. We filter comments for adherence to our", "articleID": "2014072404_00069428_W", "names": {"Mahmoud Abbas": ["Q10515624", "Q127998", "Q45193693"], "Paul Chapman": ["Q16148201", "Q3497115", "Q7149781", "Q7149783"]}}, {"date": "2014-07-24", "url": "http://economictimes.indiatimes.com/news/international/world-news/Russia-pressures-Ukraine-not-to-sign-European-Union-association-pact/articleshow/38937269.cms", "content": "\"If people in India can get donkeys married to get rains, why won't they call us?\" said <mark>Arvind Sharma</mark> who works for a company in field of cloud seeding. Government plans to import onions to prevent further spike in prices Hot Gadgets Shaping Our Digital Life \"Russia trained, equipped rebels who shot down MH17' The United States & Ukraine have blamed Moscow & Russia-backed separatists for the tragic incident that killed all 298 people on board Malaysia Airline MH17. Malaysian Airlines crash has strong echoes of 1983 Korean tragedy\" Thanks for murdering my child,' father tells Putin & plane attackers Ties with Israel behind no Gaza resolution? Many BJP leaders have links with Israel. PM Modi visited Tel Aviv as the chief minister of Gujarat, which has old diamond trade ties with Israel. Israel faces difficult choice in Gaza conflict: Should it halt invasion or not? SA Aiyar: How Modi can help clean up economic mess Modi said that for every new law, we should abolish 10 old laws, showing a deep insight into the current rot. India needs a gigantic surgical operation. A PM's Soliloquy: What stalls India from bringing about \"that' change A jobless future awaits us, no matter what the government might do What prompted PM Modi to postpone his Japan trip Modi was not satisfied with preparations by the various departments and therefore decided to visit Tokyo either in August or Sept for a substantive visit. The decision has been conveyed to NDA ministers informally. Singh will also occupy the seat next to PM and was appointed BJP's deputy leader in Lok Sabha. Assam Congress leaders seek strict action against Himanta Biswa Sarma Here's why D Subbarao will not take up a finance job\" If I take up anything in finance, I would be paid disporportionately for my past designations rather than what I do, \"says former RBI Governor D Subbarao. Tech may soon achieve what decades of bank nationalisation couldn't After poll defeat, AAP leader Kumar Vishwas turns into a much in demand celebrity Reserve Bank of India to identify six systemically important banks Ill prepared government departments prompt Narendra Modi to postpone July trip to Japan Markets tomorrow: Stocks trading ideas by experts Markets tomorrow: Stocks trading ideas b.. . Insight: Railways' challenging task of building rail links in J & K Kiev could face a total ban on its food exports. Prime Minister <mark>Dmitry Medvedev</mark> said Moscow was holding talks with the EU and its partners in a customs union which links several ex-Soviet states but\" under certain circumstances we would be forced to take protective measures. \"Ukraine last month signed an Association Agreement with Brussels that opens up to Kiev the huge EU market of 500 million consumers along with bringing it help in modernising its economy. Kiev's signing the EU deal was a bitter pill to swallow for Russia which wanted Ukraine to join its own trade bloc, and Moscow has expressed concern that it could see a flood of re-exported EU products. An official of Russia's veterinary inspection service said that if Ukraine begins to implement the EU agreement it will stray from its previous practices agreed with Russia .\" Therefore there exists the likelihood of a complete halt in the import of all (food) products, \"Alexei Alekseyenko, an advisor to the head of the veterinary service, told RIA-Novosti news agency. Russia earlier this month banned meat and fruit imports from Moldova, another ex-Soviet state that also signed an EU Association Agreement. Russia has frequently blocked food imports citing health concerns, sparking accusations from its partners of using trade as a political weapon. Kiev has come under mounting pressure from some quarters at home to quickly ratify the agreement although it has several months to do so. Russian Economy Minister Alexei Ulyukayev warned that if Kiev ratifies the EU deal Moscow will halt its participation in three-way talks on the implementation of the deal\" and we could take unilateral measures to defend our economic interests. \"A senior Ukrainian official said Wednesday that the EU deal would be ratified by the end of August, before the next scheduled meeting in September of Ukrainian, Russian and EU experts to discuss the implementation of the agreement. PREVIOUS STORY European carriers like KLM, Alitalia, Lufthansa and others suspend more Tel Aviv flights NEXT STORY British investigators downloading Malaysia Airlines MH17 black box data Have something to say? Post your comment Have something to say? Post your comment", "articleID": "2014072415_00037325_W", "names": {"Arvind Sharma": ["Q4520621", "Q56378372"]}}]