[{"articleID": "2015051101_00037127_W", "names": {"Tim Owens": ["Q41622515", "Q7804086"], "Robert Mills": ["Q28180932", "Q7347693"]}, "date": "2015-05-11", "url": "http://theday.com/local/20150508/former-norwich-bulletin-building-sold-for-150000", "content": "Norwich - Mystic businessman <mark>Tim Owens</mark> purchased the four-building former Norwich Bulletin complex on Franklin Street for the \"bargain price\" of $150,000 - less than half the listed sale price, with no liability for environmental cleanup, his attorney said Friday. Attorney William Sweeney of the New London firm TCORS filed the closing transaction paperwork at Norwich City Hall Friday morning. <mark>Owens</mark> purchased the 34,000-square-foot complex at 30-66 Franklin St. under the name Bulletin Building LLC for $150,000 from Gatehouse Media Connecticut Holdings Inc.. The advertised asking price was $325,000. The Bulletin moved out of the complex to leased space downtown a year ago. Sweeney said he also plans to file the required state Transfer Act paperwork with the state Department of Energy and Environmental Protection certifying that the building has an environmental cleanup plan. Gannett Satellite Information Network Inc. - the owner prior to Gatehouse - assumed responsibility for the cost of the environmental cleanup that had plagued the complex for years and made it difficult to market the building. Sweeney and <mark>Robert Mills</mark>, president of the Norwich Community Development Corp., both attributed the low sale price to fears about the extent of the environmental liability. \"I think the reality is there has been a stigma surrounding the property because of the environmental issues,\" Sweeney said Friday. But he said the contamination turned out to be less than anticipated. Only one area beneath a former dry cleaning operation at the corner of Bath and Franklin streets remains to be cleaned. That work is expected to be done this summer. Sweeney, a former Norwich city planner, said he hopes the transaction encourages other business developers to look at Norwich properties and not be scared off by potential contamination. \"Norwich has a lot of contaminated properties people thought were a lost cause,\" Sweeney said. \"But it's not a lost cause if you work through the process.\" <mark>Owens</mark>, owner of the Pizzetta gourmet pizza restaurant in Mystic, said Thursday he plans to convert the complex into a combination of uses, including a business incubator, microbrewery, rooftop bar and assorted retail, artist and restaurant space. <mark>Owens</mark> said he hopes to complete first phase interior renovations and exterior façade improvements in time to move the first businesses into the complex by the end of this year. <mark>Mills</mark> said NCDC officials were \"thrilled\" to work with <mark>Owens</mark> over the past year to complete the transaction and praised his perseverance and excitement about the business opportunities there. <mark>Mills</mark> said <mark>Owens</mark> conveys that excitement to potential tenants as well. Business tenants would qualify for lease rebates through the Norwich downtown revitalization program administered by NCDC. Mother, daughter UConn-Avery Point students celebrate as one graduates"}, {"articleID": "2010120623_00177795_W", "names": {"Anna Chapman": ["Q232776", "Q46174649"]}, "date": "2010-12-06", "url": "http://nydailynews.com/ny_local/2010/12/06/2010-12-06_woman_who_asked_for_cremation_in_will_is_backed_by_judge_after_relative_said_she.html?r=ny_local", "content": "woman who asked for cremation in will is backed by judge after relative said she must be buried monday, december 6th 2010, 5:33 pm the fight is over: a three-month battle over whether ethel baar would be cremated, as she wished, or buried, as a relative wished, ended when the judge said the woman's will should be honored. a no-nonsense judge ended a three-month tug of war over the body of 105-year woman monday - saying the woman's wish to be cremated must be honored. ethel baar's body has been on ice in a gramercy funeral home since shortly after she died. james pollock, sought a traditional jewish burial - and went to court. manhattan supreme court justice jane solomon put an end to the battle after reading from the will, in which baar wrote, \"i desire that my body be cremated.\" \"that, my friends, is all it is,\" solomon declared. \"if i were a cadaver, i would want my situation resolved sooner rather than later.\" she refused to hear testimony about baar's supposed change of heart, calling it hearsay that cannot trump the signed document. ellen gordon, the daughter of baar's best friend, hoped to testify that baar ultimately agreed to be buried. baar's other relatives said they don't believe she wanted a burial. \"from anything i know about her, she had no interest in orthodoxy at all,\" said her cousin william wolf. \"she was a woman of very strong will and no one could change her mind.\" baar, who died sept. 11 at the hebrew home for the aged in riverdale, will be cremated and, following her request, her ashes scattered in israel, where pollock lives. site reveals list of global spots deemed \"vital\" to u.s. interests. vote: indict wiki founder? with wedding venue but no groom, bride turns big day into $10k fundraiser canceled wedding party raises $10,000 to feed hungry. another <mark>anna chapman</mark>? uk authorities have eye on katia zatuliveter, 25. photos: sexy spies alleged sleeper spy in uk is latest in an international lineup of russian female spooks. exclusive: terror doctor eyes sewing bombs inside jihadi's bodies out of this world! world's first privately owned spaceship set to launch get a famous photo of some of new york city's most iconic locations including the empire state building, the chrysler building, the statue of liberty, times square and more? my yahoo use of this website signifies your agreement to the"}, {"articleID": "2020011911_00167854_W", "names": {"John Morrison": ["Q16116030", "Q22763081", "Q259180", "Q3182183", "Q33133894", "Q5397323", "Q56274458", "Q6249511", "Q6249515", "Q6249517", "Q6249521", "Q6249523"], "Lisa Brown": ["Q11347967", "Q1827717", "Q47071859", "Q6557848", "Q6557850", "Q6557852", "Q6557853"], "Thomas Cook": ["Q16205324", "Q47452628", "Q53952787"]}, "date": "2020-01-19", "url": "https://www.dailyrecord.co.uk/news/scottish-news/burnt-out-stolen-car-found-21311986", "content": "Sign up to FREE daily email alerts from Daily Record - daily Subscribe We will use your email address only for sending you newsletters. Please see our Privacy Notice for details of your data protection rights Thank you for subscribing We have more newsletters Show me See our privacy notice Invalid Email Police are appealing for information after gunshots were fired at a home in Glasgow. The incident happened in Salmona Street in the Hamiltonhill area of the city around 11.30 pm on Thursday, January 16. Shots were fired by people who got out of a dark-coloured four door car before returning to the waiting vehicle. The suspects fled in the direction of Auckland Street (Image: Google) Read More Related Articles Fatcat council boss in £ 800k payoff asked for payback They then fled the scene towards nearby Auckland Street. Officers probing the incident believe the motor involved was a stolen purple Nissan Pulsar. The car, registration SE66 KNN, was swiped from Kilwinning on Thursday, December 5. The stolen car was found burnt out in Manse Street, Coatbridge on January 17 (Image: Google) Read More Related Articles Bus on fire at Glasgow Fort was brand new eco bus \"torched by yobs with flare' It was found burnt out on Manse Road in Coatbridge on Friday. No one was injured and that enquiries are ongoing as cops scour CCTV footage and go door to door in the area. Officers are appealing for anyone who might have seen the stolen vehicle between December 5 and January 17 to get in touch. Police are now appealing for information (Image: Stuart Vance) Read More Related Articles Rugby Union boss is paid £ 933,000 while front-line staff get less than living wage Detective Inspector <mark>John Morrison</mark> said:\" We believe that the purple Nissan Pulsar may have been used by those who discharged the firearm and are appealing for anyone who may have seen the vehicle to get in touch. \"I would also ask anyone who has private CCTV or who was in the area and may have dashcam footage to check the footage for anything of significance which may assist in our enquiries.\" Anyone with information should contact Police Scotland on 101, quoting incident 3870 of January 16. Information can also be passed anonymously to Crimestoppers by calling 0800555111. Read More Top news stories today New hope for missing Scot <mark>Lisa Brown</mark> The Judge wins £ 14k <mark>Thomas Cook</mark> compo Row over rugby boss' £ 930k wage King Kenny's Hoops transfer prediction"}, {"articleID": "2013112007_00026401_W", "names": {"Roberto Duran": ["Q471571", "Q5406921"], "Ray Mancini": ["Q1362799", "Q19666019"], "Robert Garcia": ["Q16204904", "Q16439254", "Q21620332", "Q2275115", "Q4168665", "Q631722"], "Edwin Rodriguez": ["Q15994921", "Q3048807", "Q5346783"]}, "date": "2013-11-19", "url": "http://www.boxinginsider.com/columns/u-s-buys-manny-pacquiao-brandon-rios-subsidize-chinese-ppv-customers/", "content": "Floyd Mayweather, Andre Ward, 1 & 2 Pound-for-Pound, Still Millions Apart Lack of Education Among Fans Might be the Greatest Danger to Fighters By Ivan G. Goldman Bob Arum and his Top Rank Promotions crew are doing their best to generate a deafening buzz for the Manny Pacquiao-Brandon Rios fight in China this weekend, but so far the result isn't ear-shattering. Obtaining pay-per-view buys in the U.S. won't be an easy sell. HBO executives, in their long history of televising fights, have never staged a PPV event from an overseas location. If they thought it was a good strategy they'd have tried it before. For starters, the promoters can't get boxing media to send people out there. Budgets are tight. Although your average newspaper will send people anywhere to cover the local NFL team, you can't always get editors to send a reporter across town to cover fights, much less to the other side of the world. That's no exaggeration. Check out New York Times boxing coverage. Larger news outlets keep bureaus in Beijing, 1,500 miles from the casino strip in Macau, but they're not staffed with sports writers and probably wouldn't recognize Brandon Rios if he showed up at the door. So HBO and Top Rank, apparently having given up on attracting U.S. boxing media to China, hired George Foreman, <mark>Roberto Duran</mark>, <mark>Ray</mark> Leonard, <mark>Ray Mancini</mark>, Tim Bradley, Marco Antonio Barrera and Mike Alvarado to talk about the fight from what they're calling a \"hub\" in Las Vegas, where the fight should have been in the first place. (Or California, which suffers no shortage of people of Filipino or Mexican heritage). Will the \"old\" Manny show up this time? This card will sell for what looks like $70 in high-def. If your cable provider is anything like mine, you could spend half an hour on its website and still not come up with the exact PPV price until you get to the final stage of buying it. Incidentally, the TV broadcast sells for somewhere between four and five bucks in China, which means U.S. buyers will be subsidizing Chinese customers. The listless undercard, which once again includes Chinese flyweight Zou Shming, 2-0 (zero KOs), the world's only 32-year-old prospect, won't add even 10,000 buys in America. It's all on Pacquiao and Rios. Rios, the American, doesn't have a huge following and lost his last fight. The promoter doesn't even want to talk about Pacquiao's last outing. Though he has plenty of American fans, he opted to stay out of Las Vegas this time so he could avoid paying U.S. taxes, which are considerable. Also, Arum says Macau offered him a \"lucrative\" package. The casinos there seem to be happy with the Asian \"whale\" gamblers they attract with big fights. Everything over there is being done on U.S. time, so the fight will be staged Sunday morning at the Venetian Macao, spelled differently than the city to make life harder for boxing writers. The broadcast will start Saturday at 9 PM Eastern time. This fight the weekend before Thanksgiving is getting the full HBO publicity treatment on the 24/7 series. My local barometer is the Hustler Casino in Gardena, Calif., just down the freeway from my house. It arranges showings of PPV fights only when it anticipates big demand, and I've never seen it wrong. It's not showing this one. Now the good news: The fight itself, fought at the welterweight limit of 147 pounds, will probably be exciting as hell, maybe even sensational. Although Rios, 31-1-1 (23 KOs), has been campaigning as a junior welter, \"Rios is bigger than me,\" Pacquiao frankly concedes. Rios' size may bother the Philippines congressman during the fight itself but is unlikely to cause him any sleepless nights beforehand. Antonio Margarito, for example, was quite a big larger than Pacquiao, and by the final bell he looked like he'd been shredded by wolves. Said Manny's famous trainer Freddy Roach, \"I know I predicted that Manny would knock Rios out inside six rounds, but based on our last workout, I don't see how Rios makes it past the fourth round.\" Brandon's almost-as-famous trainer <mark>Robert Garcia</mark> advises Freddy to \"buy that gold watch for Manny...I guarantee you this will be the last time you ever see Manny Pacquiao on an HBO Pay-Per-View. Rios has won every fight, but one by coming forward and beating him down his opponent punishing, accurate shots. Pacquiao is quicker, uses angles and more footwork, but he loves to trade. Like Rios, he gets a kick out of giving the fans plenty of action. Rios takes that even a step further. He seems to enjoy getting hit. In boxing, that's not as unusual as most people would suppose. Some guys are like that. He is, he maintains,\" nobody's stepping stone. \"Pacquiao, 54-5-2 (38 KOs), will be 35 next month, and he's been through plenty of grueling battles, the kind that shorten careers. Critics are already prepared. If he looks bad, they'll say he's finished. If he looks sensational they'll say Rios was made for him. Ivan Goldman's boxing novel The Barfighter, set in the boxing world, was nominated as a Notable Book by the American Library Association. Available online & at better bookstores everywhere. Information Manny Pacquiao: With The Typhoon-ravaged Philippines, This Fight Means More UFC 167 Results: Georges St. Pierre Retains Title with Controversial Decision over Johny Hendricks Peter\" Kid Chocolate \"Quillin Talks about the Rosado fight and his Future Boxing Insider Notebook: Pacquiao, Mayweather, Rigondeaux, Chisora, and more.... Manny Pacquaio Training Camp Media Interview with Freddie Roach U.S. Buys for Manny Pacquiao-Brandon Rios to Subsidize Chinese PPV Customers Lack of Education Among Fans Might be the Greatest Danger to Fighters\" Weighing In' On A Growing Problem: <mark>Rodriguez</mark> Blows His Big Opportunity Floyd Mayweather, Andre Ward, 1 & 2 Pound-for-Pound, Still Millions Apart Jackie Kallen: Andre Ward vs <mark>Edwin Rodriguez</mark> - The Battle of the Unbeatens"}, {"articleID": "2012101617_00089238_W", "names": {"Marcus Gilbert": ["Q26785985", "Q549087", "Q6758185"]}, "date": "2012-10-16", "url": "http://steelersdepot.com/2012/10/mike-tomlin-says-he-is-concerned-about-troy-polamalu/?utm_source=rss&utm_medium=rss&utm_campaign=mike-tomlin-says-he-is-concerned-about-troy-polamalu", "content": "mike tomlin says he is concerned about troy polamalu tuesday, october 16th, 2012 at 12:13 pm by dave bryan mike tomlin had his weekly spot on siriusxm nfl radio tuesday following his weekly press conference and he was asked specifically about injured safety troy polamalu (calf), who will be out for a second straight game after re-injuring his calf against the philadelphia eagles. tomlin was asked by host adam schein how concerned he was about the health of polamalu. \"you know, i am concerned, but more than anything, as i sit here today, i'm more concerned about the guys that are playing,\" said tomlin. \"we've deemed him out at this point for this week, so his status as i sit here is less of a concern - i'm more concerned about getting the guys that are going to replace him ready to play.\" matches the thursday report by mike prisuta of dve radio, who reported during the pre game broadcast that that he had heard that polamalu could be out several more weeks. steelers injury report: polamalu, <mark>gilbert</mark> & carter out - pouncey, mendenhall & redman questionable 2012 nfl week 6 stats - adjusted net yards per passing attempt differential steelers running game off to worst post merger start though five games wacky state of the afc sets stage for crucial steelers bengals game report: <mark>marcus gilbert</mark> starts monday off with right foot in a boot"}, {"articleID": "2009020500_00000182_W", "names": {"Bob Riley": ["Q3641335", "Q438010"]}, "date": "2009-02-05", "url": "http://tuscaloosanews.com/article/20090204/news/902040271", "content": "alabama gov. <mark>bob riley</mark> studies his state of the state address in his capitol office in montgomery, monday. published: wednesday, february 4, 2009 at 4:59 p.m. last modified: wednesday, february 4, 2009 at 5:01 p.m. montgomery, ala. (ap) - the federal stimulus package, which has received little support from alabama's congressional delegation, could ease the state's budget cuts and keep government operating at close to its current level, gov. <mark>bob riley</mark> said wednesday. with the stimulus, the budgets don't get worse. without the stimulus, they do and state government could see thousands of layoffs, the republican governor said as he recommended the state budget for fiscal 2010. <mark>riley</mark>, a former congressman, said he's not recommending any particular stimulus plan, but is encouraging congress to pass one because he considers it a crucial foundation for economic recovery. \"what everyone in this room wants is an expanding budget, not a contracting one,\" the governor said. the stimulus plan passed by the u.s. house was opposed 6-1 by alabama's delegation, and the state's two republican u.s. senators are against it now that it's pending in that chamber. the house-passed plan could pump about $3 billion into alabama over 2 1/2 years. <mark>riley</mark> said if the stimulus package fails, the education budget would drop from this year's $5.8 billion to $5.6 billion next year. with the package, it could jump to $6.2 billion because of federal aid. without the package, <mark>riley</mark> is recommending spending be cut 2.8 percent for grades kindergarten though 12th, and higher education reduced 3.5 percent. but that doesn't give a picture of the true cuts because education programs have already been sliced from the state's all-time record funding of $6.7 billion in fiscal 2008, which ended sept. 30. <mark>riley</mark> is recommending a $1.6 billion general fund budget for non-education agencies in the fiscal year that starts oct. 1. that's down from nearly $2 billion this year. but his recommendation is based on the federal government giving alabama substantially more money for medicaid than this year. that would allow alabama to slice its share of medicaid funding by $353 million. most other state programs would get about the same amount as this year, and medicaid would be able to maintain its health care programs, <mark>riley</mark> said. <mark>riley</mark>'s recommendations come in the first week of a legislative session that ends in mid-may. he said the recommendations will be revised based on how congress handles the stimulus package and the flow of state tax collections this spring. for the administration, there is a bright spot. a state revenue department report released wednesday shows state tax collections in january were only 1 percent below the same month a year ago. in december, alabama experienced a 14 percent drop over the previous december. for october through january, the first four months of the state's fiscal year, alabama's tax collections were 4.4 percent below the same period a year ago. a member of the house government appropriations committee, rep. greg canfield, r-vestavia hills, said he expects legislators to delay work on the state budgets until late in the session to have the best financial information available."}, {"articleID": "2018031217_00037773_W", "names": {"Michael Jackson": ["Q2831", "Q3308266", "Q3856193", "Q43131943", "Q522680", "Q54951747", "Q57260185", "Q5826003", "Q6831552", "Q6831553", "Q6831554", "Q6831555", "Q6831556", "Q6831557", "Q6831558", "Q6831563", "Q6831564", "Q6831566", "Q92948"]}, "date": "2018-03-12", "url": "http://elkodaily.com/sports/college/the-most-annoying-college-sports-traditions/collection_9db11ff7-f6f8-5ee1-8138-9295fb296ef2.html", "content": "Facebook Twitter Email Print Save One school's beloved pastime might annoy the heck out of everyone else. Here are 21 school traditions that other college sports fans find loathsome, obnoxious or just plain dumb. 21. Big heads (San Diego State) San Diego State's rabid cheering section The Show has been credited with coming up with the idea of using oversized cutouts of heads to distract opponents; a group member printed up a big <mark>Michael Jackson</mark> head during the 2002-03 season. Ever since, sports fans across college and pro sports have copied this, going bigger and more bizarre with their \"big head\" signs by choosing random celebrities, fictional characters or even portraying the athletes themselves. Regardless, the signs have become so commonplace that they're more of a distraction to fellow fans trying to watch the game than the players. SD Dirk/Flickr 20. The Tomahawk Chop (Florida State) Florida State does have some unique traditions that earn respect from college football fans, such as the Sod Cemetery, but there's one that rubs other people the wrong way: the \"Tomahawk Chop\" and war chant. Later adopted by the Atlanta Braves and the Kansas City Chiefs, FSU claims to have invented the chant and hand motion, though the university itself isn't proud of it. Former FSU President Dale Lick wrote in a 1993 column for USA Today: \"Some traditions we cannot control.\" The chant itself is droning and incessant while the hand motion is an offensive stereotype. Ruth Peterkin/Dreamstime/TNS 19. Curtain of Distraction (Arizona State) Since it debuted in 2014, the Curtain of Distraction has helped the Sun Devils' student section, the 942 Crew, be mathematically proven as the most distracting student section in college basketball. The curtain remains closed until a rival player winds up to shoot a free throw. It's then pulled back to reveal anything from an Elvis impersonator to a shark attack to Olympian Michael Phelps in his Speedo. It's hysterical to watch--unless you're the team they're playing. Zach Helfand/Los Angeles Times/TNS 18. Calling the hogs (Arkansas) One of the most irritating cheers in college sports is University of Arkansas fans Calling the Hogs. This might be because the tradition of chanting \"wooo pig sooie\" isn't confined to stadiums, but can be heard anywhere fans congregate, from airports to Disney World. Razorback fans love the call so much, it's an additional skill you can download for the Amazon Alexa personal assistant. Dreamstime/TNS 17. Cameron Crazies (Duke) Duke's men's basketball student section earned its nickname by being one of the most intense in college sports. The organized annoying they do of visiting players include insulting chants that are coordinated on cheer sheets, \"hexing\" players who foul out and getting close enough to touch players who are inbounding the ball. Though they've mellowed out a bit in recent years thank to intervention from the university and coach Mike Krzyzewski, they remain one of the most irritating fan bases in college sports, and contribute to why many people love to hate Duke. Robert Willett/Raleigh News & Observer/MCT 16. Couch burning (West Virginia) While not at all an official or university-encouraged activity, couch burning has become a shameful defacto tradition at West Virginia. So much so that the university has produced PSAs to discourage it, and the city of Morgantown, where the school is located, banned outdoor upholstered furniture and upped the penalty for couch burning from a misdemeanor with a fine to a felony with jail time. According to the city manager in 2015, there had been 3,000 street fires in Morgantown in the prior decade. It's no wonder WVU fans are considered some of the worst in college sports. Dreamstime/TNS 15. OH-IO (Ohio State) Congratulations, Ohio State; your fans can spell your four-letter state name. Or you can most of the time. (In the 2015 national championship game, the second \"O\" flag didn't make it onto the field when the team ran out, so the flags spelled \"Ohi.\" ) Fans certainly get plenty of practice since spelling \"Ohio\" seems to be Ohio State's main schtick, from fans chanting it and spelling it with their arms to the marching band spelling it out in \"Script Ohio\" at halftime. Every season. Since 1938. This team has one bit, and it gets seriously annoying. Barbara J. Perenic/Columbus Dispatch/TNS 14. Throwing tortillas (Texas Tech) Plenty of fans have thrown items like cans and trash onto the football field to voice their displeasure at a game's outcome. Northwestern students in the \"80s were so discouraged by on-field action, that they begin staging marshmallow fights to make game day more fun. But Texas Tech Red Raiders fans stand alone in their unique food tradition. They throw tortillas at kickoff, despite outside food not being allowed at the stadium. According to lore, in 1992, an ESPN announcer said that there was\" nothing but Tech football and a tortilla factory in Lubbock. \"The actual story is probably that the practice evolved from throwing soda lids. But ever since, rabid fans have thrown tortillas at football and some basketball games, though landing them on the playing field incurs a penalty. Visiting fans have to make sure to guard themselves against an errant projectile tortilla. Nicholas Moore/Dreamstime/TNS 13. The pink visitors locker room (Iowa) This college football tradition affects visiting players and not fans. In 1979, former Iowa coach Hayden Fry had the walls of the visitors locker room at Kinnick Stadium painted pink. When the stadium was updated in 2005, the pink was carried over to the carpets, lockers, toilets and showers. Fry's logic was that pink psychologically has a calming effect on people. While it didn't bother some, other coaches such as Michigan head coach Bo Schembechler saw red in that room. He reportedly hated it so much that he put paper on the walls to cover the color. Asolsma1988/Wikimedia Commons 12. Barking (Georgia) The majority of college sports fans leave the animal noises to the sound system, with one notable exception being University of Georgia fans. A tradition that needs to retire is Bulldog Nation barking at opposing fans. It's cute when it's done by a kid, but a grown man barking in someone's face comes off as manic. The only one who should be barking at a Georgia game is Uga, the bulldog mascot. Louis Lopez/CSM/Zuma Press/TNS 11. The Leland Stanford Junior University Marching Band (Stanford) The Stanford University marching band isn't like other bands. According to NPR, they're\" the only university marching band to be repeatedly fined and banned by the NCAA \"as well as booed off the field and suspended by their own school. Their polarizing, provocative on-field routines are meant to be humorous but sometimes cross the line to offensive and even interfere with the game. Many non-Cardinal fans find their\" jokes \"and wacky uniforms to be insufferable. Al Diaz/Miami Herald/MCT 10. Smurf Turf (Boise State) While some traditions are only annoying because of the suffering they cause in-person to opponents, even college football fans watching on their couches have to deal with the eye pain caused by Boise State's iconic, annoying Smurf Turf. Also given such titles as\" The Blue Plastic Tundra, \"the blue turf was installed in 1986 and became the first and most notorious non-green stadium surface. This unique home-field advantage is hard on the eyes for fans and players, especially when the Broncos wear all-blue uniforms. Joe Jaszewski/Idaho Statesman/TNS 9. Boomer Sooner (Oklahoma) To rival fans in the stands, it can feel like\" Boomer Sooner \"is the only song the University of Oklahoma band knows how to play. In fact, in the 2018 Rose Bowl game against Georgia, the band played it for almost every play, even after the Sooners lost the lead. A failed OU third down conversation? Time for\" Boomer Sooner! \"According to Reddit, the band played it 84 times in total in that single game. Afterward, USC's marching band, the Spirit of Troy, which is infamous for overplaying its school fight song, tweeted\" Mad respect for that level of annoyingness. \"The band's official count was 1,104 times during the 2017 season. No wonder other fans are peeved. Tom Fox/Dallas Morning News/MCT 8. Duck noise makers (Oregon) The 2010 World Cup had vuvuzelas, which led to them being banned four years later in Rio. The Oregon Ducks had duck bill noisemakers, known as Duck Lips, which became barred by the Pac-12 in 2011. There was officially a league-wide policy on artificial noisemakers, though only Oregon's quacking kazoos got the boot. Though the conference and the NCAA should have bigger concerns than eliminating an innocuous long-standing tradition, it was a bit of a relief to Pac-12 opponents and perhaps even to parents whose kids were using Duck Lips long after the game was over. Larry C. Lawson/Cal Sport Media/Zuma Press/TNS 7.\" What is your profession?' (Michigan State) It seems only natural that the Michigan State Spartans would pilfer something from the 2006 movie \"300\" since it's about the Spartans. Except that the Spartans lost the Battle of Thermopylae. Miserably. And the \"Spartans\" in that battle were mostly Greeks. These facts don't stop Michigan State from playing the clip on the Jumbotron and grunting a response to the question posed by Gerard Butler's King Leonidas. Butler himself even visited the school for Midnight Madness and the homecoming football game in 2010, which further ingrained this tradition. Rashaun Rucker/Detroit Free Press/MCT 6. Cowbells (Mississippi State) Clanga! Cowbells might be a beloved tradition by Bulldogs dating back to the 1930s, but these instruments were considered so aggravating that they were sidelined by the SEC from 1974 until 2010. That year, Mississippi State's famed cowbells were allowed back into football stadiums provided Bulldog fans only ring them during timeouts. While MSU fans don't think of them as a gimmick, most other college football fans think otherwise. Charlie Jaijo/Tampa Bay Times/TNS 5. Turkey gobbling (Virginia Tech) Virginia Tech's annoying tradition isn't a chant or cheer but rather a sound effect played throughout the football stadium. Plenty of stadiums use effects like the noise of their animal mascot, but barks or growls don't make you clap your hands over your ears quite like the cry of the HokieBird, which is basically a turkey that evolved from the school's former nickname, the Gobblers. If it's not blasting for the scoreboard speakers, you might hear the turkey call emanating from a fan's noisemaker. Basically, the gobble is inescapable. Jared Lazarus/Miami Herald/MCT 4. Toast Toss (Pennsylvania) The true champions of throwing food on the field are students at the University of Pennsylvania. Between the third and fourth quarters of a football game, UPenn students sing \"Drink a Highball,\" which includes the line: \"Here's a toast to dear old Penn.\" Since no alcohol is allowed at the stadium, students improvise, throwing more than 20,000 pieces of toast as well as bagels, muffins and other baked goods down onto the track around the field. According to the Penn Currant, a modified turf cleaner called the \"toast zamboni\" picks up the food at the end of the day. The tradition has faced criticism for being a waste of money and food, though the school supports hunger-related charities to counteract the cost. Abby Drey/Centre Daily Times/MCT 3. \"Rocky Top' (Tennessee) Many discussions on fan forums are dedicated to college football fans' distaste for\" Rocky Top, \"the unofficial fight song of the University of Tennessee. This distaste seems to stem from the fact that it's simple and catchy as well as the sheer amount of times the band plays it. The Volunteers' marching band, the Pride of the Southland Band, played the song 438 times during the 2016 season, according to the Tennessean. That's an average of about 34 renditions of\" Rocky Top \"per game day. This has been described by Bleacher Report as\" psychological warfare \"in the form of a song. Tim Dominick/The State/MCT 2. Rolling Toomer's Corner (Auburn) This college sports tradition is more annoying to the Auburn groundskeepers than to anyone else, though it's also a frustrating sight to see for rival fans. Starting in 1896, people started tossing ticker tape over the telegraph wires at the spot nicknamed Toomer's Corner after big road victories. It later evolved to throwing toilet paper around the corner's oak trees. The long-standing tradition ticked off one bitter Alabama fan after Auburn topped the Crimson Tide. He poisoned and killed the original oak trees in 2010 and was sentenced to 3 years in prison for the damage, but the Tigers were resilient and continued the tradition. Mike Haskey/Columbus Ledger-Enquirer/MCT 1. Rammer Jammer (Alabama) Part of what makes this song so annoying is that it gets played quite a lot since Alabama is perennially good at football. What really make it get under the skin of the Crimson Tide's opponents are the lyrics:\" We just beat the hell out of you. \"These taunting words get directed as an opposing team mere seconds after their defeat, whether by 50 points or by 1. And the lyrics allow students and fans to relish the other team's defeat rather than celebrating their victory, which is why so many college football fans find it distasteful. Hyosub Shin/Atlanta Journal-Constitution/TNS Tags Wire Tns Sweeps College Sports Football Basketball Facebook Twitter Email Print Save Load comments × Post a comment as Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching © 2017 Lee Enterprises | Terms | Privacy"}, {"articleID": "2015092117_00128439_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2015-09-21", "url": "http://www.wehoville.com/2015/09/21/opinion-lets-not-turn-santa-monica-boulevard-into-rodeo-drive/", "content": "Mon, Sep 21, 2015 By Larry Block 2 Comments Perhaps you know me as the owner of BlockParty. It's the only place in town to get a West Hollywood tee shirt or magnet. It's a place of hometown Pride. Our lease expired a year ago and we have been month-to-month since. When I heard \"Flap Jack Johnnies\" --a Bible Belt pancake house--had signed a letter of intent to occupy my location I lamented the changes in our neighborhood. I've been fighting and fighting to protect WeHo's historic Boystown and honor its legacy by promoting the idea of an LGBT square at the corner of San Vicente and Santa Monica boulevards and lobbying for the rainbow flag on City Hall to protect what makes us so special as a city. But lets face it, landlords want maximum rent dollars and Triple-A rated tenants. Larry Block. As a local retailer concerned about the neighborhood, I wondered if the proposal by City Council members Lauren Meister and John Duran to limit chain stores from opening in West Hollywood was to protect a store like mine. If so, I wish either of them would have asked my thoughts or listened to my concerns these past few years. The proposal would ban or limit stores with more than 12 locations--what they are calling \"formula\" retailers--from opening in West Hollywood. The Subway store around the corner from you is probably a locally owned franchise with a national brand name. Is that a \"formula\" retailer that should be banned? And some Subway stores are also company-owned. How do Meister and Duran propose that we pick and choose among these? Or is this idea geared toward national chains such as Target or Best Buy or drugstore chains like CVS and Rite Aid? These national mass merchants bring low prices to local consumers through economy of scale. Do Meister and Duran want us all to shop outside West Hollywood's borders to save a buck so that we can afford to live here? A ban on chain stores is an assault on the free market system. If the federal government adopted rules like that, our form of government would no longer be free market capitalism. The staff report cites San Francisco and Malibu as examples of the ban on \"formula\" retailers. But those cities aren't like us. (Those cities didn't adopt a fur ban or ban short-term vacation rentals or ban the circus from coming to town .) West Hollywood is a little dot in the middle of Los Angeles. We are interdependent with our neighboring communities for most goods and services. Major restrictions or a ban on chain stores are not the way to protect the culture and integrity of our city. Forcing people on low incomes, or seniors and those with disabilities to travel outside our borders to meet their needs does not protect our community. Why not welcome a Staples or Office Depot to Movietown Plaza rather then have every dollar spent by a West Hollywood business on office supplies going outside our city boundaries. Millions of dollars in sales tax revenue lost--valuable money that could be used to increase our social services budget or fund mass transit. Local jobs for our residents can help to decrease commutes and ease traffic congestion. Let's consider one formula retailer \"Target' ed\" by this proposal. Target was a winner of our city's Disability Service Award. Target is a leader in hiring transgendered employees. John D’Amico has said many times: \"We export the culture that the world consumes.\" So why not welcome every chain to West Hollywood to help them implement a national push for gay and transgender rights in the workplace. Let's not build a wall between West Hollywood and our neighbors. Let's be open for business and welcome those who want to embrace our community. \"Formula\" store regulation adds political dynamite to opening a business within West Hollywood. Businesses that need permission to open here might find that a donation to a City Council member can win them an approval. It's a new way to pay for play in West Hollywood. Besides, are we going to have to hold a hearing on every store that applies to open in West Hollywood that is part of a chain? Banning chain stores with Triple-A bond ratings from opening in West Hollywood will kill development. Could that be the main goal behind Meister's proposal--to stop all development dead in its tracks? I'm not even sure she realizes the force behind this idea. Do Meister or Duran understand real estate financing? Remember hearing the initials MBS during the financial crisis? They stand for \"mortgage-backed securities\" . Commercial mortgage-backed securities (CMBS) are a type of security backed by commercial mortgages rather than residential real estate mortgages. . Without the ability to lease to Triple-A tenants, property owners and developers will not be able to borrow at the lowest interest rates to raise the money to fund new projects or sell these projects to investors. The ban or restrictions on chain stores will create fear in those thinking of financing and building in West Hollywood. There are things we can do to protect and preserve the culture and integrity of our small business community--safe crosswalks, free parking such as <mark>Beverly Hills</mark> offers to welcome consumers. The city charges me special event permit fee of $180 to have a sidewalk sale--milking every little business promotion. Code enforcement will not allow my business to stay open 15 minutes after the bars close to sell a condom. The City Council has created some of the problems in the Boystown area that this proposal is seeking to cure. For one thing we can stop approving every retail space change of use into a bar or restaurant. We can encourage diversity in our retail. Good local business starts with ample parking, safe crosswalks and a business friendly City Council. As I talk to my neighbors and watch the turnover around me, I ask the question \"Is anybody listening?\" Perhaps they are listening, but I do not think either of these council members understands the ramifications of their proposal. I do not think that we want a city of expensive boutiques. I do not think the majority of us want to travel outside our borders to eat at Chipolte or go to Lenscrafters. That Dairy Queen belongs right here in West Hollywood! Plain and simple--national chains have the economy of scale and purchasing power to deliver value and convenience to our residents. Ban the chains and we are all forced outside our borders to shop. Larry Block, a candidate in this year's City Council election, is a licensed real estate agent and owner of the BlockParty store."}, {"articleID": "2014061416_00050738_W", "names": {"Peter Dean": ["Q7173604", "Q7173605", "Q7173607"]}, "date": "2014-06-14", "url": "http://suffolkfreepress.co.uk/fun-loving-woman-took-her-own-life-1-6119509", "content": "click here If you have not signed up previously It's free and only takes a minute! Arrange your newspaper/digital subscriptions online UPDATED WITH QUOTES: Lowestoft promotion-winning top scorer among AFC Sudbury signings Tragic accident was a \"complete fluke' Plan goes in for 80 new homes in village A Sudbury woman who suffered from depression was found hanged at her home, an inquest heard. The body of Mary Goddard, 62, was discovered in the garage of her house in Betty Cocker Grove on March 24. On Friday, an inquest in Bury St Edmunds was told that police quickly established there were no suspicious circumstances and the dead woman was identified by her sister. Suffolk coroner Dr <mark>Peter Dean</mark> said a police report on the incident showed that a note had been found at the scene. A post-mortem examination conducted by consultant pathologist Dr Karl Love at West Suffolk Hospital confirmed the cause of death as hanging with depression listed as a contributory factor. Dr <mark>Dean</mark> said that details provided by Mary Goddard's GP showed that she had been treated for the effects of depression. Recording a verdict that she took her own life, Dr <mark>Dean</mark> said:\" It does appear that, sadly, she understood and tragically intended the consequences of her actions. \"After the inquest, Mary Goddard's family paid tribute to her in a statement which said:\" Mary was truly a one-off. She was intelligent, generous and a reliable, caring friend to so many people. \"She was also passionate and fun-loving, with a fantastic sense of humour. * Please type the postcode as the example above Local news on the move Keep up to date with all the latest local news on your iPhone or Android phone with our mobile site. Visit this website on your mobile to start enjoying it on the move. Contact us If you wish, you can contact us using any of the methods below. clicking here. If you remain dissatisfied with the response provided then you can contact the PCC by clicking here. Suffolk Free Press provides news, events and sport features from the Sudbury area. For the best up to date information relating to Sudbury and the surrounding areas visit us at Suffolk Free Press regularly or bookmark this page. Can I opt out of receiving Cookies? Cookies are small data files which are sent to your browser (Internet Explorer, Firefox, Chrome etc) from a website you visit. They are stored on your electronic device. This is a type of cookie which is collected by Adobe Flash media player (it is also called a Local Shared Object) - a piece of software you may already have on your electronic device to help you watch online videos and listen to podcasts. Yes there are a number of options available, you can set your browser either to reject all cookies, to allow only\" trusted \"sites to set them, or to only accept them from the site you are currently on. However, please note - if you block/delete all cookies, some features of our websites, such as remembering your login details, or the site branding for your local newspaper may not function as a result. The types of cookies we, our ad network and technology partners use are listed below: A tool used by some of our advertisers to target adverts to you based on pages you have visited in the past. To opt out of this type of targeting you can visit the\" Your Online Choices' website by clicking here. Google Ads ► Our sites contain advertising from Google; these use cookies to ensure you get adverts relevant to you. You can tailor the type of ads you receive by visiting here or to opt out of this type of targeting you can visit the \"Your Online Choices' website by clicking here. Webtrends / Google Analytics ► This is used to help us identify unique visitors to our websites. This data is anonymous and we cannot use this to uniquely identify individuals and their usage of the sites. Dart for Publishers ► This comes from our ad serving technology and is used to track how many times you have seen a particular ad on our sites, so that you don't just see one advert but an even spread. This information is not used by us for any other type of audience recording or monitoring. ComScore ► ComScore monitor and externally verify our site traffic data for use within the advertising industry. Any data collected is anonymous statistical data and cannot be traced back to an individual. Local Targeting ► Our Classified websites (Photos, Motors, Jobs and Property Today) use cookies to ensure you get the correct local newspaper branding and content when you visit them. These cookies store no personally identifiable information. Grapeshot ► We use Grapeshot as a contextual targeting technology, allowing us to create custom groups of stories outside out of our usual site navigation. Grapeshot stores the categories of story you have been exposed to. Their privacy policy and opt out option can be accessed here. Subscriptions Online ► Our partner for Newspaper subscriptions online stores data from the forms you complete in these to increase the usability of the site and enhance user experience. Add This ► Add This provides the social networking widget found in many of our pages. This widget gives you the tools to bookmark our websites, blog, share, tweet and email our content to a friend."}, {"articleID": "2017052712_00222553_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Brendan O'Brien": ["Q16194729", "Q23091973", "Q4961028", "Q496739", "Q707504"]}, "date": "2017-05-27", "url": "http://www.ndtv.com/world-news/2-men-killed-in-portland-after-trying-to-stop-anti-muslim-rant-police-1704607?pfrom=home-topstories", "content": "2 Men Killed In Portland After Trying To Stop Anti-Muslim Rant: Police A man harassing two women who appeared to be Muslim killed two people who tried to intervene. World | | Updated: May 27, 2017 15:58 IST Reuters 6 Shares PRINT COMMENTS The suspect was arrested when he got off the train where he committed the murders (Representational) Two men were stabbed to death in the US city of Portland on Friday when they tried to stop their attacker from harassing two women because they appeared to be Muslim, police said. The incident unfolded on a commuter train hours before the start of Ramadan, Islam's holy month, when most of the world's 1.6 billion Muslims observe a religious fast. The attack began shortly before 4:30 pm when a man started yelling ethnic and religious slurs toward two women who appeared to be Muslim on a MAX train at the Hollywood Transit Station, the Portland Police Department said in a statement. Three men who intervened were stabbed, two fatally. The attacker was arrested shortly after he got off the train, police said, adding that the women left the scene before police could interview them. \"In the midst of his ranting and raving, some people approached him and appeared to try to intervene with his behavior and some of the people that he was yelling at,\" Portland police spokesman Pete Simpson said during a news conference aired by local news outlets. \"They were attacked viciously by the suspect,\" he added. In a statement responding to Friday's attack, the Council on American-Islamic Relations said that anti-Muslim incidents increased by more than 50 percent in the United States from 2015 to 2016 due in part to President <mark>Donald Trump</mark>'s focus on terrorist groups and anti-immigrant rhetoric. \"President <mark>Trump</mark> must speak out personally against the rising tide of Islamophobia and other forms of bigotry and racism in our nation that he has provoked through his numerous statements, policies and appointments that have negatively impacted minority communities,\" said CAIR National Executive Director Nihad Awad. The <mark>Donald Trump</mark> administration says that while it strongly opposes what it calls \"radical Islamic terrorists\" , it has no quarrel with Islam. Following the attack, police said one of the men died at the scene while another died at a hospital. The third man was treated for non-life threatening injuries. \"These were folks just riding the train and unfortunately got caught up in this,\" he said. Witnesses told police that the two young women were possibly Muslim. One wore a hijab. Portland police did not identify the suspect or the victims. (Reporting by <mark>Brendan O'Brien</mark> in Milwaukee; Editing by Toby Chopra) © Thomson Reuters 2017 (This story has not been edited by NDTV staff and is auto-generated from a syndicated feed .) Trending"}]