[{"date": "2014-07-24", "url": "http://economictimes.indiatimes.com/news/international/world-news/Russia-pressures-Ukraine-not-to-sign-European-Union-association-pact/articleshow/38937269.cms", "content": "\"If people in India can get donkeys married to get rains, why won't they call us?\" said <mark>Arvind Sharma</mark> who works for a company in field of cloud seeding. Government plans to import onions to prevent further spike in prices Hot Gadgets Shaping Our Digital Life \"Russia trained, equipped rebels who shot down MH17' The United States & Ukraine have blamed Moscow & Russia-backed separatists for the tragic incident that killed all 298 people on board Malaysia Airline MH17. Malaysian Airlines crash has strong echoes of 1983 Korean tragedy\" Thanks for murdering my child,' father tells Putin & plane attackers Ties with Israel behind no Gaza resolution? Many BJP leaders have links with Israel. PM Modi visited Tel Aviv as the chief minister of Gujarat, which has old diamond trade ties with Israel. Israel faces difficult choice in Gaza conflict: Should it halt invasion or not? SA Aiyar: How Modi can help clean up economic mess Modi said that for every new law, we should abolish 10 old laws, showing a deep insight into the current rot. India needs a gigantic surgical operation. A PM's Soliloquy: What stalls India from bringing about \"that' change A jobless future awaits us, no matter what the government might do What prompted PM Modi to postpone his Japan trip Modi was not satisfied with preparations by the various departments and therefore decided to visit Tokyo either in August or Sept for a substantive visit. The decision has been conveyed to NDA ministers informally. Singh will also occupy the seat next to PM and was appointed BJP's deputy leader in Lok Sabha. Assam Congress leaders seek strict action against Himanta Biswa Sarma Here's why D Subbarao will not take up a finance job\" If I take up anything in finance, I would be paid disporportionately for my past designations rather than what I do, \"says former RBI Governor D Subbarao. Tech may soon achieve what decades of bank nationalisation couldn't After poll defeat, AAP leader Kumar Vishwas turns into a much in demand celebrity Reserve Bank of India to identify six systemically important banks Ill prepared government departments prompt Narendra Modi to postpone July trip to Japan Markets tomorrow: Stocks trading ideas by experts Markets tomorrow: Stocks trading ideas b.. . Insight: Railways' challenging task of building rail links in J & K Kiev could face a total ban on its food exports. Prime Minister <mark>Dmitry Medvedev</mark> said Moscow was holding talks with the EU and its partners in a customs union which links several ex-Soviet states but\" under certain circumstances we would be forced to take protective measures. \"Ukraine last month signed an Association Agreement with Brussels that opens up to Kiev the huge EU market of 500 million consumers along with bringing it help in modernising its economy. Kiev's signing the EU deal was a bitter pill to swallow for Russia which wanted Ukraine to join its own trade bloc, and Moscow has expressed concern that it could see a flood of re-exported EU products. An official of Russia's veterinary inspection service said that if Ukraine begins to implement the EU agreement it will stray from its previous practices agreed with Russia .\" Therefore there exists the likelihood of a complete halt in the import of all (food) products, \"Alexei Alekseyenko, an advisor to the head of the veterinary service, told RIA-Novosti news agency. Russia earlier this month banned meat and fruit imports from Moldova, another ex-Soviet state that also signed an EU Association Agreement. Russia has frequently blocked food imports citing health concerns, sparking accusations from its partners of using trade as a political weapon. Kiev has come under mounting pressure from some quarters at home to quickly ratify the agreement although it has several months to do so. Russian Economy Minister Alexei Ulyukayev warned that if Kiev ratifies the EU deal Moscow will halt its participation in three-way talks on the implementation of the deal\" and we could take unilateral measures to defend our economic interests. \"A senior Ukrainian official said Wednesday that the EU deal would be ratified by the end of August, before the next scheduled meeting in September of Ukrainian, Russian and EU experts to discuss the implementation of the agreement. PREVIOUS STORY European carriers like KLM, Alitalia, Lufthansa and others suspend more Tel Aviv flights NEXT STORY British investigators downloading Malaysia Airlines MH17 black box data Have something to say? Post your comment Have something to say? Post your comment", "articleID": "2014072415_00037325_W", "names": {"Dmitry Medvedev": ["Q23530", "Q47858657"]}}, {"date": "2014-07-29", "url": "http://www.surfingmagazine.com/sounds/courtney-barnett/", "content": "Have you ever seen a mousey Australian hipster girl cover Kanye West's \"Black Skinhead\" ? Melbourne's Courtney Barnett pulled it off in a radio station once and it was just too adorable to be offensive. As she said, \"I'm sorry, but I had to change some words that were...rude .\" Covers are pretty out of character for Courtney, as her songwriting is famously vivid and brainy - a talent she picked up in her younger Dahl days. Shortly before her global tour, she tells us about a few influences that have made her into the artist she's become. She made no mention of Kanye. - Beau Flemister ￼ ￼ SURFING: All of your songs have such great stories. Were you a big reader as a kid? Courtney Barnett: Yeah, I definitely read a lot as a kid. I grew up with heaps of Roald Dahl books. I always loved how he wrote such imaginative, crazy stuff. I think my songs draw from that, although I've been a bit lazy with my reading recently. [laughs] I have been reading lots of band biographies, though. What's your favorite Roald Dahl book? Probably George's Marvellous Medicine. I actually just read it again. But the thing about Dahl's children's books is that they're so dark. They're twisted and weird, and maybe I kind of do that a bit in my songs. They're sarcastic and dark, but in a funny, lighthearted way. Who are your musical influences? Nirvana was a big one when I was a kid, so was <mark>Lou Reed</mark> and Television. And now I'm really into The Rough Sea and I just started listening to Kurt Vile. My tastes are pretty broad. Oh, also <mark>Neil Young</mark>; he's a huge influence. For an Australian, some of your songs seem to have that American-Western twang to them. Yes, that's true. That'd be the <mark>Neil Young</mark>, I suppose. We really like some of that Western style over here, so I guess it shows in our music, like the guitars in \"Avant Gardener .\" Do you play anything else beside guitar? Yeah, I can play drums, bass, keyboard...that's about it. And all very averagely. [laughs] I can make them sound like they're supposed to, nothing more. Have you ever gone surfing before?", "articleID": "2014072917_00051741_W", "names": {"Lou Reed": ["Q189080", "Q6685709"], "Neil Young": ["Q1361496", "Q16104585", "Q1974908", "Q48841251", "Q6265210", "Q633", "Q6989513", "Q6989515"]}}, {"date": "2014-07-30", "url": "http://dailyrecord.co.uk/sport/football/football-news/callum-davidson-tells-grieving-st-3935163", "content": "Watch hilarious video of Northern Irish mum shouting at her daughter when she doesn't know how long to go 80 miles at 80mph Rangers hero Shota Arveladze wins gruelling legal battle to evict tenants who fell £ 42k behind on rent payments Serial pervert was caught in street sex act but still left free to rape and kill OAP Rosina Orlando Bloom throws PUNCH at Justin Bieber outside Ibiza restaurant Liam Neeson opens up about heart-wrenching moment wife Natasha Richardson's life support was turned off Coronation Street legend Charlie Lawson happy to bring <mark>Jim McDonald</mark> back - even after drinking row Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt \"says Commonwealth Games are\" a bit s *** \"and that the\" Olympics were better \"' Celtic boss Ronny Deila insists he's not afraid of Champions League catastrophe as he gears up for showdown with Legia Warsaw Glasgow 2014: <mark>Dan Wallace</mark> steals the show at Tollcross with a kilted entrance and a sensational silver in dramatic final Celtic new Bhoy Jo Inge Berget insists he won't think twice about doing dirty on former mentor <mark>Henning Berg</mark> during Euro crunch THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May .\" data-type = \"fb-share\" data-action = \"article:3935163\" > THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. \"data-type =\" tw-share \"data-action =\" article:3935163 \"> THE Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May .\" data-type = \"email\" data-action = \"article:3935163\" > St Johnstone coach Callum Davidson CALLUM Davidson has told grieving St Johnstone boss <mark>Tommy Wright</mark> he will make sure the players are ready for tomorrow's European showdown with Spartak Trnava. The Saints No. 2 has been charged with preparing the team after <mark>Wright</mark> returned to Northern Ireland following the death of his mother May. <mark>Wright</mark> won't fly back to Scotland until hours before kick-off but Davidson has assured him it will be business as usual on the training ground in the run-up to the Europa League first-leg qualifier. Last season he stepped up to the plate when the Ulsterman underwent gall bladder surgery and was ordered to steer clear of McDiarmid Park during his recuperation. So Davidson has no fears about taking over before the Slovakian side pitch up in Perth. He said: \"It's a little bit different to when <mark>Tommy</mark> was in the hospital. The main thing at the moment is he's with his family, especially his dad .\" They have the funeral to get through and then he'll be back on Thursday. So it's not a problem. \"We have been in constant contact. <mark>Tommy</mark> was the same when he was in hospital - he wants to know everything that's going on .\" He has asked for videos of Spartak Trnava to be sent to him back home. So he'll be watching them, working out the setplays and stuff before speaking to the lads when he's back. \"We'll do a chunk of prep work before the game. We'll sit down with the players and go through some videos we have .\" The good thing about that is things will be fresh in their minds. \"After showing great character to see off Swiss side Luzern in the last round Saints are determined to keep the Euro adventure going. And Davidson believes they are so professional the absence of <mark>Wright</mark> won't be felt in training. He said:\" The boys take care of themselves anyway - you rarely see a bad training session. \"They know what's expected of them and what they expect from themselves. The fact the manager isn't here won't impact on things one bit .\" The boys will make sure their standards are kept high in training. They always do that. \"But Davidson admitted compiling a dossier on the Slovaks has been more challenging than the homework they did on Luzern. The former Scotland full-back said:\" Our scout Ewan Peacock was over watching their last European game so we have a report on them. \"We're also speaking to people who have played Spartak .\" It has been more difficult to get info on them than it was for Luzern but we'll get there. \"They'll be physical. They get the ball forward quickly and are strong at the back. So it's a different test to last week against Luzern .\" It's similar to the Minsk game last year when we lost on penalties after winning away. \"The one thing I would say from the game against the Swiss is we need to improve on our ball retention. We want to be better on the ball .\" If we can keep it tight at home and take our chances then we will have something to take to Slovakia. \"Not losing an away goal would be huge so we'll have that in mind .\" Davidson expects another bumper crowd at McDiarmid Park with fans able to pay at the gate and is thrilled the squad has a clean bill of health. St Johnstone boss <mark>Tommy Wright</mark>: We've won the Scottish Cup - now it's time for a crack at the Europa League See more stories you'll love You've turned off story recommendations. Alex Salmond accused of a \"huge deception' over his plans for a currency union after a Yes vote Smoking gun: Mum's battle with cigs as stats show how second-hand smoke is really harming kids In pictures: Armed police attend routine incident in Glasgow city centre caused by a bus braking suddenly See more stories you'll love You've turned off story recommendations. Glasgow 2014: The complete schedule for Day Seven of the Commonwealth Games Glasgow 2014: Usain Bolt insists he didn't say the Commonwealth Games were' a bit sh **' and that the Olympics were better Glasgow 2014: Waveheart <mark>Dan Wallace</mark> steals the show with kilt stunt and sensational silver in dramatic final Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt\" says Commonwealth Games are \"a bit s ***\" and that the \"Olympics were better\" ' Celtic boss Ronny Deila insists he's not afraid of Champions League catastrophe as he gears up for showdown with Legia Warsaw Glasgow 2014: <mark>Dan Wallace</mark> steals the show at Tollcross with a kilted entrance and a sensational silver in dramatic final Orlando Bloom throws PUNCH at Justin Bieber outside Ibiza restaurant Rangers chairman <mark>David Somers</mark> hits back at fans by insisting he has no plans to sanction the sale of Murray Park Usain Bolt \"says Commonwealth Games are\" a bit s *** \"and that the\" Olympics were better \"' Watch hilarious video of Northern Irish mum shouting at her daughter when she doesn't know how long to go 80 miles at 80mph", "articleID": "2014073018_00052101_W", "names": {"Dan Wallace": ["Q17501740", "Q5214548"], "David Somers": ["Q15526573", "Q16196708", "Q43275382"], "Henning Berg": ["Q123303", "Q343093"], "Jim Mcdonald": ["Q18379036", "Q27915165", "Q47545518", "Q6196786", "Q6196792"], "Tommy Wright": ["Q3531369", "Q7820025", "Q7820027", "Q7820028", "Q981825"]}}, {"date": "2014-07-31", "url": "http://sj-r.com/article/20140730/NEWS/140739942/12662/www.sj-r.com", "content": "State officials will consider targeted reductions in historic site hours after Labor Day - including in Springfield - to ease the effects of budget cuts. Illinois Historic Preservation Agency Director Amy Martin said Wednesday that the agency is working on specifics and will attempt to maintain hours as much as possible at the most popular sites, including Abraham Lincoln sites. More than 1.3 million people visited eight state historic sites in Springfield and Petersburg in 2013, according to agency figures. \"We wanted to make it through the Labor Day holiday to accommodate people who have travel plans,\" Martin said after an Illinois Tourism Office event at Dana-Thomas House in Springfield. \"We're looking at trying to target it so that it's not all 26 sites .\" The agency budget for historic site operations was cut by $1.1 million for the fiscal year that started July 1, or 19 percent below the previous year. Martin said post-Labor Day hours also would take into account traditional fall visits by school groups. \"We have so many school groups coming in, and we don't want to affect those,\" Martin said. \"Teachers plan those so far in advance as well .\" Agency spokesman <mark>Chris Wills</mark> said discussions continue with legislative leaders for restoration of the $1.1 million early next year. \"That's what they cut, and that's what we would hope they'd put back,\" <mark>Wills</mark> said. \"It's not like we're going back to a level that would be an improvement .\" State Senate President John Cullerton, a Chicago Democrat, told The State Journal-Register editorial board last month that restoration of historic site funding should be a priority. <mark>Wills</mark> said lawmakers likely would not act on the restoration request until January. Lincoln's New Salem State Historic Site in Petersburg was the busiest local historic site in 2013 with more than 376,000 visitors, followed by a little more than 358,000 visitors at the Lincoln Tomb, and 321,000 at the Abraham Lincoln Presidential Library and Museum. *** Historic site visits in 2013 * Lincoln's New Salem State Historic Site: 376,463 * Lincoln Tomb: 358,142 * Abraham Lincoln Presidential Library and Museum: 321,071 * War Memorials: 152,040 * Old State Capitol: 109,687 * Lincoln-Herndon Law Offices: 29,066 * Dana-Thomas House: 23,893 * Vachel Lindsay Home: 3,530 Source: Illinois Historic Preservation Agency Contact Tim Landis: 788-1536, tim.landis @ sj-r.com, twitter.com/timlandisSJR.", "articleID": "2014073113_00020415_W", "names": {"Chris Wills": ["Q5108490", "Q56754189"]}}, {"date": "2014-08-01", "url": "http://superbike-news.co.uk/wordpress/Motorcycle-News/local-contender-bridewell-outpaces-byrne-as-top-16-separated-by-0-994s-in-free-practice/", "content": "Tommy Bridewell fired in a late scorcher to out-gun series leader <mark>Shane</mark> \"Shakey\" <mark>Byrne</mark> in the opening free practice for Sunday's sixth round of the MCE Insurance British Superbike Championship at the high-speed Thruxton circuit. The top 16 riders were covered by an incredible 0.994 s ahead of tomorrow's Datatag Qualifying session. Milwaukee Yamaha's Bridewell has just returned from competing in last Sunday's Suzuka Eight Hour race in Japan and he fired in a stunning time of 1m 15.845 secs late on in the second session. However <mark>Byrne</mark> responded instantly, closing within 0.039 s of Bridewell in the final minutes. Bridewell, based in nearby Devizes, was delighted with his performance at a circuit on which he has not had enjoyed good results in previous years. \"We have worked on the setting of the bike and it is working out just perfect. The bike feels really strong and the engine is fast so I am just enjoying my riding. Now we have to keep working hard and pushing ready for the races as that is what is important, but it is nice to be fastest today .\" <mark>Byrne</mark> in contrast has a strong pedigree at the Hampshire circuit, including a win double last year, and though he finished the day second. He said: \"I absolutely love riding this circuit, it's a bit like the M25, fast, flowing and wide and while we still have things to try, I'm feeling good. We had new brake discs to try and my first flying lap of the morning was actually faster than my fastest race lap of last year so that was a good starter .\" <mark>Michael Rutter</mark> set the third fastest time on the Bathams BMW, just eclipsing the Czech Republic rider Jakub Smrz on the Millsport Ducati and Buildbase BMW's Ryuichi Kiyonari, who like <mark>Byrne</mark>, is chasing a record fourth British title. Dan Linfoot, riding for the Bournemouth-based Quattro Plant Kawasaki team and Peter Hickman on the RAF Reserves Honda eased Aussie Josh Brookes on the second Milwaukee Yamaha back into eighth place. Lloyds British GBmoto Racing Kawasaki's <mark>Chris Walker</mark> and Anvil Hire TAG Kawasaki's <mark>Richard Cooper</mark> completed the top ten in a closely fought session. Josh Waters, the winner of the wet second race last time out at Brands Hatch, was sixteenth fastest on his Tyco Suzuki, but still less than a second off Bridewell. Results Free practice one: 1: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) 1m:16.020 s 2: Tommy Bridewell (Milwaukee Yamaha) +0.691 s 3: Josh Brookes (Milwaukee Yamaha) +0.903 s 4: Peter Hickman (RAF Reserves Honda) +0.947 s 5: <mark>Richard Cooper</mark> (Anvil Hire TAG Kawasaki) +0.958 s 6: Ryuichi Kiyonari (Buildbase BMW) +0.998 s Free practice two: 1: Tommy Bridewell (Milwaukee Yamaha) 1m:15.845 s 2: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) +0.039 s 3: <mark>Michael Rutter</mark> (Bathams BMW) +0.093 s 4: Jakub Smrz (Millsport Ducati) +0.199 s MCE British Superbike Contenders Feel the Need for Speed at Thruxton", "articleID": "2014080200_00049277_W", "names": {"Chris Walker": ["Q16196322", "Q21020894", "Q22811338", "Q2920788", "Q3675577", "Q42370515", "Q5108393", "Q5108394", "Q5108395", "Q5108396", "Q606715"]}}]