[{"date": "2014-08-01", "url": "http://superbike-news.co.uk/wordpress/Motorcycle-News/local-contender-bridewell-outpaces-byrne-as-top-16-separated-by-0-994s-in-free-practice/", "content": "Tommy Bridewell fired in a late scorcher to out-gun series leader <mark>Shane</mark> \"Shakey\" <mark>Byrne</mark> in the opening free practice for Sunday's sixth round of the MCE Insurance British Superbike Championship at the high-speed Thruxton circuit. The top 16 riders were covered by an incredible 0.994 s ahead of tomorrow's Datatag Qualifying session. Milwaukee Yamaha's Bridewell has just returned from competing in last Sunday's Suzuka Eight Hour race in Japan and he fired in a stunning time of 1m 15.845 secs late on in the second session. However <mark>Byrne</mark> responded instantly, closing within 0.039 s of Bridewell in the final minutes. Bridewell, based in nearby Devizes, was delighted with his performance at a circuit on which he has not had enjoyed good results in previous years. \"We have worked on the setting of the bike and it is working out just perfect. The bike feels really strong and the engine is fast so I am just enjoying my riding. Now we have to keep working hard and pushing ready for the races as that is what is important, but it is nice to be fastest today .\" <mark>Byrne</mark> in contrast has a strong pedigree at the Hampshire circuit, including a win double last year, and though he finished the day second. He said: \"I absolutely love riding this circuit, it's a bit like the M25, fast, flowing and wide and while we still have things to try, I'm feeling good. We had new brake discs to try and my first flying lap of the morning was actually faster than my fastest race lap of last year so that was a good starter .\" <mark>Michael Rutter</mark> set the third fastest time on the Bathams BMW, just eclipsing the Czech Republic rider Jakub Smrz on the Millsport Ducati and Buildbase BMW's Ryuichi Kiyonari, who like <mark>Byrne</mark>, is chasing a record fourth British title. Dan Linfoot, riding for the Bournemouth-based Quattro Plant Kawasaki team and Peter Hickman on the RAF Reserves Honda eased Aussie Josh Brookes on the second Milwaukee Yamaha back into eighth place. Lloyds British GBmoto Racing Kawasaki's <mark>Chris Walker</mark> and Anvil Hire TAG Kawasaki's <mark>Richard Cooper</mark> completed the top ten in a closely fought session. Josh Waters, the winner of the wet second race last time out at Brands Hatch, was sixteenth fastest on his Tyco Suzuki, but still less than a second off Bridewell. Results Free practice one: 1: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) 1m:16.020 s 2: Tommy Bridewell (Milwaukee Yamaha) +0.691 s 3: Josh Brookes (Milwaukee Yamaha) +0.903 s 4: Peter Hickman (RAF Reserves Honda) +0.947 s 5: <mark>Richard Cooper</mark> (Anvil Hire TAG Kawasaki) +0.958 s 6: Ryuichi Kiyonari (Buildbase BMW) +0.998 s Free practice two: 1: Tommy Bridewell (Milwaukee Yamaha) 1m:15.845 s 2: <mark>Shane Byrne</mark> (Rapid Solicitors Kawasaki) +0.039 s 3: <mark>Michael Rutter</mark> (Bathams BMW) +0.093 s 4: Jakub Smrz (Millsport Ducati) +0.199 s MCE British Superbike Contenders Feel the Need for Speed at Thruxton", "articleID": "2014080200_00049277_W", "names": {"Michael Rutter": ["Q3856254", "Q3856256", "Q47703212"], "Richard Cooper": ["Q16239345", "Q42758637", "Q5272785", "Q58193561", "Q7324878", "Q7324881", "Q7324882", "Q7324883", "Q7324884"], "Shane Byrne": ["Q1150486", "Q3481354", "Q7488001"]}}, {"date": "2014-08-01", "url": "http://www.npr.org/2014/08/01/337130171/no-forgiveness-but-a-kind-of-cinematic-grace-in-calvary?ft=1&f=", "content": "hide caption <mark>Brendan Gleeson</mark>, as tough-minded Father James, faces a death threat from an angry parishioner in the darkly comic new <mark>Brendan Gleeson</mark>, as tough-minded Father James, faces a death threat from an angry parishioner in the darkly comic new Reprisal Films Ireland's barrel-chested force of nature <mark>Brendan Gleeson</mark> plays a priest who has a date with murder in Calvary, John Michael McDonagh's comic but darkly existential detective story. The film continues a winning streak for the actor/director team after their terrific comic thriller (and all-time Irish indie box office champ) The Guard, in which <mark>Gleeson</mark> played a surly, often three-sheets-to-the-wind but undeniably effective cop. Calvary, which is apparently the second installment in a planned trilogy (the concluding chapter will be called \"That's a startling opening line,\" observes the tough-minded priest. But the unseen parishioner is not out to startle; he wants to cause pain to match what he's been bottling up for decades. Raped repeatedly as a child by a priest who has since died, he is now hellbent on an irrational act of retribution. \"I'm going to kill you, Father,\" he says calmly. \"There's no point in killing a bad priest. I'm going to kill you because you're innocent .\" Sunday-a-week ought to give him time to put his house in order, he says, and leaves the confessional. \"Calvary is bleak and corrosively funny in about equal measure, with the rugged grey/green landscape suiting the harshness of the village's attitudes about the Church, and repentance, and the worth of good works. Father James, a widower and recovering alcoholic who came late to the priesthood, and has found it suits him, appears as unprepared for this turn of events as we are. But there's a hierarchy to guide him (albeit, one that turns out not to be much help), and pastoral duties to occupy his time. Now, while the priest knows who's threatening him, we don't. And as he makes the rounds of his parish, talking with the police inspector (but not about the threat because the inspector's male prostitute is there), or arguing religion with a squire whose wealth brings him only bitterness, you start to realize pretty much any of his parishioners could be the one. Well, maybe not the jailed rapist cannibal (played in a nice bit of perverse casting by <mark>Gleeson</mark>'s son Domnall), but certainly the arsonists, adulterers, and coke-snorting doctors in his flock. Their callousness leaves Father James regularly astonished. Us, too, and all the while, the clock keeps ticking towards Sunday-a-week. Calvary is bleak and corrosively funny in about equal measure, with the rugged grey/green landscape suiting the harshness of the village's attitudes about the Church, and repentance, and the worth of good works. It is also so clearheaded about the human cost of the church's abuse scandals that it qualifies as something of a leap of faith in its own right. A leap past the forgiveness preached in last year's Oscar nominee, Movie Reviews No Forgiveness, But A Kind Of Cinematic Grace In\" Calvary' Sign In / Register Please keep your community civil. All comments must follow the", "articleID": "2014080202_00039679_W", "names": {"Brendan Gleeson": ["Q206659", "Q58170328"]}}, {"date": "2014-08-03", "url": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/xsczhXU-rnA", "content": "meta itemprop = \"alternativeHeadline\" content = \"One-time NFL hopeful gets second shot at league\" > Derailed NFL hopeful gets new chance at football life media/2014/08 \\ / 02/314596931636/EN _ EVANS_080214_260181_796. mp4 \",\" firstmediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_740. mp4 \",\" firstmediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_240. mp4 \",\" firstmediaHlsURI \":\" http: \\ / \\ / ipad-streaming. cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260199_tablet. m3u8 \",\" firstmpxRefId \":\" iJQ74i0ubtfI_r_zmVeaF00_XYqTfFmt \",\" firstDuration \":136,\" playerWidth \":\" 620 \",\" playerHeight \":\" 387 \"}' data-component =' [\"genericPlaylist\" ]'> media/2014/08 \\ / 03/314601539945/EN _ DAGATAPETERSENv2_080214_260203_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314601539945 \\ / EN_DAGATAPETERSENv2_080214_260203_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314601539945 \\ / EN_DAGATAPETERSENv2_080214_260203_240. mp4 \"}}' data-pid =\" dWcgmMn45fe _ \"> Israeli PM: Expect no let-up in tunnel-clearing mi...media/2014/08 \\ / 03/314603075572/EN _ ARENAS_080214_260201_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314603075572 \\ / EN_ARENAS_080214_260201_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/03/314603075572 \\ / EN_ARENAS_080214_260201_240. mp4\" }}' data-pid = \"Pg1JzBHDq_Pr\" > Ebola patient brought to U.S. for medical treatmen...media/2014/08 \\ / 02/314596419688/EN _ FISCHER_080214_260180_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419688 \\ / EN_FISCHER_080214_260180_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419688 \\ / EN_FISCHER_080214_260180_240. mp4 \"}}' data-pid =\" xbUvrdKVfY2L \"> Potentially dangerous thunderstorms move through N.. . media/2014/08 \\ / 02/314596419686/EN _ NAIR_800214_260179_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419686 \\ / EN_NAIR_800214_260179_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596419686 \\ / EN_NAIR_800214_260179_240. mp4\" }}' data-pid = \"jC6Yhmb7gYb7\" > Was ex-Virginia first family's relationship with b.. . media/2014/08 \\ / 02/314596931636/EN _ EVANS_080214_260181_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/02/314596931636 \\ / EN_EVANS_080214_260181_240. mp4 \"}}' data-pid =\" 74wf6Lma52eC \"> Wrongfully convicted standout linebacker gets work...media/2014/08 \\ / 01/314469955560/EN _ 080114_Mason_259943_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314469955560 \\ / EN_080114_Mason_259943_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314469955560 \\ / EN_080114_Mason_259943_240. mp4\" }}' data-pid = \"ggFodsWp9Zrp\" > Economy adds 209,000 jobs, unemployment at 6.2 per...media/2014/08 \\ / 01/314468931791/EN _ 080114_Blackstone_259947_796. mp4 \",\" mediaRtmpMobileHighURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314468931791 \\ / EN_080114_Blackstone_259947_740. mp4 \",\" mediaRtmpMobileLowURI \":\" http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314468931791 \\ / EN_080114_Blackstone_259947_240. mp4 \"}}' data-pid =\" nuYOBrjKwQoS \"> Colo. working to keep edible marijuana away from c.. . media/2014/08 \\ / 01/314466371534/en _ 0801_lapook_259914_796. mp4\" , \"mediaRtmpMobileHighURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314466371534 \\ / en_0801_lapook_259914_740. mp4\" , \"mediaRtmpMobileLowURI\" : \"http: \\ / \\ / download.cbsnews.com \\ / media/mpx/2014 \\ / 08/01/314466371534 \\ / en_0801_lapook_259914_240. mp4\" }}' data-pid = \"dfVhAk2MAZM8\" > <mark>Brian Banks</mark> was an NFL hopeful several years back, but his career was derailed by a wrongful criminal conviction. On Saturday, his long search for vindication turned an important corner. CBS News correspondent Carter Evans spoke with him. \"I am honored to say I've taken an amazing position with the front office of the NFL,\" <mark>Banks</mark> wrote on his Facebook page. He'll be a manager in the football operations department. He says it's just now sinking in. It's an opportunity of a lifetime, it's something that at one point in my life, I would have never [thought] of happening. <mark>Banks</mark> had been accused by a high school classmate of a rape that never happened. He was just 16, a star linebacker at Long Beach Poly High, with a full-ride scholarship waiting for him at USC and a dream to play in the NFL. \"All I had to do was play my senior year,\" he said. \"The biggest year of my life .\" But it never happened. He spent five years in prison and another four on probation before his alleged victim admitted she made it all up. When <mark>Banks</mark> was exonerated in 2012, his story gained national attention, including a profile on 60 minutes. Even though he'd lost 10 years, he hoped--against all odds--that he could still make it in the NFL. He tried out for the Seattle Seahawks and finally took the field in a pre-season game last year with the Atlanta Falcons. \"It's a dream come true,\" he said. \"And if it all ended today, you know: Mom, I did it. <mark>Banks</mark> was always realistic about his chances of making it in the NFL and his career on the field, ended with that game .\" I chased the dream and I will continue to chase it as long as I can, but when it's over, that means it's just new beginnings in other places of my life. \"That included motivational speaking, where he caught the attention of NFL commissioner Roger Goodell, and a new job .\" I just cannot wait to be in New York, working with the NFL, \"said <mark>Banks</mark>.\" Just continuing to use success as a response to everything I've been though in my life. \"In the end, his success off the field led him back to pro football.", "articleID": "2014080308_00034834_W", "names": {"Brian Banks": ["Q16240818", "Q22079589", "Q4963038", "Q4963043"]}}, {"date": "2014-08-03", "url": "http://www.nwaonline.com/news/2014/aug/03/springdale-starts-study-on-regional-slu/", "content": "Northwest Arkansas considers a regional approach to treating, processing biosolids from wastewater. Posted: August 3, 2014 at 1:30 a.m. ROGERS--<mark>Robert Moore</mark> dipped his hand into a 5-foot-tall, waterproof bag and brought out a handful of what looked like rich topsoil. \"The pathogens are gone,\" said <mark>Moore</mark>, plant manager of the Rogers Pollution Control Facility. \"Plants can grow in this .\" Raw Sewage Thousands of U.S. cities dumped raw sewage directly into rivers, lakes and bays 30 years ago, but federal and state laws have cleaned up the waterways, and made them safer. The treated residuals from wastewater treatment, known as biosolids or sludge, can be safely recycled. Fast Fact Drying System Rogers uses a Therma-Flite Bio-Scru sludge drying system that uses continuous flow processing. The process reduces the smell, which is notorious to wastewater treatment facilities, and is energy efficient. Source: Staff Report Rogers is among about 10 Arkansas cities to use a dryer system to turn sludge, or organic matter in wastewater, into something considered to be, basically, fertilizer. Bentonville and Fayetteville have similar drying facilities, but Rogers' process has drawn the attention of Northwest Arkansas wastewater officials who are considering building a regional sludge-processing facility. The facility would be the first known of its kind, according to the Arkansas Department of Environmental Quality. Heath Ward, Springdale Water Utilities executive director, announced last month the city hired McClelland Consulting Engineers to study the feasibility of a regional facility--something that could handle Springdale's roughly 23,000 tons of wet sludge produced annually, and have room to grow. The facility would be located on land near the Northwest Arkansas Conservation Authority wastewater treatment plant, west of Cave Springs. A regional facility with a dryer could take three years to get off the ground and cost millions, Ward said. He hopes the sludge study is finished in December or January, around the same time the city's master plan study should wrap up. \"I think (a regional facility) would be beneficial to Springdale short term, but to Northwest Arkansas long term,\" Ward said. Ward is interested in emulating Rogers because the city's facility creates a product that is \"clean\" and can be sold. <mark>Moore</mark> rolled the dirt-like material fresh from the Rogers dryer in his palm. The bacteria is gone. The product is safe, he said. Sludge processed through the dryer can go on parks, playgrounds and farms, according to a brochure on the technology provided by <mark>Moore</mark>. Authorities are so interested in Springdale's regional idea--an idea reminiscent of the organization's original mission--the Northwest Arkansas Conservation Authority board approved a resolution supporting the city's study July 17. Board members, including Bentonville Mayor Bob McCaslin, called the regional concept a good one. Springdale will pay between $100,000 and $120,000 for the study, Ward said. The city plans to pay for the study, and pay for construction and for operations, at least initially, said Chris Weiser, chairman of the Springdale Water and Sewer Commission. Springdale wants a facility that can expand as other cities decide to use it, Ward said. Ideally, operations, and the facility, would be turned over to the authority eventually, he said. Springdale would lay the \"footprint\" of a facility that could help Northwest Arkansas as a whole. \"It's something we need to look at for the future,\" Ward said. \"We are part of a region. It would take care of our problem--there's our benefit--and it might have a benefit for others .\" Selling Sludge Rogers sold its processed sludge in July for $17.66 a ton to an out-of-state company, <mark>Moore</mark> said. The sale was the first time Rogers sold its processed material. Previously, Rogers had to pay landfill after landfill to take the city's sludge--about 10 truckloads a day or 10,400 wet tons a year. By heating and drying its sludge, Rogers will earn about $40,000 a year, instead of paying about $38 a ton for removal, <mark>Moore</mark> said. The revenue won't immediately recoup the cost for installing and running the $3.4 million Therma-Flite dryer system, but it will pay for some expenses, <mark>Moore</mark> said. Other communities are paying attention. Ward toured Rogers' wastewater facility at least once in the past few months, <mark>Moore</mark> said. On a sunny, summer day, the building that houses the dryer is swept clean. A rake used to clean out dehydrated semi-solids sits on top of the chamber dryer. Workers continually clean the chamber, watch the temperatures and maintain the machine, <mark>Moore</mark> said. Since taking over operations of the drying system in 2013, the city has had no real problems with the dryer, said David Staib, operations supervisor. The dryer is better for Rogers and the environment, he said. \"It's the wave of the future,\" Staib said. Shrinking Landfills The dryer in Rogers will meet the city's needs for another 20 years, but small cities in Northwest Arkansas don't have good options for sludge removal, <mark>Moore</mark> said. Landfills are turning away cities, the amount of sludge produced is growing and costs to cities are going up, Ward and others said. \"It's a big deal,\" Ward said. \"Something has got to be done with it .\" Landfill space is becoming more valuable, said Billy Ammons, regional business manager at CH2M Hill, the company that operates two wastewater plants in Fayetteville. \"Everybody is going to have an issue at one time or another,\" Ammons said. Springdale spends $1 million a year to remove its sludge, but that amount could double if Waste Management stops accepting sludge, Ward said. Springdale has a good relationship with Waste Management, but the landfill stops taking sludge if the amount exceeds 15 percent of the total solid waste coming in on any given day, said George Wheatley, Waste Management spokesman. Adding too much sludge or wet-food byproducts to the landfill impacts its structural integrity, Wheatley said. The landfill wouldn't be able to support the heavy equipment and dump trucks. \"There have been other cities that have brought their sludge to us, but we've had to turn them away for different reasons,\" Wheatley said. Nationwide, a growing number of states are trying to eliminate sludge and similar material from landfills, said Jennah Durant, U.S. Environmental Protection Agency spokeswoman, in an email. Many areas are looking at regional approaches to deal with sludge, she said. More Sludge At the same time landfills are cutting back, Northwest Arkansas' population is growing and producing more, wastewater experts said. The Northwest Arkansas Council used U.S. Census Bureau data earlier this year to determine the area's population grew to about 500,000 in May, said <mark>Rob Smith</mark>, council spokesman. In Springdale, the amount of sludge the city produces has been creeping up for the past few years, said <mark>Brad Stewart</mark>, pretreatment manager. The city produced sludge at a rate of about 1,800 wet tons per month on average in 2011-12, compared to about 1,900 a year later, <mark>Stewart</mark> said. The authority's treatment facility hauled off 30 percent more sludge this year over the same time a year ago, said Rick McClain, facility manager. \"Our cost for sludge, in the budget, has increased because I'm hauling more sludge than I did a year ago,\" McClain said. Hauling away about 3,600 wet tons of sludge per year costs the authority about $120,000, McClain said. Costs will continue to rise, he said. Between the environment and rising costs, something must change soon, <mark>Moore</mark> and Ward said. They both said they are interested in keeping sludge out of landfills and producing a safe product. Copyright © 2014, NWA Media. All rights reserved. This document may not be reprinted without the express written permission of NWA Media. Please read our contact us. Material from the Associated Press is Copyright © 2010, Associated Press and may not be published, broadcast, rewritten, or redistributed. Associated Press text, photo, graphic, audio and/or video material shall not be published, broadcast, rewritten for broadcast or publication or redistributed directly or indirectly in any medium. Neither these AP materials nor any portion thereof may be stored in a computer except for personal and noncommercial use. The AP will not be held liable for any delays, inaccuracies, errors or omissions therefrom or in the transmission or delivery of all or any part thereof or for any damages arising from any of the foregoing. All rights reserved. We hope you've enjoyed your preview of NWAonline.com. You've now read the maximum number of stories available without a subscription.", "articleID": "2014080313_00037800_W", "names": {"Brad Stewart": ["Q1523176", "Q2923441"], "Rob Smith": ["Q16847100", "Q16931899", "Q17198726", "Q21151369", "Q28868156", "Q3434235", "Q5206244", "Q7340559", "Q7340561", "Q7340562", "Q7340564"], "Robert Moore": ["Q18636266", "Q21453623", "Q42887786", "Q59260611", "Q7347771", "Q7347775", "Q7347776"]}}, {"date": "2014-08-07", "url": "http://providencejournal.com/sports/red-sox/content/20140806-kelly-johnson-to-be-activated-mookie-betts-might-be-odd-man-out.ece", "content": "ST. LOUIS - Utility man <mark>Kelly Johnson</mark>, acquired from the Yankees in exchange for Stephen Drew at the trade deadline, is scheduled to be activated off the disabled list and join the Red Sox on Thursday in St. Louis. <mark>Johnson</mark> has been out since July 22 with a strained left groin. With <mark>Johnson</mark> coming back, it might be time for Mookie Betts to be sent back down to Pawtucket. Betts was in the starting lineup on Wednesday for the second time since being recalled Aug. 1. He's started 11 of the 19 games he's been active for Boston. The 21-year-old could probably use more regular playing time than that, especially with Brock Holt already spelling Jackie Bradley Jr. on occasion in center. \"You strive to find ways to make sure that his time here isn't just spent on the bench because he's got ability, he's got talent,\" manager <mark>John Farrell</mark> said. \"It's important for us to get a minimum number of games played per week .\" \"It's a little bit of a balance,\" said general manager Ben Cherington. \"We think he is a major-league player for us and will be a good one for a long time. At some point, he has to get more and more exposure to that to make that transition. On the other hand, he's got to play .\" <mark>Farrell</mark> has stated on multiple occasions that he would like to keep Holt in the lineup at the leadoff spot as much as possible, while also finding regular time for Bradley, Xander Bogaerts and Will Middlebrooks. \"<mark>John</mark> is doing the best he can to get guys in the lineup as much as possible,\" Cherington said. \"If it becomes a situation where we can't find enough playing time for a guy that we are trying to find something out about or that needs to play more for development, then we may have to make a decision on that .\" It's really more of a question of allocating playing time the right way. If that becomes too much of a challenge, then we'll find a way to ease that up and allow <mark>John</mark> to have an easier mix. We certainly don't want to get to the end of the year and look back and think, \"Boy, I wish we had gotten 60 more at-bats for this guy .' That would be inconsistent with what we need to do .\" Twitter: @ TimBritton", "articleID": "2014080707_00045775_W", "names": {"John Farrell": ["Q1017017", "Q17916883", "Q46168067", "Q56723519", "Q6232765", "Q6232766"], "Kelly Johnson": ["Q3194896", "Q35655353", "Q6386108"]}}]