[{"articleID": "2011070123_00003124_W", "names": {"Aaron Lewis": ["Q302280", "Q57053098"], "Charlie Daniels": ["Q5084755", "Q5084757", "Q551478"]}, "date": "2011-07-01", "url": "http://mlive.com/entertainment/muskegon/index.ssf/2011/07/15_gets_you_in_all_day_at_summ.html", "content": "chronicle file photo fireworks explode over the flag on top of donnie's barbecue smokehouse stand at heritage landing during the final night at the muskegon summer celebration sunday. date shot: 7/7/02. muskegon - even with its heyday two generations behind it, a onetime a-list rock band like the eagles wouldn't fly at muskegon summer celebration. \"the eagles are quite costly,\" said tanya gonzalez, assistant executive director of the annual festival. instead, the fourth of july party at heritage landing on monday will feature the eagles tribute band hotel california. top billing will go to the evening fireworks display. \"for us on july 4th, the fireworks are the real show,\" gonzalez said. \"we made a choice to put a lot of money into the fireworks and give the community a great show. so that doesn't leave quite as much for entertainment .\" we still want to have good family entertainment, so the best way to do that is to look at some tribute bands, (and) smaller national acts, great regional bands, that sort of thing. \"summer celebration schedule today:? snake pit food tent, heritage landing, noon to 11 p.m.? midway, heritage landing, noon to 11 p.m.? pirate island, midway, 2 p.m., 4 p.m., 6 p.m. and 8 p.m.? fourth of july fireworks, heritage landing, 10:20 p.m. music:? nick stevenson, tiki stage, 6-10 p.m.? dutch henry, main stage, heritage landing, 4:30 p.m.? gunnar & the grizzly bears, main stage, heritage landing, 5:30 p.m.? smokin' joe kubek, main stage, heritage landing, 7:15 p.m.? hotel california - a salute to the eagles, main stage, heritage landing, 9 p.m. tuesday off day wednesday? sand sculpture contest, pere marquette beach, 10 a.m. to 4 p.m.? snake pit food tent, heritage landing, 4-11 p.m.? midway, heritage landing, 4-11 p.m.? banana derby, midway, 6 p.m. and 8 p.m. music:? scott sheldon, tiki stage, 6-10 p.m.? brian lorente and the usual suspects, main stage, heritage landing, 6:30 p.m.? <mark>aaron lewis</mark>, main stage, heritage landing, 7:30 p.m.? <mark>charlie daniels</mark> band, main stage, heritage landing, 8:30 p.m. last year, the festival booked an independence day lineup that brought two tribute bands to the main stage: one that covered hits of jimmy buffett, the other that covered pink floyd. tanya gonzalez there was an estimated 14,000 people in the concert venue to watch the fireworks, gonzalez said .\" attendance was quite good. it was one of the better-attended shows. \"gonzalez estimated more than 200,000 people viewed last year's fireworks from locations on and around muskegon lake. as for this year, she said, festival personnel are expecting\" lots of people. but we're doing something completely different for july fourth this year. \"what the festival is doing is offering an all-day pass for $15. that pass will admit holders not only to the concert and the traditional nightcap fireworks display but also unlimited rides at the festival's midway. pass holders will be allowed to come and go from the heritage landing festival ground throughout the day and night, gonzalez said. despite what some detractors contend, muskegon summer celebration is not primarily a beer blast. at its heart is a sense of community .\" yeah, we have some shows that are a little more harder rocking shows, but there really has been a variety of acts, \"in past years, gonzalez said .\" the festival is not intended to be an all-night (drinking) party. \"it is a big party, where people come together, find their friends that they haven't seen in a while. they get together. they enjoy each other's company. that's what (this) party is all about. we're pretty successful in providing a place where people can come together and enjoy each other .\" hotel california, whose name is the title is one of the eagles' biggest hits and whose billing is subtitled \"a salute to the eagles,\" was founded after the eagles disbanded in 1982. although the eagles have played at reunion tours, hotel california remains so busy covering eagles hits that the tribute band plays 150 to 200 dates annually. one of the most successful rock acts of the 1970s, the eagles quartet was founded in 1971. original members were glenn frey, don henley, bernie leadon and randy meisner. after the eagles broke up, frey and henley enjoyed successful solo careers. www.selu.edu the eagles tribute band hotel california will take the stage monday at the summer celebration's fourth of july party. among the eagles hits that hotel california covers are \"take it easy,\" \"lyin' eyes,\" \"heartache tonight,\" \"witchy woman,\" \"one of those nights,\" \"peaceful easy feeling,\" \"desperado,\" \"tequila sunrise\" and, of course, \"hotel california .\" during its heyday, the eagles won six grammy awards and five american music awards, as well as scoring five no. 1-ranked singles and six no. 1 albums. hotel california is a quintet that performs not only eagles hits, but also hits of some other '70s bands. performances can turn into sing-alongs, not just for older people who were young when the eagles rose to fame, but also young people who have embraced the eagles. \"they're primarily going to...play a lot of songs that you will remember, a lot of songs that people will recognize,\" gonzalez said. \"even a lot of younger kids are excited about the eagles tribute band because they like the eagles. it bridges a generation gap, so to speak .\" also performing on the main stage monday will be: west michigan alternative-country band dutch henry at 4:30 p.m.; kentucky country rocker artie dean harris at 5:30 p.m.; and blues artists joe kubek and bnois king at 7:15 p.m. hotel california is scheduled to hit the stage at 8:45 p.m. american fireworks of cleveland will handle the fireworks display scheduled at 10:20 p.m. the fireworks will be choreographed to music."}, {"articleID": "2016090807_00095250_W", "names": {"Kim Jong-Un": ["Q10855883", "Q56226"]}, "date": "2016-09-08", "url": "http://www.canindia.com/n-korea-rejects-un-censure-of-missile-test/", "content": "Pyongyang, Sep 8 (IANS) North Korea on Thursday strongly criticised the UN Security Council's condemnation of its latest ballistic missiles test. <mark>Kim Jong-un</mark>'s regime said it \"categorically rejects\" the declaration and considers it \"an intolerable act of encroaching upon its dignity, right to existence, sovereignty and right to self defence\" , EFE news cited KCNA as saying. The UN executive body on Tuesday released a unanimous declaration by all member countries, strongly condemning the latest ballistic missile tests by North Korea. It also urged Pyongyang to stop violating UN resolutions that prohibit the country from developing or testing ballistic missile technology. North Korea on Monday test-fired three ballistic missiles from Hwangju in North Hwanghae province at around 12.14 p.m.. The launch was the first since the successful firing of a submarine-launched missile on August 24. It said the recent launch was conducted successfully without harming the security of neighbouring countries or the international waters. In its declaration, the UN also urged all countries to \"redouble their efforts\" to ensure that the existing sanctions against North Korea are fully implemented and warned of the possibility of fresh sanctions against Pyongyang. The UN Security Council imposed strong sanctions against North Korea in March, following nuclear and long-range missile tests by the country in January and February, respectively .--IANS ss/dg Tags countries country North Korea right"}, {"articleID": "2012061115_00013152_W", "names": {"Gordon Brown": ["Q10648", "Q1537981", "Q18763895", "Q20979218", "Q3110844", "Q5584912", "Q5584914", "Q5584916", "Q5584919", "Q5584920", "Q5584921", "Q57428588", "Q59312133"], "George Osborne": ["Q18527503", "Q332493", "Q47452635", "Q5543055"], "David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2012-06-11", "url": "http://cbsnews.com/8301-505245_162-57450238/former-uk-pm-brown-murdoch-tabloid-undermined-war/", "content": "former uk pm <mark>brown</mark>: murdoch tabloid undermined war london? former british prime minister <mark>gordon brown</mark> on monday accused a rupert murdoch-owned tabloid of personally attacking him, failing the british people and undermining the war in afghanistan through its coverage of the conflict. in an often bitter attack on the murdoch press in testimony to britain's media ethics inquiry, <mark>brown</mark> directly contradicted murdoch's claim that the then-prime minister had made an abusive phone call to the media mogul in 2009. murdoch told the inquiry last month that <mark>brown</mark> had vowed to \"make war on your company\" after the sun switched its support to the conservatives. \"it didn't happen,\" said <mark>brown</mark>, adding that he had been shocked to hear murdoch make the allegation under oath. murdoch's news international fired back, saying in a statement that the mogul stood by his testimony. <mark>brown</mark> is the first in a string of current and former political leaders to appear this week at the inquiry, set up amid a tabloid phone hacking scandal to examine malpractice in the media and ties among politicians, police and the press. among the issues the inquiry is addressing is whether newspapers have too much power over the political agenda. <mark>brown</mark> told the judge-led inquiry that the sun newspaper was guilty of \"the conflation of fact and opinion\" in its coverage of the afghanistan conflict and of his premiership. he said that instead of covering the difficult decisions facing his government, the sun had concluded \"that i personally did not care about our troops in afghanistan .\" he said the newspaper had made a series of spurious claims, for example that he had fallen asleep during a service of remembrance for dead troops. <mark>brown</mark> said he had been bowing his head in prayer. <mark>brown</mark> asserted that the sun's coverage had done \"huge damage\" to the war effort. the former prime minister said the press had \"failed this country\" by focusing on opinions and ephemera when the war in afghanistan was at a crucial stage. \"i'm afraid half the country (afghanistan) is falling into the hands of the taliban,\" <mark>brown</mark> said, accusing the press of failing to reflect this. the sun's political editor, tom newton dunn, denied <mark>brown</mark>'s allegations, saying on twitter that the newspaper had given the conflict prominent coverage. \"military loathed <mark>brown</mark> because they felt he didn't care about them. sun reported that, but <mark>gordon</mark> rewrites history to shoot the messenger,\" he tweeted. <mark>brown</mark> had a testy relationship with the powerful murdoch press during his 2007-2010 term in office. the sun, renowned for its political clout, backed the conservative party over <mark>brown</mark>'s labour in the 2010 national election. the election ejected <mark>brown</mark> from power and produced a conservative-liberal democrat coalition government. two years on, <mark>brown</mark> appeared bruised by his relationship with a press that often characterized him as prickly and awkward. <mark>brown</mark> also spoke of his pain at seeing leaked details of his young son's health splashed in the tabloid. the sun revealed in 2006 that <mark>brown</mark>'s infant son fraser had been diagnosed with cystic fibrosis. <mark>brown</mark> said he and his wife sarah had been distressed by the leak? which apparently came from a hospital worker? but acknowledged that sarah had remained friendly with rebekah brooks, the sun's then-editor, and even organized a 40th birthday party for her in 2008. \"i think sarah is one of the most forgiving people i know,\" <mark>brown</mark> said. \"i think she finds the good in everyone .\" brooks, 44, along with her husband and four aides, was charged last month with conspiring to pervert the course of justice in connection with the phone hacking scandal. they are the first people to be charged in the current investigation into tabloid wrongdoing, which has shaken britain's media, police and political establishments. more than 40 people have been arrested and questioned. the ethics inquiry was set up last year after revelations that the now-defunct news of the world had hacked the mobile phone voice mails of scores of celebrities, politicians and even crime victims in its quest for scoops. britain's current treasury chief, <mark>george osborne</mark>, testified later monday about his relationship with murdoch's media empire. prime minister <mark>david cameron</mark> faces questioning on thursday. <mark>osborne</mark> spent the early part of his testimony answering questions about his relationship to the murdoch family. he is also likely to be quizzed about his role in hiring a former editor of murdoch's scandal-tarred tabloid news of the world, andy coulson, as communications chief for the conservative party. after <mark>cameron</mark> became prime minister, coulson served as downing st. communications chief before resigning because of the scandal. ___ jill lawless can be reached at: subscribe to this comment thread by email cancel the posting of advertisements, profanity, or personal attacks is prohibited. by using this web site you agree to accept our report offensive content: if you believe this comment is offensive or violates the cbsnews.com terms of use, you can report it below (this will not automatically remove the comment). once reported, our staff will be notified and the comment will be reviewed. offensive: sexually explicit or offensive language advertisements, commercial links, or repetitive posts disruptive posting: flaming or offending other users illegal activities: promote cracked software, or other illegal content e-mail this comment to a friend. e-mail this to: send me a copy of this message note: your e-mail address is used only to let the recipient know who sent the e-mail and in case of transmission error. neither your address nor the recipients's address will be used for any other purpose."}, {"articleID": "2014052304_00069314_W", "names": {"Michelle Williams": ["Q156796", "Q229153", "Q23893381"]}, "date": "2014-05-22", "url": "http://92moose.fm/destinys-child-reunite-michelle-williams-say-yes-listen/", "content": "Destiny's Child Reunite on <mark>Michelle Williams</mark>' New Song \"Say Yes!' [LISTEN] <mark>Michelle Williams</mark>' new song\" Say Yes!' The uplifting tune, which takes lyrics from a traditional Nigerian gospel hymn, features Spin reports. <mark>Williams</mark>, who currently stars on Broadway in \"Jesus Christ Superstar' alongside JC Chasez, is in a bit of a religious mode, as\" Say Yes!' is all about glorifying God and letting him guide the way. It will be featured on her upcoming gospel record, \"Journey to Freedom .'\" When Jesus say yes, nobody can say no, \"<mark>Williams</mark> sings on the chorus of the gospel song. And the verses are equally as praise-worthy .\" Where you lead me, Lord, I will go, \"Beyonce croons on one line .\" I have no fear 'cause I know who's in control. \"While the new song was met with praise by the fans, <mark>Williams</mark> took to Twitter to reveal that the leaked track was unfinished: Time Out for Sports Talk: Spring Cleaning Before Unofficial Start of Summer Lady Gaga, Hot Chelle Rae + One Direction Rule Top 10 Video Countdown - Vote for Next Week's Countdown! Destiny's Child Reunite on <mark>Michelle Williams</mark>' New Song\" Say Yes!' [LISTEN] Is \"Edge Of Tomorrow' The\" Groundhog Day' Of Alien Movies? (And 24 Other Urgent Questions) David Krumholtz Brings You the Weather From a Very Funny Old Jewish Lady Epic Games Created a Flappy Bird Clone with Unreal Engine 4 Mojang Digs Up Details On New Minecraft Editions? Jake Owen Fan Says He's Her \"Second Favorite' [Video]? It appears that you already have an account created within our VIP network of sites on YES, Activate My Account Now! * Please note that your points, prizes and activities will not be shared between programs within our VIP network. It appears that you already have an account on this site associated with. To connect your existing account with your Facebook account, just click on the account activation button below. You will maintain your existing profile and VIP program points. After you do this, you will be able to always log in to http: //92moose.fm using your Facebook account. * Please note that your points, prizes and activities will not be shared between programs within our VIP network."}, {"articleID": "2012091717_00086806_W", "names": {"Henry Ward": ["Q26998170", "Q3785012"]}, "date": "2012-09-10", "url": "http://brummieblogger.typepad.com/a_brummie_blogger/2012/09/too-fond-of-books-update-1.html", "content": "\"books to the ceiling books to the sky. my pile of books are a mile high. how i love them! how i need them! i'll have a long beard by the time i read them .\" arnold lobel \"where is human nature so weak as in a bookstore?\" - <mark>henry ward</mark> beecher i haven't done much stitching lately due to my painful thumb making it hard to hold the needle but i have made a bit of progress on this and have a little row of books appearing. it was touch and go whether i managed to upload a photo or not. the laptop is playing up again. two weeks ago it refused to switch on at all and i spent two days persuading it that it would be in its best interests to cooperate. i'm not sure if it was the thinly veiled threats or my limited techy skills that saved the day, but something worked which is all that matters. over this weekend it developed problems with three things. first it refused to access my webmail for around 36 hours, plus it kept saying one piece of software couldn't see the internet when clearly i was connected. a system restore fixed those problems but not the third problem. photoshop elements is acting up. i can load the organiser and look at my photos, but i cannot load the editor as when i do, i get a runtime error and it closes straight down again. it is very frustrating as i have no idea how to fix it. i shall have to consult google, methinks. i haven't done much stitching lately due to my painful thumb making it hard to hold the needle but i have made a bit of progress on this and have a little row of books appearing. it was touch and go whether i managed to upload a photo or not. the laptop is playing up again. two weeks ago it refused to switch on at all and i spent two days persuading it that it would be in its best interests to cooperate. i'm not sure if it was the thinly veiled threats or my limited techy skills that saved the day, but something worked which is all that matters. over this weekend it developed problems with three things. first it refused to access my webmail for around 36 hours, plus it kept saying one piece of software couldn't see the internet when clearly i was connected. a system restore fixed those problems but not the third problem. photoshop elements is acting up. i can load the organiser and look at my photos, but i cannot load the editor as when i do, i get a runtime error and it closes straight down again. it is very frustrating as i have no idea how to fix it. i shall have to consult google, methinks."}, {"articleID": "2011010414_00155635_W", "names": {"Marc Jacobs": ["Q2986077", "Q313108", "Q45789717"], "Tom Ford": ["Q19873307", "Q240015", "Q318149", "Q7815834"]}, "date": "2011-01-04", "url": "http://stylenews.peoplestylewatch.com/2011/01/03/kim-kardashian-doesnt-find-herself-as-sexy-as-everyone-thinks/?xid=rss-topheadlines", "content": "kim kardashian admits insecurities and plays down her sex appeal courtesy glamour just when you thought you couldn't get enough of kim kardashian in 2010, she's stepping into the new year with another magazine cover. but this isn't just any issue; it's guy issue - and we couldn't think of a better cover girl! the reality star - turned-entrepreneur sat down with katie couric in an interview that covered all bases-including her sex symbol status! \"it's definitely powerful,\" kim says of her legendary reputation. \"i don't find myself as sexy as everyone thinks. i'm a lot more insecure than people would assume, but with little stupid things. when i get dressed, i'm always so indecisive .\" she may encounter occasional difficulty choosing the right outfit, but in the spread shot by terry tsiolis on her 30th birthday, kim showed off her signature flirtatious style in a variety of soft, seductive looks, including a gorgeous flowing <mark>marc jacobs</mark> dress (above), a racy dolce & gabbana bustier and even some luxe <mark>tom ford</mark> pajamas. her secret to feeling sexy? \"you have to learn to like what you see in the mirror,\" she tells glamour. \"there are definitely times when i don't feel like myself, but you have to fake it until you make it .\" check out the rest of kim's kim looks so much more beautiful \"undone\" january 3rd, 2011 i don't think she's sexy at all, because it's all fake. if you look at pictures of her throughout the years, it's obvious how much work she's had done. her sister kourtney has natural beauty, so i don't understand why everyone's so crazy about kim. i agree - you're not sexy - you're plastic. anyone can look like that with a wallet like your's. all it takes is puffed lips - and no those are not natural how big she's blown them up to be? her boobs are fake - she's had those blown up, you can see the silicone base around the edges and how they don't fall naturally. the botox she finally admitted to and looks like a wax figure. kim, you don't look like a 20 year old - you look like a 30 year old in serious crisis. leah, umm you are confused. kourtney is the one that has said she has had implants. she is by far the \"natural\" one of the three girls. kim has not and the only thing she has done is botox. how can you say she is fake. she is gorgeous even as a small child. all those girls are beautiful, implants or not. please do not take this as an attack anyone but for those who keep saying she got work done? i mean yes her upper lip looks a little bigger on this picture ok, maybe she did get something done there or it could be some kind of lipstick the makeup artist used to plump them up more like they advertise on commercials? for the most part though what i wanted to suggest was? how do you guys know that throughtout the years her bone structure just didn't mature? i know it may sound crazy to some people but there are some people that do not contain the same baby face that they had while younger your bone structure changes throughout the years. things fill out and you may become wider than usual. i don't know her personally but i do know that she's beautiful rather real or fake. she already admitted to getting surgery done to her stomach because of past abusive relationship now that's over and done. what more do you want her say or do? no matter how real or fake she is she's still a gem. i do think kim is beautiful but i also think it's sad that she feels she has to wear that much make up at 30 years old. i don't think any woman needs to wear that much make up. kim has natural beauty and less make up would look better on her and she'd still be a knock out. umm? she's right. she's not sexy. too conceited (who tweets endless bikini pics of themselves?!) and narcissistic. she looks so much better with less makeup. zoom in on a pic of her - between the eyeliner, fake lashes, ten pounds of foundation - it's hard to tell where the real kim starts. add a comment got something to add to this post? fill out the fields below to make a comment, ask a question or share a tip. we'd love to hear from you. peoplestylewatch.com is part of the time inc. style network"}, {"articleID": "2011012420_00159500_W", "names": {"Brendan Ryan": ["Q16195784", "Q17026756", "Q2924438", "Q4961085", "Q4961087"]}, "date": "2011-01-24", "url": "http://9thlevelireland.wordpress.com/2011/01/24/labour-echoes-usi-call-for-a-friday-general-election/", "content": "irish university politics news and law patents, not just politics, create obstacles to university stem-cell research \"the labour party spokesperson for education in the seanad, senator <mark>brendan ryan</mark>, has welcomed the call today by the union of students in ireland for the general election to be held on a friday to allow students return home to cast their votes?\" (more) [<mark>brendan ryan</mark>, labour party blog like be the first to like this post."}, {"articleID": "2009101321_00152371_W", "names": {"Jim Robinson": ["Q42290790", "Q6197793"]}, "date": "2009-10-13", "url": "http://sanilaccountynews.mihomepaper.com/news/2009-10-14/News/Michigan_residents_show_creativity_in_naming_uniqu.html", "content": "copyright © 2009 salinac county news all rights reserved michigan residents show creativity in naming unique steer farm bureau photo wow - mighty mitt the bovine sports michigan map! lansing - when farm bureau insurance announced a contest to name a saginaw steer born with a natural michigan map on its side, the company was amazed at the large number of entries that poured in. \"michigan people are creative and came up with some fantastic names,\" said <mark>jim robinson</mark>, executive vice president of farm bureau insurance. \"more than 2,500 michigan residents, from grade school kids to people almost 90 years old, entered the contest and they really put some thought into it .\" the winning name is mighty mitt, suggested by five michigan residents. the name atlas took second place. trooper, a combination of the nicknames for lower peninsula residents, \"trolls,\" and upper peninsula residents, \"yoopers,\" took third. the contest was especially fun to judge, farm bureau insurance officials say, because each entrant had to explain how he or she came up with the name. for example, one of the names that almost made it to the finals was copper, which not only suggests the animal's copper color, but also refers to michigan's rich copper mining history. ten people entered the name copper. some other names that almost reached the finals were mighty mac (\"the mackinac bridge connects upper and lower michigan so the name shows unity,\" ) gulliver (\"it's a strong male name and there's a town in the u.p. with that name\" ) and samson (\"like michigan, samson has exceptional strength .\" ) as might be expected, the name mitten or mittens was the most popular entry, with over 100 residents submitting that name. big mac was submitted 16 times, while lansing (or lance) was suggested by 18 residents. another 18 residents submitted the name lucky (\"because he is so lucky to be born with a michigan mitten on one side and a u on the other, and he's a sign that michigan's luck is about to change .\" ) variations on the name mackinac and mac were also popular, accounting for nearly 40 submissions, while the name mitt, mit, or mitty appeared on about 60 entry forms. some of the more intriguing names submitted were: • a-1 (\"because he's no. 1 in the state .\" this entrant made no reference to steak sauce .) • aggie (\"because agriculture is michigan's second largest industry .\" ) • amazing grazer • bo (\"because he's a bovine\" )"}, {"articleID": "2019043016_00614982_W", "names": {"Brendan Rodgers": ["Q19973684", "Q310623"]}, "date": "2019-04-30", "url": "https://www.dailystar.co.uk/news/latest-news/775597/leicester-hamza-choudhury-tweets-black-people-suicide-england-arsenal-news", "content": "\"I've learned a lot as a person in my early years as a professional--certainly enough to know that some of the thoughtless comments I have made in the past are both hurtful and offensive\" Choudhury The tweets were dug up the wake of the Foxes 3-0 win over Arsenal on Sunday, during which he made his first start under new boss <mark>Brendan Rodgers</mark>. His account was then deleted shortly after the game. Choudhury has apologised and says he has matured as a person since the tweets. He said: \"I've learned a lot as a person in my early years as a professional--certainly enough to know that some of the thoughtless comments I have made in the past are both hurtful and offensive. STAR: Hamza Choudhury made his first start under <mark>Brendan Rodgers</mark> (Pic: GETTY)\" They do not represent my true beliefs. I'm deeply sorry to anyone I have offended--both at the time and since they've been recirculated. \"I've grown up a lot since then and learned a lot about life, but I accept that I have to take responsibility for the comments I have made in the past and will be a better, wiser person for it .\" A Spokesman for Leicester said: \"Hamza's approach to addressing the matter and the remorse he has expressed shows the maturity he has developed in the years that have passed since the comments were made .\" He now has a far greater understanding of the impact his words and behaviour can have and is committed to using that influence in the positive, respectful and accepting manner his more recent growth has demonstrated. \"Related articles"}, {"articleID": "2011102101_00061545_W", "names": {"John Paul": ["Q1701359", "Q6252169"]}, "date": "2011-10-21", "url": "http://deseretnews.com/article/705392820/Utah-laws-can-prevent-wild-animal-scares-like-that-in-Ohio.html", "content": "utah laws can prevent wild animal scares like that in ohio salt lake city - ferocious predators on the prowl over night in ohio echoes a similar scare on the southeastern idaho border 16 years ago, and it represents the kind of nightmare scenario that utah laws are intended to prevent. the real-life safari hunt in zanesville, ohio, started tuesday night when terry thompson opened the gates and cages at his animal farm, where he had permits to house exotic animals. according to investigators, he then shot himself to death. lions, bears, leopards and wolves ran loose, leaving a community in terror and barricaded in their homes. \"it's like noah's ark wrecking right here in zanesville, ohio,\" said wildlife expert jack hanna. all the animals were either killed or recaptured, with one exception - a monkey that's still on the loose. a similar episode in idaho struck fear into residents of lava hot springs in 1995. nineteen lions, tigers and hybrid \"ligers\" escaped from a ramshackle facility known as \"ligertown .\" the privately owned collection of chicken-wire and plywood enclosures proved to be far too insecure to hold such dangerous predators. idaho deputies killed the last of the escaped cats several days later when it was found at a local elementary school, evidently stalking prey. officials in utah say a tough wild-animal law here protects the public. \"the state law in utah is very strict,\" said mark hadley of the utah division of wildlife resources. \"basically it prohibits people from being able to have wild and dangerous animals in their possession .\" it wasn't always so. <mark>john paul</mark> fox, chief investigator for the humane society of utah, remembers numerous private zoos and wild animal collections in the 1970s and 1980s. \"they were a big concern for us,\" fox said. \"dirty cages, lack of veterinary care, poor diets .\" the facilities were typically roadside tourist attractions or animal suppliers to movie companies. \"there was a lack of security in all those facilities,\" fox said. \"you could just drive on the site, walk in among the grizzly bears or jaguars or cougars. there would be nobody there the whole time you'd be there at the facility .\" "}]