[{"articleID": "2016092720_00418166_W", "names": {"Joe Kelly": ["Q14950949", "Q18098357", "Q19519193", "Q22005763", "Q2351168", "Q6210642", "Q6210645", "Q730076"]}, "date": "2016-09-27", "url": "http://comicbook.com/2016/09/27/i-kill-giants-has-started-filming/", "content": "I Kill Giants Has Started Filming Megan PetersPin to Pinterest It's been just over a year since sources confirmed that the graphic novel I Kill Giants was being adapted into a film. And, now, the project looks like it has started principal shooting. Creator <mark>Joe Kelly</mark> announced the news on Twitter earlier today and even gave a shoutout to co-creator Ken Niimura. In other news, #IKillGiants has begun principal shooting today. So excited, so proud and so lucky I met @ ken_niimura!--<mark>Joe Kelly</mark> (@ JoeKellyMOA) September 27, 2016 \"In other news, [I Kill Giants] has begun principal shooting today. So excited, so proud and so lucky I met [Ken Niimura]!\" <mark>Joe</mark> wrote. Over the past year, several big casting confirmations for the film were released to fans' excitement. Zoe Saldana signed on to I Kill Giants and will be playing a school psychologist. Newcomer Madison Wolfe will be playing the film's heroine Barbara, and Imogen Poots was cast in a an unknown role as well. When the film was first announced, <mark>Joe</mark> had the honor of telling fans the good news. He revealed that Treehouse Pictures agreed to finance the project. Anders Walter will direct the film while Chris Colombus stands in as producer. <mark>Joe</mark> adapted the screenplay for I Kill Giants. Speaking about the project, Chris explained that, \"<mark>Joe Kelly</mark> has written a deeply insightful story about a child using fantasy to navigate through a harsh reality, and I am excited and proud to finally be able to bring this wonderful material to the screen.\" <mark>Joe</mark> also talked about his feelings about the theatrical adaptation, saying, \"I'm overwhelmed by the enthusiasm, vision and sheer talent of the team we've assembled. Chris and Anders understand the book on an instinctive level and will translate it into a hell of a film. I could not be happier.\" If you're unfamiliar with I Kill Giants, then you should know the story started off as a graphic novel in 2008. <mark>Kelly</mark> created the project with artist J. M. Ken Niimura and pitched the story to Image Comics. If you'd like to hear a bit about the story, <mark>Kelly</mark> provided a very succinct description during an interview he did with Newsarama. \"It's a story about a girl who's a bit of an outsider--she's smart-assed and funny, but totally in our geekland: she's obsessed with Dungeons & Dragons, she doesn't have a lot of friends, she's a bit of a social misfit,\" he said. \"She's taken her fantasy life a little far, and really only talks about giants to people. She's convinced that giants are real and giants are coming, and it's her responsibility to stop them when they show up. This weird little fantasy life that she's going has started seeping into her real life, and as we see things from her point of view, we see that she sees pixies and she sees signs in the clouds and other things that might be telling her that bad things might be coming.\" Since its publication, I Kill Giants has won a Gaiman Award (an overseas manga award selected by readers), the International Manga Award, and was even listed in the \"Top Ten Great Graphic Novels for Teens\" list by the Young Adult Library Services Association in 2010. It was also awarded the title of \"Best Indy Book of 2008\" by IGN and was an Eisner Award finalist."}, {"articleID": "2017100720_00425550_W", "names": {"Tom King": ["Q23664009", "Q27139397", "Q3530763", "Q3992491", "Q52892734", "Q55635982", "Q58316386", "Q7816471", "Q7816473"], "Scott Snyder": ["Q322415", "Q59488659"]}, "date": "2017-10-07", "url": "http://www.cbr.com/nycc-dc-comics-batman-future-plans/", "content": "Share On Facebook Tweet Pin It Email Comment It's time for a DC Comics convention staple! The writers and artists behind Batman in Rebirth have been brought together on stage today at New York Comic Con to spill Gotham City's secrets. The panel includes <mark>Tom King</mark>, <mark>Scott Snyder</mark>, Sean Gordon Murphy, Cully Hamner, Tony Patrick, and James Tynion IV. CBR is there live to bring you the latest news and announcements as they happen, so keep hitting refresh! DC All Access host Jason Inman took the stage to announce the panel, including Marguerite Bennett who had not been announced previously. Batman: The Signal was up first with Cully Hamner talking about his Duke design. \"The reversed-out Bat symbol on his chest is reflective so it can pick up light and maybe confuse enemies.\" Inman asked writer Tony Patrick if he was intimidated about taking on a project with <mark>Scott Snyder</mark>. \"No not at all,\" Patrick laughed, \"This was like Duke training with Batman for me. Months of training with <mark>Scott Snyder</mark>, getting lots and lots of notes--still getting notes. This is the dream team.\" <mark>Snyder</mark> took a moment to thank everyone at the panel, \"this is the best time to be a Batman fan. You guys are the best fans in the world.\" He then moved on to talk about figuring out where Duke can land. \"We didn't want him to take on a mantle like Nightwing or Robin--which were options, but the way. We wanted to give him something new. Gotham by day is where all the new threats in the city start to take root.\" He continued, talking about Patrick's idea that for a juvie Arkham, and building out a different neighborhood. \"There's a cop who was on nightshift who quit and came to the dayshift because of an encounter with Mr. Freeze,\" He teased, also dropping hits about a new Wayne Enterprises endeavor where Bruce is going to be building housing for city employees that will build into a mystery. <mark>Tom King</mark> was up next, talking about the end of the \"War of Jokes and Riddles.\" \"I knew from day one, I knew Catwoman was gonna say yes. If you look back at my issue 1, I knew I wanted to do 100 issues of this book and I wanted to focus on Bruce and Selina's relationship as the core of the run,\" <mark>King</mark> explained. The next arc of Batman will be called \"The Rules of Engagement\" rather than \"A Dream of Me\" as was initially announced. It will run for 17 issues. \"I thought about Catwoman and Batman being engaged...and then I immediately thought about Catwoman and Talia in a sword fight in the desert...and it gets awkward.\" \"What will Damian think of this marriage?\" Inman asked, to which <mark>King</mark> responded that the next arc will be all about how Damian is going to cope with this new status quo. \"It drives him a little more crazy,\" <mark>King</mark> joked. Sean Murphy was up for Batman: White Knight, \"I was always inspired by Batman: The Animated Series, and I wanted to tell a story about a story where Joker was\" cured \"in a new way,\" Murphy explained, \"I wanted him to start coming at Batman in like, legal ways, using social media.\" \"This story is about the family, too.\" Murphy explained, saying Nightwing and Batgirl will continue to play a big part in the story. \"This is just Nightwing from the animated series but with a motorcycle jacket.\" Inman asked if White Knight was a finite story, but Murphy said he's already in talks with DC for a potential sequel. James Tynion IV was next to talk about his Bat-related projects. Batman/TMNT volume 2 was first on the docket. \"The first volume was taking the Turtle to Gotham City and the second volume is going to be taking Gotham City to the Turtles. It's Batman, Robin and Bane invading the Turtles' NYC. I just wrote a scene where Bane takes over the Statue of Liberty and pulls the Bane mask down over it.\" \"At the end of the day, all Batman stories are about family, and all Turtles stories are about family, they have this common theme.\" Tynion explained. He went on to talk about the current arc of Detective Comics, \"A Lonely Place of Living.\" \"It's been a tremendous honor. This is a book that's always been near and dear to my heart. When Geoff brought me in to say they were going to take Tim off the table but to tie him into this bigger mystery playing into Rebirth, I was so excited.\" Tynion said. \"A Lonely Place of Living\" taps into what makes Tim Drake important. \"\"The fact that Tim carries the whole world on his shoulders, and it was evident right from those first original pages in\" A Lonely Place of Dying. \"Tynion explained about the importance of restoring the original origin. Tynion went on to explain that the answers to the Connor Kent questions that keep getting asked might be answered in Detective #966. Bennett was next for Batwoman and her use of Scarecrow in the story,\" The places Kate has built her armor were not put in place to defend against villains like him. She has all this training in black ops but she has no defenses against the guilt in her mind. \"<mark>Snyder</mark> then teased his upcoming project with Sean Murphy, called Last Knight\" I want it to be my last Batman story for a long time. \"\"Batman suddenly wakes up and he's...young, but he wakes up in this post apocalyptic wasteland, crawling out of the sand in this Gotham City that's been ruined. He's got the Joker's head chained to his belt, but it's alive and like\" You gotta move, kid! \"It's got old Wonder Woman, Baby Superman--it's like my Lone Wolf and Cub Batman story.\" <mark>Snyder</mark> explained that he got advice from Grant Morrison about taking over iconic characters, \"He said you've got to give them a birth and a death. So this isn't really a death, but this is a closing a chapter in my version of Batman.\" Inman asked the panel for one last spoiler from the panel, to which <mark>Tom King</mark> replied that he and Lee Weeks are coming together for at Batman Annual \"It's the story of Batman and Catwoman's first kiss...and their last.\" Fans were then invited to ask questions. A fan from Australia asked if Tynion has any plans for new additions to the Detective Comics roster. \"The Robins and Batgirl are core to the mythos are they're going to be a big part in the next arc.\" A fan then asked if the Bat-books had any plans to do a benefit book for a Batman-oriented story for gun control, but the panel confirmed that if that did happen it would be in DC's hands. Inman then told the fan that if this was a book and an issue people want to see, they should let DC know. A fan then asked Murphy about Last Knight--if it will be a graphic novel or a mini series. \"It might be a mixed. I'm not completely informed but there will be more info probably before San Diego. It'll be a new format that'll make these stand out.\" Share On Facebook Tweet Pin It Email Comment ThePremium Network Ad Free Browsing Over 10,000 Videos! All in 1 Access Join For Free! GO PREMIUM WITH CBR Go Premium!"}, {"articleID": "2008092201_00021271_W", "names": {"Alec Brown": ["Q17150680", "Q21557966"]}, "date": "2008-09-22", "url": "http://au.rd.yahoo.com/news/rss/top_stories/*http://au.news.yahoo.com/a/-/latest/5031408", "content": "rees \"filthy': glitch sparks more m5 chaos abc - september 22, 2008, 11:00 am enlarge photo] a computer malfunction has closed sydney's m5 east tunnel, causing major traffic delays around the motorway. the motorway is closed to traffic in both directions between general holmes drive and king georges road, at arncliffe, after a circuit board that operates its ventilation and safety systems shut down. the roads and traffic authority (rta) is urging motorists to avoid the area while technicians are on site working to fix the problem. rta spokesman <mark>alec brown</mark> says the problem is not related to a similar failure in june.\" it is a different cause, i understand, but obviously the effects for motorists will be the same thing: the tunnel closed in both directions, \"he said.\" we do understand motorists' frustrations. we'll be taking a very hard look at why this has occurred and we're obviously not happy that something of this magnitude has happened again so quickly. \"the news of the computer malfunction has angered premier nathan rees.\" i'm filthy about it, \"he said.\" this is the second time this has occurred in a relatively short period of time and i want to get to the bottom of that today."}, {"articleID": "2017112018_00265352_W", "names": {"Lee Jenkins": ["Q10466528", "Q6514139"], "Geoff Smith": ["Q1502915", "Q16095878", "Q16107511", "Q16194339", "Q18128184", "Q19668048", "Q21104287", "Q28873166", "Q5534318", "Q5534319", "Q5534320", "Q5534321", "Q5534325", "Q58121518"]}, "date": "2017-11-20", "url": "http://www.mdjonline.com/neighbor_newspapers/north_fulton/news/roswell-mayor-and-city-council-candidates-to-debate-before-runoff/article_69e756ce-ce13-11e7-80c0-7b1423247e8e.html", "content": "Positively Roswell, Roswell NEXT and the Roswell Community Masjid will host a runoff debate with the mayoral and city council candidates at the Roswell Cultural Arts Center on Nov. 28. No candidate earned the majority vote to win outright in the races for Mayor and City Council Posts 3 and 6, resulting in a runoff election scheduled for Dec. 5. Each of the six runoff candidates will answer random questions submitted by the candidates who ran, but did not get elected or make a runoff, as well as questions submitted via a Facebook post. As it works, the top two vote-getters in each race square-off in the runoff election. They include: Mayor: Lori Henry and <mark>Lee Jenkins</mark> Council Post 3: Sean Groer and Mike Nyden Council Post 6: Matt Judy and Karen Parrish \"Roswell residents are encouraged to attend the event. Those that cannot, are encouraged to watch the event live via Positively Roswell's Facebook feed,\" said a news release. The debate will also be recorded and re-broadcast in the same feed via a link at https: //www.facebook.com/proRoswell/ on the day of the event. Roswell Cultural Arts Center is at 950 Forrest Street. For more information, please contact <mark>Geoff Smith</mark> at geoff @ gsmitandco.com, or 678-779-5066."}, {"articleID": "2015091200_00053446_W", "names": {"Andrew Parsons": ["Q47537752", "Q4758215", "Q57427734"]}, "date": "2015-09-10", "url": "http://www.mearnsleader.co.uk/council-pledges-to-help-refugees-1-3882053", "content": "Council pledges to help refugees Conservative MP's Members of project Maja visit the Syrian refugee camp Nizip Container camp just outside Gaziantep, Turkey, Friday, 10th January 2014. Picture by <mark>Andrew Parsons</mark> / i-Images 07:00 Thursday 10 September 2015 0 Have your say Aberdeenshire Council is committed to easing the plight of refugees seeking protection from persecution, its chief executive has said. Although the authority has so far not been directly involved in supporting those caught up in the humanitarian crisis, it is sympathetic and has been working with national Government to see how it can assist. Aberdeenshire Council Chief Executive Jim Savage It was recently represented at the UK Government's Refugee Summit by Cosla, the unbrella body for all Scottish councils. Although a small number of Syrian refugees have already been resettled in Scotland, councils are in discussions with the Home Office about accepting more. \"Over the last week, we have received a great deal of interest from members of our communities asking us what support we are able to provide, and how they can support the wider humanitarian crisis,\" said Aberdeenshire Council Chief Executive, Jim Savage. \"Officers from the council are speaking to colleagues in other agencies to consider a range of support including housing, education, and health. Our local response would involve working closely with our community planning partners, to ensure a co-ordinated response and provide all the necessary support for the refugees.\" The council Co-Leaders have indicated that the council is committed to playing its part in any government-led Syrian Resettlement Scheme. \"Scottish councils recognise the right of all people to seek protection from persecution and stand ready to play our part in alleviating this humanitarian crisis.\" We would urge any Aberdeenshire residents who wish to support the humanitarian crisis to do so through international charities like The British Red Cross which is experienced in international aid and crisis support. \"The scale of the crisis means local councils can only assist with the support of national governments at Holyrood and Westminster. Until more information is available from the UK Government on the numbers of refugees to be admitted to the country and how they will be distributed, Aberdeenshire Council will continue to monitor the situation and assist in any way it can."}, {"articleID": "2017112703_00337038_W", "names": {"Paul Brown": ["Q16197784", "Q16212754", "Q18205667", "Q18921483", "Q19396015", "Q21462455", "Q22235645", "Q24033408", "Q29034170", "Q54727692", "Q55079049", "Q5587853", "Q7149543", "Q7149544", "Q7149545", "Q7149546", "Q7149547", "Q7149549"], "Ryan Hewitt": ["Q17715106", "Q48700509"], "A. Green": ["Q57137144", "Q58985471"], "Andre Smith": ["Q2846283", "Q4754877", "Q4754878", "Q48977286", "Q493240"], "Chris Smith": ["Q11963798", "Q16235029", "Q1626495", "Q18158024", "Q18210302", "Q18631755", "Q18641613", "Q21066572", "Q22954127", "Q27861882", "Q27957276", "Q2964864", "Q30907275", "Q333264", "Q39089696", "Q41247400", "Q43137589", "Q47117548", "Q5108087", "Q5108088", "Q5108090", "Q5108094", "Q5108095", "Q5108096", "Q5108097", "Q5108098", "Q5108099", "Q5108100", "Q5108101", "Q5108102", "Q5108103", "Q5108104", "Q5108105", "Q5108106", "Q56134418", "Q56254566", "Q57684371", "Q981167"], "Carl Lawson": ["Q27918220", "Q5040466"], "Michael Johnson": ["Q16195604", "Q16238908", "Q190924", "Q1928051", "Q20667583", "Q21458865", "Q21484117", "Q29456", "Q29964620", "Q3856198", "Q4896337", "Q496521", "Q54667230", "Q55313528", "Q56853023", "Q57056207", "Q57427460", "Q5889087", "Q6831672", "Q6831675", "Q6831677", "Q6831678", "Q6831679", "Q6831680", "Q6831682", "Q6831683", "Q6831685", "Q6831687", "Q6831690", "Q6831692", "Q898451"], "Andy Dalton": ["Q129605", "Q2849092"], "Adam Jones": ["Q1060788", "Q16232662", "Q2537838", "Q2823965", "Q29787083", "Q349892", "Q350686", "Q43101011", "Q4679305"]}, "date": "2017-11-26", "url": "http://local12.com/sports/bengals/bengals-browns-5th-quarter-game-balls-coaching-grades-takeaways-key-stats-and-more-11-26-2017", "content": "Bengals-Browns 5th Quarter: Game balls; coaching grades; takeaways; key stats and more by Richard Skinner, WKRC 11 photos A A CINCINNATI (WKRC) - Welcome to the Bengals Fifth Quarter where I provide my analysis of Sunday's 30-16 win over the Cleveland Browns before a crowd announced at 51,710 in <mark>Paul Brown</mark> Stadium (here is a link to the story with game details filed as soon as the game concluded that also includes video/tweet highlights): GAME BALLS Offense: RB Joe Mixon. The Skinny: The rookie rushed for 114 yards and a touchdown on 23 carries and added 51 yards on three receptions, which accounted for 45.7 percent of the Bengals total yards. He became the first Bengals running back to surpass 100 yards since Rex Burkhead had 119 in last year's finale against Baltimore, and his total alone was more than the Bengals had as a team in any game this season. \"I tip my hat off to everybody that trusted in our run game,\" said Mixon. \"Coach did a great job calling plays, and our line did a great job executing. Our fullback (<mark>Ryan Hewitt</mark>) did a damn good job. too. Our receivers blocked on the perimeter, and it was up to me to go ahead and finish those runs, and that's what happened.\" Mixon's previous high in a game was 62 yards at <mark>Green</mark> Bay, and he surpassed that total less than two minutes into the second half. \"We put an emphasis on running the ball this week,\" said right tackle <mark>Andre Smith</mark>. \"We know if we can get Joe going, he's going to work some big runs for us and he did that today. He did some tremendous things today, and I happened to get behind him on some of those longer runs. To see him run hard and lower his pads was really impressive. I'm excited to block for him.\" The line had perhaps its best performance of the season thanks to a lot of drive blocking, but Mixon also averaged 2.8 yards after contact, according to ProFootballFocus.com. Mixon said he planned on taking the offensive line to dinner for his 100-yard performance. \"If I can get them together we're going to go - Ruth's <mark>Chris</mark>, Cheesecake (Factory), wherever, they deserve it,\" said Mixon. \"Our line has done well drive-blocking, and I'll keep finishing runs. At this point, it's about believing and getting the job done week-by-week.\" Mixon got off to a great start with runs of nine and 19 yards on the Bengals first drive of the game. \"It was big, because we all feed off of each other,\" said Mixon. \"By us going downhill from the start it meant a lot.\" Veteran guard Clint Boling was impressed with Mixon's performance. \"He brings a lot of energy,\" said Boling. \"The guy's obviously talented. You get him in space and it's fun watching him run. I think once he's taken over that role, he's obviously done well with it. He brings a lot of momentum when he starts running the ball like that.\" Mixon also finished the game on a high note with an 11-yard touchdown run with 2:57 left that gave the Bengals a 30-16 lead and clinched the win. \"We executed and we caught an outside toss,\" said Mixon. \"A.J. <mark>Green</mark> had a great block and Russell Bodine did a hell of job carrying me into the end zone. <mark>Ryan Hewitt</mark> did a great job.\" Defense: Nickel pass rushers (<mark>Carl Lawson</mark>, <mark>Chris Smith</mark>, Geno Atkins, Carlos Dunlap and <mark>Michael Johnson</mark>). The Skinny: The Bengals recorded four sacks and had 11 quarterback hits, and those five combined for three of the sacks and eight of the quarterback hits. <mark>Lawson</mark> had 1.5 sacks and now has a team-high 7.0 sacks, while <mark>Smith</mark>, Atkins and Dunlap each had half a sack, and <mark>Johnson</mark> had a quarterback hit. Atkins also had two other quarterback hits. \"We had an opportunity to work our man, and (<mark>Chris Smith</mark>) and I built that relationship to feel the rushes, and we play off each other,\" said Dunlap. Defensive tackle Pat Sims, who doesn't play in nickel situations, also had a sack. The Bengals now have 33 sacks this season after recording just 33 all of last season, and are on pace for 48, which would tie for second most in a season in team history since sacks became an official NFL stat in 1982. COACHING GRADES Head Coach Marvin Lewis: A-minus. Offensive Coordinator Bill Lazor: A-minus. Defensive Coordinator Paul Guenther: C. Special Teams Coordinator Darrin Simmons: B. The Skinny: The Bengals have dominated this series of late (they entered the game having won six straight, each by at least 13 points and by an average of 22.7 points per game) so it would have been easy to overlook the Browns, and the team didn't, which Lewis deserves at least some of the credit. It was a very business-like, professional win with few gaffes. The Bengals were penalized just four times for 35 yards with a personal foul for hitting a defenseless receiver on linebacker Vontaze Burfict accounting for 15 of those yards, and that was even a questionable call. Lazor's offense had its most productive performance since the bye week and racked up its second-most yards of the season (361). The offense was well-balanced, too, with 30 rushes accounting for a season-high 152 yards (and take away two kneel downs for minus-two yards on the final two plays of the game and it would have been 28 for 154 yards), while quarterback <mark>Andy Dalton</mark> attempted 28 passes and completed 18 for 209 yards and was sacked just once. About the only negative was that the offense was only 1 for 4 scoring touchdowns in the red zone, but the offense did score points on each of its first five drives of the game, and then put together a seven-play, 75-yard drive for Mixon's clinching touchdown with 2:57 remaining after the Browns had pulled within 23-16 with 6:57 left. Guenther's unit just wasn't as dominant as it should have been and allowed 405 yards, but while it bent a lot it didn't break all that much and held the Browns to only one touchdown, although that came at the end of a 15-play, 89-yard drive in the fourth quarter. Cleveland rushed for 169 yards on 31 carries (5.5 per carry) and probably should have stuck with the run game a little more than it did. \"We had some plays that will be interesting to see where our breakdowns where, particularly in the running game a couple of times,\" said Lewis. As for Simmons' group it made a glaring mistake in a sixth straight game, this time when Cethan Carter was called for an illegal block in the back to wipe out <mark>Adam Jones</mark>' 55-yard punt return for a touchdown. Other than that though the special teams were pretty solid. Kicker Randy Bullock made all three field-goal attempts (31, 49 an 21 yards) and all three extra-point attempts. The Browns averaged just 20.6 yards on five kickoff returns. <mark>Jones</mark>' punt return still gained 16 yards and Alex Erickson had a 14-yard punt return and a 25-yard kickoff return. THREE TAKEAWAYS - The defense is doing a lot of bending, but not breaking lately. The Skinny: Since the 29-14 loss to Pittsburgh on Oct. 22 the Bengals are 3-2 and the defense allowed an average of just 19.2 points per game (seven other points came on a punt return by Jacksonville), but it also allowed an average of 380.2 yards, including 145.0 yards on the ground. There is a lot of bending going on, but not much breaking to this point. \"Bend but don't break,\" said Dunlap. \"Obviously, we don't want them to get into the red zone, but when they get there, don't let them get seven--hold them to three.\" In the last five games the Bengals defense allowed 11 field goals and nine touchdowns. The most disturbing trend though is that the Bengals continue to get gashed on the ground. They allowed the Browns to average 5.5 yards per carry and in the last five games allowed an average 4.3 yards per carry. \"We have a lot of things we have to clean up as a defense,\" said <mark>Lawson</mark>. \"We allowed them to get too many yards on the ground. We should have put that team away. I'm not saying they're not a talented team, but we should have played better than what we did. It's the pride of the defense to not let them put up yards rushing or through the air. I'm happy we got the win, but there's some stuff to clean up.\" - Bullock answered Lewis' challenge The Skinny: After missing the Nov. 5 game at Jacksonville due to a back injury, Bullock missed an extra point in each of the last two games and Lewis said on Wednesday that the team's patience with Bullock was short and that, \"we're committed to Randy for this week.\" Bullock responded by making all six placement kicks: three field goals (31, 49 and 21 yards) and three extra points. \"I think today was a confidence booster,\" said Bullock. \"I had a good week of practice. Since I've been back I've kind of gradually continued to kick a little bit better and I'm just trying to get my strength back and fine-tune my swing.\" He said he didn't mind Lewis putting extra pressure on him with his comments. \"Honestly, I think that's part of the NFL,\" said Bullock. \"Every week is an evaluation; every day is an evaluation. It doesn't matter what position you are in the building - whether you are a player or a coach - you are constnatly being evaluated and you just go out and do your job and everything takes care of itself.\" - A.J. <mark>Green</mark> amazes The Skinny: In the NFL Gamebook all it says to describe a late third quarter pass completion from <mark>Dalton</mark> to wide receiver A.J. <mark>Green</mark> is: \"<mark>A.</mark> <mark>Dalton</mark> short pass right to <mark>A. Green</mark>, pushed OB at CIN 40 for 13 yards.\" It was certainly nowhwere near as simple as it reads as <mark>Green</mark> extended his hands toward the sideline to make a fingertip grab against tight coverage from Browns cornerback Jason McCourty, and then somehow tapped his feet inbounds in just enough time to make the catch. In short, it was a spectacular catch. \"When <mark>Andy</mark> threw the ball, there wasn't but one person in the world maybe that can make that catch and get both feet down without question in bounds,\" said Lewis. \"That's why I told (the referee) to (pick up) the (end of the) quarter there, because I thought it was inbounds. They ended up challenging it, so it stopped (the clock) anyway, but I had no question in my mind he had both feet down (inbounds). You have to have the ability to track the ball, and the athleticism to get both feet down like that. It was incredible.\" <mark>Green</mark> finished with a team-high five receptions for a team-high 66 yards. THREE STATS/NUMBERS OF NOTE 0-5: The Bengals record this season when the opposition scored first entering Sunday's game, but they are now 1-5 after Cleveland got a field goal on the opening possession of the game. 104.9: <mark>Dalton</mark>'s passer rating in the last five games this season. In that span he is 80 of 135 for 1,012 yards, nine touchdowns and no interceptions. He has thrown 140 straight passes without an interception. 131.8: <mark>Dalton</mark>'s passer rating in the last six games against the Browns. He is 117 of 160 (73.1 percent) for 1,442 yards, 15 touchdowns and no interceptions in thos six games. THREE QUOTES OF NOTE - Lewis on <mark>Jones</mark> having his 55-yard punt return for a touchown wiped out by Carter's illegal block in the back: \"It was a shame. It was a great job by him and a great finish with a block by William (Jackson). The guy's got a block in the back on the back side. That's one of the things our young guys have to keep on understanding: They're giving us the football, they're punting it where they are punting it from, we're going to get good field position, so let's make sure we don't have to have anything more. Let the returners make the guys miss, and positive yardage is positive yardage. It's something to learn from.\" - Browns coach Hue Jackson on the key 15-yard penalty for unnecessary roughness called on rookie safety Jabrill Peppers for hitting Bengals wide recever Josh Malone to break up a pass late in the fourth quarter on the Bengals game-clinching touchdown drive: \"The officials said that our player's helmet hit their player in the head. I didn't see that. I thought our player's shoulder hit him in the chest. The torque of the impact could have caused their player's head to react the way it did. To me, that's football. He didn't target their player's head. That was a huge call at that juncture in the game, and the officials have to get that one right. I thought Jabrill (Peppers) did the right thing during that play, and I stand by him wholeheartedly. He hit the guy below the shoulder pads.\" - Center Russell Bodine on the offensive line's positive performance the last couple of weeks: \"Things weren't obviously going toward the beginning of the year like we wanted it to go, but we just kind of emphasized being physical and going out there and having a little bit of an attitude, and we've done a good job of that the last two weeks and we just need to keep it going.\" UP NEXT: Monday Dec. 4 vs. Pittsburgh Steelers, 8:30 p.m. (ESPN). The Skinny: The Steelers are playing the Sunday night game against the <mark>Green</mark> Bay Packers, but should win that game and if they do will be 9-2 and in total command of the AFC North. The Bengals (5-6) can stay alive in the division race (albet it just barely) with a victory, but they can definitely stay in the wild-card race with a win. Pittsburgh has dominated the series of late winning the last five in a row, including 29-14 earlier this season in Pittsburgh on Oct. 22, and eight of the last nine. The Bengals last win at home in the series came on Sept. 16, 2013 when they won 20-10. Lewis is just 8-23 against the Steelers since becoming Bengals head coach in 2003. The Bengals are also just 11-23 in Monday Night Football games. close"}, {"articleID": "2018022702_00215915_W", "names": {"Steve Rogers": ["Q24006357", "Q3499089", "Q3973387", "Q7613788"], "Simon Williams": ["Q15647498", "Q17020826", "Q4470100", "Q57901554", "Q58040063", "Q6242950", "Q7520052", "Q7520053", "Q7520054", "Q7520056", "Q7520060"], "Peter Parker": ["Q19596717", "Q21165177", "Q51587673", "Q56513979", "Q7176298"], "Steven Rogers": ["Q15437892", "Q50709434"], "James Rhodes": ["Q2012356", "Q42367696", "Q6142033"]}, "date": "2018-02-27", "url": "http://marvel.wikia.com/wiki/Marvel_Super_Heroes:_What_The--?!_Season_1_29?diff=4376977&oldid=4354223", "content": "Revision as of 16:39, February 11, 2018 (view source) Luismine23 (wall | contribs) ← Previous diff Latest revision as of 02:27, February 27, 2018 (view source) Luismine23 (wall | contribs) Line 62: Line 62: * Big Butt Universe {{Mentioned}} * Big Butt Universe {{Mentioned}} \"\"Itens:\" ' \"\"Itens:\" ' − * {{a | [[Hunger Virus]]}} + * {{Cameo | [[Hunger Virus]]}} * {{a | [[Iron Man Armor Model 37 | Bleeding Edge Armor]]}} * {{a | [[Iron Man Armor Model 37 | Bleeding Edge Armor]]}} * {{a | [[Black Widow's Gauntlets]]}} * {{a | [[Black Widow's Gauntlets]]}} − <!--+ <!--\"\"Vehicles:\" ' − \"\"Vehicles:\" ' + * <br />--> − * <br /> −--> | Notes = * Watch the full episode [https: //www.youtube.com/watch? v=Jh9NkpgbfNM here]. | Notes = * Watch the full episode [https: //www.youtube.com/watch? v=Jh9NkpgbfNM here]. Latest revision as of 02:27, February 27, 2018 \"Holiday Special with Iron Man & Deadpool\" Gallery Marvel Super Heroes: What The--?! Season 1 #29 December 10, 2013 Episode Title \"Holiday Special with Iron Man & Deadpool\" Director Alex Kropinak Writers Marly Halpern-Graser, Ben Morse, Todd Casey Producers Ben Morse, Todd Casey, Jesse Falcon, Alex Kropinak Previous Episode Next Episode \"San Diego Comic Con 2013 Special\" (June 25, 2013) \"Deadpool vs. Punisher\" (March 10, 2014) Appearing in \"Holiday Special with Iron Man & Deadpool\" Featured Characters: Iron Man (Tony Stark) Supporting Characters: Avengers Captain America (<mark>Steve Rogers</mark>) Hulk (Bruce Banner) Hawkeye (Clint Barton) Black Panther (T'Challa) (First appearance) Black Widow (Natasha Romanova) Thor Wonder Man (<mark>Simon Williams</mark>) (First appearance) Deadpool (Wade Wilson) Ant-Man (Hank Pym) Villains: Skrulls (First appearance) Other Characters: Fin Fang Foom (Mentioned) Guardians of the Galaxy (Mentioned) Sleipnir (Mentioned) Jim Rhodes (Photo) Howard Stark Wolverine (Logan) (Earth-811) (Cameo) Sentinels (Earth-811) (Cameo) Spider-Man (Miguel O'Hara) (Cameo) Marvel Zombies (Cameo) Colonel America (<mark>Steve Rogers</mark>) (Earth-2149) (Cameo) Spider-Man (<mark>Peter Parker</mark>) (Earth-2149) (Cameo) Hulk (Bruce Banner) (Earth-2149) (Cameo) Alex Kropinak (Cameo) Locations: Earth-TRN416 Earth (Destruction) New York City Manhattan Avengers Tower Earth-811 (Cameo) Earth-928 (Cameo) Earth-2149 (Cameo) Earth-1218 (Cameo) Big Butt Universe (Mentioned) Itens: Hunger Virus (Cameo) Bleeding Edge Armor Black Widow's Gauntlets Synopsis for \"Holiday Special with Iron Man & Deadpool\" Synopsis not yet written. Notes Watch the full episode here. Trivia No trivia. See Also Discuss \"Holiday Special with Iron Man & Deadpool\" on the forums Gallery for the Marvel Super Heroes: What The--?! series Cast Character Actor Recommended Media None. Links and References None. Footnotes Retrieved from \"http: //marvel.wikia.com/wiki/Marvel_Super_Heroes: _What_The--% 3F! _Season_1_29? oldid=4376977\" Categories: Episodes 2013, December Modern-Age Marvel Super Heroes: What The--?! Season 1 Alex Kropinak/Director Marly Halpern-Graser/Writer Ben Morse/Writer Todd Casey/Writer Anthony Stark (Earth-TRN416) / Appearances Avengers (Earth-TRN416) / Appearances <mark>Steven Rogers</mark> (Earth-TRN416) / Appearances Bruce Banner (Earth-TRN416) / Appearances Clinton Barton (Earth-TRN416) / Appearances T'Challa (Earth-TRN416) / Appearances Natalia Romanova (Earth-TRN416) / Appearances Thor Odinson (Earth-TRN416) / Appearances <mark>Simon Williams</mark> (Earth-TRN416) / Appearances Wade Wilson (Earth-TRN416) / Appearances Henry Pym (Earth-TRN416) / Appearances Deviant Skrulls/Appearances Fin Fang Foom (Earth-TRN416) / Mentions Guardians of the Galaxy (Earth-TRN416) / Mentions Sleipnir (Earth-TRN416) / Mentions <mark>James Rhodes</mark> (Earth-TRN416) / Minor Appearances Howard Stark (Earth-TRN416) / Appearances <mark>James</mark> Howlett (Earth-811) / Appearances Sentinels/Appearances Miguel O'Hara (Earth-928) / Appearances Zombies (Earth-2149) / Appearances <mark>Steven Rogers</mark> (Earth-2149) / Appearances <mark>Peter Parker</mark> (Earth-2149) / Appearances Bruce Banner (Earth-2149) / Appearances Earth-TRN416 / Appearances Earth/Appearances New York City/Appearances Manhattan/Appearances Stark Tower (Columbus Circle, Original) / Appearances Earth-811 / Appearances Earth-928 / Appearances Earth-2149 / Appearances Earth-1218 / Appearances Hunger Virus/Appearances Iron Man Armor Model 37/Appearances Black Widow's Gauntlets/Appearances Synopsis Needed Templated Articles"}, {"articleID": "2019072401_00047837_W", "names": {"Daniel Wilson": ["Q18638182", "Q267207", "Q28783194", "Q3701757", "Q41804974", "Q58150517"]}, "date": "2019-07-24", "url": "https://www.recordernews.com/news/local-news/159749", "content": "Legislature recognizes DPW supervisor for his carpentry skills Posted by Recorder News | Jul 23, 2019 | Featured, Local News, Top Stories | 0 | Winnie Blackwood/Recorder staffChairman of Physical Services Committee and District 5 Legislator <mark>Daniel Wilson</mark> reads a proclamation to recognize Gary Oeser, a structural maintenance supervisor for Montgomery County Department of Public Works, for his fine craftsmanship in creating an appellate bench during the committee meeting on Tuesday. State Supreme Court Judge Joseph M. Sise looks on during the issued proclamation. By WINNIE BLACKWOOD Recorder News Staff FONDA--A Montgomery County Department of Public Works employee was recognized for his fine craftsmanship in creating an appellate bench for the State of New York Supreme Court, Appellate Division, Third Judicial Department during its visit last month. Gary Oeser, DPW's structural maintenance supervisor, received a proclamation by the Montgomery County Legislature during their Physical Services Committee meeting on July 16 for his work in creating a special bench for the appellate division when they held a special session at Montgomery County Courthouse on June 6. State Supreme Court Judge Joseph M. Sise said on Tuesday that when he received word from Presiding Justice Elizabeth A. Garry of the Appellate Division of the Third Department that she would be bringing her court on the road for the first time in over 21 years and would be making a stop in Montgomery County, he immediately knew to ask Oeser to build a special bench for the occasion. \"I am glad to be a part of a proclamation regarding Gary Oeser because he follows a long line of men and women, who work for our county and care about our county, care about the presentation that we have to our citizens, specifically for me here at the courthouse,\" Sise said. A bench was created when the appellate division visited the county 21 years ago that took three DPW workers to build, but was repurposed. Sise knew the county could create another bench for the appellate division's most recent visit because of the fine craftsmanship and the skills Oeser has as a finish carpenter. \"Gary Oeser built such a quality bench that the appellate division, they came and sat on it and couldn't get over it; they couldn't get over it, how perfect it was,\" Sise said. \"His master craftsmanship, his hard work, his dedication to Montgomery County all came together to build this bench, this honey oak bench. He even picked the right wood to match the honey oak courtroom of our traditional, historic courtroom. It is so impressive. It outdid what we did 21 years ago, which was something, but also we are the only county that did that.\" Other counties that were part of the tour made makeshift courts with the five judges sitting at different levels on a trial bench, but because of Oeser's work they were all able to sit at the same level. \"The bigger picture is we in Montgomery County care so much about each other and about our county that it's evident from all that we do and Gary Oeser specifically, one man built this bench, not three, was such a fine example of what the very best of this county has to offer,\" Sise said. \"I was so proud.\" Garry is still raving about Oeser's work and the reception they received by the county, Sise said. \"I want to thank you, Gary, for that,\" Sise said. Chairman of the Physical Services Committee and District 5 Legislator <mark>Daniel Wilson</mark> presented Oeser with the proclamation after Sise's speech to recognize the finish carpenter for bringing praise and distinction to the county. \"The county of Montgomery is pleased to recognize employees, who take pride in their career and are committed to giving back to the people they represent,\" <mark>Wilson</mark> read from the proclamation. Montgomery County Executive Matthew Ossenfort also praised Oeser for his work, but added members of DPW had to step up to the plate and take over the day-to-day operations of the department that Oeser was in charge of as he worked on the bench. \"It was really a team effort all the way,\" Ossenfort said. Share:"}, {"articleID": "2010041212_00171132_W", "names": {"Robert Blake": ["Q16199517", "Q25351995", "Q524281", "Q53765054", "Q53765055"]}, "date": "2010-04-12", "url": "http://startribune.com/world/90604154.html", "content": "| world kyrgyzstan's deposed president gathers supporters, opponents threaten arrest by peter leonard, associated press teyit, kyrgyzstan - kyrgyzstan's deposed president on monday rallied supporters in his home village, testing his ability to mount resistance to the opposition forces that drove him out of the capital last week. as about 500 people gathered in a muddy field in kurmanbek bakiyev's native village of teyit, the deputy head of the self-declared interim government said in the capital that an operation to arrest bakiyev was being organized. \"just let him try. if he does, much blood will be shed,\" bakiyev told reporters who asked him about the statement by almazbek atambayev. atambayev did not give details about the arrest plans, but said \"we do not want fresh bloodshed.\" at least 81 people died in the capital last wednesday when a confrontation between police and protesters exploded into gunfire and chaos. protesters stormed government buildings and bakiyev fled to his native southern region. he has refused to step down and the rally in teyit brought an array of speakers who vowed their support and waved banners with slogans such as \"hands off the legitimate president.\" there were no uniformed police in view at the rally, and the loyalty of the country's security forces remains a significant question. the stalemate has left kyrgyzstan's near-term stability in doubt. that worries the west because a u.s. air base in kyrgyzstan is crucial in the military campaign against the taliban in afghanistan. the base is used both as the launch point for refueling flights over afghanistan and as a troop transit point. troop transit flights had been diverted for several days, but the u.s. embassy said monday those flights have returned to normal operation and that the refueling flights are continuing. u.s. assistant secretary of state <mark>robert blake</mark> is to travel to kyrgyzstan on wednesday for talks including the base status. atambayev, echoing previous statements by interim government leader roza otunbayeva, said the base's status will be discussed with the united states and \"we shall decide everything in a civilized way.\" many kyrgyz oppose the base and atambayev expressed deep ambivalence. \"this base is our common cause to provide stability in afghanistan,\" he said. but then he launched into criticism of the united states for allegedly cutting deals with bakiyev's family for contracts at the base. alleged corruption by members of the bakiyev family, including enriching themselves through fuel contracts for the base, was one of the top issues that brought out protesters last week. \"while trying to preserve the base, you lost the respect of the people,\" atambayev said of the united states. bakiyev told the associated press in an interview on sunday that he had not ordered police to fire at protesters in the capital. \"my conscience is clear,\" he said. he strongly urged the united nations to send a peacekeeping force to kyrgyzstan, arguing that the nation's police and the military are too weak to keep the unrest from spreading. \"the people of kyrgyzstan are very afraid,\" bakiyev said. \"they live in terror.\" otunbayeva, after meeting monday with european union representatives, said \"we are in a rather rigid and delicate situation: people in the street demand revenge, they are ready to go there and deal with him shortly, but we'll be cautious as far as the forceful scenario is concerned and won't allow new victims.\" in taking power thursday, the interim leaders said they controlled four of kyrgyzstan's seven regions. by saturday they claimed to have expanded their control throughout the country. the interim leadership on monday announced the dismissal of kyrgyzstan's ambassadors to the united states, germany, russia and turkey. but the ambassador to russia, raimkul attakurov, rejected the order, telling the russian state news agency ria novosti that he would leave only on bakiyev's order. kyrgyzstan's society is strongly clan-based, but there are few signs that bakiyev could muster any significant tribal support in the south to challenge the self-declared interim government. some analysts say that a hike in utility prices and massive corruption has set many southerners against bakiyev. at the polls - hungary's center-right fidesz party took a commanding lead in the first round of parliamentary elections on sunday, while jobbik, a far-right party with an anti-gypsy and extreme nationalist agenda, was a strong third just behind the governing socialists. tales of survivors, iran dominate israeli commemoration of jews who perished in holocaust tales of survivors, iran dominate israeli commemoration of jews who perished in holocaust - the mournful wail of air raid sirens pierced the air on monday, bringing hectic israel to a standstill as the country built on the ashes of the nazi holocaust remembered the 6 million jews who perished in world war ii."}, {"articleID": "2014112119_00053563_W", "names": {"Simon Fraser": ["Q12058068", "Q19043594", "Q21457277", "Q4492612", "Q55834851", "Q7518792"], "Arvind Gupta": ["Q18043985", "Q3633965", "Q4802480"]}, "date": "2014-11-21", "url": "http://news.ubc.ca/2014/11/21/vancouver-whitecaps-fc-launch-new-usl-pro-team-and-provide-update-on-national-soccer-development-at-ubc/", "content": "Preliminary rendering of the proposed state-of-the art fieldhouse at UBC by Acton Ostry Architects and BBB Architects. Soccer fans in Metro Vancouver will soon have a new professional team to cheer for. Whitecaps FC announced on Friday the launch of Whitecaps FC 2 (WFC2), the club's USL PRO team that will begin play in the spring of 2015. WFC2 will be owned and operated by Whitecaps FC and will play all home matches on the David Sidoo Field at Thunderbird Stadium, a natural extension of the club's training home at the University of British Columbia: the National Soccer Development Centre (NSDC) In partnership with UBC and the Government of British Columbia, the club also revealed preliminary renderings of the final phase of the NSDC, featuring a state-of-the-art fieldhouse (subject to final UBC Board of Governors approval), which is set to be completed prior to the start of the 2017 Major League Soccer (MLS) preseason. The fieldhouse is being designed by Acton Ostry Architects, an award-winning architectural firm based in Vancouver, in collaboration with BBB Architects, internationally recognized sports architects who recently completed the Kia Toronto FC Training Ground & Academy. In total, the multi-campus NSDC includes seven fields - two artificial turf fields at <mark>Simon Fraser</mark> University, and three grass and two artificial turf fields at UBC. \"Today marks another important milestone for our club and another step forward in our partnership with UBC,\" said Whitecaps FC president Bob Lenarduzzi. \"We're thrilled to be launching our USL PRO team at UBC. We have many talented young players at our club, including nine Residency products who recently did very well internationally with our Canadian U-20 men's national team. WFC2 will allow them to continue their development against quality competition, including our fellow Cascadia rivals from Seattle and Portland. Along with the renderings of our new training facility, we have a clear view into our future. These initiatives will provide a positive impact and lasting legacy for Whitecaps FC, Canadian soccer, UBC, and the community at large.\" \"This partnership with Whitecaps FC and the provincial government will allow for a greater student and community participation in field sports and will provide exceptional experiences for soccer fans,\" said UBC president <mark>Arvind Gupta</mark>. \"Having Whitecaps FC and varsity soccer programs here at UBC will inspire our students to pursue their passions and will further strengthen our successful Athletics program.\" Whitecaps FC 2 matches will be a unique, affordable experience for soccer fans, families, students, and supporters. The club is now accepting $50 deposits on season tickets, which start at $118 plus applicable fees - just $8 per match - for current MLS season ticket holders and the UBC campus community including residents, students, staff, and faculty. A limited supply of family packs are also available, starting at $199. For more information on all ticket options go to whitecapsfc2. com or call 604.669.9283 ext. 1. Fans who act now will also join the WFC2 Starting 11, recognizing the starting 1,100 season ticket holders of the inaugural WFC2 season and guaranteeing the lowest season ticket price for every future season. Starting 11 members will be provided exclusive rights such as voting on which kit the team will wear for each (home) match, winning a jersey off the back of a player, and two additional ambassador tickets to share with friends or family who have not attended a WFC2 match. As a bridge between the club's Residency program and MLS first team, WFC2 will replace the club's U-23 team and allow promising young players to develop in a competitive professional environment. Whitecaps FC are the seventh MLS club to officially field a team in USL PRO for the 2015 season, joining Cascadia rivals Portland Timbers (T2) and Seattle Sounders FC (Sounders FC 2), as well as LA Galaxy (LA Galaxy II), Montreal Impact (FC Montreal), Real Salt Lake (Real Monarchs), and Toronto FC. All MLS clubs are expected to either field their own team or have an affiliate in USL PRO next season. In September 2012, Whitecaps FC, UBC, and the B.C. government announced a joint initiative to construct and operate a shared-use soccer training facility at UBC. In February 2013, an improved grass field and locker room access was completed. In addition to Whitecaps FC's MLS team, the NSDC will become the permanent training home for the club's USL PRO and youth sides, as well as UBC's varsity teams, student recreation participants and community partners. Once completed, the NSDC at UBC will include five constructed, refurbished, and improved fields - three grass and two artificial turf - as well as the new 35,000 + square foot fieldhouse. The high performance training centre will create important recreational and high performance sports legacies for the UBC community, providing a major upgrade in facilities, including washrooms, change rooms, multi-use space, concessions, and classrooms. The NSDC will provide not only Whitecaps FC and UBC with state-of-the-art facilities and fields, but will be accessible to recreation leagues from across the city. The project is well underway with the near completion of UBC's Varsity Turf Field now located at Wolfson West Field. \"This world-class facility will be a hub of community activity for recreational, competitive and professional soccer players,\" said Coralee Oakes, minister of community, sport and cultural development. \"The centre will also be a tremendous draw for future hosting opportunities at a time when sport tourism is the fastest growing segment of B.C.'s tourism industry.\" Click here for the renderings of the proposed fieldhouse. For more information and news about WFC2, visit the official website at whitecapsfc2. com"}]