[{"date": "2014-08-07", "url": "http://www.huffingtonpost.com/2014/08/06/russia-racist-laser-obama_n_5656732.html?utm_hp_ref=world&ir=WorldPost", "content": "CNN Correspondent Who Allegedly Bit Paramedics Apologizes For Her Behavior Emma Watson Laughs Off Turkish Politician's Sexism With Cheeky Photo How My Father's Gay Marriage Trial Re-Ignited My Calling to the Ministry Iraq's Christians Threatened With Death But \"Vicar Of Baghdad' Stands Strong President Barack Obama received birthday greetings from around the world when he turned 53 years old on Monday, but some of those wishes weren't exactly well. In Russia, protesters used lasers to beam a crude, racist image of Obama onto the U.S. Embassy in Moscow. The image showed the president in a birthday hat with a banana going in and out of his mouth followed by projections of the words\" Obama \"and\" happy birthday \"in English. Racially-charged messages aimed at Obama have been cropping up with alarming regularity in Russia. Also on the president's birthday, a banner depicting Obama as the\" Three Wise Monkeys \"--see no evil, hear no evil and speak no evil--Across from the US embassy in Moscow today, Russians hung this racist banner addressing Obama on his 53rd birthday. a series of racially-charged posters were displayed around the city of Perm, with one showing the president with a banana, The Moscow Times reported. The late Sen. <mark>Robert Byrd</mark> (D-W. Va.) loosely said the\" N-word \"on\" Fox News Sunday \"in 2001, while discussing the state of race relations in the United States. In a WPIX interview in 2012, East Haven, Conn.. Mayor Joe Maturo (R) was asked what he would do for the Latino community. Maturo replied,\" I might have tacos when I go home. I'm not quite sure yet. \"In 2011, Texas state Sen. <mark>Larry Taylor</mark> (R) made a culturally insensitive remark while speaking at a hearing regarding an insurance company paying policy holders in a timely manner .\" Don't nitpick, don't try to Jew them down, \"<mark>Taylor</mark> said. Recordings from Richard Nixon's presidency recovered in 2009 revealed that Nixon thought abortion was necessary\" when you have a black and a white...or a rape. \"In 2010, South Carolina state Sen. Jake Knotts (R) referred to President Barack Obama and South Carolina Gov. Nikki Haley (R) as\" ragheads. \"BuzzFeed released footage of the incident in 2012. In 2006, former Florida state Rep. Ralph Arza (R) was accused by Bruno Barreiro of calling a school superintendent a\" negro mierda, \"meaning\" black piece of sh--\"in English. Arza resigned and faced criminal charges after spouting threats and racial slurs such as\" n--er \"in a drunken voicemail to Barreiro. While campaigning in 2006, former Sen. <mark>George Allen</mark> (R-Va .) referred to an Indian-American as\" macaca, \"a slur typically directed to Africans. While speaking to reporters on a campaign bus in 2000, Sen. John McCain (R-Ariz .) used the slur\" gooks \"while condemning the Vietnamese prison guards who tortured him .\" I hate the gooks, \"McCain said .\" I will hate them as long as I live. \"While serving as a Missouri senator, Truman referred to waiters who served at the White House as an\" army of coons \"in a letter addressed to his daughter. In a letter to his wife in 1939, Truman used the phrase\" n--er picnic day. \"The book\" Game Change \"by reporters John Heilemann and Mark Halperin, published in 2010, revealed that Senate Majority Leader <mark>Harry Reid</mark> (D-Nev .) made some racial remarks in reference to Obama during his 2008 campaign. The passage in the book reads:\" [<mark>Reid</mark>] was wowed by Obama's oratorical gifts and believed that the country was ready to embrace a black presidential candidate, especially one such as Obama--a \"light-skinned' African American\" with no Negro dialect, unless he wanted to have one,' as he later put it privately. \"<mark>Reid</mark> apologized for the comments in a statement released in January 2010 .\" I sincerely apologize for offending any and all Americans, especially African-Americans, for my improper comments, \"<mark>Reid</mark> said. Some Russians project laser image of Obama eating a banana on the...Nigerian Nurse Who Treated Ebola Patient Dies Of The Disease Rare Footage Appears To Capture Gaza Rocket Site Why Christ, Mao And The Buddha Are Making A Comeback In China MIKHAIL KLIMENTYEV via Getty Images\" The Huffington Post \"is a registered trademark of TheHuffingtonPost.com, Inc.. All rights reserved. Describe the error here (1,000 character limit) * Type the words below so we know you are not a cyborg", "articleID": "2014080712_00025791_W", "names": {"George Allen": ["Q22276776", "Q527553", "Q5536192", "Q5536193"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"], "Larry Taylor": ["Q2075846", "Q3218109", "Q52863279", "Q6491197", "Q726296"], "Robert Byrd": ["Q24301024", "Q276524", "Q7342555", "Q7342556"]}}, {"date": "2014-08-07", "url": "http://www.jdjournal.com/2014/08/07/famu-law-school-sued-by-professor/?hvid=4N8j2k", "content": "1,000,000 + Attorneys and Legal Staff Case Western Reserve Announces Interim Law Deans to Remain in Posts ABA Bestowing Honor on Tulane Law School Geoffrey Shields, Former VLS Dean, Dies at 68 <mark>Jennifer Smith</mark>, a law professor at the Florida A & M University Law School, has filed a lawsuit against the institution, according to The Tampa Tribune. She claims salary inequities, retaliation and discrimination in her lawsuit, which was filed in Leon County circuit court last week. <mark>Smith</mark> was hired in 2004 as an associate professor. The complaint states that it was filed in Tallahassee because that is where the school is headquartered. Eight violations of federal and state law for equal pay and gender discrimination are mentioned in the suit against the school. She is asking for a promotion to full professor, unspecified damages, attorney fees and other relief. The complaint said that <mark>Smith</mark> was granted tenure in 2010, but has been rejected for promotion to full professor since then. According to the complaint, an administrator \"sabotaged' her promotion by putting negative recommendations in her personnel files in place of positive ones. The administrator called other officials at the school to prevent promotions. <mark>Smith</mark> claims that the treatment was done in retaliation for her request to public records about professor-pay information. <mark>Smith</mark> said she filed a workplace-violence complaint against the same administrator. She said the administrator\" made some threatening comments about her. \"The complaint quotes a report from the ABA in September of 2012 about the law school that cites concerns from faculty about an\" inhospitable environment for women, lesbians and gay faculty members. \"Law School News. You can follow any responses to this entry through the Philly Woman with Permit to Carry Charged in New Jersey with Unlawful Possession of a Weapon Attorney Career Resources: In-House Corporate Attorney Jobs Grow As Business Burgeons In Birmingham", "articleID": "2014080802_00071089_W", "names": {"Jennifer Smith": ["Q10306654", "Q14322421", "Q3177108", "Q3177109"]}}, {"date": "2014-08-08", "url": "http://timesofindia.indiatimes.com/life-style/relationships/man-woman/The-allure-of-the-older-woman/articleshow/38075104.cms", "content": "READ MORE Demi Moore | Courtney Cox | Ashton Kutcher | romance | older woman The allure of the older woman RELATED 10 Things women wish men understood Orgasm opens up partners more in bed! Offbeat ideas for your honeymoon Social media to the rescue in all walks of life 3 alternatives to traditional marriage With Courtney Cox getting engaged to her younger Irish rocker boyfriend, the focus is once again on the May-December couple If you thought that the breakdown of Demi Moore's marriage to Ashton Kutcher, who was 16-years younger to her, would put an end to young man-older woman romances, think again. Courtney Cox (50) just got engaged to her Irish rocker boyfriend, John McDaid (37), who's 13-years her junior. May-December couples no longer raise eyebrows the way they did in the past. Psychologist Sudha Vasan says, \"Today you can see relationships among all kinds of people regardless of their age. Younger men wanting to date older women generally find women their own age manipulative, self centered, and shallow. The older women are have more depth and maturity, which these men find fascinating .\" If you've fallen head-over-heels for an older woman, here's how she differs from the girls you've dated before. She'll take you lightly at first If you thought opening the door for her would fetch you brownie points, you're wrong. She'd be grateful for being courteous, but that's about it. So, take it easy, don't overwhelm her with too much help or attention for that matter. At the same time, do not seem frivolous or inattentive. She's not easy to impress She's independent and outings at fancy places and gifts might be ho-hum to her. Don't fake interests - you're likely to be dropped the moment she catches bad GK on that hobby you're lying about to impress her. Be an attentive listener and rope in topics you're aware about. She's no shrinking violet Remember this woman can travel alone, and probably has a bigger car than you do. She might just drop you home and is most likely to be the one to initiate the first kiss. She shells out her own money She's earning (perhaps much much more than you), so when you do take her out on a date, she'd persistently stress on splitting the check, oblige her humbly. http: //timesofindia.indiatimes.com/followceleb.cms? alias=Demi Moore, Courtney Cox, Ashton Kutcher, romance, older woman Post a comment Subscribe to Lifestyle Newsletter Find out about the latest Lifestyle, Fashion & Beauty trends, Relationship tips and more ALSO ON TOI Kendall Jenner strips to linge...Leaked: <mark>Terry Richardson</mark>'s unr...Cameron Diaz sizzles on the co.. . Carmen Electra shows off incre...Paris Hilton flashes underwear...Kim Kardashian flashes her nip...Beyonce flaunts her butt cheek...Parineeti Chopra flaunts her c.. . Ellie Goulding flaunts her cle...Alok Nath effect: Strip queen...Katrina Kaif, Ranbir Kapoor st.. . Watch: Poonam Pandey's top 5 h.. . Poonam Pandey does a seductive...Priyanka Chopra voted Bollywoo...Katy Perry flashes her panties ...", "articleID": "2014080814_00021074_W", "names": {"Terry Richardson": ["Q3518927", "Q714583"]}}, {"date": "2014-08-11", "url": "http://www.alexandrianews.org/governor-mcauliffe-announces-creation-of-childrens-cabinet-and-the-commonwealth-council-on-childhood-success/", "content": "Alexandria Virginia Local News Since 2008 Governor <mark>McAuliffe</mark> today signed an Executive Order creating a cabinet solely dedicated to the education, health, safety, and welfare of Virginia's children and youth. The newly launched Children's Cabinet will develop and implement a policy agenda that will help better serve Virginia's children and will also foster collaboration between state and local agencies. As a part of that effort, the Governor also signed a second Executive Order establishing the Commonwealth Council on Childhood Success. This Council will be chaired by Lt. Governor Northam and will focus on improving the health, education, and well-being of our youngest children. \"Children are the Commonwealth's most important resource, and it is critical that we provide them with the tools and resources they need to thrive in a 21 st century economy,\" said Governor <mark>McAuliffe</mark>. \"Both the Children's Cabinet and the Commonwealth Council on Childhood Success will help ensure that Virginia's children live happy and productive lives .\" Secretary of Education Anne Holton and Secretary of Health and Human Resources Bill Hazel will serve as co-chairs of the Children's Cabinet. Lt. Governor Ralph Northam, Secretary of Public Safety <mark>Brian Moran</mark>, Secretary of Commerce and Trade Maurice Jones and the First Lady of Virginia <mark>Dorothy McAuliffe</mark> will serve as members of the Children's Cabinet. \"The Children's Cabinet provides an opportunity to work together on the complex issues that affect a child's development. Addressing the need for safe housing, access to healthcare and proper nutrition are important first steps that will help bridge the achievement gap and prepare Virginia's children to succeed in a new Virginia economy,\" said First Lady <mark>Dorothy McAuliffe</mark>. \"It is an honor to be named Chair of the Commonwealth Council on Childhood Success,\" said Lt. Governor Northam. \"I am incredibly grateful that early childhood is a priority for Governor <mark>McAuliffe</mark> and his administration. The early years of a child's life are extremely formative, and have a significant impact on their health, growth, and readiness to succeed. As policymakers we must ensure that our public investments in these services provide adequate access and high quality programs. I look forward to working with state agencies, local school districts, service providers, the business community, and advocates to ensure that every Virginia child has the opportunity to thrive and succeed .\" \"The establishment of the Children's Cabinet is a great first step towards addressing the basic needs of Virginia's youth,\" said Secretary Holton. \"There are schools, neighborhoods, and communities across the Commonwealth suffering under the crushing weight of entrenched poverty, and it is our goal with the Children's Cabinet to offer a helping hand, not a wagging finger .\" Secretary Hazel added, \"While regular communication between secretariats regarding children and youth issues is important, we believe a more significant impact can be achieved by delving further into the issues impacting the health, education and success of our children .\" The Children's Cabinet will focus on five specific priority areas: Eradicating the achievement gap in schools in high poverty communities. Increasing access to basic needs including housing, healthcare, and proper nutrition. Improving outcomes for youth transitioning out of Virginia's juvenile justice, mental health and foster care systems. Increasing workforce opportunities for parents and for youth as they transition out of high school.", "articleID": "2014081203_00004314_W", "names": {"Brian Moran": ["Q17232911", "Q4964801"], "Dorothy Mcauliffe": ["Q45120525", "Q56282493"]}}, {"date": "2014-08-17", "url": "http://seekingalpha.com/article/2429355-chapman-and-hempton-on-herbalife-the-blind-are-leading-the-blind?source=feed_sector_healthcare", "content": "Summary Bill Ackman has claimed, in PSQ's letter, that he will eat the premiums on a new set of options, if necessary, to continue his Herbalife short. Hey Bill, me too! Perry and Soros have trimmed their stakes, as reported by the NY Post a day after \"13/D day\". Bob Chapman has flown off the handle and, in the process of missing the entire point on HLF, misdirected his hostility for John Hempton's Herbalife comments towards Bill Ackman. Also, Bob Chapman appears to be wrong about everything. More on this below. A Small Note What would an early Saturday morning and coffee be without putting down my thoughts on the recent Herbalife developments that have taken place this week? As you'll notice, due to a growing work load on other projects with priority for me, you can expect to see less QTR than you're used to here on Seeking Alpha. This has nothing to do with Seeking Alpha themselves, they've been more than amazing to their contributors and they continue to be one of the best places for crowd sourced content on finance. It's an extremely strong and powerful platform, one that I'm gracious to note has landed me some projects that I'll likely be busy with for the foreseeable future. Because I'll also not likely have tons of time to pen articles and will be putting down a lot of my thoughts in short quips, rather than novellas, I'll also be posting a bit on my newly formed blog, which you can read and bookmark follow me on Twitter, where I'll still be active and will note where and when I'm posting new articles/blogs. Of course, you can always e-mail me, as well (quoththeravensa @ gmail.com). Some people will be saddened by this, others are already chugging champagne and ordering pyrotechnics for the party that will ensue this evening at their respective homes and hedge funds. Regardless of what you think about QTR, I thank you for being a part of it all thus far. We've got lot of beautiful work still to do in the future, I assure you. The Herbalife Soap Opera Continues Now, onto Herbalife. For those of you that missed it, Bill Ackman released his letter to shareholders earlier last week. As usual, Michelle Celarier was the first to summarize the important parts in her NY Post piece that was out Wednesday of this past week: Ackman, who has called Herbalife a pyramid scheme, said he is prepared to extend his $1 billion short bet against the nutritional products company - in the form of put options that expire next year - if necessary. The activist argued that not only is Herbalife's business \"deteriorating,\" but there is \"much greater risk of regulatory shutdown or reform along with further stock price declines,\" according to the letter. Ackman also acknowledged his recent Herbalife presentation flop, saying \"in light of the hype, investors and the media came to the event perhaps expecting recordings of the CEO acknowledging that he had been running a pyramid scheme .\" In a bid to put a positive spin on it, Ackman now claims the dense, three-hour presentation was \"designed for regulators,\" and went on to remake his case against Herbalife's nutrition clubs. \"As a result of our investigation, we are now able to explain and document to regulators that what Herbalife management has deemed\" daily consumption' at nutrition clubs, is in fact a low - income, pyramid scheme concealed within the larger pyramid scheme, \"he wrote. In addition to that, and earlier in the week, Herbalife (NYSE: released a letter to regulators entitled\" Bill Ackman's Attempt to Goad Regulators Into a Baseless, Unnecessary Legal Battle \". It's got a nice ring to it, doesn't it? In this letter - which QTR can only really describe as absurd and dripping with emotion - Mr. Chapman makes a couple of ridiculous assertions, like: Mr. Ackman\" did the wrong thing \"by playing a tape of John Hempton calling company executives\" scumbags \"on CNBC live national television. If you haven't seen the full video of Mr. Hempton defending Herbalife, you can watch it here. Try not to watch it within 3 hours of eating a meal. I've since unblocked Mr. Hempton on Twitter, as I'd like to have a beer with the man some day after this is all said and done. I'm extending an olive garden to him, some will say. That's how the expression goes, right? Unlimited soup, salad, and breadsticks? Whatever. I still contend Hempton has this trade all sorts of wrong. Remember kids, John Hempton was buying the stock\" even though he agrees with Ackman \", Herb Greenberg says to start this CNBC interview. So, he was either pushing his moral compass to the side or he was part and parcel with a group that was trying to orchestrate a short squeeze. Regardless, I'd argue Hempton knows exactly what kind of company this is and his\" unreserved apology \"for his statements he made on air is a product of either doubling down on a shaky case or simply throwing his moral compass to the wind and looking at Herbalife's cash flow and financials the same way that Huckleberry Hound used to look at a steak. I love the label CNBC puts up: Hempton agrees with Ackman, except on facts. No kidding. Hempton's rock solid defense in 2013, well before there was a massive regulatory presence on the scene, was made up of the following verbatim statements, all included in the above link: I short scumbags, I'm pretty familiar with scumbags. Multi-level marketing schemes are scumbags. This one's got 2.5 million people in their chain and Bill Ackman's case is that they rip them off. Well, you know, look at smoking companies. Tobacco companies kill 5 million people a year - twice as many people a year globally as Herbalife has in its network. They're scumbags, but they've returned cash to shareholders for decades and if you've shorted them you've been run over. It buys back stock regulatory, it has a fairly hefty dividend - they're scumbags, but they're the stock market's scumbags. All Herbalife needs to do is find somebody who was fat and is less fat because of Herbalife and somewhere in their 2.5 million distributors there'll be a few of those. And all they do is wheel them out in front of [the FTC]. A thesis that says I have to wait for the government is a bad thesis .\" Nailed it, \"Hempton likely thought to himself after this interview. But I'm calling nonsense here. When you say things like this on live national television, that's pretty much the international queue for asking for people to continue to disseminate it. Isn't that the whole point of going on TV to make your point? Thus, I'd suggest Mr. Chapman have words with Mr. Hempton about his statement, and not attack Mr. Ackman for replaying it. Mr. Ackman was simply dipping into the vault of media out there on Herbalife and it just so happened Mr. Hempton said something he likely regrets now. Next time, perhaps Mr. Hempton will be a bit more calculated with his words. I can only imagine the phone calls Mr. Hempton got from fellow longs after they saw this interview on CNBC. In contradictory fashion, later in his letter, Bob Chapman goes on Even John Hempton's careless choice of words in 2012 [sic] was intended to convey his view that the MLM industry has participants, including some distributers [sic] of Herbalife products, who are overly aggressive and opportunistic. Moreover, that singular statement, no matter how taken out of context by Bill Ackman, did not represent anyone but John Hempton's apparent view at that particular time. Taken out of context? He was calling the C-Level suite at the company\" scumbags \". There's nothing really to take out of context. Dry the\" taken out of context \"excuse out and you can fertilize the lawn of Michael O. Johnson's Malibu home. Bob Chapman's next complaint is as follows: He incorrectly asserts that Seeking Alpha\" articles \"(he puts this in quotes like I'm writing instruction manuals on how to eat frozen yogurt) are trying to shame the regulators into acting. He also asserts that shorts are trying to goad regulators into acting and infers that this is an\" order sent down from Pershing Square. \"With regard to this - who cares if people are trying to goad the regulators into acting? Of course they are. This company is a fraudulent enterprise at its most intrinsic levels. If people were trying to goad regulators into acting on Madoff, do you think history would be kind to them? Personally, I'm not trying this strategy - I already have what I want, and that's simply for these regulators to take a good, hard look. I'm convinced there is too much evidence for them to let this company slide - Alan Hoffman or no Alan Hoffman. Bill Keep and Vander Nat, I'd think, would side with me on this. I know that regulators must move slowly and in a calculated fashion and I accept that. I actually prefer that they do, in order to get things right. The people at these agencies aren't idiots - they're PhDs in business and people with law degrees from prestigious institutions that are critical, logical thinkers. Take note, Mr. Hempton; they don't care what the company's free cash flow is, they're not duped by the temporary circus act of a $1 billion stock buyback - they care whether or not the source of the success you tout is inherently fraudulent. Further, there's no point of goading now - the investigations are all underway. Mr. Chapman, as much as he wants, can't go back and stop the FTC et. al from investigating. The commission voted, the investigation is open. The ball is rolling now - and the facts are on the side of the shorts. We have concrete evidence and proof of how this scheme operates. Ackman has nailed the top distributors to the wall, we've got enough primary source evidence of false income claims, false medical claims, Universidad del Exito, predatory practices, potential mail/wire fraud, and flailing fundamentals to last us the next six lifetimes. It's like Fantasia, the evidence just keeps on coming and coming! On the heels of Mr. Ackman's last presentation and Herbalife's underwhelming earnings report, the short thesis is as rock solid as its ever been. This is the most blatant case of a predatory company (that now could be failing on its own) that I've seen - possibly since I've started investing. Also, to address more garbage claims from Mr. Chapman, my articles are my opinion only. I have never been asked by Pershing Square to write about anything specifically or Herbalife in general, nor do I have any working relationship with them. I'm short because of Pershing Square's original case and then doing tons of my own, furious due diligence. This isn't a case where I went out and got short, and then decided to check my facts. I'm short because I checked my facts first and saw more downside potential than upside potential. It's that simple. I'm not Pershing Square - or anyone's pawn. If Mr. Chapman doesn't like me pointing out things like the\" 24 Ways that Herbalife is Mocking the Regulators \", or he feels that's\" goading the regulators \", perhaps he needs to re-associate himself with the realistic truth behind this company. Additionally, he doesn't have to read me, and I'd encourage him not to. Chapman finishes his piece by speaking on behalf of regulators: That regulators refuse to be cajoled, bullied, prodded, goaded and\" shamed \"into pursuing Bill Ackman's profiteering and self - aggrandizing agenda does not come anywhere close to making them\" spineless. \"This is so obvious that any reasonable observer, Herbalife investor or otherwise, would have to agree. Thank you, Mr. Chapman. Those statements have been duly noted, but I doubt the FBI, FTC, SEC, DOJ, and Attorneys' General need you to stick up for them. They're the ones with the badges and the guns, remember? They're likely not intimidated by Bill Ackman. noted on Wednesday that TheStreet downgraded Herbalife due to the performance they posted in the last quarter: Embattled nutritional supplement firm Herbalife Ltd. (NYSE: HLF) has been downgraded from Buy to Hold NYSE: TST). <mark>Kevin Baker</mark> and colleagues cite\" deteriorating net income, weak operating cash flow and a generally disappointing performance in the stock itself \"as reasons for the downgrade in their report published Wednesday, August 13th. Which brings us to the topic of distributor confidence. Here's where I'd like Mr. Chapman, Mr. Hempton, and other bulls to perk up and listen. While everyone is bickering about regulators and Mr. Ackman, does anyone else get the impression from the company's last earnings report that distributor confidence may be waning? Suppose Mr. Ackman wanted to get the eyes on his last presentation not just for regulators and for the media, but also for all of those people that are currently in Universidad del Exito in South American countries. If you were viewing Ackman's presentation and were in the middle of a time and lifestyle sucking Club 100 endeavor, wouldn't you then start to think twice about what it was you were partaking in? Matt Stewart points out, in a past piece, that many people from countries where Herbalife is extremely popular had tuned into this last presentation. Mr. Ackman was right. It is an Enron style fraud when you look at how Club 100 works. I know why he was hyped up the day before - I know how he was looking at this evidence. It may not have been damning to the people like the nameless ditzy (major news organization) reporter in the room who embarrassed herself with a question during the Q & A, but to those paying extremely close attention to this scheme and how it works - that presentation was a gallon of jet fuel thrown onto an already burning fire of evidence. If Vander Nat, who is presumably working with regulators on this (no one can get in touch with him), had any holes in his thesis to pin this company to the wall, Mr. Ackman's last presentation just filled them like a compressed can of Herbalife\" Fix-A-Flat \". This is a confidence game. If distributor confidence begins to wane, the whole thing is going to be crumbling down from the inside out - even without the help of regulators. Perhaps some of the more\" on the ball \"fund managers are starting to notice this. Bloomberg reported last week that Perry Capital also cut its stake in the name: Perry Capital, the $10.9 billion hedge-fund firm run by ALLY) and Allergan Inc. and cut its holding in nutrition company HLF) during the second quarter. Perry, based in New York, acquired 14.3 million shares of Detroit-based Ally that were valued at $341.2 million as of June 30, according to a filing with the U.S. Securities and Exchange Commission today. Ally was the hedge-fund firm's second-largest U.S.-listed stock holding, after American International Group Inc.. Perry sold 800,000 shares of Herbalife, leaving it with 4 million shares worth about $258 million as of the end of the quarter, according to the filing. It sold out of its 5.2 million shares of the real estate investment trust Equity Commonwealth. reported that George Soros shaved off some of his stake in the company, as well. Headlines are also making their rounds that Mr. Soros believes the market is heading into bearish territory - I'm going to take a good guess and say that his remaining couple million shares are now boxed into a long squeeze. But, that's just a guess. To Conclude The mindset and mental gymnastics necessary for the small few that continue to stay brazenly long this name baffles me. You can tell by the way Mr. Hempton speaks in his CNBC interview that at one point he seemed to know the truth about those running the company and what they were up to. He even admits that the MLM industry as a whole are\" scumbags \". My guess is that Mr. Hempton knows exactly how this game is being played and has been lying to himself about his change of heart. Who knows why he's had his change of heart - perhaps he's been bought off, perhaps he feels he's too far in on the long thesis to turn around - perhaps he's trying to protect people like <mark>Kevin Thompson</mark>, MLM Attorney, whose entire livelihood likely depends on this industry surviving. For the shorts, this may be about the money; but for some of us, it's also about doing what's best for our country and our fellow people. This is a predatory company that should not be allowed to operate the way is currently does. For the bulls, this has always been about the money. If it's not trying to orchestrate a squeeze, it's looking at the cash flow or the buybacks. It's been about how to make a good buck, regardless of how this company is generating it's cash. I continue to contend that this is a global confidence game that will be shut down by regulators - the sooner, the better. Just remember - karma's a bitch. See you all soon, Chapman And Hempton On Herbalife: The Blind Are Leading The Blind Long/short equity, contrarian, special situations, wild cards We only use your contact details to reply to your request for more information. We do not sell the personal contact data you submit to anyone else. Thank you for your interest in Seeking Alpha PRO We look forward to contacting you shortly for a conversation. Our PRO subscription service was created for fund managers, and the cost of the product is prohibitive for most individual investors. At this time, we do not yet have a subscription product for individual investors. If you'd like us to contact you when it's ready, please click here. If you are an investment professional with over $1M AUM and received this message in error, click here and you will be contacted shortly. Thank you for your interest in Seeking Alpha PRO", "articleID": "2014081712_00018096_W", "names": {"Kevin Baker": ["Q3195652", "Q6395772"], "Kevin Thompson": ["Q15460072", "Q21062645", "Q3814856", "Q6397622", "Q6397624"]}}]