[{"date": "2014-08-17", "url": "http://feeds.washingtonpost.com/c/34656/f/636679/s/3d96747b/sc/13/l/0L0Swashingtonpost0N0Csports0Credskins0Ckyle0Eshanahan0Eand0Erex0Egrossman0Ereturn0Eto0Eold0Estomping0Egrounds0C20A140C0A80C170Ce22edd7c0E7a390E47680Eb69d0Efcef4718873e0Istory0Bhtml0Dwprss0Frss0Isports/story01.htm", "content": "\"BATMAN: Assault on Arkham': 5 Takeaways from the new animated adventure Comic Riffs | David Betancourt Free and Easy: Civil War Weekend, #SummerCool Block Party, Kush Abadey Cleveland Browns wide receiver AnthonyArmstrong catches a long pass against cornerback Jordan Poyer during training camp. (Mark Duncan/Associated Press) Cleveland Browns to FedEx Field on Monday night. In addition to former offensive coordinator Kyle Shanahan, who coached in Washington the past four seasons, and two other former assistant coaches, the Browns also now have three past Redskins players on the roster. <mark>Anthony Armstrong</mark>, who played in Washington in 2010 and 2011 now is looking to make the Browns' 53-man roster. Tight end Emmanuel Ogbuehi, who signed with Washington as an undrafted rookie in 2013 but didn't survive final roster cuts, also plays for the Browns. Rex Grossman, who played with Washington for four years. This is now Grossman's third stint with Shanahan, having played under him in Houston before following him to Washington. Washington's players last week were happy to hear Grossman, who started for Washington in 2011, had found work. Left tackle Trent Williams said he had wondered why Cleveland hadn't signed Grossman sooner. But wide receiver Santana Moss and cornerback DeAngelo Hall both half-jokingly commended Grossman on making a smart veteran move in waiting until the end of training camp to agree to a deal. Grossman remained a popular figure in Washington's locker room the past two seasons even after Robert Griffin III and Kirk Cousins arrived on the scene, knocking the veteran down to third string. Players all liked Grossman's aggressive style of play and willingness to go for the gusto, even though at times, he would keep both teams in the game, gunning touchdown passes and interceptions with nearly the same frequency. Tongue in cheek, Hall lamented the fact that he wouldn't be in the game still by the time Grossman took the field .\" If I wasn't trying to just get out of [this preseason game] healthy, I'd probably ask to go back into the game to face Rex, \"he said .\" We all know he's going to throw some 50-50 balls up there, because he's a gunslinger. \"Shanahan brought with him to Cleveland assistants Mike McDaniel (wide receivers coach) and Richard Hightower (special teams assistant in Washington and now an offensive assistant). Shanahan and Griffin had their clashes. But Washington's other offensive players have a great deal of respect for their former offensive coordinator. Wide receivers Pierre Garcon and Santana Moss praised Shanahan as a great offensive mind, and said they still had a good relationship with him. Backup quarterback Kirk Cousins also expressed gratitude for Shanahan's work with him, and said\" I always felt like his preparation and game planning always put me in a position to succeed. \"Fullback Darrel Young, who joined Washington's practice squad as a linebacker late in 2009, but under Shanahan made the switch to fullback and started all four years, also had high praise for Shanahan .\" It's kind of weird seeing him in Brown, \"Young said .\" But I have the utmost respect for Kyle because he put me in position to be a starter for this Redskins organization, and he allowed me to put some good stuff on tape so I could earn Jay's confidence. So, my hat's off to him. But obviously, I want to win this game. \"Have a Redskins question? Send an e-mail to mike.jones @ washpost.com with the subject line\" Mailbag question, \"and it might be answered on Tuesday in How motorized wheelchairs became a symbol of Medicare fraud In Ferguson, three minutes - and two lives forever changed Some evangelicals in Republican Party are feeling left out, see no standard-bearer In Iraq, captured Yazidi women fear the Islamic State will force them to wed", "articleID": "2014081803_00016533_W", "names": {"Anthony Armstrong": ["Q21457672", "Q4772017"]}}, {"date": "2014-08-19", "url": "http://wgrz.com/story/sports/high-school/2014/08/19/hamburg-volleyball/14300947", "content": "MORE HAMBURG, N.Y. - A huge weight has been lifted off the shoulders of Hamburg volleyball player, Zachary Yerington. The senior middle hitter has chosen to play at Ohio State in the fall of 2015. Yerington verbally committed to play for the Buckeyes last week and couldn't be more excited. \"It's been one of my dreams since I was probably in seventh or eighth grade to go to Ohio State and play a sport there. At first I wanted to play football because I was playing football at the time and then I switched to volleyball my freshman year so that was kind of my dream to get there and play there,\" Yerington said. Yerington explains how the recruiting process all came together. \"Coach Hanson actually sent me an email and asked for my phone number so he could call me and talk about it. I didn't really have words at the time I was kind of just exuberant almost,\" Yerington explained. With a skilled player like Yerington, it's hard not to talk about his success at Hamburg. Head Coach <mark>Brian Carroll</mark> explains how he's been able to be so successful. \"Zach's a big part of our team but it's not all about him. He's definitely a person who can put a ball away when we need that but we also have some very high skill players in other positions that allow him to have the success he has. He's talked about how he's going to be going to Ohio State, he needed to have a team get him there to have the skill to be able to get looked at. He has a lot of kids here who have helped him along the way so in a way really our whole program is going there which is kind of nice,\" Coach <mark>Carroll</mark> explained. Even though Yerington already has his college career lined up, he still has one more season left with Hamburg and expectations are high as usual. \"I think we're going to be good I think we can push for the sectional championships again and hopefully further but we've got a tough road ahead of us because there's a lot of tough teams in our division,\" Yerington pointed out. \"Our team is solid, pretty well rounded, we're pretty deep and have a team of eleven but a majority of the kids will be able to get on the floor during the season. We have a lot of experienced players returning as well as some nice youth coming up to fill the roster out,\" Coach <mark>Carroll</mark> pointed out. The Bulldogs look to win back-to-back sectional titles this year and Coach <mark>Carroll</mark> seems confident in his group's work ethic this season.", "articleID": "2014082003_00048717_W", "names": {"Brian Carroll": ["Q18205841", "Q265252", "Q48362944", "Q4963300", "Q911994"]}}, {"date": "2014-08-20", "url": "http://mv-voice.com/news/show_story.php?id=8436", "content": "LASD board members call it quits Two school district board trustees announce retirement following agreement with charter school Two board members at the Los Altos School District are leaving on a high note this year. Following approval of the five-year agreement with Bullis Charter School and approval of placing a facilities bond measure for the November ballot, <mark>Doug Smith</mark> and Mark Goines announced they will step down. Both <mark>Smith</mark> and Goines started working with board members at Bullis Charter School about a year ago on what would later become the five-year agreement. <mark>Smith</mark> had been on almost every one of the \"negotiating teams,\" and was one of two board members who stuck around until the early hours of the morning at mediation meetings to make sure the legal team was happy with every last comma in the agreement. But <mark>Smith</mark> won't take any special credit for the agreement. He said everyone on the board and the district staff put a significant amount of time and effort into the agreement, and helped to strike a comprehensive compromise between the district and the charter school. \"It's always a team effort,\" <mark>Smith</mark> said. He said that Randy Kenyon in particular, the district's assistant superintendent of business services, did a great job giving the board an idea of what the school district needed to provide to the charter school under Proposition 39. Though <mark>Smith</mark> did not say whether his decision to retire from the board hinged on the approval of the five-year agreement or the board's success in getting a bond measure on the November ballot, he did say that the new board members will be in a more stable position going forward. Though the five-year agreement and the ballot measure are fresh on everyone's minds, <mark>Smith</mark> said he's also proud of how much the district has improved the school programs over the years, which included throwing out the \"old model\" of teaching. \"When I ran five years ago, I really wanted to revamp the way we deliver curriculum,\" <mark>Smith</mark> said. He said the district has done a great job shifting away from lecture-style teaching and towards collaborative work and small group projects, where students divide up responsibility for the project and have specific jobs. \"If you look at kids leaving the program, they are able to work well with others, and they are inquisitive,\" <mark>Smith</mark> said. When elected to the board, one of the first things <mark>Smith</mark> had to do was hire a new superintendent for the district. He said the board's choice of Jeff Baier has worked out great, and that the board has had a \"fantastic\" relationship with him. \"We chose someone that we collaborate with well,\" <mark>Smith</mark> said. \"Jeff is always very well-prepared .\" In a statement addressed to the LASD community, Goines commended Baier and district staff for their service during his time on the board and for \"their dedication and excellent service to children .\" With <mark>Smith</mark> and Goines opting out of this year's school board election, five people will be vying for the three open seats. The decision by the two incumbents not to run gave the green light to Vladimir Ivanovic, a Gardner Bullis parent, who said his decision to run for a board seat hinged on whether <mark>Smith</mark> and Goines planned to run for re-election. He said the board has done a good job so far, and that there was no reason for him to run if all three incumbents sought re-election. Incumbent and current board president Tamara Logan will run for re-election this year. Other candidates are Martha McClatchie, a community volunteer and parent of three students at Bullis Charter School, Sangeeth Peruri, a Covington parent and member of the district's Citizens' Advisory Committee for Finance, and <mark>John Swan</mark>. About 25 percent of the district's students are Mountain View residents. More information on the candidates can be found in the July 18 edition of the Post a comment Posting an item on Town Square is simple and requires no registration. Just complete this form and hit \"submit\" and your topic will appear online. Please be respectful and truthful in your postings so Town Square will continue to be a thoughtful gathering place for sharing community information and opinion. All postings are subject to our Since this is the first comment on this story a new topic will also be started in Town Square! Please choose a category that best describes this story. * Enter the verification code exactly as shown, using capital and lowercase letters, in the multi-colored box.", "articleID": "2014082103_00023686_W", "names": {"Doug Smith": ["Q1251857", "Q15054504", "Q1606849", "Q18388709", "Q500575", "Q5300911", "Q5300912", "Q5300913", "Q5300915", "Q5300916", "Q5300917", "Q5300919"], "John Swan": ["Q28867802", "Q3182553"]}}, {"date": "2014-08-21", "url": "http://bostonglobe.com/metro/2014/08/20/ferguson-young-people-see-moment-opportunity/ix1qYqVzaVRj0FggYrF44I/story.html", "content": "Market Basket eyes deal this week Most Boston pedestrian accidents go unreported Researchers decry limits on drones Protesters in Ferguson, Mo., held roses as they demonstrated for justice after the fatal shooting of <mark>Michael Brown</mark>. FERGUSON, Mo. - Deandra Connors sat at the McDonald's on West Florissant Avenue looking out the window. Outside, her peers stood with protest signs and occasionally shouted what has become the battle cry of this movement: \"Hands up; don't shoot .\" Connors, 18, has been out here every day since her former classmate, <mark>Michael Brown</mark>, was shot to death by a Ferguson police officer 10 days ago. Here, in this moment, she feels part of something that she hopes will usher in an era where her dreams will not be deferred. <mark>Brown</mark>'s death has not only jolted many young people into consciousness and action, including daily protests, but it has also created a collective trauma of sorts. It has deepened the stress of being young black teens living in areas of concentrated poverty and crime - and prompted at least some teens to think beyond themselves. Connors dreams of going to nursing school or studying the culinary arts, or maybe becoming a forensic scientist. But, she said, whichever career she chooses must come with a paycheck large enough to help start a nonprofit to assist impoverished children in Africa immigrate to the United States. \"To help them find jobs, so they can live the American Dream, too, but I don't want them to come here and be targeted, too. So that's why everything's gotta change right now,\" she said. The daily march for justice has two purposes, she said: \"All of it's not for <mark>Mike</mark>; it's for people who been going through this stuff, like for real, for real. It just took <mark>Mike</mark> as a sacrifice for all of it to be shown .\" For many of these young people, this isn't just a philosophical protest. It's a personal one. They knew <mark>Brown</mark> or were connected to him by a few degrees of separation, and by shared experiences. In Ferguson and the neighboring communities in northern St. Louis County, some teens of color come from low-income households. African-American youths are dramatically more likely to be pulled over by police than whites, according to the state attorney general's office. And some attend struggling schools, according to state statistics. Last year, for example, the state Department of Education stripped the academic accreditation from the school district attended by <mark>Brown</mark> and Connors in Normandy, The state allowed students to transfer elsewhere with tuition and transfer fees paid by the unaccredited district, thus draining it of millions of dollars. To make it here, 16-year-old Kameron Dunn said, \"you gotta be on your game. It's gotta be three things to make it: be an A-student, stay swagged out, or you gotta know how to knock people out .\" And while he acknowledged that he started high school by getting into \"a lot of drama,\" now, he's trying to stay above the fray. \"I'm trying to go to college and be an engineer,\" he said, standing on West Florissant Avenue, a roadway lined with strip malls that could exist in anywhere USA but has become the nexus of protests in recent days. Dunn was standing with a friend, Elexus Steed, who was passing out roses to fellow protesters. Steed, 16, described <mark>Brown</mark> as her \"homeboy .\" \"<mark>Mike Brown</mark> knew everybody, though. Maybe that's why he has so many people out,\" she said. Thousands of people from across the country - and some traveling from as far as Boston and Texas - have converged on West Florissant Avenue. The initial protests, while mainly peaceful, were met with an aggressive show by police who used tear gas and rubber bullets to disperse the crowds. But as days have become weeks, a more youthful, volatile group has emerged at night and clashed repeatedly with police. Their anger and frustration at what they consider an unjust system is palpable, often creating tense standoffs with law enforcement. Their emotions can be kept in check by ministers and community elders, but it can easily spill over with the slightest of provocation. Some people in the community witnessed <mark>Brown</mark>'s shooting; many more saw his lifeless body as it lay on Canfield Drive, according to area residents. Connors said she was at her cousin's house nearby on Aug. 9, when one of <mark>Brown</mark>'s friends came running over. \"He said,\" Mikey been shot .' \"So, she said, they went outside, joining a growing crowd .\" They just displayed his body for like three or four hours without even putting a sheet on it, \"she said, her voice pitching with anger and emotion .\" And even after they put the sheet on there, he was still out there. \"Fourteen-year-old Manasseh Kimbrough was spared seeing his friend's body, but that doesn't make his anger at the situation any less tangible. Kimbrough and his brother, who live in an apartment complex on the west side of West Florissant Avenue, spent several hours rapping with <mark>Brown</mark> in front of the QuikTrip gas station and convenience store several days before he died. The subject matter, he said, was life .\" It wasn't like sex and money and weed or nothing. It was just life, to get out of the struggle and stuff like that, \"he said, as a group of protesters marched by shouting,\" No justice, no peace. \"The trio went their separate ways. Days later, <mark>Brown</mark> was dead .\" When we found out about this, me and him was mad, hurt, \"Kimbrough said. Kimbrough sang at the first candlelight vigil, and he and his brother have returned to protest since, their grief compounded by choking tear gas and stinging rubber bullets .\" They keep tear gassing and it makes it worse. It's building us up, \"he said of the several days police launched gas canisters into the crowd. These teens don't talk about the end of the protests. For them, they say, this is just the beginning. Work here © 2014 Boston Globe Media Partners, LLC You have read 5 of 10 free articles in a month. You have read 7 of 10 free articles in a month. This is your last free article in a month. Continue reading with unlimited access for just 99 ¢ Don't miss any of your favorite stories again. Read the stories that matter to you as much as you want, whenever you want when you subscribe to BostonGlobe.com. The login information you entered does not match an account in our records. To activate FREE access as a home delivery subscriber Forgot your password? Home delivery subscribers get free access. Link Account Customer Service Number: 1.888. MY. GLOBE E-mail address not found, please try again or contact customer service at 1-888-MYGLOBE Please check your e-mail for a message from BostonGlobe.com with the subject line\" BostonGlobe.com password request. \"Click the link in the e-mail to choose a new password for BostonGlobe.com, and note that your new password will also be used for your Boston.com membership. You have reached the limit of 10 free articles in a month Continue reading by subscribing to BostonGlobe.com for just 99 ¢. Continue reading by subscribing to BostonGlobe.com for Stay informed with unlimited access to Boston's trusted news source. High-quality journalism from the region's largest newsroom Convenient access across all of your devices Today's Headlines daily newsletter", "articleID": "2014082112_00057407_W", "names": {"Michael Brown": ["Q10456471", "Q11936682", "Q1328702", "Q15522038", "Q17516932", "Q1779573", "Q18344346", "Q18719315", "Q26915320", "Q27914049", "Q295684", "Q30123102", "Q336303", "Q3857364", "Q458065", "Q47487885", "Q50143349", "Q50978985", "Q55998905", "Q57392216", "Q57413534", "Q6828857", "Q6828858", "Q6828861", "Q6828864", "Q6828865", "Q6828867", "Q6828868", "Q6828870", "Q6828871", "Q786003"], "Mike Brown": ["Q1102021", "Q16200455", "Q16213884", "Q17306282", "Q1933055", "Q1933070", "Q2757687", "Q298913", "Q3313242", "Q3857364", "Q41790047", "Q4274643", "Q437776", "Q458065", "Q6380458", "Q6846151", "Q6846155", "Q6846156", "Q6846157"]}}, {"date": "2014-08-21", "url": "http://radiotimes.com/news/2014-08-21/jeremy-paxman-in-talks-with-channel-4-but-he-wont-be-taking-jon-snows-job", "content": "Jeremy Paxman in talks with Channel 4...but he won't be taking Jon Snow's job Could Paxo be plotting a new lease of life on another channel? By Ben Dowell Thursday 21 August 2014 at 03:25 PM For a quarter of a century he was a pillar of the BBC presenting establishment as the host of Newsnight. And even after he announced he was quitting BBC2's current affairs flagship this year, the Corporation is believed to have remained keen to retain his services in as many capacities as possible. But now it has emerged that Jeremy Paxman is in talks with Channel 4 about making shows for the rival broadcaster. Asked at the Edinburgh International Television Festival if she has held talks with the presenter, C4's Chief creative officer <mark>Jay Hunt</mark> said: \"I have known Jeremy for years and worked with him on Newsnight [at the BBC]. [C4 News presenter] Jon Snow should not be worried in any way. But am I in talks? Yes, of course .\" <mark>Hunt</mark> would not elaborate on what she is talking to the veteran presenter about, but it appears the erstwhile grand inquisitor of BBC2 is looking to spread his creative wings further than just 3:30 pm The Hairy Bikers: Everyday Gourmets 4:30 pm Put Your Money Where Your Mouth Is Subscribe to RT Try the magazine of the year, RadioTimes, with 12 issues for just £ 1. Shaun the Sheep Win: Be an extra in Shaun the Sheep The Movie next year. © Immediate Media Company Limited Website is owned and published by Immediate Media Company Limited.", "articleID": "2014082122_00049562_W", "names": {"Jay Hunt": ["Q15990063", "Q6166730"]}}, {"date": "2014-08-21", "url": "http://fiercepharma.com/story/pfizer-eyes-actavis-back-plan-another-astrazeneca-bid/2014-08-21", "content": "Every business day, FiercePharma updates pharmaceutical executives on the latest Pharma industry news and deals. Stay up to date on: Pharma Company News ∣ Generic Drug Companies ∣ Pharmaceutical Marketing & Sales ∣ FDA Regulations & Warnings ∣ Phase IV Clinical Trials Who loses most in Lilly vs. Novo diabetes study? AstraZeneca Thumbs up or down on megamergers? Depends on your point of view Eisai's revved-up Belviq marketing starting to pay off, analysts say Reprint Pfizer may not get a great shot at buying AstraZeneca this fall--but it's preparing to give it a try. Meanwhile, Bloomberg reports, the U.S.-based drug giant is looking at Actavis, the generics maker with a new home address in Ireland, among other targets. That domicile is a key factor, of course, given Pfizer's (Warner Chilcott last year. That deal--and its subsequent buyout of U.S.-based Forest Laboratories--also built up Actavis' business in branded pharmaceuticals. So in addition to the company's large portfolio of generic meds, Actavis would bring along a few notable brands, and some newly approved meds. So, an Actavis buy would build up Pfizer's established products unit, widely seen as the first prospect for another sale or spin-off. It would add some new products to Pfizer's branded stable, which is in need of help. And because of Actavis' recent buying spree, it's worth some $59 billion--large enough to allow Pfizer to shift its domicile to Dublin, Bloomberg says. Whether Actavis is receptive to Pfizer's advances isn't clear; the smaller company didn't comment. Whether Pfizer would prefer Actavis, AstraZeneca ($AZN) or another buy? The company won't say, of course; Pfizer's spokeswoman Joan Campion told Bloomberg her company is continuing to \"evaluate all opportunities, regardless of size, through the lens of value creation for our shareholders and enhancing the competitiveness of our business .\" That pretty well echoes what CEO <mark>Ian Read</mark> said during the company's Q2 earnings call. Analysts and media reports have trotted out a variety of other potential Pfizer targets--even GlaxoSmithKline ($VRX), Bloomberg points out, but the Canadian drugmaker is embroiled in a hostile move to buy Allergan. The history of Pfizer's AstraZeneca bid is well documented. So is the U.K. M & A code that prevents Pfizer from mounting a new offer until November. What Bloomberg points out now is that, since Pfizer's most recent foray, AstraZeneca has raised its 2014 revenue forecast, bought a portfolio of respiratory meds from Spain's Almirall and trotted out some promising data for three cancer drugs. That means AstraZeneca would likely raise its asking price even further, Helvea analyst Odile Rundquist told the news service. \"My impression is that the deal will never go through, because it is too expensive for Pfizer .\" Will he or won't he? Pfizer CEO scouts big deals but \"silent' on AstraZeneca rebid Prepping for $25B merger, Actavis taps Forest CEO Saunders to lead combined company Join 105,000 + Insiders SIGN UP FOR OUR NEWSLETTER FiercePharma is the pharma industry's daily monitor, with a special focus on pharmaceutical company news and the market development of FDA approved products. Join thousands of pharma industry leaders who get Don't worry about a hep C pricing war, analysts tell Gilead-watchers Big Pharma doesn't win the margin stakes. That's Jazz, Celgene, Regeneron and Alexion Price could be key for Sanofi's new Gaucher pill as it sets out against IV rivals Celgene's cost-sharing offer persuades NICE to about-face on Revlimid Don't worry about a hep C pricing war, analysts tell Gilead-watchers Price could be key for Sanofi's new Gaucher pill as it sets out against IV rivals Will Allergan bid for Salix as it looks to escape Valeant's clutches? Celgene's cost-sharing offer persuades NICE to about-face on Revlimid Improve the Inclusion & Exclusion Criteria for Your Next Clinical Trial | Tuesday, September 9th, 2pm ET / 11am PT | Presented by: Rho Communiqué to sales reps: With today's docs, it's the medium and the message The formularies are here! Brace yourselves for the 48 new exclusions Seton Hall Law Online Graduate Certificates in Pharmaceutical & Med Device Law & Compliance BIOGEN IDEC NAMES ADRIANA KARABOUTIS EVP, TECHNOLOGY AND BUSINESS SOLUTIONS Celleration Announces Next Generation UltraMIST ™ System Receives FDA Clearance is the pharma industry's daily monitor, with a special focus on pharmaceutical company news and the market development of FDA approved products. Join 100,000 + pharma industry leaders who get", "articleID": "2014082122_00070249_W", "names": {"Ian Read": ["Q1655624", "Q20797619"]}}, {"date": "2014-08-21", "url": "http://www.queenslandcountrylife.com.au/news/agriculture/sheep/general-news/spring-lamb-set-for-a-leap/2709189.aspx?src=rss", "content": "Not only have yardings fluctuated considerably between weeks, but the quality hahas also varied MORE new season lambs may be on the market than normal for this time of year in some districts, but they certainly aren't helping to keep indicator prices high. Lower old season lamb prices weighed down the Eastern States Trade Lamb Indicator (ESTLI) last week resulting in a slip of about 20 cents a kilogram to 472c/kg. Mecardo market analyst Augusto Semmelroth said lamb markets had been relatively volatile during the past few weeks. He said weekly saleyard numbers had varied some 20 to 30 per cent week-on-week. \"Not only have yardings fluctuated considerably between weeks, but the quality of animals on offer has also varied, adding some extra volatility to Meat and Livestock Australia's National Livestock Reporting Service (NLRS) State indicators,\" Mr Semmelroth said. \"Despite the increasing number of new season lambs being consigned, they are still the minority of total yardings .\" As a result, the lower prices paid for old season lambs in plain condition continues to impact negatively on the overall performance of most indicators. \"Mr Semmelroth said the past week's rain might entice some producers to hold stock to heavier weights or restrict numbers of stock in plain condition from reaching the market .\" This could give some support for prices this week, \"he said. Although lamb supply at Cowra was reduced, the number of new season lambs dominated the yarding last Friday. Of the 6000 lambs offered, about 4000 of those were new season lambs. NLRS reported competition was good resulting in a firm to slightly dearer market. As a result, medium and heavy trade weight new season lambs were firm and averaged about 515c/kg. About 40pc of the yarding were young lambs from 22kg to 24kg and they topped at $128 a head. Old lamb of similar weight, by comparison, topped at $112 a head. Forbes Livestock and Agency Company director Tim Mackay said at Forbes on Tuesday the new season lambs made up about 50 per cent of the lamb yarding .\" There seems to be plenty of them about from the traditional supply areas and in the next few weeks I expect they will really start to flow into the market, \"he said. In the north of the State, Colin Say and Company agent <mark>Craig Thomas</mark> said the supply of new season lambs would be about three months away .\" The (dry) season has really had a big influence on the supply of lambs in this region, \"he said .\" Lots of lambs were sold into the south earlier in the year so we have few lambs being offered on the Northern Tablelands at the moment, \"he said. In the Tamworth district, Davidson <mark>Cameron</mark> McCulloch and Company branch manager Daniel McCulloch said there would be a gap in supply between the old lambs and new spring lambs .\" We are almost at the end of the old lambs and many people are choosing to send them into the sales at 19kg to 20kg rather than try to put more weight on them at this stage in the season, \"he said .\" The new season lambs are probably going to be a bit later than normal so I expect we will start to see the bulk of them starting to flow in late September and into October. \"Meanwhile, over-the-hooks lamb rates slipped another 10c/kg. Processors claim they have reduced price grids due to the number of new season lambs on the market. The 20kg to 22kg lambs have averaged 488c/kg, while the 24kg to 26kg category was on about 485c/kg. Wagga suckers limited but season shapes up well WITH plenty of old season lambs still on the market, the prime lamb sale at Wagga Wagga last week was as much as $10 a head cheaper. G.J. Hulm and Company agent Tyler Pendergast, Tumut, said it could be another month before new season lambs dominated the yardings at Wagga .\" At the sale last Thursday the suckers would have been about $10 a head cheaper, while the plainer, old lambs sold for even less, \"he said. To put supply into perspective, Mr Pendergast said in a yarding of about 30,000 lambs last week only 8000 were new season .\" By the middle of September there should be a few more spring lambs being offered and from what I've seen in clients' paddocks they are growing very well, \"he said .\" The mild winter and good feed mean the lambs are coming along really well and I expect when they are ready for market there will be some top lines being offered. \"Mr Pendergast, (pictured with colleague Mal Vogan, Tumbarumba, at last week's lamb sale) said sucker lambs were on par with previous years .\" I wouldn't say they are any earlier or later than past years, \"he said .\" We didn't get a lot of rain during the weekend like some of the northern areas of State did, but I expect it might mean the flow of lambs in the north will steady up. \"AgForce's Stacey Milner talks rural finance with Bentley's managing director <mark>Ben Cameron</mark>. Well the farmers and country people think labour are a bad party. however Labour have always SEVEN young beef producers travel to Canberra next week to participate in the Beef Industry Rising Champions Initiative. MORE new season lambs may be on the market than normal for this time of year in some districts, but they certainly aren't helping to keep indicator prices high. FRESH from setting up a new bulk grain port terminal in Bunbury, WA, Bunge Australia has announced plans for a new export facility in Geelong, Victoria. Connecting Livestock Buyers & Sellers: Your one-stop shop for livestock news, reports and sale listings.", "articleID": "2014082201_00007695_W", "names": {"Ben Cameron": ["Q23796181", "Q4885386"], "Craig Thomas": ["Q3002075", "Q979098"]}}]