[{"articleID": "2019061621_00306601_W", "names": {"Elton John": ["Q16209157", "Q2808"], "John Lennon": ["Q11979004", "Q6244563"], "Yoko Ono": ["Q11464149", "Q117012", "Q16264827"], "Danielle Macdonald": ["Q20745002", "Q37610021"], "Bradley Cooper": ["Q205707", "Q4954898"]}, "date": "2019-06-16", "url": "http://msn.com/en-au/entertainment/movies/14-music-biopics-in-the-works-after-rocketman-from-elvis-presley-to-aretha-franklin-photos/ss-AACYddE?li=AAgfVR9", "content": "Full Screen 1/15 SLIDES © Getty Images With the box office and awards season success of \"Bohemian Rhapsody,\" music biopics are roaring back. \"Rocketman,\" based on the life of <mark>Elton John</mark>, just released this past weekend, and several others are currently in the works, including films about Elvis Presley, Aretha Franklin, Bob Marley, <mark>John Lennon</mark> and <mark>Yoko Ono</mark>. 2/15 SLIDES © Getty Images Amy Winehouse Monumental Pictures' Alison Owen and Debra Hayward are producing a film on the life of the late Amy Winehouse. They'll be working in coordination with Winehouse's father Mitch, who previously said in a statement that he felt finally the \"time was right.\" Although no one has been cast yet as the soul singer, Owen tells TheWrap the project is in development and the plan is to shoot next year. 3/15 SLIDES © Getty Images \"Respect\" - Aretha Franklin Before her death in 2018, Aretha Franklin chose Jennifer Hudson to portray her on film. The biopic follows the Queen of Soul from her childhood singing in her father's choir, through the tumultuous, cultural revolution in the 1960s at the start of her career, and on the way to becoming an international icon. Tommy Liesl is directing the film from a script by Oscar winner Callie Khouri. MGM has the movie slated for release on Aug. 14, 2020. 4/15 SLIDES © Photo by Mike Prior/Redferns Bob Marley Bob Marley's son Ziggy is producing the currently-in-development biopic about the iconic reggae singer's life with Paramount Pictures. Marley helped introduce reggae to mainstream audiences around the globe and helped change the landscape of music before dying of cancer at age 36. 5/15 SLIDES © TheWrap Boy George Most recently, MGM announced it is set to produce a feature biopic on the life of Boy George, the flamboyant and charismatic frontman of the pop band Culture Club. Sacha Gervasi (\"Anvil: The Story of Anvil\" ) is writing and directing the film that will chart his childhood in a working class Irish family up through his international success as a solo artist. 6/15 SLIDES © Getty Images \"Beautiful\" - Carole King The film adaptation of the Tony-winning Broadway musical \"Beautiful\" about the life and career of Carole King was first announced back in 2015, and an individual with knowledge of the project told TheWrap that \"Beautiful\" is still in development. While no cast or director has been set, Tom Hanks, Paul Blake and Gary Goetzman are set to produce an adaptation based on the musical book by Douglas McGrath. The play is a jukebox musical featuring many of King's hits as it charts the early part of her career, including \"You've Got a Friend,\" \"One Fine Day,\" \"Will You Love Me Tomorrow,\" \"Natural Woman\" and many more. 7/15 SLIDES © Getty Images \"The Power of Love\" - Celine Dion Valérie Lemercier will star in and direct this feature inspired by the life and career of Canadian singing powerhouse Celine Dion, which will also feature her songs. The film is in the French language, and Gaumont is handling, but a representative says sales have not yet begun on the film. 8/15 SLIDES © Getty Images Elvis Presley \"Moulin Rouge\" director Baz Luhrmann is helming an untitled biopic about the life of Elvis Presley at Warner Bros., and as of March, Tom Hanks was in talks to portray Elvis' manager \"Colonel Tom\" Parker. No word on casting for the King himself however. 9/15 SLIDES © Getty Images Gucci Mane In February, Paramount Players and Imagine Entertainment acquired the life rights to Gucci Mane and kicked off development on a music biopic based on the rapper's book \"The Autobiography of Gucci Mane.\" Imagine's Brian Grazer and Erica Huggins are producing the project, and Mane is executive producing with Todd Moscowitz. His book talks about how Mane released mixtapes from prison alongside other rappers like Migos and Young Thug. 10/15 SLIDES © Photo by Tony Russell/Redferns \"I Am Woman\" - Helen Reddy Tilda Cobham-Hervey stars in this biopic of Australian singer Helen Reddy, who became a smash with her feminist anthem \"I Am Woman.\" Evan Peters and <mark>Danielle MacDonald</mark> also star in the film directed by Unjoo Moon from a script by Emma Jensen. The biopic follows Reddy's career as a musician and as an activist during the 1970s. WestEnd Films is handling sales. 11/15 SLIDES © John Shearer \"I Still Believe\" - Jeremy Camp Lionsgate had a surprise box office hit on their hands with the faith-based music biopic \"I Can Only Imagine,\" and their next is about another Christian rock star, Jeremy Camp. \"Riverdale\" star KJ Apa stars alongside Shania Twain, as well as Britt Robertson, Melissa Roxburgh and Nathan Dean Parsons. 12/15 SLIDES © Wikimedia Commons <mark>John Lennon</mark> and <mark>Yoko Ono</mark> Bohemian Rhapsody \"scribe Anthony McCarten wrote the screenplay for an untitled biopic about the romance between <mark>John Lennon</mark> and <mark>Yoko Ono</mark>, along with their activism and strive for peace. <mark>Ono</mark> herself approved the story after producer Josh Bratman lobbied her to bring it to the screen. Jean Marc Vallée (\"Big Little Lies,\" \"Dallas Buyers Club\" ) is directing the film, which is currently in active development, an individual with knowledge of the project tells TheWrap. 13/15 SLIDES © Courtesy: Allan Warren \"Leonard\" - Leonard Bernstein <mark>Bradley Cooper</mark> is following up \"A Star Is Born\" by taking on the life story of the legendary composer Leonard Bernstein. <mark>Cooper</mark> will direct and star in the music biopic, as well as write the script with Josh Singer (\"First Man,\" \"Spotlight\" ). Paramount Pictures and Amblin Partners are co-financing the project about the New York Philharmonic music director and composer of \"West Side Story.\" At one point Jake Gyllenhaal was attached to star in a separate Bernstein biopic from director Cary Fukunaga. 14/15 SLIDES © Getty Images \"Blond Ambition\" - Madonna The script for \"Blond Ambition\" by Elyse Hollander was the number one ranked title on the 2016 Black List of the best un-produced screenplays, and Universal acquired the project in 2017 for Brett Ratner and John Zaozirny to produce. It's described as the story of how Madonna struggled to get her first album made in 1980s New York, as she navigates fame and a struggle with her gender in show business. Immediately after news broke that the script was acquired, the Material Girl in a now-deleted Instagram post called the project \"all lies.\" \"Nobody knows what I know and what I have seen. Only I can tell my story,\" she said in a separate post. \"Anyone else who tries is a charlatan and a fool. Looking for instant gratification without doing the work. This is a disease in our society.\" An individual with knowledge says the film is still in active development. 15/15 SLIDES © Getty Images Teddy Pendergrass Tyrese Gibson will play R & B legend Teddy Pendergrass from Warner Bros., who acquired the rights to the singer's life in February. Pendergrass' story is ripe for adaptation, as he rose to fame as part of the group Harold Melvin & The Blue Notes before breaking out as a solo artist. Pendergrass suffered a major spinal cord injury in a car crash in 1982 that left him paralyzed, leading him to fight to come back as part of the Live Aid concert in 1985. He died in 2010. Gibson is also producing with the \"Empire\" creator Lee Daniels and Donald De Line. Pendergrass' widow is an executive producer. 15/15 SLIDES 1/15 SLIDES Next Slide"}, {"articleID": "2018020714_01031112_W", "names": {"Elisabeth Jensen": ["Q1330023", "Q16202543"]}, "date": "2018-02-07", "url": "https://www.paulickreport.com/news/the-biz/frankfort-host-second-annual-keep-day-feb-15/", "content": "Frankfort To Host Second Annual KEEP Day Feb. 15 Sponsored by: by Press Release | 02.07.2018 | 9:37 am The Kentucky Equine Education Project is staging its second KEEP Day in Frankfort on Thursday, February 15, 2018, providing a convenient setting for those involved in the industry to share with state legislators the importance of horses to their districts' economy. The event will run from 12:00 PM--2:00 PM in Room 129 in the Capitol Annex. The informal setup will allow industry stake-holders, including horse enthusiasts and racing fans, to interact with a variety of state senators and representatives. Horses of all breeds form a $4 billion industry in the Commonwealth, supporting an estimated 100,000 in direct and indirect jobs and spanning all 120 counties. Kentucky is home to 35,000 operations with at least one horse, totaling 242,400 equines and $23.4 billion when including related assets, according to a University of Kentucky Department of Agriculture survey. \"KEEP Day is a convenient way for people working in businesses connected to equines, as well as those who show, ride and own horses, to meet with our lawmakers and let them know that every county and district benefits from horses,\" said KEEP executive vice president <mark>Elisabeth Jensen</mark>. \"We encourage those involved with every breed and discipline to come and show support for our signature industry that creates so many jobs.\" Created in 2004 to preserve, promote and protect the state's signature industry, KEEP represents and advocates on behalf of Kentucky's entire horse industry--all breeds and equine pursuits. \"People might be surprised to know how many trail-riding and pleasure horses there are in Kentucky--about 80,000,\" <mark>Jensen</mark> said. \"While there are about 54,000 Thoroughbreds in the Commonwealth, there also are 45,000 Quarter Horses and 36,000 Tennessee Walking Horses. All these horses eat grain and hay provided by our farmers, and their owners buy trucks, trailers, tractors and tack, also paying for an array of services such as boarding, instruction and training, farriers and veterinarians. We want those voices heard at KEEP Day and encourage participants to let their state legislators know that they are attending.\" Rep. James Kay of Versailles said at last year's inaugural KEEP Day that horses are an important economic tool even in areas of Kentucky that aren't home to high-profile breeding farms or racetracks. \"We absolutely benefit from the horse industry every day in ways that people don't always understand,\" Kay said. \"We need to do a better job articulating that, and showing the economic driver that the industry is for our people.\" New to the Paulick Report? Click here to sign up for our daily email newsletter to keep up on this and other stories happening in the Thoroughbred industry. Copyright © 2018 Paulick Report. This entry was posted in The Biz and tagged Horse Racing, keep, kentucky equine education project, thoroughbred by Press Release. Bookmark the permalink."}, {"articleID": "2013121000_00054922_W", "names": {"Ben Rhodes": ["Q4886343", "Q4886346", "Q4886347", "Q4886348"]}, "date": "2013-12-09", "url": "http://news-leader.com/usatoday/article/3917719", "content": "Neighbors Kay Manes and Becky Ray almost never miss the annual Victorian Christmas Homes tour in...Watch an Amish man and his horses help straighten out a big rig that got stuck snow, in this...A biker traveling quickly down a dirt path toppled into a photographer who was trying to get a good...Missouri and Oklahoma State came so close to conference titles and being in the Bowl Championship...Q: I've heard it is possible to grow most of a traditional Thanksgiving dinner in your own backyard. Holiday season is less than jolly for those grieving loss of loved one The holiday season will be difficult and different for Mary Lou Braswell this year. The two national political parties have corrupted their own respective party ideals. I was always reasonably content with ignorance. President Obama will make remarks on Nelson Mandela's legacy during a memorial service Tuesday for the late South African freedom fighter, officials said Monday. \"We do expect President Obama to speak as part of the program,\" said <mark>Ben Rhodes</mark>, deputy national security adviser for strategic communications. The president and first lady Michelle Obama departed Monday for Johannesburg, where a Mandela memorial service will be held in a soccer stadium. Obama--who will also spend time with the Mandela family--is not scheduled to hold any bilateral meetings with foreign leaders while in South Africa, <mark>Rhodes</mark> said. <mark>Rhodes</mark> also said the U.S. expects to have a delegation at Mandela's burial on Sunday, but the details are still being worked out. President George W. Bush and wife Laura are aboard Air Force One with Obama. So is Secretary of State Hillary Clinton, but former President Bill Clinton is traveling separately. Former President Jimmy Carter will also attend the Mandela memorial in South Africa. Meanwhile, Vice President Biden and wife Jill visited the South Africa embassy in Washington, D.C., on Monday to sign a condolence book honoring Nelson Mandela. Biden will speak Wednesday at a special memorial service for Mandela to be held at the National Cathedral in Washington, D.C.. According to the vice president's office, Biden wrote in the condolence book: \"On behalf of the American people, our deepest condolences to the people of South Africa for the passing of Nelson Mandela. But more than that, our profound gratitude--for his compassion, his humility, and his courage.\" Through his unflagging, unflinching commitment to human dignity and his willingness to forgive, he inspired us and challenged us all to do better. Obama expected to speak at Mandela memorial President Obama will likely speak at a Nelson Mandela memorial in South Africa. paid archives for news older than a week. Become a subscriber today to enjoy these benefits: iPad-optimized edition Mobile site & iPhone app Are you currently a subscriber? Set up your digital access now. You now have full access. Thank you for subscribing. Access the tablet-optimized site, mobile site and iPhone app Share your access with any friend or family member Subscriber exclusive Top 5 daily email newsletter Create an account or if you have a digital profile To continue using your current Web browser, Adobe Flash must be installed or upgraded:"}, {"articleID": "2018010203_00413415_W", "names": {"Kim Jong Un": ["Q14045951", "Q56226"]}, "date": "2018-01-01", "url": "http://www.huffingtonpost.in/2018/01/01/un-secretary-general-puts-world-on-red-alert-in-somber-new-years-eve-address_a_23321153/", "content": "Reuters U.N. Secretary-General Antonio Guterres speaking during the 9th ASEAN <mark>UN</mark> Summit in Manila, Philippines, in November 2017. United Nations Secretary-General António Guterres issued a grim warning as 2017 drew to a close. In a somber video address posted to Twitter on New Year's Eve, he cautioned that the globe was on \"red alert\" following a year marked by deepening conflicts and \"new dangers.\" \"When I took office a year ago, I appealed for 2017 to be a year for peace,\" Guterres said in the clip. \"Unfortunately, in fundamental ways, the world has gone in reverse ....Global anxieties over nuclear weapons are the highest since the Cold War, and climate change is moving faster than we are. Inequalities are growing, and we see horrific violations of human rights. Nationalism and xenophobia are on the rise.\" Facing such challenges, Guterres said he was \"not issuing an appeal\" but a \"red alert for our world.\" Only international unity and cooperation, he stressed, could now help solve these many crises. As we begin 2018, I am issuing a red alert for our world. I call for unity--our future depends on it. pic.twitter.com/fWtTa1irM3--António Guterres (@ antonioguterres) December 31, 2017 \"I truly believe we can make our world more safe and secure. We can settle conflicts, overcome hatred and defend shared values but we can only do that together,\" the U.N. chief said. \"I urge leaders everywhere to make this New Year's resolution: Narrow the gaps. Bridge the divides. Rebuild trust by bringing people together around common goals. Unity is the path. Our future depends on it.\" Hours after Guterres' message, North Korean leader <mark>Kim Jong Un</mark> issued a New Year's Day speech, in which he spoke of a \"nuclear button\" on his desk, ready for use if the hermit kingdom is threatened. \"The entire United States is within range of our nuclear weapons, and a nuclear button is always on my desk. This is reality, not a threat,\" he said, adding that he was \"open to dialogue\" with South Korea and emphasizing that \"these weapons will be used only if our security is threatened.\" Adm. Mike Mullen, former chairman of the Joint Chiefs of Staff, said Sunday that the U.S. is \"closer to a nuclear war with North Korea\" than ever before. MORE: António Guterres International News Politics <mark>un</mark> secretary general united states Wars and Conflicts Suggest a correction"}, {"articleID": "2019112522_00082127_W", "names": {"Jim Elder": ["Q1150140", "Q6194827"]}, "date": "2019-11-25", "url": "http://grenfellrecord.com.au/story/6511151/historic-sa-painting-sold-privately/?cs=9397", "content": "Historic SA painting sold privately whatsapp A painting by Adelaide's planner Colonel William Light has sold to a private collector. A 180-year-old painting by Adelaide's planner Colonel William Light that was passed in at auction on Sunday has been sold to a private collector. The watercolour was created by Colonel Light between January and April 1837, around the time he surveyed and laid out the South Australian capital. It was expected to fetch upwards of $100,000 but attracted only one bid of $20,000. Art dealer <mark>Jim Elder</mark> confirmed on Tuesday that the work had since been purchased by a private collector who wanted to remain anonymous and who asked that the sale price not be disclosed. Mr <mark>Elder</mark> said he was bitterly disappointed the painting had passed into private hands. \"This important piece of South Australian history may not be seen again in public for generations,\" he said. \"It has been lost to South Australian society.\" The work spent the past 40 years stored in a camphor wood chest in a garage before being discovered recently by the owner's widow. Before the auction, Mr <mark>Elder</mark> said it was nothing short of a miracle that the painting had survived. \"This is one of the earliest depictions of Adelaide and thus carries significant weight with historians and art collectors alike,\" he said. The work shows a farmhouse with outbuildings and a surrounding settlement of tents and huts with colonists going about their business. Campfire smoke drifts through the gum trees as cattle graze in a nearby clearing. The Mount Lofty Ranges can be seen in the background beneath billowing white clouds. Mr <mark>Elder</mark> said painstaking art history and genealogical research traced the watercolour's provenance back 180 years to a man called Shimmin who worked as a gardener for Colonel Light's fellow surveyor William Jacob on Jacob's Barossa Valley property, Moorrooroo. It had remained in the Shimmin family for generations. Light was a prolific painter and sketcher, often selling his works to support himself, but many were destroyed by a fire at the Land and Survey Office and his adjacent hut in January 1839. He had arrived in the new colony in October 1836 and died of tuberculosis just three years later aged 53. Most of his known remaining works, including an incomplete self-portrait, are housed in the Art Gallery of South Australia, the State Library of South Australia and the Adelaide Town Hall. Australian Associated Press"}, {"articleID": "2011030323_00080782_W", "names": {"Robert Johnson": ["Q16215328", "Q18630840", "Q18672192", "Q21665589", "Q23795774", "Q25522930", "Q30678501", "Q47546079", "Q4932943", "Q57208493", "Q5889205", "Q7346149", "Q7346150", "Q7346152", "Q7346153"], "John Lee": ["Q1306769", "Q14946953", "Q16228054", "Q1700807", "Q18817097", "Q19325486", "Q19840337", "Q24583501", "Q28919977", "Q54556034", "Q54556035", "Q54556036", "Q56191613", "Q58155059", "Q59595679", "Q6244365", "Q6244371", "Q6244377", "Q6244380", "Q6244381", "Q6244383", "Q8995719", "Q9051824"]}, "date": "2011-03-03", "url": "http://startribune.com/entertainment/music/117363328.html", "content": "hey, hey, the blues is all right an unlikely hero picks up the torch a century after the birth of the music's greatest legend. blues at the crossroads when: 8 p.m. sun. when todd park mohr's manager suggested that he record an album in tribute to the 100th birthday of legendary bluesman <mark>robert johnson</mark>, his first reaction was understandably negative. mohr, aka big head todd, is best known for crooning such pop songs as \"bittersweet\" with his colorado band big head todd and the monsters. \"i resisted the idea kicking and screaming,\" he said. \"i know a lot of guys out there live and breathe <mark>robert johnson</mark>, and i wasn't that familiar with his music. i didn't know if i had a lot to offer.\" but less than a year later, mohr has not only immersed himself in <mark>johnson</mark>'s music to create a proper recording for the man's centennial, he's touring with legends such as howlin' wolf guitarist hubert sumlin and 95-year-old honeyboy edwards (who knew <mark>johnson</mark> personally) under the name of the big head blues club. the group--which includes mohr's cohorts from the monsters plus an assortment of new and old blues hounds--will play sunday at orchestra hall, its penultimate gig on a 21-city all-blues tour. the title of the concert, \"blues at the crossroads,\" is doubly suggestive. it invokes the legend that, one midnight at a crossroads in mississippi, <mark>johnson</mark> made a deal with the devil, who tuned his guitar and gave him special blues powers in exchange for his soul. one of <mark>johnson</mark>'s best-known songs, \"cross roads blues\" (later covered by eric clapton's cream), helps to fortify this outsized tale in people's minds. but in a more sober vein, blues music really is at a crossroads, with only a few of the seminal delta musicians who migrated north to play and record the blues, such as edwards and pianist pinetop perkins, still alive today. most of the titans who came to prominence in the blues revival of the 1960s and '70s are gone. and while there are pockets of stellar blues musicians from succeeding generations who keep the flame alive, its potency has diminished on the music scene. \"i think there is something of a regeneration happening to blues music, with the white stripes and the black keys and others drawing heavily from the delta blues,\" mohr said. \"i know i can feel a need and a readiness out there for the emotional part of blues music to be current again.\" forefathers and sons \"the blues? i don't care what happens, the blues is gonna be here,\" said sumlin, 79, with a mischievous laugh. \"everything else is gonna die before the blues.\" hearing sumlin play--be it on old howlin' wolf recordings, his performances last year on a jimi hendrix tribute tour, or with the big head blues club--it's tempting to believe him. and when mohr reports that 95-year-old honeyboy edwards is a fixture on the tour bus, and that sumlin constantly regales him with stories from the road and has \"been like a father to me,\" that passing of the baton seems a bit more secure. sure, sumlin is engaging in howler-caliber hype when he insists that \"these big head todd and his monsters can play <mark>robert johnson</mark> as good as <mark>robert johnson</mark> hisself.\" but when mohr opens the gigs with a heartfelt acoustic rendition of \"love in vain\" or \"stones in my passway\" on dobro or guitar and vocal, it's apparent he's following the tradition while being true to himself and ever-conscious of the danger of becoming a charlatan. the same can be said of the other three members of big head todd and the monsters. ditto drummer cedric burnside, grandson of the late blues singer r.l. burnside and the 2010 blues music awards drummer of the year, who teams with slide guitarist lightnin' malcolm on the record and the current tour. that's malcolm stinging his slide behind honeyboy edwards, or on a solo rendition of a son house tune. without question, something precious will be lost with the passing of edwards, perkins, sumlin and others. but it has always been that way. meanwhile, something precious is also being savored, and retained. \"i told my producer, clive goldsmith, that i've been waiting 30 years to make this record,\" said mohr, who had a hit single when he and the monsters were joined by <mark>john lee</mark> hooker for a cover of hooker's classic blues \"boom boom,\" and who included the blues standard \"smokestack lightning\" on their last album in 2010. \"i am delighted to be in this period of rediscovery and enlightenment. the music i make [from now on] will always be affected by this. - the garfunkel-less hall of famer will perform at the minneapolis convention center's auditorium in lieu of northrop. your comment is being reviewed for inclusion on the site. startribune.com welcomes and encourages readers to comment and engage in substantive, mutually respectful exchanges over news topics. commenters must follow our terms of use. keep it civil and stay on topic. no profanity, vulgarity, racial slurs or personal attacks. comments that violate the above will be removed. repeat violators may lose their commenting privileges on startribune.com. car detective let us look for you. when a vehicle that matches your specifications is listed, search thousands of listings nationwide. listings include local foreclosures and upcoming open houses. healthcare careers exploration. education. your healthcare career awaits."}, {"articleID": "2014092620_00030892_W", "names": {"John Mayer": ["Q1699730", "Q21039156", "Q215215"], "Beverly Hills": ["Q4899544", "Q923258"]}, "date": "2014-09-26", "url": "http://news.com.au/national/victoria/tinder-craze-a-casual-sex-cesspool-or-a-swipe-right-for-true-love/story-fnii5sms-1227070498139", "content": "Tinder craze: A casual sex cesspool or a swipe right for true love? WITH 10 million users worldwide and about a million users in Australia, Tinder has become the go-to dating app for 20 and 30-somethings. But is finding true love really as simple as swiping right or is Tinder just a cesspool of casual sex? Apparently, it's a match. Time to plan the first date? Source: TheAustralian It was a weekday evening and Erica was at home in inner Melbourne, browsing through the latest faces and physiques on Tinder, when she spotted a family friend from primary school days. \"Our parents knew each other well and he and I played together,\" the 28-year-old says. \"We hadn't seen each other for at least 20 years. I recognised him instantly but it was obvious he didn't recognise me.\" I swiped right and so did he and we started texting. But within three texts he wrote, \"So, fancy a f--?' I didn't take that any further.\" Erica has had three Tinder dates with guys who've passed her unofficial selection test - she spends a few days texting and talking on the telephone to find out more before agreeing to a first date in a public venue. \"While you're texting and talking you can usually work out if they're crazy or married or if the spark isn't there,\" she says practically. \"My first Tinder date went well but then I got busy at work. When I messaged him a few weeks later I didn't hear back. The next guy I went out with was a bit quieter than the guys I usually go for but I liked him.\" But a few days later he sent me a message saying he'd met someone else. I respected his honesty and with Tinder there are always plenty more fish in the sea! \"I went on my last date at a bar in Brighton. The guy was about three inches shorter than me and while we got along well we both sensed it wasn't going to be a romance.\" DATING FROM YOUR LOUNGE ROOM Erica says Tinder is helpful in connecting people who have busy lives. \"Sometimes at the end of the day slapping on make-up, doing your hair and going out to dinner or to a bar is the last thing you want to do. With Tinder you can find people and chat without leaving home,\" she says \"I don't think you can expect to meet the love of your life anywhere - it will just happen. But by interacting with more people, it opens up your opportunities.\" Since it launched in late 2012, Tinder has more than 10 million users worldwide and has become the international go-to app for 20 and 30-somethings looking for friends, social opportunities, a date or, ahem, a little more. And Australia has embraced it with open arms. Tinder co-founder Sean Rad says Australia is the third largest user after the US and UK, though he won't confirm exactly how many people here use the app. For the dwindling number of people still unfamiliar with Tinder - mostly the 40-plus age group and those preoccupied with mortgages and kids - Tinder's technology allows people to use their mobile telephone to browse profile photos of other Tinder users within a set geographical distance from themselves. If you like the look of someone's photo you swipe right and they join your list of \"liked people\" . You swipe left to reject a profile and that person will never know you've rejected them. Hanging out at the bar on Tinder. Picture: Keryn Stevens Source: News Corp Australia KEEPING IT SIMPLE If the person you swipe right \"likes\" you too, then you can start chatting via text, phone or arrange to meet. \"Our vision was to make it more simple and organic to meet new people,\" Rad says. \"We put everyone on a level playing field and they figure out who wants to meet who. Initially we tested Tinder with college students because they're at a stage of their lives when meeting new people is top of mind.\" But it grew beyond that. It's become very mainstream now - people talk about Tinder on daytime TV. It has entered the fabric of pop culture. \"Modern-day icons of pop culture have been quick to jump on the Tinder trail, too. Katy Perry says she has been using it following her split this year from boyfriend of two years <mark>John Mayer</mark>. Singer Lily Allen says she has been looking at what Tinder has to offer (though this admission left her fans wondering about the state of her marriage). Earlier this year Shane Warne tweeted that he was debating whether to join Tinder. Warne made the tongue-in-cheek comment after ex-girlfriend Liz Hurley swiftly healed her broken heart with a new love. In response, Warne mused:\" It might be time to take up my single friends' suggestions and join Tinder! \"And Aussie singer Natalie Imbruglia says she's also considering the app.\" My girlfriend in London has fallen madly in love on her third Tinder date - and I'm incredibly jealous - everyone I know who's single in London is on Tinder, \"she said. AN EGO BOOST Rad says Tinder's core user group is 18 to 35-year-olds, fairly evenly split between men and women. He believes the app's popularity lies in the fact that\" you can make what you want out of it \".\" You can look for a date, for a short-term relationship, for a person to marry or a friend, \"he says.\" We're in the business of making that initial contact and what people then make of that is completely up to them. I think people initially start using Tinder because they want to see how many matches they can make - it's an ego booster, just like posting content on Instagram and seeing how many likes you get. \"But when you get a match on Tinder you could then meet a best friend or fall in love.\" Rad dismisses criticism that Tinder is superficial and encourages casual sex and disposable relationships. \"Yes, it is initially based on appearance but that's humanity, right? That first impression counts,\" he shrugs. \"That first impression is how we initially make contact whether we like that or not.\" THE TRAVEL APP Caroline Chagas, 30, a St Kilda business owner, has used Tinder when travelling. \"In Scotland recently I met a local guy through Tinder. He invited me to a gallery because we were both interested in art - though after we first matched and started texting he said he wanted to have sex,\" Chagas says. \"I told him that wasn't going to happen and 20 minutes later he messaged me and said the urge had passed and did I want to keep talking?\" So we kept texting and I made it very clear nothing would happen between us. But we went to the gallery and it was great to be in a new city with a local showing me around. \"Chagas is a recent recruit to Tinder after stories of instant hook-ups initially put her off.\" I'm not judging - but it's not something I do and often I tell guys that and don't hear from them again! \"she laughs.\" I think one of the worst things about Tinder is that in the process of using it I've found husbands of friends using it, too. That's pretty confronting. I see Tinder more as window shopping and if you're looking for a soulmate perhaps you should stay away. \"Doing what comes naturally. Pic Keryn Stevens Source: News Corp Australia HOOKING UP, BUT LONELY Relationships Australia's Melbourne manager Sue Yorston says Tinder fits well with a generation used to getting the information they need from technology.\" They are also an \"I' generation who've been told they can do and have what they want and they're an instant generation looking for instant gratification. I think people using Tinder aren't getting anything they don't expect out of it,\" she says. Yorston says the concept of dating has changed from a time when people often met a potential partner through work or friends and got to know them gradually. \"Dating isn't really in our vocabulary any more. Now people hook up,\" she says. \"Tinder is very instantaneous and I think it seems to be based more on popularity - people can start to judge themselves based on the number of\" likes' they get. \"So if I am using Tinder I exist and if I'm getting hook-ups and likes, someone is looking at me. I think the current generation of 20s and 30-somethings are often isolated. Our research has found the highest users of social media websites also scored highest on a scale of loneliness.\" As humans we can only thrive if we have that caring, nurturing personal contact. We need empathy, cuddles and care so we know that we matter to someone and that they have our interests at heart. \"JUST DOING WHAT COMES NATURALLY University of Melbourne's School of Social and Political Sciences senior lecturer Dr Lauren Rosewarne believes apps like Tinder have taken off simply because it's a way to do more quickly what humans have strived to do for eons - connect with others.\" Tinder simply makes easier what is already happening offline: men and women connecting for friendship, romance or just sex. Therefore the same pitfalls and perils of the dating world - for both genders - exist in the context of Tinder, \"she says, referring to the risks of unwanted pregnancy, STIs, heartbreak and feelings of being exploited. However, she adds that with a larger time gap now between when people become sexually active - at around 17 - and when they marry in their late 20s or early 30s, it's to be expected that people will have more sexual partners, with or without the help of Tinder. But Rosewarne says double standards exist.\" Society as a whole still judges women more than they judge men when it comes to how many sexual partners they have. We have this fear of what will happen to society if women don't toe the line, \"she says.\" I think if you are using Tinder you have to keep your expectations modest. But if there weren't a place or a market for Tinder, people wouldn't be using it. \"There are 10 million users of Tinder worldwide. Picture: Keryn Stevens Source: News Corp Australia SAVING TIME AND MONEY Felix *, 32, works in contract management in Melbourne and has been on Tinder for six months - friends persuaded him to try the app after the end of a long-term relationship.\" I think a forte of Tinder is that it saves people time and money. If you go out to meet people. you might go to 10 bars or clubs in 10 different weeks and you're dropping money everywhere, \"he says.\" I've been on about 12 dates and most people have been quite nice. I tend to swap messages with someone over a week and then talk on the phone and if that person sounds interesting I take it from there. \"I've only had one weird Tinder experience - I arranged to meet a girl who was the opposite of the person I'd spoken to on the phone. I wasn't even certain she was the same person, actually. She was very full on and not the sort of person I'd want to catch up with at all.\" Felix is using Tinder to meet new people when he moves to Sydney this year. \"It's a great way to make connections in a new place - people have been advising me on where to live. For me, it's been more of a friend finder,\" he says. The brains behind Tinder: Justin Mateen and Sean Rad in <mark>Beverly Hills</mark>. Source: Supplied WEIRD DATES AND A WEDDING Chris *, 31, works in sales and began using Tinder about a year ago - it's a favourite pastime on a Friday night when he's out with mates. \"They're always keen to help me make a decision. I like the simplicity of it. I've used the Blendr app before but the downside of that is you could be texting someone and not know if they are interested or not,\" he says. \"With Tinder there's an immediate common ground but that can be a downfall. I think people can in the end be too personal and impolite. I haven't used Tinder for the quick\" wham, bam, thank you ma'am' and I think some girls now expect that. \"Chris has been on a dozen Tinder dates with mixed results.\" Early on I met a girl and I was two minutes late for our date but I sent her a text to let her know I was running behind. When I arrived the first thing she said was, \"what drink are you buying me?' There wasn't even a hello and she was preoccupied with everything else happening in the bar - I think she was interested in my wallet basically,\" he says. \"But I have been to a wedding of a couple who met through Tinder and I recently met a girl who is a generous and considerate person. So we'll see how that goes.\" * Some names have been changed Originally published as Do you swipe here often?"}, {"articleID": "2008120115_00039555_W", "names": {"Taj Mahal": ["Q353023", "Q59627566"], "Satish Chandra": ["Q42721372", "Q7426275"], "George Bush": ["Q207", "Q23505"], "Manmohan Singh": ["Q17019633", "Q41914", "Q47205876"]}, "date": "2008-12-01", "url": "http://news.in.msn.com/national/article.aspx?cp-documentid=1711235", "content": "india to intensify cooperation with foreign intelligence agencies new delhi: with the mumbai terror strikes killing 183 people - at least 20 of them foreigners - and sparking global outrage, india has decided to intensify cooperation with security agencies of other countries, a move that is likely to put extra pressure on pakistan to come clean on its alleged links with the attacks. \"india does not have issues with seeking cooperation of intelligence agencies of other countries, specially in an incident like this in which foreign nationals are involved,\" official sources told ians. a federal bureau of investigation (fbi) team landed in mumbai sunday night. it has already surveyed the <mark>taj mahal</mark> palace and tower hotel which, along with the trident-oberoi hotel and nariman house, was the scene of the almost 61-hour long operation to flush out the terrorists who had seized the three buildings. the fbi team is reported to have traced an e-mail sent to lahore by the deccan mujahideen, a shadowy organization which has claimed responsibility for wednesday night's terror attacks that injured at least 325. besides the fbi, security teams from israel and britain are also in india to help investigation agencies here in unearthing the larger plot behind the mumbai carnage. the only terrorist captured by indian authorities following the mumbai attacks told his interrogators that he and the 10 other men in his group were sent specifically to kill israelis to avenge \"atrocities\" against the palestinians. six israelis, some dual citizens but all of them jews, were killed in the attack on the nariman house, also known as chabad house, one of the 10 targets hit by terrorists in a series of coordinated attacks across the city. amir kasab, 21, told investigators that this was why they targeted the chabad house, an outreach center meant for local jews and jews touring india, including israelis. india's polite declining of an israeli offer to send its elite counter-terror squad to end the siege of nariman house has been criticized by some sections of the israeli media. however, new delhi feels that it did the right thing by refusing the israeli assistance as this may have delayed the anti-terrorist operation. \"it would have required some time to brief israeli squads about the geography of the place and other issues relating to rules of engagement. besides, our people are as good as anybody else,\" official sources said. \"we can't have foreign troops carrying out anti-terror operations in our country. this is unacceptable,\" g. parthasarathy, a former indian envoy to pakistan, told ians. \"however, we must fully cooperate with intelligence agencies of other countries,\" he added. enlisting the assistance of foreign intelligence agencies will also help put extra pressure on pakistan to clear the air about those elements india suspects to behind the mumbai attacks, parthasarathy said. <mark>satish chandra</mark>, a former deputy national security adviser and also a former envoy to pakistan, agreed. \"this is call to be taken by security agencies only. we have good expertise in this area. we don't really need anybody's help,\" <mark>chandra</mark> told ians. the fbi team was briefly detained at the chattrapati shivaji international airport sunday night after customs officials refused to allow forensics equipment on board their aircraft on indian soil, sources in intelligence bureau said. however, senior raw officials said the team arrived here without providing prior lists of personnel and the specialised forensic equipment they were carrying. since customs officials in mumbai had no idea what the fbi team was carrying, they were asked about this. \"we do not want foreign investigating agencies to aid us in a probe which we are capable of handling. if we allow one agency to join the investigation it will lead to a precedent which we have been avoiding all these years,\" said a senior raw functionary. india had granted permission to the fbi to examine the sites involved in the mumbai terror attack since us nationals were also targeted. six americans were among the foreigners killed in the terror strikes. us president <mark>george bush</mark> has pledged his full support for the investigation into the attacks and will be sending secretary of state condoleezza rice to india wednesday for mutual consultations over the strikes. <mark>bush</mark> has assured prime minister <mark>manmohan singh</mark> that the us will provide all necessary resources and will work with the international community to bring those responsible for the bloodshed to justice."}, {"articleID": "2019062003_00116406_W", "names": {"Steve Williams": ["Q1179916", "Q12573034", "Q1283673", "Q1364352", "Q14403908", "Q16244764", "Q21094780", "Q2347408", "Q3499167", "Q3506825", "Q4583412", "Q7614311", "Q7614312", "Q7614313", "Q7614314", "Q7614315", "Q7614316", "Q7614317", "Q7614318", "Q7614319"], "Jason Day": ["Q24005613", "Q246992", "Q6162329", "Q6162331"], "Adam Scott": ["Q201842", "Q350869"], "Paul Casey": ["Q10557500", "Q683113", "Q7149753", "Q7149754"], "Matt Jones": ["Q16231732", "Q1793338", "Q18688093", "Q19879351", "Q20744464", "Q3299493", "Q3299747", "Q59550247", "Q6380972", "Q6788860", "Q6788861", "Q6788863", "Q6788864", "Q6788866", "Q6788867", "Q6788868"], "Cameron Smith": ["Q27840142", "Q27840143", "Q28343824", "Q2934778", "Q44614454", "Q5026380"], "Cameron Davis": ["Q16207340", "Q44741988", "Q54225074"], "Francesco Molinari": ["Q1363419", "Q15791396", "Q55965506"], "Justin Thomas": ["Q15877245", "Q19666564", "Q22098319", "Q51084062", "Q52504008", "Q775036"]}, "date": "2019-06-19", "url": "https://www.dailymail.co.uk/wires/aap/article-7160543/Williams-key-reclaiming-No-1-Day.html?src=rss", "content": "<mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark> e-mail <mark>Jason Day</mark> says his exciting new partnership with accomplished caddie <mark>Steve Williams</mark> has restored his hunger to reclaim golf's world No. 1 ranking. Winless since earning two US PGA Tour victories between January and May last year, former world No. 1 <mark>Day</mark> admits he was struggling to find a spark in his career. But the Queenslander believes he has turned a corner with <mark>Williams</mark> on the bag - admitting that hitting practice balls after his Wednesday pro am at the Travelers Championship was effort he had not put in for some time. The Travelers event at TPC River Highlands in Connecticut is the second event <mark>Williams</mark> will caddie for <mark>Day</mark>, following his tie for 21st at last week's US Open. <mark>Day</mark> knows New Zealand's <mark>Williams</mark> will not tolerate slacking, having caddied for Tiger Woods during 13 of his 15 major championship wins in addition to Australian <mark>Adam Scott</mark> when he won the 2013 Masters at Augusta. \"I think the most exciting thing for my game right now is the hunger and desire to get better again is back,\" <mark>Day</mark> told AAP at TPC River Highlands. \"<mark>Steve</mark> has been integral in that feeling because he is huge on hard work.\" That's why I'm back trying to do the things I need to do to improve; I'm going to do more work after a pro am which I wasn't really doing previously. I'm excited about getting on top of it all. \"<mark>Day</mark>, whose 12 PGA Tour titles includes the 2015 US PGA Championship, has not lifted a trophy since winning the Wells Fargo Championship in May last year. He admits there is a long road ahead to climb golf's rankings and usurp four-time major winner Brooks Koepka's hold on the position.\" Once you get that desire to get back to the top, working is very easy and becomes more of a habit, \"<mark>Day</mark> said.\" I'm going to be patient and let the results come however difficult that may be. \"<mark>Day</mark> will play the opening rounds of the Travelers with <mark>Paul Casey</mark> and Bryson DeChambeau. Other Australians in the field include 2012 winner Marc Leishman, <mark>Matt Jones</mark>, Rod Pampling, Curtis Luck, <mark>Cameron Smith</mark>, Aaron Baddeley and <mark>Cameron Davis</mark>. Headlining the Travelers are major champions Bubba Watson, Koepka, <mark>Francesco Molinari</mark> and <mark>Justin Thomas</mark>. TPC River Highlands, a par 70 that measures only 6,841 yards, is the second-shortest course on the PGA Tour behind Pebble Beach (6,816 yards). Share or comment on this article: <mark>Williams</mark> key to reclaiming No. 1: <mark>Day</mark>"}, {"articleID": "2016051223_00544891_W", "names": {"Juan Jacinto": ["Q16218552", "Q6300054"]}, "date": "2016-05-12", "url": "http://duluthnewstribune.com/news/4031539-benefit-be-held-superior-family-after-tragic-car-crash", "content": "Benefit to be held for Superior family after tragic car crash Benefit to be held for Superior family after tragic car crashDuluthMinnesota424 W. First St. 55802 A benefit will be held Sunday for the <mark>Jacinto</mark> family, owners of Guadalajara Mexican Restaurant in Superior. <mark>Juan Jacinto</mark> and his mother-in-law lost their lives in a car accident March 11 in Mexico. His wife, Maria, and their daughter, Jessica, were seriously injured. Money raised will help defray the family's medical and related expenses. Recommended for you Homeless youth on the rise in Duluth schools The event will run from 2:30 -5:30 p.m. at the restaurant in the Mariner Mall, 69 N. 28th St. According to Amigos de <mark>Juan Jacinto</mark>, a group of local residents are organizing the benefit, Maria suffered a spinal injury that required surgery. She has begun physical therapy and is able to move her fingers, hands and feet, but not her legs. Jessica broke both legs, her hip and collarbone. She is now out of her cast, according to group member Mark Androsky, but isn't walking unaided yet. The event is a time to remember a friend, Androsky said, and to help his family, which includes two teen sons living in Superior. \"I've been going to the restaurant for 10 years,\" Androsky said. \"My kids kind of grew up there.\" <mark>Juan Jacinto</mark> always greeted him as \"Se & ntilde; or Marco\" with a big smile, and took time to visit and show them around the business. \"He just worked all the time,\" Androsky said. \"He put his heart, soul and life into the restaurant.\" The business owner had a heart like a teddy bear and would give you the shirt off his back, he said. The community has responded in kind, with an outpouring of support and more than 25 silent auction prizes. The Amigos group hopes to double the number of prizes; additional silent auction items can be brought to the restaurant or mall office during business hours by Saturday. Sunday's event will begin with a prayer service and dedication at 2:30 p.m., followed by $1 tacos and a silent auction 3-5 p.m. Those unable to attend--but who would still like to help--can direct donations to Superior Choice Credit Union, Attn: <mark>Jacinto</mark> Family Benefit, 2817 Tower Avenue, Superior, WI 54880. Find more information on the Amigos de <mark>Juan Jacinto</mark> Facebook page. Recommended for you"}]