[{"articleID": "2011012216_00101230_W", "names": {"Stephen Ross": ["Q30071164", "Q531857"]}, "date": "2011-01-22", "url": "http://nationalfootballpost.com/Dolphins-sign-Ireland-to-contract-extension.html", "content": "send this january 22, 2011, 11:18 am est with coach tony sparano already signed to a contract extension, now miami dolphins owner <mark>stephen ross</mark> has signed general manager jeff ireland to a multi-year contract extension. the dolphins have gone 25-24 under ireland. \"the decision to extend jeff's contract as our general manager was an easy one,\" <mark>ross</mark> said. \"the young talent that jeff has assembled during his three years with the dolphins has made a profound impact on our franchise's recovery from the 1-15 season of 2007. jeff has my full support moving forward as we pursue our goals to build the best and brightest front office in the national football league and ultimately to win a super bowl championship for all of south florida and dolphin fans around the world.\" there are no comments for this post, please add your comment below."}, {"articleID": "2020011018_00260256_W", "names": {"Tim Sullivan": ["Q16122829", "Q17033913", "Q466552", "Q59368830", "Q7804357", "Q7804358"]}, "date": "2020-01-10", "url": "http://philly.com/politics/nation/marianne-williamson-democratic-presidential-trump-20200110.html", "content": "Democratic presidential candidate Marianne Williamson speaks at a the Faith, Politics and the Common Good Forum at Franklin Jr.. High School, Thursday, Jan. 9, 2020, in Des Moines, Iowa. Andrew Harnik / AP DES MOINES, Iowa--Democratic presidential candidate Marianne Williamson, the spiritual guru and bestselling author, ended her campaign on Friday, weeks before voting begins, saying she did not want to make it tougher for a progressive to win. She also said she did not believe she would be able to gain enough support in the upcoming contests to make a difference in the race to challenge President Donald Trump. Related stories Elizabeth Warren is gearing up for the 2020 Pennsylvania primary Takeaways from the Democratic debate: Buttigieg keeps rising, Warren gets an easier ride Joe Biden told this protester to \"vote for Trump .' Bernie Sanders just hired him. Related stories Elizabeth Warren is gearing up for the 2020 Pennsylvania primary by Julia Terruso Takeaways from the Democratic debate: Buttigieg keeps rising, Warren gets an easier ride by Jonathan Tamari Joe Biden told this protester to\" vote for Trump .' Bernie Sanders just hired him. by Julia Terruso In a post on her website, Williamson said \"we will not be able to garner enough votes in the election to elevate our conversation any more than it is now.\" Williamson has barely registered in the polls and struggled in fundraising since launching her bid for president last January. She laid off her entire staff from her campaign at the end of last year, but continued to appear at campaign events in Iowa and New Hampshire in recent weeks. Her decision leaves 13 candidates remaining in the primary. Posted: January 10, 2020 - 1:10 PM Alexandra Jaffe, Associated Press Clout Newsletter Clout: your guide to the wild world of politics Sign Up Clout Newsletter We Recommend Nancy Pelosi: House moving to send impeachment to Senate next week Lisa Mascaro and Mary Clare Jalonick, Associated Press U.S. announces new sanctions on Iran after missile strikes Associated Press As Iran and U.S. take step back from the brink, Canada grieves Rob Gillies and <mark>Tim Sullivan</mark>, Associated Press Justice Department winds down Clinton-related inquiry once championed by Trump. It found nothing of consequence. Devlin Barrett and Matt Zapotosky, The Washington Post Iran's next move: A cyber attack on the U.S.? David Gambacorta House approves measure demanding Trump pull back on Iran Karoun Demirjian, Washington Post We Recommend"}, {"articleID": "2015092809_00060415_W", "names": {"Rajeev Kumar": ["Q17149113", "Q37839716", "Q50627950", "Q56945691", "Q57500308"]}, "date": "2015-09-28", "url": "http://economictimes.indiatimes.com/markets/stocks/policy/fresh-guidelines-for-exchanges-listing-soon-sebi/articleshow/49136674.cms", "content": "Fresh guidelines for exchanges' listing soon: Sebi By PTI | 28 Sep, 2015, 02.36 PM IST Post a Comment READ MORE ON & raquo; sebi | <mark>Rajeev Kumar</mark> Agarwal | <mark>Rajeev Kumar</mark> | MCX | Forward Markets Commission | finance | equities ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: As its regulatory ambit widened with FMC's merger, capital markets watchdog Sebi today said it will put in place a new mechanism for entities desiring to operate in both equities and commodities segments. Besides, fresh guidelines would be put in place with regard to listing of the exchanges, U K Sinha said today after merger of the Forward Markets Commission (FMC) with the Securities and Exchange Board of India (Sebi). While the listing of stock exchanges has been hanging in balance for a long time, one commodity bourse MCX is already listed. \"Our immediate focus is to ensure stability and credibility in commodities markets and also to ensure that there are no disruptions in the way of functioning of commodity exchanges,\" he said. Sinha also said that new participants like banks and FPIs (Foreign Portfolio Investors) as well as more products would be allowed. \"These development measures will happen in few months. Right now, our focus would be on placing the regulators environment,\" he said. The Sebi chief said the regulator will come out with more guidelines for listing of exchanges in the context of commodities exchanges. \"We were waiting for the merger to happen first,\" he said. Sebi will also have a new mechanism for new entities who want to do business in both securities and commodity markets, he said, adding that the focus to ensure high quality physical delivery would be the starting point for the combined regulatory authority. Speaking at the event to mark the merger, Sebi's Whole Time Member <mark>Rajeev Kumar</mark> Agarwal said that the regulator will take stock of the NSEL matter subsequently. Sinha said it is a momentous day in regulatory architecture of India. \"This will have impact on regulatory area as also on the economy at large. It has taken almost 12 years for the merger but globally such steps have taken longer time. Except US and Japan, rest of the world has unified regulatory system so far as securities and commodities are concerned,\" he said. Giving credit to Finance Minister Arun Jaitley for navigating through the entire merger process in a timely effective manner, Sinha said, \"I was not sure that such position will be taken up so early and so fast.\" He added: \"With this merger, there are a lot of expectations from market players and participants. This merger is expected to ring in economies of scope and scale. It will encourage more competition and better price convergence.\" Our effort is that it should help bring simplicity in transaction. Most importantly it should provide a tool to hedge risks for all major stakeholders, \"he said. Sinha further said Sebi has made mistakes in the past but learnt from them.\" As far as commodity markets go, we will try to avoid making mistakes and avoid making any mis-steps. We will try for better convergence of prices from physical side, \"he said. Stay on top of business news with The Economic Times App. Download it Now!"}, {"articleID": "2012081909_00014980_W", "names": {"Jose Garcia": ["Q18808599", "Q3810443", "Q58413561", "Q6292313", "Q6292317", "Q778451"]}, "date": "2012-08-19", "url": "http://masslive.com/living/index.ssf/2012/08/2_ridge_runners_on_the_job_at_mount_tom_in_holyoke_thanks_to_grant_funding.html", "content": "the republican | michael s. gordon yamira vazquez, 19, left, and <mark>jose garcia</mark>, 21, right, both of holyoke have a job working as ridge runners on mount tom. holyoke - yamira n. vazquez has a summer job that is helping her keep in shape for the softball season at american international college in springfield where she plays third base for the yellow jackets. she is one of two young holyoke residents who have summer jobs as \"ridge runners\" on mount tom as part of a program of the trustees of reservations and the appalachian mountain club. vazquez likes the job because she can hike, enjoy nature and eradicate some of her shyness by talking with people she meets. the other ridge runner, <mark>jose garcia</mark>, and vazquez work on holyoke's mount tom portion of the new england national scenic trail, a 215-mile trail route that travels through 39 communities in connecticut and massachusetts. the trustees of reservations and the appalachian mountain club have joined forces to provide outdoor work opportunities here thanks to a grant from the boston youth environmental network and the state department of conservation & recreation. the grant helped to expand the trustees' existing holyoke youth conservation corps that offers regular summer employment to local teens and to create the two new ridge runner positions to work with hikers on mount tom. vazquez has completed her first year at american international where she is double-majoring in criminal justice and political science. <mark>garcia</mark> has been working with the holyoke boys & girls club as a supervisor, instructor and lifeguard. both have experience with holyoke's natural spaces through their previous work with the trustees' youth corps. \"i'm honored to say i'm a ridge runner,\" vazquez said. as ridge runners she and <mark>garcia</mark> welcome hikers to the trail, answer questions, provide directions to visitors and monitor trail conditions. they also provide the current youth corps members with important trail condition reports and act as professional role models for the younger team members. the ridge runners also serve as outdoor ambassadors for holyoke, speaking to others about their work and the benefits of being outside. the department of conservation & recreation awarded a $250,000 grant to the boston youth environmental network last year to create and fund paid opportunities for youth to have positive job experiences outdoors, working in state parks and trails across massachusetts. the trustees was awarded a portion of the grant from the boston youth environmental network to fund its existing youth corps and to work with the appalachian mountain club to create the new ridge runner positions. \"the trustees are interested in creating more green jobs and outdoor opportunities in holyoke,\" said kate preissler, engagement manager for the western region for the trustees. the grant for the ridge runner program was an opportunity to create new positions. the ridge runners were selected based in part on prior outdoor work experience, familiarity with outdoor activities and the mount tom area, comfort speaking with the public and eagerness to share what they know with others, preissler said. vazquez and <mark>garcia</mark> will be the hiking the trail on mount tom saturdays and sundays through the end of august."}, {"articleID": "2011082922_00011017_W", "names": {"Sarah Wright": ["Q21456599", "Q269137", "Q57958348", "Q58209430"]}, "date": "2011-08-29", "url": "http://krem.com/news/local/128618403.html", "content": "gallery see all 2 photos? seattle--it may not be starring meg ryan and tom hanks, but there is a movie filming in seattle for the next few weeks. the movie is titled \"21 and over,\" and stars a cast of newcomers to hollywood, including names many may never have heard off, such as justin chon and <mark>sarah wright</mark>. imdb lists the movie as a comedy. the storyline is written as \"the night before his big medical school exam, a promising student celebrates his 21st birthday with his two best friends.\" uw anticipates the movie crew will be on campus until late september, but they will be most visible today (monday, august 29), friday, september 2 and tuesday, september 6 for \"traffic stunts.\" crews are shooting the stunts mostly in the area of memorial way and stevens way. additional shoots are scheduled for inside campus buildings and around campus in the evenings. print print email email this article share tweet facebook share share! x digg delicious myspace google buzz linkedin stumbleupon newsvine reddit previous article 5,000 acres charred in bell plain complex fire next article survivor of okanagan shooting released from hospital"}, {"articleID": "2009071705_00042555_W", "names": {"Jim Jordan": ["Q186215", "Q5892295", "Q6195963"]}, "date": "2009-07-17", "url": "http://rechargenews.com/energy/biofuels/article183474.ece", "content": "the quality of ethanol is checked at a distillation plant at the jalles machado sugar cane farm in goianesia 125 miles from brasilia direct brazilian ethanol exports to the us crash brazil has exported 22.3 million litres to the us since mid-april, compared to 376.2 million litres during the same time last year, according to the brazilian sugar cane industry association, unica. \"at this time last year, better us sales opportunities existed because gasoline and petroleum were so expensive,\" says julio borges of the brazilian consultancy job economia e planejamento. \"the mixture of ethanol in gasoline in the us was very economically attractive - today the situation is very different-petroleum is cheap, gasoline is cheap.\" bob starkey, vice president at <mark>jim jordan</mark> & associates, a us consultancy, says it is not just the price of gas: \"the weak ethanol price in the us is due to the slow demand for gasoline, demand is down for transportation fuel by 5.5% versus last year for the first six months, because of the recession and 9.5% or higher unemployment. the economics for blending ethanol is good, but overall demand for fuels is down.\" miguel biegai, a sugarcane specialist at safras & mercado, a brazilian consultancy, blames the drop off on a lack of early contracts, usually signed some six months before the beginning of the harvest. he notes that in late 2007, with oil prices on their way up, contracts for the following harvest were a hot commodity.but in the second half of 2008, contracts were few and far between. \"even those who knew they would buy were afraid of buying ahead of time because they didn't know\" where prices would be in the middle of 2009, says biegai. the market today is improving, says biegai, and starkey and commercial analyst fred gomes of the brazilian consultancy mbf agribusiness say strong domestic demand has drawn interest away from imports while the us dollar has been weak compared to the brazilian real, leading producers to get a better value locally. exports via the caribbean basin initiative, which end up in the us but without the $0.54 per gallon tax that is charged on direct shipments, were the same as last year. starkey says \"using the caribbean dehydrators to avoids the duty is just barely profitable, but the transit time delay about four weeks make shipping to the us are risky, the price might drop between shipment and delivery date. this makes setting a contract difficult.\" european exports have held steady, and unica says that exports to india, japan and south korea have made up for the steep drop off in us exports."}, {"articleID": "2015122114_00398887_W", "names": {"Keith Alexander": ["Q1360488", "Q1385942", "Q6383962", "Q6383966"], "Patrick Miller": ["Q16228480", "Q2057815", "Q7147222"]}, "date": "2015-12-21", "url": "http://www.mercurynews.com/crime-courts/ci_29292125/investigation-reveals-us-power-grid-vulnerable-foreign-hacks", "content": "Investigation reveals US power grid vulnerable to foreign hacks By GARANCE BURKE and JONATHAN FAHEY Associated Press Posted: 12/21/2015 06:01:43 AM PST Updated: 12/21/2015 06:01:47 AM PST SAN JOSE--Security researcher Brian Wallace was on the trail of hackers who had snatched a California university's housing files when he stumbled into a larger nightmare: Cyberattackers had opened a pathway into the networks running the United States power grid. Digital clues pointed to Iranian hackers. And Wallace found that they had already taken passwords, as well as engineering drawings of dozens of power plants, at least one with the title \"Mission Critical.\" The drawings were so detailed that experts say skilled attackers could have used them, along with other tools and malicious code, to knock out electricity flowing to millions of homes. Wallace was astonished. But this breach, The Associated Press has found, was not unique. About a dozen times in the last decade, sophisticated foreign hackers have gained enough remote access to control the operations networks that keep the lights on, according to top experts who spoke only on condition of anonymity due to the sensitive nature of the subject matter. The public almost never learns the details about these types of attacks--they're rarer but also more intricate and potentially dangerous than data theft. Information about the government's response to these hacks is often protected and sometimes classified; many are never even reported to the government. These intrusions have not caused the kind of cascading blackouts that are feared by the intelligence community. But so many attackers have stowed away in the systems that run the U.S. electric grid that experts say they likely have the capability to strike at will. Advertisement And that's what worries Wallace and other cybersecurity experts most. \"If the geopolitical situation changes and Iran wants to target these facilities, if they have this kind of information it will make it a lot easier,\" said Robert M. Lee, a former U.S. Air Force cyberwarfare operations officer. \"It will also help them stay quiet and stealthy inside.\" In 2012 and 2013, in well-publicized attacks, Russian hackers successfully sent and received encrypted commands to U.S. public utilities and power generators; some private firms concluded this was an effort to position interlopers to act in the event of a political crisis. And the Department of Homeland Security announced about a year ago that a separate hacking campaign, believed by some private firms to have Russian origins, had injected software with malware that allowed the attackers to spy on U.S. energy companies. \"You want to be stealth,\" said Lillian Ablon, a cybersecurity expert at the RAND Corporation. \"That's the ultimate power, because when you need to do something you are already in place.\" The hackers have gained access to an aging, outdated power system. Many of the substations and equipment that move power across the U.S. are decrepit and were never built with network security in mind; hooking the plants up to the Internet over the last decade has given hackers new backdoors in. Distant wind farms, home solar panels, smart meters and other networked devices must be remotely monitored and controlled, which opens up the broader system to fresh points of attack. Hundreds of contractors sell software and equipment to energy companies, and attackers have successfully used those outside companies as a way to get inside networks tied to the grid. Attributing attacks is notoriously tricky. Neither U.S. officials nor cybersecurity experts would or could say if the Islamic Republic of Iran was involved in the attack Wallace discovered involving Calpine Corp., a power producer with 82 plants operating in 18 states and Canada. Private firms have alleged other recent hacks of networks and machinery tied to the U.S. power grid were carried out by teams from within Russia and China, some with governmental support. Even the Islamic State group is trying to hack American power companies, a top Homeland Security official told industry executives in October. Homeland Security spokesman SY Lee said that his agency is coordinating efforts to strengthen grid cybersecurity nationwide and to raise awareness about evolving threats to the electric sector through industry trainings and risk assessments. As Deputy Secretary Alejandro Mayorkas acknowledged in an interview, however, \"we are not where we need to be\" on cybersecurity. That's partly because the grid is largely privately owned and has entire sections that fall outside federal regulation, which experts argue leaves the industry poorly defended against a growing universe of hackers seeking to access its networks. As Deputy Energy Secretary Elizabeth Sherwood Randall said in a speech earlier this year, \"If we don't protect the energy sector, we are putting every other sector of the economy in peril.\" ------THE CALPINE BREACH The AP looked at the vulnerability of the energy grid as part of a yearlong, AP-Associated Press Media Editors examination of the state of the nation's infrastructure. AP conducted more than 120 interviews and examined dozens of sets of data, government reports and private analyses to gauge whether the industry is prepared to defend against cyberattacks. The attack involving Calpine is particularly disturbing because the cyberspies grabbed so much, according to interviews and previously unreported documents. Cybersecurity experts say the breach began at least as far back as August 2013, and could still be going on today. Calpine spokesman Brett Kerr said the company's information was stolen from a contractor that does business with Calpine. He said the stolen diagrams and passwords were old--some diagrams dated to 2002--and presented no threat, though some outside experts disagree. Kerr would not say whether the configuration of the power plants' operations networks--also valuable information--remained the same as when the intrusion occurred, or whether it was possible the attackers still had a foothold. According to the AP investigation, the hackers got:--User names and passwords that could be used to connect remotely to Calpine's networks, which were being maintained by a data security company. Even if some of the information was outdated, experts say skilled hackers could have found a way to update the passwords and slip past firewalls to get into the operations network. Eventually, they say, the intruders could shut down generating stations, foul communications networks and possibly cause a blackout near the plants .--Detailed engineering drawings of networks and power stations from New York to California--71 in all--showing the precise location of devices that communicate with gas turbines, boilers and other crucial equipment attackers would need to hack specific plants .--Additional diagrams showing how those local plants transmit information back to the company's virtual cloud, knowledge attackers could use to mask their activity. For example, one map shows how information flows from the Agnews power plant in San Jose, California, near the San Francisco 49ers football stadium, to the company headquarters in Houston. Wallace first came across the breach while tracking a new strain of noxious software that had been used to steal student housing files at the University of California, Santa Barbara. \"I saw a mention in our logs that the attackers stored their malware in some FTP servers online,\" said Wallace, who had recently joined the Irvine, Calif.-based cybersecurity firm Cylance, Inc., fresh out of college. \"It wasn't even my job to look into it, but I just thought there had to be something more there.\" Wallace started digging. Soon, he found the FTP servers, typically used to transfer large numbers of files back and forth across the Internet, and the hackers' ill-gotten data--a tranche of more than 19,000 stolen files from thousands of computers across the world, including key documents from Calpine. Before Wallace could dive into the files, his first priority was to track where the hackers would strike next--and try to stop them. He started staying up nights, often jittery on Red Bull, to reverse-engineer malware. He waited to get pinged that the intruders were at it again. Months later, Wallace got the alert: From Internet Protocol addresses in Tehran, the hackers had deployed TinyZbot, a Trojan horse-style of software that the attackers used to gain backdoor access to their targets, log their keystrokes and take screen shots of their information. The hacking group, he would find, included members in the Netherlands, Canada, and the United Kingdom. The more he followed their trail, the more nervous Wallace got. According to Cylance, the intruders had launched digital offensives that netted information about Pakistan International Airlines, the Mexican oil giant Pemex, the Israel Institute of Technology and Navy Marine Corps Intranet, a legacy network of the U.S. military. None of the four responded to AP's request for comment. Then he discovered evidence of the attackers' most terrifying heist--a folder containing dozens of engineers' diagrams of the Calpine power plants. According to multiple sources, the drawings contained user names and passwords that an intruder would need to break through a firewall separating Calpine's communications and operations networks, then move around in the network where the turbines are controlled. The schematics also displayed the locations of devices inside the plants' process control networks that receive information from power-generating equipment. With those details, experts say skilled hackers could have penetrated the operations network and eventually shut down generating stations, possibly causing a blackout. Cylance researchers said the intruders stored their stolen goods on seven unencrypted FTP servers requiring no authentication to access details about Calpine's plants. Jumbled in the folders was code that could be used to spread malware to other companies without being traced back to the attackers' computers, as well as handcrafted software designed to mask that the Internet Protocol addresses they were using were in Iran. Circumstantial evidence such as snippets of Persian comments in the code helped investigators conclude that Iran was the source of the attacks. Calpine didn't know its information had been compromised until it was informed by Cylance, Kerr said. Iranian U.N. Mission spokesman Hamid Babaei did not return calls or address questions emailed by AP. Cylance notified the FBI, which warned the U.S. energy sector in an unclassified bulletin last December that a group using Iran-based IP addresses had targeted the industry. Whether there was any connection between the Iranian government and the individual hackers who Wallace traced--with the usernames parviz, Alireza, Kaj, Salman Ghazikhani and Bahman Mohebbi--is unclear .------A \"LUCRATIVE' TARGET Cyberattacks designed to steal information are steadily growing in scope and frequency; there have been high-profile hacks of Target, eBay and federal targets such as the U.S. Office of Personnel Management. But assaults on the power grid and other critical infrastructure aim to go a step further. Trained, well-funded adversaries can gain control of physical assets--power plants, substations and transmission equipment. With extensive control, they could knock out the electricity vital to daily life and the economy, and endanger the flow of power to mass transportation, military installations and home refrigerators. In the summer of 2014, a hacker of unknown origin, using masking software called Tor, took over the controls of a large utility's wind farm, according to a former industry compliance official who reviewed a report that was scrubbed of the utility's name. The hacker then changed an important setting, called the automatic voltage regulator, from\" automatic \"to\" manual, \"he said. That seemingly simple change to any power plant can damage the generator and destabilize parts of the nearby grid if the plant's output is high enough. Last year, Homeland Security released several maps that showed a virtual hit list of critical infrastructure, including two substations in the San Francisco Bay area, water and gas pipelines and a refinery. And according to a previously reported study by the Federal Energy Regulatory Commission, a coordinated attack on just nine critical power stations could cause a coast-to-coast blackout that could last months, far longer than the one that plunged the Northeast into darkness in 2003.\" The grid is a tough target, but a lucrative target, \"said <mark>Keith Alexander</mark>, the former director of the National Security Agency who now runs a cybersecurity firm. The number of sophisticated attacks is growing, he said.\" There is a constant, steady upbeat. I see a rising tide. \"No one claims that it would be easy to bring down the grid. To circumvent companies' security, adversaries must understand the networks well enough to write code that can communicate with tiny computers that control generators and other major equipment. Even then, it's difficult to cause a widespread blackout because the grid is designed to keep electricity flowing when equipment or lines go down, an almost daily occurrence that customers never see. Because it would take such expertise to plunge a city or region into darkness, some say threats to the grid are overstated--in particular, by those who get paid to help companies protect their networks. Still, even those who said the risks of cyber threats can be exaggerated agree it is possible for cyberattackers to cause a large-scale blackout. And nearly everyone agrees that there are weaknesses that open the door to malefactors. Traditional central power stations and transmission systems include equipment that is decades old and physically unable to handle electronic threats. Some run on machines that use software that is so old that malware protections don't exist, such as Windows '95 and FORTRAN, a programming language developed in the 1950s. At the Tennessee Valley Authority, a corporation owned by the federal government that powers 9 million households in the southeastern U.S., a former operations security expert said in recent years he saw passwords for some key operating systems stored on sticky notes.\" Some of the control systems boot off of floppy disks, \"said <mark>Patrick Miller</mark>, who has evaluated hydroelectric dam cybersecurity for the U.S. Bureau of Reclamation and Army Corps of Engineers.\" Some dams have modeling systems that run on something that looks like a washing machine hooked up to tape spools. It looks like the early NASA stuff that went to the moon. \"The rush to tie smart meters, home programmable thermostats and other smart appliances to the grid also is causing fresh vulnerabilities. About 45 percent of homes in the U.S. are hooked up to a smart meter, which measures electricity usage and shares information with the grid. The grid uses that information to adjust output or limit power deliveries to customers during peak hours. Those meters are relatively simple by design, mostly to keep their cost low, but their security is flimsy. Some can be hacked by plugging in an adapter that costs $30 on eBay, researchers say. FERC recently raised concerns about another area that is not covered by federal cybersecurity rules: contractors that sell energy companies software and equipment. As is evident from the Calpine incident, attackers have used outside companies to pull off hacks against energy companies.\" We've got these vulnerable systems out there that are old and never had security built into them, and now we're exposing them to a wider audience, \"said Justin Lowe, a utility cybersecurity expert at PA Consulting Group.\" That wider audience is getting much more hostile. \"------DEFENDING THE GRID The full extent of the attacks on the grid is not public knowledge. A Freedom of Information Act request by the AP for information regarding any FBI investigations of such hacks was not fulfilled. The Department of Justice said that agency kept no record of how often any such cases had been prosecuted. The North American Electric Reliability Corporation, which oversees the reliability of the electrical sector, collects information about cyber incidents involving utilities and other users, owners, and operators of the bulk power system--but it is scrubbed of identifying information and details are confidential and exempt from disclosure under FOIA. Authorities say they take the threat seriously. In response to a FOIA request, Homeland Security said it had helped more than 100 energy and chemical companies improve their cyber defenses, and held both classified and unclassified briefings in June 2013 and late 2014 on threats to companies associated with power grid operations. A small DHS team compiles statistics about hacks and vulnerabilities on control systems powering the grid and other public infrastructure, and responds to some attacks. But former federal employees who spoke on the condition of anonymity because the information was sensitive said government red tape kept the team from thoroughly responding to the smaller municipal and rural utilities that most needed their help, and that the statistics overstated the agency's grasp of the problem. The companies themselves say they are vigilant--though they caution no fortifications are foolproof. Early this year, an operations supervisor in Virginia for a subsidiary of American Electric Power--the nation's largest power grid operator, with operations in 38 states--opened a personal email on a company laptop and unwittingly downloaded a piece of malware called CryptoLocker. Known as\" ransomware, \"CryptoLocker is a relatively common type of malware that reaches to outside servers, usually overseas, and downloads encryption instructions that scramble a computer's contents, making them inaccessible to anyone without a specific\" key. \"The malware then moves through a computer--and computer network--and encrypts all the files it can, keeping users from accessing anything. In exchange for a fee, the hackers provide the victim a key that allows the files to be unlocked. Members of AEP's cyber-security team--housed in the company's Columbus, Ohio, headquarters behind an unmarked door that unlocks with a fingerprint scanner--saw the strange network behavior as soon as it started.\" When you see this (code) attempting to hit thousands of systems outside of the AEP network, that's a \"holy crap' moment,\" said Sean Parcel, AEP's lead cyberinvestigator. Had CryptoLocker wormed its way into AEP's system, the business and operations networks could have locked up, experts say. But Parcel said AEP's cyberteam already had blocked the foreign addresses that the malware needed to reach to start encrypting files, part of a policy of systematically blocking hundreds of Internet Protocol addresses each week to keep employees from inadvertently downloading malicious code. AEP said the team remotely isolated and erased the supervisor's computer before its systems were affected. Like most big utilities, AEP's power plants, substations and other vital equipment are managed by a network that is separated from the company's business software with layers of authentication, and is not accessible via the Internet. Creating that separation, and making sure that separation is maintained, is among the most important things utilities can do to protect the grid's physical assets. But cybersecurity experts say the protective gaps between computer systems that manage utilities' business operations and machines that manage their grids are not always as wide or as unbridgeable as utilities say they are. And even the utilities' own experts, who maintain it would be extraordinarily difficult for a hacker to knock out power to customers, admit there is always a way in. \"If the motivation is high enough on the attacker side, and they have funding to accomplish their mission,\" Parcel said, \"they will find a way.\" ---- --"}, {"articleID": "2014061302_00023558_W", "names": {"John Henry": ["Q16193633", "Q3181733", "Q58744887", "Q6238703", "Q6238707", "Q6238712"]}, "date": "2014-06-12", "url": "http://therepublic.com/view/story/25f80e62a6d1412e9fbef344f945e71c/US--Missouri-Execution-Winfield", "content": "ST. LOUIS - A federal judge on Thursday granted a stay of execution for Missouri death row inmate <mark>John</mark> Winfield, less than a week before the convicted killer was scheduled to be put to death, citing concerns that a prison worker was intimidated into deciding against writing a clemency letter on Winfield's behalf. It wasn't immediately clear if the state planned to appeal the ruling by U.S. District Judge Catherine Perry in St. Louis. Messages seeking comment from the Missouri Attorney General's office and the Missouri Department of Corrections were not immediately returned. Winfield, 43, was scheduled to die at 12:01 a.m. Wednesday for killing two St. Louis County women in 1996. His execution would be among the first since late April, when the death of an Oklahoma inmate raised new concerns about lethal injection drugs and the secretive process many states use to obtain them. Clayton Lockett's vein collapsed on April 29 and he died 43 minutes later of a heart attack after he was injected with drugs obtained from a secret source. President Barack Obama called the botched execution \"deeply disturbing\" and called for a review of how the death penalty is applied in the United States. No one has been executed since. Marcus Wellons is scheduled to be put to death June 17 in Georgia, and three executions are scheduled for June 18: Winfield, Lewis Jordan in Pennsylvania and <mark>John Henry</mark> in Florida. Missouri is among several states that obtain execution drugs from unnamed compounding pharmacies. Other appeals by Winfield cited concerns that the unproven quality of the drug could cause pain and suffering for the inmate. But it was a different appeal that earned the stay from Perry. Court documents show that Terry Cole, the laundry director at the Potosi Correctional Center, which houses death row inmates in Missouri, told Winfield's attorneys he supported Winfield's clemency request and was willing to write a letter on Winfield's behalf. The judge wrote in her ruling that Cole was told by a prison administrator that there was no policy prohibiting such a letter, but workers must tell supervisors if they have contact with an inmate's attorney. But the judge said that on May 20, a corrections department investigator told Cole he was under investigation for alleged \"over-familiarity\" with Winfield. Cole eventually decided against writing the letter. Cole denied being threatened, but the judge said evidence indicated he feared for his job. \"The evidence presented to me shows that Winfield is likely to be able to prove at a later trial that prison officials took actions to intimidate Cole to keep him from providing support for Winfield's clemency petition,\" the judge wrote. Winfield attorney Joseph Luby said Cole supervised Winfield's work at the prison and spends eight hours a day with him. He said Cole has described Winfield as among the \"elite 1 percent of all inmates\" in terms of his behavior, and is an inmate who has served as a mentor for young prisoners. \"This 20-year corrections staff member was made to fear for his job when he wanted to tell the truth about Mr. Winfield's remarkable rehabilitation and the positive good he will continue to do if his life is spared,\" Luby said in a statement. In a separate case, a federal appeals court in St. Louis has set a September hearing regarding Russell Bucklew, whose late May execution was delayed by the U.S. Supreme Court hours before he was scheduled to die. Bucklew, 46, suffers from a rare congenital condition that causes weakened and malformed blood vessels as well as tumors in his nose and throat. The last-minute appeal cited those medical concerns as well as the secrecy surrounding the state's lethal injection drug and its supplier. The 8th U.S. Circuit Court of Appeals has scheduled a hearing on Bucklew's case for Sept. 9 All comments are moderated before posting. Your email address must be verified with Disqus in order for your comment to appear. Story copyright 2014 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Feedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to"}, {"articleID": "2020031306_00040003_W", "names": {"Miguel Lozano": ["Q43853754", "Q58968707"]}, "date": "2020-03-13", "url": "http://greenleft.org.au/content/one-day-without-us-mexican-women’s-strike-and-marches-make-history", "content": "Tamara Pearson Puebla March 13, 2020 Issue 1257 Mexico Mexican women's strike and march in Puebla. Photo: Tamara Pearson. Some 11 women were murdered in Mexico on March 8--International Women's Day--as hundreds of thousands mobilised around the country to protest the rampant violence women face. On March 9, a large proportion of the country's women participated in an action titled \"One day without us\" , and refused to work, shop, do housework, or be active on social media. The marches and the strike were effective in challenging the violence and abuse against women that has been normalised and cloaked in impunity in Mexico. Relatives of women who have disappeared or been murdered in Mexico. Photo: Tamara Pearson. Rage and momentum for the actions built up over February when a man murdered his partner, Ingrid Escamilla, then skinned her and removed her organs. Judicial authorities and the media colluded to print the photos of her body. Just days later, a 7-year-old girl was found in a plastic bag after being raped, tortured and having her organs removed. Women responded to the circulation of the exploitative and gory photos of Escamilla with an online campaign tagging Escamilla and posting photos and drawings of her face and of beautiful scenery, so that those would be the images she would be remembered by. Last year, 3825 women were murdered in Mexico, though only a third were formally classified as femicides. Two-thirds of women in Mexico have said they have been victims of some form of violence, and almost half said they were violently attacked in their most recent relationship. Women in Mexico earn 34% less than men for the same work, and 36% of women have unpaid home-based work as their main job. Isabel Maldonado. Photo: Tamara Pearson. Mexico's president, Andres Lopez Obrador's (AMLO) response to the calls for action was mixed. He supported striking women who work for the federal government, but also suggested the protests were aimed at destabilising his government. In Puebla, as in most parts of the country, relatives of victims of femicide led the march. Women on megaphones called out their names, and the march responded with chants of \"Justice!\" Since 2013, when the registry of femicides began in Puebla, only 20 of 434 femicides in the small state have resulted in sentences. \"Today is a day of protest at all the violence we face here in Mexico, but the violence is structural, so I think it is important to protest every day,\" Isabel Maldonado told Green Left. \"I'm marching today because I have the fortune of being alive\" . Photo: Tamara Pearson. Organisers in Puebla, a city of 1.5 million, estimated that 40,000 people participated in the march. In Mexico City, the government estimated 80,000 people participated however, organisers and observers put the figure at upwards of 140,000. All of Mexico's major cities had huge turnouts, with 25,000 in Guadalajara and 15,000 in Monterrey. Ana Maria Smith, a university lecturer who attended the Mexico City march, told Green Left: \"These marches were historic, not just because there were hundreds and thousands of us, but because we stopped being indifferent to the profound pain of people closest to the victims.\" \"We put ourselves in their shoes and felt their pain and made it all of society's. This process has helped us understand how damaging the patriarchal and capitalist systems are.\" Mexican women's strike in Puebla. Photo: Tamara Pearson. The March 9 strike was originally called by the Veracruz feminist collective, Brujas del Mar (Witches of the Sea) with the goal of simulating the disappearance of women and their social invisibility as well as demonstrating the huge role women play in society. The strike was successful. The women's carriages of Mexico City's trains and metro buses (designated as such in order to prevent the sexual harassment--common on crowded transport) were empty. Other public spaces were also eerily absent of women--only men were present in stations, universities and shopping areas. Most schools were left without teachers, as most teachers are women, and likewise, metro stations were left without ticket vendors. Some banks and universities joined the strikes and most street stalls were absent or staffed by men. Some 90% of the 18,500 women who work for one of Mexico's biggest banks, BBVA, went on strike. People shared photos of their offices--empty of women, stating \"it's clear that without them, things wouldn't work.\" Mexican women's strike in Puebla. Photo: Tamara Pearson. \"I'm still in shock, I never imagined that one day I would see something like this, a city without women,\" <mark>Miguel Lozano</mark>, a human resources director in a bank told Animal Politico. He said it was a day of reflection for men about the types of violence women face. Women Zapatistas issued a statement in support of the strike, saying women \"should know they aren't alone\" and participated in it by not turning up in their communities, and by lighting thousands of candles. On Tuesday, AMLO responded to the actions saying that his government's strategy wouldn't change--he said he would continue dealing with the \"causes of the violence,\" and emphasising employment and youth programs. [Tamara Pearson is a long-time journalist based in Latin America, and author of The Butterfly Prison. Her writings can be found at her blog .] Feminism women's strike gender violence"}, {"articleID": "2010121417_00143310_W", "names": {"David Cameron": ["Q1173911", "Q16195447", "Q18719363", "Q192", "Q47345547", "Q51808902", "Q5232111"]}, "date": "2010-12-14", "url": "http://cbc.ca/world/story/2010/12/14/holbrooke-praise014.html", "content": "last updated: tuesday, december 14, 2010 | 11:05 am et world leaders praised u.s. envoy richard holbrooke, who died monday following heart surgery in washington d.c. (omar sobhani/reuters) world leaders are praising u.s. envoy richard holbrook, who died in a washington, d.c., hospital following surgery for a tear in his aorta. holbrooke was remembered for engineering the end of the 1992-1995 bosnia war - europe's bloodiest conflict since the second world war - and for seeking to bring stability to war-torn afghanistan. canadian foreign affairs minister lawrence cannon was among those offering condolences on tuesday, calling holbrooke \"a trusted friend of canada\" and \"an inspiration to all of us.\" \"today marks the 15th anniversary of the signing of the dayton accords, the agreement that mr. holbrooke brokered to end the war in bosnia and open the door to stability, and democracy for the people of the western balkans,\" cannon said in a statement. \"we valued his views and counsel on the many issues that brought canada and united states together to promote our common values in a world fraught with conflict and fragility.\" even holbrooke's main opponent in the war in bosnia, bosnian serb leader radovan karadzic, expressed \"sadness and regret\" over holbrooke's unexpected death monday. but in afghanistan, the taliban rejoiced at news of his death, claiming it was caused by failures in the u.s.-led war there and holbrooke's \"grappling with a constant psychological stress\" from his position as president barack obama's special envoy to afghanistan and pakistan. \"the protracted afghan war and the descending trajectory of the americans' handling of the warfare in the country had a lethal dent on holbrooke's health,\" the group said on jihadi websites. legendary diplomatic skills in brussels, nato secretary general anders fogh rasmussen paid tribute to holbrooke's legendary diplomatic skills, saying he played an essential role in the 1995 dayton agreement that ended the bosnian war and lauding his work in afghanistan. as obama's special envoy, holbrooke realized \"that we sometimes have to defend our security by facing conflicts in distant places,\" fogh rasmussen said tuesday. afghan president hamid karzai and pakistani leader asif ali zardari also praised holbrooke, who died at 69, though holbrooke's style did not play as well with karzai as it did with balkan leaders. aides said karzai considered the american envoy ignorant of afghan culture. german foreign minister guido westerwelle said the world should be grateful to holbrooke for his contribution to the international strategy in afghanistan. holbrooke earned the nickname the bulldozer after he bullied warring serbs, croats and muslims to agree to end the bosnian war with sometimes risky diplomatic overtures. swedish foreign minister carl bildt, who served as an envoy to bosnia in the early 1990s, said the strategy gave holbrooke many close friends but also many enemies. british officials also offered tribute. \"he will always be remembered for his pre-eminent role in ending the vicious war in bosnia, where his force of personality and his negotiating skill combined to drive through the dayton peace agreement and put a halt to the fighting,\" prime minister <mark>david cameron</mark> said in london. \"an unjust peace, but still a peace' not all bosnians admired holbrooke's efforts to achieve peace, arguing that the multiethnic state he set up as part of the dayton peace process had proven too unwieldy for effective governance.\" he was instrumental in bringing peace to bosnia. an unjust peace, but still a peace, \"said haris silajdzic, bosnia's wartime foreign minister who participated in the dayton negotiations. but sarajevo's citizens, who suffered a 3? - year siege during the bosnian war that killed thousands, were more positive about holbrooke's legacy.\" the dayton agreement was reached to end the war, but it is no longer good for us and the time has come to change it, \"said dalila cikusic, a sarajevo resident.\" but that has nothing to do with holbrooke, we must do it ourselves...as far as richard is concerned, i only have words of praise for him. \"in kosovo, prime minister hashim thaci has proposed naming a square after holbrooke in the capital of pristina for his role in helping the province gain independence from serbia. violent protests have erupted in rome after prime minister silvio berlusconi won back-to-back confidence votes in parliament. a al-qaeda affiliated website says the suicide bomber behind an attack in central stockholm was targeting a newspaper that published cartoons of the prophet muhammad. wikileaks founder julian assange is granted bail by a british judge, and media reports suggest swedish authorities would not appeal the decision. world leaders praise u.s. envoy richard holbrooke after his unexpected death for engineering the end of the 1992-1995 bosnia war and for seeking to bring stability to war-torn afghanistan. police in southwestern ontario are working with the military near sarnia to try to clear a highway where nearly 300 motorists have been stranded by extreme winter weather. wikileaks founder julian assange is granted bail by a british judge, and media reports suggest swedish authorities would not appeal the decision. a al-qaeda affiliated website says the suicide bomber behind an attack in central stockholm was targeting a newspaper that published cartoons of the prophet muhammad. the lowly penny may be doomed, as the senate finance committee gets set to recommend that canada eliminate the coin."}]