[{"articleID": "2018081311_00163822_W", "names": {"Alexander Zverev": ["Q13990552", "Q24689242", "Q4189526"], "Kevin Anderson": ["Q11040742", "Q1740075", "Q18630776", "Q299956", "Q3195650", "Q42783158", "Q48769673", "Q6395723", "Q6395724", "Q6395726", "Q6395728"]}, "date": "2018-08-13", "url": "https://www.thesportreview.com/2018/08/toronto-masters-2018-rafael-nadal-masters-tstisipas-to-win-80th-title-but-is-out-of-cincinnati/", "content": "Toronto Masters 2018: Rafael Nadal masters Tstisipas to win 80th title, but is out of Cincinnati Rafael Nadal beats Stefanos Tsitsipas in the final to win the Toronto Masters title By Marianne Bevis Monday 13 August 2018, 12:08 UK @ mariannebevis Rafael Nadal Photo: Marianne Bevis The week in Toronto began with what looked like a truly challenging draw for the world No1 Rafael Nadal, but seven days later, he lifted his fourth Rogers Cup trophy to become only the fourth man in the Open era to win 80 career titles. Nadal won the title in Toronto in 2008 and in Montreal in both 2005 and 2013. On the last occasion, he went on to join a very select group of players in adding the Cincinnati title and then the US Open title, a remarkable North American treble. But while he is the defending champion in New York this year, but he will not be attempting the treble this time around. Now age 32, he has pulled out of Cincinnati. He said: \"I am sorry to announce that I won't be playing in Cincinnati this year. No other reason than personally taking care of my body and trying to keep as healthy as I feel now.\" It is a sensible decision: The Toronto title was his 40th match-win of the year, with all but four of those wins coming since April. After being forced to retire in the Australian Open quarter-finals with a hip injury, he was absent until the Davis Cup quarter-finals, where he won both his singles matches. They were immediately followed by title runs at the Monte-Carlo Masters, Barcelona, the Rome Masters and the French Open, plus a quarter-final finish in Madrid along the way. He went on to conclude his Wimbledon campaign in the semis on the back of two intense five setters, first a four hour 48 minute win over Juan Martin del Potro, then a five and a quarter hour loss to Novak Djokovic. In Toronto, he negotiated his potentially tricky draw with relative ease, with the exception of his three-set comeback over Marin Cilic in the quarters. It included wins over the often dangerous Benoit Paire, a three-time Major champion on the injury comeback trail, Stan Wawrinka, and the big, powerful 22-year-old Karen Khachanov. Finally, Nadal had to top the talk of the tournament, the charismatic Stefanos Tsitsipas. The Greek, who less than a year ago had yet to win a main-tour match, and was ranked 192, began what has been a stunning rise up the ranks from No91 this January. By the time he reached his first final in Barcelona, had broken the top 50. By then, he had claimed five top-20 scalps, and added David Goffin to that count with his semi-final run in Washington. Toronto, though, would bring out a whole new level of flair, attack, and sheer determination from the teenager who would turn 20 on the day of his first Masters final. He beat four top-10 players, the youngest ever to do so in a single tournament, including Dominic Thiem, Djokovic, <mark>Alexander Zverev</mark> and <mark>Kevin Anderson</mark>. What is more, he did it the hard way. The last three of those matches required three sets, the last two from a set down, and each involved tie-breaks. How much did he have left for the biggest final of his career? He began well enough, but Nadal had the look of a man on a mission, and his serving in particular was outstanding. He broke in the third game and again in the fifth, and while Tsitsipas would hold once, Nadal served out the set, 6-2, having dropped just one point on his serve. The Greek could not find an opening to hit back, but was not helped by below-par serving and a slew of forced forehand errors. And by the time Nadal led 4-2 in the second set, the Spaniard had yet to drop a first-serve point, and only two overall. It looked a foregone conclusion, then, that Nadal would serve out the victory at 5-4, but Tsitsipas, as he has so often this week, went for broke, swung freely, and helped by some unexpectedly tense serving--two double faults--from Nadal, broke to level. He then held comfortably, and threatened the Nadal serve, but could not convert his break chance for the set. And so it went to another tie-break, with many in the Toronto arena fully expecting the magician from Greece to take this to a third set again. But Nadal did not waver, and the hour-long second set ended 7-6 (4) in his favour. This is now Nadal's most successful hard-court event, and this his first Masters on the hard stuff since that famous treble run in North America in 2013. He said of his victory: \"If you told me this two weeks ago I would not have believed it...It's a very important victory for me and I'm very happy.\" Canada is a place that I feel comfortable. I play well. That's it. And I played with the Canadian colours during the whole event. \"But aside from Nadal's memorable achievement at the tournament, the Rogers Cup of 2018 will be remembered for bringing the personality and tennis of one of the new generation's brightest prospects centre stage. Tsitsipas, and his will to win, have charmed the crowds in Canada, but he will not be stopping here. He was ranked 27 at the start of the tournament, and has jumped to 15 this week. If he can hold that position until the US Open, it would be a helpful boost--he would not face a higher seed before the fourth round. However, Cincinnati will be a big physical test after his Washington and Toronto efforts, and he gets no first-round bye, either. He will be back on court come Tuesday against No11 seed Goffin in a draw at least as tough as the one in Toronto. But his will is strong, as his assorted messages on cameras and Twitter testify.\" Fight like there is no tomorrow. \"\"It never gets easier. You just get better.\" Talking to ATPWorldTour.com about his Nadal encounter, that fighting spirit was as intense as ever. He had learned, he said: \"How much I have to work. How much gap there is between him and me, and how much more I need to...Work more hours and become stronger and a more solid baseliner and withstand pressures, physical pressures on the court that to him it just seems like nothing special. That's the big difference between my game and his. He never cracks. He will always grab you like a bulldog.\" He concluded: \"I'm really hungry for more. I believe I can achieve much more this year.\" Few will disagree with that. But the day, the week, and very possibly the year, belong to world No1 Nadal, who now has almost 4,000 points between himself and No2 Roger Federer, after the two men had exchanged the No1 ranking six times in the opening months of the year. He has, it is fair to say, earned is rest during Cincinnati."}, {"articleID": "2018070521_00003953_W", "names": {"Anthony Kennedy": ["Q11171", "Q59192346"], "Harry Reid": ["Q19650494", "Q21466700", "Q314459", "Q5671912"]}, "date": "2018-07-05", "url": "https://www.outsidethebeltway.com/majority-of-americans-want-new-supreme-court-justice-confirmed-before-midterms/", "content": "Entertainment Majority Of Americans Want New Supreme Court Justice Confirmed Before Midterms Democrats are making largely meaningless appeals to the so-called \"Merrick Garland Precedent\" to argue for a delay in confirming the President's next Supreme Court nominee. The American people feel differently. Doug Mataconis · Thursday, July 5, 2018 · 1 comment Ever since Justice <mark>Anthony Kennedy</mark> announced his retirement last week, Democrats have been arguing that the Senate should put off consideration of whoever the President might select to replace him until after the upcoming midterm elections, which as of tomorrow will be exactly four months away. This call is quite obviously a call back to the refusal of Senate Majority Leader Mitch McConnell and the Republicans to hold a hearing or take a vote on the nomination of Judge Merrick Garland to succeed Justice Antonin Scalia after he died. At the time, Republicans and their supporters cited the fact that there was an upcoming Presidential election and that the American people should have an opportunity to be heard on the outcome of that election before the Senate acts on any nomination. Using much the same logic, many Democratic Senators and pundits are citing what they've come to call either the \"Merrick Garland Precedent\" or the \"Mitch McConnell Precedent\" in support of their argument that the Senate should delay consideration of a new Supreme Court nominee until after the election. This position began mere minutes after <mark>Kennedy</mark>'s retirement announcement became public when Senate Majority Leader said on the Senate floor that the Republican-controlled Senate \"should follow the rule they set in 2016, not to consider a Supreme Court justice in an election year.\" He also said that \"millions of people are just months away from determining the senators who should vote to confirm or reject the president's nominee, and their voices deserve to be heard now.\" Senate Minority Whip Dick Durin said pretty much the same thing, and the message has been repeated by other Democratic Senators, including Kamala Harris, Elizabeth Warren, and several Democrats who sit on the minority side of the Senate Judiciary Committee. Just today, Senator Schumer doubled down on his position by making the rather absurd suggestion that President Trump should appoint Merrick Garland to replace <mark>Kennedy</mark>, mirroring similar comments that were made by some on the left before Trump named Justice Gorsuch as his nominee early last years. By contrast, Senator McConnell has said that he intends to move quickly on the nomination once the President announces it and that he intends to hold a vote on the nomination before the beginning of the new Supreme Court term in October. This means there would need to be a Senate vote before the end of September and preferably early enough before the start of the new term on October 1st so as to allow the new Justice to prepare for the first two weeks of oral argument, which have already been announced. Obviously, Democrats have at least some hope that their appeal to what the Republicans did with respect to the Merrick Garland nomination will work to their political advantage notwithstanding the fact that it doesn't appear to have had much of an impact on the 2016 election outside the Democratic base. In any case, if a new NBC News poll is any indication, the American public does not agree: A majority of Americans believe the Republican-led Senate should vote on President Donald Trump's Supreme Court nominee before the November midterm elections, undercutting the Democratic argument that it should be delayed until after the pivotal fall elections, according to a new NBC News | SurveyMonkey poll. More than six in 10 Americans, or 62 percent, said Trump's nominee, who will be announced on Monday, should be confirmed or rejected before the elections in which control of the House and Senate are at stake. About three in 10, or 33 percent, said the Senate should wait until after the elections, the poll found. Sixty-six percent of Democrats and 60 percent of Republicans said Trump's nominee would be an important factor in their vote in the midterms. However, less than half of independents, 46 percent, said it would be on their mind when casting their November ballot. The vast majority of Republicans surveyed, 85 percent, said the Senate's vote on the nominee should take place before the election. Roughly six in 10 Independents, or 61 percent, agreed. However, more than half of Democrats, 55 percent, believe the voting on a new justice should wait. Obviously, there is at least some amount of hypocrisy in the fact that Republicans are prepared to proceed on a nomination to replace <mark>Kennedy</mark> just four months before the midterms, with a final vote on that nomination that would take place just 6-8 weeks before the election, after having refused to take any action on Garland's nomination which was announced some eight months before the Presidential election and seven months before the start of the Court's next term. However, as James Joyner correctly noted in his post on this issue on the day <mark>Kennedy</mark> announced his retirement, what the Republicans did with respect to the Garland nomination was in the end purely an exercise in power politics, it was not intended to be the establishment of some new precedent regarding the consideration of judicial nominees prior to an election. Additionally, as I put it in a post just a few weeks before President Trump took office, the Senate GOP Leadership made a huge political bet in the wake of Scalia's death, one that they easily could have lost had Hillary Clinton won the election, and they ended up winning. In the end, that was all that really matters. Part of the reason for this is because, in the end, voters outside the beltway clearly don't really care about the \"process stories\" that routinely become the obsession of Members of Congress, pundits, reporters, and activists. By that, I mean that they generally don't seem to care how something gets done in Washington as long as it gets done. This is the main reason why the GOP's gamble on the Merrick Garland nomination failed to resonate with the American public and why Democratic efforts to portray the efforts to get to a quick vote on the new Supreme Court vacancy isn't likely to resonate with them either. Polls like this make clear that they're more concerned with what gets done than how it happens, and the intricacies of the rules of the United States Senate are hardly something that is going to interest the average American voter. Given that, any hope on the part of Democrats that they're going to score political points on the contrast between the GOP position in March 2016 when Garland was nominated and its position today is way off the mark. In any case, the Democrats efforts to resurrect the ghost of Merrick Garland are clearly meant to be a political move. By bringing it up, they obviously hope to revive the memories of that matter in the minds of their base and the American public in the hope that it will be advantageous to them in the midterm elections. Obviously, they are essentially powerless to stop the nomination itself thanks to the Republican decision to finish the work that <mark>Harry Reid</mark> had started and end the filibuster for Supreme Court nominations. People such as Schumer and Durbin are obviously smart enough to realize that. If this poll is any indication, though, the argument isn't likely to resonate with the American public as a whole and could end up backfiring on Democrats if they try to slow the nomination down right before the election since such a move would seem to run counter to public opinion"}, {"articleID": "2017071513_00459615_W", "names": {"Ibrahim Babangida": ["Q333415", "Q35539224", "Q4521833"]}, "date": "2017-07-15", "url": "http://www.dailytrust.com.ng/news/feature/-how-we-survived-biafran-war/205547.html", "content": "Feature \"How we survived Biafran war' By Tony Adibe (Enugu), Linus Effiong (Umuahia), Nabob Ogbonna (Abakaliki) & Emma Elekwa (Awka) | Publish Date: Jul 15 2017 2:00 AM (0 Likes)\" How we survived Biafran war' War drums are easy to beat, but hard to dance. Rising agitations for Nigeria's break-up have made the country's leaders to issue words of caution at various points in recent times. <mark>Ibrahim Babangida</mark>, an army General and former military ruler who actively took part in the civil war to keep Nigeria one, recently expressed concern on profuse verbal provocations from certain individuals in the country, saying the pains of that war fraught with death and suffering are still being felt. This is a link that appears lacking in the imagination of current agitators for secession and hate speech mongers. Our correspondents bring accounts of some Nigerians who went through the three-year quagmire. Obiefuna Onuoha makes a living dealing in paint. He was five years old when the Nigerian civil war broke out. \"Everything was turned upside down. Life became miserable,\" he recalls. \"There was no food for us to eat, no water to drink. The only thing close to meat was grasshopper, if you could see it. Another was lizard. In fact, nobody should even think of another war, please. War is not good and I will nerve support it, a person like me would prefer dialogue if the need arises,\" he says. Onuoha recalls living in the forest with his twin for two whole years while bombs and mortars pounded surroundings. Now more recent agitations are forcing him to look back upon years he would rather forget. Agitators for Biafra and opposing sides have been pitted against each other. The stand-off has forced reflections into the years between 1966 and 1970 when Nigeria teetered on the brink of breakup, as the eastern part of the country declared itself Biafra, citing political marginalization. \"The obvious point is that freedom is not free and for me I am not ready to witness any fight again. In short, it is better for me to stay in Nigeria than witness another war in the name that we are fighting for Biafra,\" said Onuoha. Chinedum Nwogu was 18 years at the time, and he recalls how it began like a funfair. \"Many people jumped up and down that the war had started, just like the drum beat we are having now, there was enthusiasm everywhere, people were asking Ojukwu for weapons,\" he says. And then the refugee problems began. \"We never thought we would have such problem until when people started fleeing their homes to reside in schools, and the speed of the federal troops? They were moving fast to conquer more grounds which gave rise to the growth of refugees. Before we realized it, they had taken over Enugu. The city was then the capital of the newfound country.\" The refugees had nobody to take care of them, they were just in schools. There was hunger in the land, health hazards, food scarcity because the Nigerian government did not allow the Red Cross free passage to bring food to the people, so there was problem of malnutrition. There was economic blockage, \"recalls Nwogu.\" We had a lot of deaths, we lost more of our brothers and sisters to health hazards. Sincerely speaking, more people died out of starvation compared to the number killed by the federal troops. This was the most horrible part of the war. \"What is happening now is also the same build up to what happened during the civil war, but if you ask me, and a few of us who are veterans, we are telling the young ones to adopt all the available options. I don't want war, it's more than what you see.\" \"Unprepared, and without a bullet\" Josiah Akparandum, 80, is also a veteran of the civil war. He was 25 then and skipped conscription into the Biafran Army. He joined the war out of sheer enthusiasm and trained as an intelligence officer, such was in short supply at the time. After training for four months in Enugu, he took leave to see his family at Owerrinta, on the outskirts of Aba in present-day Abia State. He was too late. \"When I got to my village, l realized that my community had been taken over by the Nigerian Army, I couldn't find my parents nor any of my relatives anymore, because some were killed while others fled for their lives,\" Akparandum recalls. That was in 1968. \"I refused to return to work, I had to pitch my tent with the Biafran Army Bongo Battalion at Owerrinta Umuopkala axis to fight against the perceived enemies of my people where I was allowed to work in the intelligence unit,\" he says. As an intelligence officer, he wrote situation reports to the 65 Brigade through the battalion. He believes the war took Biafra unprepared. \"The then South easterners should not have gone for the war because they didn't prepared for it, it was just mere enthusiasm by the Igbos, we suffered so much hunger, ill health, no medical support anywhere, deaths at home and loss of many soldiers.\" \"South easterners lost the Biafran War mainly because of sabotage by Igbo civilians and some of our Biafran military men who hijacked food meant for distribution and sold them. A lot diverted monies meant to purchase arms, some ran away with the cash, there was serious sabotage during the Biafran war.\" In as much as the Igbo race is still complaining about marginalization, not having our own fair share of the dividends of democracy, I am not in support of going to war, but I believe Biafra will be won without a bullet. \"We saw hell' The bullet is something Emeka Amaefula doesn't want to contemplate.\" I don't want to wish even my worst enemy the type of experience we had during the civil war, \"says the 54-year-old, only a boy in 1966 when the war broke out. As it began to wind down in 1969, the memories still haunt him.\" Troops from the Nigerian Army were throwing bombs at the market. My mother and other women were not going to the market because Nigerian troops were always bombarding everywhere. Nothing was happening. Everywhere was in crisis. There was no food, no hospital and no utilities. \"We were starving. There were kwashiorkor and other terrible illnesses caused by poor feeding. My mother used to cook unripe paw-paw as yam. We cooked and ate that because there was no food. Our parents could not go to farm because of the war. We were hunting for lizards and rats to eat. It was a miracle I survived.\" We were able to gather insects, lizards, maggots and snails which scattered all over the bush. As we ran inside the bush we saw all these things and we started gathering them and it helped us a lot. They also got food handouts from non-government groups like Caritas, mostly milk and smashed egg yolk. \"We were served corn meal at a place called community centres. Schools were not functioning and some of schools were operating under trees. At the end of the war we were forced out of our homes and our properties were vandalised. My father trekked from Calabar to Ikeduru in Imo State. They were ferried across the river and those that didn't have the stamina to trek died on the way. Inestimable losses Teddy Chilaka worked with the International Red Cross Society during the war, assisting the wounded under harrowing circumstances. He recalls:\" Two of my brothers were killed in the war. You know what it means losing your beloved ones in such tragic situation. Then when the Nigerian military forces were coming closer and closer, we ran from one village to another. At the sound of aircraft, we had to hide under a tree and remove our white shirts in order not to be easily identified by those in the aircraft. Then we were sleeping in markets. It was like that until after two months. I left my parents and went with the Red Cross team to Cross River State, and from there we traveled to many places, carrying the sick, assisting the wounded, taking them to hospital. Then after the war, we came back and rejoined our families. We were lucky that my parents were alive because most of our neighbours were dead. \"It was after the war that people developed lack of regard for dead bodies. Before the war, when you saw people carrying a corpse, you would hide. But in the war condition, we were eating where dead bodies were laid, to the extent that people were no longer afraid of death or corpses.\" Life very difficult after return \"When we came back, we had no homes. We were haboured somewhere in our neighbourhood until we were able to get money to start life all over again for the family,\" he recalls. But he has a different understanding of ongoing agitations. \"The agitators I've come in contact with are not canvassing for war. They are saying that they will follow it up through referendum, like Southern Sudan did or the one that happened recently, Scotland under British government. Now, if the United Nations can organize a referendum, if they succeed, so be it, but if they do not succeed, they may continue to agitate until their intentions are achieved.\" Igbos are humiliated too much because of the effects of the civil war. In fact, the war made the Igbo to lose their identity. Nobody will agitate for war again. \"But Emeka Iro doesn't rule out a referendum. From Isuikwuato Local Government Area resident in Abakiliki, he was 10 when the war started. His father died in the war, leaving the 10-year-old to fend for himself even after the war. Says Iro:\" It was a bitter story and I won't like that to repeat itself. Like these people - the Indigenous People of Biafra (IPOB) and MASSOB members that are calling for referendum, if there should be referendum everybody will air his or her view and if it is something we cannot manage everybody we go their way but in a situation where it will lead us to a war, I will not like it. \"Emeka Okafor retired from public service, he was eight years old when the war started. He was among countless youths who joined the war effort in enthusiasm. He fought for three years and has marks on his body to show for it.\" I served the 14 Divisional Brigade headquarters, Owerri, 60 Brigade in Uguta, 72 Battalion in Egbema, among others. I rose to the rank of a lieutenant, \"he says.\" We were in Ogbidi when the war ended. As soon as it ended, we had no option than to go back to the basics. Personally, I was very disappointed that we lost out in a noble cause we all thought we could have won, \"he said. He returned to school after the war.\" Our mates in Nigeria were already in year one when we were still battling with the entrance examinations. I became more annoyed. But thank God, I eventually graduated and worked in both public and private organizations. But the disquiet hasn't died down, and there's talk of Biafra of the mind. \"What gave rise to this agitation is injustice and lack of fairness and equity. Check out the six geopolitical zones in the country. Northeast has seven states, others have six. It is only the Southeast that has five states. You know states is a basis for sharing the national cake,\" Okafor says. \"Just imagine what we have lost as all these years. On that ground, it is okay to at least recognize the fact that we have been shortchanged and cheated for long.\" A state like Bayelsa that produces the greatest volume of oil has only seven local government areas. So, if anything is being shared, you can imagine what they would end up getting. But Kano which has no single oil well has 44 local governments. I don't think that is fair. \"What does Biafra meant to Igbos? Ralph Obioha, a chieftain of the apex Igbo socio-cultural association, Ohanaeze Ndi-Igbo, was in the House of Representatives between 1979 and 1983, serving on the finance committee. Later, he joined pro-democracy groups in the aftermath of June 12. They triggered international sanctions on Nigeria to force the military back to the barracks. He would later found the Justice Party. But he is disturbed that the\" crusade' led by Nnamdi Kanu of the Indigenous Peoples of Biafra (IPOB) is anti-Igbo. \"I'm opposed to Biafra. It means nothing. It is against the Igbo. Anybody who is proposing or propagating it is anti-Igbo because Biafra is not in Igbo's vital interest. Nigeria is even too small for Igbo. The Igbo are all over the world excelling in every field of their chosen endeavours. How can we contract it? How can we reduce our space and size?\" says Obioha. He says the word Biafra is opium for young people who never witnessed the war and who are taking up social media to fan misconceptions. \"I'm appealing to the Igbo to see Nigeria as the place they will have to aspire to be their best, to take the abundant opportunities in this country. On the other hand, I'm asking other Nigerians to have another look about the Igbo. The Igbo are the engine room of Nigeria. They are really the true Nigerians because they are the ones who will leave their own shores and venture to other places and take those places as their home, build and develop such,\" notes Obioha. Air Commodore Luke Ochulor is retired but he fought on the Biafran side during the war. He later became the military administrator of Delta State. \"Most of us are worried but is not because we don't know what to say. We have been very inarticulate as far as this problem of agitation is concerned. The danger in this type of situation is that you may be caught in a web where the agitators, because they don't understand exactly what they are looking for, can regard you as an enemy, which makes it dangerous.\" But we all owe allegiance to the flag of the Federal Republic of Nigeria. After the civil war, we all agreed that the fight for Biafra was over. That's what makes a people and then we must stay together and build Nigeria to an extent that if any group wants to secede, we won't allow them. So when we look at the agitation for Biafra, we are of the view that youths in the Southeast zone of Nigeria have the right to protest if the condition in Nigeria is not good for them and their future. But they should not use the word, \"Biafra'. (0 Likes) Name"}, {"articleID": "2016093011_00891518_W", "names": {"Jeff Foster": ["Q21716120", "Q2571956", "Q3552863"]}, "date": "2016-09-30", "url": "http://app.com/story/news/local/land-environment/enviroguy/2016/09/30/nj-fall-deer-hunting/91158636/", "content": "Skip Ad Ad Loading...x Embed x Share Fish & Wildlife officials were able to help a doe who had been shot in the face with an arrow. STAFF VIDEO BY DOUG HOOD Buy Photo Deer hunting starts Oct. 1. (Photo: Susanne Cervenka/Asbury Park Press) Buy Photo WALL - The signs across from Denise Wilczewski's home seem to contradict each other. Bow and arrow deer hunting ahead. But also: No Hunting. For Wilczewski, of Wall, the mixed message is concerning. Technically, there's no deer hunting allowed in the section of Shark River Park that is across from her home. With bow deer hunting season opening Saturday, Wilczewski worries that the confusion she reads in the signs could result in either her family or her pets being injured by a stray arrow. OH DEER! Truck hits deer in Howell, deer attacks driver The root of Wilczewski's concerns stems from an attempt by Monmouth County Parks System to expand the archery hunting area in Shark River Park this summer. After concerns from neighbors like Wilczewski, Wall officials intervened, asking the county to return to old maps earlier this month that gave a greater buffer between the hunting area and homes. \"Who is going to be watching them? Who is going to be making them stay (within the hunting area)? Where's my safety in all this?\" Wilczewski said. \"It's not about hunting. It's about strange people around my house with weapons.\" Wilczewski isn't convinced enough is being done to protect residents. Her solution: Don't let hunters access the park from the side of the road by residential neighborhoods. Even though the original hunting boundaries were reinstated, hunters are now able to access the park directly across from Wilczewski's home. Monmouth County Parks spokeswoman Karen Livingstone says hunters always were able to do this. But, former Wall Mayor <mark>Jeff Foster</mark>, who helped Wilczewski with hunting concerns years ago, said hunters didn't access there because the parking was on another street. MORE HUNTS: Brick man wins $4500 hunting Giant Pythons Livingstone said that while hunters can access the park from any location, it doesn't give them the ability to hunt in off-limits areas. Wall administrator <mark>Jeff</mark> Bertrand said his police officers can take action if they see illegal hunting. \"If they are hunting in an area they aren't supposed to be hunting, our police officers will take action,\" he said. ENVIRONMENT: Lacey Rail Trail's fate to be decided soon Here are 4 things to know about deer hunting on county land: 1. Monmouth County expanded the hunting area this year in some parks to match state regulations. New Jersey changed its law in 2010 to reduce the distance hunters have to be from buildings from 450 feet to 150 feet. Hunters still have to be at least 450 feet away from schools. Livingstone said Monmouth County Parks System held off before implementing those changes to its hunting maps. Livingstone said the county parks system decided to move ahead with the change after seeing the state did not have problems with the new distance on its lands. 2. The rules are more strict for hunting on Monmouth County Park lands. Monmouth County allows hunting at 17 parks, but the rules here are different than on state land. Hunters have to be at least 18, licensed by the state and have taken safety courses to get a permit to hunt in one of Monmouth County Parks. And, all hunting has to be done from a tree stand. \"They're in one place. They're not meandering around,\" Livingstone said. Hunters are also given numbers that must be displayed on their tree stands and vehicles to identify who they are. 3. Ocean County allows hunting on some preserved lands. Hunting isn't allowed in Ocean County parks, but Ocean County does allow it on some of the land in its Natural Lands Trust Fund Program. County officials point hunters to its interactive maps to see what tracts allow hunting and what don't. Ocean County doesn't have additional permits to hunt on its land like Monmouth County; however, Monmouth officials remind hunters they need to follow state and local regulations for hunting in each area. 4. The number of deer harvested last year was down. Monmouth County's deer harvest at its parks was down about 9 percent in the 2015-2016 season compared to the prior season, according to the county's annual deer management report. In all, 840 permits were issued to hunters who hunted 9,798 days and harvested 426 deer in Monmouth County Parks. Statewide, the harvest numbers were down about 21 percent and down 14 percent across all of Monmouth County, a tally that includes more land than just the county parks. Susanne Cervenka: 732-643-4229; scervenka @ gannettnj.com. CONNECT TWEET LINKEDIN COMMENTEMAILMORE Read or Share this story: http: //on.app.com/2dJyy9c"}, {"articleID": "2017062919_01044196_W", "names": {"Baljit Singh": ["Q4851052", "Q4851053", "Q805002"]}, "date": "2017-06-29", "url": "http://www.theobserver.ca/2017/06/29/bluewater-health-adds-8-larger-rooms-accommodating-for-larger-families-and-indigenous-birthing-rituals", "content": "Bluewater Health adds 8 larger rooms accommodating for larger families and Indigenous birthing rituals By Jeremiah Rodriguez, Postmedia Network Thursday, June 29, 2017 3:31:57 EDT PM Previous Next First Nation dancers performing a dance during the drum ceremony at Bluewater Health Hospital inaugurating new multi-purpose rooms in maternity ward. (JEREMIAH RODRIGUEZ / THE SARNIA OBSERVER) Tweet Change text size for the story Print Report an error Forget waiting rooms, large families will now be able to comfortably fit in the same room where a mother goes in labour to recovery as Bluewater Health adds eight large unique birthing rooms Thursday. The new rooms, funded by Bluewater Health Foundation, allow for a new birthing experience where larger families, especially Indigenous ones, can stay in the same room where labour, birthing and then recovery all will take place. \"Indigenous population generally come with larger extended families and we really wanted to give them space,\" Sally Jenkins, director of the Maternal, Infant Child program, said. \"It's part of their culture and they have big celebrations.\" Marked by a ribbon-cutting and an Indigenous dancing and drumming ceremony, one of the rooms was dedicated and specially designed for Indigenous families but are open for everyone to use. They include wood panelling, a basin for cedar bath for purification and cleansing and a space for ceremonial smudging. \"The rooms are important because it keeps the families together. So they are bigger rooms and they don't get moved,\" Jenkins said. \"It's less disruptive.\" The room was also a part of one of the first joint projects between Aamijiwnaang First Nation Health Centre and Erie St. Clair LHIN's Indigenous advisory panel, said Sarah Plain from the health centre. The new rooms are all larger than both Bluewater's six birthing and 10 postpartum rooms and one of the eight is even larger to accommodate and hold larger families who might wish to take part in the traditional indigenous birthing ceremonies. This larger one is covered in covered in Indigenous art, decorations and a mounted moss bag behind glass not unlike the usable ones that First Nations peoples use to hold newborns, grandmother Liz Plain said. \"My daughter--who is going to be forty soon--I still have hers and has gone down in generations to my recently born grandson,\" Plain said. Although she mentioned that re-using one is rarer in most cases. Bluewater Health sees over a thousand births a year so the new rooms should be a massive help. \"We have a commitment to serving our diverse community and that's why we trying to provide an exemplary birthing experience for all the families in Sarnia and Lambton,\" Dr. <mark>Baljit Singh</mark>, Medical director of the MIC program said. The genesis for the new rooms happened during planning for renovations to create more birthing rooms two years ago, Bluewater reached out to the First Nations community as well as Dr. <mark>Singh</mark> along with staff and physicians all for their input. The rooms themselves were built within one year with the funds donated by the Bluewater Health Foundation."}, {"articleID": "2019030712_00029963_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2019-03-07", "url": "http://kutv.com/news/nation-world/guidelines-ask-agents-to-target-spanish-speakers-at-border", "content": "Guidelines ask agents to target Spanish speakers at border | KUTV Guidelines ask agents to target Spanish speakers at border by ELLIOT SPAGAT, Associated Press Thursday, March 7th 2019 VIEW ALL PHOTOS FILE - In this Jan. 25, 2019, file photo, a migrant who did not give his name looks on with his children as they wait to hear if their number is called to apply for asylum in the United States, at the border in Tijuana, Mexico. (AP Photo/Gregory Bull, File) SAN DIEGO (AP)--Border agents have been told to explicitly target Spanish speakers and migrants from Latin America in carrying out a <mark>Trump</mark> administration program requiring asylum seekers wait in Mexico, according to memos obtained by The Associated Press that reveal some inner workings of a top government priority to address the burgeoning number of Central Americans arriving in the country. The <mark>Trump</mark> administration launched the program in late January in what marks a potentially seismic shift on how the U.S. handles the cases of immigrants seeking asylum and fleeing persecution in their homeland. The program initially applied only to those who turned themselves in at official border crossings, but a memo from a division chief of the Border Patrol's San Diego sector says it expanded Friday to include people who cross the border illegally. The guidance includes instruction about various groups of immigrants who are not to be sent back to Mexico and instead go through the traditional asylum process in the U.S. immigration court system. They include pregnant women, LGBT migrants and people suffering medical issues. Authorities said previously that Mexican asylum seekers are excluded, as are children traveling alone. FILE - In this Feb. 19, 2019, file photo, migrants who are awaiting their chance to request asylum in the U.S. pass the time inside a shelter in Bachilleres gymnasium in Ciudad Juarez, Mexico. (AP Photo/Christian Torres, File) U.S. officials must check if the asylum seeker has any felony convictions and notify Mexico at least 12 hours before they are returned. Those who cross illegally must have come as single adults, though the administration is in talks with the Mexican government to include families. The program is being implemented as border arrests soared in February to a 12-year-high and more than half of those stopped arrived as families, many of them asylum seekers who generally turn themselves in instead of trying to elude capture. Guatemala and Honduras have replaced Mexico as the top countries, a remarkable shift from only a few years ago. The instructions say Mexican officials insist that no more than 20 asylum seekers are returned each day from San Diego to Tijuana, Mexico, on Monday through Saturday, underscoring challenges that the U.S. faces in trying to quickly ramp up one of its top border enforcement priorities and most significant changes to the U.S. immigration system of <mark>Donald Trump</mark>'s presidency. Authorities said Tuesday that more than 76,000 were stopped or apprehended at the Mexican border in February, more than double the same period last year. A memo on Tuesday to top Border Patrol officials in San Diego said the agency is under \"pressures to utilize this program as much as we can.\" Asylum-seeking families are typically released from U.S. custody immediately and allowed to settle with family or friends while their cases wind through immigration courts, which often takes years. Critics say that amounts to \"catch-and-release,\" which administration officials want to limit with the new Mexico program. In a statement, the Department of Homeland Security described the program as \"another tool available in the law\" to respond to the record numbers of Central American migrants arriving at the border in recent months. The agency said the program is being carried out in a \"thoughtful and deliberate manner\" that protects vulnerable migrants and is done in collaboration with the Mexican government. Two U.S. officials who were not authorized to discuss the internal guidance and spoke on condition of anonymity confirmed contents of the memos obtained by the AP. FILE - In this Dec. 3, 2018, file photo, migrants are escorted by a U.S. Border Patrol agent as they are detained after climbing over the border wall from Playas de Tijuana, Mexico, to San Ysidro, Calif. (AP Photo/Rebecca Blackwell, File) Explicitly targeting Spanish speakers and Latin Americans had not been previously disclosed, though some critics said it was no surprise considering that recent arrest numbers are largely Central Americans. Judy Rabinovitz, an attorney for the American Civil Liberties Union, said the criteria \"does smack of the same concerns we had in the Muslim ban,\" referring to <mark>Trump</mark>'s ban on travelers from several predominantly Muslim countries, which was eventually upheld by the Supreme Court. \"We know they are trying to get at Central American asylum seekers but to see it written there so blatantly is so disturbing,\" said Rabinovitz, whose organization was among those that sued the administration last month to block the policy. Secretary Kirstjen Nielsen has made the administration's \"Migrant Protection Protocols\" a top priority, working for months with Mexican counterparts to seal the broad outlines of an agreement in November. Testifying Wednesday in Congress, Nielsen said the U.S., working with Mexico, was exercising its authority to make people wait outside the country. \"All asylum seekers have the opportunity to present their case,\" she said. \"We're not turning anybody around.\" The effort has gotten off to a modest start amid mixed signals from Mexican officials and been limited to San Diego. Tonatiuh Guillen, who heads Mexico's immigration agency, told the AP that Mexico accepted 112 Central Americans during the first five weeks, including 25 children. Homeland Security has declined to release numbers. A Homeland Security official, speaking to reporters Friday on a conference call on condition of anonymity, said the administration planned to grow the effort exponentially across the border, including to people who cross illegally between border crossings. The official declined to say when or where but said it was likely to be expanded in the next few weeks. One memo obtained by the AP shows that it had been expanded on the same day. ___"}, {"articleID": "2014021806_00030562_W", "names": {"Michael Kirby": ["Q57496340", "Q6831890", "Q6831895"]}, "date": "2014-02-17", "url": "http://www.pri.org/stories/2014-02-17/un-report-details-atrocities-north-korea-are-painful-even-imagine", "content": "<mark>Michael Kirby</mark>, chairperson of the Commission of Inquiry on Human Rights in North Korea holds a copy of his report during a news conference at the United Nations in Geneva February 17, 2014. \"The gravity, scale and nature of these violations reveal a state that does not have any parallel in the contemporary world,\" the UN document states. The report is the result of a year-long Commission of Inquiry, organized by the United Nations Human Rights Council. Its purpose was to document what it calls the \"unspeakable atrocities\" committed in North Korea, with a view to holding the perpetrators accountable. Investigators accuse North Korea's government of systematic murder, torture, rape, forced abortions and deliberate starvation, as well as infanticide. The Commission heard from hundreds of witnesses. On Monday, it released the recordings of the public hearings. Witness Jee Heon A was jailed for attempting to flee across the North Korean border to China during a famine. gave her evidence through a translator before the Commission last year. She recalled how joy turned to terror one night, when a fellow inmate gave birth: \"Suddenly we heard these footsteps, and a security agent came in. And this agent said that - usually when a baby is born we would wash the baby in a bowl of water - but this agent told us to put the baby in the water upside down.\" Despite protests, the mother was beaten till she drowned her newborn baby. Witness Jee said she saw this multiple times. Most of the witnesses were refugees from North Korea. But the chair of the Commission, Australian jurist <mark>Michael Kirby</mark>, says he found them credible. \"If people are uncertain,\" he said, \"they can look at the public hearings, because it's on the Internet. It's accessible to people all around the world. They don't have to accept our word for it. They can look at these witnesses and make a judgment for themselves. Are they telling the truth or are they - as the North Korean government has said -\" human scum' who are fabricating these stories? \"<mark>Kirby</mark> said the North Korean witnesses who provided testimony were overwhelmingly brave and determined people who had suffered greatly and wanted to do something to make sure the next generation of North Koreans didn't have to suffer in the same way. The UN Commission had two objectives. First, it aimed to ascertain whether crimes against humanity were taking place in North Korea. And second, it sought to propose ways to make the perpetrators accountable. The Commission has recommended that prosecutors take these cases before the International Criminal Court in The Hague."}, {"articleID": "2013012410_00021460_W", "names": {"Sarah Brown": ["Q18880260", "Q19877460", "Q29570399", "Q2986943", "Q3950320", "Q47703783", "Q49250595", "Q56711704", "Q7422136"]}, "date": "2013-01-24", "url": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/9cF9ZLeOGZo/index.html", "content": "broken limbs, broken lives in northern mali by faith karimi, nima elbagir and ingrid formanek, cnn updated 5:07 am est, thu january 24, 2013 \"for the islamists, a human being is like an ant you squash,\" gao resident says once vibrant northern mali is now a shadow of itself, residents say \"home is not sweet anymore,\" timbuktu native says an offensive led by french troops is aimed at flushing out the militants bamako, mali (cnn)--there's no shortage of harrowing details on life under islamist militants in northern mali. public floggings for smoking a cigarette. brutal beatings for working as a radio journalist. broken hearts, broken limbs. \"for the islamists, a human being is like an ant you squash, like an animal you slaughter,\" said sedou sangare, a resident of the northern town of gao. gao was once a vibrant community filled with colorful camel caravans lazily strolling down the streets. bearded men and beaded women mingled freely. mali forces push back islamic militants is al qaeda close to calling mali home? france beefs up troop number in mali unrest, tension continue in mali malian govt. regains control of diabaly in mali, echoes of libyan intervention then the islamists rode in on rundown pickup trucks, armed to the teeth. they banned smoking, television, sports and music--a major setback for the northern region known for its \"festival au desert.\" they forbade unwed men and women from mixing in public. \"everybody panicked' though gao has a majority muslim population, most residents practice a more relaxed form of the religion. after militants started imposing a stricter form of islamic law, or sharia, throngs took to the streets in protest.\" when they declared sharia, everybody panicked, \"sangare said.\" christians, muslims, everybody fled. \"but the protests did not deter the militants, who publicly punished anyone who defied their teachings. in august last year, they forced a couple allegedly having an affair into two holes and stoned them to death as terrified residents quietly watched. lists of public and cruel punishments grew. floggings, executions, amputations--all in full view of aghast residents. the islamists compiled a list of unmarried mothers, saying sharia law condemns relationships outside marriage. a mayor--and his people--displaced mayor sadou diallo misses residents of his desert town of gao, most of whom fled to bamako when militants took over. about 229,000 malians have been displaced--mainly from kidal, timbuktu, and gao, according to the united nations. he is one of the displaced. a former respected community leader, trying to rebuild, just like his people. residents of the north, once proud of the vibrant desert communities near river niger, say the region is a shadow of what it used to be.\" home is not sweet anymore, \"said fadimata alainchar, a charity worker and native of nearby timbuktu. a recent visit to her hometown left her shaken.\" when entering the city, the signboard which was: \"welcome to timbuktu the city of 333 saints\" is now \"welcome to timbuktu, the gate to the application of the shariya,\" she said in a submission to cnn's ireport. the fabled city includes ancient tombs and wooden structures dating to the 15th century, a major part of its cultural heritage. and those are not the only changes. women who don't cover their bodies in accordance to the militants' sharia law, are imprisoned or raped, she said. their husbands, terrified of killings and amputations, don't utter a word. and gunshots are a common sound. \"if not to disperse women marching, it is to kill dogs that are barking and preventing the insurgents from sleeping,\" alainchar said. \"home has changed. before it was peace, joy and love. now it is shame, terror and abuse.\" \"i prefer dying\" stories of cruel punishments abound. radio journalist malik maiga faced the militants' wrath when he used his show to warn residents of public stoning or floggings. islamists singled him out, beat him up and left him in a cemetery. he survived and is among the displaced in bamako. maiga is not the only journalist targeted. last week, another radio journalist was killed, leading gao residents to retaliate by killing a militant leader. then there's suleyman and muktar, former truck drivers, accused of stealing. their limbs were hacked off. they are jobless and wander around the capital. \"i prefer dying to being like this,\" muktar said. \"my hand hurts, my heart aches. i only have god to ask for help.\" mali descended into chaos last year, when junior military members seized power in a coup. outraged soldiers accused the government of not providing adequate equipment to battle ethnic tuareg rebels roaming the vast desert in the north. tuareg rebels took advantage of the power vacuum after the coup and seized some parts of the north. a power struggle erupted between the rebels and local islamists, leading the latter to topple the tribe and seize control of two-thirds of northern mali, an area the size of france. hope amid chaos the crisis in the north has prompted fears that the al qaeda-linked extremists will set up shop there. it is \"a serious, ongoing threat,\" u.s. secretary of state hillary clinton warned wednesday. an offensive led by french and malian troops is aiming to stop the militants from using the vast desert area as a training ground for international attacks. \"we are in for a struggle. we cannot permit northern mali to become a safe haven\" for terrorists, clinton said. international troops from west african nations such as nigeria are joining the effort to restore some normalcy to the north. amid the strife and despair, citizens of the former french colony remain hopeful. and as french combat helicopters fly overhead, crowds below erupt into cheers. but in northern mali, at least for now, there is little to smile about. cnn's nima elbagir reported from bamako, mali, and faith karimi wrote from atlanta. cnn's <mark>sarah brown</mark> also contributed to this report"}, {"articleID": "2020011920_00178440_W", "names": {"Sam Bishop": ["Q10387701", "Q11305227"], "Mike Holmes": ["Q14950204", "Q20676979", "Q6847289", "Q6847291", "Q6847293"]}, "date": "2020-01-19", "url": "http://www.gamereactor.eu/fortnite/?sid=d3ca12781128fb71a08e079e90899f48", "content": "FORTNITE REVIEW. Written by Petter Hegevall on the 6th of April 2018 at 16 \"Fortnite for iPhone is something of a gem in terms of content and its free-to-play structure.\" NEWS. Written by <mark>Sam Bishop</mark> on the 16th of January 2020 at 09:32 The streamer has been virtually placed into the game, and you can find his gear in the item shop later today. NEWS. Written by <mark>Sam Bishop</mark> on the 6th of January 2020 at 14:36 It earned $1.8 billion USD, so it seems Epic's titan is showing no signs of slowing down anytime soon. NEWS. Written by <mark>Mike Holmes</mark> on the 3rd of January 2020 at 15:51 It might not have matched up to last year's total, but Epic's Battle Royale-inspired shooter is still head and shoulders above the rest. NEWS. Written by <mark>Sam Bishop</mark> on the 20th of December 2019 at 12:41 The feature has been enabled once again after being taken out, letting you play alongside a friend on the same console. NEWS. Written by <mark>Sam Bishop</mark> on the 17th of December 2019 at 09:00 To celebrate the Star Wars collaboration in Epic's game, the pair have partnered for a special something on Thursday. NEWS. Written by <mark>Sam Bishop</mark> on the 11th of December 2019 at 13:06 Epic is allegedly trying to skip the 30% cut Google gets from in-app purchases, while Google is staying firm with its own rules. NEWS. Written by <mark>Sam Bishop</mark> on the 10th of December 2019 at 13:30 Matt Gailer has allegedly asked Epic to stop offering the Pump It Up emote, and Epic wants to make clear that it's not an infringement of trademark or copyright."}, {"articleID": "2016051306_00638534_W", "names": {"Ryan Turner": ["Q28857180", "Q7384602"]}, "date": "2016-05-13", "url": "http://www.whitsundaytimes.com.au/news/team-motivated-to-secure-victory-by-lifetime-membe/3025721/", "content": "The Foundation Cup Slade Point and Cities will play for. Popular Stories VOTE: Whitsundays on track for solar farm Is that a knife in your pants? Man charged in Airlie Beach Mayor declares conflict of interest over marina Local Real Estate Cars For Sale RUGBY UNION: It's set to be a clash between the titans in the forward packs during tomorrow's Mackay Rugby Union game. That's the opinion oft Mackay Cities assistant coach <mark>Ryan Turner</mark> thinks. Cities playing Slade Point in the first match of a three game series for the Foundation Cup (right). \"Last night at training our head coach Bruce Heggie brought out the Foundation Cup,\" <mark>Turner</mark> said. \"He spoke passionately about what it means to him and to us and to Slade Point as the two founding clubs.\" Bruce is a life member of Cities. He also arrived in Mackay a few years after the start of the competition started. \"This makes him one of the longest serving members in Mackay Rugby Union.\" The cup is between the two founding teams of the competition. <mark>Turner</mark> is confident the game will be decided by both team's forward packs. \"They have a big and strong forward pack and we have one to match,\" he said. \"So we will let the big boys battle it out for awhile before letting the backline come into the game.\" <mark>Turner</mark> believes experience in the backline will be a defining factor in the game. \"Slade Point has a young backline and they are talented,\" he said. \"I just think our boys have the experience to get the edge over them.\" Cities are coming off their first loss of the season, losing 18-7 to the Whitsunday Raiders. \"We don't take losses well,\" <mark>Turner</mark> said. \"Therefore we will be looking to bounce back.\" Game times Bowen Mudcrabs v Kuttabul Camelboks at Bowen at 3.30 pm Brothers v Whitsunday Raiders at Whitsunday at 4.30 pm Mackay Cities v Slade Point at Cathy Freeman Oval at 3.30 pm cathy freeman oval Read More Login to follow citites Read More Login to follow foundation cup Read More Login to follow mackay Read More Login to follow rugby union Read More Login to follow slade point Read More Login to follow sport Read More Login to follow Topics: cathy freeman oval, citites, foundation cup, mackay, rugby union, slade point, sport 0 PRINT Join the Community. Get your local news, your way. Sign Up Stay Connected Update your news preferences and get the latest news delivered to your inbox. Update Now"}]