[{"date": "2014-08-30", "url": "http://primetime.unrealitytv.co.uk/glee-spoilers-lea-michele-celebrated-birthday-glee-finale-spoilers/", "content": "Home> American TV Shows> Glee finale spoilers & Lea Michele did THIS for her birthday! Glee finale spoilers & Lea Michele did THIS for her birthday! Tweet August 30th, 2014 by Emily H. Lea Michele is officially another year older. The superstar celebrated her 28th birthday in LA yesterday with some of her closest girlfriends, and thanks to Twitter, she brought us all along for the ride. The \"Cannonball' singer kicked off her birthday celebrations by tweeting,\" So excited for tonight's bday celebration dinner with yummy food by @ TheKitchyKitchen \", along with the pic below of <mark>Claire Thomas</mark>' book and a very special birthday menu. Four hours later, the party was well and truly underway when Michele snapped a pic from girl's night, calling her besties\" The best girlfriends in the world...\"From this pic, we know the star was celebrating with FOX Television Executive Stephanie Herman, actress Aubrey Dollar,\" Once Upon a Time' actress Joanna Garcia and Switch Boutique owner <mark>Jennifer Cohen</mark>. It was then time for the brunette beauty to blow out the birthday candles. \"A very Happy Birthday\" , she captioned the pic below, \"Thank you @ KitchyKitchen for such a delicious meal and this AMAZING cake!\". But it wasn't just her girls that were showing her some birthday love, Michele also got a whole lot of love from her fellow \"Glee' co-stars. <mark>Kevin McHale</mark> (Artie) tweeted,\" Happy birfffdayyyyy @ msleamichele \", <mark>Harry Shum</mark> Jr. (Mike) tweeted out\" Wishing @ msleamichele a very very very Happy Happy Joy Joy Birthday! \"and Darren Criss's (Blaine) 140 character note read;\" a very happy birthday to one of my favorite singers and drinking buddies @ msleamichele \". Mark Salling (Puck) also wished a happy birthday to his\" sister from another mister \", calling her\" cosmically wonderful \"and finishing up with\" Love you so much \"(aww!), whilst Jenna Ushkowitz (Tina) pulled double duty, wishing a happy birthday to her co-star & to her Mum .\" Happy Birthday to the beautiful ladies, @ msleamichele and my MOMMA!! #MamaUshkowitz Love u guys!!! \", she tweeted. The birthday lady was clearly feeling all the love. The\" Brunette Ambition' author thanked her friends and fans on twitter by posting, \"So much birthday love today...Makes me so happy...Thank you all for making this day so extra special!\" We're glad that our favourite lady got to enjoy her birthday with some downtime, because she's set to be pretty busy for the next few months. Michele and her co-stars are all expected to head back to the \"Glee' set next week to start filming on the sixth and final season of the hit. As we told you earlier this week, Michele's character, Rachel Berry, will be to rebuild the New Directions after her LA television career turned out to be a\" humiliating failure \". Michele and her co-stars are also expected to be filming some\" emotional scenes \"in the coming months, according to co-creator <mark>Ryan Murphy</mark>. We're not quite sure what those scenes will entail yet, and neither does <mark>Murphy</mark>... When asked last Monday if he had a plan for the series finale, <mark>Murphy</mark> admitted;\" I did. I don't anymore \", admitting that after the untimely passing of Michele's on and off-screen boyfriend Cory Monteith (Finn Hudson), the show's ending is still up in the air. <mark>Murphy</mark> admitted that\" having a happy ending and them [Berry and Hudson] both getting their dreams \", was the original way the story would end, but that\" the fact that that can't be is a big pain in all of our hearts. \"\"Glee' is expected to return to FOX next year. An official air date has not yet been confirmed. How would you like to see the series end? Tell us your thoughts, and your birthday wishes for Lea Michele, in the comments below. Leave a Reply Click here to cancel reply. Name (required) Mail (will not be published) (required) Notify me of follow-up comments by email. Notify me of new posts by email.", "articleID": "2014083101_00037606_W", "names": {"Claire Thomas": ["Q16231575", "Q29866814"], "Harry Shum": ["Q16905622", "Q348649"], "Jennifer Cohen": ["Q27811419", "Q6178217"], "Kevin Mchale": ["Q314427", "Q40444", "Q6396937"], "Ryan Murphy": ["Q1185730", "Q19979249", "Q21934130", "Q316844", "Q3453832", "Q6379482", "Q6380012", "Q7384364"]}}, {"date": "2014-09-01", "url": "http://abcnews.go.com/International/wireStory/zealand-gunman-kills-suspect-faces-charges-25208215", "content": "New Zealand Gunman Kills 2; Suspect Faces Charges A man suspected of killing two unemployment-office workers and seriously wounding a third in a South Island town was charged Tuesday with murder. <mark>John Tully</mark> was arrested Monday evening following a seven-hour manhunt that kept a town on edge. <mark>Tully</mark> made his first court appearance Tuesday on two charges of murder and one of attempted murder. He did not enter a plea and remained in custody. Police spokeswoman Lisa-Marie Brooks said a police dog unit apprehended <mark>Tully</mark>, 48, near a lake shortly after 5 p.m. following an extensive manhunt in the South Island town of Ashburton. She said <mark>Tully</mark> was being treated for minor dog-bite injuries and police were still searching for the weapon used in the shootings. Earlier, police had urged residents to remain inside their homes as they searched an area near the town's river and stormed a house that turned out to be empty. <mark>Tully</mark> had been interviewed in recent weeks by the local newspaper about his struggles finding somewhere to live and had also written to lawmakers. The incident began about 10 a.m. when police said a man entered a Work and Income New Zealand office and started shooting. A witness said the man was wearing a black balaclava and shot at two women, according to the Ashburton Guardian newspaper. Other witnesses told the paper the man was carrying a shotgun that may have been sawed down and fled on a bicycle. Ministry of Social Development Chief Executive <mark>Brendan Boyle</mark> said all three victims worked for the agency. \"We are all devastated by the deaths of two of our colleagues in the shocking attack,\" <mark>Boyle</mark> said in a statement, adding \"our thoughts and prayers\" are also with the third victim who was being treated at an area hospital. Lawmaker <mark>Winston Peters</mark> said in a statement that <mark>Tully</mark> had emailed his political party on Aug. 14 about the difficulty of finding a house to live in. \"We replied immediately and also followed up,\" <mark>Peters</mark> said. \"However, the emails kept bouncing back .\" <mark>Tully</mark> last month told the Ashburton Guardian that he had previously worked in Australian mines, had returned to his hometown and had ended up living in a tent after being unable to secure government-assisted accommodation. Ashburton Mayor Angus McKay said the town was very community-minded and the tragedy would affect many lives: \"It just hits home real hard,\" he said, according to The New Zealand Herald newspaper. click here to upgrade your browser in order to comment.", "articleID": "2014090123_00042792_W", "names": {"Brendan Boyle": ["Q18684945", "Q4960876"], "John Tully": ["Q57115306", "Q6261390"], "Winston Peters": ["Q1396178", "Q5625319"]}}, {"date": "2014-09-02", "url": "http://overlawyered.com/2014/09/september-2-roundup-4/?utm_source=rss&utm_medium=rss&utm_campaign=september-2-roundup-4", "content": "Police have traced the crime wave to a single micro-neighborhood in the California capital [Sacramento Bee] \"Adam Carolla Settles with the Patent Trolls\" [Daniel Nazer/EFF, Reason, related eight days earlier and previously] eBay takes on Landmark in the E.D. of Texas [Popehat] Frank Furedi on law and the decline in childrens' freedom to roam [U.K. Independent] On \"ban the box\" laws re: asking about job applicants' criminal records, it's sued if you do, sued if you don't [Coyote] Fake law firm websites in U.K. sometimes parasitize the real ones [Martha Neil, ABA Journal] What C. Steven Bradford of the blog Business Law Prof reads to keep up (and thanks for including us on list); As applications to renounce U.S. citizenship mount, many related to FATCA, our government hikes fee for doing so by 422% [<mark>Robert Wood</mark>, Forbes] Tweet Tagged as: accolades, California, child protection, criminal records and hiring, Eastern District of Texas, eBay, patent trolls, United Kingdom", "articleID": "2014090205_00036724_W", "names": {"Robert Wood": ["Q1265326", "Q15052600", "Q19325396", "Q21165763", "Q22098434", "Q24566698", "Q43915973", "Q51586292", "Q7351216", "Q7351217", "Q7351220", "Q9185475"]}}, {"date": "2014-09-02", "url": "http://www.reuters.com/places/africa/article/2014/09/02/us-health-ebola-idUSKBN0GX1IH20140902", "content": "MONROVIA (Reuters) - The United Nations said on Tuesday the spread of the deadly Ebola virus in West Africa was causing food shortages in one of the world's poorest regions and the U.S. Centers for Disease Control and Prevention warned the disease was threatening the stability of stricken countries and their neighbors. Doctors in Liberia were out on strike as they struggled to cope with the worst outbreak of Ebola on record, while the global aid organization Medecins Sans Frontieres (MSF) said 800 more beds for Ebola patients were urgently needed in the Liberian capital Monrovia alone, while in Sierra Leone highly infectious bodies were rotting in the streets. Governments and aid organizations have scrambled to contain the disease, which according to the World Health Organization (WHO) has killed more than 1,500 in West Africa since March. In an address to United Nations member states, MSF President Joanne Liu said, \"Six months into the worst Ebola epidemic in history, the world is losing the battle to contain it .\" She said aid charities and West African governments did not have the capacity to stem the outbreak and needed intervention by foreign states. Slamming what she called \"a global coalition of inaction,\" Liu called for the urgent dispatch of field hospitals with isolation wards and mobile medical laboratories. MSF, also known as Doctors Without Borders, said biological disaster response teams were needed to support West Africa's buckling healthcare systems. There are no approved Ebola vaccines or treatments, but as hospitals and Ebola treatment centers battled to contain the disease and tend to the sick and dying, the U.S. Department of Health and Human Services said a federal contract worth up to $42.3 million would help accelerate testing of an experimental Ebola virus treatment being developed by privately held Mapp Biopharmaceutical Inc.. The agency said in a statement that Mapp, based in San Diego, California, would manufacture a small amount of its ZMapp drug, which uses antibodies manufactured in tobacco plants, for early stage safety studies and animal studies needed to prove its effectiveness and safety in people. ZMapp is one of several treatments for Ebola under development. The drug, although never tested in humans, gained attention this summer when two American aid workers who contracted Ebola in Liberia were cured after receiving it. Their physicians said they did not know if the drug helped. Human safety trials are due to begin this week on a vaccine from GlaxoSmithKline Plc GSK. L and later this year on one from NewLink Genetics Corp NLNK. O. The Ebola epidemic in West Africa could infect more than 20,000 people and spread to more countries, the World Health Organization warned last week. With a fatality rate of 52 percent, the death toll stood at 1,552 as of Aug. 26. Cases of Ebola have been reported in Liberia, Sierra Leone, Guinea, Nigeria, Senegal, and Democratic Republic of Congo. The cases in Congo, which include 31 deaths, are thought to be a separate outbreak and not related to the West African cases. AMERICAN STRICKEN, MEDICAL STAFF STRIKE U.S. missionary organization SIM USA said on Tuesday that an American doctor treating obstetrics patients at the ELWA hospital in Monrovia had tested positive for Ebola. The doctor, who was not working in the hospital's Ebola treatment center, was in an isolation ward at the hospital and responding well so far, SIM said on its website. At Monrovia's John F. Kennedy Medical Center (JFK) scores of staff went on strike to protest against working conditions and unpaid bonuses. Amid shortages of equipment and trained staff, more than 120 healthcare workers have died in West Africa in the Ebola outbreak. \"Health workers have died (fighting Ebola), including medical doctors at...JFK and to have them come to work without food on their table, we think that is pathetic,\" <mark>George Williams</mark>, secretary general of the Health Workers Association of Liberia, told Reuters. <mark>Williams</mark> said healthcare workers at JFK, the country's largest referral hospital, had gone unpaid for two months. The Liberian strike came a day after healthcare workers at the Connaught hospital in Sierra Leone's capital Freetown held a one-day protest over pay and conditions. Staff there returned to work on Tuesday after they said the government settled a backlog of hazard pay and agreed to raise the weekly risk bonus to $100 from $40 for nurses working in Ebola wards and members of burial crews. Separately, the Liberian government began offering a $1,000 bonus to any healthcare workers who agreed to work in Ebola treatment facilities. The World Health Organization and other international bodies have rushed to support healthcare systems in affected countries, but additional staff and resources have been slow to arrive. PRICES SURGE, OBAMA ADDRESSES WEST AFRICANS In Monrovia, Medecins Sans Frontieres said its new ELWA 3 center, which has 160 beds, was overflowing with patients. \"Every day we have to turn sick people away because we are too full,\" said Stefan Liljegren, MSF coordinator at the site. Further pressuring the ability of the region's governments to spend money on healthcare, the epidemic has put harvests at risk and sent food prices soaring in West Africa, the U.N. Food and Agriculture Organization (FAO) said. The agency issued an alert over food security for Liberia, Sierra Leone and Guinea, which are most affected by the outbreak. Restrictions on people's movements and establishment of quarantine zones to contain the spread of the haemorrhagic fever have led to panic buying, food shortages and price hikes. \"Even prior to the Ebola outbreak, households in some of the most affected areas were spending up to 80 percent of their incomes on food,\" said <mark>Vincent Martin</mark>, head of an FAO unit in Dakar coordinating the agency's response. \"Now these latest price spikes are effectively putting food completely out of their reach .\" The director of the U.S. Centers for Disease Control and Prevention, Dr. Thomas Frieden, said he expected the outbreak to accelerate and urged governments to act now. \"We're likely to see significant increases in cases. Already we have widespread transmission Liberia. In Sierra Leone, we're seeing strong signs that that will happen in the near future,\" he said. Frieden said the outbreak was the first epidemic of Ebola the world has ever known, meaning it was spreading widely in society and \"threatening the stability\" of affected and neighboring countries. Frieden, who has been briefing U.S. President Barack Obama on the outbreak, said there was still a window of opportunity, but \"that window is closing .\" \"We need action now to scale up the response. We know how to stop Ebola. The challenge is to scale it up to the massive levels needed to stop this outbreak,\" he said. \"The virus is moving faster than anyone anticipated. We need to move fast .\" In a video message to West Africans in Liberia, Sierra Leone, Guinea and Nigeria and released on YouTube, Obama affirmed the United States' support in the fight against Ebola and attempted to dispel some myths about how it is spread. here \"Ebola is not spread through the air like the flu. You cannot get it from casual contact like sitting next to someone on a bus,\" he said. Instead, he said the most common way people become infected \"is by touching the body fluids of someone who is sick or has died from it, like their sweat, saliva or blood, or through a contaminated item, like a needle .\" Obama said that was why so many people were becoming infected while caring for Ebola patients at home, and he urged people who felt sick to get prompt treatment because half of the people who become ill recover. \"Stopping this disease won't be easy, but we know how to do it. You are not alone,\" Obama said. To try to ease the strain on their economies, Ivory Coast, which closed its borders with Liberia and Guinea last month, announced on Tuesday it would open humanitarian and economic corridors to its two western neighbours. The death toll from an Ebola outbreak in the Djera region of northern Democratic Republic of Congo has risen to 31, Minister of Health Felix Kabange Numbi told Reuters on Tuesday. The outbreak in Congo's Equateur province is thought to be separate from the West African epidemic. (Reporting by <mark>James Harding</mark> Giahyue; Additional reporting by Stephanie Nebehay in Geneva, Isla Binnie in Rome, Umaru Fofana in Freetown, We welcome comments that advance the story through relevant opinion, anecdotes, links and data. If you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. Views expressed in the comments do not represent those of Reuters. For more information on our comment policy, see http: //blogs.reuters.com/fulldisclosure/2010/09/27/toward-a-more-thoughtful-conversation-on-stories/ Cannot there be airdrops of food, water and other daily hygiene necessities? Cannot money be transferred into one of the Liberian banks to cover the unpaid salaries and other overdue payments of the health workers who risk their very lives to contain this pandemic? What is wrong with this world? Where is the humanitarian sensibility in each leader of each country? What does this say about our collective commitment to those in dire need? Actress Jennifer Lawrence contacts authorities after nude photos hacked Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance, and interactive television platforms. Thomson Reuters journalists are subject to an", "articleID": "2014090223_00062897_W", "names": {"George Williams": ["Q11310861", "Q16236651", "Q19664444", "Q21001058", "Q23838005", "Q3760673", "Q552019", "Q5546363", "Q5546368", "Q5546370", "Q5546374", "Q5546375", "Q5546376"]}}]