[{"articleID": "2018091700_00014315_W", "names": {"Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"]}, "date": "2018-09-16", "url": "http://abc11.com/risk-to-life-is-rising-with-florences-floodwaters-governor-says/4257798/", "content": "share tweet share email \"Risk to life is rising' with Florence's floodwaters, governor says SHARE: share tweet share email SHARE share tweet share email ABCNews MARK OSBORNE Sunday, September 16, 2018 07:34 PM Florence weakened to a tropical depression Sunday, but that is cold comfort to residents in North Carolina who have seen over 2 feet of rain and are now battling major-river flooding and possible tornadoes .\" Flood waters are still raging across parts of our state, and the risk to life is rising with the angry waters, \"North Carolina Gov. <mark>Roy Cooper</mark> said at a midday news conference. He added that\" this storm has never been more dangerous than it is right now \"in certain areas of the state. Some parts of the state were getting 2 to 3 inches an hour, <mark>Cooper</mark> said .\" That's enough to cause flooding in areas that have never flooded before until now, \"<mark>Cooper</mark> said. Since the storm made landfall as a hurricane in North Carolina on Friday morning, it has been blamed for 16 deaths. Officials said that 10 people died in North Carolina and six in South Carolina. The death toll included a person killed Sunday in a pickup truck crash near Gilbert, South Carolina, that occurred when the motorist drove through standing water on a roadway, according to the South Carolina Department of Public Safety. Hundreds of people have been rescued by local authorities, Cajun Navy volunteers and the U.S. Coast Guard since Friday morning. New evacuation orders were issued Sunday for a mile-long area along the Cape Fear and Little rivers in North Carolina. More than 700,000 households and businesses in the state were still without power as of Sunday afternoon, an estimated 15,000 people were in shelters, and 171 primary roads were closed including parts of two interstates, authorities said. The state Highway Patrol advised people to stay off the roads, saying troopers responded to 48 collisions from Saturday night and into Sunday morning. Adding to the threat of further flooding, a tornado watch was in effect for most of Sunday for the areas of Wilmington, Fayetteville, Myrtle Beach, Jacksonville, Oak Island, and Florence .\" It's bad right now, and we do expect it to get worse over the coming days, \"Michael Sprayberry, director of North Carolina Emergency Management, said on ABC's\" This Week \"Sunday .\" We know that's going to be a major mission going forward because this is historic and unprecedented flooding. \"Major river flooding a threat Catastrophic flooding unfolded Sunday morning in parts of North Carolina, exceeding flooding 19 years ago in Hurricane Floyd. the National Weather Service said. One waterway, the Cape Fear River, rose 15 feet in just 24 hours from early Saturday to early Sunday. It reached flood stage in Fayetteville, North Carolina, where mandatory evacuation orders were issued Saturday .\" This will be very dangerous flooding over the next few days, \"the National Weather Service said in a tweet Sunday morning. The Coast Guard head echoed this view .\" My biggest concern is the rising water, \"Schultz said on\" This Week, \"noting that Wilmington, North Carolina, got 24 inches of rain and could potentially get 15 inches more .\" We're looking at a high water situation, \"he said .\" The rivers could potentially crest here into the early part of this week. So, we have not seen the worst of the flooding. \"Schultz was among the emergency officials who briefed President Trump on the storm on Saturday .\" We talked about the massive risk the storm poses, catastrophic flooding, prolonged flooding, \"he said of the briefing .\" We gave him an update on response capabilities in the theater and the president is completely leaning in. Anything the feds need to do to support the local, the state partners here in South Carolina and North Carolina. We feel fully supported. \"The Lumber River, near Lumberton, North Carolina, rose to into major flood stage Sunday. It is expected to reach a level very near the record Hurricane Matthew set in 2016. Mandatory evacuations were issued for South Lumberton on Saturday. Major river flooding is also expected on some rivers from southern Virginia to northern South Carolina. The Northeast Cape Fear River, near Chinquapin, North Carolina, will rise above record flood levels set by Hurricane Floyd in 1999. This will cause devastating flooding across much of Onslow County with travel made impossible and many homes completely flooded. The Neuse River, both near Goldsboro and Kinston, North Carolina, will reach major flood stage late Sunday and into Monday. The Waccamaw River, near Conway, South Carolina, will rise near record levels by the end of the week. Florence has dropped a tremendous amount of rain in eastern North Carolina, with a widespread 20 to 30 inches reported already. Radar is estimating that some areas between Wilmington and New Bern, North Carolina, have received over 30 inches of rain. These are some of the latest rainfall totals as of 11 p.m. on Saturday:--Swansboro, N.C.--30.59 inches--Newport/Morehead City, N.C.--25.20 inches--Elizabethtown, N.C.--20.17 inches--Jacksonville, N.C.--16.13 inches--Conway, S.C.--9.90 inches--Myrtle Beach Airport, S.C.--6.74 inches Florence is now the third storm to set a tropical cyclone state rainfall record in just the last 12 months. Harvey dropped 60.58 inches of rain last year in Texas, setting the state's new record. Lane just last month dropped 52.02 inches of rain in parts of Hawaii, breaking the state record. The 30.59 inches that have fallen in Swansboro sets a new record for North Carolina. Florence also currently stands as the sixth-highest tropical cyclone rainfall total across the U.S. for records dating back to 1950. Heavy rain spreads inland Heavy rains bands are still coming onshore in eastern South Carolina and North Carolina on Sunday morning. Some of the heavier bands have shifted toward Fayetteville, Charlotte, and Raleigh. Torrential rain is causing inland flooding with major roadways, including large portions of I-95, closed. An additional 6 to 10 inches of rain is still possible along the southeast border of North Carolina and South Carolina. Life-threatening, catastrophic flash flooding is likely over the southern to central Appalachians from western North Carolina into western Virginia and eastern West Virginia. Torrential rain will cause flash flooding and increase the risk of landslides in the higher terrains. Florence is still moving very slowly inland. The track shows Florence moving west through Sunday, and then gradually turning north by Monday. Florence will likely become a remnant low within 36 hours. Even though Florence is weakening, it will still bring significant rainfall inland to the Appalachians before moving toward the Northeast on Tuesday. Totals could exceed 4 inches locally for inland New York and Massachusetts .\" People need to heed the warnings from their local emergency management experts and stay in safe ground, \"the Coast Guard's Adm. Schultz said. Related Topics: abc news national SHARE: share tweet share email (Copyright © 2018 ABC News Internet Ventures .) Top Stories WATCH LIVE: Florence flooding is most dangerous right now, Governor says New Bern flooding: Aerial footage shows extent of Florence's damage LIST: Tropical Storm Florence school closings Florence updates: 17 dead, including 11 in NC Cape Fear River at flood stage, expected to pass Matthew Florence flooding: Monitoring potential flooding in your area with FIMAN Exclusive first look at Atlantic Beach after Hurricane Florence Floodwaters rise in North Carolina, evacuations begin in Lillington Show More Officials say there may be sewage in Florence floodwaters VIDEO: Florence damage in Wilmington Rescue crews from all across the country ready to assist North Carolina VIDEO: Sanford Dam breaches in Boiling Spring Lakes More than 632,000 remain without power as crews work to restore service More News"}, {"articleID": "2014111917_00050789_W", "names": {"Jason Collins": ["Q2317740", "Q6161884"], "Nicky Morgan": ["Q10502518", "Q580375"], "David Laws": ["Q333663", "Q5236379"]}, "date": "2014-11-19", "url": "http://www.pinknews.co.uk/2014/11/19/islington-council-to-fly-transgender-flag-for-day-of-remembrance-tomorrow/", "content": "Enter your email address to receive our daily LGBT news roundup Islington Council will fly a flag from the Town Hall tomorrow Islington Council will fly a transgender flag from the top of town hall tomorrow, to mark the Transgender Day of Remembrance. The Transgender Day of Remembrance is held across the world every year on November 20world, 226 transgender people were reportedly killed in the past 12 months - though statistics are unreliable, as most countries do not hold accurate data on transgender victims. Islington Council will fly the transgender flag over town hall for the day, ahead of its remembrance event. Labour councillor Osh Gantly - who is currently the only openly trans elected politician in the UK - said: \"Transgender Day of Remembrance provides an opportunity for the entire community to remember, mourn and honour the transgender and gender-diverse people who have been murdered in the last year and the years before .\" In many countries today it is still the case that transgender and gender-diverse people are routinely murdered, beaten, bullied and discriminated against. \"It is vital that we stand-up for transgender rights as they are human rights .\" I am very proud to be an Islington Labour councillor that happens to identify as transgender. \"But I am especially proud that, for the first time ever, our council has chosen to mark Transgender Day of Remembrance by flying the transgender flag over Islington Town Hall .\" I'm fortunate that I live in London, one of the greatest cities in the world, which is in the main a welcoming place to be a transgender or gender-diverse person. But transphobic hate crimes do take place in our great city every day. \"I'm pleased to say that Islington Council is committed to tackling hate crime in all its forms .\" I know that, as a Labour council, we stand together for all our residents and today we proudly proclaim that includes our transgender and gender-diverse residents. \"Liverpool council also plans to fly the flag over its Town Hall tomorrow. NBA's first out gay player <mark>Jason Collins</mark> retires US: First same-sex marriage licence issued in South Carolina Republican congresswoman: I backed LGBT equality after my son came out as trans Trans radio host Stephanie Hirst: I went public with transition to help inspire others Welsh Lib Dems to lead landmark debate on transgender issues Mexico City: Legislative assembly passes pro-trans gender recognition bill UK: Man ordered to stand trial after allegedly abusing trans woman in supermarket Watch: Trans MMA fighter destroys claims she has an\" unfair advantage' in sport UK: Family accused of forcing daughter out of company for being transgender What happened after a single dad asked strangers for advice on helping his son come out as gay WATCH: University of Nottingham hockey team strip off against homophobia EastEnders star cut from Children in Need quiz after offending S Club 7 with anti-gay joke Comment: The truth about being a gay 16-year-old at an all boys boarding school France: Former President Sarkozy condemned by key allies for call to scrap equal marriage US: First same-sex marriage licence issued in South Carolina Islington Council to fly transgender flag for Day of Remembrance tomorrow NBA's first out gay player <mark>Jason Collins</mark> retires Stonewall CEO:' I know of gay footballers in the Premier League' Nicola Sturgeon becomes Scotland's First Minister Republican congresswoman: I backed LGBT equality after my son came out as trans Comment: Uganda's LGBT community is in limbo pending a new anti-gay bill Trans radio host Stephanie Hirst: I went public with transition to help inspire others WATCH <mark>Nicky Morgan</mark> presents PinkNews Award to the naked rowers WATCH <mark>David Laws</mark> presents Lynne Featherstone with PinkNews Ally of the Year Award Watch Conchita Wurst performs at the United Nations Watch Cartoon Network debuts first ever gay characters - but censors the kiss Interview Lord Cashman on Thatcher's hair, returning to EastEnders and equalising...British man jailed for \"homosexual acts': I don't support a travel boycott against Morocco Meet someone who isn't male or female and wants a new type of passport"}, {"articleID": "2018020815_01194499_W", "names": {"John Rankin": ["Q15429094", "Q20203593", "Q374620", "Q42634605"]}, "date": "2018-02-08", "url": "http://www.roanoke.com/news/world/wire/uk-disappointed-at-bermuda-s-same-sex-marriage-ban/article_922c1670-79e2-5cb4-94f8-297fa3277a70.html", "content": "LONDON (AP)--The U.K. government expressed disappointment Thursday that Bermuda has abolished same-sex marriage, but said it would have been wrong to overturn the decision by the British island territory. Bermuda's Senate and House of Assembly passed legislation replacing same-sex marriage with domestic partnerships in December, and the island's U.K.-appointed governor, <mark>John Rankin</mark>, signed it into law Wednesday. British Prime Minister Theresa May's spokesman, James Slack, said Britain was \"seriously disappointed\" by the decision, which reverses a 2017 court ruling legalizing gay marriage. Receive today's headlines in your inbox with our daily news email SUBSCRIBE TODAY But he said it would not have been right for Britain to block the move. He said the bill \"has been democratically passed by the Parliament of Bermuda, and our relationship with the overseas territories is based on partnership and respect for their right to democratic self-government .\" Some opposition politicians criticized the government, saying Britain should have intervened to prevent the change, which they called discriminatory. Labour Party foreign affairs spokeswoman Helen Goodman said the legislation was \"shameful\" and \"turns same-sex couples into second-class citizens .\" Foreign Office Minister Harriett Baldwin said \"after full and careful consideration\" the government had decided not to block the legislation. She said Britain's powers to intervene with laws in its overseas territories \"can only can be used where there is a legal or constitutional basis for doing so, and even then only in exceptional circumstances .\" "}, {"articleID": "2011082000_00041725_W", "names": {"Dan Ellis": ["Q1159058", "Q466579"]}, "date": "2011-08-20", "url": "http://ducks.ocregister.com/2011/08/19/hiller-hopes-vertigo-is-a-one-time-thing/70497/", "content": "as a mystifying case of symptoms related to vertigo continued to take hold over him, jonas hiller tried not to think about what kind of effect they could do his career. but those thoughts were impossible for the ducks' top goaltender to keep out of his mind whenever he sat in the waiting room for the many appointments to diagnose and deal with the ailment that was affecting his head. as he proclaimed himself symptom-free on friday and fit for training camp next month, hiller talked about the mental strain he was under over the last three months of a potential vezina trophy-caliber season that was interrupted for good. \"normally i'm used to where if i want something really bad, i can just try a little harder and somehow i get there,\" hiller said from his off-season home in his native switzerland. \"and i think in this situation, it was frustrating for me. i was pushing and trying and trying. i couldn't just push and it was gone .\" it was kind of like a new situation for me. i don't think i was thinking that was it with my career or anything. but sure it's tough. you have a lot of time to think in not playing. in the doctor's office and waiting for the appointment, you have a lot time to think about that and what's going to happen and everything. \"i always tried to not think about it too much .\" hiller is certainly in a much better frame of mind these days as he reported that his on-ice training with swiss elite league club sc bern has gone well, noting that the intensity of practices has been similar to what he'd go through on a regular day with the ducks as \"they're starting the season pretty soon here so they're already getting game ready .\" though the real test of whether he's at full strength won't come until he's in camp and playing in the preaseason, hiller said he's at the point where he'd feel comfortable competing in game action. \"i haven't played games for quite a while now so i can't make any promises,\" he said. \"i'm feeling great in practice. i see the puck well and everything. i'm definitely looking forward to be back playing as soon as possible .\" after being shut down for good during the first-round playoff loss to nashville, hiller was ordered by the team to rest in a depature from the failed process to work through the symptoms. the fourth-year nhl goalie didn't do much outside of off-ice training until last month, either spending time at home or vacationing in hawaii with his girlfriend. on july 10, hiller finally returned to the ice as he took part in the camp run by his mentor, former ducks and current toronto maple leafs goaltending coach francois allaire. he acknowledged that he felt nervous but said he cleared that hurdle. \"i went back on the ice and felt pretty good right off the bat,\" he said. \"i had some better days and some days where i was a little so-so. but i never felt like i was off a lot .\" while he said he's progress to where \"i pretty much have to say i am where i used to be\" , hiller remains a bit frustrated that no definitive cause for his vertigo has been found even after visiting with doctors in switzerland where he felt more at ease talking to them in his native german tongue. \"i got some second opinions, but nobody could really exactly tell me where it was coming from,\" he said. \"everybody was saying it could be a few things, but nobody was really able to put their finger on it. it was frustrating, especially for the future. i wish i would know what exactly happened to prevent it from coming up again .\" i definitely hope it's a one-time thing. if it is, i don't really care what actually caused it. \"in hiller's absence, the ducks responded to the implosion of backup curtis mcelhinney by getting ray emery and <mark>dan ellis</mark>. both stabilized the club's goaltending and helped the club make the playoffs with emery ultimately starting five of the six postseason games against the predators. despite the strong performance by emery, the ducks decided not to re-sign the veteran in a sign that they were hopeful that hiller would be able to regain his spot at the lead goalie with the returning <mark>ellis</mark> as his backup. hiller gave the club the kind of news it wanted to hear, at least until he hits the ice when camp opens. you can follow any responses to this entry through the rss 2.0 feed. you can skip to the end and leave a response. pinging is currently not allowed. user agreement. keep it civil and stay on topic. no profanity, vulgarity, racial slurs or personal attacks. icemancometh: hiller said he did see doctors in switzerland and had tests done but got same feedback as here that no root cause of symptoms were found. icemancometh: hiller on practice sessions:\" i see the puck well and everything. i'm definitely looking forward to be back playing as soon as possible. icemancometh: will blog on it in a bit but hiller said he'd be comfortable playing a game feeling the way he is now. extended rest helped him mentally. icemancometh: rt @ anaheimducks: hiller: \"i haven't played games for awhile, but i'm feeling great in practice. i'm seeing the puck well and i'm lookin ..."}, {"articleID": "2009101402_00010694_W", "names": {"Robert Barnes": ["Q20751527", "Q21293016", "Q9310720"]}, "date": "2009-10-14", "url": "http://washingtonpost.com/wp-dyn/content/article/2009/10/13/AR2009101300782.html?hpid=topnews", "content": "former enron chief executive jeffrey k. skilling was sentenced in october 2006 to 24 years and four months in prison. (by brett coomer--associated press) file - in this may 25, 2006 file photo, former enron executive jeff skilling leaves the courthouse after the verdict in his fraud and conspiracy trial in houston.the u.s. supreme court said monday, oct. 12, 2009, it will consider throwing out the convictions of former enron chief executive officer jeff skilling for his role in the collapse of the one-time energy giant. (ap photo/pat sullivan, file) jurors in the fraud and conspiracy trial of skilling and enron chairman kenneth l. lay are shown in a sketch. comments that include profanity or personal attacks or other inappropriate comments or material will be removed from the site. additionally, entries that are unsigned or contain \"signatures\" by someone other than the actual author will be removed. finally, we will take steps to block users who violate any of our posting standards, terms of use or privacy policies or any other policies governing this site. please review the <mark>robert barnes</mark> washington post staff writer wednesday, october 14, 2009 the supreme court said tuesday that it will review former enron chief executive jeffrey k. skilling's conviction to see if he received a fair trial in the hothouse atmosphere of houston following the collapse in 2001 of the nation's seventh largest company. it will also consider whether federal prosecutors properly applied the \"honest services\" statute that led to skilling's conviction and 24-year prison sentence. in granting the case, the justices put aside a request from the federal government that they at least delay a decision on skilling until after the court had dealt with two other cases that challenge the honest services law. the justices will hear those two cases in december, and skilling's case sometime after the first of the year. one of the cases involves the conviction of another corporate giant, media magnate conrad black. skilling was president of enron and briefly its chief executive before the company, the nation's largest energy trader, sought bankruptcy protection in late 2001. in 2004, he was indicted in the collapse along with kenneth l. lay, the company's longtime chairman. thousands of houstonians lost their jobs and life savings when enron went under, and skilling's petition to the court said the company officers were vilified. \"the devastating impact\" of enron's collapse resulted in \"blistering daily attacks on the executives--principally skilling and lay--deemed responsible for enron's demise,\" said skilling's petition, adding that the men were compared to \"al qaeda, hitler, satan, child molesters, rapists, embezzlers, and terrorists and encouraged to\" go to jail' and \"to hell .'\" but the district judge presiding over the trial said the coverage did not unfairly prejudice the jury ultimately seated to hear the case. skilling was convicted in may 2006 of conspiracy, securities fraud, insider trading and lying to auditors. he was cleared of some other charges. a federal appeals court upheld the judge's decision to have the trial in houston, as well as skilling's convictions. it did send the case back for resentencing. (lay was also convicted but died months later of heart disease .) the court is as likely to be interested in the question that skilling's case raises about the honest services statute, which gives wide leeway for federal prosecutors to go after actions of public and private officials who deprive constituents or their employers of the \"intangible right of honest services .\" the statute has become a favorite tool in pursuing both public corruption cases as well as those involving corporate greed. in skilling's case, solicitor general elena kagan said that the law was properly applied, but also that skilling would have been convicted without it. but the law has engendered a backlash from those who say it is used too freely. one of those critics is justice antonin scalia, who criticized his colleagues earlier this year for not accepting a different case involving the statute. he said the law \"invites abuse by headline-grabbing prosecutors in pursuit of local officials, state legislators and corporate ceos who engage in any manner of unappealing or ethically questionable conduct .\" since then, the court has accepted the petition of black, who was accused of defrauding his company, hollinger international, and a former alaska legislator accused of drumming up business from a company that had dealings with the state, even though no state law appears to have been violated. the federal appeals courts have interpreted the law to cover widely divergent levels of conduct. the skilling case asks whether the law requires proof of personal gain. black's case raises the issue of whether there must be proof that the defendant knew there would be economic harm to his company. and the alaska case deals with whether a public official has violated his duty under state law. the supreme court full coverage of the u.s. supreme court, including key cases and nominations to the nation's highest court."}, {"articleID": "2019052508_00262293_W", "names": {"Rory Stewart": ["Q328892", "Q55363983"], "Theresa May": ["Q264766", "Q30161835"], "John Mcdonnell": ["Q10379941", "Q47348016", "Q55196720", "Q6247660", "Q6247662", "Q6247664", "Q6247666", "Q694695"], "Liam Fox": ["Q16300641", "Q332374", "Q6539597"], "Jeremy Hunt": ["Q333533", "Q929730"], "Steve Baker": ["Q10379857", "Q15973457", "Q1991602", "Q2346812", "Q260111", "Q6380444", "Q7611849", "Q7611850", "Q7611852", "Q9345785"]}, "date": "2019-05-25", "url": "http://www.bromsgroveadvertiser.co.uk/news/national/17664618.tory-battle-intensifies-as-new-candidates-emerge/", "content": "Tory battle intensifies as new candidates emerge By Press Association 2019 Tory leadership front runner Boris Johnson (David Mirzoeff/PA) 0 comment The Tory leadership race has exploded into life, with Cabinet minister <mark>Rory Stewart</mark> launching an attack on Boris Johnson and Health Secretary Matt Hancock entering the contest. As the battle heated up, International Development Secretary Mr <mark>Stewart</mark> said he could not serve in a government led by Mr Johnson because of his stance on a possible no-deal exit from the EU. The comments came as Labour insisted it would force a Commons vote of no confidence in the new prime minister as soon as possible. As Tory tensions rose, Mr <mark>Stewart</mark> told BBC Radio 4's Today programme a no-deal exit would be \"damaging and dishonest\". He said: \"I could not serve in a government whose policy was to push this country into a no-deal Brexit .\" I could not serve with Boris Johnson. \"I spoke to Boris, I suppose, about two weeks ago about this and I thought at the time he had assured me that he wouldn't push for a no-deal Brexit .\" So, we had a conversation about 20, 25 minutes and I left the room reassured by him that he wouldn't do this. \"But, it now seems that he is coming out for a no-deal Brexit .\" Mr <mark>Stewart</mark> said there was no majority in the Commons for no deal, stating: \"I think it would be a huge mistake. Damaging, unnecessary, and I think also dishonest .\" Former foreign secretary Mr Johnson, who has emerged as the bookies' favourite, stressed he would be prepared to back a no-deal departure to ensure the UK leaves the EU on October 31. Mr Hancock said he was running for leader because the party needed to look to the future and attract younger voters. He said he would take a different approach to try and get Commons support for a Brexit deal than the one <mark>Theresa May</mark> used. He said: \"She didn't start by levelling with people about the trade-offs .\" I think it is much, much easier to bring people together behind a proposal if you are straightforward in advance. \"Mr Hancock warned against an early election, saying:\" Some of my contenders <mark>may</mark> say that if they don't get their preferred option, whether it be no deal or something else, then they'll have a general election. \"I put it to you that would be a disaster for the country and it would risk Corbyn by Christmas .\" Asked if Labour would force a Commons no confidence vote in the new prime minister when they take office, shadow chancellor <mark>John McDonnell</mark> told the Today programme: \"Yes .\" Because we believe any incoming prime minister in these circumstance should go to the country anyway and seek a mandate. \"Mr <mark>McDonnell</mark> said that Labour needed to have a new\" conversation \"about the way forward on Brexit. International Trade Secretary <mark>Liam Fox</mark> has refused to rule himself out as a Tory leadership candidate. Asked if he would stand, Dr <mark>Fox</mark> told the BBC:\" Well, I don't think it's likely to happen, but, as you say, it's an unusual contest. \"Dr <mark>Fox</mark> said:\" It is best for us to leave with an agreement. \"But, I think that it is possible, and probably increasingly likely now, that we could leave without a deal because I think there's a limited patience from the European Union with Britain's constant delay .\" Work and Pensions Secretary Amber Rudd, who has said she will not stand for the top job, told the BBC: \"I would be very concerned about somebody who is too enthusiastic about no deal .\" It is very important that whoever takes this on looks for a solution and tries to work to find where the majority of the House (of Commons) is. \"More than a dozen Tories are understood to be considering a bid, with Foreign Secretary <mark>Jeremy Hunt</mark> indicating he will be in the race and former work and pensions secretary Esther McVey putting herself forward\" as a future leader \". (PA Graphics) The new Tory leader looks set to take over as prime minister at the end of July after Mrs <mark>May</mark> finally laid out a timetable for her exit from Downing Street. The timetable for the contest will see nominations close in the week of June 10, with MPs involved in a series of votes to whittle down what is set to be a crowded field to a final two contenders. Tory party members will then decide who wins the run-off. Hosting a radio call-in on LBC, Ms McVey said:\" I'll put my hands up here, I better declare an interest straight away. I have put myself forward as a future leader. \"And Sir Graham Brady quit as the leader of the 1922 Committee--a position which gave him a significant role in the Prime Minister's departure--in order to consider a leadership bid. Environment Secretary Michael Gove--who stood in the 2016 leadership race and <mark>may</mark> consider another bid--said Mrs <mark>May</mark>\" deserves our respect and gratitude \". Home Secretary Sajid Javid, who had a\" frank \"discussion with Mrs <mark>May</mark> about her deal on Thursday, said\" nobody could have worked harder or had a greater sense of public duty \". Leading Eurosceptic <mark>Steve Baker</mark> said he is\" considering \"running. 0 comment"}, {"articleID": "2008091708_00016578_W", "names": {"Tony Kelly": ["Q16195148", "Q7822698", "Q7822699", "Q7822700", "Q7822701", "Q7822703"]}, "date": "2008-09-17", "url": "http://starobserver.com.au/news/2008/09/17/oxford-st-bashing-victim-in-a-coma/1775", "content": "help find missing youths one man is in an induced coma at st vincent's hospital and two men are facing court following another weekend of violence on the once-golden mile. senseless and opportunistic could describe the oxford st attacks that don't appear to be alcohol-related or directly homophobic, rather a culture where thuggery and drugs prevail. the first altercation on sunday morning took place between two strangers in front of a fast food outlet on the strip. police claimed a man parked in a hyundai getz began verbally insulting the victim before getting out of the vehicle, punching him to the ground and fleeing. the next day miranda police arrested and charged a 21-year-old umina man at kurnell with the assault. later that evening a 22-year-old woman from new york was mugged walking along brisbane st between oxford st and harmony park by a man allegedly armed with a pair of scissors. a group of onlookers came to her defence but the attacker fled, police claim. a man carrying a pair of scissors and a small amount of cannabis was arrested by kings cross police after a description of the attacker was circulated via police radio. the man has been charged with robbery and possession of a prohibited drug. nsw police declined to comment further on the assaults or arrests. acon president mark orr said he was concerned about any and all levels of violence in the oxford st precinct because it was home to a large segment of the glbt community and any violence impacts on residents and visitors. \"violence begets violence and we don't want to see these problems escalating any further and turning oxford st and the surrounding areas into a place which attracts ever more violent behaviour. we're working closely with local police and the city of sydney on a range of projects and programs to address the issue of violence generally and homophobic violence in particular .\" for example, we're very concerned at the number of fast food outlets opening on the strip that operate late at night, allowing people to sober up and then continue drinking or just keeping people hanging around on the footpath. this behaviour presents a threat to the safety of residents and visitors to the area and we support police efforts to curb this level of activity. \"new police minister <mark>tony kelly</mark> first rode into the nsw upper house on an anti-gun law and order offensive, but even without deadly weapons assaults on oxford st show no sign of slowing. <mark>kelly</mark> said he was honoured to be taking on the role of police minister and would ensure officers had the\" resources and support they needed to continue the good work they are already doing \".\" it will also be my job to ensure the trust and confidence people rightly have in the nsw police force is maintained in the future, \"he told reporters. gamma gamma, a support group for married men who have sex with men, meets in secure confidential and non-sexual surroundings at the acon building, 9 commonwealth st, surry hills, on the first and third wednesdays of each month at 8pm. there is also a support line, monday-friday 6-10 pm, on 9267 4000. the aids trust sydney food and wine fair will be held on saturday 1 november in hyde park north and will this year feature the addition of a product market to highlight the quality of food and harvest. go to www.aidstrust.com.au for more information or to buy coupons in advance. the sydney gay and lesbian business association hosts lemons with a twist on the first friday of each month and fruits in suits on the third thursday of each month, at slide. lovers of gay cinema are encouraged to become a member of queerscreen, sydney's premier gay and lesbian film festival body. subscribe get regular news updates delivered direct to your inbox via the sydney star observer's email alerts. one man is in an induced coma at st vincent's hospital and two men are facing court following another weekend of violence on the once-golden mile. senseless and opportunistic could describe the oxford st attacks...the grooms wore yarmulkas sydney couple scott whitmont and christopher whitmont-stein will make australian history this sunday when...mandy's getting extra dirty remember christina aguilera's hit dirty - with sweat dripping all over her body and...four moore for clover it was an election campaign fuelled by one-upmanship on everything from environmentalism to safety ..."}, {"articleID": "2019032307_00006457_W", "names": {"Mike Young": ["Q17144212", "Q19664774", "Q3308595", "Q6849349", "Q6849350", "Q6849351", "Q6849355"], "Jay Wright": ["Q3807514", "Q6167365"]}, "date": "2019-03-23", "url": "http://www.actionnewsjax.com/sports/tipping-off-wofford-murray-state-aim-for-big-march-moment/933342281?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "TIPPING OFF: Wofford, Murray State aim for big March moment By: AARON BEARD, AP Basketball Writer Updated: Mar 23, 2019 - 2:48 AM Loading...TIPPING OFF: Wofford, Murray State aim for big March moment RALEIGH, N.C. (AP) - The first teams will earn their spot in the NCAA Tournament's Sweet 16 on Saturday - and the upstarts are right there near the front of the line. There are eight double-digit seeds left in the field of 32 entering the second round, three of those coming from outside the power conferences: No. 12 seeds Murray State and Liberty, and No. 13 UC Irvine. And then there's Wofford, the headliner in a batch of schools aiming to make their own enduring March Madness moment with a marquee matchup against Kentucky. That game comes Saturday in the Midwest Region, along with Murray State's date with Florida State in the West bracket in an eight-game schedule. And make no mistake: there's plenty of belief for a pair of teams that haven't lost a game in months. \"You don't want to get out of character and try to do things that you can't do or do things that you're uncomfortable doing just to try to show that you can do something,\" Wofford guard Fletcher Magee said. \"We want to stay within ourselves, play our game, and we feel that if we do that, we can be right there and we can compete with them .\" Murray State (28-4) rolled in its first-round game behind Ja Morant, who had a hello-national-audience performance with 17 points, 16 assists and 11 rebounds in a rout of fifth-seeded Marquette. That was the Racers' 12th straight win. They haven't lost since falling to Jacksonville State on Jan. 31. Morant (24.4 points, 5.7 rebounds) leads the country with 10.2 assists per game, and the Racers have three other double-figure scorers. The biggest challenge will be handling Florida State's size and length. \"We know Ja will get all of the attention,\" said Shaq Buchanan, averages 13.1 points. \"Like, it's amazing, but at the same time, we know how to handle that. And we know everybody's going to be keyed in on him (Saturday), so we just going to make plays for him like we did against Marquette .\" As for Wofford, the seventh-seeded Terriers (30-4) have been a popular pick. All four losses came against power-conference teams that made the NCAA Tournament and they have won 21 straight games since falling to Mississippi State on Dec. 19. The Southern Conference champions, who rolled past Seton Hall in the first round, entered the tournament ranked No. 13 in the NCAA's new NET rankings - ahead of names like LSU, Auburn and Kansas - after claiming their first AP Top 25 ranking in program history. Behind Magee's incredible shot-making ability, the Terriers rank ninth in KenPom's adjusted offensive efficiency (118.8 points per 100 possessions). They're facing a second-seeded Kentucky team missing leading scorer and rebounder PJ Washington due to a foot sprain. \"I can't imagine a team more confident, and that's earned,\" Wofford coach <mark>Mike Young</mark> said, adding: \"They may whip our tail, but it will not be because my kids are scared. They'll come out ready to fight .\" Here are some of the other storylines for Saturday's schedule: TILLIE'S HEALTH Gonzaga has been waiting for Killian Tillie to look healthy. The 6-foot-10 junior had a season-high 17 points on 7-for-8 shooting in the first-round rout of Fairleigh Dickinson for the top-seeded Zags, who face No. 9 seed Baylor in the West Region. Tillie had been sidelined into January with a foot injury, then reinjured his foot and didn't return until the West Coast Conference Tournament. Now he's another weapon for a team that leads KenPom's adjusted offensive efficiency rankings (125.4 points per 100 possessions). \"It makes us much more versatile,\" Zags coach Mark Few said, adding: \"He's got an incredible feel for the game and basketball intuition .\" CHAMPS IN ACTION It's been a while since reigning national champion Villanova was a lower seed playing to pull an upset. The sixth-seeded Wildcats face No. 3 seed Purdue in the South Region's only game Saturday and they are 3 1/2 - point underdogs. It will be the first time the Wildcats have played a higher seed before the Final Four since beating top-seeded Kansas in a 2016 regional final on the way to coach <mark>Jay Wright</mark>'s first national championship. Villanova had been a No. 1 or No. 2 seed for five straight tournaments. BIG TEN BATTLE It's not ideal, but the Big Ten has a second-round East Region matchup with No. 2 seed Michigan State and 10th-seeded Minnesota. The Spartans won the only meeting in February, and the rematch will cost the Big Ten one of its seven teams still alive in the tournament. \"However the NCAA Tournament does the seeds and the matchup is how they do it,\" Minnesota's Amir Coffey said. \"We have no control over that. We just have to be ready for whoever we are matched up against .\" THE REST OF THE SCHEDULE The schedule includes another 2-vs-10 matchup in the West with Michigan against Florida, respectively. In the East, third-seeded LSU meets sixth-seeded Maryland. And in the Midwest, there's an intriguing matchup between fourth-seeded Kansas and fifth-seeded Auburn - two teams that have experienced wild swings in their seasons. Kansas was preseason No. 1 in the AP Top 25 yet dealt with a series of injuries and off-court issues that have left coach Bill Self with a very different roster. Meanwhile, Auburn peaked at No. 7 in December, fell out of the rankings, then made a late-season surge to win the Southeastern Conference Tournament. ___ Follow Aaron Beard on Twitter at http: //www.twitter.com/aaronbeardap ___ More AP college basketball: https: //apnews.com/MarchMadness and http: //www.twitter.com/AP_Top25 Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"articleID": "2016070114_00696655_W", "names": {"Donald Trump": ["Q22686", "Q27947481"]}, "date": "2016-04-09", "url": "http://college.usatoday.com/2016/04/09/chalking-pro-trump-messages-set-off-storms/", "content": "Supporters in Madison, Miss., on March 7, 2016. (Photo: Justin Sellers, The Clarion-Ledger) If three is officially a trend, chalking is now a trendy--and highly controversial--way for <mark>Donald Trump</mark> fans to show their love. This week, two schools--the University of Illinois at Urbana-Champaign and the University of Tennessee at Chattanooga--jumped into the chalking fray, joining the headlines made in March at Emory University with pro-Trump messages scrawled on campus grounds. Following a now-familiar timeline, the chalked messages appeared and the storms followed. At UTC, it hit the student government. Hailey Puckett, a member of a UTC student government coalition called Empower UTC who chalked \"<mark>Trump</mark> 2016\" on April 5, was asked to resign by fellow coalition members. pic.twitter.com/qjcJUAvRuO--EMPOWER UTC (@ EMPOWER_UTC) April 6, 2016 Empower' s stance did not go over well with some students, who responded along the lines of this tweet. I am personally calling for the impeachment of @ UTCSGA PRESIDENT @ EMPOWERPhillip after his blatant violation of free speech and civil rights--Austin Sanders (@ ASanders_22) April 6, 2016 The next day, EMPOWER UTC members Phillip Stubblefield and Mikayla Long posted apologies. Stubblefield noted that his words had been poorly chosen. \"I fully support every individual' s First Amendment rights and the senator-elect has every right to support any candidate of her choosing,\" he wrote. I feel that I have to express my honest opinions and that I have to represent all students. pic.twitter.com/m7JxhpM3HF--Phillip Stubblefield (@ EMPOWERPhillip) April 6, 2016 Long apologized and noted that \"Hailey was asked by EMPOWER to resign from SGA because she disregarded her responsibility as an elected senator to represent the students that elected her. Her statement,\" Super proud of our art work, but I have a feeling half of UTCs campus is going to hate it' does not show that she is currently prepared to represent students effectively. That is the sole reason we asked her to resign. \"Regarding recent events: pic.twitter.com/xITD8o1SxH--Mikayla Long (@ mikaylasheaIong) April 6, 2016 Puckett' s message was later washed off by students who then chalked the message,\" Black UTC supports unity \"in its place, reports student newspaper The University Echo. Since, then, the newspaper says, other messages have been chalked, ranging from\" Power C 4 <mark>Trump</mark>, \"to\" UTC supports Hailey, \"\"UTC supports Black UTC\" to a \"<mark>Trump</mark> 2016 .\" The school has released a statement saying in part, \"Diversity--including diversity of thought--is a core value of the University of Tennessee at Chattanooga. This idea was put to the test when a question of free speech developed between several groups of students ....The heated dialogue that resulted was unfortunate but serves as a teachable moment for our students and the incoming student government leadership .\" The UTC administration has not played a role in this debate. \"Also on April 5, chalk messages were written on the University of Illinois at Urbana-Champaign campus. They included,\" They have to go back #Trump, \"\"Build the Wall\" and \"<mark>Trump</mark> Deportation Force .\" The messages appeared near the campus' Latina/Latino Studies building. In an email sent to the school community and obtained by USA TODAY College, the school said in part, \"We value discourse while also recognizing that offensive speech is protected by the First Amendment. The best recourse to speech with which we disagree is more speech .\" In a statement to the campus, Jonathan Inda, chair of the Department of Latina/Latino Studies, called the chalking \"unacceptable .\" \"It is no coincidence that a\" <mark>Trump</mark>' message was scrawled in front of the Department of Latino/Latina Studies building. Such a message was not intended to advance political dialogue, but to psychologically wound, breed intolerance, and create an atmosphere of insecurity for Latina/os on campus, \"he said. At Emory, students claimed they were\" in pain \"after seeing\" <mark>Trump</mark> 2016 \"tagged on campus. The drawings led a few dozen students to protest the school's administration building, The Emory Wheel reported. RELATED: Emory students protest pro-Trump slogans, say they don' t feel safe Emory University Students Afraid Of This And It Proves Millennials R Pansies | RedState https: //t.co/iCilyeF7DS pic.twitter.com/0DGsjB96jQ--Elisabeth (@ 10thAmendment) March 24, 2016 Students at various schools have expressed their concerns with the drawings Just came out of lunch and there' s\" <mark>trump</mark> \"written in chalk all over my school nice--Cam ✘ (@ qc_cam) April 7, 2016 Hearing that someone supports <mark>Donald Trump</mark> is like hearing nails on a chalk board .:))))))--Ethan' s girl ❤ ️ (@ AbbyMcGuire31) April 7, 2016 The <mark>trump</mark> wars are getting out of hand on campus y' all. The chalk art is just getting outrageous--Keimi Elizabeth (@ keimibeth) April 7, 2016 Someone wrote <mark>Trump</mark> 2016 all big in chalk in the yard--sydney jetmore (@ liilTokyo) April 7, 2016 Alexandra Samuels is a student at University of Texas at Austin and a USA TODAY College breaking news correspondent. Filed under: News Tagged: Alexandra Samuels, backlash, chalking, <mark>Donald Trump</mark>, universities"}, {"articleID": "2019111400_00011243_W", "names": {"Andre Durand": ["Q4754772", "Q518409"]}, "date": "2019-11-14", "url": "http://networking.itbusinessnet.com/2019/11/ping-identity-reports-third-quarter-2019-results-provides-outlook-for-full-year-2019/", "content": "ARR was $206.7 million, up 23% from the prior year period Third quarter total revenue was $61.8 million, of which 93% was subscription revenue Company raised $187.5 million in Initial Public Offering DENVER--(BUSINESS WIRE)--Ping Identity Holding Corp. (\"Ping Identity,\" or the \"Company\" ) (NYSE: PING), a pioneer in Intelligent Identity, today announced its financial results for the quarter ended September 30, 2019. \"Our strong third quarter results were driven by Ping Identity's Intelligent Identity leadership in securing customer, employee, partner and IoT identities across the enterprise market, and bolstered by market-wide momentum for identity solutions that enable digital transformation and simultaneously enhance security,\" said <mark>Andre Durand</mark>, Ping Identity's founder and Chief Executive Officer. \"It's been a momentous year to date for both Ping Identity and our clients. We completed our initial public offering, successfully launched several new identity solutions for securing users, applications and APIs across the hybrid cloud, strengthened our leadership in the customer use case, and landed many new Fortune 1000 corporations. Enterprises continue to partner with Ping Identity to modernize their legacy identity systems and accelerate their cloud transformation and API first initiatives. All of this creates momentum toward our main goal, which is to enable seamless user experiences while balancing the need for security and privacy in a real-time world .\" Financial Highlights for the Third Quarter of 2019 ARR: Ending ARR in the third quarter of 2019 was $206.7 million and represented a 23% increase compared to ending ARR of $167.7 million in the same period last year. Ping Identity defines ARR as the annualized value of all subscription contracts as of the end of the period. Revenue: Total revenue was $61.8 million, an increase of 45% year-over-year. Subscription revenue was $57.5 million, an increase of 49% year-over-year. Cash Flow: Cash provided by operations was $8.5 million in the nine months ended September 30, 2019 compared to $23.7 million in the nine months ended September 30, 2018. Unlevered Free Cash Flow was $8.1 million for the nine months ended September 30, 2019, inclusive of contingent deal consideration in the amount of $4.9 million, compared to $26.9 million in the nine months ended September 30, 2018. Dollar-Based Net Retention Rat e: For the period ended September 30, 2019, Ping Identity's dollar-based net retention was 115%. The Company has achieved 115% or higher for each of the past eight quarters. Please refer to the section titled \"Use of Non-GAAP Financial Information\" and the tables within this press release which contain explanations and reconciliations of the Company's non-GAAP financial measures. Recent Business Highlights Ping Identity recently secured a notable customer win with a large global entertainment and ticketing platform, which purchased and is implementing Ping Identity's hybrid cloud platform to replace a homegrown solution. This is a core part of the enterprise's digital transformation strategy to establish a more personalized relationship with their customers and a better user experience for event access. Ping Identity closed the largest PingIntelligence for APIs deal in company history at over $500,000 in ARR, driving further innovation around API security. The Company's industry leadership and accomplishments have been validated recently by the likes of Gartner, KuppingerCole, InfoSec, and CRN. For example, Ping Identity currently scores 92% on \"Willingness to Recommend' by Gartner Peer Insights and was positioned as a Leader in Gartner's August 2019 Magic Quadrant for Access Management. Ping Identity hosted Identify conferences in Chicago, New York, Europe and Asia Pacific, and announced the launch of PingCentral to help customers automate centralized identity services. Ping Identity is now a NYSE-listed company (ticker symbol: PING) after completing its IPO on September 19, raising $187.5 million. The majority of net proceeds were subsequently used to pay down debt .\" We are pleased with our strong third quarter performance, driven by our continued leadership position in the enterprise market due to the flexibility of our platform and our ability to address multi-generational IT realities, \"stated Raj Dani, Chief Financial Officer of Ping Identity .\" Total ARR grew 23% versus the prior year period, which we believe provides the best representation of the underlying health of the business. We've also been able to effectively balance our commitment to invest in growth and innovation with profitability by delivering operating efficiencies that have resulted in a net loss improvement from $5.6 million in the third quarter of 2018 to a net loss of $0.6 million this quarter. Adjusted EBITDA margins were 22% in the quarter, and year-to-date cash flows from operations as well as Unlevered Free Cash Flow were positive. We believe there are significant whitespace opportunities within our existing customer base by adding identities and use cases and selling new solutions, as we further penetrate an overall $25 billion market opportunity for Identity Access Management software and hybrid cloud solutions. \"Fourth Quarter Financial Outlook Ping Identity provides the following expected financial guidance for the quarter and fiscal year ending December 31, 2019: Quarter Ending December 31, 2019: Total ARR of $222.1 million to $223.1 million Total Revenue of $64.7 million to $66.7 million Unlevered Free Cash Flow of $(11.9) million to $(10.8) million Year Ending December 31, 2019: Total ARR of $222.1 million to $223.1 million Total Revenue of $239.3 million to $241.3 million Unlevered Free Cash Flow of $(3.8) million to $(2.7) million, inclusive of contingent deal consideration in the amount of $4.9 million Conference Call Details In conjunction with this announcement, Ping Identity will host a conference call today, November 13, 2019, at 5:00 p.m. Eastern Time to discuss its financial results. To access this call, dial 844.583.4551 (domestic) or 825.312.2270 (international) and reference conference ID 3167765 to the operator. A live webcast as well as the replay of the conference call will be available on the Investor Relations page of the Company's website at investor.pingidentity.com. A replay of this conference call can also be accessed by dialing 800.585.8367 (domestic) or 416.621.4642 (international) until November 20, 2019. The replay passcode is 3167765. Use of Non-GAAP Financial Information In addition to Ping Identity's results determined in accordance with generally accepted accounting principles in the United States (\"GAAP\" ), the Company believes the following non-GAAP measures presented in this press release and discussed on the related teleconference call are useful in evaluating its operating performance: non-GAAP gross profit, non-GAAP operating expenses, non-GAAP net income, non-GAAP net income per share, unlevered free cash flow, and adjusted EBITDA. Certain of these non-GAAP measures exclude stock-based compensation, depreciation and amortization expense, loss on extinguishment of debt and acquisition-related expenses. Ping Identity believes that non-GAAP financial information, when taken collectively, may be helpful to investors because it provides consistency and comparability with past financial performance and assists in comparisons with other companies, some of which use similar non-GAAP financial information to supplement their GAAP results. The non-GAAP financial information is presented for supplemental informational purposes only, and should not be considered a substitute for financial information presented in accordance with GAAP, and may be different from similarly titled non-GAAP measures used by other companies. A reconciliation is provided herein for each non-GAAP financial measure to the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures. Forward-Looking Statements In addition to historical consolidated financial information, certain statements in this press release and on the related teleconference call may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 that involve substantial risks and uncertainties. All statements other than statements of historical fact included in this press release and on the related teleconference call are forward-looking statements. These statements may include words such as \"anticipate,\" \"estimate,\" \"expect,\" \"project,\" \"plan,\" \"intend,\" \"believe,\" \"may,\" \"will,\" \"should,\" \"can have,\" \"likely\" and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events. For example, all statements Ping Identity makes relating to its estimated and projected costs, expenditures, cash flows, growth rates and financial results or its plans and objectives for future operations, growth initiatives, or strategies are forward-looking statements. All forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those that the Company expected. Specific factors that could cause such a difference include, but are not limited to, those disclosed previously in the Company's other filings with the SEC which include, but are not limited to: the Company's ability to adapt to rapid technological change, evolving industry standards and changing customer needs, requirements or preferences; Ping Identity's ability to enhance and deploy its cloud-based offerings while continuing to effectively offer its on-premise offerings; the Company's ability to maintain or improve its competitive position; the impact on Ping Identity's business of a network or data security incident or unauthorized access to its network or data or its customers' data; the effects on the Company's business if it is unable to acquire new customers, if its customers do not renew their arrangements, or if it is unable to expand sales to its existing customers or develop new solutions that achieve market acceptance; Ping Identity's ability to manage its growth effectively, execute its business plan, maintain high levels of service and customer satisfaction or adequately address competitive challenges; the Company's dependence on its senior management team and other key employees; the Company's ability to enhance and expand its sales and marketing capabilities; the Company's ability to attract and retain highly qualified personnel to execute its growth plan; the risks associated with interruptions or performance problems of Ping Identity's technology, infrastructure and service providers; the Company's dependence on Amazon Web Services cloud infrastructure services; the impact of data privacy concerns, evolving regulations of cloud computing, cross-border data transfer restrictions and other domestic and foreign laws and regulations; the impact of volatility in quarterly operating results; the risks associated with the Company's revenue recognition policy and other factors that may distort its financial results in any given period; the effects on Ping Identity's customer base and business if it is unable to enhance its brand cost-effectively; the Company's ability to comply with anti-corruption, anti-bribery and similar laws; the potential adverse impact of legal proceedings; the impact of Ping Identity's frequently long and unpredictable sales cycle; the Company's ability to identify suitable acquisition targets or otherwise successfully implement its growth strategy; the impact on Ping Identity's business and reputation if it is unable to provide high-quality customer support; the Company's dependence on strategic relationships with third parties; the impact of adverse general and industry-specific economic and market conditions and reductions in IT and identity spending; the ability of Ping Identity's platform and solutions to interoperate with its customers' existing or future IT infrastructures; the Company's dependence on adequate research and development resources and its ability to successfully complete acquisitions; Ping Identity's dependence on the integrity and scalability of its systems and infrastructures; the Company's reliance on software and services from other parties; the impact of real or perceived errors, failures, vulnerabilities or bugs in Ping Identity's solutions; the Company's ability to protect its proprietary rights; the risks associated with Ping Identity's use of open source software in its solutions and subscriptions; the Company's reliance on SaaS vendors to operate certain functions of its business; the risks associated with indemnity provisions in the Company's agreements; and the risks associated with liability claims if the Company breaches its contracts. Given these factors, as well as other variables that may affect Ping Identity's operating results, you should not rely on forward-looking statements, assume that past financial performance will be a reliable indicator of future performance, or use historical trends to anticipate results or trends in future periods. The forward-looking statements included in this press release and on the related teleconference call relate only to events as of the date hereof. The Company undertakes no obligation to update or revise any forward-looking statement as a result of new information, future events or otherwise, except as otherwise required by law. About Ping Identity Ping Identity is pioneering Intelligent Identity. The Company helps enterprises achieve Zero Trust identity-defined security and more personalized, streamlined user experiences. The Ping Intelligent Identity ™ platform provides customers, employees, partners and, increasingly, IoT, with access to cloud, mobile, SaaS and on-premises applications and APIs, while also managing identity and profile data at scale. Over half of the Fortune 100 choose Ping Identity for its identity expertise, open standards leadership, and partnership with companies, including Microsoft and Amazon. The Company provides flexible options to extend hybrid IT environments and accelerate digital business initiatives with multi-factor authentication, single sign-on, access management, intelligent API security, directory and data governance capabilities. Visit www.pingidentity.com for more detail. PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (In thousands, except per share amounts) (unaudited) Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Revenue: Subscription $57,495 $38,481 $161,387 $129,057 Professional services and other 4,270 4,138 13,276 13,012 Total revenue 61,765 42,619 174,663 142,069 Cost of revenue: Subscription (exclusive of amortization shown below) 5,995 4,526 16,828 12,785 Professional services and other (exclusive of amortization shown below) 4,086 3,347 11,002 9,184 Amortization expense 4,159 3,549 11,981 10,613 Total cost of revenue 14,240 11,422 39,811 32,582 Gross profit 47,525 31,197 134,852 109,487 Operating expenses: Sales and marketing (1) 17,819 13,690 55,153 41,811 Research and development (1) 11,283 9,634 33,594 26,027 General and administrative (1) 10,984 6,411 26,732 19,490 Depreciation and amortization 4,060 3,976 12,334 12,332 Total operating expenses 44,146 33,711 127,813 99,660 Income (loss) from operations 3,379 (2,514) 7,039 9,827 Other income (expense): Interest expense (3,818) (3,959) (12,067) (11,750) Loss on extinguishment of debt (3,150)--(3,150) (9,785) Other income (expense), net (992) (131) (767) (1,043) Total other income (expense) (7,960) (4,090) (15,984) (22,578) Loss before income taxes (4,581) (6,604) (8,945) (12,751) Benefit for income taxes 3,986 983 5,227 1,374 Net loss $(595) $(5,621) $(3,718) $(11,377) Net loss per share: Basic and diluted (0.01) (0.09) (0.06) (0.18) Weighted-average shares used in computing net loss per share: Basic and diluted 66,269 65,004 65,436 65,002 ______________________________________ (1) Includes stock-based compensation as follows: Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Sales and marketing $283 $184 $693 $535 Research and development 225 76 658 184 General and administrative 1,190 444 2,446 1,265 Total $1,698 $704 $3,797 $1,984 PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands) (unaudited) September 30, December 31, 2019 2018 Assets Current assets: Cash and cash equivalents $81,934 $83,499 Accounts receivable, net of allowances of $735 and $455 33,760 50,108 Contract assets, current 66,608 53,435 Deferred commissions, current 4,846 3,746 Prepaid expenses and other current assets 14,094 10,644 Total current assets 201,242 201,432 Noncurrent assets: Property and equipment, net 8,226 5,630 Goodwill 417,696 417,696 Intangible assets, net 192,283 207,043 Contract assets, noncurrent 16,791 14,033 Deferred commissions, noncurrent 7,372 7,287 Deferred income taxes, net 2,622 1,829 Other noncurrent assets 1,866 2,073 Total noncurrent assets 646,856 655,591 Total assets $848,098 $857,023 Liabilities and stockholders' equity Current liabilities: Accounts payable $2,839 $1,766 Accrued expenses and other current liabilities 10,165 7,906 Accrued compensation 10,808 18,394 Deferred revenue, current 30,613 31,493 Current portion of long-term debt 774 2,500 Total current liabilities 55,199 62,059 Noncurrent liabilities: Deferred revenue, noncurrent 1,594 3,874 Long-term debt, net of current portion 74,810 241,051 Deferred income taxes, net 33,839 39,112 Other liabilities, noncurrent 2,860 1,822 Total noncurrent liabilities 113,103 285,859 Total liabilities 168,302 347,918 Commitments and contingencies Stockholders' equity: Preferred stock---- Common stock 78 65 Additional paid-in capital 690,170 515,979 Accumulated other comprehensive loss (582) (787) Accumulated deficit (9,870) (6,152) Total stockholders' equity 679,796 509,105 Total liabilities and stockholders' equity $848,098 $857,023 PING IDENTITY HOLDING CORP.. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (In thousands) (unaudited) Nine Months Ended September 30, 2019 2018 Cash flows from operating activities Net loss $(3,718) $(11,377) Adjustments to reconcile net loss to net cash provided by operating activities: Loss on extinguishment of debt 3,150 9,785 Depreciation and amortization 24,315 22,945 Stock-based compensation expense 3,797 1,984 Amortization of deferred commissions 4,110 2,716 Amortization of deferred debt issuance costs 626 673 Deferred taxes (6,910) (1,755) Other 292 (50) Changes in operating assets and liabilities: Accounts receivable 15,980 10,903 Contract assets (15,931) (2,710) Deferred commissions (5,295) (4,543) Prepaid expenses and other current assets (4,486) (472) Other assets 305 126 Accounts payable 736 111 Accrued compensation (7,639) (1,828) Accrued expenses and other 2,302 (297) Deferred revenue (3,160) (2,526) Net cash provided by operating activities 8,474 23,685 Cash flows from investing activities Purchases of property and equipment and other (4,517) (2,081) Capitalized software development costs (7,260) (4,314) Acquisition of Elastic Beam, net of cash acquired of $0--(17,414) Other investing activities (300)--Net cash used in investing activities (12,077) (23,809) Cash flows from financing activities Payment of Elastic Beam contingent consideration (1,136)--Proceeds from initial public offering, net of underwriting discounts and commissions 174,375--Payment of deferred offering costs (1,093) (52) Proceeds from stock option exercises 1,571--Repurchase of common stock--(76) Proceeds from long-term debt--250,000 Issuance costs of long-term debt--(5,994) Payment of long-term debt (171,743) (170,625) Payment of debt extinguishment costs--(5,085) Net cash provided by financing activities 1,974 68,168 Effect of exchange rates on cash and cash equivalents and restricted cash 168 (310) Net increase (decrease) in cash and cash equivalents and restricted cash (1,461) 67,734 Cash and cash equivalents and restricted cash Beginning of period 84,143 21,469 End of period $82,682 $89,203 PING IDENTITY HOLDING CORP.. SUPPLEMENTAL FINANCIAL INFORMATION RECONCILIATION OF GAAP TO NON-GAAP FINANCIAL DATA (In thousands, except per share amounts) (unaudited) Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Gross profit $47,525 $31,197 $134,852 $109,487 Amortization expense 4,159 3,549 11,981 10,613 Non-GAAP Gross Profit $51,684 $34,746 $146,833 $120,100 Non-GAAP Gross Profit Margin 84% 82% 84% 85% Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Total operating expenses $44,146 $33,711 $127,813 $99,660 Stock-based compensation (1,698) (704) (3,797) (1,984) Acquisition related expenses (522) (1,753) (2,799) (4,928) Amortization expense (3,361) (3,462) (10,316) (10,842) Non-GAAP Operating Expenses $38,565 $27,792 $110,901 $81,906 Three Months Ended September 30, Nine Months Ended September 30, 2019 2018 2019 2018 Net loss $(595) $(5,621) $(3,718) $(11,377) Stock-based compensation 1,698 704 3,797 1,984 Acquisition related expenses 522 1,753 2,799 4,928 Amortization expense 7,520 7,011 22,297 21,455 Loss on extinguishment of debt 3,150--3,150 9,785 Provision for income taxes (1) (3,351) (2,462) (8,331) (9,920) Non-GAAP Net Income $8,944 $1,385 $19,994 $16,855 Net loss per share: Basic and diluted $(0.01) $(0.09) $(0.06) $(0.18) Weighted-average shares used in computing net loss per share: Basic and diluted 66,269 65,004 65,436 65,002 Non-GAAP Net Income per Share Basic $0.13 $0.02 $0.31 $0.26 Diluted $0.13 $0.02 $0.30 $0.26 Weighted-average shares used in computing Non-GAAP Net Income per Share: Basic 66,269 65,004 65,436 65,002 Diluted 67,978 65,345 66,801 65,019 _____________________________________ (1) The related tax effects of the adjustments to Non-GAAP Net Income were calculated using the respective statutory tax rates for applicable jurisdictions. Contacts Media Contact: Kevin Sellers press @ pingidentity.com Investor Relations Contact: Hugo Doetsch Tel: 303.396.6213 investor @ pingidentity.com Read full story here Continue Reading Previous KBRA Releases Rating Report for the State of Wisconsin General Obligation Bonds of 2019, Series B Next Turning Point Brands Names Graham Purdy Chief Operating Officer"}]