[{"date": "2014-09-02", "url": "http://www.reuters.com/places/africa/article/2014/09/02/us-health-ebola-idUSKBN0GX1IH20140902", "content": "MONROVIA (Reuters) - The United Nations said on Tuesday the spread of the deadly Ebola virus in West Africa was causing food shortages in one of the world's poorest regions and the U.S. Centers for Disease Control and Prevention warned the disease was threatening the stability of stricken countries and their neighbors. Doctors in Liberia were out on strike as they struggled to cope with the worst outbreak of Ebola on record, while the global aid organization Medecins Sans Frontieres (MSF) said 800 more beds for Ebola patients were urgently needed in the Liberian capital Monrovia alone, while in Sierra Leone highly infectious bodies were rotting in the streets. Governments and aid organizations have scrambled to contain the disease, which according to the World Health Organization (WHO) has killed more than 1,500 in West Africa since March. In an address to United Nations member states, MSF President Joanne Liu said, \"Six months into the worst Ebola epidemic in history, the world is losing the battle to contain it .\" She said aid charities and West African governments did not have the capacity to stem the outbreak and needed intervention by foreign states. Slamming what she called \"a global coalition of inaction,\" Liu called for the urgent dispatch of field hospitals with isolation wards and mobile medical laboratories. MSF, also known as Doctors Without Borders, said biological disaster response teams were needed to support West Africa's buckling healthcare systems. There are no approved Ebola vaccines or treatments, but as hospitals and Ebola treatment centers battled to contain the disease and tend to the sick and dying, the U.S. Department of Health and Human Services said a federal contract worth up to $42.3 million would help accelerate testing of an experimental Ebola virus treatment being developed by privately held Mapp Biopharmaceutical Inc.. The agency said in a statement that Mapp, based in San Diego, California, would manufacture a small amount of its ZMapp drug, which uses antibodies manufactured in tobacco plants, for early stage safety studies and animal studies needed to prove its effectiveness and safety in people. ZMapp is one of several treatments for Ebola under development. The drug, although never tested in humans, gained attention this summer when two American aid workers who contracted Ebola in Liberia were cured after receiving it. Their physicians said they did not know if the drug helped. Human safety trials are due to begin this week on a vaccine from GlaxoSmithKline Plc GSK. L and later this year on one from NewLink Genetics Corp NLNK. O. The Ebola epidemic in West Africa could infect more than 20,000 people and spread to more countries, the World Health Organization warned last week. With a fatality rate of 52 percent, the death toll stood at 1,552 as of Aug. 26. Cases of Ebola have been reported in Liberia, Sierra Leone, Guinea, Nigeria, Senegal, and Democratic Republic of Congo. The cases in Congo, which include 31 deaths, are thought to be a separate outbreak and not related to the West African cases. AMERICAN STRICKEN, MEDICAL STAFF STRIKE U.S. missionary organization SIM USA said on Tuesday that an American doctor treating obstetrics patients at the ELWA hospital in Monrovia had tested positive for Ebola. The doctor, who was not working in the hospital's Ebola treatment center, was in an isolation ward at the hospital and responding well so far, SIM said on its website. At Monrovia's John F. Kennedy Medical Center (JFK) scores of staff went on strike to protest against working conditions and unpaid bonuses. Amid shortages of equipment and trained staff, more than 120 healthcare workers have died in West Africa in the Ebola outbreak. \"Health workers have died (fighting Ebola), including medical doctors at...JFK and to have them come to work without food on their table, we think that is pathetic,\" <mark>George Williams</mark>, secretary general of the Health Workers Association of Liberia, told Reuters. <mark>Williams</mark> said healthcare workers at JFK, the country's largest referral hospital, had gone unpaid for two months. The Liberian strike came a day after healthcare workers at the Connaught hospital in Sierra Leone's capital Freetown held a one-day protest over pay and conditions. Staff there returned to work on Tuesday after they said the government settled a backlog of hazard pay and agreed to raise the weekly risk bonus to $100 from $40 for nurses working in Ebola wards and members of burial crews. Separately, the Liberian government began offering a $1,000 bonus to any healthcare workers who agreed to work in Ebola treatment facilities. The World Health Organization and other international bodies have rushed to support healthcare systems in affected countries, but additional staff and resources have been slow to arrive. PRICES SURGE, OBAMA ADDRESSES WEST AFRICANS In Monrovia, Medecins Sans Frontieres said its new ELWA 3 center, which has 160 beds, was overflowing with patients. \"Every day we have to turn sick people away because we are too full,\" said Stefan Liljegren, MSF coordinator at the site. Further pressuring the ability of the region's governments to spend money on healthcare, the epidemic has put harvests at risk and sent food prices soaring in West Africa, the U.N. Food and Agriculture Organization (FAO) said. The agency issued an alert over food security for Liberia, Sierra Leone and Guinea, which are most affected by the outbreak. Restrictions on people's movements and establishment of quarantine zones to contain the spread of the haemorrhagic fever have led to panic buying, food shortages and price hikes. \"Even prior to the Ebola outbreak, households in some of the most affected areas were spending up to 80 percent of their incomes on food,\" said <mark>Vincent Martin</mark>, head of an FAO unit in Dakar coordinating the agency's response. \"Now these latest price spikes are effectively putting food completely out of their reach .\" The director of the U.S. Centers for Disease Control and Prevention, Dr. Thomas Frieden, said he expected the outbreak to accelerate and urged governments to act now. \"We're likely to see significant increases in cases. Already we have widespread transmission Liberia. In Sierra Leone, we're seeing strong signs that that will happen in the near future,\" he said. Frieden said the outbreak was the first epidemic of Ebola the world has ever known, meaning it was spreading widely in society and \"threatening the stability\" of affected and neighboring countries. Frieden, who has been briefing U.S. President Barack Obama on the outbreak, said there was still a window of opportunity, but \"that window is closing .\" \"We need action now to scale up the response. We know how to stop Ebola. The challenge is to scale it up to the massive levels needed to stop this outbreak,\" he said. \"The virus is moving faster than anyone anticipated. We need to move fast .\" In a video message to West Africans in Liberia, Sierra Leone, Guinea and Nigeria and released on YouTube, Obama affirmed the United States' support in the fight against Ebola and attempted to dispel some myths about how it is spread. here \"Ebola is not spread through the air like the flu. You cannot get it from casual contact like sitting next to someone on a bus,\" he said. Instead, he said the most common way people become infected \"is by touching the body fluids of someone who is sick or has died from it, like their sweat, saliva or blood, or through a contaminated item, like a needle .\" Obama said that was why so many people were becoming infected while caring for Ebola patients at home, and he urged people who felt sick to get prompt treatment because half of the people who become ill recover. \"Stopping this disease won't be easy, but we know how to do it. You are not alone,\" Obama said. To try to ease the strain on their economies, Ivory Coast, which closed its borders with Liberia and Guinea last month, announced on Tuesday it would open humanitarian and economic corridors to its two western neighbours. The death toll from an Ebola outbreak in the Djera region of northern Democratic Republic of Congo has risen to 31, Minister of Health Felix Kabange Numbi told Reuters on Tuesday. The outbreak in Congo's Equateur province is thought to be separate from the West African epidemic. (Reporting by <mark>James Harding</mark> Giahyue; Additional reporting by Stephanie Nebehay in Geneva, Isla Binnie in Rome, Umaru Fofana in Freetown, We welcome comments that advance the story through relevant opinion, anecdotes, links and data. If you see a comment that you believe is irrelevant or inappropriate, you can flag it to our editors by using the report abuse links. Views expressed in the comments do not represent those of Reuters. For more information on our comment policy, see http: //blogs.reuters.com/fulldisclosure/2010/09/27/toward-a-more-thoughtful-conversation-on-stories/ Cannot there be airdrops of food, water and other daily hygiene necessities? Cannot money be transferred into one of the Liberian banks to cover the unpaid salaries and other overdue payments of the health workers who risk their very lives to contain this pandemic? What is wrong with this world? Where is the humanitarian sensibility in each leader of each country? What does this say about our collective commitment to those in dire need? Actress Jennifer Lawrence contacts authorities after nude photos hacked Our Flagship financial information platform incorporating Reuters Insider An ultra-low latency infrastructure for electronic trading and data distribution A connected approach to governance, risk and compliance, and interactive television platforms. Thomson Reuters journalists are subject to an", "articleID": "2014090223_00062897_W", "names": {"James Harding": ["Q11142372", "Q3161133", "Q6135540"], "Vincent Martin": ["Q2089239", "Q30127114", "Q3559734", "Q47392981"]}}, {"date": "2014-09-04", "url": "http://www.eurweb.com/2014/09/finding-your-roots-2-returns-with-courtney-b-vances-dads-side/", "content": "(L-R) Actor Courtney B. Vance, Actress/Playwright Anna Deavere Smith, Recording artist Nas, Actress Khandi Alexander, and Executive Producer, Writer and Presenter Henry Louis Gates, Jr. speak onstage at the \"Finding Your Roots 2' panel during the PBS Networks portion of the 2014 Summer Television Critics Association at The <mark>Beverly</mark> Hilton Hotel on July 23, 2014 in <mark>Beverly Hills</mark>, California * You know you have a complicated family history when ancestry.com's help line tells you,\" We can't help you. \"This is what actor Courtney B. Vance says he was told verbatim when he went to the popular genealogy website for help in researching his dad's side of the family. Luckily for Vance, Dr. Henry Louis Gates, Jr. and his trusty DNA kit was available. The Harvard professor is back on PBS this month with Vance and 28 other celebs for\" Finding Your Roots 2. \"The season premiere will find Vance, author <mark>Stephen King</mark> and actress Gloria Reuben all exploring the mysteries of their paternal ancestry. Vance's story is particularly complicated because his dad, Conroy Vance, was a foster child who never discussed his biological father .\" I've been looking for my dad's side of the family for a long time, \"he told the TCA Summer Press Tour .\" My dad would never talk about him, my mom didn't even know anything about him. \"Growing up, my dad and my mom were there for my sister and I. We were a tight, tight family, and for us not to know anything about him, there were certain things we just didn't talk about with Daddy. It's just family. Family is funny, and so it was not an unnatural thing for me growing up not to know anything about my dad or about the Vance side of our family .\" Vance has expressed endless gratitude toward Dr. Gates for tacking his father's branch of the family tree for the series. The actor, who just finished a run on Showtime's \"Masters of Sex,\" explains how he was literally turned away by ancestry.com when he first attempted to track down his father's lineage. \"Finding Your Roots 2\" will feature 29 celebrities from sports, music, film, television, theatre, and literature, airing Tuesdays, Sept. 23 through Nov. 25 at 8 p.m. ET. \"Finding Your Roots': Marsalis Reflects; Why Alicia Keys Pulled Out", "articleID": "2014090423_00006035_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "Stephen King": ["Q25183273", "Q27983592", "Q2832846", "Q39829", "Q7609688", "Q7609689", "Q7609690"]}}, {"date": "2014-09-05", "url": "http://abqjournal.com/457046/news/democrats-health-proposal-targets-cost.html", "content": "PUBLISHED: Friday, September 5, 2014 at 12:02 am...............................................................................................................WASHINGTON - Borrowing a Republican idea, a group including former senior Obama and Clinton advisers is unveiling a novel proposal to let states take the lead in controlling health costs. Individual states would set their own targets to curb the growth of health care spending. If they succeed, they'd pocket a share of federal Medicare and Medicaid savings, ranging from tens of millions to $1 billion or more, depending on the state. The plan, released Thursday, comes from the Center for American Progress, a public policy think tank closely associated with the White House. The center's former president, John Podesta, currently serves as counselor to President Barack Obama. Called \"Accountable Care States,\" the new option would be voluntary, reflecting longstanding Republican preferences. To address Democratic concerns, participating states would have to maintain insurance coverage levels and enforce consumer quality standards to claim their financial dividends. The state spending targets would encompass private spending, as well as Medicare, Medicaid, state and local employee insurance plans, and subsidized private coverage under the new health law. States would not have to expand Medicaid under Obama's health care overhaul to participate. Release of the plan follows a government report earlier this week that projects a return to unsustainable levels of health care inflation. Spending has been held in check the past five years largely because of a weak economy. The proposal is also a sign of Democratic sensitivity to a major piece of unfinished business for Obama's Affordable Care Act - cost control. Obamacare remains politically risky for Democrats in this fall's political campaigns. \"Given the current political gridlock, it is unlikely that the federal government will take the lead on reforms to control health care costs systemwide,\" the proposal said. \"States must therefore play a leadership role, with the federal government empowering...them to act .\" EMANUEL: Plan has roots from both parties (AP Photo/J. Scott Applewhite) Authors include Neera Tanden, a former top policy adviser to Obama as well as to Hillary Clinton; <mark>Peter Orszag</mark>, Obama's first budget director; Joshua Sharfstein, former deputy commissioner at the Food and Drug Administration under Obama, and Ezekiel Emanuel, a physician, former Obama health policy adviser and older brother to the president's first chief of staff, current Chicago Mayor Rahm Emanuel. Podesta was not on the list. \"It's got some Republican roots to it, and it's got some Democratic roots to it,\" Ezekiel Emanuel said. \"We wanted to create a bipartisan proposal that does take advantage of some Republican ideas and is cognizant of Democratic concerns, and use it to transform the whole delivery system .\" Authors plan to shop the idea around to top policymakers on Capitol Hill and in the administration. Congressional approval is needed to fully develop the concept. Obama's health care overhaul faces big challenges Catacomb-hopping horror flick \"As Above, So Below' is hopeless and hardly credible", "articleID": "2014090506_00018092_W", "names": {"Peter Orszag": ["Q13538222", "Q730580"]}}, {"date": "2014-09-06", "url": "http://bostonglobe.com/opinion/2014/09/06/john-updike-trash-everyone-treasure/pXAbC1acuL0grVpK7CrRZI/story.html", "content": "What words are gubernatorial candidates using most? The Democrats can't neglect reform We just can't judge Patriots until January A shark upturn in waters off Mass.. Got a tiny kitchen? Try strong colors. Coakley hedging her bets on casinos Honorary diplomas and a $1.34 check for a \"Simpsons\" voice-over were in Updike's trash. introduced us to <mark>Paul Moran</mark>, a onetime Salem resident who spent three years rooting through John Updike's trash. It is an unseemly pursuit, if not technically illegal; the Supreme Court ruled in 1988 that trash does not enjoy the privacy protections of the Fourth Amendment. <mark>Moran</mark> wasn't out to make money - he and his wife now run a shave ice stand, Maui Wowee, in Austin - but scooping up John Updike's trash was a habit he just couldn't quit. On his first plunge into the late novelist's waste stream, <mark>Moran</mark> unearthed honorary diplomas from Dartmouth, Bates College, Emerson, and Salem State that were bound for the dump. Eventually, <mark>Moran</mark> plucked so many interesting items from the refuse that he created an online collection of found Updike-ana, called The Other John Updike Archive. The trash - from the man Ian McEwan called \"the greatest novelist writing in English at the time of his death\" in 2009 - proves to be full of unexpected treasures. <mark>Moran</mark> salvaged boxfuls of canceled checks, a Screen Actors Guild payment ($1.34) for a \"Simpsons\" voice-over, as well as Christmas cards from Presidents Bushes and Clinton, and from John Lithgow and Elliot Richardson. <mark>Moran</mark> rescued a lot more than ephemera. He has posted at least one explicit letter from a lover, and now owns an Updike address book, a trove of floppy disks (Wang!), and notes for a contemplated novel about Saint <mark>Paul</mark>, which may someday see the light of day. \"I don't think Updike would be embarrassed\" by the decades-old love letter, <mark>Moran</mark> told me. \"His own writing was pretty explicit .\" Right-thinking people everywhere have decried <mark>Moran</mark>'s pilfering. In her Atlantic article, Adrienne LaFrance quotes Updike's authorized biographer Adam Begley; Leslie Morris, the curator of Harvard's Updike collection; and the Updike estate's agent <mark>Andrew Wylie</mark>, dialing up the obloquy (\"dumpster digger\" - <mark>Wylie</mark>; \"outrageous invasion of privacy\" - Begley) at <mark>Moran</mark>'s shenanigans. In contrast, Updike's son David, who is also a writer, described <mark>Moran</mark>'s haul to me as \"fair game. I'm also glad that Mr. <mark>Moran</mark> has saved some of these objects, as I'm interested in seeing some of them. If he's trying to sell them and make a killing, I'd be less sympathetic .\" After speaking with <mark>Moran</mark>, I had the impression that he would like to sell his collection to a library or museum, but so far he has no takers. Morris, who works at Harvard's Houghton rare books library, told LaFrance that \"people always make choices about what's going to be important and what should be thrown away and what should be kept...Anyone would like to think that their decision - that it's not worth keeping - is the right one and should be respected .\" Except that authors make gigantic blunders when it comes to posterity. A kooky, Christianized Nikolai Gogol burned half of \"Dead Souls,\" his great, irreverent masterpiece about 19th-century Russia. Vladimir Nabokov tried to burn \"Lolita\" several times. Novelist <mark>Henry James</mark> boasted of the \"gigantic bonfire\" he made of his personal papers - records that fans and scholars would like to have seen. In the name of deceased authors, well-meaning executors have committed equally egregious crimes. A coterie of Lord Byron's friends decided to burn his (presumably scandalous) diary shortly after the great poet's death. Byron wanted the diary published. The loss to literary history is incalculable. My point? Thank you, <mark>Paul Moran</mark>. I'm glad you didn't shut down your website last December, as you said you would. I'm a big Updike fan, and I found your archive to be endlessly fascinating. I disagree with your assertion that Updike's tossed-out family and travel snapshots are copyright-protected. I wish you would post more of them, although I know you are alert to privacy considerations as well. I know you feel the scorn of your detractors. \"I get it,\" is what you told me when I mentioned your critics. \"I've felt bad about this .\" Don't. To quote Updike, you are \"giving the mundane its beautiful due .\" To quote him again, from his famous poem, \"My Children at the Dump\" : \"The waste seems wonderful .\" You have created a \"wonderland of discard\" for us all to enjoy. Work here © 2014 Boston Globe Media Partners, LLC You have read 5 of 10 free articles in a month. You have read 7 of 10 free articles in a month. This is your last free article in a month. Continue reading with unlimited access for just 99 ¢ Don't miss any of your favorite stories again. Read the stories that matter to you as much as you want, whenever you want when you subscribe to BostonGlobe.com. The login information you entered does not match an account in our records. To activate FREE access as a home delivery subscriber Forgot your password? Home delivery subscribers get free access. Link Account Customer Service Number: 1.888. MY. GLOBE E-mail address not found, please try again or contact customer service at 1-888-MYGLOBE Please check your e-mail for a message from BostonGlobe.com with the subject line \"BostonGlobe.com password request .\" Click the link in the e-mail to choose a new password for BostonGlobe.com, and note that your new password will also be used for your Boston.com membership. You have reached the limit of 10 free articles in a month Continue reading by subscribing to BostonGlobe.com for just 99 ¢. Continue reading by subscribing to BostonGlobe.com for Stay informed with unlimited access to Boston's trusted news source. High-quality journalism from the region's largest newsroom Convenient access across all of your devices Today's Headlines daily newsletter", "articleID": "2014090606_00036175_W", "names": {"Andrew Wylie": ["Q4468413", "Q508842"], "Henry James": ["Q2074142", "Q3784955", "Q39884025"], "Paul Moran": ["Q10346294", "Q3371859", "Q43466628", "Q48700342", "Q59515425", "Q7152589", "Q7152591"]}}, {"date": "2014-09-10", "url": "http://staradvertiser.com/news/breaking/20140909_domestic_violence_victims_often_in_denial_experts_say.html", "content": "Domestic violence victims often in denial, experts say Janay <mark>Rice</mark> listened as her husband, Baltimore Ravens running back <mark>Ray Rice</mark>, spoke during a May 23 news conference at the team's practice facility in Owings Mills, Md. (AP Photo/Patrick Semansky, File) \"I woke up this morning feeling like I had a horrible nightmare, feeling like I'm mourning the death of my closest friend. But to have to accept the fact that it's reality is a nightmare itself. No one knows the pain that the media & unwanted (opinions) from the public has caused my family,\" said the woman who was punched unconscious by the semifamous football player, then her fiance, now her husband. \"To take something away from the man I love that he has worked his a--off for all his life just to gain ratings is horrific. THIS IS OUR LIFE! What don't you all get. If your intentions were to hurt us, embarrass us, make us feel alone, take all happiness away, you've succeeded on so many levels .\" \"No,\" said Nikki Daniels, a therapist in Tampa who works with survivors of trauma and abuse. \"No,\" said Rod Reder, the vice president of the Tampa-based National Institute of Crime Prevention. \"Not at all,\" said Douglas Covington, the head of misdemeanors, including domestic violence, at the Hillsborough County State Attorney's Office. \"I would be surprised if she had said anything else,\" said Teresa Drake, a national lecturer on domestic violence from the University of Florida's Levin College of Law. This started in an elevator in a casino in Atlantic City, N.J., on Feb. 15, when <mark>Ray Rice</mark>, a well-regarded running back for the NFL's Baltimore Ravens, hit Janay Palmer, the mother of his young daughter. A first video clip - released a few days later - showed only the woozy, rag-doll aftermath. A second video clip - released this week - showed the actual act, a left cross to the face, her head banging off a railing as her body fell heavy to the floor. In the not-quite-seven months in between, <mark>Rice</mark>'s attorney said that \"when this matter is fully tried and completed, you'll have a better understanding of what happened,\" his coach called him a \"heck of a guy,\" and many of his fans continued to wear replicas of his jerseys, saying his wife had forgiven him and he was \"still a good man .\" He married the woman he hit, whom he has known since 10th grade, telling her, \"Love is patient, and love is kind, and we made it,\" in a ceremony a day after he had been charged with aggravated assault. He pleaded not guilty and entered a lenient program for first-time offenders. The NFL suspended him for two games. He apologized at a news conference for \"the situation my wife and I were in .\" She apologized at the same news conference for her \"role in that night .\" Only after the second, even more ghastly clip did the Ravens release him, and his five-year, $40 million contract, and did the NFL suspend him indefinitely, prompting Janay <mark>Rice</mark> to get on Instagram and say what she said. Her comments, said Tara N. Richards, an assistant professor at the criminal justice school at the University of Baltimore, \"may seem counterintuitive to how people think a victim\" should' think or feel. But research demonstrates that victims of domestic violence often do not identify as victims, that they often blame themselves for the violence, and they often want the violence to stop, but not necessarily the relationship. \"\"Sometimes,\" Tampa police Detective Paul Northrop said, \"it's hard to convince a victim they are truly a victim .\" \"It's embarrassing and humiliating to be a victim,\" said Reder, from the National Institute of Crime Prevention. An assault of this sort, caught by a camera or not, and most are not, is seldom an aberration. Almost always, the experts say, it is a portion of a pattern of coercion and control. \"I'm sure right now she believes this is us against them,\" said Drake, from UF's law school. \"I'm sure it's how he's positioned it. Batterers can be very manipulative .\" If she had Janay <mark>Rice</mark> in her office in Gainesville, she said, she would show her the so-called power and control wheel, a visual highlighting the threats, the isolation, the intimidation, the economic abuse, the emotional abuse. \"You don't deserve that,\" she said. \"You deserve better than that .\" (3) You must be subscribed to participate in discussions By participating in online discussions you acknowledge that you have agreed to the check out gavin de beaker's \"gift of fear\" book for information on how to detach from violent stalkers, partners and abusers.", "articleID": "2014091006_00014977_W", "names": {"Ray Rice": ["Q1523516", "Q23823439"]}}, {"date": "2014-09-10", "url": "http://www.automotiveworld.com/news-releases/mercedes-benz-invests-three-billion-euros-germany-mercedes-benz-realigns-production-organization-passenger-cars/", "content": "Mercedes-Benz invests more than three billion euros in Germany: Mercedes-Benz Realigns its Production Organization for Passenger Cars New organization model focuses on vehicle and powertrain product architectures Mercedes-Benz invests more than three billion euros in capacity increase and modernization of its German passenger cars and powertrain plants in 2014 \"We want to continue to grow and will significantly increase our production capacities in the coming years,\" said <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management. <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management. Mercedes-Benz is realigning its global passenger cars manufacturing activities and is strengthening its German passenger cars locations with investments worth billions of euros. \"We want to continue to grow and will significantly increase our production capacities in the coming years. At the same time we want to permanently and sustainably strengthen our competitiveness with a high-performance organization,\" said <mark>Markus Schäfer</mark>, Member of the Divisional Board of Mercedes-Benz Cars, Production and Supply Chain Management, during a media event at the Mercedes-Benz Sindelfingen plant. This year alone, Mercedes-Benz is managing 18 vehicle ramp-ups at eight locations worldwide, among them the start of production of the new C-Class sedan on four continents. Until 2020, Mercedes-Benz will additionally introduce 12 models which do not have a predecessor. As well as stepping up its international activities, Mercedes-Benz is strengthening it German plants with investments of more than three billion euros this year. At the Sindelfingen plant, more than one billion euros are invested primarily for future products. Another billion euros go to the Untertürkheim core plant, amongst others for the expansion of engine production. The Bremen plant's capacities will be increased with around 750 million euros. Further investment also goes to the Rastatt compact car plant, where the fully-electric B-Class electric drive has been seamlessly integrated into series production. The new manufacturing organization Mercedes-Benz Operations (MO) is based on global production networks and centralized responsibility for logistics and quality. \"Under our previous production structure, the individual plants operated largely autonomously. Now, manufacturing will be organized according to product architectures, independent of individual locations,\" explained <mark>Schäfer</mark>. These product architectures comprise the rear-wheel drive architecture (MRA), the front-wheel-drive architecture (MFA), the architectures for SUVs (MHA) and sports cars (MSA) as well as the powertrain architecture (MPA) The MRA production network (S -, E -, C-Class) is led by Andreas Kellermann, who was previously head of the Bremen plant. Michael Göbel is now in charge of global compact car production (A -, B-Class, CLA, GLA and in the future CLA Shooting brake), having previously overseen roadster production in Bremen. Production of SUVs (M -, R -, GL -, and G-Class) and sports cars (SL, SLK) is the responsibility of Jason Hoff, who also retains his existing role as President and CEO of Mercedes-Benz U.S. plant in Tuscaloosa/Alabama (MBUSI). Peter Schabert, who has been responsible for global powertrain production since 2010, will continue in this position unchanged. Each vehicle and powertrain architecture will draw on a system of modules and components. The new C-Class is the first model series to be built entirely in accordance with this principle. The C-Class is Mercedes-Benz's highest-volume model series and went into production on four continents within just six months earlier this year: Bremen came first in February, followed by the East London plant (South Africa) in May, the Tuscaloosa plant (USA) in June, and the BBAC plant in Beijing (China) in July. Within the global production network, Bremen is the lead plant and manages all aspects of C-Class production, from the tooling strategy and quality assurance to the training of colleagues from other sites worldwide. The company is thereby ensuring that the highest standards are met at all production sites right from the outset. Around 500 employees from plants outside Germany have received intensive training so that, as multipliers, they can pass on their knowledge within their home plants. \"Our German passenger car and powertrain plants form the backbone of our global production network. The achievements of the teams in all four plants are second to none: they have done an outstanding job in launching the C-Class at four sites in such a short space of time,\" stated <mark>Schäfer</mark>. Making sure that every production facility delivers the high quality that is synonymous with the Mercedes-Benz brand is just one aspect of the redefined quality management function. \"Our quality remit covers every area of Mercedes-Benz Cars, from product development to customers,\" said <mark>Schäfer</mark>. He believes that providing innovative manufacturing processes is also a part of quality management: \"It means our designers and developers are able to launch exceptional vehicles that are equipped with leading technologies .\" Another key factor in the new organization is centralized supply chain management, in which all stages of the supply chain must be seamlessly integrated, from the supplier right through to the end customer. \"We still face great challenges in this field, at the same time there is also huge potential for reducing costs and increasing efficiency,\" explained <mark>Schäfer</mark>. Global production networks bring Mercedes-Benz closer to the different markets and customers and enable it to respond more quickly to changes in demand, because production can be adjusted in individual plants. At the same time, manufacturing in other currency areas enable exchange rate volatility to be evened out. \"Given the expanding range of models, steadily increasing unit figures, and greater complexity than ever before, we have to become significantly more flexible,\" said <mark>Schäfer</mark>. This includes having different variants on the same assembly line, factory equipment being used for several vehicle generations, and working hours that can be varied depending on demand. By standardizing and modularizing its plants, Mercedes-Benz intends to contain the level of capital expenditure needed and reduce fixed costs. \"It is essential that we achieve continuous improvement in all disciplines and raise our productivity,\" added <mark>Schäfer</mark>. The expansion of alliances, establishment of joint ventures, and use of capacity at contract manufacturers play an important role in Mercedes-Benz's growth strategy. At the end of June, Daimler announced that it was setting up a production joint venture with the Renault-Nissan alliance, stepping up their existing cooperation. The partners intend to build a new generation of compact cars at a new factory in Aguascalientes, Mexico, which will have a total annual production capacity of 300,000 units. <mark>Schäfer</mark> focuses on transparency and a collaborative working relationship across all hierarchy levels, both in the company as a whole and in his own organization: \"A high-performance organization depends on the motivation of all employees. The human factor makes the difference .\" Goodyear's Georges Feider notes the benefits and challenges of truck tire development live at 4 hours ago 120,000 Porsche cars delivered to customers worldwide 4 hours ago All-new Opel 2.0 CDTI: New generation large diesel debuts in Paris Automotive World is a leading provider of automotive industry information. Our news, analysis, research and forecasts have been informing the decisions of automotive stakeholders, including all of the world's major vehicle manufacturers, since 1992. Automotive Megatrends is the events division of Automotive World, the leading provider of premium automotive industry information. Our aim is to connect and inform the stakeholders who are shaping the global automotive industry of tomorrow. 1 - 3 The Washington Building Stanwell Road Penarth CF64 2AD", "articleID": "2014091017_00090453_W", "names": {"Markus Schäfer": ["Q1529352", "Q19668288", "Q27531610", "Q40433377"]}}]