[{"date": "2014-09-11", "url": "http://sj-r.com/article/20140911/ENTERTAINMENTLIFE/140919988/10295/ENTERTAINMENT", "content": "There's often room in the day for the music of the British invasion, or electronic dance music from the European continent, or quirky pop from Down Under. This weekend, however, is not that time. The American Music Show on Friday and Saturday at Donnie's Homespun, 107 W. Cook St. at the Vinegar Hill Mall, celebrates roots music - kind of folky, a little twangy, but very definitely American-made. Scheduled to perform are longtime St. Louis band the Bottle Rockets (\"Radar Gun\" ), Texas duo The Mastersons, and several central Illinois acts. The Sangamon Valley Roots Revival and WUIS-FM are hosting the show. (The original concert lineup had Grammy Award nominees Eric Brace and <mark>Peter Cooper</mark> scheduled to perform Friday. However, late Tuesday, American Music Show producer Sean Burns announced that a back injury means Brace and <mark>Cooper</mark> have to reschedule their performance. Burns did not specify if it was Brace or <mark>Cooper</mark> who was hurt .) The Bottle Rockets had a minor hit in the mid-1990s with \"Radar Gun,\" and their 2011 album \"Not So Loud: An Acoustic Evening with the Bottle Rockets\" landed on the Billboard magazine charts. The Mastersons - a Texas husband-and-wife duo of Chris Masterson (guitar) and Eleanor Whitmore (fiddle) - will fill the Brace and <mark>Cooper</mark> slot on Friday. The duo performs in <mark>Steve Earle</mark>'s band in addition to writing and recording their own music. Tickets cost $20 per day, or $30 for a two-day pass. Tickets are available online at www.bedrock66.com, or via BrownPaperTickets.com. The music festival schedule follows: FRIDAY 6:30 p.m.: The Whistle Pigs 7:45 p.m.: The Mastersons 9:30 p.m.: The Chris Casello Trio SATURDAY (outdoor and indoor stages) 3 p.m.: Big Storm 4:15 p.m.: Owen and Dooley Present...5:30 p.m.: Wolf Crick Boys 6:45 p.m.: Crankshaft & The Gear Grinders 8 p.m.: The Blue Ribbon Revival 8:15 p.m.: JP Harris & The Tough Choices 10 p.m.: The Bottle Rockets", "articleID": "2014091114_00088610_W", "names": {"Peter Cooper": ["Q2075218", "Q22003710", "Q39078607", "Q7173381"], "Steve Earle": ["Q17542895", "Q7612450", "Q781634"]}}, {"date": "2014-09-12", "url": "http://www.sbs.com.au/news/article/2014/09/12/schoolboy-star-tupou-signs-reds", "content": "The Queensland Reds secure spectacular Kiwi schoolboy prop <mark>Taniela Tupou</mark>, after popular tryscoring video clips saw him dubbed the \"Tongan Thor\". Standout New Zealand schools player <mark>Taniela Tupou</mark> - known as the \"Tongan Thor\" - has signed a two-year Super Rugby contract with the Queensland Reds. <mark>Tupou</mark>, 18, burst into the limelight this year with his performances for the Sacred Heart College first XV in Auckland. The 135kg prop scored a series of long-range tries, employing speed and footwork which belied his size. Videos of his tries went viral on social media, earning him the nickname \"Tongan Thor\" and sparked domestic and international interest in his services. Reds head coach <mark>Richard Graham</mark> says he will seek to further develop <mark>Tupou</mark>'s game, adding to an impressive skill base. \"I think he is a phenomenal athlete and his YouTube clip in late May is a snippet of what he is capable of at this early stage in his rugby career,\" <mark>Graham</mark> said. \"He understands there is a lot of hard work in front of him .\" Tongan-raised <mark>Tupou</mark> says he grew up supporting the Wallabies as they featured some Tongan players. He says his decision was partly influenced by the advice of Reds and Wallabies playmaker Quade Cooper, who grew up in New Zealand. \"My goal now is to try and play for the Reds as soon as I can .\" ", "articleID": "2014091122_00029737_W", "names": {"Richard Graham": ["Q3430805", "Q391756", "Q43395925", "Q7326015", "Q7326016", "Q7326017", "Q7326018", "Q9310288"], "Taniela Tupou": ["Q18166319", "Q25189771"]}}, {"date": "2014-09-13", "url": "http://www.denverpost.com/rss/ci_26523122?source=rss", "content": "Traditional (Provided by Arch-Interiors) Back in my college days, I wrote a paper called \"From Fiction to Nonfiction: Writing Along the Continuum .\" I looked at writing's extremes, from fantasy-rich fiction to stripe-straight reporting, with stopovers at essay, memoir, humor and opinion writing. I did this for selfish reasons. If writing were to be my future, I wanted to write it all - facts, lies and everything in between. (Hence this column: I wanted to know the rules so I could break them .) I feel the exact same way about decorating: I don't like to feel pigeonholed. So was I thrilled with a recent conversation I had with a high-end-high-style designer friend who walked me through the design continuum, and said I could, in fact, have it all - just not all at once. \"Home décor runs the gamut from antique-filled traditionalism to stark modernism,\" Christopher Grubb, president of Arch-Interiors, in <mark>Beverly Hills</mark>, told me. \"If traditional is all about embellishment, zz and modern is about clean lines, you can't have both together. Can you?\" I asked. His short answer: Yes, kind of. But you must blend with care. Grubb told me about two stopovers on the design continuum between traditional and modern: transitional and contemporary. \"Some people find it relaxing to come home at the end of their work day to clean lines, so they find modern interiors relaxing,\" said Grubb. \"Others find them too sterile, and prefer their surroundings embellished by decorative arts .\" Those folks veer toward traditional. \"And some can't decide,\" I say. \"I tell those clients design is a language,\" said Grubb. \"When they gravitate toward an item that isn't going to fit, I say,\" Yes, that's great, but that's Chinese and we're speaking French .' \"\"And those hybrid interiors you promised me?\" \"They're bilingual,\" said Grubb, who then pinned down the hallmarks of traditional and modern interiors, and their bilingual hybrids, transitional and contemporary. Syndicated columnist and speaker Marni Jameson is the author of \"House of Havoc\" and \"The House Always W ins\" (Da Capo Press). Contact her through marnijameson.com. Transitional (Provided by Arch-Interiors) Contemporary (Provided by Arch-Interiors) Interiors considered contemporary are the next stop up the continuum. They're decidedly more modern, but not purely so. \"The lines, and furniture shapes are modern, but the rules relax as comfort becomes important,\" said Grubb. Furniture fabrics are more comfortable than those in a modern interior, and here you may encounter chenille or a cotton print. In contemporary spaces, color, which is largely absent in modern interiors, can be featured on an accent wall or on pillows (used sparingly), other small furnishings, or in a collection of vases. \"However, you won't find carved wood, nor will you see a nod to antiquity. Rugs are geometric or tone on tone. Art will lean toward the abstract, though the look also might include an ethnic piece, like an African mask. 4. Modern These interiors are all about clean lines. They feature metal finishes, sleek surfaces, and zero excess. Think chrome, leather, glass, stone, and highly finished wood .\" Furniture is usually more sculptural and may not look comfortable, \"said Grubb .\" It's very Bauhaus and Le Corbusier. Spaces feel very museum-like. \"We reserve the right to remove any comment we feel is spammy, NSFW, defamatory, rude, or reckless to the community. We expect everyone to be respectful of other commenters. It's fine to have differences of opinion, but there's no need to act like a jerk. The Rockies are flirting with history, and in this instance that is not a good thing. Rick Upchurch's return includes induction into Broncos' Ring of Fame", "articleID": "2014091307_00006491_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"]}}, {"date": "2014-09-14", "url": "http://wfmz.com/news/news-election/kerry-countries-willing-to-aid-against-isis/28055452", "content": "<mark>Kerry</mark>: Countries willing to aid against ISIS (CNN) - Secretary of State <mark>John Kerry</mark> closed a trip to the Middle East saying countries \"in the region\" and \"outside the region\" are prepared to engage in military assistance against ISIS and \"in actual strikes if that is what it requires .\" Critics have said <mark>Kerry</mark>'s efforts to build an international coalition of Arab and European nations to fight ISIS were struggling. In an interview taped Saturday in Cairo, Egypt, that aired on CBS' \"Face The Nation\" Sunday, <mark>Kerry</mark> said some nations \"are clearly prepared to take action in the air alongside the United States and to do airstrikes, if that's what they're called on to do,\" but did not get more specific. On CBS, <mark>Kerry</mark> admitted that airstrikes alone will not solve the challenge of defeating ISIS, but he reiterated the administration's stance that there is no plan to put troops on the ground outside of local Iraqi forces and Syrian rebel groups. \"Well, we're not looking to put troops on the ground. There are some (nations) who have offered to do so, but we are not looking for that at this moment anyway,\" <mark>Kerry</mark> said. Integral to the White House strategy is an effort to train and equip Syrian rebel forces. On CNN's \"State of the Union,\" White House chief of staff Denis McDonough said: \"We have had a relationship with these fighters now for a couple of years. They're getting better and more capable. And what's most important here is that the Syrian opposition on the ground fighting ISIL can count on American and coalition airpower to supercharge their effort. That's important and that's ultimately going to be what is called for in this strategy .\" ISIS, which calls itself the Islamic State, is also known by the acronym ISIL. Republican Sen. Lindsey Graham, who advocates using U.S. special forces if needed to fight ISIS, was harshly critical of the Obama administration on \"Fox News Sunday .\" \"I will not let this president suggest to the American people we can outsource our security. And this is not about our safety--there is no way in hell you can form an army on the ground to go into Syria to destroy ISIL without a substantial American component,\" Graham said. \"This is a turning point in the war on terror. We are fighting a terrorist army, not an organization,\" Graham said. \"It's going to take an army to beat an army, and this idea that we'll never have any boots on the ground to defeat them in Syria is fantasy .\" \"This president needs to rise to the occasion before we all get killed back here at home,\" Graham said. The views expressed are not those of this company or its affiliated companies. Please note by clicking on \"Post\" you acknowledge that you have read the Please set an email address for your profile. To complete your registration on this site, please supply an address. Please confirm or modify the email address to which you will have subscription offers sent. For a more personalized experience, please supply the following You have entered a forbidden character", "articleID": "2014091418_00028986_W", "names": {"John Kerry": ["Q22316", "Q6242998"]}}, {"date": "2014-09-14", "url": "http://kxxv.com/story/26529427/wildlife-experts-work-to-keep-baby-opossums-alive", "content": "Wildlife experts work to keep baby opossums alive (AP Photo/Sunshine Haven Animal Rescue & Wildlife Rehabilitation, Sarinah Simons) meta content = \"2014-09-14 06:59:44\" > $50K reward offered for tips on trooper's slaying With the deadly ambush on a state police barracks in the Pocono Mountains, law enforcement in eastern Pennsylvania went on high alert and officers from throughout the region, including New York and New Jersey,...Investigators on Sunday returned to scour the woods across from a state police barracks where two troopers were ambushed, leaving one fatally shot and another critically wounded. meta content = \"2014-09-14 23:00:25\" > Wildlife experts work to keep baby opossums alive Wildlife rehabilitation experts are working to keep two baby opossums alive after the mother was apparently beaten to death with a sharp rock. Wildlife rehabilitation experts are working to keep two baby opossums alive after the mother was apparently beaten to death with a sharp rock. meta content = \"2014-09-14 23:00:11\" > Small earthquake rattles Northern California A small earthquake rattled parts of Northern California. meta content = \"2014-09-14 20:30:48\" > Lawyer: Hopeful tests show dead infants stillborn By DAVE COLLINS Associated Press The lawyer for a Massachusetts woman arrested after the bodies of three infants were found in her home says he's optimistic that forensic testing will show the...By DAVE COLLINS Associated Press The lawyer for a Massachusetts woman arrested after the bodies of three infants were found in her home said Sunday that he's optimistic that forensic testing will show...meta content = \"2014-09-14 22:30:11\" > Police: 6 hurt in shooting outside Alaska bar Police say six people were injured, one critically, in a shooting outside a bar in Alaska, and the suspects remain at large. Police say six people were injured, one critically, in a shooting outside a bar in Alaska, and the suspects remain at large. meta content = \"2014-09-11 13:47:54\" > Silicon Valley struggles to speak FDA's language From Apple's new smartwatch that tracks heartbeats to contact lenses that measure blood sugar - Silicon Valley is pouring billions into gadgets and apps designed to transform health care. But the tech giants...From Apple's new smartwatch that tracks heartbeats to contact lenses that measure blood sugar - Silicon Valley is pouring billions into gadgets and apps designed to transform health care. But the tech giants that have...meta content = \"2014-09-11 18:47:52\" > Seeking help after years of 9/11 survivor guilt The roar of a plane. The rise of a new building. Terrorism in far-off lands. The roar of a plane above Lower Manhattan. The rise of a pristine tower where ruins once smoldered. News of terrorist attacks in far-off lands. meta content = \"2014-09-14 22:00:18\" > Police detain \"Django Unchained' actress in LA An actress who appeared in\" Django Unchained \"was handcuffed by police responding to a report of indecent exposure. An actress who appeared in\" Django Unchained \"was handcuffed by police responding to a report of indecent exposure. meta content =\" 2014-09-14 21:10:13 \"> Mayor at Star-Spangled Banner event, hospitalized Baltimore Mayor Stephanie Rawlings-Blake complained of shortness of breath and chest pains during the city's Star-Spangled Banner celebration over the weekend and was taken to a hospital for tests. Baltimore Mayor Stephanie Rawlings-Blake complained of shortness of breath and chest pains during the city's Star-Spangled Banner celebration over the weekend and was taken to a hospital for tests. meta content =\" 2014-09-14 20:40:08 \"> Man's family disputes police version of shooting The family of a 22-year-old black man who was fatally shot by police in Utah is disputing investigators' statements that he was shot after he lunged at officers with a sword and race played no role in the...Alien-like giant water-living dinosaur unveiled Water-living 50-foot dinosaur unveiled; Discoverer:\" It's like working on an extraterrestrial' Water-living 50-foot dinosaur unveiled; Discoverer: \"It's like working on an extraterrestrial' From Ebola front line: Teaching how to stay safe Facing Ebola for first time, doctor learns to use crucial safety gear, then helps teach others Facing Ebola for first time, doctor learns to use crucial safety gear, then helps teach others AP Newsbreak: Source says <mark>Rice</mark> video sent to NFL AP Newsbreak: Law enforcement official says he sent video of <mark>Ray Rice</mark> to NFL 5 months ago AP Newsbreak: Law enforcement official says he sent video of <mark>Ray Rice</mark> to NFL 5 months ago Ferguson citizens call for arrest of officer Ferguson reforms met with rancor, doubt, at 1st City Council meeting since police shooting Ferguson reforms met with rancor, doubt, at 1st City Council meeting since police shooting Apple unveils smartwatch, bets on wearable devices Apple unveils smartwatch, mobile payment system in biggest expansion since death of Steve Jobs Apple unveils smartwatch, mobile payment system in biggest expansion since death of Steve Jobs Schwarzenegger reveals portrait by Austrian artist Schwarzenegger reveals official state portrait by Austrian artist that will hang in Capitol Schwarzenegger reveals official state portrait by Austrian artist that will hang in Capitol Clinton, Bush launch new scholars program Clinton, Bush share laughs as they start new scholars program at presidential centers Clinton, Bush share laughs as they start new scholars program at presidential centers Jeans face an uncertain future amid yoga wear rage Shoppers' love affair with yoga pants trumps jeans Divers seek lost crab pots in Washington waters Divers search for lost crab pots to clean up Washington state's sea floor Divers search for lost crab pots to clean up Washington state's sea floor Ruling against BP could mean $18 billion in fines Judge says BP\" grossly negligent' in Gulf spill; $18 billion in fines possible RIVERSIDE, Calif. (AP) - Wildlife rehabilitation experts are working to keep two baby opossums alive after the mother was apparently beaten to death with a sharp rock. The 2-year-old mother with two babies in her pouch was found in critical condition by a security guard outside an industrial building in Fontana last week, the Press-Enterprise reported (http: //bit.ly/1sEUKAP). The mother opossum died three days later, said Karolyn Verville, who heads Sunshine Haven Animal Rescue & Wildlife Rehabilitation in Riverside. Verville has been feeding cat milk replacement to the hungry babies, which she says tends to suit most wildlife. \"We're the next best thing to mom,\" she told The Associated Press on Sunday. Police in Fontana are searching for the attacker, after a sharp rock with blood and fur on it was found near the opossum. Animal shelter staff had hoped to save the mother opossum, which had possible skull and jaw fractures, so she could continue to nurse the babies until they were old enough to release into the wild. Verville said the babies need care for three months before they can be returned to their environment. State law requires animals to be released no more than three miles from the place where they were found, she said. \"The idea is not to protect them from death - nobody can do that,\" she said. \"It is just to give them a chance at life .\" meta content = \"2014-09-14 08:49:46\" > Hillary Clinton in Iowa stirs 2016 speculation Hillary Rodham Clinton is returning to Iowa to pay tribute to the state's retiring Democratic senator as anticipation builds over the possibility of another presidential campaign. Hillary Rodham Clinton, making her return to Iowa for the first time since the 2008 presidential campaign, implored Democrats on Sunday to choose shared economic opportunity over \"the guardians of gridlock\" in an...meta content = \"2014-09-14 08:09:44\" > Sweden shifts to left in parliamentary election Sweden's parliamentary election opened Sunday with polls showing the left-leaning Social Democrats poised to return to power after eight years of center-right rule. Sweden's Social Democrats were poised to return to power after a left-leaning bloc defeated the center-right government in a parliamentary election Sunday that also saw strong gains by an anti-immigration party. meta content = \"2014-09-14 06:59:44\" > $50K reward offered for tips on trooper's slaying With the deadly ambush on a state police barracks in the Pocono Mountains, law enforcement in eastern Pennsylvania went on high alert and officers from throughout the region, including New York and New Jersey,...Investigators on Sunday returned to scour the woods across from a state police barracks where two troopers were ambushed, leaving one fatally shot and another critically wounded. meta content = \"2014-09-14 17:10:02\" > Vikings miss <mark>Peterson</mark> in 30-7 loss to Patriots <mark>Adrian Peterson</mark> did not accompany the Minnesota Vikings to the stadium on Sunday for the game against the New England Patriots. The star running back is keeping his distance in the wake of child abuse charges that...The face of the franchise was nowhere to be found as the Minnesota Vikings flailed away against the New England Patriots on Sunday, and it's not clear when, if ever, <mark>Adrian Peterson</mark> will rejoin them. meta content = \"2014-09-14 17:40:08\" > Iraqi leader: No need for Arab powers to strike IS Newly outraged by the beheading of yet another Western hostage, diplomats from around the world are in Paris pressing for a coherent global strategy to combat extremists from the Islamic State group - minus two of...News Channel 25 KXXV-TV P.O. Box 2522 Waco, TX 76702 Phone Numbers: Main: 254-754-2525", "articleID": "2014091423_00023368_W", "names": {"Adrian Peterson": ["Q1398352", "Q373983"], "Ray Rice": ["Q1523516", "Q23823439"]}}, {"date": "2014-09-20", "url": "http://chroniclelive.co.uk/news/north-east-news/newcastle-united-fans-hand-out-7803727", "content": "Manhunt after teenager snatched from bus stop in Wallsend and raped in car Police swoop to clear Newcastle's East End of criminal residents Body found at University of Sunderland student accommodation during Freshers' Week 15-year-old girl raped while she waits at a bus stop in Wallsend Revealed: What Newcastle United boss Alan Pardew told his players about the boo boys Alan Pardew may have to substitute one of his younger players to protect them Newcastle United manager Alan Pardew does not fear his expected reception at St James' Park Newcastle United v Hull City LIVE: Build-up, action and analysis from St James' Park 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park \"data-type =\" fb-share \"data-action =\" article:7803727 \"> 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park\" data-type = \"tw-share\" data-action = \"article:7803727\" > 100 banners and 30,000 leaflets printed ahead of Newcastle United's Premier League clash at St James' Park Newcastle United fans will this afternoon attempt to carry banners into St James' Park calling for the sacking of manager Alan Pardew. The SackPardew.com campaign has printed 100 banners and 30,000 leaflets with their message, which on Saturday lunchtime were being distributed through pubs in the city. \"I got up at 4.15 am this morning and drove up from London to support this,\" said one disgruntled Toon fan handing out leaflets outside The Junction pub at Haymarket, who did not wish to be named. \"I was a season ticket holder but after the Sunderland game last season I said never again go to another match while Pardew was in charge, but when I saw this I thought I've got to come up .\" What really got me about it was that all the stuff they are saying on their website is the same as I've been thinking and saying to my friends in London, who think he's doing ok because they only see what is shown and said on Match of the Day and Sky Sports. \"A few people have taken issue with it as I've been stood here, saying you can't change things by sacking the manager, but he's not doing well enough .\" Even when we finished fifth in the league we were getting by on luck and magic from one or two players and we scraped wins. \"None of the people handing out the leaflets and banners that the Chronicle spoke to were willing to give their names, in many cases citing the anonymity of the campaign as one of the reasons they were attracted to it .\" In the past we've had 60th minute walkouts, and 69th minute walkouts and demonstrations outside the ground, but they're all by all different groups and they squabble and can't agree and it all seems to be about the individuals or the groups making a name for themselves, \"said another of the protestors .\" But this isn't. It's one clear message and it doesn't matter who you are, if you want to get behind it you can - and if you don't then that is fine too. \"At Bar Loco, on Leazes Park Road, the mood among those handing out the larger banners was positive, with reports of many supporters stopping to pick up the protest material before trying to take it into the ground for the match against Hull City .\" I think there is a malaise at the club and if we keep Pardew then we will go down, \"said a protestor in his 20s .\" And I think the atmosphere in the ground is also not what it was before - and I believe that is Pardew's fault, not <mark>Mike Ashley</mark>'s. \"We used to play attacking, exciting football but these days there is nothing to be excited about in the club. Newcastle United v Hull City LIVE: Build-up, action and analysis from St James' Park Keep up to date with all the build-up, action and reaction to Newcastle United's Premier League clash with Hull City at St James' Park Alan Pardew unlikely to net compensation bonanza should he be fired after Hull City game Alan Pardew reacts to Chronicle's popularity poll ahead of crunch clash with Hull City Newcastle United manager Alan Pardew feels that the Chronicle's poll was not an accurate measuring stick over his popularity Irate fans tell Alan Pardew it's time to get out of Toon: Poll reveals 86% want NUFC manager sacked See more stories you'll love You've turned off story recommendations. Hunt for missing Alice Gross is biggest police search since 7/7 bombings North East news LIVE: Latest updates from Newcastle and the North East Alzheimer's Society Memory Walk draws crowds to Newcastle and Gateshead quaysides Manhunt after teenager snatched from bus stop in Wallsend and raped in car Police swoop to clear Newcastle's East End of criminal residents Body found at University of Sunderland student accommodation during Freshers' Week 15-year-old girl raped while she waits at a bus stop in Wallsend See more stories you'll love You've turned off story recommendations. Burnley v Sunderland LIVE: Build-up, action and analysis from Turf Moor Alan Pardew unlikely to net compensation bonanza should he be fired after Hull City game Contact us Got a story in your area? Is there something happening in your area you would like us to report on? Competitions and promotions Vikki Hawkins Print The Chronicle is read by more adults than any other regional newspaper on sale in the area. With 170,115 average issue readers, this reach extends to 366,753 weekly readers - that's over 1/4 of adults in the area! The average time spent reading the Chronicle is 31 minutes; which shows the length of time that readers are engaging with the editorial and advertising content. 49,199 * copies of the Chronicle are sold on average each day as it continues to be an integral part of the region. * ABC Newcastle Chronicle 100% paid, Mon - Sat, JICREG, 1/10/2012 Page Views: 10m Audience figures from Omniture, monthly average (Jan - Jun 2014). More than 1 in 3 ChronicleLive users have clicked through to an online advertisement, demonstrating that our users are responsive and receptive to Internet advertising messages. ChronicleLive reaches an internet-savvy audience, with 84% of users having purchased products or services online in the past 12 months. Download our rate cards for all the prices of our print and digital products. Editor, The Chronicle Editor-in-Chief, Trinity Mirror North East Darren was appointed editor of the Chronicle in September 2011, following a six-year spell as editor of the Evening Gazette in Teesside.", "articleID": "2014092014_00028533_W", "names": {"Mike Ashley": ["Q15454805", "Q554077"]}}, {"date": "2014-09-23", "url": "http://theguardian.com/world/2014/sep/23/julia-gillard-i-dont-see-an-alternative-to-what-i-did-that-day", "content": "<mark>Julia Gillard</mark>: I don't see an alternative to what I did that day It was the act that dead-weighted her prime ministership, and almost cost Labor power federally in 2010 - but <mark>Julia Gillard</mark> says she would not reverse the decision to depose Kevin Rudd as Labor leader and prime minister. In an interview with the Nine Network broadcast on Tuesday evening, <mark>Gillard</mark> did not resile from the June 2010 leadership coup \"even with the benefit of hindsight\" - even though most senior Labor figures now do, regarding the strike against Rudd as a fundamental mistake. In characteristically unflinching fashion, <mark>Gillard</mark> told interviewer <mark>Ray Martin</mark>: \"Still, even with the benefit of hindsight, [I] don't see an alternative to what I did that day .\" <mark>Gillard</mark> also declared she would have \"out-campaigned <mark>Abbott</mark>\" if the Rudd forces had not destabilised her and run her down before the 2013 federal poll. \"If I'd had a clear run...I would have out-campaigned <mark>Abbott</mark>. I would have run a better campaign and I could have landed us in the same spot. That's my view, others will contest it, I get that .\" The conversation with <mark>Martin</mark> broadcast on Tuesday night is part of a promotional drive for <mark>Gillard</mark>'s memoir, My Story, to be released on Wednesday. <mark>Martin</mark> noted during the interview the memoir is a tale of \"almost unbridled treachery\" - a reference to her poisonous relationship with Kevin Rudd, which is canvassed extensively in the book. Despite being unable to countenance a viable alternative to deposing Rudd, <mark>Gillard</mark> is not without regret about the events of 2010. She regrets that she \"fed hope\" to Rudd in their fraught conversation over whether there were any circumstances in which he could hold on to the Labor leadership after their confrontation in June. She acknowledges that the act of blasting Rudd out of the prime ministership was traumatic for him and consequential for her. It assigned her a reputation for \"political brutality\" - \"the woman who wielded the knife\" - a difficult bequest given that in the critical moment of decision, she'd actually been \"hesitant .\" She told <mark>Martin</mark> the voters were surprised and disconcerted by the abrupt leadership change because she and other Labor players had shielded them from the government's policy drift and descent into internal paralysis. <mark>Gillard</mark> suggests she thought Rudd would move on and more than likely quit politics, \"free from the weight...because he'd found it so difficult in those last few months. Obviously I was wrong about that .\" \"If you look at my prime ministership there was this sort of cocktail, the internal destabilisation, the minority government - I think a harshness in the public critique - all of that swirled together to make it very hard political yards,\" she said. <mark>Gillard</mark> said her prime ministership felt like a fight on two fronts. \"You had this parallel tracks between what the opposition was saying about me and what the, you know, internal critics were saying about me - and that was a very hurtful, powerful dynamic .\" <mark>Gillard</mark> says she promised Rudd the foreign affairs portfolio after the loss of the leadership in a transaction designed to \"stop the leaks .\" Tuesday night's interview with <mark>Martin</mark> covered a range of topics. <mark>Gillard</mark> accepts complete responsibility for the \"real <mark>Julia</mark>\" botch up in the 2010 campaign. The newly minted Labor leader used a newspaper interview to attempt to reset a campaign plagued by leaks and missteps and excessive stage management by insisting she would, henceforth, be \"the real <mark>Julia</mark>\" - a declaration which served to reinforce voter's doubts about her authenticity. \"I put my hand up for that, one hundred percent...a dumb rookie error .\" <mark>Gillard</mark> is highly critical of press gallery journalists. She says some \"became activists in the leadership contest...(and) that's not their job as journalists .\" She also used the conversation with <mark>Martin</mark> to deliver a hard flick at radio talkback host <mark>Alan Jones</mark> - the broadcaster who declared <mark>Gillard</mark>'s father had \"died of shame .\" <mark>Gillard</mark> says <mark>Jones</mark> delivered only a \"mealy mouthed apology\" for the infelicitous outburst, and he only delivered that because of commercial pressure. \"It was a disgraceful thing; unforgiveable .\" She says she felt \"sorry\" for Germaine Greer - who made a famous crack about <mark>Gillard</mark>'s \"big arse\". From \"being the feminist for our times, to end up talking like that for cheap laughs about another woman was a really sad thing\". There are reflections on her time in the Lodge, the famous misogyny speech, her relationship with partner Tim and their daily routine, her atheism, her personal rapport with US president Barack Obama, the pressures of appearance and fashion for female leaders - and reflections on <mark>Tony Abbott</mark>. She says <mark>Abbott</mark> lacked the application required to persuade the cross bench independents to form a minority government after the 2010 election. \"I turned up, I was there every day doing it personally. <mark>Tony</mark> took a different approach .\" She contends that in the prime ministership, <mark>Abbott</mark> is a \"slave\" to the whims of <mark>Clive Palmer</mark>. \"On the big questions where the major parties have divided Mr <mark>Abbott</mark> can't do anything unless <mark>Clive Palmer</mark> says yes .\" On gay marriage - an issue she worked against in government, <mark>Gillard</mark> accepts \"we are going to see same sex marriage here and in, you know, most parts of the developed world .\" The Great 2014 Celebrity Nude Photos Leak is only the beginning US confirms 14 air strikes against Isis in Syria US air strikes against Isis and Khorasan in Syria - live updates Carbon map - which countries are responsible for climate change? \"Fuck it, I quit': Alaska TV reporter makes on-air exit to fight for pot legalisation Man avoids being hit by car and survives being knocked off bike by truck Charlo Greene tells viewers she owns Alaska Cannabis Club Israel shoots dead two Palestinians suspected of killing abducted teenagers Deepika Padukone: Bollywood star in titillation row with Times of India US air strikes against Isis and Khorasan in Syria - live updates US air strikes against Isis and Khorasan in Syria - live updates <mark>Julia Gillard</mark>: I don't see an alternative to what I did that day Australians preparing to fight overseas could face life imprisonment", "articleID": "2014092310_00013784_W", "names": {"Alan Jones": ["Q16730391", "Q172753", "Q19831854", "Q21453612", "Q2830529", "Q30321578", "Q4706990", "Q4706991", "Q4706992", "Q4706993", "Q4706994", "Q4706995", "Q4706996", "Q51879900", "Q56248414", "Q56969955"]}}]