[{"date": "2014-09-23", "url": "http://theguardian.com/world/2014/sep/23/julia-gillard-i-dont-see-an-alternative-to-what-i-did-that-day", "content": "<mark>Julia Gillard</mark>: I don't see an alternative to what I did that day It was the act that dead-weighted her prime ministership, and almost cost Labor power federally in 2010 - but <mark>Julia Gillard</mark> says she would not reverse the decision to depose Kevin Rudd as Labor leader and prime minister. In an interview with the Nine Network broadcast on Tuesday evening, <mark>Gillard</mark> did not resile from the June 2010 leadership coup \"even with the benefit of hindsight\" - even though most senior Labor figures now do, regarding the strike against Rudd as a fundamental mistake. In characteristically unflinching fashion, <mark>Gillard</mark> told interviewer <mark>Ray Martin</mark>: \"Still, even with the benefit of hindsight, [I] don't see an alternative to what I did that day .\" <mark>Gillard</mark> also declared she would have \"out-campaigned <mark>Abbott</mark>\" if the Rudd forces had not destabilised her and run her down before the 2013 federal poll. \"If I'd had a clear run...I would have out-campaigned <mark>Abbott</mark>. I would have run a better campaign and I could have landed us in the same spot. That's my view, others will contest it, I get that .\" The conversation with <mark>Martin</mark> broadcast on Tuesday night is part of a promotional drive for <mark>Gillard</mark>'s memoir, My Story, to be released on Wednesday. <mark>Martin</mark> noted during the interview the memoir is a tale of \"almost unbridled treachery\" - a reference to her poisonous relationship with Kevin Rudd, which is canvassed extensively in the book. Despite being unable to countenance a viable alternative to deposing Rudd, <mark>Gillard</mark> is not without regret about the events of 2010. She regrets that she \"fed hope\" to Rudd in their fraught conversation over whether there were any circumstances in which he could hold on to the Labor leadership after their confrontation in June. She acknowledges that the act of blasting Rudd out of the prime ministership was traumatic for him and consequential for her. It assigned her a reputation for \"political brutality\" - \"the woman who wielded the knife\" - a difficult bequest given that in the critical moment of decision, she'd actually been \"hesitant .\" She told <mark>Martin</mark> the voters were surprised and disconcerted by the abrupt leadership change because she and other Labor players had shielded them from the government's policy drift and descent into internal paralysis. <mark>Gillard</mark> suggests she thought Rudd would move on and more than likely quit politics, \"free from the weight...because he'd found it so difficult in those last few months. Obviously I was wrong about that .\" \"If you look at my prime ministership there was this sort of cocktail, the internal destabilisation, the minority government - I think a harshness in the public critique - all of that swirled together to make it very hard political yards,\" she said. <mark>Gillard</mark> said her prime ministership felt like a fight on two fronts. \"You had this parallel tracks between what the opposition was saying about me and what the, you know, internal critics were saying about me - and that was a very hurtful, powerful dynamic .\" <mark>Gillard</mark> says she promised Rudd the foreign affairs portfolio after the loss of the leadership in a transaction designed to \"stop the leaks .\" Tuesday night's interview with <mark>Martin</mark> covered a range of topics. <mark>Gillard</mark> accepts complete responsibility for the \"real <mark>Julia</mark>\" botch up in the 2010 campaign. The newly minted Labor leader used a newspaper interview to attempt to reset a campaign plagued by leaks and missteps and excessive stage management by insisting she would, henceforth, be \"the real <mark>Julia</mark>\" - a declaration which served to reinforce voter's doubts about her authenticity. \"I put my hand up for that, one hundred percent...a dumb rookie error .\" <mark>Gillard</mark> is highly critical of press gallery journalists. She says some \"became activists in the leadership contest...(and) that's not their job as journalists .\" She also used the conversation with <mark>Martin</mark> to deliver a hard flick at radio talkback host <mark>Alan Jones</mark> - the broadcaster who declared <mark>Gillard</mark>'s father had \"died of shame .\" <mark>Gillard</mark> says <mark>Jones</mark> delivered only a \"mealy mouthed apology\" for the infelicitous outburst, and he only delivered that because of commercial pressure. \"It was a disgraceful thing; unforgiveable .\" She says she felt \"sorry\" for Germaine Greer - who made a famous crack about <mark>Gillard</mark>'s \"big arse\". From \"being the feminist for our times, to end up talking like that for cheap laughs about another woman was a really sad thing\". There are reflections on her time in the Lodge, the famous misogyny speech, her relationship with partner Tim and their daily routine, her atheism, her personal rapport with US president Barack Obama, the pressures of appearance and fashion for female leaders - and reflections on <mark>Tony Abbott</mark>. She says <mark>Abbott</mark> lacked the application required to persuade the cross bench independents to form a minority government after the 2010 election. \"I turned up, I was there every day doing it personally. <mark>Tony</mark> took a different approach .\" She contends that in the prime ministership, <mark>Abbott</mark> is a \"slave\" to the whims of <mark>Clive Palmer</mark>. \"On the big questions where the major parties have divided Mr <mark>Abbott</mark> can't do anything unless <mark>Clive Palmer</mark> says yes .\" On gay marriage - an issue she worked against in government, <mark>Gillard</mark> accepts \"we are going to see same sex marriage here and in, you know, most parts of the developed world .\" The Great 2014 Celebrity Nude Photos Leak is only the beginning US confirms 14 air strikes against Isis in Syria US air strikes against Isis and Khorasan in Syria - live updates Carbon map - which countries are responsible for climate change? \"Fuck it, I quit': Alaska TV reporter makes on-air exit to fight for pot legalisation Man avoids being hit by car and survives being knocked off bike by truck Charlo Greene tells viewers she owns Alaska Cannabis Club Israel shoots dead two Palestinians suspected of killing abducted teenagers Deepika Padukone: Bollywood star in titillation row with Times of India US air strikes against Isis and Khorasan in Syria - live updates US air strikes against Isis and Khorasan in Syria - live updates <mark>Julia Gillard</mark>: I don't see an alternative to what I did that day Australians preparing to fight overseas could face life imprisonment", "articleID": "2014092310_00013784_W", "names": {"Clive Palmer": ["Q5134643", "Q550879"], "Julia Gillard": ["Q41563", "Q59400153"], "Ray Martin": ["Q7297787", "Q7297788", "Q7297789", "Q7297790", "Q7297791"], "Tony Abbott": ["Q348577", "Q7821736", "Q7821738", "Q7821739"]}}, {"date": "2014-09-23", "url": "http://marinij.com/dining_food/ci_26591323/from-editors-kitchen-can-you-really-have-fine", "content": "From the Editor's Kitchen: Can you really have a fine dining experience at a mall? I admit it - I am a food snob. I hate eating in restaurants that are in malls. Maybe it's because I lived in Florida for a few years, where just about every fine dining establishment is in a mall. So I was a bit shocked that I actually enjoyed dining at the Mariposa Restaurant in Neiman Marcus a few months ago - not just in a mall but in a department store in a mall! Of course, it was in the Ala Moana Shopping Center in Honolulu and on a lanai overlooking the beach and the Pacific Ocean with the gentle trade winds caressing me, the intoxicating smell of plumeria trees wafting by and a mai tai in my hand. But in general, the idea of making a mall a destination to dine feels all wrong. Casual? Sure. Fine dining? Uh, no. We're lucky that Marin has a lot of upscale restaurants that aren't in malls. But, we have a handful that are. What about you? Do you enjoy the mall dining experience? What about restaurants in department stores? Let's dish! Send in your comments in 200 words or less in an email to lifestyles @ marinij.com by Oct. 17; please put \"Editor's Kitchen\" in the subject line. Don't forget to include your full name and hometown. We'll run them in the Oct. 29 Plus section and online. Last month we asked readers how they feel about dogs in restaurants in light of Gov. <mark>Jerry Brown</mark>'s recent signing into law a bill that permits dogs besides service dogs at restaurants with outdoor areas throughout the state. I was surprised by how many don't like it, especially since we are such a dog-loving county. Here's what they had to say: Most Bay Area dog owners will always insist that their dog is harmless and is not a nuisance to anyone else, and they will refuse to acknowledge any evidence to the contrary. But any dog CAN in fact be harmful and be a nuisance, for a long list of reasons; that is why it has always been well-understood that we need strict rules on dogs in shared public spaces. These rules are for the health and safety of everyone in our community. Dogs are not people, and do not have the rights of people. Dogs should always be on a leash in public places; they should not be brought into public buildings; and they should not be brought anywhere near where food is sold. Dogs are unclean, and some people can have serious allergic reactions to dogs, so it is dumbfounding to me that we would revise our laws to allow them in restaurants. I see no tangible benefit from this, but plenty of potential drawbacks. Dogs in public places, along with inconsiderate and self-entitled dog owners, are a serious and growing nuisance in the Bay Area. AB 1965 is just another step in the wrong direction. - Jim Feldman, San Rafael It's cruel I'm one of \"those\" people who don't have a problem with animal testing. Rats? Dime a dozen. Would I stand by and let anyone mistreat a defenseless animal? Never. Speaking of animal cruelty, isn't it cruel to subject your beloved pet to all the trauma of being around BIG humans? Isn't it cruelty to stuff them into your little shoulder bag? Or stuff them into a \"made for puppy\" stroller? Isn't it down right cruel to make them go shopping, or be at a food establishment when they can't even order an entrée? I've been subjected to \"pets\" in so many environments, like the grocery store; I actually have a picture I took on my cellphone where little Fido is sitting in the child area of the cart, with no layer between the pups bum and the cart. I've seen dogs, regularly, at the farmers market. When I mentioned this to a woman she said, \"Well, they should have signs .\" Really? They do, and do you really need to be told? The real animal cruelty is depriving your pet the unbridled joy of greeting you when you get home. Or, \"how can I miss you if you don't go away?\" - Abby Danielson, Novato Enriching life Our dog, Dutch, loves to go out to restaurants with us. He's a very well-behaved Tibetan terrier (almost 4 years old), and enhances our eating experience, particularly since he eagerly manages to share our meal. He doesn't bark, doesn't cry, doesn't create a ruckus - simply sits tight until the food arrives and then waits patiently for his handout. His presence also enhances the social experience since most people in Marin love dogs and will readily come over and chat with us while giving Dutch lots of attention. Who could possibly have a problem with that? A dog not only enriches the dining experience, but also enriches all aspects of our lives. Kudos to <mark>Jerry Brown</mark> for recognizing that. - Terry Bremer, San Rafael Better than some kids I think it is a great idea and one whose time was too long in getting here. We have always had one or two dogs and love taking them with us to dine out. Most of the time they are much better behaved than the children that are in the same place - they certainly never throw their food, scream and throw tantrums or do any of the other bad behaviors often witnessed by us. I would love to see dogs allowed inside restaurants - as they are in some of the best European ones - but at least this is a start. Pets, as well as children, need to be under the control of their \"parents\" at all times and this makes dining out with them a pleasure. - Sandy Hufford, San Rafael Disturbing trend Thanks for asking us to weigh in on the \"Take your dog just about everywhere\" trend. It takes a dog lover to speak up for those of us who are dismayed by the surge of canine encounters in public places. It's politically incorrect to say you'd rather not shop or eat a meal with someone's best furry friend down by your ankles. The fact is that even the sweetest, most docile doggy companion can be unpredictable. I wonder if the older woman who's small dog suddenly leapt up and bit me on the thigh because my \"hat frightened her\" ever thinks about me. I think about that encounter. She went off saying, \"She never does that .\" Well, obviously she does! And that's the point. In a store, restaurant, museum or farmers market unexpected things can happen. In the past year I've encountered dogs in all of those places. This despite large signs posted at the entryway and legitimate rules in place concerning hygiene. Most dogs are fine and sweet but overly friendly dogs can be almost as much a problem as aggressive ones when they greet you (uninvited) by jumping, or snuffling you and planting a nice smear on your shin or skirt. It mystifies me why someone would bring their dog to certain places. I'd be a little anxious that he/she might do something to disturb others and that would impact my own experience. But I think that many dog owners don't understand that their pooch is special to them but not to everyone and it's rude to give them freedoms that impinge on others. Even a dog/babe-in-arms might be vocal or smelly. I've noticed that many service people and business owners are cautious about causing a scene and so I'm glad that the IJ is giving us a forum to say: \"Please leave your best buddy at home when you go shopping or out to eat .\" By the way, I'm not talking about casual places with outdoor spaces where you would expect to see folks out for a walk with their pet. And if a business owner is a dog lover and encourages their presence I will do my part by choosing a different establishment but I hope that the doggy takeover in Marin allows dog-free places to remain; know that there are customers out there who appreciate it! - C. Powell, Corte Madera \"Gone to the dogs' California has literally\" gone to the dogs. \"So now bus boys will not only have to clean the tops of the tables; but they will also have to clean up dog urine and feces from underneath the tables. The restaurant menus for pit bulls and mastiffs dining outside will be: Chihuahua or toy poodles for an appetizer and perhaps a small toddler for an entree. Are dog owners insane? Is our Assembly a bunch of idiots? Has no one considered the potential danger and folly of allowing innumerable dogs together in the same place around each other and food? What were you smoking, Governor\" Moonbeam \"when you signed this inconceivable bill into law? - Pamela Lunstead, Novato Not my darling Please, leave Fido home or with a sitter while dining in a restaurant. Not everyone thinks your dog is a\" darling. \"It's bad enough that they are allowed in malls, at street fairs and in outdoor restaurant areas to be tripped on and cleaned up after, to say nothing of the confrontations that often occur between two canines. Sanitation is certainly another issue. I, for one, would not dine in a restaurant, upscale or otherwise, if dogs were allowed inside. - <mark>James Carroll</mark>, San Anselmo Leave them home I have a dog and love dogs but really - why are people dragging their dogs everywhere? Do people really think their dog enjoys shopping at the mall, going into the fitting rooms, being dragged from store to store? I am so tired of encountering dogs en masse everywhere I go. Barking, ill-mannered dogs are no better than screaming children. When we go out to eat I really do not want to sit next to dogs. I have that at home and certainly do not want it at a restaurant. Nowadays everyone seems to have some sort of companion dog. Are there that many people in the world that need this security or is it just an excuse to take their dog wherever they want? I know one thing for sure - my dog would much rather be sleeping comfortably at home than having anxiety with all the commotion at malls, restaurants, etc.. People, leave your dogs at home! - R. Boyett, Ignacio Not a fan Dog are wonderful beings and have enhanced man's life throughout time. However, I am baffled by this growing presence everywhere. I've seen dogs in carts at grocery stores, large long-haired dogs brushing through racks of clothing at malls and yes, at outdoor eateries. I recognize the beauty and companionship they provide, but am opposed to this ubiquity. First, is this where your dog wants to be? Being stepped around on a dirty sidewalk or at the mall? As for dog allergies, they are real and life threatening. Additionally, people don't have control. Dogs bark and nip. And seriously, Marin, why can't you pick up your dog's droppings? Municipalities increasingly spend more and more money dealing with this issue. And now it's near restaurants and at the mall. Dog waste is not organic fertilizer. I love dogs, but I'm not a fan of this new development. - Nicole Kowalski, San Rafael Form of abuse Regarding dogs at restaurants, with some exceptions of course, I can't see a good reason for people to bring one. To force the poor thing to patiently lay down and hungrily smell delicious food and not be able to have any while they enjoy theirs is a form of abuse and just plain cruel as I see it. It shows total indifference and lack of any real concern for the dog. To display this treatment makes me both sad and angry. It spoils the entire meal for me. Naturally, I'll go out of my way to avoid restaurants that allow dogs. - Lorraine Peters, San Rafael No yapping, please If the outdoor dining space at a restaurant is large enough to accommodate dogs I think it is OK to bring dogs along providing they are clean, well-behaved and not yappy. Some people are totally oblivious to the idea that not everyone is in love with their dog. And the claim that the dog is a service dog is often abused and an untrue claim to that effect can have negative consequences for those people who truly need a service dog. - Nancy Valente, Mill Valley She causes smiles Our dog is part of our lives. We take her with us whenever we can and for lunches we seek out places with outdoor seating so we can bring her with us. All of the places here in central Marin, with outdoor dining, welcome us, including our pooch. She is better behaved than some of the patrons and certainly quieter. She normally just goes to sleep under our table and gives us comfort by her presence. Most all time people come over to pet her and say hello and it seems to me that she enhances their luncheons as well as ours. She generates a lot of smiles. We've never encountered a negative reaction. So if you see us with our 60 lb beautiful golden doodle we hope you get a smile out of it. - Robert Greber, Greenbrae A delight to see Dogs are allowed in fine restaurants all over France, including Paris. In a country where a reverence for food and dining etiquette are unquestioned, this is a non-issue. Is it that French humans and dogs are more well-behaved? I currently do not own a dog, but am delighted to see well-trained dogs and well-trained humans wherever I go. - Nancy Heinemann, San Rafael Not her best friend I do not like dogs and they do not like me. I will never again be able to enjoy a meal in an outside restaurant because I am very against having dogs there.", "articleID": "2014092322_00057275_W", "names": {"James Carroll": ["Q1680137", "Q21501580", "Q24247086", "Q652225"], "Jerry Brown": ["Q152451", "Q717620"]}}, {"date": "2014-09-24", "url": "http://www.localmemphis.com/story/d/story/local-hospitals-on-alert-for-enterovirus/28496/0IH7kSEDwEm0WTtuyLZmnw", "content": "MEMPHIS, TN (localmemphis.com)--Doctors at Le Bonheur Children's Hospital are on alert and looking for any patients showing symptoms of a virus that has sent hundreds of children to the hospital around the country. Worried parents and kids with stuffy noses are routine at Le Bonheur's emergency room and most kids who catch the the Enterovirus D68 will be just fine. But for some, it turns nasty very quickly and become so serious they need to be put on a ventilator. \"So, it would start out as a common cold type of symptoms, then some of those would develop into more of a cough and difficulty breathing,\" explained Infectious Disease Specialist <mark>Dr. John</mark> DeVincenzo. <mark>Dr.</mark> DeVincenzo is an expert in infectious diseases. When children with those symptoms show up, patient fluid samples are sent to a lab at Le Bonheur where technicians check for signs of Enterovirus D68. \"It might, for example, cause someone who has asthma to get a lot worse asthma or it might be so severe that it causes somebody whose healthy without any medical problems to have viral pneumonia,\" said <mark>Dr.</mark> DeVincenzo. There is no vaccine for Enterovirus D68, so doctors provide supportive care until the patient gets better. In the most serious cases, patients could be in the hospital for a couple of weeks.", "articleID": "2014092401_00063231_W", "names": {"Dr. John": ["Q511074", "Q54593093"]}}, {"date": "2014-09-25", "url": "http://newsnet5.com/news/local-news/oh-cuyahoga/spirit-airlines-to-begin-offering-service-at-cleveland-hopkins", "content": "Spirit Airlines announced Wednesday the discount carrier is coming to Cleveland. Spirit Airlines to begin offering service at Cleveland Hopkins CLEVELAND, Ohio - Spirit Airlines announced on Wednesday the discount carrier is coming to Cleveland Hopkins International Airport. \"That's right we're taking our talents to Cleveland,\" jokingly said Spirit Vice President of Network Planning Mark Kopczak. Kopczak says United Airline's decision to scale back operations at Hopkins opened the door for Spirit to come to the city offering travelers a no frills, low cost options to select cities. \"We're here not just because the Cleveland area is a great place to live and travel to and from, but also because air travel choices have dwindled here and fares have gone up,\" Kopczak told those on hand for the announcement. \"We're here to try and reverse that trend .\" The city of Cleveland is on board with the airline's arrival as well. Mayor <mark>Frank Jackson</mark> says the move will potentially bring in new traffic to the city from places like Dallas, Las Vegas and a handful of spots in Florida including Spirit's hub in Fort Lauderdale. \"Anytime you can make it inexpensive or cheaper for people to travel to some places and they make choices, maybe they'll pick Cleveland,\" <mark>Jackson</mark> said. Doug and Trudy Foster say they travel in and out of Hopkins International about four to five times a year and soon they'll have a few more choices when it comes time to buy those tickets. \"Competition,\" said Doug. \"That's what you're looking for is some competition too .\" Trudy Foster says she is anxious for a new player to join the field. \"We do love this airport. It's convenient for us and we do like, like you said having options. It's great,\" Trudy said. Spirit will launch service at Hopkins on Jan. 15 with daily nonstop flights to Tampa Bay, Orlando and Fort Myers. Dallas, Las Vegas, Fort Lauderdale, Los Angeles and Myrtle Beach will be added in the following months. The airline says tickets will go on sale on its website beginning Sept. 24.", "articleID": "2014092502_00046218_W", "names": {"Frank Jackson": ["Q21621551", "Q5487508"]}}, {"date": "2014-09-25", "url": "http://wtol.com/story/26622257/toledo-homeowner-waits-over-a-year-to-get-14000-patio-fixed", "content": "Toledo homeowner waits over a year to get $14,000 patio fixed meta content = \"2000-03-29 16:19:59\" > Call 11 for Action at 419-255-2255 if you are the victim of a consumer scam, fraud, or rip off. I want to fill out an official complaint Click here to e-mail the Call 11 for Action office with your consumer complaint. Click here to e-mail the Call 11 for Action office with your consumer complaint. meta content = \"2000-03-29 16:52:15\" > Are you interested in helping others with their consumer problems? Call 11 for Action can use your help. meta content = \"2014-09-24 18:43:30\" > Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr.. Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr. and its decision would be announced Wednesday. meta content = \"2014-09-23 20:50:33\" > Nightmare: Dad hears burglar on baby's monitor It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. At the Mid-south Saw milling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. He said he saw something sacred as he was working and cutting slabs. \"Talking to a couple At the Mid-south Sawmilling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. meta content =\" 2014-09-24 03:02:02 \"> <mark>Heather Brown</mark> speaks for first time in nearly a year <mark>Heather Brown</mark> speaks for first time in nearly a year We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. meta content =\" 2014-09-23 22:56:33 \"> Wood County Health Department wants community to be aware of the signs and symptoms of viral meningitis A fifth grader from BG Schools was diagnosed last week. It is currently the only confirmed case and the Health Department is hoping it stays that way. Lumber yard owner finds Jesus in tree trunk At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. Shocking! Dad hears creeper in baby's bedroom Video: Obama salutes while holding coffee cup A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. Sheriff, BCI excavate at Vickery residence as part of investigation Officials executed a search warrant at a residence near High Street and County Road 268 on Tuesday. A prosecutor says a new tip led to the execution of the search warrant, but would not provide details about that tip. <mark>Heather Brown</mark> speaks for first time in nearly a year TOLEDO, OH (Toledo News Now) - A Toledo homeowner spent thousands of dollars on a custom-made patio when only three month later it started to crack. Bill Strall's life has revolved around keeping tabs on the work done at his home .\" I called him on April 6 at 2:15 left him a message, \"said Bill. After several failed attempts to reach Concrete Images Owner Troy Musselman, Bill felt like he had no choice but to pick up the phone again .\" I called him back on May 23 at 11:34 and left a message, \"said Bill .\" Called him again at 2:38 and left him a message. \"The problems between Bill and Troy Musselman go back to December 2012, that's when Bill says he noticed several cracks in the concrete spreading throughout his patio. Bill says he paid Troy a little over $14,000 for it just three months prior .\" When he went to pour the patio, the patio was fine and I told him there were two things, I didn't want it to pool water and I didn't want it to crack, \"said Bill. He says he called Troy just as soon as he realized his wishes were not being meant. Bill says Troy came out in March of 2013 and looked at the patio .\" He offered me a one-time deal, \"said Bill .\" He said,' I tell you what you pay for the concrete and I'll supply the labor .' \"Bill says he did just that, paying $750 for the concrete and delivery costs. He says Troy then told him to call him back in September when business slowed down and he would fix the cracks. Bill says it was deja vu all over again .\" I gave him a call, left a message, never heard back, \"said Bill. So Bill called Toledo News Now's Call 11 For Action Team. Troy didn't want to go on camera but he says that he offered to fix the cracks but Bill declined. He says that cracks are something he can't control. Once the Better Business Bureau got involved Troy offered to give Bill a $500 check for his purchase of the concrete and by Sunday Bill had his money .\" I'm happy that channel 11 got involved and you got me results within a week, \"said Bill. The BBB says make sure to get written estimates of everything, that includes work that may need to be re-patched, make sure the contractor can give a work schedule and ask if they are bonded or insured.", "articleID": "2014092504_00002155_W", "names": {"Heather Brown": ["Q1592530", "Q57355022", "Q58218852"], "Kevin Ward": ["Q15452481", "Q17489694", "Q6397719"]}}]