[{"articleID": "2010120619_00215221_W", "names": {"Michael Werner": ["Q113355", "Q1358181", "Q13615228", "Q1762023", "Q27279714", "Q6835290"], "Aaron Curry": ["Q1632553", "Q21013130", "Q38185770"]}, "date": "2010-12-04", "url": "http://blogs.artinfo.com/artintheair/2010/12/01/captain-beefheart-takes-a-bow-at-michael-werner/", "content": "captain beefheart occupies a unique pop-culture niche thanks to his absurdist songs from the 1970s, but his career as a painter is less well known - even though art has been his main creative outlet since he stopped recording music in 1982. a painting by beefheart, who now goes by his given name, don van vliet, is nestled in a prime spot at <mark>michael werner</mark> gallery's abmb booth. (check out his other paintings at the priced at $40,000, the paint-glooped 1992 abstraction - titled \"black doily\" - is the latest can vliet work to be offered by the gallery, which has represented the artist for twenty years. he came to <mark>werner</mark> after a.r. penck, another gallery artist, became a captain beefheart fan in east berlin in the '70s. \"now a whole generation of younger artists has become obsessed with his work, like thomas houseago and <mark>aaron curry</mark>,\" <mark>werner</mark> said. van vliet's expressionistic style - \"he started out more figurative, and became less so,\" explains the dealer - is very much in key with the gallery's heavily germanic roster, whose art surrounds the work in the booth. while the van vliet was still available as of 3:30 during the vernissage, the gallery enjoyed a flurry of other sales in the fair's first hours. a humongous, wall-devouring georg baselitz painting from 2005 - titled \"die grossen fruende (remix),\" and featuring two sketchy figures against a white ground, one with yellow swastikas on his knees - sold for \"just under a million dollars,\" according to <mark>werner</mark>, and all six 2010 <mark>aaron curry</mark> works, including a hanging sculpture and collage paintings, moved at prices ranging from $15,000 to $60,000. other works sold too, including a sigmar polke for $40,000. is <mark>werner</mark> excited by the market energy? \"i'm beyond that,\" he said. \"i'm satisfied. i could go home now and be happy .\" "}, {"articleID": "2014051900_00020842_W", "names": {"Jorge Valencia": ["Q10517881", "Q59157499"], "Jorge Ramos": ["Q1981462", "Q56808142", "Q6278531"]}, "date": "2014-05-18", "url": "http://wunc.org/post/american-story-it-was-reported-rest-nation", "content": "Judge: Law Repealing Teacher Tenure Is Unconstitutional Political Junkie Ken Rudin Talks NC Congressional Races, Legislature's Short Session Fletcher Fellow for Education Policy Reporting <mark>Jorge Valencia</mark> Capitol Reporter A display of America's first ethnic newspapers at the Newseum's new exhibit, \"One Nation With News For All .\" The exhibit opened on May 16 and runs through Jan. 5, 2015. Puck magazine mocked immigrants and minorities. \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477599.jpg \"class =\" noexit lightbox \"> In the late 19th century, editorial cartoons such as this one from These press passes were used by leading ethnic journalists, including Korean American reporter K.W. Lee and Spanish-language news anchors Mar? a Elena Salinas and <mark>Jorge Ramos</mark>. The Chicago Defender, a leading black newspaper, throughout the South, helping to promote the Great Migration of blacks to the North .\" href = \"http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477607.jpg\" class = \"noexit lightbox\" > This stepstool was used by Pullman porters, black railroad sleeping car attendants in the early 20th century. The porters spread copies of A display of America's first ethnic newspapers at the Newseum's new exhibit, \"One Nation With News For All .\" The exhibit opened on May 16 and runs through Jan. 5, 2015. powerful photo essay on racial segregation in the United States was published in this Sept. 24, 1956, issue of Life magazine \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477613.jpg \"class =\" noexit lightbox \"> On display in the exhibit, Gordon Parks' Ethnic newspapers became advocates for their communities by fighting biases that stereotyped them as second-class Americans. Pensylvanische Berichte aimed at the growing immigrant population, was founded in 1746 and became one of America's first successful ethnic newspapers. This 1751 issue reported on the death of Frederick, Prince of Wales .\" href = \"http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477619.jpg\" class = \"noexit lightbox\" > The German-language newspaper Pensylvanische Berichte aimed at the growing immigrant population, was founded in 1746 and became one of America's first successful ethnic newspapers. This 1751 issue reported on the death of Frederick, Prince of Wales. The North Star, founded in 1847. \"href =\" http: //mediad.publicbroadcasting.net/p/shared/npr/styles/placed_wide/nprshared/201405/313477578.jpg \"class =\" noexit lightbox \"> The first draft of American history has many authors. And they include journalists from ethnic media: newspapers, websites, radio and TV stations dedicated to reporting news for immigrant and ethnic communities. A new exhibit called\" One Nation With News For All \"opening this weekend at the Newseum in Washington, D.C., explores the role ethnic media has played since the country's founding. Sharon Shahid is the lead writer of the exhibit, which features some unexpected icons of American history. Like Abraham Lincoln, who owned a German-language newspaper. Shahid says Lincoln bought the paper to court German-American voters in Springfield, Ill.. More than a century earlier, the country's first German-language newspaper was founded in Philadelphia by Benjamin Franklin. A video in the exhibit shows journalists and artists reading excerpts from some of the country's oldest Latino, Native American and Asian-American publications. They often served as the main outlets for the unique perspectives of each community. Shahid says that's especially true for new immigrant groups .\" What they did in establishing their newspapers and their radio stations, it was a very American thing, \"she says .\" They served as a bridge between the old country and the new country, and that's what helped them become American. \"Within the African-American community, ethnic media gave voice to the long struggle to be recognized as equal citizens .\" If it was in Jet, it was correct! \"says visitor Chester McCoy, a social worker whose family lived in St. Louis. The exhibit nods to this history with displays of Frederick Douglass' pocket-watch and the diary of Ida B. Wells, another early civil rights pioneer who published an African-American newspaper. But it was a photo of a chubby-cheeked teenager that caught McCoy's eye. It was in Jet that many African-American readers saw the mutilated body of 14-year-old Emmett Till. His murder in 1955 helped galvanize the civil rights movement .\" So I was a little kid, and I'm looking at it, not understanding it cause I'm not reading at that age, \"McCoy says .\" But I look at the pictures and I make this connection: He's black. I'm black. \"Beverly Cumbo, a retired tour guide from Brooklyn, N.Y., also recalled seeing Till's murder in the media .\" It's very emotional, and I have very vivid memories of Emmett Till and the newspaper clippings at that time, \"she says. African-American magazines and newspapers have always been a staple in Cumbo's media diet. Since the Internet age, Shahid says the growth of ethnic media means even more choices .\" They've multiplied, \"she says .\" You can't even keep up with them anymore. They've got a worldwide audience now. \"An audience for the diverse voices that make up the American story .\" One Nation With News For All \"is on display through Jan. 4, 2015."}, {"articleID": "2019030303_00303701_W", "names": {"Donald Trump": ["Q22686", "Q27947481"], "Michael Cohen": ["Q16728129", "Q18038631", "Q1930523", "Q22277395", "Q28868110", "Q6829330", "Q6829331", "Q6829332", "Q6829335", "Q6829336"]}, "date": "2019-03-03", "url": "http://indiatoday.intoday.in/world/story/donald-trump-criticises-india-over-high-tariffs-threatens-to-impose-reciprocal-tax-1469242-2019-03-03", "content": "US President <mark>Donald Trump</mark> on Saturday accused India of being a \"high tariff\" nation and threatened to charge a reciprocal tax to match heavy duties imposed on goods imported from the United States. <mark>Trump</mark>'s statement came while he was addressing the last day of the four-day Conservative Political Action Conference (CPAC) in Maryland. \"India is a very high tariff nation. When we send a motorcycle to India, they charge 100 per cent tariff. When India sends a motorcycle to us, we charge nothing. I want a reciprocal tax, at least I want to charge a tax,\" said <mark>Trump</mark>. A reciprocal tax can be defined as a form of a tariff to imports from other countries that charge a similar duty on imports from the US. This is not the first time <mark>Donald Trump</mark> has called out to India over high import duties. \"But let me tell you something. The world respects our country. They respect us,\" he added. India and US were engaged in a minor trade tussle in 2018 when the US took action against certain trade policies, which allegedly favoured Indian traders, thus disrupting the balance of trade. On February 6, another disciplinary action was taken by the US against India's trade and investment policies as it withdrew the policy of zero tariffs on Indian exports to the US. Under the Generalised System of Preferences (GSP), India used to enjoy tariff concession to the tune of USD5 .6 billion worth of exports. However, the move to withdraw GSP is expected to reduce US trade deficit with other economies in the world. Read | US welcomes Pakistan's decision to release captured Indian pilot Also Read | <mark>Trump</mark>'s former lawyer <mark>Michael Cohen</mark> has testified. Calls him racist and conman Watch | Reasonably decent news on India-Pakistan conflict: <mark>Donald Trump</mark>"}, {"articleID": "2018121104_00382443_W", "names": {"Tom Brady": ["Q2376327", "Q313381", "Q7815037"], "Robert Quinn": ["Q12374132", "Q3938397"], "Tony Gonzalez": ["Q729462", "Q7822457"], "David Andrews": ["Q1111220", "Q16096796", "Q20630502", "Q21085750", "Q330801", "Q5230783", "Q5230786", "Q5230788", "Q55861112", "Q56557174", "Q56707376", "Q59094383"]}, "date": "2018-12-11", "url": "https://www.fox13memphis.com/news/patriots-on-to-pittsburgh-after-stunning-loss-to-dolphins/886867026?utm_source=homestream&utm_medium=site_navigation&utm_campaign=homestream_click", "content": "Patriots \"on to Pittsburgh' after stunning loss to Dolphins Need a profile? Register now. {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Sign in using you account with: {* loginWidget *} Welcome back. Please sign in {* #userInformationForm *} {* traditionalSignIn_emailAddress *} {* traditionalSignIn_password *} Please confirm the information below before signing in. Already have an account? Sign In * Required fields By submitting your registration information, you agree to our Terms of Service and Privacy Policy. {* createAccountButton *} {* / registrationForm *} Why are we asking this? We collect zip code so that we may deliver news, weather, special offers and other content related to your specific geographic area. Thank you for registering! We have sent a confirmation email to {* data_emailAddress *}. Please check your email and click on the link to activate your account. Thank you for registering! We look forward to seeing you on [website] frequently. Visit us and sign in to update your profile, receive the latest news and keep up to date with mobile alerts. Click here to return to the page you were visiting. Reset your password Don't worry, it happens. We'll send you a link to create a new password. We have sent you an email with a link to change your password. Sign in to complete account merge {* #tradAuthenticateMergeForm *} {* traditionalSignIn_emailAddress *} {* mergePassword *} Edit your profile Resend Email Verification Sorry we could not verify that email address. Enter your email below and we'll send you another email. Click submit to receive another verification email Your Verification Email Has Been Sent Check your email for a verification link Patriots\" on to Pittsburgh' after stunning loss to Dolphins By: KYLE HIGHTOWER, AP Sports Writer Updated: Dec 10, 2018 - 6:18 PM Loading...Patriots \"on to Pittsburgh' after stunning loss to Dolphins FOXBOROUGH, Mass. (AP) - More times than not, the sight of Rob Gronkowski approaching the end zone has signaled good things happening for the New England Patriots. Yet there was the image of Gronkowski awkwardly crashing to the ground in a desperate attempt to prevent Kenyan Drake from crossing the goal line during Sunday's last-second 34-33 loss to the Dolphins. Talk about something being the opposite of what people have come to expect from the Patriots. While Miami's pass and double-lateral on the final 69-yard touchdown play got all the attention in the aftermath of Sunday's loss, coach Bill Belichick reiterated there were other miscues that contributed. There was Stephen Gostkowski's first missed extra point in 38 tries this season and only his second missed field goal inside 50 yards in 2018. New England also missed a scoring opportunity at the end of the first half. Albert McClellan blocked a Miami punt inside the Dolphins 20, setting up the Patriots on the 15 with 14 seconds left and no timeouts. <mark>Tom Brady</mark> completed a 13-yard pass to Gronkowski to get the ball to the 2. But <mark>Brady</mark> was sacked by <mark>Robert Quinn</mark> on the next play - very unlike <mark>Brady</mark> to miss a scoring opportunity - leaving New England's lead at 27-21 at halftime. Finally, on its last series of the game, the offense failed to get into the end zone and settled for a 22-yard Gostkowski field goal, despite having a first-and-goal on the 7 .\" I think there were a lot of things that could've been better in the entire game, \"Belichick said .\" I think the game was about a lot more than that (final) play, but certainly that play wasn't a good one for us. \"Belichick said the reason Gronkowski was at safety instead of Devin McCourty, one of New England's best defensive players:\" It would be his ability to play the deep, long throw. \"But the coach then admitted that Dolphins quarterback Ryan Tannehill probably didn't have the arm strength for such a desperation heave .\" I think it was a little too far to get to the end zone, \"Belichick said,\" but certainly a deep pass in that situation is a possibility. I wouldn't rule that out. \"The irony of the ending is that it overshadowed one of Gronkowski's best performances of the season. The tight end finished with eight catches for 107 yards, marking the 28th 100-yard game of his career. The only tight end with more 100-yard games than Gronkowski is <mark>Tony Gonzalez</mark> with 31. It was just Gronkowski's second 100-yard receiving game this season and his first since New England's season opener. Fullback James Develin also continued to impress with his fourth rushing touchdown in four games. He had one in his first 74 career games .\" It's going to test our character. It's going to test our mental toughness, \"Gronkowski said Sunday .\" I mean, I feel like I've been going through that all year, and now to get to this point now. We've just got to keep working hard. We've just got to keep grinding. We've got to keep focusing and just come together as a team more. \"Still, the loss only meant their route to reaching another Super Bowl will be that much tougher. As stunned as New England's players felt as they trudged off the field following the loss, other surprise results around the conference on Sunday kept their hopes of securing a ninth consecutive first-round bye in the playoffs very much alive. The Patriots (9-4) began preparations for their Week 15 game at Pittsburgh still on track to capture the second seed in the AFC behind Kansas City (11-2), which stayed in first place after fighting off Baltimore in overtime. Los Angeles improved to 10-3 after its win over Cincinnati and has the conference's second-best record. But the Chargers are division-mates with the Chiefs and would have to settle for a wild-card spot if nothing changes over the final three weeks of the regular season. New England holds the head-to-head tiebreaker over Houston, which is also 9-4 after its loss to Indianapolis. And courtesy of the Steelers' loss to the Raiders, even should Pittsburgh (7-5-1) beat New England, it would still trail the Patriots in the AFC standings. The Texans would move ahead of the Patriots in the AFC if they beat the Jets on Saturday and the Steelers win Sunday. Patriots center <mark>David Andrews</mark> said the fact they still have a say in where they finish up is the only thing they were thinking about when they walked back into the team facility Monday .\" We've got a lot we can do better. We got a big challenge coming up this week, so that's what our focus is on, \"he said on Monday .\" We can't do anything to change what happened yesterday, so we gotta move on. \"Special teams captain Matt Slater, invoking Belichick's classic parlance, said everyone in the locker room is officially\" on to Pittsburgh. \"\"I don't think there's really much else to talk about,\" Slater said. \"Over the course of the season it's gonna be very rare that things go your way all the time. And we've certainly been spoiled around here with some good fortune over the years. So we're just gonna move forward and focus on the Steelers and what we need to do to perform well there .\" ___ More AP NFL: https: //apnews.com/NFL and https: //twitter.com/AP_NFL ___ Follow Kyle Hightower on Twitter at http: //www.twitter.com/khightower Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Next Up:"}, {"articleID": "2018022504_00025623_W", "names": {"Otis Johnson": ["Q21934110", "Q7108796"], "Thomas Jefferson": ["Q6115426", "Q743755", "Q7791239"]}, "date": "2018-02-25", "url": "http://savannahnow.com/accent/2018-02-24/these-people-s-lives-mattered-too-book-gives-new-narrative-savannah-s-weeping-time", "content": "Posted February 24, 2018 09:02 pm By Special to Savannah Morning News \"These people's lives mattered, too': Book gives a new narrative to Savannah's The Weeping Time Pamela Oglesby, at left, and Shirley James helped commemorate The Weeping Time as part of the 27th annual Savannah Black Heritage Festival in 2016. James was festival coordinator. (Carl Elmore/Savannah Morning News file photo)\" The Weeping Time: Memory and the Largest Slave Auction in American History \"by Anne C. Bailey Anne C. Bailey The 2016 commemoration of The Weeping Time was held at the site of the Georgia Historical Society marker explaining the 1859 slave sale. The marker is on Augusta Avenue at Dunn Street. (Photo by Carl Elmore/Savannah Morning News file photo) The 2016 commemoration of The Weeping Time held at the site of the Georgia Historical Society marker explaining the 1859 slave sale. The marker is on Augusta Avenue at Dunn Street. (Carl Elmore/Savannah Morning News file photo) O n March 2-3, 1859, the largest documented auction of human beings on U.S. soil took place at the Ten Broeck Race Course, just two and a quarter miles west of downtown Savannah. The sale of 436 men, women and children--including 30 babies--came to be known as The Weeping Time, and it is one of the most significant events leading up to the Civil War, though few textbooks mention it and very little has been written about it over the 159 years since it occurred. A historical marker documenting the event was erected in a small triangular park at the corner of Augusta Avenue and Dunn Street in West Savannah and dedicated on March 2, 2008, by Mayor <mark>Otis Johnson</mark>. Because of its somewhat obscure placement, it's doubtful that many come across the marker unless they're explicitly seeking it out. A smattering of articles have been written about The Weeping Time over the years and a handful of books have touched on the subject, including one well-researched, self-published edition by Gullah-Geechee historian Griffin Lotson. But until now, there has never been a full-scale accounting of this incredible episode in American history in a book by a mainstream publisher. Historian and associate professor Anne C. Bailey has stepped into the breach with her book,\" The Weeping Time: Memory and the Largest Slave Auction in American History, \"published by Cambridge University Press. Bailey teaches history and Africana Studies at Binghamton University, State University of New York. She spent years researching this epochal event and tracing the genealogy of a number of the descendants of the auction. Bailey will be speaking at Georgia Southern's Armstrong Campus on March 22. Too few narratives Bailey's initial interest was ignited after she visited <mark>Thomas Jefferson</mark>'s Monticello Plantation in 2006 and noticed how the complicated issue of slavery was still being grappled with and the uncomfortable story of Sally Hemings was marginalized. When Bailey came across the account of how 140 of <mark>Jefferson</mark>'s slaves were auctioned off after his death, it struck a deep chord inside her, particularly the word\" auction \"as it applied to human beings .\" That word just stuck with me, \"explains Bailey .\" I realized that, having read hundreds of books on slavery, I don't recall that an auction had been used as a lens by which we looked at the period of slavery. \"Bailey mentions a few significant studies of slave auctions--most notably Walter Johnson's chronicle of the New Orleans slave market--but they have been few and far between .\" There really aren't too many people looking at this question of slave auctions and the fact that they were so common, \"says Bailey .\" I also noticed that when I looked at it carefully, it was also pivotal in the minds and hearts of anyone who was writing their own slave narrative. \"Bailey says if you look at the canon of autobiographies of enslaved people, the auction block was a central motivation for many things, including escape. She concluded that it was such an integral element to understanding the so-called\" peculiar institution \"of slavery that it eventually led her into the annals of The Weeping Time. People who need a voice The entirety of the story surrounding The Weeping Time is so extraordinary, it's a wonder that volumes haven't already been written about it. It's Shakespearean in scope and includes a cast of characters that would be nearly impossible to imagine if they weren't real. It includes Pierce Mease Butler, the reckless gambler and owner of the enslaved people who were sold. Butler inherited his wealth (and\" human chattel \") from his grandfather, Maj. Pierce Butler, one of the largest slaveholders in his time and the author of the\" Fugitive Slave Clause in the U.S. Constitution. \"Butler's wife, Frances Anne\" Fanny \"Kemble, was a well-known British actress and abolitionist who claimed she was unaware of Butler's entanglement in the slave trade when they married, but eventually visited the plantation in Darien that Butler inherited and wrote what is considered the most detailed first-hand account of slavery in\" Journal of a Residence on a Georgia Plantation (1838-1839). \"And though their stories are even less known, some of the people who were sold in 1859 have been given a voice by Bailey through her painstaking research and by the eyewitness account of an undercover reporter from the New York Tribune, Mortimer Thomson, who wrote under the pseudonym Q. K. Philander Doesticks. Bailey recounts some of the scenes that Thomson relates in his article at the time about people like Dorcas and Jefferey--considered mere\" hands \"and listed as auction items--but who were in love and shared a life, only to be ripped apart by being sold separately and taken to different parts of the country .\" An American issue' One of the things Bailey's book does best is sussing out the thin narrative threads of these enslaved individuals and giving them a voice despite the paucity of information we have about them. Bailey's goal is not only to tell the tale of The Weeping Time, but also to explain why it's relevant today and to bring the memory of these individuals who have been hidden from history for so long to the fore. \"Because so much of black American life in my view has been about just getting to the next level--pushing through to the next level and moving forward--looking back has been difficult,\" explains Bailey. \"But I think there's something so powerful--even if you go back just a few generations--about knowing who these people were and that their lives matter. You know, we talk about black lives matter. These people's lives mattered, too. Just to be able to call their name is a really powerful thing .\" In the last few chapters of the book, Bailey talks about the healing power the restoration of these historical memories can have. She talks about the \"democratization of memory\" by explaining why it's so important to highlight these previously untold stories as part of our collective past. \"Maybe we can't do anything about the past, but what can we do now?\" asks Bailey. \"That concerns me. If we can't do anything about the past, we can certainly rectify some wrongs in the present .\" Slavery is an American issue. This is not a southern problem, its legacy is an American problem...The great story of slavery is that it's not a one-dimensional story. \"A work of restoration One of the most salient aspects of Bailey's book is how she was able to trace the genealogy of some of the descendants of The Weeping Time. Due to the overwhelming absence of genealogical records, African Americans have traditionally had a harder time than most in tracing their lineage, but Bailey says there's plenty of progress that can and should be made despite the substantial hurdles .\" It's a work of restoration. We have to work with what we have. I don't think we have everything that we need. There's no question that we don't. But I think for too many historians, that was a reason to not try at all. \"I find that what happens in most cases is that people are pleasantly surprised at how far they can go. Even if it's just on one side of the family, maternal versus paternal or what have you...There's more there than we think, let me put it that way .\" What Bailey most hopes with her book is of course that people buy it, but that they also actually read it and not let it just sit on a shelf. The history it recounts is very much alive and relevant to today. And she's optimistic that it will contribute to a full understanding of our nation's history and fill in some of the gaps that have been left empty for too long. \"I'm hopeful. History moves slowly, so I think it's not fast enough for most of us, but I'm hopeful that people are open to looking at things in a different way, and I think there are more of them than not .\" IF YOU GO"}, {"articleID": "2009010512_00034615_W", "names": {"David Jones": ["Q10450056", "Q1174792", "Q1174894", "Q1174896", "Q16105375", "Q16945194", "Q17314899", "Q18350685", "Q18921618", "Q19665551", "Q20655901", "Q20732856", "Q21467224", "Q21467227", "Q24007312", "Q24007313", "Q260857", "Q2747788", "Q27906151", "Q27983475", "Q3018172", "Q312803", "Q4042624", "Q458276", "Q49193215", "Q50633601", "Q51397308", "Q52356357", "Q5235721", "Q5235722", "Q5235734", "Q5235735", "Q5235742", "Q5235743", "Q5235745", "Q5235746", "Q5383", "Q54666079", "Q56248428", "Q56507984", "Q56596961", "Q56604601", "Q57497739", "Q57552289", "Q728167"], "John Fry": ["Q21598151", "Q53575955", "Q55949243", "Q6234331", "Q6234334"]}, "date": "2009-01-05", "url": "http://cityam.com/index.php?news=27451", "content": "london midday: leading stocks mixed 05/01/2009 leading shares are mixed but slightly firmer on balance, with much of the morning's advance surrendered in anticipation of a weak opening on wall street. standard chartered is going well in an otherwise weak banking sector, despite deutsche bank cutting its price target for the asia-focused bank to 850p from 980p. elsewhere in the sector royal bank of scotland, hbos and lloyds tsb are the worst performers. ahead of a christmas trading update tomorrow, debenhams is sharply higher while elsewhere on the high street phone retailer carphone warehouse and newsagents wh smith attract support. aim-listed regent street stalwart liberty posted better sales than last year in the first ten months after a strong showing in december. \"although november's trading reflected the general retailing slow down, sales in december exceeded expectations and almost matched last year's record christmas as the store cleared its stocks in preparation for a widely anticipated major renovation during january 2009,\" liberty's said. its parent, serviced office and hotels group mwb's two main subsidiaries saw solid trading in the past few months. on the hotels side, \"trading at malmaison and hotel du vin has been firm over the 12 months to 31 december 2008 with internal ebitda and cashflow targets for the year to december 2008 ahead of those for the year to december 2007,\" mwb said. primark owner associated british foods is weaker after goldman sachs said the stock looks full valued. the us bank, which has a 710p price target for the stock, said primark may have suffered in the run-up to christmas from heavy discounting by rivals and higher input costs as a result of the weakness of the pound. sportswear retailer jjb sports shoots up after friday's announcement that veteran uk retailer sir <mark>david jones</mark> has moved to become executive chairman. the restaurant group said like for like trading over the seven weeks since 13 november has been at levels below the same period last year. however, results for the year ended 28 december are still anticipated to be in line with expectations. pub groups are out of favour. punch taverns is sharply lower on press reports that it has formally started the sale process for 500 of its leased pubs by offering their existing lessees first refusal on the properties. enterprise inns is another big ftse 250 faller. data search software giant autonomy has entered into a \"multi-million dollar\" licence agreement with bae systems. the agreement is for the licensing of autonomy's intelligent data operating layer software for archiving. car dealer inchcape motors forward despite citigroup cutting its price target for the stock from 110p to 40p and lowering its rating to \"hold\". \"with two profit warnings in two months, a late cycle collapse to double digit negative declines in all markets, a zero dividend, negotiations ongoing to agree on new covenants and no recovery in revenue trends expected until 2011, we cut our recommendation to hold/high risk,\" the us bank said. medical technology firm lifeline scientific said ebitda losses for the full year will be lower than expected and materially lower than last year. the group said it has continued to experience strong growth in the second half. \"revenue for the 12 months ended 31 december 2008 will be ahead of market expectations,\" it added. carbon credit specialist camco sees a reduction of € 6m in expected revenues and an associated reduction in expected net income, but still anticipates to report an overall maiden pre-tax profit for the full year to 31 december. johnston press announced that <mark>john fry</mark> has joined the newspaper publisher as new chief executive to replace tim bowdler, who stands down ahead of his planned retirement in may. ftse 100 - risers amec (amec) 538.50 p +6.00% standard chartered (stan) 919.00 p +5.69% rolls-royce group (rr .) 363.50 p +5.44% international power (ipr) 260.50 p +5.25% invensys (isys) 183.10 p +5.17% amlin (aml) 368.50 p +5.06% drax group (drx) 603.00 p +4.69% bg group (bg .) 1,043.00 p +4.30% london stock exchange group (lse) 557.50 p +4.21% icap (iap) 310.00 p +4.03% ftse 100 - fallers old mutual (oml) 56.20 p -6.80% tate & lyle (tate) 394.25 p -6.58% royal bank of scotland group (rbs) 50.00 p -4.76% hbos (hbos) 69.20 p -4.55% lloyds tsb group (lloy) 125.30 p -3.62% antofagasta (anto) 457.50 p -2.97% imperial tobacco group (imt) 1,843.00 p -2.95% sainsbury (j) (sbry) 327.50 p -2.67%"}, {"articleID": "2019050105_00097229_W", "names": {"Sarah Blake": ["Q2724605", "Q57826767", "Q57826777", "Q7422106"], "Roy Cooper": ["Q16106910", "Q7372694", "Q7372695"], "Jeff Baker": ["Q331064", "Q58331138"], "Antonio Rodriguez": ["Q19881466", "Q2857425", "Q4776927"]}, "date": "2019-05-01", "url": "http://longisland.news12.com/story/40396397/vigil-planned-after-2-killed-4-wounded-in-campus-shooting", "content": "Vigil planned after 2 killed, 4 wounded in campus shooting Posted: Updated: (David T. Foster III/The Charlotte Observer via AP). UNC Charlotte Chancellor Philip DuBois receives a hug after a news conference regarding a deadly shooting on the campus earlier in the day, Tuesday, April 30, 2019, in Charlotte, N.C. (AP Photo/Jason E. Miczek). People gather across from the campus of UNC Charlotte after a fatal shooting at the school, Tuesday, April 30, 2019, in Charlotte, N.C. (AP Photo/Jason E. Miczek). People gather across from the campus of UNC Charlotte after a shooting incident at the school Tuesday, April 30, 2019, in Charlotte, N.C. (John Simmons/The Charlotte Observer via AP). A University of North Carolina at Charlotte campus police officer carries a tactical shield after a shooting Tuesday afternoon, April 30, 2019, in Charlotte, N.C.. The shooting on the campus left at least a...(John Simmons/The Charlotte Observer via AP). Emergency vehicles cluster on Mary Alexander Road on the campus of University of North Carolina at Charlotte after a shooting Tuesday, April 30, 2019, in Charlotte, N.C.. The shooting on the campus left at l.. . By TOM FOREMAN Jr. and <mark>SARAH BLAKE</mark> MORGANAssociated Press CHARLOTTE, N.C. (AP) - A shooting that killed two and wounded four at a North Carolina university left students scrambling for shelter and prompted fresh calls for ways to keep campuses safe. A vigil was planned for Wednesday on the campus of the University of North Carolina-Charlotte, where the shooting on Tuesday upended the last day of class. The governor vowed a hard look at what happened in order to prevent future shootings. \"A student should not have to fear for his or her life when they are on our campuses,\" Gov. <mark>Roy Cooper</mark>, a Democrat, told reporters. \"Parents should not have to worry about their students when they send them off to school. And I know that this violence has to stop ....In the coming days we will take a hard look at all of this to see what we need to do going forward .\" Campus Police Chief <mark>Jeff Baker</mark> said authorities received a call in the late afternoon that a suspect armed with a pistol had shot several students. Officers assembling nearby for a concert rushed to the classroom building and arrested the gunman in the room where the shooting took place. \"Our officers' actions definitely saved lives,\" <mark>Baker</mark> said at a news conference. Two people were killed, and three remained in critical condition late Tuesday. <mark>Baker</mark> said a fourth person's injuries were less serious. Students were among the victims, but officials would not say how many. The Charlotte-Mecklenburg Police Department identified the suspect as Trystan Andrew Terrell, 22. He's in custody with charges pending. Monifa Drayton, an adjunct professor, was walking onto campus when she heard the shots. She said she directed students fleeing the scene to take cover inside a parking deck. \"I heard one final gunshot and I saw all the children running toward me,\" she said. \"We started to get all the children pulled into the second floor of the parking deck and the rationale was if we're in the parking deck and there's a shooter and we don't know where he is, he won't have a clear shot .\" She added: \"My thought was, I've lived my life, I've had a really good life, so, these students deserve the same. And so, whatever I could do to help any child to safety, that's what I was going to do .\" The shooting prompted a lockdown caused panic across campus. \"Just loud bangs. A couple loud bangs and then we just saw everyone run out of the building, like nervous, like a scared run like they were looking behind,\" said <mark>Antonio Rodriguez</mark>, 24, who was visiting campus for his friend's art show. The suspect's grandfather Paul Rold of Arlington, Texas, said that Terrell and his father moved to Charlotte from the Dallas area about two years ago after his mother died. Terrell taught himself French and Portuguese with the help of a language learning program his grandfather bought him and was attending UNC-Charlotte, Rold said. But Terrell never showed any interest in guns or other weapons and the news he may have been involved in a mass shooting was stunning, said Rold, who had not heard about the Charlotte attack before being contacted by an Associated Press reporter. \"You're describing someone foreign to me,\" Rold said in a telephone interview Tuesday night. \"This is not in his DNA .\" Shortly after UNC Charlotte issued a campus lockdown, aerial shots from local television news outlets showed police officers running toward a building, while another view showed students running on a campus sidewalk. The university has more than 26,500 students and 3,000 faculty and staff. The campus is northeast of the city center and is surrounded by residential areas. Spenser Gray, a junior, said she was watching another student's presentation in a nearby campus building when the alert about the shooting popped up on everyone's computer screens. She said she panicked: \"We had no idea where he was...so we were just expecting them at any moment coming into the classroom .\" Susan Harden, an UNCC professor and Mecklenburg County Commissioner, was at home when she heard of the shooting. She went to a staging area, she said, to provide support. Harden said she has taught inside the Kennedy building, where the shootings occurred. \"It breaks my heart. We're torn up about what's happened,\" Harden said. \"Students should be able to learn in peace and in safety and professors ought to be able to do their jobs in safety .\" ___ Associated Press writers Martha Waggoner and Emery Dalesio in Raleigh contributed to this report. Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Can't Find Something?"}, {"articleID": "2018030517_00351858_W", "names": {"Tom Ford": ["Q19873307", "Q240015", "Q318149", "Q7815834"]}, "date": "2018-03-05", "url": "http://www.cityam.com/281696/focus-victoria-gbp4bn-investment-has-completely-changed", "content": "Homes and interiors Monday 5 March 2018 5:34 pm Focus On Victoria: A £ 4bn investment has completely changed the area from dowdy offices to shiny penthouses and hip restaurants Share Melissa York I edit our weekly residential section Hot Property, and I deputy edit Living magazine, recently awarded Property Supplement of the Year at the 2017 Property Press Awards. I also write features for Bespoke, our monthly luxury magazine, and I write for the Life & Style section, encompassing arts reviews, travel and food. I won Consumer Magazine Property Journalist of the Year and Lifestyle & Interiors Journalist of the Year at the Property Press Awards 2017. Follow Melissa Nova, Victoria If the Queen's getting a £ 369m refurbishment of Buckingham Palace, it seems only fair that the neighbourhood surrounding it should get a polish, too. £ 4bn should just about cover it, and that's how much has been invested in the area by developer Land Securities over the last five years. Around £ 700m of that has gone on revamping the train station, a major terminus that's also set to be a hub for Crossrail 2, if current proposals go ahead. Traditionally, the areas around big rail stations haven't made desirable places to live and Victoria was no exception. Tall, grey, faceless office blocks characterised much of its property stock for decades and the retail offering was pretty poor, making it one of the cheapest spots in central London. Now, new homes make up two thirds of all sales in the area, with £ 262m changing hands in the resi market in 2017, more than twice the amount on the year before, according to figures compiled by David Fell, research analyst at Hamptons International. He nods to Nova, where penthouses go for £ 8m, and \"facadism\" , described as \"schemes that keep the front of the building while knocking down everything behind. We have seen a big influx of prime tenants ranging from CEOs to Middle Eastern royalty Developers are increasing using 19th century grandeur to conceal living space designed for the 21st century .\" Good transport links--it's on the Victoria and Circle lines in Zone One, as well as a being a gateway to the south of England and Gatwick Aiport--are only going to get better with the refurbishment of Victoria coach station, too. This makes it the perfect place for a London bolthole, says <mark>Tom</mark> Bond from UK Sotheby's International Realty, who is seeing \"a significant number of buyers from the commuter hotspots including Surrey and Berkshire, who are seeing a convenient second home in the capital .\" Hamilton at the Victoria Palace Theatre The influx of new homes and better transport has also made it a popular place for premium lets, according to Jo Eccles from SPPG. \"We have seen a big influx of prime tenants ranging from CEOs to Middle Eastern royalty. They or their relocation agents are specifically targeting Victoria as a location and the most popular buildings are 44 Victoria Street and Nova, with steady demand for rental properties in the £ 1,000 to £ 3,500 a week range .\" With new businesses moving in--Deutsche Bank, <mark>Tom Ford</mark>, Google and the UK's new National Cyber Security Centre--as well as new residents, top names in retail and hospitality have been lured to the area, from Molten Brown to Michelin-starred chef Jason Atherton's latest restaurant Hai Cenato. \"People no longer walk through Victoria to get to their destination, but choose to stay to enjoy the exciting array of new restaurants and shops, which is drawing a young crowd,\" says Martin Bikhit from Kay & Co.. But traditionalists will still find secluded enclaves of 18th century terraced housing tucked behind Victoria Street, and according to Kirsty Sugden of Dexters Westminster, \"surrounding Westminster Cathedral are a host of red-brick mansion blocks dating from the Victorian and Edwardian period .\" Mostly, Victoria is known for its diverse housing stock and bright future. \"You may find a one bedroom flat for £ 550,000 around the corner from a £ 20m townhouse,\" Sugden adds. Boisdale Belgravia Area highlights One of London's most highly-anticipated musicals, Hamilton, took up residence in the refurbished Victoria Palace Theatre last year and it's the hottest ticket in town. A view of Westminster Cathedral, the mother Catholic Church for England and Wales with stripped back Byzantine-style architecture, is often a perk of buying property in Victoria. A Royal Park, St James's, is right on your doorstep for picturesque jogs and the changing of the guard. For robust Scottish fare and a fine cigar, Boisdale of Belgravia is only a few paces away from Victoria Station and has an impressive selection of whisky on offer, too. Cardinal Place is one of many new shopping havens on Victoria Street, but has a particularly good food offering, with a food market every Thursday lunchtime. Full to the brim, waddle over to the Curzon Victoria on the same street to take in a film in one of its comfy sofa seats. Then check out the new restaurant quarter around the Nova building. Area guide"}, {"articleID": "2018050603_00162144_W", "names": {"Ben Scott": ["Q15078073", "Q27839151", "Q4886426", "Q4886429"]}, "date": "2018-05-06", "url": "http://www.stuff.co.nz/the-press/business/103645157/In-Their-Prime-Bennys-Barber-Shop-opens-warehouse-space-in-central-Christchurch", "content": "In Their Prime: Benny's Barber Shop opens warehouse space in central Christchurch JACK FLETCHER Last updated 15:48, May 6 2018 JOSEPH JOHNSON/STUFF Benny's Barber Shop owner <mark>Ben Scott</mark> is moving his business inside a warehouse at the corner of Orbell and Disraeli streets. Clients will be able to shoot hoops and play video games. Basketball, coffee and clipper cuts. All is on offer at Christchurch's biggest and most unique barber. Maximising its cult-like following, Benny's Barber Shop has opened its new 300-square-metre headquarters in an old glazing warehouse on Orbell St in Sydenham. JOSEPH JOHNSON/STUFF Benny's Barber Shop owner <mark>Ben Scott</mark> plays a computer arcade game at his new premises. Owner <mark>Ben Scott</mark> said it would become the company's main premises; its existing barbershops literally moved in under the high ceilings. Previously dotted around the city, Benny's three containers and two caravans were rolled in and installed over the weekend, bordering a basketball half court. READ MORE: * Benny cutting his own path to success in Christchurch * A barber shop in retro caravans gives Christchurch men an edge JOSEPH JOHNSON/STUFF Benny's Barber Shop's new premises will provide a cafe, entertainment areas and space for haircuts. \"This kind of space is always what I wanted,\" <mark>Scott</mark> said. \"So we can throw rugby balls and basketballs around and it doesn't break anything .\" Customers were welcome to shoot hoops and video game machines offered further entertainment. The barber's own clothing line was for sale in a small retail space next to a barista coffee bar. JOSEPH JOHNSON/STUFF Benny's Barber Shop has new headquarters. <mark>Scott</mark> built much of the fit out himself, from the bar at the entrance to the office space upstairs, which housed an independent filmmaker, a graphic designer and Canterbury's Red Bull distributor. Ad Feedback \"It was just a flat floor up there when we got the place, so I built the office, the desks and everything else,\" he said. The building itself was refurbished by Box 112, the Christchurch property developers behind the reopening of the Caffe Roma building, several industrial spaces on Welles St and numerous other developments. Junk & Disorderly has taken up space next door to Benny's in the Orbell St warehouse. <mark>Scott</mark> started the business about four years ago after a rugby injury forced him to give up a building apprenticeship. He was already cutting his mates' hair and decided to hone his skills at barber school in Auckland. Using his building skills, <mark>Scott</mark> fitted out a campervan and operated from his parents' Burnside property. He built a following, helped in no small way by slick haircuts for All Blacks and other rugby stars, photos of which were posted to social media. \"That first year for me was stupid hours really, like, 8am till 10pm. I just kept going,\" he said. The business has since expanded. Now 3 years old, the company employs 12 staff and operates a space in Hallensteins' Christchurch store. Another is opening in the Wellington store, on Lambton Quay, in July. \"If that goes well they want to look at Auckland too, so that's a big move, but definitely exciting .\" I'm hoping it continues to expand really, so we'll open this and rip into that, start a second clothing line, do some more marketing and potentially tap into some hair product ranges, \"he said. - Stuff Saved | Saved Stories Saved | Saved Stories Save | Saved Stories Save | Saved Stories Next Business story: Lincoln: From mill town to boom town The Press Homepage Comments"}, {"articleID": "2019052114_00012756_W", "names": {"Harry Martin": ["Q16729680", "Q42277437", "Q5670906"]}, "date": "2019-05-21", "url": "http://smh.com.au/entertainment/music/from-the-archives-catcalls-and-curtain-calls-for-judy-garland-20190520-p51p8l.html", "content": "From the Archives: Catcalls and curtain calls for Judy Garland From the Archives: Catcalls and curtain calls for Judy Garland Flashback From the Archives: Catcalls and curtain calls for Judy Garland On May 22, 1964, the legendary Judy Garland boarded a Qantas jet for Hong Kong, ending an Australian tour made notorious by a chaotic appearance at Melbourne's Festival Hall. By Staff reporter Judy Garland leaving Chevron Hotel for Mascot on May 22, 1964. Credit: <mark>Harry Martin</mark> First published in the Sydney Morning Herald on May 21-23, 1964 \"You're late\" : catcalls to Judy Garland (SMH, May 21, 1964) Melbourne, Wednesday. An angry crowd shouting, \"you're late,\" greeted Judy Garland when she arrived for her Festival Hall performance before a crowd of 7,000 tonight. She was due on stage at 8:30 pm. She did not arrive until 9.30 pm. Advertisement As the minutes before she arrived ticked by. The crowd remained generally quiet. There were a few slow hand-claps. Then Judy Garland appeared. She ambled slowly across the stage, smacked the conductor on the head, took his baton and conducted her 30-piece orchestra. Sections of the crowd stamped their feet, cat-called and shouted. \"I love you, too,\" Judy said. Performing at Festival Hall. \"You are late,\" someone shouted. \"I could not get out of that hotel,\" Judy replied. A woman shouted: \"Give her a chance .\" The conductor, Mort Lindsay, pointed his baton at Miss Garland and the orchestra broke into \"When You're Smiling\". Them Miss Garland sang. Within minutes most of the audience had forgiven her. By the end of her fourth number she was completely in control of them. After the show, Miss Garland kept police waiting 25 minutes before she left the stadium. They had to hold crowds back from her car. Quiet Farewell For Judy Garland: 15 Fans At Airport (SMH, May 23, 1964) Judy Garland, accompanied by American actor Mark Herron, left Sydney last night by Qantas jet for Hong Kong in a surprisingly quiet scene at the airport. Only 15 fans farewelled at Mascot, but about a hundred people waited for her outside the foyer of the Chevron Hilton Hotel. Her quiet departure last night was in contrast to arrangements made earlier in the day to get her aboard an aircraft which left Sydney for Hong Kong at 11.30 a.m. Customs, police and airline officials took elaborate steps to ensure that Miss Garland was farewelled without fuss and with dispatch. But she did not turn up. Later, an announcement was made that her booking for the morning flight had been cancelled. Fans who had waited for hours to farewell her dispersed. It was the fourth time Miss Garland had been late for Australian appearances. Remained in hotel She was late for her performance in Sydney, late for her appearance in Melbourne on Wednesday night and late for her flight out of Melbourne on Thursday. She remained in her hotel suite all day yesterday and refused to see anyone. At 9 last night, hotel security officers were told Miss Garland would soon leave the hotel for the airport. But it was 10 p.m., and many false alarms later, when she appeared. People on their way to a ball in the hotel crowded the foyer waiting for her. Finally, Miss Garland, smiling but looking drawn under a huge, floppy hat, stepped out of the lift. She strode quickly through the crowd, clasping at the hands held but to her by dozens of people. There were dozens of warmly spoken farewells: \"Goodbye, Judy, come back .\" and, \"We love you, Judy .\" She arrived at the airport driven straight to a private reception room in the overseas terminal which faces the tarmac. When a crowd of reporters gathered outside the room, her agent, Mr S. Field, arranged an interview with Miss Garland on condition that the reporters would leave immediately they were asked to do so. Would Like To Come Back In the reception room Miss Garland was seated by herself. Miss Garland said she was leaving with good impressions of Australia. \"I would like to come back,\" she said. \"I don't think my fans got a fair impression of me .\" Asked if she had been given fair treatment by the Press, she said: \"Not quite .\" She said a non-committal answer to every question except whether she would return and whether she planned to retire. To that she smiled, and said, \"Oh! Are you offering any money?\" The reporters were then told the interview was at an end. It had lasted two minutes. Miss Garland waited with friends in the reception room. She appeared, smiling and happy, at 10.50 and crossed the tarmac to board the plane. She posed for photographers and waved to the few fans seeing her off. She was dressed in the same yellow coat and hat she had worn when she arrived. Miss Garland and Mr Herron were the last passengers to board the airliner, which left on schedule at 11 p.m. NEW YORK, May 22 (A.A.P.).--Miss Garland's Wednesday concert in Melbourne and her departure from Melbourne on Thursday made headlines in the United States and the United Kingdom. \"Riled Aussies hoot Judy off stage .\" headlined the New York \"World-Telegram\" in a long double column story on the front page. New York's largest circulation evening newspaper, the \"Journal-American,\" ran the story in the middle of its front page under the black heading: \"Judy Booed Off Stage .\" \"Curtain Catcalls\" The tabloid \"Post,\" which carried a local headline and a picture on its front page, put the story over three columns on page three with the headline: \"For Judy: Curtain-Catcalls\" In London, Miss Garland's dramatic night flight from Melbourne was told in front-page stories and pictures in several national newspapers. The five-column headline on the front pace of the \"Daily Herald\" said: \"Tour ends with concert fiasco--and unhappy fans see her leave...Judy is dragged to her plane .\" Judy Garland at Kingsford Smith Airport last night before leaving by Qantas for Hong Kong."}]