[{"date": "2014-09-25", "url": "http://wtol.com/story/26622257/toledo-homeowner-waits-over-a-year-to-get-14000-patio-fixed", "content": "Toledo homeowner waits over a year to get $14,000 patio fixed meta content = \"2000-03-29 16:19:59\" > Call 11 for Action at 419-255-2255 if you are the victim of a consumer scam, fraud, or rip off. I want to fill out an official complaint Click here to e-mail the Call 11 for Action office with your consumer complaint. Click here to e-mail the Call 11 for Action office with your consumer complaint. meta content = \"2000-03-29 16:52:15\" > Are you interested in helping others with their consumer problems? Call 11 for Action can use your help. meta content = \"2014-09-24 18:43:30\" > Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Live at 3 p.m.: Announcement of grand jury finding on <mark>Tony Stewart</mark> fatal crash Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr.. Prosecutors in upstate New York said a grand jury was finished hearing testimony regarding <mark>Tony Stewart</mark>'s role in the on-track death of sprint car driver <mark>Kevin Ward</mark> Jr. and its decision would be announced Wednesday. meta content = \"2014-09-23 20:50:33\" > Nightmare: Dad hears burglar on baby's monitor It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. It sounds like a scene from a horror movie; A Thomasville man heard a burglar breathing over his daughter's baby monitor. The man and his family have been victims of multiple burglaries in the past couple months. At the Mid-south Saw milling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. He said he saw something sacred as he was working and cutting slabs. \"Talking to a couple At the Mid-south Sawmilling lumber yard, there was a cut of wood that jumped out to owner Daniel Turbeville. meta content =\" 2014-09-24 03:02:02 \"> <mark>Heather Brown</mark> speaks for first time in nearly a year <mark>Heather Brown</mark> speaks for first time in nearly a year We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. We first introduced you to <mark>Heather</mark> and Sean Brown of Gladewater in September 2012. <mark>Heather</mark> was 34 weeks pregnant and slipped into a coma. Her son, John, was delivered by c-section. meta content =\" 2014-09-23 22:56:33 \"> Wood County Health Department wants community to be aware of the signs and symptoms of viral meningitis A fifth grader from BG Schools was diagnosed last week. It is currently the only confirmed case and the Health Department is hoping it stays that way. Lumber yard owner finds Jesus in tree trunk At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. At the Mid-South Sawmilling lumber yard, there was a cut of wood that jumped out. Shocking! Dad hears creeper in baby's bedroom Video: Obama salutes while holding coffee cup A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. A video of President Obama saluting Marines with a cup of coffee in his hands causes a stir online. Sheriff, BCI excavate at Vickery residence as part of investigation Officials executed a search warrant at a residence near High Street and County Road 268 on Tuesday. A prosecutor says a new tip led to the execution of the search warrant, but would not provide details about that tip. <mark>Heather Brown</mark> speaks for first time in nearly a year TOLEDO, OH (Toledo News Now) - A Toledo homeowner spent thousands of dollars on a custom-made patio when only three month later it started to crack. Bill Strall's life has revolved around keeping tabs on the work done at his home .\" I called him on April 6 at 2:15 left him a message, \"said Bill. After several failed attempts to reach Concrete Images Owner Troy Musselman, Bill felt like he had no choice but to pick up the phone again .\" I called him back on May 23 at 11:34 and left a message, \"said Bill .\" Called him again at 2:38 and left him a message. \"The problems between Bill and Troy Musselman go back to December 2012, that's when Bill says he noticed several cracks in the concrete spreading throughout his patio. Bill says he paid Troy a little over $14,000 for it just three months prior .\" When he went to pour the patio, the patio was fine and I told him there were two things, I didn't want it to pool water and I didn't want it to crack, \"said Bill. He says he called Troy just as soon as he realized his wishes were not being meant. Bill says Troy came out in March of 2013 and looked at the patio .\" He offered me a one-time deal, \"said Bill .\" He said,' I tell you what you pay for the concrete and I'll supply the labor .' \"Bill says he did just that, paying $750 for the concrete and delivery costs. He says Troy then told him to call him back in September when business slowed down and he would fix the cracks. Bill says it was deja vu all over again .\" I gave him a call, left a message, never heard back, \"said Bill. So Bill called Toledo News Now's Call 11 For Action Team. Troy didn't want to go on camera but he says that he offered to fix the cracks but Bill declined. He says that cracks are something he can't control. Once the Better Business Bureau got involved Troy offered to give Bill a $500 check for his purchase of the concrete and by Sunday Bill had his money .\" I'm happy that channel 11 got involved and you got me results within a week, \"said Bill. The BBB says make sure to get written estimates of everything, that includes work that may need to be re-patched, make sure the contractor can give a work schedule and ask if they are bonded or insured.", "articleID": "2014092504_00002155_W", "names": {"Tony Stewart": ["Q380127", "Q3993311", "Q4648431", "Q56803689", "Q7823492", "Q7823493"]}}, {"date": "2014-09-25", "url": "http://www.bbc.co.uk/news/uk-england-leicestershire-29362829#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa", "content": "Print Braunston-in-Rutland church \"blighted by bat faeces' Faeces and urine from a 500-strong colony of bats are affecting services at a 1000-year-old church in Rutland, officials have said. The bats are roosting in the roof of All Saints Church, in Braunston-in-Rutland, but cannot be removed as they are a protected species. Staff and volunteers are spending up to an hour-and-a-half cleaning before weddings and funerals can take place. They have also covered stones dating back to 1632 in order to protect them. Local MP Sir <mark>Alan Duncan</mark> said he would raise the issue with the Church Commissioner in Parliament. He said:\" This situation is absolutely intolerable and I have never seen such a mess. \"Bats might be a protected species, but they are clearly not facing extinction in Braunston any time soon .\" Speaking in the House of Lords earlier this year, Conservative peer Lord Cormack agreed bats were a \"particular menace\" to church-goers. He described an instance in which \"the vicar had to shake bat faeces out of her hair while celebrating holy communion at the altar\". Officials said bat droppings can cause irreparable damage to buildings and artefacts Braunston church council member Sue Willetts told the Leicester Mercury: \"The young fly all over inside the church and their droppings are all over\". She added: \"The first thing that hits you is the smell .\" <mark>Derek Williams</mark>, of Peterborough Diocese, added: \"Bat droppings can cause irreparable damage to buildings and artefacts, as well as inconveniencing visitors .\" We receive no state aid for church maintenance or for the kind of legal measures to discourage bats from roosting. \"But, according to the Bat Conservation Trust, the droppings themselves rarely cause damage, although bat urine can corrode metal. And, if faeces are left they can encourage algal growth that can damage surfaces. 05 AUGUST 2013, SCIENCE & ENVIRONMENT The Uncatchable How Greece's most wanted man became a folk hero Watch\" As many as it takes to protect myself from bad guys' #MuslimApologies The sarcastic hashtag that says \"Sorry for algebra '", "articleID": "2014092517_00056456_W", "names": {"Alan Duncan": ["Q302417", "Q4706546", "Q56885837"], "Derek Williams": ["Q10548473", "Q16196337", "Q28935704", "Q39039625", "Q5262465", "Q5262466"]}}, {"date": "2014-09-26", "url": "http://news.com.au/national/victoria/tinder-craze-a-casual-sex-cesspool-or-a-swipe-right-for-true-love/story-fnii5sms-1227070498139", "content": "Tinder craze: A casual sex cesspool or a swipe right for true love? WITH 10 million users worldwide and about a million users in Australia, Tinder has become the go-to dating app for 20 and 30-somethings. But is finding true love really as simple as swiping right or is Tinder just a cesspool of casual sex? Apparently, it's a match. Time to plan the first date? Source: TheAustralian It was a weekday evening and Erica was at home in inner Melbourne, browsing through the latest faces and physiques on Tinder, when she spotted a family friend from primary school days. \"Our parents knew each other well and he and I played together,\" the 28-year-old says. \"We hadn't seen each other for at least 20 years. I recognised him instantly but it was obvious he didn't recognise me .\" I swiped right and so did he and we started texting. But within three texts he wrote, \"So, fancy a f--?' I didn't take that any further .\" Erica has had three Tinder dates with guys who've passed her unofficial selection test - she spends a few days texting and talking on the telephone to find out more before agreeing to a first date in a public venue. \"While you're texting and talking you can usually work out if they're crazy or married or if the spark isn't there,\" she says practically. \"My first Tinder date went well but then I got busy at work. When I messaged him a few weeks later I didn't hear back. The next guy I went out with was a bit quieter than the guys I usually go for but I liked him .\" But a few days later he sent me a message saying he'd met someone else. I respected his honesty and with Tinder there are always plenty more fish in the sea! \"I went on my last date at a bar in Brighton. The guy was about three inches shorter than me and while we got along well we both sensed it wasn't going to be a romance .\" DATING FROM YOUR LOUNGE ROOM Erica says Tinder is helpful in connecting people who have busy lives. \"Sometimes at the end of the day slapping on make-up, doing your hair and going out to dinner or to a bar is the last thing you want to do. With Tinder you can find people and chat without leaving home,\" she says \"I don't think you can expect to meet the love of your life anywhere - it will just happen. But by interacting with more people, it opens up your opportunities .\" Since it launched in late 2012, Tinder has more than 10 million users worldwide and has become the international go-to app for 20 and 30-somethings looking for friends, social opportunities, a date or, ahem, a little more. And Australia has embraced it with open arms. Tinder co-founder Sean Rad says Australia is the third largest user after the US and UK, though he won't confirm exactly how many people here use the app. For the dwindling number of people still unfamiliar with Tinder - mostly the 40-plus age group and those preoccupied with mortgages and kids - Tinder's technology allows people to use their mobile telephone to browse profile photos of other Tinder users within a set geographical distance from themselves. If you like the look of someone's photo you swipe right and they join your list of \"liked people\". You swipe left to reject a profile and that person will never know you've rejected them. Hanging out at the bar on Tinder. Picture: Keryn Stevens Source: News Corp Australia KEEPING IT SIMPLE If the person you swipe right \"likes\" you too, then you can start chatting via text, phone or arrange to meet. \"Our vision was to make it more simple and organic to meet new people,\" Rad says. \"We put everyone on a level playing field and they figure out who wants to meet who. Initially we tested Tinder with college students because they're at a stage of their lives when meeting new people is top of mind .\" But it grew beyond that. It's become very mainstream now - people talk about Tinder on daytime TV. It has entered the fabric of pop culture. \"Modern-day icons of pop culture have been quick to jump on the Tinder trail, too. Katy Perry says she has been using it following her split this year from boyfriend of two years <mark>John Mayer</mark>. Singer Lily Allen says she has been looking at what Tinder has to offer (though this admission left her fans wondering about the state of her marriage). Earlier this year Shane Warne tweeted that he was debating whether to join Tinder. Warne made the tongue-in-cheek comment after ex-girlfriend Liz Hurley swiftly healed her broken heart with a new love. In response, Warne mused:\" It might be time to take up my single friends' suggestions and join Tinder! \"And Aussie singer Natalie Imbruglia says she's also considering the app .\" My girlfriend in London has fallen madly in love on her third Tinder date - and I'm incredibly jealous - everyone I know who's single in London is on Tinder, \"she said. AN EGO BOOST Rad says Tinder's core user group is 18 to 35-year-olds, fairly evenly split between men and women. He believes the app's popularity lies in the fact that\" you can make what you want out of it \".\" You can look for a date, for a short-term relationship, for a person to marry or a friend, \"he says .\" We're in the business of making that initial contact and what people then make of that is completely up to them. I think people initially start using Tinder because they want to see how many matches they can make - it's an ego booster, just like posting content on Instagram and seeing how many likes you get. \"But when you get a match on Tinder you could then meet a best friend or fall in love .\" Rad dismisses criticism that Tinder is superficial and encourages casual sex and disposable relationships. \"Yes, it is initially based on appearance but that's humanity, right? That first impression counts,\" he shrugs. \"That first impression is how we initially make contact whether we like that or not .\" THE TRAVEL APP Caroline Chagas, 30, a St Kilda business owner, has used Tinder when travelling. \"In Scotland recently I met a local guy through Tinder. He invited me to a gallery because we were both interested in art - though after we first matched and started texting he said he wanted to have sex,\" Chagas says. \"I told him that wasn't going to happen and 20 minutes later he messaged me and said the urge had passed and did I want to keep talking?\" So we kept texting and I made it very clear nothing would happen between us. But we went to the gallery and it was great to be in a new city with a local showing me around. \"Chagas is a recent recruit to Tinder after stories of instant hook-ups initially put her off .\" I'm not judging - but it's not something I do and often I tell guys that and don't hear from them again! \"she laughs .\" I think one of the worst things about Tinder is that in the process of using it I've found husbands of friends using it, too. That's pretty confronting. I see Tinder more as window shopping and if you're looking for a soulmate perhaps you should stay away. \"Doing what comes naturally. Pic Keryn Stevens Source: News Corp Australia HOOKING UP, BUT LONELY Relationships Australia's Melbourne manager Sue Yorston says Tinder fits well with a generation used to getting the information they need from technology .\" They are also an \"I' generation who've been told they can do and have what they want and they're an instant generation looking for instant gratification. I think people using Tinder aren't getting anything they don't expect out of it,\" she says. Yorston says the concept of dating has changed from a time when people often met a potential partner through work or friends and got to know them gradually. \"Dating isn't really in our vocabulary any more. Now people hook up,\" she says. \"Tinder is very instantaneous and I think it seems to be based more on popularity - people can start to judge themselves based on the number of\" likes' they get. \"So if I am using Tinder I exist and if I'm getting hook-ups and likes, someone is looking at me. I think the current generation of 20s and 30-somethings are often isolated. Our research has found the highest users of social media websites also scored highest on a scale of loneliness .\" As humans we can only thrive if we have that caring, nurturing personal contact. We need empathy, cuddles and care so we know that we matter to someone and that they have our interests at heart. \"JUST DOING WHAT COMES NATURALLY University of Melbourne's School of Social and Political Sciences senior lecturer Dr Lauren Rosewarne believes apps like Tinder have taken off simply because it's a way to do more quickly what humans have strived to do for eons - connect with others .\" Tinder simply makes easier what is already happening offline: men and women connecting for friendship, romance or just sex. Therefore the same pitfalls and perils of the dating world - for both genders - exist in the context of Tinder, \"she says, referring to the risks of unwanted pregnancy, STIs, heartbreak and feelings of being exploited. However, she adds that with a larger time gap now between when people become sexually active - at around 17 - and when they marry in their late 20s or early 30s, it's to be expected that people will have more sexual partners, with or without the help of Tinder. But Rosewarne says double standards exist .\" Society as a whole still judges women more than they judge men when it comes to how many sexual partners they have. We have this fear of what will happen to society if women don't toe the line, \"she says .\" I think if you are using Tinder you have to keep your expectations modest. But if there weren't a place or a market for Tinder, people wouldn't be using it. \"There are 10 million users of Tinder worldwide. Picture: Keryn Stevens Source: News Corp Australia SAVING TIME AND MONEY Felix *, 32, works in contract management in Melbourne and has been on Tinder for six months - friends persuaded him to try the app after the end of a long-term relationship .\" I think a forte of Tinder is that it saves people time and money. If you go out to meet people. you might go to 10 bars or clubs in 10 different weeks and you're dropping money everywhere, \"he says .\" I've been on about 12 dates and most people have been quite nice. I tend to swap messages with someone over a week and then talk on the phone and if that person sounds interesting I take it from there. \"I've only had one weird Tinder experience - I arranged to meet a girl who was the opposite of the person I'd spoken to on the phone. I wasn't even certain she was the same person, actually. She was very full on and not the sort of person I'd want to catch up with at all .\" Felix is using Tinder to meet new people when he moves to Sydney this year. \"It's a great way to make connections in a new place - people have been advising me on where to live. For me, it's been more of a friend finder,\" he says. The brains behind Tinder: Justin Mateen and Sean Rad in <mark>Beverly Hills</mark>. Source: Supplied WEIRD DATES AND A WEDDING Chris *, 31, works in sales and began using Tinder about a year ago - it's a favourite pastime on a Friday night when he's out with mates. \"They're always keen to help me make a decision. I like the simplicity of it. I've used the Blendr app before but the downside of that is you could be texting someone and not know if they are interested or not,\" he says. \"With Tinder there's an immediate common ground but that can be a downfall. I think people can in the end be too personal and impolite. I haven't used Tinder for the quick\" wham, bam, thank you ma'am' and I think some girls now expect that. \"Chris has been on a dozen Tinder dates with mixed results .\" Early on I met a girl and I was two minutes late for our date but I sent her a text to let her know I was running behind. When I arrived the first thing she said was, \"what drink are you buying me?' There wasn't even a hello and she was preoccupied with everything else happening in the bar - I think she was interested in my wallet basically,\" he says. \"But I have been to a wedding of a couple who met through Tinder and I recently met a girl who is a generous and considerate person. So we'll see how that goes .\" * Some names have been changed Originally published as Do you swipe here often?", "articleID": "2014092620_00030892_W", "names": {"Beverly Hills": ["Q4899544", "Q923258"], "John Mayer": ["Q1699730", "Q21039156", "Q215215"]}}, {"date": "2014-09-27", "url": "http://manilastandardtoday.com/2014/09/27/noreen-capili/", "content": "Don't use big words just to impress your readers. It doesn't matter how you say it. You never go wrong if you write from the heart. \"Noreen Capili, also known as Noringai, author of the best-selling books\" Parang Kayo Pero Hindi, \"and\" Buti Pa ang Roma May Bagong Papa, \"has this advice to give to aspiring writers and she makes use of this to the hilt in getting her message across to her readers. Her two books were the result of years of hard work as a blogger, a contributor to an online community, a love advice columnist for a magazine and a similar job for a maritime company, and a soap opera writer for a local TV network. A graduate of BA Creative Writing in UP Diliman, Capili dreamed of seeing her name on the TV screen, releasing her own book, and writing for movies. She has already written for TV shows like the sitcom\" My Juan and Only, \"the anthology\" Your Song, \"and soap operas\" Katorse, \"\"My Binondo Girl,\" \"Rubi,\" \"Walang Hanggan,\" \"Mutya,\" \"Sabel,\" \"Aryana,\" and \"Mirabella,\" just to name a few. And from the books that she published, she might soon write for movies based on their adaptations. \"Star Cinema just bought the rights to\" Parang Kayo Pero Hindi' for a movie adaptation. We're now developing the story. I'm writing the storyline. This might be my first film as a writer. There were also inquiries about \"Buti Pa ang Roma May Bagong Papa' to turn it into a movie,\" Capili disclosed. \"I initially joined a writing workshop conducted by director Joey Reyes while I had a day job in Makati. I took a leave every Monday for three months so I could attend the workshop. After that, Direk Joey invited me to work with him in a sitcom. When it ended, our producer got me to write for an anthology. That's my first drama. I wrote different stories every week. From there on, I got other writing jobs. I resigned from my day job so I could write full-time. I took another workshop, this time under Bing Lao in 2007,\" said Capili, who makes people laugh, cry, and fall in love for a living. It really matters to Capili what Direk Joey says about her writing. She considers his films \"May Minamahal\" and \"Pare Ko\" among her inspirations in becoming a scriptwriter. \"I really want to make something like those films .\" She is also fortunate for having director Jun Lana as her teacher in Playwriting and Screenwriting back in college. \"You really need to have the right mentors for your motivation. Direk Jun told me that if I want to be a writer, I must be conscious with my grammar .\" Capili has long dreamed of writing her own book. \"When I was just starting, around the time when I wrote\" Kuwentong Jelly Beans,' some of my readers told me to compile my articles and they will buy it. That was about six or seven years ago so I inquired how to get published. I did not receive any reply through text message or email from the first publisher I approached until I forgot about it. \"On January 11, 2011, Capili was hospitalized after falling into a coma due to a ruptured aneurysm. After surviving her near-death experience, she became more driven to fulfill one of her dreams. She even wrote about it in one of her essays\" Alam Mo Ba \"Yung Aneurysm?\" for her second book. \"I learned that Anvil Publishing, Inc. is open for submissions from unpublished authors. However, applications for that year had just closed so I made sure to submit the following year. I just tried my luck. I was not expecting too much because I know Anvil is not the type which publishes my essays. Fortunately, they liked the ten articles I submitted and they asked for more samples,\" Capili recalled. \"Anvil asked for a sample. I gave them the whole compilation and they told me to divide them into two. What I did was to put everything about relationships and for boys in Book 1 and placed the rest for girls in Book 2. That's the way I categorized them .\" The result was a resounding success. \"All of those I have written in my books are based on real experiences. I neither invented nor imagined them. If they are not my experiences, they are experiences of my friends. Maybe that's why many people can relate to them because they really happen. The stories were not fabricated. Some came from my blog so they are personal,\" Capili shared on why her books became popular. \"In my previous job, I had a love column for a magazine. That time I was just 22. I don't know anything much about love. I took on the challenge because that was what my editor in chief assigned to me. That time I didn't really give advices. I just gave them options on what would happen depending on their decision. In a way, it's still up to them,\" Capili recounted. She had more mature readers when she moved to a maritime company. \"At Maritime Magsaysay they had a website for seafarers and their families. Some wives wrote to me and asked for advice. This helped me a lot .\" The book author considered Barbara Conklin, Sidney Sheldon, and Danielle Steele among her favorite writers in high school and Jennifer Weiner, Mitch Albom, and <mark>Paulo Coelho</mark> when she reached her twenties. \"I have a different set of favorite books depending on my age. When I was a teenager, I liked\" The Other Side of Midnight \"and\" Rage of Angels \"by Sidney Sheldon. When I was in my twenties, I enjoyed\" Tuesdays with Morrie, \"\"She's Come Undone,\" \"Stardust,\" and \"Good in Bed .\" Now in my thirties, I like \"Thirteenth Tale,\" \"Belong to Me,\" and \"Shopgirl,\" she revealed. Aside from writing to express, not to impress, and writing from the heart, Capili has this to share to starting writers, \"Don't give up. I was rejected many times when I was just starting out. It's not easy being a writer. It's not mechanical. You should read a lot. You need to be curious of what is happening around you. You can get a lot of stories from what you hear. You need to be observant .\" \"Urbana at Feliza' at 150 39 minutes ago Art events: Sikap Pinoy National Art Fair\" Strawberry Lane' rates high on pilot week Controversial hosts about 1 hour ago Piolo Pascual bares all about 1 hour ago", "articleID": "2014092710_00050153_W", "names": {"Paulo Coelho": ["Q12881", "Q46727943", "Q56420084"]}}, {"date": "2014-10-01", "url": "http://brisbanetimes.com.au/entertainment/music/guess-which-downton-abbey-star-has-her-own-folkrock-band-20141001-10oe9b.html", "content": "Learn More Personalise your news, save articles to read later and customise settings If you have trouble accessing our login form below, you can go to our Downton Abbey) has her own band, Sadie and the Hotheads. \"itemprop =\" image \"/> Elizabeth McGovern (Cora, the Countess of Grantham in hit TV series Downton Abbey) has her own band, Sadie and the Hotheads. Downton Abbey star Elizabeth McGovern, who plays the demur Cora, Countess of Grantham in the show, is set to embark on her first US tour with her band Sadie and the Hotheads. The US actress and her bandmates formed the folk-rock group in 2007 and toured Europe earlier this year as the opening act for Mike and the Mechanics. Now McGovern is ready to head home and face American audiences .\" I think it's coming at the right time since we slowly built experience with each other, \"says McGovern, who is the lead singer and focus of most of the band's publicity and video clips. Downton Abbey has her own folk rock band, Sadie and the Hotheads .\" itemprop = \"image\" /> Elizabeth McGovern (centre), who plays the demur Cora, Countess of Grantham in Downton Abbey has her own folk rock band, Sadie and the Hotheads. \"I feel like we're more ready than we've ever been...I go there with more confidence than I would have in the past .\" Advertisement Sadie and the Hotheads have their own YouTube channel with just 500 subscribers and 61 videos, some of which are perhaps a tad awkward. The most popular track, for instance, is The Cow Song, (which has over 110,000 views) includes the lyrics: \"It's nice to watch the way they chew / I'm glad you brought me here with you / Hanging on to the gate while it swings / Gives me a chance to think about things\". Then there's a cover of the Bee Gees' classic Stayin' Alive. Sadie and the Hotheads set out on a 10-city tour beginning in Washington, USA, on December 4. \"It's a slightly funny experience for fans of the show to come hear the music because it's such a different world to the show (Downton Abbey) itself,\" McGovern says. \"When we first started touring there would be a lot of people carrying Downtown Abbey books...and I could see a look of surprise on their faces because it isn't what you expect. I mean it's not a classical quartet of violins .\" Error: Please enter your screen name. Error: Your Screen Name must be less than 255 characters. Error: Your Location must be less than 255 characters. I understand that submission of this content is covered by the You need to have read and accepted the Conditions of Use. <mark>Christopher Nolan</mark>'s Interstellar movie trailer finally answers some questions <mark>Julia Gillard</mark>'s memoir treads a careful path through her time in power", "articleID": "2014100103_00021582_W", "names": {"Christopher Nolan": ["Q224912", "Q25191"], "Julia Gillard": ["Q41563", "Q59400153"]}}, {"date": "2014-10-03", "url": "http://feeds.theguardian.com/c/34708/f/663841/s/3f169732/sc/13/l/0L0Stheguardian0N0Ceducation0C20A140Coct0C0A30Ccatholic0Eschool0Est0Ebenedicts0Ebury0Est0Eedmunds0Ebreach0Etrojan0Ehorse0Eofsted0Erules/story01.htm", "content": "A Catholic school in Bury St Edmunds fell foul of Ofsted rules. Photograph: <mark>Graham Turner</mark> for the Guardian A Catholic state school has fallen foul of controversial rules on promoting British values and guarding against extremism and radicalisation, introduced in the wake of Birmingham's Trojan Horse affair. The Ofsted report, which followed a snap inspection but was withdrawn within hours, claimed that younger pupils at St Benedict's secondary school in Bury St Edmunds, Suffolk, \"show less awareness of the dangers of extremism and radicalisation\". It questioned whether the school prepared pupils \"for life and work in modern Britain\" - with the language Ofsted said on Friday morning that the report was on hold for review by its east of England regional director, Sean Harford, after St Benedict's released what appeared to be the final version of the document on its website. The report was the result of a no-notice inspection of St Benedict's by Ofsted last month, only a few days into the start of the school year, because the school website failed to include details of its citizenship teaching. Ofsted's snap inspections were introduced after the investigations in Birmingham. The inspectors recommended \"making clearer the contribution to students' preparation for life and work in modern Britain and the dangers of extremism\". The Ofsted team also complained that the school's \"delivery of citizenship education is not made clear, or how the school teaches students about the dangers of extremism and radicalisation\". St Benedict's is a voluntary-aided Catholic faith secondary school with more than 600 pupils, around two-thirds of whom are Catholics. It boasts excellent A-level results, and in 2014, 70% of its pupils passed GCSEs with five or more A * - C grades, including English and maths, well above the government's minimum of 45%. <mark>Hugh O'Neill</mark>, the school's headteacher, said: \"We accept that Ofsted has a job to do, and there are reasons why they regard no-notice inspections as a valid form of inspection. We will follow whatever guidance the eventual Ofsted report that we receive asks us to follow .\" I've been gratified, as have the staff, by the number of messages we've had from colleagues, parents and students, who have all said they regard the school as excellent and don't feel the Ofsted report reflects their view of the school at all. That's been universal with everyone I've spoken to. \"The inspectors also found fault with the school's teaching and pupil progress regarding disadvantaged, disabled students - and lowered its grade from\" good \"to\" requires improvement, \"the second-lowest rating. <mark>O'Neill</mark> said Ofsted's report had come at a bad time, with parents visiting open days before making their final choices for secondary school applications this month. The school's previous inspection took place last year, and praised the pupils' moral, social and cultural development. Ofsted said that the regional director had decided to delay publication of the report\" to allow further quality assurance checks to take place \". Student rewards such as cash and free trips fail to improve GCSE results <mark>Tom Hardy</mark> in Peaky Blinders Preview of <mark>Hardy</mark> as Camden gangster Alfie Solomons Finally, the flying car may have landed Ebola isn't the big one. So what is? And are we ready for it? US Ebola patient's friends quarantined under armed guard Violent clashes break out in Hong Kong after counter-protesters storm sit-in <mark>John Lewis</mark> boss:\" France is sclerotic, hopeless and downbeat...it's finished '", "articleID": "2014100313_00045035_W", "names": {"Graham Turner": ["Q21465447", "Q21557314", "Q2313039"], "Hugh O'Neill": ["Q21165090", "Q5932150", "Q5932158"]}}]